{
 "id": 14191,
 "title": "Sublimation of Visual Perception",
 "date": {
  "submission": "2013-09-18T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Oliver",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 ug",
   "administration": "buccal",
   "substance": "25C-NBOMe",
   "form": "blotter/tab"
  },
  {
   "time": "1:20",
   "amount": "150 ug",
   "administration": "buccal",
   "substance": "25C-NBOMe",
   "form": "blotter/tab"
  },
  {
   "time": "2:40",
   "amount": "150 ug",
   "administration": "buccal",
   "substance": "25C-NBOMe",
   "form": "blotter/tab"
  },
  {
   "time": "3:40",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "I began the experiment with 25C-NBOMe at 14:09 with an initial dosage of perhaps 150 micrograms, though the exact mass contained in the paper squares was hardly certain. I let the paper lie on my gums and let the saliva accumulate in my mouth for twenty minutes before I swallowed it and spat out the pulp. Subtle bitterness gradually numbed my mouth and tongue, and water tasted strange, as though it had lost its inertia. I finished the tab at 14:50. I ingested another square at 15:30 as I began to see the chemicals potential and knew I needed to boost the dosage for its character to become unmistakable. I played Deerhunters Cryptograms as the chemical began to manifest. At 16:50 I placed the third and final tab behind my lip.",
  "Reading a book on the mathematics of fractals, I was thrilled as the word that began to swell, as though I were viewing the word under a magnifying glass, then shrink, then blow up, then shrink. Colors were shifted toward the palette of a box a pastels, though bright like Day-glo a-la LSD, and they churned and washed. There was the characteristic LSD halo of lurid rainbow around the brighter objects in my visual field and the impression that white surfaces, like the pages of a book, were tinged violet. The notes I jotted down read, colorsneonsswirling, as though my hands were painted in them as I write. The visuals are typical of phenethylamines yet there is intermixed the peculiar acidity of everything. The lady of Duchamps Nude Descending a Staircase was descending those stairs as quickly as I could imagine, ad infinitum. Mydriasis and xerostomia were both evident.",
  "I felt that certain psychedelic agitation as I frantically wrote, I am a bit discombobulatedhaving a blast though. Very thankful I do not have to remember to breathe as my mind juggles cool metaphors and simple thoughts. The paper and desk were swayingeverything felt off kilter yet strangely balanced at once. The ink of the blue pen appeared to run as I wrote. The strangest aspect of the visual experience took the form of wisps of steam that seemed to boil off of some objects in the field of perception, especially surfaces with many closely spaced black lines. I viewed a plane of many thin, parallel black lines at about 45 degrees, which gives rise to the illusion of faint pastel lines of color for whatever neurological reason, and the lines seemed to sublimate, and the pinks and greens of the illusion were dramatic.",
  "As I peaked around 17:50 I stepped outside my dorm to smoke a cigarette. It was sleeting and the palette of the crepuscular horizon was like that of Rosseaus The Sleeping Gypsy, but more skewed to the violet end of the spectrum, colors the likes of which I have never experienced in any state of consciousness, yet akin to the colors of 2C-T-2. All seemed silent, as though reality were just colors now and sounds had been muted. Lone students walked by with umbrellas. I returned inside, wishing soon to leave my room.",
  "First I wrote a few more sentencesI felt like I truly understood madness yet I remained lucid enough to know my state was temporary. Like a steam rising up from me, I wrote about my visuals, or reality, that life essence mist, such as the vapor that rises from the body of a man who runs for miles in the winter. Like objects of the visual field wisp wisp wisp like the steam off a gently boiled kettlea taste of madness! Im in a mad groove. Like I can be comfortable while exploring what madness might feel like? Its scary territory but is so grandiose [the theme of madnesswho human lacks some conception of what it must feel like?] that I feel I can easily hop back out, just having been the observer, like Dante.",
  "At 18:40 I noted typical psychedelic differences in pulse/how pulse feelsprobably slightly elevated. I put on jeans and tied my belt then exited my room. I encountered a wet snow outside. I walked about  of a mile to my buddys house whom I had been texting during the research. Cars were annoying yet walking normally was easy, though I noticed that I walked a sinusoidal route down a long parking lot. I stepped into the dining hall thinking I would get a bowl of granola, though I was unsure how well I could work my mouth. My glasses fogged as I entered the heated environment, and I realized I was much too addled to be in public. So I continued down the parking lot. The flat asphalt seemed to have tiers, though with my knowledge that it was level I was not tricked by what visual perception told me. So walking on flat ground appeared to be like walking up thin stairs. The sky was dumping cold sleet on me, and I was numb when I made it to my friends house. I sat in front of his space heater, which shone in fiery orange, and began to descend from the peak of the chemical, though rainbow clusters still clogged my vision at times and script still wiggled and rotated. I drank a Moosehead lager and was relieved to feel grounded in my sanity.",
  "Conclusion: this chemical is chill at low dosages (150-200 mcg) yet can zonk me out of my gourd at higher dosages. I enjoyed my solo research but I would not take it in solitude again. I appreciate my foray into the mad consciousnessI thought of Virginia Woolfbut it was unsettling."
 ],
 "erowid": {
  "id": "99307",
  "citation": " Oliver. \"Sublimation of Visual Perception: experience with 25C-NBOMe (ID 99307)\". Erowid.org. Sep 18, 2013. erowid.org/exp/99307",
  "substance": "25C-NBOMe",
  "views": "1382"
 }
}
