{
 "id": 14208,
 "title": "Witnessing My Inner Neural Mechanics",
 "date": {
  "submission": "2005-07-11T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "neuro",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "carts."
   },
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Opium"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I'll keep this short because the part of the experience that I found the most intriguing only lasted about 30-45 seconds. I was with a few trusted friends last year in the middle of the night at a large ornate Buddhist monastery in the next town over. These friends are the type with whom I experience real chemistry, we always did something and it was always fun. It never got old, there was always a sense of wonder and exploration; even if it wasn't a particularly new experience. This night was like that, But with more intensity due to the acid. We felt this elated awe as we passed the statues and gong towers and rock gardens and structures of far eastern motif. Getting to the point now, We smoked a bit of herb and were partaking of the opium right along and at one point we decided to sit on the steps of the giant Buddha hall and take a few nitrous hits. I'm always careful to breath appropriately with nitrous so as to protect my brain from damage caused by lack of oxygen. After 2 or 3 cartridges in a row, I entered this weird state that I'll never forget. I closed my eyes and felt myself spiral away from the world into a special place where it was dark but I was comfortable and not afraid despite the distance I felt. However, I was not unconscious.",
  "The next part is the most interesting to me, As my friends were still talking, I heard the words that they said but didn't really pay much attention because I heard their voices as the voices of other people in my life. Someone spoke and I heard my brother's voice distinctly saying the words. Someone else spoke and it was the voice of another close friend who wasn't with us. All I could do was laugh at the time, but instantly in my mind I was figuring out what was going on. I theorised that there is some sort of recognition circuit in my brain (obviously) that takes external data and makes sense of it by routing it to the appropriate areas of the brain based on past experience and what we have already gathered in our life regarding the stimuli. Through association circuits, nearly all the parts of the brain are connected to different degrees and I realized that this mismatch was caused by the content of the sentences being spoken. The person who sounded like my brother was talking about something that I strongly associated with my brother , mostly unconsciously, and so on. It makes sense biologically, the only thing I can't explain is how I heard the mismatched voice from the beginning of their sentences, before I knew the content of what they were saying. My conclusion: weird. Goes to show the mind boggling complexities of the human brain, our essence, and all the levels it is always working on."
 ],
 "erowid": {
  "id": "9940",
  "citation": " neuro. \"Witnessing My Inner Neural Mechanics: experience with Nitrous oxide, LSD, Cannabis & Opium (ID 9940)\". Erowid.org. Jul 11, 2005. erowid.org/exp/9940",
  "substance": "Nitrous oxide, LSD, Cannabis & Opium",
  "views": "15053"
 }
}
