{
 "title": "I Play It Safe",
 "author": "Iowa Punker",
 "citation": " Iowa Punker. \"I Play It Safe: experience with Alcohol - Beer (ID 14204)\". Erowid.org. Dec 27, 2006. erowid.org/exp/14204",
 "substance": "Alcohol - Beer",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "report": "<p>Alcohol is by far my substance of choice. But I don't really like being drunk. I drink to relax and to be social. I do drink quite frequently, so to the average person I'd appear to be an alcoholic, which I'm not. I just really, really, love beer. I usually drink to the point where I feel relaxed, slightly tipsy, more talkative, and warm-feeling. This usually occurs after about four or five 'lite' beers. Regular or Ice beer just gets me too drunk. I prefer not to drink it.</p><p>Being really drunk is almost like being delirious to me. I slur every word, I say or do things you may later regret, my balance is fucked, and sometimes I make an ass out of myself.</p><p>But if I am at a party and the alcohol is flowing heavily, I know I may end up drinking more than I planned. When I go to parties, I drink all night long and into the next morning without even feeling wasted or spilling my drink on the floor, with no hangover whatsoever. Here's how:</p><p>1. Pace myself, because an alcohol buzz can really creep up on me, especially drinks made with hard liquor.</p><p>2. When I reach the point of feeling pleasantly intoxicated (warm, happy, sociable, relaxed), I stop drinking. This is the best part of an alcohol buzz. If I must sip on something (which I do) I usually fill my beer bottle with water. I always drink out of brown bottles so no one ever sees me do it.</p><p>3.Water is extremely beneficial to an alcohol drinker. Alcohol can seriously dehydrate me, therefore it is necessary to stay hydrated. Also, as mentioned above, it speeds the elimination process so I don't end up getting real stupid-drunk. So between my drinks, I take a few gulps of water. And before bed, drink at least two 12-oz. glasses.</p><p>Some people like that sloppy drunk feeling. Not me. I do love beer more than anything in the world, but to me, being really drunk kinda sucks.</p>",
 "year": "2002",
 "id": "14204",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-27T08:00:00.000Z",
 "views": "4085",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ]
}
