{
 "title": "Minty Fresh",
 "author": "Jack M.",
 "citation": " Jack M.. \"Minty Fresh: experience with LSD (ID 14224)\". Erowid.org. Mar 25, 2005. erowid.org/exp/14224",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "report": "<p>[dose: slight overdose, squirt where a drop was the idea]</p><p>We are significantly addled. That is good. How near the flame now! Verging on the edge of incineration, we see that the business of selfhood itself is in flux.</p><p>There is a blob of light just outside of me, perhaps two feet in front of my eyes. The blob of light dances away as my vision moves toward it. I cannot place my gaze directly upon it. It exists only in the dreaded Zona Peripheralis. Upon the blob of light, or rather pouring from all directions into the blob's pulsing, white-hot center, is the nexus of reality. The color, shape and essence of all things in the room flow and dissolve into the center of the light blob. And because thusly the light blob becomes a phenomenon so fascinating and compelling that I wish to pour all of my five senses into its center, I find myself in the quite desperate situation of wanting to 'be' the light blob, yet frustrated by my inability to fix any of my senses upon it.</p><p>As this occurs, I become aware that my senses ( and therefore 'me') are being drawn and dissolved into the blob of light. Now joining all the matter of the material world in this commingled mess, my selfhood begins to bleed away. The blob of light expands in front of me, becoming a portal through which I plummet for no distance and zero time. I emerge awash in a most terrifying place. My selfhood has joined everything which exists around me in a chaotic mixed ocean of reality, sensory information and consciousness. In this place, I become suddenly aware of the process which got me here. This knowledge does not come alive inside my brain 'privately'. But rather seems to 'happen' outside of me. And though this thing had begun to play itself as a memory, or as a thing to be known about some ill-remembered before, it displaces the present and becomes what is actually happening. Therefore, I find myself living the various steps which got me from normal perceptual consciousness to this place of madness, but now as if for the very first time. In other words, what began as a hazy memory of something that had already occurred (as if I were sitting in my car parked on the side of the road, trying to recall something of the trip to explain my present location) instead becomes a new experience which is happening to me for the very first time.</p><p>This is how I got here: I become aware of 'sensory traffic' (i.e. the flow of sensory data between perceived object and sense organ) as something tangible. This 'stuff' of seeing, tasting, smelling, hearing and feeling begins to dissolve into itself. This sensory 'data stuff', which had existed in distinct categories appurtenant to each of the senses, begins to flow freely out of those categories and into a variegated morass. Thus the profoundly abstract and disturbing synaesthesia state becomes a reality. Colors speak to me and touch me. The air smells of red and green. I can taste my own excitement. This last observation does not register immediately as a portent of what is to come (what already came). But it should have.</p><p>As I lean forward to place a kiss on Lauren's hip, the sight, smell and taste of her flesh rushes so rapidly into my brain that the aggregated sense phenomenon that was kissing her hip becomes an emotional event inside me. Or rather, the bundled sense data shifts instantaneously from being about Lauren to being of me. This bizarre transformation triggers the breakdown of the boundary between sensory traffic and internal self-awareness (i.e. the current inventory of thoughts on my 'desktop' which owe none of their essence to any externally originating stimuli.). This understanding lasts only for a moment, though. Because as soon as I hold it, it disintegrates - leaving (in the wake of a small, bright explosion) a pool of undifferentiated thought energy. This pool mixes reality's emanations, my reactions to those emanations and all the other ejecta of consciousness in a seething mass which glows brightly white for the most part, but pulses spasmodically with intense non-primary colors for tiny instances.</p><p>My selfhood has broken down and has been lost into all which had previously existed outside of me. My jaw dissolves into Lauren's hip, tugging my brain behind it like a slab of cold liver pulled by a coat hanger. I flow with the jaw into a place of warm and agreeable darkness somewhere inside her body. I believe my flesh eyes are closed. But I can see the effects of a highly reticulated prismatic kaleidoscope at work before my vision. I become afraid. Nothing is real. The things generated by my imagination become indistinguishable from whatever really exists. I panic. I need desperately for the real to assert itself over the imagined. I get up from the bed, turn on the light and command Lauren (though she will remember it as a whimpering plea) to exist more forcefully. She complies. I stand there shuddering and try to describe to her what has just occurred, and how now all of that experience seems a pool of molten gold, still stretched across the bed, from which I have just emerged, and whose gold liquid still drips from my body as a lingering memory.</p>",
 "year": "2001",
 "id": "14224",
 "gender": "Male",
 "timestamp": "2005-03-25T08:00:00.000Z",
 "views": "14317",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 }
}
