{
 "id": 14225,
 "title": "End of the World or So I Thought",
 "date": {
  "submission": "2013-09-15T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "M",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.4 mg",
   "administration": "buccal",
   "substance": "25I-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "Some information about me first. I have depression and anxiety problems. I find it hard to be in public places. This may help people understand as to why my trip was so terrible.",
  "This happened on the 21st of December 2012, probably the worst day in the world to have a bad trip. Those of you will remember that this day was the day that the world was going to end.",
  "So I got hold of 25 of the strongest NBOMe tabs Ive ever tried, each tab contained 1200 ug of 25i-NBOMe, I also had 25 tabs of 25c-NBOMe with 800ug per tab in. The original plan was to take 2 of the 25i tabs and 1 of the 25c tabs and put them on my top gum for the length of the trip. This is an extremely high dose, from personal experience with this chemical I can say to never, ever do this much. The struggle on the heart is just insane and the whole time I was just waiting to hear the beating of my heart stop, it must have been beating faster than I could count even when sober.",
  "It was 3pm, school had finished for the term and it was Christmas holidays! Woo! Right, so this is where it begins! I get out of school and meet up with the two friends who I planned to trip with. We will call them X and Y for this story to hide their identities. X planned to do 2x 25i tabs, and Y planned to do 2x 25c tabs. A note about them: Y seems to have an extremely high tolerance to this substance, 2 tabs merely make him see things, and X on the other hand I would say has an average reaction to NBOMe, nothing out of the ordinary.",
  "4pm: We place the tabs on our gums; X and Y talked me out of taking 3 tabs as they said it would be too unsafe. So I used 2 25i tabs instead. We then decided to walk to the bus stop as we need to get back to Ys house as fast as possible.\r[Erowid Note: 2.4 mgs of 25I-NBOMe is considered an extremely high dose, see 25I-NBOMe Dose Chart.]",
  "4:30pm: At the bus stop, I am the first to feel the effects, the cars driving past seem to leave behind a disturbance in the air. The houses opposite start to breath slowly. CEVs are just madly intense at this point. Knowing how quickly and strongly I was coming up I knew straight away I had it in for me that night. Pupils have no dilated fully, X and Y are coming up.",
  "4:40pm: The bus arrives! We throw the money at the driver while looking at the floor. Three teenagers in uniform on drugs isnt the best example to set. We sit down at the front. I feel like Im on a hover craft. At this point my chest feels lighter and ever so slightly uncomfortable, my legs begin to just slightly cramp up. Both of these symptoms I blame of the vasoconstriction, however it wasnt too much of a problem. Now the thing is the bus was full of people, family people, old people, and young people. We were extremely worried and couldnt help but break out huge grins and random burst of laughter, Xs pupils are just massive space saucers at this point, and hes facing the back of the bus, I tell him to keep his head down which he does. When we get to our stop we stand up and press the stop button, we must have been standing there for what felt like 10 minutes waiting for the bus to move 100m forward into the bus stop.",
  "5pm: I am really, really, tripping now, we fast walk across the road, in the way of a van that I just stopped and stared at the hood at for about 10 seconds, he must have thought I was mad! Anyway we walk through the village and this is when the trip engulfs me.",
  "By engulf I mean like it happens each time I know Ive taken too much nbome. It's weird, all of a sudden my body starts walking forward away from my vision, its like my senses are out of sync and delayed. Its horrible. X and Y are in front of me and I just stop there dead still. Ys head twists around 180 degrees and I see my face on his! He starts speaking but I dont understand him, and then suddenly boom! Im back there and conscious again, its so weird. Like miniature blackouts where Im just 100% disconnected.",
  "5:05pm: We rush in the front door, I throw off my shoes and sprint up the stairs into Ys room, I just stand there in the middle so confused and wondering if theres anyone in the room. Those of you that have done nbome before, youll know what I mean when I say it feels like theres people in the house that arent actually there. At this point X and Y walk in, X takes the bed, Y takes a chair, and I sit down on the chair behind me. Then the giggles set it and we all go into our own separate trips, my heart starts to go really fast and I dont want to worry the other two so I dont mention it. By fast I mean 2-3x faster than normal and really hard thumping. I wasnt even peaking at this point and all the walls just turned into while diamonds. When Im on nbome I see stars in the air, galaxies, shapes, and faces. This time there were SO many stars in the air that they were just blocking my vision completely; I couldnt look further than 2 meters. The really cool thing I love doing is looking to the left side of the room, then looking at the right side of the room. A sober person would only see both sides separately depending on how big the room is, but the whole room was just a huge panorama, I could see, hear, and feel everything. It was amazing.",
  "5:30-6pm?: The trip just takes a turn for the worst, I peak, the walls are plastered with white cats staring at me with fangs. I say Guys, everything is looking at me. I really meant that, every single object, surface, corner and particle had a three jawed face on them and they had repositioned themselves to face me. This face I see quite often. Its like a demon face and it just floods my brain with fear. They try to attack me, eat me, set me on fire, whatever pops up into my head that they could do to me, just fucking happens. Then my breathing goes weird, everyone automatically breathes right? Well I had suddenly become conscious of the fact that I wasnt breathing (or so I thought), so I had to concentrate on manually breathing a certain amount of times per minute. Now this was hard for one reason: the fucking time dilation. It was so strong in effect that things would speed up 10 fold, then slowdown 10 fold in literally moments. Y gets worried and figures out that Im having another one of my episodic bad trips. He straps his watch to me so I can keep track of the time. It doesnt help. I would stare at it and just watch the second hand race around faster than anything then suddenly 5 minutes would have passed, 10 minutes, 20 minutes. I must have been staring at that watch for quite some time! I started to question if I was alive, and I was being reassured by X that I was and that he was experiencing the exact same.",
  "6:30pm: Now this is where I am just completely fucked, like A+++++, Y puts on a balaclava. I wasnt aware of this. Then suddenly were being robbed at gun and knife point by 2 guys! This was a complete hallucination and didnt actually happen. I black out. This, people, is what happens when you mix strong psychedelics with anxiety disorders. Dont do it! I started to question if I was alive and I was being reassured by X that I was, and that he was experiencing the exact same.",
  "Choppy memories from the point of the black out: 6:30pm, to the point of consciousness at 8:30pm:I throw a shoe across the hallway downstairs, at this point I am just watching myself do all this. I have no conscious input. I figure out that Im meant to be putting my shoes on as were going for a walk so I struggle but do it. Out the front door, black out.Were walking down a road. I attack Y by the throat and try to strangle him. I shout out to him that hes a fucking thief! My brain had linked the balaclava incident to Y and I just got so confused.I pull my trousers down and start urinating while walking forwards. The piss just goes all over my trousers but I dont seem to have cared. Y and X at this point are thinking what the fuck am I doing. Later they mentioned that on this walk I was acting like a complete child, grabbing things from their hands and falling over constantly.Its probably a hour into the walk now and I begin to strip. I get completely naked and start to try and rip my dick off, apparently my entire arm was just tensed up and I was pulling as hard as I could. I failed thank god. I then hallucinate that Im ripping my cock off with my mouth, which thanks to the spine wasnt possible (again, thank god).This was described to me by Y the next day: I was butt naked, Y and X were trying to get me dressed, I was screaming ARE WE HAVING SEX?! a dog walker comes past as I say this, they tell me to the shut up, shut up now! X loses his patience with me. I had been choking them, getting naked, screaming random stuff, lying dead in the road, pissing everywhere, and getting very aggressive. So he starts punching me in the face while Im on the floor.8:30pm: This is where I very slightly begin to come back into consciousness and was slowly coming off of the nbome now. Y came up to me and said 'M, this is your last chance, I have the phone right here.' He holds the phone up with the digits 999 entered in. I dont respond and try to attack him, so he calls an ambulance, and has to wave a passer-by down to get the name of the road. At this point Y and X are freaking out. This has been hell for me though. The whole time I thought I was being dragged outside to be buried in a coffin. At one point I thought I was buried alive in a hole head first! Now my memory of this happened differently to what they described, I dont remember them being there when the passer-by stopped. I began to strip and run toward the car, the woman drives off. I assume shes gone. Now Im on a dirty road, naked with my clothes scattered across the floor. I think this cant be real, kind of like in a dream where youll try to wake yourself up. I bite down as hard as I could; I break a lot of teeth at this point. Thats when I knew I would regret this day.",
  "9pm: A vehicle is driving towards me. It looks like a van and maybe there was hope for me! I have full consciousness but complete short term amnesia. Maybe it was someone who could direct me to the nearest village. We were in the middle of nowhere. I see the words Ambulance written on the front and the fluorescent stripes all over. Fuck. I start waving my arms, and shouting help over and over, someone gets out, runs over to me and directs me toward the ambulance. Im still butt naked. I try to get in the front but he says No, In the back, so I get in the back. Im confronted with another man, he tells me to lay down, as I get in I notice how cold I actually am and start shaking like a crazy person. He checks my pupils, and describes them as saucers! a 9 out of 10 on his scale thing he had. A police officer now steps in, I am shitting bricks now, I tell him my name, my age. Then I just answer I dont know to everything else, he realises that hes going to get absolutely nothing out of me as to be honest apart from my identity I knew absolutely nothing. From then on its the usual hospital stuff, blood pressure, Saline drip, those pads they attach (I counted 13 on me), urine test. Then they let me go at 1 am! At this point I was still tripping but I knew theyd keep me over night if I said that, so I lied and got out.",
  "I have actually done nbome twice after this experience, both times were horrific, and Ive sworn off of the substance. It gives my heart an extremely hard time and Im constantly thinking Im going to die. The last time I did it I met satan and the grim reaper came into my room to get me. NBOMe is obviously not for me. Out of the 20ish people Ive seen do nbome, I am the only one that has such a high reaction to it. It is also a good thing to note that because of all the nbome Ive done I now have symptoms of HPPD. I see stuff all the time. Walls breath, purple static. If I concentrate on walls and flat surfaces I can get them to slide in any direction I want. Sounds fun right? Well its showing no signs of going away and it just makes life difficult now. I dont want to be constantly reminded of it.",
  "I hope this has helped people in some way. Nbome is an extremely weird chemical. No trip is the same. It scares me and I now advise people not to do it. We don't know what it does to the heart or other organs it affects. Stick to LSD, Shrooms, just not this chemical. For those wondering - my penis is still intact and my teeth are fine. :) I've definitely learnt my lesson."
 ],
 "erowid": {
  "id": "99493",
  "citation": " M. \"End of the World or So I Thought: experience with 25I-NBOMe (ID 99493)\". Erowid.org. Sep 15, 2013. erowid.org/exp/99493",
  "substance": "25I-NBOMe",
  "views": "1149"
 }
}
