{
 "title": "Unexpected, Involuntary Spasms",
 "author": "Morpheus",
 "citation": " Morpheus. \"Unexpected, Involuntary Spasms: experience with P. harmala & Psilocybin Mushrooms (ID 14234)\". Erowid.org. Apr 26, 2002. erowid.org/exp/14234",
 "substance": "P. harmala & Psilocybin Mushrooms",
 "bodyweight": "211 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.25 g",
   "oral",
   "Syrian Rue",
   "(capsule)",
   " T+ 0:45",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>(Male, 6ft., 211lbs, age 33, good health)</p><p>I ingested 2.25 grams of ground Syrian Rue seeds in gel caps at 11:15pm along with 3.0 grams of dried fresh P. Cubensis (v. Mazapatec) mushrooms at 12:00 midnight. All of the appropriate MAOI dietary caveats were observed (no tyramines in the diet for 72hrs prior to ingestion). Further, I fasted completely, except for pure water, for the 12 hours immediately prior to the ingestion.</p><p>Additionally, I am on no prescription medications of any kind and am, at age 33, in reasonable physical shape (I can maintain a brisk pace for basically any 3 or 4 mile trail hike in our rather hilly area). No other substances were ingested, although it did take another 8hrs after the traumatic element of the experience before I could eat food of any kind.</p><p>The journey itself (the visionary aspect) lasted approximately 6hrs and went largely as expected. The problems started at about the seventh hour after ingestion, well into the 'comedown' and continued for roughly 90 minutes thereafter.</p><p>(The immediate suddenness of the onset of these symptoms cannot be overstressed)</p><p>Symptoms: Cold sweats, shallow labored breathing, dementia, loss of ability to articulate, involuntary spasms (full body, legs, arms, and stomach), dangerously low blood pressure and weakened pulse - and then the symptoms literally stopped all at once after lasting about 90 minutes; just like someone flipped a switch turning the unpleasantness 'on' and then 'off' again 90 minutes later. It was very odd. Nausea and serious fatigue followed and lasted for another full 12 hours. Additional physical fatigue lingered for almost 24hrs further.</p><p>Interestingly, I went into the event well rested. I would not consider myself as physically or mentally strained or overly taxed in any regard either during the few days before, the day of, or during the actual event itself. The event left me baffled and beleaguered on several fronts. Regardless, however, I am still among the quick rather than stiff and cold among the dead.</p><p>However, I had an interesting related experience 5 nights after what I just described.</p><p>After doing quite a bit of physically taxing yardwork (our yard is a never ending watershed of things that need to be done, haha), I was feeling rather stiff and sore. That evening about an hour before bed, I took two 220 mg 'Aleve' tablets (naproxen sodium). After about an hour of feeling nothing ('Aleve' isn't supposed to make a person 'feel' anything per se), I began re-experiencing the exact same symptoms as I went through during the late comedown of my mushroom/MAOI journey - only to a lesser degree of intensity. It also lasted about 90 minutes.</p><p>This made me rethink the days before I began observing the non-MAOI diet. It dawned on me that I had, on the Wednesday morning prior to the Saturday night journey, taken two 'Aleve' 220mg tablets for mild pain relief from yardwork.</p><p>Is it possible that the chemistry in 'Aleve' stayed in my system for that long? Further, is it possible that the short-term MAOIs of the Syrian Rue were able to hang around long enough in my system to bring about (to a much lesser but still recognizable degree) virtually the same adverse effects? Or perhaps was there some sort of interplay between them that allowed for various active effects to linger for that many hours (days) after the fact of ingestion?</p><p>I have been known to have a slow metabolism (one of my totems is a three-toed tree sloth, haha), but this is quite an unexpected stretch even for me.</p>",
 "year": "2002",
 "id": "14234",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-04-26T07:00:00.000Z",
 "views": "26462",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "2.25 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(capsule)"
  }
 ]
}
