{
 "title": "Next Day I Still Feel It",
 "author": "TNDiva177",
 "citation": " TNDiva177. \"Next Day I Still Feel It: experience with Cannabis & Citalopram (ID 14240)\". Erowid.org. Mar 25, 2005. erowid.org/exp/14240",
 "substance": "Cannabis & Citalopram",
 "bodyweight": "140 lb",
 "report": "<p>I started the evening out about 5:00 P.M. by smoking  a few bowls. We smoked until about nine, at which time my friend who had tried celexa before asked me if I wanted to try a pill.  I took one and initially felt nothing. We smoked some more and I went to bed about 11:30. At one in the morning, I woke up with a crawling feeling all over. Kind of like a bad case of the jitters. I got up and came to play on the computer. Suddenly, I felt kinda trippy. The room was sort of shaking around me, I was aware of what was going on, but confused also. The computer seemed to make me feel worse, so I just sat there with it off. From there, my mind just floated away. I thougt about a million different things, and suddenly understood things I hadn't before. I've tripped before on acid, and this wasn't quite the same thing. No visuals really, just a mild trip that allowed me to think. I tried to go back to bed about 2:30, and couldn't sleep. Don't know when I when I passed out, but I wasn't able to sleep very well. I got up at nine this morning.</p><p>It's 10:30 now, I'm I'm still feeling it. I'm completely able to perform whatever I need to do, but I'm sort of loopy and light headed. I feel like I do when I take a cold or allergy medicine that is supposed to make me sleep, but I can't (like say, if I am at work or school) and fight it off. That sort of disconnected feeling. Overall, it was fun, but I wouldn't recommend taking it and expecting to do anything the next day.</p>",
 "year": "2002",
 "id": "14240",
 "gender": "Female",
 "timestamp": "2005-03-25T08:00:00.000Z",
 "views": "18749",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "(pill / tablet)"
  }
 ]
}
