{
 "id": 14249,
 "title": "Three Days and Three Nights",
 "date": {
  "submission": "2005-07-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Dave",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "4:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "A buddy of mine, we'll call J, picked up some E from a friend of his about a week prior to our trip. Another friend of mine, who we'll call P, had never tried ecstasy and really wanted to have an experience with it. It was in the middle of the summer and we'd all been rollin for the most part of summer, just eatin any e that came by(not a good idea at all). That summer pretty much came to a halt after our experience. We all met up at a buddys place and swallowed our pills down with a bit of water. We decided to go walk to a nearby park with J and P and smoke some joints, it was about an hour after we had eatin our E and nothing was going on, nothing at all, no one was feeling a thing. We walked to yet another nearby park to sell a gram of weed to a friend. When we got there it was about 2+ since we dropped our pills, we were rollin like there was no tomorrow. I was talking a lot more than I would usually talk on E, letting some personal information to people who I didnt know too well at all. That was only a start though, I had basically no feeling of euphoria that I would usually get on E, I was thinking to myself, 'Holy fuck I think I've lost the magic of ecstasy'. Both my two buddys felt basically the same as I had described to them.",
  "I still had one more pill left so I asked P if he wanted anymore or else I would take the whole pill for myself, he said that he didn't think it was as intense as most people told him. It was about 4+ hours into the trip, so we split the pill into two and swallowed em. NOT A GOOD IDEA. Dont take more of something with unknown ingredients... That was all we needed, we were bouncing off the walls after that, we all had entirely too much energy. Even J who had only ingested one pill was bouncing off the walls. For a while (by a while I mean 1-2hours) I could swear that I could hear a system pumping really bassy music but it was actually my heart. I felt my chest just to see exactly how I was doing, my heart was racing fast. About 5hours into the experience we were finally coming down. It was very unusual though, it took about 3 hours for it to react in all of us, and then the peak only lasted about an hour to two hours.",
  "The side effects were the worst part. After we all left the park we decided to go home and TRY to get some sleep. P stayed at my place and J went home. Both me and P went home to my house and smoked a couple bowls before going inside and trying to go to sleep. I setup a bed in my room for P to sleep in and then immediately jumped into my bed and closed my eyes. After about 2 hours of trying to sleep I knew something was wrong, P couldnt sleep either. So we basically tried to sleep as much as we could before morning came. When morning came nothing was different, we were still coming down from the drug and had no sleep whatsoever. At about 11am I went to go have a shower, I looked in the mirror at my eyes, my pupils were still as big as pennies. This I thought was not right at all. When I got out of the shower I looked at P's eyes, still dilated. Something was wrong. So we called J at noon and asked him how he was doing. Same story, no sleep at all. So I told him to go and take a quick look in the mirror, same story, dilated pupils still.",
  "It was four days later when we all started to feel normal. We all hadn't slept in 3 days either, insomnia is very annoying. This experience caused a whole lot of different problems in just one night. I would recommend people test their E.",
  "This was my worst experience with ecstasy. I haven't touched it since this experience either. E is a very unpredictable drug, because it can contain a lot of other more deadly drugs in one tiny little pill.",
  "-Dave"
 ],
 "erowid": {
  "id": "9966",
  "citation": " Dave. \"Three Days and Three Nights: experience with Ecstasy (ID 9966)\". Erowid.org. Jul 12, 2005. erowid.org/exp/9966",
  "substance": "Ecstasy",
  "views": "5202"
 }
}
