{
 "title": "The Wormwood Experiment",
 "author": "the double D's",
 "citation": " the double D's. \"The Wormwood Experiment: experience with Wormwood & Cannabis (ID 14255)\". Erowid.org. Apr 30, 2002. erowid.org/exp/14255",
 "substance": "Wormwood & Cannabis",
 "bodyweight": "125 lb",
 "report": "<p>We have been interested in alternate consciousness experiences for awhile, and it is with this in mind, that we decided to try 'the wormwood experiment'. </p><p>We took a small amount (a pinch, small fingers), and mixed it with cannabis.  We smoked it in a bong.  We felt immediately that we had stumbled into something very interesting and quite unlike anything we had previously experienced.</p><p>The result, for us, was a very relaxed body stone.  At the same time there was a sense of surging energy in our bodies.</p><p>I saw what appeared to be some kind of shimmering beings, about the room where we had smoked.  And something big. (scared the crap out of me for a second.) </p><p>My accomplice experienced an ache in the area of her 'third eye'.  She did not see anything out of the ordinary. </p><p>We would like to caution anyone reading this that attempting to move while having inbibed these substances is very difficult.  It took us 2 hours to get to the store (for munchies).  Although we tried repeatedly just to get off the couches. </p><p>Further experimentation is required.</p><p>We read 'the Thudge' article and are considering experimenting with this obviously more potent substance.  Our stones, were shorter lived and less pronounced, although many of the general descriptions sound similar.</p>",
 "year": "2002",
 "id": "14255",
 "timestamp": "2002-04-30T07:00:00.000Z",
 "views": "18677",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " bowls",
   "administration": "smoked",
   "substance": "Wormwood",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": " bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
