{
 "title": "Trippin' Hard for the First & Last Time",
 "author": "Brocker",
 "citation": " Brocker. \"Trippin' Hard for the First & Last Time: experience with LSD (ID 1426)\". Erowid.org. Oct 20, 2000. erowid.org/exp/1426",
 "substance": "LSD",
 "bodyweight": "125 lb",
 "report": [
  "<p>It was my first time experimenting with acid and I was really anxious to try it. I took my hit at about 1am and it took good effect at 2am. I remember I was lying on the floor watching this weird movie, it looked like a screen saver. Weird images just kept coming out of the screen and they were getting faster and faster. I could actually feel myself getting scared, so I had the people I was with turn off the movie. I then started to stare at the ceiling which had neat patterns all over it, then the patterns started moving and shooting all over the ceiling.",
  "The next thing I knew, I was floating up to the ceiling and I was laughing. Once I reached the ceiling, I turned over and saw myself lying on the floor. I started talking to my human self and I was actually talking back!! My ghost self and human self were having a deep conversation about my life! What seemed like 20 minutes was really 3 hours and I finally snapped out of it. When I came to, I decided to smoke a cigarette. I could feel the smoke shoot down my lungs and I could feel it moving around in my body. I moved to the couch and some of the non-tripping people that were there decided to put on these scary masks and scare us. I knew it was fake but it seemed so real, and behind them I saw a flashing white light and people from like the 1940s, ballroom dancing and whispering my name over and over again. I finally stopped tripping at around 2 the next day and I would not recommend this to anyone.</p>"
 ],
 "year": "2000",
 "id": "1426",
 "views": "15384",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "submissionDate": "2000-10-20T07:00:00.000Z"
}
