{
 "id": 14271,
 "title": "The Hospital Spaceship",
 "date": {
  "submission": "2013-09-29T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "KGB",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "",
   "substance": "25I-NBOMe",
   "form": "blotter / tab"
  },
  {
   "time": "0",
   "administration": "IV",
   "substance": "Pharms - Lorazepam",
   "form": ""
  }
 ],
 "report": [
  "I have had experience with psychedelics in the past, but none at all like this. I've had LSD once, MDMA three times, mushrooms six times and salvia a few times as well. I picked up an 8 strip of 25I-NBOMe from a dealer for ten dollars. At around 11pm, I took 2 tabs, then another somewhat on accident. I guess I wasn't thinking clearly and yes I do understand I took far too much. Anyways, my friend and I started to watch an anime, Sgt Frog and I recall telling her that I wanted to screw every female character on the show with much passion.",
  "I was having a great time and 30 minutes later, I was on the floor staring at the ceiling talking about how amazing everything looked, as the ceiling swirled in patterns. I saw geometric patterns of all colors layer over everything, much like a rainbow bee-comb. I thought this was the greatest trip of my life. She switched the movie to The Lorax and at some point left to go home. I have no recollection of the next few hours but I very vaguely remember my dad asking me in a very scared voice 'son, what did you take'. I remember in my trip there being some conspiracy about something with hospitals and I was scared out of my mind.",
  "My next memory was being in a hospital, bandages around my right arm with a tube going into me. Both of my arms were bound down by restraints and there were these human looking aliens I believed all to be figments of my imagination wobbling around hooking me up to the EKG. On that EKG, I could see my heart rate extremely high, somehow I was able to recognize that. I didn't believe that I was in a 'real' hospital. I thought I had been kidnapped or abducted by aliens and the doctors were fake and part of my bad trip and I thought they were trying to put things inside of my penis. I really don't know if they were, but I couldn't touch my penis to find out. I was crying and screaming and thrashing about so much that my arms bled from the restraints I was on. My mom was sitting by me and I told her that I drank 40ozs and hung out at the bulb (neither of which were true).",
  "I also didn't believe that she was my mother, and her face was morphing constantly. There seemed to be white wispy smoke like things trailing from everyone's bodies, and there were designs floating in front of me. I was sweating and shaking through the night. In the morning, my mom told me that I was in the hospital and took too much drugs.",
  "I still didn't believe she was my mom and kept insisting that she call my mom to tell her that I was in the hospital and O.K. I found out that the I.V. that was in my arm gave me Ativan and my parents had found me at around 12 am in the driveway, swinging my arms around and spinning in circles. They said I was knocking into things and knocked over the trashcans and bent the car mirror. I apparently also fell into the bushes a few times and my pants were wet with what I believe to be rainwater, but could have very well been urine.",
  "I right now have cuts and bruises on various parts of my body and I'm extremely exhausted, physically and mentally. I don't want to do drugs anymore, not even weed which I have loved dearly since I was 13. I know people will take this drug regardless of my report, so all I can do is advise extreme caution and consideration to the dose and if you really want it before doing so."
 ],
 "erowid": {
  "id": "99780",
  "citation": " KGB. \"The Hospital Spaceship: experience with 25I-NBOMe (ID 99780)\". Erowid.org. Sep 29, 2013. erowid.org/exp/99780",
  "substance": "25I-NBOMe",
  "views": "1117"
 }
}
