{
 "id": 14275,
 "title": "Simultaneous Stimulant Use: A Retrospective",
 "date": {
  "submission": "2013-04-30T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Amanofcontradictions",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": {
    "number": "T+",
    "unit": "0:10"
   },
   "administration": "1 ",
   "substance": "oral"
  },
  {
   "time": "Alcohol - Beer/Wine",
   "administration": "T+ 0:20"
  },
  {
   "time": "smoked",
   "amount": "Cannabis",
   "substance": "T+ 1:30"
  },
  {
   "time": "1 ",
   "amount": "oral",
   "administration": "Alcohol - Beer/Wine"
  },
  {
   "time": "1:30",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": {
    "number": "T+",
    "unit": "1:45"
   },
   "administration": "150 mg",
   "substance": "insufflated"
  },
  {
   "time": "MDMA",
   "amount": "(powder / crystals)",
   "administration": "T+ 1:50",
   "substance": "50 mg"
  },
  {
   "time": "oral",
   "amount": "MDMA",
   "administration": "(powder / crystals)",
   "substance": "T+ 2:20"
  },
  {
   "time": "0",
   "amount": "smoked",
   "administration": "Cannabis"
  },
  {
   "time": "3:00",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone"
  },
  {
   "time": "(powder / crystals)",
   "amount": {
    "number": "T+",
    "unit": "4:45"
   },
   "substance": "oral"
  },
  {
   "time": "MDMA",
   "amount": "(powder / crystals)",
   "administration": "T+ 5:00",
   "substance": "repeated"
  }
 ],
 "report": [
  "In the opening to his monumental work on the sea, 'The Mediterranean', Fernand Braudel memorably insisted that 'Mountains come first'. Thus it is perhaps appropriate that some information on the hinterlands and landscape of my experience be provided.",
  "The personal landscape:",
  "I am a nineteen year old male studying history as part of my three year degree at a globally ranked top five university. I train in both athletics and rowing regularly and pride myself upon my mental and physical vitality. The other side of the coin is my love of experimentation; I have at the time of writing sampled to different extents alcohol, caffeine, nutmeg, nicotine, ephedrine, DXM,MXE,Ketamine, codeine, dihydrocodeine, tramadol, valium, cannabis, HBWR, salvia divinorum, MDMA, 6-APB, 4-Methylmethcathinone, speed, methiopropamine, ritalin and various other stimulants and depressants. Generally speaking my relationships with these substances has been characterized by short, experimental uses that have been compatible with the continuation of a physically and socially healthy lifestyle. The exceptions to this rule being my use of caffeine and, latterly, ritalin and methiopropamine.",
  "The hinterlands and setting:",
  "I had abstained from all substances except for caffeine and alcohol in the preceding three days. After Athletics training I ate a small meal of kedgeree at home and set out to a friend's house party around 21:00. The venue was a detached house with an amateur DJ and garden for smoking. My close companions were also aged nineteen and all smoked Cannabis more regularly than I, as well as plenty of experience with MDMA, 4-Methylmethcathinone(from here on mephedrone)and ketamine. ",
  "The experience:",
  "21:00 (from henceforth T+0:00) One joint of cannabis shared.",
  "T+0:10 One can of beer containing 2.5 units of alcohol",
  "T+0:20 One joint shared.",
  "T+0:40 Fairly typical 'stoned' sensations of heaviness, relaxation and altered thought-patterns.",
  "T+1:30 One joint shared. In combination with a further can of beer  that brings my total alcohol intake up to 5 units I am left feeling quite stoned - feelings of detachment, relaxation verging upon apathy and good humour are noted.",
  "T+1:45 I prepare a line of 150 mg of brown, fairly crystalline MDMA for insufflation. The fact that my companions had to tell me to halve the size of my dose was, in hindsight, a good indicator of my ebullient and careless mindset at the time.",
  "T+1:50 I dab a further quantity of powder - perhaps 50 mg in the process of rebagging my remaining MDMA.",
  "T+2:00 Alerts and some head-rush present.",
  "T+2:20 A joint shared which takes the edge off of some of the come-up. A sense of confusion and unease mixed with stimulation and euphoria noted. This appears to be fairly typical of the liminal stage between ingestion and the 'full' effects of MDMA.",
  "T+2:30 The joint leaves many in good spirits and we join others in the DJ room for dancing to house music. I was enjoying myself but effects were not as intense or enjoyable as an experience on MDMA and Ketamine several weeks ago.",
  "T+3:00 A friend, M and I go to a room with the intention of insufflating some speed. However we were diverted by other guests who kindly offer free lines of the mephedrone which they assure us is 'so good it should be shared'. Such an offer was, of course hard for us to resist, and we both snorted lines of around 150 mg.",
  "T+3:20 By this point I am rushing very hard on mephedrone. The physical effects were so strong that my entire head felt blasted and tingled, a sensation that was at times hard to separate from my mental stimulation. Heart rate was considerably but not hazardously raised in comparison to MDMA in isolation.",
  "T4:00 I have been dancing and talking very actively since ingesting the mephedrone.",
  "T+4:30 My close group leave the house party to walk to a nearby friend's house in order to continue our experiences in a more chilled atmosphere.",
  "T+4:45 A joint is smoked and further MDMA taken orally in water by all concerned.",
  "T+5:00 By this point I have been considering insufflating some speed for some time. Two of my close friends and I insufflate small bumps of it.",
  "T+5:10 Although the combination of copious quantities of cannabis, MDMA and mephedrone have left me in an extremely abnormal state of consciousness, the speed is still clearly distinguishable from the other substances by its exceptional clearheadedness, an effect made all the more noticeable by its contrast with the mephedrone's unclean feel.",
  "T+5:30 Music is continuously played and a very high but warm atmosphere became prevalent amongst the group of seven or so friends. Further joints were smoked, followed by a bong.",
  "T+5:30-7:30 At the same time as smoking,  my friends and I continued to insufflate small bumps of speed, all note the cleanness of the high. Towards the end of the session I begin to have extra lines, perhaps because I have much more extensive past use. The polydrug experience meant that I began to develop a considerable 'body-load' including very elevated heart rate. I then stopped dosing but continued to have an enjoyable time. I danced and was extremely active throughout, far more so than my companions.",
  "T+8:00 Some attempts at winding down the night and sleep are made, including several joints. I was content to lie in my sleeping bag but sleep was, unsurprisingly, interrupted and most likely shallow.",
  "T+13 I awake properly, with a splitting headache and feelings of a hangover. Lethargy far greater than a typical morning after amphetamines or cannabis was noted. This after-effect was noted by most present, but especially M and I who had done mephedrone and speed also.",
  "T+13:00-20:00 Relaxed joints were smoked, and with water, a simple aspirin and a breakfast of self-cooked fresh produce my hangover subsided. Music was listened to and warm recollections shared of the night before. Two final bongs were smoked each leaving us all in a fairly stoned state of relaxation before we caught the bus back to our homes.",
  "A Retrospective:",
  "Significant fatigue led me to sleep for twelve hours at 21:00, exactly a day after the beginning of the experience. I awoke the next day feeling somewhat tired but otherwise healthy.",
  "The mephedrone combined with MDMA and later speed was a strong but rather dirty influence on the experience. Despite all the substances merging into one another to a great extent, the mephedrone could be distinguished at times for its strong physical stimulatory effects, particularly in contrast with the clearheaded effects of the speed.",
  "The later effects of the MDMA, particularly exacerbated by cannabis, contained a significant element of psychedelia, at times verging on psychosis.",
  "In future, I would abstain from ingesting mephedrone in combination with the other substances, primarily on the grounds that I have experienced it once, and the combined stimulant effect is a largely unnecessary strain upon my body.",
  "The entire experience remained, nonetheless, a warm and rich sea of swimming thoughts."
 ],
 "erowid": {
  "id": "99798",
  "citation": " Amanofcontradictions. \"Simultaneous Stimulant Use: A Retrospective: experience with MDMA, 4-MMC & Methiopropamine (ID 99798)\". Erowid.org. Apr 30, 2013. erowid.org/exp/99798",
  "substance": "MDMA, 4-MMC & Methiopropamine",
  "views": "1668"
 }
}
