{
 "id": 14277,
 "title": "Worst Hangover of My Life",
 "date": {
  "submission": "2013-04-05T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "StillGood",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "1:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "2:00",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "3:00",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "4:00",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "5:00",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "A friend of mine is an RC vendor, and was kind enough to send me some samples, including the 4-MEC which is the subject of this report.",
  "I started with a small bump, maybe 40mg. This produced a stimulant effect, which I would liken to low dose amphetamine.",
  "I found myself coming down within an hour, so decided to redose. Again, not a large amount maybe 50mg.",
  "Definite euphoria, motivation, energy, and appreciation for music. At this point, still most reminiscent of amphetamine.",
  "I did a handful of key bumps which maintained the experience.",
  "After 3 or 4 hours, I decided to try a full line. I insufflated (probably) around 150mg.",
  "At higher dose levels, the serotogenic activity of the drug becomes MUCH more pronounced. I am a very experienced user of MDMA, so these effects were easy for me to identify. I felt cognitively foggy, and physically floaty. The euphoria, however, was not on par with MDMA, but still enjoyable.",
  "The bumps and lines continued for about a total of 10 hours. When it was all said and done, I had consumed the whole gram of 4-MEC.",
  "I ended up having drinks with some friends and smoking weed. The latter of which induced sleep, and I slept a full 8 hours.",
  "The experience itself was enjoyable, but not particularly noteworthy.",
  "What is noteworthy is how incredibly awful I feel the next day as I am writing this.",
  "The hangover is worse than taking a large amount of MDA. It feels like my brain hurts, and I am slightly nauseous. I feel sluggish and unmotivated. If I didnt have work, I would definitely be laying in bed, or trying to find some landing gear.",
  "I have used A LOT of drugs in my time, and this is definitely amongst the worst hangover/day after experiences I have had.",
  "I hope anyone reading this will use caution when taking 4-MEC and keep the total dosage low for your first experience.",
  "I suspect the neurotoxicity of this compound would be high if research were performed."
 ],
 "erowid": {
  "id": "99800",
  "citation": " StillGood. \"Worst Hangover of My Life: experience with 4-Methylethcathinone (4-MEC) (ID 99800)\". Erowid.org. Apr 5, 2013. erowid.org/exp/99800",
  "substance": "4-Methylethcathinone (4-MEC)",
  "views": "1232"
 }
}
