{
 "title": "Organized Confusion",
 "author": "Mason",
 "citation": " Mason. \"Organized Confusion: experience with DXM (ID 14283)\". Erowid.org. Sep 26, 2008. erowid.org/exp/14283",
 "substance": "DXM",
 "bodyweight": "145 lb",
 "report": "<p>I have used DXM many times before but I quit using it for a long time (about 2-3 years). Now, I am a freshman in college and just recently got myself to quit sniffing oxycontin. I needed something that wasn't addictive to help me out through withdrawl and I figured that i hadn't used DXM in a while. A friend of mine in the dorm also wanted to use it. He had done it twice before but never in any high or even moderate dosages. My reason for taking it was that I need to do some serious introspection and I also have been researching how to induce an out of body experience. My friend (I will call him B) and I planned out the day that we would do it (a friday night) and when that time came we cooked down some sucrets in water and then poured the water out and let the powder settle at the bottom of the last 'shot'. We had decided to dose at about 7:30PM because we wanted to take a walk up to this big hill we have on campus to watch the sun set. All week I had been preparing for what I wanted to be a religious or spiritual experience. What I got however was not quite what i expected.</p><p>T+00:45 - After playing a game of hacky-sack to get our blood flowing, we decided to embark on our journey. We walked over towards the big hill just as the effects started to kick in. I remember feeling 'lifted' slightly and we were discussing how we both could feel something at this point ( a little like having 4 or five beers). When we reached the top of the hill and sat down the DXM was kicking in more and more with every passing moment. The sun was just starting on its downward path and we were talking about how incredibly beautiful it was out. We were basically discussing life and a love of nature and things like that when we both got hit with the second plateau. At this point, i looked down and saw a cop driving down the dirt road towards where we were sitting. I started to get paranoid at this point because i knew my eyes looked like saucers and i know fucked up DXM can make you look to someone who is not tripping (ESPECIALLY a cop.)</p><p>Anyway, B told me to just close my eyes and pretend the cop wasn't down there watching us (god damn big brother) so we both did just that. It was at this point that my *soul* ( I'm not sure if it was my soul, maybe just my mind) escaped my body for the first time in a quite a few years. I can remember my *soul* flying out of my body and heading straight for the police car. I can remember entering the cops body (it was a woman, or so I gathered) and for a moment i knew what she was thinking. It seemed she had the delema of wanting to come and get us to see what we were up to but then she didn't want to have to climb the big hill. This made me laugh and I opened my eyes. The cop was gone, the sun was down, and an hour had passed in what seemed like 10 minutes! I tapped B to get him out of his trance and we decided to get back indoors. (the trip was REALLY kickin in)</p><p>T+01:30 or 01:45 - By the time we reached the dorms, we were both coming up on our peaks and wanted to chill out to some music in my room. When I got to my room, my roommate was there and it made me feel strange because he's not into drugs. I can remember just wanting to lay down and trip out but I was really confused as to what was going on in my room (later to recall nothing was going on I was just really fucked up). B decided to go take a shower because he gets really itchy whenever he takes DXM. At this point, my roommate left for the night and I was all alone, FINALLY! I put on my headphones and started to listen to acid jazz. I can remember laying down on the middle of the floor and then all of the sudden I felt like i had 30 bodies that had fanned out beneath me. I was melting into the floor! (really cool) Now, whenever I used to take DXM, I always used to eat coricidin (BAD) and I used to get some REALLY crazy visuals, probably from the CPM (VERY BAD). I wasn't getting crazy visuals at all with this stuff, maybe because it was pure I don't know but all I would see were solid colors like grey or white or black flashing in a ball like shape and feeling like I could see this ball in 4d. I do rememeber at one point (I think it was my peak) listening to this song and all of the sudden I popped into a surreal suburbia. This little town in my mind was complete with freshly mowed lawns, big houses, and even a barking dog that kept running after me. I felt like I was in a movie! I can remember meeting this guy and he kept asking me what i was doing in his town. Eventually, i replied (it wasn't actually my body doing the talking i think my mind was just floating around the town) 'I'm looking for my head.' He then proceeded to tell me that i was crazy like mr. leary or something along those lines. Eventually after floating around looking for my head, the song in the background ended and i opened my eyes. Instantly I yelled 'I found it, I found my head!' and then proceeded to think to my self 'what the hell just happened' I laid there for a while trying to peace together what had happened and then i remembered that B never came back. I couldn't help but feel that he was somehow in trouble (I always have this sort of telepathy). So anyway, I got up and walked out into the hall way which seemed to go on FOREVER before I came to B's door.</p><p>I saw another one of my friends coming out Bs door and i asked him where B was. He mumbled something like 'Dude, his lip, his lip!' and I was like 'what the fuck is going on'. I was very confused at this point, I don't think I could have handled the smiplest of tasks. I went into B's room and he was sitting on his bed in his boxers looking really freaked out. I asked him what was up and he told me that he had an allergic reaction to the DXM and it made his shit swell up. I looked at his lip and it was HUGE!! He looked like someone had punched him in the face. I told him that I don't think that's what happened because he didn't drink any dyes or sugars with the DXM. Anyway, that calmed him down and we went back to my room where we both colsed our eyes and started tripped out hardcore. I really can't remember much except seeing this big red revolving lip in my view whenever I shut my eyes. This made me laugh so hard I could keep my eyes shut after a while so i just started dancing around the room like a drunken monkey. That was the most enjoyable experience of my life just dancing without a care in the world. I can't even describe how happy i was from that point on. Anyway, after that B got up too and we ended up having a huge discussion about life, drugs, women, and universal human nature. We probably sat up until 4am talking about stuff until we got tired and passed out. When I got up the next morning I tried to contemplate what happened the pervious night. I remember being really confused a lot but came out of the trip being so incredibly happy that it was all worth it. I remember coming to the conclusion that I really didn't need drugs to be happy (I had always used drugs to be happy since I was about 13) Anyway, it's been about 2 weeks since I've last used any opiate and i am thankful as hell for that. I finally have gotten away from the grasp of drugs. It's kind of ironic being the fact that it took a drug to get me to realize that i don't need them anymore.</p><p>So I guess my point of this is that drugs can be a lot of fun, but they can do a lot of harm too. Everything in life balances everything else out. If you have too much fun you are always going to pay. Just like if you steal someones purse, it will come back to you. My advice to anyone who wants to use DXM is to RESEARCH it. We found out later that B actually passed out in the shower and fell into a wall causing his fat lip. He told me that he could have drown or something because he blacked out for a while. DXM causes mass confusion in higer doses and you really need to know what to expect before doing it. Also, it can really cause brain damage (i.e. it is speculated to make tiny holes in your barin if you take too much for too long.) so you just have to be smart about using it if you are going to.</p><p>That's my story and I'm sticking to it....</p><p> PEACE - Mason</p>",
 "year": "2002",
 "id": "14283",
 "gender": "Male",
 "timestamp": "2008-09-26T07:00:00.000Z",
 "views": "3796",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "540 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(powder / crystals)"
  }
 }
}
