{
 "id": 14288,
 "title": "An Embracing of All Life",
 "date": {
  "submission": "2005-07-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Pnk",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "First time, taken in very alien place to home thousands of miles away in mountain town near east coast in early colonial town which spawned several American historical figures. Taken with new but very trustworthy individuals who had grown them. Eaten with ricedidn't even taste them. taken as thunderstorm rolled in. At first everything was just funny, but then the storm and the real voyage rolled in.",
  "Eventually realized that it was time to leave the house where we took them and wander around strange town with my permanent companion. New realizations and connections to nature and my animal-being on this earth. Drinking water from a leaf seemed completely natural, and I could feel the cycles of nature all around. Also realizations and release of guilt held within self about ancestors conquesting the nation and suddenly feeling the essence of all of human evolution. No justification, but a realization of where I fit in and how all of history relates to the present, and a feeling of understanding at the beauty that the first voyagers to America must have felt while at the same time somehow easing my guilt and feeling a connection to native Americansan embracing of all life and realization that things are not always easy, but we are all of the same.",
  "Plants were of severe interest and I saw an entire bed of bushes as many copies of one same busha huge garden of exact replicas of the same bush. Plants were very close to me and seemed to be friends of mine as people are. Eventually realized that making out with companion was a must, so we tried it and enjoyed it very muchAll touching was strange as if feeling what touching as a sense was like for the first time. Both of us very wet from the rain that was constantly happening, but not minding one bit.",
  "Eventually found our way back and found our friends. Talked a bit and wandered around the house. Went back to sleeping quarters and as effects were beginning to dwindle talked with companion and then had some of the best sex ever both of us agreed. Went to sleep feeling somewhat confused at all of the information gathered, but very satisfied and enlightened. One of the best nights ever and the positive effects are still with me everyday."
 ],
 "erowid": {
  "id": "9988",
  "citation": " Pnk. \"An Embracing of All Life: experience with Mushrooms (ID 9988)\". Erowid.org. Jul 12, 2005. erowid.org/exp/9988",
  "substance": "Mushrooms",
  "views": "2495"
 }
}
