{
 "id": 14280,
 "title": "First Time in a Technoclub in Amsterdam",
 "date": {
  "submission": "2013-06-02T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Adriaan",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.75 tablets",
   "administration": "oral",
   "substance": "6-APB"
  },
  {
   "time": " T+ 1:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "6-APB"
  }
 ],
 "report": [
  "<p>Yesterday I tried this relatively new substance: 6-APB. For those of you wondering what kind of experience it gave me, here you go.",
  "Me and a friend of mine went a techno club in Amsterdam to celebrate the 3rd years anniversary of a specific party. Normally the club closes around 5 in the morning but because of the anniversary, the club was open till 9 in the morning. For this reason my mate and I decided to go for 6-APB, it is known that 6-APB lasts longer and thus is more appropriate to use on long party's.",
  "Dosage, euphoria and duration:",
  "I took the first three quarters of a pill (1 whole pill = 150 mg, 99.95% pure) around midnight, and then a half of pill around 1 AM.",
  "Around 2 AM, I noticed a very pleasant euphoria was climbing up in a very gradual fashion, it took about 20 minutes to half an hour to reach the peak, which for me (a bit of a experienced MDMA user), wasn't overwhelming at all. In my experience, the big difference between MDMA and 6-APB is the way I reach the peak, which was way more gradual with 6-APB then it was with MDMA. The euphoria peak wore off around 6 AM and was just like the build-up, very gradual. After the peak had worn off, a (amphetamine-like) stimulation and a good mind-set kept the party up!",
  "Stimulation and jaw clenching",
  "There was a good bit of stimulation and jaw clenching present, which both remained strongly active till around 11 AM (will take magnesium in future rolls to prevent jaw clenching). My mate told me he did not really experience jaw clenching like I did, a lot less actually. (he took 1,5 pill @ midnight).",
  "Hallucinations",
  "There were some hallucinations, which share resemblance with my first MDMA experience: vision blurs, tracers, et cetera. My mate did a whole lot of 6-APB once (around 400 mg in one night), and he told me that the psychedelic edge of 6-APB was getting effective at 200+ mg dosages.",
  "Conclusion",
  "I had a wonderful evening, danced a lot, had a lot of lovely conversations and enjoyed myself really well.",
  "Caution",
  "Remember: It is a good idea not to drink too much water and when you are feeling too hot, go to some less crowded place, and cool down (a shard of ice on the back of your neck really helps a lot). And if you role on a dance party, don't forget to sit once in a while, to give your body some rest.</p>"
 ],
 "erowid": {
  "id": "99822",
  "citation": " Adriaan. \"First Time in a Technoclub in Amsterdam: experience with 6-APB (ID 99822)\". Erowid.org. Jun 2, 2013. erowid.org/exp/99822",
  "substance": "6-APB",
  "views": "901"
 }
}
