{
 "id": 14287,
 "title": "Unpredictable",
 "date": {
  "submission": "2013-05-06T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tellurium",
  "gender": "Male",
  "weight": 190
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "37"
   },
   "administration": "oral",
   "substance": "2C-T-7"
  },
  {
   "time": "7:00",
   "amount": {
    "unit": "mg",
    "quantity": "4"
   },
   "administration": "oral",
   "substance": "Mirtazapine"
  }
 ],
 "report": [
  "I have been in the process of reviewing this and other members of this series recently including 2C-T-2, 4, 16 and 21.",
  "For me, generally, the 2C-T family have been somewhat unremarkable as psychedelics and certainly a lack of visual aspect to the experience compared to others such as, say, 10mg of DOM and as such have been a bit of a disappointment.",
  "However...",
  "I'm relating this due to a disturbing effect I had from 2C-T-7 recently. This was part of a run I was doing by incrementally increasing dosage by 5mg until I reached 45mg and determined that this had excessive body load with no net reward to compensate.",
  "So I took 37mg (7 days from last dose of 40mg of 2C-T-7) and expected a somewhat milder experience with less nausea and the beginning of it progressed that way, as expected. I normally expect mental effects to peak at about the 3hr point yet visual effect peak around the 4hr point and then plateau followed by a steady decline.",
  "When I was into the plateau at about the 6hr point the effects started to increase again as though I had 'redosed', vomiting ensued followed by a sense that I about to lose consciousness or pass into a state of delirium, it still kept climbing over the course of an hour (I feared death at this point).",
  "In desperation I took about 4mg Mirtazapine and within 30-45mins I declined into a more manageable state with residual intoxication. Mydriasis during this experience was much more pronounced than with earlier runs.",
  "The cause for this resurgence of effects is unknown to me, as I consumed nothing but water since taking the dose, no other drugs in my system, no sleep deprivation and have not made any changes to my diet. It came out of the blue and has caused me to revise further exploration of this compound and possibly the entire 2C-T series."
 ],
 "erowid": {
  "id": "99871",
  "citation": " Tellurium. \"Unpredictable: experience with 2C-T-7 (ID 99871)\". Erowid.org. May 6, 2013. erowid.org/exp/99871",
  "substance": "2C-T-7",
  "views": "771"
 }
}
