{
 "title": "Panic Attack and Palpitating Heart",
 "author": "Stars",
 "citation": " Stars. \"Panic Attack and Palpitating Heart: experience with Caffeine (ID 1428)\". Erowid.org. Jul 16, 2000. erowid.org/exp/1428",
 "substance": "Caffeine",
 "bodyweight": "170 lb",
 "report": [
  "<p>I've drunk caffeine since I was 14 years old.  In fact, I spent a large amount of time as a teenager scoping all the coffee houses, becoming friends with all the 'regulars' (if not a regular myself).  I never saw anything wrong with caffeine--it is in soda, and my parents together must drink over 12 cups a day.  That is, I never saw anything wrong with caffeine until the night I was stuck in bed with a palpitating heart and panic attack, unable to write my 10 page paper for my anthropology class.",
  "For those of you interested, I am an experienced drug user including the likes of methamphetamine, cocaine, LSD, MDMA, Ketamine, marijuana, GHB, Alcohol, Inhalants, Morphine, nytol, kava, nitrous, tobacco, and zoloft(for my depression).  It is not as if my system wasn't used to being inhabited by chemicals.  But, for some reason, the night I planned to write my anthropology paper was a caffeine experience from the pits of hell. ",
  "I started off by drinking 3 cups of coffee to keep me awake for another 12 hours minimum.  But then, I convinced myself that the dose I chose was not enough and drank 3 more cups of coffee.  Then I thought, what the hell, for the extra punch of motivation, I'll take a vivarin.  All of this caffeine within a time span of 2 and a half hours.  This increased dosage was a poor decision on my part, because 20 minutes later I was on top of the toilet with diarrhea.  My heart was beating profusely, I was struggling to catch my breath, and I felt a pain in my stomach as if I was having an anxiety or panic attack. ",
  "After using the toilet about 5 times, I decided that I was in no shape to write my anthropology paper and I convinced myself it was alright to turn it in late.  I walked dizzily to my bed from my computer, trying not to awake my roomate.  I lay down in my bed, disillusioned about my current state, and decided to try to fall asleep.  Well, 7 hours later I was still awake and struggling for breath, hoping that I wouldn't have a heart attack.  I almost convinced myself to take 2 nytol to come down off the caffeine, but I didn't ultimately because I heard that combining caffeine with nytol could result in my parents needing to visit me in the hospital. ",
  "Eventually, after hours of tossing and turning, I was able to fall asleep.  I awoke happy to be alive.  You see, I was in extreme panic the night before--an experience that I could relate to having a bad trip on LSD.  I decided to never pull an all nighter again.  I immediately threw away my vivran and began to write my anthropology paper with a clear head.</p>"
 ],
 "year": "2000",
 "id": "1428",
 "views": "58092",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Caffeine"
  }
 ],
 "submissionDate": "2000-07-16T07:00:00.000Z"
}
