{
 "title": "Profound Awareness",
 "author": "Swifty",
 "citation": " Swifty. \"Profound Awareness: experience with 2C-T-2 (ID 14317)\". Erowid.org. May 1, 2002. erowid.org/exp/14317",
 "substance": "2C-T-2",
 "bodyweight": "220 lb",
 "header": [
  "DOSE:",
  "65 mg",
  "oral",
  "2C-T-2",
  "(powder / crystals)"
 ],
 "report": "<p>In one of PIHKAL's entries, someone describes 'the thinking-connection that I associate with 2C-T-2'. I haven't found much else that mentions how 2C-T-2 helps one understand complex expressions and modes of thought, although there are some accounts on the web that get close to that idea. I think 2C-T-2 is something for the psychiatrist to take, because it enhances understanding and comprehension. I also find it to be extremely introspective, and it forces me to look deeply at my place in the universe. I find there's quite a bit of amnesia and 'forgetting what I was just doing' during the experience of 2C-T-2 that makes it difficult to do much else other than enjoy meditation, music or the company of others. But I'm convinced you come out of it with an increased understanding of things.</p><p>On 2 occasions I tried 65mg of 2C-T-2, and each time I found it to be an extremely meaningful and life-changing experience, somewhat different than other phenethylamines I have tried, such as 2C-B, 2C-I, MDA, etc. The experience was more like an LSD breakthrough than anything else. Please do NOT use 65mg 2C-T-2 as a first time dose!! I had increased my dosage from 10 to 50mg over the course of 2 years, and when I got up to the 40-50mg range I started to notice something different. The side effects (stiff joints, jaw tightness) were about the same as a 20mg dose, but there was a feeling of transcendence, as though a profound discovery had been made. I wanted to see if a higher dose would show me something more.</p><p>After drinking 65mg 2C-T-2 dissolved in 10ml H2O, I 'put my house in order', as one is prone to do after ingesting a mind-altering substance. Straightening things up, turning things off, taking the phone off the hook. At the 1 hour point I felt very altered and lay down on my bed, looking at the sky through the skylight. The visuals were starting, and for me on 2C-T-2, these consist of halos and grids that form perspectives and patterns on everything. I watched the sky for a good half hour, enjoying the show. At the 1.5 hour point, I seriously wondered if I had taken too much, heading completely into that +3 disorientation and confusion. With 2C-T-2, this can be alarming because the amnesia is so strong. On LSD it's difficult to tell if you're hot or cold, tired or alert, etc. With 2C-T-2 I never even get to that point. I am unable to think things through far enough to know what I am feeling, and because of that I have to trust that everything is going to be OK because I would have no way of telling if it wasn't, even though you I still see pretty good, walk around, and otherwise function normally.</p><p>At the 2 hour point I am sitting in a chair, looking around at everything and I become completely grateful for what I am, where I am, and who I have become. There is a roof over my head, I am warm and fed, I am alive and healthy, there are people that love me and I love them. Everything that I took for granted just a short time ago is powerfully meaningful. All of the things that I have done and need to do are obvious and connected to the universe. I'm not jumping up and down with joy about all this, but I'm relieved at the level of understanding I've achieved. There is a profound compassion for all life and a state of grace like none I've ever experienced. It's completely involving. I've experienced the feeling of oneness that is experienced with MDMA, LSD and Psylocybin, but they are flat and stoning compared to this. I'm really quite tuned in, I just happen to have visual distortions as well.</p><p>It takes about an hour to go through this, and after a while I listen to some music, read some mail, and otherwise reassimilate myself into the world. It feels good to do this, and I'm filled with hope and promise for what is yet to come. After about 6 hours the effects taper off quickly and I'm able to sleep easily for a good 10 hours. The next day I feel inspired and refreshed, although by the day after that I'm a bit tired. However, the sense of understanding and compassion are retained.</p><p>A couple weeks later I try the experiment again with 65mg 2C-T-2, and pretty much the same thing happens. Somehow I didn't think it would be the similar, that it would be less profound, but it all happens again; the extreme confusion and the profound self-realization replay themselves in much the same way. And another thing happens. After this second experience I lose interest in drugs or inebriants of any kind. I realized that I was just bringing myself up and down again and again and I wanted to get off the pogo stick for a while. I wanted to proceed with my life clear-headed and sharp so I could work with this renewed sense of values that the 2C-T-2 had helped reveal within myself. So far it's been 6 months, and I feel pretty darn good. But I don't regret any of the drugs I've used. They were all part of the process that got me here, and they have done all they can do for now.</p>",
 "year": "2001",
 "id": "14317",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-01T07:00:00.000Z",
 "views": "12330",
 "dose": {}
}
