{
 "id": 1432,
 "title": "Confusion and Extreme Memory Loss",
 "date": {
  "submission": "2005-08-05T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A Random kat",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "This started at about 10:30 pm.",
  "T=0: Ingested 5 mg of Ambien. A friend (we'll call him Q) did so as well.",
  "T+0:05: Mild effects. Ingested 1/3 of a 5 mg pill (give or take 1/5) I don't remember how much more Q took. I think it was 1/2 of a 5 mg pill.",
  "T+0:07: Strong effects. Sedated, but not quite tired.",
  "T+0:15: Went to the bathroom. A bit of trouble walking.",
  "T+0:20: Effects are strong. Still not tired, but I'd easily be able to sleep if I tried. I think it's because it slows the breathing, more than drowsiness.",
  "T+0:45(ish): Lost track of time around here. We were in Q's garage, fiddling with sticks and little hand-held power tools (for stripping bark and whatnot). Tried to make walking canes, I think. It was hard to get music loud enough to hear. Everything was loud, yet silent. Confusion and extreme memory loss occurs.",
  "Lost track of time",
  "About an hour after ingestion, I purged. I didn't notice myself purging. I just saw a strange liquid coming out of my mouth. I did a half-assed job cleaning it up, but I think I forgot about it whilst cleaning it. I lay down on a lawn chair (that reclines). I cover up with blankets and rest my head on a pillow. I talk with Q for a bit. We both comment on the people in the room. It feels crowded, like we're in a mall. The people aren't as real as anti-cholinergic hallucinations, but we can't tell if they are real or not. Something in the back of my head tells me they aren't.",
  "I get up. I didn't fall asleep. I think I put in a different CD (my memory is extremely fuzzy). Either way, it felt like the CD played for about five minutes before it was over. I don't recall hearing a note.",
  "We talk to each other a bit. Short, strained mumbles inform us that we are, in fact, quite delirious. We don't remember anything, so I think we had a few conversations twice (or thrice). Again, extreme confusion, and there is no longer a memory to lose.",
  "At some point, we decided to go back inside. We forget his CD player outside (and playing, perhaps), and a pillow, and probably a few other things. Interestingly, neither of us smoked a cigarette the entire time. That's pretty good, considering at the point we both had a pack a day habit.",
  "We get inside, and I think it was 4:30 or so. I don't recall. It was early morning, shortly before sunrise. I don't think I made it to a bed or a couch, I recall waking up on the floor, at about noon the next day. Aside from aches from sleeping on the floor, we both feel completely normal.",
  "I should note that Ambien is somewhat of a dangerous drug to take in dosages above those recommended by a doctor. It slows breathing, which can be very dangerous for an active person."
 ],
 "erowid": {
  "id": "14413",
  "citation": " A Random kat. \"Confusion and Extreme Memory Loss: experience with Zolpidem (ID 14413)\". Erowid.org. Aug 5, 2005. erowid.org/exp/14413",
  "substance": "Zolpidem",
  "views": "14578"
 }
}
