{
 "id": 14324,
 "title": "Fun with 5-MeO-DMT",
 "date": {
  "submission": "2000-06-27T07:00:00.000Z"
 },
 "author": {
  "name": "Skylla",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": ""
  },
  {
   "time": "0",
   "amount": "8.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I had an experience with 5-MeO-DMT that defies everything that I have read about it at Hyperreal. I won't say where it's from, but if you want it you will find it. It's the place that has never sold a drug. Anyway, I am a 220 pound male (Skylla's just a name to hide behind), who has a high tolerance for drugs. I got 20 mg in the mail on Wednesday. It was all together in a single unit, so I eyeballed what looked like about 3 mg. I put some on top of Basil leaves and took a hit, held it in, and had a one hour trip. It was normal in intensity and duration. It had no visuals, just the WHOOM WHOOM BZZZZZZT (joy) noise and the 'plant kingdom rapture'. No big deal, and I was disgusted at the fact that there were no visuals. I went to work and came home to drink a solution containing about 4 grams of ground Syrian Rue in lemon juice. It was about 8:15. At 9:45, I was sitting at my pc, when I divided what was left in half. I put the quantity on basil, lit it, held it in... I was in the fluidic light and a sort of archetypal joy that was mindless and probably what a plant feels like. The noise oscilated faster and 'tighter' then RAPTURE. The feeling flowed like water or air and at points illuminated. The trip consisted of no mental activity whatsoever. At a point in time, I remembered who and where I was and moved my fingers first. I was blind but knew that it would pass. I opened my eyes and thought how uncomfortable the bed was. I was on the floor. My head was under my computer desk, the wall phone next to my desk was knocked on the floor and to my horror - I was covered in vomit. The clock said 11:30. I did not sleep all night. I got up and somehow functioned at work, went home, and still did not sleep. I would trip on cups of coffee. (I know-no coffee and beta-carbolines, but I was out of it). I slept about 3 hours last night. At 2:00 today, I felt almost normal.",
  "I have these thoughts:",
  "There is an anti-cholenergic reaction from the body to 5-meo-DMT. \rHarmaline will not leave the body even with EXTREME diuresis (B-6, etc...)\rIf one were to keep taking harmaline, a 5-meo-DMT trip could last for life - until the body dies from sleep deprivation. \rThe Solomon Snyder model of MAOI is not completly accurate. I say this because of the trips that would occur with coffee. (See the book 'Drugs and the Brain') \rBeta-carboline potentiation does NOT make for a trip that will end in any reasonable amount of time. I need your input on this - what happened?",
  "Let me add that while there were these terrible parts, it was a religious experience. The light is mine, the experience real..."
 ],
 "erowid": {
  "id": "2232",
  "citation": " Skylla. \"Fun with 5-MeO-DMT: experience with 5-MeO-DMT & Syrian Rue (ID 2232)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2232",
  "substance": "5-MeO-DMT & Syrian Rue",
  "views": "52610"
 }
}
