{
 "id": 14336,
 "title": "The Lamp",
 "date": {
  "submission": "2007-10-02T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ethan Kurtz",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. semilanceata"
  }
 ],
 "report": [
  "Just when I had begun thinking that nothing much was going to happen, the pole light in the corner of the room began to waver.  The middle section between the base and light dome began to twist and coil like an irritable snake.  'Maybe I shouldn't have eaten all of those mushrooms,' a thought rolled over my brain like a news ticker at the bottom of the screen on a 24 hour news channel.",
  "But wait, there was something before this wasn't there?",
  "I first became interested in the relationship between ethnogens-- particularly mushrooms-- and non-traditional spiritual experiences eight years ago.  Being a less than adventureous individual (read: coward), I was content for an extended period of time to pursue extensive research on the subject.  As Ralph Waldo Emmerson said, 'knowledge is the antidote for fear.'  And the more I read concerning mushrooms the less intimidated I was by the thought of 'shrooming'.",
  "I decided to embark on my first mushroom guided journey in the early morning hours of Thanksgiving 2002.  I had done very little in the way of packing for the trip prior to departing.  I got some art books (Caravaggio and Klimt) and put several Lorenna McKennitt CD's in the CD changer before eating the mushrooms.  This was at approximately midnight.  Onset effects were almost an hour in coming.  This was due probably largely to the fact that I had eaten only five hours beforehand.",
  "I first noticed an increased level of energy.  It became very difficult to hold still and I fidgeted constantly while looking at several of the paintings in the art books.  I quickly became uninterested in the paintings.  I smoked a cigarette and grew fascinated with the way it burned.  It seemed that when I watched it closely, it burned slowly.  When I turned away for only a moment, the cigarette would seem to be suddenly consumed while I was not watching.",
  "At this point I felt the overwhelming urge to lie down.  I did so on the couch in my living room.  The couch cushions seemed to move under me.  I would breath out and the couch would rise under me.  If I inhaled the couch felt like it was sinking.  It seemed to me that the couch was breathing in time with me, with it's inhalation matching my exhaling.  It was a comforting feeling. I glanced up at one point to look around the room.  The love seat that matches the couch was in my line of vision and the dots that are part of the design on the upholstery seemed to move.  It was as if hundreds of lady bugs were crawling over the surface of the couch.  The couch seemed as if it possessed the ability to feel.  It seemed very sad.",
  "I passed out soon afterwards.  Actually, I am not sure 'passed out' is the best way to put it.  It was as if I was instantly severed from any sort of external perception my body or self.  There was only a vast void.  I had no feeling except for a profound contentment. I came back to myself just as the last CD in the changer came to an end.  I opened my eyes.  Everything around me was strange and vaguely menacing.  The light in the room had changed.  It no longer looked like light.  It seemed to just be various shades of yellow painted on the walls, ceiling and furniture.  Shadows listed gently on the walls.  I sat up as I noticed that the shadows seemed to be walking off the walls out into the room.",
  "I blinked against this uncomfortable hallucination and as soon as my eyelids closed, it was as if a voice-- possibly my own-- whispered to me inside my head.  It said: 'Your cynicism and pessimism are a gift.  You are using them as a crutch and thereby alienating yourself from your own existence.'  I opened my eyes and the shadows had receded and were again slithering around the walls.  I went to bed soon after this, but I was unable to sleep for quite some time. The voice I heard was not easy to shake.  I had been struggling with a great deal of issues in several important relationships in my life.  In the days after my experience, I felt a sort of clarity about my life.  I made several important decisions regarding my plans for the future which I had been avoiding for several years with ease.",
  "Almost exactly two months later, I took mushrooms again.  The set and setting with this trip were much more involved.  I cleaned my house.  I planned a time when I could be alone and undisturbed for an entire day.  I had a definite goal in mind for this trip, a question: what am I supposed to do with my life?  I was at a very difficult point in my life.  I was about to lose my job.  The plans I had set in motion after my last trip had been set in motion but would not be useful for a half year.",
  "I took 3.5 dry grams of Psilocybe Semilanceata.  I chewed each mushroom until it had almost entirely dissolved in my mouth before swallowing.  It took me a little over ten minutes to ingest the dose.  Onset effect began to manifest in less than twenty minutes.  Object in the room around me began to expand and contract.  The lamp mentioned at the beginning of this essay began it's snake-like behavior.",
  "A bright light filled the room around me.  It seemed like it was being emitted from a small sphere floating inches above the center of my head.  The light became almost blinding and then disappated, leaving a series of visual anamolies in its' wake.  I saw visual anamolies because that is the easiest way to explain things.  It was like my field of vision had been fractured jigsaw puzzle style.  Each small piece of fit together to make up my everything I could see.  However, within the pieces the colors seemed to separate into three distinct layers.  blue receded, the green floated in the mid-ground, while red seemed to be the closest to me.  When I closed my eyes, a single buttercup like flower spun behind my eyelids.  They were a bright orange color and they looked like flowers except that instead of pollen markings they had hieroglyphic markings that changed in a counter clockwise manner as the flowers spun clockwise.",
  "I became very uncomfortable and could not hold still.  I began thinking that I had eaten too many mushrooms and that I was going to go insane.  I tried to eat something, thinking that since I had fasted for 16 hours prior to eating the mushrooms that putting some food in my stomach might diminish their effect.  Eating was an extremely difficult undertaking.  I was overly aware of each little movement of my jaw and teeth.  It took too long to chew.  I started to feel nauseous and gave up on eating.",
  "I laid down on the floor and tried to get comfortable.  I was cold, so I covered up with a loose weave blanket and stared up through the holes in it at the room, which was constantly warping and moving.  I found that by looking up through the blanket's weave, I could actually be somewhat comfortable.  If I stared long enough, I found myself feeling physically disjointed.  As if my body were inhabiting various areas of the room I was in.  My right arm was under me.  My head was floating above me near the roof, looking down on me.  My left arm and leg were somewhere near the front door.",
  "Upon closing my eyes, four identical fractal spirals began tracing their way out into a great black void.  If I concentrated hard enough I could actually ride on one of the four as it spun off into infinity.  The difficulty was that riding the spiral too long made me dizzy.  If I was in any one of these alternate realities for too long, I grew extremely uncomfortable.  I found that it was easiest to let myself not choose any one reality and to attempt to simultaneously exist in each reality for as long as I could.  At these moments when I inhabited all of my available bodies simultaneously, were the only moments when I felt the same euphoria of my previous experience.",
  "Finally, everything calmed a little.  My fractured vision continued for nearly five hours.  But at least after several hours I was able to move around again.  At this point my best friend called to check on me.  She had known I was tripping alone and wanted to make sure I was alright.  We talked for several minutes and she asked me if I had recieved any profound insights.  I tried to explain what I was experiencing.  Finding the correct words, however, was nearly impossible.",
  "I tried to sleep, after I got off the phone.  I was not able to and so I sat trying to ascertain why I was feeling the way I was feeling.  I was still hallucinating, but my fractured vision had subsided.  I began to hear music in my head.  It was Oakenfold-esque trance music.  I interested me initially but grew repetitive.  I thought that it would be nice if the song had a new sound added to it.  Instantly, the music in my head readjusted itself with the noise I had wished it to have.  I slowly realized that I could control the music.  It was like having turn tables in my head, where I could create my own soundtrack.  The idea crossed my mind that DJ's are really the last pure reporters on the planet.  They inhabit key central nodes in the world-- New York, London, L.A., Paris, Sydney, etc.  They take music, which is essentially distilled information and re-channel it in a new direction.",
  "As I started to come down, I was overcome with an extreme since of lonliness.  It was not the typical fearful lonliness.  It was just a sense of singular purpose in the universe.  In the months since this experience, I have thought about it extensively.  I have several things about myself.  In my life, I tend to create self defeating loops for myself.  By this I mean that I attempt to manipulate sitations to my benefit, but I do it in such a way that it actually inadvertantly damages me.  I spend too much time blaming the effects in my life, without examining the causes.  Virtually all my decisions have been made to allow me to follow the path of least resistence.  This is not the way I wish to live my life."
 ],
 "erowid": {
  "id": "22350",
  "citation": " Ethan Kurtz. \"The Lamp: experience with Mushrooms - P. semilanceata (ID 22350)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22350",
  "substance": "Mushrooms - P. semilanceata",
  "views": "2473"
 }
}
