{
 "id": 14330,
 "title": "Curiously Apathetic",
 "date": {
  "submission": "2010-01-09T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Justin Time",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cytisus scoparius",
   "form": "(flowers)"
  },
  {
   "time": "1:40",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Substance: Cytisine (inhaled) in form of Sweet Broom flowers",
  "Quantity: unknown",
  "Setting: my house, alone; on full stomach; random music at medium volume in background",
  "8:35 unknown quantity (small?) smoked through a filter, taste rather pleasant",
  "+0:00 immediate cooling of body, relaxation, pleasant drowsiness",
  "+0:10 slight difficulty typing, though whether due to hand/eye discoordination or lowering of mental facilities unsure. Increase in brightness of light colours, decrease in brightness of dark colours. Fuzzy 'static' type patterns overlaying everything.",
  "+0:20 lengthening of sound, heightened awareness. Definately some reduction in mental acuity.",
  "+0:35 slightly off-balance, some tingling of extremities; feels like a sustained cigarette 'head-rush'",
  "+0:45 this is a very subtle and delicate state of being. It feels like a prelude to something bigger; but that 'something bigger' seems a long way off, whatever it is. Effects on music difficult to describe... bass sounds seem very heavy and muddled, highs sound a bit tinny. Possibly because of the 'sound lengthening' described earlier. Electronic music is not suited well to this material.",
  "+0:50 just noticed that the computer monitor is breathing. I hear a baby crying, though I can't seem to find where the sound is coming from.",
  "+1:15 whatever 'high' there was has faded to a subdued tranquility. A nice, safe, warm place of curious apathy. My eyes move to see new things, my ears move to hear new sounds; but my mind doesn't really care one way or another what my senses find. I don't think I've spoken since I dosed, which even in an empty house is unusual for me. I just feel detached, like an observer in my own body. I want to speak, but have nothing to say. Words roll through my mind, but it is, at the same time, empty. I've lost interest in everything. I know I wasn't always this way...or was I? I would say this bothers me, but for reason I can't even get up the emotion to be annoyed at this sudden loss of caring.",
  "+1:40 started drinking alcohol, just to feel something. I think the drug has worn off, but the apathy brought with it has stayed. Hopefully the booze will change that. I think it is already working. I just smiled for the first time since this started. A smug grin to myself...",
  "Comments: interesting material, nice as a mild downer; but no depth to it. I *might* explore this again at a higher dosage, or in combination with something else."
 ],
 "erowid": {
  "id": "22338",
  "citation": " Justin Time. \"Curiously Apathetic: experience with Cytisus scoparius (Scotch Broom) & Alcohol (ID 22338)\". Erowid.org. Jan 9, 2010. erowid.org/exp/22338",
  "substance": "Cytisus scoparius (Scotch Broom) & Alcohol",
  "views": "5457"
 }
}
