{
 "id": 1433,
 "title": "Trying to Return to the Source",
 "date": {
  "submission": "2003-02-07T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "joshi",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "1:00",
   "amount": "11 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "extract"
  },
  {
   "time": "4:30",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": "11 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "extract"
  },
  {
   "time": "6:00",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "extract"
  },
  {
   "time": "9:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Six times in the period of 1999-2000, I drank Ayahuasca in a ritual context, five times with one group loosely affiliated with Santo Daime, and once with another purveyor of Ayahuasca rituals.  Out of those six times, four were relatively unremarkable, with effects ranging from nausea and a vague off-balance feeling, to some kind of mediumish psychedelic drug effect.  (well, the fourth time I ate one very large mushroom at the tail end of the journey and went so far over the line as to experience myself in a totally different universe, become totally incoherent, forget my own name, and, according to some people there, try at one point to remove my clothes, but thats a different story) In any event, the other two of the six Ayahuasca experiences rate as the most spiritually meaningful experiences of my life.",
  "What was different in the circumstances?  I dont know.  Dosage?  How much of the nasty bitter stuff at the bottom of jar I got?  Im not sure.  One thing I have concluded is that for me, fasting the whole day is no good; I need to have eaten something within the previous twelve hours, or my brain doesnt have the energy to trip.  It seems fashionable to fast totally for the sake of purity, but paradoxically, this seems to dampen the spiritual dimension of the trip.",
  "Those two experiences  now unfortunately receding further into the mists of memory than I would like  were things of great beauty and importance.  I, who had gone into the ayahusca ritual as a psychonaut looking for new trips, came out spiritually remade.  I felt the very strong presence of entities, some associated with people who were in the room, some free-standing, and I felt the presence of an incredible primordial love which existed just behind this reality.   I remember sitting near the guitar-players, staring at the candles in the middle of the room, with tears streaming down my face.  Its so beautiful. I said to one of the leaders of the ritual, I had no idea that it could be so beautiful.",
  "The second of the good two experiences occurred in September, 1999.  Shortly thereafter, I moved out of the country (the Netherlands) where such rituals were available.  For the subsequent two and a half years, I did not drink Ayahuasca.  It seemed to me too spiritually powerful a substance to do outside of a ritual context, and despite my knowing some trippers, I didnt really feel like they were necessarily the right people to do it with.",
  "But enough time went by, and I really came to feel that I needed to re-connect with those spiritual energies.  Surely, other psychedelics can bring one to similar spaces, but I find that Ayahuasca is deeply special; there is nothing like it.  Smoked N,N-DMT, is similar in certain regards, but mainly those are the strongest and most characteristic psychedelic effects  not the intensely spiritual ones, which take longer to develop than such a trip lasts.",
  "So my friend S and I went up to my step-fathers house in Vermont last weekend to drink.  I still refuse to do the substance in the confines of city dwellings  in a small house in the woods is better, though a church is ideal.",
  "I had prepared 27g of P. harmala by slow-cooking and then boiling in an approximately 50/50 vinegar/water mix, and he had prepared about 2 ounces of M. hostilis rootbark by boiling five times in lemon juice/water.  Five was a bit of overkill, as the last boiling was basically clear.  In preparation, we both took 1.2 g of lecithin the night before the experience, and another 1.2 g the morning of the experience, as is recommended in Psychedelic Shamanism to reduce nausea.",
  "We ate breakfast at around 11AM, and started our trip at 3:00.  In general, I am a fan of tripping during the day so as to more greatly emphasize the various positive qualities, but I have come to believe that in fact the real work of an Ayahuasca experience must be done after sundown.  I feel that the darkness allows one to focus and mediate more fully on the spiritual aspects of the trip.  So our starting time was the first mistake of the trip.  I think that, while definitely a positive and powerful psychedelic experience, this Ayahuasca trip still did not truly reach the heights of my previous experiences, and I think the mistakes that we made were mainly logistic/dosage related.",
  "Before starting we had completely rearranged the house so as to try to make a sacred space, taking out the furniture, putting up Christmas lights, putting out flowers and cloths, and covering relatively immovable but potentially distracting things such as the TV with sheets.  I will just say now that this aspect of preparation was an unqualified success.  I have read trip reports of very difficult experiences with ayahuasca, but I have never myself seen one; perhaps this is due to proper attention being given to the surroundings in which the trip was to take place  certainly the chapel in which I used to drink was perfect for the occasion.",
  "Anyway, one of the other first problems was determining the dose of harmala.  I had put some salt in the brew, in an attempt to get the alkaloids to precipitate.  Something definitely dropped down there, and we drank each a cup containing some of this sludge.  Basically, this was to be the only good harmala dose we got.  Perhaps next time I will make more, or combine the substances like the Indians do.   As it was, we sort of ran out later on, even though I supposedly brewed nine doses.",
  "After each drinking our harmala, I proceeded to smoke some marijuana to combat the nausea that I knew would come.  S really doesnt like MJ, so he abstained.  We continued to prepare the space, and I did some yoga (which combines very well with cannabis, but isnt, in my experience, really possible on a strong-dose Ayahuasca trip) until it was 4PM, when we each drank one fifth of the hostilis brew, or about 11g.  We proceeded to go outside to lie on the grass.  It was slightly too cold when the wind picked up, but the sun warmed us well when it wasnt behind clouds.",
  "The trip came on fast.  We sat, silently, meditating and watching the sky.  I noticed that there was this energylike substance surrounding the clouds, and I saw the clouds themselves transform in the sky; I saw one set of clouds that became a large skeleton, covering the entire sky but lightly.  I closed my eyes and began to see patterns, especially when I turned my head back and faced the sun.  Gone were the usual closed-eye visual colors, to be replaced with an amazing set of browns beiges and golds, all from the light of the sun.  Lying there, throat-singing, with the sunlight coming down on me, I had what was to turn out to be the most powerful spiritual experience of the trip.  I had, at one point, looking at the superb blue of the sky, a flashback to my most powerful Salvia experience; I took it to be a sign that Ayahuasca was telling me to go back to that world today.",
  "I felt something resembling the usual nausea when I moved, and I felt  as usual, again  very weak consequently.  S threw up, but I didnt.  I was eating crystallized ginger to help with the nausea.  It may have.  I certainly cant tell whether or not our predosing with lecethin helped.  If it did, it wasnt by a lot.",
  "Eventually it became too cold and we retreated indoors.  We listened to some music, (including a song I had written for the occasion, which seems to have been just perfect and I think I want to make a whole album just like that, but thats a different story) and as some of the synth parts in the Twisted compilation Eclipse built up, I felt as though we were getting there, becoming.... that as the sun went down, it would be time to truly delve within, and I was excited.  While listening to the music S had the fantasy/illusion/dream that he was playing some kind of computer game in which the purpose was to go around the world and try to get everyone to drink Ayahuasca, and that his score was based on what percentage of a given population was drinking Ayahuasca.  The flowers we put out were the most beautiful flowers I have ever seen.",
  "The sun finally went down, later than I expected.  By the time we drank again, at about 7:30 or so, our trip effects had receded.  I think this was a crucial problem.  I think that it is important to time the doses so as to stay in the space, otherwise one loses the momentum that one needs to get to that certain spiritual point.  What made matters worse was that apparently we did not drink enough harmala with this dose.  The idea was that we would drink more harmala and more hostilis.  We were exited when we drank the hostilis, because we felt that there was much more bitter sludge in those cups than the earlier ones.  Yet, at 9:00, we were suspiciously not tripping.  We decided to remedy the situation by splitting the remaining 11g of hostilis and harmala.",
  "At 9:30, we were about to eat some mushrooms (with some trepidation, cf the harmala/mushroom experience I mention above) to try to salvage something of the experience, when finally it started working again.",
  "It was good, it was right, but it wasnt perfect.  I sat, and I sang, hoping that S would join me. He turns out to be hopelessly tone deaf, so... oh well.  I did more throat-singing, and I some of the Ayahuasca hymns that I remembered from the ritual days. (specifically, the ones in English, though I remember the chorus of the Portugese one where the chorus is just ay-ay-ay-ay ay-ahuasca, ay-ay-ay-ay ay-ahuasca, etc) I came close during the singing to the feelings that I had had before, and I certainly was able to engage those feelings, but they did not come as strongly or forcefully or overwhelmingly as I had remembered.  Furthermore, I had no particular sense of the presence of the entities.  It was a valiant and not entirely unsuccessful attempt, but I didnt quite return to the source.  The timing was bad and the dose still didnt seem right.  S wasnt nauseous at all  which would be great if he had been tripping hard, but since he hadnt, one is given to wonder... ",
  "I guess the object lesson here is that although one is compelled to try to drink only the active alkaloids and only just as much as required in order to mimimize nausea, can actually backfire and result in the trip not working.  The native brews usually contain way too much beta-carbolines; maybe they actually know what theyre doing?  Hmm...",
  "Anyway, I decided that if Ayahuasca hadnt really delivered, I wouldnt follow its suggestion and smoke Salvia. Or perhaps that was just a rationalization of the very healthy fear that I cultivate of that substance.  But we did decide to push on, once more into the breach, and smoke some 5MeO-DMT.",
  "Now, at this point, I guess about midnight or so, we were not completely strongly under the influence of harmala, but not completely out either.  I cant say whether the harmala potentiated the 5MeO with respect to strength of dose, as I always just eyeball it.  (note to readers: dont try this at home, or rather, if you do try eyeballing 5MeO, realize that the process requires FAR, FAR less of the substance than you would imagine, and serious caution, especially if you are combining it with MAOIs, is in order) However, harmala did appear to lengthen the 5MeO trip for both of us.  I wish the trip had had more of a spiritual quality, but there is a degree of cosmic mind-bendingness to the 5MeO trip which seems to me somewhat antithetical to the focus and subtlety required for the true mystical experience to come through.  Nevertheless it did certainly pack a certain degree of psychedelic wallop that seemed to be required at the time.  S also asked to hear my song again, and again it seemed pretty good (and thats the acid test, as it were... :) ).  Finally, as we came down from the MeO trips (taking two hits each which lasted for about half-hour/forty minutes total), it was time to smoke some more weed, make macaroni and cheese, and go to bed.",
  "Congratulations if you made it this far.  I guess the various take home lessons of this report are that powerful positive spiritual experiences with Ayahusca are possible, but that a number of things  environment, dosage, timing  have to go right in order for this to happen.  Another is that I found that 5MeO-DMT, while hugely powerful, does not mimic a proper Ayahuasca experience.  Another is that having too much harmala might not be so bad, at least if too much is not taken very far to extremes.",
  "My opinion that Ayahuasca is really the best psychedelic  despite the nausea, despite the fickleness, despite the taste  hasnt changed.  I hope that some of you can also realize what a special gift the drink really is."
 ],
 "erowid": {
  "id": "14424",
  "citation": " joshi. \"Trying to Return to the Source: experience with Syrian Rue, M. hostilis, Cannabis & 5-MeO-DMT (ID 14424)\". Erowid.org. Feb 7, 2003. erowid.org/exp/14424",
  "substance": "Syrian Rue, M. hostilis, Cannabis & 5-MeO-DMT",
  "views": "21681"
 }
}
