{
 "id": 14339,
 "title": "God in Color",
 "date": {
  "submission": "2004-07-23T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dope-E",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.0 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "2C-T-2",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "A friend of mine approached me one afternoon with 2C-T-2 out of the blue. We proceeded to hang out the whole time at my house. We got cartoons, dance music and plenty of Herb. He told me to start with a low dose of about 7 mg. He told me I probably wouldn't get high at first but if I started slow I wouldn't get nauseaus. After about an hour which we filled getting pretty much baked, He put about 10 - 15 mgs on a mirror and told me to lick it. Now in hind sight it wasn't that smart of an idea but I took a dollar bill rolled it up and snorted it.",
  "Less then one second after I had I exhaled, my brain felt like it was expanding to twice it's size. Within minutes I could feel my body winding up like a spring, I was waiting to just snap. Maybe 5 minutes maybe 15 minutes later it was like I blinked and colors started flashing and wasn't long until I noticed the walls were breathing/rippling. More like an intense mushroom visuals then acid breathing I would say. I remember reading a (black and white) Richard Gorey Comic book and believing the whole time it was in color. The first 45 minutes of visuals were so intense I could feel myself falling into them. I had to take a reality check with the cartoons on t.v. to get a grasp on things. When I went out to smoke a cigerrete during the hardcore peak, I was distinctly seeing lights on the horizons like an acid high and the moving lights. Maybe it was all the pot smoking before during and after but when the high was gone (about 6 hours later) I didn't really miss it. I felt completley satisfied and almost.... relieved?, maybe but I think it was more like I had a lot to reflect on.",
  "I can say that I felt almost spiritually high, that even compared to some other strong Hallucingegens (namely acid, foxy, MDMA, mushrooms and LSD) I felt I had reached an even higher 'state of being'",
  "Some good sleep a shower and good breakfast and I almost could have forgot about the exciting night before. Well maybe not 'forget' it but I had no physical ailments."
 ],
 "erowid": {
  "id": "22358",
  "citation": " Dope-E. \"God in Color: experience with 2C-T-2 (ID 22358)\". Erowid.org. Jul 23, 2004. erowid.org/exp/22358",
  "substance": "2C-T-2",
  "views": "6555"
 }
}
