{
 "id": 14349,
 "title": "Getting Off on Native Krathom",
 "date": {
  "submission": "2004-03-19T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Pike",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 leaves",
   "administration": "buccal",
   "substance": "Kratom",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>I was doing research on this leaf and came across the vault. I live in Thailand where this stuff grows naturally, and eat it from time to time, mostly when my Thai friends offer it.",
  "I've read of other experiences with this leaf on the Internet and the dosages people are taking are way beyond what anyone here takes. Maybe the cultivated strains are weaker. Anyway I do quite well with just one half or one leaf. They split down the center vein quite easily, so it's easy to take it in half-leaf doses.",
  "I usually start getting a buzz in about 15 minutes, and am fully off in 30-45 minutes. Some folks compare it to opium, and I guess that's fair if you're talking about high-quality chandoo containing a minimum of opium and maximum of papaverine and other stimulating alkaloids in O. Anyway for me krathom is primarily stimulating in its effect. I often eat a half leaf or more when embarking on a long drive, to keep me alert and make the trip a lot more interesting.",
  "Basically it feels like a mild dose of E, with less jitters. In fact no jitters, just mild elation and alertness. It wears off in about two hours and there is virtually no crash (just a tad, less than for caffeine I'd say).",
  "It's a shame it's illegal in Thailand, as all the truck drivers and dock workers that used to eat krathom to make a day's work go better are now on ya ba - cheap amphetamines that are causing addiction and violent incidents, etc. Krathom doesn't seem addictive at all, I'm able to take it daily for a week then not at all for six months or more.</p>"
 ],
 "erowid": {
  "id": "22387",
  "citation": " Pike. \"Getting Off on Native Krathom: experience with Kratom (ID 22387)\". Erowid.org. Mar 19, 2004. erowid.org/exp/22387",
  "substance": "Kratom",
  "views": "13245"
 }
}
