{
 "title": "Toxicity After Infrequent Use",
 "author": "Meat Nipples",
 "citation": " Meat Nipples. \"Toxicity After Infrequent Use: experience with 1,4-Butanediol (ID 14352)\". Erowid.org. May 1, 2002. erowid.org/exp/14352",
 "substance": "1,4-Butanediol",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "7.5 ml",
   "oral",
   "1,4-Butanediol",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "2001",
   "14352",
   "Male",
   "",
   "Not Given",
   "May 1, 2002",
   "18001",
   " "
  ]
 ],
 "report": "<p>\nI wrote this over a year ago and find it as pertinent as ever:</p><p>Ive recently posted on various message boards about 1,4 Butanediol and have come to a disappointing conclusion.  I read a certain persons toxicity paper on 14BD and discredited it because I heard he had abused the drug for a very long time (sorry about that).  Unfortunately, it seems I may have been a bit bull-headed.  1,4 Butanediol is poisonous.  I have done it in moderate doses 2-3 times a week for the last month, and I started to show signs of liver and kidney distress over the weekend.  The first couple of times I tried 14BD there was a complete lack of toxic effects.  I could easily do 5ml and wake up the next day feeling refreshed and healthy.  Then I started to do a large booster dose a couple hours after my first dose.  This is when I first started to notice slight stomach discomfort and upper respiratory congestion the next day.  This was very subtle however and did not concern me too much.  I laid off the 14BD for an entire week and tried it two nights in a row the next week.  The night after, I had unpleasant withdrawal-type effects; sleeplessness, agitation, paranoia, and a sense that I would need to do more 14BD to feel normal.  This was after only a couple of weeks of infrequent experimentation with it.</p><p>Well, I tried it again last week, two nights in a row, and had these same withdrawal problems only accompanied by symptoms of liver and kidney toxicity.  I felt sick, had cloudy bloodshot eyes, extreme upper respiratory congestion (woke up coughing flem like mad), one very dark, painful urination followed by frequent crystal clear urinations (at one point I urinated five times in an hour), abnormally oily skin and hair (by the end of the day my hair was disgusting), and pain in my upper right abdomen.</p><p>These symptoms passed after one day and now I feel fine.  My friend, though he has never dosed more than once in a night, also reported some of these symptoms and is getting rid of his supply.  I know that I do not lack the liver enzymes that convert 14BD into GHB because I have a rather high tolerance to alcohol though I rarely drink (possibly from a family history of alcoholism on my father's side; probably shouldn't be messing with this stuff anyway).  I had split a pint with my friend, each having about 250ml.  I have done less than half my supply (-125ml!!!) in a month and I have given quite a bit away to other friends.  This is not much considering there are reports of people doing this stuff everyday!</p><p>I strongly discourage anyone from experimenting with 14BD.  I have never tried GHB and can therefore make no comparisons, other than anecdotal evidence suggesting that 14BD is not a good GHB substitute is growing at a scary rate.  I have experimented with 'hard drugs' such as cocaine and opiates and they did not pose near the addiction potential or physical threat that Butanediol does.  I am a perfectly healthy 18-year-old male with no pre-existing medical conditions that could have contributed to my reaction to this substance.  I am 6'1', 155 lbs, and exercise frequently.  I can only hope that I havent caused permanent damage, though I doubt it given the short duration of toxic symptoms.</p><p>Please, do not take a chance on this stuff.  The high is not euphoric.  It is pleasant but not pleasant enough to risk poisoning yourself. There is nothing spiritual or intellectual about it.  It is NOT a GOOD DRUG.  Either abstain completely (advisable) or break the law and make your own GHB (not advisable).  If you obtain a large amount, you will be wasting your money because your health will dictate that you get rid of it, as it has with me.  I don't know what else to say, except have fun and be careful.</p><p>Its been a while and my liver seems to be fine.  My 14BD experience gave me a frightening first hand account of the purely physical side of addiction.  I was by no means addicted, but my body craved 14BD and became sick when I stopped using it.  Even after just 2 nights in a row.  Please stay away from this crap.  Also notice how some people who say that its perfectly safe continually refer to it as a product.  Seems someone may have a vested interest</p>"
}
