{
 "id": 14352,
 "title": "Overdosing is no Fun",
 "date": {
  "submission": "2008-03-05T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Youngbuck",
  "gender": "Female",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "AMT",
   "form": "powder/crystals"
  },
  {
   "time": "2:00",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "AMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "[Erowid Note: 450 mgs of AMT is considered an extremely high dose, see AMT Dose Chart]",
  "Setting: a late monday night in my dorm at my college",
  "I take about 150mg and wait 2 hours and still feel nothing I have tripped on AMT twice beforee this and I loved it. So after waiting two hours I take some more totaling 450mg. And in about an hour my life is about to take a drastic turn of the worst.",
  "After all 450mg kicked in I was trippin balls everything was moving and I was so happy and swaeting bullets but overall I felt ok. I ran around the halls in my dorms room looking for a party and some weed. But I was so fucked up I was scareming at the top of lungs and security came. I started cursing everyone and telling them that were all going to die tonight and just sscaring the hell out of people. I was breaking fire alarms I was out of control.",
  "Eventually security got me back to my room and tried to calm me down that is I lite a Cigg in my room and security took it from me and I punched the guy in the face for taking my Cigg. Next thing the police get there and they are restraing me and holding me down. ..... I must have passed out for a good hour and I woke up in the hopsital I freaked out I was starpped down to a bed and had and IV in me and there were treatng me of a LSD overdoes when I had taken AMT which no one had ever herd of.",
  "Well after I got out the hospital I was kicked out of college and my parents kicked me out and now I sleep where ever I can.",
  "AMT takes a long time to kick in. I should have waited at least 3 hours before taking anymore. Blacking out and waking up in a hospital is no fun.",
  "This is about a week after and I have noticied no real bad effects from my overdose really strabge I thought I would be fucked up for life after taking a research chemical Stay safe and keep trippin :)"
 ],
 "erowid": {
  "id": "22395",
  "citation": " Youngbuck. \"Overdosing is no Fun: experience with AMT (ID 22395)\". Erowid.org. Mar 5, 2008. erowid.org/exp/22395",
  "substance": "AMT",
  "views": "8124"
 }
}
