{
 "id": 14351,
 "title": "Walk Don't Run",
 "date": {
  "submission": "2003-09-30T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Starbucks",
  "gender": "Male",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "40",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-C",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I attempted to weigh out 40mg of 2CC, but frankly my scale is not sufficiently accurate below 100mg, so in the end I decided to eye ball my dose by laying out 100mg and dividing it into slightly uneven halves, and I placed the smaller 1/2 into a shot glass with some orange juice.",
  "Just over an hour prior to this I had eaten a small banana, and drank some ginger tea (though I anticipated no nausea, I was being cautious).",
  "I downed the shot, it's taste was not good, but was quickly washed away with more juice. My mind set at this time was dare I say normal, basically happy but not especially so, some minor concern over a possible change of job, but no major issues on my mind.",
  "I was surprised to feel 1st alerts within 20mins of ingestion.",
  "Over the next 25-30mins the effects grew steadily and I began to get some very feint CEVs, and a slight difference in my vision, but neither substantial.",
  "As the experience proceeded it was pleasant, calm, and comfortable, with no bad feelings and no trace of nausea. But that was it, nice but certainly mild. Indeed, approx 2 hours after ingestion I decided there was no reason not to return a missed call from a potential employer.",
  "I found it to be like 2Ci without much euphoria and 2CT2 without much of a sensual element.",
  "I would say that it overall lacked intensity and maybe was a little too subtle for my tastes. I wasn't disappointed because I wasn't expecting much. For me next time I use this will be in combination with other things, as in itself it seemed to lack impact. That said I think it would be a good for people who have little or no experience with psychedelics (or phenethlyamines etc) as an easy intro into the possibilities, a stroll through the potential, rather than sprinting headlong into the more challenging substances."
 ],
 "erowid": {
  "id": "22390",
  "citation": " Starbucks. \"Walk Don't Run: experience with 2C-C (ID 22390)\". Erowid.org. Sep 30, 2003. erowid.org/exp/22390",
  "substance": "2C-C",
  "views": "16764"
 }
}
