{
 "id": 14362,
 "title": "Learning My Health and Sanity Are Important",
 "date": {
  "submission": "2004-10-27T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Anonymous(UK)",
  "gender": "Male",
  "weight": "80 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "[Erowid Warning: While substituted phenylpiperazine and benzylpiperazines are known compounds used recreationally, plain non-substituted phenylpiperazine -- mistakenly equated with BZP in this report -- is not.]",
  "Recently having just ordered some 1-phenylpiperazine Hydrochloride 97% aka BZP [although hard (in terms of convincing) to get, still legal in the UK], I decided to try the substance straight away (having been reading everything on it that the web has to offer). It was late morning and I had just essentially woken up.",
  "12:45pm",
  "As I had no way of accurately measuring the chemical and knowing that I was intending somewhere between 50 - 200mg I decided to fill a gelatine capsule which I estimated as 500mg and then empty it out cut it up into 5 sections and ingested just the one, I.e hopefully 100mg. I think the main problem was either the dosage was too high (accidently) and/or I had a completely empty stomach.",
  "1:00pm",
  "Feeling very panicky now, pupils very dilated, nausea and very hot. I was very worried I was having a bad reaction (like you hear about with mdma very rarely), and seeing as I have never actually had any kind of amphetamine or ecstacy I thought that this might be quite possible. Anyway, the next two hours were the worst, I had to strip down completely and use lots of cold flannels to try to cool myself down as well as controlling my water intake (not too much, not too little).",
  "3:00pm",
  "Start to feel a bit better, but still very dizzy.",
  "5:00pm",
  "It seems any positive effects are happening now, feel slightly speedy but in a more controllable way.",
  "12:00 (midnight)",
  "now feeling close to baseline but have been fighting what feels like semi-flu/cold like symptoms for the last few hours. Mainly headache, feeling flushed and dizzy. Pupils also still dilated.",
  "3:00am",
  "I can't say I feel in a completely normal mind frame but I feel tired and think I will finally be able to sleep. I just hope tomorrow morning is not brought with a migraine [as read about in other BZP reports] as right now I don't appear to have any kind of headache.",
  "Conclusion:",
  "If I am to try BZP again I would like to firstly have a very full stomach and secondly in a dose thats more like 20-50mg and NO MORE, also a proper weight measured by an accurate balance mainly for reasurance.",
  "Also a side note, this experience may well have been a positive one because the first 2 hours on this drug showed me how important my sanity and health are to me and led me towards different thoughts about my personal use of such chemicals."
 ],
 "erowid": {
  "id": "22420",
  "citation": " Anonymous(UK). \"Learning My Health and Sanity Are Important: experience with Piperazines (ID 22420)\". Erowid.org. Oct 27, 2004. erowid.org/exp/22420",
  "substance": "Piperazines",
  "views": "15637"
 }
}
