{
 "id": 14376,
 "title": "Speed-Tripping",
 "date": {
  "submission": "2003-05-18T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Trip-Head",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  }
 ],
 "report": [
  "I was going to a local fair with some friends.  Rides, concerts, that sorta thing.  Well, my friends E and A bought a 20mg capsule of 2C-I from me and they really wanted me to trip with them.  I had tripped on 20mg of 2C-I just two nights before, but I too wanted to trip with them.  So, figuring I was with friends for this trip, I decided to experiment with a heavy dose, 40mg.",
  "All three of us began to trip about the same time.  We rode a couple rides and discovered that A) fair rides are fun when tripping, B) guys/girls are cuter when tripping, C) I was beginning to trip harder than E and A.",
  "So after the fair closed, we hung out at this park near by and watched these skaters skateboard around.  It was great, all the skaters leaving trails and stuff.  Then they started jumping off a bridge into these bushes and we kept cheering 'em on because the trails looked so cool.",
  "Then we rode home to E's and house chilled out.  A started playing with my cell phone and her cell phone acting like they were glowsticks.  E played with cigarettes.",
  "At some point I hit a new level in my trip and I was laying under some tree branches.  I thought I felt a drop of water and asked out loud, 'Is it raining?'  I never heard A say no.  Suddenly drops of light started falling out of the branches and it felt like I was beginning to fly up into the branches.  The feeling was euphoric, but not the artificial drug euphoric.  A who was worried, poked me and snapped me out of it, but I didn't hold it against her.  She knew that I had taken more and was worried about me.  In fact, I gave her a huge hug just because I was so happy that I had people with me who had my back.",
  "My visuals were much faster paced and complex than on 20mg.  I didn't experience the ego-loss or bad trip that a lot of people have described on 40mg.  Trails were longer, and I had a sort of cross-over in the visuals and body feel.  I was looking at some concrete and it seemed to shape itself into various lizard looking patters.  When I put my hand on the concrete so I could watch closer, I gasped to discover that I FELT lizards creeping and crawling beneath my hand.  I had this experience many times during the night.",
  "Towards the end of the trip, A, E, and I curled up together on E's bed and started talking about stuff.  Occasionally, some song playing on the radio would catch our attention and we'd all become quiet without anyone saying, 'Shhh...listen' or something similar.  Then we'd just start talking again.  At some point, we were all laying on E's bed looking out the window watching the ground act as if it were the sea, rising and falling, and for me, actually splashing in some parts, and I could hear the sea.",
  "As we came down, we felt like we had tripped for days, in fact for them it was only 6 hours.  My trip though, was a different story.  At the 6 hour mark, the body feeling had gone away and I had stopped hearing things, and music sounded normal enough.  But visual wise, things were still moving for the next four days.  I could sit down, look at a piece of wood paneling, and it's start to move slowly.  If I looked away and looked back, it'd be normal unless I stared a good 10-20 seconds.  I had CEV's all this time also.  While not annoying or disturbing, I think I'm going to let the 2C-I be for some time.  At least till this stuff gets out of my system.  :-)"
 ],
 "erowid": {
  "id": "22463",
  "citation": " Trip-Head. \"Speed-Tripping: experience with 2C-I (ID 22463)\". Erowid.org. May 18, 2003. erowid.org/exp/22463",
  "substance": "2C-I",
  "views": "7606"
 }
}
