{
 "id": 14387,
 "title": "Smooth Easy Ride to a Mental Mugging",
 "date": {
  "submission": "2006-08-22T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Ratherdeep",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(capsule)"
  },
  {
   "time": " T+ 12:00",
   "amount": "1 tablet",
   "administration": "insufflated",
   "substance": "Caffeine",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>I was until very recently what is termed 'Straight Edge', I didn't so much as smoke or drink. I am really just beginning to abuse drugs of any sort, but I resolve to start at the top and work down. My drug experiences thus far are as follows: a disgusting amount of DXM abuse, a Dramamine trip, and Adderall. I am, or like to think of myself as a safe abuser, as safe as it can be anyway. Today I tried Adderall, I got it from a friend who has ADD, it was a lot less than what I expected and a lot more than what I wanted. Speaking with others I knew who had done it I was rather confused as to what effects it might have, some said it calmed them down, others said it sped them up.",
  "I got the pills, which were Adderall XRC [sic], 25 mg capsules, and following the advice of my benefactor I ate them at 15 minute intervals. I would like to add here that I cracked a small hole in one of them to make sure the telltale ball thingys were actually inside and I wasn't just getting burned. I didn't notice any change whatsoever, however small in either mentality or physical feeling for quite some time. After I had decided that they weren't going to do anything and more or less forgotten I was astounded by how horrible I felt, like absolute garbage. I got an excuse from gym and basically just stood there bouncing a ball up and down.",
  "It basically killed my personality at first, I had little motivation, no sense of humour, no spontaneity, nothing, I just kind of was, and didn't have any trouble with not thinking about   anything whatsoever. After a while the nausea wore off, I basically just became sunken really, no unnecessary movement or speech, I did my assignments quickly and diligently without pause for joking or looking out the window, which is usually all I do. It was really just a smooth feeling, it kind of flowed, like the Dramamine trip I had was harshly chemical and DXM can be shocking, Amphetamine felt rather like drinking melted chocolate after a diet of hard liqour. This smooth alright feeling lasted for 4 hours at the most, preceded by 2 hours of sleepy lousiness and followed by...",
  "Once this feeling went away I was more or less normal again, I thought my trip was over and I concluded that it wasn't worth daily or even weekly use, perhaps just on exam days. An hour or two later I noticed a marked ache in my jaw, I realized that whenever I wasn't speaking or eating my teeth were clamped shut with borderline violent force, the tendons in my wrists visibly twitched, I was excruciatingly overheated and my throat felt numb.",
  "A terrible case of cotton mouth developed, my tongue feels like wood and is white and scratchy, any moisture which finds it's way into my mouth is immediately sucked up again. It has been about 18 hours since I took it and the symptoms show no sign of alleviation. This second trip, which snuck up on me from behind and beat me senseless has resulted in a pounding headache, jitters, and a tendency towards quick, violent, repetitive motion. I do feel very very wired though. I don't believe my heart rate accelerated beyond what caffeine does at any point during the amphetamine trip.",
  "I feel it is relevant to include that I had a slight afterglow from a 300 mg dose of DXM the day before, as well as the insufflations of one caffeine pill 12 hours after amphetamines. I believe the dose was too high to be pleasant. I am a recreational drug user and Adderall does not seem to be very recreational, it is more of a utility drug.</p>"
 ],
 "erowid": {
  "id": "22497",
  "citation": " Ratherdeep. \"Smooth Easy Ride to a Mental Mugging: experience with Amphetamines (ID 22497)\". Erowid.org. Aug 22, 2006. erowid.org/exp/22497",
  "substance": "Amphetamines",
  "views": "7923"
 }
}
