{
 "id": 14398,
 "title": "Screaming Frenzy",
 "date": {
  "submission": "2003-03-31T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Doctor B",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. semilanceata"
  }
 ],
 "report": [
  "This report is quite long ..",
  "Firstly a little background information about me  20-year-old male living with my parents in a small leafy town in the north of England. Early last year I was diagnosed with a schizo - affective disorder and spent a period of 6 months in a mental institution. I have been out of hospital for around 8 months now and (through the use of medication) I live a normal life and suffer none of the symptoms which got me institutionalised. Currently taking the anti psychotic risperidone and also sleeping tablets, zopiclone.",
  "I have always been interested in altered states of mind and in the past I have achieved altered states through the heavy daily use of marijuana, dxm, ketamine, caffeine, codeine and occasionally ecstasy, which a lot of my friends believe caused my mental situation as I suffered from all the hallmarks of cannabis psychosis. Anyway, I digress",
  "A few months ago I was offered some shrooms by a dealer friend, and although it is common sense that a person of my fragile mind should never touch psycedelics, it thought fuck it and purchased just over three grams of what I was informed were liberty cap magic mushrooms. I know some people will wonder why I would risk my sanity for the sake of a mushroom trip, but the honest answer is I dont really care! For me, suffering a mental illness wasnt all bad, apart from a profound paranoia, I was just a happy go lucky soul oblivious to all world around me, and to this day i remain a happy person. My philosophy is simple  Im going to die one day so I might as well have as much fun as possible in before I croak.",
  "Unfortunately I had to wait a few weeks until my parents had gone on holiday before I could trip, so I spent the time reading Erowid's trip reports and generally just learning as much as I could about the shrooms.",
  "Eventually the time came for my parents to go on holiday, so I was left with only my older sister to deal with. My sister is an air hostess and works long hours, so when I found out that she was working on the Saturday after my parents went away I knew that was the time to trip.",
  "My sister went to work at some godawful hour in the morning and wasnt due home till around 6pm, so I invited three friends (whom I will refer to as S, W, and A) round to accompany me while I tripped. These people were actually my workmates, not my usual gang of friends, but we had been meaning to get together for a while and I thought this was the perfect opportunity to do it.",
  "They arrived around 11am and we spent an hour or so drinking beer and just chatting, when I decided it was time to drop the shrooms. My friends all advised me that I shouldnt really be doing it, but they knew that once I get an idea in my head theres no changing my mind. Reluctantly, they agreed to sit for me while I tripped.",
  "At about 12:30 I ate all the shrooms, chewing then swallowing, and I actually quite enjoyed the taste. I got myself a beer and sat back and waited for the show.",
  "After around 40 mins I suddenly tipped over from a sitting position onto my side, and thats when I realised the shrooms had kicked in. Much to my friends amusement I had lost nearly all control of my body, I sat and giggled insanely whilst unable to sit up straight. I was astounded at how suddenly the effects had come on, but at this early stage I wasnt experiencing any visuals, I just felt heavily drunk. At this time I was sitting on the floor of my bedroom, S and A were sat on the bed and W was sitting in my chair. They were all quite drunk. The next thing I remember is I was suddenly sitting on my bed and S and W were now on the floor. 30 minutes and passed and to this day I have absolutely no memory of that lost half hour.",
  "As I came round  I looked around I noticed that everything had taken on a green and red outline, which looked exactly like one of those 3D pictures you need red and green 3D glasses to look at. I was tripping hard. As I was talking to W his eyes started to move around his head and his facial features exchanged positions, his eyes were on his jaw and his lips were on his forehead. This amused me greatly and I was enjoying it immensely when W lost all colour and turned black and white.  I was thoroughly enjoying the trip up to this point, but things quickly went downhill",
  "I remember sitting on my bed and getting increasingly annoyed at the music that was playing, so I got up and went and turned my stereo off. Just as I had re positioned myself on the bed, the music started again and I had to get up and turn it off. This annoyed me greatly as i thought my friends kept turning the stereo on, but I learned later that I had hallucinated the whole thing. The saga went on for about ten minutes as I repeatedly turned the stereo off only for it to start playing again. This eventually stopped happening and I was relieved. The trip was becoming a bit intense. I became very offense, insulting my friends then immediately apologising afterwards. I felt my mind split into two separate personalities, one evil and one good. The evil side of me kept calling W a fat bastard and then the good side of  me would immediately apologise and blame it on the evil side. I was genuionley horrified that I was being so nasty to my friend, but unfortunately I had no control over what I was saying. Thankfully my friend was cool about it and he knew what I was doing was due to the drugs.  Again, I completely zoned out for another 10 minutes or so.",
  "Next thing I knew I was stood in front of the bathroom mirror screaming at my self and laughing uncontrollably as my face morphed into that of an old man, then back to a young child. I clambered into the bath and lay there for a few moments. Suddenly I became intensely paranoid that my sister would soon be home any minute. I was a gibbering wreck, in no fit state to deal with my sister! I asked S the time and he informed me it was about 2:30. A entered the bathroom and she immediately enquired as to why I had a trickle of blood running from my nose, to which I had no reply and I still have no idea where it came from. Again  I asked the time, about 30 seconds after I had last asked. I had no concept of time, and for the next hour or so I was asking my friends every few minutes what the time was. I was becomingly increasingly distressed and at one point I punched S in face, which was a bad idea considering he is 66 and about 19 stone! Thankfully S realised that the shrooms had fucked me up and I couldnt control myself, so he didnt retaliate or hit me back. I am so relived to this day that I had such understanding friends, because with the wrong bunch of people things would have gotten very ugly.",
  "After the punching incident, my friends decided that I needed to lie down and chill out. S and W went downstairs to smoke a joint, while A helped me into bed and sat with me. She sat andf stroked my head while I tried to explain all that was going on in my head. I felt an intense affinity with A, and I felt incredibly connected to her, as though we were the only two people in the world and we were brought together at this place by fate. After the trip A and I started dating, but we only lasted a few months.",
  "After about 30 minutes A left me to rest and went downstairs. I remember lying in bed with my eyes closed, yet all I could see was a riot of colours and lights. At this point I became very introspective. I experienced some very profound thoughts, and I suddenly became very insightful. I remember having a conversation with some mystical being. We discussed my mental health problems and the voice explained to me that I shouldnt be ashamed of my problems and that if I accepted who I was then I would be peaceful. This being helped put to rest a lot of my inner demons and made feel comfortable with myself.",
  "I must have eventually fallen asleep and was awoken at about 5:30 by my friends who were leaving. I was still tripping at this point and I felt the need to go outside. After my friends left I had a walk up to the local playing field where some of my other friends were playing football. The whole world was distorted and everything still had the green/red aura around it.",
  "I was having a lot of fun now, and I spent the rest of the evening chilling with my mates lying in the field explaining to them what I was experiencing. At around 8:30 I went home. My sister was back and she enquired what Id been doing all and I told her that Id had a few friends round and Id got slightly drunk. She (and my entire family) strongly disapprove of drugs, so I omitted that part of my day from the story!",
  "At about 9:30 I was feeing very tired so I went upstairs and got into bed. I must have drifted off immediately because that is my last memory of that day.",
  "The next day I felt relatively normal, although I noticed my senses were slightly heightened and colours were brighter than usual.",
  "A few days later I spoke to A,S and W and they told me that I had frightened them greatly to the point of them nearly taking me to hospital. Apparently I had been in a drug frenzy of epic proportions!",
  "In summary, I would say this had been a good trip. Although I had some frightening experiences, it was all worth it for the good experiences I had. I believe the shrooms have made me a better person and am thankful for the help of the mysterious being who helped from a bad trip into a good one.",
  "As a final note, I was unsure as to whether my anti psychotics would affect my trip, but I dont think they did.  If you are person who suffers from mental problems perhaps shrooms arent a good idea, perhaps I was lucky that they didnt fuck me up completely but personally, I would risk my sanity again."
 ],
 "erowid": {
  "id": "22540",
  "citation": " Doctor B. \"Screaming Frenzy: experience with Mushrooms (P. semilanceata) (ID 22540)\". Erowid.org. Mar 31, 2003. erowid.org/exp/22540",
  "substance": "Mushrooms (P. semilanceata)",
  "views": "7082"
 }
}
