{
 "title": "Horrible Experience in School",
 "author": "Gregw05",
 "citation": " Gregw05. \"Horrible Experience in School: experience with Zolpidem (Ambien) (ID 14401)\". Erowid.org. Feb 10, 2004. erowid.org/exp/14401",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "145 lb",
 "report": [
  "<p>Well..... where to start...I had taken Ambien before, and each time i took a 10 mg tablet it would usually give me double vision for a while, which I for some reason thought of as cool.  So one day I was feeling quite depressed (I am bi-polar now) and decided to take a bunch with me to school, big mistake.",
  "During the first period I took one 10 mg pill.  The effects kicked in like I expected while we were watching a movie.  When 2nd period came, I took another to see what that would do (prior to this I had only ever taken one at a time).  Then, during third period, I took the rest, which added up to 50 mg total.  Much of the next period of time is really foggy and I dont remember much but I'll try my best. ",
  "I was fucked up.  When the bell rang I could hardly stand up.  I hobbled up the stairs and fell flat on my face in front of a decent amount of people.  When I went up towards my classroom I remember bumping into many lockers / walls / people.  Finally when i had reached what I thought was my classroom I was already sort of late, and I stumbled into the classroom.  It turned out that class wasn't the one I was in, and a ton of people gave me awkward looks.  I think I remember uttering something about being lost and the teacher asked me if I was feeling ok, I said yes and nearly fell out of the classroom and then went into my room.  I got a lot of disturbing looks from a bunch of different people in that class, and at least 2-3 times my teacher asked me if I was ok and what was wrong.  Then before I knew it, there was a knock at the door and my teacher called for me and said someone was there to see me and told me to take my books.  I couldnt even walk straight or see straight, by this time my vision was so blurred that I couldnt think or talk right and couldnt tell what was in front of me. ",
  "The person at the door was one of the vice principals and he had said that someone reported me as being messed up and he took me down to his office.  The trip down was horrible I fell constantly which couldn't have looked good since I told him I was fine.  He got a nurse and she started testing me, making me follow lights with my eyes and walking in a straight line and things like that.  I had no idea what they were doing it for at the time, I was totally oblivious to everything around me and everyone talking to me.",
  "She took my blood pressure and pulse (I can't remember what she said about them) and then the vice principal said he was going to contact my parents.  at this time i still didnt know what was going on.  I remember him telling me not to leave the office and to have a seat on the bench outside his room.  I must have sat there for a REALLY long time but I only remember a few things about it.  The wall for the admissions desk was coming towards me, and at times rippling up and down, almost like water.  The mail boxes for the teachers kept popping in and out, and all their names were switching around.  UPS boxes were doubling themselves and the words they had printed on them kept fading in and out.  I remember I passed out around then for what seemed like a short time, but was actually 2 hours.  Finally I woke up to the vice principal telling me he had contacted my parents and they would be in soon.  I tried to stand up, but couldnt move.  People all around me were looking at me but I couldnt tell who any of them were.  The ground felt as if it was vibrating and I felt really sick.  I knew I had to vomit but I kept it in because I still wanted to say I wasn't messed up. ",
  "My parents came in finally after a little bit and they talked with my vice principal.  He said I had broken 3 rules and was under suspicion of drug use.  He also said I was suspended until i got a court hearing with someone from the department of education.  My family and I left and went to get a drug test, which I probably failed miserably considering I had smoked a day or 2 before all this happened.  Next I passed out in my parents car and went home.  I got in a HUGE argument with my parents and tried to leave my house but they stopped me.  Because I am depressed I started to break down and got into a huge yelling match with my parents outside of my house and my dad wouldnt let me leave.  I went back inside and put my hand through the wall and then my dad grabbed me by my arms and told me to stop.  He and I got into a fight and we wrestled on the ground for a pretty long time.  My mom called the police and they finally came when we were still on the ground.  I got cuffed and sent over to a near-by hospital for an immidiate psychiatric evaluation because of my depression.  I was horribly embarressed walking into the E.R. being cuffed and followed by a cop. ",
  "The hospital was really backed up, and before I even got seen I had been there for 6 hours waiting, the entire time I kept fading in and out of being awake or not.  Finally we got seen, and the social worker who evaluated me recommended that I needed to stay for 3 days for further evaluation, because he thought I was schizophrenic.  He diagnosed me as being bi-polar (aka manic depressive) and said that my regular medicine for depression wasn't strong enough.  They tried to keep me there but I finally convinced my parents about an hour and a half later to sign me out of the hospital against medical advice. ",
  "I must say that was the most dramatic and horrible experience of my life thus far...  if you're going to mess around with ambien, make sure you do it in a safe place.  I would recommend not doing it at all, even though you trip pretty hard, its not worth the side effects and with my experience i regret doing it at all......</p>"
 ],
 "year": "2002",
 "id": "14401",
 "gender": "Male",
 "views": "40345",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2004-02-10T08:00:00.000Z"
}
