{
 "id": 14408,
 "title": "Appropriate Bonding",
 "date": {
  "submission": "2004-06-06T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "King of Suburbia",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.75 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 4:00",
   "amount": "0.25 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>History: Myself, I am now in early thirties.  From ages 15 to 20 I used Alcohol, Cocaine (insufflated) , Marijuana, Mushrooms, LSD, Crack, Ecstasy (once after a Dead show/LSD Trip).  At age 20 I stopped using everything for about 11 years primarily because of abuse of Alcohol and Cocaine.  In those 10 years I married, had 2 children and bought a house.  None of these things would have been possible if I had continued with my Alco-Coca lifestyle.",
  "Two years ago I used Ecstasy again after a good deal of research.  I used by myself in an empty house and was blown away by the level of insight attained by concentrating on my relationship with my wife and children,  Although the whole time I was wishing I could share the experience with my best friend (wife).  After this experience I asked her to try it with me but she said she did not want to try it.  Shortly after that 9/11 occurred and I feel I was able to use my insights from the previous experience to improve my relationships within my family and get us through a tough time.  I work in NYC and believe I was somewhat shell shocked about continuing to work in the city.  I made changes in my work schedule to ensure I am home for dinner every night with the kids and other changes to ease pressure on my wife and to spend more time with the kids.",
  "After some hesitation (1 1/2 years) , I convinced my wife to try a blue dolphin with me.",
  "Setting: Vernal Equinox, Friday Night, Baltimore Inner Harbor, Hotel Room with a nice view of \tthe city. Kids are safe with the Grandparents for the weekend.",
  "The Experience: estimated times",
  "T + 0 \tMyself (180 lbs) 3/4 blue dolphin swallowed",
  "\tWife\t (120 lbs) 1/2 blue dolphin swallowed",
  " Myself  various bits and pieces ( sublingually",
  "\tthroughout till T + 240 ) 3/4 of a dolphin",
  " Wife various bits and pieces ( sublingually)",
  "     1/4 of a dolphin",
  "T + 10 \tStarted watching the Movie 'Rabbit Proof Fence'.",
  "T + 40\tI am starting to feel it, Wife feels nothing except",
  "\trelaxed.  She had a larger dinner (T-60 ) than myself.",
  "\tWe each take a small piece sublingually.",
  "\tAnd start to get into the movie.",
  "T + 60\tBoth feeling it.  Start talking about the movie and use it  for a jumping off point to deeper conversations about life and western suburban value systems. The Traps of Consumerism and Materialism.",
  "T + 90\tBoth feeling good.  We are drinking good amounts of water. Peeing a lot and body temperature fluctuations are the main distractions from a wonderful mental/spiritual state. ",
  "T+ 115\t'Rabbit proof Fence' is over.  A very good movie. ",
  "I initially thought it might be disturbing (Nasty Christian Australians whooping up on Aborigines) but in the end the Human Spirit triumphs.",
  "T + 120\tStart watching 'Maid in Manhattan'.  Sorry J. Lo but this movie was superficial crap, made all too apparent by Ecstasy mental state.  Turn it off, and see small bits of Perpetual War News Channels.  We had briefly forgotten about the War.  That was nice.  Turn it off.",
  "T + 150  Having great conversations about our family, and how we relate to the kids.  Gushing about how cute our kids are.  The little nuances of their personalities that make them so lovable.  The momentary words are not so important as the underlying emotional sentiments.",
  "T + 180\tNaked under the covers,  Back and body rubs feel very good.",
  "I am absolutely convinced I married the most beautiful woman in the world.  My wife seems to be enjoying the moment as well.  She realizes that one of her biggest blocks to happiness,  is not being able to live in the moment.  For someone who is very quiet and not often forthcoming with internal sentiments, she is able to eloquently describe her insight as it presents itself to her.",
  "T + 240\tLast bits of pieces sublingually.  500 mg of Vitamin C each.",
  "Body temperature and peeing are the only physical annoyances. ",
  "Erectile Dysfunction as well but I am sure that will be corrected in time.",
  "T + 300\tEffects winding down, we have reached a nice plateau.  Love making is wonderful for next two hours.  Feels like we are seventeen again but with the know-how and sensitivity of thirty years olds.",
  "T + 420\t2 Advil each to help sleep.  High on the after glow, and the closeness.\tWe both fall asleep shortly after.",
  "T + 540\t6:30 AM Awaken.  Freakin Biological Clock, this is the",
  "same time the kids are waking up at home.  Despite only two hours of sleep we feel surprisingly well.  Making love again still feels great.",
  "T + 630\tVery Hungry.  We eat at the Hotel Breakfast buffet. ",
  "The Rest of the day is a lazy wondering day through the Inner Harbor,\tContinuing deep conversations, two naps and a great dinner together.",
  "During the night,  I told my wife that MDMA was legal for a while and used to be used for couples therapy.  I said, 'Imagine a society where couples could go to the pharmacy and get an appropriate dose of MDMA and have the same experience we are having, without the fear of poor quality substance or legal ramifications. To be able to breakthrough the mundaness of suburban thirty-something living and spiritually recharge your commitment to relationships and life is not something that should be made illegal and shunned in a society as complex as ours.'",
  "At least I meant to say something like that, but however it came out I knew that she knew what I meant.",
  "One of the dangers listed with MDMA is 'Inappropriate Bonding'.  I can see how this might be true.  But who better to inappropriately bond with than your wife?</p>"
 ],
 "erowid": {
  "id": "22590",
  "citation": " King of Suburbia. \"Appropriate Bonding: experience with MDMA (ID 22590)\". Erowid.org. Jun 6, 2004. erowid.org/exp/22590",
  "substance": "MDMA",
  "views": "65152"
 }
}
