{
 "id": 14404,
 "title": "Dragons, the First Element and Trees",
 "date": {
  "submission": "2006-05-02T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Muse",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "AMT"
  }
 ],
 "report": [
  "[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I was extremely prepared for this trip as I had done AMT once before with amazing results. This time I recieved the capsule from the same source as the first time, knew it was the same so I prepared myself for a few days to take it. Before a trip I usually spend a few days making sure my mind is in order.",
  "So the day of the trip I went over to N's house.  N and J had already dropped about 3 hours before. They were sitting in a completely dark room when I got there at 4:00 pm.  They were histarically laughing so I decided to drop right then.",
  "T-1:00  I start to notice a speed/MDMA feeling, increased thought process.  We leave in my car as I feel very normal to pick up B.  Once in car I really start to take off. I'm at an intersection ambulances going by, I feel so alive! Much like MDMA no problem driving, but lights all over seemed streaked (hard to explain like LSD) We pick up B who takes his gelcap.",
  "T-2:30  Get back to N's house, we have a definite shroom atmoshpere going on all laughing just greeat fun atmospere. The MDMA feeling is quickly leaving but the increased thought process is definitly going strong (which I learn continues constantly throughout the trip)",
  "T-4:00  Music is great listening to 60's stuff (were just pushing eachother crazier and crazier. Only way to explain it.",
  "T-5:00  I go outside and walk around , at N's theres a pond I feel very alive and there is weird perceptions going on different from and trip I've had.",
  "T-5:30  Gazing at these trees and shrubs and somehow there is a dragon looking at me, By this time J and N are really tripping out. Talking about seeing acid patterns everywhere.  Like everything is part of the same depth and everything is connected.",
  "Complete loss of time no longer is comprehensible.  We had this room set up so it was completely black, I'm sitting in this room with N and J and we are just talking and tripping on our voices.  Like N will say something then imidiadly afterward he'll say 'who said that was it me?'  funny stuff, like we were all part of this thing which was completly outside ourselves.  Were in this room listening to Jimi Hendrix and my first completely pyscadelic experience from AMT.  I observe this spectrum of light in the pitch black room.  I feel like it was created by Jimi, purples, reds greens, blues just crazy.",
  "maybe midnight   I go outside to sit by the pond with B, I'm just gazing at this thing and I say to B 'hey doesn't this pond look like a bunch of rocks?' Right after saying this I can't believe the clarity of the rocks completely 3-D rocks, no pond there anymore. Perception tells me I could walk across them.",
  "Then I have a realization by myself sitting by the pond. Something which has impacted my life greatly.  I had this realization which was part secret knowledge part observation part common sense.  I realized that water was the first element.  Simple as that. This one realization has impacted my life greater than any  previous, That night I must have drank about 2-3 gallons of water.  There was a big shower storm at dawn which I took a shower under.  Felt like the first real shower in my life.  After this natural shower I went back to N's and went to sleep.",
  "THis experience was all in all very natural It seemed like I had been conected with some force of the universe which was teaching me lessons about lif's simplicity. The whole trip probably lasted for about 14 hours.  The next day I felt like I was still tripping lightly.  Especially when We smoked some pot.",
  "THis is oviously a hard experience to write about, it was so out there, and I left out most of the experience, i have tryed to show here some of the lessons this drug has to offer.  Also one odd observation about AMT is when smoking pot on this drug I couldn't get high.  Basically when I would take a hit it would like induce these visions and patterns mostly.  But I wouldn't get stoned at all, we smoked lots of pot that night maybe 1/4 oz of good buds, and it seemed like the pot would just kind of induce these visions."
 ],
 "erowid": {
  "id": "22562",
  "citation": " Muse. \"Dragons, the First Element and Trees: experience with AMT & Cannabis (ID 22562)\". Erowid.org. May 2, 2006. erowid.org/exp/22562",
  "substance": "AMT & Cannabis",
  "views": "3552"
 }
}
