{
 "id": 14418,
 "title": "Psychedelics with Psychiatric Meds",
 "date": {
  "submission": "2008-01-16T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kp2Sushi",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "substance": "Venlafaxine"
  },
  {
   "time": "0",
   "amount": {
    "number": "36",
    "unit": "mg"
   },
   "substance": "Methylphenidate"
  },
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "substance": "Olanzapine"
  },
  {
   "time": "0",
   "amount": {
    "number": "100",
    "unit": "mg"
   },
   "substance": "5-MeO-DiPT"
  },
  {
   "time": "0",
   "amount": {
    "number": "75",
    "unit": "mg"
   },
   "administration": "smoked",
   "substance": "AMT"
  }
 ],
 "report": [
  "Many people wonder about the interactions between psychiatric meds and psychedelics. I have the answers you need.",
  "Here is a timeline of my experience:",
  "00:00",
  "Took 150mg of Effexor and 36mg of Concerta, followed by 100mg of 5-MeO-DiPT and 75mg AMT which I smoked. Some people complain about the harshness of AMT smoke and I can agree that it did cause a little distress in my lungs, but not anything that did not fade shortly after.",
  "Immediately I knew that I had done appropriate amounts of the psychedelics. I have found that it takes significantly larger doses of substances to produce an effect in my system. This is most likely a product of the Effexor and Zyprexa. The reason? Effexor downregulates serotonin receptors and Zyprexa actively antagonizes 5-HT2 receptors. Thus a much larger dose of the substances was required to provide the desired effect.",
  "As for my mindset at the time, I am very content. I am never in a bad mindset when I do psychedelics. I openly accept their effects and have an air of excitement about myself for experiencing the unknown.",
  "00:05",
  "I am already feeling the come on from both the AMT and the 5-MeO-DiPT. This is very interesting. I'm listening to some music and the pitch of the instruments is correct, but the pitches of the vocals are much lower than usual. This is very strange, but I like it.",
  "00:20",
  "The AMT is starting to take hold and I am seeing form constants and visual pattering.",
  "01:00",
  "Both of the substances have completely taken hold.",
  "I have gone to the science building to get on the internet. The pitches of the vocals is still altered.",
  "02:00",
  "I'm now at a coffee shop talking to some friends. They've noticed that my eyes are very dilated and are convinced that I'm on acid. Hah, if they only knew!",
  "03:00",
  "My vision is now very blurry. I don't mind though. The AMT seems to induce a beautiful mindset for it's effects to take hold under.",
  "07:00",
  "The 5-MeO-DiPT is starting to subside, but the AMT is still full blown out there. I am back at my apartment listenning to music and I am loving it!",
  "10:00",
  "The AMT is starting to decline. I am very euphoric and the visuals are getting a bit less intense.",
  "12:00",
  "The visuals are almost gone and I am still in a very good mood. This has been an intense trip.",
  "12:30",
  "I have decided to go to sleep.",
  "20:00",
  "I am now awake and I am still feeling some of the effects of AMT. It has a very pleasant afterglow, which I am thouroghly enjoying."
 ],
 "erowid": {
  "id": "22619",
  "citation": " Kp2Sushi. \"Psychedelics with Psychiatric Meds: experience with Venlafaxine, Methylphenidate, Olanzapine, AMT & 5-MeO-DiPT (ID 22619)\". Erowid.org. Jan 16, 2008. erowid.org/exp/22619",
  "substance": "Venlafaxine, Methylphenidate, Olanzapine, AMT & 5-MeO-DiPT",
  "views": "7687"
 }
}
