{
 "id": 14412,
 "title": "Life Force",
 "date": {
  "submission": "2003-07-01T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Grug",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.5",
    "unit": "ml"
   },
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "liquid"
  }
 ],
 "report": [
  "For the last 5 years i have used 1,4B as the mythical 'elixir' we are all trying to find, that makes life great and eases most troubles.",
  "For the last 5 months i had run out and could not find a supplier of it. Previously my friend bought a 205 litre drum of the pure chemical and this supplied my needs for free. I have found that taking 1,4-B a couple of times a day increases general well being, gives a healthy glow to my skin and face and fulfills my raging drug habit without compromising my lifestyle, since it doesn't hang around in your system and isn't tested for in most drug tests, if any.",
  "I'm not saying its perfect by any means. At one stage i was addicted to it, having to dose 3mls every 1.5 hours otherwise i'd go into chronic withdrawals, which if you read in this site are apparently life threatening.  Diazepam and dose reducing over a few days got me off it, and i'd rate the ease of getting off it 1 out of 10, compared to opiate withdrawal a 10/10. Just don't do it cold turkey whatever you do if your in a similar sitch.",
  "And of course, i have written off a car.  Nno brakes 80km/h big tree, passed out, after which i swore I'd never drive under the influence of ANYTHING except maybe pot.  And I've passed out in public at many raves.  Over here in Australia, the promoters of the underground rave scene 'banned' it because too many punters were passing out and the ambos were freaking out.  The people who went to hospital were just waking up and walking out a couple of hours later (note: drug overdoses are serious, if in doubt call an ambulance so you or your friends can live to see another day).",
  "Basically I'd just like to say hooray for 1,4B.  I have learned to respect it and it makes life worth living, This is the closest thing I've found to the 'elixir of life'."
 ],
 "erowid": {
  "id": "22604",
  "citation": " Grug. \"Life Force: experience with 1,4-Butanediol (ID 22604)\". Erowid.org. Jul 1, 2003. erowid.org/exp/22604",
  "substance": "1,4-Butanediol",
  "views": "12368"
 }
}
