{
 "id": 14413,
 "title": "Two-Faced",
 "date": {
  "submission": "2007-10-02T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DBT",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "For quite a while I had been wanting to experience salvia.  I had been researching it, and was looking forward to finally trying it.  I got some, and it was taken away from me, I won't go into details how.  I was very, extremely angry at this turn of events.  Months later I was in a new situation where it was readily available for me.  I purchased a gram of it, and smoked it all without it having any effect on me whatsoever.  It was annoying.  I purchased more a few days later, and again attempted to smoke a few bowls, but again, to no avail.  The next day, as soon as I woke up, in the apartment I had been living in by myself for a couple of weeks, I resolved 'I will get high from this salvia, now'.  I sat in a chair, and I smoked it. ",
  "I withdrew from my body, backwards, like you see a cartoon spirit leaving the body of a character who has just died.  I did not go very far, but it felt like I was a bit above and behind my body.  Time seemed to slow down, and as a result of this, my ears were filled with a buzzing, like a delay effect set on infinite feedback offset by a fraction of a second.  I could see through the ground and the walls as if I was staring down a long hallway, I could see behind them into another dimension.  My perception of this extra dimension was mainly consistent of a grid style lines intersecting in a way similar to how one might see on a 3d software program before the texture has been placed over the basic 3d form.  From every object in the physical world, these grid things extended off into the other dimension.  On/from the wall moving around was something that seemed reminscint of a snake form of sorts, but did not give me the idea of an entity.  It seemed to me this thing was what the delay sound was emitting from, as if it was a result of the snakething's motion.",
  "Then faces appeared floating, or just existing, in the middle of everything.  One was the most perfectly evil face I have ever seen, the other the embodyment of coldness and lack of emotion.  The latter seemed to have some sort of armor covering it.  The evil face was grinning, and from it I received, 'What are you doing here?  Are you alone?  We're going to hurt you.'  I was purely shocked, I had the feeling my jaw was dropped, though I do not know if it actually was.  I began to ask out loud, 'Why are you going to hurt me?  Why?  Why are you going to hurt me?'  There was no response, the faces just stayed there, motionless, staring.  I kept repeating, more and more sounding like I was trying to show how it was irrational of it to be that way, and at this time I was coming down from my high.  I began to feel like a fool. ",
  "I directed much thought toward the experience, and it was very significant to me.  It was the climax to a buildup that had been growing for some time.  I realized that my state of mind was completely idiotic, just wanting to get high, and getting pissed off when I wasn't.  I felt like I had been slapped in the face for not being respectful like I should have been.  That face haunted me for quite some time after this experience, as somewhat of a reminder of what is out there, and that traveling to the spiritual world is not to be taken so lightly."
 ],
 "erowid": {
  "id": "22606",
  "citation": " DBT. \"Two-Faced: experience with Salvia divinorum (10x extract) (ID 22606)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22606",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2270"
 }
}
