{
 "id": 14420,
 "title": "Splashing Water is Heaven, but There Is Hell",
 "date": {
  "submission": "2003-04-03T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Hix",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. mexicana",
   "form": "(fresh)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I noticed that there are very few trip reports for Philosophers stones, which are fresh psilocybe mexicana truffles (apparently they are not-yet-fruited mushrooms). Very similar to magic mushrooms, the main psychoactive compounds are psilocin and psilocybin, although there are thought to be other alkaloids present which are thought to influence a trip, as with other magic mushrooms. The big advantage of the stones is that they are legal in the UK (I dont know where else), and unlike magic mushrooms the truffles resemble a nutty tasting breakfast cereal.",
  "I bought the stones from a UK website, and incredibly due to some heaven sent cock-up received 50 grams instead of 15! They arrived the morning after a sleep over at my house with three great friends, where we smoked lots of marijuana. We planned to trip that day, with three of us taking the stones and one not. Although it was slightly spur of the moment, we had planned to take shrooms for some time, had been seeking them for over a month, and had read-up on them. It was everyones first trip, but we were all experienced daily cannabis smokers (bud not resin!) and regular drinkers at Uni. It is worth mentioning that the previous night Homer, Bonham and I had all got breakthrough trips with some Salvia x5 extract, and anyone who has read about Salvia breakthrough trips knows that this is quite a big experience.",
  "The three of us each stewed approximately 5 grams of stones in a cup of tea for 15 minutes, then drank the tea and ate the soggy truffles at the bottom of our cups. We had all eaten a light breakfast a few hours before, and everyone except me was scoffing popcorn around this time. After about 20 minutes Bonham and I agreed that we could feel a slight change in our general perception, and I definitely felt quite a strong anxiety-like apprehension, despite being quite happy and excited at the prospect of the experiences to come. It is quite hard to gauge time passage, but the trip got steadily stronger over the following hour, reaching a plateau after about one and a half hours.",
  "As the trip grew in strength my perceptions became more and more altered. When looking around and moving early on it felt slightly like being drunk, because my coordination was piss poor and there was a slight moving of my field of vision. I also went and looked at my pupils, which were massive. ",
  "Visually the trip became really good after about 45 minutes. I agree with many people that the term hallucination is often not an accurate description of the visuals, at least at lower trip levels. Visually I never saw any object that wasnt there, but my visual perception was greatly altered when compared to sober vision, which is after all just another subjective state of perception.",
  "Patterns, especially bright and colourful ones, were brilliant to look at. The more complex and varied the better. My sleeping bag had a bright, colourful and contrasting varied-shape pattern, and when looked at the colours seemed brighter, almost shiny, and definitely more beautiful. The colours also seemed to subtly yet rapidly change hue. When looked at with the periphery of my vision, even just outside my central vision, the pattern flowed and pulsed. This occurred with most objects and surfaces, even if the pattern was relatively dull or non-existent. Visually contrasts, patterns, bright colours, lines and shapes all became alive when I looked at them with my periphery vision. They seemed to move about, and I could often seemingly see faces, objects and 2d patterns in them, just like the periphery visualisations I experience when really high. Things also looked generally more beautiful, more alive and better than in every day vision. Aldous Huxley was definitely correct in saying that this is how one ought to see, even though he was tripping on mescaline at the time.",
  "As the trip came on stronger, probably after an hour or so, I could see extremely bright, electric looking lines move about in patterns and surfaces in the periphery of my vision. It often looked like lightening except more colourful, often shimmering between different colours. Looking around, or looking at moving objects was also greatly altered. Bonham and I agreed that a good analogy is that everything looks like a film that has a low frame rate. This is because everything moving in our vision proceeds in jerks, although smoothly and often seemingly slower than with sober visual perception. The brain seems to miss frames and it almost looks like slow motion, although we can still strangely tell that everything is moving at normal speed. Bizarre but really interesting and calming.",
  "I find it hard to describe what I felt physically, but I realised quite soon that I had underestimated the physical effects, and they were always strongly apparent throughout the trip, and lasted the longest out of any of the effects. There is an increased awareness of the physical body, and this often makes relaxing harder, things can often feel somehow nicer to the touch.",
  "Emotionally I was feeling quite happy, but mentally I was often overwhelmed by the state I was in, due to the incredible sensory flow of information from the outside world. However a lot of the anxiety faded as the trip became stronger, and as the intensity of it increased I often felt too overwhelmed to do anything except lie back and try to relax, and let my mind go wherever it wanted. However, all through the trip I found relaxation very hard, and I was extremely restless.",
  "My mind became awash with random thoughts and observations that flashed in and out of my consciousness, and it was often so intense and rapid that it was annoying. It was very hard to participate in consciously directed trains of thought, my mind would flicker between thoughts however hard I tried to direct it. I remember watching a Smiths music video and loving the wonderful colourful pictures, but being unable to concentrate on and appreciate the music. I think it is much better to let go, and to experience oneself and the world while tripping without trying to control it, I certainly learned this.",
  "After an hour or so Homer wasnt tripping very hard and so decided to roll a fat one with some lovely buds fresh from the Dam. The weed definitely intensified the experience, especially visually, and Homer said that it worked wonders for his trip, making it much stronger. Next time I probably wont smoke though, because it altered the trip to a more knocked-out state of mind.",
  "It is very true that the coming up period on shrooms is experientially long. Because of my muddled mind that was racing at full throttle, and my lack of accurate time perception, I find it hard to recall the intense part of the trip accurately. Looking back it seems like a dream, where I can only recall faded fragments and images of the events. The trip was going really well, and we were all really enjoying it, despite all agreeing that we had a little nausea. Unfortunately it all turned bad when I went to the toilet, more than an hour after kick-off.",
  "Stumbling around and becoming ecstatic at the beauty of the splashing water in the sink (it was the best thing I looked at while tripping, and the most beautiful thing I have EVER seen) I became aware of my friends voices in the next room, and I thought I heard words like sick and a general commotion. I told myself I was imagining it and came back in, only to be passed by Grace carrying a bowl of sick to the toilet.",
  "I entered the room and one of my beds had a big pool of sick on it, and poor Bonham was lying on my other bed (I have 3), head near a bowl, rings as black as death around his eyes, and skin as white as chalk. Only one minute ago he had been fine, this was the biggest shock I have ever experienced. I soon realised what a bad trip was all about, and how easy it is to set one off even with a seemingly innocuous situation. I rapidly became conscious that my natural neurotic anxiety had shot off the scale. Thoughts spun round and round my head, on and on, and I couldnt stop trying to plan through what I should do. My mind became a mass of revolving thoughts and plans, whilst I tried to calm myself down and think through rationally what to do. I realise now, as I did at times then, that from here onwards it was just a big fucking battle: me against my trip. This is the worst thing I could do, you cant beat a trip into submission, you just get unbelievably anxious, worried and fearful, both emotionally, and physically. You also get really critical of yourself and angry at what youve done, and you feel such strong regret and pity, but the trip doesnt get less intense. It was one of the most emotionally intense periods of existence Ive been through, I felt a cascade of dark emotions, deep depression combined with regret, fear, anxiety, and often panic. At times I even feared I would break down.",
  "Looking back now it seems silly, because what had happened wasnt remotely bad. It was not the end of the world, there was just a bit of a mess to clean up. Bonham was feeling better almost straight away, and the first thing he said when I came into the room was how much he was enjoying the trip again. My biggest fear at first was that he was ill, had overdosed, or whatever. If any of my friends came to any harm I wouldnt even be able to deal with it when sober, but luckily this wasnt even an issue.",
  "The only real problem was that I had to decide whether to tell my mum, and get the sick cleaned up properly, or to deal with it as best we all could so as to keep her in the dark over our tripping in my room. I was really scared about her finding out, although this was really out of character for me. My mum knows we smoke weed in my room, and accepts it, but I would rather she didnt know that I use other drugs; but I also know that she would have helped us and probably not even questioned our drug use.",
  "Instead, from the sick episode onwards it was a manic stumble around as I hopeless tried to clean two days of slobbing combined with a sick soaked bed, along with lots of help from all my lovely friends, who were also having bad trips thanks to the events and general environment. When a situation gets anywhere near uncomfortable when tripping it can soon escalate into the worst period of existence in ones life. I know thats exactly what it felt like to me. I was fighting everything, except my friends, who I knew were always there for me, and each other.",
  "It was one of the most difficult times of my life, and the most intense experience Ive ever had. If you can avoid it do. There is SO much I would be willing to do to have not had the trip turn bad.",
  "Luckily as time passed we all calmed down a bit, and we planned to get out the house and into the peace and seclusion of the country. We also found soft music helps calm a bad trip. However, after some manic cleaning I suddenly got the bizarre urge to talk to my mum. I never planned to tell her we were tripping, although the thought did seem comforting to me because I know she would have helped. Amazingly I had a really long, important and quite deep conversation with her. This really grounded me and helped me chill out, even though I had to watch myself to stay looking sober. It is a really strange experience having a deep conversation with your mum whilst tripping out and trying not to get sucked in to all the beautiful patterns flowing everywhere, I wouldnt advise it for everyone. From here on the intense negative emotional states ended, and all that was left was anxiety until we got outside.",
  "We drove to a really beautiful place on the hills above the town I live in that overlooks the whole valley. We chilled out, ate food, walked around, and admired the views for a while. It was about four hours into the trip, and I was definitely coming down at this point, but I still got brilliant visuals, with the grass and foliage making beautiful patterns to look at. I only saw a few flowers but they were also incredible to look at. Its definitely much, much better to trip outside if you are sure to be safe, because its much more calming and interesting, and much more beautiful.",
  "One of the most striking things was looking across the valley and into the valley at the town. The houses, hills and objects seemed so much closer it was unreal. Especially when concentrating on an object in the valley, it would seem so close and immediate that it was incredible. After some rock throwing we all went for a short drive before coming home to watch the Simpsons.",
  "Although more than 5 hours since eating the stones I was still quite far off baseline, and could quite easily go in and out of trippy states, like in a deep stoned state, bringing some life to patterns, shapes and colour contrasts in my immediate and less immediate periphery vision. The physical feelings of intoxication with shrooms were more apparent than the visuals, and I was really surprised to still be feeling subtle intoxication about 10 hours after eating them.",
  "After the Simpsons everyone left. I spent the evening relaxing, and thinking a little about my experiences, although I did get quite depressed for no apparent reason. I also found that getting to sleep was quite hard, although I often find sleep a problem anyway, and I was not totally sober until the next morning.",
  "Tripping definitely works with my personality and can really accentuate my traits. If you are naturally prone to problems like depression and anxiety then be careful, they certainly got worse for me, as did my manic desire to constantly do things. However the parts of me that I hate only became accentuated when the trip got bad. During the good part of the trip I felt really happy when the anxiety went. I think the main thing for people worried about emotional states is to plan well, if the trip had gone well all day Im sure I wouldnt have had any problems being happy.",
  "Im still really glad for the whole experience, even the bad part, because I learned a lot about myself and gained such an unusual experience compared to everyday life that I think it can only broaden and expand my mind. Looking back the most striking thing is that the cause of the bad part of the trip, and it really was hell for a few hours, was so innocuous that its just laughable now. All my friends agreed that despite the problems they also felt that it was a really worthwhile experience. We are already agreed that we will trip again, although this time with more respect for drugs, and a lot more planning.",
  "I also want to say that the night after the trip I got quite stoned, and began tripping quite strongly. I got quite a few of the effects I got from the stones, but I found it hard to sleep for a few hours and it was not especially pleasant. Luckily this hasnt happened again since, so dont panic too soon if you get anything odd happen after a trip.",
  "Sorry for the length for you lazy readers. I hope this report can help people planning to trip for their first time.",
  "Be kind; be happy."
 ],
 "erowid": {
  "id": "22625",
  "citation": " Hix. \"Splashing Water is Heaven, but There Is Hell: experience with Mushrooms - P. mexicana & Cannabis (ID 22625)\". Erowid.org. Apr 3, 2003. erowid.org/exp/22625",
  "substance": "Mushrooms - P. mexicana & Cannabis",
  "views": "10689"
 }
}
