{
 "id": 14444,
 "title": "To Infinity and Beyond!",
 "date": {
  "submission": "2005-12-09T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Denim",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "ml"
   },
   "administration": "oral",
   "substance": "GBL",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "carts."
   },
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  },
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "carts."
   },
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  }
 ],
 "report": [
  "The evening came and I was looking for 'that something extra'.  Having taken the GBL followed immediately by two tokes (1/2 bowl) from the bong I waited for a few minutes for the come up.  Once I was in full flow (about 15 minutes) I inflated the balloon with 2 cannisters of nitrous and settled back in the chair, expecting something different.",
  "My previous experiences have shown the GBL to synergise any other substance and expand on its effects, and having had some 'nice' experiences with nitrous and cannabis, I wondered how this one would be tempered.",
  "I wasn't ready for what happened next.  Two cannisters are more than I can inhale in one breath, to I took what I could comfortably and sat back.  As I was coming up on the nitrous, I breathed in and out of the balloon with the remainder of the nitrous in it a few times.",
  "Suddenly I was transported to another dimension, where the whole concept of reality folded in on itself, all five senses became one, then dissolved, sounds melted, consciousness melted, I was transported to several different instances in the time-line, simultaneously, as different people, there were religio-philosophical implications and much much more as my consciousness raced to keep up with the evolving experience. It could have been an acid trip.  I was gone for hours, but in reality it was unlikely to have been more than a minute or two. A second balloon with two more cannisters took me even further!!",
  "This experience, though changing in content has been repeatable on demand with the same combination, and I have tried it on two mates, both of whom are hardened experimenters and both of whom had the most profound and pleasurable experiences with it.",
  "I have used shrooms, salvia, hb wood, absynthe, ayahuasca, charlie, GHB, acid, and one or two less desirable, but as yet I haven't found a more enjoyable and profound combination than this!!"
 ],
 "erowid": {
  "id": "22690",
  "citation": " Denim. \"To Infinity and Beyond!: experience with GBL, Cannabis & Nitrous Oxide (ID 22690)\". Erowid.org. Dec 9, 2005. erowid.org/exp/22690",
  "substance": "GBL, Cannabis & Nitrous Oxide",
  "views": "7108"
 }
}
