{
 "id": 14445,
 "title": "Experiencing the World in One Night",
 "date": {
  "submission": "2007-10-02T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Funkalicious",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.8 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I went down into my friends basement to play ping-pong after we smoked and could feel a buzz starting. This was after about 30 or 45 minutes, we each ate about 3.8 grams of mushrooms. When we started playing ping-pong, I could not coordinate myself enough to play the game. I gave my paddle to another person and picked up my friends guitar from the wall. I sat down on the couch and began to play around with notes and chords, not having any idea what I was actually doing. The sounds that I created sounded ridiculously bad, but to me they felt incredible. We were listening to Comfortably Numb by Pink Floyd and I began to really feel what was going on in the music. I tried to play along on the guitar with the song and match notes. When a guitar solo began, I hit a note that felt so incredible that I stopped and looked at all my friends. They asked what was wrong and I told them nothing, just that the music was unbelievable.",
  "After that event, I dont really remember the transition, I just remember finding myself in a car riding in the back seat. We drove and I watched the side of the road fly by my window. It was probably around 10 at night so it was dark, but I could still see shapes and shadows. When we stopped, we were in a small parking lot with a group of small pine trees to the side of our car. They did not look different, but my perception of their presence felt different from normal. We began to walk to someones house to a party, but had to cut through several yards to get there. As we walked over the crest of a small hill, I looked up into the sky, which was completely clear and I could see every star imaginable. As I stared into the sky, I suddenly felt as if I were a part of its vastness and almost felt as if I could swim through the stars. The feeling of my presence and being alive became my vision of the stars and my body felt extreme peacefulness and awe. I commented to my friends on this but could not make any sense of it at the time. We cut through more yards and again I felt as if I were perceiving things differently from normal.",
  "At the party, I became like a very drunk person, walking around and talking loudly to people who I did not know at all. I asked for some milk, specifically, because I was thirsty, and when I got the glass, I threw the milk in my face for some reason. It spilled all over me and hardly any went in my mouth. We all laughed at the randomness of it. One kid came up to us and knew we were tripping so he began to ask us how we felt and got all excited. His energy seemed abnormal to me, probably another distorted feeling.",
  "We went into a room with lots of people inside. We had to squeeze in next to the door and barely had room to sit. Everyone in the room began to stare at us because they knew we were tripping. They would not talk to us directly, but did talk with each other about what we were doing. This was very unpleasant and suddenly I had my first frightening out of body experience. My point of view rapidly spun around to that of the people watching me and I was sitting alone in the corner flailing my arms and hands spastically in the air and making disturbing, insane facial expressions. My body began to twitch. This happened one more time and then I began to tell my friend that we needed to go. I started to feel as if I had been asking him for hours and he was becoming angry and started yelling at me. I later found out that he had not, but at the time, I did not know otherwise.",
  "As we left the room, I felt a great relief and calmness. I became incredibly friendly to the people at the party, even though I did not know them. I approached one person I had met before and felt overjoyed to see him, probably because he was one of the few people I actually knew that was there. For some reason, at the same time, I felt as if there was something wrong with him. I repeatedly asked him if he was alright and he kept telling me that he was, but I could not help feeling like he had something really bad going on. I found out later that all I kept asking him was Are you ok dude?, but remember saying other things.",
  "When we left the party, we decided to ride around in the car for a while. I suggested going for a walk in the woods at one point, feeling like I had come up with the greatest idea of all time, but we ended up driving, even though we all thought it would be fun. As we rode in the car, I stared out the window and watched my surroundings again and the other cars on the road. At one point, I thought I saw a police car next to us coming up to pass, but it just stayed beside us. This was totally my own hallucination. We kept riding and a friend in the back seat with me wanted to smoke, so I took out a joint and suddenly I saw him spasm uncontrollably next to me as if he had lost his mind, jumping up and down, rocking back and forth, and his face was somewhat distorted or blurred. His eyes were larger than normal and very scary. Then, as soon as it started, it stopped. I was back to just sitting there, and we were passing a joint, but I did not smoke any. I decided I did not want to be any more altered than I already was.",
  "We kept driving and suddenly I decided I needed to go to the bathroom. I told my friends I needed to go soon, but they said we could not stop yet. I do not know how long I waited for, but the longer I waited, the more excruciating it was to hold it in. I told my friends I absolutely had to stop, so they said they would stop somewhere as soon as they could. When they finally pulled in somewhere, I told them I did not need to go anymore. Somehow, I had managed to block that out of my senses. However, as soon as we began to drive again I had to take a piss even worse. I told them I had to stop again and at this point, they were getting a little annoyed. They pulled in at a gas station but it was too late, my urge to relieve myself had arrived before the salvation of the ivory throne could. Nature had overpowered me again, not just with the mushrooms.",
  "After pissing my pants, I felt incredibly at ease and had one of the most relaxed feelings of my life. I didnt even care that I had just pissed all over myself. Then when I realized that I had, I thought Oh god, I have to cover this up. and that was when I poured my drink all over myself. After doing this I shouted Fuck I spilled my drink all over myself! to which my friends replied Really? Dude that sucks!, but it was not until we arrived back at my friends house that they saw how soaked my pants were. I decided I did not care and just laughed at myself.",
  "Climbing out of the car was one of the most difficult things I tried to do all that night. It felt like my body was being pulled down toward the seat because it felt so comfortable just to sit there. When I finally pulled myself out, with the help of my amused friends, I was blinded by the flood light on the house. It was not abnormal looking, but the intensity was at least ten times greater than normal. We made our way into the house and I said I was going to go take a shower and change my clothes. They told me that would probably be a good idea. I stumbled my way clumsily up the big staircase and went into the bathroom to get in the shower. I turned the water on and got in the shower, I think I forgot to take off some of my clothes at first, but caught myself before getting in the water all the way.",
  "My next task became operating the shower. I was able to turn the bath water on and let it run, but I could not remember what I needed to do to get the shower going. I stood upright in the water and stared at the flowing faucet. Something about it felt totally different from normal. Soon I realized that I had just been standing there staring at the flowing water and remembered how to turn on the shower head. Apparently I had been standing for quite a while, because my friend came upstairs to see what I was doing and make sure I was alright. When I got out of the shower, which I only stood in for about a minute at the most after turning it on, I stared at myself in the large mirrors on the wall.",
  "My mirrored image looked just like it always has, but again I felt as if I was perceiving it a different way. I also experienced some of the same out of body experiences as earlier that night at the party, where I watched myself go out of control and appear to have lost my mind. I saw myself as the stereotypical, misinterpretation of a mentally disturbed individual or drug addict. I fidgeted with my fingers and grinned menacingly, as well as glared with strange eyes at the mirror. Then I heard my friend upstairs and snapped out of it, relieved to be free of the strange experience. I put more clothes on, but managed to put most of the same ones on, just different pants, so I then walked down into my friends basement in my t-shirt and some pajama pants, it was an interesting sight.",
  "This part of the night is also a blurry part, but I know I sat down on the couch next to my friends and they all watched me carefully. I felt like I appeared very strange to them and was not feeling well. After a few minutes of this confusion, I had an urge to lie down and told them I was going to bed. The bedroom I slept in was a guest bedroom attached to a basement living room area. There was a glass, sliding door on one wall and the regular door on another that went into a hallway. The next hour or two ended up being intense bursts of peaks and valleys in my trip. I got into the bed and felt relieved to be lying down, but noticed immediately that there was a mirror on the closet door next to the bed, so as I lay on my side, I saw myself staring right into my own eyes. This bothered me a little at first, but after a few minutes I relaxed and kept my thoughts under a little more control and in touch with my senses.",
  "Out in the main basement area, my friends were watching Road Trip. I had seen the movie at least 3 or 4 times, so it was easy for me to imagine the scenes in my head while I listened to the audio. This turned into a very enjoyable experience and each time a song came on in the movie, my mind was filled with blissful energy; stimulated to focus my thoughts on that energy. I soon became aware of the light reflections on the off-white walls of the basement from the TV screen. I saw flashing and waving reflections of each individual color of the spectrum. When the music played, these visualizations became significantly more intense and much more enjoyable. The music and colors became feelings and thoughts instead of sights and sounds. My mind was registering them as usual, but in a very different way. With time, my focus drifted from the windows and hallway lights to the ceiling, which continued with this flashing and reflecting of the spectrum.",
  "I lay calmly in the bed observing the beautiful visualizations before my eyes and felt at peace. In this peace, I either drifted into sleep or transitioned into a totally different dimension of perception and time. My body was weightless and traveled on a continual backward path, like a video camera zooming out. From this weightless position, I watched bizarre landscapes fly out from under me and form new shapes, colors, and depth perceptions. The landscapes appeared much like those in a Dr. Seuss book, lots of bright colors, again each individual color of the spectrum, and strange plants, bushes, rocks, trees, or other formations and structures.",
  "Trees appeared as tall, rectangular stalks with no small branches and no leaves. They were not rounded on any sides, they all had strongly defined edges and sides, most of which were rectangular. Bushes appeared the same, and rocks were mostly strange, rough formations sitting on the ground as usual. Some of the plants, trees, and rocks stood alone on a tall pedestal of land with a patch of grass or soil on the top. There were no hills or rivers, only barren landscapes with lots of straight drop offs and rocky cliffs. But my point of view was above all these places, more like a bird flying over it all, just in reverse. As I traveled over the landscapes, the color of the land would slowly transition through each color of the spectrum, much like I had been experiencing earlier on the walls. When a color was shown, everything was colored according to that color, if there were shadows, they were darker hues of that color, and likewise for the brighter spots.",
  "As I stayed in this state of consciousness for a long period of time, my body felt completely free. I went in and out of moments of panic or fear to feelings of bliss and pure unity with my self and surroundings. I do not remember if there was any additional experience after this event, but I must have fallen asleep during anything that might have happened. The next day I spent almost all my time thinking in the back of my mind about what I had experienced and what it may or may not mean, what Natures role was in everything, what I should believe and how to understand things. Aside from my moments of panic, fear, nervousness, and other minor discomforts, my experience with mushrooms was still a very pleasant one and I enjoy telling my story more every time."
 ],
 "erowid": {
  "id": "22699",
  "citation": " Funkalicious. \"Experiencing the World in One Night: experience with Mushrooms - P. cubensis & Cannabis (ID 22699)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22699",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "2469"
 }
}
