{
 "title": "Mild Effect of Morning Glory.",
 "author": "Black",
 "citation": " Black. \"Mild Effect of Morning Glory.: experience with Morning Glory Seeds (ID 14455)\". Erowid.org. May 8, 2002. erowid.org/exp/14455",
 "substance": "Morning Glory Seeds",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "60 seeds",
   "oral",
   "Morning Glory",
   "(seeds)",
   " T+ 0:25",
   "60 seeds",
   "oral",
   "Morning Glory",
   "(seeds)",
   " T+ 1:10",
   "60 seeds",
   "oral",
   "Morning Glory",
   "(seeds)",
   " T+ 2:05",
   "150 seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "report": "<p>\nSo I bought 25g of 'untreated' seeds from a herbal seed shop online. That is i believe approximately 1000 seeds.</p><p>I had a relatively large dinner around 7pm and at 8:19 I decided to take 60 seeds. I had read the 'Morning Glory for Dummies' report and felt that id take 60, chew them down and swallow. I washed them down with a little water. At 8:42 I had another 60 sees and by 9:04 I had slight leg stiffness. I wouldn't have said cramps, it wasn't painful but I understand that these seeds are vasoconstrictive, which to me means it lowers your circulation. By 9:29 I took another 60 seeds, that is 1:10 mins after the first lot. I noted more leg stiffness again at 10:31.</p><p>The effects did not seem to be happening. By 10:58 I noted not much had happened at all. I felt by 2 and a half hours something should happen. Maybe this wasnt a great idea but at 11:00 I took 67 seeds and at 11:05 I took another 87. 334 seeds between 8:19 and 11:05 but still not much was happening. I had talking on the phone to a few friends and I did feel quite chatty and confident, I felt I had a bit more energy and I began to notice percetual changes. I noticed a few things visually that I didnt normally see, the way light reflected off certain surfaces etc. Most noticably I gained very good hearing. I noticed a lot of sounds of pipes and creaks in my house that I didnt normally hear. I put on some music and observed all the sounds with more clarity. This was quite exciting. I saw the occasional slighty waves in visuals but there was no substantial visual hallucinations. By 1:00 i was lying in bed and I had a few audio halluncinations, but then again I often get those when I'm very tired, which I was.</p><p>I awoke the next morning feeling very tired. The seeds seemed to make me feel tired and stimulated at the same time. It was strange. I have had a few very mild feeling of movement in my intestines but thats about it. I had NO NAUSEA whatsoever and no sickness of any kind. The only remotely bad thing was the leg stiffness.</p><p>Analyzing this experience I have come to several conclusions. One is that most people seem to use treated seeds and I understand that even if you grow your own from these seeds the treatment often spreads into the next generation of seeds. I bought specifically untreated seeds and feel this was the main reason I suffered no nausea. The other reason may have been the fact I had had a good meal before hand. Which brings me onto my next conclusion.</p><p>Ingestion after a meal seems to me to lower the effects. I read some very intense stuff by people in the experience vaults and yet my 'trip' was very mellow and insignificant. Perhaps the meal slowed the digestion of the LSA from the seeds and so I never got a great intake and I understand that after a while more LSA will simply be ineffective in producing effects, hence the fact that I suffered no real changes after taking the extra 154 seeds at 11:00. I feel that the fact I spread the intake over 3 hours and had had a large meal nullified most of my exposure to LSA since I probably only got a little to start and the later stuff was ineffectual because I was already coming up on the small amount. This is the only reason I can see why my experience was lesser than many others reported here.</p><p>However I am glad I suffered no nausea whatsoever and I reckon I have about 500 seeds left so I think Ill try them again sometime soon under different conditions and see what happens.</p>",
 "year": "2002",
 "id": "14455",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-08T07:00:00.000Z",
 "views": "13106"
}
