{
 "id": 14460,
 "title": "Looking Good",
 "date": {
  "submission": "2003-04-07T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Starbucks",
  "gender": "Male",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-T-4",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "There seems to be very little information around regarding 2C-T-4, but I recently has a chance to try it and so I did.",
  "In the morning I ate a light breakfast and dealt with a few things for a couple of hours. I then brewed and drank some ginger tea, presuming that there may be some nausea ahead, and wanting my 1st experience with this to go well.",
  "0.00 - put 15mg of 2C-T-4 into some juice and drank it down, barely tasted it.",
  "+0.40 - 1st alerts",
  "+1.30 - a slight vivid difference noticed in my visual field.",
  "+2.20 - noticed that there are busy CEVs but they are also very feint.",
  "+4.00 - over the last 2 hours or so the intensity of the OEVs continued to build, reaching the point that for a the 1st time in a long time I engaged in some wall staring, they were nothing amazing but more than I expected.",
  "After adjusting to the visuals I settled in to wacth a few epsiodes of 'Serial Experiments Lain' (in the course of these 2 hours), which had me transfixed, I felt really involved with the story, and my eyes enjoyed the artwork even more than usual.",
  "Then in the last part of this period I suddenly became distracted, I felt  a sense of deeping of the effects as if my room had suddenly become larger and I could here a deep drum beat somewhere in the distance. For a short while I just sat there and abosorbed this feeling, which I can't easily describe, but at a push I'd say it was like a slow motion genetle version of when 5-meo-dmt 1st hits you in the seconds after you smoke it.",
  "After I came out of this I decided to write a few notes of what had been going on throughout.",
  "And then it got a bit odd. I looked down at what I had written and the final sentence read 'This is not my writting'. Inital puzzled at this I entered into a verbabl and written dialouge with myself, paid close attention to my environment and mind, and debated the possibility that some other entity had borrowed my hand for a few seconds. I decided I didn't want to dwell on this since the moment seemed to have passed.",
  "+4.30 - still enjoying some effects, but now seems to have stablised into a non-specific trip, with nothing being particularly enchanced, I went about normal tasks, checking mail, reading news, etc quite happily.",
  "+6.20 - things are definately fading away now, a slight headache has developed but it's of no concern. Called some friends and carried out normal conversations with the slightest spaciness.",
  "Throughout the experience, there was some minor disturbance to my stomach, but never approaching what I would call nausea.",
  "I listened to music on and off throughout, but at no point did it really draw my attention, though this could be because I was listening to a random selection of Mp3s, rather than a co-ordinated audio strike.",
  "I was impressed with the visuals, they were more prominent than on the same (15mg) dose of 2C-T-7, which surprised me. I think that a higher dose (being more easily possible due to the lack of nausea), could yeild some strong visuals (as it stands I would compare them to mild acid visuals).",
  "I was pleased with this overal, and look forward to re-visiting it at some point."
 ],
 "erowid": {
  "id": "22739",
  "citation": " Starbucks. \"Looking Good: experience with 2C-T-4 (ID 22739)\". Erowid.org. Apr 7, 2003. erowid.org/exp/22739",
  "substance": "2C-T-4",
  "views": "13497"
 }
}
