{
 "id": 1447,
 "title": "Overdosing on Datura",
 "date": {
  "submission": "2002-05-07T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "prot0n",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "flowers",
    "quantity": "15"
   },
   "administration": "oral",
   "substance": "Datura",
   "form": "tea"
  }
 ],
 "report": [
  "After obtaining a good nights rest, and on a relatively empty stomach, I impulsively drank tea made from 15 tree datura flowers. Within 30 minutes I was overcome by intense visual and aural hallucinations, as well as extreme fatigue and unbearable dry-mouth. My muscles became heavy, and walking became impossible.",
  "The rest I don't remember, and is according to what people have told me. Apparently, I left the house of a friend at which I dosed despite his begging me not to an hour after consuming the poison. I stumbled all over the place, bruising my arms and legs, eventually to be picked up by either the paramedics or cops and brought to the emergency ward at the hospital. My heart had stopped, and upon being saved and after re-awakening, I became psychotic-fighting with the nurses and talking to people and things that were not there. I was tranquilized, and after re-awakening, very disorientated and tied to the bed. I had not remembered how I came to the hospital, and the doctors were not very cooperative in giving me this information at first.",
  "This terrifying experience happened a week ago, and I am still having very bad chest pain, and have a hard time concentrating on things.",
  "If you are going to try datura, be smart and take a sensible dose. I now look back at this experience and realize how much trouble it would have saved me to read the datura FAQ _BEFORE_ I decided to try it."
 ],
 "erowid": {
  "id": "14481",
  "citation": " prot0n. \"Overdosing on Datura: experience with Datura (ID 14481)\". Erowid.org. May 7, 2002. erowid.org/exp/14481",
  "substance": "Datura",
  "views": "20356"
 }
}
