{
 "id": 14476,
 "title": "Relaxing, Mellow High",
 "date": {
  "submission": "2007-06-26T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pill_Fiend",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "75",
    "grams": 0.075
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "650",
    "grams": 0.65
   },
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I started using drugs about 1.5 years ago. My first drug I ever tried was DXM, which remained my drug of choice until I ended up getting addicted to it, so I quit during the summer of last year. I have also used propoxyphene, ritalin, alcohol, flexerol, dramamine (which was a big mistake,).",
  "I am 16 and am somewhat thin, so drugs hit me a little harder obviously then it would someone who weighs 160lbs and works out all the time. I suffer from social anxiety disorder and mild depression, for which I take Lexapro for, but for the past week and a half I've forgotten to take it so at the time of this experience it was for the most part out of my system.",
  "Today I went into school in an eager mindset: I knew I would be able to get Tramadol today (in the form of Ultracet which contains 37.5mg of Tramadol and 325mg acetaminophen per pill).",
  "They had been offered to me a day earlier by a friend of a friend who said he could get me a pretty much unlimited supply. So today I bought two off of him eagerly awaiting what I knew would be fun. I popped them both in my mouth and downed them with some chocolate milk. I hadn't eaten breakfast this morning but I had just eaten a small can of pringles.",
  "After only about 10 minutes I already started to feel the effects. I noticed I was a bit calmer and my feet were slightly tingly.",
  "After another 20 minutes or so I had to go to my next class which was Science. By the time I got in there I was feeling pretty good. My heart was beating a little faster, my lower body had a nice tingly feeling that feels similar to Nitrous, and I was very relaxed. I remained this way throughout class.",
  "An hour and a half later I think is when I came to the peak, which was the start of my next class. We sat and watched a movie the whole time and I was feeling so good. People were laughing really loud behind me so I couldn't hear the movie, which is something that would usually send me flying into a rage, but I just sat there thinking 'it's all good'. I'm usually very jittery with anxiety and have bad thoughts on my mind, so this is something that works wonders for that. I can see how people find opiates addictive.",
  "On the walk to the bus I could feel I was walking a little funny, sort of like I weighed less (not as strong as the weightless feeling DXM gives, but still there).",
  "On the bus I couldn't stop talking to my friend and when I got off the bus I was slightly disappointed because it adds to the euphoria to talk it seems.",
  "I walked up the hill to my house with a smile on my face, without a care in the world.",
  "So I sit here now, the effects not quite as strong but I'm still feeling quite good.",
  "I experienced no side effects the whole time, like nausea or cramps like some people report. It also did not cloud my mind at all, I could think just fine the whole time. All in all I was quite pleased with this experience. But I can also see how these are addictive. In a way it sort of bothers me that people are out there using stuff like heroin, when this is much milder and less dangerous and is very similar. I really don't feel the need to increase the dose except for maybe one more pill when I really want to relax. I'm already wanting more (not physically, but mentally) so I'll be sure to be careful with this stuff and use once a week at the very most to avoid addiction."
 ],
 "erowid": {
  "id": "22810",
  "citation": " Pill_Fiend. \"Relaxing, Mellow High: experience with Tramadol (Ultracet) (ID 22810)\". Erowid.org. Jun 26, 2007. erowid.org/exp/22810",
  "substance": "Tramadol (Ultracet)",
  "views": "65033"
 }
}
