{
 "title": "Trees Grew Beer and Lemonade",
 "author": "DID",
 "citation": " DID. \"Trees Grew Beer and Lemonade: experience with LSD, Alcohol & Cannabis (ID 14476)\". Erowid.org. Jan 26, 2008. erowid.org/exp/14476",
 "substance": "LSD, Alcohol & Cannabis",
 "bodyweight": "60 kg",
 "report": "<p>Being now all in retrospect, I can safely come out with my enlightening story of my 1st trip. </p><p>It was about a week after my final year in school, me and a group of friends decided to celebrate down at my mates farm, just east of Melbourne.  It was summer and the weather was beautiful.  The farm was surrounded by about 4-5 lush paddocs with a few cows and a large stream running about 4 mins walk away.  The best part was the mountain range running right over our heads featuring a very dramatic rocky cliff face right on our door step.  In other words perfect for the perfect get away. </p><p>Initially I was set just to lay back with a beer or two and mabie a joint or 10, but a friend came down with a good supply of exotics for everyone to take.  One of those exotics being some lsd.  I'd never had lsd but I decided to bite the bullet and live once.  It was the second night about 12 of us decided to do the drop.  Some were 1st timers, others were the teachers so to speak.  I was, I guess understandingly, nervous yet excited and was eager to find out what was going to happen.  I'd seen two of my friends drop the night before and I thought it to be the funniest most interesting thing I'd ever seen!  Looking into a bowl of water with rainbow glitter in it for about 1 hour laughing and hugging each other!  I though to myself that it must of been good but still, it was that damn human instinct, the fear of not knowing.</p><p>We all took 1 tab each at about 7:30, just as the sun was going down, reflecting off the cliff face above us, making it a deep orange. We had the best of day and night I guess.  We were all sitting on the farms verandah, looking at the sunset, talking. At about 8:15 the trip started to ease in, as I noticed rubbing my legs with some kind of nervous pleasure.  I ain't done this before! I was also getting this uncontrollable grin on my face. The conversation initially going from chatty to a more, 'How we feeling!? How we feeling guys!?'  The group became more relaxed and in depth with one another.   Not really conversation talking but talking about on the spot things, i.e. How good are ciggies! Is there any beer? Put on that song! etc.  Yet being a little lost for words, I didn't care a single bit and just decided to let the drug take me.  I had good company, surroundings, the night was warm and the music was fine.  Every thing started to slip into place.</p><p>By 11pm, it was a free for all. Although we all stayed in the one place, conversations broke off into groups of 2-3.  Around this time, things started to get curiously weird and wonderful.  Looking at my cigarette, I started to see a little castle on a peak of molten rock.  I was so amazed at this 7th wonder of the world that there must be more out there to experience.  I saw my friend, Tam's having a neck massage and it looked good!  Tam's said it was so good she was more than happy to give me a try.  I closed my eyes and melted into my seat as these hands seemed to touch my every neural sense.  With colours and fish net like patterns flowing and morphing into ever more patterns and colours. </p><p>And that was it!  I was in the land of the lala people!  All the trees that were around, started to grow bottles of beer and lemonade on them (true!).  It was like I had just won the lottery!  So I started running off to all the trees, picking beers and lemonade off the trees for my bemused friends to drink.  There was so much of the stuff that this went on for about half an hour (seemed like 2 hrs).  The finding even extended to crates of beer and soft drink, under the trees.  I have to say, I did get a little protective of my treasure! THESE ARE ALL MINE!</p><p>After that, I decided to go inside for the first time of the night and have a look around.  I saw the telly on but not tuned as it was all buzzy beeish.  The rest of the night was really just walking around looking at stuff with a huge grin on my face.  Being the last one up at about 6am, I later died in the hallway after about 20 billies. </p><p>I have to admit, the come down wasn't very nice.  My brain was mush the next day.  I had never really been the same after that first trip as I had perceived things never before the same.  I don't want to glorify LSD over all.  Just this particular overpowering mindful experience of the senses.  I'd had some very nightmareish ones after that, a couple of years later.</p>",
 "year": "1997",
 "id": "14476",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-26T08:00:00.000Z",
 "views": "3553",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": "10 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
