{
 "title": "A Deconstruction of Time",
 "author": "Lacan",
 "citation": " Lacan. \"A Deconstruction of Time: experience with Salvia divinorum (extract 5x) (ID 14473)\". Erowid.org. Jul 19, 2005. erowid.org/exp/14473",
 "substance": "Salvia divinorum (extract 5x)",
 "bodyweight": "170 lb",
 "report": "<p>Two nights ago, I had my first true experience with Salvia. I had tried several times before to achieve a psychedelic experience by smoking the plant, but had been unsuccessful in attaining anything more than a slightly weird feeling and general light-headedness.</p><p>I was frustrated by my earlier failed attempts, so on this evening, I decided to load the bowl of a bong completely with 5x extract, a dose higher than I had tried previously. My girlfriend sat on her bed and acted as an observer. I was moderately nervous about smoking the Salvia. I smoked the first bowl completely and inhaled a large amount of smoke. As I held my breath I tried to pack another bowl and light it, but my lighter continually failed to light. I soon realized that it didnt matter; I was rapidly descending into an altered state of consciousness.</p><p>Before I continue with this report, let me make a disclaimer that certain aspects of this trip transcend far beyond the descriptive capabilities of language. I can attempt to describe my experience, but in no way can I completely convey to someone else such a subjective experience. Salvia took me into a realm beyond discourse.</p><p>I was sitting on the floor and turned my head to look up at my girlfriend on her bed. This simple action, which objectively took maybe three seconds, was the single most distinct, bizarre and frightening aspect of the entire trip. During the period it took my body to move my sight from the floor to my girlfriend, my mind was detached from time.</p><p>Just as I felt I should have been completing the motion of looking up at my girlfriend, I found that, in fact, I was just beginning the motion, and I realized that it might take me an eternity to complete the action. It was as though I was trapped outside of time, watching it pass at an excruciatingly slow pace, unable to return my consciousness to a reasonable perception of time.</p><p>Then, I realized I was attempting to say something to my girlfriend, but I felt I had already said it, and I was repeating myself, while, at the same time, I felt that I hadnt yet said anything. I perceived time non-linearly. I was about to say something, saying something, and just completing a sentence, all at the same time.</p><p>I should point out that all of this time-distortion was incredibly frightening. This was not a fun experience, by any means. I was worried that my skewed sense of time would prevent me from returning to a normal state for what might seem like an eternity. If all of time lost its meaning, as it seemed it had, then how would I ever be able to make sense of anything again? An intense fear accompanied my confusion at the inability to perceive time.</p><p>I finally completed the motion of looking at my girlfriend. Her face was slightly distorted, with exaggerated features. I recognized her as an entity, but not as my girlfriend. She was smiling, and I could not determine if she was a friendly entity, there to help me, or an unfriendly one who was somehow participating, and reveling, in my confusion.</p><p>I looked away, and then the visual aspects of my Salvia dream took over. While I was on Salvia, I was able to perceive real objects, but anything I did not concentrate upon, seemed to cease to exist. As I turned my head away from my girlfriend, her bed, the floor and the desk next to me became a sort of three-dimensional atlas in which I was trapped. The bed and desk seemed to shift from being their normal mundane selves, to being huge continents, with the floor as the ocean between them. I was in the midst of this room-sized, 3D atlas, and I felt like I was floating amongst the continents. (My girlfriend later told me that during this stage of the trip, I simply kept looking around the room repeating the words, This is weird, over and over again).</p><p>I was still feeling a great deal of fear left over from the time distortion experience and I suddenly found myself at the door of my girlfriends room. I was beginning to come down from my trip and could now tell the difference between reality and what the Salvia was making me see. I still had a vague notion that there were entities in the room that wished to either help me or hinder me in some way. My girlfriend was one of these entities. I wanted to get away from them, just in case they were evil. I opened the door and left the room. I told my girlfriend what I was doing, just in case it was her, though at this point I still wasnt sure if she was my girlfriend or something more insidious.</p><p>I went into the hallway then shut myself in the bathroom. It was in the bathroom that I returned to reality. My girlfriend was outside the door calling my name, and I was sure of who she was. For some reason, my mind needed me to go into the bathroom to ground itself in reality once more. When my girlfriend asked me why I went into the bathroom, I told her that I wasnt sure, I just needed to.</p><p>Similarly, I got the sudden urge to take a shower, and knew that I had to do it in order to free myself completely of the Salvia. I took a hot shower, still perceiving the world as slightly weird. This weird feeling lasted for another hour or so. I was also cold and shaky; I believe because of the adrenaline my body released while it was under such intense fear at the beginning of the trip.</p><p>My conclusion is that Salvia is an amazing, intense plant. Nothing could have prepared me for such an intense distortion of time. I want to reiterate that I would not consider this experience as fun in any way. It was one of the most frightening experiences of my life. That being said, however, I believe I will try Salvia again sometime in the future, though not for a considerable period of time. I believe I can learn further about how perception constructs reality, and I look forward to those lessons, but I sincerely hope that to achieve that learning, I do not have to go through such a harrowing experience again.</p>",
 "year": "2002",
 "id": "14473",
 "gender": "Male",
 "timestamp": "2005-07-19T07:00:00.000Z",
 "views": "4212",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "250 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
