{
 "id": 14475,
 "title": "Sitting Up or Standing Down?",
 "date": {
  "submission": "2005-05-09T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Psilo_smylin",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150",
    "grams": 0.15
   },
   "administration": "sublingual",
   "substance": "Moclobemide",
   "form": "pill/tablet"
  },
  {
   "time": "0:10",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "smoked",
   "substance": "DMT",
   "form": "extract"
  },
  {
   "time": "0:10",
   "amount": {
    "unit": "mg",
    "quantity": "60",
    "grams": 0.06
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-6x"
  }
 ],
 "report": [
  "150mg Moclobemide (MAOI) Aurorix Tablets (sublingual/ oral)",
  "~100mg of DMT (Crude Crystals) made from: Phalaris aquatica var.Australian, Psychotria viridis P.carthaguensis, Mimosa hostilis rootbark) (inhaled/ smoked)",
  "60mg of Salvia divinorum 6x Enhanced Leaf Extract (Australian Grown) (inhaled/ smoked)",
  "PRELUDE:",
  "It has been about a month since I first tried smoking a DMT extract, which I was very pleased with, but I didn't quite 'break though'. Over the past two weeks I've been working on a simple DMT acid/ base extraction (shellite & methanol) from various rich sources (mentioned above).",
  "Several days ago I smoked a largish quantity of the less refined tar I'd extracted. It was quite harsh and although I had a strong 'coming up' feeling, nothing eventuated. So after a little more work I refined & reduced resulting in some small yellow/ red crystals. It should be mentioned that a portion of this was NaCl (Salt), as I choose to use Sodium Hydroxide & Hydrogen Chloride ;)",
  "After the last failed attempt at smoking I decided that I would use a small dose of a MAOI for the experience. I choose the Salvia extract in place of the traditional & inert oregano/parsley flakes because I was familiar with the taste and effects.",
  "T + 0:00",
  "I was in a positive mood, excited by my efforts and the anticipation of a successful experience. One 150mg Aurorix Tablet was chewed and held in mouth for around five minutes, then swallowed.",
  "While waiting for MAO Inhibition, a pinch of Salvia divinorum extract was added and stirred with a slightly moist mixture of methanol and DMT extract (to soak it up), then heated until dry. The DMT covered Salvia was then packed into a small gauze cone (bowl), mounted in the dry pipe and DMT crystals placed on top. A thin glass pipette tube was also packed with a small quantity of the DMT crystals.",
  "Roughly ten minutes after taking the MAO I began to feel a very mild yet discernable mood lift and warmth, followed by a quick contemplation of my recent diet; no cause to worry I confided myself.",
  "I was ready.",
  "T + 0:10",
  "Heating the thin glass pipette, I drew softly but deeply, I put it down and grabbed the loaded pipe, lighting a match over the candles flameI toked hard, however a recent break from smoking had limited my lung capacity. I re-lit the match off the candle while asking myself if Id be able to take another toke if the effects from the pipette had kicked in, at that point something happened. I felt a familiar pulling on my face, only this time it was an even pull, not just from the left.  Suddenly my body seemed to lurch back and my vision focused forwards through the smoke and manifested colours and patterns.",
  "Somehow I found myself reaching for the pipe through this maelstrom of activity. Although coordination was not at all hampered I was slightly confused as to why I was toking down on the pipe I was reaching out for and also holding to my lips.",
  "It was as if the action was automatic with practice, but the timing and visual perception was distorted and delayed. I placed the pipe down in front of the candle and shook out the match; my vision focused intensely on the glowing pipe before me.",
  "The pipe was luminous from the candle-flames radiance.  From the cone spouted geometric, neon-green, gridlines that joined and pulled away from my face & eyes, behind & through my peripheral field of vision, a meter or so out from my shoulders and arched over to complete the loop spouting from the cone. I sat in awe watching these gridlines, I noticed that some lines/ grids on each side were flowing inward and some flowing outwards to complete the loop from cone to eyes.",
  "At this point I remember only feelings of excitement and intrigue.",
  "Words began to form in my head, a question",
  "'Am I sitting up or standing down,",
  "huhhwhhhat?",
  "I almost laughed.",
  " Im sitting, I know that Iwas",
  "Without changing my stare I lay my hands down beside me just to make sure.",
  "The reassurance that I was still sitting on my bed seemed to ground me a little, so I flopped down sideways onto the mattress.",
  "T + 0:20",
  "Thereafter the experience faded quickly.",
  "I lay in bed for a while going over the experience, wishing I could carry it on into my sleep.",
  "Within about half an hour I was asleep.",
  "I slept well and felt a little better than usual the next day, afterglow or antidepressant MAOI action, Im not sure.",
  "It was a combination I would like to explore further but I dont really feel the need.",
  "Please take care, especially when using MAOIs."
 ],
 "erowid": {
  "id": "22803",
  "citation": " Psilo_smylin. \"Sitting Up or Standing Down?: experience with Moclobemide, DMT & Salvia divinorum (6x extract) (ID 22803)\". Erowid.org. May 9, 2005. erowid.org/exp/22803",
  "substance": "Moclobemide, DMT & Salvia divinorum (6x extract)",
  "views": "15263"
 }
}
