{
 "id": 14489,
 "title": "Learning New Ways of Living",
 "date": {
  "submission": "2003-04-14T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SAJ",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "capsl"
   },
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "capsl"
   },
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "capsls"
   },
   "administration": "insufflated",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "capsls"
   },
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Vitamin C"
  },
  {
   "time": "12:00",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Paroxetine"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Tryptophan",
   "specific": "5-HTP"
  }
 ],
 "report": [
  "I have a strong need to write this report about some mental health problems I have been experiencing which most likely relate to ecstasy use. Im 35 and have been taking drugs on and off over the last few years. I didnt take any drugs at all (except for alcohol) before age 27 and I never noticed or suffered from any mental problems until recently. Drugs I have taken over this period and the approximate number of occasions are as follows: ecstasy 45, mushrooms 5, LSD 10, GHB 20, coke 10, meth 2, 2CB 2, 2CI 1, MDA 1, ketamine 3, nitrous 20, pot ? (Im not a big smoker.)   In general I take quite small amounts, for example I have never taken more than 1 hit of LSD or more than 2 pills of ecstasy in one night and I dont normally combine drugs.",
  "I was doing E fairly regularly and I started feeling a bit freaky a couple of years ago; I began to have strange head rushes when I was sober as though I was too awake and wired, finding it difficult to calm down. This was particularly annoying since my job requires quite a lot of concentration and I would start having these weird moments when the tension seemed to build up too much and Id have to get away from the computer and lie down. This caused me to reduce my drug consumption significantly and stop taking ecstasy to the point where I was starting to feel a lot better by summer 2002.",
  "In September 2002 I went to Burning Man and unfortunately for most of the time I was ill with a cold and so I didnt take anything except Tylenol. However by the Friday night I was feeling better and decided to take E and party all night since I had been in bed most of the week. I took two gelcaps (that tested positive with Marquis reagent) about four hours apart and I also took 500mg of vitamin C approximately every two hours. I had a great time, biked around, met a lot of people and felt really euphoric. When the sun was just about to come up someone suggested we take some more E and so we snorted about half a pill each and sat there watching the sunrise  it was sweet! Then later I took the rest to make a total of three gelcaps in the space of 12 hours.",
  "By 10am I was coming down and we were all tired, so I took 20mg of Paroxetine (an SSRI) to help mitigate against neurotoxicity and then I tried to get some sleep in the shade. Unfortunately however it was getting really hot and I think it got up near 100 degrees and I found it really hard to stay cool. I was drinking lots of water and pouring it on myself but I felt way too hot and really light headed as though I was cooking alive; people were asking me if I was OK, and I felt like shit. Later it cooled down, but I think it was not good for me to get that hot on the comedown. During the following week I took some 5HTP (probably about four 50mg doses.)",
  "Things were OK for a while, but about two weeks after the experience I started feeling pretty bad on a regular basis and I began to have anxiety attacks. I would feel tightness in my chest, and a rushing feeling of fear and my face would go red and Id start hyperventilating then forgetting to breathe in alternation. It began to get so I couldnt stand to go to meetings at work or drive because I thought I would get anxiety attacks and wouldnt be able to function or talk about work without freaking out. I started to get a lot of stomach pains and intestinal cramps and just about every other symptom of stress. I couldnt tolerate caffeine and I was grinding my teeth so much that I had to have a root canal in an otherwise healthy tooth.",
  "After about a month it got really bad and I was feeling like this for quite a large percentage of each day; everything was out of control and I couldnt deal with just existing. Every little moment by moment stress of the normal work day was enough to start me going. I was in a perpetual state of trying to calm down. Even trying to think about what projects I wanted to work on triggered me into a state of fear and I would have to spend ages trying to meditate and get into a relaxed space, breathing regularly. The panic attacks would last for hours. It was impossible.",
  "I went to my doctor and she gave me some Xanax (I was not previously on any medication.) This actually helped quite a bit - at least to give me some way of controlling things when it got bad - but it wasnt a complete solution. What seems to have helped is time and learning new ways of living. I am writing this in April and to a large extent things are under control. Starting from around three months after taking the Es it seemed like the symptoms were getting less. I had also started doing meditation, regular workouts and yoga and had talked to a psychiatrist a few times. I also tried to reduce my work load as much as possible. I am not fully back to normal but at least I am quite functional and a lot happier now.",
  "I cant be certain that the ecstasy was the cause but it seems quite likely. I hope that people can learn from these experiences and also can have some hope that things might get better for them if they are experiencing similar problems. I can no longer tolerate any stimulants and I have to take a lot of breaks from stress but at least I am not freaking out anymore."
 ],
 "erowid": {
  "id": "22864",
  "citation": " SAJ. \"Learning New Ways of Living: experience with MDMA (ID 22864)\". Erowid.org. Apr 14, 2003. erowid.org/exp/22864",
  "substance": "MDMA",
  "views": "49627"
 }
}
