{
 "id": 14486,
 "title": "A Learning Curve",
 "date": {
  "submission": "2007-10-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Mangle"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(liquid)"
  }
 ],
 "report": [
  "My friend Dillan and I had been very interested in the psychedelic side of life for a long time and we had both wanted to try mushrooms or acid for quite a while. We had both been smoking bud for a couple of years and although it was still pleasurable, it was getting boring just sitting in smoking and listening to Pink Floyd all night. We decided on mushrooms and I took on the task of growing them, and didn't tell him I was until they were ready.",
  "On a sunny afternoon in southern England we decided the time was right and consumed 2g of shrooms blended with orange juice. I was extremely nervous and the taste didnt exactly build me with confidence so I drank them quite slowly, hoping I would get used to the taste. We then sat outside in my garden and waited.",
  "After about 20 mins I was getting strange feelings in my stomach, kind of like when I am about to make a speech in front of loads of people and I'm not sure if I feel sick or not. This feeling would come and go every couple of minutes or so. The first sign I had of something was happening was the cracks in my crazy paving slowly moving forwards and backwards in time with my breathing. I looked at Dillan and he had huge pupils and a big smile on his face. I looked across my garden and I couldn't believe how beautiful it was. I could see every leaf and blade of grass around me in such fine detail. The grass was seperating into layers and flowing like waves in the sea. The hedges were stretching out towards the grass and swaying in time with every breath. I felt like the inside of my body was a thick warm liquid and my arms were melting and dripping off the end of my fingers. I couldn't stop yawning and every yawn was nicer than the last. I suggested we went inside so we went up to my room.",
  "I had never noticed so many different colours in my room and all I could do was to slouch on my bed and stare at them all with fascination. The colours would reach out and touch me. I understood why I had designed my room the way I had done as if I didn't know it at the time. I put on under the bridge and we sat back and looked at everything, pointing it out to each other and talking about what we were feeling. We just couldnt stop talking about tripping and trying to explain it. My mind was racing thinking of my life and the way people in my life saw me. I thought of how differently my friends look at me than my family or people at work. I would then think about how other people would view me even though I had never met them. This was all going around in a big loop and I kept reminding myself I had already thought of it a couple of seconds ago.",
  "It had been about 2 hours I guess but it felt like we had been tripping all day. I could see Indian tribal faces in the walls like the ones on the front cover of Axis:Bold as Love. These faces were trying to tell me something in my mind that I could not understand. I felt on was on the verge of something that I had no knowledge about.",
  "We then found ourselves downstairs in my living room sitting in front of the fireplace. I put on the TV but it was unwatchable. The people seemed so fake and pathetic, talking about things that really didn't matter and getting themselves worked up over the lamest things. I turned it of and immediatley the fireplace twisted itself and then unravelled in a split second.",
  "After sitting talking about random things for half an hour I noticed the trip seemed to be weakening and the visuals were calming down. Everything was floating and settling into its place. I felt very calm and focused and that I could do absolutley anything I wanted, but all I wanted to do was sit and enjoy what had just happened. An hour later all the visuals had gone and I was left with a sense of inner peace and complete calm. We spent the rest of the day smoking bud and chilling out. I believe I found out a lot about myself and the people in my life that day and I would recommend shrooms to anyone interested in learning about themselves. I cannot explain how powerful and emotional the experience was, I don't think anyone can."
 ],
 "erowid": {
  "id": "22851",
  "citation": " Mangle. \"A Learning Curve: experience with Mushrooms - P. cubensis (ID 22851)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22851",
  "substance": "Mushrooms - P. cubensis",
  "views": "2486"
 }
}
