{
 "id": 14498,
 "title": "A Night with the Usual",
 "date": {
  "submission": "2006-02-10T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Larzo",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco"
  }
 ],
 "report": [
  "I was stuck at home on a friday night and I figured I'd make the best of it and have a little party with myself.  I looked around the house and located a bottle of Irish Cream (60 proof).  I poured myself a tall glass full with the intentions of chugging it.  However I got sidetracked and went looking for a gram of regs I had left over from a session with my best friend the day before.",
  "I found the marijuana and surveyed that I didnt have anything at hand to smoke out of because I lent my bowl to a friend of mine.  So I grabbed my pack of cigarettes and began to pinch out about half of the tobacco in 5 cigarettes.  I later filled the half empty cigarettes with the finely ground marijuana and smoked them throughout the evening, about 8-11. ",
  "At 11pm I drank the liquor and smoked a cigarette and was ready to sit back and relax.  The mood was so lifted and despite being stranded alone at home, I was having a blast of a time.  This isnt such an extraodinary event, im sure many people do things similar to this.  I do it whenever I have the necessary ingredients and im home alone or bored.  As simple as it may seem, these three substances when used together have such a perfect harmony.  Whatever the chemical reasons may be, at the same time, all three create an ideal euphoria.",
  "I sat back and relaxed as all of my worries drifted away and I turned on the television so I could drift off into whatever movie I began to watch.  I smoked a few more of these very strong cuban cigarettes I had left over from a recent trip to mexico.  Each time I smoked I got the smallest, most perfect lift back into my state of bliss.  All in all, what posed to be a boring and dull night turned into what couldnt have any more fun."
 ],
 "erowid": {
  "id": "22884",
  "citation": " Larzo. \"A Night with the Usual: experience with Alcohol, Tobacco & Cannabis (ID 22884)\". Erowid.org. Feb 10, 2006. erowid.org/exp/22884",
  "substance": "Alcohol, Tobacco & Cannabis",
  "views": "13458"
 }
}
