{
 "title": "Addicted and Loving It",
 "author": "Goddess71277",
 "citation": " Goddess71277. \"Addicted and Loving It: experience with Cocaine (ID 14497)\". Erowid.org. Jun 25, 2007. erowid.org/exp/14497",
 "substance": "Cocaine",
 "bodyweight": "135 lb",
 "report": [
  "<p>I am writing from inside an increasing addiction to my favorite drug. I did coke the first time when I was 17, with a very hot boy who was an excellent lover. He would have me drive him to the city to buy and sell drugs. I loved it from the first time, the smell, the feeling, the horniness. I wasn't exactly a coke whore for him, I'd have hung out without the drugs, but it was certainly a bonus. I didn't do it anymore until I was 24, mostly because I was in a very domestic relationship and had a little boy.",
  "After I left that relationship, which was unhealthy, I started hitting the bar scene in my town and lo and behold, my town is in the middle of a cocaine 'epidemic, which to me was just a stroke of good good luck. It's everywhere. I do it because I'm bored, because I want to feel happy. I know all about dopamine levels and all the other reasons cocaine works and why it brings me down farther than when I started when I come off it.",
  "Recently I've been messing with a very good looking coke dealer, which I recognize to be unhealthy, but the sex and the drugs, and yes the combination are just too tempting. I'm very smart and generally have a non-addictive personality, but lately I've had three separate experiences of staying up all night, splitting a teener (1.75g) with this man. Usually I can sleep on moderate levels of coke, but not that amount. I've missed some work. I've started to realize that I've done lines in the bathrooms of just about every bar I've gone to this year. I carry around between a gram and an eight-ball in my car or purse at all times.",
  "I roll it around in my vial and think 'I love you.' I have a professional reputation by day, and even by night only a very few people know I do coke at all. I feel fairly confident that I'll get bored of the coke and let it go at some point - I hope. But I thought it might help to contribute the perspective of someone who is still on the upside of developing a habit. Every time I'm scared I might have a heart attack, especially when I smoke it off of foil, I know unprocessed coke can kill me. Especially when I do huge rails for the fifth time at 3:00 am. But it is beautiful and white and it is happiness in a jar.</p>"
 ],
 "year": "2002",
 "id": "14497",
 "gender": "Female",
 "views": "3391",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2007-06-25T07:00:00.000Z"
}
