{
 "id": 14499,
 "title": "Group Introduction to the Goddess",
 "date": {
  "submission": "2004-12-16T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bhodi Loco"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Salvia divinorum",
   "form": "dried"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "Myself and a circle of close friends gathered over the weekend to discuss and experience the leaves of this rapidly spreading plant. I have things to report...",
  "First, though, who the hell am I? Well, I'm a sort who cares about our world, our people, our minds and spirits. I have experienced the gift of lucidity within dreams at a young age, and have persued and perused this area at a casual level, carrying on over into meditation, trance states, and eventually...psychedelics. I've experienced LSD, Mushrooms: both at low, user-friendly levels (Nothing exceeding 3hits/grams). I've been experimenting with supplements in terms of altering and amplifying dream vividness and intensity (B Complex, Calcium/Mag, 5-HTP, etc.). I've rolled with Es both clean and not-so-clean, and danced with flips both candy and hippie. I've been told I've made some excellent Marijuana Bruscetta in my day.",
  "Those who 'travel' with me say that I have a really good and open vibe. One that's extremely contagious. This attitude from others, as well as my own compassionate interest in the well-being of others, has landed me in the roll of 'Experience Guide', a roll I take with great honour and respect. Having said that, I now have some news from the Salvia front. First the !!! unpredictable !!! experience, and then advice to the user, and then, and most importantly, the sitter.",
  "It's important to report the many different experiences I and my friends have had, just so that the reader will appreciate the wide range of reactions this leaf can generate. My partner Xan and I had just been carefully exploring the Salvia over the Solstice Holidays: I had an intense experience the first time and this should stand as a lesson for those who think to take this !unpredictable! leaf lightly. I had aquired a 500 mg quantity of a x5 extraction, and had calculated the dosage to about 200mg. Intending to just experience the first fuzzy levels of her influence, I smoked a 100mg quantity while in bed with Xan. I inhaled deeply while burning the leaf with a steady flame from a butane lighter. The flavour was distinct, potent but pleasant. I passed the pipe to Xan, who finished the embers. Before she could pass the pipe back I was struck hard:",
  "I came up VERY quickly, my body began to buzz and my head went soft and a little bit tingly. The walls and light-play in the room began to vibrate with waves of energy, flowing left to right. It had a sharply pixilated feel to it, as opposed to the paisley fractals of acid or 'shrooms. And then I felt my Self being pulled at. I felt as though I was being drawn out of my body! This was only to be a test-flight, folks, and here I was with the door being flung wide open...I wasn't ready. I was worried about Xan, and what she must be thinking, and she probably wasn't expecting this, I wasn't expecting this, and I better lie down and let go, but I can't leave Xan, 'Are you Okay?' I ask her, and she looks at me funny, and I'm still only half propped up on my elbows -- I was on my way to lying down and must have been distracted along the way, Xan must think I'm in trouble, 'Are you Okay?' I ask her, I feel like the walls are about to shift away and reveal the expanse behind their simple three-dimensions, I'm so tense, I should lie down -- Oh yeah, I was doing that for a second, this stuff has really sent me on my ass, I hope Xan is alright, 'Are you Okay?', she looks at me funny, maybe a little bit annoyed, am I freaking out?",
  "I can't belive this stuff has me spun like this, I should lie down and go into it, holy cow! I was lying down or trying to, anyways, I should finish this lying down thing first before I try anything else, I can't belive it stopped me in the middle of lying down, Xan must thing I'm looped! 'Are you Okay?' I ask her. Am I okay...",
  "I never actually got to lie down. It only lasted about ten minutes, but it could've been a great experience if I hadn't taken it so lightly. Through all of the following day I had a warm post-adrenaline edge, and felt very alive, very vital. Salvinorin A is the active chemical in Salvia, and is the most potent naturally occuring psycheledic molecule (DMT is apparently dreamy compared to this).",
  "The Saturday after Intention, Xan and I tried 150mgs each of the same x5 extraction, I first, then, after I settled down, Xan would try. This time we would hold the leaf with the respect it deserved. It was a planned, and deliberate inhalation of the leaf essence, and NOT a spontaneous peek through the window. This time I did not get the tugging, pulling-away I had the first time. I had an intense buzz, and the room was vibrating far more intensely...this time it was very sensual and very stimulating. Xan tried it and found it to be buzzy and slightly visual.",
  "I acquired some straight leaf and some x10 extraction for the circle. Friends were interested and had been asking about the experience, so Xan and I had planned an 'evening of experience'. For the evening our invited friends sat around our living room examining the material as Xan and I described our experiences, and passed on the knowledge we had picked up off the net. Some friends went online to read other information and experiences.",
  "We began with an introduction to the straight leaf at low levels -- one bowl each, maximum. (Xan and I had tried this earlier and found it to be closer to a marijuana experience, though more 'high' than 'stoned', with light visuals). Everyone experinced the flavour and the 'energy frequency' of this plant. The experience is unique and distinct on every level and its important to wade slowly into the experience, unless you want to end up babbling while propped up on your elbows.",
  "I made one exception this evening. Our friend M. is more into the mind-essence than the body-essence of entheogens and wanted in right away. I obliged, as I was confident that I could guide him into and through an introductory experience. I had him lie comfortably on a bed, breathing deeply and guiding him into a state of deep relaxation. I explained the process of smoking (inhale deep, hold, exhale), and explained the immediacy of the effects, the physical sensations, and reassured him of my presence through his entire journey. I prepared a pipe for him with 100mgs of the x10 extraction. He partook, and leaned back into the bed. He then proceeded to describe a fantastic series of psychedelic visual effects, both eyes open, and eyes-closed. He had pastoral sensations: farms, wagons, etc. nothing too vivid, but the definite essence. Wanting a deeper experience, M. requested a larger dose, and I accomodated. He consumed another 150mgs of the extract without going into a deeper state. He found it quite enjoyable.",
  "Two others ventured into the x10 realm. One experienced little but the buzz and the 'sensation that he was a giant lying on a town, his hands resting on the roofs of the village'. The other had a 'drowning' sensation, and stood up to lift himself up out of the water. He then began to wander around aimlessly. It was necessary to redirect him away from a descending staircase and into another room where he soon recovered his sense of control and motivation. These accounts are vague and second hand...the travellers themselves may have additions and corrections to these reports, but the vast difference in experience should be obvious, and all from the same dosage of the same extract.",
  "What follows is an important lesson to both users and sitters/guides. After everyone had their first experiences, Xan tried a large dose of the x5 extract (about 200mgs). She had become a little bit skeptical in relation to the relatively light effects of the x10 with the new users. She sat on the edge of our bed and inhaled deeply the smoke from the pipe. She looked up for a second in casual expectation, and then suddenly her eyes widened slightly and she began to laugh. I had trouble figuring out if she was lightly high and wanted more, or if she was struck. She almost slipped off the bed, I had to lay her down.",
  "She had been struck immediately, intensely; from her own accounts she was caught clinging between two very vivid and real worlds. A motherly voice was calling to her, telling her that it was all okay -- she could come out and play. According to Xan the voice was offering her another existence as she was being pulled away from her reality and being shown a vast expansive alter-reality. Xan had an intense physical feeling of falling backwards out of the universe so she tried to hang on because she was terrified that she wouldn't be able to return. She felt Very Small! She literally clung to my shirt collar, calling out for me to pull her up. I, only existing in the reality of the bedroom, thought she was asking me to pull her up into a sitting position. I succeeded, but she kept calling out to me regardless of her posture. Her eyes were open, she was frantic and grabbing me in a state of anxious panic. She eventually came back, and explained that she had lost all knowledge that she had smoked salvia during her journey. She did hear my voice and used it as an anchor to pull herself back towards our reality. She reported fantastic visuals unlike shrooms or lsd and that time was not a factor, her journey seemed endless. All in all it lasted 10mins with the after effects of 40 mins.",
  "SUMMARY AND ADVICE",
  "Salvia is a very potent and unpredictable plant. The experiences can range from a low marijuana like buzz from the straight leaf to fun psychedelic visuals and full throttle OOBEs with the extracts!!! The feel and effects of Salvia ARE DIFFERENT than lsd and shroom, in ways that are impossible for me to describe. I found that gauging dosages can be a futile exercise considering the unreliable extract measurements, the unpredictable effects on the individual user, and the likely resistance during first use. It is important to respect the journey you set upon with the plant, because once you start, you have no way of knowing where you'll end up. Start slow and work your way up. Sitters are a must!!!",
  "Word to fellow guides! Take the traveller in gently. Introduce them to the lower states and gain their confidence before allowing a full blown OOBE. When they are willing to take the Big Step, set the environment up for safety and security. Take them into a very relaxed and alert state. During the trip, if they seem frightened or confused, remind them that they have just smoked Salvia, that they are experiencing a wonder, that they are safe, and that the trip will only last a short while. The experience is very dream-like, in that many will forget that they are dreaming. I aim to practise some Lucid Dreaming techniques to see if this will embolden the traveller to follow the Goddess more readily.",
  "Thanks for wading through my thoughts and experiences! Next time Xan is eager to let go with trust and openness, and I hope to meet her there!"
 ],
 "erowid": {
  "id": "22885",
  "citation": " Bhodi Loco. \"Group Introduction to the Goddess: experience with Salvia divinorum (leaf & extract) (ID 22885)\". Erowid.org. Dec 16, 2004. erowid.org/exp/22885",
  "substance": "Salvia divinorum (leaf & extract)",
  "views": "6420"
 }
}
