{
 "title": "A Crackout on Nitrous",
 "author": "Firewater",
 "citation": " Firewater. \"A Crackout on Nitrous: experience with Codeine (with Acetaminophen), Cannabis & Nitrous Oxide (ID 14518)\". Erowid.org. Mar 29, 2005. erowid.org/exp/14518",
 "substance": "Codeine (with Acetaminophen), Cannabis & Nitrous Oxide",
 "bodyweight": "170 lb",
 "report": "<p>My usual crew and I decide it's a good night for some pious experimentation. The four of us meet up and decide we'll do something we hardly ever do; smoke marajuana. Now, we're all fairly experience drug users, us combined having done just about everything at one time or another. I'm more into things like AMT, DMT, 5-MeO-DiPT, while they like to stick with the more tried and true chemicals like MDMA and mushrooms. Anyway, we all pretty much quit smoking pot about six months ago because we didn't like the fact that it made us feel so retarded. IMHO, pot makes me feel like an idiot.</p><p>Moving on, I'd just received a gift of a nice brass cracker and a box of 24 n2o bulbs. We decided we'd smoke a little bit of pot then bust open a few crackers and see where it took us. Earlier that night, I had taken 2 T3s to relax, and D had taken one for a sore arm.</p><p>We smoke the pot, and then D decides to be the first one to kiss the cracker. I bust it in a baloon, and he sucks it down. BANG, he's in a totally ecstatic state. He's laughing like hell, and speaking gibberish. This goes on for about five minutes until he becomes very serious and says that he doesn't feel well.</p><p>In short, D broke. He became very pale, started shivering, and was talking about all sorts of nonsense. He told us that he was being ripped apart, and that he had to start over from ground zero. He eventually puked then went to sleep.</p><p>He was fine the next day, if a little sleepy. Moral of the story, be careful. I'd thought it would be harmless, and instead it turned my best friend into a head-case for about 3 hours.</p><p>Peace.</p>",
 "year": "2002",
 "id": "14518",
 "gender": "Male",
 "timestamp": "2005-03-29T08:00:00.000Z",
 "views": "11605",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ]
}
