{
 "id": 14512,
 "title": "Riding the Wave",
 "date": {
  "submission": "2006-05-24T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "V-Man57",
  "gender": "Male",
  "weight": "192 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl",
   "form": "(patch)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>I have had a lot of history of using opiates, primarily vicodin, oxycontin, percocet, and other commonly prescribed narcotic painkillers.",
  "I have also had much experience with the feelings associated with the withdrawal symptoms which I almost 90% of the time will be completely aware of whenever I cease to take my pills.",
  "I have no real pain, however, I purchase the pills off the street.",
  "Recently, I have tried to quit again, and a new doctor I aquired prescribed me a patch for clonodine which lasts for 7 days straight!",
  "I put it on 26 hours following my last use of opiates, and for the next 7 days I felt NO WITHDRAWAL symtoms to my awareness. It worked wonders. I have been taking Prozac for almost 6 years, and also a drug called Neurontin (for the past 3 years), both of which are prescribed to me for depression.",
  "I do not smoke, however, I chew Nicotine Gum (for the past 2 years), and I drink an average of 4 cups of coffee a day. All of which did not change when I switched from abusing opioid painkillers to the mere application of a clonidine patch.",
  "When I quit the narcotic analgesics, I also quit the habit of smoking marijuana. It has been about 15 days since that first day of being clean, and compared to other times I have tried to quit using drugs, this time has not been too hard. (although it is never easy)",
  "Before I had quit this time, I had not been physically without some sort of opiate drug in my system for at least 3.5 weeks. This has been my experience with Clonidine.</p>"
 ],
 "erowid": {
  "id": "22952",
  "citation": " V-Man57. \"Riding the Wave: experience with Clonidine (ID 22952)\". Erowid.org. May 24, 2006. erowid.org/exp/22952",
  "substance": "Clonidine",
  "views": "16282"
 }
}
