{
 "title": "Best Done In Nature",
 "author": "~Rufio~",
 "citation": " ~Rufio~. \"Best Done In Nature: experience with Nutmeg (ID 14517)\". Erowid.org. Mar 29, 2005. erowid.org/exp/14517",
 "substance": "Nutmeg",
 "bodyweight": "110 lb",
 "report": "<p>As I woke up to an alone house I decided to try some nutmeg. I had faked sick that day, so I was alone at my house with no school. I decided to read up on it a little before doing anything. I decided to do a small dose and see what would happen. I took some echenacia capsles from my herb cabinet in my kitchen and opened them releasing all the contents. Then I ground up some nutmeg on a nutmeg grinder. The total weight at first came out to about 1 g. I swallowed one capsule and ate a light breakfast. Within about 10 minutes I felt the effects. Subtle at first but I couldn't ignore it. It was unlike any other high I've felt. Sort of like being drunk but without the hazyness. Almost a mix between pot and booze but not at the same time. I ate my breakfast outside on my porch. I live in a secluded area.</p><p>It was a beautiful day. 65 degrees and not a cloud in the sky. In May...with trees realzing it's almost summer. My visual sense was greatly amplified. Things felt different. I was enjoying being alone and in nature tremedously. At times I found myself giggling from the sight sensations. Throughout the whole thing I had a clear head tho which is the difference for me between nutmeg and everything else. After about an hour of staring at birds on my bird feeder I decided it was getting less intense. I noticed that as I walked inside to the unnatural world, the effects were drasticly reduced. So I made another capsle of nutmeg, then went outside again.</p><p>It got more intense within 20 minutes. I was in a trance like state. The whole time it was like meditation. After about 2 hours, I returned to the unnatural world.</p><p>I doubt that I even used 2 g. But then again..I'm kinda scrawny, I only weigh 110 lbs. The setting makes all the difference. And Now it's 1:00 and I'm not that groggy. I doubt that I'll have a krazy hangover and sleep for 15 hours. My expeirence was tremedously theraputic. I didn't describe it all that well and I don't think I could in words.</p>",
 "year": "2002",
 "id": "14517",
 "gender": "Male",
 "timestamp": "2005-03-29T08:00:00.000Z",
 "views": "4823",
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(capsule)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(capsule)"
  }
 ]
}
