{
 "id": 14527,
 "title": "An Orgasm with God",
 "date": {
  "submission": "2000-09-08T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "White Rabbit",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "ground / crushed"
  }
 ],
 "report": [
  "A friend of mine had obtained a whole shit load of these 5-MeO-DMT pressed pills from a friend and was into letting us all try an experience with this intense substance.",
  "Im not sure what the dose was [Erowid Note : Many of the 5-MeO-DMT pills currently available are 10 mg] all I know is that it was one pill crushed and storted, and then my friend urging us to hurry into the other comfy room to accept the buzzz.",
  "i sat there for a while looking up at the roof noticing the first on comings of the substance, then just like that a wave of intense feeling, mind and physical, rushed over my whole being with a powerfull force.",
  "I spent the trip, which lasted about a half an hour, writhing on the ground touching and massaging myself all over, unable really to control myself, it was one of the best orgasms ever experienced, just me and my soul. There weren't many noticable visuals, just complete ecstacy coming from within and the universe.",
  "Even after the substance wore off I noticed the similar feeling I would experience after sex, or waking up from a really tranquil sleep, very content and wanting to cuddle anything within my reach, at the time this was the big fat pillow laying next to me.",
  "After the experience me and my two friends talked abbout the experience for the rest of the night, I realized this trip was all about diggin yourself, and the reasons for some of my occasional nervous twitches, which is just my self diggin myself, and therefore I start rubbing my neck, or playing with my own hair, its the kind of trip where you can really learn to achieve your energy requirements from the very soul you're attached to, and to what that higher force your soul is then a part of, wholeness.",
  "I think next time I would be interested in having this experience with a sexual partner, and on top of that with a MAOI for even further exploration of this wonderful world of ecstatic exploration with god."
 ],
 "erowid": {
  "id": "2300",
  "citation": " White Rabbit. \"An Orgasm with God: experience with 5-MeO-DMT (Snorted) (ID 2300)\". Erowid.org. Sep 8, 2000. erowid.org/exp/2300",
  "substance": "5-MeO-DMT (Snorted)",
  "views": "16645"
 }
}
