{
 "id": 14538,
 "title": "Cognitive Functioning",
 "date": {
  "submission": "2007-04-05T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Theintegrator",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I had been using amphetamines (only no meth) for about a year occasionally, when a new student joined our small high school somewhere in GA.  In any case, he was carless so myself and a friend of mine decided that it would be our shared responsibility to give him rides to and from school daily (our private school had no buses).   Well, in return for the rides we each received 20 mg of Adderall or ritalin or whatever he got that day.  We decided to save them for the weekend.",
  "When the weekend hit and the Friday 3pm bell sounded we bounded out to the car and began to eat the small orange morsels like sweetarts.  About an hour or so later we were talking at the speed of light and discussing everything from school as well as other outside world events.  The clarity and frequency of cognitive functioning was enhanced so much that we felt we were able to extrapolate grand theories.",
  "This also comes with hallucinogens, however, maintaining a single thought while on hallucinogens is damn near impossible.  Not on this drug, though.  Arguments soon ensued and we debated consistently throughout every party we attended that night.  People were amazed that we could be this 'fucked up' and still be able to function at levels that were comparable to their own.  The night flew by, and the next day I awoke in my bed with just bits and pieces of the prior evening's events.  However, any grandiose theories that were developed the night prior were still stuck firmly in my head."
 ],
 "erowid": {
  "id": "23038",
  "citation": " Theintegrator. \"Cognitive Functioning: experience with Amphetamines - Adderall (ID 23038)\". Erowid.org. Apr 5, 2007. erowid.org/exp/23038",
  "substance": "Amphetamines - Adderall",
  "views": "6434"
 }
}
