{
 "id": 14536,
 "title": "The Purple Flower Clouds",
 "date": {
  "submission": "2005-09-22T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Cosmo",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I had planned to trip the night before alone in my room, but I changed my mind at the last minute since my last DPT trip was the same, and i felt it would be the same as last time and i wouldn't learn anything new.  So i decided to do it the next day right around sunset.  The sunsets here are amazing absulutly mindblowing every day.",
  "At a round 4:00 pm i start to get ready. There is no one home i start cleaning my room then i took a shower. I feel great and on this trip  i want DPT to help me make a life changing decision that will problably determine the rest of my life. You see im kind of stuck in puerto rico. I use to live in phili then my parents moved back here and im not liking it here to much.I want to move back to the US, but my parents wont help me move unless im going to college and i dont want to go to college right now.So hopefully this trip will help decide if should leave on my own to somewere on the west cost.",
  "Its 4:30 now and every thing is all set i put my Ash Dargan didgeridoo cd on the cd player.I put the 50mg into three differnt lines.I snorted the lines but this time because of my past experiences with snorting dpt i know that my nose will get clogged up making it hard to breath and not breathing well plus the body load makes it hard to focus during the trip.So i wait a while until al the DPT is absorbed then i blew my nose and it worked great i highly suggest doing this.",
  "4:33pm im noticing the first effects so i press the start button.The drums start getting more intense and the didgeridoo sounds deeper and bassier. I feel very energetic every thing starts to get psyhedelicsized this music is very tribal and primitive i cant help it i start dancing like a mad man.I had my eyes closed and I thought i was part of some ancient aboriginal tribe in australia this keeps on goin for like 5 minutes when i open my eyes i realize i compleatly forget that i was trippin and were i was.",
  "4:40 im peakin really hard very little visuls i cant stand up any more. I lie down on my bed and close my eyes for some reason i have very little visuals this time maybe because it was day time.By now the drums and digeridoo combination gets really loud and way to intense. Then i realized that these are the worlds two most ancient instuments percusion the oldest type of instrument and the digeridoo was problably the second. The combo of the two is so primitive this is why the both touch the human soul so deeply the muscic sent me to ancient times. with my eyes closed i could have never known if i was in same far away land and a member of some wild tribe dancing my self to a state of extacy,Dream time as the aboriganies call it.Or if a was some crazy kid tripping and dancing in my room. Now the drums get my heart beat racing plus the body load the digeridoo is just overwhelming I cant take it any more. I get up and turn off the music.",
  "Now with my eyes open i got mayor visuals wierd no CEV. the walls are breathing im seein an eye that i get a lot it changes evrey time a trip and it is always up and to the left, the powercord from my tv witch is on top of a high drawer so i can see from my bed is moving around and has a purple aura to it, my celing fan is scary the screws on it looked like a scary eye. I always find dpt to be very intense like i feel on the break of madness like im about to loose it and the bodyload doesnt help much either.But i love that feeling of madness maybe thats why i trip so much:) the wisest of men enjoy a little madness now and then. I get the courage to get up and get another cd pink floyd's ummagumma cd number 2 i put on.I put it on and lied back down again. I very soon realize that this music is very intense and has some influence of that syd barret high stung madness.",
  "Then that reminded my of how syd barret blew his own mind away and whent schizo from eating so much acid defenitly not a good thing on dpt.then it hit me the way psychedlics work.In order for you to have buetiful visions, conections and epifanies first the regular world has to be changed thats were hallucinations and madness come in.the physical reality has to be distored in order for you the mind to acept other realities and visit other dimesions.This calmed me down. what happend next was ego loss the music was my ego.When i came back i was like wow were was i were did i go it was great that never hapend to me.By this time the body load was over this when you can really focus on one thought on dpt.",
  "6:00pm  I get up and now with the body load over i get that loveley warm psychedelic fuzzines that many people get with dpt.I go to my computer and sit down. Then i look out the window see the craziet sunset ever good timing huh:) to the far west the sky had this spectacular orange glow as if the sky was on fire also to the west were these horizantal orange fluffy clouds  they started low to the earth then slanted upward towards the sun then southwestward were these really round dark rich purple clouds that reminded me of flowers around that area the sky had a purple glow to it too further south the clouds were white and the sky had a lavender blue color.I dont know if there are no words for it really.",
  "The trip felt really warm like MDMA with some of the cleanest acid youve ever had i guess that was as close as ill get to taking some sandoz lsd.So here i am staring in awe at this absolutely blown away especially by the purple clouds they were amaizing and they werent a halucination ive seen them sober before.but the funny part is the whole time i was trying to put this in to words its imposible words are inert sometimes. Slowy i start coming down slowly the clouds are blown away.So i stand up to light up an incense stick and when i come back the clouds were gone then i remember my forgoten purpose of this trip. Of course i must go with the wind and  try and catch the round purple clouds west.",
  "'Go up three more streets take a right go two more blocks drop this guy of at the next corner.'",
  "'Wheres that?'",
  "'I dont either but its somewere and its gonna determine the course of your life.'",
  "  -  Waking Life"
 ],
 "erowid": {
  "id": "23035",
  "citation": " Cosmo. \"The Purple Flower Clouds: experience with DPT (ID 23035)\". Erowid.org. Sep 22, 2005. erowid.org/exp/23035",
  "substance": "DPT",
  "views": "7211"
 }
}
