{
 "id": 14535,
 "title": "A Pep Up",
 "date": {
  "submission": "2006-10-21T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shan",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "90",
    "grams": 0.09
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Being a former pothead, I trained myself to never go to anything 'harder' than, marijuana. A lot of friends of mine had began to take a lot of pills, but there was one in particular that they just seemed to love the most.... Adderall.",
  "As reluctant as I was to try it, I figured that I would just try it once, you know, just to see what all the fuss was about.  A friend of mine had ADD and offered the pills to me. He himself said he never liked to take them because he didnt like the way they felt anymore. 'Mat' gave 'Liz' and I 10 pills total, so we decided we would take the pills together while in school, so the day would go faster.",
  "I took 3 pills at around 12:15 in the pm with some juice and went to class. At first I began thinking really hard to myself 'Why am I doing this! I hate pills, they arent even working!' The time seemed to go by really slow, I thought it had been at least 2 hours after I had taken the pills, but it was really only about 12:45, when I realized I felt great all over. I sat in class and just let this warm buzzing feeling overcome me and it was fantastic. I never really talked much in class, or raised my hand, but this day I was answering every question my teacher would ask. I was very up and really happy. Smiling and talking to people I didnt know.",
  "I was full of all this energy and I just could not stop walking around and talking and touching people and touching things. I did not see any visions or anything, but little ordinary things around me, I became fascinated with and I began to come up with explanations for their purposes (ex. pencils). The things I was saying did not make logical sense, but it didnt matter, because my body felt like it was in a warm blanket or sitting in the sand on a beach all by yourself. It felt like I was in on a secret that nobody else knew about, and I loved this, it made me laugh out loud. After school the effects seemed to only get greater, and I didnt mind because it was great. But when I was around my parents, all I wanted it to do was go away. It felt like I was drunk, but instead of making me  sleepy, it made me have more energy. My parents know me as one who mostly keeps to myself and not talk to them much. I started to have intense conversations with them about everything! I loved every minute of this experience. I couldnt sit down and I drank a lot of water (bad cotton mouth!) I began to take Addys every other day, but I was then put into a drug rehab program for getting caught being under the influence of alcohol. I quit using Adderall because I was scared I might of had to take a drug test.",
  "Oh man, were those days horrible without it. The day I stopped using adderall, I went on a crazy crying binge. I was no longer happy, I quit pot for it. I tried to go back to pot, but it just didnt give me the utopian dream I was once in before. When I quit, it wasnt hard but I didnt like the feeling of reality, and I became horribly emotionally depressed. I remember spending literally 3 days in a hole crying. About everything and anything. I tried to quit and I did, but now I'm back to using, just not as much. I loved Adderall. I still do til' this very day."
 ],
 "erowid": {
  "id": "23031",
  "citation": " Shan. \"A Pep Up: experience with Amphetamines (Adderall) (ID 23031)\". Erowid.org. Oct 21, 2006. erowid.org/exp/23031",
  "substance": "Amphetamines (Adderall)",
  "views": "8454"
 }
}
