{
 "id": 1454,
 "title": "Many Faces of DPT",
 "date": {
  "submission": "2002-05-07T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "extemporaneous",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Acquired some DPT a while ago, and have had it sitting around waiting until there was inclination as well as opportunity for tripping. With school and work constraints, along with mood fluctuations, plans to do stuff like this can be put off for months.",
  "100mg or so of DPT was contained in a capsule which was emptied out onto an old compact disc which was no longer wanted or needed.",
  "Using a rolled up $20, so as to fit the image of a stereotypical coke-head when actually doing nothing of the sort, a small amount of the powder was insufflated.",
  "Initial burn was hardly noticable, so a second slightly bigger pile was taken into the other nostril. This time, burn was more noticable, and unpleasant nasasl drip became immediately present.",
  "The next 30 minutes or so were spent preparing the area and trying to get comfortable, while watching a late night television talk show. During this time, the nasal drip was almost unbearable. Once effects began to manifest (talk show hosts actions seeming more exaggerated, swelling and shrinking of various things on and off of TV), and it was decided that it was safe to take the rest of the powder, remaining powder was taken into the nose.",
  "Immediately after this final dosing, effects of first dosing take hold stronger. Eyes are closed, and attempting to listen to the television, only garbled nonsense words are heard. General body feeling is rather unpleasant, mild shaking and jaw clenching, not nearly as bad as on AMT, and this could all be due to being improperly dressed for the temperature of the room, as all that was worn at the time was shorts, and the room was rather cold.",
  "Once at the peak of the trip, the nasty body feelings mostly dissapeared, but it is difficult to remind oneself to stay put and avoid contact with people. Forgetting that other people were in the house and might not approve of somebody taking strange chemicals, a 'field trip' was taken to the basement to visit the family puppy dog. Animals are always entertaining while on psychedelics. However, once the silliness and riskiness of this adventure was realized, it was easy to get back into the bedroom, safe and sound.",
  "The old Atari 7800 is at this point turned on, the game of choice being Centipede. Once playing, it is difficult to decide whether the game is playing the player or the player is playing the game. Despite the obvious unreality of the videogame, it is frequently accepted as reality, and upon realization of the fact that the videogame is not reality, immediate reaction is to try to find out what IS real. But the game distracts the player from coming to any conclusions by forcing them to further participate, and frequently making them forget once again that the game is not real. It becomes impossible to not play, until in a moment of thought after the death of the controlled pixels it is realized that to hit the power button means no more confusion.",
  "Videogames are decided to be too much stimulation.",
  "During times of silence with eyes closed, the body seems to be a gooey mass, all the senses are closely tied and easily confused and it is realized how much effect one sense has upon the others. Visions are seemingly random yet entertaining. Occasionally, moments stretch on for eternity, and it seems as though you have to voluntarily decide to breathe. Swallowing feels funny, DPT seems to have some dissociative effects.",
  "Remainder of trip is spent listening to music. Creativity is greatly recognized, and perhaps over appreciated and interpreted as much more creative than it actually is. Initially, music selection is the Dead Milkmen, admittedly not the most psychedelic band to ever exist... Yet it still grasps hold of the brain and tosses it about, painting nice pictures and placing you aboard various thought trains... some, inevitibly, with no destination. Next musical choice is Mercury Rev, but by this time the trip is nearly over.",
  "Mood was never constant. Went from frightened to playful to content and back again all within a matter of minutes. Overall, trip was enjoyable, and quite intense, though not quite as bizarre and intense as some previous journeys with LSD. Visual activity is mostly closed-eye, intense abstract minds-eye hallucinations... reality based hallucinations not quite as strong.",
  "Will definitely try again."
 ],
 "erowid": {
  "id": "14492",
  "citation": " extemporaneous. \"Many Faces of DPT: experience with DPT (ID 14492)\". Erowid.org. May 7, 2002. erowid.org/exp/14492",
  "substance": "DPT",
  "views": "16230"
 }
}
