{
 "title": "No Such Thing as Too Much",
 "author": "Kenetoken",
 "citation": " Kenetoken. \"No Such Thing as Too Much: experience with LSD (ID 14549)\". Erowid.org. Apr 15, 2005. erowid.org/exp/14549",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "report": "<p>On many occasions I have used LSD to enhance the visual aspect of the event but always staying to a moderate dose to avoid any possible complications (police, other substances). However, I recently decided that I was going to do a little self-experimenation with some of the strongest paper acid I have ever taken. The purpose of this experiment was to find out if it is possible to waste my supply of LSD by taking too much. For instance, When I smoke Marijuana in a blunt or if I roll up a really fat hog-leg, I use more Marijuana but obtain the same high as if I had only smoked a bowl (minus the nicotine effect in a blunt).</p><p>Over the course of 2 months I ingested various amounts of LSD. Let me also add that my supplier was the chemist so there was no decrease in quality of product. The first dose I took was one hit. The trip was common and comfortable and lasted nearly eight hours. For the next three days I loaded my body with vitamin suppliments and ate very well to prepare myself for the next series of doses. My next dose consisted of one hit plus one hit+1hr. I noticed an increase in overall intoxication and visual patterns. The duration was around eight to nine hours. Again for the next three days I re-nourished myself and to save repetition of facts just know that after each dose for three days I reloaded my body with vitamins and minerals. My next dose was two hits at the same time. I noticed instantly that my trip came on a lot harder, was more intense and lasted a lot longer, almost 12 hours at this point. My next dose was two hits at the same time followed by one more one hour after noticable effects were reached. I noticed each time that the initial dose seemed to determine the intensity from the get-go and the secondary dose seemed to help continue the intensity. For two weeks I did no drugs and ate very well. I decided that this break would help in any tolerance and would also be benificial to my body considering what I had in store for my next round. I needed to do a larger dose to determine how much was being wasted since lets face it three hits isn't exactly a waste.</p><p>So I decided to start off with five hits at once then five more hits three hours after effects began. About 30 minutes after I took the first five hits I went into what I would call an instant peak. I was tripping very hard for only about an hour and a half when all of the intensity dropped. So I decided to take the other five hits and no increase occured. I thought for sure I would have crossed some kind of deminsions at this level but it didn't happen. I decided to wait a week and try again with a much larger dose. 10 Hits followed by 15 hits for a total of 25 hits. Now I wanted to time this so that I would get the maximum benefit of the LSD without wasting any. Basically I wanted to trip harder than I had ever before and get the maximum effect from each of these 25 hits. I had started to see a pattern developing also.</p><p>I took the first 10 hits individually one every 5 minutes for 50 minutes instead of all at once. I started into my trip by the time I got to my 6th hit. It was kind of slow and gradual with little spikes of reality leaving flashbacks. Then it hit me about an hour and a half into the trip. A hardcore peak that lasted for almost 45 minutes. During this time I only saw the colors purple, red, blue, and white. I lost all sense of time (thank GOD for stopwatches) and I could not determine what was real and what was fake. My coordination and balance were no more. I began to wonder if I really should take the remaining 15 hits. When I began to come down and I could hear without the echo again I closed my eyes and stuck the remaining 15 hits in my mouth and swollowed. What happened next was nothing like I expected (of course I was expecting death). I continued to get further from my peak and the intensity continued to drop. But what didn't stop were my visuals. I continued to have outrageous visuals without the peak for what must have been 16 more hours. I was just calm, but tripping.</p><p>So after a few days of recovery I decided to look back on my experience and make my final determination of what is the best dosage regimine for the greatest effect. I learned that taking 10 hits gradually gave me the same effect as taking five hits at one time, only taking ten hits over time made the trip last longer. I also learned that I am are going to do LSD I should decide how long I want to trip. 12 hours is the minimum when going over 3 hits. If I am going for a short trip then I take no more than five hits at one time since I also learned that I can only trip so hard. There is no other dimension to be crossed it is just a set dimension in my mind that I reach each time I trip, just how closely I examine it depends on me. If I want to trip for 24 hours or more and it is possible I might do a gradual increase to about 5 or 6 hits (one hit every 10-15 min) followed by an all at once dose of 5 or 6 hits at the four hour mark. This should get me to the 14 hour range where a ten strip will be needed to continue into the hardest realm of a trip. By the time I reach the 24 hour mark I will be tripping from the acid as well as the lack of sleep which is when the MOST VIVID AND INTENSE VISUAL WILL OCCUR!!!</p><p>So I guess I would have to say there is no such thing as wasting LSD but unless I want to prove something or change who I am I take my hits one at a time.</p>",
 "year": "2002",
 "id": "14549",
 "gender": "Male",
 "timestamp": "2005-04-15T07:00:00.000Z",
 "views": "7261",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": " T+ 0:05",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "2": {
   "time": " T+ 0:10",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "3": {
   "time": " T+ 0:15",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "4": {
   "time": " T+ 0:20",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "5": {
   "time": " T+ 0:25",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "6": {
   "time": " T+ 0:30",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "7": {
   "time": " T+ 0:35",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "8": {
   "time": " T+ 0:40",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "9": {
   "time": " T+ 0:45",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "10": {
   "time": "",
   "amount": "15 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
