{
 "id": 14540,
 "title": "Strangers",
 "date": {
  "submission": "2007-05-21T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ectasy",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "0.5"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "After going to a club one weekend without me my best friend became a totally different person.  It was hard on me because I felt as though we were drifting apart and we had been friends for so long. I didn't understand why she came back all of a sudden liking techno and casually looked at the sky to say 'isn't that so pretty?' Why she stayed over strangers houses and was gone for days.  I didn't know, until she invited me to her world.",
  "The following weekend I went to the club with her but unfortunantly we couldn't find any of those 'little pills' for me, so I sat there watching her roll and not understanding what the hell was going on or what these people were doing.  I decided then that I was never going back there again and never rolling.  I just looked at my best friend and that wasn't her, it didn't even look like her.  I didn't want to do the things that she was doing.  Sharing water with starngers, her eyes rolling back in her head, I didn't realize that she was in ectasy.",
  "The next weekend, I don't know why but I went back.  We were there for probably an hour and still sober, I was getting anxious and just wanted to go home, until she pulled me in the bathroom handed me the half of a pill and said 'it's now or never.' I threw it in my mouth without thinking and chewed, the worst taste I've ever had.  But after chugging a water it went away. ",
  "I found a seat on the stage and answered annoyed 'NO I'm not feeling anything!'",
  "I don't remember the exact moment when I realized that I was rolling, but I remember what it felt like.  A cool cat named Karma walked over to give me a light show after a friend mentioned that I was very single.  As he bent down and began I watched all the colors blending and moving unlike any thing I've ever seen, until he hit me in the nose with the light :)  But he gave me some Kandie for it so it was all good.",
  "We went up stairs to the chill room and sat down to rub each others backs. I had an ill look on my face and he asked me if I needed to go to the bathroom.  Just as soon as I said 'no' I stood up running and still threw up everywhere.  But no one seemed to mind. I just smiled saying 'I threw up, that's so gross!'  I reminded myself of a child.  I was embarrased but at the same time, didn't care, because Karma was there.  This starnger, who took care of me when I got sick and kissed me to reassure me that it wasn't that bad.  Of course, after puking, my roll was even harder.  And things started to blur.  At some point I met Shadow and he treated me well. Just chilled with me because that pink ladie was kicking my ass.  I wanted to dance but could not, I just wanted to lay and be rubbed.",
  "I'm not too sure in which order the following events happened, but many moments stand out in my mind.  For example, I met my soul mate while sitting on the bathroom sink.  A 16 year old girl who got a cramp in her foot as I always do.  We talked for maybe a half and hour in the bathrom and said hello, everytime we saw each other again.",
  "While sitting down with a boy, another walked over to me and kept touching his lips.  He had promised me a make out earlier, so I knew what he meant.  'Now?' I asked.  He answered 'yes' so I patted the floor, he sat down and we kissed.  'you taste good' I said and he handed me his sucker threw up and peace sign and I didn't see him for the rest of the night.",
  "But the most memorable moment was when my best friend and her stranger told me that they were going to get married.  He then turned to her 'Will you marry me?' She nodded yes like an innocent child, saying yes, she would like a treat, ice cream, candy, this stranger's last name. It was special but I immediately was sad thinking that she was leaving me.  That was the first time that we really ever said that we loved each other.  Like every time before was meaningless before now.  We shared how we are each other's family, how we couldn't live without each other, and more importantly, she loves me more than him and would never leave me.",
  "Ever since that night, her and I have been closer than ever before.  Constantly saying that we love each other and how much we mean to each other.  Listening to techno together, having deep, meaningful conversations about how we are goddesses, appreciating the sky together saying 'Isn't it pretty?'  I want to think her for inviting me to her world. Opening my eyes and showing me how to really love."
 ],
 "erowid": {
  "id": "23049",
  "citation": " Ectasy. \"Strangers: experience with MDMA (Ecstasy) (ID 23049)\". Erowid.org. May 21, 2007. erowid.org/exp/23049",
  "substance": "MDMA (Ecstasy)",
  "views": "4350"
 }
}
