{
 "id": 1455,
 "title": "Poisoned",
 "date": {
  "submission": "2005-04-21T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Aaron",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "8 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(tea)"
  },
  {
   "time": " T+ 1:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "In the past 15 years I've tried a large variety of psychoactive drugs.  I have used hallucinogens extensively -- i.e. marijuana, LSD, psiloscybe mushrooms, and MDMA. I thought I'd give HBWR seeds a shot.  I purchased them from a well-known ethnobotanical resource and have reason to believe that they were free of fungicides etc. ",
  "I tried them two times.  Each time I removed the fibrous black-grey coating from the seeds, rinsed them carefully, ground them quickly in a coffee grinder, and filled gel-caps with the resulting powder.  Both times I took the caps with hot decaffeinated tea on an empty stomach.  Both sessions began around 7:00 PM after relaxing, pleasant days.  Both times I smoked a small amount of nausea-relieving herb, first at ingestion and an hour later.",
  "My first experience was a mixed bag.  I took 5 seeds this time.  The effects came on slowy, beginning within 30 minutes and building to a peak 3 hours later.  After an hour, I felt a great deal of sedation and nausea, but also waves of pleasant bodily euphoria.  I lay down for an hour and may have fallen asleep.  I came to feeling fairly intoxicated - I was moderately euphoric, felt mildly drunk, and experienced visual effects like those of MDMA.  Also, alarmingly, I had to work a little breathe.  My throat felt constricted and my face was swollen.  These alarming symptoms disappeared as I walked around investigating the mildly psychedelic effects of the seeds.",
  "My second experience was terrible.  I took 8 seeds this time.  Again it took 3 hours to build up to a peak.  This time the euphoria of the first experience was absent. (I suspect that this just one of those random variations in drug effects.)  It was pretty neutral emotionally.  At their most intense, I would characterize the open-eye visual effects as being like those of Nitrous Oxide, some tracering, some random fluctuation of brightness and color intensity.  There were no CEVs.",
  "But this time the adverse effects were much worse.  I was extremely nauseated.  My stomach was cramping and, most alarmingly, my breathing was extremely laboured.  I was yawning compulsively.  My throat was constricted.  I was badly congested.  My lips and fingers began to tingle.  I lay on the floor with my legs elevated for about 2 hours before I began to feel better.  The next day I was fine.",
  "The 'trip' itself sucked.  It didn't even have any of the metaphysical thrill of a bad trip.  I just felt poisoned.  It was a bit like I suspect a bad allergic reaction would feel, but I am not prone to allergies.  Maybe these were the effects of cyanogenic glycosides.  Maybe not.  I cannot explain what happened.  But I hope that I have provided some useful information here about the possibilities for adverse reactions.  Be aware."
 ],
 "erowid": {
  "id": "14494",
  "citation": " Aaron. \"Poisoned: experience with H.B. Woodrose, Cannabis & Caffeine (tea) (ID 14494)\". Erowid.org. Apr 21, 2005. erowid.org/exp/14494",
  "substance": "H.B. Woodrose, Cannabis & Caffeine (tea)",
  "views": "25080"
 }
}
