{
 "id": 14561,
 "title": "Cliche 70s Visuals",
 "date": {
  "submission": "2003-05-04T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "MDMA-4-ALL",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:30",
   "amount": "0.25 tablets",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:00",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  },
  {
   "time": "6:00",
   "amount": "carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "report": [
  "Dosage :",
  "25mg 2CB. White powder in red/yellow caps",
  "3/4 of a 'white rolex' -> assumed bunk.",
  "Several cannisters of Nitrous.",
  "Setting :",
  "At my house with friends after a outdoors dance-event. 4 of us 2CB trippers, and a few other people recovering from other chems taken at the event.",
  "Mindset:",
  "Excited and happy, but a little tired after a long day. Looking forward to 2CB as it is my favorite chemical, and hard to find.  There was myself, my fiancee C, my housemate D and a good friend N.",
  "We had spent the day at an outdoors festival, dancing and relaxing with friends. We stayed sober for the event, as we planned to drop some MDMA and wait for that to comedown before trying the 2CB together. I had arranged 4 caps, 1 for each of us.  Of all of us I had tried 2CB twice before, C once and the others hadn't been so lucky.  It was D's first experience with any chem other than MDMA and pot.",
  "I have also been reading PHIKAL lately, so was using Shulgin's rating scales which I will describe for people that don't know them. +0 is baseline, +1 is a small, noticable lifting from baseline, +2 is a very noticable high, +3 is a strong high, and +4 is a life-changing experience (Most people only reach +4 a few times in their lives, I believe I have reached it once before).",
  "When we got home I ate 1/2 a white rolex (havn't dropped for about 2 months), and C had the other half. N and M both ate wholes. After almost 90 min there was still no real affect from the pills, so M crushed up her last one and we each did 1/4 of a pill railed. After another half an hour there was still no MDMA affect (Maybe a very weak speed reaction) so we decided to take the 2CB.",
  "T + 0.00",
  "Sitting around talking in M's room. I decided to rail a small amount of my cap and eat the rest, while the others all ate theirs. I took out a very very small amount of white powded and did the bump. It burned quite baddly, and I was glad I had done such a small bump, I could tell a whole line would have really killed.",
  "T + 0:15",
  "I could tell the first affects were starting while sitting outside with friends having a smoke. There was a tiny bit of sliding in my vision, and peoples faces seemed to move a little in the light. Now each other time that I've had 2CB the onset was at least 45 min to get the first alert, so I put it down to snorting a tiny amount.",
  "T + 0:45",
  "Noticable +1 at this stage. I could look at objects and the colours were more vibrant, but still no increased movement or other visual tricks. We were just moving through the house, talking and enjoying having friends around. Most people were either recovering from taking substances while out earlier in the day, and I enjoyed a good talk to a friend who had 2CB while out, and comparing previous stories about this chemical.",
  "T + 1:30",
  "Some light stomach upset, but nothing too bad. Visuals increasing, and I'd say I was at a good +2 by now. Looking at the posters on my walls I could direct movement willingly, forcing any style of visual I wanted. I had good fun for about 10 min playing with a Lord of the Rings poster hanging in our hallway.",
  "T + 1:35",
  "M was sick. Felt better afterwards, but the nausea continued for her in waves through the night.",
  "T + 1:45",
  "Went outside to find C and see how she was doing. She was complaining about strong stomach upset. We talked for a little while more, and she was feeling more and more nauseous. She ended up being sick, and said she felt a lot better afterwards.",
  "T + 1:55",
  "Sitting back in M's bedroom. Talking to N about it, and I can remember saying: 'Hey, I've hit a very very nice +3 now', and the next think I knew it was my turn to be running to the bathroom. Was sick, but felt better almost straight away. Went into my bedroom to listen to some quiet music while I recovered, but was back out to the main party within 10 min.",
  "T + 2:15",
  "Decided to go back and listen to some classical music. I think I was influenced by PHIKAL here, having read how Shulgin was always listening to classical. I asked C to bring in a bucket, because I was still feeling unsettled. She got a large red bucket from the laundry, and continued to tease me about it for the rest of the night. We closed the door and listened to one of her favorite classical tracks while cuddling and talking. While listening to the music with my eyes closed my visuals were particularly intense, and the music moved me in quite a profound way. I was crying at one particularly sad sounding piece.",
  "T + 2:30",
  "Warning - Sexual content",
  "I know my friends read these, and if you would rather not read about C and me doing naughty sexy things, please skip to the next time marker. ",
  "We got undressed and slid under the covers. I was feeling such strong feelings of love and lust that I just couldn't have waited any longer. Our lovemaking started very slowly, the feelings too intense to be able to rush anything. When we did begin to make love I got a reminder as to why I think of 2CB as my favorite erotic chemical. Looking into my fiancee's eyes during intercourse I had the strongest feelings of connection and adoration. The feelings were intense, and the physical ones no differant. Every nerve ending was exploding. While we started slowly, the pace did pick up, but I was unable to reach orgasm so we eventually decided to call it quits and rejoin the rest of the party.",
  "T + 3:00",
  "I decided to have a quick shower, and while in there I enjoyed one of my favorite hallucinations. The small shower cubical was 'breathing', swelling and contracting around me while I washed. The walls would move in to be so close I was sure I would touch them, to feeling like they were several meters away.",
  "T + 3:30",
  "Time for some fuckedup cards. Myself, N and two other friends sat down for a game of 'hearts'. i was amazed that I could actually play, and every single trick seemed the funniest thing imaginable. C couldn't believe it, and while we did have a few problems with it all, we managed to play quite a few hands out.",
  "T + 4:00",
  "Sitting in my bedroom doing nitrous. I was sitting in a chair with my feet up on another one while doing the nangs. While I was one of our other friends was tickling my feet with a feather duster. My eyes closed I was seeing the most cliche of 70's style CEV. Moving shapes and patters dancing with the music. Each note had a colour and a warmth to it that flooded through my body with an intensity I have only ever had with 2CB.",
  "T + 4:30",
  "Too noisy. There were too many people around me, too much noise and nowhere to escape too for a little peace. I ended up going for a quick walk with N and another friend through the park. Was good to get away from it all for a little while, giving me space and quiet to think.",
  "T + 5:00",
  "Sun starting to come up, and me starting to come down. Still very intense, but I can sense that its dropping off at last. I say 'at last' because while I love the feeling of 2CB it is a VERY strong chemical, and can be very intense for a long period. I had enjoyed my night immensely, but was looking forward to normallity again.",
  "T + 5:30",
  "Back down to a +2 by this point. Visuals still strong though, and watching my fiancee's screensaver was fun. M, N and I got into a discussion about her wallpaper which shows to dogs looking at you. Each of us had a story about what the dogs were thinking and trying to tell us. To me one of them was an older, wise doggie. A grandfather type. He had some wise message for me that I just couldn't understand. The other was a younger doggie, possibly the grandson, who had this 'I've heard it all before' look on his face.",
  "T + 6:00",
  "Back to a comfortable +1, where I stayed for about another hour. Sitting in my room with the other three participants talking about our nights and what we all thought of 2CB. I love it, and am looking forward to another try. C enjoyed it, but the nausea was too much, and it was too intense a chemical for her and she decides to leave it alone from now. M seemed in two minds as well, having enjoyed the night but not the waves of nausea. N agreed with me, and I could tell he would be more than willing to join me again.",
  "The rest of the day",
  "I stayed awake for a few more hours before falling asleep. No trouble sleeping, and no noticable comedown the next day. I did however have a light mood-lift, but a anti-social feeling as well for the next 12 hours.",
  "Summary",
  "Without a doubt it is still my favorite chemical. I love the visuals and the relaxed happy mindstate it puts me into. A very erotic chemical for me, but M said not for her, too intense. Lack of comedown is a plus, and will check next time to see if the antisocial mood is related."
 ],
 "erowid": {
  "id": "23123",
  "citation": " MDMA-4-ALL. \"Cliche 70s Visuals: experience with 2-CB (ID 23123)\". Erowid.org. May 4, 2003. erowid.org/exp/23123",
  "substance": "2-CB",
  "views": "29486"
 }
}
