{
 "id": 1457,
 "title": "Usage & Withdrawal",
 "date": {
  "submission": "2005-04-21T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "anonymous",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 shots",
   "administration": "oral",
   "substance": "GBL",
   "form": "(liquid)"
  }
 ],
 "report": [
  "First of all let me tell you I have been using GHB for 4 years now.  I first started with obtaining pure GHB from a chemist friend who made it for us.  With pure GHB the normal dosage of our supply is a cap full (from a 2 Liter soda bottle).  I can't say that I ever felt addicted to the pure GHB.  I used it on a regular basis (daily) and can honestly say I can't ever remember side effects from using it. ",
  "Unfortunately (or not) the ingredients to make it became illegal where I live so my friend was unable to make it anymore.  Time went on and I was looking for an alternative to GHB and of course came across GBL.  GBL is converted to GHB within the body so I was good to go.  Somehow a friend who had access to GBL came up with a mixture he found to be very, very close to what we were used to with pure GHB.  He found that mixing 120ml with 1 Liter of water made a great mixture.  So from then on we found a 1/2 shot (out of a shot glass) would give us the same effects as we found with the cap full of pure GHB.",
  "Now after having used the GBL replacement for over 2 years I can honestly say that I have found out numerous times that this is indeed addictive.  My usage (when I have the product around) is daily.  Ranging from a half shot a day to up to 2 half shots daily.  Now I find everything is within normal limits until my supply dwindles and I have no more left. ",
  "What happens is increased anxiety, sweaty palms, cold hands, shivers and shakes and depression.  And definately a craving for more GBL.  I find that taking a dose again puts all these effects aside for a short time...usually 4-6 hours.  Sleeping is difficult also and I usually end up taking a dose to sleep half the night and waking up only to dose again so I can go back to sleep. I also experience strange feelings of twitching in inner organs such as the liver or something.  Feels itchy and twitchy at the same time.  It is very uncomfortable along with the other effects, because they all come hand in hand. ",
  "What I find is I have to either A.) Try not to get to the daily usage stage so I can avoid the extremely uncomfortable withdrawal effects or B.) Dwindle my usage down slowly to less and less dosage over a period of 3-4 weeks to allow my body to slowly recover without having a full fledged withdrawal.",
  "So basically what I am saying is I don't care what anyone says...it is addictive and does have withdrawal symptoms.  I have experience these countless times and all time I have the same feelings and experiences with my body.  Occasional use...like only on weekends does not create the addiction or withdrawal effects.  But daily use can and will cause this to happen to me.",
  "So in the end...I still use GBL because I find I like the effects and find it to be a pleasant experience.  Not to mention increased sociability which I tend to like a lot.  But now as I write this I am awaiting a shipment of 1 Liter of pure GBL to distribute into 120ml bottles to keep around for myself...a stock if you will.  Like I said these 120ml bottles get mixed with 1 Liter of water to make a bottle that last a good long time.  But this time...I vow to keep my usage down to a controllable minimum...because I know all too well that the withdrawal is pure hell.  I am going to try my hardest to only allow myself a half a shot maybe every other day and see how things go...but if I find myself getting heavy into it I will give my supply to my roommate to hide from me so I can safely get away from the hard withdrawal symptoms that accompany stopping heavy use.  I will probably never stop using it unless I can no longer gets my hands on it...so I say use it in moderation and just take my word for it...you will thank me in the end.",
  "One more thing...I find that once I get through the withdrawal and are 'normal' I find no psychological urge to have more...once I am off I am fine and have no cravings for it, but I will take a dose if offered.  It is just having it readily available that is dangerous...it is easy to get into daily use and then inevitably withdrawal...be careful and have fun."
 ],
 "erowid": {
  "id": "14499",
  "citation": " anonymous. \"Usage & Withdrawal: experience with GHB & GBL (ID 14499)\". Erowid.org. Apr 21, 2005. erowid.org/exp/14499",
  "substance": "GHB & GBL",
  "views": "21035"
 }
}
