{
 "id": 14571,
 "title": "Collapsing Universe",
 "date": {
  "submission": "2001-09-25T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Schizo",
  "gender": "Male",
  "weight": 67
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.35",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "Normally I only write my reports in german, but I will try to translate this one, so more people can read it.",
  "Trip 93:",
  "It's some minutes after midnight and I want to go to sleep. But I also want to do a salvia journey. I placed an extract, done by my friend, in my bong. It equals around 0.3-0.35g dried leaves. This extract was in a box with the text 'Little Drug-Hiding-Place' (in german) on it. I had lost this box last evening at a beach because we got into trouble with the police (because of making fire). Luckily I found this box next day between all the normal people at the beach. :-) The sun burned for five hours on the box, but the extract was still fine.",
  "I sat down comfortably in meditation position, switched on some music, and smoked the bonghead in one large hit. Due to the extract this was not so hard and unpleasant as smoking the pure leaves.  I put my bong to the side, closed my eyes, and kept the smoke in my lungs as long as possible. I can't really remember at the beginning of the trip now. My old reality simply switched away. My usual bodyfeeling was washed away. Known geometries broke. Normally, I leave my old reality and switch to one or more new realities. This time I had the feeling that the whole fabric of reality, space and time, the whole universe collapsed.  Everything was pushed out of its normal surroundings, so that parallel dimensions/realities penetrate and fold themselves. Multiple dimensions and times fusioned and shared the same space. In a subspaceanomalie (star trek greets), it must be the same way. It was one big not-controllable spectacle.",
  "One time, I had the feeling of large differently-shaped and -colored columns coming out of nowhere under me and ending nowhere above my head. These colums were like large stalactites. These stalactites were different realities, but they were also myself. They felt like my new body. I have the feeling on salvia, that the consciousness expands beyond the body. When this is completely done, then you have no bodyfeeling anymore, but you have a new feeling for reality. You are reality. There is no more a difference between 'out there' and 'here inside'. There exist only a fusion of both. Consciousness and reality is the same thing.",
  "When I moved my head, it was like looking into different worlds, but my eyes were closed the whole time. Because of the collapsing realities, I had the feeling of a reality moving up at my right side and moving through me. It was like being trapped with half the body in the ground. Physical laws like 'Where one body is, there can't be another one' lost their validity. Matter fusioned in this big tumult. Sometimes I really thought I was in other realities, and I couldn't say whether my eyes were closed or not. Because I saw these other dimensions like in a dream. But the configuration was changing rapidly, that's why it was difficult to remember special things or look at something more detailed. One time I thought, it is day and my parents are in the room.",
  "At the beginning of the trip (first 3 minutes), I also heard the typical voices in my head. I think I communicated with them but can't remember special parts, because so much happened in such a short time.  The bodytwisting continued. One time I felt like two rotating discs with my consciousness mapped on them.  After 2-3 minutes the intensity dropped a bit. Now I realised that the music was still playing. The music was like a red thread into my old reality and I knew that as long as I heard the music I could find my way back to my reality. In some parts of this trip I thought that I did it this time (typical for breakthrough trips) and will exist across different dimensions. I remembered my first heavy trip and found that there also the universe was collapsed. It's like a computer which renders realities, time and space, and now this computer has an error",
  "or crashes.",
  "Slowly the intensity dropped. The universe ordered itself more and more in the known way and I found myself back into my old reality. After 10 minutes I opened my eyes, but sat still for another 3 minutes, because the trip shocked me. I was happy to be back in my normal world.  That was one of my heaviest trips. It's a pity, but I also forgot alot, and it's very difficult to bring the things I saw back into my normal world. Describing everything in words is also very difficult. I was conscious the whole trip, but it's another kind of consciousness. The duration of 5-10 minutes is enough, because it's hard to remember this short period.  This was a really heavy trip (this text is only a profane description of what I experienced). It was very interesting and gave me alot of stuff to think about. But I didn't stop taking salvia after that trip; four days later I tripped again.  Salvia is very real and the experiences don't seem to be drug-induced.  Thanks, Salvia, for the transmission.",
  "Schizo",
  "questions and comments to: schizo604@gmx.net"
 ],
 "erowid": {
  "id": "2315",
  "citation": " Schizo. \"Collapsing Universe: experience with Salvia divinorum (ID 2315)\". Erowid.org. Sep 25, 2001. erowid.org/exp/2315",
  "substance": "Salvia divinorum",
  "views": "3650"
 }
}
