{
 "id": 14574,
 "title": "Telepathic Transcendence",
 "date": {
  "submission": "2008-09-24T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andrew",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50",
    "grams": 0.05
   },
   "administration": "smoked",
   "substance": "DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I made my own extract from Mimosa Hostilis root-bark.",
  "I am age 16, and have had experience with LSD 3 times, mushrooms more than 20 times, usually from 5-8grams of mushrooms when I use them. I've done ayahuasca 4 times and smoked DMT around 6 times before this experience. I've also done 5-MeO-DiPT, 2C-T-4, cactus, Marijuana and am going to try 2C-I this week. Drugs really got me into chemistry, hopefully I can go to college soon for it but this isnt a life story so I'll get to the report.",
  "I had planned on doing this a bit earlier in the day with a nice mindset, but friends called and so I had things on my mind at the time. I still decided to smoke it, but a little later, around 11:00 I'm guessing. My mom was sleeping in the house, I figured since I've smoked DMT a few times before I wouldnt wake her up, and I didnt. But this definately did not help the set or setting.",
  "I loaded my freebase glass vaporizer(blew it myself) with a hefty dose of DMT crystals and melted it down(not neccessary but I do it because it makes things a bit faster when it's time to smoke). Then I took my butane torch lighter, which makes a *huge difference in the size of hits you take, and I held it to the pipe.",
  "When I saw smoke I started inhaling deeply and slowly as not to cough, it doesnt taste so good, but if you're used to it it is easier take bigger hits withought coughing. This is the first time with such a high dose, and with this butane lighter which sure did make a big difference. As I finished inhaling my first toke(5-10 seconds maybe?) I held it in for exactly 6 seconds and as I blew out I remember my last thoughts were 'oh fuck' because I just blew out a hit bigger of DMT than I ever have before and as I'm blowing out I start to feel it already. The 'oh fuck' didnt have a good effect on the mind set either by the way.",
  "The first effects are like everything starts to change to a higher frequency, like everything starts to vibrate to the sound in my head. This gets more and more intense visually untill all I see is blinding complex/almost confusingly complex visuals(well this time at least).",
  "This is when I took another hit!! After that I should of closed my eyes but I was caught up in the moment and just forgot to. Then the chaos netting started becoming more apperent and became more vivid and colorfull. By now what I was seeing was still growing in intensity and for some reason, which is unusual for me, I started thinking it would be too intense for that moment, which doesnt make much sense now that I think about it. Then the colors shifted to more of a red complex chaos netting as things took a more serious turn.",
  "A transcending telepathic voice said 'WHY' and with that I saw brief images of parametic/police/family vibes, I was dieing! This felt like the end for some reason. I started freaking out, which is a first for me even with all of my experience with high doses of mushrooms and other hallucinogens. I started to come down a bit, but still extremely loaded, with this slight comedown I started thinking I have to make everything right in my life, I have to balance things out, and then I literally got up like I was going to change my life and get rid of the things that shouldnt be in my room. After stumbling threw my room for about 5 seconds and making noise, I realized now probobly isnt the best time to do that so I layed on my bed and enjoyed the rest of my trip. At this point I was a bit moved and fear for my life had subsided. I almost forgot what I did 3 minutes earlier.",
  "I think this experience was needed to show me I have to be a bit more carefull and plan out what I do. Also I shouldnt be using psychedelics so often even though I would say I use them for the right reasons. And of couse the feeling of needing to change my life for the better was a plus. I feel if I had a better mind set and setting this would have been a totally different experience, like one which will surely take place in the future."
 ],
 "erowid": {
  "id": "23159",
  "citation": " Andrew. \"Telepathic Transcendence: experience with DMT (ID 23159)\". Erowid.org. Sep 24, 2008. erowid.org/exp/23159",
  "substance": "DMT",
  "views": "9144"
 }
}
