{
 "id": 14578,
 "title": "What the ?",
 "date": {
  "submission": "2006-03-24T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "That green jesus",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "This was my first experence with salvia. I had recently ordered some salvia from an online dealer , they said it should take about a week to get to me. I am still waiting for my delivery and I'm pretty sure I won't be getting it. I really don't want to say any names but this place ripped me off. Not to worry I have already contacted the better business bureau.",
  "I did not let this experience get me down, I was really wanting to try this stuff. So I ordered from another company, I got this shipment within 3 days (very pleased to say). Well as soon as I got it I wanted to try it after waiting so long. I wasn't quite sure if it was a good thing to do on this day because I was battling depression all day long but I said screw it I'll give it a shot. So I packed a couple of bowls of just the leaf and wasn't quite feeling anything, after the third bowl I started to feel a little funny. A little laughing was going on and I could see watery visuals around my room (nothing intense or anything) so I packed another bowl and still I pretty much felt the same except a little more dazed.",
  "About 15 minutes later I thought maybe I'll try a little of the extract so I packed a little less than a whole bowl, I must of took about all of it in on one hit I really don't remember what happened next. As soon as I started to exhale my whole room just like flipped on its side and created a mirror image of itself completely surrounding me like every thing was shrinking. Every thing on my wall enlongated to make it seem like it was falling to the floor. I don't quite know what I was saying but it definitely felt like someone was in the room with me (I was alone when I did this). It felt like I was talking to a female and I was saying where am I whats going on and its not a bad thing is it. When I started coming to I realized how long I had been in this trance. Before I took that hit I had started my favorite cd (george acosta's awake) and I looked at the counter and it was almost half way over. To me it didn't feel like time existed.",
  "I really didn't know what I was doing, so I will never do this again without a sitter because I don't even remember putting my pipe down or even exhaling."
 ],
 "erowid": {
  "id": "23165",
  "citation": " That green jesus. \"What the ?: experience with Salvia divinorum (ID 23165)\". Erowid.org. Mar 24, 2006. erowid.org/exp/23165",
  "substance": "Salvia divinorum",
  "views": "3553"
 }
}
