{
 "title": "Imperfect Medicine",
 "author": "ClanQ",
 "citation": " ClanQ. \"Imperfect Medicine: experience with BZP (ID 14577)\". Erowid.org. May 11, 2002. erowid.org/exp/14577",
 "substance": "BZP",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Piperazines - BZP"
 ],
 "report": "<p>Tending toward hypersomnolent depression, I've always gravitated to stimulants as a partial (and very imperfect) solution. I'm an avowed caffeine junkie, and I use ephedrine sporadically. So, BZP (1-Benzylpiperazine/N-Benzylpiperazine) seemed like a nice candidate for exploration.</p><p>I managed to get ahold of a very large quantity of BZP freebase liquid. Since it isn't terribly useful in this form (and caustic to boot), I prepared a solution of BZP HCl in 100mg/mL concentration by mixing appropriate amounts of the freebase and distilled water, and titrating to a pH of 7.0 with concentrated HCl. I did this because preparing nice crystalline BZP HCl is unnecessary, a waste of solvents/chemicals, and complicates dose measurement; liquid can be easily and accurately measured</p><p>with a syringe or marked dropper.</p><p>The solution tastes bad, but is tolerable if you have a something to wash it down with (a citrus juice works well). Effects become noticable ~25-35 minutes post ingestion. When I first began to use it, effects peaked at T+4hrs, and then slowly tapered off until T+7-8hrs. After my tolerance built (in my experience, tolerance began to be noticeable after 5-8 days of daily use), effects peaked at about the same time but dropped off much faster, and were usually gone by T+5hrs.</p><p>Effects are pleasant. Moderately euphoric, it's main effect was in making me much more social. I was unusually happy (even 'bubbly') and enthusiastic, and could become absorbed for many hours on abstract mental tasks (programming, for instance) without becoming the least bit fatigued. There was significantbody load: increased heart rate, elevated blood pressure, *heavy* sweating, anorexia, mild weight loss.</p><p>My experience is that it's significantly different from (meth)amphetamine and other similar stimulants. It feels more 'serotonergic', which, given it's serotonin-reuptake inhibiting properties (see Pubmed), is understandable. It has less of a tendency to produce manic or ego-centric behaviour (again, IMO) and is probably a better choice for people who use stimulants for utilitarian purposes.</p><p>Unfortunately, tolerance is a problem. Following the first week of use (1-2x daily), I had to steadily increase my dose to achieve the desired effects . I started at ~60mg and worked up to ~250mg. Every period of use eventually had to be discontinued because the positive effects gradually decreased and were then replaced by a quiet, seething irritability. I ended up snapping at nearly everybody for no reason, walking around with my teeth clenched and my hands in tight fists; in other words, the exact opposite of what I was using it for.</p><p>It's also addictive/self-reinforcing. With considerable difficulty (and with several relapses), I managed to stop using it and haven't used it since. On a scale of 1-10 (1 being like caffeine, 10 being like nicotine), it's addictive potential is probably somewhere around 4; not life-destroying, but kicking the habit is definitely a non-trivial proposition.</p><p>So: BZP has it's place. Just: Caveat emptor, and use your head.</p>",
 "year": "2000",
 "id": "14577",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-11T07:00:00.000Z",
 "views": "32976",
 "dose": {}
}
