{
 "id": 14584,
 "title": "The Bizarro-stimulant",
 "date": {
  "submission": "2003-10-29T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Lupin",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "2-Aminoindan",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "After purchasing a large quantity of this substance from an online vendor and trying it out, I feel I must comment on it. I would not recommend its recreational use at this point, although further trials will be pursued at lower dosages. I've had three experiences with the compound: two at roughly 100mg, and another at about 30mg.",
  "For those who don't know, 2-AI is a cyclized amphetamine. Imagine the alpha-methyl being part of a 5 membered ring, which loops back to the phenyl (or imagine that carbon being the alpha methyl for 2 distinct side chains off the 1,2 positions on the phenyl) and you get this weird bicyclic (in this case 6-membered aromatic and 5 membered  aliphatic ring) with an amine sticking off the end. There are methylenedioxy analogues (in this case numbered 5,6 as opposed to 3,4 I believe because the 1 position goes to the side with the) being considered by some as non-toxic ecstasy replacements.",
  "So it's like amphetamine? That could be said, but it wouldn't do this substance justice. I'll now describe one of the experiences",
  "Set and Setting: Irrelevant for stimulants. Dorm room, thinking about getting some work done. Chatting with friends on IM. Hanging out. Dose, as mentioned, was 100mg.",
  "T+10",
  "Phase 1: Takeoff.",
  "That energetic anxiety is there. Something needs to be done. This compound comes on quick and strong. Intense focus.",
  "T+30",
  "Phase 2: Transatlantic crossing. For about 30 minutes this stuff is in high gear. There's a certain dopaminergic character that can be somewhat disturbing at times. Euphoria comes and goes, and the overall feel is that of being hard-wired. It's these 30-45 minutes where work is admittedly possible, although there isn't enough time to analyze the attention-enhancing aspect of it further. That's because of...",
  "T+75",
  "Phase 3: 400 miles north of the Azores. Initial reports state that at least one engine was out when the crash occured. This stuff abruptly shuts off. For some reason, it's so quickly metabolized that at well under 2 hours after ingestion, a feeling of sickness is present. I didn't want to eat, move, talk, or do anything but lay down. The crash lasted pretty much until I woke up the next morning. No further effects were noted.",
  "Neurotoxic? Probably not. Safe? Probably not. Worthwhile? Not at all. It amazes me that in a time where the gov't bans psychedelics whose primary danger involves the user's own stupidity in terms of measuring doses (foxy, amt), a compound as frightening as this one. Nevertheless, in my own stupidity I plan on re-attempting this compound one final time. Doses will be 10mg every 15 minutes for 2 hours. Perhaps the time-release method will be more effective. If not, maybe I'll ebay the rest of my stash. After all, it's still legal."
 ],
 "erowid": {
  "id": "23187",
  "citation": " Lupin. \"The Bizarro-stimulant: experience with 2-Aminoindan (ID 23187)\". Erowid.org. Oct 29, 2003. erowid.org/exp/23187",
  "substance": "2-Aminoindan",
  "views": "37264"
 }
}
