{
 "id": 14588,
 "title": "Peaceful Easy Feeling",
 "date": {
  "submission": "2007-10-03T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nunofyourdamnbeezwax",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Meclizine",
   "form": "pill/tablet"
  },
  {
   "time": "0:20",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "0:20",
   "amount": "350 mg",
   "administration": "oral",
   "substance": "Carisoprodol",
   "form": "pill/tablet"
  },
  {
   "time": "0:20",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  },
  {
   "time": "1:50",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "1:50",
   "amount": "175 mg",
   "administration": "oral",
   "substance": "Carisoprodol",
   "form": "pill/tablet"
  },
  {
   "time": "2:50",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  },
  {
   "time": "3:20",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "3:20",
   "amount": "87.5 mg",
   "administration": "oral",
   "substance": "Carisoprodol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This was my first experience with Hydrocodone and did quite a bit of research before hand. I remember having a particularly bad experience with Codeine in the past and wanted to avoid the vomiting and accompanying sickness. I have been planning this for over a week I went to various sites including to learn about opiates and the various additional drugs that could help as well as those that could hinder. I was in a very good headspace yet slightly anxious state about the hydrocodone.",
  "T -1:30 I ate a light lunch.",
  "T -1:00 I took a Tavist (for the itchies) and a Tagamet (supposedly increases your high)",
  "T -0:20 I took a Bonine (Meclizine) for potential nausea. Even with all of my preparations I was still nervous about my experience.",
  "T :00 I took 1  Norco (15mg hydrocodone), 1 Soma (350mg Carispoprodol) and  a Xanax (1mg Alprazolam). I broke all of the pills into very small pieces thinking that I would absorb them better.",
  "T +0:20 Slight buzz coming on- a little floaty but also groggy. I make myself a glass of iced tea.",
  "T +0:25 Limbs feel heavy. Head is a foggy.",
  "T +0:30 A little dizzy but no real high",
  "T +0:45 A sudden warm flush. I feel very dreamy but this is in no way intense. In fact quite the opposite.",
  "T +1:00 Peaceful, dreamy feeling. Hard to walk a straight line.",
  "T +1:30 I decide to take another  Norco (5mg) and  Soma (175mg Carispoprodol)",
  "T +1:45 VERY hard to walk a straight line- like being drunk without the stupidity or numbness that often accompanies intoxication. Feeling peaceful and content. Very relaxed.",
  "T +2:00 Feelings of comfort continue. Made more iced tea. I have desire to move around now. I plan on doing the cold water extraction method next time so that I can feel free to take more of the hydrocodone without having to worry about the effects of the APAP on my body.",
  "T +2:10 Finding it difficult to read because my eyes keep skipping around the page.",
  "T +2:20 I took some Alka-Seltzer to settle my stomach (a little queasy) and a Benedryl to help with the itching. Ive got a peaceful easy feeling otherwise (yes, plagiarism!). It begins raining and it is just so beautiful! The sight sound and smell is amazing.",
  "T +2:50 I spend 30 minutes dusting my apartment. Dont know why but I am really enjoying it and when it turns into a chore I stop. Feels like its getting hot in here but I know its just because I am constantly moving. Im still not as high as I thought I would be.",
  "T +3:00 I dont want the feeling to end. This time I chew another  Norco (5mg) and  Soma. Not as bitter or as bad as I might have thought. No wonder people become addicted! I wish I could feel this at ease all the time.",
  "T +3:20 *SO* very sleepy. Still drinking the tea hoping the caffeine will keep me awake. Having a hard time concentrating on anything. My vision/focus to be twitching.",
  "I keep thinking that some pot would be fabulous with this. Dont really smoke it any longer because it would tend to make me paranoid, but I feel like it would be different with the hydrocodone. I would like to do more but I will wait and try out the extraction method first.",
  "Channel surfing. Nothing is holding my attention for very long. Although I definitely have an altered consciousness, I dont necessarily feel high. Thought processes are a little murkier than usual and I have that just about to drift off to sleep feeling.",
  "Physically the stomach queasiness is gone. Extremities (feet, hands, cheeks) kind of tingly and a little numb. Body is extremely relaxed. Jello. Feels like I just got the most awesome massage or just got out of a hot tub.",
  "T +4:00 Seem to be coming down now but it is gradual. Not at all a crash. Starting to get kind of noddy.",
  "T +4:00 to 4:30 I allow myself to doze off, but its not really a nap or sleep. I am still very much aware of what I am hearing and processing it. Radio is on and I am aware of every song. Never really loose consciousness. I wake and decide to put some food in my stomach.",
  "T +9:00 I sit here transcribing my scribbles on paper onto the computer. No real hang over but everything is still a little dreamy. Will be going to bed soon.",
  "Overall a very pleasant experience but not something that I am interested in doing very often, I could get WAY to accustomed to it! Next time I will up my initial dose and use the cold water extraction method to take out all that nasty APAP.",
  "To sum up the experience up in one word . . . .PEACE."
 ],
 "erowid": {
  "id": "23192",
  "citation": " Nunofyourdamnbeezwax. \"Peaceful Easy Feeling: experience with Hydrocodone, Carisoprol & Various (ID 23192)\". Erowid.org. Oct 3, 2007. erowid.org/exp/23192",
  "substance": "Hydrocodone, Carisoprol & Various",
  "views": "14825"
 }
}
