{
 "id": 14592,
 "title": "My Greatest Moment of Spirituality",
 "date": {
  "submission": "2007-06-16T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>Salvia is the first psychedelic I have ever tried. One night, I asked for a sign to show me that there was some kind of entity there when I was smoking salvia.  After a few minutes, I thought that I wasn't going to see anything, but when I opened my eyes I saw this creature in the tree right in front of me.  It wasn't a full blown hallucination or anything, just a bunch of branches more noticeable than the rest of the tree.  When I walked up to it, I was able to see a face.",
  "So, for the next couple days or so I was feeling very excited that there was actually an entity within salvia.  Theories of alternate realities ran through my head along with theories that salvia is the earth spirit or god.  Then I began thinking about what I saw and how I was probably just looking really hard for something.  I was an atheist so doubt about spiritual and religious experiences was not uncommon for me. ",
  "I smoked a couple times since then, and have only had great experiences.  The last time I smoked I was hoping that I would actually get to see lady salvia.  Unfortunately, that did not happen.  I went home that weekend though, and when I arrived I was still feeling the afterglow.  My mom is an artist so she was showing me the many things she had made since I had been away at college.  Then, I walked into the kitchen and saw a little painting. ",
  "It was the creature that I had seen when I asked for the sign.  It wasn't a vague resemblance, almost every little detail was there.  It had the same forked-head, it was green, the left arm was up a little more than the right, and it didn't have any legs.  Needless to say, doubt totally left me from that point on, and I totally believe that there is an entity that exists within salvia.  I feel spiritually revived knowing that there is something else out there.</p>"
 ],
 "erowid": {
  "id": "23206",
  "citation": " Anonymous. \"My Greatest Moment of Spirituality: experience with Salvia divinorum (ID 23206)\". Erowid.org. Jun 16, 2007. erowid.org/exp/23206",
  "substance": "Salvia divinorum",
  "views": "3619"
 }
}
