{
 "id": 146,
 "title": "Better Than Expected With Next-Day Stupidity",
 "date": {
  "submission": "2013-11-11T08:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "Nik B",
  "gender": "Male",
  "weight": "14 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 10:25",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 12:25",
   "amount": "200 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Subject: Jeff the cactus",
  "Note: Jeff is on 20mg prescribed Citalopram",
  "Note: Times are estimates, to the nearest 10 minutes",
  "12pm. Jeff was spending the day with friends so, for a new substance, didn't want to go too mad before knowing what may happen. He had been drinking for a few hours - mostly cider, 5 cans he believes - and watching an airshow.",
  "2:15pm. It got cold so he headed off to his place of work to get a jumper. Upon arrival he noticed a package with his name on it in the doorway. When he opened it he realised it was a gram of ethylphenidate that he had ordered online when inebriated one evening from a source one used before - reliably - for an alternative substance.",
  "3:30pm. He opened up the envelope and popped open the bag. The powder was white-ish cream coloured. He popped open the bag and popped out probably no more than 20mg of powder into a line.",
  "3:35. He insufflated the line. Initially felt pretty ok.",
  "3:45. Jeff began walking back to the airshow - about 3 miles. As the walk went on, he started to feel more and more nervous, borderline paranoid. He was pleased about wearing sunglasses as his eyes were dancing around all over the place. 3 miles without speaking was disconcerting as he had no idea how he would sound when he finally did.",
  "4:35. Finally he re-met the group. Immediately Jeff noticed that he was chatting a lot more crap than usual. Making jokes, fooling around, a large amount more confidence. The only thing dampening that was knowing that he had to DJ later and knew he couldn't get too twisted.",
  "8pm. The night went on and Jeff sobered up.",
  "2am. Jeff got home and decided to insufflate a proper line. Around 150mg.",
  "2:30am. Jeff starts to feel waves of euphoria. Impressive given the SSRI.",
  "3am. Jeff starts dancing (quietly, so as not to wake the guests staying) around his room to house music. It's a wonderful feeling.",
  "3:30am. Jeff starts to get a bit amorous, so decides to look at some adult entertainment.",
  "4am. Insufflates another 200mg.",
  "4:30am. The whole experience from 2:30 begins again. Dancing, touching, daydreaming, writhing about on the bed.",
  "The above experience continues intermittently until 12pm (lunch time) the following day, when Jeff is abruptly snapped out of his strange trance to rejoin the group on the beach.",
  "For some bizarre reason Jeff agrees and heads to the beach. Jeff is still highly confident, chatty and chirpy.",
  "3pm. The substance begins to wear off and Jeff begins to feel a little more drained.",
  "4pm. The high of the substance has worn off significantly and tiredness begins to kick in. Jeff starts drinking cider in an attempt to take the edge off, but the thought of walking to the public toilet gets too much, so Jeff stops at one can.",
  "5pm. The high of the substance has completely worn off. Jeff is left more-or-less completely braindead. People attempt to engage in conversation but Jeff either completely misses the conversation or completely misinterprets what was said and makes a complete fool of himself by answering with complete irrelevance.",
  "7pm. FINALLY Jeff gets to go home. Crashes on the sofa and sleeps until the next day. Gets a cold (possibly from the beach?) but otherwise feels alright.",
  "----",
  "Final thought: At the time, great! A euphoric stimulant with, unusually for Jeff, an appreciation for music. But make sure you have nothing major to do the next day.",
  "Jeff."
 ],
 "erowid": {
  "id": "101181",
  "citation": " Nik B. \"Better Than Expected With Next-Day Stupidity: experience with Ethylphenidate (ID 101181)\". Erowid.org. Nov 11, 2013. erowid.org/exp/101181",
  "substance": "Ethylphenidate",
  "views": "631"
 }
}
