{
 "id": 14604,
 "title": "Chopping Up Earth",
 "date": {
  "submission": "2000-09-10T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shaman",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "smoked",
   "substance": "DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "This experience really knocked me off my chair literally. I sat on a chair with a large pipe in my hand stuffed with tobaco and 'Divine Moments of Truth' :-). I put the pipe in my mouth and inhaled one large dose. It felt hot but just as i had inhaled it, BAM! Suddenly i found my self sitting on the floor, the whole world around me changed into mosaic almost directly. i looked at the pipe and there were just a large black hole left of it. i closed my eyes and saw large chopping tools like knives and axes chopping up molecules then i understood that the molecules must be the earth. I saw thousands of them and suddenly they had formed a new dimension. this dimension was all made out of colors and you could hear different sound from everywhere in different frequencies. Large choppers now chopped up seven earths at the same time till it reached one billion and then sent out the pieces into outer space to start it all over again.",
  "Suddenly i heard a BAM and opened my eyes. and there stood a large monster in front of me with white huge teeth and saliva dripping from his jaws. This monster started to dissolve into the black hole and i was also sucked into it. the rest of the trip is quite hard to explain but i can say that a lot of love and piece were involved. thousands of Light beams were piercing my eyes as i was travelling 1000km/hr through the hole after the now almost transparent dragon figure. i could now feel the 'chi' inside my unimportant so called body, streaming through my veins.(chi is japanese for nirvana/power).",
  "It was amazing, i was loving the creature in front of me that has almost dissapeared by now and the whole everything was ME and i was IT. I understood that our universe, even if its unlimited and all the stars and planets were Me and at the contrary. i could see everything at the same time, well see is not the exact word, i was everything at the same time. Now i had disolved too into cosmos/everything. This was the ultimate LOVE. Suddenly BAM!  As quick as i got there, I was sitting on the floor feeling weird and happy :)"
 ],
 "erowid": {
  "id": "2327",
  "citation": " Shaman. \"Chopping Up Earth: experience with DMT (ID 2327)\". Erowid.org. Sep 10, 2000. erowid.org/exp/2327",
  "substance": "DMT",
  "views": "6463"
 }
}
