{
 "id": 14616,
 "title": "How Did it Happen to Me",
 "date": {
  "submission": "2007-10-03T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "bgirl",
  "gender": "Female",
  "weight": "105 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "It is hard to even look back at the life I once led. I have tried cocaine at a number of times. In August became a daily thing to snort off and on. My boyfriend mentioned shooting it. I have done it once in the past, and was open to the newness. The first couple of times it was nice, but nothing special. I remember the first time we really did enough to get the 'wa-wa's'. The taste of numbness in the back of my throat. The sound of staticy metallic all around me. It a feeling I can't desribe. My boyfriend and I swore it would be an once in awhile thing, boy were we wrong. I lived for that feeling.",
  "At some point I wasn't attending school anymore, college lost my interest. I lost my job. We had no money, but still managed to find just enough money to get fucked up. I would wake up at 6pm and my boyfriend would be no where to be found. He would arrive home shortly and I would start to yell at him, he would pull out a gram or two of coke and shoot me up. Everything was ok then, we were happy. After two day binges of no sleep I would catch myself talking a hot shower, hoping for sleep later. I remeber looking at my arms, broused, and hurting. I had track marks all up and down my veins. I only way about 105lb as it was, now I looked like a skelton. I remeber the one time my boyfriend gave me just a litte to much. As soon as it hit me I hit the floor. That metallic sound was so loud, and my eyes started to shake back and forth in my head. My boyfriend started to wig out and was asking if I was ok. I just laughed and about 10 mins later begged him to do it like that again. We never left the house, unless to score more drugs. I told my friends to leave me alone, I was fine. They knew we were using alot of cocaine, but even to this day didn't really know we were shooting it. I couldn't wear short sleeves any where I went.",
  "It got to the point that I would be coming down, and start crying, telling my boyfriend that this had to end, or I had to die. He would yell at me to shut up and go sleep on the couch. Soon it would end when one day I answer the door and there are cops there with a warrent to his arrest. I just woke up (it's 4pm) and said he wasn't there. I go to get my cigs, as they search the house. They found him hiding behind the couch. Next thing I know, we are both in handcuffs, sitting in the back of a cop car. I had to call my dad from jail that night.",
  "It was my nefew's 3rd birthday, and I was suppose to be at my parent's house celebrating, instead I'm in jail. I lived 2 hours from home. My dad came and bailed me out of jail the next morning. I found out that my boyfriend started suffering from withdrawals that night in jail. I was confused, I wasn't going through withdrawal. That's when I found out he was using herion behind my back. I never tried it, never wanted to.",
  "He was shipped off to rehab. My parents never found out about my drug use, but I know they knew something was up. I had to drop out of school that semester, and move back home. I haven't shot it since then. Once in awhile, I'll get some and snort it, but it doesn't even phase me anymore. I still have the desire to shoot it one more time. When I think about it I can taste the numbness in the back of my thoart. I crave that feeling, the sound. But I just can't allow myself to do it. I know if I even did it one more time, that I just don't have the will power to say no after that.",
  "Very few know how bad it got, and I never saw it coming. I grew up in a very loving, white, middleclass home. This was not me, I couldn't believe I turned into a junkie. I pawned anything of value. I will always have a weekness with cocaine. It reunied a wonderful relationship with my boyfriend, we no long talk anymore, and it almost reunine my life. If it wasn't for us getting arrested, I believe I probably wouldn't be here today to tell my story."
 ],
 "erowid": {
  "id": "23306",
  "citation": " bgirl. \"How Did it Happen to Me: experience with Cocaine (ID 23306)\". Erowid.org. Oct 3, 2007. erowid.org/exp/23306",
  "substance": "Cocaine",
  "views": "14819"
 }
}
