{
 "title": "Music Was Broken",
 "author": "Anonymous",
 "citation": " Anonymous. \"Music Was Broken: experience with DiPT (ID 14610)\". Erowid.org. May 12, 2002. erowid.org/exp/14610",
 "substance": "DiPT",
 "bodyweight": "",
 "report": "<p>Without any exaggeration at all...this was BY FAR the best drug experience of my life.  It could blow away a 1 mg acid trip. It seems after you hit a certain dosage level, the DiPT trip is *completely* different than what is usually reported, and I have tried almost every research chem and illegal drug I can think of. Oddly enough, I found that the visuals were 10x as good as 2C-T-7, acid, shrooms, AMT, and any high-dose combination of drugs I have tried. The only thing I havn't tried that could possibly be better (visually) is DMT.</p><p>My hearing was broken down to a point where I *could not* recognize music, and I could not understand anyone talking making it impossible to participate in conversation (the only annoying part).  It was like walking around in a movie.  My girlfriend played some mozart and I could not recognize it as classical music!  The music was broken down into 'moments' - there was no flow.  I could hear people talking only if I concentrated extremely hard and made them repeat themselves a couple times.</p><p>No one ever talks about the visual aspect of DiPT and before this 200mg trip, I thought they were 'decent', if that.  The visuals were very comparable to DPT except 2x as good.  There were lots of 'feelings' that reminded me of acid - like the profoundness, rapid thoughts yet blanked out state of mind.</p><p>After tripping inside for several hours, I stepped outside and looked at the sky in awe for 5 minutes...the clouds were turning into balls of fire that resembled meteors and they started falling from the sky.  It was the end of a most incredible night.</p><p>Most of my previous trips on DiPT have lasted around 6 hours.  This trip lasted 12 hours.</p>",
 "year": "2002",
 "id": "14610",
 "gender": "Male",
 "timestamp": "2002-05-12T07:00:00.000Z",
 "views": "16853",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "DiPT",
   "form": "(powder / crystals)"
  }
 }
}
