{
 "id": 14626,
 "title": "Night Like No Other (Monsters)",
 "date": {
  "submission": "2003-10-20T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "norman",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 drops",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(tea)"
  }
 ],
 "report": [
  "I am by far a veteran psychadelic user. One who is not easily scared by their experience. This night was enjoyable, when it wasnt unbearable. Lets start at the top...7 grams muscaria boiled for 20 minutes in one bowl while the 7grams of cubensis boiled for 35. When both preperations where ready I drank a shot of juice containing around 20 drops of a Calea extract, now the shot of muscaria followed by the all powerful pscilocybin tea. I do not recomend this, I repeat I do not recomend this!!! I felt uplifted and good in about 20 minutes then very soon I noticed a car drive by the window. The trails had just started. At this time I smoked a rolled combination of both mushroom dusts and cannibis (BC).",
  "At this point reality came to an abrupt end! OH MY GOD!!! I was at home in my apartment looking ahead in the living room when I noticed small black dots. The dots were everywhere there was empty space (air). Now lets rewind. I drank all the tea sometime after 11:30 pm. By that time I had picked out six cd's to listen too. Back to 1:15 am all HELLs about to break loose. The black dots had my attention, I focused right at the black dots until I was looking through what was like a key hole to somewhere. The somewhere was not vacant from life, but was vacant from what WE KNOW as life. These 'things' had one eye and it looked right at me. They were not the normal geometric living patterns that are prevelant on LSD and pscilocybin alone. The things formed corners in space and from the first ones that appeared arose folding planes of countless others. It looked like a step pyramid or staircase of living one-eyed crawling spear headed creatures who where doing nothing but EATING each other like pirhana while looking directly at me with their one eye. Once I focused on them they would not leave my living room till nearly 3:00 am.",
  "These things were SCARY. I wanted to run to the nearest church to see if they would follow me in. I did not panic but thought of my EXISTENCE as obselete to the world. My own reflection seemed like an evil spirit trying to coerce me evertime we saw each other, I got away from the mirror! I was in deep thought for a while about what I was witnessing. I took it as a warning! Dont call on the gods if you arent ready for the monsters that travel before them. I was scared for my life for those two hours and confused and deranged until 7:00 am. From 1:20 to 1:50 (this was true peak) I listened to several CDs none made the monsters go away or become peaceful. I closed my eyes and saw them there also. time was distorted, VERY DISTORTED. For what was truly 30 minutes of peak it seamed like HOURS (atleast 3) I was enlightenend on several degrees but nearly scared out of my mind if not to death.",
  "Please if you read this and want to try a similar mix, I would NOT reccomend it. I think it would have been more peaceful if I had introduced the muscaria and the calea later in the psylocibin trip like at least 2 hours into feeling it. Thank you for your time, BEWARE when you mix these three hallucinogens, it seemed more powerful than 5 doses of LSD and MUCH MUCH more terrifying! Do not say I did NOT warn you. STAY SANE, do good on this earth and none of us should fear the worst monsters..."
 ],
 "erowid": {
  "id": "23345",
  "citation": " norman. \"Night Like No Other (Monsters): experience with A. muscaria, P. cubensis & Calea zacatechichi (ID 23345)\". Erowid.org. Oct 20, 2003. erowid.org/exp/23345",
  "substance": "A. muscaria, P. cubensis & Calea zacatechichi",
  "views": "28673"
 }
}
