{
 "title": "To Terror and Counting",
 "author": "Miro",
 "citation": " Miro. \"To Terror and Counting: experience with 2C-T-7 & Ecstasy (MDMA) (ID 14622)\". Erowid.org. May 13, 2002. erowid.org/exp/14622",
 "substance": "2C-T-7 & Ecstasy (MDMA)",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "oral",
  "MDMA",
  "",
  "",
  "30 mg",
  "insufflated",
  "2C-T-7",
  "(powder / crystals)"
 ],
 "report": "<p>This is not a report written directly by me, but instead by a close friend who wishes to get this story out.  I was there when this happened, and to say that it scared me would be like saying that the internet is relatively-simplistic...</p><p>Start his description:</p><p>I'm going to describe part of a bad experience here. This will probably ruin my chances for running for President (or floor sweeper at Home Depot), but I want you to know how a bad overdose can happen, and how I feel about it.</p><p>I have done 2C-T-7 twice before orally, 25mg. Long ride, but fun, manageable and it seemed to go well with everything, including MDMA. With nitrous, a beautiful long egoless float into a point, with the universe blossoming up about you eventually. Very nice.</p><p>My bad 2C-T-7 experience also ties with MDMA. The MDMA dose was actually low, probably 100mg for a 170lb male. The 2C-T-7 dose was, to the best that everyone involved can put together, and what it 'looked like' at the time, between 25 and 35mg. It was a 50, split unevenly between me and someone else. They ate theirs (thank God) and had a great time.</p><p>I blew it. I mistook it for MDMA and insufflated a little more than half.</p><p>Insufflated 2C-T-7 (maybe only with MDMA) hits fast. I knew something was wrong in about 90 seconds. It had me curious. No one I know anywhere sells bad MDMA. I wondered if it were MDA or even PMA or DXM (which would take much longer to affect me). About 3 minutes after that, the speed with which things ramped up told me I was in really serious trouble. I felt in my pocket, and realized I'd switched caps. I also realized that, with the 'comeup' rate, this stuff was either mismeasured, is interacting, or is much more active when insufflated. In any case, it was happening faster and far worse than anything I've dealt with, I was in way over my head too fast, was already having difficulty thinking, and I needed help.</p><p>That's saying a lot. I've tried everything. I'm a tank. I almost never need help, and even when I'm not 'conservative', I'm almost always well within explored territory.</p><p>I immediately called for help from a friend who knows medicine and psychoactive meds really well. Fortunately, she was there in less than a minute. At the time she showed, I was almost unable to stand.</p><p>I was able to communicate for about 10 minutes. During then, we determined:</p><p>- I was on an insufflated dose of 2C-T-7, which is known to be very</p><p> dangerous. I had read briefly something about this, but my friend</p><p>  fortunately was more knowledgable and knew the gravity of the situation.</p><p>- At the rate things were progressing, my curve was ballistic and reality</p><p>  and self-control were going away within 10 minutes and I had no say-so</p><p>  at all. That scared me very badly. Shit happening that fast means a</p><p>  serious ride.</p><p>- I might be a very real danger to other people. I knew this intuitively,</p><p>  and not through anyone else's experience. This and the thought of</p><p> ruining the experience for anyone else seemed like the worst thing</p><p> imaginable. I know that burden was a major part of the fear aspect of</p><p> the trip. The thought of inadvertently hurting people (physically or by</p><p> making them watch) was the Worst Thing in The World. As things p</p><p>  progressed, I said 'You might need 8 people to hold me down, and the</p><p> things I say might haunt you all for the rest of your life.' There was</p><p> no melodrama in this. It was really like that. I've felt harmless for</p><p> all my life. Now I felt like I might fuck up and hurt my friends. It was</p><p> horrible. I've found out since that others who have similarly overdosed</p><p> have actually turned violent before dying.</p><p>- We decided not to call for medical help. In retrospect, even though</p><p> things turned out okay, I'd recommend other people do so. It's not worth</p><p> a person's life not to dial 911 if you're not sure. If 2C-T-7 is in the</p><p> mix, do it, regardless of the the consequences. No consequence to that</p><p> person or the party is worth a person's death.</p><p>I believe I screamed 10 minutes after that. A few times. The next 4-5 hours seemed like an experiment in how much you can wring someone's brain out in a bad way and not cause their body to actually die.</p><p>More than a year later, I am convinced that without *extremely* competent care of medically knowledgeable people at the site, and the administration of enough alprozolam (Xanax) and THC to drop a mad elephant, that I'd have died badly.</p><p>Read that again. I am certain I would have died. And it would have been ugly.</p><p>As it is, I consider my recovery complete. And I did learn a lot from the experience! It does not seem to burden me, though it will take years to process what I saw and learned.</p><p>I'm a little wack :), but I'm also experienced in psychoactives. I think that there is a good percentage of people who would not have recovered from the experience in a significant way, and who would need permanent psychiatric help.</p><p>In other words, it's that bad, and I don't think some people would ever recover from that kind of torture.</p><p>Some personal thoughts:</p><p>Regardless of who is responsible or not, It would feel shameful to me to be the first of our family to kill myself off with carelessness. This does not suit my morals! I preach being very careful and listen and guide people very carefully. Some people will try psychoactives. I want them to have to best possible experience, to gain introspection, to improve their lives. Setting a stupid example does not further my goals, and it damages my reputation. I don't experiment much now, but I always, always mark pills. If you aren't 100.0% certain what's in that pill or cap, give it the whirly twirly down the loo.</p><p>2C-T-7, at least in massive overdose (or with MDMA interaction) cut loose stuff in my brain that I hate, I'd buried, I thought was GONE. One has less and less control. My understanding of the environment I was in, and what was happening slipped away. As the 'bad' aspects worsen, I could literally have attacked one of my friends, not understanding what was going on, and believing I was fighting for my life.  This is a deliriant experience, as well as a hallucinogenic one. I didn't know what was going on at all, and I was convinced I was going to die. If I were convinced you were a real danger, reasonable or not, I'd have killed you, not knowing the difference.</p><p>I think this makes this a dangerous drug. Anyone showing violence under 2C-T-7 may be totally committed to what they're doing. There is nothing I know of more dangerous than a desperate person. Keep that in mind in dealing with any overdoses.</p><p>Anyone suspected of being in this condition may be in extreme medical peril. It's possible that a ton of benzos (Xanax) and pot may save them, as it may have with me, but I don't want to be on record as saying that's the best overdose response. I doubt anyone knows that yet.</p><p>And beyond medical peril, it's worth saying that someone who has blown it with 2-CT-7 could be having their soul flayed out of their skull every second. Anything you can do to make them comfortable will help. Even after hitting me with 2 Percocet and about 12 codeines (bless you!!! it helped so much), my friends were still freaked by how much nasty energy was still 'sparking off' me the next morning, even though I all I wanted was for everyone to be happy.</p><p>I remember at one point saying, with a barely audible voice, 'tranq me...tranq me...' I was begging for unconsciousness. If it can be done safely, it doesn't seem like a bad idea for someone in 2C-T-7 hell should be put out for the duration of the experience (say 6 hours).</p><p>If you can't, or won't, then hold their hand. Say soothing things to them. 'I'm here.' 'You're safe and okay.'</p><p>Try and bring them back into the room, very gently, with talk. Massage their temples and jaws. Put headphones on them with William Orbit, low volume. If you leave, come back every 5 minutes. You may be dealing with a fellow human who is having the worst thing done to them that will ever be done to them, that ever can be done to them. I cannot emphasize this enough. Flex those big compassion muscles and help them any way you can. Their suffering is nearly infinite, but your compassion can be as big. It will help.</p><p>- - - - - -</p><p>Between Topica, and that experience, I feel my innocence has been thoroughly scrubbed away. This is not a bad thing. One always has to learn to face the truth and acccept it or change it. I would have preferred not to have discovered some truths in the ways that I have, but now knowing them, I feel I am a better person.</p><p>Currently, I am learning how to be compassionate towards others in the ways that I can learn.</p><p>Hopefully, truths and good ideas like these can be passed on to other folks in more gentle ways. If I may give advice, read read read before you do anything new. Don't take untested combinations. If you do, have seriously competent medical people around, and dose yourself only while sober.</p>",
 "year": "2001",
 "id": "14622",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-13T07:00:00.000Z",
 "views": "18881",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDMA"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": "30 mg",
   "substance": "insufflated"
  }
 }
}
