{
 "id": 14635,
 "title": "Clear Thinking Took Place",
 "date": {
  "submission": "2003-04-30T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tsp",
    "quantity": "0.25"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "seeds"
  },
  {
   "time": "0:20",
   "amount": {
    "unit": "g",
    "grams": "5.0",
    "quantity": "5.0"
   },
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "tea"
  }
 ],
 "report": [
  "The Ayahuasca Experience (DMT & MAOI)",
  "Using DMT in Mimosa Hostilis bark and MAOI in Peganum Harmala",
  "Preparation (For one individual)",
  "Preparation of the bark: 10grams of Mimosa Hostilis bark was placed into an electric coffee grinder for roughly 45 seconds until it was quite fine for the most part. The shredded bark was then placed into a small pot of water along with four sliced lemons. It was gently boiled for roughly 2.5 hours. Bottled water was added periodically as it evaporated. After 2.5 hours of watchful boiling the lemons were discarded and the liquid was reduced to as small of a size as possible without drying up the extracted bark. The remaining concoction was then poured through a small, fine strainer with the liquid remnants going down into a standard measuring glass. The amount measured 1/3 of a cup. The color was purple to pink. The bark was NOT used a second or third time to create more of the concoction but if other people wish to join in then by all means the bark could have been reused for further boiling with additional water and lemons.",
  "Preparation of the Peganum Harmala: 1/4 teaspoon of (4X potency) Peganum Harmala extract was placed into a standard shot glass along with water. Nothing further is required for preparation.",
  "Ingestion",
  "Note: No food should be eaten within four hours before this concoction is consumed. Small to moderate amounts of water and cold tea are fine.",
  "Step One: Once intellectually and morally prepared as well as physiologically, the Peganum Harmala is consumed first. Take the whole shot. It is a bit bitter. Drinking a chug or two of Arizona Green Ginseng Tea afterward was very helpful. Tic-Tacs are also necessary. Wait twenty minutes before ingesting the Mimosa Hostilis.",
  "Step Two: After twenty minutes have passed drink ONE shotglass of the Mimosa Hostilis drink. It is significantly bitter and this must be acknowledged with more cold tea and a couple of Tic-Tacs. Save the rest of the drink in a sealed container and store it in the refrigerator for another day.",
  "Experience",
  "Not even twenty minutes after ingesting the Mimosa Hostilis the psychedelic effects begin to take place in a noticeably electric manner. One should not be uneasy as one will soon realize that the experience will be familiar if other strong psychedelics have been ingested in the past. Basic but casual standing asanas are recommended for a few minutes as well as mindful breathing. The experience is quite similar to Psilocybes and the comparison should entreat adults to realize that both mushrooms and DMT increase spirit within an individual under the proper set and setting, preferably without other people in my opinion (but I can be exceedingly withdrawn so take that with a grain of salt). Clear thinking took place. A dramatic and desirable intensifying of one's awareness is also experienced. No visuals were experienced. No vomitting or even nausea were experienced and there was certainly no purging whatsoever. After roughly two and a half hours the effects began to diminish very smoothly and gradually. It was a very helpful and delightful experience that I will remember and cherish. Nothing else was consumed before or during this experience. I recommend out of intuition NOT using Cannabis or alcohol or any other psychoactive agent.",
  "This was written roughly four hours after ingestion."
 ],
 "erowid": {
  "id": "23381",
  "citation": " Anonymous. \"Clear Thinking Took Place: experience with Ayahuasca (M. hostilis & Syrian Rue) (ID 23381)\". Erowid.org. Apr 30, 2003. erowid.org/exp/23381",
  "substance": "Ayahuasca (M. hostilis & Syrian Rue)",
  "views": "14116"
 }
}
