{
 "id": 14632,
 "title": "Prisoner of the Static",
 "date": {
  "submission": "2007-10-03T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Kong",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This is my personal account of my experience with S. divinorum.  As the experience transcended any language that I am aware of, this account can not possibly encompass the numerous psychological phenomena, for lack of a better word, that I encountered.  I choose to record this trip, now months removed from the incident, in order to better understand what happened to me and how it has effected me for better and for worse.  I also would like to share my experience with others in order to better address the incredible power that is contained in psychedelics of all kinds, and extend my utmost respect for these substances.  With that said, I hope that this account will be both entertaining and informative in some way.",
  "The trip occurred on November first, 2002.  A friend and I decided to smoke a bowl or two of S. divinorum in his dorm room.  I had tried S. divinorum approximately six to eight times prior to that night with varying degrees of success.  I had encountered a variety of sensations from past uses that included a general euphoric state, heightened tactile sensations, and detachment from the outside environment.  These sensations tended to accompany milder trips.  A few more intense trips yielded (as best as I can discern) the ability to see an objects aura in the form of a liquid outline of color as well as hearing whispers and having the feeling that other people were present in the room.  Nothing, however, could have prepared me for the trip that I had on the night of November first.",
  "While we listened to Tools Lateralis, my friend packed a bowl of dried leaves and a sprinkling of 10x extract.  Amounts were eyeballed, but were not outrageous.  He took a few bong hits and apparently felt many of the general effects of the drug explained above.  I next packed a similar bowl with anywhere from an estimated four to five times the amount of 10x extract and took a large bong hit, and held the smoke in my lungs.  I reached a terminal velocity in approximately five to ten seconds, accelerating me into a different dimension.  I immediately forgot that I had smoked anything and that the world that I was confronted with was the real world.",
  "Gravity increased tenfold making it almost impossible to lift my limbs.  I had also melded into the chair that I was seated in and my viewpoint shifted.  It was as if I was looking up from the seat of the chair.  Lines of colored dots streamed down my field of vision.  The lines were in a uniform pattern streaming from top to bottom much like the computer data in the movie The Matrix.  At this point the walls of the room had begun to blend and turn different colors.  Scanning the room I realized that other people were melded into the bed and other pieces of furniture.  The color of the room had begun to turn into a bright yellowish/tan hue.  At this point I attempted to lift myself out of my chair and felt not just restrained by the increased gravity, but forcibly pushed back down by someone.  While this is happening, human voices mixed with screams were proliferating the room.  It was too incoherent to understand, but I could feel the despair carried through these voices.  The walls were ripped, and in these rips was static.  The kind found in a television.  From this static people were reaching out trying to escape some other reality.",
  "While my fellow prisoners and myself were attempting some sort of escape from this limbo of existence that we were now merged with, an omnipresent female voice, perhaps the mythical Lady Salvia, would reinforce our hopelessness and despair.  She did not really speak.  It was more like I was being bombarded and injected with fear and despair.  Another omnipresent being was also present.  This being was traveling around the room pushing people back down into the melded furniture and rips in reality like someone closing the lid of a chest.  This being had no distinguishing features and as far as I could tell, remained silent.",
  "The noise reached chaotic levels.  One constant phrase was running through my mind, You are stuck here forever.  At this point I was truly terrified.  I quickly searched the room with my eyes and was soon staring at a computer monitor.  I saw the reflection of my world in the screen and came to the conclusion that in order to escape, I would climb through the monitor back into my world.  As I stared intently into the monitor, I saw a vision.  People covered tightly by some sort of sheet that adhered to them and molded to their form, like a second skin.  They were screaming and the sheet was invading their mouths.  They were suffocating.",
  "I officially had The Fear.  The room had now changed to a solid yellow platform/tunnel, much like a train station terminal.  I realized that my friend was walking freely around the room, he was therefore an ally of the omnipresent beings, and could not be trusted.  He then spoke.  Apparently, he was changing the music to something more soothing in an attempt to ease the extreme state that I was in.  He asked if Cake was an appropriate choice of music.  I believe the quote was, Do you want to listen to Cake?  I promptly answered No. This was not because I did not want to listen to Cake, but because I did not hear what he actually said but the following, You cant leave.  Youre here forever.",
  "I couldnt take it anymore and attempted to leave.  I forced myself up and stumbled to the door.  Luckily my friend was able to convince me to sit down on the bed.  I barely made it to the bed and almost knocked over a variety of objects on a nearby end table in the process.  At this time, I was finally coming out of the trip and the strains of the Beatles album Sgt. Peppers Lonely Hearts Club Band were calming me down from frantic state.  Total time of trip was approximately five to ten minutes.  It would take another twenty to completely come out of my haze and many weeks to shake the feeling that we are all living in an illusionary world and that we are all captives.  That everything is hopeless.",
  "I have now sufficiently recovered and the trip, and although bad at the time, has provided me with an incredible amount of insight into the core of my being that would be futile to attempt to explain.  I have since done S. divinorum mixed with marijuana, but not alone.  I dont know if I will choose to use S. divinorum alone again, but I will leave that open.  Once again, this account does not do the trip the justice it deserves, but I will say that the one thing I am certain of was that for five minutes I went completely insane."
 ],
 "erowid": {
  "id": "23361",
  "citation": " Kong. \"Prisoner of the Static: experience with Salvia divinorum (leaves & 10x extract) (ID 23361)\". Erowid.org. Oct 3, 2007. erowid.org/exp/23361",
  "substance": "Salvia divinorum (leaves & 10x extract)",
  "views": "3727"
 }
}
