{
 "id": 14645,
 "title": "Homegrown",
 "date": {
  "submission": "2000-10-10T07:00:00.000Z",
  "experience": "1984-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "K.T.",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 flower",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "tea"
  }
 ],
 "report": [
  "My ma grew a big 'angel`s trumpet' tree in our backyard, huge white flowers up to 30cm long.",
  "For about 6 months I ripped into it fairly regularly.",
  "First time we used 12 flowers to make a tea, boiled it all up for 15 minutes in 2 litres of water. 5 people drank a cup each. We filled a bourbon bottle with the remainder and went to a party.",
  "The party was all straight dudes from the airforce, the girl in our group felt very uncomfortable and aked me to drive her home. I hid the bottle in the kitchen. I felt pretty normal, just a metallic taste in my mouth, but once we were driving we both forgot where we were going and where we had just come from. The panels and bonnet of my car started `breathing` and sprouting veins through which I could see a liquid moving.",
  "It was more beautiful than a worry, so I drove on.",
  "It turned out we were on our street, we recognised our own house as we drove past it.",
  "So I dropped off my friend and returned to the party (nice guy- i know). I found the bourbon bottle sitting empty on the kitchen table. An hour later about 15 people were sitting quietly in the lounge watching the ceiling continually rise, the walls breathe in and out. Everybody seemed content except the friend I had taken home,  she hallucinated 4 friends were in her room all night wearing plastic raincoats.",
  "1 week later we made another brew, about the same proportions, but while it was cooking we went to the pub and  drank several beers. The brew had boiled dry and burnt by the time we returned, so we put in 4 cups of water and boiled it up for 10 minutes. 4  of us had a cup each.",
  "In under 10 minutes the walls were breathing, my mouth was lined with alfoil, none of us could speak, just croak. After another 10 minutes, my arms were breathing spurting rainbow-coloured fountains on the out-breath. My hands turned into green-scaled claws still breathing with massive veins swelling across them. My friends chose their courses of action, one took 2 sleeping tablets (don`t know what) and went to bed, another tried to walk home ( about 20km, midnight Sunday) went in the wrong direction, got picked up by a friend at 4:00am, sounds odd but it seems to happen on datura.",
  "The third was picked up from my house by another guy, who dropped him home, in his bedroom were waiting a selection of his ex-girlfriends, who just silently stared at him all night while they sharpened knives and loaded guns.",
  "I went to bed, at first I kept melting, then I kept dropping  lit smokes onto my bed and searching for them in a panic. Next just about every person I had ever met in my whole life came into my bedroom, one at a time, through the window, through cracks in the wall or just appearing. From one crack  came a human body with a sheep`s head, the head was rotting and the sheep started baaaaing at me. The head changed into my ex-boss, who calmly re-assured me everything was allright.",
  "At this point I decided the only way to stop this trip was to kill myself. I wanted to go to the kitchen and get a knife, but I couldn`t find my bedroom door or even window.",
  "Where there used to be a door was now a blank wall.",
  "I blacked sometime after that.",
  "In the morning, the guy who had taken sleeping pills, woke me up. I was naked, my hands and knees cut up and covered with blood, still tripping but kind of sane. My mate took me out to the backyard, our entire picket fence  had been pulled down, all of my clothes I had been wearing the previous night were scattered up the back alleyway. I have no idea what I did for about 12 hours, running naked around an inner-city suburb, in the early hours of a Monday morning. I had a top up on Monday night, and tripped until Wednesday night. None of us could read anything for about 4 days after.",
  "None of my friends took Brugmansia/Datura after that. I did but was a bit more careful except one time.",
  "Used a datura shrub, about 1m high, small yellow flowers, made a tea from the flowers, put it in a small plastic softdrink bottle. We went to a bikies rally, Harley Davidsons and whatall, don`t ask why. At the rally, nobody wanted to drink my brew so I drank the lot myself.",
  "I came back to ummm me? about 30 hours later. I was pissing and realised I was no longer wearing underpants, then i noticed I was wearing nothing at all except someone else's jeans. My clothes, wallet and keys were all gone.",
  "I walked out of the toilet and found I was at a friend`s house it was about 11:00pm the next day. I have no memory of this entire period and my gear was never  found."
 ],
 "erowid": {
  "id": "2343",
  "citation": " K.T.. \"Homegrown: experience with Brugmansia/Datura (ID 2343)\". Erowid.org. Oct 10, 2000. erowid.org/exp/2343",
  "substance": "Brugmansia/Datura",
  "views": "33155"
 }
}
