{
 "id": 14642,
 "title": "Passing a Urine Drug Test",
 "date": {
  "submission": "2007-10-14T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Alex",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "<p>Hello.",
  "I've been a very heavy marijuana smoker for almost 8 years. In addition, in the 6 months preceding the test I've gained 20 lbs (plenty of extra fat). I spent days searching the web on how to pass a urine drug test once I knew I will be tested for a new job and I had 7 days to pass it. Below is my account of how I've done it. During my search for information I was particularly thankful to people who posted their actual experiences, not just general advices, so I thought someone else might find my experience very helpful as well. Since I believe drug testing is a violation of my rights I felt I must make my personal experience of how to beat a drug test available to potentially help others. Please feel free to reformat the following information. What I have is pretty much is a time-line.",
  "-------------------",
  "Day 1",
  "  -- did nothing",
  "Day 2",
  "  -- ran a few miles",
  "Day 3",
  "  -- biked a few miles",
  "Day 4",
  "  -- did nothing",
  "Day 5",
  "  -- drank LOTS of beer throughout the day",
  "  -- took 2 tea-spoons of creatine (one in the morning, one in the evening)",
  "  -- took 2 pills of Activated Charcoal (same as above)",
  "  -- drank some *pure* Cranberry Juice",
  "Day 6",
  "  -- ate a very large meal in the middle of the day",
  "  -- drank some *pure* Cranberry Juice",
  "  -- drank about 12 beers",
  "  -- took 2 tea-spoons of creatine (one in the morning, one in the evening)",
  "  -- took 2 pills of Activated Charcoal (same as above)",
  "  -- took vitamin B-2",
  "Day 7 (morning before the test)",
  "  -- got up 5 hours before the test and made a gallon of 'Herbal Clean Master Tea'",
  " -- took 1 tea-spoon of creatine",
  "  -- took 1 pill of vitamin B-2",
  "  -- 4.5 hours before the test started drinking the tea with little sugar in each cup, periodically taking gulps of *pure* Cranberry Juice",
  "  -- 1.5 hours before the test took 2 pills of creatine/B-2 (included with the tea)",
  "  -- pissed as often as I could during the entire time (didn't wait for full bladders)",
  "  -- pissed the final time before leaving home for the test",
  "  -- during the test pissed into the cup only from the middle of the stream",
  "PASSED THE TEST AND GOT THE JOB !!!",
  ":)</p>"
 ],
 "erowid": {
  "id": "23412",
  "citation": " Alex. \"Passing a Urine Drug Test: experience with Cannabis & Drug Testing (ID 23412)\". Erowid.org. Oct 14, 2007. erowid.org/exp/23412",
  "substance": "Cannabis & Drug Testing",
  "views": "22426"
 }
}
