{
 "id": 14653,
 "title": "Oh the Lethargy",
 "date": {
  "submission": "2004-02-12T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "rommstein",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "powder / crystals"
  },
  {
   "time": "3:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "At 9:15pm, friday night I dosed up on 5mg 5-meo-amt dissolved in water. By 10:15pm, nothing more than placebo type feelings. Decided to redose, but Also decided to allow th drug another 2 hours 2 kick in. By 12:15 I was having a nice, very tame, non-visual trip, so I took 2mg more. By this time I had no intestinal disturbance. Within the hour I was seeing Paterns on everything and had extreme cramps, But they didn't bother me. It worked it's way into the trip and became part of it. The trip was intense but getting boring so I went back to my room to Try and sleep, but as soon as I turned the lights off I was transported to another dimension. Everything was crumbling around me, and rebuilding. This was the case with everything, organic, structural, everything. I turned on the lights about an hour into it (my time-stretched guesstimate) I picked up my guitar and wrote what I thought at the time to be a profound, undeniable song, Which turned out to be a very simple song When I reviewed it the next day. Turned off the lights and instantly I was returned to the other dimension, tripped hard until 6am, when I started to come down, and by 11am I was almost baseline. Song written While tripping ///",
  "1||",
  "2||",
  "3||",
  "4|| 3 5 7v  6 5v 0 4v",
  "5||",
  "6||",
  "1||",
  "2||",
  "3||",
  "4|| 3 5 7v  6 5v 0 4v",
  "5||",
  "6||",
  "1||",
  "2||",
  "3|| 3 5 6v  7 5v 0 4v 3210",
  "5||",
  "6||"
 ],
 "erowid": {
  "id": "23467",
  "citation": " rommstein. \"Oh the Lethargy: experience with 5-MeO-AMT (ID 23467)\". Erowid.org. Feb 12, 2004. erowid.org/exp/23467",
  "substance": "5-MeO-AMT",
  "views": "5922"
 }
}
