{
 "id": 14665,
 "title": "Two Takes On First ShroomHuasca Trip",
 "date": {
  "submission": "2000-07-15T07:00:00.000Z",
  "experience": "1994-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Murple",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "seeds"
  },
  {
   "time": "0:40",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "I actually have two separate trip reports for this trip. One is a hand written report, the other is a post I made to the usenet group alt.drugs the next day.",
  "----- The Handwritten Report -----",
  "I chose today for this experiment, mainly for symbolic reasons. Being Easter, the celebration of Jesus' resurrection, it seemed an appropriate day to try a combination that could lead to a personal resurrection experience. I began with a baseline consciousness, not habing smoked pot all day and eating only lightly.",
  "I ground up approximately 2 grams of harmala seeds at midnight (so I guess its the day after Easter, technically). I ate them at 12:20AM, they tasted quite disgusting. At 1AM, I ate about a gram of real strong shrooms.",
  "By 1:30, I'm beginning to feel some mild psychedelic effect. I put on Traffic's 'Mr. Fantasy' album, and the Spanish guitar in 'The Dealer' seemed to take on some ethereal dimension. I feel the trip gradually intensify.",
  "It's basically like a regular psilocybin trip, but there is an added, not quite definable difference, qualitatively and quantitatively. More relaxed, mellow, and earthy feeling. The harmala seems to open a different door in the mind. It's really not describable, even in relation to a regular psilocybin trip. It's just not the same. Even on a physical level, it doesn't feel quite the same. I feel cold despite the fact that its around 70 degrees outside... and I feel somehow taller, like my torso is several inches too long. I like the difference harmala makes. Enough writing.",
  "Follow-Up:",
  "A very unique trip. Much longer and more intense than a gram of shrooms would normally be. Different too - more relaxed and my thoughts were more humanly oriented rather than it being an intense cosmic journey through the inner mind like shrooms or acid usually produce. I liked it...very enlightening.",
  "----- The Internet Post -----",
  "Actually, its funny that I just saw Ted's post....as I was just about to make a post of my own concerning a harmala + psilocybin trip I took last night.",
  "I began by crushing up 2.5 grams of harmala seeds, and swallowing them - quite a disgusting taste... I waited about 30-45 minutes for them to digest (and to see if i would throw up) before eating my shrooms. I felt a slight queasiness in my stomach, but not desire to yack, so I ate the shrooms (about 30-45 mins after the harmala, like I said).",
  "After eating 1.5g of shrooms (from a previous trip out of the same bag, i knew them to be quite potent shrooms), the trip began about 20 minutes after taking them. It came on more gradually than a pure shroom trip. The trip itself was different than just plain shrooms. Its not really a describably difference...it seems to open a different (but similar) door in the mind. Physically, it felt different to. For example, although it was about 70 degrees outside, it felt to be about 40 degrees.... When I walked, I felt somewhat drunk - I wasn't stumbling, my coordination seemed fine...but there was that same sense of vertigo that you feel when walking around drunk.",
  "Hallucinations were quite different. I remember looking at Venus and not being able to decide if it was a star or a plane, because it kept moving. Inside, colors seemed different, but not in the intense way caused by plain shrooms - they seemed somewhat eartier, and I found myself attracted to browns, greys, black, and dark reds - quite different from the attraction to bright colors caused by pure psilocybin.",
  "As far as MAO inhibition... I was drinking cocacola all night (caffeine) and ate a cheeseburger at mcdonalds (cheese & meat), but felt no side effects...however, I do not recommend eating alot of no-no foods, because although shall quantities can be OK, chowing down on cheeses and alcohol or yeast or meats could cause problems. Keep it simple, if you decide to trip with harmala. (You probably wont feel very hungry anyways).",
  "About halfway through the trip, I ate another gram of harmala, to prolong the trip. It did seem to work...as the trip lasted about 6 hours total (other trips from the same bag of shrooms, but with no harmala, lasted only 3-4 hours). The come-down was very very slow, and the peak was quite long as well.",
  "My thought-patterns were also different than they usually are while on shrooms or LSD. But like I said, the differences are very hard to describe...they are subtle, but they add up to produce a quite distinct trip.",
  "For one, it seemed like a less 'freaky' trip. It was very intense, but there was no sense of panic at all. I would probably feel OK going out to dinner with my parents while being on this combination - the harmala really seemed to add a calming aspect to the trip. It also seemed to be less personal of a trip. Rather than a dive into the subconscious mind (as with LSD/shrooms), it seemed to be a dive into what Jung called the super-conscious Mind - the mind of humanity as a whole. Alot of the things I usually end up thinking of while tripping never crossed my mind...and alot of things I have never thought about while tripping were quite prominent in my mind last night.",
  "Harmala is quite legal, and quite easy to get through various mail-order botanical companies...I highly recommend anyone who uses shrooms or DMT try mixing some harmala with the shrooms/DMT. It's incredible - like tripping for the first time. And I like the doors that it opened in my mind. I feel like this trip did a lot of good for me."
 ],
 "erowid": {
  "id": "2351",
  "citation": " Murple. \"Two Takes On First ShroomHuasca Trip: experience with Mushrooms & P. harmala (Syrian Rue) (ID 2351)\". Erowid.org. Jul 15, 2000. erowid.org/exp/2351",
  "substance": "Mushrooms & P. harmala (Syrian Rue)",
  "views": "10834"
 }
}
