{
 "title": "5-MeO Beta Testing",
 "author": "Visation",
 "citation": " Visation. \"5-MeO Beta Testing: experience with 5-MeO-DMT & Cannabis (ID 14662)\". Erowid.org. May 15, 2002. erowid.org/exp/14662",
 "substance": "5-MeO-DMT & Cannabis",
 "bodyweight": "200 lb",
 "report": "<p>I am writing here to describe my first experience with 5 Meo DMT, which happened last night.  After spending many hours researching on this site, I decided that 5 Meo DMT was the tryptamine I wanted to try.  My experience with entheogenic substances is not that extensive: A couple of mushroom trips (p.cubensis and amanitas muscaria), one rather unremarkable experience with morning glory seeds, some failed salvia attempts and a whole lot of chronic. </p><p>Needless to say, I was a little hesitant when I opened up the package in the mail containing a small plastic envelope with 250mg of 5meo in it.  However, curiosity soon got the best of me as I sprinkled about 5 mg onto the bowl I was about to smoke. The taste was hardly offensive (plastic, but a good clean kind of plastic) and the smoke was a little harsher than normal. I definitely noticed a strong body buzz and a tripping headspace that was somewhere between 'whoa! I'm really stoned' and 'Damn, these mushrooms are the shit!' however I must say it was nowhere near the intensity of most of the experience reports I've read on this site.  That's probably because I only did a small amount. </p><p>Later that evening I dipped a finger into the bag and picked up a couple of grains (about 5mg again by my estimation - could've been less), which I promptly insufflated.  This experience was a little more intense, although it took longer to come on.  I had a warm body buzz and very unfocused cognition.  It was quite a task for me to find the remote to my television, let alone brush my teeth so I could go to bed.  This lasted for about 2 hours until I was finally able to fall asleep. </p><p>That was last night.  Today I am a little groggy (due to lack of sleep more than anything else) and occasionally have little mini-flashbacks, although nothing serious.</p><p>All in all, I would say it was a fun experience, although nothing too out of control.  Most definitely something worth trying again when I am able to get the full effects, and I will be able to make a better judgement.</p>",
 "year": "2002",
 "id": "14662",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-15T07:00:00.000Z",
 "views": "10815",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.0 mg",
   "administration": "",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(flowers)"
  }
 }
}
