{
 "id": 14678,
 "title": "First San Pedro Encounter",
 "date": {
  "submission": "2000-10-08T07:00:00.000Z",
  "experience": "1996"
 },
 "author": {
  "name": "Murple",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 g",
   "administration": "oral",
   "substance": "Cacti",
   "form": "(tea)"
  }
 ],
 "report": [
  "Date:         1996/07/26",
  "Woah what a fucking night!",
  "I ordered some San Pedro, mainly out of curiosity, not really expecting it to be worth the money. Let me just say this stuff is for REAL, it works and it works REAL well! ",
  "I started with about 40 grams of dried cactus. I chopped it ALL (including the skin and the few spikes and the tough woody-like shit in the middle) up into little bits and pieces and soaked it in water over night, then boiled that water for an hour or so. Then I filtered out the cactus chunks, saved the liquid, and threw the cactus sludge into another jar of water overnight. I repeated this process 3 times until the liquid stopped turning brown overnight. I took the 3 liquids and mixed them in a large pot, and threw away the cactus remains. I boiled the 'tea' off for about 2 hours until it was concentrated down to 2 glassfulls.",
  "This was some of the most disgustingly bitter stuff I've ever tasted. Amazingly I didn't throw up, and got down a whole glass until I couldn't force anymore down. I decided 'Oh well I didn't drink enough to probably get more than a mild buzz.' All the online literature suggests 40 grams of dried cactus would not be sufficient for a strong trip unless it was incredibly potent San Pedro, and I'd only drank the equivalent of 20. Well, about an hour or so later I was surprised to find myself tripping very very hard.",
  "The experience was not quite like LSD or shrooms. More shroomlike than",
  "acidlike, but different. For one, the body feeling is very different, it lacks the electric like feeling you get on the indoles. My body just felt odd. It wasn't particularly speedy as you might expect from a phenethylamine. The mental state was alot clearer as well, more a clean stream of consciousness than a blasting torrent of chaos like with acid. And there was the odd sense of someone being there on the other side, guiding you along. Mescalito? :) Time distortion was MUCH more pronounced than with LSD. I repeated several hours over and over, it seems. I remember looking at the clock at 3:10am, and looking at it an hour later and it was 3:02am. Another odd effect was I noticed a strong aphrodisiac quality. This stuff will make you pretty horny, which surprised me.",
  "I've taken LSD over 300 times, and shrooms around 20 times. San Pedro made me feel like the first time I tripped. This stuff has alot more of the spiritual qualities I've always liked about acid and shrooms, and its a cleaner trip."
 ],
 "erowid": {
  "id": "2356",
  "citation": " Murple. \"First San Pedro Encounter: experience with San Pedro (ID 2356)\". Erowid.org. Oct 8, 2000. erowid.org/exp/2356",
  "substance": "San Pedro",
  "views": "24766"
 }
}
