{
 "id": 14676,
 "title": "Did Not Sleep or  Pass Out",
 "date": {
  "submission": "2006-09-18T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Insommanic",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.5",
    "quantity": "2.5"
   },
   "administration": "oral",
   "substance": "Gamma-Crotonolactone",
   "form": "liquid"
  }
 ],
 "report": [
  "Having read some reports about gamma-C I decided to purchase some. ",
  "Late one particular friday evening about a week after the gamma-C arrived I was having trouble sleeping and decided to try this new product.",
  "I had heard various reports about how much to use.  Everything from 1g to 3g. ",
  "I have a 1ml pipette and I calculated that 1ml = about 1g.  Since I weigh 190 pounds I opted to start at the high end of the dosage range.",
  "This chemical looks like GBL and its viscosity is very similar.  But the smell is fairly strong and the taste is the worse!  I could not drink it strait or with water.  Finally I mixed it with Tomato juice. ",
  "gamma-Crotonolactone with tomato juice tastes like a spicy bloody mary cocktail with a smokey flavor on top and a bit of extra burn going down.  I had an empty stomach as it was about 2 in the morning and I had not eaten since dinner time.",
  "After about 25 minutes I started to feel the effects.  I felt a very slight nausea, much less than with g-BL or GHB.  A nice pleasant sedative effect soon overcame me.  I turned on the stereo with some light trance music.  I became completely relaxed and very happy.  I only wish I had been with friends as I really wanted to share the experience.",
  "At about the 1 hour point I thought to myself that with this much GHB or g-BL that I would have gone to sleep.  The sedative effects of the g-Crotonolactone were stronger and deeper yet not too similar to GHB or g-BL.  They felt better.  But I did not fall asleep!",
  "The whole experience lasted about 3 or 4 hours with the effects dropping off slowly over that time.",
  "This is a great chemical.  The taste is too strong for the date rape crowd to use.  You could never put this into a drink, even a the strongest bloody mary without there being a strong and noticable taste.  Also, I did not sleep or pass out as I would have with GHB or g-BL.",
  "This is my first try with this chemical.  I am really impressed.  I will share this with friends."
 ],
 "erowid": {
  "id": "23555",
  "citation": " Insommanic. \"Did Not Sleep or  Pass Out: experience with GCL (ID 23555)\". Erowid.org. Sep 18, 2006. erowid.org/exp/23555",
  "substance": "GCL",
  "views": "8127"
 }
}
