{
 "id": 14683,
 "title": "Riding that train",
 "date": {
  "submission": "2000-11-20T08:00:00.000Z",
  "experience": "1997-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Murple",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "lines",
    "quantity": "6"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "lines",
    "quantity": "2"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "This was far from my first time using cocaine... I'd had it perhaps 2 dozen times since 1990... but this time I decided to try and document the effects as they occured.",
  "Nov. 23, 1997",
  "-------------",
  "11:27pm:",
  "    I just cut out two medium-to-small sized lines of cocaine. I've",
  "already had about 6 or 7 lines over the past 3 hours or so, the last",
  "being a little over an hour ago. I smoked a bowl of pot about 45 minutes",
  "ago, but its effects are pretty much unnoticeable, except maybe a slight",
  "reduction in the edginess of the cocaine effects. I'm definately still",
  "feeling the effects, although I'm in the come-down stage at present. The",
  "next 2 lines should give me a pretty typical high-dose cocaine experience.",
  "At present, I feel contradictorally wired and tired. I feel as if I could",
  "fall asleep if I wanted, although from experience I know I couldn't yet. I",
  "feel a warm fuzzy feeling all over my body, similar to the feeling of the",
  "second wind you get when you stay up all night, but there is also a mild",
  "feeling of stimulant tension. Euphoria has definately long since passed.",
  "Cocaine makes me dehydrated, and this manifests itself primarily in the",
  "feeling of dry mouth. I will frequently suck on my cheeks, trying to",
  "salivate, I guess. It's not really a conscious thing. Its a bad thing,",
  "actually, as it makes the dry mouth worse, and sometimes will leave my",
  "mouth feeling uncomfortable the next day. I'm going to finish my",
  "cigarette, then do these lines.",
  "11:33pm:",
  "    I snort the lines, and immediately feel both euphoria, and a",
  "passing urge to get the rest of my coke out and do more. I get the urge to",
  "smoke a cigarette, so I do. The high intensifies for a minute or two then",
  "levels. I'm mildly euphoric, but very stimulated. Its a distinct",
  "stimulation, more like amphetamines than caffeine. But definately",
  "different. There is a mild anesthetic property, mainly concentrated in my",
  "mouth and nose, and a generalized tingly, warm sensation. I notice myself",
  "typing alot harder, but pausing more between sentences. The urge to smoke",
  "my cigarette is overwhelming. There is a warm feeling along my spine.",
  "Mentally, I feel both calm and stimulated, somewhat paradoxically. If",
  "there were people here, I'd be talkative.",
  "11:38pm:",
  "    I am feeling a barely perceptible decrease in the high, and decide",
  "to stop typing for a little bit to enjoy it, probably with another",
  "cigarette. The urge to do more coke occasionally pops into my mind but",
  "then leaves just as quickly.",
  "11:53pm:",
  "    I went and smoked a cigarette, and alternated (quite frequently)",
  "between walking around my room smoking it, sitting on the edge of my bed,",
  "and putting down the cigarette to lay down and close my eyes. Laying down,",
  "I felt very calm, and as if my body were floating. The peak wore off",
  "gradually, and not evenly. I would alternate between feeling come-down",
  "effects and peak effects, with the come-down periods becoming longer and",
  "more frequent.",
  "    The euphoria is mostly gone now, and the thoughts of doing more",
  "coke are a little more frequent and longer, but are nowhere near",
  "irresistable. Simply being aware of the craving seems to make it go away.",
  "I took a multivitamin just now, which I always do before bed anytime I do",
  "any drugs outside of my usual ones (pot, tobacco, and caffeine). It",
  "generally reduces day-after fatigue. The stimulation is still quite",
  "strong, and more amphetamine-like, although it is beginning to fade into",
  "the post-peak mellowness of cocaine. I am almost back to the point I was",
  "when I began writing this.",
  "    Physically, the dry-mouth has become more noticable again. My",
  "lungs feel sort of grimy from smoking too many cigarettes (cocaine tends",
  "to make me chain smoke), and my nasal passages feel somewhat clogged and",
  "sore from doing coke all night. I snorted a few drops of warm water to",
  "help clear out my nose, which helped significantly. I can still",
  "occasionally taste cocaine in the back of my throat if I snort or breath",
  "deeply through my nose.",
  "12:05am:",
  "    I'm basically back to where I was at the beginning now. I feel",
  "calm and quiet. I don't really feel bad, although there have been times",
  "when I've felt quite depressed and physically worn when I've done alot of",
  "cocaine in a short time. I feel physically worn out, and mentally a little",
  "tired, but its definately not a bad thing - basically like being",
  "overtired, despite the fact that I know I could not fall asleep right now.",
  "I've probably done about 1/2 gram over the course of about 4 hours, which",
  "although is alot, is nowhere near the most I've done; that would probably",
  "be about 1.5 grams over 2 or 3 hours. Aside from the two lines I did while",
  "writing this, I used the cocaine in a social setting tonight, with a girl",
  "and a guy I'm friends with. Its when doing it alone that I'll sit there",
  "and do line after line until it's gone or I just can't take anymore.",
  "    I plan on smoking a small bowl of pot to relax, and write a little",
  "more. I'm going to take a 3mg melatonin tablet and probably a shot of",
  "tequila before I go to bed, to counteract the stimulant effect that would",
  "keep me from sleeping. I'll still probably be unable to sleep for about an",
  "hour, perhaps more, but it will definately help, though it will probably",
  "make me groggier tomorrow.",
  "    Overall, it was an enjoyable experience, but not outstandingly so.",
  "Cocaine simply isn't my drug of choice. I'm glad I did it, but it'll",
  "probably be a while before I do it again.",
  "12:16am:",
  "    I take my melatonin, and take a hit off my bowl. This experiment",
  "is at an end."
 ],
 "erowid": {
  "id": "2359",
  "citation": " Murple. \"Riding that train: experience with Cocaine (ID 2359)\". Erowid.org. Nov 20, 2000. erowid.org/exp/2359",
  "substance": "Cocaine",
  "views": "189562"
 }
}
