{
 "id": 14707,
 "title": "A Combination of Techniques / Recipes",
 "date": {
  "submission": "2004-06-29T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Neos 666",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "oz"
   },
   "administration": "oral",
   "substance": "Cacti",
   "form": "dried",
   "specific": "T. pachanoi"
  }
 ],
 "report": [
  "I recently used a combination of methods to engage in a mescaline experience via San Pedro cactus.",
  "I obtained a few specimens of the cactus (believed to be the Trichocereus pachanoi species) from a distributer about 6-7 years ago. I've since grown dozens of plants from the originals I purchased but have only experienced the mescaline inside them for the second time 3 days ago. This second time I decided to follow the recipes found in Jim DeKorne's book 'Psychedelic Shamanism'. In this book he lists 2 preparations for brewing the cactus into a drinkable liquid.",
  "The 1st method involves boiling the raw cactus sliced, stripped of it's waxy skin and spikes, for 8 or more hours hours (unfortunately that's as detailed as he goes with that) in a large tin of water. The shamans then proceed to remove the solid material and boil down the remainder to tea cup sized portions (again he leaves out the detail about how many cups). Mr. Dekorne then goes onto detail his somewhat similar method.",
  "In this 2nd method 4 ounces worth of dried cactus powder(obtained by stripping the wax and spikes, freezing the raw cactus solid, chopping up the frozen chunks in a blender, then pouring the mush out on a cookie sheet covered with plastic wrap and letting dry. The resulting dried out cactus material is crumbled into powder.)",
  "The powder is boiled in an electric crock pot for 24 hours after which the liquid is filtered through cheese cloth and then filtered again through a coffee filter. The remaining liquid is boiled in the crock pot with the lid off, until it is reduced to to 3 fluid ounces.",
  "My experiment was a little different. Since I did not have a crock pot I used a large cooking pot (3-4 gallon) with the lid on filled almost to the top with water and about 4 ouces of dried cactus powder obtained by the above mentioned process. I proceeded  to boil the contents for about 24 hours, refilling the pot as neccessary. In the final hour I allowed the mixture to boil down to about 3-4 quarts. I then lined a strainer with cheese cloth and poured the liquid through into a small pot. The solid material was left in the cheese cloth and I wrapped it up in the cloth (after it had cooled) and squeezed the remaing liquid out into the small pot. Then I lined the strainer again with a large coffee filter and poured the liquid into another small pot. This remaining dark syrupy liquid was boiled down ,with the lid off, to a little over 3 double shot sized shot glasses (or approx. 5-6 ounces).",
  "Once cooled, I swallowed 3 double shot glasses worth at approximately 8pm on a Friday night. It tasted horrible, made me gag and I even spit up a little of the last glass. The onset was slow taking about 2 hours to build. As the trip developed I noticed an 'energized' feeling and was antsy/anxious. I could feel a metabolism shift that was a bit MDMA-like in it's speediness. Didn't really see trails so much like musrooms or LSD. Colors and light seemed brighter, philosophic thoughts arose constantly. If I concentrated my sight on anything non-moving for a moment the view would shift and move kind of like seeing through heat vapors. The video games I played (Mech Assualt, Tao Feng) seemed more realistic and vibrant. In Mech Assault (a multiplayer on-line game) my performace was better than I have ever played sober. It felt like my reaction time was extremely fast and almost like I was thinking 10 moves ahead of my opponents.",
  "Later on I watched the animated Matrix short called 'the 2nd Renaisance' and the dvd version of Akira. Both were filled with images and meaning I had never seen before or understood. My mind was reeling and I felt like I was absorbing information on a level never experienced before. As the experience was winding down and the sun was rising I decided to try sleeping. I was still feeling very much energized despite wanting to rest. I got up a few times and layed down a few times. When i would try to sleep with my eyes closed I would see bizare morphing colors, patterns and images. At one point, with my inner voice I spoke to 'mescalito' and didn't so much hear 'mescalito' reply but rather understood it as a spirit bestowing a gift to me for taking care of it all these years as it has grown in my cacti. As I continued to be unable to sleep I tried smoking some weed as I watched some of my videos. This was powerful experience and synergized well with the mescaline. Smoking salvia divinorum leaves was pleasant as well and propelled me even higher. The smoking of the herbs made me feel a surge of indescribable power.",
  "My only complaints would be the stomach cramping and nausea that seemed to come and go through the night. I also felt gassy. None of it was dehabilitating but I was glad to be home nonetheless. I don't think I would ever want to experience all of this in a public setting. The dosage was comparable to about 1/16 of an oz. to a full 8th of an ounce of mushrooms. All in all I was extremely pleased with the outcome and have a new found appreciation for being in a symbiotic relationship with a plant sacrament. I am no longer merely a consumer."
 ],
 "erowid": {
  "id": "23687",
  "citation": " Neos 666. \"A Combination of Techniques / Recipes: experience with Cacti - T. pachanoi (ID 23687)\". Erowid.org. Jun 29, 2004. erowid.org/exp/23687",
  "substance": "Cacti - T. pachanoi",
  "views": "9798"
 }
}
