{
 "title": "Take a Moment to Pause and Think",
 "author": "Sway",
 "citation": " Sway. \"Take a Moment to Pause and Think: experience with Mathamphetamine (ID 14700)\". Erowid.org. Mar 29, 2007. erowid.org/exp/14700",
 "substance": "Mathamphetamine",
 "bodyweight": "185 lb",
 "report": [
  "<p>Not everything drug related is as bad as it seems.  Im writing this in response to all the negativity toward drug existence, use, etc.  Im a 19 year old male who is openly (to people who know me well enough) addicted to meth.  Every story I have ever read, heard and whatnot have all been the same; 'I had to FINALLY get help [because I was feeling too bad about myself and my life, and the drugs just werent working the way they used to, and I realised that this is not the way to deal with my problems. The drugs controlled and destroyed my life. Im humiliated to know that Im a drug addict and I just feel hopeless.  I do not feel peaceful or stabil, I cant be successful or happy, and I dont really feel I have any future whatsoever.'",
  "That is what I hear whenever drugs are mentioned.  If that is what drugs are supposed to do to you. then I've been doing them wrong since the first day I started.  I do not wish to get help, because I am content with what I am; an addict.  I can stop if I chose to. I made the choice to continue with the use of this drug, and I can choose to stop too.  Sure, the drugs arent as potent for me anymore because of the extreme tolerance Ive built up to them.  But still.  I did not become a user to deal with my problems, I lived my life for myself and my enjoyment.  It was fun, so I kept doing it.  Knowing 100 percent that my next fix could be my last.  That I could get bump that would be too pure for me, and it'd stop my heart, and then the lights would go out, the orchestra would fade, and the party would end.  Knowing that, I continued to use, because it would not matter to me if I were to die from dope that was too good, or an overdose, or anything drug related.  It didnt matter to me (and still doesnt for that matter) because I knew the consequences of every decision I made, before I made it.",
  "On to my next point, drugs ruining and controlling life.... bullshit!!!  I personally love my life, enjoy where it's at, and know that there is a world of opportunity before me. Not only that but, truth be known, am proud to be a drug addict.  Im not ashamed or humiliated to be a drug addict.  If you were to ask me if I had done drugs in the past, do drugs in the present and/or plan on doing drugs in the future, I would have no problem telling you that I did drugs, still do, and want to continue.",
  "As for not being at peace, becoming or being unstable, not feeling a possibility to be successful, or just plain not being happy and depressed I would have to say that something that is on the opposite side of that spectrum is present in my drug contained life.  When Ive had a fix, I am a more cool, calm, and collected person, who is filled with a sense of inner peace at all times regardless of whether or not I am in a drug induced state.  I am more organized, detail oriented, precise, and all around more stable when Im accompanied by a drug in my daily life.  I will admit Im not as successful as I'd really like to be.. but who the fuck is??  Im happy with the job I have, and the money I make, but I also am preparing to go to college to get on the track to obtaining a career quite possibly as a clinical psychologist.",
  "Im a very happy person.  Im confident to the point of arrogance at times, I have a very high self esteem and self confidence level, Im popular with the people I need to be, and I still have really great close friends.  This is a situation that I was not in 2 and 1/2 years ago.  I've gone through a lot of shit in my short life, I've endured more than most average everyday coffee drinkin Joes.  I've had experiences from the worst mind fucks and severe heartache to witnessing some horrificly violent events and being on the brink of suicide again because I wasnt able to kill myself the last time I tried.  Not many people would survive a trip, let alone a brief tour of my psyche, they couldnt remain confident and happy go lucky like they usually are.  They would experience exactly what I did... but only at a fraction of the intensity.  All my past aside, I am still very happy about the point Im at in my life.  I would not change a single thing even if I had the chance.",
  "I have never lost a job because of drugs, I have never attacked or killed anybody.  I have yet to even get into an incident with the authorities while being on drugs.  Every ticket and blemish on my record was created on a day that I was stone cold sober.  So now, I end my little rant on this subject and will continue my life where I get a fix, go to work, hang out with my friends, and live a rewarding life with drugs accompanying me on my voyage.</p>"
 ],
 "year": "2002",
 "id": "14700",
 "gender": "Male",
 "views": "4051",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Methamphetamine"
  }
 ],
 "submissionDate": "2007-03-29T07:00:00.000Z"
}
