{
 "id": 14715,
 "title": "Easter Cactus Resurrection",
 "date": {
  "submission": "2000-07-13T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Murple",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "100",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Cacti",
   "form": "dried",
   "specific": "T. pachanoi"
  }
 ],
 "report": [
  "I boiled 100g cactus down to half a coffee mug of green/brown slime.\r3:58PM",
  "Take a first shotglass full. Ewww! Such a foul, foul taste. And its so thick it just slowly crawls down your throat...\r4:21PM",
  "After 2 shots, I can feel the sludge settling into my stomach. I was reading from 'The Hymn of Jesus' (Acts of John) as I drank it. Still plenty more to drink! Ugh... I think I may be feeling the first hint of effects though.\r4:40PM",
  "3 shots, definately feeling it! (OK, they're actually about half full shot glasses - more would be impossible to down) Try a fourth glass I guess!\r5:27PM",
  "Took my 5th (and last, for now!) shot. I'm definately feeling something pretty strongly.\r2:59AM",
  "Jesus, I'm still tripping! What a long, strange trip it's been...\r3:43AM",
  "What a trip! Almost 12 hours since I drank it, and still tripping. This is probably about the 5th time I've had Pedro, but none of the other times came *close* to this. I don't think I'd ever truly tripped on mescaline until now. A real interesting trip! Very strong similarities to MDMA, in some ways. The peak was a very long dreamlike state that came in waves. After my last glass, I sat down and read some Gnostic texts for Easter, and by around 6PM was unable to keep reading, and lay back listening to music and getting lost in thought. Visuals were excellent, way more intense than acid, and much different. Much more 'primitive' and 'natural.' I was listening to a live Grateful Dead tape around sunset, and in my mind was transported back to a Dead show at sunset. The whole trip had a theme of going back to my roots. Its a real dreamy trip - there's an almost narcotic-like effect on the body (but *not* the mind), similar to how ecstasy can be for me at times. Watching people come and go outside was endlessly fascinating. Shadows became magical. Music wasn't really enhanced, and served primarily to set the tone for mental wanderings. Open and closed eye visuals tensed to interrelate, and the mental journeys were to earthly places, not strange dimensions like with acid. Its a very happy trip as well... I remember finding it real funny when I thought to myself, 'It should be illegal to feel this good... oh yeah, IT IS!' I started coming down around midnight, after watching 'The Ten Commandments' on TV. Its 4:16AM now and I'm still not totally back...",
  "There are a few negatives though, like most notably the horrible taste. It also gave me diarrhea and gas, but I was tripping enough that it didn't bother me, and passed quickly. The taste, however, is a big negative. And with effects lasting this long, its sort of exhausting.",
  "But still, *wonderful* stuff!"
 ],
 "erowid": {
  "id": "2371",
  "citation": " Murple. \"Easter Cactus Resurrection: experience with San Pedro (ID 2371)\". Erowid.org. Jul 13, 2000. erowid.org/exp/2371",
  "substance": "San Pedro",
  "views": "14132"
 }
}
