{
 "id": 1472,
 "title": "Free, Relaxed, Interesting Trip",
 "date": {
  "submission": "2002-07-25T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Duke Of Earl",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "12",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "pill/tablet"
  },
  {
   "time": "0:10",
   "administration": "smoked",
   "substance": "Opium"
  },
  {
   "time": "0:10",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "2:00",
   "amount": {
    "number": "0.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "specific": "P. cubensis"
  },
  {
   "time": "10:00",
   "amount": {
    "number": "1",
    "unit": "cup"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "I recently came across 2 2C-T-7 pills of approximately 12mg, that were just given to me by a friend.  I researched them on the web and decided to try them dispite their shakey dosage, because they were definitely below what was considered a threshold dose. So me and my girlfriend took them, and a few minutes later my friend came by with some weed and some opium, so we smoked a bowl, topped it with o, and then rolled a blunt. ",
  "About 2 hours later I felt sort of strange, but I wouldn't consider it tripping.  I had some shrooms I was saving, but I had taken a full 1/8 of the same shrooms before and tripped fairly hard.  I remembered that the 2c-t7 site said that it greatly inhanced psilocybin, so we literally split A GRAM.  We began watching a trippy dvd, and I couldn't tell if it was me or the video, so I tried closing my eyes.  I was getting great closed eye visuals, with colors snapping into pictures almost like a slide show, and the tripping feeling was very intense.  The strange part was that I was completely relaxed, almost to the pointof falling asleep.  It was very pleasant to be able to enjoy the trip without having to get all antsy and start moving around.",
  "I snapped out of my daydream and me and my girl realized we had been both doing the same thing.  Once we realized it though we snapped out of it and the visuals were not as intense.  We decided to smoke a blunt (just weed) and that brought us right back up.  We walked around for a while and the tripping feeling pretty much left us, but the visuals remained.  I can only attribute that to the shrooms wearing of and the 2c-t7 kicking in.  The whole trip lasted about 10 hours.  Also interesting to note, I drank a beer towards the end of the trip, and felt really drunk for about 5 to 10 min., the I was completely fine.  Just thought I'd share, and I believe the opium let us sit back and enjoy the onset of the trip.  As a word of caution, we took doses that alone were far below what is necsary to trip on either substance alone.  I feel that had we split even a gram a piece the trip would have been EXTREMELY intense. ",
  "Anyway, be careful, fasten your seatbelts and enjoy your flight."
 ],
 "erowid": {
  "id": "14547",
  "citation": " The Duke Of Earl. \"Free, Relaxed, Interesting Trip: experience with Cannabis, Opium, 2C-T-7, Mushrooms (P. cubensis) & Alcohol (ID 14547)\". Erowid.org. Jul 25, 2002. erowid.org/exp/14547",
  "substance": "Cannabis, Opium, 2C-T-7, Mushrooms (P. cubensis) & Alcohol",
  "views": "7774"
 }
}
