{
 "id": 14727,
 "title": "PedroHuasca",
 "date": {
  "submission": "2001-06-25T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Murple",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "capsl",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract"
  },
  {
   "time": "0:45",
   "amount": {
    "unit": "g",
    "grams": "65",
    "quantity": "65"
   },
   "administration": "oral",
   "substance": "Cacti",
   "form": "tea",
   "specific": "T. pachanoi"
  },
  {
   "time": "7:45",
   "amount": {
    "unit": "ml",
    "quantity": "2.5"
   },
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "liquid"
  }
 ],
 "report": [
  "10:15PM - Pick friend up from work.",
  "10:30PM - Each ingested 1 capsule of harmala extract, containing the extract of about 1 tablespoon of harmala seeds.",
  "11:00PM - Each of us drink Green Slime Tea giving each of us a dose equal to about ~65g of dried Pedro.",
  "11:30PM - I get hit by INTENSE nausea and run to the bathroom. I vomit, then go back to the couch feeling miserable. My mind is full of negative thoughts, something that's never happened from Pedro before and which I feel came from the harmala. I spend the next hour or so fighting off waves of nausea, having to run to vomit about 5 ot 6 times. Fucking harmala! Unlike the nausea harmala normally induces, rather than feeling as if I am dying, after the first puke I feel as if I am purging myself of negative emotions. Every heave throws out another bad feeling, leaving me feeling cleansed when all of it is over.",
  "12:00AM - OH MY GOD!!! The trip has reached very intense levels. Keeping my",
  "eyes open becomes difficult because so much is going on internally. Recent",
  "life events are being reviewed from many points of view simultaneously,",
  "interspersed with bizarre visuals, such as a universe in which nothing exists but millions of smurfs running around in a black vacuum. When I open my eyes, the room is very strange - shadows are meaningful entities, perspectives alter instantanously, everything is weird.",
  "12:00AM thru 6:00AM - After the nausea passes, I am in a very good mood, though all I can do is lay on the couch and alternate between watching open-eye visuals and closing my eyes to reflect on things and watch closed-eye visuals. The closed eye visuals are weird... in one, a man is sitting in a bathtub taking a bath, only the bathtub is floating in the middle of a vast ocean. In another, I am watching a formal party, with people in tuxedos and evening gowns - only they are in a swimming pool with water up to their necks - this seems to be where they want to be, however. I am able to examine recent events in my life in amazingly clear detail, free from my own anxieties.",
  "The television is on the whole time, and whenever I open my eyes and look at it, there is a different show on, it seems. It's impossible to follow the plots of anything I see for more than 20 or 30 seconds, though this could be due to the fact that I dont feel like watching. The shadows on the walls are much more interesting visual stimuli. At some point, I close my eyes and have a very intense closed eye visual.",
  "I see a San Pedro in front of me, very realistic. All of the sudden, it grows to enormous size - hundreds of branches going out in every direction. The branches are easily 2 feet in diameter, and 40 or 50 feet tall. This mega-cactus is strangely alive, and seems to move slightly. All of the sudden the face of an old man appears on the top of the main branch of the cactus, and its eyes look down to its 'belly', which swells then opens up,revealing a large sphere of stars - I realize I am looking at the universe. A voice tells me that this is inside me as well, and that what needs to be done is to take this core of my being and pour out its energy in the form of love. The voice asks me if I understand and I answer that I do - and the vision ends.",
  "I open my eyes and sit up, and tell my friends that I have just seen God. We all laugh. Laughter is a dominant emotion all night - I say emotion, because it is laughter for no reason other than just being alive. We keep commenting on how everything is weird - and derive great joy from the inherent oddness of the universe.",
  "6:00AM-12:00PM: Several people who had been at a club all night come over, and everyone does a round of 1,4-butanediol. I took 2.5ml, then about an hour later take 3ml. A strange thing happens - my body becomes extremely intoxicated from the BDO, but my mind remains in a mescaline state, seemingly untouched by the BDO. This incongruity leaves me with the strange and not quite comfortable feeling that I am unable to control my body. While my coordination is shot, my mind is clear. I'm completely unable to sleep, though my body is very tired. Not a combination I'd ever try again. Finally, around 10AM, a friend drives me home where I finally manage to fall asleep around noon. I wake up exhausted but",
  "spiritually refreshed."
 ],
 "erowid": {
  "id": "2375",
  "citation": " Murple. \"PedroHuasca: experience with San Pedro & P. harmala (Syrian Rue) (ID 2375)\". Erowid.org. Jun 25, 2001. erowid.org/exp/2375",
  "substance": "San Pedro & P. harmala (Syrian Rue)",
  "views": "28596"
 }
}
