{
 "title": "Unforgettably Strange",
 "author": "KraftWerk",
 "citation": " KraftWerk. \"Unforgettably Strange: experience with PCP (ID 14726)\". Erowid.org. Jan 25, 2008. erowid.org/exp/14726",
 "substance": "PCP",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "PCP"
  ]
 ],
 "footer": [
  [
   "2001",
   "14726",
   "Male",
   "",
   "Not Given",
   "Jan 25, 2008",
   "12575",
   " "
  ]
 ],
 "report": "<p>I don't remember why my buddy laced the blunt that he gave me with PCP. Maybe it was to make things more interesting. It definately did that! </p><p>After smoking this blunt, I felt much, much different than I normally do when high on weed. It was kind of a paranoid agitation, things sounded as though they were liquids, rippling and pouring, surrounding me and engulfing me. That is when things started to get wierd. </p><p>I thought that I was stuck in sand, falling through it. I also thought that I was being stalked. I could see a man in a pulsating trenchcoat fly by me, before spinning in circles and laughing at me. I then could see a fence shattering like glass. I was extremely scared by the intensity of these hallucinations. I then started to speak pure nothingness to those who I thought were around me, I remember speaking about 'Movie snatchers' and how someone was trying to kill me. Then, I went with some of my buddies on a sailboat. </p><p>If you don't know about sailing, the main (big) sail is mounted on a swiveling metal pipe (called the boom). When you make a turn on a sailboat, the boom swings over very fast, and because of its speed, you have to duck under it, or else you'll end up with a painful bump on the head. Well anyways, because I was so out of it, I was hit full-force on the side of the head by the boom. Normally, I would have doubled over in pain, but I felt NOTHING, absolutely nothing. </p><p>I have heard how people on PCP feel no pain, and now I believe it. The rest of the day consisted of seeing the sky change colors, water boling and burning and sometimes seeing a man with a knife yelling at me. Because the trip was so intense, I'll never, ever do PCP again. It was one hell of an experience though!</p>"
}
