{
 "title": "I Felt Like I Was in a Black Hole",
 "author": "Lucky Charm",
 "citation": " Lucky Charm. \"I Felt Like I Was in a Black Hole: experience with Freon (ID 14728)\". Erowid.org. Jun 23, 2007. erowid.org/exp/14728",
 "substance": "Freon",
 "bodyweight": "105 lb",
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I have done freon many times, but one night it was an amagingly different experience. There was a bunch of people over, it was a 'party',  and my friend would go and fill up trash bags with freon. Everytime they came back, I would go and take about three hits from the bag, not enough to pass out though. Then, I took a little more than three, and my friend squeezed the bag to give me bigger hits. I walked inside and my world was suddenly different. The corners seem to turn a beautiful purple color, and this overwhelming feeling of warmth caressed me from the inside. An unexplanable sound was very clear and very loud. It was sort of like an echo, but no human can make the same sound. My brain sort of feels like it is pulsating. I was walking around the room (bad idea) with my hand over my face smiling and gigiling away like a clown. I began to stumble and suddenly i could feel myself fall over and over. I could barely hear my friends over the echoing sound, but I could make out a laughter that kept repeating the same way, 'aha, aha, aha, aha.' I felt like I was in a black hole replaying.</p><p>Two of my friends caught me when I fell, and all I could see was it replaying over and over and over. I felt my hand on the table but I couldn't remove it. I felt my self smiling with my mouth open and I figured I looked dumb so I vaugley remember closing my mouth. The most annoying part was not being able to do anything at all about it, just having to lay there until I woke up. It was very very crazy. But the whole time, I felt very good, I just felt really stupid. I know I will do freon again, just not to pass out! Freon is one powerful mother fucker.</p>",
 "year": "2002",
 "id": "14728",
 "gender": "Female",
 "timestamp": "2007-06-23T07:00:00.000Z",
 "views": "7729",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 }
}
