{
 "id": 14732,
 "title": "Smoking DPT HCl",
 "date": {
  "submission": "2000-09-10T07:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Murple",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "smoked",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Tonight was my 5th time out with this miraculous substance. I began tonight by being curious to see what would happen if I smoked DPT the same way as you would 5-MeO-DMT. I know with the free base it would work fine, but I have the hydrochloride salt which supposedly isn't effective smoked. I vaporized about 15mg or so, and felt a very distinctly tryptamine sensation - somewhat similar to a low dose of 5-MeO-DMT in fact. So it is definitely active smoked. I'd noticed the same thing about cocaine years ago - the hydrochloride was not supposed to be smokable, thus freebasing was invented. But it is definately smokable, and smoking cocaine HCl over marijuana (a 'snowcap') is a common practice. Smoking the salt may not be as efficient as the free base - but it definitely does work. Anyway, I decided to save this approach for another day, and continued with a more tried and true approach.",
  "I laid out about 50mg and insufflated it as 2 lines. About a half hour later, I insufflated about another 20mg. I played my guitar, listened to some music, and spent a little while laying down. The whole while I was online on a chat room talking to someone else who had taken DPT as well. At one point I thought to myself about how the war on drugs had polluted shamanic space by spreading ideas such as 'people who use drugs are bad.' Sometimes, ideas like these can intrude on anyone raised in this society, even suburban shamans - and they can pop up in the middle of entheogenic experiences.",
  "But like the image of the Buddha at the end of Huxley's novel Island, the shamanic experience and the ancient and sacred places it leads to sit quietly smiling as the boots of fascism trample around making noise. The fascists will pass, but the experience will remain - infinite, eternal, and unsullied."
 ],
 "erowid": {
  "id": "2377",
  "citation": " Murple. \"Smoking DPT HCl: experience with DPT (ID 2377)\". Erowid.org. Sep 10, 2000. erowid.org/exp/2377",
  "substance": "DPT",
  "views": "10043"
 }
}
