{
 "title": "The Recreational Effects From Ephedrine",
 "author": "DXMTRIPPER",
 "citation": " DXMTRIPPER. \"The Recreational Effects From Ephedrine: experience with ephedrine (ID 14733)\". Erowid.org. May 7, 2004. erowid.org/exp/14733",
 "substance": "ephedrine",
 "bodyweight": "135 lb",
 "header": [],
 "report": "</p>This is not one specific experience report but rather the compilation of various ephedrine experiences and a guide for people new to ephedrine.  Ephedrine can be found in OTC (over-the-counter) pills such as Mini-Thins, Yellow Jackets, and Stacker 2s.  I have used this interesting stimulant on and off for the past year and I am pretty happy with it's effects.  I am also glad to say that it is not scheduled.</p><p>My first experience with ephedrine was rather a quite stupid attempt of me to get a good buzz.  My past experience with Ritalin led me to believe that all stimulants produced a good euphoria.  So with this ignorant thought in mind I proceded to take 6 pills of Mini-Thins. These pills don't just contain 25 mg ephedrine but also an expectorant (gaufisen, I believe). Which totaled to 150 mg of ephedrine!  After 45 minutes I could feel the effects coming on...I became very sped up to say the least and had a good tingly feeling in the top of my head.  Pretty soon the speedy effects just kept getting stronger and stronger and my heart began to beat very rapidly.  Suffice to say, I was not very happy for a while and I had to wait 3 hours before I started to feel normal again.  The way I felt is when you take an overdose of caffeine....very agitated and jittery.  After this horrible experience I decided to stay away from ephedrine for a while. </p><p>One day, during a particular rough day at school, a friend of mine offered me 2 Yellow Jackets.  These pills contain 25 mg of ephedrine, some caffeine, and some other herbs.  They are to be used solely for the purpose of energy my friend had told me.  Well, being very wary of my first ephedrine experience I took 1 pill.  With 1 pill or 25 mg of ephedrine one will get sped up and have a general mood lift.  I found out that I liked the experience and took the other pill later that night.  I would not say it produced euphoria...a euphoria is a very strong good feeling and body high.  Ephedrine just gave me a mood lift.  I am sure it could pep me up if I was depressed. </p><p>Every so often I would take 1 or 2 pills of ephedrine.  Everything from Yellow Jackets, to Stingers, to Stacker 2s. Ephedrine really works for me in doses lower than 100 mg and it is good if you need to burn the midnight oil for a test or study for school.  I believe, however, that ephedrine is on it's way to becoming outlawed.  Reason #1...it can be used to make methamphetamine and the feds do not like this.  Reason #2...somebody out there makes the same mistake I did their first time with ephedrine and ends up seriously hurting themselves or even dying. </p><p>Ephedrine can also be very rewarding if taken with some other substances.  Alcohol and a low-dose of ephedrine can be quite stimulating and some have compared it to a low-dose of MDMA (XTC).  I have tried this combination and I would not compare it to MDMA but it definantly makes the drinking experience more enjoyable.  Another combination I have tried is with DXM.  I have found out that taking ephedrine at the same time you take the DXM ruins the DXM experience.  However, if the ephedrine is taken an hour or two after you take your DXM than you get a nice sedated feeling.  Be careful with this combination...the synergistic effects probably raise heart rate and blood pressure a good bit.</p><p>Overall, ephedrine can be a very rewarding substance if used properly.  I have really enjoyed the latter part of my experiences with ephedrine and just wanted to put in my two cents for anyone who is interested in this substance.  Thank you for your time Erowid.  Take care and keep cool.</p><p>DXMTRIPPER</p>",
 "year": "2001",
 "id": "14733",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-07T07:00:00.000Z",
 "views": "44100"
}
