{
 "id": 14763,
 "title": "Another Experimental Route",
 "date": {
  "submission": "2000-10-08T07:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Murple",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "3.0 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Well, nobody has tried this yet, so...",
  "8:50PM",
  "------",
  "    I weigh out 6mg of 5-MeO-DIPT, chop it up into fine powder, and",
  "divide it into two lines of approximately 3mg each. I divide each of these",
  "in 2 again.",
  "8:53PM",
  "------",
  "    1.5mg up one nostril, 1.5 up the other! The smell/taste is similar",
  "to DPT - or any other tryptamine for that matter. I'm glad that 5-MeO-DIPT",
  "has a very low dosage range... it would not be pleasant to insufflate",
  "large quantities of this. I have an immediate sense that 'something' is",
  "coming, but the effects are not instantaneous.",
  "8:58PM",
  "------",
  "    Yuck! The drip from this stuff tastes very bad, and also is giving",
  "a very uncomfortable burning sensation in the back of my throat. Neither",
  "saline nasal spray nor drinking seems to help. I guess I just need to wait",
  "it out.",
  "9:05PM",
  "------",
  "    I am beginning to feel a tryptamine lift, and the bitter burning",
  "taste in my throat is subsiding.",
  "9:20PM",
  "------",
  "    The taste in my throat has cleared up, and I'm definately feeling",
  "the effects now. At this point, its still fairly mild, and feels like what",
  "I would expect from the same ammount done orally. I wonder if it will",
  "build any more, or if I should do some more? I decide its best to wait",
  "another 10 minutes or so, just in case.",
  "9:30PM",
  "------",
  "    I'm feeling a rather good effect. I seem to have reached a plateau",
  "now. It feels slightly stronger than this dose would orally - but not by",
  "much. I feel warm, trippy, and happy. I have very mild visual enhancement",
  "(bright colors etc), like I would expect from a low oral dose of",
  "5-MeO-DIPT. The time it took from insufflation to peak effect was roughly",
  "25-30 minutes. I think a little more will do nicely. 2 lines of 1.5mg each",
  "are still on the plate, I think one of them is in order - if not both...",
  "9:40PM",
  "------",
  "    I insufflate one of the 1.5mg lines.",
  "9:50PM",
  "------",
  "    Fuck it. Up with the other 1.5mg!",
  "10:02PM",
  "-------",
  "    This route seems to be about co-effective with oral. Same dosage",
  "range (though maybe insufflated is SLIGHTLY more efficient). Similar",
  "subjective effects, although this seems a little more energetic, and it",
  "hit alot faster. The neck tension and jaw clench seems a little less",
  "prominent. There is no trace of stomach discomfort. This is a very clean",
  "experience compared to my oral experiments with 5-MeO-DIPT. This is an",
  "exceedingly comfortable place. This feels like wrapping up in a warm fuzzy",
  "blanket in front of a fire on a winter night.",
  "10:32PM",
  "-------",
  "    Ahhh... very nice. The last few lines are fully kicked in. I am at",
  "a very solid +2. Warmth, a nice tryptamine body high, a relaxed and mellow",
  "mindset. Some mild visual enhancements and perhaps even hits of OEVs",
  "scurrying past the corners of my eyes. I feel like going to lay down and",
  "relax and think for a while.",
  "11:00PM",
  "-------",
  "    Wow. Laying on my couch and listening to my fan was amazing. A",
  "timeless sense of relaxation and bliss. Thinking contentedly about life.",
  "Everything is good. I feel very introspective, in a warm fuzzy way. Again,",
  "the sensation is similar to the coming down phase of a very good LSD trip.",
  "I do feel that I am lower down now than I was a half hour ago, however. A",
  "few quick tokes of cannabis, then off to lay down for a few more minutes.",
  "11:11PM",
  "-------",
  "    I'm unable to return to that warm, floaty place. I seem to be",
  "coming down a good deal now. I am still quite high but the mental effects",
  "are now taking a back seat to the purely physical sensation of",
  "tryptamineness. The bright colors are still very prominent. But the peak",
  "effects are beginning to subside. I feel I've still got a long glide down.",
  "11:50PM",
  "-------",
  "    I'm a little lower than I was. Its very hard to judge how far you",
  "have come with this substance. Its very difficult to tell if I'm feeling",
  "less effect than a half hour ago, or to tell what effects have dissipated.",
  "But I know that I am alot further towards baseline than I was a half hour",
  "ago, nevertheless. I did notice a sort of laxative effect just now - an",
  "increase in peristalsis, rather. Perhaps the stomach effects of oral doses",
  "are not just because of chemical irritation of the stomach or intestine,",
  "but also due to some sort of neurological process? Perhaps it is",
  "interacting with serotonin receptors in the brain stem. Its a non-issue",
  "though. There was no discomfort whatsoever. This was a far cleaner",
  "experience than oral... except for the bad tasting drip. I think I will be",
  "using this route more than the oral route, despite my usual aversion to",
  "snorting things. Its just a cleaner trip this way.",
  "12:30AM",
  "-------",
  "    I'm pretty far down now. Could probably sleep without too much",
  "effort now. This experiment exceeded my expectations quite a bit."
 ],
 "erowid": {
  "id": "2389",
  "citation": " Murple. \"Another Experimental Route: experience with 5-MeO-DiPT (ID 2389)\". Erowid.org. Oct 8, 2000. erowid.org/exp/2389",
  "substance": "5-MeO-DiPT",
  "views": "16157"
 }
}
