{
 "id": 14779,
 "title": "The Experience",
 "date": {
  "submission": "2003-05-23T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Big Rass",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "45 g",
   "administration": "oral",
   "substance": "Banisteriopsis caapi",
   "form": "(tea)"
  },
  {
   "time": "0:15",
   "amount": "35 g",
   "administration": "oral",
   "substance": "Psychotria viridis",
   "form": "(tea)"
  }
 ],
 "report": [
  "The Experience",
  "This report was written the day after my second ayahuasca experience. While the first one was quite uneventful, the second proved to be nothing less than astounding. My first ayahuasca experiment involved some 50 grams of B. caapi and approximately 12 grams of M. hostilis. A fellow traveler felt a considerable effect from this dose, while I only had a brief encounter with what I felt to be a female consciousness of great power, but nothing else.",
  "After looking through the literature, I decided that a more scientific approach was needed. In his bioassays, Ott established 1.5-2 mg/g to be the minimun oral activity of harmine/harmaline, and the oral activity of DMT to be 0.25-0.50 mg/g. According to Metzner, there are two distinctive types of B. caapi; judging from a picture in his book, I determined mine to be of the type called tucanaca, reported to have a higher content of harmine (5.5 mg/g) than of the other alkaloids present in B. caapi. My weight being 68 kg, I decided that 136 mg of beta-carbolines from B. caapi should be sufficient. Using Metzner's data, this should be obtained from 23.4 grams of B. caapi, but to be sure I settled in the middle of Ott's recommendation of 30-60 grams, 45 grams. Choosing Ott's data on the DMT-concentration of P. viridis, 1.02-2.0 mg/g, making (17-34) - (34-68) grams of P. viridis the active dose, I again opted for the middle road, settling on 35 grams.",
  "For this second experiment I crushed 45 grams of B. caapi with a hammer and put it in a pot with 300 ml of tap water and a squeeze of lime juice. This was brought to boil, then left to steep for about 15 minutes. I poured the water through a nylon stocking and repeated the process once with the plant matter. The combined amount of fluid, 330 ml, was boiled down to 100 ml.",
  "35 grams of P. viridis was boiled for approximately half an hour with 500 ml of water and some lime juice. The fluid was filtered off and the plant matter was blended with 300 ml of water and lime juice. This was boiled for about 20 minutes and then strained. The combined liquid, 450 ml, was boiled down to 100 ml. The whole process took about two hours.",
  "Thus, I found myself sitting on some thick, comfortable sheep skins and a couple of pillows on the living room floor, staring at the two glasses of brown liquid before me. Recalling the gut-wrenching bitterness of the B. caapi decoction, I prepared myself by numbing my taste buds with some lime juice and closing my nose with two fingers before drinking it. This worked surpirsingly well; to my great relief I tasted almost nothing. I waited 15 minutes before drinking the P. Viridis brew.",
  "I closed my eyes and waited. I sat cross-legged, meditating until I felt the effect rising to a +, which is the last entry in my notes. I lay down and started my submerge into unfamiliar territory. A lot happened during the next two and a half hours. At first my body felt heavy, kind of sedated, apparently an effect of harmine also noted by other researchers. My first contact with the DMT space consisted of a meeting with some space-alien like beings, who brought me into a Giger-esque universe. I have no memory of communicating with them, being probed or anything else; the whole event was somewhat baffling and on the neutral side, although a little frightening as well. I asked for more, knowing I could handle it, and the experience accelerated. Gone were the aliens and I dissolved into a seemingly endless space of swirling colours, intricate patterns, filled with a loud, whining noise, which filled my whole sensory apparatus.",
  "The patterns were much like the ones I see on psilocybin, but the colours less luminous. I decided to let go of my body, keeping my breath as a line back to life. During my journey through the DMT space, I witnessed some amazingly powerful processes. I felt that this space, which I assume is within all of us, is a rich source of energy and healing, spiritual powers. This realisation was frightening as I didn't feel ready to handle such powers, much less knowing what to do with them. I felt two very distinct tryptamine carrier waves rippling through my body. This phenomenon also occurs to me during my psilocybin trips; the wave comes on as a loud, metallic, buzzing sound which seems to signify that something is about to happen. And indeed something did. As I was pulled deeper into the experience, the intensity of it rose to an almost unbearable level.",
  "At one point, I wished for it to stop, but knowing that resistance was futile, I recalled my reading of The Psychedelic Experience and let go. The DMT space was all there was; it filled my entire perceptual faculties, allowing no part of my everyday reality to interfere. An unquestionable ++++. I noticed some rather severe nausea which connected me back to my body. It took me a while to accept vomiting as a feasible solution, owing to my limited body awareness. But when it came, it felt purifying and relieving. The vomiting concluded the very intense part of the trip; I relaxed and let the effect of the ayahuasca fade, while contemplating the unbelievable luck I am in, to be granted a glimspe of these realms of vision, of beauty and energy. I felt that by doing so, I connected with the ancient human tradition of entering these strange dimensions. I also felt that my having this experience was somehow beneficial for all of mankind; that I helped clean out some collective human karma. This was by far the most powerful psychedelic experience I have had so far, although the overall message was somewhat more blurry than those obtained from my psilocybin trips. I will return."
 ],
 "erowid": {
  "id": "23935",
  "citation": " Big Rass. \"The Experience: experience with Ayahuasca (B. caapi & P. viridis) (ID 23935)\". Erowid.org. May 23, 2003. erowid.org/exp/23935",
  "substance": "Ayahuasca (B. caapi & P. viridis)",
  "views": "61957"
 }
}
