{
 "id": 14797,
 "title": "I Thought I Was Experienced...",
 "date": {
  "submission": "2003-05-27T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "sixthseal",
  "gender": "Male",
  "weight": "68 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0:30",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "2:00",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:30",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Lyserg-Saeure-Diaethylamid (Lysergic acid diethylamide-25) - the brainchild of Dr. Albert Hoffman. This was the first drug I've ever taken and I've had about 35 trips of acid since then. Unfortunately, this substance seems to be rarer these days and I haven't seen it around for years! LSD is not available in Malaysia (at least I've never come across it) and even in Melbourne, there's only rumors that acid is around but no one seems to be able to get hold of any.",
  "I recently managed to get in touch with someone who can actually deliver this rare (or so it seems) chemical. The best thing was the price - it's only A$15 for each blotter! It has been 6 years since I've last tripped on acid, and I'm sure glad to see it around, so I bought 3 blotters. The blotter art is a picture of a Buddha with a green face and a blue head piece.",
  "I intended to take a single blotter because it's been a while since I've tripped and these Buddha blotters were said to be strong. I perforated one blotter and put it under my tongue and listened to some psy-trance. My past experiences with LSD were always in raves, but I wanted to take it in a safe environment this time to gauge the strength. It was strong acid alright, and I made the mistake of dropping the other two blotters when I felt the first familiar effects take hold.",
  "I thought I could handle the experience but I haven't taken into account my frame of mind (not so good) at the time. I knew that taking all three blotters was a mistake when things started getting too intense and I had to shut off the music. I've forgotten the utter mind-fuck that LSD produces and I spent the night reading the Psychedelic Crisis FAQ [erowid.org].",
  "I knew deep down that everything was alright and it's just the acid that's fucking with my mind', but if you've taken a high dose of LSD, you know how things can get out of control inside your mind. :) I'll admit it, I was terrified. I know that everything would go back to normal in 10 hours, but everything was so intense, so unstoppable that I had a bad trip. I was utterly blindsided by the strength of these blotters - taking all 3 was a mistake indeed.",
  "I know that I'm not going insane. It's just the acid, it'll all be good in 10 hours, I tell myself. I know it's impossible to overdose on LSD (the LD-50 is very, very high) but I was scared that I'll be insane forever. I actually seriously considered checking myself into a hospital! Imagine that! What ludicrous thoughts I entertain in my mind while under the influence! I know it's just the drugs, and I'm really glad I had enough experience to stop things from getting really out of control.",
  "I practically tore apart a blister pack of Xanax (alprazolam) in an effort to calm down. 2.5 mg of Xanax didn?t do anything, so I sedated myself with a further 15 mg of Valium (diazepam). I shut down all the lights (to reduce stimulus) and laid in bed with blankets around me, watching the trails as the blankets moved. Closing my eyes produced repetitively green geometric patterns flowing and morphing through my vision and I was getting auditory hallucinations too. I opened my eyes to see a warped room that I could barely recognize, the proportions were wrong and things were too fluid.",
  "Finally, the benzos did their magic but I still couldn't sleep. It was a weird state of feeling like I was floating to sleep, and then the acid kicks in and I jerk awake into an unfamiliar room. I was pretty much sedated by then though, so I got up and managed to resume the trip report I was trying to keep. Hah! :) I don't remember much after that, but I know I went out to get some food and saw someone and had to avoid eye contact while getting food. That's about the only thing I remembered clearly before managing to eat and sleep. Here's the trip report, in all its unedited glory:",
  "-----------------------------------------------------------------------",
  "things you might want to know: yes, i licked the scanner after. might be nothing, but eh, i've done nastier things ;)",
  "took 1 blotter",
  "t+30 felt the effects",
  "it was so nice to see uncle sid again",
  "very positive and quite strong and i felt such a positive vibe, i took the remaining two",
  "took the two remaining blotters at t+30",
  "t+60",
  "okay, i'm regretting that now. very intense.",
  "okay so regretting it now.",
  "its to intense. like with the codiytion of acid being the way it is most pepl have never had a full hitt and dose . i'm respectign this now. i'ved forgotten ny respect for you uncke side",
  "wow",
  "xanax 2,6mg",
  "reduce stimulous going offline and shutting lights down now",
  "psychedelic crisis faq",
  "fuck it i'm aborting",
  "don't want to be a danger to myuself and others",
  "can't abort even with 2.6 mg xanax",
  "still going strong",
  "i'm aware of everything, just wouldn't want anoe to see me in this sate now",
  "wow i underestimated lsd",
  "don't ever do that, if you are, chances are you're not taking a hard dose or you'll find it hard to conrol even with experience if alone",
  "t + can't think properly",
  "this is reli strong dose to affect this way empahais that if they've never taken experienced such midn budnering wat is true wat is fiction?",
  "repect it i wonder how many ppl can handle this kind of things alone and still have the reality achor to know themselves",
  "quit this self serviding bullshit and get done",
  "managed to get myself soome food in: i think there was something that was said abotut men not khlepong another girl take in her stuff, but sorry thats just coz i was in the middle of a psychedulic crisis and was trying to aboidinb eye contatct!!! sorry i would have helped otherwise but not when i'm fucking tripping ballz on lsd. and i dun even know if you're a fucking polis or somehow related to yes and is gonna tip me in or something",
  "gosh now that i think about it its scaring me. i acted normal",
  "seems that i can't abort it and the xanax is really mking me feel less anxtious and forgot about things too thats the bad part but yeah eveyrthing is fine and dandy",
  "end of story: this has taught me an important lesson. dont think that you know all there is to a drug and can 'hadle' it. given me repsect on lsd an whe  intense warp in can have on everything, antyhing and evertyhgin",
  ":)",
  "open cevs",
  "you haven't had really good acid unless you're sure you're on it",
  "think to youself about how we care so much about what others peicee us of",
  "jaw PERMENANTLY CLENCHED",
  "-----------------------------------------------------------------------",
  "I woke up the next day feeling embarrassed for getting so completely 0wn3d by a substance I thought I was experienced in. I'm utterly humiliated by what I wrote in the trip journal, but I'm going to post it anyway, coz it shows how badly strong psychedelics like LSD can mess with your mind. =D It's disjointed and hard to read, but there you go, everything I wrote posted as is. Buddha taught me how to write the word 'respect' that day. Oh well, no harm no foul, and I'm going to treat acid more carefully now."
 ],
 "erowid": {
  "id": "24002",
  "citation": " sixthseal. \"I Thought I Was Experienced...: experience with LSD (ID 24002)\". Erowid.org. May 27, 2003. erowid.org/exp/24002",
  "substance": "LSD",
  "views": "150140"
 }
}
