{
 "title": "Fearing Overdose",
 "author": "dysphunktion",
 "citation": " dysphunktion. \"Fearing Overdose: experience with Codeine (with Acetaminophen & Caffeine) (ID 14800)\". Erowid.org. Apr 4, 2005. erowid.org/exp/14800",
 "substance": "Codeine (with Acetaminophen & Caffeine)",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "180 mg",
  "oral",
  "Codeine",
  "(pill / tablet)",
  "",
  "1800 mg",
  "oral",
  "Acetaminophen",
  "(pill / tablet)",
  "",
  "90 mg",
  "oral",
  "Caffeine",
  "(pill / tablet)"
 ],
 "report": "<p>[Erowid note: this person took 1800 mg of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]</p><p>I consider myself an experienced Opiate user. Having taken almost every Prescription based drug in hopes of a Euphoric experience. Never having a bad experience, the thought of my shiny new Tylenol 3 prescription made me orgasmic. I recieved this prescription due to a pretty severe toothache. Seconds after leaving the dentists office I had 12 T3's in my possesion. I decided that I would wait until I got home before I took this new endeavor on.</p><p>Like all my other Opiate experiences I usually wait until late at night, 10:30 or so. Mainly because there are less distractions and enjoyability is increased.</p><p>Time ticked away and eventually so did 10:30. Gulp. 6 Pills downed.</p><p>180MG codeine is now settling in my stomache. My virgin stomache now has enough codeine in it to hopefully give me a -very- intense trip, I could never have been farther from the truth.</p><p>10:45.</p><p>A new sort of feeling is coming over my body. Not like the Hydrocodone feelings I am used to. This is more subtle, almost like Marijuana. I do things, like turn my head, and wonder if I actually did it. Slowly my body becomes warm and cozy, a smile creeps on my face and I am happy.</p><p>11:08.</p><p>I am lying in my bed with my now sleeping girlfriend. I am listening to her breath and I suddenly realize that she is breathing normal compared to me. I am taking very short breaths. Then I remember reading about OD symptoms and that is one of them. Yet, I did not take enough of to justify an OD. The thought doesnt help, panic sets in. I think I am od'ing.</p><p>11:26.</p><p>The shallow breathing is now being forced. I have to force the Oxygen into my lungs. I am in the midst of a severe panic attack. I don't know what to do. I wake my girlfriend up and explain it to her. She convinces me that I am not od'ing that I am manifesting the symptoms. She could be right. I decide to go outside.</p><p>11:40</p><p>I have been walking around outside for awhile now, everything seems ok. When I don't think about my breathing I am ok. I decide to try and enjoy this experience. I go back inside and lay back down with my Angel. I lay there for quite some time, falling in and out of sleep. Then I get up to go to the bathroom. When I begin to open the door to the bathroom I realize I am trying very hard to turn the handle. Pushing the door open seems impossible. Fatigue. OD symptom #2. Panic attack #2. I hate codeine now.</p><p>12:20.</p><p>After walking around some more outside I realize that I am not really fatigued, just a bit tired. I decide to let myself go to sleep so I head back in the house and lay down once more. Drifting in and out of consciousness, my thoughts are flooded with the most obscene images. The second I close my eyes I have visions of a strange old lady with two crayons in her hand, screaming. I can't take this, eyes open.</p><p>12:44.</p><p>After 20 minutes of fighting sleep I can't control it anymore. I fight off the strange thoughts and let myself drift off into happy sober land. Severe pain in my stomache. My lungs. My chest. OD symptom #3. Codeine is the devil. I lay there with my new OD symptoms and realize that i will never partake of the codeine again. Sleeping.</p><p>2:11.</p><p>I wake up, look at the clock, realize that the drug has already peaked and I have not died. I lived. I experienced. Goodnight.</p>",
 "year": "2002",
 "id": "14800",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-04-04T07:00:00.000Z",
 "views": "25626",
 "dose": {}
}
