{
 "id": 14807,
 "title": "The Tree Dripped and Melted",
 "date": {
  "submission": "2007-10-06T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Tavarua",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "The trees dripped and melted outside of my house, I was posted on my balcony stuck to a lounge chair gripping my bubbler and my sanity. Thirty minutes ago I ate an eigth of P. Cubensis, ate the bag slowly and ground up the mushrooms in my mouth. These were hard to find and overpriced so I am going to get my money's worth. I watch the trees do the dance all around the park below my house.",
  "Wow these are intense, my arms feel heavy as I pack up the bubbler with a dimesack of NorCal's finest. Three heavy hits later and the visuals start to intensify greatly. All of the grass in this park flows and moves in waves, ripples with electricity and then it all clicks. Literally the trees and the grass, birds and dragonflys darting around on a blue spring day. It's all clicking and humming that I can feel through my body and mind, vibes and vibrations. I feel good but I feel stuck up here on my balcony and I wish I was down there.",
  "I decided then that going out in public wasn't a good idea considering the state I was in. At about an hour and a half into the trip I threw up, on purpose. I went inside and forced the mushrooms out of my system. Enough is enough and I don't want to go any further; a guilty feeling set the mood for the next part of the trip. It became very difficult for me when faces began contorting out of the woodgrain floor and walls, and now my visions were becoming the same both open eyed and closed. For what seemed like a very long time I closed my eyes to escape, but there was no getting away from the powerful visuals. I found out about ego loss when I finally realized that the drug was more powerful then I.",
  "I cleaned up sometime later, after the vomiting and shitting, and finally made it out into my room and the rest of my house. Out through the windows the trees were still dancing, and they all looked the same to me now. I started up some mp3's and in an instant grew bored with the computer, the music I was listening all of the sudden took on a sadness to it as I somehow came to the unnerving conclusion that I had gone too far with this. Mom and Brother were going to come home later that night and find me in this new mental state, they wouldn't understand how the patterns crept over everything and faces lurched out. I couldn't understand it either but it was real to me at the time.",
  "And then I was in bed. Two and a half hours or maybe three into the experience I was mentally and physically exhausted, and it was only lunchtime. Forgetting that I had ever taken mushrooms in the first place now I tripped with the covers over my head, time stretched and I saw a lot of things. My ears and body cracked and fizzled with vibrations and humming. There are some blank spots during this part of the trip. I know I was having fantastic halluciations and dreams. I woke up periodically from some kind of state and would blurt out one of two things: 'Damn' or 'Why don't they use this?'. Then I would fade away back into the mind.",
  "A couple pebbles thrown at my bedroom window roused me out of the bed and out to see who it was. A buddy had come over to check up on me and burn one. So we chilled out on that balcony again and as I hit the blunt the visuals took to crawling and slithering again. I watched moss grow and contort through cracks in the pavement. I commented on it. He asked how the trip had been so far and I hesitated as I said it's been fine.",
  "I am fine now, just have a slightly different perspective on things. This really was a difficult experience for me, to let go of control. My thoughts whirled so fast, suicide was even a thought at one point ('anything to make this stop'), thankfully alot of the thoughts were too fleeting to act on.",
  "I have not done mushrooms again, but have had great experiences with DXM and Ecstasy once, now that I have learned how important a sitter is, as well as set/setting. Next time I come across these, I will be starting out with 1.5 grams and slowly moving up from there, camping next to the beach and I will have some friends there to get lifted with."
 ],
 "erowid": {
  "id": "24043",
  "citation": " Tavarua. \"The Tree Dripped and Melted: experience with Mushrooms - P. Cubensis & Cannabis (ID 24043)\". Erowid.org. Oct 6, 2007. erowid.org/exp/24043",
  "substance": "Mushrooms - P. Cubensis & Cannabis",
  "views": "2337"
 }
}
