{
 "id": 14818,
 "title": "Parabola's End",
 "date": {
  "submission": "2013-07-14T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Crazy K",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:15",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I snorted about a third of my (approx.) 92 mg of DPT.  My throught and tounge felt coated with something.  My throught felt sore too.",
  "I snorted the rest of the ~92 mgs about 15 minutes later and deffinantly saw the shit after that.  That was extreme auditory and visual hellucenating.  The burn, initially, was quite bad from snorting it.  What I saw was basically (through the peak)... that thing at the end of Tool's Parabola music video... that was basically it without the eye things swimming around and it wasn't that structured [also, the eyes in the background would be replaced with colorful patterns and they moved up and along the walls and whatever else (at fast speeds)].  My cabinet looked like it was painted there with oil paints. ",
  "What I was hearing was my stomach growling.. everything echoed and stretched and distorted and vibrated... I would bereath and shutter and It would echo ... it was quite intense.. At one point I just got under my covers and turned off the lights because it was just too much. ",
  "At the peak and a little after I was shivering... although, I don't know if I was cold.  My teeth were chaddering, my body was shaking, my legs most of all.  I would twitch every once in a while.  My mind was racing through shit...",
  "I took it at about 9:45 pm and I could function again (although still tripping) at 12:00.",
  "I was quite blown away by this trip."
 ],
 "erowid": {
  "id": "24107",
  "citation": " Crazy K. \"Parabola's End: experience with DPT (ID 24107)\". Erowid.org. Jul 14, 2013. erowid.org/exp/24107",
  "substance": "DPT",
  "views": "424"
 }
}
