{
 "title": "Showed Me Reality",
 "author": "anonymous",
 "citation": " anonymous. \"Showed Me Reality: experience with Salvia divinorum (5x extract) (ID 14815)\". Erowid.org. Mar 28, 2005. erowid.org/exp/14815",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "180 lb",
 "report": "<p>I recently was sent a quarter ounce of Salvia to try from someone I met on the internet.  I have been reading about Salvia for quite sometime and I was very eager to try it.  I called a couple of my buddies and told them that I had recieved the Salvia.  I met up with 2 of them and we walked to another friends house.  It was about 12:30 a.m..  When we got to his house, we immediately went into his garage, because we were very eager to smoke the Salvia.  I packed a bowl of some Salvia 5X enhanced leaf and instantly put a butane lighter to it.  I was staring in the same spot the entire time I was enhaling the smoke.</p><p>Before I even knew what was going on it hit me.  My head began falling back in one direction.  The image I was staring at, remained in the middle of my perspective although I was facing a completely different direction now.  I had (and have every time I smoke Salvia) such a great feeling of DEJA-VU.  I felt as if I knew the meaning to life, and that something terrible had happened.  I was at this point mumbling all sorts of nonsense, and my friends were telling me to be quiet.  I began seeing bright glowing white rips in time and space, and images of what I refered to as electronic hell engulfed my field of vision.  My friends were telling me to pack them a bowl, and I kept telling them that if I did such a thing that the cats would come running and stop existence.  I then yelled at my friend Lucas to 'Stay on grandma's porch.'  and that if he left 'it will cause the end of the world.'  I for some odd reason believed I was outside at daytime on my imaginary grandmothers back porch in the year 1976.  When in reality I was in a garage past midnight sitting on some folding chair smoking salvia.  I saw a whole other existence that time.</p>",
 "year": "2002",
 "id": "14815",
 "gender": "Male",
 "timestamp": "2005-03-28T08:00:00.000Z",
 "views": "4134",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
