{
 "id": 14825,
 "title": "This Is the Beginning, It's Just Begun",
 "date": {
  "submission": "2006-03-24T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "folodaleada",
  "gender": "Female",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "daily"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": ""
  }
 ],
 "report": [
  "Ive been seeing a psychiatrist for paranoia and recovering from a drug induced psychosis for a while now, I just recently came off anti-depressents but Im still taking 100mg of Seroquel- an anti-psychotic which has helped me loads to think clearly again.",
  "Now my doctor is obsessed with helping me lose weight, he thinks Im gorgeous and if I was slimmer I'd be stunning- I wasnt even bothered that much before but now hes prescribed me Dexedrine (5mg spansules - long acting). Speed. When he knows I have a history of drug abuse and drug related paranoia. ",
  "I dont know whether to big him up or diss him! On the one hand (Ive only been taking it properly for 2 days, on and off for 2 wks):",
  "-I feel really calm, guess Im kind of euphoric, happy and confident.",
  "- Ive already lost a bit of weight.",
  "- I like this feeling and I cant believe Ive be prescribed speed - drugs for free that cant be bad.....",
  "BUT on the other hand",
  "-Ive already started upping the dose jus a little and taking it throughout the day instead of in the morning",
  "-Sometimes I feel good and happy but sometimes I feel a bit down, nervous, tearful, cold hands but I like that and I start getting an anxious feeling in my chest- this is when I want to take some more",
  "-I either feel focussed or spaced, like theres cotton in my head.",
  "It is a VERY addictive drug. Ive never felt this way bout a drug before. Yea I hate running out of coke if Ive got it but I get over it, sleep it off. I think Im a bit alcohol dependent and I have itched to get more alcohol before but I dont drink all day and I wouldnt dream of it. This however...I think I have opened Pandora's box. And I know whats in there, more speed.",
  "All I gotta say is make sure youg know what youre bein prescribed and think carefully about whether you really wanna take it. Dexedrine is great, it feels good but I have to be  able to control it. Guess Ill soon find out if I can or not."
 ],
 "erowid": {
  "id": "24140",
  "citation": " folodaleada. \"This Is the Beginning, It's Just Begun: experience with Amphetamine (Dexedrine) & Quetiapine (Seroquel) (ID 24140)\". Erowid.org. Mar 24, 2006. erowid.org/exp/24140",
  "substance": "Amphetamine (Dexedrine) & Quetiapine (Seroquel)",
  "views": "7388"
 }
}
