{
 "id": 14821,
 "title": "Sleeping Tablets Sent Me Bonkers",
 "date": {
  "submission": "2003-06-02T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Will",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "67.5 mg",
   "administration": "oral",
   "substance": "Pharms - Zopiclone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Here in Australia, zopiclone is sold as Immovane. My dad does a lot of travelling and was given a prescription by his doctor. I was going through a fairly rough period of my life at this stage, and I was drinking excessively and smoking a lot of weed and taking other stuff whenever I could afford it. Anyway, one day I found dad's Immovane and checked out dosages on the net. They were 7.5 mg tablets and I figured it was (relatively) safe to take all nine tablets that were there (for a total dose of 67.5 mg)",
  "Well, put it this way, it's an experience my parents would rather forget. As for me, it barely matters because I can't remember it anyway. I remember popping the nine tablets, then watching some television. After this, all i have is two memories. This is no shit. I have had (like most people) memory loss attributed to booze, but nothing like this. My two memories were of snapping a comb in half, apparently because I was really angry, and at talking to my (now ex) girlfriend on the phone, aggressively asking her about her past.",
  "That's the interesting point I want to make about this drug, zopiclone. It's a sleeping tablet, but an excessive dose (67.5mg) did NOT send me to sleep. In fact, I took them about 7:30 pm and didn't go to bed until 2:00 am. During this time I threatened my family, threatened my girlfriend, worried my parents to the point of my mum ringing the police (only to be told that they couldn't do anything unless I actually hurt someone or did some damage) my parents also had to disconnect the phones to stop me making phone calls, hide the car keys cause I was threatening to drive, lock up the bikes because I wanted to go for a ride, and I also confessed everything to my parents about my previous drug use, which included a confession about IV drug use. I don't remember any of this, I was told about it the next day. Apparently, I told my girlfriend I 'felt like my head was gonna explode.'",
  "So, there, that's the tale. Also, the next day was hazy and lethargic, and all food/drink had a metallic tang to it (a common side effect I've since read about)."
 ],
 "erowid": {
  "id": "24128",
  "citation": " Will. \"Sleeping Tablets Sent Me Bonkers: experience with Zopiclone (ID 24128)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24128",
  "substance": "Zopiclone",
  "views": "41733"
 }
}
