{
 "id": 14820,
 "title": "Shaman Alert!",
 "date": {
  "submission": "2003-05-30T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "ClearLight",
  "gender": "Male",
  "weight": "266 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "  I had some good friends who hooked me up w/ the 10 mg 2ci  'i' tabs.   I took two of these @ around 1 am at a party.   I also took a vitamin supplement 'E' kit, throughout the experience (pre and post)  which I highly recommend.",
  " The pattern of the trip pretty much followed what has been written before.. Alerts etc.  I found some things unsettling which I will get into shortly.",
  "I have had training as a Shaman and Psychic practioner and have been doing so for 28 years.  What this means is I can see energy and do the usual clarivoyant things across space and time without using sacred medicines.  This report is more about the post trip than the trip.",
  "While ayahuasca, psilocybin, 2-ct's and MDMA all enhance and extend the psychic range and perception, I found just the opposite w/ 2CI.    The psychic functions in the 3rd eye were completely blocked by this compound. Not only that, but the control of the visual internal spaces was random, so my internal imagery was not amiable to direction or awareness during the experience.  Random energies and visual flashes just came up and then dissolved.",
  "I had great emotional insight into some of my personal processes.  This compound definately stirs the emotional realm and allows insight into deeper issues. One of which for me, was processing the toxin's release from the 28 pounds I had lost via Atkins style diet in the last two months. I had been negligent about clearing the body toxins, and not balancing my spiritual and worldly domains, and it was here to tell me about it.  I also had some insight into current life, relationship and financial issues.  That was very positive. However, I felt very frustrated that I could not extend my sensorial net to the other realms and utilize this compound for knowledge beyond what was present in myself.  The trip stayed focused on me.",
  "\t I came down about 8 hours later and drove home.  Crashed for 6 hours and was up and hanging with friends.  I found myself in a nice mellow mood.  The sense of well being from the compound flowed on for the next 3 days.  What was extremely disconcerting was the fact that the psychic capabilities were still offline!   I felt as though I had a block across the forehead that could not be penetrated, hence, nothing was appearing on the internal screens.  This was most disconcerting as it extended from the Saturday night experience to the following Thursday.  Perhaps this is an artifact of the heavy molecular weight Iodine present in the compound.  This does NOT happen with 2-CB for example.",
  "I finally ended up doing some exercises and moving energy through the frontal lobe sludge and have come back up to about 40% of my normal capacity.  At D+5 I am still not fully back on line.  What I notice that was nice, is that this compound also blocks the introspective excessive analysis that occurs in the frontal lobes associated with depression.  I found myself in a very happy, up, clear space.  Very joyful and emotionally clear.  The only downside is that my skills were suppressed. ",
  "I imagine that if anyone is taking anti-depressants, or has issues with schizy behavior while tripping, this compound could be very useful.  It may even presage a new class of anti-depressants. ",
  "However, if you are into Shamanistic or Psychic practices, or use such skills for medical or healing work, be prepared for about a week of having that faculty off-line.  If your psychic capabilities are not developed or activated yet, I imagine it won't be much of an issue with you."
 ],
 "erowid": {
  "id": "24121",
  "citation": " ClearLight. \"Shaman Alert!: experience with 2-CI (ID 24121)\". Erowid.org. May 30, 2003. erowid.org/exp/24121",
  "substance": "2-CI",
  "views": "14037"
 }
}
