{
 "id": 14830,
 "title": "3 Nights with My Favorite Study Aid",
 "date": {
  "submission": "2003-06-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Brandy",
  "gender": "Female",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>During finals week @ college last semester I took a lot of aderall. Here's my experience. I think it was pretty normal, for the record. I'm really familiar with aderall, having taken it sporadically for the last 2 years, and consider myself really in tune w/ me in general. :) The pills I had were all the same, 10mg time-release blue round pills.",
  "So, the first night @ around midnight I snorted 1/2 a pill, 'cause it had been a while since I last snorted, and got drip in about 2-3 minutes. normal. :) I started to get really light feeling, like when there's sunlight on your face and you're all warm and pleased w/ yourself, happy, excited, anxious, like I was looking forward to something fun. I felt my heart start to race, like always, and my pulse quickened, I wanted to move. In general it feels like my whole being is filled w/ energy, to a greater or lesser degree. At that point I went off, ran actually, to the computer lab to work. I snorted another 1/2 pill @ 2:00am when I felt almost down from the first, tired feeling. I went home @ 5am and got to sleep around 6am, because when I tried to lay down I felt my heart race too fast to sleep and it was like my heart was jumping, and my muscles were still jumping as well. I got up and ran up and down the stairs for like 10 minutes then went to sleep all tired out. I woke up again, refreshed, at 10am and started my day.",
  "The next night was similar, I snorted a 1/2 pill @ 12am, 1/2 pill @ 1:30am, 1/2 pill @ 3am. I did this because the first dose I took did not get me as energized as it had the night before!",
  "The 3rd night I snorted a whole pill @ midnight, because I know I build up a tolerance really quick, and another whole pill @ 2:30am! I was up @ 6am, so I decided to stay up. But I was feeling down, tired, worn out, over-worked, basically I was dragging. I used caffine for the rest of the day, a 12oz cup of coffee every hour or so. I mostly maneged to hold it together...",
  "I had to go 2.5 hours without coffee during the day @ one point and felt terrible. I was sick to my stomach and my head ached, my muscles were spasming (worse than usual, 'cause they always do a little bit after aderall) and I almost puked. But I hadn't eaten anything more than 3 apples a day for the last 3 days so nothin came up. As soon as I got coffee I felt what I would call normal again. I went to bed that night and slept for 10 hours, woke up and mostly refreshed.",
  "The next 2 days I felt pretty good, slept a little more than normal and made sure to sleep instead of taking caffine. But I still didn't feel like eating untill dinner on the second day after, though I made myself eat apples because I get sick and really tired if I dont.",
  "In short, that's how I do it. This method is the one I use mostly, during finals weeks @ school, it works well and I don't feel too bad afterwards and it makes me very productive. I did 60 pages of essays this last semester this way! :) yay! :)</p>"
 ],
 "erowid": {
  "id": "24153",
  "citation": " Brandy. \"3 Nights with My Favorite Study Aid: experience with Amphtamines (Adderall) (ID 24153)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24153",
  "substance": "Amphtamines (Adderall)",
  "views": "24806"
 }
}
