{
 "id": 14836,
 "title": "There's a Plane in My Living Room",
 "date": {
  "submission": "2003-06-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Vivienne",
  "gender": "Female",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  }
 ],
 "report": [
  "<p>I've never tried any drugs other than weed, so when my friend suggested that a group of us trip, I was interested.  Of course, being the paranoid nerd that I am, I went online and did my research.  Had to make sure I wasn't in danger of dying off of two hits of acid...yeah I am paranoid.  Probably why acid wasn't such a good choice of drugs for me. ",
  "About 8pm, my cousin and two friends and I each took 2 geltabs of acid.  I remember saying, 'wow these things look so little, are you sure they are going to work?'.  One of my friends that had taken acid before just laughed at me.  A half hour went by, and I was a bit annoyed because I felt the same.  I wanted to take another one, but my friend assured me that it wouldn't be long before it kicked in.  20 minutes later, I was starting to feel a little strange.  I suggested we all go outside and sit on the porch to get some air.  An hour later, we were two miles from my house running through the woods.  Now I'm pretty much a lazy person, it's an effort just to walk outside to my mail box :-).  But I felt so great, like I could walk anywhere!  We killed another hour walking back, it was a lot of laughing and good feelings all around. ",
  "When we got back to my house, that's when things started getting weird.  I had forgotten that we had set up black lights and posters all over my living room to celebrate the occasion.  So when I walked into the house, I was completely weirded out.  The colors from the posters were swirling around and moving all over the ceiling and floor.  I started to get scared, and had this thought in my head that my two friends were going to kill  my cousin and I.  I guess the power of suggestion was enough to freak her out as well, because we both ended up in the bedroom trying to climb out the window.  I have never felt so terrified in my life.  At that moment, I truely belived my own insane thoughts.  My friends came in and freaked when they saw me dangling half out the window.  After fighting with them briefly, I agreed to go back out and sit in the living room.  The black lights and posters were more vivid than ever...I remember looking at one and seeing a plane flying towards me.  I got all emotional and started crying. ",
  "My friends told me the next day that I was talking about the plane and all the 'people trying to escape the city' in the poster for like 2 hours. I don't remember what time we ended up passing out but it was starting to get light out so I know it was early morning.  The first thing I looked at was that poster.  It was of a bunch of mushrooms.  And all I could think of was how the hell I ever saw a plane.  Over all, I'd say I had a good experience. Except for the brief period I thought my friends were going to murder me.  Like I said though...I'm a naturally paranoid person.</p>"
 ],
 "erowid": {
  "id": "24164",
  "citation": " Vivienne. \"There's a Plane in My Living Room: experience with LSD (ID 24164)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24164",
  "substance": "LSD",
  "views": "7179"
 }
}
