{
 "id": 14848,
 "title": "2C-T-7, Two Guys, Serzone & Earthquakes",
 "date": {
  "submission": "2000-10-08T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "jeffguy",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25",
    "grams": 0.025
   },
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "250",
    "grams": 0.25
   },
   "administration": "oral",
   "substance": "Piperazines",
   "form": "pill/tablet",
   "specific": "Nefazodone"
  }
 ],
 "report": [
  "2ct7 25mg in gelcap.  Mixed powder in liquid, then chased with empty caps.  Mostly empty stomach.  We both had a soy milk/protein powder smoothy about an hour before.  I also took my evening dose of Serzone (nefazodone HCI)  (400mg BID, this one was 250) shortly after taking the 2ct7.",
  "6:30pm = 00:00",
  "00:30 - Very first alarms",
  "02:00 - Body buzz not unsimilar to foxy.  Some slight visual crawling, but only very slight.  Nothing going on emotionally.  Eyes aren't even dialated.  Music enjoyable, but not especially enhanced.  Nothing is especially enhanced.  Very aware of belly.  It's almost slightly sedative in it's effects.  David is chilled but sweaty.  He says it's like foxy with 2c-b-ish visuals.  Colors are more vivid, especially yellows.",
  "02:30 -- David is having serious body tremors.  It moves around from his center to his extremeties.  Massive shaking.  Not unpleasant, just intense.  He's very warm and shivering cold.  I am where I was before.  I smoked a bit of pot, and now I'm a little stoned.  I do believe that the Serzone is muting this a great deal.  I'm just a little little bit tripping.  Mostly just mellow.  I'm not tremoring at all.  David says he's flat-out tripping.  I am not.",
  "03:00 -- I can feel the tremor but only very slightly.  It does move from my heel to my arms to my center.  David wanted some time to sort it out on his own.  I do realize, now that I'm trying to operate my computer and be on IRC and all that I am zooming a bit.  The Pot (I smoked more) has brought it out a bit, tremor included.  It's so so mild tho.",
  "04:00 -- I am no longer tripping at all.  I do have some energy tho and am alert and well.  David is up and about and is not shivering and tremoring as intensely.    He's quite hungry and eating well.    It's like in cartoons when the Coyotee got those ACME Earthquake Pills.    It's exactly like that for him.",
  "06:00 -- sleepytime"
 ],
 "erowid": {
  "id": "2419",
  "citation": " jeffguy. \"2C-T-7, Two Guys, Serzone & Earthquakes: experience with 2C-T-7 & Nefazodone (ID 2419)\". Erowid.org. Oct 8, 2000. erowid.org/exp/2419",
  "substance": "2C-T-7 & Nefazodone",
  "views": "12227"
 }
}
