{
 "id": 14847,
 "title": "Quitting",
 "date": {
  "submission": "2003-06-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "A. Shaver",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>Like most people, I consumed the occasional soda as a kid.",
  "Then came college and work. As related by other people on Erowid, I felt I 'needed' caffeinated drinks to keep up. And, it worked. For awhile. The 'buzz' that lasted for the next few minutes or hours (depending on how tolerant my system was of the drug that week) helped me focus and use the artificial energy from the drug to speed through work (caffeine calls upon stress hormones to induce an alert state).",
  "However, recently I decided to quit. Why? I was *too* hyper. I felt mentally tense, my mind swimming with thoughts, being obnoxiously loud and energetic at work. There were nasty physical symptoms too: acidic stomach, inability to sleep well, heart palpitations, and so on.",
  "I'd tried quitting before, and would succeed for awhile, but go back to the drug after a few days. So far, though, I have not had caffeine in more than two weeks! Probably as a result of major depression lifting (Celexa rocks!), I was able to institute a number of healthy behaviors in my life, like regularly-scheduled 8-hour sleep blocks, more exercise, and... no caffeine.",
  "Even though I quit 'cold turkey' and apparently succeeded, the struggle continues. Just tonight, I bought a 20oz Pepsi from one of my apartment building's vending machines. I fondled the cold bottle, sniffed the delicious tart caffeine smell, and then, after a few minutes, dumped the contents in the sink.",
  "(Note: The dosage mentioned in this post is just an estimate. Moreover, I am particularly sensitive to caffeine, perhaps in part because I have a fast metabolism and am thus naturally energetic.)</p>"
 ],
 "erowid": {
  "id": "24186",
  "citation": " A. Shaver. \"Quitting: experience with Caffeine (ID 24186)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24186",
  "substance": "Caffeine",
  "views": "18855"
 }
}
