{
 "id": 14856,
 "title": "Not Worth It",
 "date": {
  "submission": "2003-06-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "the_god",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "Salvia, salvia, salvia.  If your reading this report then you may be wondering if you should try this legal herb for yourself.  Thats good, research and self preperation are always good with new substance use.  Well i read a few reports myself and read how amazing salvia is and how many of the users reported very outrageous visuals.  Well reading this, i just had to try it.  I drove to the nearest headshop and picked up 3 grams of salvia x7 extract for 50 dollars.  Waiting a few hours, i walked outside with my brother anxious to smoke a bowl and to test the effects of this herb.  I took a huge lungbuster and held it in for at least half a minute.  The smoke knocked me down and it felt as if the whole planet was weighing down on me.  Then my brother took a hit and i took another after his hit.  I felt hot and clammy hitting the salvia and very uncomfortable like i needed a shower. ",
  "After finishing the bowl (roughly a gram), i went inside pissed and angry at the world.  It wasn't just my attitude, it was the salvia making me actually violent wanting me to smack my brother for suggesting the use of this herb.  I mean, it worked to the extent of making me feeling heavy headed but i saw no visual hallucinations.  I then went to bed disappointed.  The next 2-3 times i tried the salvia mixed with marijuana.  Although the high was much heavier with the salvia smoked afterward, i still saw no visual hallucinations or heard any audio hallucinations.  Overall i personally don't like the drug and was angry i spent 50 dollars on it.  I've done alot of drugs and this isn't one of them i'd recommend for the price."
 ],
 "erowid": {
  "id": "24205",
  "citation": " the_god. \"Not Worth It: experience with Salvia divinorum (7x extract) (ID 24205)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24205",
  "substance": "Salvia divinorum (7x extract)",
  "views": "8692"
 }
}
