{
 "id": 14865,
 "title": "I Was Me, Only Better",
 "date": {
  "submission": "2003-06-04T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "40ozCasualty",
  "gender": "Female",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "insufflated",
   "substance": "Methylphenidate",
   "form": "ground/crushed"
  },
  {
   "time": "0:20",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "oral",
   "substance": "Methylphenidate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Got to school in the morning in a fairly good mood, for my first Ritalin in a while had just come into my possession.",
  "T+0:00 Crushed up 20 mg and railed it in two lines. Had a cigarette.",
  "T+0:05 The drips...be warned they are very bitter.",
  "T+0:20 Swallowed 40mg. Went to bio class.",
  "T+0:40 Discernible feeling of happiness. Started to be more talkative.",
  "T+0:55 Heart rate was up and I was getting very talkative. Went to chat with my teacher about biology because nobody else would listen to me. I enjoyed talking about boring shit that I usually hate.",
  "T+1:00 to T+3:00 Euphoria. Everything was great. You know that feeling you get when you wake up in the morning and are REALLY looking forward to something you're gonna do that day? That's the feeling, only it's sustained. Couldn't stop talking, much more outgoing than I am 'normally.' Everything I said was witty and insightful, at least to me.",
  "T+3:00-4:30 Feelings of starting to come down, mixed with occasional bursts of happiness. Coming-down feelings are like...you don't want to do anything, but yet you're still too high to do nothing. You also feel like there's something you want but you don't know what it is, and moreover, you don't really want to put out the effort to find out.",
  "T+5:30 By this point I had come all the way back down. Feelin' fine. For once I had a hearty appetite, usually I don't eat for hours after I come down."
 ],
 "erowid": {
  "id": "24240",
  "citation": " 40ozCasualty. \"I Was Me, Only Better: experience with Pharms - Methylphenidate (ID 24240)\". Erowid.org. Jun 4, 2003. erowid.org/exp/24240",
  "substance": "Pharms - Methylphenidate",
  "views": "23772"
 }
}
