{
 "id": 14866,
 "title": "Testing Benzos",
 "date": {
  "submission": "2007-04-05T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tokentom",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:25",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Lorazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0:55",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "1:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "1:20",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  }
 ],
 "report": [
  "Its a nice summer evening and I am excited b/c my valium will be arriving in the next day.  But, what to do about the anxiety I'm feelin now?  So I only have one xanax left and i want to save that, which pretty much means it's time to do something today.  So I call my local Urgent Care and go in and tell him my symptoms, and tell him that I've been treated with valium and xanax before for anxiety.  The Dr. is hesitant to prescribe valium 'too long of half life'  he says.  Ignoring the xanax comment he is quick to bring up Ativan, tells me it will have the same quick relaxing effects of valium, but with a shorter half life.  Side note, it seems that every Dr that you tell them you have anxiety, they are a lot quicker to the draw with an SSRI, then a benzo, but just tell the Dr. again, you'd be willing to try it, but you want something for now.",
  "Ok, out of the Dr office with a script for ativan.  this will be a new experience.  The pharmacy tells me that it will be 30 mins for the script to be filled.  No problem, I'll just go duck out and medicate with my legal medical bud. ",
  "+5:10pm  Smoked two bowls(0.7grams)",
  "Exiting the car I felt nice and uplifted.  The walk back to the pharmacy seemed slower.  Inside the pharmacy there was a big line, and my high was comming on strong from the cannibus, brain was feeling tickeled.  The size of the line didnt matter to me as I day dreamed away in the smoke.  I leave the pharmacy with a bottle of little white pills. 'Ativan' it says.   I had done some research and I figured I was going to start with 2mg because everything I read says its similar to valium, just not as strong.  And I usually take 1-2mg of xanax throughout the day, so knowing my body and what I've read, I concluded with 2mg.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "+5:35 2mg of Ativan",
  "Now I know how my body and mind when I smoke and take valium, and before one knows how this will effect them, I DO NOT INDORSE or RECOMEND DRIVING, it's just not safe.  Well I only had a short drive home and popped the Ativan as I was getting on the freeway. ",
  "+5:55 I feel somewhat smily and silly.  started to not care about slow traffic, in fact, I was keeping back myself, I am almost home but still don't feel that 'valium' feel.  I decide to stop at 7-11 and pick up a six pack of new castle.",
  "+6:05 First bottle popped and gone before I knew it.",
  "+6:10 Second beer",
  "+6:15 Feeling great, I start to notice that the muscles in my neck are turning to mush.  Nice feeling, so far the initiall effects of 2mg of Ativan came smooth, the addition of beer helped accelerate this process, and make it a little more uphoric for me.",
  "+6:30 Third Beer",
  "+6:45  this combination feels great, my muscles are relaxed all over.  Walking around isn't hard, but it is very noticible to me that I am walking slightly off, I feel like I could bump a corner while walking and it wouldn't hurt, but still feel that if I'm not careful with my steps, I just might end up hitting a wall when I pass. ",
  "+7:15  Music is great, my senses are totally taking it on, it also seems like my vision is delayed, like what I see catches up with were im looking, and my eyes feel very heavy, but I am not tired.  The phone rings, it's my friend, we are all going to go see a movie at 10:30pm.  I am so happy for no aparent reason, this is comming from the ativan and beer combination I think.  With the indroduction of ativan and beer, it's hard to pin point when the marijuana high left, feels like its still there.",
  "+7:40  The thought of hanging on to see a movie at 10:30 seems almost impossible.  Ativan is cool.  I thought I would have to use more to get to the desired state.  So there are 3 beers gone and 2mg of ativan, plus the cannabis.  I definatly feel slowed down now.  This was fun, I cant believe 4 hours are about to go buy, wow, seemed like a framented hour. ",
  "+7:45 I just got back from the wash room, you can't really notice my slumped eyes, but they feel heavy, and cordination has now become slightly harder then where it was before.  Feel fine enought to walk about house, go up and down stairs, wouldn't feel fine to run a mile right now.  The couch seems more and more inviting everytime I look at it.",
  "+8:00 I'm going to conclude my report for now, I am doing just wonderful, stress is gone, and I feel happy.  I would smoke more cannibus, but later, Im actually comfortable at the moment, so I'd hold off on the beers as well, it seems to be going strong now, very enjoyable!!!",
  "Well I hope this helps someone who is curious about ativan.  I would still rank it behind xanax and valium, but not by much if introduce cannibus and beer.  Happy Mind Expanding, and please be safe."
 ],
 "erowid": {
  "id": "24242",
  "citation": " Tokentom. \"Testing Benzos: experience with Lorazepam, Cannabis & Alcohol (ID 24242)\". Erowid.org. Apr 5, 2007. erowid.org/exp/24242",
  "substance": "Lorazepam, Cannabis & Alcohol",
  "views": "34823"
 }
}
