{
 "id": 14871,
 "title": "Inhalant Only for Medical Use",
 "date": {
  "submission": "2007-07-04T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Prometheus",
  "gender": "Male",
  "weight": 63
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 ml",
   "administration": "inhaled",
   "substance": "Halothane",
   "form": "(liquid)"
  }
 ],
 "report": [
  "[Erowid Note: The use of halothane for anaesthesia in hospital settings has largely been replaced with other inhalant anesthetics.]",
  "My group recently aquired a small flask of halothane, one of the preferred agents for inhalation-anaesthesia in hospitals. We have earlier experimented a bit with other inhalants, as diethylether and chloroform. It's NOT something we do often or in large doses, as we know it's not the safest or healthiest thing you can do to your body.",
  "The first test: About 1 ml was dabbed on a rag. The liquid evaporates rather quickly, though not nearly as fast as ether. The rag was held over mouth and nose, and I inhaled continously for about a minute, making sure to get a mouthful of fresh air once in a while, to get enough oxygen. The taste is sweet and not too unpleasant. A tingling was noticed in the extremities, and a tone started in my head, a bit like on nitrous. After putting down the cloth, I was dizzy for about 3 minutes, then the effects had subsided. The mental effects were mild, and not very interesting.",
  "We have since experimented with a bit larger doses and different rates of inhalation. The conclusion is that it knocks you out before you can get to any interesting mental effects. It's not even close to being a substitute for N2O when it comes to intensifying psychedelics. Halothane more sort of slows down the mind. Conclusion: Not much recreational value."
 ],
 "erowid": {
  "id": "24257",
  "citation": " Prometheus. \"Inhalant Only for Medical Use: experience with Halothane (ID 24257)\". Erowid.org. Jul 4, 2007. erowid.org/exp/24257",
  "substance": "Halothane",
  "views": "9162"
 }
}
