{
 "id": 14878,
 "title": "Ecstasy Crash Experience",
 "date": {
  "submission": "2001-02-15T08:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dave",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.25 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "25:00",
   "amount": "0.25 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "30:00",
   "amount": "0.25 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "32:00",
   "amount": "0.25 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "On my second experience using Ecstacy I experienced a crash condition where I ended up taking more Ecstacy to cope with the feelings of sadness, depression and annoyance.",
  "On this particular experience I originally took 1/4 of a fairly large tablet.  I took the tablet at a house party where I was unfamiliar with the environment and the people in the environment.  Despite the risks of taking such a drug in an unfamiliar environment I felt like I had a really good experience and ended up making a connection with the people that were present.  I don't know whether this was because this was a unique group of individuals or if the ecstacy use allowed barriers to be removed that would otherwise have been present.",
  "During the course of the party I also smoked a considerable amount of marijuana, and drank a small amount of alcohol.  I was careful to drink plenty of water.  I took the ecstacy around 2:00 am and stayed at the party until around 10:00 am.  As I was leaving the party I started to experience feelings of great sadness.  I was moving, and the chances of ever seeing the people that I felt I had made a strong connection were slim.",
  "After returning home I managed to sleep for a few hours until around 8:00 pm.  When I woke up my feelings of sadness were still present and felt even worse than they did before I went to sleep.  I couldn't sleep any longer and I was having a hard time dealing with my confused feelings.  At around 3:00 am I took another 1/4 of the pill in an attempt to aleviate the sad feelings I was experiencing.  My intent was to have a personal trip where I would make a strong connection with myself.",
  "As the effect of the ecstacy started to return I began to reflect on myself and the experience I had just had and the experience that I was currently having.  After the elation of comming on to ecstacy I started to feel a little bit anxious and I decided to go for a walk.  I occupied myself with exploring my environment while in my unfamiliar state of mind.  After walking and exploring for 2 hours I felt tired and anxious and I wanted to go to sleep but I knew that I wouldn't be able to sleep.  I returned home again and tried drinking a beer to help me relax.  I eventually did relax and started having a good time again.  Such a good time that I took another 1/4 of the pill at around 8:00 am.  I continued feeling good and eventually took the last 1/4 of the pill at around 10:00 am.",
  "After taking the final 1/4 of the pill I experienced a more intense experience than I had ever experienced on ecstacy (I had only taken it once before where I took half of a considerably smaller pill).  I continued to have a somewhat pleasant experience until around 6:00 pm.",
  "At this point in time I was feeling completely exhausted.  I didn't know whether I had been drinking enough water and I had been drinking alcohol off and on.  I also hadn't eaten since before I originally took the first dose over 40 hours prior.  At this point I realized that I had been too harsh on my body and I needed to try and take care of myself.  I started to feel really frightened because my heart rate felt like it was up and I felt completely fatigued although I couldn't calm down and sleep.  I managed to eat some food although I had a really hard time getting it down.  I also started drinking lots of water because I was feeling pretty dehydrated.",
  "I went for another walk and bumped in to some friends.  I managed to explain what my situation was and they talked me down a little bit and came home with me and talked with me and comforted me until I was able to sleep.",
  "In hindsight it was both a positive and negative experience.  It would have been ok if I hadn't gone so far and been so harsh on myself.  I was essentially high for 46 hours with no food and only 10 hours of sleep.  I think this experience reinforces the standard guidelines for taking drugs:  be conscious of your state of mind before taking anything;  have friends around that know what you have taken;  be prepared for the effects of the drug and the effects of comming off of the drug."
 ],
 "erowid": {
  "id": "2427",
  "citation": " Dave. \"Ecstasy Crash Experience: experience with Ecstasy (ID 2427)\". Erowid.org. Feb 15, 2001. erowid.org/exp/2427",
  "substance": "Ecstasy",
  "views": "7989"
 }
}
