{
 "id": 14889,
 "title": "First 2-CT-2 Experimentation",
 "date": {
  "submission": "2003-06-07T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Stino",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 3:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Last weekend I tried 2-CT-2 for the first time. I was staying at a friend's place in the woods with about 20 others. After drinking about 12 beers over the course of a few hours, one of my friends offered to share a hallucinagenic pill with me.",
  "I asked him if it was mescaline, since he'd recently tried some, and he told me that it was 2-CT-2. Neither of us had taken it before, but felt comfortable about it since we'd both eaten shrooms and acid many times before. We opened the 20 mg pill and made two lines.",
  "After blowing the powder, both of us started experiencing effects within minutes. We had seperated very soon due to differing interests. If we had realized that the effects would come so fast, we'd have stayed together that first while.",
  "It was dark out, and I was tripping pretty hard after 5-10 minutes. Having no sign of my tripping partner, and being surrounded by many drunk belligerents that did not know what I'd done, I retreated to my a girlfriend's car to relax for a while. At this point I was experiencing visual effects much stronger than any acid I'd ever taken, and I was actually worried for my health.",
  "My girlfriend came to the car soon, finding me there to her surprise. I informed her of the situation, and she helped comfort me a little. I exited the car so she could move it down by the newly-lit bonfire, and proceeded to vomit all the beer and food I'd consumed.",
  "My uneasy feelings persisted, and so I returned to the car and laid for about 40 minutes with my girlfriend. I felt cold and needed several blankets. I was feeling much more comfortable as time went on, although I felt mentally unable to hang out with all the people who were simply drinking. The visual effects were astounding. I saw tracers, morphing objects, general changes in hues, and I even saw it quickly light up outside many times as if there was lightning or a strobe light. I also had physical feelings similar to ecstacy and acid body highs.",
  "At this point, my tripping friend appeared. He stayed in the car for a while, informing me that he'd vomited soon after taking the stuff. He had laid in the grass away from everyone for the last 40 minutes, also unable to be social.",
  "Ten minutes later we became comfortable enough to head out to the bonfire with all the others, and had a great night from then on. I played guitar for hours, with all the drunk kids singing along. I kept tripping for the next 2 hours, and the effects slowly tapered off for hours afterward.",
  "Besides the uncomfortable feelings the I experienced at the start, I enjoyed the experience. If I had known more about what I'd taken or had taken it before, I would've fared much better. I was not mentally prepared for such strong effects to take hold so quick, and I was not familiar with the drug.",
  "For people who are trying this for the first time, it may be better to take orally. If you insufflate it, know that it will hit hard and fast. I have taken acid about 20 times and shroomed about 7 times, and nothing has compared to 2-CT-2. I would try it again, eating maybe 20-30 mg or blowing 10 mg like I did, but no more than that. The effects from 10 mg insufflated was strong enough for my tastes."
 ],
 "erowid": {
  "id": "24305",
  "citation": " Stino. \"First 2-CT-2 Experimentation: experience with 2-CT-2 (ID 24305)\". Erowid.org. Jun 7, 2003. erowid.org/exp/24305",
  "substance": "2-CT-2",
  "views": "12748"
 }
}
