{
 "id": 14894,
 "title": "Trippy, Insightful",
 "date": {
  "submission": "2007-04-10T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FattySlim",
  "gender": "Male",
  "weight": 136
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "0.25",
    "quantity": "0.25"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "===> SUPER QUICK I ONLY HAVE TWO MINUTES VERSION ",
  "IN A NUTSHELL: I smoked some 10X extract and tripped into a childhood-themed vision. Salvia is a personal experiance, not a party drug. I highly reccomend it for its potential in personal insights and for its relatively short recovery time (the time in which I lost all control lasted only about 10 minutes).",
  "===> THE NORMAL VERSION ",
  "Intro:",
  "I had long been intriugued by Salvia divinorum. I had been drawn to its affordability, legality, and its promise. If the experts were true, I would have had an interesting vision that would help me reveal inner truths within a managable timeframe. This turned out to be true. The only other chemical that might have been in my system was some 'Kava Kava' extract from hours earlier.",
  "Prep:",
  "Truth be known, I'm a terrible smoker, I just can't smoke without coughing, so much so that it ruins most of my cannabis experiances. So it takes a lot more 'tries' for me to land that perfect hit. Half-filling two bowls in a small water pipe, I used up about a quarter of my one gram bag of 10X extract.",
  "Pre-Effects:",
  "While I was loading the second bowl, I felt the Salvia 'wind'. I hate to use a geek metaphor, but it was like I was on the recieving end of one of those Jedi 'mind-push' things. There was just an overwhelming force driving me to move SouthEast. Giving in, I plopped onto the bed and lit the second bowl. I held it in as long as I could, and let it go.",
  "THE TRIP:",
  "this is kind of personal, but I made sure to write down what I had experianced and I don't want to lie to any of you who are looking for honest experiance info, so here is what I saw.",
  "'I immediately regressed into the mindstate of a child, I felt as if I was in the hands of a weird hybrid between donald duck and goofy, I kept my eyes closed, but I knew that's what I was carrying me, the whole time a children's song I used to listen to played in the background, and then someone was trying to hoist me onto their shoulders, I resisted, because I didn't want to put my cratch in close contact with their head, then I thought about  oral sex, I slowly began to think and manipulate the way I was being carried. once I regained concious thought, I quickly snapped out of it and calmly walked upstairs'",
  "CONCLUSION:",
  "Examining the nature of my trip w/ my therapist, I was able to make personal insights and discovered inner truths. I sought an honest to god vision and I got it. I am a big guy who smoked a relatively substantial amount (though inefficiantly)of potent extract to achieve this effect. The one gram bag cost me 8.99 from an internet site."
 ],
 "erowid": {
  "id": "24316",
  "citation": " FattySlim. \"Trippy, Insightful: experience with Salvia divinorum (10x extract) (ID 24316)\". Erowid.org. Apr 10, 2007. erowid.org/exp/24316",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2918"
 }
}
