{
 "title": "Exponential Loss of Control",
 "author": "Arronise",
 "citation": " Arronise. \"Exponential Loss of Control: experience with Triazolam, Amphetamines, Temazepam, Diazepam, Nutmeg & Alcohol (ID 14904)\". Erowid.org. Apr 7, 2005. erowid.org/exp/14904",
 "substance": "Triazolam, Amphetamines, Temazepam, Diazepam, Nutmeg & Alcohol",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.75 mg",
   "insufflated",
   "Pharms - Triazolam",
   "(pill / tablet)",
   " T+ 0:30",
   "35 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " T+ 0:45",
   "40 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   " T+ 1:00",
   "0.5 oz",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   " T+ 1:15",
   "0.25 gal",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2002",
   "14904",
   "Male",
   "",
   "Not Given",
   "Apr 7, 2005",
   "18007",
   " "
  ]
 ],
 "report": "<p>Much of the time, I view mind-altering substances as useful tools for exploring the metaphysical as well as the inner soul. However, there are those times when too much time spent sober and a lack of psychedelic drugs prompt a reaction that I am never proud of. When these times come, I feel that I must change my state of mind, no matter what it is I take. These times are not uncommon, but I almost always control myself.</p><p>I have prescriptions for halcion (triazolam) and dexedrine (dextroamphetamine), for my sleeping and concentration problems. Lately I have found that I only need half the prescribed dose of halcion to fall asleep, and built up a stash of 'extra' pills. Every now and then I have snorted the halcion, resulting in a mild euphoria along with occasional slight memory loss afterwards. On this particular night, I snorted one 0.25 mg pill. The dark side of my psyche that i hate prompted me to snort just one more half of a pill. Then another, and another, and another. A total of 0.75 mg triazolam.</p><p>For those who have not heard of this drug, it is a common prescription sleeping pill, one of the most powerful to be found out there. A pill with 0.25 mg is the most potent that I know of. The drug can cause amnesia, in high doses like I took, and especially if it is snorted. I barely remember taking seven 5 mg pills out of my bottle of dexedrine and chewing them (they are not chewable). My memory fades and I recall the sight of the temazepam bottle that my sister, who has a similar sleeping problem, accidentally left at my apartment. I took three, I think. </p><p>Before I took the halcion, I had a stash of 4 10 mg valium pills in a bottle in my bathroom. Imagine my surprise this morning when I found the bottle open and empty on the sink. Or when I saw the empty bottle of nutmeg on my stove that previously had maybe half an ounce. Or the empty bottle of wine on the floor. </p><p>The fact that my apartment was trashed only added to my dread. When I am sober, I would never consider taking so many drugs at once. It is not enjoyable or healthy. What scared me the most was the idea that I had wandered around my apartment after snorting three halcion, and proceeded to overload myself on whatever drugs I could find. </p><p>There is nothing more frightening than the complete loss of control over your own actions, especially if this leads to ingesting more drugs that inhibit this control. Always treat pharmaceuticals with respect, and never, NEVER abuse tranquilizers. Sleeping pills such as halcion and tranquilizers like valium cause memory loss and inhibit one's control over themselves. </p><p>What fun is it getting high if I am disturbed by what I can't remember and ashamed by what I can?</p>"
}
