{
 "id": 14918,
 "title": "ROCKED! All Week Long",
 "date": {
  "submission": "2000-09-09T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Half Dead",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.75 g",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "School had just been let out for the summer.  I took a few weeks off of work to relax.  Well that started out fine until I ran out of money to buy my weed.  I found a solution to this.  I would get a guy I knew to front me a gram of speed.  After he did this, I chopped it up to make it look like more then a gram.  I sold all of this speed for like 50 dollars more then I paid for it.  I kept doing this until I had quite a bit of extra money.  I was having to stay up later to sell the speed.  So I started using it.  This was all fine I kept making money, and was jacked all the time.",
  "Two weeks later I started back work at the grocery store.  I had found a new girlfriend, and she liked to tweek with me.  I had also devolped a speed habit of 1/2 to a full gram a day.  This amount got me good and rocked each day all day long.  My girlfriend liked to do speed, but never had any money, and I was better at my job cause I was always jacked.  Each day I sold an 8-ball(3 1/2 grams) of crank to support my habit, cause I wasn't making any money anymore.",
  "So, one my day off from work, I pick up an 8-ball to sell.  Also I picked up my girlfriend about the same time.  This was like 11am.  We did our first line for the day and went and sold crank.  By 5pm I had sold all my crank, and also made 50 bucks.  I told my girlfriend I would take her to the steak house for supper.  Neither of us were hungery, but it made me look good to her.  On the way to the steak house, she and I smoked 1/2 gram of crank.  Now we were wired and not hungery.  We each sat and drank a soda, then left.  When we got back to town, we picked up her friend, and went to a guys house to sell some powder.",
  "He only had 25 dollars, and I need $50.  So he gave me a 1/4oz. of weed for the differance.  So all of us started doing crank, and smoking weed.  I did about 3/8 of a gram just by myself.  I could not sit still, but too high to move.  I started talking to my girlfriend and made an ass out of myself.  I then did another fat rail, and left.  I got home could not sleep, and there was nothing to do.  I talked on the phone with some friends until 6am.  I got up and went to work and then I crashed.  I was dead tired and feeling bad.  I had a sore throat and a fever.  I went home and swore I would never do crank again.",
  "After recovering from being sick, I rarely do speed.  I lost 25lbs in 2 weeks because I was binging with speed.  Now I never do it after 4pm, and never before I go home.  This way, I can sleep, and not get my habit started again.  So if you do crank, pace yourself.  I had times I thought my chest was going to explode."
 ],
 "erowid": {
  "id": "2440",
  "citation": " Half Dead. \"ROCKED! All Week Long: experience with Methamphetamine (ID 2440)\". Erowid.org. Sep 9, 2000. erowid.org/exp/2440",
  "substance": "Methamphetamine",
  "views": "35727"
 }
}
