{
 "id": 14928,
 "title": "Where's My Sandwich?",
 "date": {
  "submission": "2007-05-21T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Venum_injektur",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "I have never been into drugs, a few painkillers here and there. I've done my share of drinking but even that I rarely do anymore. 6 months ago football season was over, me and my friend (lets call him B)had been hanging out alot. He intoduced me to Incubus. I had heard them before but never really got into their music until he opened me to them. A few months after I started to listen to Incubus, I began discovering some of the concepts behind their magnificent songs. Psychedelic Mushrooms. I then realized that alot of their 'strange' lyrics were probablly the result of a shroom experience.",
  "I had heard a little about shrooms before and about how great the trip is but I was curious to what the negative side effects were. So I started searching, and searching, and a lot more searching, and eventually uncovered absolutely no negative or harmful effcts on the body, along with no mental or physical dependencies. About this time I got that feeling of excitement in my stomach knowing I wanted to do them.",
  "Completely coincidental, the very next week, my friend B talked to me after school, and suggested the idea that his parents were going out of town for the weekend and his brother could get us some shrooms if we wanted to try them. Well I was to say the least very excited. So the day came and I made my way to his house. B's brother arrived shorlty after and began preparing the shrooms, a supposedly grade A batch from africa. Me and B then went online and entertained ourselves with net humor pages for about an hour to get our minds ready for what was to come.",
  "6:00 pm When we first took the shrooms I was reluctant to down them alone because what I've heard about their horrible taste. But after B swallowed his I gained the courage and started chewing. It wasn't that bad actually, kind of like a rotten sunflower seed if that makes any sense.",
  "6:00-6:15 pm After downing them we made quick work of a whole carton of OJ. After the comsumption we made our way back to the computer where we sought more humor.",
  "6:55 pm A girl from school we had called had arrived but decided not to join us but only to watch. Even though I'm told we didnt I'm absolutely sure we started playing monopoly.",
  "7:25 pm 30 minutes went by and still felt nothing, I began feeling very angry that we had gotten ripped off.",
  "7:45 pm Just as I was passing go I began feeling the ever to familiar feeling of the warmness you feel when an opiate painkiller is kicking in. I just sat back and said nothing.",
  "8:00 pm This is where I almost lost it. I told the girl I was hungry and asked if she could make me a sandwich. I kept playing, then 20 minutes later I said 'hey wheres my sandwich?' She responded by saying 'What are you talking about? You already ate it.' Well I laughed and said whatever you don't have to make me one if its gonna be like that. But then she kept on persisting that I had indeed eaten a sandwich that she had prepared for me and that I enjoyed it very much. This confusion for me was only made worse by B and his brother also agreeing that I had eaten a sandwhich right in front of them.",
  "8:10 pm I was beggining to doubt my own memory and was so confused I was about to cry when I suddenly realized 'Hey! this is it, its my trip, thats whats making me feel like this, its started!' From then on it was a great time.",
  "8:30-8:45 pm The girl had to leave to pick up her brother, and since she had a little thing for me asked if I would like to ride along. Of course I agreed and off we went.",
  "The car ride was one of the weirdest experinces of my life. Every turn and bump in the rode was exagerated a hundred times. A sharp turn felt like we were going to roll it. Also during the ride I experienced one of the most fearful moments in my life, but only for a second when a police car drove past I felt like my world just ended. But eventually I forgot about the cop.",
  "8:45-9:05 pm When we picked up her brother I just sat in the front seat silent the whole ride experincing hundreds of CEV's and OEV's and drifting into and out of what I thought of as 'existence'. Suddenly I snapped back to reality to find the girl yelling at me to get out of the car to left her brother out. I later found out I had been sitting there unresponsive to her yelling for like 5 minutes.",
  "9:05-10:15 pm The ride home was pretty much the same.",
  "10:17 pm As I was walking up to the door I began wondering how my friend was doing, but I soon found out when I saw him laying on the couch with the honest to god biggest smile I have ever seen on his face.",
  "10:20-12:30 pm I layed on the couch next to him and we tripped for a few hours, occasionnaly looking at each other noticing how big our pupils were and busting into fits of unstopable laughter. We were watching a movie, can't really remember which one becuase every scene turned into more and more CEV's.",
  "12:35 pm Peeing was breathtaking, I know it sounds funny, but I was sucked into the toilet in neverland, found out some truths about my inner self and came back to reality realizing that I had already unzipped my pants, peed, and zipped them back up, all I was not even there mentally.",
  "12:45 pm Around this time I discovered a effect that remained constant, when I put my hand to my lips for any reason my mouth seemed to suck my whole hand in, further and further until I realized what was going on and pulled it out. Many times I realized my hand was wet but didn't know why.",
  "1:00-1:30 pm B's brother kept me tripping by saying a single word that held my attention and made me drift off into some distant place to ponder what it meant. The word was shoelace, which I have no idea why he chose that word.",
  "2:10 pm I started to come down, no more visuals but intense euphoria and light feeling for about an hour. Then we decided our trip was done and we went to sleep.",
  "9:00 am Woke up feeling a little groggy, but happy, no hangover or anything. The rest of the day seemed perfect. Although we realized our trip was a bit weak compared to the stories we've heard, we were still content, it was our first time anyway.",
  "One interesting an amazing thing that was affected during my trip, was my perception of time. Dozens of times I would look at the clock, then drift off into some paralell universe, when I would snap back to reality for a second I would have put all the money I owned that it had been at least a few hours, but when I looked at the clock it was maybe a minute or two later. This is what made the trip extra special, the feeling that it would last forever.",
  "I totally recomend shrooms to anyone looking to experiment, why screw up your body with all that other stuff, shrooms is the way to go. I plan on doing them again very soon. Just remember to have a very trusted person sit you to make sure you dont try anything crazy, like a takeoff from your roof. :)"
 ],
 "erowid": {
  "id": "24432",
  "citation": " Venum_injektur. \"Where's My Sandwich?: experience with Mushrooms (ID 24432)\". Erowid.org. May 21, 2007. erowid.org/exp/24432",
  "substance": "Mushrooms",
  "views": "3388"
 }
}
