{
 "id": 14922,
 "title": "Pay the Price",
 "date": {
  "submission": "2003-06-11T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "jacky",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Voacanga africana",
   "form": "seeds"
  },
  {
   "time": "0:45",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Voacanga africana",
   "form": "seeds"
  },
  {
   "time": "15:15",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I finally got around to trying voacanga seeds that ive had for almost a year. Reading what few reports there are on the internet, I didnt really expect much. I ground 4 grams of seeds, about 60 or so seeds, and swallowed them with water. 45 minutes later, after no real indication of any effects, i swallowed 4 more grams. An hour later I felt mildly stimulated, although being 12:30 in the morning, I felt tired too. I slept fine with no strange dreams or alteration of sleep patterns discernable.",
  "The next day I felt tired, and in a good mood. I was reminded somewhat of rauwolfia serpentina's effects as far as a feeling of underlying sedation that carried throughout the day. A day trip into the mountains was the plan, and at around 2 pm I took a vicoden 10 mg for what seemed to be an ache between my shoulder blades. By 6 pm this ache had manifested itself throughout my stomach and chest area. My chest felt tight, and I had a horrible ache between my shoulder blades. I was very tired and weak. On returning home I experienced a very painful episode of what I can only describe as muscle contractions in my chest/back/stomach areas. During this particular time I felt somewhat feverish, with strange thoughts running through my head. Laying down and accepting these symptoms was all I could do although a trip to the hospital was in the back of my head. The symptoms somewhat subsided in intensity as the night wore on.",
  "I am writing this the morning after the morning after consumption. A full 33 hours later, after being able to sleep only 4-5 hours (on the second night) I still feel sick. The symptoms mostly being strange soreness in the back/chest upper stomache area. Perhaps I should have done an extraction on the seeds. My opinion of these seeds as possible entheogen is doubtful. My opinion of these seeds as possible enjoyable somatic inebrient doubtful. Given the low amount of information I have been able to find on the applications that these seeds have as inebrient/medicine, besides their use as an intermediate in the production of other compounds, my conclusion is to stay the hell away from them. I am still interested in hearing other reports on the consumption of these seeds, more out of morbid curiosity now. I would not recomend the steps I took or didnt take.",
  "Taking a vicoden could have interacted with the central nervous system depressant effects these seeds have been purported to cause. Grinding the seeds and eating them without food could cause stomache distress alone. With all the sources for these seeds out there I wonder how many others have imbibed? Hats off to anyone that has found a use for these seeds."
 ],
 "erowid": {
  "id": "24405",
  "citation": " jacky. \"Pay the Price: experience with Voacanga africana (ID 24405)\". Erowid.org. Jun 11, 2003. erowid.org/exp/24405",
  "substance": "Voacanga africana",
  "views": "19862"
 }
}
