{
 "id": 14937,
 "title": "Ascorbyl Palmitate for Post-MDMA Depression",
 "date": {
  "submission": "2003-07-25T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "ktsugen",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": "2:00",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": ""
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Vitamin C",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I recently experimented with a new post-MDMA nutritional supplement protocol to counteract the sense of depression and exhaustion that usually occurs a couple of days after using MDMA. Over the last couple of years, I have also used Prozac at the end of these (infrequent) trips -- a practice which I found only slightly minimizes the negative after-effects.",
  "An article published in Synapse (2001 Apr;40(1):55-64) indicates that, in lab rats, vitamin C can prevent free radical damage from MDMA (abstract available on med-line). A more recent article (Ascorbyl palmitate as a carrier of ascorbate into neural tissues, J Biomed Sci. 2003 Mar-Apr;10(2):193-8.) further suggests that the fat soluble form of vitamin C known as Ascorbyl Palmitate could be the 'preferred form of transport of ascorbate into neural tissues' (abstract also available on-line).",
  "Armed with this information, I decided to swallow, in addition to the usual Prozac tab, Ascorbyl Palmitate (AP) powder dissolved in whole milk (for the fat content--it won't dissolve in water), at the end of an MDMA experience--an experience that had been precipitated by ingesting 2 120mg capsules of pure MDMA, 2 hours apart. I tried to consume the vitamin C to bowel tolerance--the point at which my body is theoretically saturated and expels in diarrhea the extra vitamin C that has not been absorbed in the small intestine (please refer to the literature on using vitamin C in mega-doses to 'bowel tolerance' -- a simple google search should yield this -- to get detailed instructions on this process.). My bowel tolerance for AP at the end of a fairly intense MDMA experience turned out to be just under 40 grams, which is equivalent to just under 17g of pure vitamin C (200 grams of AP is equivalent to 85 grams of pure vitamin C). Considering that my normal bowel tolerance is about 8 grams of pure vitamin C, this increased tolerance probably indicated that my body had been somewhat stressed.",
  "After consuming the neutral tasting milk-AP combination, I retired to bed (around 9pm). I awoke the next day quite tired, but not as exhausted as on previous occasions after using the same amount of ecstasy. That morning, I ingested a further 38 grams of AP, again dissolved in milk, and repeated this again at bedtime. I awoke on the second day after the MDMA experience, feeling completely refreshed, rested and in a good mood -- which is quite remarkable considering that I am usually emotionally and physically drained by the two day mark. Taking into consideration the occurrence, that morning, of slightly loose stools, I reduced my AP dose to 30g bid, and finally, the day after, to 22g bid.",
  "The post-MDMA depression never materialized. I felt the most tired the day after the experience, but never had the crash I usually expect mid-week.",
  "I still believe that MDMA is potentially dangerous, especially if used in excess. However, I am now more comfortable taking it on occasion (for me, about twice a year) followed by Prozac and high doses of the fat-soluble form of vitamin C. Next time I will also try pre-loading with vitamin C, and adding alpha-lipoic acid to the protocol a well."
 ],
 "erowid": {
  "id": "24452",
  "citation": " ktsugen. \"Ascorbyl Palmitate for Post-MDMA Depression: experience with MDMA & Ascorbyl Palmitate (ID 24452)\". Erowid.org. Jul 25, 2003. erowid.org/exp/24452",
  "substance": "MDMA & Ascorbyl Palmitate",
  "views": "11105"
 }
}
