{
 "title": "The Devil's Drug",
 "author": "Anonymous",
 "citation": " Anonymous. \"The Devil's Drug: experience with Caffeine (ID 14937)\". Erowid.org. Jun 15, 2007. erowid.org/exp/14937",
 "substance": "Caffeine",
 "bodyweight": "110 lb",
 "report": "<p>The night started out young. I was bored and home alone from 8pm till about 3:30am. What else was there to do? I had some untaken extra-strength Nodoz laying around in my room, so I thought 'ah, I might as well as finish this bottle out'. Big mistake.</p><p>(8:15 pm)</p><p>I take 5 extra strength pills (200mg/pill) in all of about 15 seconds. downed them all with a glass of water thinking 'this will be fun, I'll feel all energetic!' wrong.</p><p>Sure, at first I started out all hyper and enthusiastic, but it didnt last long.</p><p>(10:00 pm)</p><p>By now, I'm all out sweating, trying desperately to catch my breath, my heart is pounding out of my chest, I could have sworn I was going to pass out at any moment and die. I could do nothing but pace my house, even though the walls seemed to sway from side to side while I attempted to walk back to the toilet for the maybe 15th time in 30 minutes.</p><p>(12:00 AM)</p><p>Just when I think that nothing could get any worse, The caffeine seems to jump to a higher level. Keep in mind that although 1000mg's isn't a fatal overdose, I'm a very VERY small person to have taken all of that in one swallow. So by now I can't walk around my house because things are getting too intense for me. The only thing I can remember thinking is 'I will never touch caffeine again.'</p><p>(2:00 AM)</p><p>I somehow manage to get to the phone in my kitchen and dial the operator to connect me to poison control. I get a hold of them and to my surprise they tell me that 'I'll be fine, my amount taken was not an overdose that needed Medical attention.' They told me I just needed to fair through it till it passed. Around 3:00 am I either passed out of fell asleep in my room.</p><p>Right now its 9:45 AM, and I woke up still feeling like shit, my stomach is killing me, I can't believe this. I will never touch Caffeine again in my life.</p>",
 "year": "2002",
 "id": "14937",
 "gender": "Male",
 "timestamp": "2007-06-15T07:00:00.000Z",
 "views": "3696",
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 ]
}
