{
 "id": 14958,
 "title": "Half Of A Parallel Trip - Introspection Galore",
 "date": {
  "submission": "2007-01-06T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JacquesCousteau",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "inhaled",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I've tripped on mushrooms 4 times. Three out of those four times I either underdosed or simply had really poorly produced mushrooms with a low potency. (Give me a break, we were like 16 back then. :)",
  "But this report isn't about those three fairly-boring trips. It's about the fourth.",
  "This report is a report of MY trip, but gives some information regarding the other half of the parallel trip as well. The setting was my friend C's house. C's house has been a really chill social interaction point for me since like 8th grade, because he only lives with his Dad, and he lives in the basement. His parents gave up on him earlier than most do, heh.",
  "The night started with poor preparation on my part. I didn't think to eat much that day for some reason, just really busy doing other things, and I ended up with my mushrooms (DOSAGE: 8th) in front of me on an empty stomach.",
  "Hearing the call of the mushrooms in front of me like that was just too much. My perception of the situation was colored by the call of the mush, which allowed me to just say to myself 'I'll eat something if it starts to give me trouble.' I ate them down, and chilled for a little while.",
  "Then it started to rumble like it was empty, and gave me that nauseau-like feeling that sometimes comes with your stomach making noises of hunger. It's like an overwhelmingly unpleasant feeling in your stomach, as opposed to actual pain.",
  "So then I got some bread and some juice and tried to eat the bread, but it just wasn't having it. I managed in a few bites, but it felt like my entire digestive system had shut down, and pieces of bread going down my throat felt very dry and unwelcomed.",
  "I gave up on the bread and rode it out.",
  "So for the next hour and a half I tripped BALLS while dealing with horrible stomach discomfort. Needless to say, it was magnified by the trip. Amazingly enough, though it was very paralyzing to my body, I was pretty much able to put it out of my mind and pay attention to other things.. it kind of moved back and fourth in focus, and each time I'd look around the room I'd be like 'Woah, I'm tripping harder than I thought' This is probably due to the distraction sort of bringing me down.",
  "All the while, C's tripping as hard as me and experiencing similar stomach problems. A room full of people had accumulated as they tend to do, (people he doesn't even want there end up there a lot, and it's hard to get them to leave because there's literally no where else to hang out around here, as the rest of us live in our parents' homes)",
  "Needless to say, having like 10 people in a room (some high, some tripping, some straight) is really an overload when on shrooms, because of the way it opens up your senses. It's like you're unwillingly completely aware of how each person in the room is feeling by watching and listening to them all. It's pretty strange sometimes, and it can get to you.",
  "I started to feel really weird between my stomach and all the people in the room, so I told C I wanted to go outside, and he joined me. Outside he told me about how he wished all the people inside would leave because they were making him really uncomfortable.",
  "Around this time we reflected upon the wonder of how we seemed to be travelling almost identical paths in our trips. It was like we both had stomach pains, both couldn't take the people int he room, both felt the need to go outside.",
  "At this time (about five minutes after we came outside) we decided it was too cold outside. We then got in C's car and listened to Incubus. Incubus is a very trip-happy band. Their mushroom use-age in creating music is inspiring to me. It's like, when you're on mushrooms and listening to it, you appreciate all the little trippy details they have in their songs.  This is basically how I felt for about 10 minutes.. me and C discussed it, then I attempted some CEV's.",
  "When I closed my eyes, what I saw was almost indescribable. I could probably do a better job painting it than describing it, but basically it was like looking up inside a round cathedral-shaped ceiling, and the whole thing was painted with a beautiful blue and red pattern (very rich dark blues and reds) made up of geometric shapes. This alone isn't all that amazing, what was amazing to me, was that the entire thing was moving in a manner I can't explain. It was like the ceiling itself was alive and was forming into different shapes intentionally, at an extremely rapid pace.",
  "All this took place for about 30 seconds, then I stopped CEVing. I don't even know why, I remember thinking it was so cool, and then being like 'I don't want to close my eyes anymore.' for some reason.",
  "Suddenly the extreme level to the trip underwent a drastic change of mood. Me and C both experienced this simultaneously, as we both found the world to be suddenly extremely grey and depressingly dark and plain. Of course, it was like 11:30 PM or so, and it was dark out. It's perfectly natural that these things would look like that..",
  "But just minutes before that I was sitting the car saying 'I can't believe how hard I'm tripping, this rocks out' and now I was saying 'Dude, I can't believe how much everything sucks all of the sudden.' C always agreed with me, and I found this really interesting. We had taken them at the exact same time, and same dosage, so it makes sense, but it was interesting to witness.",
  "We decided to go back in. Inside, everything was still very strange, but we watched The Family Guy. Watching The Family Guy tripping was pretty fucking strange. I kept watching Stewie's head turn purple then blow up, then shrink back down and go back to normal peach color. The entire upper left corner of the TV screen was completely un-accessable to me. It was like the whole thing was blurred right off the screen as if it was being stretched or something.",
  "I kept telling C his TV was broken.",
  ":)",
  "A while later several people left, and the room dwindled down to the normal dwellers of C's room, which consists of myself, C, and two of our other close friends.",
  "This is when my trip really picked up. I went very introspective, but at the same time my mouth was connected to my introspective brain. It was like everything I thought flowed fluidly out my mouth. Everyone listened to me talk for hours. I discussed how fragile our lives are after coming to a realization of this. I decided that we take our lives for granted. I actually got anti-drugs at that point and decided to stop forever. (Changed me mind the next mornin'! I think it's funny that I was so sure it was the right thing to do, then when I stopped tripping it faded away and I wanted to do drugs, because we only live once and we should have fun! For granted or not, life is about being happy and having fun.)",
  "I went to the bathroom, and while I was in there, staring down at my stream of piss, I felt very strange and uneasy. I had the thought that I would somehow make this a weird trip to the bathroom and it would make it hard for me to do so after the trip without having some weird flashback. I then looked in the mirror at my eyes, and my pupils were really big. I looked pretty strange, and I decided to stop looking at it. (Not because it was bothering me, but because I was afraid it would start to.) I returned to the basement.",
  "Introspection continues as I discuss how much our lives are like garden hoses. Allow me to explain. I was thinking of our live's timelines as being like a garden hose, and thinking about how our memory only seems to reach so far back down. It reminded me of when you look down the end of a garden hose, how you can see some of the sides of the house, but no matter how hard you try to hold it at the right angle to the sun, you can never see what's in the black spot in the middle. I concluded that the meaning of life was hidden in the black spot in the middle of what we can see when we look into our own pasts.",
  "This led me to thoughts on the cylinder shape and I pondered that perhaps space-time is made up of all of our garden-hose-like tubes, which loop right back around and connect to themselves like links in a piece of chainmail. This led me to conclude that our lives are a continuous loop, and that we're all living the same life over and over again, creating space-time 'fabric' by looping together. Through acquaintances made in life perhaps.",
  "At one point I thought about how our population is growing. I thought this defeated the concept at first, but it actually fits into place perfectly, because the passage of time can be thought of very easily as the creation of more 'space-time' (which is made up of our collective 'histories' so it is really history.) So as more people are born, their histories are woven into space-time. I'm having a little trouble explaining this clearly, as I'm stoned, but if you're tripping right now you probably know what I mean. If you're not, you're probably getting lost.",
  "This was both astounding and horrifying to me. I thought it was incredible that I had created an entire space-time theory just because of mushrooms (And even now when I read it I don't think it's so ridiculous really. Well, maybe it's ridiculous to some degree, but so is every other scientific theory on this stuff that I've read)",
  "The night ended in introspection-out-my-mouth mode. My girlfriend and I ventured home eventually, and I talked the whole way. She was amazed at everything I was saying (she wasn't tripping, but we share such a similar personality that it felt for ME like she was tripping. I don't know how to explain it, we just have a connection.) I fell asleep talking to her. I remember telling her I couldn't talk anymore because I'd used up all my breath. I really was having trouble, I was exhausted.",
  "Post-note about the parallel tripping: After introspection kicked in I was way too busy to keep track of C at all. He was off in his own world, being very quiet most of the time. A few times I found him grinning at me, because he thought it was hilarious how much I was talking. (They later informed me that it was extremely excessive and they were all completely astounded that that much information could pour out of someone so fast.)",
  "I'm tripping again tonight.. this will be the first time I've had some good ones (confirmed from friends) since this incredible trip, and I CAN'T WAIT!",
  "Maybe I'll write another one of these after :)"
 ],
 "erowid": {
  "id": "24520",
  "citation": " JacquesCousteau. \"Half Of A Parallel Trip - Introspection Galore: experience with Mushrooms & Cannabis (ID 24520)\". Erowid.org. Jan 6, 2007. erowid.org/exp/24520",
  "substance": "Mushrooms & Cannabis",
  "views": "2712"
 }
}
