{
 "title": "Fun, Respect, and Agitation",
 "author": "-bC-",
 "citation": " -bC-. \"Fun, Respect, and Agitation: experience with Salvia divinorum (ID 14956)\". Erowid.org. Jun 1, 2002. erowid.org/exp/14956",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "12 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>Note: 1. I have explored various psychoactives in the past. 2. I am a very mellow individual with little stress. 3. I have taken no medication aside from Tylenol in the 2 weeks prior to this.</p><p>Substance: Salvia Divinorum 10x</p><p>Amount: 12 large inhalations (about 4 pipe bowls of medium size)</p><p>Method of ingestion: Smoked *My partner will hold the pipe, light the pipe, and refill the pipe as quickly and efficiently as she can so I will be able to consume a large about in a brief time period.</p><p>Mindset: I am in an unusually good mood before I proceeded to try this substance. The whole day was an all around good positive atmosphere. I am relaxed, comfortable, and greatly anticipating this experience.</p><p>Setting: Outside my house on a tranquil day, the sun is setting right in front of me. Also, there is a slight breeze, birds chirping, and the trees swaying. At this time, I am in the presence of my dog, my girlfriend, and an array of wild animals. </p><p>The Experience: As I sit comfortably on the ground, I prepare my mind through meditation for what is about to happen. My partner then raised the long-stem pipe to my mouth and begins to light it, all the while given me calm instruction.  I took large hits from the pipe holding each lung-full for almost exactly 20 seconds. Upon exhaling, I immediately took another hit. Repeating this process through the help of my partner for 12 hits took around 4 minutes. After the 6 or 7th hit from the pipe the only thing I recall is my 'trip' and not smoking anymore, although my partner confirms I did indeed finish 12 hits.</p><p>I remember being overwhelmed by an extreme fit of laughter that put me in a state of delerium. I fell back from my sitting position and looked up at the trees. Suddenly I quit laughing and became very annoyed by my usually peaceful surroundings. The sound of my partner's voice became so agitating that I told her to shut up. The sound of the bell on my dog's collar was beyond irritating. And suddenly, the comfortable ground I was rested upon became uncomfortable. I could feel every little detail of the dirt and debris below me.</p><p>I suddenly sat up and proceeded to laugh again, except this time more aware that I was under the influence of salvia. The laughter slowly wore off and my mind slowly returned to normal.</p><p>After effects: I noticed the after effects tend to linger for about an hour. I was quite relaxed yet lethargic. I also later noticed feelings of sexual attraction were more intense. I felt rather turned on and more comfortable with my sexuality as with MDMA minus the empathy. Depression set in about 20 minutes after the initial trip and lasted another 20 minutes. Coming out of it was a quick - as if my mind was suddenly cured. I instantly was overcome with a sense of 'everything is fine. Nothing is wrong.' and the rest of my day was a loving, positive, atmosphere.</p><p>Physical effects: Sweating, rise in heartbeat, Skin irritation, difficulty focusing eyes, difficulty concentrating.</p><p>Mental/Emotional effects: Gravity seems somewhat distorted, as if on a mild roller coaster ride, taken over randomly with fits of laughter, slight confusion, and a sensitivity to your surroundings.</p><p>Note: I have at least 20 experiences with salvia; I just felt this symbolizes the normal trip. Several of mine have been spiritual where trees talked to me through telepathic energy and told me they were to heal all my problems. While this was a great thing, it only happened a few times, under some strict conditions of meditation and total silence.</p><p>Overall/Conclusion: Looking over my log notes, I can see the ability for salvia to be recreational, but I still believe from my personal experiences that salvia should remain for healing, insight, and enlightenment through the exploration of yourself, and your world. While I had fun, this is not something I would probably do to cure a boring night at home. Be careful of how you prepare your surroundings. Any slight noise or distraction that seems minor to you now, will multiply later in your journey.</p>",
 "year": "2002",
 "id": "14956",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-01T07:00:00.000Z",
 "views": "18519"
}
