{
 "id": 14951,
 "title": "Captain at the Helm",
 "date": {
  "submission": "2001-09-02T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Dirk",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "9 drops",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "Having felt the relatively mild effects of smoked salvia on several occasions, I decided to try a concentrated salvia extract. Over a month or so I took various amounts of it, both diluted and undiluted, with none giving any more of a buzz than when I'd smoked the salvia. Between this frustration at not achieving any 'better' results and my bad habit of doing potentially regrettable things on a whim, last night I decided to take a large dose and see what would happen.",
  "I took 9 drops of diluted extract sublingually over the course of 12 minutes. I mixed the 3 drops of extract with approx. 1.5 drops of water in a shot glass, poured it in my mouth, waited 4 minutes, swallowed, and repeated twice more. As soon as the solution hit my tongue the alcohol began burning (it burns, badly, for about half a minute), although this time my mouth didn't begin salivating as much as it normally does. By the second shot glass my mouth was pretty much numb, and by the third the salvia had kicked in enough that I could barely figure out what was going on, let alone feel my tongue.",
  "Somewhere during the course of the middle shot the salvia kicked in. With lower doses, the first signs of the salvia kicking in had always been the feeling that my head and upper torso were on fire, something between having a high fever and sweating profusely. This time it started as a tingle in my hands and feet, which slowly spread up through my body as the visuals (slight fish-eyed view, green and amber-red tint to everything) began. I was sitting in front of my computer at the time, and as the experience intensified the display began to take on 3-dimensional qualities, as if I could reach into it towards the open windows and such. This distracted me enough that I didn't notice how strongly the salvia had kicked in until I tried to take the third shot, which I had trouble doing (remembering what I was supposed to do became problematic). Once that was in my mouth I waited the remaining 4 minutes, swallowed, stood up...and reality went crazy.",
  "(The following is my interpretation of the experience as I was coming down off the trip, after consensus reality had returned. I note this because this trip was *nothing* like LSD, Ketamine, or anything else I've experienced. Even the egoless, timeless environment of a K-Hole is more easily described than this. So, if something I say doesn't make total sense, that's why)",
  "As I was standing up from my chair, I immediately felt that 'down' was to my left, and that the entire room was in essence on it's side. Even though I was standing on the wall (in my newfound reality), this seemed perfectly normal to me. Once I deemed this to be 'correct,' it was like it opened up my mind to even more of this strange new place. I knew I was in a garden, the idea of my room being enclosed was totally gone from my mind. My computer desk and its contents remained, but all the walls now extended outwards into a bright, very green garden with a white gazebo off to my left (which put it 'down' from me, with this entire place still being on the 'wall' I was standing on). It wasn't that I could actually see this so much as I just knew it was there, that this is where I was supposed to be, not my room. As the thought-idea of 'my room' went through my head, I seemingly pulled my consciousness back to consensus reality - I knew I was in my room, not a garden, and that 'down' was towards my feet and not to my left. This only lasted as long as I concentrated on staying grounded, however - as soon as I became comfortable with consensus reality I would again sink back into this new place.",
  "Sometime during this I lay down on my bed, and turned the light off. In the darkness I was still in the garden - the perception of this new reality was the same no matter what physical conditions existed (light/dark, eyes open/closed). The only difference was now I felt like I was being pressed up against the bed, my feet facing 'down'. I spent some time amusing myself with the idea that this meant there were three types of gravity/force present, one holding me sideways, the other telling me where 'down' was, and the third keeping my bed in what I felt should be mid-air. My thoughts quickly changed to worrying that my roommate (who would freak out finding me in this condition) was about to come home, so I turned the lights back on, stood up, and walked out of my room (no idea why, it just seemed the logical thing to do at the time).",
  "Walking seemed to keep me grounded in consensus reality, the only change being that the concept of right and left were a little confusing, and I knew that I wasn't judging the passing of time at all well - my bedroom clock said I'd only been tripping for a little over 5 minutes - seemed like forever. Since I had some time before my roommate arrived, I decided I'd go take a shower and go to bed, so I wouldn't have to deal with him. I walked into the bathroom, which brought my vision across a mirror.",
  "Looking at my face, the first thing I noticed was the wide-eyed, blank/mindless look I had, which I took to be the 'scared animal face' I'd read about when going through salvia information. As I stood there looking at myself, I realized that I'd been mentally talking to myself this entire time, narrating what was going on as if I wasn't the person experiencing the trip. This made me wonder if I could physically talk at all, so I tried...but couldn't. I then commented to myself something like, 'heh, I guess the captain doesn't want to open my mouth. Oh well.'",
  "Then it dawned on me that the person I was looking at *wasn't* me - somehow I existed as a separate entity from my body, which was floating/existing over my body's left shoulder. Analyzing this brought me to the strange situation I was currently in; I was somehow existing in 3 different places simultaneously, as a body, mind/consciousness (shoulder-entity), and spectator. My body was able to use all of its functions, but only if my consciousness decided to tell the body to do it, and the body decided to go along with entity's suggestion. The shoulder-entity, which seemed to equate to my consciousness, seemed to be performing 2 separate functions - commanding and narrating to my third-self. The third me was a spectator somewhere back and to my left, behind both the consciousness-me and the body-me. I'm not sure what it was for, but at the time I felt positive that even though I couldn't explain (to myself) what its purpose was, it was just as essential to 'me' as the other 2 parts were. As for who 'the captain' was, I'm still not sure - my consciousness was either referring to the spectator or to my body, although I have no clue which (I think I was talking to the spectator-me, but I was so confused by all this that I really didn't analyze any further). This whole situation began to make me feel panicky, as I realized I was actually perceiving everything from these three different locations simultaneously...something I couldn't even begin to comprehend despite the fact that I was doing it. This led to worries that I might continue to split up, causing my panic to grow.",
  "In a smart move by the consciousness-me, I decided to busy myself by continuing to prepare to take a shower. I undressed down to my boxers, took my clothes out to the hamper in the kitchen, and returned to the bathroom successfully, sinking back into thought only once as I saw myself in the hallway mirror. It was like I was running on automatic, which I basically was - I've followed this exact procedure almost nightly for the last few years. I closed the bathroom door, removed my remaining clothing, went to the bathroom (really weird/disturbing experience, it felt like I was watching someone else go to the bathroom), and hopped in the shower.",
  "I seemed to be coming down off the salvia trip at this point, as I was quickly feeling more like a single entity. I believe the water hitting me helped this, although staring at the far wall kept trying to draw me back into the sideways-gravity world (I kept thinking that wall was now 'down', and would then get stuck on the idea that this new 'down' was a different direction from the 'down' in my bedroom, even though they both existed in the same place/world/altered reality).",
  "By the time I was done with the shower and in my bed, relaxed and comfortable, the salvia was mostly out of my system, holding on just enough to keep my mind wide awake. I went over the events in my mind, trying to get them sorted into a manner I'd be able to explain the following day (i.e. the above report). It took me the most time to figure out how to explain the triple-me incident, and by the time I was satisfied with my explanation/interpretation I was almost back to baseline and so drifted off to sleep.",
  "Today I feel extremely awake and alert, way more than I should considering the amount of sleep I got. My tongue still feels burnt from the alcohol still, although it's not too bad. I really have no desire to experience this again soon, although I have no fears about it and most assuredly will sooner or later."
 ],
 "erowid": {
  "id": "245",
  "citation": " Dirk. \"Captain at the Helm: experience with Salvia divinorum (ID 245)\". Erowid.org. Sep 2, 2001. erowid.org/exp/245",
  "substance": "Salvia divinorum",
  "views": "6472"
 }
}
