{
 "title": "Talking With God",
 "author": "Shrike",
 "citation": " Shrike. \"Talking With God: experience with Salvia divinorum (6x extract & tincture) (ID 14953)\". Erowid.org. Dec 15, 2004. erowid.org/exp/14953",
 "substance": "Salvia divinorum (6x extract & tincture)",
 "bodyweight": "340 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)",
   "",
   "0.25 oz",
   "sublingual",
   "Salvia divinorum",
   "(liquid)",
   "",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   ""
  ]
 ],
 "report": "<p>I am a 30 year old scientist and I recently came across a web page on Salvia Divinorum on the Internet. I do not use illegal drugs of any kind, however, I had sporadic experience with marijuana and other psychedelics in undergraduate college. I found those sorts of experiences beneficial for insight into myself, and personal growth. So naturally, after learning it was legal, I felt compelled to try Salvia.</p><p>I was confronted with this substance which supposedly inspires a wide array of effects varying from total rapture to the worst night terror, and I really didn't believe any of it, because myself and my uncles have done every hallucinogen known to man, and none of it ever really affected us as strongly as the Salvia accounts describe. So I ordered one gram of fortified leaves standardized to 15mg Salvinorin-A per gram (roughly 6X), and a one-half ounce bottle of an alcohol-based sublingual Salvia tincture. I ordered the tincture to try first, with the idea of 'priming' the smoking experience with a more gentle liquid one first.</p><p>My package arrived in the mail on Thursday, and I was anxious to try the substance for the first time. The package said to use 4 droppers for a moderate experience. I work for the federal government (which is why I don't use drugs), I had no idea what to expect, and I had to work the next day, so I started with one dropperful under the tongue. I did not dilute the dropper, which was a HUGE mistake. Although natural saliva eventually diluted it, the pure grain alcohol solvent burned the underside of my tongue much like a hot coffee burn, which I still have now. This really hurts, and has not healed after two days. However, I did experience what I've heard menopausal women describe as a 'hot flash' for a few seconds, after which I entered a brief, light, slightly expanded state of consciousness which included some very small visual disturbances, but almost imperceptible.</p><p>When I looked at the stucco ceiling in my apartment, it seemed to pulse or move just slightly, and when I closed my eyes, I got glimpses of things quickly moving through my field of view, somewhat like watching people in white robes walking through a dark room. As your eyes adjust, you might catch a glimpse of a cuff here, or a hem there, flitting by... but you can never see the form completely in the dark. I also had a personal moment of emotional clarity and well being which was pleasant, and persisted until noon the next day.</p><p>I worked the next day and then drove out of town to visit some family for the weekend. I took my Salvia because I knew my uncles Xavier and Xander would want to try it with me. They are the real drug heavyweights. I arrived on Friday night, and in my uncle's room, we fired up about two micro-hits each of the 6X-fortified leaf using a small brass bowl and a regulation lighter from the Stop and Go. I felt the same characteristic hot flash as before, but nothing else. My uncle also felt nothing, and at this point I was pissed, because I had dropped about 100 bucks on this stuff and I wanted it to work! :-) At that point I read the smoking recommendations and realized I needed a bong and a butane torch-style lighter to make it work. I had neither of these, but one of my uncles had both. So my uncle Xavier and myself decided we would go over my uncle Xander's house to use his paraphernalia.</p><p>Now we are all Christians, and I have heard reports of people encountering intelligent entities during their trips. I, for one, believe in the existence of both angels and demons, and I also believe in an unseen Heaven and hell, so, naturally, I did not want a genuine encounter with a demonic presence, since those can be tricky to deal with effectively when you are intoxicated. As a Christian, even though you are in dominion over darkness, you are not supposed to seek out experiences with demonic presence, however you always have the security of knowing you cannot be possessed, because a true Christian is already possessed voluntarily by the Holy Spirit of God who dwells inside you, so, before we started, I said a small prayer, 'Lord Jesus, please show your grace and protect a bunch of stupid trippers, in Jesus' name'. I knew the ethnobotany of Salvia was such that the Christian Mazatecs use the leaf to receive visions from Christ and the Virgin Mary for the purpose of supernatural healing. That was part of the allure of the leaf, and I wanted to give God His due respect to protect us from any spiritual consequences of taking the leaf. After doing this, I felt much less anxious about investigating the unknown effects of the Salvia, and I was ready to jump in with both feet.</p><p>When I arrived, Xander immediately wanted to stoke the Salvia. I explained to him that we needed a hotter flame, since Salvinorin-A vaporizes only at high temperature, so he got his butane welding torch for us to use. Now, I don't use any drugs, but Xavier was high on marijuana, and although Xander had recently stopped smoking marijuana, he was taking Effexor daily and had also just taken 8mg of Dilaudid (a prescription narcotic) for his chronic back pain. I told Xander I didn't think it was a good idea that he smoke it, because it should not be taken while on other medicines, but he just brushed me aside, said 'we probably wont even catch a buzz off the shit!' and packed a small bowl-sized hit in his bong. Although I had educated myself about the leaf and warned him vehemently, he would not listen to me, and went into it hard, fast, and blind. This was not a one-hit he was using. This was a small BOWL. Now Xander has a real talent for doing bong hits, so he sucked down the entire bowl in one hit, and held it for a long time. Eventually he blew it out, and made some sarcastic trippy look on his face to make fun of the whole exercise, and packed another bowl.</p><p>He sucked down bowl number two and held it for what seemed like forever. His face flushed red, his aspect changed and got vacant, and I had to remind him to blow it out. I asked him if he felt anything. And he said 'Yes... I feel something.' Xavier and I immediately noticed his words were noticeably slurred, like he was very drunk, so we took the things out of his hands and he did not resist. He said.. 'It's doing something...' and then 'Kinda trippy...'. At that point he began to close his eyes and slip out of contemporaneous awareness, at which point I said 'Fight it!'. Then his eyes snapped open and he looked straight at me, but was unable to say anything. I told Xavier to lean him back, and Xavier tried to lean him back in the seat, but it was as if his body was frozen and resisted it.</p><p>While Xander was still under the influence, I decided to stoke a bowl myself, and see. So I lit up the first bowl, and as a nonsmoker, found the smoke to be somewhat harsh even through the waterpipe, but it tasted good. After one hit I felt the same hot flash as before, but no effects, so I stoked a second bowl. Naturally, I can't smoke like Xander does, so my dose was probably lower than his, but after smoking the second bowl, I held it hard, and tried to increase my internal lung pressure with the smoke in my lungs. Then, I had a strong sense of separation of my soul from my body, as if my body were just there, like a robot, and my soul was telling it do things, but they were not the same entity. I felt as if I could hold that hit forever. The whole room seemed to shift colors from its normal shade to a deep ruby red, and then it mellowed to a subtle orange-yellowish tint. I felt a huge somatic (body) sensation of my skin vibrating, almost similar to a hand percussion massager, only over the entire surface of my skin at once, and I could see how that could be overwhelming if it lasted too long, but this soon gave way to a feeling of 'birth', if you will, like I had come through some barrier into a new and strange place.</p><p>I heard someone say 'Let it out', and I let out the smoke. I felt as if myself and the room around me was in a thin, sticky, translucent jelly-like substance, and I could see it sticking all over everything, around the edges of things, moving and flowing according to its own strange dynamics. It would be wrong to say this substance had color, although it did in its own way.. It was simultaneously translucent and shifting multicolored, but not in the conventional sense of the word. I lifted my right hand, and shook it through the air, and I slung this jelly off of my hand onto the floor, and felt it splash on the ground, at which point my hand generated more. I picked up my feet and set them down on the floor, and I could feel my feel sloshing and splashing in it as if in a semi-viscous puddle. It behaved as if it were water in zero gravity in its ability to be thin, yet adhere to a substance and not run off.</p><p>When looking at my right hand, I began to see translucent rubbery bricks made of this jelly substance, like brick wall or a structure off to my right, and I got the sense that I was on the outside of this wall looking in. These bricks were also in the air in places, but chiefly along this wall to my right. I felt as if the entire 'real' world was just a faade laid out on top of this strange new world, like in the end of the movie 'The Matrix'. At that point I became aware of the sectional sofa to my left where my uncles were sitting. I looked over and heard someone talking. Immediately, it was as if the sectional was the only thing in existence, and we were floating all alone in some sort of strange new void or universe on this sectional. It was like the sectional was the only thing in the universe, afloat on a raft of jelly plasma, except the jelly brick wall was still there. The wall was sort of silently inviting me to travel along it, in a weird way, but I always had the choice not to go. Thing is, I wanted to go explore it, but not with other people there. I felt embarrassed to do that, and I wanted to go alone.</p><p>As soon as I became aware of others on the couch, I immediately felt as if we all knew some sort of profound and very private thing that we shouldn't know, but I couldn't put my finger on exactly what that was. I saw Xander begin to lean forward a bit, and Xavier was making trip noises, and generally trying to fuck with him. At one point he was trying to press him back into the couch to relax. Immediately, I felt as if I was the one being pressed, and I said 'Don't touch him, it's not comfortable'. What I meant was, it wasn't comfortable for me. It was as if I could sense Xander's discomfort, and I could feel it myself. Then, I became acutely aware of the T.V. again, and the ceiling light, and I found them to be EXTREMELY annoying. I just wanted them off, and the people on T.V. to shut up! They were so annoying. And then, I began to resurface from the experience, and I did not like the feeling of losing the secret discovery I had just made. I wanted to go back there, to know that thing which I couldn't identify, which I could only know while I'm 'in' there. </p><p>At no time did I lose my identity or sense of who I was, or experience any fear at all, however this was an extremely intense psychedelic experience, so much so that I had to smoke a cigarette after coming down to ground myself strongly in contemporaneous reality, and I haven't smoked cigarettes in about a year. I noticed that as the effects tapered off, the cigarette tasted funny, but to me, it was like a security blanket which made me feel more normal. I was looking over at Xavier and Xander, and Xander was resurfacing now. Xavier and Xander's antics just struck me irresistibly funny at this time, and I started laughing at those fools, because Xavier was still fucking with Xander and acting stupid, and it was HILLARIOUS! The laughter and the pleasantly diminishing psychedelic state was very euphoric.</p><p>After about 5 minutes, I had absolutely no effects whatsoever, except a desire to go back there again, to that strange new place, and explore more. It was very unique, thought provoking, and I feel I could learn a lot about myself from this sort of experience if I were really allowed to explore it instead of fighting to retain contemporaneous social activity.</p><p>Now, Xander had a similar, but slightly different experience. He described seeing the same sort of bricks that I saw, and what he described as a wall or a dome made out of them, with a black hole at the top. He said the bricks were transparent, and seemed to be the same color as the background of the room, as if there was a space warp, or a rip in the fabric of space, and the room was being sucked into it. But here's the freaky thing. He saw this dome in the same place in the room as I saw the brick wall, and the description was similar. In my experience, it was off to my right, and in his, it was in front of him, and he was sitting to my left at a right angle to me, looking to my right. That was strange. He said it was trying to suck him in, but he didn't feel afraid of it, he enjoyed looking into it. We asked him what he felt when Xavier was pushing on his head to lean him back, and he said it was as if he was on the edge of 'something', trying to come up out of the experience, and Xavier was trying to push him off a cliff backward into a place he didn't want to go. As he re-surfaced, he said under the influence of the diminishing state that he 'didn't know where he was for a minute', and he 'forgot he was in the living room'. He also said that 'it was like a dream state, but I was awake'.</p><p>By this time, we knew Xavier had not done a hit yet, and that was why he was messing with everybody. :-) So we loaded him up one, and he smoked one bowl with no effects. Then he smoked the second bowl, and got real quiet, and started leaning slightly forward into the T.V. and mumbling under his breath. He would mumble unintelligibly, and then laugh. He almost sounded like a little baby. We asked him if he felt anything and he said, in a strange tone, 'Nah... I don't feel anything.', but he was acting as if he did. A few minutes passed, and we asked him what he saw, but he could not comment on it at all, He only refused another hit and went over to sit in the recliner across the room, silently. He made no comments at all while Xander and I each did another hit, which spent the entire gram. As Xander and I both resurfaced the second time, with similar experiences as before, by that time Xavier was talking. He said it was like the whole room warped and bled into the T.V., and all three of us were sitting in the boat with the fishermen on T.V. as first-person participants.</p><p>Then he said his focus got drawn back into the room, and he was hearing Xander and I talk, but there was a bigger set of us above us doing the same thing, and a bigger set above that set, and so on and so on, so that the scene was going on simultaneously on several different levels all at once, like a Chinese puzzle box, where you open the box, and there's a smaller one inside, an a smaller one in side that one, etc... And we were the smallest, inner one, and at that moment he said he felt we were all just this miniscule speck, which was one small piece of a larger puzzle we were all a part of. Needless to say, after he resurfaced and gave up the journey for that night, he was way more serious, and not messing with people. He described (some hours after his experience) that he felt that he remembered having done that before, exactly like dj vu, even though it was his first time. Later on, he questioned whether the experience was a hallucination, or if the experience was actually real, and the Salvia just opened the doors to perceiving what is always there but we can't see. On some level, I found his argument persuasive.</p><p>At this point we were out of fortified leaf, but I still had a little less than a half-ounce of the tincture. Xavier said he'd pass on the liquid, because he figured it would taste like shit (and BOY, was he right), so Xander and I decided to split the dose. Each one of us took five dropper loads and diluted it to four droppers of water and held it in our mouth for 20 minutes. This was listed on the dose sheet as being a dose between moderate and strong. It still burned the shit out of my mouth, even diluted.</p><p>At about the 15 minute mark, that same feeling began to come on, except there were far less visuals. There were some, like a diminished perception of the plasma again, but not real vivid hallucinations. The effect was more emotional/feeling-based. For me, I got the same annoyance over the T.V. and the ceiling light as I got coming out of the smoking experience, so I got up and killed the light. Xavier was watching T.V., so we left that on. I got the hot flash again, and a strong desire to leave the room. I felt the room was a cage, and I wanted to go outside and experience open nature under the moonlight. So I got up and went outside. The moon with clouds passing over it was phenomenal! I was in awe over what I perceived to be a sharpened perception of things, sharper sight, sharper hearing. It was like I had the senses of an eagle or a wolf or something.</p><p>I needed to pee, so I dropped trow right there beside a wall in the moonlight and started to pee. For some reason, I thought.. 'what if the neighbors see me?' And I saw the whole situation from the outside looking in, as if I were the neighbor seeing myself there holding my pecker in the moonlight, and the image of that made be begin to laugh out loud. :-) I tried to hold it in, but it was hilarious, and I accidentally spit the Salvia juice out during that surprise laugh all over my shirt. :-) So I took my shirt off, wiped up, and went inside. When I went inside, Xander was passing in and out of a somnolent (sleep-like) state. He asked if he could swallow the juice, and I said yes. His eyes looked almost shut. He'd go to perform an action, like drink some drink, only he'd pass out and freeze in a given position for a second. I'd nudge him to re-orient him, and he'd pick up where he left off without missing a beat like nothing happened!</p><p>At one point he went to light a cigarette, and I said 'Don't light that, man, you're passing out.' And he looked at me and said 'You must be hallucinating mutherfucker', and he kept on doing it. Strangely enough I had to stop and consider whether or not I really was hallucinating it, so I asked Xavier to watch him, and Xavier confirmed it was not just me. By the time Xander had the cigarette in his mouth and lit, he had passed out and re-oriented like 5 times! It must have taken him 15 minutes to light that cigarette. At that point, I decided to turn the lights back on to reorient Xander so he didn't burn the freaking house down, because he was completely unaware of fading in and out of consciousness. My subjective feelings were that I was on the threshold of a meaningful experience, but the whole exercise had been a waste, because I could already feel myself coming down. It was frustrating. The effects had been mostly somatic (physical). It didn't matter, really, because at that time, my concern was over Xander.</p><p>Now, here's where the uncoolness starts. When we turned on the lights, we both noticed that Xander's eyes were really, really puffy and seemed a bit lazy. Sometimes they didn't appear to be working together very well, like one or the other was lazy at different times. His speech was a little slurred, and I immediately noticed these effects as the effects described in Hoffman's text about the Mazatec Curanderos. On the other hand, I had taken the same liquid dose, and I was completely straight. We asked him what he was seeing, and he said he was seeing double. At times he would shake his head, as if trying to shake it off, but he couldn't do it. Xavier started talking to him about his eye condition, saying 'Man, your eyes are fucked up. It's like one is moving without the other man! Like when you used to take that Topamax shit..'. I was cringing inside, because I could see Xavier's comments increasing Xander's anxiety which could eventually create a bad trip.  I was also a little worried about Xander because I knew he was under the influence of other drugs, and I assumed this must be a side effect of interaction, since I did not have it.</p><p>So I created a way for him to center his vision. I had him close his eyes, move them around under his lids, then open them, and that seemed to restore their dual-use, but only for moments at a time. At one point we established that when objects moved, he saw only one of them, but when they were still, 'Two bongs... Two sun pictures... Two chairs...', etc...  He also said there were two of me, so I invited him to trace the line of my glasses. He traced my brow. Then when he found the glasses, he said .. 'that's wierd, because they're here..', and his anxiety increased. I reassured Xander that the effects of the liquid wouldn't last more than a couple of hours, that he looked like a champ, and it wasn't shit, just to lay back, close his eyes, and tell me what he saw. At one point he said he saw a row of locks stretching across his field of view, with keys in them. At another point he said he saw a nurse, which was probably a symbol of his unconscious fear of having damaged himself psychologically and needing medical attention. That scared him.</p><p>So I sat with him for a while, and under the influence, he said it was somewhat like mushrooms, only the liquid Salvia gave less visuals and more body sensations than smoked Salvia, and without the laughter of mushrooms. When I asked him what he saw, he just kept saying 'seein' double...'. After about two hours, I was fairly assured that he was ok. He said he was ok, although still with distorted visual effects, and that I should go home and go to sleep. When I left Xander, I was less concerned about his side effects, since his trance state was improving by the hour and I was sure it'd pass in time. I was more concerned about fire safety. He promised not to smoke, and I went home to go to bed. We started this little adventure at 9 p.m., and it was now 3 a.m. Let this be a warning to those thinking of mixing Salvia with prescription psychological medications or other psychotropic substances... DO NOT MIX SALVIA WITH OTHER DRUGS. IT INTERACTS UNPREDICTABLY. You have been warned.</p><p>The next day, I missed church because I was up so late. So, in comes Xander after church, looking just fine and showing good orientation and eye movement. He said he had no ill effects from the Salvia, but had passed out with his forehead on his computer keyboard and woke up like that in the morning. He explained that he had a slight moment of double vision that morning, but after he dropped a Dilaudid for his back, it went away and never came back. Funny thing is, he had a wafer and a juice cup with him. He said he had taken communion and repented for his trip, and felt compelled to give communion to both of us as well. So, although I found that a little strange, I agreed, because I believe anything done in remembrance of Jesus is a good thing. So Xander gave communion to Xavier and I right there in Xavier's bedroom, complete with cracker, little cups of juice, and all. This may have been the entheogenic potential of the substance coming out in Xander, or it may have been an expression of Xander's guilt over having done something he percieved as unclean.</p><p>In any case, it seemed the experience had affected him dramatically in a way he hadn't expected, and this was his way of setting it right and making sure it was right with us as well. As a Christian, I thought it was a good way to thank God for a safe experience and ask His forgiveness for monkeying around in His domain, although I had prayed before taking the Salvia, and never had any anxiety, unpleasant effects, or guilt from the experience.</p><p>This experience has provoked a great deal of thought in me. I marveled at the similarity of our experiences, and how similar they were to the 'tunnel' people describe seeing during near-death experiences. I thought Salvia might be a key to unlocking the door to perception of the unseen spirit world. Although we never saw the intelligent entities that so many people describe, that is because we prayed for Jesus to protect us. It would not surprise me how an unsaved person could be visited by spirits in this condition, which is an extraordinarily dangerous state of affairs, since demons never come right out and say that's what they are.</p><p>I was expecting an entheogenic experience, i.e., to feel closer to God. While I did have a pleasant, profound, and stimulating experience, one thing I did not have was a dialogue with God while I was under the influence of Salvia. It was interesting, challenging, and stimulating, but I did not hear from God. Ironically, I did hear from God the next day, in that usual still, small voice of His which my sober mentality is affectionately familiar with. And what he said was this, He said that I don't need a plant to get closer to Him, because as a saved Christian, I am as close to Him as I can ever get. And it wasn't a plant that got me there, it was the blood of Jesus Christ, shed for the remission of sins to bridge the gap between imperfect me, and my perfect Father in Heaven. He did not scold me or shame me for smoking the plant. He did not even say that it was wrong of me to do it.</p><p>But I did get the distinct impression that he was chuckling at me. Not with the harsh laughter of cynicism, but instead with a pleasant giggle, similar to the way a loving parent would react watching their child have an imaginary conversation with the President of the United States on his very favorite plastic toy Fisher-Price telephone. And after taking a hard look at myself, I chuckled too. And more than the bread, more than the juice, and more than the Salvia, for me, that is what made everything ok.</p>",
 "year": "2002",
 "id": "14953",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-15T08:00:00.000Z",
 "views": "18946"
}
