{
 "id": 14957,
 "title": "An Unexpected Dissociative Night",
 "date": {
  "submission": "2005-04-01T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dave",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "[Erowid Note: Some authors report suspicions that their cannabis has been 'laced' (adulterated), in some cases presumably with PCP. While this is possible, readers should be aware that idiosyncratic response to the effects of cannabis (usually higher doses) can lead some users to presume their cannabis has been 'laced'. While it is unlikely that the cannabis in this report was adulterated, there is no way to know for sure.]",
  "Last night I was going to smoke some grass, which I had been smoking for a while, but my dealer had told me that there are two different strains in my bag and I was trying the one I hadn't used. I took two 1 gallon Gravity bong hits, which is usually enough to completely floor me.  Soon I began to get very stoned, and was just sorta hanging out with my friend, when I began to notice something very different and wrong. Whenever I looked around my room, it was like my eyes were a camera lens, everything was in very sharp focus as well. I felt very odd in my body all of a sudden, my external limbs and so forth were being controlled by someone else it seemed. It was as though my mind and thoughts were trapped in someone's body, I guess that is the definition of being mildy dissociated, but it really started to scare me. I am very adept at talking myself out of panic during a high because I used to have panic attacks, but this time I was really starting to freak out. The way in which this drug makes you feel is sort of like what happens in being John malkovich. All your thoughts are spoken in your head, there is no quiet thinking.",
  "So by now, I think I was cold because my limbs were shaking a lot and the shivers were manifesting themselves in a very odd manner. All of these things were scary, but not enough to make me freak out. When I closed my eyes in bed, it was like every inch of my skin touching anything was always aware of it. Usually when the body has had the presence of a stimulus for a while, it tunes it out (e.g.- a clock ticking, I quickly don't hear the ticks anymore) but on PCP all your senses are overloaded and alert. It's very odd to just be inside a big body, not entirely unpleasant, but not something I'd like to do again. I took some alprazolam (.5 mg) to calm myself down which helped a lot. Being 'dissociated' makes me feel like it is impossible to go back to being normal, and that's what really started to bother me. It didn't feel like I'd be able to sleep, and for a while I thought that if I went to sleep I'd just die. Luckily I had my best friend on hand who helped me out when I really needed a reality check. Throughout most of the plateau, I was actually fervently reading PCP user reports, which helped so much. I just thought my brain had snapped and made me somewhat insane.",
  "Eating and drinking weren't that hard to do, but I seemed to get a short stomach ache from the milk (or oreos) that I was eating. Some mylanta cleared that up so I started watching 'A very brady sequel' which was able to take most of the fear and edge off. I was still inside looking out (tunneling?) but I wasn't scared, just hanging out. I fell asleep pretty fast and had some crazy dreams. I am writing this the morning after (approx +11 hours after ingestion) and I still feel mildly dissociated, but not stoned or anything, just a little different. I can still function fine, but life is more like virtual reality than life. It looks kinda the same, but I wouldn't consider myself normal right now. Some reports say this can last for a good while, I don't really look forward to feeling like this for much longer. All in all, I am glad I now have a dissociative under my belt, there is really nothing like PCP, you kinda have to do it to understand it, but would I do it again? No, no I wouldn't.",
  "I'd just like to add that the portrayal of a PCP high in 'Training Day' is surprisingly accurate. Good luck and happy tripping!"
 ],
 "erowid": {
  "id": "24518",
  "citation": " Dave. \"An Unexpected Dissociative Night: experience with Cannabis ('with PCP') (ID 24518)\". Erowid.org. Apr 1, 2005. erowid.org/exp/24518",
  "substance": "Cannabis ('with PCP')",
  "views": "5546"
 }
}
