{
 "title": "The Good, The Bad, and The Ugly",
 "author": "Caleb",
 "citation": " Caleb. \"The Good, The Bad, and The Ugly: experience with Paroxetine (ID 14958)\". Erowid.org. Aug 5, 2005. erowid.org/exp/14958",
 "substance": "Paroxetine",
 "bodyweight": "190 lb",
 "report": "<p>I started taking Paxil a while back to try and treat my OCD (Obsessive-Compulsive Disorder). I had previously tried Zoloft and despite working my way up to the high dose of 150 mg a day, it never did a thing for me. I was taking it every day for a few months but I could have just as easily been taking a sugar pill. I told my doctor this and he suggested Paxil, so I started taking 20 mg and then went up to 40. Paxil did not really work in treating my OCD, however, it did a LOT of other things. On the good side, it decreased my social anxieties big time. The awkwardness and anxiety of being around strangers and interacting/expressing myself to others was gone, for the most part. I was quite happy with this, it changed my life in a big way. But my OCD was still as present as ever. So my dosage was increased to 60 mg per day.</p><p>By now, I had noticed a number of unpleasent side effects. First of all, the sexual side effects that seem to accompany all SSRI's. My orgasms had become seriously delayed, and on 60 mg it was almost as if I was impotent. I also began to notice some constipation, which also increased when I moved up to 60 mg. I also began doing a lot of sweating, for no particular reason. But I stuck it out and eventually moved up to 80 mg a day. This was not a good idea. I became VERY irritable and anxious, and the previous side effects increased. I came to the conclusion that Paxil was not worth it, it was doing *something*, but not what it was supposed to be doing. So I stopped taking it, didn't feel any withdrawal effects at all, luckily. Now that I'm off of it I realize it was doing even more than I thought as far as side effects go. For one, it erased my appetite. You can decide for yourself whether that is bad or not. Also, I believe it made me a bit emotionally shut off.</p>",
 "year": "2002",
 "id": "14958",
 "gender": "Male",
 "timestamp": "2005-08-05T07:00:00.000Z",
 "views": "11901",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  }
 }
}
