{
 "title": "Add It Up",
 "author": "S.W. Bloch",
 "citation": " S.W. Bloch. \"Add It Up: experience with Amphetamine (Adderall) (ID 1496)\". Erowid.org. Sep 7, 2000. erowid.org/exp/1496",
 "substance": "Amphetamine (Adderall)",
 "bodyweight": "215 lb",
 "report": "<p>A combination of two remarkably powerful amphetamines, which make up Adderall, literally made me feel as though I commenced evolving-- physically, sexually, spiritually, and cerebrally, beyond all other human forms. It completely enveloped my life between July 1999 and February 2000, in one-week-binges each month (respectively). The bottles that were supposed to last one month each never even came close. Rarely letting myself come down, I popped them like there was definitely no tomorrow. And at the rate I was going, that was not far from the truth.</p><p>Of all the many drugs I've taken, heroin and cocaine included, Adderall is without question the most euphoric and the most addictive substance I've ever taken into my body, mind, and soul. I truly did not know a substance could be so addictive or euphoric, and this is coming from someone who has tried many other reckless delights.</p><p>For me, overdose has probably never been so conceivable or imminent with any other drug. A few times, I thought I was coming very close, with my heart feeling like it was going to pop out of my chest and say to me 'you're fired!'</p><p>Socially, I would do one of the following: extend myself to everyone around, becoming Mr. Socialite-- witty, intelligent, and fluid in every way....with everyone intrigued; or I would withdraw, being more than shy, but bitter and resentful, preferring to just be home alone and sit. Paranoia wasn't uncommon either, because at higher doses, I usually began to hallucinate, and my mind is screwed, if anything, too tightly on these shoulders.</p><p>At work, I seemed to be a little more efficient, but extremely anal about keeping up the store, more so than with caffeine or even speed. I often wonder if anyone at work knew. If they looked into my eyes, it was unmistakable.</p><p>But by far and away, my most unusual effects were the dramatic change in physical sensitivity, especially sexual. And my absolute favorite thing to do on the stuff was, you guessed it, masturbate. Please, pardon my bluntness. I could do it several times longer than I normally could. Once, I believe I must have gone at it for 12 hours, using up all the lubricants, shampoos, cooking oils, and even toothpastes I could find in my home, even fruit preserves. I never felt alone doing this either.....always feeling like there was a lovely female presence in the room. So I was completely shameless about it. Atypical at best, I could even hear voices! During this time, it was usually women moaning that I heard. And sometimes the drug made me so compulsive, confused, and neurotic that I once cleaned my rather filthy body using dozens of paper towels rather than just stepping into the shower! I became so speedy mentally that my body could not keep up. I became ineffecient, paradoxically to the initial effects. I would spin my wheels, going nowhere oh so comfortably. This was the type of madness I engaged in-- on a drug that was supposed to improve my retention when reading!</p><p>Apparently different from its two half-brothers: dextroamphetamine & methamphetamine, this haphazard combo-deal gives even the most experienced drug user a bit more than he bargained for. Picture the stimulation of about 50,000 cups of coffee, the relaxation, at times, of Valium or Xanax, the aesthetic but frightening hallucinations of LSD or Psilocybin, the sexual arousal of Viagra, and the bliss & empathy of ecstacy (MDMA) all combined in one little pink (or blue in the case of 10 mg doses) pill, which has a sweet & sour to it that reminds you of candy melting in your mouth like M&M's.</p><p>.....And they give this shit to hyperactive children and adults! The psychiatric establishment is really redefining irony writing this prescription, which I myself used to have.</p><p>I can only be grateful that Ritalin was all that was available to those with my 'disability' back when I was a youngster.</p><p>I wouldn't expect this compound to be legal for more than another 5 to 10 years with the clash of these two stimulants turning up such unpredictable effects, it's bound to earn more media attention in the next few years....not good press suffice it to say. I'm actually surprised that, with our paternalistic laws, it was synthesized to be legal in the first place.</p><p>USE WITH EXTREME CAUTION</p><p>....IF AT ALL.</p>",
 "year": "2000",
 "id": "1496",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-07T07:00:00.000Z",
 "views": "86250",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 }
}
