{
 "id": 14985,
 "title": "My Personal Best",
 "date": {
  "submission": "2007-05-06T07:00:00.000Z",
  "experience": "1994-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Patrick",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Mushrooms"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "g",
    "grams": "1.0",
    "quantity": "1.0"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "This is the story of my own most memorable trip, out of approximately 100 trips. This trip was the culmination of several years' effort to achieve a full 'visionary' experience, as opposed to simple 'visuals' like breathing walls or transient faces in the clouds.",
  "In middle school, I had a precocious interest in psychedelics and mystical states. I read Hoffman's 'LSD: My Problem Child,' and Huxley's 'Doors of Perception,' and became intensely interested in exploring those states for myself. Through high school, I had several experiences with LSD, all of which were low to moderate dose, and not particularly meaningful. After I graduated high school, I read some more about mushrooms, and decided that I wanted to experiment with those. I aquired putative shrooms several times, but they either were not psilocybin shrooms, or they were extremely weak, producing very little perceptual or cognitive effect.",
  "Finally, a friend aquired some shrooms unlike any I had seen. They looked like something that would have grown on mars. Clean, white stalks with reddish, Hershey Kiss-shaped caps. He was a trusted source, and assured me that even a single gram was sufficient to produce a strong effect. Finally, I was going to be able to perform the experiment I had thought of for years.",
  "The trip took place at a friends apartment, with 4 other people. The atmosphere there was emotionally comfortable and physically safe, with minimal paranoia-inducing potential. His living room ceiling was strung about with colored christmas lights, and was otherwise dimly lit. The dosing was as followed: I made tea with about 3-4 grams, and about 15 minutes later, I ate 1-3 more grams. The others took much less. My best friend took a single gram.",
  "I paced the kitchen, waiting. Approximately 30 minutes later, I felt a heaviness coming over my body, and a slight diminuition in coordination. My palms started to get clammy and sweaty. There was nausea, but it was not terribly bad. I don't think I vomited that night. I knew 'it' was coming, and coming hard. However, though the paranoia was there, it was surprisingly minimal. By about +45 minutes, the net effect of nausea, discoordination, and heaviness prompted me and the rest of my friends to sit on the couch.",
  "My friend said in a quiet, calm voice: 'Patrick, close your eyes.' I did. There were violets and greens, fairly subtle at first, but getting more and more immersive. Then we smoked cannabis, which launched us on our way. I kept my eyes closed for most of the next four hours. I 'saw' so much during this time, that it would be impossible to describe it or remember it all. There combination of lights outside and lights inside produced an indescribably beautiful display. Of course, it was constantly moving, morphing, changing, mostly abstract geometry, reminscent of the Mandelbrot fractal, but also concrete, distinct objects like buildings, and people. I literally gasped and sighed at the beauty of it all.",
  "At one point, we put on some music, Dead Can Dance. Interestingly, our group trip followed the music. With out eyes closed and the music approaching a crescendo, all of us would simultaneously exclaim: 'Whoaa!' I don't know if we were all seeing the same things, but clearly for all of us the trip was synched with the usic. When I focused my attention on any part of the display, that part of the display would morph and complexify, unfold like a flower into something else. It was fantasmagoric.",
  "There was a part of the trip that was very much like a near-death experience. I was 'moving' though this beautiful, multicolored tunnel. I knew full well that I was in a body on earth, but the sensation behind closed eyes was of moving though the tunnel. Finally, I felt like I had arrived 'somewhere.' It was a dark, warm space. The visual display was changed. I identified this space at the time with the O, the Not, the Gnostic plenum, a nothing that anything could come out of (intepretations I now think are dubious). Tears came to my eyes. It was the only time in my life when I wept for joy. I felt reborn, perfectly in control of my experience.",
  "At this point, all of us opened our eyes, and continued the trip in its new phase. I noted that my friend, who ate only a single gram, was very obviously tripping. But none of us felt impaired. In fact, my verbal abiities were greatly increased during this time. We continued to marvel at the effects. I held a candle near to the wall. Around the cangle flame was a beautiful halo, a rainbow, with geometric cells. I could not determine if these were actually features I was percieving, of if they were artifacts created in my brain, but they sure seemed like features 'out there' that I was seeing for the first time.",
  "As I lay down later, I had extremely vivid visions of real-world objects. Cartoons, animals, places, people. They were remarkably detailed. For instance, I could visualize my girlfriend's body in great detail. This I found and still find deeply interesting. It seemed very obvious to me that someone who is epistemologically naive could easily mistake such things for visions of gods and spirits. Though I haven't used psychedelics in years, I would consider another journey with the right shrooms.",
  "Thanks for letting me share my experience with you."
 ],
 "erowid": {
  "id": "24599",
  "citation": " Patrick. \"My Personal Best: experience with Mushrooms & Cannabis (ID 24599)\". Erowid.org. May 6, 2007. erowid.org/exp/24599",
  "substance": "Mushrooms & Cannabis",
  "views": "2881"
 }
}
