{
 "title": "Herbal Stimulant Cocktail",
 "author": "MomeRath",
 "citation": " MomeRath. \"Herbal Stimulant Cocktail: experience with Ephedra sinica, Guarana, Yerba Mate & Yohimbe (ID 14990)\". Erowid.org. Mar 23, 2006. erowid.org/exp/14990",
 "substance": "Ephedra sinica, Guarana, Yerba Mate & Yohimbe",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Guarana",
   "(tea)",
   "",
   " ",
   "oral",
   "Ephedra sinica",
   "(tea)",
   "",
   " ",
   "oral",
   "Yerba Mate",
   "(tea)",
   "",
   " ",
   "oral",
   "Yohimbe",
   "(tea)"
  ]
 ],
 "report": "<p>I have always been interested in drugs and altered states of consciousness, but not being very enthusiastic about getting arrested, I have been trying to seek out legal alternatives to experiment with. </p><p>I procured some herbs from a local shop: an ounce of guarana, ephedra (ma-huang), yerba mate, and yohimbe. I tried all of the herbs by themselves in various doses as a tea, and also mixed them together in different amounts.</p><p>I make the teas by crushing the herb into a powder (if it isnt already), steeping the desired amount in hot water for about 10 minutes, and then filtering it through a cheese cloth/old tee-shirt/whatever.</p><p>Guarana I find to be only slightly stimulating in doses around 1-3 teaspoons in a cup of water.  It tastes surprisingly good (compared to some other herbs), and the effects are about the same as a strong cup of coffee.  On one occasion I increased the dose to around 4-5 teaspoons and the effects were unpleasant, like too much caffeine.  Guarana also tastes pretty good and adds some extra kick to a cup of coffee if you throw in a teaspoon or so. For this herb Id stick to low doses for a nice coffee alternative, unless of course you are fond of caffeine jitters and anxiousness.</p><p>Ephedra is fun.  I usually take a dose of 2 teaspoons in a tea, which is stimulating, but not as edgy as caffeine.  It doesnt taste great but its bearable.  Im not sure of the ephedrine content of the dry herb, so I have not tried very high doses, but it is an enjoyable experience nonetheless</p><p>Yerba mate is a wonderful herb, it tastes great and I have never had a bad experience with it even at very high doses.  I think its supposed to have caffeine in it but I have never had the anxiety that I associate with caffeine.  The stimulation is very pleasant.  It gives me a clearheaded feeling rather than just a speedy sensation. I drink at least two cups of Yerba a day, usually about 5-6 teaspoons. Its supposed to be pretty nutritious too, so I highly recommend it.</p><p>Yohimbe is strange.  I have had a couple bad experiences with it, and a couple really good ones.  At a dose of 1 teaspoon its stimulating and kind of euphoric, at 2 teaspoons the feelings of euphoria and stimulation increase.  But a couple times I overdid it, taking 3+ teaspoons is generally unpleasant.  Racing heart and nausea usually occur.  This doesnt taste too bad either, but Im going to stick to low doses from now on.</p><p>I have also mixed these herbs together, using Yerba Mate as a base for the tea and adding about 1 teaspoon of guarana, ephedra, and yohimbe.  This may be unwise, because it is probably fairly unhealthy to mix all these stimulants.  But in any case, the tea taste good and is very stimulating, great for staying up and writing or studying.  But  I am a big boy of 250 pounds.</p>",
 "year": "2001",
 "id": "14990",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-03-23T08:00:00.000Z",
 "views": "24304",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Guarana",
   "form": "(tea)"
  }
 ]
}
