{
 "title": "Nothing Like it in the Drug World",
 "author": "Nicole Sylva",
 "citation": " Nicole Sylva. \"Nothing Like it in the Drug World: experience with Dimenhydrinate (Dramamine) (ID 15)\". Erowid.org. May 31, 2000. erowid.org/exp/15",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "8 tablets",
  "oral",
  "Dimenhydrinate",
  "(pill / tablet)"
 ],
 "report": "<p>I unfortunately happen to be one that really enjoys the Dramamine experience and so I have done it more times than I have done acid and shrooms combined.  It is probably the most dangerous drug I have done and I did it (at a young age) caused both my body and my mind harm in doing so.  There is nothing out there right now that would come close to a good Dramamine trip and as much as I would love to trip 'a good one' at least one more time, I honestly don't think my body could handle it.  Anyway, I would like to indulge you on the first trip I ever had that was on 8 pills of the older Dramamine...</p><p>I was barely 14, a freshman in High School, and I wanted to do every drug I could get my hands on.  I had already done a lot of them.  Two of my friends had heard of tripping on Dramamine, and at first I didn't think that was much of an interesting concept, but I wanted to give it a shot.  So we each took eight pills.</p><p>It took a while to kick-in, but after about 15 minutes I began seeing flat items as three demencianal.  Then things became unreal, I was sitting at the kitchen table and looking at the wood patterns on the table. I could see the shapes forming faces that would move and I felt they were trying to scare me and cause me to have a bad trip so I told them not to try and scare me because I wanted to have a good time, and at that time that seemed normal.  There was writing on the table that wasen't really there and I was trying to read it out loud, but as I would follow the sentances with my eyes the parts I had just read would change, so I gave-up.  Some how, I made it to a chair in the living room.  In all the Dramamine trips I have been through it has always been the case that I would find somewhere to sit or lay and would not be able or even think of moving my body.  In most cases my mouth would often hang open while I mouthed words that I would not speak.</p><p>Anyways, in this chair I started passing out and then waking up and passing out again, yet I couldn't tell the difference.  My eyes would close yet I could see through them and so I wouldn't notice they were closed until they opened.  I sat in the chair with massive hallucinations, there was a non-existant party going on where I was having conversations with people who weren't there and I was mouthing words that weren't coming out. I could hear them in my head and the false person I was talking to could hear them too, but later my friends told me that I was just staring and mouthing.  The TV in front of me was actually turned off, but in my little world there was a remote in my hand and I was watching the TV and changing the channels, when a porn came on the imaginary station I couldn't change it back and kept talking to my friends about how disgusting it was yet my friends were already passed out on the couch (another thing that happens, you always knock right out in the end).  I would pass-out and be in my friend's mother's van driving down the road and talking to friends in the van, and then my eyes would open.  The whole time, I didn't once think, 'God, I'm fucked-up!'  because you don't think when you are tripping on it, you just are, and everything just is.  You don't think about your friends or yourself or that you may get in trouble, you just are.  After about 2 hours of intense tripping (at least thats the best estimate of time I can come-up with) I passed-out into a dead rest, and while I was sleeping I was still tripping.</p><p>There were many other times that I tripped on the drug and a lot of the times it was unpleasent.  If you trip good, everything is fine and you wouldn't notice if it wasn't, but if you don't trip than it is hell.  My heart almost exploded once, and it scared the shit out of me, I had been using Dramamine too often and it was ruining my heart.  I now have heart problems (palpitations, I come close to fainting, rapid heart beats, etc.)and stomache problems, and I haven't been quite right since my period of Dramamine facination.  I think that everyone should try this drug at least once because there's nothing like it (you probably don't know what it's like to be totaly fucked out of your mind until you've tried it), but I also don't think so, because the experiance is risky and can do a lot of damage.  Yet there is nothing else like it, and believe me I love my drugs, but this one scares me and it is too risky.  It is more than an acid trip, shrooms or ether, but besides the pysical risks, the TOTAL and utter detachment to reality is dangerous.  Be prepared.</p>",
 "year": "1995",
 "id": "15",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-05-31T07:00:00.000Z",
 "views": "37097",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 tablets",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 }
}
