{
 "id": 15019,
 "title": "One Seed",
 "date": {
  "submission": "2003-06-24T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "rautavaara",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 seed",
   "administration": "oral",
   "substance": "Turbina corymbosa",
   "form": "(seeds)"
  }
 ],
 "report": [
  "[Editor's note: Rivea corymbosa and Turbina corymbosa are synonymous.]",
  "the subject aquired 10 seeds of rivea corymbosa from a local supplier here in vienna.",
  "one seed was coarsely crushed with a teaspoon, the crumbs were poured into a glass of water. the glass was kept in a dark place for about 25 minutes, occasionally stirred. the water was filtered through a coffee - filter.",
  "the end product was sipped over a timespan of around 45 minutes. the water was held in the mouth for some time before swallowing.",
  "this amount (1 seed, water - extracted with mediocre efficiency) produced noticeable, albeit not very dramatic psychotropic as well as peripheral effects (hands seemed a bit numbed, maybe just an illusion).",
  "the psychological effects are hard to be put into words, since they were quite subtle. it did have a little spiritual tonality to it.",
  "anyway, these tiny seeds seemed to be equipotent with the argyreia - nervosa seeds the subject has tried. i must confess, however, that the subject always employed very small amounts of a. nervosa (again, 1 - 2 seeds, cold water extraction for 10 minutes). this is because the subject is somewhat distrustful about the safety of LSAs for entheogenic purposes. rereading the abstracts dealing with ergonovin/ergometrin (probably the main active compound in these seeds) at PUBMED confirmed his cautious approach to these substances...",
  "***",
  "conclusion: the seeds of rivea corymbosa (the 'real' ololiuqui) should be consumed in the order of magnitude of 1 to 10 seeds, not in hundreds, like some sources state. some ethnobotanical fieldwork in the regions where ololiuqui is still used, as well as chemical analysis with modern techniques is needed to shed some light on this mysterious plant."
 ],
 "erowid": {
  "id": "24715",
  "citation": " rautavaara. \"One Seed: experience with Turbina corymbosa (ID 24715)\". Erowid.org. Jun 24, 2003. erowid.org/exp/24715",
  "substance": "Turbina corymbosa",
  "views": "44259"
 }
}
