{
 "id": 15016,
 "title": "What Could Be Happening to Me",
 "date": {
  "submission": "2006-03-23T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "insanity",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Diphenhydramine"
  }
 ],
 "report": [
  "The normal dosage for Diphenhyrdo (sleeping pill) is one, maybe two pills. One night me and my friends took 5. About an hour later I got up to move the car in and I felt like my head was just a sphere that was floating, no legs or even a body. The effects were mostly physical and not mental, it didn't change the way I thought just the way I felt.",
  "It has been done 4 times in the past. I now have not been able to sleep for days at a time. I will literally be up all hours of the day and night often happening more than once or twice a week. It doesn't matter when I have to wake up or go to bed. If I do sleep it will only be for a couple hours, and I will wake up very early and not be able to sleep again. When I am awake in the day I feel extremely exhausted all the time, very woozy, and I feel I am going insane because I am forgetting what the hell I was doing right in the middle of doing it. I used to never forget anything at all or find trouble doing any mental tasks. Now I am confused at some of the simplest problems. The worst part is the way my head feels, if you have ever been hit in the head really hard you will know what I mean, it feels like there is a wall of clay right in the back (it is weird but that is only where I feel it) of my head, and my thoughts are trying to get through, and either come out unclear and incoherent or just get 'stuck' there and I can't think at all. I have felt the normal effects of sleep deprivation before and it was just normal tiredness, nothing at all like this is.",
  "It has been going on for about almost a month now and hasn't shown any signs of recovery. This may be normal for some people but I have never felt anything like this before and I feel like I am in a different world with no way back to reality. and that is another thing, I keep having to stop throughout the day and question if I am really here or not, or if it is just a dream.",
  "If wonder if anyone knows anything about what could be happening to me. I will do anything at all to get back to normal."
 ],
 "erowid": {
  "id": "24702",
  "citation": " insanity. \"What Could Be Happening to Me: experience with Diphenhydramine (ID 24702)\". Erowid.org. Mar 23, 2006. erowid.org/exp/24702",
  "substance": "Diphenhydramine",
  "views": "27446"
 }
}
