{
 "id": 15020,
 "title": "Warming, Mild Giddiness, Euhphoria...",
 "date": {
  "submission": "2003-06-23T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "catfish",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 drops",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": "32 oz",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "MAOI",
   "form": "daily"
  }
 ],
 "report": [
  "This is a report on the effects of yohimbe tincture. I bought a Pausinystalia johimbe (sic) bark tincture, consisting of certified grain alcohol (70-75%), distilled water, dilute hydrochloric acid & Yohimbe extractives. It was purchased from a reputable health food store, so I was assured it was 'clean'.",
  "The recommended dosage is 30-40 drops 1-3X a day (20 drops = 1 mL). I took 30 drops in some kool aid, and my friend and I began to do arm curls. No, I am not some meathead jock, we were just trying out my new weights. Anyway, I didn't notice any effects for about 15 minutes, and then sort of a 'warming' sensation , followed by mild giddiness. I must say two things: I DO take a prescription MAOI, but have it on my doctor's authority that it is short-acting and I eat chocolate and drink beer all the time. The other thing is that I have used yohimbe bark before, and the effects of the tincture were more subtle than with the pills I had gotten from GNC.",
  "So we're lifting and watching a movie. I noticed a consistant uplifting body buzz, but nothing spectacular. During the course of the evening, I consumed 32 oz of beer, which added mild euphoria to the mix. When it was time to go to bed, my wife and I made love, and then I noticed a big difference. I have a strong appetite for sex, but it was definitely increased at least two fold. I felt more attentive, and the sensations were spectacular. Spinal chills, and pleasant throbbings. The experience climaxed, and the orgasm was neverending, or so it seemed. The volume and duration and intensity were at least three fold from normal.",
  "It was a little difficult to sleep, but I managed.",
  "My points are:",
  "1) to mix yohimbe bark with another, somewhat stronger MAOI seems to have beneficial effects in that it prolongs the duration of effect",
  "2) alcohol mixes well with this tincture",
  "3) sexual enjoyment was definitely enhanced considerably",
  "4) doc says also releases testosterone into the blood and it would seem true.",
  "I do not recommend messing with yohimbINE, however. It is a prescription drug for a reason where I am from."
 ],
 "erowid": {
  "id": "24719",
  "citation": " catfish. \"Warming, Mild Giddiness, Euhphoria...: experience with Yohimbe (extract) & Alcohol (ID 24719)\". Erowid.org. Jun 23, 2003. erowid.org/exp/24719",
  "substance": "Yohimbe (extract) & Alcohol",
  "views": "27474"
 }
}
