{
 "id": 15033,
 "title": "Black Out",
 "date": {
  "submission": "2003-10-02T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Washing Machine",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "oral",
   "substance": "Zolpidem",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "1.75"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "The experience that I am about to explain happened almost 2 years ago. My neighbor, who was my age at the time (17) used to give me 10mg Ambien pills for free. Apparently her mother had a script, but didn't take them. Well I had three at my disposal one night and had done some meth earlier in the day so was having difficulting even attempting to sleep (Time-1:20 a.m.). I figured I would take all three for a total of 30 mg, which I thought for sure would put me to sleep having been experienced with this drug previously. Well I was wrong, and I shouldn't have been so stupid since I knew that anything more than 20 mg for me comes with the possibility of 'blacking out'. By this I mean severe amnesia in which I cannot remember anything that has happened for many hours.",
  "The last time I remember that night is 1:30 a.m. After that it seemed I was instantly fast forwarded to morning and as i 'wake up' I find myself standing on a hillside not far from my house at 6:30 in the morning, smoking a cigarette, and tripping very hard (I also had some potent geltabs of acid stashed away too). I had not intended on taking any doses that night and wasn't even aware that I had until my ambien amnesia wore off. Now at the time I had a ten strip of acid and I started flipping out because I had no idea how much I took or at what time I took it, plus I had lost the rest of the acid (or took it all). I later found the cellophane they were in, it was at the bottom of the middle console in my car and the plastic was ripped like an animal had gotten to it. I was relieved to find I only took 1.75 hits, Which is strange dose, but i figure I was too out of my head to properly cut even doses. The trip was not at all pleasant, not because I freaked out or anything, but because i had no intentions of tripping, especially not on a work morning. I didn't even go into work and the trip finally subsided around 12:30 p.m.",
  "The reason I decided to write this report is to warn others how powerful ambien can be. I actually dosed myself, which i kinda think is funny now, but at the time I hated everything about it, especially being at my house with my parents home (not good) so early in the morning....I am very surprised they didn't notice something was up. Anyway that's about it...just remember ambien is a very strong drug not to be taken lightly (I have boycotted the substance ever since) and LSD too, is a very strong drug that is not so fun when taken at unappropriate times and unintentionally. Hopefully this report may prevent a similar instance for someone else, because I think my situation had the potential to be very very dangerous in perhaps different circumstances",
  "PeAcE******************************"
 ],
 "erowid": {
  "id": "24751",
  "citation": " Washing Machine. \"Black Out: experience with Zolpidem (Ambien) & LSD (ID 24751)\". Erowid.org. Oct 2, 2003. erowid.org/exp/24751",
  "substance": "Zolpidem (Ambien) & LSD",
  "views": "30969"
 }
}
