{
 "id": 15034,
 "title": "Faerie Land",
 "date": {
  "submission": "2007-10-12T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Pilgrim",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "I have heard and read a lot about salvia. I had the good fortune to have someone give me the rest of ther bag after she had a less than satifactory experience. I waited a while before trying it. A buddy that I usually take these excursions with was in town from NY. He had never experienced this plant either. It was decided that we would make a water bong from a Coke bottle and smoke some that night. After the usual blundering and stumbling associated with stoned bong building(although it is part of the fun), we had a fairly good piece ready to use. We went in my room, I loaded a medium sized bowl and sucked it down.",
  "I had the usual heavy hearted rush from committing to something new, but that was the extent. I remembered that holding in the smoke was suppossed to help. Again I tried, this time with a larger bowl, and stronger lungs. This is when the experience delved into one of the most realistic hallucination experiences I've ever had. I lay back on my floor and stared at my ceiling. The ceiling slowly disappeared, and green ivy and organic plant material spilled over the tops of my walls, and climbed down toward the carpet. Inside the plants were small faces and beings rummaging around, looking at me, giggling and 'speaking' to me. Where the ceiling was, there were small winged creatures flitting around. There was no fear. Just absalute fascination and awe. I felt totally comfortable with my new surroundings. I belonged there. I felt like this was shown to me to let me know that this 'other world' is always there. Not so far away. We just don't see it. Slowly I came out of it. My friend from NY said I was asking 'Where are you going?' to the air.",
  "I think this plant reacts amazingly well with some people and with others, it can probably be terrifying. Not 15 minutes after my beautiful, green visitation, I watched over my friend as he had a fairly severe experience. His was very industrial, metallic, and terror based. Very interesting. I have yet to use the rest of that bag.",
  "As a side note, both of our heads cleared up fairly quickly except for a cold feeling that lingered with us for about an hour. That was put to rest with the small but alway potent combination of marijuana and The Simpsons."
 ],
 "erowid": {
  "id": "24752",
  "citation": " Pilgrim. \"Faerie Land: experience with Salvia divinorum & Cannabis (ID 24752)\". Erowid.org. Oct 12, 2007. erowid.org/exp/24752",
  "substance": "Salvia divinorum & Cannabis",
  "views": "2556"
 }
}
