{
 "id": 15035,
 "title": "Nightmares Caught Me Off-Guard",
 "date": {
  "submission": "2009-10-26T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nova19",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:00",
   "amount": {
    "number": "75",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Trazodone",
   "form": "pill/tablet"
  },
  {
   "time": "0:30",
   "amount": {
    "number": "25",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Trazodone",
   "form": "pill/tablet"
  },
  {
   "time": "1:00",
   "amount": {
    "number": "1.5",
    "unit": "mg"
   },
   "substance": "Melatonin"
  }
 ],
 "report": [
  "I am very experienced drug user, although I am only 19. I am currently recovering from a lot of bad drug use, and consider myself somewhat of a psychoactives expert for someone my age, and I have done nearly any drug you would name.",
  "June 24th, early morning.",
  "My friend (we'll call him A) and I were up all night, until about 8:30 a.m. When we both still couldn't sleep, after trying to knock ourselves out with the chronic, we decided some trazadone might be in order.",
  "8:30 - J and I take 75mg trazadone each.",
  "9:00 - We boost it to an even 100mg.",
  "9:30 - Still not too tired, and still toking like mad, we decide to add in a little melatonin, hoping this will finally knock out the insomnia.",
  "9:45 - Lay down, listening to Radiohead's 'Hail to the Theif' while in bed trying to sleep, which I smoothly drift into.",
  "Noon-8:30p.m. - Consistantly waking up every 2 hours or so, due to very odd nightmares. Each of them, although I can't remember them all, had a distinctly uncomfortable feel to them. A very eerie feeling, like being trapped in a Silent Hill game...",
  "Comments: I didn't think too much of this until I talked to J the next night: he said he had woken up every 2 hours b/c of nightmares, and skipped the first 4 hours of school. What I am saying here is that I have taken trazadone consistently and at high dosages before, without this effect, ever. Same with melatonin. Cannabis does not affect my ability to sleep, and in fact keeps me from remembering any dreams. I dreamed fairly vividly last night, and I don't like the feelings associated with even THINKING about it."
 ],
 "erowid": {
  "id": "24768",
  "citation": " Nova19. \"Nightmares Caught Me Off-Guard: experience with Trazadone, Melatonin & Cannabis (ID 24768)\". Erowid.org. Oct 26, 2009. erowid.org/exp/24768",
  "substance": "Trazadone, Melatonin & Cannabis",
  "views": "9500"
 }
}
