{
 "id": 1504,
 "title": "Tripping Without Drugs",
 "date": {
  "submission": "2007-08-21T07:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "Retz",
  "gender": "Male",
  "weight": "80 kg"
 },
 "dose": [],
 "report": [
  "<p>[Erowid Note: Asphyxiating carries a number of potential risks including brain or eye damage, concussions (from falls), and death.]",
  "Me and some of my friends were spending time in a park and had a discussion about drugs. One of them said that he can make us trip without any drugs.",
  "One of us stood against a tree and breathed deeply for a while and then took a very deep breath another pushed down hard on his ribcage or actually just at the place where the ribs end. This rendered the subject immediatly unconscious. Then, after about 20 seconds he was awaken by slapping on his face.",
  "When I tried it, I didn't think it would work, but then suddenly I was in a meadow which glowed in yello and red, everything was extremely beautiful and funny. This seemed to last for ages. I must say that I have never felt such bliss ever again, although now I have tried both mushrooms and am a smoker of cannabis.",
  "Then the voices of my friends started to appear in the distance and I started to see hazy shapes dancing far away. And then, with a shock I woke up in reality with a kind of 'What's going on? Where am I?' feeling. It felt really terrible the first seconds as I was sad to lose images I had and also my hand was a little broken as my friends had failed to catch me when I fell down. Oh yeah, and what had seemed to me like ages was actually only a little less than 30 seconds.",
  "Allthough this sounds harmless (And we thought so as well) it actually isn't so, as a friend had the same thing done to him three times during one day and after that he could barely stand up, vomited several times in the evening and felt strangely paranoid for several days. This freaked us out and we have never tried it again.</p>"
 ],
 "erowid": {
  "id": "14651",
  "citation": " Retz. \"Tripping Without Drugs: experience with Hyperventilation (ID 14651)\". Erowid.org. Aug 21, 2007. erowid.org/exp/14651",
  "substance": "Hyperventilation",
  "views": "12695"
 }
}
