{
 "title": "Wyk Warrior",
 "author": "bErSeRkY",
 "citation": " bErSeRkY. \"Wyk Warrior: experience with Alcohol (Mead) (ID 15045)\". Erowid.org. Apr 7, 2005. erowid.org/exp/15045",
 "substance": "Alcohol (Mead)",
 "bodyweight": "180 lb",
 "report": "<p>I recently ran across a website that sells an authentic 'Viking Mead Kit'. Being an occasional home brewer, I decided to grab a kit and try it out.</p><p>I'd heard that one can just brew mead with honey and water, but the package I received contained additional unidentifiable [save for oak leaf and moss] herbs and seeds in a cloth satchet along with a container of organic orange blossom honey.</p><p>I added all of the ingredients and ~4.5 gallons of purified water to a 5-gallon glass jug. The jug was cork stoppered and placed in the closet. I came home from work the next day to a house filled with a sweet, bready smell. Upon inspection the jug had blown its cork and sprayed my clothes. This stuff was CO2 volatile! The airtight plug was exchanged for a clean mayonnaise jar lid which allowed the mix to 'burp'.</p><p>30-40 days passed and I invited 3 of my psychonaut friends over to quaff. I strained and decanted each of us 1 gallon. We hit the deep woods with our bounty and climbed into an abandoned deer hunting platform [20 feet off the ground].</p><p>We said our own individual drinking sayings and turned up. The mead was clear and astringent, almost effervescent with alcohol. It portrayed a lightly sweet berry aroma, although we couldn't discern why it would. A half-hour later, we were unexpectedly f*cked up. It is a unique and seemingly friendly ancient buzz, not a downer like beer, but more like a bubbly wine fuzzy-giddiness. I noticed we eventually started talking and laughing loudly and the fear of falling from the tree waned. </p><p>The spirit drinking being complete, we set about a 'Wyk' adventure which was comprised primarily of swaggering at large trees, yelling at the gods, and berserking on boulders. We knew that the spirits of Valhalla watched us as we praised their oft-used concoction.</p><p>The next morning did not bring the expected sharp hangover. Only a numb memory and bramble scratches described the previous Viking venture.</p><p>Don't drink and climb!</p>",
 "year": "2002",
 "id": "15045",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-04-07T07:00:00.000Z",
 "views": "10170",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 gal",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 }
}
