{
 "title": "Danger Zone",
 "author": "yari",
 "citation": " yari. \"Danger Zone: experience with Inhalants: Butane (ID 1507)\". Erowid.org. Sep 8, 2000. erowid.org/exp/1507",
 "substance": "Inhalants: Butane",
 "bodyweight": "85 kg",
 "header": [
  "DOSE:",
  " ",
  "inhaled",
  "Inhalants",
  "(gas)"
 ],
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>[Erowid Note: The '2-3 cans' per 'session' is a very large amount of butane and the author is unclear how long it took to inhale that much.  This is a very dangerous level of use and there are cases in which a single lungful of butane has caused death. (documentation pending, march 2005)]</p><p>a few years back iwas really enjoying life, casual drug use - smoking pot, chemicals at the weekends. then i embarked on a 4 year college course during which i was to be random drug tested, for the first few months i survived well without even drinking then i started getting bored and figured that gas (butane lighter refil) would be undetectable in drug tests.</p><p>Occasional cans increased to 2-3 cans in a session, maximum 3-4 sessions a week a few years into the course, halucinations good and pleasant to start with, no adverse phsycological effects, but as time went by things got scarier and scarier and i could be quite shaken by some of my visions at times (ghosts of the living and the dead, pseudo religous experiences, visions of heaven and hell etc) - still didnt stop, this was purely escapism from my mundane existemce that i had brought upon myself.</p><p>Eventually I started drinking heavily to avoid blasting gas and now im ok again - at least i dont do any drugs regularly (not even alcohol). no more gas ever again 4 me for i am still psychologically scarred by the life changing experiences which i had - ultimately for the worst - dont know if i will ever be fully back to 'normal' but im trying every day.</p><p>to conclude these words i say to anyone who reads this to avoid solvent abuse entirely - or suffer the consequences for the rest of your life. Word to the wise - get high on life (reality) - over and out.</p>",
 "year": "2000",
 "id": "1507",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-08T07:00:00.000Z",
 "views": "21593",
 "dose": {}
}
