{
 "id": 15082,
 "title": "Exploding Lymph Nodes",
 "date": {
  "submission": "2003-09-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Debaser",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:00",
   "amount": "9.0 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Mindset & Setting :",
  "(22 yr old male, ingested at his house, ingested out of boredom and a feeling of 'hey I guess it might make the day go by more smoothly!' God  was I ever so wrong.) First off, I take Wellbutrin twice daily. (SR 150 tabs x2) And on this date that I ingested the 4-ho, I had just taken my wellbutrin 2 hours prior.",
  "Big mistake.  Here's what happened....",
  "T+  hour : wow this IS kinda floaty and fun.  Gosh Golly I am havin a fun lovin time.",
  "T+ 1 hour: holy shit things are not so good.  I was paranoid about swollen lymp nodes in my neck already and I think they might be getting bigger (because of a reaction with the 4-ho-dipt sublingual yesterday at a microdose. 1 mg? I noticed they enlarged the next day)",
  "T+ 1.5 hour: god dammit!  I have lost all.  I can't do anything except lay on my bed with icepacks to lower my temp.  (It feels like im really hot..maybe that's only what i'm perceiving but hey it sure calms me down.) ",
  " \tSo yeah musings laying in bed:  Why exactly did you just ingest a chemical that you know so little about? You're an idiot Guinea pig fella.  Now your dying and nothing can save you.",
  "T+ 1.5 hour (still in bed): Ouch.  It hurts to move anywhere.  I'm getting shocks every time I move my head.  Whoever said this was a mild psychedelic good for first time users can go fuck themselves.  Ouch.  Ahh!!!.  If I try to stand up I get a head rush bigger than hoover dam compounding on my head.  My legs are filled with a mutated version of pins and needles.  My nerves near my knee joints feel sore and sore and sore.  My heart rate lying down is skyrocketed to incredible speeds.  Is this hypertension?  It sure is scary.",
  "T+2.0 hour: Still feeling unimaginable terror, tremors, pain shocks all over, and for a lack of a better word - stress.  I manage to concentrate my energy on getting to another bed in my house by a phone (in case I die, it would be a shitty site to see). Get to bed by phone.  Phone my close friend...got answering machine ' Hey so yeah I took that 4-ho-dipt. Im probably dying.  I can't do anything except ly in bed.  I have painful tremors all over my body.  Help.'",
  "T+2.2 hours: Prayed to God.  Said ' Look if you get me through this.  I will never do such irresponsible things to my body.  I will never touch another research chemical again. (** I kept my promise. Hey if I broke it with whatever else I'd ingest in the future.. I'd probably die as part of the 'deal' .. haha.)",
  "T+3.5 hours: Well I thought...if it hasn't killed me yet I'm probably fine.  Wish I had some ipecac...",
  "......Not much more to it.. After a few more hours I was back to calm seas.  I had major trails and felt like a complete idiot.  I mean I actually felt stupid.  I couldn't type worth shit on the computer.  I thought I had actually gotten dumber.  But then I thought...maybe it'll wear off.."
 ],
 "erowid": {
  "id": "26536",
  "citation": " Debaser. \"Exploding Lymph Nodes: experience with 4-Ho-DiPT & Wellbutrin (ID 26536)\". Erowid.org. Sep 2, 2003. erowid.org/exp/26536",
  "substance": "4-Ho-DiPT & Wellbutrin",
  "views": "24103"
 }
}
