{
 "title": "OTC Highs",
 "author": "Cope Head",
 "citation": " Cope Head. \"OTC Highs: experience with Dramamine; DXM (ID 15109)\". Erowid.org. Jun 1, 2002. erowid.org/exp/15109",
 "substance": "Dramamine; DXM",
 "bodyweight": "",
 "report": "<p>In my early days of psychedelic exploration I was as eager to try out new modes of being and ways of exploring the interface between reality and myself as I am now, but I had much less access to psychoactive chemicals. So, like many other people in similar circumstances I decided to explore the over the counter options available to me at the time. My only sources of information were my friends and acquaintances. The Internet didn't really exist yet, for the most part. There weren't any books I could find about the subject. But, I was brave and fairly foolish, so I didn't let my ignorance get in the way of my desire to explore.</p><p>My first OTC drug high was with Dramamine. A friend had told me about his experiences with it and it sounded good to me. He described it as 'like acid' when he'd taken twelve pills of this common anti nausea medication. One of my roommates and I went out and bought a few boxes. We each swallowed ten of the pills inside and waited for something to happen.</p><p>It took a while to come on. I was looking for acid like effects, of course. My roommate started feeling it first. He described seeing things jumping off the carpet. I wasn't feeling much at this point. Nothing moved or 'breathed' and I didn't feel particularly high. I did feel weird, however, and slightly uncomfortable.</p><p>My weird feeling escalated and I began to feel really fucked up. My roommate went off to bed and I sat in our living room smoking cigarettes and feeling weird. I started having conversations. I was alone, but I kept forgetting it. I'd be a few minutes into an exceedingly odd conversation and then realize the person I was talking to wasn't there. I talked to a few inanimate objects, including the table lamp. It would all seem to make sense, and then I would realize what I was doing and stop. I wasn't actually speaking, the whole conversation was taking place inside my head.</p><p>After an hour of this sort of thing I decided to go to bed.</p><p>I spent another twenty five minutes in the bathroom taking my contact lenses out. It was a near impossible task. I kept forgetting what I was doing and slipping off into more conversations with folks that weren't there. I was very confused and disoriented. As I left the bathroom I thought I heard voices in another roommate's room. I stopped outside the door and listened for a few minutes to what seemed to be a conversation between my roommate and friend of ours. I couldn't quite make out what was being said, but I had a strange feeling they were talking about me. I wanted to open the door and confront them, but knew this wasn't a good idea. Part of my mind was arguing that there was no one in there, since I hadn't seen anyone come in. The other part was insisting that it heard voices. Finally, reason prevailed and I went to bed.</p><p>Lying in bed I continued on my strange journey. I was having detailed and strange thoughts, delusions and fantasies. The main one I remember was of reading (or trying to read) a newspaper in a language I didn't understand or recognize. I continued in this vein for a while before drifting off. The next day I felt hungover and out of sorts. It was not an experience I was eager to repeat. I can't imagine a set of circumstances where I would willingly have that experience again. It was monumentally lame and foul.</p><p>Some months later I decided to try Robitussin (DXM) cough syrup. This enjoyed something of a renaissance among some members of my circle of friends and acquaintances. Again I heard it described as 'like acid'. Well, I doubted it, but I felt it was worth looking into, considering how many of my friends had tried it and liked it.</p><p>I bought a four ounce bottle of Robitussin DM at the grocery store (I know now I should have gotten the Maximum Strength). I took it home and drank it. Or tried to. It was incredibly nasty tasting. I managed to drink most of the bottle, leaving less than a quarter of it. I went into my room and lay down to await effects and try hard not to puke.</p><p>I must have fallen asleep. I awoke feeling strange. I got out of bed and turned on my lamp, which had a purple light bulb. I sat in front of the lamp, staring at it as my mind zoomed over a thousand strange thoughts. I felt weird, somewhat high in a not unpleasant way. There were no visuals or anything, just a strange high and a lot of weird thoughts rolling through my head as I sat in front of the light. I stayed up for an hour or so, enjoying the mild trippiness of my thoughts rambling over assorted oddities before heading to bed. It was interesting, but nothing like acid.</p><p>A few weeks later I decided to try it again. This time, I was doing it with two of my friends, M and R. Neither had tried it before. We acquired more robo, this time a generic brand that had a fair amount of alcohol in it as well. We chugged the foul crap and sat in R's basement waiting to feel something.</p><p>It didn't take long before I was feeling something. The alcohol gave me a bit of a buzz and the DXM was definitely warping me. The room looked like I was viewing it through a fish eye lens. The air appeared to be thick in some strange say. I felt most definitely fucked up. It wasn't unpleasant, but it wasn't particularly pleasant either.</p><p>My stomach had been churning since I drank the cough syrup and it finally decided it had had enough. I asked R what would be a good place to puke and he told me to go outside. I staggered up the stairs and out into his yard where I collapsed and began puking. I puked three or four (or more) times before someone came out to check on me. They asked if I was OK and I mumbled something about being fine, sorry I puked on your tree I asked to be taken home, and someone obliged. I still felt weird and spacey, but it wasn't in any way fun.</p><p>My early and uneducated forays into OTC intoxication were almost universally unpleasant. Even the most pleasant and positive moments were only mildly interesting. I am certain that if I had been better informed I would have almost definitely had better and more interesting experiences.</p><p>I understand that many people find DXM to be a pleasant recreational drug and/or positive spiritual tool, but it has never seriously interested me since the second time I tried it. I have considered doing it several times, but with so many other interesting things available to me, it isn't any kind of priority.</p><p>The Dramamine experience was pretty much unpleasant in every way and I have no interest in ever repeating it, even if it were the only psychoactive available to me. It wasn't fun or insightful, and was only interesting for the utterly bizarre nature of the effects.</p><p>I sincerely hope that anyone reading this who is interested in trying these things takes the time to look for useful information before proceeding. Even OTC drugs like this are extremely powerful and you can seriously injure yourself if you proceed without the proper information on dosage, side effects, etc. I was lucky, but someone else might not be so lucky in my place.</p>",
 "year": "",
 "id": "15109",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-01T07:00:00.000Z",
 "views": "58294",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 tablets",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 }
}
