{
 "id": 1511,
 "title": "A Corrupted Blank Slate",
 "date": {
  "submission": "2006-06-21T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Gary UK",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "I read a lot about people huffing petrol products, dust-off, varnish remover and other solvents.  It seems that majority of these people report bad experiences.  I can't speak about these, however, as a regular huffer of liquid butane (petrol-lighter refils) I can only report good experiences however, the resulting damage of a five year abuse is now painfully apparent to me.",
  "I started huffing having never previously taken drugs of any kind (I didn't even smoke regulars back then) ... I happened to fall in with a crowd of huffers although, for a long time I resisted the temptation.  I finally gave in after an argument with my parents in which I had walked out and was determined to do anything to avoid going back home that night.  My first huff started that night.  I was only 17.",
  "The first few huffs taste strange but leave a warm glowing feeling inside, like the warm glow I get after a few whiskeys.  This comes on always within the first minute and feels good.  Fingers start to tingle and generally the experience is a lot like the pleasant onset of drunkenness.",
  "The next few huffs feel vaguely sexual ... my whole body seems to humm and buzz and every breath brings a feeling to my chest like the nervousness of being with someone I love when I feel it is time to tell them how I feel.... a delightfully giddy excitement and my breathing feels shallow at times and I feel the need to concentrate on my breathing - a slight paranoia about the stupidity of what I am doing often accompanies this but soon disappears.",
  "For a while I rest in this state, breathing normally and feeling quite comfortable.  I wait until any developing paranoia leaves me and I am ready to continue ... I feel warm and glowing, relaxed and happy ... the room seems a little different but I couldn't explain how and sometimes little lights seem to flicker in my peripheral vision, like those I get when tired ... nothing spectacular.",
  "The next few deep huffs after this state inevitably bring an audio effect which can only be described as a sort of ambient jews harp or some kind of spring ... a boingy whaaahy sound that comes from nowhere in particular and seems to permeate everything.  Sudden noises or speaking make it stop only for it to creep back again.  My voice seems a little strange as do the voices of others with me - we try not to talk.  Strange lights play around the edges of objects and everything seems less real and take on an almost dreamlike quality that is hard to convey.",
  "A few more huffs and there is a very rapid change in my perception... like some perceptual cog slipping into (Or more likely 'out of') place.  It happens so cleanly and suddenly that I can almost point to it.  Suddenly I notice the wooden floor is made of wooden jigsaw pieces and this seems normal, I smile.  The room now seems so different that I cannot tell you whose room it is or where it happens to be - it seems to exist on its own, it is all that exists ... I cannot visualize anything beyond what I immediately see.",
  "A few more huffs and the whole open-eye hallucination clicks into place and everything becomes different.  The trips are often very similar in nature, at least, people and rooms always change consistently so I will explain the most common features that I see at this point. ",
  "One of my regular huffing companions changes into a ragdoll, he has yellow wool hair and I can see every twisted strand clearly ... The more I try to see past the illusion the more perfect the illusion becomes until normal vision is absolutely impossible.  My other friend turns into the girl from a well known television testcard that the BBC used to use.  This ties in with the ragdoll who is also from the same testcard image.",
  "The back of their sofa is suddenly made of dark-coloured oversize jigsaw pieces stacked on their sides against the wall, some of these have fallen forwards and piled up to make the seat of the sofa ... detail is amazing and again I cannot, however hard I try, see past the illusion.",
  "On this occasion I am wearing a fluffy white jumper with a grey band across the middle that I got for christmas... it makes me feel furry and friendly and I suddenly realise that I am in fact an old-english sheepdog.  I can't see myself, I just know.  I laugh a kind of breathy dog-laugh because I realise that I am not actually allowed on the sofa... they havent noticed this and allow me to remain.",
  "The table has become a stack of four oversize childrens alphabet blocks and suddenly I do not recognise any feature of the room although I feel at home here.  Looking at the television I am struck with a sudden realisation that everything has been reversed ... that we are inside the television and a normal world lies beyond through that opening of light.  We ARE the testcard.  I smile.",
  "Huffing again nothing further happens except that I prolong the state... it is complete and no amount of huffing seems to change things ... looking at the fire I see a lightshow in the distance and fancy that its a vast arena where a band is playing ... I can hear the band and the crowd (Although, later I realise it was on the tape we were playing during the huff - a live version of a techno classic)  I am enthralled and want to see more but I Am aware that I am too large to get in, and that, also, I am a dog.",
  "I bark.  They look at me.  I look at them.  I look at the television.  I scratch my ear.  I look back at them.  They look at television.  It all seems so natural and I know that many of you will believe that I am making this up... but the truth is that my head is so full of toxins that almost anything is possible at this point.  The fact that it seems so real and natural is, I believe, what makes this a frequently re-occuring reality.  But it feels so real that in that moment I could swear that my eyes have been opened to a greater and more true reality.",
  "One time I went to retrieve some cigarettes from the fireside opposite me... my feet were moving awkwardly and I looked down to notice that they COULD NOT step on the joins in the jigsaw floor ... not only this but the tile under my foot seemed to rise up to meet me with each step ... barely perceptible, just an inch or so.  By the middle of the room the tiles are rising about 2 foot and I try to put my foot down through the gap to touch the floor below but I physicaly cannot ... the tile below my foot comes to meet me and the other one falls away.",
  "By the time I reach the fireplace I seem to be about 40 feet in the air and rising all the time ... I can see the room far below and air whistles around my head (Turned out later that the kitchen window was open) I see light snow and it feels good.",
  "Looking forwards I see the fireplace in front of me and finally locate my cigarettes which had changed pack colour (They were actually someone elses) ... and finally got back to the sofa ... sitting on the sofa I can see the fireplace opposite me and at the same level as myself.  I laugh, and then feel self-conscious.",
  "I sit and watch the others for a while and get bored... a few more huffs and I pass out stunningly.  Seeing the white bag wrapped around by O-shaped hand coming up to my face like a funnel.  I inhale deeply ... again it comes to my face, and again, and again, and again very fast like a trail except that I feel each funnel hitting the last, I feel their impact through my hand and lips until suddenly I fly backwards and into a bigger funnel behind me and the chain of funnels takes me down into another alternate reality (A butane dream - I am unconscious)",
  "This is where vivid closed-eye hallucinations begin ... tunes repeat endlessly and sometimes mockingly and I feel I am trapped inside some vast arcade game ... Everything is colourful and perfectly vivid.  Things revolve around simple rules here although I am not always sure of what those rules are ... something keeps flying past me picking up parts of the scenery as it goes and I am jumping over blocks to avoid it ... a floating orange figure called 'wordy' who is a hemisphere with black arms and no body hovers in front of me",
  "'Wordy watches word watchers, hello word watchers watching ....' he says ... somewhere a crowd of children say 'hello wordy' in unison ... A dark thing called the 'onus' is bouncing around with the sound of an unceasing jewish harp ... and a springy chorus of words sing a song about 'catching the onus' and repeating tunes and words ... it is altogether quite beautiful.  I race around corridors and passages, sometimes being chased, sometimes chasing 'wordy', there seems to be something I am supposed to be doing but I don't know what it is - all I know is that I have a purpose in all of this, I belong here, I have some vital role.",
  "Suddenly the black 'onus' thing comes up behind me and I become part of that blackness ... the song is all that exists but now I hear it muffled like I am floating inside of something much bigger than myself ... I hear a and feel a loud >pop",
  "Total duration was about an hour and a half ... for most of that time I was asleep, but it seems like much longer.  Later as the effects wear off I will feel a little nauseous and be unable to look at food.",
  "The rest of the day I feel disconnected and slow, like a hangover.  I cannot think of anything except the most simple things.  The rest of the second day I find it hard to concentrate.",
  "An interesting point to note is that items in my dream change predictably... maybe it is so real and overpowering that it is hard to hallucinate anything else once having had one major trip in those surroundings ... moving to different surroundings often creates a different trip, although people often carry their characters with them.  Whenever I wear white now I am an old-english sheepdog.  And my dark haired friend is almost always a yellow-haired ragdoll in any environment - such is the power of these illusions on my psyche.",
  "LONG-TERM SIDE EFFECTS",
  "We used to take butane by bag or rolled handkerchief (And occasionaly the compressed gas refill) about once a month - and after a year I didn't feel any lessening of my abilities in real life or any loss of vividness in my high state.",
  "Nevertheless I changed to just doing it about once every 2 months - and after five years of regular abuse I started to notice acute short and long-term memory deficits and large gaps appearing in my past where I couldn't remember anything.  Items I had once and cant remember where they went, whether they broke or were sold, places where I used to live I can no-longer find or remember the area ... sometimes walking home on a familiar route I pause at a corner unsure of which way to go.  For a few minutes both ways seem wrong and I couldn't choose.",
  "Only once I became so confused about the direction home that I just stopped and cried... I thought I was losing my mind.  A lady stopped and asked me what was wrong and I had to tell her I'd forgotten where I lived ... she seemed a little puzzled why a man of my age would cry about such a thing (I was 22) and she just assumed I was new to the area.  I'd actualy lived there 6 years.",
  "I told her the street name and she looked it up in the A-Z in her car and, you know what?, I was actualy standing at the junction at the end of my own street.  I felt so stupid as I walked down the street hoping that I would find something about it that I recognised - but nothing until I actualy got to my front door - I recognised that but not the street.",
  "Many years have passed since then and I have not touched butane since... the smell now makes me feel sick.  And my short/long-term memory is improving and my cognitive skills are back to normal I believe.  But there are still large clouds over my memories of times before I did butane.",
  "I am now 29 and have a child... I take occasional ecstasy now and find it has none of the problems of my previous inhalants and enhances my feeling of reality and belonging without distorting it.",
  "I consider these trips to be better than the random trips I have had from LSD and also way superior to NOS ... but not if I stop at the warm-fuzzy feeling ... I have to drive through to the perceptual change and open-eye hallucination and possible even until I get sleepy and pass out and have the amazingly vivid butane-dreams.  Otherwise its no better an experience than drinking spirit alcohol.",
  "I wouldn't change my experiences for anything, I have been places and experienced things that no other man has experienced... and in this respect it is worthwhile, rather like climbing a mountain or trecking to the north pole...  I have been a dog, visited what were essentially alternate universes, lived inside a TV, floated over bizarre perfect landscapes and met some VERY interesting characters ... many of whom I still have vivid memory of, and still more that I have forgotten completely.",
  "If I could change anything I would have just used it just a few times and then stopped before I became damaged as it is certainly taking a long time to recover all my mental faculties.</p>"
 ],
 "erowid": {
  "id": "14685",
  "citation": " Gary UK. \"A Corrupted Blank Slate: experience with Inhalants (ID 14685)\". Erowid.org. Jun 21, 2006. erowid.org/exp/14685",
  "substance": "Inhalants",
  "views": "15255"
 }
}
