{
 "id": 15113,
 "title": "Teenage Lobotomy",
 "date": {
  "submission": "2004-05-05T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "smackron",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "pill / tablet"
  },
  {
   "time": "5:00",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "pill / tablet"
  },
  {
   "time": "14:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "pill / tablet"
  },
  {
   "time": "17:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "Thursday-",
  "Purchased 6 two mg bars of xanax from one of my pill dealers. Afterwards me and friend A ingested one each around 7 o'clock. 15 minutes later I began to feel light headed and quite euphoric, however my mood seemed to fluctuate from happy (almost like a light roll on extasy) to depressed and anxious. Anyways, after hanging out for a bit I was taken back home with four bars left in my pocket. That night I decided it would be a good idea to take the rest of the bars. By the way Xanax makes you very stupid. So I swallowed one and the other three I crushed up and drank in a glass of sweet tea, this being about one o'clock am. I don't remember anything else from that night.",
  "Friday-",
  "Somehow my mother was able to wake me up for school. (Later that day she said I slept with my CD player and head phones on, which I remember being broken the day before). Still zonked out I put on a pair of my grandfathers pyjama pants(?) and a white shirt for school. A few minutes later I was picked up by Friend B and his hot little sister to leave, by the way I'm a junior in high school. I don't really remember all this but when I got to school I bought 10 more 2mg bars, which I split with friend A. I think I ate all of my five around 9:00. Neither me nor any of my friends have any idea what I did during the 1st half of school, I'm pretty sure I was there but I wasn't in any of my classes. Anyway after homeroom, friend A noticed I was walking around the halls like a fucking zombie and made me leave with them to eliminate the risk of being seen by any administrators.",
  "\tSo Friend A, C, and D left school I think around 10:00am and they later told me that we went to a park. Apparently I wanted to climb a tree, but my friends knew I was in no condition to do so. But I absolutley insisted that I could do it so they had to hold onto me as I did so. I almost fell off about 10 times and it would've been a 20 foot fall onto rocks. The only thing I remember from this is them holding onto me as I crawled up. We left to go back to school around 12:00. On the car ride back I was trying to force friend A to give me his share of the pills. All three of my friends knew it was a bad idea so they insisted I didn't. This made me furious so apparently I took friend A's car keys and began stabbing him with them. He finally gave in and gave me one more pill. I walked into the art room very non-chalant popped the pill in my mouth, surprisingly I chewed the vile thing up and swallowed the pieces with a swig of water. Here's where things get bad.",
  "\tBy now it's lunch time and my friends lead me up to the lunch area, where I found my homeroom teacher. He questioned me about where I was, and I truly thought I had gone to homeroom that day. I called him a liar and it  was obvious I was completely wasted so he gave my parents a call. I guess about 15 minutes later my parents show up and that last pill really starts to kick in. While I am forcifully arguing with I was slurring my words real bad. They made me get in the car and go home. The last thing I remember is being furious and throwing things around. Then everything went blank.",
  "I open my eyes and its 11:30 PM and I am lying in hospital bed with an IV in my arm, three suction monitor patches on my chest and a god damned catheter shoved up my cock. At around 12 they loaded me into an ambulance to take me to another hospital. By the way to do this they had to take the catheter out while I was awake which was no fucking picnic. I soon fall back asleep. I guess I spent the rest of the night in a sort of benzodiazepam coma. But the hardest part of the whole thing was confronting my family the next morning. Right now it is Saturday and I got back from the hospital about 6 hours ago. I feel like I should fell really bad about the incident but all I can do is laugh about it. By the way pretty much 99% of these facts were not pulled from my memory but from the observations of the people I was around. Long story short, Xanax overdose = 20 hour comatose. I would not recommend using Xanax recreationally. Opiates are much better ;)"
 ],
 "erowid": {
  "id": "26627",
  "citation": " smackron. \"Teenage Lobotomy: experience with Alprazolam (ID 26627)\". Erowid.org. May 5, 2004. erowid.org/exp/26627",
  "substance": "Alprazolam",
  "views": "111976"
 }
}
