{
 "id": 15130,
 "title": "So I Decided to Try It",
 "date": {
  "submission": "2006-02-23T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "volcomstoner",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bump",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "7 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  }
 ],
 "report": [
  "Just some quick background, I am 19, in perfectly good health, skateboard often, and am not prescribed any medicines.  I'm basically your average New England college kid, Ive lived in the smallest state in the country my whole life, and did my share of drugs, however drugs never made it into the top 10 list of things I like to do (except smoke herb).  In the past I've burned herb almost everyday, I drink often, Ive taken a good amount of Adderall and percoset, taken mushrooms, lsd, and dabbled in cocaine & oxycontin...all of which I researched quite in depth.  I'm one of the many that will try anything once, when I feel educated and mentally/physically prepared.",
  "So it was an average Monday night during fall semester, my work was done, the drinking had started.  My roommate had returned from a neighboring state to pick up some bags of heroin, to feed his addiction (his addiction had me pretty bummed out, it was really dragging him down).  When he returned he immediately started talking about how he was done with 'it' (heroin, painkillers) and he was sick of being sick, and being in the state I was in, was really excited for him, as he was quitting after this batch was gone.  So being the good friend I am, I offered to help him get rid of it ASAP.  I had snorted oxy about 10 times within the last 2 years, and figured heroin couldnt be that much different.   So the line was broken out, and snuffed in.  5 minutes later I felt the warm, happy, mellow feeling much like oxy.  It seemed almost identical to it, until about an hour later when I seemed to be coming down.  ITCHY.  DAMN ITCHY.  It really sucked to tell you the truth, I itched physically, and my mind was itching for another bump.  Conclusion, HEROIN IS VERY ADDICTING.  They werent fucking around in D.A.R.E. (about H at least, I find most of it to be bullshit)."
 ],
 "erowid": {
  "id": "26695",
  "citation": " volcomstoner. \"So I Decided to Try It: experience with Heroin & Alcohol (ID 26695)\". Erowid.org. Feb 23, 2006. erowid.org/exp/26695",
  "substance": "Heroin & Alcohol",
  "views": "26561"
 }
}
