{
 "title": "Loops and Illusions",
 "author": "-bC-",
 "citation": " -bC-. \"Loops and Illusions: experience with Ecstasy (ID 15136)\". Erowid.org. Jun 3, 2002. erowid.org/exp/15136",
 "substance": "Ecstasy",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)",
  "",
  " ",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>Note:</p><p>1. I did not take medication 2 weeks prior to this experience.</p><p>2. I have explored many various psychoactives in the past.</p><p>3. I am a mellow individual with very little stress.</p><p>This particular pill was not tested to be 100% mdma, but I have tried many mdma pills in the past that were proven to be pure so I know what the feeling is like (although I am aware other chemicals carry almost identical effects)</p><p>Mindset: Happy about getting another mdma experience, anticipating the well-known effects, and eager to experience them with my girlfriend/partner who has never tried it before.</p><p>Setting: A clean, quiet, and comfortable living room/bedroom. No interruption. In the presence of my trusted girlfriend and my Trip sitter who was also there watching television in another room.</p><p>Experience: My partner and I swallowed the pills at the same time, both having only eaten once that day, 5 hours before taking the pills. 2+ hours after consuming the mdma, we both felt a complete nothing. Rather disappointed I went and got a light beer for my partner and I to share. We both drank the beer quickly. Another 30 minutes later we felt nothing. After we decided the tablet wasn't any good, we both drank another beer.</p><p>Before I knew what was happening I was shot into an exhilarating peak. The standard physical side effects were noticed along with the empathetic effects so commonly reported. Soon after I came on the experience, my partner began to feel immediate effects also.</p><p>For the next 30 minutes of the peak, it was great, like a standard MDMA 'roll.' My partner and I then walked to my room to sit on my bed and talk and show affection.</p><p>Something strange then happened to the both of us, and we only realized it when it was over. Suddenly we both started crying as the peak became so intense it was shocking. Our eyes went through severe nystagmus, and through a blurry focus, we stared into each other's eyes repeating delirious phrases of love. It was as if we were caught in a time warp or a loop that prevented our thoughts from leaving the feelings of love and each other. I did not experience one thought aside from my concentration on her. I did not know anything even existed; I even lost thought of physical feeling. I couldn't feel the tears in my eyes, or my body on the bed.</p><p>The next thing we both remember we are sitting on our bed holding each other, now in the presence of my trip sitter.</p><p>Definitely a unique experience, although I am not sure I want to be in that position again as it was pretty frightening.</p><p>The next day I had a light headache and I was restless from the night before. Many people report feeling depressed with a longing for the feelings you experience on mdma - This time, surprising, it was not the case. The next day had a brilliant positive energy flowing throughout it. I had a heightened appreciation for everything I was involved in. I became more respectful to everyone I encountered that following day. Even though I was abnormally happy I felt as though it was pure and real not residing effects from a drug.</p><p>Note: I did not test the pill at all. Since I have never encountered this experience from mdma, I am apt to blame it on [something other than mdma  --editor].</p><p>Overall: It seems almost impossible to explain these remarkable feelings through words that feel so empty... The climax of my trip was not only mind-blowing, shocking, and thrilling; it has become a very meaningful part of my life that has even furthered my interest in exploring my mind.</p>",
 "year": "2002",
 "id": "15136",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-03T07:00:00.000Z",
 "views": "19419",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
