{
 "title": "Stupid Move, Payed for It",
 "author": "Anonymous",
 "citation": " Anonymous. \"Stupid Move, Payed for It: experience with DXM, CPM & Cannabis (ID 15141)\". Erowid.org. May 7, 2004. erowid.org/exp/15141",
 "substance": "DXM, CPM & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]</p><p>To start this report off, know that I have not had THAT much experience with many Hallucinagins, although I am always interested in trying new things.  I have eaten shrooms on many occasions, and dropped acid once. </p><p>I had heard about DXM before,and wanted to try it, but i wasn't down with drinking a bottle of nyquill, and knew of no other way of trying it.  A couple friends of mine had told me they tried Corciden, a cold remedy they got from our local pharmacy. The fact that it was pills eased my mind a bit, so I was down for taking it.  I just had to get my hands on some.  Which was easy considering I Work and a pharmacy.</p><p>A couple days later, while still thinking if i should try it, the opprotunity came in school.  A couple of friends were taking it in school at our lunch period, so I figured, without having much knowledge of the drug at all, that I would do it then.  After inquiring how many pills I should take, I settled on 12 pills.  Considering my friend was popping 16, and another popped 8. </p><p>Now, I had lunch 7th period, which is just about 12:00pm, I had work that same day at 5pm.  Stupid, stupid move. </p><p>As school ended I still was feeling no effects, School ends at 2:02 so I figured, 2 hours, no effect, I might as well forget about it and try a higher dossage for the next i wanted to try it.  After school I went to a friends house, I arrive around 4pm and like always, decided to smoke some weed before work.  Me and a friend finished smoking at about 4:30, we shared a pretty fat joint.  This is when things got wierd.</p><p>I had gotten up after sitting down for a while, I did not feel high, I just had a weird type of dizzy feeling.  I shrugged it off, and went to work.  Now I live very close to my job, so i just walk their.  As the minutes passed this dizzy feeing started to get more intense.  I tried to shrug it off, thinking in my head that it Cant be the Corciden that I had taken many hours ago. </p><p>I arrived at work, and started to feel Completely trashed.  I could not see straight, and was having trouble walking.  My stomach was killing me, so I went into the back room.  I sat down and realized that if anyone had seen me, they definitly would think I was on something.  I went into the bathroom and tried to splash some water on my face, but I couldn't even manage to direct the water to my face.  My pupils we're dilated, and I felt like complete garbage.  I stayed in the backroom for about 15 minutes until a fellow employee, which is a friend of mine with come Corciden experience.</p><p>I talked to him for a bit and told him that something was wrong. After a little bit longer, A nasueus feeling came over me and I ran into the bathroom and threw up.  After this the dizzyness died down, and I started to get my head straight.  I went back into the store and found my manager screaming at me for being 15 minutes late.  I looked like hell, so I told him I had just gotten sick and was going home.  I went back to my friends house, it took a good 2-3 more hours for me to feel straight again.</p><p>This experience with Corciden was horrible.  I probably will never try it again. I recieved NO visuals, and felt like hell.  I dont know why it took so long to kick in, but Corciden affects diffrent people very diffrently.   I suggest if you are thinking about trying DXM, don't mess around with cold pills for the high.</p>",
 "year": "2001",
 "id": "15141",
 "gender": "Male",
 "timestamp": "2004-05-07T07:00:00.000Z",
 "views": "38404",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "12 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": ""
  },
  {
   "time": " T+ 4:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
