{
 "title": "Tripping while My Parents Were Home",
 "author": "Shroomkiddie",
 "citation": " Shroomkiddie. \"Tripping while My Parents Were Home: experience with Mushrooms (ID 15147)\". Erowid.org. Jun 19, 2007. erowid.org/exp/15147",
 "substance": "Mushrooms",
 "bodyweight": "210 lb",
 "report": "<p>Lucky for me my parents arent that bright when it comes to drugs and didn't bust me. However I did have my close calls. I hope and pray that they never do catch me in this state.</p><p>I had been searching for months for either mushrooms or acid. I had never tripped before in my life and was excited at the prospect of being able to see and talk to things that weren't there. I wanted to explore myself.  When a couple of friends finally after months of searching delivered I was so excited.</p><p>After waiting for my circle of friends to be free a couple of nights later I ingested maybe 3 to 4 small mushrooms out of a good sized plastic bag. They were disgusting, they always are either dried or fresh from what I've read. To make things short I had nothing but a minor body buzz and a tiny bit of color distortion. I was very disappointed, I thought wheres the cartoon characters and stuff.</p><p>About a week later I was sitting home on a Sunday very bored. Than as I began to think of things to do I remembered that I had shrooms still. I didn't know the just how strong they were and thought that if things got real bad I could sneak out the back door. So I went downstairs saying hi to my mom and began making a peanut butter sandwich casually, which would a little effort became a shroom sandwich. I ingested almost all of the shrooms I had left and ate two pretty big shroom sandwiches. Shrooms went down much easier than the first time. \t</p><p>Waited for the effects for about 45 minutes and than it hit me. The tv looked like it was alive almost breathing. I thought this was rather funny and watched a movie as long streaks of colorful lines and dashEs of fire balls were visible. Soon I decided to take a shower. This was so cool, the shower became a rain forest as I laid back in the tube. The light became the sun, the curtains turned into flowers and plants, the water turned red. As I thought to myself this is the coolest thing ever. I have never been at peace so much.</p><p>I went back to my room and heard my dad call me for dinner. I told him that I wasn't hungry and left it at that. Some visible trouble walking and some dizziness as I sat on my bed. Than the trip got real strong with time distortion and a whole lot of questions poping in my head. What is death? Am I dead now? What's the difference between life and death? Now this trip was getting way to strong. I didn't expect this at all.</p><p>I turned off the light and tv and laid down in my bed. Suddenly remembering that my parents are just down stairs. Shit my parents are home and I'm tripping my balls off. My dad and mom were starting to wonder why I wasn't going down stairs. I told them I was sick and to leave me alone as I stayed in my bed. My dad called me what seemed like 10 times(This wasn't real of course and it was just my head playing games). I knew enough not to respond and voice distortions and echoes were becoming apparent.</p><p>I was starting to get real worried now and kept visualizing me telling my parents that I had over dosed and shrooms and being taken to the ER as my dad shook his head. I was scared out of my mind and kept praying to god to get me out of this and I will never do this ever again.</p><p>Lucky (not really) a family member came over with my cousin.  My cousin is not cool when it comes to drugs and I would never tell him that I was tripping. After hearing echoes of sounds that weren't real. I heard my dad calling me thinking that I was just hearing things. He opened my door and asked me to come down. 'Oh shit it was real'. I told him to leave me alone and that I was sick. He closed the door behind me and I heard 'hes sick I guess'. My mom came upstairs with my cousin as he gave me my Christmas present early. I blankly stared at it finally being told to open it. Oh yeah your supposed to open things with wrapping paper on them.</p><p>It was a spider book and a dvd. After a brief pause and being told to I thanked him and they went back down stairs. My mom entered the room again and asked me what was wrong. I kept telling her I was sick. My mom kept asking me questions and I just said yes to all of them. Every time she asked me something she got taller and shorter. Taller and shorter again. I moved my head along with this motion. She came in with a bunch of medicine and pills that I slurped down as she took my temp. She left and told me to go to sleep. I tried to go to sleep but couldn't. Finally after 6 hours the trip had ended and I didn't get busted. Thank God!</p><p>I woke up the next day trying to remember what had happened. I thought that my cousin coming in and giving me the book was a hallucination but it was real. I saw the book in my room on the floor.</p><p>Here it is folks I may have not gotten busted, I was very lucky. I consider this to be a bad trip. Really it would have been fun minus the parents.</p>",
 "year": "2001",
 "id": "15147",
 "gender": "Male",
 "timestamp": "2007-06-19T07:00:00.000Z",
 "views": "57842",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ]
}
