{
 "id": 15141,
 "title": "A Trip to Heaven",
 "date": {
  "submission": "2003-09-15T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "S.C.",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "brought up a strict, conservative religious environment, I was initially very scared of psychadelic drugs.  however, I had started smoking pot not more than two months eariler than my first LSD experience, and it had opened the door to other, stronger drugs.  my curiosity ate at me like a disease, so I decided to try it on a beautiful saturday afternoon.",
  "my friend J came over after church that day, with a backpack of contraband slung over his shoulder. knowing what was waiting for me, I anxiously ushered him into my room, where we safely locked the door.  he pulled out a large sheet of paper with lines drawn on it.  it looked like graph paper for algebra class.  he cut me two of the tiny squares and told me to let it sit on my tongue for a while.  although I couldn't shake the lingering feeling of apprehension, my curiosity finally convinced me to pop them in my mouth.  they didn't taste like anything at all, and i kept them on my tongue while i changed my clothes, grabbed some money and a jacket, and said goodbye to my mom.  As we drove away, I asked my friend J what to look for.  Being a seasoned drug user, he told me that I would know.  Being almost twenty minutes in, I felt almost nothing.  I was eager for my first altered perception, hoping that it would dazzle my mind in ways that people had told me it would.  We arrived at the place we would all be tripping at, a house on a country road far from civilization.  Already many of my friends had gathered there and were casually smoking cigarettes and making conversation on the front lawn.  The owner of the house, one of my best friends, came up and warmly greeted me.  I whispered to him that I had dropped two hits and his eyes got wide.  'No way!  So did I!'  and he laughed like a little child.  The prospect of having someone to share this trip with me was very inviting, considering I still didn't know what to expect.  J came up to me and started waving his hands in my face, trying to trip me out, but to no avail.  it just annoyed me.  he looked at me funny and all of us proceeded to enter the house.  each of us grabbed a comfy seat in the living room.  they had all been waiting for J and I because J also had pot next to the LSD.  He sold sacks to everyone who wanted one and we all just got caught up in lighthearted conversation.  this was when I felt the first effects.  I was sitting next to one of my friends, a girl, and we were sharing this multi-colored afghan to keep warm.  All of a sudden, I felt so good inside.  The afghan felt very comforting close to my skin, and the warmth of my friend, who we'll call M, felt very comforting as well.  I couldn't help but smile.  Now while this was great, I still was not feeling any of the psychedelic effects that everybody would talk about.  while I felt slight disappointment, I rationalized that it was only an hour into the dose, and if it didn't work, I could always get stoned. ",
  "after about 15 more minutes of sitting in the room talking, people started pulling out their respective sacks and rolling joints.  the first one to finish, guigo, eyed me and M, and we followed him outside to the barn where everybody smoked.  at the time, my body just felt very tingly and good, as if I had just gotten a really good massage.  guigo sparked the spliff, and passed it to me.  I held it to my lips and took in a rather large hit, causing me to cough out a gargatuan cloud of smoke.  This is where it all hit me at once.  All of a sudden, time started moving at a snail's pace.  I looked up at my friends after my fit of coughing, and they all smiled at me, amused by my display.  Their faces moved in sluggish patterns, it almost looked as if their faces were made out of clay.  I passed the spliff to M, who took it happily.  Her hand extended out soooooo slow, and she took forever to put it to her mouth. and the sounds, oh the sounds.  everything was so loud and clear.  the crackle of burning herb, the sound of M breathing out the smoke.  everything was exaggerated to an extreme point.  the more hits of pot that i took, the more into this strange world I descended.  finally we finished the spliff, and we conjured again in the house.  I was feeling very dizzy and disoriented, and noticeably i might add.  one of my friends came up to me and said, 'how ya doin there acid head?' followed by a laugh.  I smiled at him, his words still processing as he walked away.  I honestly didn't understand what was going on. ",
  "about two hours into the trip, it was getting insanely intense.  It was like a world that even if I wanted to leave, I couldn't.  I found myself asking the question, 'when is this going to end?' and for a few minutes I felt very, very scared.  and to make things worse, my friend's (the one who owned the house) parents came home unexpectedly.  they were supposed to be gone for the weekend.  my friend started freaking out.  'Everybody, upstairs!  And don't say anything!' he yelled, frantically trying to rid the house of any incriminating evidence.  we all scurried up stairs to his tiny room and all sat on the bed.  It seemed like I waited there for almost an hour, but it had only been 15 minutes.  My friend M pulled out her cell phone and called another friend, steve, and he told us that we could come over there.  His parents had left and he was sure they weren't going to show up unexpectedly.  Sighing with relief, we all shuffled outside.  everyone left for steve's except for my friend aaron and I.  we decided to wait until my friend was done getting yelled at by his parents.  inside aaron's car was a mango.  the mango looked so appealing to me, it's orange and red colors drawing me in like a visual magnet.  I pulled out a sharpie marker and started drawing strange designs all over it.  It felt as if I had no control over this, like my subconscious was the one telling my hands to make these designs, and I had almost no control.  At the end, it looked amazing to me.  I dubbed it 'the monkey mango,' and set it down for aaron to see.  He was totally sober, and it obviously did not entertain him as much as it had me.  It was raining, so the rain droplets coming down the windshield looked surreal, almost.  they seemed to be a figment of my imagination, but when I heard the sound of them dropping on the roof, I realized that it was all in my head.  It was all very, very entertaining.",
  "After what seemed like hours, he finally came out and we left for steve's.  when I got there, I felt really good because I felt safe again, and there were even more friends at steve's house than had been at the previous house.  I sat down in his couch and started chatting with old friends.  This was about three hours in, and the full effects were hitting me.  I went into the bathroom to take a  piss, and when I had finished I proceeded to open the door.  There was no door knob.  I looked down for visual confirmation, and sure enough, there was no door knob.  I thought my mind might be playing tricks on me, but I stuck my fingers through the hole where the door knob should have been and found nothing but thin air.  I was trapped, it seemed.  the door would not open with out a door knob.  This confused me greatly.  I started getting upset.  I thought someone had played a joke on me, trying to trip me out or something.  I started yelling, 'who the hell locked me in the bathroom?  who the hell thought this was funny!'  over and over again.  my friend guigo was getting a real kick out of it, I heard him laughing hard outside.  This only served to upset me more.  Finally, steve let me out with a tool, and I felt good once again.  Guigo had tears streaming down his face.  He said, 'dude, I want to trip with you,' followed by fits of hard laughter.  I sat down once again, and started thinking. I had just asked my girlfriend out last week, so the relationship was pretty new, and the passion still on full blast.  Thinking about her was pleasant, and I got lost in my head thinking about how she smelled and how she laughed.  and then out of nowhere, she bounded down the stairs and jumped in my lap!  I felt this undescribable rush of euphoria and emotion that almost knocked me senseless.  I looked up at her and she looked so beautiful.  I couldn't believe it.  She usually didn't approve of me doing drugs, but for some reason, this day she didn't care.  she smothered me with puppy love and chatted me up for a good half an hour.  The incredible euphoria continued the entire time I was in her presence.  I just seemed to appreciate having her all the more when I was on acid.  She got off my lap and beckoned me into an empty room, and well, the rest is left to the imagination.  but let me tell you, it was incredible.  after that, I've only done acid one more time, but am still deep in love with my girlfriend, and I know that these lasting emotions come from that one experience, which will stay with me until I pass away.",
  "If you are apprehensive about trying acid, you have every right to be.  But in the right circumstances and around the right people, it can be the most memorable and amazing experiences you could ever have.  I will never regret doing it."
 ],
 "erowid": {
  "id": "26734",
  "citation": " S.C.. \"A Trip to Heaven: experience with LSD & Cannabis (ID 26734)\". Erowid.org. Sep 15, 2003. erowid.org/exp/26734",
  "substance": "LSD & Cannabis",
  "views": "8593"
 }
}
