{
 "id": 15144,
 "title": "'I Know...'",
 "date": {
  "submission": "2003-12-30T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "neon green snake",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 oz",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>It has been quite a while since this experience and I still reminisce occasionally, like today. So now I have decided to put the experience in writing to the best of my ability to share the the experience verbally with everyone who is interested.",
  "Halloween, 2001. I arrived at my friends house w/ approximately 6-7, maybe 8 ounces of assorted psychedelic mushrooms. We had the evening basically planned out: I bring the shrooms, my friend 'T' provides the boiling pot, the stovetop and the sock, along with a few minutes of his time and a free trip so as to enhance hallow's eve. So I get to T's house and I get right to business. Everyone's already there. Waiting for the 'provider'. I emptied the shrooms into a large sock, a very large sock, like the kind that makes you think to yourself, 'if I had feet this big, I'd be famous!' I fit the entire 6 ounces into the sock and proceeded to boil the slime out of my 'flowers'. About 20 minutes later, I took the sock and squeezed what remained of the slime out of what remained of the mushroom foliage. Tea brewed, psychonauts eager, I divided the brew into six glasses of tea, for 6 people. We drink, toast, and begin to celebrate the halloween that we, at the time, were unaware that we would remember it w/ euphoric recall for the rest of our lives.",
  "Dose+10 minutes:-we proceeded to walk to the actual trip setting right up the road at my other two friends Ter and Tif's house. Halfway there, which would be 15 minutes after dosing, I surprisingly started grilling. So soon! 'Twas the tea...anyways, the river of time slowed almost to a halt, we arrived and the experience rapidly began to go weird on us. We were just sitting around, doing whatever made us feel comfortable, engulfed in giggling frenzies, exagerated interests and headtrips, epiphanies, love, and expansion. I called a friend and made him come get everyone stoned. When he arrived and got us stoned, everyone was convinced we were at our peak. It was about an hour after ingestion and we didn't think we were going any deeper into psychedelia. We were wrong.",
  "Dose+1 hr 10 minutes: after we all smoked some pot, even though pot doesn't really do much when we're grilling except enhance the psilocybin slightly, we settled down a little of course, due to the newly aquired cloud in our brain. We were all experiencing a profound state of clarity, wholeness, and unity. Everyone had a smile on their face representing a feeling or emotion differing from the other people. We all agreed on this too...we were all in a state of telepathy. We saw each other's inner-self as vivid as a the color of a tree would appear. On top of that, we felt as if we knew what was going on everywhere else around the world, we saw famine, drought, murder, rape, starvation, torture, and all the other aspects of a world so cold. But we also saw the positive...marriage, birth, barbeques, camping, fishing, loving, caring, nurturing, etc...everyone was stuck in a state of 'aw', a state of mind that we decided to compare to that of a god. We kept repeating a peculiar phrase over and over again with different tones of voice, different meanings behind it every time, and different facial expressions...'I know'.",
  "The visuals for all of us were inundating to the max. Reality was no more, or maybe it finally was?...'you know? You know! I know!' it went on for the longest time, for what seemed like an amount of time not comparable to a realistic amount of time. Time didn't exist, every second was an eternity, but an eternity wasted as well at times. We all experienced this out of the blue state of love that was synchronized between all of us. All of a sudden everybody started getting up and giving everyobody else hugs, authentic tears streaming down everybody's face, screaming emotional phrases...'I love you!' 'I know!' 'I can finally see!'",
  "Indeed, we all felt as if we were mentally merging. We experienced identical states of mind that differed with such intensity at the same time. Such a precious moment, we were all devastated when the presence of such purity decided to depart from the depths of our souls. But at the same time, we felt truly and thoroughly cleansed in every aspect. We were introduced to perspectives infinitely ineffable by the vocabulary of man.",
  "That's about the best I can do to verbalize my beautiful night of hallows eve. And to add just a little more positivity, when we started coming down, we still had the entire night left to go off and do what we wanted to do, to let our primitive instincts out. To allow our inner self freedom for just one night. Enjoy psychedelia, play it safe, overindulgence can and will be painful and those are my three main pointers for my fellow psychonauts. Life's too short to waste it, indulge.   :)</p>"
 ],
 "erowid": {
  "id": "26747",
  "citation": " neon green snake. \"'I Know...': experience with Mushrooms (ID 26747)\". Erowid.org. Dec 30, 2003. erowid.org/exp/26747",
  "substance": "Mushrooms",
  "views": "6932"
 }
}
