{
 "id": 1515,
 "title": "Deep & Slow (part 2)",
 "date": {
  "submission": "2002-05-22T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Will It Ever End?",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "DiPT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I already reported my first experience. I enjoyed it, so I decided to try it again 2 days later. I thought perhaps that I would have built up a little tolerance...",
  "I will remind you that I take paroxetine (an SSRI) daily.",
  "So I took 20mg at 8:00am, on the way to work. I figured, maybe it would make work a little more interesting. Effects came on in less than 15 minutes this time, and sounds became extremely low in pitch and slightly metallic/robotic in tone, especially voices. I had a great day at work, no one could have known, and it didn't really effect any of my other senses this time. When no one was speaking, it was so peaceful, it feels like you are covering your ears; very silent.",
  "From my first experience I expected it to last until I went to sleep, and it did. When I woke up the next day, it was still working, and gradually was wearing off throughout the day. But not completely. That night I could barely sleep because of an annoying ringing in my ears (tinnitus). The next day voices were still a bit lower in pitch, but the metallic sound was worse than before.",
  "It's been ~60 hours since I dosed, and my hearing is still not back to normal.",
  "---------------------------------------------------------------------------",
  "On a side note:",
  "I would just like to mention, since I don't think anyone else has, that this is not the only drug to affect the sense of pitch by making things sound lower.",
  "Carbamazepine, an anti-seizure drug (brand name Tegretol) alters perception of pitch, though not nearly as much as DIPT. A number of people with perfect pitch have complained that it made them lose their perfect pitch.",
  "Fluvoxamine, a serotonin reuptake inhibitor (brand name Luvox) has also been known to alter one's perception of pitch. Again, not as much as DIPT.",
  "It's interesting to note that these have been perscribed by doctors to relieve tinnitus."
 ],
 "erowid": {
  "id": "14703",
  "citation": " Will It Ever End?. \"Deep & Slow (part 2): experience with DiPT (ID 14703)\". Erowid.org. May 22, 2002. erowid.org/exp/14703",
  "substance": "DiPT",
  "views": "9121"
 }
}
