{
 "id": 15162,
 "title": "Heavily Tripped out Compound",
 "date": {
  "submission": "2008-01-17T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pachanoi",
  "gender": "Male",
  "weight": 109
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:45",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "I got some T7 a couple weeks ago and tried it once orally, 20mg went down about an hour after dinner.  We got fairly high, very mellow and pleasent, sex was interesting, sleep was easy, light visuals, nothing very profound though. So I took the inititive to try a new way, snorting it.  At about 10am I bump 10mg's of 99.9% pure 2-CT-7.  It doesn't hurt much, but my body knows it just hit something DIFFERENT, I cringe.  Not quite sure if I did the right thing at this point, I was looking for a nice mellow, mildly visual time.  My body knows this will be more. ",
  "Within 5 minutes I throw up, I half-expected nausea as the reports state that as a possibility, so I write it off as an unpleasantness that I have to deal with and not worry about.  I ended up peuking three times allthough it really wasn't that bad, pretty easy really.  Well about this time is when I start getting launched out of reality, cold shivers for a little while, extreme stimulation of the skin, not knowing if I will be ok... damn intense. ",
  "At about 30-45 minutes after taking the line, the T7 starts to mellow out, turns DAMN pleasent.  Beautiful colors, great patterns, no dark spots, no body noise, very comfortable.  At this time I start smoking some dank, some Dutchman's Royal Orange and some Blueberry which I grew and turned out outrageously as I am a damn good grower if I do say so myself.  Anyways, the herb was wonderful, I love getting stoned when I am tripping, and T7 lets you get BAKED, it really helps out the visuals by amping the colors and deepening the trails. ",
  "Then I got the munchies, the fucking muchies on a psychedelic, I wasn't sure about eating, but gave it a shot and it was awesome, GREAT flavors, exotic, almost erotic.  My stomach felt great and everything digested as normal.  Music is wonderful, I have no urge to do more although I am having a fabulous trip.  Great mood enhancement.  The effects left quickly at about the 5 hour mark with snorting this compound, eating it lasted about 10... all in all this is a wonderful drug that NEEDS to be RESPECTED. ",
  "All my friends who have tried this since have bumped it too, about 1 in 4 get nausea and all say it is very much worth the expierience.   Remember, treat these compound with respect, they are very strong, and the dose/response curve is VERY sharp, so be smart, and invest in a milligram scale online.  It will make you and your friends feel much safer, cause it is.  Peace people."
 ],
 "erowid": {
  "id": "33453",
  "citation": " Pachanoi. \"Heavily Tripped out Compound: experience with 2C-T-7 (ID 33453)\". Erowid.org. Jan 17, 2008. erowid.org/exp/33453",
  "substance": "2C-T-7",
  "views": "4233"
 }
}
