{
 "id": 15166,
 "title": "Ill Prepared for What Was to Come",
 "date": {
  "submission": "2005-12-15T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "a believer",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:55",
   "amount": "250 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  },
  {
   "time": " T+ 0:55",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 0:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": " T+ 0:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(daily)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1500 mg",
   "administration": "oral",
   "substance": "Pharms - Divalproex",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>This was my first real experiance with Salvia. I had tried it before with little hallucinogenic effect, but this time I had tried to prepare myself, and it worked. I fasted for 24 hours to cleanse my mind, body, and spirit. I spent the day in meditation and prayer. It is important to note that I was slightly fearful due to my psychological disorders and possible consequences of the use of hallucinogens. I have obsessive-compulsive disorder, and bi-polar disorder [30mg prozac daily, 15mg abilify daily, 25mg seroquel daily, depakote 1500mg daily, and trilepta].",
  "Well, as night came on I began to listen to some strange, thought provoking music and at 10:30 I smoked a small bowl of cannabis. I took a seat on my porch and discussed what was to come with a friend of mine, who was sitting for me. At about 11:00 I smoked a second larger bowl of cannabis. Then at 11:25 I turned off the lights and began listening to the Lords Prayer in latin set to song. I packed a quarter of a gram of the extract onto a base of cannabis, said a quick final prayer, closed my eyes and hit the bowl. I held my first hit down and waited about 15 seconds before I released it. I continued to smoke the rest in a similar manner.",
  "Within 20 seconds of my first hit, I began to feel a strange sensation of gravity, and after a moment I felt compelled to lie on the floor. I lay down, facing the floor and I knew I was in for an interesting expieriance. I was not scared, but I felt that every breath was a struggle, because every breath was being sucked into the earth. I stared down with eyes closed and I began to think that I had already reached my peak. I was incorrect. I began to think about the music and a series of images appeared before me, rapidly moving and quick to disapear. I rather enjoyed that. I chose at this point to open my eyes, and I looked left. As I stared at the trees, I felt the pressure dissipate, and I began to see a figure of an alien nature. It passed while I stared and morphed into a ceremony. I saw the Mazatecs partaking of salvia and some dancing beside a fire. The ceremony was beutiful and filled with earthy colors. I saw with great clarity at this moment.",
  "At this point I saw them turn and look at me. I knew I was invading Mazatec territory, and I realized I was wrong to do so. Those who stared at me shot a single arrow at me. I was hit but the arrow was not in me. I could feel pain in my lower rib cage, but it was not there when I looked. I looked back to the ceremony but it had ceased to be. In the place of beuty was the head of Medusa. I stared awestruck. The snakes moved in a circular pattern. It was at this point an image flashed in my head. I saw my legs turn to stone, but I had not turned my head. My body felt like a rock and I lay still.",
  "I was confused, because I was still able to know that Medusa did not exist. I heard a vioce tell me to turn over, so I did, and was not stone anymore. I closed my eyes once more and when I did I saw clouds moving and pulling apart. An image appeared within the clouds. I saw heaven. It was at this point I began to come down. I was still very much under the influence. My brother told me it was 11:59. I sat in a chair and began to think and occasionally speak.",
  "I now know that hallucenagens are in no way a toy. I realized that Salvia is meant only for the strong of mind and those close to God.</p>"
 ],
 "erowid": {
  "id": "33472",
  "citation": " a believer. \"Ill Prepared for What Was to Come: experience with Salvia divinorum (10x extract) & Cannabis (and psych meds) (ID 33472)\". Erowid.org. Dec 15, 2005. erowid.org/exp/33472",
  "substance": "Salvia divinorum (10x extract) & Cannabis (and psych meds)",
  "views": "3764"
 }
}
