{
 "id": 15168,
 "title": "Sussex Circle",
 "date": {
  "submission": "2004-07-08T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Claire",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "tea"
  },
  {
   "time": "1:00",
   "amount": "0.5 cups",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "tea"
  }
 ],
 "report": [
  "Recently I was invited along to a Shamanism weekend that involved the drinking of Ayahuasca. I got there on Friday night feeling very dispirited about the decision to break up with my boyfriend. The group had a communal dinner and got to know one another.",
  "The group was a mixed one, both men and women, aged between 31 to 60(?), with a variety of experience of such matters, from none at all to being very experienced. The Shamans who were leading the session announced that rather than waiting til the fourth weekend to drink Ayahuasca we would be drinking it on the last night.",
  "I decided to drink un completo or full cup which was what I drank in Peru. For me this is a very strong dose but within my capacity.",
  "So I went to the front and had a full cup which I threw back up five seconds later. After a while I was only getting very mild effects which was really annoying me. One of the Shamans had said to wait an hour and a half and if you want more come to the front for a top up dose(but only if you can sit up by this point). So I waited a while and then got another small dose from the other Shaman.surprise surprise I chucked it back up again.",
  "So I sat down again.Then things EXPLODED!.",
  "I was tripping my face off which was fine. Then all of a sudden I went to the level beyond tripping my face off. I kept on repeating 'I surrender,I surrender'(to Ayahuasca) whilst shaking uncontrallably from the cold. I appealled to the spirit of Ayahuasca to bring me down a level but she said that she couldn't and that I had to stay at that level all night. I didn't realise it but I was hyperventitilating, the Shaman who had been imbibing had to come down from his Ayahuasca trance to blow sacred tobacco in my face. Immediately this calmed things down for me and I felt that I didn't know who I was or or who anyone else was but knew that I was in England and that I felt safe and warm and loved. I have never felt so happy about getting smoke in my face and lungs. It smelt rich and tasted delicious",
  "The other Shaman helped me up and walked me to the toilet where Ayahusaca made love to me bringing me to orgasm and back to the room again. I closed my eyes and had several conversations with Mama Ayahuasca. She showed me where I was going wrong in my personal life and slapped me hard several times on the cheek for showing her disrepect but not praying to her daily. Then she helped me get rid of all the negative feelings i've been harbouring towards my ex-boyfriend of late and said 'Ayahuasca is Claire and Claire is Ayahuasca' and 'one is all and all is one'. She showed me physical doors in my mind which she got me to open to deal with past traumas.",
  "I started drifting back up to the next level of intensity so the Shaman who had not been drinking Ayahuasca had to come over and blow more tobacco in my face to ground me again. This took a lot longer and more effort than it had done the first time round. I lay on the floor listening to the Icaros.The session slowly ended and I managed to mumble the words toilet at the two Shamans whilst they were leaving. Between the two of them they got me to the lawn where I was immediately distracted by the mad visuals. I went back to the room crashed to the floor, Ayahuasca told me that it did not matter if the Shamans left me to go to bed as past, present, future were all one and that energetically they would always be present there. I spent the rest of the night lying in a huddle on the floor observing the energy that is always present but filtered out by the brain flying round the room. At dawn-break I stumbled off to the toilet and did the necessary feeling a real sense of sadness that things were returning to normal and that Ayahuasca was leaving my body.",
  "I could only drink Chamomile tea up til lunch the next day as my sense of taste couldn't handle the chemical taste of water.",
  "Two of the other participants gave me a big hug the next day and asked whether I was feeling delicate?.",
  "All together it was a great experience."
 ],
 "erowid": {
  "id": "33481",
  "citation": " Claire. \"Sussex Circle: experience with Ayahuasca(B.Caapi and P.Viridis) (ID 33481)\". Erowid.org. Jul 8, 2004. erowid.org/exp/33481",
  "substance": "Ayahuasca(B.Caapi and P.Viridis)",
  "views": "18414"
 }
}
