{
 "id": 15173,
 "title": "The Trance",
 "date": {
  "submission": "2007-11-27T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Voyager",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "4:00",
   "amount": {
    "unit": "mg",
    "quantity": "12.5"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "4:02",
   "amount": {
    "unit": "mg",
    "quantity": "12.5"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "This is my account of the sacared herb Salvia:",
  "I ordered the product (1 gram Salvorin A enhanced Salvia Leaf) last Thursday from one of the more expensive but reputable internet dealers and received the package promptly Monday afternoon.  I read every artical I could possible read about the subject prior to my purchase and leading up to its delivery at my door, but of course none of this prepared me in anyway at all to what I was about to experience.",
  "I followed the advice of the FAQ section of the website I ordered the product from and began to divide the gram into 20 equal doses.  They claimed that 1/20th of a gram would give the user a sence of what Salvia was all about.  So I drew the blinds, put on some soft music, made a comfortable place on my bed, and packed the 20th of a gram dose into my bowl, then fired it.  I inhaled deeply, and I held the smoke in my lungs until I started to feel the first sensations embracing me. ",
  "I must admit I was not prepared at all for what I experienced.  I expected the dose I took to be a very mild introduction to Salvia, but instead I felt an indiscribable pressure that was very unsettling.  I had my eyes closed, I saw and felt a double helix like a strand of DNA rotating in front of me.  I can say I felt like I was the double helix and my body was being twisted.  I opened my eyes and felt disorientated and saw everything as slightly fuzzy.  The experience ended and I was not sure I wanted to try Salvia again.",
  "About 2 hours later I tried again with a little less about 1/25th of a gram.  Same setting this time again.  After inhaling I released the smoke and that familiar pressure returned.  This time I did not stay calm.  I had to leave my room.  I grabbed my cup of coffee off the desk and a cigarette.  I went to the microwave to heat the coffee and at first tried to heat the coffee for 5 min then I realized that was too long and changed it to 1.5 min (only takes 30sec in this microwave) I hit the start button and went to the backyard to have a smoke.  Leaving my room did not help dissipate the feelings of pressure.  I smoked the cig (by now this trip is over) and got my coffee out of the microwave which had boiled over.  Again I did not know if I would ever really be able to enjoy this mystical herb.",
  "Later, around 2 am I finally muster the courage to try a chicken shit dose of about 1/4 of 1 of my 20 doses. I wait and nothing happens. 2 minutes later I fire up another 1/4 dose and feel something vaguly. I repeat this process slowly introducing more Salvorin into my body.  I am still slighly apprehensive but this time I lit insences and repeatidly asked for protection. I fall into a very relaxed dreamlike trance.  I cleared my head of distractions and my eyes were 1/2 open.  I felt amazing shivers of emotion down my spine like you get from a beautiful piece of music.  I could feel the rush up my spine then I feel the energy spew out from the top of my head.  This was amazing.  As I would feel myself leaving the trance I would take another small bump.   I was beging to understand the Salvia.  I could not have been any more relaxed and in peace with everything.  This feeling is far greater than with MDMA.  With each new hit I would add more to the bowl and go deeper into the trance.  I finally found the tunnel I read about so often.",
  "With my eyes only partial opened the crystal ashtry on my desk took the form of a crystal sphere the only light in the room was a candle and a lava light.  I eventually extinguished the candle because I felt it was detracting from the experience.  When I finally decided not to take anymore hits (4:30 am) I stood up and it felt so good to slowly sway my head and body from side to side.  I felt perfect harmony with the world.  ",
  "I went to bed and woke up more fresh feeling than I ever have.  Anytime I look at a spiral pattren I am reminded of my experience and I feel as if I can revisit my meditated state at any time with or without the Salvia."
 ],
 "erowid": {
  "id": "33501",
  "citation": " Voyager. \"The Trance: experience with Salvia divinorum (extract) (ID 33501)\". Erowid.org. Nov 27, 2007. erowid.org/exp/33501",
  "substance": "Salvia divinorum (extract)",
  "views": "2576"
 }
}
