{
 "title": "Cold Water Extraction vs Chewing Seeds",
 "author": "Nekom",
 "citation": " Nekom. \"Cold Water Extraction vs Chewing Seeds: experience with H.B. Woodrose Seeds (ID 1517)\". Erowid.org. Sep 10, 2000. erowid.org/exp/1517",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "135 lb",
 "report": "<p>After extensive research, I decided to try the Hawaiian Baby Wood Rose seeds.  I ordered 20 grams of seeds, which turned out to be a lot more seeds than I had thought.  Me and my friends B and S went fishing.  B scraped the fuzz from the seeds, which is reported to cause nausia and took 8 seeds.</p><p>We returned to B's house, where we picked up a case of beer which we intended to drink if the experiment fizzled.  We then went to S's house for the night, and me and S scraped 10 seeds each, ground them as best we could with forceps and a meat tenderizer, soaked them in cold water for about an hour and drank the water.</p><p>B had reported only uncomfortable feelings, but no major effects.  Within an hour, S and I began feeling quite tired and sick.  I laid with my head down for about 30 minutes, half asleep.  It was then that S decided to get his mom to take B home, and I walked to my house right up the road.</p><p>As soon as I stood up I began feeling very strange.  I walked home in a thunderstorm, very slowly, stopping in my yard to have a cigarette.  I went inside, said goodnight to my parents and went to my room. </p><p>I went to my computer and played mario for super nintendo on my emulator in slow motion, which was qutie entertaining.  I then watched david letterman, who had jackie chan on the show, and burst out laughing for no apparent reason.</p><p>After watching some TV I noticed that when the screen briefly went black, looking out the windows was strange.  I turned the TV off, leaving no lights on in the room, and watched the thunderstorm for an hour with a huge grin on my face.</p><p>I did not experience any visuals really, I would describe it as a euphoriant rather than a hallucinogen.  Overall, I would say it was very pleasant after the nausea wore off.  I called S the next day and he said he had the same kind of experience.  B only got sick.</p><p>From this I would recommend to anyone trying them for the first time to use a cold water extraction rather than chewing the seeds.  And don't expect an acid trip, it is NOT acid, but it is a very interesting journey.</p>",
 "year": "2000",
 "id": "1517",
 "gender": "Not Specified",
 "timestamp": "2000-09-10T07:00:00.000Z",
 "views": "15206",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 }
}
