{
 "title": "Three Trials",
 "author": "-bC-",
 "citation": " -bC-. \"Three Trials: experience with Valerian, Kava Kava & St. John's Wort (ID 15173)\". Erowid.org. Dec 26, 2003. erowid.org/exp/15173",
 "substance": "Valerian, Kava Kava & St. John's Wort",
 "bodyweight": "150 lb",
 "report": "<p>Note:</p><p>1. I have taken no medication 2 weeks prior to this experience.</p><p>2. I have explored many various psychoactives in the past.</p><p>3. I have a very mellow individual with very little stress.</p><p>We all have heard the various reports and articles about the healthy benefits from these herbs and the 'safer' methods of approaching a desire for relaxation, tranquility, and the diminishing of depression.</p><p>Experiment A:</p><p>I took Valerian capsules from an over the counter source three times a day (one at every meal) for approximately three weeks. I tried to compare all the factors the bottle listed. According to the instruction on all bottle labels, there is a waiting period of 2 weeks for the herbs to completely affect your mind and body. I used the third week to record all the noticable physical and mental effects.</p><p>Results: I noticed within the first two or three days a total lack of motivation. I would not exactly call it laziness or apathy, it was just an all around feeling of stillness (perhaps the best word to describe it). I felt a lack of desire to persue my daily activities. This feeling climbed every day until the 2nd week, where I began to actually obtain more positive effects of a lesser degree. I still felt a small amount of the 'stillness' but more just a heavy and tired body and mind that could rest very easily every time i was given a chance.</p><p>Overall: First series of effects where pretty uneven and actually varied in intensity throughout the week. It did in fact help me sleep easier at night, although waking it the morning was of no easier task. While the effects where noticable because I actually focused on them everyday, I seriously doubt valerian could be used to treat a patient with minor to severe anxiety or general nervousness.</p><p>Experiment B:</p><p>Kava Kava</p><p>I followed the same procedure for administrating the capsules into my diet by consuming them three times a day, one at every meal. This process was continued for three weeks. The Kava Kava was from an over the counter (and popular) source.</p><p>Results: Kava seemed to slightly enhance my comfort in public places and increase my desire to be social. Kava did not relax my body, or my mind for that matter, but rather the way I went about doing things. In saying, I mean my day was taken in more slowly and patiently. The manner in which I acted in my lifestyle was more focused. Since these effects were not very profound I am sure a certain percentage of these results where based on a normal placebo effect.</p><p>Overall: While Kava Kava was actually the herb that came closest to meeting the gaurenteed results, it was still not as strong as I was hoping it to be. Good for a capsule to go along with the daily vitamins. Once again, if your looking for something to help with social anxiety disorder and really take the edge off, I don't recommend this.</p><p>Experiment C:</p><p>St. John's Wort: Ok, This is the substance that has recieved the most attention from scientists and psychologist alike. Both accurately pointing out St. John's Wort to be benefitial in treating depression. The herb is said to promote general feelings of well-being.</p><p>Results: I am sad to say I experienced nothing. Although I was recently classified as having clinical depression, I am on no medication and this Herb seemed NOT to affect me in any way noted. Even if I tried to concentrate on my overall mindset it was impossible to feel or see any changes in my everyday stream of conscience or my general emotional feelings.</p><p>Overall: I don't think I'm depressed in the least bit, so this could very well be the case. Aside from that, the decision to try this herb is up to you and your research.</p><p>                                -bC-</p>",
 "year": "2002",
 "id": "15173",
 "gender": "Male",
 "timestamp": "2003-12-26T08:00:00.000Z",
 "views": "27153",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "St. John's Wort",
   "form": "(capsule)"
  }
 }
}
