{
 "id": 1518,
 "title": "Enjoyable and Overdose (Log)",
 "date": {
  "submission": "2005-01-14T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "mikeyMarb",
  "gender": "Male",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "After experiencing many highs off of Ritalin, I decided to write a log of my experience having a good high on this drug, and another log of having an experience with too much of this drug",
  "-Good Experience-",
  "8:30am, I was given one 20mg tablet of Ritalin, as prescribed for ADD. I decided to grab two more tablets, so I can enjoy a nice high. I then swallowed them.",
  "9:00am, I started feeling the effects, my mood is very high, since I have the whole house to myself until 3:00pm, I started to enjoy my high.",
  "9:05, started to feel a warm, comfortable, relaxed feeling flow through my body, sitting on the computer, I decided to listen to music and have a cigarette, the music made my mood about 3 times better than usual, I sat their with my mouth open in a trance to focus on one thing, as I puffed my cigarette, it felt purely wonderful, tasted alot better, the rush of the cigarette combined with the effects of ritalin, was heaven.",
  "9:30, sat talking to people in chat rooms, I felt a connection with everyone, and a sense of bonding.",
  "10:00, I continued to do this, my appetite was down, no desire for food at all. at there enjoying myself, let me tell you, time flies by really fast.  I decided to do homework, homework was actually fun to do, writing with a pen..it was great.",
  "These effects went on until about 1:00pm, after that I had mild depression, anxiety, tension,...a craving for more",
  "- The overdose -",
  "9:00am, a few days later I took 4 tablets, and a half of one, the effects came in about 9:30, for some reason I felt uncomfortable",
  "9:25am, I felt very uncomfortable, I felt like I was in a bad haze, felt very dumb, with a low IQ, the thoughts in my head felt a little un-real, like being half asleep..and visualizing, or saying the wrong things about a situation that doesnt exist..I felt tired, my appetite wasnt gone alot..it was very weird, and very uncomfortable, this went on for about 4 hours, after that I was calm the whole day, with anxiety, depression, and so on..",
  "This substance to me is very addicting, and it ruined relationships with others, I do not have the energy to give this up, so people be safe."
 ],
 "erowid": {
  "id": "14724",
  "citation": " mikeyMarb. \"Enjoyable and Overdose (Log): experience with Methylphenidate (Ritalin) (ID 14724)\". Erowid.org. Jan 14, 2005. erowid.org/exp/14724",
  "substance": "Methylphenidate (Ritalin)",
  "views": "30172"
 }
}
