{
 "id": 15180,
 "title": "Tired Like a Zombie and Depressed",
 "date": {
  "submission": "2004-09-16T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "psychonomist",
  "gender": "Male",
  "weight": "78 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  },
  {
   "time": "0",
   "amount": " T+ 2:00",
   "administration": "1.0 g",
   "substance": "oral"
  },
  {
   "time": "Tabernanthe iboga",
   "amount": "(rootbark)",
   "administration": "",
   "substance": "5.0 mg"
  }
 ],
 "report": [
  "<p>I have used effexor until two years ago and have taken small amounts (100/200mg?) of iboga extract with this and had a nice stoning effect. It helped me to stop my newly acquired habit of smoking 4 or 5 cigarettes a day.",
  "Recently I tried a gram of good strength root bark, after having taken 50mg of 5-htp a few hours before. The effect reminded me a bit of MDA, but only when lying down was the experience pleasurable. The next two days I had sudden flashes of light in my peripheral eyesight and the occasional feeling the world had suddenly shifted or trembled in my view, this was disturbing. After one or two weeks the nice serotonin feeling of the iboga and the reduced need for alcohol and nicotine gave way to a bit of dullness. I took five mg deprenyl and the week after was terrible, I felt dull and tired like a zombie and depressed (not my normal reaction to deprenyl which I take to lift my mood and provide some energy). Taking 5htp against the depression did not work at all, whereas normally this works like a charm for me.",
  "Friends of mine have also reported to mostly get an energetic boost from small amounts of iboga (to quit smoking), but occasionally get depressed. Since this substance affects the body for so long after taking it I think a warning is in place. Since harmaline has shown some of the same effects on addiction, maybe it is a more suitable substance since its effects last shorter, and mood effects seem to be more favorable. Of course it would have to be taken more frequently (weekly?) and take care of MAOI precautions.</p>"
 ],
 "erowid": {
  "id": "33517",
  "citation": " psychonomist. \"Tired Like a Zombie and Depressed: experience with T. iboga (root bark), 5-HTP & Selegeline (ID 33517)\". Erowid.org. Sep 16, 2004. erowid.org/exp/33517",
  "substance": "T. iboga (root bark), 5-HTP & Selegeline",
  "views": "21557"
 }
}
