{
 "id": 15186,
 "title": "Oneness and the Obnoxious One",
 "date": {
  "submission": "2007-03-19T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "RiaN",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "A friend had told me of this Salvia Divinorum drug that would produce similar effects to DXM, which I had come to enjoy, but had vowed to quit for fear of health risks. I was convinced to buy some 10x extract leaves sold as incense at a local headshop. My friends and I divided the cylinder of Salvia and smoked, though none of us achieved any effects.",
  "One month later, after getting off work, I was invited over to Robert's house, Robert being the one who had told me about the drug. Present at the house in its concrete and cramped basement were myself, Robert, Jesse, Josh, Jeremy, and Heather.",
  "I was allowed the first hit of the SuperSalvia that Robert and Jesse had concocted. It was made by soaking the leaves in the liquid and then allowing the liquid to dry, or so I believe. I held the lighter to the cigarette shaped pipe and inhaled.",
  "The smoke was far more pleasant than cigar smoke, and even marijuana. I had taken a large hit and had read enough to know to hold the smoke in for about 30 seconds. After 20 seconds had passed, everything seemed to 'elongate', my perception changing drastically. Everything 'felt/looked' sharp in a sense. I had completely forgotten about who I was, were I was, and why and when. It was an instant ego loss. My arms sat in my lap holding the lighter and pipe, but to me, they formed a horizon, and my vision beyond my lap was the sky, taking on a very Mario Brothers look, possibly because the couch was orange. I was in a completely new world, and I WAS the world, and I viewed it subjectively.",
  "'You should take your second hit, dude,' said Robert. 5 seconds had passed.",
  "'Is he feeling it?'",
  "I stared down at my arms confused to no end. I'd bring my hands closer to my face, preparing to take another hit, but this would disrupt the environment that I had created, and felt completely catastrophic, and so I would immediately and apologetically bring my hands back where they were. I was ready to enjoy this.",
  "'Oh yeah, he is DEFINITELY fucked up.'",
  "Unfortunately, one individual who was sitting next to me was very detrimental to the trip. As you likely know, Salvia is not a social drug. Well, this guy would not shut up, nor would he hold still, or even worse, he would not be himself. While on Salvia, I saw THROUGH him. After a few moments of failing to get deeply into the trip thanks to his restlessness, I announced, 'You are afraid, and you do not know who you are, nor do you know how to relax. Fear conquers you. Shut the fuck up.'",
  "Of course he didn't. It had been nearly a minute in real time since I had taken the hit. Of course, to me, time no longer existed. I found myself wanting to get more comfortable. But, I could not sprawl out on the couch, because said individual was on it, being obnoxious. The others also began to converse amongst themselves, making it difficult for me to get into my trip. I had the desire to be outside, and invited others to join me, being that I wanted to involve them in what I was feeling. But I couldn't find the door. So, I layed on the cold, hard concrete and stared at the ceiling.",
  "Salvia created a feeling of merging with everything around me. I felt an incredible sense of oneness with everything. I came to realize that 'we are all in this together, and we are all one'. This was a very sure realization, and I was amused and slightly saddened that these simple creatures in the room with me did not understand the truth. After perusing the idea of One, I suddenly broke through their conversation saying, 'Quickly! Tell me about God, if it is only an idea or abstraction!'",
  "The annoying one interrupted with, 'There IS no god.' To which I responded, 'You are an arrogant retard, and there is no possible way that you can be absolutely sure of that. You have only put your own ignorance in bold for the rest of us. Try thinking.' I am an agnostic. Jeremy was confused at the question and could not supply an answer. Again, I wanted to go outside. Of course, I was beginning to come down.",
  "Heather, Robert, and I went outside and sat in my car and talked. After a few minutes, she became cold and went inside. Robert supplied me with the pipe and asked if I wanted to try again in the solitude of my cold car. I obliged. He began to drill me on avoiding a bad trip, as I held the smoke in. This did not help, and I was coming to dread a bad trip, and as I felt fear grasp me and I lost sense of identity, I waved my hand at him, suggesting that he shut up and let me trip.",
  "Again, I struggled for comfort, and ended up laying across the seats of the front of the car, Robert in the back. Looking out the window, the pawn shop across the street seemed to not so much melt as merge with everything else, as always. The cold made it difficult to really trip, not to mention the discomfort of the car and the fogginess of the windshield. I got out of the car and climbed on top and laid on the roof, while Robert silently exited and stood vigil to be sure I didn't do anything stupid. In my ascended state of mind, I deeply respected him for this.",
  "We soon decided that we were going back inside. Heather had begun drinking, and I asked Jeremy to take me for a ride in his car, namely for warmth, the company of a good friend, and freedom from the obnoxious one. The drive itself was likely only five minutes, but again, time wasn't a factor.",
  "As we arrived at the intersection to one of the main roads, I suddenly came to understand that our personalities, our egoes, are actually just masks. Our true selves are based on simply being. I realized that even LANGUAGE is an illusion, just sounds with implied meaning. That is why words cannot do anything justice. By the way, money is an illusion too. I reflected on our unity and our true nature as the lights passed us by.",
  "When we returned, Heather was quite drunk, and we spent the next hour keeping her from faceplanting on the concrete. We had her sit in the car while I explained the trip to Jeremy.",
  "I believe that psychedelics like Salvia and DXM activate parts of the brain normally not used. This would explain the godlike state of mind I achieve while under their effects. Salvia itself is very powerful, and not a recreational drug, but a very introspective drug. I recommend it to anyone looking for a serious and intellectual, possibly spiritual experience. If you're looking to get fucked up, take shrooms or guzzle cough syrup.",
  "I look forward to tripping again on the Great Sage."
 ],
 "erowid": {
  "id": "33537",
  "citation": " RiaN. \"Oneness and the Obnoxious One: experience with Salvia divinorum (ID 33537)\". Erowid.org. Mar 19, 2007. erowid.org/exp/33537",
  "substance": "Salvia divinorum",
  "views": "3657"
 }
}
