{
 "title": "Intimate Afterglow",
 "author": "Sunchaser",
 "citation": " Sunchaser. \"Intimate Afterglow: experience with 2C-I (ID 15186)\". Erowid.org. Jun 5, 2002. erowid.org/exp/15186",
 "substance": "2C-I",
 "bodyweight": "170 lb",
 "report": [
  "<p>I prepare very carefully for psychedelic experiences, especially new ones. This one had been planned for four months with one close friend at a country cottage. It was a beautifully sunny day which we spent in the colourful garden.",
  "I had thought that 2-CI was going to be close to 2-CB which I had taken three times before at the 20mg level. We both took 15mg at exactly midday. I felt the first alert at about the half hour mark and it was very clear after an hour that this was going to be closer to LSD than 2-CB. The intersuggestability of feelings, visuals and music was very close to LSD whereas 2-CB has 'out-there' intricate visuals which are beautiful but less involving. I will do 2-CB in public but would not want to have been interacting with strangers at this level of 2-CI.",
  "It carried on building nicely until two hours where the depth stopped and fell short of LSD. Whereas with LSD I feel thrown into the experience, with 2-CI I started to feel disengaged. After a while I realised that I could move in and out of the experience which was a disappointment at first but later I realised that this could be very useful especially for insight.",
  "I felt 2-CI was raunchy whereas 2-CB is sensual. I would have loved to have been able to make it a more sexual experience but that wasn't possible on this occasion. For two hours I was able to take stock of my life and became aware of anxieties that I wasn't aware of before that are blocking me. Sobbing at the freedom that this brought (facilitated by the beauty of the music) I felt renewed. This was more on an emotional level whereas LSD would be working with more depth at a spiritual level.",
  "At the four hour mark we started talking and for two hours the conversation flowed easily and intimately, such a good chance to truly catch-up with where we and our lives are. After six hours we felt like a walk and some food and walked a mile to the pub. The warmth slowly wore off over the next three hours and I would say at nine hours I was back to base-line.",
  "I would certainly do this again and would up the dose to 20-22mg.</p>"
 ],
 "year": "2002",
 "id": "15186",
 "gender": "Male",
 "views": "8592",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2002-06-05T07:00:00.000Z"
}
