{
 "id": 15199,
 "title": "Trapped In Thought",
 "date": {
  "submission": "2006-10-28T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Think2Deep",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "60"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "The power of Adderall is unbelievable, but there is no such thing as a perfect drug and Adderall is no different.  I have used this drug countless times and only now, at the exact time of writing this, have I realized that my problems can only grow worse from using something so good.",
  "May 15, 2004 - Today is Friday.  I have ten days until my high school graduation.  I start my morning by waking up at 7:00 a.m., getting a shower, and eating a peanut butter and jelly sandwich.  I am aware that I will be receiving three 20mg pills of Adderall today from a friend that I called last night. ",
  "At 7:30 I am at school and first period is about to begin.  I received the Adderall from my friend moments before class and immediately take one of the pills.  About half way into first period I began to feel the increase of senses throughout my body and the motivation to work, which are the desired results of taking Adderall.",
  "I go to a computer repair class at vocational school from 2nd to 5th period everyday so after first period I get on the bus to leave for vocay.  At this time I am feeling the Adderall good, leading to talkativeness and having deep conversations commonly.  When I arrive at vocational school I pop another 20mg pill and begin to write my first of two reports (which was the reason for me asking my friend for the Adderall in the first place)  My thoughts are flowing quickly and efficiently resulting in a well placed and informative report.  Yeah I nailed the fucker.  In about 15 minutes I had already completed the first report which was about a page long.  I begin the second report and complete it in about 10 minutes with satisfying results also. ",
  "Now the second pill is working full boar.  I feel as though I could describe the whole meaning of life in a 100% logical way, with ease.  Next on my agenda was to complete a test for my comp repair class.  I took the practice test first, which has an answer checker to all the questions. I memorized almost all the answers to the test after doing it only once, and it was a 55 question test.  I took the real test and easily recalled all the answers from the practice and got a 97% on it.  I goofed off for the rest of the class playing games and stuff until we left.  When I got back at home school I was starting to feel jittery because I hadnt had a cigarette since I woke up.  Even so I kept my cool through sixth period, paying much attention to the teacher and then proceeded to seventh period.  I then decided to pop the last pill...bad move.",
  "This is when my day begins to get bad.  Although I had a vocab test which I scored well on, this period was not much fun for me.  When the final pill began affecting me I began to have a strong feeling of insecurity.  It felt as though my mind was moving so fast that I couldnt process anything from my brain to my voice.  This led to me saying random things, many of which didnt make sense Im sure.  I realized I was doing this but there was nothing I could do, I just had too many thoughts to comprehend.  I felt like I couldnt act normal and all the social joys of Adderall had transformed into fears of making myself look stupid.  I remained as anti-social as possible for the remainder of the class.  When the bell rang I was very relieved that I was leaving school and getting away from any social situations. ",
  "I went home and smoked a cigarette which made me feel a bit more secure so I called one of my friends and went swimming with him around 3:30.  While we were out there I could tell I wasnt myself.  Normally I would be ecstatic to swing from the rope and jump out of the thirty foot tall tree into the water, but because of the amount of Adderall in my body I had a strange fear of doing these things.  My voice was shaky and my self esteem was very low at this point, I just wanted to be home but because I told my friend id be at his house tonight I got dropped off there at around 6:00.  This was no fun at all.  I didnt want to talk to anyone and I was having a horrible time, having no interest in anything that was going on...the only emotion I had was the fear of doing something stupid.  I left with a friend for a couple of hours to go to get his girlfriend.  We also stopped by the pool hall and went to a restaurant.  All this time, still feeling antisocial, all I could think about was wanting to go home. ",
  "Around midnight I got dropped off at my house and proceeded to write this report.  It is now 2:30 in the morning and I have no chance of falling asleep,  I feel depressed and as of now nothing seems good at all.  There is no way I could get excited over anything at the moment.  I decided to write this because I know that I am still under the effects of the Adderall, but all recreational effects have long since passed.  The only way for me to keep myself from dwelling on how bad everything is right now is to keep my mind busy by writing this."
 ],
 "erowid": {
  "id": "33604",
  "citation": " Think2Deep. \"Trapped In Thought: experience with Amphetamines (Adderall) (ID 33604)\". Erowid.org. Oct 28, 2006. erowid.org/exp/33604",
  "substance": "Amphetamines (Adderall)",
  "views": "15901"
 }
}
