{
 "id": 15191,
 "title": "The Disappointing Foxy-Flip",
 "date": {
  "submission": "2001-12-03T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "HeWhoLives",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "15",
    "grams": 0.015
   },
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I've thought for a long time that this combo would be magical. Both drugs give me similar body effects. So I reasoned that the combination should be a full body orgasm.",
  "So one night, I decided to try this out at a rave. The set and setting probably contributed to my disappointment. I stayed up all night long in another town trying to bail my friend out of jail the night before. Before going to the rave, I contemplated just going to bed and not staying up for another night. However, I didn't want my free weekend to be wasted. When I got to the rave I noticed that my usual friends were absent (I went to the rave by myself). Also, some of the people there were club kids. This atmosphere was unfriendly and somewhat boring.",
  "Anyhow, I opened up the gel cap containing 15mg of Foxy and ate that around midnight. Half an hour later I felt it coming on. Then I dropped the E, which had an imprint of an English lion on it. I tested it with a test kit and it tested positive for an MDMA-like substance.",
  "To my suprise, the 2 drugs contradicted instead of complemented each other. The Foxy, as usual, made me feel like laying down, while the E made me feel like dancing. When the phat house beats enticed me to dance, I quickly tired and had to sit down. The E made me want to",
  "talk to people but the Fox put just enough 'twist' on my mind so that I had trouble being coherent (yet, as usual, there was nothing transcendental about the mind effects). The body effects were not especially noticeable, but then again there weren't too many roll piles and there weren't too many friendly people to help me experience the body effects.",
  "Like I said, the set and setting probably had something to do with my disappointing experience. I was pretty tired, the vibe was more of a club vibe, and my friends were absent. The experience might have been different if I had done this at home with a lady. But even then, only the body effects would be enhanced. The nice talkativeness of E would still be hampered by the Fox.",
  "In short, my experience was a waste of good Foxy and good E."
 ],
 "erowid": {
  "id": "3355",
  "citation": " HeWhoLives. \"The Disappointing Foxy-Flip: experience with 5-MeO-DiPT & MDMA (ID 3355)\". Erowid.org. Dec 3, 2001. erowid.org/exp/3355",
  "substance": "5-MeO-DiPT & MDMA",
  "views": "8881"
 }
}
