{
 "id": 15200,
 "title": "A Strange, Frightening New World",
 "date": {
  "submission": "2007-05-01T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ny",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "I bought a gram of 7x Salvia extract from a local headshop earlier this week, after reading about it for months.  I was very eager to try it, so while at a friend's house, we loaded up a water pipe with the extract.  I was in a very familiar place, in a good mood, after a fine week, and had two sober sitters with me.  However, I was quite nervous at the prospect of experiencing some of the things I had read about.  The first hit I took was probably about 1/12th of a gram.  I inhaled all of it in one hit, and quickly loaded another of about the same size.  I exhaled the first hit and immediately hit it again.  After these two hits, my surroundings began subtly to change; I saw beautiful shimmering liquid patterns 'behind' most objects, just beneath the surface of the actual objects.  Foolishly, I loaded up and smoked two more hits, both quite large.  As I was exhaling the fourth and final hit, I was violently transported out of coherence.",
  "I felt myself being strongly pulled down onto the pillow that I was sitting on, and curled up into the fetal position, covering my ears from any outside interference.  As soon as I closed my eyes, I lost all sense of spatial perception.  I was still aware that there were two other people with me, but they might as well have been miles away.  With my eyes closed, I saw a circular, three dimensional tube pulsating in front of my eyes.  At this point, I opened up my eyes, and noticed that I could see through the ceiling of the room, and hulking above the house were two gigantic, shapeless, incredibly malevolent beings.  The beings were there to take me away from everything I had accepted about our world.  At this point, I was transported inside a 'spaceship' where I was subjected to various experiments.  Among them were electric shocks, which caused my body to convulse violently on the ground.  The most terrifying experiment occured when I became aware that the 'aliens' were controlling the seasons outside the window; summer became spring, winter became summer, at seemingly random intervals.  The beings were exerting their power just to show how much larger and more powerful they were than me.  I started yelling 'Room 101! Room 101,' in reference to the torture room in the novel 1984.",
  "At this point I began pleading with the beings to let me return to our world.  My friends informed me that I was making disturbing, guttural, gurgling pleads for help in between series of convultions.  Briefly, I became conscious again of the world as we know it, and for maybe a minute was coherent again.  However, I soon felt myself being pulled back down to the pillow I was sitting on, and merged with the carpet.  For a terrifying few minutes, I was unable to escape the capet.  After this, I became more coherent, and was able to describe to my friends the horrifying experience I had just been through.  However, as I was talking through my experience, I kept having extremely paranoid thoughts and was still convinced that the aliens I had encountered were real.",
  "The whole ordeal lasted about 20 minutes, and for the next hour or two, I felt like a gigantic part of my brain had been entirely obliterated--I was withdrawn, and excessively introspective, and especially worried that I would never return from this paranoid state. ",
  "Luckily, I woke up this morning at home and feeling completely normal mentally, albiet a bit scarred from the mental lashing I was given last night.  I think in the future, I will try Salvia again, but will approach it with much more caution.  I think it is important to approach Salvia with a certain reverence and respect, simply because of the tremendous power it has, especially in concentrated form."
 ],
 "erowid": {
  "id": "33605",
  "citation": " Ny. \"A Strange, Frightening New World: experience with Salvia divinorum (7x extract) (ID 33605)\". Erowid.org. May 1, 2007. erowid.org/exp/33605",
  "substance": "Salvia divinorum (7x extract)",
  "views": "5500"
 }
}
