{
 "id": 15206,
 "title": "Euphoria and Paronoia",
 "date": {
  "submission": "2006-12-25T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ramonesdude",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "At about five o'clock in the afternoon I took ten caffeine pills and washed them down with a bit of cheap wine (not much more than a mouthful so I was sober). I was at a train station and had to wait an irritating amount of time for a train.",
  "The caffeine hit suddenly and I realised my leg was shaking. At about five thirty the train arrived and I had an odd sensation that the train station was moving but not the train (if that makes any sense). I got on the train and sat down. When I looked out the window at the green plants zooming past I had a small amount of colour distortion. Everything had a tinge of yellow or grey to it. A strong euphoria set in that I can only compare to codeine. I felt like I was melting into the chair and whenever part of me twitched it felt like it was made of water.",
  "Once I got off the train and entered the masses of humans at the train station my mood suddenly changed. I had a sudden dislike for almost everyone and glared at anyone who made eye contact with me. My view of life suddenly changed and I thought only weird people were worth talking to. I hated people for not rejecting the morals of society and truly becoming themselves. I thought conformists were just idiots.",
  "That was my view on the world for about ten minutes and then suddenly I believed everyone was just born to kill me and I feared everyone. I looked no one in the eye and walked fast, really fast.",
  "After about half an hour of chemical paranoia I got distracted by some fireworks. One thing about a large dose of caffeine is it can make everything look cooler. Every time a firework exploded I had difficulty focusing on it and it seemed to grow and shrink like it was breathing.",
  "From then on things died down and I felt physically weak and tired as I had probably over-exerted myself. I also began to get a bizarre anticipation that something dramatic would happen (nothing did). Once home I had difficulty sleeping but felt fully energized after two hours sleep.",
  "After this event (which was my first experiment with caffeine) I had a fascination with the drug. I experimented with addiction, withdrawal, good dosage and over dosage. The largest amount I ever took was 4 grams [EROWID NOTE: 4 grams is a high dose] which caused severe organ pain and put me in the sort of mind frame that made me intentionally force a safety pin through my thumb."
 ],
 "erowid": {
  "id": "33624",
  "citation": " Ramonesdude. \"Euphoria and Paronoia: experience with Caffeine (ID 33624)\". Erowid.org. Dec 25, 2006. erowid.org/exp/33624",
  "substance": "Caffeine",
  "views": "10425"
 }
}
