{
 "id": 15210,
 "title": "Buffeted by Gravity",
 "date": {
  "submission": "2007-03-06T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Byzantium",
  "gender": "Male",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "The following are a few of my first proper salvia trip reports. Up until this point I'd only ever tried the normal leaf, and found the effects barely noticable, and a couple of times I'd tried utilising the quid method, which also proved unsucessful, even at 5 grams.",
  "Having had no luck with all previous experiences of non-fortified leaf, I decided to really go for it and see whether I was screwing up somewhere along the line or just hard-headed. I measured out 1/20th of a gram of 5X extract and loaded it into a medium-sized bong, and took it all down in one hit. There was really no anticipation or fear. Looking back, I don't think I was expecting anything to happen - I'd never had any luck with the plant before.",
  "The next thing I know, I'm shifting the bong away from the vicinity of my feet and then *poof* - gone. I have no recollection of the next ten or so seconds, but when I did regain consciousness my head seemed to be part of the wheel of an old stone watermill. The whole situation was immensely strange; for a few seconds I actually *was* the wheel. I was not a human being, in the sense that I had the ability to appreciate and philosophise about existence. I had absolutely no control over my faculties. It was like I was posessed, bound by duty, in this case, the laws of physics, to carry out my task, which was to spin around. The strangest thing was the physical effect it had on me: I was rolling my head around like you would when warming up for the gym.",
  "After a few seconds I realised that it was the salvia that was causing all this, but try as I might I could not stop my head from being pulled in a circle. I also now felt the presence of maybe some kind of leprechaun creatures off to my left. They were definately clad in green attire, that I was sure of. In fact, everything had a greenish tint to it. I later realised this was probably because my walls are painted green. Pretty obvious, I know, but then you tend not to notice things like that at the time.",
  "I think I loaded up another bowl (I was quite heady), but I do remember at some point staring at the carpet and seeing two-dimensional patterns morphing into things like the outlines of faces. They had a quality more like sand being disturbed from underneath. Also, the music playing, a combination of gentle fluting and gregorian chanting, seemed deeply profound. I can't really explain it, but it was as if the musicians were observing me from far away.",
  "Overall, all I could conclude was that S.D. was incredibly strange. I can't honestly say I gained anything from the experience, but it wasn't unpleasant either. Overall, on the S-A-L-V-I-A scale I would probably have it down as a Level 3.",
  "The next time I tried salvia it was again in my room. I was determined to try and make some sense out of the experience this time, and maybe because of that it was rather uneventful. I had this strange feeling of resistance against any attempts to 'figure it all out', and found myself becoming a tad frustrated at my head's tendency to start drifting off into a circle again. I'd stop myself from doing it, but it always found a way of beating me - I remember distinctly thinking 'Oh, what's that on the floor over there to my left? And on the roof up there? And now to my right - hey, I'm spinning again!' Not really an inspiring experience.",
  "This annoyed me slightly. The first time it was a novelty, but if all I was going to get out of salvia was neckache then what was the point? Not one to give up, I later went over to a friend's house to introduce him to Sally D, and to see if he would suffer the same bizarre phenomenon. He said it just made him feel really heavy, and laughed heartily at apparently nothing for a short while. I was feeling very relaxed by now, so I decided to up the dosage for my hit - nothing excessive, just an incremental increase. I held the smoke in for longer this time, and only vaguely remember exhaling, before muttering something like 'I'm going, just lie down on a jacket' and rolling flat on the floor.",
  "And then I'm there again. I have no ego, no concept of the outside world, and although I am aware of the room I am in, it is irrelevant: all I am focused on is this huge wooden wheel - either of a horse-drawn cart or a carriage of some sort. The leprechauns are driving it (I can't see them though), and I am caught up amongst the spokes and being pulled along, left to right, as always. I very briefly lapse out of this. That's something I find very disconcerting about salvia. You can be utterly gone one second and then back the next, with just enough time realise that you're tripping, before having your attention dragged back to whatever it was you were preoccupied with before. I can see splodgy green prints on the floor from where the cart has been. I wouldn't exactly call it a hallucination. Maybe more like the way you convince yourself that some clouds are in the shape of something. Nothing concrete.",
  "I won't bore you with more of the same, but I will say that the last time I smoked S.D. It was a rather unpleasant experience - the 'wheel' apparently grows in size each time I enter its world. This time it was at least as tall as my room, and I felt overwhelmed. I managed to resist being dragged across the floor and escaped for some fresh air, where I nearly began rolling about in the street. I was freaked out by the lack of control I had over the situation and how it could have ended up, and I haven't tried salvia since, although this is for 'financial reasons', or being skint, really."
 ],
 "erowid": {
  "id": "33633",
  "citation": " Byzantium. \"Buffeted by Gravity: experience with Salvia divinorum (5x extract) (ID 33633)\". Erowid.org. Mar 6, 2007. erowid.org/exp/33633",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2903"
 }
}
