{
 "title": "Shrinking into an Infinitely Small Space",
 "author": "punkrockmike",
 "citation": " punkrockmike. \"Shrinking into an Infinitely Small Space: experience with Marijuana (ID 15216)\". Erowid.org. Jul 1, 2005. erowid.org/exp/15216",
 "substance": "Marijuana",
 "bodyweight": "165 lb",
 "report": "<p>When I first tried MJ, my friends said nothing would happen to me, I would just laugh. This was true, I laughed a ton for about 10 minutes. Then somebody who was with me asked for my phone number. He gave me a pen and paper, but when I tried to write, I couldn't move my hand. I lost complete function of my left hand. After about an hour I was able to write again, and in the meantime, I couldn't feel my legs (yea like in the movies).</p><p>The second time I tried MJ, my friends had constructed a gravity bong out of a 3-gallon arrowhead water bottle. The burn chamber was a 5/11 socket wrench piece. He lit me a huge GB hit, and I couldn't finish all of it. I held it in for about 3 seconds when I let out a gigantic cough. I ran over to his toilet cuz I thought I was gonna vomit. I didn't puke and I was ready for another hit. Taking a second hit, I didn't cough nearly as much and held it in for about twice the time. I sat on his couch for about only 1 minute before I felt it.</p><p>Holy crap. All of a sudden I heard a high-pitch noise, which I identified as the whine most TV's make. My body felt like it exploded. All 5 of my senses were boosted, especially feeling. I could feel every molecule in my body. This was great except I was afraid to stand up. Then all of a sudden my heart-rate skyrocketed. I lost complete control of my body, and began to get scared. My friend said 'grats bro you're high'. I said cool but I was not cool. It was fucking scary for about 2 hours while I was super-zonked.</p><p>After about the 2 hour mark, though, I gained back control of my body. At the same time, time itself was distorted for me. The next 4 hours seemed only like a few minutes. Life itself became a slide-show with only 1 frame out of 1000 registering in my brain.</p><p>At about this time my second high had ended.</p><p>During later experiences I had started to get bored with MJ. All until one time when I decided to focus more on my high instead of people around me. This was amazing. I set my mind into a positive state repeating 'I am in complete control of my high, and I can affect it in any way.' Suddenly I felt my body explode just like my second high experience. It was like smoking out for the first time all over again. I read about people on acid trips and how they imagine their body shrinking and expanding. Immediately after thinking about this, I felt tingling on the very top of my head. The tingling then turned into an intense vibrating. I touched the top of my head and then all of a sudden my body felt like a sword was splitting my body in half starting from the top. This was very cool, as it felt my body was split perfectly in half, and separated by about 6 inches of empty space. After my body 'melted' back together, I wondered if I could distort myself in any other way. I saw a physics book, and on the cover was the infinity sign. I then began reading about black holes and how they were infinitely small. My body all of a sudden started to feel like it was being sucked into a black hole, centered in my stomach. I put the book to my side and let myself shrink into an infinitely small space. I couldn't let myself get out of this state of infinite smallness, but then I remembered reading about supernovas in the physics book and then my body felt like it exploded just like a supernova.</p><p>Since then, I try to duplicate these situations whenever I smoke out, but It usually takes a decent amount of dank smoked in a GB.</p>",
 "year": "2002",
 "id": "15216",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-01T07:00:00.000Z",
 "views": "5425",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
