{
 "id": 15211,
 "title": "A Frightening Trip to Heaven",
 "date": {
  "submission": "2006-11-14T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "T",
  "gender": "Male",
  "weight": "290 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0:02",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0:10",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0:00",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 ],
 "report": [
  "Just the other day I was walking by an old friend's house.  I hadn't seem him in years.  As I was walking by they called my in and I went into his room to see him.  My friend (let's call him K) is paralyzed in various parts of his body.  I hadn't seen him since before the accident so I was a bit overwhelmed at the sight of him.  This once active guy is now bedridden.",
  "We were chilling with his brother just chatting and catching up on stuff when his brother started talking about his opinions on several different things.  That may sound irrelevant but you'll soon understand why I added that.",
  "After about 20 minutes I still wasn't too comfortable because it had been so damn long.  K asked if I smoked, I said yeah, and he had his brother (we'll call him S) get his hookah.  S packed a bowl of some VERY skunky stuff and lit it while K took the first hit.  Then S took a hit and then me.",
  "It was a very hot day in the high 80s.  The room was very nice though compared to outside, the AC was blowing right on me.",
  "About 2-3 minutes later we all took another hit.  Then finally about 10 minutes after our first hit we all had another.",
  "The high came on very fast and we were listening to rap, something I was never a big fan of.  Soon after I decided to light a cagarette and after smoking about half of it I noticed I was swaying to the beats.  I had come to the end of the cigarette and was taking my last drag when my vision left me, I felt around quickly for something to hold onto but nothing was there and I fell forward...Thank god his bed was right in front of me.",
  "S pulled a stool behind me and told me to sit down.  My vision came back about 30 seconds after it left.  I put one hand on the foot of the bed and the other was resting on my lap.  I was staring at the carpet and the patterns were shifting, expanding, and changing colors.  I looked up and the room looked a lot darker but much more colorful.  I was completely panicked!",
  "I thought that I was going into one of those seemingly rare marijuana trips.  I tried so hard to fight it and after about five minutes of heavy fighting I thought I was coming down.  Everything was getting lighter and back to normal.  I was suddenly overcome by an ache in my back so I laid down.",
  "I was worried about lying down because I could tell both K and S were nervous about what was going on.  I was extremely comfortable on the floor, I had no pillow or head support but I didn't care.",
  "After about five minutes I became very uncomfortable again.  At first I thought I'd wait for it to pass but when it didn't I realized something - waiting does absolutely nothing.  You have to fix things yourself because they won't do it for you.  I liked this a lot because I'm a huge procrastinator.",
  "It stayed like that for about two hours.  Every five minutes or so I had to readjust myself.",
  "During those two hours I listened to K and S talk and it was just so amazing.  I completely understood why S had all those opinions.  They're not brothers but you would think they were.  They got along so well.  The family in that house was incredible.  They were all so nice and full of love.  It was SO amazing.",
  "Basically I felt like everything is so loving, nothing was worth getting angry over, I was in touch with everyone.  I lied there thinking about friends of mine, some of em I only had good thoughts about and others I only had bad.  There was no in between.  I now know who my true friends are.",
  "I finally was able to stand so I did, I walked home with a limp but I wasn't in pain.  I walked that way to keep me from stumbling.  I went straight into my room where I sat in a trance-like state of thought.  I learned a lot from it.",
  "Finally I fell asleep and woke up two hours later with something like a marijuana high but only physical effects, nothing mental.  I guess from all the looking back I've done onto that experience I've come to the conclusion that 'trips' on marijuana aren't for everyone.  Not many people seem to experience stuff like I did on marijuana but the people that have all have gained something from it.  It was a great experience and even though it was so unpleasant at times, if I could do it again I would (I don't mean smoke weed, I mean have a 'trip' from weed)."
 ],
 "erowid": {
  "id": "33637",
  "citation": " T. \"A Frightening Trip to Heaven: experience with Cannabis (ID 33637)\". Erowid.org. Nov 14, 2006. erowid.org/exp/33637",
  "substance": "Cannabis",
  "views": "4524"
 }
}
