{
 "id": 1522,
 "title": "The Grasp Of Yayo/Cocaine",
 "date": {
  "submission": "2001-02-12T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": ".007",
  "weight": 66
 },
 "dose": [],
 "report": [
  "The first time I experienced cocaine, I was 14 years old. Out of the blue, one of the older kids in my neighborhood said he was buying some and asked me if I was interested. So we went to this guy's house and he scored it. We went into the guy's cellar and broke it out. I did two lines, and I was racy and my throat was numb, but I couldn't really get a grasp of the high. I didn't do coke for two and a half years after that.",
  "In July of 1998 it was my birthday and I was real drunk, and one of my buddies was selling coke at the time, and I bought a gram. I did two lines and it was like I never even drank any liquor, I was straight. I did two more and I felt absolutely invincible. I found myself spending another seventy dollars that night on it.",
  "By the time I knew it, three weeks had gone by and I was doing yayo (coke) every day, spending about a hundred dollars a day on my habit, and I was dealing weed so the money was easy to get, and a couple of people sold coke.",
  "I went on a series of being straight one week, and fucked another, finding myself taking heavy amounts of LSD and doing a lot of coke, at the same time. I eventually could not sleep at night, and stopped going to school. I was a mess, and I had to do something about it, so I cleaned up.",
  "I was clean for about a year and a half, and it felt good. All of my friends had stopped too, but it struck again. I started selling coke, and then my drug of choice was ecstasy, so I didn't touch it. Two weeks later me and my best friend were sitting in my room, fucked on like three ecstasy hits apiece. I was bagging some coke up and for some reason I got really tempted. I said something to my friend, who was also a recovered user. We ended up doing all of the coke that I had. We stayed up for fourteen hours and did about thirty lines apiece (4.5g). After that we did it for about two  months, spending anything we had, going through at least forty lines a day. I started developing chest pains, but the high was overpowering me. I could not stop. I was really agitated all of the time, and fighting with my mother.",
  "And now it is a year later. I am almost nineteen years old and doing well. I HOPE to never cling on to coke again, but one can never say when you are caught in the grasp of the yayo."
 ],
 "erowid": {
  "id": "1473",
  "citation": " .007. \"The Grasp Of Yayo/Cocaine: experience with Cocaine (ID 1473)\". Erowid.org. Feb 12, 2001. erowid.org/exp/1473",
  "substance": "Cocaine",
  "views": "11192"
 }
}
