{
 "id": 15232,
 "title": "New and Unusual Energy",
 "date": {
  "submission": "2000-10-20T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "2:00",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "A bunch of friends and I were going to a rave one night, and I decided that I wanted to trip.  I purchased 3 hits of Garcia blotter from a friend, and ingested it before we left for the rave.  I have no idea exactly how much acid was on the paper, but they were pretty big hits, on good blotter.  My friend had also purchased some acid, and he had some MDMA as well.  He had several extra capsules of MDMA and gave me one.  Not being one to look a gift horse in the mouth, I took it and stuck it in my pocket, almost forgetting about it when the trip began to set in, in about 1.5 hours. ",
  "The MDMA was pure, and one of my friends had gotten it from a reliable source.  It was powder in gel-caps, not pressed pills that I ordinarily get. ",
  "We all got to the rave, and by the time we got to the door, I was tripping hardcore.  I went and sat down near the dance floor, and it was when I heard that the cops had showed up that I remembered the capsule in my pocket.  That was about 2 hours into the trip.  I took the capsule so hat I would have nothing on me for the cops to find, and I didn't even think too much about it.  I didn't have a bad trip because of the cops, fortunately, and they left eventually after arresting somebody who had eaten way too much acid and was rolling around in some mud.",
  "I returned to my friends and hung out with them for the rest of the night.  My roll began to kick in after about 30 minutes from ingestion, and I felt the most euphoric I have ever felt.  I smoked cigarettes and laid on a hammock for a long time.  I didn't even need to talk, I just felt so good.",
  "I can't describe every detail of the whole experience, but it was certainly the best thing I have ever felt, and I'm not sure if I can beat it, or even if I want to.  The trip continued hard while I rolled, and the roll didn't really hit me hard like it usually does, but it sort of faded in, and when it was done faded out.  I didn't dance because my mind was too busy soaking up all the new and unusual things going on around me, but I did have a lot of energy.  The only real drawback was the day after, because my trip lasted a good 14 to 16 hours, and I was still feeling effects of it for all the next day.  I could not go to sleep until that night.  Still, if there was one word to describe the whole thing, it would be 'incredible.'"
 ],
 "erowid": {
  "id": "3369",
  "citation": " Anonymous. \"New and Unusual Energy: experience with MDMA & LSD (ID 3369)\". Erowid.org. Oct 20, 2000. erowid.org/exp/3369",
  "substance": "MDMA & LSD",
  "views": "8640"
 }
}
