{
 "id": 15259,
 "title": "My Life as an Organic Contracting Tube",
 "date": {
  "submission": "2007-06-01T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ernie",
  "gender": "Female",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "daily"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "daily"
  }
 ],
 "report": [
  "First of all, I need to mention that I suffer from chronic depression and have been on antidepressants, specifically wellbutrin and celexa, for four years. I feel fairly good, do therapy etc. Careful, limited usage is the hallmark of my 'recreational' drug use. This is just to say that salvia has had, for me, no bad reactions with my particular meds and that I find the effects to be very liberating/useful therapeutically.",
  "I have smoked salvia on perhaps four occasions. Each time I have smoked I have been with a sitter and smoked the 'reccomended' dosage of at least 3 big hits through a bong.",
  "In preparation for each trip I tried to calm myself and made sure that I was not too hungry, too stoned or too tired. I prepared a comfortable place for myself and put on music, an album called '3' by the band 'Pole' was suggested by my brother who took me on my first trip and it remains a favorite.",
  "The first time I tripped I kept my eyes open. After a few big hits on a bong I saw the room I was in as if through a kaliedescope. Everything around me was refracted and spinning. I was thrilled and tried to explain it to my brother. He quickly said 'don't talk,' so I laughed my head off instead. I had an absolute ball! I was so pleased to be seeing things outside the realm of the mundane. The trip ended after about five minutes and left no residual effects.",
  "Later that night I went again and this time felt that oft reported sensation of being pulled backward and to the right. I kept my eyes closed. I felt as if my whole body and consciousness were being pulled back out of the top of my head. I then had a sensation (only word to describe it) of being a child, something was pulling me into childhood, yet I couldn't quite put a finger on why I was there. I saw apiece of shirt material turn into a swirling mass of pulsing color and shape. Then it ended. Five minutes of trippy pleasure with no after effects.",
  "The next day I was filled with wonder and joy. It seemed to me as if I had had an incredible night of lucid dreaming. I had been inside my own consciousness and found it not only pleasing but exciting, colorful, fun. The next few times that I smoked salvia were much the same, though it did seem the effects were not as strong. I figure that I have become somewhat used to the sensations and find them not quite as enchanting as my first two times. The last time that I smoked salvia was my last for a time, not because of any bad effects, but because I reached some sort of nirvanic state that I am not sure can be replicated. It fulfilled me so much that I don't really want to trip for a little while.",
  "Once again a friend sat with me, though no music this time. I sat on my bed in a quiet room and smoked three big hits. I tried to light a fourth for good measure but the lighter crapped out. My friend ran to the other room screaming 'lighter emergency' only to return to find me blissfully lolling on the bed, with an ecstatic grin on my face and bong water running down my chin from this midget bong I used. Oops, just a tiny bit embarrassing, but I was too far gone to care.",
  "Quickly put, I saw my life in front of me represented as some sort of organic contracting tube. The tube contracted from both ends, age 35 on one end...birth at the other. As my life contracted to a point I became aware that I would shortly see the culmination of my life thus far, I knew I was about to get an understanding of the 'essence of my existence.' Since I am an agnostic and a realist and a depressed one at that, I grew frightened that what I would feel or see would be 'bad.' I was sure that if my life were reduced to one moment or point or essence, it would not be pretty.",
  "But I was wrong. Instead, as I watched it all contract I felt an overwhelming feeling of pure good, of love and light and everything else I don't feel we get enough of in this life. WOW! I was surprised and awed and grateful. I kept saying to my friend 'I thought it was going to be bad, but it was so good.' And it was.",
  "Just my experiences..."
 ],
 "erowid": {
  "id": "33774",
  "citation": " Ernie. \"My Life as an Organic Contracting Tube: experience with Salvia divinorum (leaves) (ID 33774)\". Erowid.org. Jun 1, 2007. erowid.org/exp/33774",
  "substance": "Salvia divinorum (leaves)",
  "views": "3831"
 }
}
