{
 "id": 1526,
 "title": "A Whole New View",
 "date": {
  "submission": "2005-07-20T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Knowledge Seeker",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "cap",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "3:30",
   "amount": {
    "unit": "cap",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material"
  },
  {
   "time": "6:00",
   "amount": {
    "unit": "cap",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material"
  }
 ],
 "report": [
  "Searching for the world in between the cracks I decided to see if shrooms could guide me to this place. At about 5:30PM, X and me had the first stem and cap go down, the taste of sunflower seeds stayed in my mouth. The preparation started while waiting for the upcoming trip. Music, incense, pot, henna, toys, and of course more shrooms for later.",
  "T + 0:30 We went outside to smoke a bowl. Although the shrooms hadnt really kicked in at all the high was amazing, especially the body high. We talked of the world philosophically things because we wanted to find answers sometime through the night. The smoke from the bong was awesome, it is so weird to think how a translucent thing can make me feel so good.",
  "T + 1:00 The trees slowly change to the shapes unthinkable while sober. All the different shades constantly changing and the new world opens up. The sun made everything lift. Soon it my body felt really light and everything around me felt light. As though the sun was just pulling everything up by a string.",
  "T + 2:00 Looking at the glitter, it was everywhere. It brought a glow to everything you look at made it give life. As we go outside we felt the flowers and trees. I realized how plants do not mind when I touch them, or eat them, because that is what they were meant to do. Just as everything I do I am meant to do. An amazing thing to think about, I am connected to everything around me. There is a little spot in my oneness for everything and everything has a spot in their oneness for me. We all have different talents of ourselves which make the whole, which make the (can be called anything but one) God inside everyone.",
  "T + 3:30 The next cap and stem go down smooth. I saved a little bit of a cap for later though. We went back outside for another bowl before we ordered pizza. Then 20 minutes later we open the door to another person. Our wide-eyed tripped out outfits don't quiet understand what he's saying so we give him the money and grab the pizza. I figured out that of the 5 senses some can be manipulated easier than others. Smell, taste, sound, touch, then sight. Meditation can help with the ability to change these. When listening to the crickets and frogs outside it doesn't have the normal sound it usually does. It made music and sounds I don't usually hear.",
  "T + 5:00 What shall we do with all these bizarre things all around us. We decided to do henna so we could remember our trip for a couple weeks. We were doing good on reading the directions until we forgot to leave it on for 2 to 3 hours instead of 30 minutes which is what we did. After taking off the henna we went to smoke and while sitting in the chair I felt as though I was leaving one world and entering the next. This was the time when I could see and feel all the different worlds connected to my oneness. I didn't feel as though I was apart of any particular world, I was in my center, looking out at everything else. I was in touch with myself and nothing could bother me if it tried.",
  "T + 6:00 I decided it was time to eat the last cap for a little boost in the trip. Unfortunately it was a little over the edge making me feel kind of sick but it didn't give me a bad trip and I just stuck out the times when my stomach felt sick and enjoyed the rest. I went to the mirror and tried to go through it, although I couldn't get it to become watery and let me go into it, the mirror did suck in my hand and deform itvery cool.",
  "The rest of the night had many little journeys of wandering around. Going out to the pool and looking at the ripples and reflections in the water. With many smoke stops along the way. I now know that there is a world between the lines and have been in that world. Now I just have to find the peace on my own.",
  "T + 11:30 Headed off to bed for a deep sleep from a crazy night."
 ],
 "erowid": {
  "id": "14748",
  "citation": " Knowledge Seeker. \"A Whole New View: experience with Mushrooms (ID 14748)\". Erowid.org. Jul 20, 2005. erowid.org/exp/14748",
  "substance": "Mushrooms",
  "views": "3225"
 }
}
