{
 "title": "Fucked Up Pills: The Good & Bad",
 "author": "Xyloform",
 "citation": " Xyloform. \"Fucked Up Pills: The Good & Bad: experience with Dimenhydrinate (ID 15260)\". Erowid.org. Jul 27, 2005. erowid.org/exp/15260",
 "substance": "Dimenhydrinate",
 "bodyweight": "135 lb",
 "report": "<p>Setting: eating noodles sitting at computer. Friday night. Alone in the house. Perfectly good mood.</p><p></p><p>9:18</p><p>Took 500 mg of dimenhydrinate</p><p></p><p>9:28</p><p>Feel a bit shaky, confused a bit more easily. Read some stories on what happened and feeling a bit like I should try to puke them up, but I think Ill continue the journey</p><p></p><p>9:31</p><p>Feeling a bit coldnot sure if its due to the mgs or if its the coldness of the house, I felt a smaller amount cold before while I was cooking my ramen. Phones ringingweird, I ran into the room where the phone was ringing and it was dark, Ive never been afraid of the dark before but it was kinda scary this time.</p><p></p><p>9:35</p><p>Note to self:</p><p>Rememberif it feels too bad, take a cold shower..</p><p></p><p>9:36</p><p>Time to play a computer game</p><p></p><p>9:51</p><p>Starting to feel a bit weird  stomachache persisting.</p><p></p><p>9:55</p><p>I guess the stomachache is it taking place - I feel all rubbery and the floor is being weird  it moves from side to side and up and down. Like theres a ball under it and it like tilts in one direction then another, also when I was walking, I felt like I was walking right but I was really going straight. Parents came home and I had no trouble talking to them..</p><p></p><p>9:57</p><p>Getting tired. Seeming to become a statue and melting into my self.</p><p></p><p>10:00</p><p>Feeling pretty fucked up  theres light shining on my computer game controllerI thought someone erased on that part (because its a big white smudge thing)</p><p></p><p>Bleh. I stayed up for another 20 minutes then I couldnt stand it anymore. I walked over to my bed which was a very hard task, but it was somewhat fun, I felt really drunk and was very uncoordinated. My stomach really hurt and I had a very bad headache. I felt like I was going to throw up but I didnt throw up. I lay on my bed for about an hour before I fell asleep.</p><p></p><p>I woke up about 2 hours after I fell asleep and my shoulders felt really weird. At first it was a really cool weird  it felt like getting a chill down my back, only it was on my shoulders. It didnt go away, though. It was with me for hours, and I couldnt go back to sleep with it. I kept trying to make myself shiver and get chills so it would go away but it didnt work. The chillness stayed thereand it sucked! I finally ended up being able to fall asleep after what seemed like hours but it was probably only 20 minutes.</p><p></p><p>Conclusion:</p><p></p><p>I wont do it again, although it makes you feel really stoned and drunk, the negative effects far outweigh the positive ones. The stomach and headache that I got were so bad, all I could do is lay in bed and think about them, Holy shit my head hurts so much, fuck my stomach. etc., and Im not one to do that. I did eat them with food (2 bowls of noodles) and that did not help the stomachache. I didnt notice any hallucinations, but thats probably because my eyes were closed for almost the entire duration of the effects, because my stomach and head hurt so damn much. I became very sensitive to light as well. The shoulder thing, although it seems somewhat cool was NOT. It pissed the hell out of me, and was very unnerving. Today is the day after, and I feel a bit out of it. Not that bad of a hangover type effect.</p><p></p><p>From 1 to 10, 10 being highest:</p><p></p><p>Positive feeling: 6</p><p>Negative feeling: 9</p><p>Hangover: 1</p><p></p><p>Overall (not just the average of the others): 2</p><p></p><p>Ways it could improve:</p><p></p><p>If I didnt get a stomach or headache, I could have probably dealt with the shoulder thing fairly well, and taken it all in the swing of things. The stomach and headache put me in a very bad mood though. Maybe taking some stomach and head meds before will calm those aspects, but I wouldnt experiment with mixing meds, especially when Im taking them in this high of a dosage.</p><p></p><p>This is for educational use only. In no way am I promoting the use of dimenhydrinate as a drug. Have a nice day, and I hope you learned something by my first and last experience with Dimenhydrinate.<p>",
 "year": "2002",
 "id": "15260",
 "gender": "Male",
 "timestamp": "2005-07-27T07:00:00.000Z",
 "views": "34573",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 }
}
