{
 "id": 15288,
 "title": "My Brain is Bleeding From a Sobe",
 "date": {
  "submission": "2007-11-28T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Data Burn",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "It was a pretty nice day on spring break. I badly wanted to get high because I was having my first bored day on the break. I grabbed some cash and went to my friends house. Her house is like a 24/7 walk in party because her mom is never there and her dad is somewhere else. I knock the door and she answers the door. We'll call her S. I noticed S's pupils were slightly dimond shaped and I wondered what drugs she had been doing. I ask her if I put in $5 if she could just smoke me up. She agreed. I walked in her kitchen and there was 3 other guys there. I knew all of them so I felt comfortable in the situation.",
  "I look over and S has a Sobe bottle, punctured with a hole at the bottom and a hole in the cap. She fills it with water while covering the hole, and screws on the cap with weed on it. She holds the lighter over the weed and takes her finger off the hole. The water slowly comes out and it creates a natural suction and burns the weed and holds the smoke in the bottle. The smoke is extremely white and condensed and I have known people passing out from only 3 of these, which about 1.5 grams maybe even less. I have done this a couple times so I go for it. She takes off the cap and I inhale. I accidentaly inhaled way too hard, and ingulfed all the smoke in roughly 2 seconds. I feel that bad hit, throat scorching feeling comming on and at this point I'm at the other side of the counter. I start to make my way back to the sink to drink some water and I notice that if I move to fast, I overwhelm my self and get really dizzy. So it took me quite a while to get to the sink.",
  "I finally got water and closed my eyes and lay on a hammock. I started to feel better in my throat in head, and I think to myself 'Ok I can handle myself now.' and stand up. Everything around me is swaying from left to right. Wow! I think. I didn't even know weed could have such a strong visual effect as it did then. My ears started feeling really hot and I was convinced that they were on fire. I kept slapping them. Every breath I took I could feel the oxygen swirl around in my lungs. I then felt what can only be described as my brain bleeding. This kind of freaked me out because it actually felt like my brain was bleeding. I was walking around the house quite slowly grabbing on to furniture to help me move. I finally find my friends upstairs in a small washroom. I sit on the sink and just talk with them for about an hour. My eyes were almost always closed because, every time I laughed, my eyes would shut and I'd embrace the laughter.",
  "After that we sat in a circle outside of the washroom and this is when it all started comming crashing down so, so hard. Two of my friends decided to trip me out and started talking about how they were gonna cut me up and sell my organs. I was a little scared for some reason even though I knew they wouldn't. I closed my eyes and I felt something poking me. I was convinced this was a knife and they actually were trying to cut me up. (it was a pencil) and I jumped up screaming. I started to feel uncomfortably dizzy and felt natious. I went into a dim room by myself and grabbed a plant pot and started throwing up in it. I couldn't believe it. 1 gram of weed and I was tripping like I did and ounce and 4 hits of e or something.",
  "I noticed that everything looked like faces to me. Everything. I couldn't help but see faces in everything. It started to annoy me because I felt like I was being watched by all of them. So I decided to close my eyes. Bad Idea. I felt like I was spinning out of control and started throwing up again. Soon I became so dizzy that if I either moved at all, or closed my eyes, the whole room would be sucked into a warping spiral and I would start throwing up. So I had to kneel there, being careful not to move, being careful so I always focused on something. I then realized that I had to lay down to feel any better. I tried to slowly, slowly move my head towards the floor but I would get sick again.",
  "After about half an hour of pain, finally, my entire body was on the ground and I was staring at the wall. After that I just remember waking up 4 hours later, comming downstairs, and stumbling home with my shirt over my shoulder, throw up on my pants. I had a bad trip from weed. It was baffling."
 ],
 "erowid": {
  "id": "33846",
  "citation": " Data Burn. \"My Brain is Bleeding From a Sobe: experience with Cannabis (ID 33846)\". Erowid.org. Nov 28, 2007. erowid.org/exp/33846",
  "substance": "Cannabis",
  "views": "3505"
 }
}
