{
 "title": "AMT Mushroom Substrate Test",
 "author": "FlowGnome",
 "citation": " FlowGnome. \"AMT Mushroom Substrate Test: experience with Mushrooms (P. cubensis) & an AMT Analogue? (ID 15285)\". Erowid.org. Jun 10, 2002. erowid.org/exp/15285",
 "substance": "Mushrooms (P. cubensis) & an AMT Analogue?",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "report": "<p>This is a report a FOAF told me, involving his experiment seeding the substrate of some Equadors grown PF style with alpha-methyltryptamine, to see if anything new would come out of it.  He has not run TLC analysis yet to determine if there was a new compound at all, because he felt that the knowledge of a new compound could influence the trip.  His suspicions of possible new compounds included 4-hydroxy-alpha-MT, a standard conversion to psilocin/psylocybin, or 4-hydroxy-alpha,N,N-trimethyltryptamine.  The first compound is known, and is toxic at higher doses.  The third could not be found on the usual sites, and would be the amphetamine analogue of psilocin.  Yet another possibility given to him by a couple fairly incredible chemists is that the methylamino group would interfere with the natural pathways and the mushrooms would ignore the AMT's presence entirely, treating it like inert matter.</p><p>Past experience: With mushrooms, most was about 3.5g. LSD, AMT, 2C-T-7, 2C-T-2, Ayahuasca, 5-MeO-DiPT, DPT, etc.  Basically I'm a fairly seasoned traveller, except with the mushroom, so my definitions of +2 (on the Shulgin scale) might not quite fit yours.  YMMV etc... \rSet: Excited, a little nervous.  Might be trying something nobody has tasted before, or might be eating some mushrooms.  Who knows?\rSetting: A friend's during the coming up, home for the peak (nice apartment with appropriate trippy reading materials and whatnot), and back and forth afterwards.</p><p>Notes taken during the trip marked with 'Notes:', other comments are written after the experience.\r9:10PM (t+0:00) - Down the hatch and into the unknown.  Ate about 2.0g of dried mushrooms total, don't want to overshoot.  Added a few stragglers from a cake that had been seeded with DiPT to get a decent amount.</p><p>I went over to a friend's house and sat around waiting for them to kick in.  My friends got really bored, not wanting any of the psychedelics I had offered them and not having any of their favorite drug, booze, around, so they finally decided to take a car ride.  When they left, I returned home again.</p><p>Notes: T+1:20 - Not much different from the std. mushrooms, except some shakiness that is especially apparent when I try to write.  Mentally, maybe a +2, visually +1.5 or so.  Low dose or poor drying methods to blame.  Also some flushing feeling in the face, but that could be directly related to the fact that its damn hot in here anyway. No physical concerns otherwise.  Shakiness probably bad at higher AMT -> substrate levels.</p><p>At this point, I was feeling a bit stimulated, almost like too much caffeine.  I laid down for a while and thought for a while, and suddenly became aware of some kind of problem with my life, which i visualized as a missing piece of or hole in my brain.  I explored a multitude of possibilities for what it could be: A girlfriend, more intimacy period, drugs, less drugs.  It wasn't until much later in the night that I realized that it was indeed a peanut butter sandwich, and that the hole was actually in my stomach.  Since I haven't tripped in a couple months, forgot to remember not to try and think too much.  :-)</p><p>After laying around for a while, I decided to read some pharmacology textbook I had laying around.  Mental facilities intact, apparently.  Finally, the shaking had become enough and I realized that I had missed my dose of Clonazepam anyway, so .5mg of that went down the hatch and that smoothed all body concerns out nicely, like it usually does.  I went back to my friends and played on their computers for a while, watching music videos and such.  In the meantime most of the visuals (what little there were) were dying down, and I ended up surfing to The Shroomery to check some posts.  They finally got back from the car ride, and announced they were going to bed, so I went home again.  I then laid down in bed for a while, and started getting into a little bit of a less-than-happy mood, as I have a tendency to do on a daily basis.  The following was written down.</p><p>Notes: T+4:50 - Mostly 'down', but then I was never really that 'up' to begin with. I suppose this has become a trend in my mushroom trips as a whole - there is never much of a strong effect.  I guess I'm expecting to have my ass cosmically smacked around like the many 400mcg+ LSD trips of the past.  Maybe I'm just a hardhead when it comes to mushrooms, or maybe I'm being disappointed because I'm expecting something of these trips that just isn't there, at least not at these dosages. </p><p>Earlier in the night I had a moment of clarity, and realized that there is a hole in my life, my thoughts, that needs to be filled.  With what exactly I didn't determine (PBJ!), the closest I could come was a need for intimacy, despite the world hating persona that I've adopted.  Perhaps its time for this shell to be cast off once and for all.  But to reveal my mind and emotions to the full incomprehensible pain of the modern world we live in would more than likely drive me insane. The best I can hope is that someday I can be fully self-sufficient, and isolate myself from humanity, somewhere far in the country, and allow fate to direct the ending of my life, rather than some corporation of imbeciles struggling over their wars and material objects.  Pra'Bob' I hate money, but short of going homeless there isn't much I can do but go to work every day as a cog in the giant, gas guzzling monstrosity we call 'civilization'.</p><p>Specifically, at this point, I was thinking about the current world climate, Pakistan and the Nuclear situation, my personal belief that this entire terrorist attack was a staged event used to get Americans riled up enough to support a war against some oil-rich countries.  Think nothing like that could happen? Read into the Bay of Pigs.  Anyway, on to my random unfounded chemical guessing:</p><p>Notes: Although visually there isn't a whole lot to be said about this trip, the clarity of thought, shakiness early on, and the fact that I'm still awake might indicate that whatever new compound formed isn't the toxic 4-HO-AMT, but it isn't AMT either, so what am I left with? 4-hydroxy-alpha,N,N-trimethyltryptamine.</p><p>Notes: T+05:05 - Continued...  I've just realized that this is the first attempt I've ever made at writing during a psychedelic experience.  I had previously thought that these substances would affect my written communication as much as they affected my verbal, and had decided not to try it.  Just the act of writing these thoughts stimulates me, and focuses me enough that I can keep a flow of ideas coming.  Interesting! I think that solo trips are the way to go, as I always have, but from now on I'll remember to keep a pen and paper handy. </p><p>[Can't wait to analyze these and do TLC, hopefully it will be accurate enough]</p><p>Meeting Shulgin and reading enough about him and of what he wrote has made me wish I could choose my own path over again from the beginning and research psychedelics as he did. </p><p>Notes: (Pulling the wool over my own eyes here, since this trip was done in the name of psychedelic research.  Interesting oversight.) Shulgin's methods weren't considered acceptable by the government, but then, whose are, really? They allow destruction of animal life in labs just to save someone the 'misfortune' of being fed a psychedelic and asked what the effects were.</p><p>That's where my written notes end, as I had concluded thinking about what I had wanted to and decided to go to sleep.  Sleep didn't work, so videogames were used instead.  Both as mind-numbing.  Anyway, this trip reminded me more of the mild ego-inflation and rampant thought trains of a small dose of amphetamines than of the more relaxed trip the mushroom has given me in the past.  There was also a hint of depression, or maybe a tendency towards dark thoughts, that just wasn't there in previous mushroom trips.  Something new is there, but short of NMR nobody will be quit sure what it is. </p><p>In the meantime, TLC is going to be run soon and the results published on the Shroomery messageboard by my FOAF, Boobs McFeely, so stay tuned and happy shrooming.</p><p>Anyway, hope you enjoyed that piece of written-and-performed-in-international-waters piece of thoughtcrime material.  Good day!</p>",
 "year": "2002",
 "id": "15285",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-10T07:00:00.000Z",
 "views": "18991",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 ]
}
