{
 "id": 15282,
 "title": "Sparkles",
 "date": {
  "submission": "2007-06-22T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Smokey",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 drops",
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "2.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This was my second experience with LSD. My first with X. Decided to 'candy flip' by eating both at the same time. Still to this day, I believe it was the greatest buzz I have ever had. Every object had sparkles all over. When I looked in the mirror, I could see white flashes and sparkles all over my face. When I looked outside I could see sparkles on the grass and sparkles on trees. It was a very pleasant, feel-good flip. I had the positive feeling of X, mixed with the confused feeling of LSD. I still can't get over the sparkles that were everywhere. It was unbelievable. I was so high for a couple hours that I thought I was the King of the world. I remember being sprawled out on the floor on my back, looking at the ceiling seeing sparkles and waves and white flashes and bubbles and blurps. Closed my eyes and saw spirals and bubbles filled with flashes and sparkles.",
  "I experienced flashbacks after that about once every couple of months. I would be sitting there and move suddenly and the sparkles would come back and they would be everywhere. It could happen in class, at home, or even while driving (which proved to be dangerous once, but thats another story). Usually lasted for 2-3 minutes. I would have to stop everything and just look in amazement while sparkles came back. As the years went on, they became less and less frequent and it had been probably around a year before last week. I was in the bathroom in the afternoon, and I looked down for some reason. Looking back up, the sparkles were back! Lasted for 20-30 seconds.",
  "I don't understand how this is possible, and it must be a permanent damage on my brain. If it is, this is somewhat alarming, but still its nothing scary when it occurs. I enjoy seeing the sparkles b/c it is truly like seeing water glisten off snow on the ground at night. It's just amazing that the human eyes could see something so wonderful. They look like a bunch of little lightning bolts floating around and disappearing. Sometimes they'll dance and wiggle. I know this sounds strange, but it happens to me once or twice a year, and its not easily forgettable. OWELL! Sparkles are fun to see."
 ],
 "erowid": {
  "id": "33832",
  "citation": " Smokey. \"Sparkles: experience with LSD & MDMA (Ecstasy) (ID 33832)\". Erowid.org. Jun 22, 2007. erowid.org/exp/33832",
  "substance": "LSD & MDMA (Ecstasy)",
  "views": "6748"
 }
}
