{
 "id": 15290,
 "title": "Phish and Phun",
 "date": {
  "submission": "2000-10-22T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Denny",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "3"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "The day began in hightened anticipation of the best day in a long time. It had been a few months since I had last seen Phish, and I had my drugs and five friends to go along with them. the night began early, perhaps i should say that i abstained from both ecstasy and lsd use one full month prior to this day, my tolerances were minimal. I dropped all three hits at 4:30 pm. The six of us began our drive of about 30 miles to hersheypark stadium. i was the only one under any influence at that time. We went to Wendy's for a quick bite to eat, but my french fries tasted like shit, eating for me on psychedelics always is bad. Our trip then started we myself starting to dealing to tingles of an acid trip. Before we made it to the venue everyone had smoked a few bowls in the car, and two others dropped their acid, two hits a piece. Because of the incredible amount of traffic we didn't get into the parking lot until about 7 pm.",
  "That is when i dropped the roll i had, it was a crown. i was tripping fairly hard at this point, more than two hours in, but still coming up fast. The venue was amazing, 40,000 people the largest of the tour. We knew that our seats were on the opposite side of the stadium, so we headed straight to the floor, probably 200 - 250 ft from the stage. The six of us were lost from being a group until intermission, as some people had to go the bathroom and didn't find us, i went to go get some water, as i was feeling dehydrated as the roll came up.  The cops at the door had made me dump out the water that i had brought. I wasn't about to argue with a pig while i was tripping. For the first set it was me and my friend J. grooving on the floor. The roll was fully up by the time Phish was going.",
  "This was the time of my most intense visuals ive ever had, and i had never done both E and A together.  As i looked at Trey's guitar i could see the notes as he played them, and i could hear them before the sound actually got to me. As i closed my eyes i felt the world around me mattering less and less and my own inner energy at it's peak. The music was unbelievable, and indescribably beautiful. I looked at the sky from time to time and the clouds manifested themselves as different friendly shapes. I had an energy and everything around me had an energy, as long as everyone enjoyed themselves the aura was bright and constant. If someone passed though around us the energy was broken and we had to build it back up. The group next to us didn't have a bowl, somebody had stloen theirs, so i offered mine. We smoked for a couple minutes and just passed it around to anyone around who wanted any. It was sharing and giving and love for people who you had never even seen before, partly due to the drugs but mostly due to the music. By the end of the first set i was still peaking and enjoying one of the best nights of my life, but more was to come.",
  "During intermission we ambled our way closer to the stage within about 100 ft. We smoked again once during the second set and i was boosted back up to peak, Marijuana always has done great things to enhance other drugs for me. I could be close to baseline after a trip or a roll, and smoke some bud and be right back peaking. Although the second set was too short the encore was great and we filed out and got everyone together.  After a twenty minute walk and my friends buying some 'novelties' after the show we tried to get out and did after about an hour. After making it back to campus i didn't get to sleep until the acid wore off around 5. 12 hour trip and it was amazing."
 ],
 "erowid": {
  "id": "3385",
  "citation": " Denny. \"Phish and Phun: experience with LSD, Ecstasy & Cannabis (ID 3385)\". Erowid.org. Oct 22, 2000. erowid.org/exp/3385",
  "substance": "LSD, Ecstasy & Cannabis",
  "views": "11847"
 }
}
