{
 "id": 15307,
 "title": "What Happened?!?!",
 "date": {
  "submission": "2007-11-28T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Frank",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.0 mg",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I'm here to tell you about my first experience with lorazepam, or any related drugs for that matter. I have tried many other drugs, including other pharmacy drugs, but never and anti anxiety drug. It all started one morning when I arrived at school and my friend informed me that he found a whole bottle of lorazepam at his house last night. He had taken 3 of the 1mg pills the night before and said all it did was make him relaxed. So I figured what the hell? I got 7 of the pills from him and went to the bathroom. I downed all 7 pills at once and headed to class.",
  "It had been about 20 minutes since I had taken the pills and I wasnt really feeling any effects yet. I started to get pissed cuz I wasnt noticing any difference in my physical or mental state. About 5 minutes later I decided to stand up and see if I could feel any effects. I got up and walked across the classroom to throw away a piece of paper, as I walked I noticed that the floor seemed far away and I felt as if I had to step down to reach it. I sat back down and thats the last thing I remember for a while.",
  "From what I've been told by friends I was walking fine and my speech was normal but I wasnt making any sense. I was just rambling on about stupid shit. That day after second hour which I have no recollection of, the whole school met for a church type deal. I vaguely remember a teacher coming up to me and making me sit between two other teachers. After that I dont remember anything else for a while. After going to one more class and failing a test (people told me that I stared at it for about 5 minutes and then turned it in blank) teachers got suspicious I guess and called my parents. They came to school and we talked with the disciplinarian for a while, then they decided to take me to get drug tested. Fortunately this type of drug doesnt show up on drug tests. I then went home and did god knows what that afternoon.",
  "Everything Im saying I did after 1st hour is entirely based on what other people tell me. I honestly dont remember anything from then until about 4 pm. At about 4 pm I started coming back to reality, or so I thought. Everything I saw was double, unless I closed one eye. And I argued with my mom, saying that I was fine and trying to show her that I could walk in a straight line. Then at about 4:30 I called my friend Samantha and asked her to come get me and of all things go to church. She agreed and told me she would call me when she was on her way. I decided that I would lay on my bed until she got there.",
  "The next thing I remember was waking up at 2:30 the next morning, and wondering what happened. All I could think about was what happened that day, so not realizing how late it was I proceeded to call everyone in my phone and ask them if they knew what happened. Once again I thought I was fine, but now realize that I was still under the influence of the drug. I went back to sleep after talking on the phone to a long list of people for over 2 hours.",
  "Ever since then my memory is still fucked up. And I constantly wonder what exactly happened."
 ],
 "erowid": {
  "id": "33917",
  "citation": " Frank. \"What Happened?!?!: experience with Lorazepam (ID 33917)\". Erowid.org. Nov 28, 2007. erowid.org/exp/33917",
  "substance": "Lorazepam",
  "views": "64599"
 }
}
