{
 "title": "Methadone can be Hell",
 "author": "TheSpaceman",
 "citation": " TheSpaceman. \"Methadone can be Hell: experience with Methadone (ID 15313)\". Erowid.org. Mar 22, 2006. erowid.org/exp/15313",
 "substance": "Methadone",
 "bodyweight": "145 lb",
 "report": "<p>One day, I was bored and someone offered me some methadone. I had never tried it before, but was slightly experienced with other opiates, painkillers like oxycodone and hydrocodone. It was given to me in a liquid form. It was a foggy colored liquid and if it wasn't moved for a while white grains settled to the bottom. It was said to be 30mg and the person said it was a pretty good dose for a first timer.</p><p>I rented some movies that night, and cleaned up my room. At about 11pm, I prepared to take the methadone. I got a glass of milk and took the little bottle and poured its contents into my mouth. It had an odd, unpleasent taste. I gulped it down with some milk and got up and put in a movie. About 30 minutes later, I felt a nice, calm feeling, starting in my stomach as a pleseant buzz-like sensation. I started feeling happy and peaceful.</p><p>I was enjoying the movie, Jay and Silent Bob Strike Back. After about an hour, some slight nausea started to come on slowly. I then smoked a bowl of medium quality pot. It helped the nausea some, but not as much as I thought it would. It was about 1am and I put in the other movie i rented. The nausea was still there, but not very intense because I was high, as well as buzzing nicely from the methadone. The weed went pretty good with it. I was just sitting there enjoying the buzz. It was very pleasureful, almost sexual.</p><p>I started to get sleepy around 3 so I layed down and went to sleep. It was easy going to sleep, despite the nausea. I awoke at about 1pm. I still felt a strong presence of the opiate. In fact, it didn't even seem like it lost any intensity. The nausea was getting worse too. I got up feeling very tired. The pleasure part of the drug was taken over by the nauseating effects. I felt very sick, and went to the bathroom and threw up a lot and dry heaved for a few minutes. It was horrible, but I felt better when I was done.</p><p>I drank some water and about 5 minutes later the intense nausea was back. I threw up in my garbage can cause the nausea came back too quick for me to run to the bathroom. I threw up about 5 different times within 2 hours. The whole day I felt very tired and had a bad feeling in my stomach. I still felt the effects when I fell asleep late that night. It stays in the system much longer than opiates I was used to.</p><p>I will probably not do methadone again, or at least at this dose.</p>",
 "year": "2002",
 "id": "15313",
 "gender": "Male",
 "timestamp": "2006-03-22T08:00:00.000Z",
 "views": "34298",
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Methadone",
   "form": "(liquid)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
