{
 "id": 15318,
 "title": "Makes Me See in 8-Bit",
 "date": {
  "submission": "2006-12-10T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "System",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "My friends and I were hanging out after I'd left work.  I picked up my friend Perkins and rolled a blunt of weed to smoke on the way to my friend Josh's house.  We were high as hell and showed up at Josh's red-eyed and bushy-tailed.  Josh wanted to get high in his garage, but with the fog machine on and with 5-Meo-DMT sprinkled on the weed, Perkin's and I were all over this.  We got some food and went to his garage, it took Josh an hour to get the fog working and it was quite entertaining considering how high I was.",
  "Josh sprinkled a small amount of 5-Meo-DMT on the weed, 4 or 5 crystals.  We could taste plastic and our lips were numb for just a moment, but still no serious effect.  With every bowl of weed we packed more and more and more 5meo-dmt and began seriously hallucinating.  Perkins and I felt as if our arms had disconnected and our bodies and minds were completely disassociated with reality.  I saw all kinds of weird patterns and flashes of color, my body panicking with forgeign feelings.  I tried to eat and it felt like I was a huge head being fed by smaller hands and arms, and I couldn't feel anything.  You have to excuse my typing and lack of...I dunno I am still very hungover/high.",
  "5-Meo-DMT did NOT disappoint me, while driving everything turned completely 8-bit, the street was made of cells, beige or black, and they were in patterns as if in a gameboy or cell phone interface. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "It was fucked up but fun stuff, I recommend 5-Meo-DMT on weed completely, but not if you have any responsibilities at the time, because I disconnected from reality and seriously hallucinated. :)"
 ],
 "erowid": {
  "id": "33944",
  "citation": " System. \"Makes Me See in 8-Bit: experience with 5-MeO-DMT (ID 33944)\". Erowid.org. Dec 10, 2006. erowid.org/exp/33944",
  "substance": "5-MeO-DMT",
  "views": "3818"
 }
}
