{
 "title": "Just Feeling Everything So Much",
 "author": "saRah",
 "citation": " saRah. \"Just Feeling Everything So Much: experience with Cannabis (ID 15326)\". Erowid.org. Apr 13, 2005. erowid.org/exp/15326",
 "substance": "Cannabis",
 "bodyweight": "",
 "report": "<p>The first time I tripped out on ganja was about 3 years ago when I smoked purple haze and thought a roundabout in a kids' playground was trying to eat me. This resulted in me crawling, commando-style, across the ground, in an attempt to escape said evil playing apparatus.   I didn't think anything like that would ever happen to me again. But it did. Not quite like that but with very bizarre trip-like elements that I wouldn't have expected from ganja.  </p><p>I've been smoking marijuana since I was 15/16, with a few-month hiatus this year. So I figured that I wouldn't experience anything like that again because my body had become accustomed to it. Maybe it's because it hasn't been that long since I wasn't smoking so my body hasn't got used to it again yet.  This day, I'd shared about 6 spliffs in total but it was the last 2 (we bonged the last one) that did it for me really.  I was lying on a bottom bunk bed. Above me was the wooden base of the higher bunk, with a large red star that I painted on there last year. I got lost in blowing a plume of smoke up to the middle of the star and watching it spread out across the surface.  There were fairy lights on at that point with a big candle so I couldn't see in extreme detail but enough to keep my attention completely.   I was smoking a small bong, staring at the cherry, which is what your eyes are drawn to as it's so close to them.  I passed the bong to john and watched him smoke it and then he started to really look like a goblin. Which freaked me out a bit. At first, cos I was worried about there being a goblin in the room and then because of the fact that I WAS worrying about the transformation of a good friend into a fictional creature. I reasoned with myself that this shouldn't happen cos I was only smoking skunk. </p><p>So I looked away and lay back down and everything felt really slow and heavy then very fast, like everything was leaving a trail behind it. The speeds kept changing and my head was so heavy.  I wanted to move it but I couldnt lift it up without feeling like it was gonna roll off my head so I held onto my hair and physically lifted my head up.  I thought that maybe if I lay still and closed my eyes that it would stop, still being quite adamant that I wasn't on hallucinogenic so there was no reason for this to be happening.  Then I started seeing things flashing in my vision, really fast, like a really fast montage of shots in a film, slowly coming towards me and I felt like it'd swallow me up but I didn't care. And there were these patterns in the middle of it with these couple of shapes, predominantly pastel blues reds and yellows. I recognised the shapes, I think they were from a painting we used to have in our house ages ago.   Then I was thinking about moving my tongue and I can't remember why but I had to withdraw my tongue into my mouth because there was another tongue which was faster than mine and then there was this thing constricting my tongue, like a tiny lasso, or something. </p><p>And then I started to imagine that I had lost whatever race it was that my tongue was having and that my tongue was being eaten.  I don't know what by, I got the impression of insects but at the time, it didn't matter and I was just watching my tongue being eaten. When I told john about it a while later, it seemed sickening, as it does now, but at the time, I was completely indifferent to it.  I was struck by a sense of vast importance. EVERYTHING took on a new level, I felt like I had so many things to say to people, like if I didn't something, terrible would happen. I decided to try and text someone because I needed to let them know how much I felt everything right there and then like I'd never felt anything before. I really wanted someone there and to totally immerse myself into them, actually lose the boundaries between us and be one. I was trying to use my phone and my head was heavy and I was transfixed by the trail of the green light in my phone. Then when I actually got to writing something I just couldn't find the words. I thought about trying to find a pen and paper but by then it had become unpleasant to move too much.   So I lay there, trying to remember if it used to feel like this when I got really mashed and I don't think it did.</p><p>Gradually, I felt better. Even tho I didn't remember this being how I felt when stoned, it was a familiar feeling, without a doubt. I felt warm inside and there was the sensation of waves... Like when you've spent a lot of time in the sea and your body still feels like it's moving. I was listening to 'white pony' and noticing SO MUCH that I'd never heard before and it was the best thing I'd ever heard. I was lying there, crying because I was just feeling everything so much.   It started to wear off, I don't know how long the heavy bit lasted. Then I was just thinking like I usually do when stoned, my thought processes being diverted somewhat, my mind making strange links between things.  Here comes the humourous part of the evening.  I started to ponder burping being impolite.  You ask people why it's not very nice. They say just cos it's impolite and they were taught not to do it.  So then my mind starts going, ahhh, but no, as it does when it decides to have an argument with itself. It could be a completely invalid point but my mind will throw it up anyway just to make things more interesting.  So my mind is going no, you think it's impolite cos you were brought up to think that, you don't still think the same about everything you were brought up to believe so why keep it up about socially acceptable things? </p><p>So then that pisses the rest of my mind off and it can't think of anything else to say. And then there's a silence and finally it goes,   because it smells.  And even the deviant bit can't argue with that.</p>",
 "year": "2002",
 "id": "15326",
 "timestamp": "2005-04-13T07:00:00.000Z",
 "views": "5021",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
