{
 "id": 15322,
 "title": "Like Looking Through an Open Door",
 "date": {
  "submission": "2004-12-20T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Canuck",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>I had recently purchased a kg of leaves, and made extract with it (10x, 20x, and 40x). Before this experience, I had used 10x and 20x about 4 times each, and was aware and prepared for what salvia can do to oneself. I *INSIST* that before trying 40x, to try some 10 and/or 20x first, to get an idea of what can be expected.",
  "I sat on the bed, with my sitter (another essential aspect to salvia) sitting on a chair to observe me. I smoked a full bowl of 40x in my waterbong (with a butane torch lighter), and held the smoke. After approximately 30 seconds, I exhaled.",
  "I will now detail what my sitter witnessed, since I did not see anything in the room for the next 8 minutes.",
  "After I exhaled, I looked around, touched myself a few times, then touched the bedside table. My sitter asked how I was doing, at which point I sat straight up and said 'Unemployment strategy'. (I do not recall looking around, touching, or saying that). Then sat still, and after a few minutes, a long line of drool started to slowly ooze out of my mouth, a strand extending to just above my bellybutton, where it hit my shirt. Shortly after, I lied down on my back. About 30 seconds later, I said 'wow, oh my god, amazing', and was back to reality. My eyes had been open the entire time. 8 minutes had passed since exhaled and started talking again.",
  "Myself, I remember exhaling, but do not remember getting to the place where my trip occured. I was in a place, with a wall of moving colours in front of me. They were moving in strange patterns, and I knew they were alive. I was also not in my body, I was just *there*, just beyond them. At one point (likely when drool hit my shirt), i got a sudden rush/tingle/cool feeling, and a green box fell directly in front of me, taking up about 1/3 of my field of view. Its edges weren't crisp, and it shook and morphed then dissappeared. Shortly after (I should note that my sense of time was not at all normal, neither faster nor slower, but still not normal), the colours began moving in an organized manner, as I knew there was now a competetion starting, somewhat like a race. The whole time it was not just like watching something happen, I was part of it, it affected every sense, and a few more, totally and completely. I was in a different world/dimension/universe/conscienceness.",
  "Immediately after this competetion began, the space where I was began to pull down and back from me. As it receded behind me, I saw that it was a short, small tube, and it was covered in what can best be described as greyish saran wrap. I could still make out the moving colours through it, however. As I 'looked' forward again, I was in total blackness, with 2 sources of light just off in the distance. I immediately began rushing towards them. I then realized they were my eyes, and as I got closer, I could see more through the holes in the blackness. I liken it to looking through an open door, then walking towards it. As you get closer, you can see more of whats on the other side of the door. Same idea, only it was the field of view from my eyes that was growing as I rushed back into my body. It was as though I was behind my body, in some deep recess of my mind, or in another dimension returning to mine.",
  "As soon as I was at my 'eyes', I snapped back to reality, and said something along the lines of 'wow, oh my god, holy shit, amazing', etc.",
  "At this point my sitter asked increduously how it was, telling me I had been out for 8 minutes, that my eyes were open, and what I had done (along with that I was generally unresponsive). I couldnt believe I had touched things, spoken, that my eyes were open, or that it had really been 8 minutes (Im used to trips lasting under 5 minutes). I can confidently say that this was the *MOST* powerful experience I have ever had, and I am very glad I did it. I have never had an out of body experience before, and am extremely glad I've had one. That said, it is not a to be taken lightly, and I wont be using 40x very often.",
  "This drug demands respect, and before doing it, ensure you have the proper tools, setting, and reliable sitter. If one is responsible, it can be a very fullfilling experience.</p>"
 ],
 "erowid": {
  "id": "33950",
  "citation": " Canuck. \"Like Looking Through an Open Door: experience with Salvia divinorum (extract) (ID 33950)\". Erowid.org. Dec 20, 2004. erowid.org/exp/33950",
  "substance": "Salvia divinorum (extract)",
  "views": "13039"
 }
}
