{
 "id": 15324,
 "title": "Hard Sleep",
 "date": {
  "submission": "2000-10-19T07:00:00.000Z"
 },
 "author": {
  "name": "jem",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100"
   },
   "administration": "oral",
   "substance": "Tryptophan",
   "form": "capsule"
  }
 ],
 "report": [
  "Dosage: 10mg Paxil daily, two 50mg capsules of 5HTP",
  "Setting: going to sleep",
  "Experience: I had had too much coffee that day, it was 2 in the morning, and I was bored and jittery and really wanted to go to sleep. I took the two caps of 5HTP as per the directions on the bottle and lay in bed waiting to get sleepy.  After about half an hour, I did, but not intensely; just enough to justify turnoung out the light and giving up on my book.",
  "I slept HARD.  And intersprered throughout were long, intense, extraordinarily detailed dreams.  Enire societies, with their own mode of dress, moral stances, general facial chracteristics, etc. were created just so that they could play out the concerns of my subconscious. Unfortunately I don't remember the dreams today; i'm lazy as shit, and even though I don't have a job and I caould easily keep a detailed dream journal, I didn't do it.  I haven't transcribed any of the maddeningly intense dreams I've had since I lost my job and started sleeping my physically normal scehdule, which is from 2am to 10am (though sometimes it stretched from 11:30pm to 11:30 am), and I wonder what kind of infomation I might find hidden in those intricate landscapes, where everything down to the fabrics of the clothes that people wear, and the lighting of the rooms, is emotioanlyl significant.",
  "I woke up in the morning feeling paralyzed.  I have slept heavily before, but usually after I lie there for a while, sense returns.  I lay there for a long while without being able to move my heavy limbs mor ethan a few degrees.  It was really terrifying, and only the sensation of unreality that had followed me from the dream kept me from feeling panic.  I remembered having taken the 5HTP the night before, and understanding that, in combination with an SSRI in my bloodstream, that it was a risky move (for that reason, I don't allow myself to take melatonin while on SSRIs, which is a drag -- I love that sleep rush you get from melatonin, where nothing you can do will help you resist the onslaught of sleep!), but I hadn't anticipated that the effects on waking would be so intense.  After lying there for almost an hour (when it usually takes me less than five minutes to actually get my ass out of bed, no matter how sleepy I am), I was able to actually get up.  I felt so dizzy I was nauseated; I felt on the verge of fainting every few steps.  With great effort I took a shower and got dressed; I had plenty to do that day, being unemployed and such, but I just felt weak and removed from 'reality'.",
  "That feeling of unreality stayed with me all morning, even after a larger coffee than what I usualy have; I forced myself to twalk the 10 blocks to the library from my bank downtown, but it felt kind of like the walk I took the day after having had a spinal tap -- I was working as hard as I could, but I was still walking as slowly as an old woman.  It's one of the most frustrating feelings in the world, expending tons of energy and only getting a piddling performance out of my muscles. ",
  "Eventually I came home again and sat on the couch and watched the Kids in the Hall and felt a little bit more strength return, but not much.  And how much strentgh do you need to watch TV, anyway?",
  "My friend swears that I have a unique metabolism... I wish it were unique in a 'take anything and be fine the next day' sort of way.  I suppose that soon, it will be immaterial, because my Paxil prescription is almost gone -- I have less than 2 week's supply left, and then I'm thrust back into the cold world of Unregulated Serotonin.",
  "My body tends to react to chemical confusion by knocking me out cold, or making me speedy and sleepless, but exhausted.  I'm semi-famous around these parts for a general-sized dose of LSD25 keeping me awake for at least 18 hours after ingestion -- increase the dosage, and the sleeplessness increases by 12 hours each.  Yeesh."
 ],
 "erowid": {
  "id": "3397",
  "citation": " jem. \"Hard Sleep: experience with Paroxetine (Paxil) & 5-HTP (ID 3397)\". Erowid.org. Oct 19, 2000. erowid.org/exp/3397",
  "substance": "Paroxetine (Paxil) & 5-HTP",
  "views": "29892"
 }
}
