{
 "title": "Stunning Immediacy",
 "author": "Roach Clip",
 "citation": " Roach Clip. \"Stunning Immediacy: experience with Salvia divinorum (ID 15322)\". Erowid.org. Jun 30, 2002. erowid.org/exp/15322",
 "substance": "Salvia divinorum",
 "bodyweight": "110 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)"
 ],
 "report": "<p>I recently purchased one gram of a 10x extraction of salvia divinorum from a respected online seller. I would like to share my first experience using the substance. I used a tiny sprinkle of the extact material, not even enough to line the bottom of the small bowl on a metal/clay pipe I had previously used for marijuana.</p><p>The smoked salvia divinorum high is one of stunning immediacy. Very rapidly after exhaling my first deep hit of the hot, bitter, but light smoke, I felt lightheaded and hot all over. My heart pounded in my chest and I began to sweat.</p><p>Did I say stunning immediacy? More like being shot from a cannon. WHAM! Suddenly, I was swept up by something on my left. It felt like a craft or a machine moving at light speed with incredible force. I felt it for an instant. I heard a young boy yell 'come here' or 'get on' before it zoomed off. I looked up and sensed small beings-perhaps elves-scurrying off about six feet ahead of me and toward the left. I think they were laughing at me. I looked down at the pipe and lighter in my hand. I felt that they were remnants of the fast moving machine that had somehow broken off and were left in my hands. For a moment I theorized that the speeding machine I felt must have smashed through from the future and that the voice I heard was a distant relative of mine inviting me to jump on and come with him into his time. I felt my presence on this machine was of dire importance, but I was unable to stay on it, and that by falling off I had caused some kind of singularity in time/space. The pipe and lighter were keys or proof of the machine's existence.</p><p>I frantically looked around the room. It seemed as though every edge of every object in my cluttered living space were a seam in the fabric of space/time. I wished I could open them up. I didn't know who or where I was. I was definitely somewhere else. I was definitely not alone. I wasn't particularly comfortable however. For a moment I imagined that some of my 'friends' from my past had drugged me, that everything was an elaborate scheme to make me retarded and enslave me. Through a force of sheer will I pulled myself back through my childhood. I imagined elementary school, my grandparents, and playing in the backyard as a rush of memories. I looked at my belongings and wondered who they belonged to. Then I remembered my girlfriend, my life, and my identity. Just as suddenly as it had begun, the rush ended.</p><p>Remarkably, all this occurred in about one or two minutes!</p><p>I was numb. I expected it to be quick but nowhere near as powerful as that. For a few minutes afterward I struggled to make sense of what had happened. It was all very lucid. There was no hint of a stoned feeling. It was more of a lost in the woods anxiety. Do NOT fuck with salvia if you've got a heart condition.</p><p>I was back to normal in about a half hour. I tried smoking again. The effects were just as rapid and just as disorienting. Once again I had to forcibly pull my identity back. More reflection is necessary before I smoke any more of this potent herb. I like it, but it requires great maturity and mental preparation to be fully appreciated. I'd like to get to the point where I can enjoy the otherness of the experience without feeling a need to forcibly yank myself back into the real world. I may have made a mistake trying the extract before the leaf.</p><p>Back in the 90's, as a retarded art school student, I tried consuming amanita muscaria (another legal psychoactive). Salvia can be kinda creepy, but it's over quickly and after only one experience, I'd call it a bit visionary. Amanitas, on the other hand will make you insane.</p>",
 "year": "2002",
 "id": "15322",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-30T07:00:00.000Z",
 "views": "7395",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
