{
 "id": 15327,
 "title": "The Tribal Man and The Kitty Guide",
 "date": {
  "submission": "2007-03-07T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Raoul Duke",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(cookie / food)"
  }
 ],
 "report": [
  "<p>I've done shrooms once before this experience, and it was not nearly this fun or enlightening. My friend T and I had been searching all day for some shrooms or pot to no avail. T finally got desperate and called one of his friend's brothers. He said he could get us some very potent shroom candy. He said he'd meet us at the highschool in 30 minutes. We started running towards the school.",
  "We got to the dugout where we were suposed to meet this guy, and he wasn't there, so we called him. He said the dealer would be there in 5 minutes. We sat around and waited, feeling very excited. The dealer showed up. I knew him from back when I skateboarded nearly every day. He walked over and pulled out his wallet. There were 5 slightly golden nuggets wrapped in green cellophane. He told us to take any two we wanted. We gave him the $30 and took the biggest two he had. He asked us if we knew about shrooms, and we nodded and the dealer took off.",
  "We walked through the school parking lot and started back to my house. We were really excited. We walked through the college and ran through some sprinklers. We hopped the wall that separated the college and the grocery store, and headed towards the street. We got to the stoplight and waited. We ate approximately 1/4 of each of our shroom nuggets. They tasted like crap.",
  "The light turned green and we ran accross the street. We ate another 1/4 of our shroom nuggets halfway to my house. We got inside and had a quick chat with my dad, then retreated into my room.",
  "T ate his entire nugget and waited for the effects. By 9 o'clock I was already feeling the effects and I still had a large chunk of nugget left. T convinced me to eat the rest, and we started watching Married with Children. Al kept talking about a John Wayne movie called 'Hondo'. His obsession with the movie amazed me. I started shouting 'HONDO!!!!' at the top of my lungs. I was laughing really really hard at this point.",
  "Now, bare in mind that I'm not sure what order these events went in, so I'm just guessing from here on out.",
  "Al was stuck in a grocery store ranting about Hondo. He started talking about how things used to be before computers. There was a big old west scene that I barely remember. Al proceeded to throw one of the registers at the un-breakable glass and it hit him in the head. I was laughing harder than I thought anyone could laugh. The show ended and I decided to go take a leak. I was staring down at the toilet and it slowly turned in to a giant toilet spider. It grew eyes and a mouth out of the back and sprouted green and black legs out of the bowl.",
  "I was a bit unnerved by my toilet turning into a spider, but for the most part I could just think, 'Awesome!' I went back into the room and told T about it. I don't remember what he said. At this point we ran out into the kitchen and grabbed up a bottle of 500mg vitamin C tablets. I took 10 and T took 8 or 9. We ran back into the bedroom and Tony was lying on the bed saying something I couldn't understand. I was busy staring at the sticker on my door that had wavy lettering. It was moving around and I was mesmerized by it. T ran into the bathroom to look at the mirrors.",
  "I went in there with him so I could have someone to talk to. I sat on the toilet, completely forgetting that it was a spider. T talked to himself in the mirror for a while, because at this point we thought there were other people living in a mirror world just on the other side of the mirror.",
  "T suddenly looked over at me and proclaimed 'YOU ARE A CAT!!' For some reason, this upset me and I denied it for a good half hour. I finally accepted it and got up out of the bathtub which I had fallen into while denying that I was a cat. I looked at T and shadow and color became one on his face. This new substance started to drip down the bridge of his nose and engulf his face. His face was suddenly painted like some stereotypical tribal villager of some lost jungle. He suddenly gained another piercing in his nose, and his mohawk turned into a river of fire.",
  "I shouted 'YOU ARE A TRIBAL MAN!!!' and ran accross the hall back into the bedroom. He came over a few seconds later and started knocking on the door. I said something like 'Get out of here you crazy spear carrying tribal guy!' He coaxed me into cracking the door open a little bit. I said 'What do you want here? You're gonna kill me with that spear there, aren't you?'",
  "He denied any knowledge of a spear, but I saw him there, with his face paint, firey hair, loincloth and spear. He finally convinced me that he wasn't going to harm me, so I allowed him back into the room.",
  "He layed on the bed and walked upsidedown on some kind of translucent platform that I had no knowledge of. It didn't matter to me, I was back grooving with that sticker.",
  "The next thing I remember, we were in my old bedroom, and I was hanging on to the closet door. I was saying to T, 'If I let go of this door, he'll die! He's sick! He needs me.' T was busy jumping back between the closet and the desk. After about 30 minutes of hanging on to a door: I was baseline. My trip was ended. I let go of the door and walked T back into the hallway. We went on a walk and T discovered the beauties of light, color, and nature.",
  "This was a very mind expanding experience. I'm not sure how it was mind expanding, but a day after it ended, I was different. Just like the first time I had eaten this magical fungus. I recomend that everyone do shrooms at least once in their life. It's one of the best experiences anyone could ever have.",
  "- Raoul Duke</p>"
 ],
 "erowid": {
  "id": "33989",
  "citation": " Raoul Duke. \"The Tribal Man and The Kitty Guide: experience with Mushrooms (ID 33989)\". Erowid.org. Mar 7, 2007. erowid.org/exp/33989",
  "substance": "Mushrooms",
  "views": "2792"
 }
}
