{
 "id": 15333,
 "title": "Very Few Noticable Differences",
 "date": {
  "submission": "2004-10-28T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ephemerides Dragon",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "IAP"
  },
  {
   "time": "0:30",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "IAP"
  }
 ],
 "report": [
  "Some friends of mine acquired IAP a month or two before hand and didn't like it. So I bought 60-100 mg for about 5 bucks. My friend divided the IAP up by eyeballing it, so there was either 30-50 mg in each pill. I took one pill a block of school at about 8:30 am and didn't feel anything for a while. Half an hour later I wondered if anything was going to happen so I took the other pill. As the day went on I felt hot and cold flashes and some people commented about my extremely dilated eyes. I could start feeling it come on at about 9:30.",
  "There were very few noticeable differences. Light reflections off of walls and windows were more vibrant and interesting. My legs felt odd and at times as though they were sinking into the ground. I felt no euphoria and my attention span wasn't any better or worse. It was difficult for me to explain or speak to anyone when they asked me questions. It made me more quite overall. In retrospect, it reminds me of a dxm afterglow. Tired, dimwitted, and fairly sluggish.",
  "After school at about 3-3:30 I smoked some marijuana with some friends. The effects the marijuana had were minimal. Actually, I didn't feel any high at all after smoking it and apparently they were some headies. Which was dissapointing. After that at about 4:30 I was driving home and I started to get a slight headache in the lower back of my head.",
  "The next day I was more aggresive and more emotional. For a while afterwards I was like this. I had a very strong desire to quit my job and I felt an overwhelming hatred for my boss.",
  "All in all IAP did very little for me and I wouldn't try it again, even if it was free."
 ],
 "erowid": {
  "id": "34005",
  "citation": " Ephemerides Dragon. \"Very Few Noticable Differences: experience with IAP (ID 34005)\". Erowid.org. Oct 28, 2004. erowid.org/exp/34005",
  "substance": "IAP",
  "views": "11800"
 }
}
