{
 "id": 15330,
 "title": "An Alcohol Trip?",
 "date": {
  "submission": "2000-06-09T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ishmael",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.2",
    "unit": "gal"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  }
 ],
 "report": [
  "Well, after a rather rousing show at a local club, I went back to a friend's home and utilized a Fifth of Whiskey to an unexpected end.  Over the course of about an hour, I consumed the entire fifth straight and proceeded to become very drunk.  What must be understood is that I was doing this drinking only for the sake of being drunk.  I had not intented, nor had I ever heard of Alcohol (besides in the Uncharist) used spiritually. ",
  "Well...I, needless to say, felt very groggy very quickly.  I sat down in an overstuffed armchair with my feet up and instead of passing out, as would be typical, I felt myself 'slip' into a quasi-trance state.  With my eyelids fluttering, I was still perfectly aware of my body; sensations were normal (I could feel the cool evening breeze flowing through an open window).  But quickly, I had the sensation of moving OUT of my body, away and upwards through the top of my head (an odd one of a kind feeling).  I only then, after realizing I was in fact FEELING this that I began to actually SEE myself below.   Keep in mind this was like a division of consciousness here; I could still feel my body and feel myself away from it. ",
  "At this point I made the choice to concentrate on myself aloof from my body.  Well, quickly I was flying away from my body, away from the house...like I was being pulled away instead of directing myself away.  Well, I was pulled out into the sky, away from the city, away from the state away from the country until I was actually in space flying away from Earth and the Moon.  I went through a few asteroid fields as I cleared the solar system and continued outwards with increasing speed.  Moving away from the expasiveness of the galaxy, I watched it solidify into the spiral that characterizes it.",
  "On the same tolken, I was soon far enough away that It was like a mere star and every other galaxy about was the same; reduced to single points of light.  These too then began to coalesce until I was looking back at the universe at the point of the Big Bang; looking at the waves of energy that themselves created and formed into what appeared to be gyrating atoms.  These atoms TOO solidify into matter...and this matter, as I removed myself away from it further and further...I realized was a hair on my head!  I then gasped and sat straight up in my chair...laughing uncontrollably.  The entire experience took me less than a couple of minutes (by looking at the clock)."
 ],
 "erowid": {
  "id": "34",
  "citation": " Ishmael. \"An Alcohol Trip?: experience with Alcohol (Whiskey) (ID 34)\". Erowid.org. Jun 9, 2000. erowid.org/exp/34",
  "substance": "Alcohol (Whiskey)",
  "views": "146523"
 }
}
