{
 "id": 1534,
 "title": "Hot Combo",
 "date": {
  "submission": "2002-05-21T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "NSU",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "1:10",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Just a week ago I tried a new combination that seemed to be well suited to introspective and creative tripping. After having been recently introduced to 2C-I, I quickly became a fan due to this compounds rather subtle, gentle, yet powerful nature. It struck me as a good enhancer of other drugs and I have tried it with a number of them but I was curious as to what the synergy between this and LSD would be like.",
  "Having established my adequate 2C-I dose to be at 25mg oral and 10 mg insufflated, and having come across some medium-potency acid, I decided time, set and setting were right to conduct the experiment on this combo.",
  "T+0:00  -  I drop the acid first just to make sure it  works properly and it is consistent with the rest of the batch. Within 15 minutes first alerts start, just a heightened awareness that tells me this acid is smooth on coming up, not bunk nor overly powerful.",
  "T+0:45  LSD effects much more pronounced now, ripples and traditional edginess starting.",
  "T+1:10  The acid is coming up nicely and I decide to snort 10 mg of 2C-I. The effect is almost immediate, launching the trip into a very steep curve and in 15 minutes it reaches a new dimension, one in which  I am very stoned yet retain incredible clarity and calmness.",
  "T+ 2:00  Still coming up. What an amazing trip!! While it is clear that LSD is the dominant psychedelic here, the 2C-I has added much warmth and its own spin to it. Visuals are fantastic, revolving shapes with characteristic electric green, purple, blue colors, ripples but with some decidedly smoother shaping, gently popping up in orderly stereoscopic fashion. Also, tinges of  kids toys feel to them, a very distinct trait of past 2C-I trips for me.",
  "And despite being in a very intense psychedelic journey, I feel very little of the edginess I usually feel on acid.",
  "I put on some wildly different styles of music and seem capable of getting into every note while paying attention to the great visuals and engaging in creative thinking, all at the same time. My mind is working so fast, I would love to have some of my usual buddies around to chat but that was not possible.",
  "T+4:00 I reach a plateau, albeit a very high one. I am very stoned but feel absolutely great, aside from a bit too much edginess. This is taken care of by ingesting 7.5 mg of midazolam, but otherwise I feel fine, buzzing with energy and creative thinking.",
  "I put on more specific music and apply my full concentration to thatMan, this is great!!! I stare at the ceiling, which by now has been turned into a full canvas, where exquisite visuals respond to every note, purple lights intertwine with head shapes of alabaster, shards of multicolored glass shine in all directions, all in perfect tune and tempo with the music.",
  "I keep at this for a long time and, frankly, lose count of time and have some wavy recollections after this point.",
  "T+8:30 Have come down a notch but still going strong. I decide it is time to hit the sack as in 2 hours will have to pick my girlfriend at the airport, and take 15mg of midazolam to sleep a bitBut to no effect, which is weird, it generally works just fine for me. Fortunately, I hit baseline (or whereabouts) in just about time to drive. Even at no sleep, feel great and energized.",
  "Conclusions:",
  "This combo was very successful and much stronger than I had anticipated. The interaction was good, with LSD dominating the effects but with good synergy. The 2C-I, at this dose range, made the trip stronger, faster and gentler. It added its own color and shape twists, while not making the whole experience overly intense.",
  "And it added a warmth that is distinctively different from that of MDMA, where the body warmth and lovey feeling makes for a nicer acid trip. 2C-I seems to make the mental aspects of the acid trip more connected to your own experiences, closer to home in a sense. It also makes the visuals startlingly richer, by adding its own palette of colors and shapes while never clashing with LSD.",
  "A word of caution though: as with any psychedelics, watch out for proper doses when trying this combo. I think a pinch more of 2C-I could have turned it into a too-intense-to-handle experience. Before attempting this, make sure you have tried and established adequate doses of each one of these drugs.",
  "But for creative thinking, musical endeavors and sheer psychedelic exploration, this combo is excellent and I highly recommend it. Hot tripping indeed"
 ],
 "erowid": {
  "id": "14792",
  "citation": " NSU. \"Hot Combo: experience with LSD & 2C-I (ID 14792)\". Erowid.org. May 21, 2002. erowid.org/exp/14792",
  "substance": "LSD & 2C-I",
  "views": "12289"
 }
}
