{
 "id": 15356,
 "title": "Noted Side Effects",
 "date": {
  "submission": "2004-06-04T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "DrHomerG",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 ug",
   "administration": "oral",
   "substance": "Pharms - Atomoxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": ""
  }
 ],
 "report": [
  "<p>I wanted to post this note to describe several side effects I have experienced with 2C-I. I admire this drug for its recreational value; providing a social lubricant, a pleasant body high, and engaging visuals. However, while many view 2C-I as a wonder drug for achieving such positive results with minimal body load, I have had several negative body reactions.",
  "1) A general queasiness persists throughout the entire trip. As many users have reported, I feel no prominent nausea and/or vomiting from the substance. This includes taking 2C-I after eating a meal, and eating while under the influence. Yet while I am able to eat and my body does not protest, food is not appealing. My body feels an anxious queasiness bordering on anorexia.",
  "2) A post-trip headache always occurs. If I fall asleep after a 2C-I experience, I wake up with a pounding headache similar to an alcohol hangover. However, I have found drinking coffee clears this up wonderfully.",
  "3) The most recent negative side effect I found (and my reason for posting this note) was bloody stools. This only occured after my last time taking 2C-I. I have recently been taking 60mg Strattera daily, a selective norepinephrine reuptake inhibitor (SNRI) prescribed as the only non-stimulant ADD medication. While no subjective interactions between 2C-I and Strattera were noted, such as an intensified or nullified trip, perhaps a possible gastrointestinal interaction occured leading to my bloody stools. This side effect was not present after 48 hours of ingesting 2C-I.</p>"
 ],
 "erowid": {
  "id": "34091",
  "citation": " DrHomerG. \"Noted Side Effects: experience with 2C-I & Atomoxetine (ID 34091)\". Erowid.org. Jun 4, 2004. erowid.org/exp/34091",
  "substance": "2C-I & Atomoxetine",
  "views": "29737"
 }
}
