{
 "title": "Bitter/Sweet",
 "author": "Heli0s",
 "citation": " Heli0s. \"Bitter/Sweet: experience with Wormwood (ID 15367)\". Erowid.org. Jan 12, 2007. erowid.org/exp/15367",
 "substance": "Wormwood",
 "bodyweight": "155 lb",
 "report": [
  "<p>It is now 11:58 p.m. June 5th 2002, and I have a nice brew of wormwood tea sitting in a bowl in front of me.  I have only taken a few sips so far, so I will come back to this when the consumption process is finished and I feel the effects a little more. There's about a full glass' worth of it, and I put in about 10 tbsp of sugar, because this stuff is super super bitter.",
  "Last night I attempted making some but I didn't steep it in boiling water, rather I steeped it in room temperature water, because I read from certain sources that the active ingredients in wormwood are very sensitive to heat and can be destroyed very easily.  However, earlier tonight, I read from another source, with many many good references, that the correct way is to pour boiling water over it and let it sit like that for about 10-15 minutes.  There is definitely a difference in this drink compared to last night's.  This one seems Way more potent.  I've also tried smoking it but that doesn't seem to work, unless you have to smoke tons of it which is just a waste.  Its funny how different sources on brewing this stuff can be completely opposite each other.  That also goes for absinthe as well.",
  "Anyways, the taste of this stuff is very interesting, and unlike anything I've tasted before.  I put so much sugar in it that you couldn't possibly not noticed the extreme sweetness.  But the pervasiveness of the bitterness is so much that it balances out very strangely.  Its disgusting and delicious at the same time.  I know how much I'm rambling on but I haven't finished my drink yet! It just shows how eager I am to submit a report and convey my own personal reaction to this herb.",
  "I am nearly finished with my drink now and am already beginning to notice its effects.  Everything I see has a softer quality to it.  I have a slight stomach ache but nothing serious.  With every sip I notice the bitterness more than the sweetness, but its still not too bad.  Right now I'm going to get up and move around and get my blood circulating.",
  "Ok, it is now 12:47 p.m. June 13th.  After looking through a Salvador Dali book, I walked around my house for a bit.  The effects are definitely arising, although very subtle.  I am noticing the dimensions of the rooms are more well defined.  I was observing a curtain in my living room with a flower pattern.  There are no visual hallucinations yet, but while looking at the lovely floral designs on this curtain, I felt I could account for the pattern better as a whole, and not just looking at one space of it, and scanning across it with my eyes like that.",
  "Its hard to describe.  My peripheral vision seems more like normal vision, like where I'm not looking, I am looking.  I can feel a fuzzy warm feeling around my body, not inside, but around me, like a hazy glow has formed.  My vision also has a fuzziness to it, but I can see quite clearly.  There doesn't seem to be much more to note at this time, except that my short term memory is slightly impaired.  So far the experience has been pretty disappointing.  My next experiment with wormwood will be for making absinthe, but for that I need to find a source with the correct recipe.</p>"
 ],
 "year": "2002",
 "id": "15367",
 "gender": "Male",
 "views": "11411",
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "(tea)"
  }
 ],
 "submissionDate": "2007-01-12T08:00:00.000Z"
}
