{
 "id": 15366,
 "title": "Skidalebebopbop!",
 "date": {
  "submission": "2007-03-07T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pseudonym",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "9:30-down the hatch, 18 mgs of 2c-e dissolved in water",
  "10:30-this is taking too long, nothing",
  "11:00-ok this is ridiculous, still nothing",
  "sometime after 11:00 2c-e crept up on me cuz im tripping.  The visuals remind me of mushrooms what with the dripping and the melting and the growing.  I've also noticed that it comes in waves.  About five minutes ago I was thinking to myself, this is strange, everything is back to normal. Even the body buzz had lifted. But now I'm definetly tripping again. ",
  "I'm feeling very adventurous, but the walls here are way too interesting and I dont want to leave them to act on that feeling.  I was trying to find out if my pupils should be dilating (they didnt) and now look at me, somehow i got sucked into writing an experience report.  There is a shoelace about 10 feet away from me on the floor and it is getting increasingly threatening.  I dont know how it got there, but every time i look over at it it seems that it has taken an even more aggressive stance.  I wouldn't call it threatening, because it doesnt scare me at all, I would probably liken it to a chihuahua coming up to you and barking furiously.  It is threatening, but it can't really do anything to you. ",
  "The shoelace, among other things amuses me.  I'm sitting in my basement with a stupid grin on my face just giggling at everything. I know I'll come back, this 2c-e headspace is most intriguing. Skidalebebopbop"
 ],
 "erowid": {
  "id": "34111",
  "citation": " Pseudonym. \"Skidalebebopbop!: experience with 2C-E (ID 34111)\". Erowid.org. Mar 7, 2007. erowid.org/exp/34111",
  "substance": "2C-E",
  "views": "3192"
 }
}
