{
 "id": 15367,
 "title": "Thanks Grandfather",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Coolbeanz",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Well, it happened that we had to take my grandfather's meds away as he was taking too many of them and at irregular intervals.  The upshot is that I've now got tramadol, fioricet, and a bit of darvocet.  I also had oral surgery a couple of days ago, so I have some vicodin from that.",
  "I haven't touched the other stuff, but have been using the tramadol lately.  First started with 50mg (a pill).  This caused some mild body sensations; noticeable and pleasant.  Then I went up to 100mg.  Started to get 'noddy.'  Eyes began to close, and feeling the rush of the drug in waves.  A bit like ecstasy in this regard. ",
  "Moved up to taking 100mg three times today.  First was this afternoon.  Made me more sleepy than anything else (I was also hungover and taking some other meds that can cause drowsiness).  So I took a nap and woke up early this evening.  A couple of hours after waking I took 100mg, then 100mg two hours later.  I was feeling quite stoned.  It's a deceptive high in that I think I'm all right, but I had to drive a bit and realized I wasn't doing this very well.  I noticed my vision was affected in that things began to approach the 'trails' and lag of acid.  I also felt a little dizzy and nauseated at times. ",
  "It feels pretty good, overall.  As far as side effects go, tramadol does create 'hesitancy' to urinate.  Not that I cant' go, just that it takes a bit more effort.  Also, it seems that I can't shit when I want to.  The drug also constricts my pupils.  And I can't keep shit straight--much like a marijuana high this way.",
  "For pain, though, this one seems to be nothing compared to the 800mg ibuprofen pills I was given for my pain associated with oral surgery: tramadol isn't very helpful, the ibu is."
 ],
 "erowid": {
  "id": "34114",
  "citation": " Coolbeanz. \"Thanks Grandfather: experience with Tramadol (Ultram) (ID 34114)\". Erowid.org. Jun 25, 2007. erowid.org/exp/34114",
  "substance": "Tramadol (Ultram)",
  "views": "3553"
 }
}
