{
 "id": 1536,
 "title": "Wild Heart",
 "date": {
  "submission": "2003-12-05T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "anonymous",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Growing up, I never drank soda, or even ate much chocolate, so I think my body was a little bit surprised to find caffeine in its system last summer. I tried a medimm sized cup - aside from warming me up on a cold day, it was miserable. I was lightheaded/dizzy, felt like I was floating, couldn't really talk, and the nervousness of the whole thing made my heart race. I liked the idea of coffee, because i'm stupid, so I kept drinking it in the mornings before work, thsi time sticking to a smaller size.",
  "By the time I went back to school in August (about a month later) I still hadn't graduated to a larger size and kept drinking the smalls. After a few weeks of school though the work would pile up and I got stressed, and my heart would race to the point where I would literally be bouncing around the quad, talking fast, and chain smoking. God cigarettes are good with coffee, took me long enough to catch on! I would 'race' for a few hours, then crash and sleep for about 3, a nap I guess.",
  "I then went abroad to London where the coffee is stronger - and to think I can't drive on a half a cup of starbucks. I quit after a month, I can't handle caffeine I guess. I will seriously stay up all night from one cup that I had at 4pm. Also, I noticed that I sweat more when I work out after drinking a cup. While I do well running using other machines, etc, I can just feel in my body that it's not healthy. True I do other unhealthy things (I smoke, eat badly, do other drugs) but I try to do them smartly. And working out on caffeine is not smart.",
  "i've learned a lot about myself though - that my heart is just not cut out for uppers. It pounds way too much. Many people at my school do cocaine, and I'll admit it's tempting. But at the rate my heart pounds on just coffee, I'd have to be just an idiot to do coke, or speed, stackers, etc. I still do enjoy coffee in small doses, rarely, after an all nighter or if I'm going out drinking for a long time. But since I've lived so long without it before, I don't see why I need it now."
 ],
 "erowid": {
  "id": "14799",
  "citation": " anonymous. \"Wild Heart: experience with Caffeine (ID 14799)\". Erowid.org. Dec 5, 2003. erowid.org/exp/14799",
  "substance": "Caffeine",
  "views": "12472"
 }
}
