{
 "title": "My Mental Battle",
 "author": "Rave Mage",
 "citation": " Rave Mage. \"My Mental Battle: experience with 2C-T-7 (ID 1537)\". Erowid.org. Jul 31, 2000. erowid.org/exp/1537",
 "substance": "2C-T-7",
 "bodyweight": "128 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)",
   "",
   " ",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>\nIt was 6:42pm when me and my friend were sitting at his kitchen table dividing up lines of lucky 7. We had just acquired some a couple days ago and were about to test drive it. After it was divied up, i took a key and dipped it in and snorted a fairly nice amount. I didnt see it, so i ate another bump. We were not using a scale so i had to rely on my estimation. Then i sat down watching tv for about an hour.</p><p>I didnt feel really anything but bit light-headed and some nausea. So i took a pill of 2cb, 1 hour later about 8pm. The 2cb kicked in getting the standard happy feeling with the accustomed body buzz. Nothing out of the ordinary, until i noticed a green mesh on the covering the floor. I tried to pull it off only to look up and see the walls melting, i thought it was the 2cb, so i kept telling my friend that this stuff doesnt work. Another hour later i could tell that this felt kinda like an acid trip but with more control. i can get into a 'bad trip' pretty easily but now i could think of somthing positive and my trip would get happy with a lot of laughter.</p><p>I still didn't think it was the lucky 7. I noticed my self getting very paranoid checking my other substances sitting in the other room, looking out the window and started to get the fear, but another friend walked in unexpectantly a very good friend iv'e known a long time, and I was deathly afraid of him! i had no idea who he was or what he was doing there, then the friend that was there first started talkin to him, i thought i was being plotted against. Then i remembered to think of somthing positive and i was back to normal again. Just sitting and constantly laughing at nothing. I felt as if all our minds were linked and we 3 could read each others thoughts. I would think of somthing and in a few seconds one of them would say it. Very strange but i knew i wasn't just so messed up i couldnt think and talk striaght.</p><p>i had complete control, unlike LSD where anything can happen and theres nothing you can do about it. I would say its hard to get the fear on this stuff. When i started to come down i was very realxed and calm. I had somewhat a new insight on psychedelics. That i could now handle them much better. After that i was so spent aching slightly so i layed on the floor unable to move. Woke up the next day pretty baked out my physical body. wasnt tired but i my thought patterns were slow.</p>",
 "year": "2000",
 "id": "1537",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-07-31T07:00:00.000Z",
 "views": "7215"
}
