{
 "id": 1538,
 "title": "Welcome Home",
 "date": {
  "submission": "2005-04-23T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Dr. Beaker",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This is my attempt to relate my first experience with psilocybin mushrooms which just happened yesterday.  Up until this point I have had no experience with psychedelics, having only drunk alcohol, smoked pot, and smoked opium (once). ",
  "My friend and I headed to the New York City Rainbow Family Gathering in Central Park (the Rainbow Family are a losely organized group of American hippies, and some of the nicest people you will ever meet).  I had no intention of tripping that day, having brought only about a gram of high grade weed.  We were among the first to arrive and were just hanging out waiting for everyone else to show (seems stoners are always late).  It was at this point that someone whipped out a huge ziplock bag of long thin mushrooms and offered handfuls to everyone.  I have been curious about shrooms for a long time now and readily accepted.  I ate several small stems and one very large one, I estimate that the dose was approximately 1.5 grams (half of an 1/8th sack) but I could easily be wrong.  My friend took a much lower dose (probably about half a gram) and experienced only threshold effects. ",
  "The first thing I noticed was slight nausea and a cold feeling.  My friend and I rolled a joint and went into the woods to spark it up.  This helped the nausea a lot and helped me relax while I anticipated the trip.  As the gathering gained steam I felt an increasingly intense body buzz and began laughing uncontrollably.  I began to feel the earth breathe underneath me, and the ground seemed to turn to liquid and swirl in tiny whirlpools before my eyes.  I pointed this out to some people and they knowingly laughed.  It was at this point that the Rainbow Family tradition of the 'Circle for peace' began.  Everyone held hands in a circle and held a resonant 'OM.....' for a while, then shouted in exuberance at the top of their lungs.  As cliche as it may sound, I looked up at the sky and saw a face smile down. ",
  "It was after this that the party really picked up steam.  Intense drum circles raged on continuously with different musicians sporadically jumping in and out, people lit up joints or munched on ganja brownies.  I remember dancing like a madman and feeling that I had returned to a primal state of mind that I had been wandering away from my whole life, and I was glad to be back. ",
  "We left about 5 hours after I had eaten the shrooms and I was beginning to return to reality.  Before we left, my friend and I went into the woods to smoke a bowl and plant a kind bud seed, giving something back to the earth that had provided these plants for us. ",
  "To sum it all up, shrooms gave me two distinct feelings.  One was the ability to instincivly sense positive or negative vibes, completely independent of space and time, what the Grateful Dead called a 'Ripple in still water, where there is no pebble tossed or wind to blow'.  The second was a feeling that I had returned to the natural state that I was 'supposed to' be in but had long since wandered from.  As the Rainbow Family motto goes:",
  "WELCOME HOME"
 ],
 "erowid": {
  "id": "14808",
  "citation": " Dr. Beaker. \"Welcome Home: experience with Mushrooms (ID 14808)\". Erowid.org. Apr 23, 2005. erowid.org/exp/14808",
  "substance": "Mushrooms",
  "views": "4256"
 }
}
