{
 "id": 15382,
 "title": "My Tolerance and an Adventure In Candyland",
 "date": {
  "submission": "2007-12-12T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ataslave",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "I had no experience with salvia prior to this experience. I was expecting something similar that of marijuana, but I was a quite wrong.",
  "I had recently purchased some extract of ebay. 5x/10x/15x/20x. About a gram of each.",
  "I would consider myself a veteran of pot smoking, and I was quite intrigued about smoking the mysterious plant. So I took out my glass spoon called Tigerlily (black with orange stripes), and sat down with my good friend 'S' who had also never tried salvia. I loaded a bowl of 5x and let S take the first hit. He told me his legs and arms felt wierd and sort of detached. I told him to take another hit, and he geeked out and started talking about how planes of glass protruded from my tv and such. He also mentioned something about lines of longitude and plants. I told him to write it down. Here is what he wrote:",
  "'lines composed of plant material, green, leafy, like poppy leaves, constantly changing. Planes composed of glass protruding from the tv with lines of concentration. Freaking me out a little'",
  "I decided I must try this.",
  "I packed a bowl of the 5x and ripped it clean. No effect.",
  "I waited a few minutes and packed a bowl of 10x and cashed it. No effect. I was starting to get worried like I had some weird tolerance to the salvia or something. By now, I was starting to feel a little tingling feeling in my feet, but nothing else. I decided to go all out and pack a full bowl of the 20x extract I ripped that one clean and started to feel a little weird. I told S to pack one more bowl of the 20x, and when I exhaled the last of the smoke, darkness filled the air. All I could see was S's face. I somehow wasn't afraid. Then this vision hit me:",
  "(this was written by me after I had finished the visual)",
  "'two rows one red, one blue, of animated 'Candyland Game Pieces' connected at the hands carried me nicely away from [S]. They hummed a tune, and told me that [S]'s real name was the popsicle stick man, and that his intent was to jab me with popsicle sticks. I was a little afraid and was covered in a blanket. The rows of candyland game pieces told my blanket to kill [S]. I told [S] to stay away from my blanket, because I did not want him to get hurt. '",
  "All of a sudden I open my eyes and the visual was gone. All this happened in the course of 4-5 minutes. It seemed like a lot longer. I'm curious as to why I was so tolerant to the salvia, and why S tripped after 2 hits of the 5x."
 ],
 "erowid": {
  "id": "34182",
  "citation": " Ataslave. \"My Tolerance and an Adventure In Candyland: experience with Salvia divinorum (5x, 10x & 20x extracts) (ID 34182)\". Erowid.org. Dec 12, 2007. erowid.org/exp/34182",
  "substance": "Salvia divinorum (5x, 10x & 20x extracts)",
  "views": "2598"
 }
}
