{
 "title": "So Close - First and Worst",
 "author": "Felix",
 "citation": " Felix. \"So Close - First and Worst: experience with LSD (ID 154)\". Erowid.org. Jun 10, 2000. erowid.org/exp/154",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "154",
   "Not Specified",
   "",
   "Not Given",
   "Jun 10, 2000",
   "12994",
   " "
  ]
 ],
 "report": "<p>\nIt was anticipated to be the best party (rave) in a long time and the set and setting couldn't have been better, so I decided that this was the night I would trip for the first time (I had actually taken acid a month or so earlier but nothing happened more than a very slight body fry, very disappointed).  I also decided that I would do 2 hits this time to make sure I would actually trip - BAD idea (just a hint - never do 2 your first time!).</p><p>So within 30 to 45 minutes I was starting to feel quite energetic and everything was extremely funny - I was basically running around telling my friends I was crazy and insane, just because it was fun to say, and I was laughing my ass off at my friend A. as she did old 80's dances.  I went into the bathroom and my face stretched up and down in the mirror, I looked at the floor and I laughed in amazement as the tile swirled and shifted.  I came out and found my friend B, he said that 'metro is here' but to 'not worry about it, they're just making sure everything's OK.'  I thought little of this and proceeded to watch glowsticks, dance, laugh at funny shit, and basically have a great time.  Until the lights turned on.</p><p>(Mind you I took the acid at 10:30pm, it was now probably about 11:30)  At first I wasn't really bothered by the lights being on.  Cops were shutting it down (venue wasn't licensed, gee great).  I was in such a good mood and I knew I could keep my cool, thinking that as I stood right next to a cop.  But soon everything turned to confusion, everyone had to exit the building through a narrow hallway that seemed long as hell.  Everything in my trip at that point turned 'ghetto' as people started chanting 'fuck the police' and I began to get increasingly anxious and paranoid.  Peoples faces stretched and distorted and their eyes looked sunk in.  </p><p>Once outside I couldn't keep track of any of my friends if they were more than 10 feet away from me.  Extremely confused, halfway lost, and just trying to keep calm, A. walked me to my car and had me wait as she went to find a driver.  At this point I think is where I peaked, right before the cop came up to me, telling everyone to move out and go home. </p><p>Before I knew it the cop was asking me who's car it was, (I said mine) asked if I could drive, (stupid me, I said no) then the horror started as he began asking what I took, if it was GHB, Ecstasy, LSD, asking if I 'wanted to go to jail tonight,' etc.  Everytime he asked, he made me look at him to answer, and everytime I looked it scared the shit out of me as his face morphed and stretched with an authoritative evil.  I knew he could tell I was lying, seeing how I kept looking away.  I scanned the parking lot as best I could for my friend A. who came up just in time and said told the cop that I had gotten 'dosed.'  I said yeah I drank some water that I had been dosed or something of that matter.</p><p>After what seemed like hours the cop believed that I had been dosed with some kind of drug involuntarily, took my pulse, which he said was around 140-160 bpm (because I was so intensely scared) and escorted me to sit me down by the ambulance.  The next 15 minutes I sat scared as hell asking for water, not being able to understand anything, still thinking I was in deep shit and my I was going to jail and my dreams and goals would never be reached.  I was so afraid I felt like crying (and I hardly ever cry) but I couldn't feel anything, no emotions, just fear and confusion.  They found me a cell-phone to use, I tried calling my friend V., she wasn't home.  Nobody was home.  Hell I even tried calling my dad and he would've been pissed, because all I wanted to do was go home where it was safe.</p><p>The rest of the trip was pretty much driving around all night in a passenger seat trying to locate other friends around town; it took me a good 2 or 3 hours for me to actually calm down once the cops let me go, I kept thinking that I was going to get caught if we got pulled over.</p><p>What I learned from this is to FUCKING MAKE SURE your setting is safe before doing any kind of drug, and to make sure you can handle it (and not to mention don't drive your own car to the party).  I wasn't ready for what happened that night and I don't think I could go through it again.  I'm eternally grateful to my friend A. for 'saving' me because had she not been there and had not come up at the right time with the right thing to say, I would've gotten hauled off and my future would be seriously fucked. </p>"
}
