{
 "id": 15402,
 "title": "Introspective Amplification",
 "date": {
  "submission": "2000-10-22T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Umbra",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 ml",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(liquid)"
  },
  {
   "time": "0:04",
   "amount": "1.0 ml",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(liquid)"
  },
  {
   "time": "0:08",
   "amount": "1.0 ml",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Dosage:",
  "0:00 1 ml of 'Emerald Essence' Salvia tincture, Sublingual",
  "0:04 1 ml of 'Emerald Essence' Salvia tincture, Sublingual",
  "0:08 1 ml of 'Emerald Essence' Salvia tincture, Sublingual",
  "Background:",
  "- no drug use for 2 months prior",
  "- on no medication or dietary supplements",
  "- previous experiments /w hallucinogens have shown subject to be relatively tolerant",
  "The reports I read on the web about this Salvia piqued my interest, and I eventually decided to try it out.  Smoking things bothers me so I opted for the sublingual absorption method of delivery and purchased a concentrated tincture, despite it being relatively a lot more expensive.",
  "When I first got it I tried a single .75 milliliter sublingual dose and noticed no effects other than a slightly stilled mind - but perhaps I was just tired.",
  "4 days later I decided to experiment again.  I took what was listed as a 'Moderate' dose alone in a quiet place.",
  "I first brushed my teeth, gums and tongue - as I heard this helps the mouth absorb the drug.  The directions indicated that a 'Moderate' dose is 3-4 dropperfuls (1 dropperful = 0.75 ml) and that this was best staggered over 3 consecutive 4-minute sublingual applications.  I put 4 dropperfuls into a shot glass.",
  "+0:00 (8:30pm) - I held a third of the tincture under my tongue.  It stung like a bitch - imagine holding vodka or 151 in your mouth.  Keeping it under my tongue made my whole mouth go numb and watery.  At least it didn't taste too bad - like slightly bitter raisins. ",
  "+0:04 - I swallowed the tincture left in my mouth and held another third under my tongue.",
  "+0:07 - I felt a weird muscle twitch in my leg, which quickly went away.  Weird body twitches are characteristic of my mushroom trips, yet at the moment I still felt baseline.",
  "+0:08 - I swallowed the tincture I had in my mouth and put the last third under my tongue.  A slight sensation of tightness developed on the top of my head. ",
  "+0:15 - Like someone who catches a faint whisper of something approaching in the distance, I stop what I was doing and tried to find a stillness.  I rested my eyes on the scene in front of me and unfocused my consciousness so it was directed to nothing in particular.  This stillness seemed to precipitate all the effects of the drug immediately and my vision tunneled.  Mentally I had been dropped somewhere else. ",
  "I dimmed the lights, sat down, closed my eyes, and meditated.  I was not scared; there were no visuals; no time dilation; no elation; no mental impairment.  The experience was indescribably introspective.  Memories, feelings, and the internal stage of imagination became more real and more vivid.  Everything internal was amplified, everything external was deprioritizes to the periphery of consciousness.  Looking around me things seemed simply less there - at one point I was drooling from the taste of the tincture lingering in my mouth and didn't even notice.",
  "I could see how the perception of an out-of-body experience could arise from higher levels of this drug.   At one point when meditating I tried to leave my body, and while I didn't have an out-of-body experience, I did have what I can only describe as a body-no-longer-relevant experience.  I was something else somewhere else traveling though a non-corporeal psychescape.",
  "After a while I opened my eyes and looked at the notebook sitting on my desk - I had planned to record the effects.  Bringing the pen to the paper, I quickly gave up in my struggle to try to find words for this experience.  As others have said before: Salvia is simply too weird to adequately describe.",
  "+0:25 - I left to get a Coke to wash the not-exactly-pleasant taste of the tincture out of my mouth.  I remember thinking, 'Am I walking straight?'  It definitely took more effort coordinating myself in the corporeal world, the disorientation being similar to maybe 3 or 4 hard ciders.",
  "+0:35 - I got back, sat down on my bed, and drank the Coke with some Pringles.  No nausea, but the Pringles tasted unusually oily.  It was good to get the tincture taste out of my mouth. ",
  "At this point I started to experiment more deliberately with the salvia state of mind.  First I tried solving some calculus problems and proved to myself I wasn't logically impaired.  Second, I listened to some music, noticing it seemed easier to get lost in.  Third, I tried for a minute to make objects levitate ... what do you know? ... didn't work.  Fourth, I tried to travel to the psychic body of a friend and asked her to message me to say she heard me ... this didn't work either.  Not that I had much faith in the last two experiments, but I couldn't find any reason not to try :)",
  "+0:45 - The internal amplification started becoming uncomfortable.  It was simply too loud too long and it didn't seem to be subsiding.  I tried to fall asleep and despite the caffeine from the coke and it being quite early in the evening, sleep came quickly.",
  "+1:30 - I woke up peacefully, but still feeling slightly off baseline.  I quickly fell back asleep.",
  "+6:30 - I awoke with the memory of a strange dream still echoing in my mind.  I was baseline and felt peachy, but had too much energy to fall back asleep.  That's what you get for going to bed so early.",
  "Afterthoughts:",
  "This is the weirdest drug I've ever taken in my entire life.  In my opinion it is neither recreational nor social.  If salvia had something to show me, I was not ready for it, because I do not feel like I came away from my experience with much other than a lingering feeling of undirected weirdness. ",
  "If I attempt higher doses I'll smoke it despite my disdain for that method of delivery.  The effect duration of smoked salvia is much shorter and if I'm to go deep into salvia-country I'd very much prefer a shorter visit to a longer one."
 ],
 "erowid": {
  "id": "3425",
  "citation": " Umbra. \"Introspective Amplification: experience with Salvia divinorum (tincture) (ID 3425)\". Erowid.org. Oct 22, 2000. erowid.org/exp/3425",
  "substance": "Salvia divinorum (tincture)",
  "views": "23465"
 }
}
