{
 "title": "Beautiful World",
 "author": "cliqhopper",
 "citation": " cliqhopper. \"Beautiful World: experience with Oxycodone (with Acetaminophen) (ID 15401)\". Erowid.org. Oct 15, 2005. erowid.org/exp/15401",
 "substance": "Oxycodone (with Acetaminophen)",
 "bodyweight": "250 lb",
 "report": "<p>Summer is finally here and it's a hot and uneventful Thursday afternoon. My friend X and I decided to spice up our boredom with a little medication.  To our suprise and happiness, we found all sorts of perscription meds in the house.  At about 1, X took 2 Flexeril (muscle relaxants) and went to lay down and listen to music.  I held 2 Endocet pills, deciding whether I should save them for another time or take them now.  3:30 rolled around and my curiosity got the best of me; I swallowed them with great anticipation.  I sat around listening to some IDM while my friend spaced out lying on his floor.  After an hour I began to get a little disappointed but just as soon as the thought hit me, so did the oxy.  It was euphoric, beautiful, amazing.  I'm a pretty big guy (6'2' 250lbs) and I was very surprised at how well the oxy was working.  I felt so calm and peaceful, almost as if the world around me didn't even matter.  It was like I just blended into everything around me.  I was truly happy.  </p><p>I lied down on X's couch and closed my eyes while the music carried me away.  I wasn't tired, just relaxed and calmed; I felt amazing.  I sat for hours not moving the slightest bit, just listening.  It wasn't so much that I couldn't move, just that I didn't need or want to.  I felt so perfect, I didn't want to even risk ruining it.  I didn't fall asleep the entire time, just let my mind go.  I had so many thoughts going through my head, but none of them mattered. </p><p>It was 7 and our friend, E, stopped by.  We were both still a little 'under.'  After a cup of coffee and some conversation, I was almost completely recovered from my experience.  I've experimented with many different drugs, mainly perscriptions, and so far oxy is by far my favorite.  I'll never be able to forget the warmth and comfort that came with them.</p>",
 "year": "2002",
 "id": "15401",
 "gender": "Male",
 "timestamp": "2005-10-15T07:00:00.000Z",
 "views": "24474",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 ]
}
