{
 "id": 15407,
 "title": "Whoops, Can't Count",
 "date": {
  "submission": "2004-06-11T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tim",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "9000 mg",
   "administration": "oral",
   "substance": "Gabapentin"
  }
 ],
 "report": [
  "   While sobering up in a less-than-luxury treatment facility (which I did need), I was put on a number of psychiatric drugs.  Principally, these were Neurontin, Serzone and some Klonopin.  Klonopin was less than 2 mg daily, but I don't recall the Serzone dosage.  But the moral of this story is as follows:",
  "My mind had been reasonably messed up on a combination of alchohol, club drugs and undiagnosed psychiatric conditions.  Neurontin was prescribed early on, but as my insurance was dubious, I was getting sample packs of neurontin from the psychitrist (when outpatient).  I started with lowers dose (400 mg x 3 daily) and increased.  Eventually, I was prescribed 1,000 mg x 3/day.  That's a lot, I am told.",
  "Now I've mentioned that my mind was messed up generally, and one of the things that I had to do was compile dosages from the various samples to get up to the 1,000 mg mark (he had no 1,000 mg samples).  Simple, but not for me.  Somehow I got really confused and was taking 3,000 mg three times per day (9,000 mg).  This lasted several days.",
  "During this period, some of the things that happened are as follows: (1) I stopped at a stop sign and waited for it to change (unlike stop lights, the signs don't change); (2) it was impossible for me to distinquish between the hot and cold water knobs while showering, except by experimentation (ouch!); and (3) the difference between the 'up' and 'down' buttons on an elevator essentially went away, resulting in necessary trial and error. I only did this for a few days before I figured out what was going on and stopped.  It was close to a disassociative effect, but generally falls into that broad category of 'zoned out.'",
  "I'm told I didn't hit the record at 9,000 mg, but I'd sure want some fairly sober people around me before doing that again.  I might decide that the best way to get a bottle cap out of the disposal when I couldn't quite reach it would be to turn on the disposal for a 'second or two.'"
 ],
 "erowid": {
  "id": "34262",
  "citation": " Tim. \"Whoops, Can't Count: experience with Gabapentin (ID 34262)\". Erowid.org. Jun 11, 2004. erowid.org/exp/34262",
  "substance": "Gabapentin",
  "views": "44216"
 }
}
