{
 "id": 1540,
 "title": "Not Too Bad At All",
 "date": {
  "submission": "2002-05-22T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Erik Revolt",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "11.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Amanitas",
   "form": "dried",
   "specific": "A. muscaria"
  }
 ],
 "report": [
  "I read many reports on the internet, so I ordered 28 grams so I could determine proper dosage. It took over a month for the package to arrive.",
  "I had this hunch last night that they would arrive today. Sure enough the box arrived after I woke up, but right before my 5 pm shift. I ate nothing, drank only caffinated liquids and smoked cigarettes to block hunger. It was very hard as being a line-cook.",
  "I got home and took out 1 very large cap and broke another in half. I  roughly guestimated about 7-9 grams at first dose. I immediately felt the dried fungus activating some enregy in me, similar to my experiences with psilocybin. About 90 minutes later, I felt a real speedy acid-like jitter. My mind was flying, I felt very powerful and a little wild. My friend made a surprise visit and I he couldn't tell how my trip began to peak.",
  "About 2 1/2 hours the 'heady' buzz got stronger. I felt no nausea at all. I ate some chips and salsa. I tripped harder. The body rush was like that of MDMA. I felt like I was on cloud 9. I watched 'Zero Effect' and almost fell asleep. Slight visuals were everywhere as if I was on the verge of crossing into another world, but couldn't.",
  "I ate another 2-3 grams to see if I would trip harder. It's been 5 hours and I am still tripping hard. I still feel no sickness. If the trip keeps this good I may do this more often. I will add more if something different happens. This reminds me a lot of ecstasy & acid. Like one big candy flip. Wave after wave of almost rolling/ tripping. Very clean as well."
 ],
 "erowid": {
  "id": "14814",
  "citation": " Erik Revolt. \"Not Too Bad At All: experience with A. muscaria (ID 14814)\". Erowid.org. May 22, 2002. erowid.org/exp/14814",
  "substance": "A. muscaria",
  "views": "16719"
 }
}
