{
 "id": 15403,
 "title": "Research Chems + Opiates",
 "date": {
  "submission": "2004-06-09T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "persistent",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "Methadone",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": ""
  },
  {
   "time": " T+ 2:00",
   "amount": "20 mg",
   "administration": "IV",
   "substance": "2C-C",
   "form": ""
  },
  {
   "time": "0",
   "administration": "IV",
   "substance": "Heroin",
   "form": ""
  },
  {
   "time": " T+ 48:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Propoxyphene",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "AMT",
   "form": "(daily)"
  }
 ],
 "report": [
  "I, persistent, have become a severe opiate addict. Currently I am on 35 mg methadone per day. Today, I had to go without my daily dose. I have been injecting a balloon of heroin or extra methadone almost every day, and have been taking 10-20 mg amt per day, and injected 20 mg 2c-c on top of 20 mg orally 2 days ago.",
  "An oral dose of 20 mg 2c-c was almost unnoticeable. At the 2 hr point I injected 20 mg with some heroin. The rush of visuals was quite impressive, completely obscuring my vision, and were accompanied by a dmt-type carrier wave and severe nausea. This only lasted a few minutes. By 20 minutes later I was unusually bored for being on a psychedelic, and somewhat drowsy. (2c-c has very little in common with 2c-b,  and is only visual for me iv. 10 mg iv produced no visuals but still induced severe nausea. 15 mg insufflated was barely threshold. Interesting for comparison purposes, but not a particularly fascinating compound.)",
  "The psychedelics have helped a  lot with the psychological side of addiction, and I swear that the amt slightly but noticeably reduces cravings and withdrawals.",
  "Today, by about noon, my withdrawals 30 hours post-methadone were unbearable. I managed to get my greasy addict hands on some pills. I took 200 mg propoxyphene napsylate plus 5 mg hydro and 15 mg oxy and still suffered minor withdrawals, though somewhat attenuated. I then very stupidly took 100 mg tramadol, being unaware of its potential to precipitate withdrawal in methadone addicts. Luckily this has not happened yet, perhaps my being on a low dose and having had no opiates in many hours helped. It seems to me that this tramadol may be a very useful aide in methadone detox, and I will follow this up soon. Even more interesting to me is the anti-addictive properties of amt, which may mimic those reported by Shulgin for aet. Further research in this vein is desperately needed, and it galls me to think of all the suffering addicts who may be helped by this now schedule 1 substance. I am interested in hearding about addicts out there who have experience with tramadol or amt or any other medicine that has helped with addiction/withdrawal, perhaps by sharing info we can come one step closer to a cure."
 ],
 "erowid": {
  "id": "34250",
  "citation": " persistent. \"Research Chems + Opiates: experience with Methadone,  Tramadol, Propoxyphene, Hydrocodone & Oxycodone, Heroin, AMT & 2C-C (ID 34250)\". Erowid.org. Jun 9, 2004. erowid.org/exp/34250",
  "substance": "Methadone,  Tramadol, Propoxyphene, Hydrocodone & Oxycodone, Heroin, AMT & 2C-C",
  "views": "62551"
 }
}
