{
 "id": 15414,
 "title": "Legal Empathy",
 "date": {
  "submission": "2007-06-13T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bedo Doobie",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "18",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "User background- Very experienced user of psychedelics with over 30 years of experience with LSD, peyote, morning glory seeds, cubensis. Experienced user of Ecstasy...first time user of 2c-I",
  "Purchased 2C-i through legal channels. Purity attested to be 98%",
  "Dosage level measured using accurate mg. scale.",
  "Having never tried 2CI before I started out with a moderate dose for my body weight.",
  "Taken at 1:00 PM on a nice sunny afternoon.",
  "First hour did not feel much at all but after about 65 minutes began having first alert.",
  "Next hour felt very speedy and circular thinking ,needing to be doing something enjoyable. Attribute mindset to heightened sense of anxiety around work issues which I was dwelling on even before started trip. Decided to go outside and work in the garden...much better.",
  "At three hours noticed thinking was lucid and felt a sense of calm and pleasure at the beauty around me though this was not too much different than I usually feel. Noticed a very little bit of the plants and grass breathing which I usually see when I am taking acid but very moderate psychedelic effects. In comparison to other psychedelics this dose level is more like Fisher Price- my first trip. Not much in the way of introspection that comes with LSD or peyote or morning glory seeds or mushrooms. Similar to taking about 1/4 hit of LSD.",
  "Later partner comes home and I notice I am very empathetic to her in our interaction.",
  "We go out for dinner. I am not hungry but she is, so I sit and spend time with her and watch the other people in the restaurant whom all seem quite individual. I get a more pronounced sense of the disconnect and connect that goes on between people in social situation and feel very strongly like taking the initiative in my own life to live my Life without being dictated to by social mores.",
  "We go home and I watch 10 minutes of Jon Stewarts DAILY SHOW which I always find funny and it is especially funny tonight.",
  "Then my partner asks me to help her with her leg and knee which is injured by doing energy work. I consent to doing energy work for her and find my ability to speak and see the energy fields with my hands is heightened. It is now 8:00 PM. I feel like I am 'down' but still feel quite energetic. I end up staying up until midnight and get up early the next morning (6:00 AM) to go to work my job which is quite physical. No ill effects on my body, not tired or 'hungover'. Able to work hard the next day. Feel quite cheerful.",
  "Over all I would say 2C-I is fascinating to me because in the environment I work in there are random drug tests done so no illicit drugs for me or I would lose my job, I may be a bit late to the party but for now 2C-I is still legal. Doubt that will last.",
  "At 18mg...not that interesting from a psychedelic point of view but recreational and not tiring."
 ],
 "erowid": {
  "id": "34279",
  "citation": " Bedo Doobie. \"Legal Empathy: experience with 2C-I (ID 34279)\". Erowid.org. Jun 13, 2007. erowid.org/exp/34279",
  "substance": "2C-I",
  "views": "4273"
 }
}
