{
 "title": "The Final Sunset of My Life",
 "author": "xiancurits13x",
 "citation": " xiancurits13x. \"The Final Sunset of My Life: experience with DXM (ID 15418)\". Erowid.org. Apr 28, 2008. erowid.org/exp/15418",
 "substance": "DXM",
 "bodyweight": "232 lb",
 "header": [
  "DOSE:",
  "1660 mg",
  "oral",
  "DXM",
  "(powder / crystals)"
 ],
 "report": "<p>Unlike most people I trip best when I am not in the best of moods. The trip of the psychonaut is exactly what I need sometimes to 'get a grip' on my life. So cut to the opening scene: It's an a windy October night, I had just lost the love of my life, I was sinking into the deepest depression I have ever been in,I was quickly losing all will to live, there was only one way out and it looked just like the edge of of a razor. So with nothing to lose I figuredI'd go for the biggest, deepest trip of my life. If I died, I wouldn't haven't care.</p><p>So many 'different' trips happened this night that I will only put down the one that effected me most.</p><p>I dosed at sunset on an empty stomach, the powder dxm was mixed in in with iced tea and was totally wretched. I watched the sun sink from my roof and about a half hour later I felt the effects take a hold of me. I quickly got off my roof and headed into my bedroom, doing the dxm strut along the way. I  got undressed, put on a cd and hopped into bed with the only illumination being christmas lights around the ceiling of my room.</p><p>Music: Black tape for a blue girl</p><p>A green mist quickly formed over head (always happens right when I start a trip) followed by hallucinations of translucent animals and humans dancing around my head, asking me to go with them. I agreed and thus began my journey into the final sunset of my life. While laying on my bed, bright lights backlit my head and it felt as though I had the sun against my back. I felt my bed tip down and I was being fed into the sun itself. I felt myself slide into this 'Sun' and I followed the translucent figures through the fires (ever see lord of the rings? the big firey eye of mordor scene?..imagine walking through that). I felt the heat (probably a dxm induced fever) of the sun and I knew for sure I would never return to my life. The music of black tape for a blue girl was perfect and it kept me so calm during the entire experience that I probably owe that album my sanity. So there I was following this group of translucent characters through the sun. Along the way I encountered dead relatives, 'Aliens', and my lost love. Everything was in perfect balance, I was happy and accepted whatever my fate was to be.</p><p>But suddenly walking through this corridor I found myself in a room that looked strangely like an acient egyptian throne room. I sat there, content to be in my new found kingdom. I thought I had died and somehow became a god and those translucent characters were the messengers of death and came for me to place me in my new world. Sure why not? I go from feeling I have nothing to live to being the supreme ruler of the universe (another amazing dxm affirmation). The trip ended with many more visitations and paths taken, far too many to go in to. Since that trip I have straightend my life out, found purpose for being here and look forward to each days sunset. With my new clarity I plan to visit sigma and have a laugh with the gods.</p>",
 "year": "2001",
 "id": "15418",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-28T07:00:00.000Z",
 "views": "11462",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1660 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(powder / crystals)"
  }
 }
}
