{
 "id": 15429,
 "title": "First Bong O' Dope",
 "date": {
  "submission": "2007-07-06T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Blayze",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Now when I first ever smoked marijuana I did not get all that high. I had nearly 10 pipes with no effect! I smoked out of nothing but pipes for the first 3-4 months of my 'stoner' period. So I used marijuana nearly daily for 3-4 months then suddenly stopped smoking it for 8 months. This one particular day my friend urged me to come smoke some dope, because I hadn't had the buzz in a long while I agreed. I really was anticipating getting stoned, the whole walk back to his place I couldn't stop thinking about it.",
  "We got there (this is the same place I had been getting stoned previously) and I sat down on his couch. My friend went into his bedroom, 5 minutes later he comes back with a big grin on his face and about half an ounce of weed. We sit down (Im shaking by this point, I really want to get stoned!) and I grab a little bit for myself, enough for 2-3 hits, and place it in a bowl and proceed to letting my friend cut it up.",
  "My friend went and got his bong, it was a 600mL glass juice bottle, but made a nice bong. He gave it to me along with a lighter, and taught me how to smoke it. I packed the bowel full, and sucked it all into my lungs. I got a nice lung-full of smoke, a lot more than I could ever handle from a pipe. As I exhaled I coughed a lot, it messed me up. Trying not to let my friend know I was already stoned, I packed another bowl full, bigger than the last one. I sucked it down like the last one, this one messed me up. I coughed and coughed. I had a sip of someones water, just a glass that was left on the table. It felt like it had put a fire out in my throat! I closed my eyes and all I could see was dope leaves with rectangles around them, hundreds of them. They were like bright metallic green.",
  "I felt that was enough for me. We got up and moved into his kitchen. We sat down on either side of this circular table. I remember sitting down, I was looking straight ahead of me, slightly towards the ceiling. All of a sudden I had this feeling of complete blankness, it felt like being on heroin, like noddin off. I forgot everything, I didnt know where I was, who I was, who my friend was. I thought that I was in another world, and I was trying to get back to my home world. I kept telling myself things like, Okay, this is home, remember this. Then I would forget and think Im in another world again.",
  "Apparently I was tripping like that for about 30 minutes, it felt like 5, 10 minutes max. My time perception was totally messed up. I looked over at my friend, he was eating some donuts and taking no particular notice of me, so I just tried to make sense of the situation. I couldnt think. My thoughts are just one big dopey haze. It felt like I was just floating, like looking at my self from a different body. Until my friend got my attention and suggested we go get some fresh air.",
  "I got up and looked down the hallway. It looked like it was really narrow and long. I started walking and his sister came out of her bedroom. She looked at me, with a weird expression on her face. I couldnt work out who she was. She was looking at me like something was terribly wrong. I kept walking on back into the lounge room. I know I had to go out the door, but my mind like shutdown, and I dont know why but I went and sat down. But it felt like I had walked out, my second out of body experience. I ended up getting up and following my friend outside.",
  "As I walked through the yard I just got a rush of pleasure, I felt so happy to be alive and tripping so well, all the colours were bright and vibrant. I suddenly yelled out at the top of my lungs, MAN IM TRIPPIN HARDCORE!! and I started laughing uncontrollably. My friend yelled at me, I felt as if I had killed someone, I felt really guilty, my mood changed right away. Walking down the street it seemed as though my head was detached and bouncing on my neck.",
  "We walked right down to this football pitch. We sat down on a bench and I started tripping again, same as before but this time when I closed my eyes I saw 3 big circles suspended in a black mist. They were worlds as I was calling them. Some how I start getting this feeling of looking at my friend and me though my mind, we were in one of these worlds that I was looking at. We decided to walk around the oval. I was fascinated by everything, it seemed as though it was the first time I was doing anything. My friend start joking about how trashed I was. He instructed me to pickup a pinecone, I picked it up, I started walking towards him and he ran away. I was confused, apparently I picked up a piece of dog shit, I swear I thought it was a pinecone.",
  "From there me and my friend went our separate ways, I got home ate some food and crashed out on my couch. My peak came pretty early on, about 15-20 minutes after the last hit. Lasted a good 2 and a half hours, I was pretty much down before falling asleep. One of the nicest trips Ive ever had."
 ],
 "erowid": {
  "id": "34324",
  "citation": " Blayze. \"First Bong O' Dope: experience with Cannabis (ID 34324)\". Erowid.org. Jul 6, 2007. erowid.org/exp/34324",
  "substance": "Cannabis",
  "views": "3328"
 }
}
