{
 "id": 15421,
 "title": "My Experience with Addiction",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Merlin",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(daily)"
  }
 ],
 "report": [
  "[Erowid Note: 1 gram of tramadol is considered an extremely high dose, see Tramadol Dosage]",
  "I'm 23 years old and have been taking Tramadol every day for nearly 5 months.  I prefer real opiates but it's hard to find a consistent source not to mention they're far too expensive.  When I first began taking tramadol I did it to compensate for lack of opiates.  The first few times I took 100mg and didn't notice a great deal. ",
  "I continued to take 100mg a day for a week and noticed little except that it kept me from craving opiates.  I wait a week and try taking 150mg now that my tolerance for anything is mostly gone.  I was some what surprised.  The Tramadol gave me a warm fuzzy feeling similar to that of hydrocodone but not as intense.  I sat in front of my computer for three hours messing around on the internet.  I sat there chain smoking and smiling at myself.  It made me feel mighty happy.  From that day I haven't gone but a day or two here and there without taking the shit.  I'm terribly addicted but not too upset about it for it is easy and cheap for me to obtain it. ",
  "I must mention that there are some serious side effects I experienced during my first month of taking Tramadol.  I took(and still do) about 800mg-1000mg a day.  Before I gained a tolerance it, one day I took 400mg at once.  Generally before I had taken 150mg at a time. ",
  "About an hour after taking the 400mg I began to feel the happy excited feeling I always did when taking it but much more intense this time.  After two hours of happiness I began to get sleepy.  To my surprise I started to enter an opiate dream.  It was great until I was jolted by my body seizing.  I seized twice, each for about five seconds. ",
  "After that the muscles in my arms would contract causing my hands to flap around uncontrollably.  When I finally woke up I felt fine.  I remembered reading that seizure was one of the possible side effects so it didn't alarm me too much.  I promised myself I wouldn't take that much at a time again.",
  "Other side effects I experienced were constipation(severe constipation), inability to urinate, inability to reach orgasm, and occasional twitch here and there.  Be careful with this stuff"
 ],
 "erowid": {
  "id": "34301",
  "citation": " Merlin. \"My Experience with Addiction: experience with Tramadol (ID 34301)\". Erowid.org. Jun 25, 2007. erowid.org/exp/34301",
  "substance": "Tramadol",
  "views": "7325"
 }
}
