{
 "id": 15425,
 "title": "Glow-In-The-Dark Mini Putt",
 "date": {
  "submission": "2007-07-24T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Floyd",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I had my first trip on mushrooms, and it was the greatest thing Ive ever experienced, so after the fact, I decided to write a short story on it.",
  "It was after dinner on March 13th, if I recall. Lance and I had been skateboarding for 10 minutes from my Dads house to finally arrive at my Mom's house. We strolled up the stairs and sat down in my room. I reached into my stash and got out the bag. We each ate 2 Vitamin C tablets before we put the shrooms in our mouths. We chewed the first handful for about 5 minutes. As we swallowed them we took down some Vitamin C supplement drink. The second handful seemed to taste much better than the first. Slowly we chewed them until they became a paste.",
  "We sat down for about 2 minutes and decided to eat one more Vitamin C tablet each. We put on some music and waited. We began to chuckle a bit, before we left my house. I stepped outside and stumbled down my steps. Everything outside seemed to have vibrant colours. The streetlights were red, not the pale yellow they usually are. We walked down the street towards the convenience store. I began to feel the effects slightly when I laughed and looked around. We walked into the store and looked around. Lance ended up buying some ridiculous sunglasses. They were aviators with a transparent yellow shade. He paid for them and we walked out.",
  "We took a look at each others eyes and realized our pupils were extremely big. Lance said to me Im going to put on these sunglasses right when I know Im fucked up. We began to walk down a dirt path when we decide to smoke a tiny bit of a joint to kick-start our experience. As I was toking, I gazed upward at the stars. They were the brightest Ive ever seen them, even in the country they werent this bright. We put away the joint and walked the rest of the dirt path. I stopped in my footsteps and started in awe at a nearby pine tree. I saw a skeleton in the tree and I started to yell. Lance stopped me and we continued walking.",
  "The red streetlights were even brighter than they were before. Lance pulls out his sunglasses and his white fishing hat made out of a towels material. He looked at me and at that moment, I knew we were fucked. We began walking towards our destination, Glow-In-The-Dark Mini Putt. We walked down a street that seemed never-ending. I began to question things out loud and soon found myself extremely happy. I began to smile so hard that I was drooling. I laughed like a child playing with toys, when all I was doing was walking down a road. I saw an awkward looking fence and questioned why it looked the way it did. Lance pulled me away and said We need to get to Mini Putt! I went along and we continued down the same road. As we approached the end of the road I saw some bushes and remarked how I thought they looked comfy. I was talking about jumping into them when Lance again insisted we keep going.",
  "We came to the end of the road and we thought of where to turn. I said that it might be quicker if we go back the other way and take a different turn. As we walked across to the other side of the street we stopped in the middle of it. Lance began to sort of freak out. I ran near a house and walked on the tiny hill beside it when I closed my eyes. I saw amazing colours and patterns moving around. Green and orange triangles and other odd things, like in cartoons.",
  "Until I saw a pair of eyes staring back at me. I quickly opened my eyes to get away from the others. I closed them again to see if they were still there and of course they were. So from then on I was afraid to close them. We walked back on the same street we had been walking on for a while. When we came to the first road we turned left and I saw shadows on the ground. The shadows seemed to be 3-Dimensional and popped out at me. Lance collapsed on the ground as he walked over the shadows. He began screaming It fells like hands are holding me up!",
  "I ran to the other side of the street and saw a school. I walked over to the parking lot and I sat on the pavement. Lance got up from the minor freak-out and came to see what I was doing. I saw wonderful patterns all over the ground. I stared at them for a couple of seconds and abruptly got up. I saw a tree that seemed to tilt at almost a 90 degree angle. I began to run and yell to Lance that it felt amazing to run. So we ran to the other exit of the schools parking lot, and as we got to the end we stopped and walked as if nothing ever happened.",
  "We came to a crossroad and I said that we should go left. Lance said that we should go straight. He pointed out what the streets looked like. The Left way was dark and scary, and the other way was bright and colourful and seemed fun. We walked straight and ended up being on a busy street. We walked uphill almost reaching the halfway point to Golf. We tried talking to each other but it was no use, we could barley speak properly.",
  "As we passed an old lady who was walking her dog, it barked at us fiercely as if we were cats. We walked for a little longer when I saw something shiny in the bushes. I stopped Lance because I felt that whatever it saw, was calling me to it and that I needed to see what it was. I concentrated and saw a pop can with a figure on it that resembled Jesus face. I reached out for the can but Lance again pulled me away and said something along the lines of getting to Mini Putt.",
  "Right after, we both decided to close our eyes and try to walk around. We wandered and yelled for about 5 minutes, and when I opened my eyes I was on someones lawn and Lance was way ahead of me. We walked up the street and as we came to a busy intersection I found a hubcap on the ground. I picked it up and kept on walking. By this time I felt extremely out of it. Colours were flying past me like lightning, I could barley make sense with words, and my mind began to shut down.",
  "We crossed the intersection and I grabbed the hubcap with both of my hands. I turned and said to Lance, Its the crazy bus and I began using it as a steering wheel. I was yelling and acting like a complete idiot when a patch of grass caught my attention. I closely examined it and it looked like salamanders to me. But yet again Lance felt the urge to get to Mini Putt quickly.",
  "We walked across a bridge almost nearing our destination. The stoplights at the end of the bridge looked like bright stars to me, and I watched them intensely as Lance was trying to explain something. We stumbled down a hill, hopped over a guardrail on the side of the road, and were about to jump a small stream when Lance told me to leave the hubcap behind. I hadnt realized that Ive been carrying it for the whole time. So I stood it up against a guardrail post and jumped the stream.",
  "We now were walking among people as we entered the complex where the Mini Putt was located. I felt so screwed up and I needed to get inside. The year-long walk (or so it felt like) had come to an end when I saw the shining sign of the Putting place. I put on my mirror sunglasses as we waltzed in. A hundred different things went through my mind. I was trying to process all the colours, patterns and where I was through my brain, when Lance grabbed me by the shoulder and pulled me toward a payphone near a corner.",
  "I totally forgot that we were supposed to meet up with a whole bunch of our friends. I leaned up against the corner and began to trip out. I saw the corner stretching and begin to curve like a ball. Lance tried calling our friends house when his mother picked up the phone. I heard him try to speak to our friends mom. It was like listening to a retard use a phone. He hung up and we walked over to the counter where we had to pay. We couldnt get a hold of our friends so we decided to go putting anyways.",
  "I knew in my mind that I couldnt count money if my life depending on it. We reached the counter and two 18 year old girls ask us what we wanted. I said Mini Putt for two, please! One of them said Together, or separate? and I got confused. I said Yea then quickly responded No! The girl looked at me as if I was on drugs, little did she know. She again asked me Together, or separate? I responded Separate! and I handed over a 20 dollar bill. She rung up the cash and handed me over my change. I shoved it all into my pocket because I knew that I couldnt count it. I ran to the bathroom before Lance even paid.",
  "I flew the door open and crashed into the sink. I took off my sunglasses and looked at myself in the mirror. I started having a conversation with myself through the mirror when Lance flies in. He yells Where the hell were you, I was looking for like 5 minutes! Apparently I had been talking to myself for quite sometime. I was about to go into a stall and take a shit when Lance stopped me and convinced me that if I went to the bathroom my trip would end. As we walked out of the bathroom I noticed that each wall in the bathroom was a different colour, and that put a smile on my face.",
  "We walked around the Mini Putt place waiting for our names to be called so that we could finally golf. I wanted to sit down so I searched and found an empty room. In the room there was a table all broken up into pieces, almost like puzzle pieces. There were tons of chairs and crazy drawings all over the ground and walls. We decided to call it the Party-Room. Lance and I tried to talk to each other but I kept on dazing off. He wanted me to come with him to the arcade so he could play a game, but I refused to get up.",
  "I heard our names being called and I jumped up and ran to the front counter. I tried talking to the girls and asking them if it was our turn, but they said no. My speech also mustve confused the hell out of them. I walked solemnly back to the Party-Room and sat down again. I realized that Lance had been yelling at me for 2 minutes to go play a game with him. So I stood up, tripped out for a couple of seconds, then we walked to the arcade. Lance found a fighting game that he wanted to play. There were about 5 other people in the tiny arcade, besides us. Lance puts in his money and begins to play.",
  "I became confused and I started to mumbled aloud and pull out quarters from my pockets. I tried putting them into the game, I didnt know why I was doing this, and I didnt know how to either. So I stood there pretending to play the game so I wouldnt look like a complete asshole to the other people in the arcade. I watched the screen as Lance was playing and I asked him what character he was. He replied The big one! I watched his character when all of a sudden it morphed into this other thing, then again, and again! I couldnt watch the game in the state I was in, it was too intense. Lance soon gave up because he didnt even know what he was doing, or why he was in the arcade.",
  "We were about to go back to the room when our names finally got called. As we were walking up to the desk, I saw the 2 girls dancing around arm in arm like leprechauns. I blinked and looked again and they were normal. We grabbed our clubs, picked out our golf balls, and we entered what we had been waiting for the whole night, Glow-In-The-Dark Mini Putt!",
  "As soon as we walk into the putting area, all the florescent colours jumped out at me. I took off my sunglasses and tried to out them into my breast pocket. I dropped them and I couldnt find them. Lance then came over to me and started pushing me and saying Lets play! He pushed me to a wall and I tripped over something. There were my sunglasses. I put them into my pocket and we began to play. My mind could not comprehend anything. I didnt know the difference between left or right, up or down, real or fake, normal or insane. Confusion was he only thing with me inside that building. Lance hit his ball and almost got it in. I dropped my orange ball and whacked it not caring what I looked like or what I was doing. I got my ball in the hole, but it took me about 5 or 6 tries before I did.",
  "At the second hole I just threw my ball down and hit it as hard as I could. The ball flew off and I did not know where it went. Lance started to putt and I sat down and tried to think. My mind was going haywire, I couldnt think even if I tried to think. Lance got his ball in the hole again and we went onto the next one. I found my ball lying in the middle of the ground and it looked like a bright orange orb. I picked it up and began talking to it. Other people who were also golfing looked at us. We must have looked like mentally handicapped kids trying to have fun.",
  "We played tons of holes and none of them I could do properly. I forgot what how I swung so I hit left or right, both ways I couldnt hit it properly anyways. We were on one hole where some kids were playing and laughing and having a good time. And they asked us if wed like to pass them because it looked like we were having fun, or so they said. As we passed them I saw a treasure box and started to say weird stuff. They all looked at me and we continued to the next hole. The inside of the putting place was like the inside of my brain; a mess, confusing, and colourful. When we were playing golf, time had no meaning. Neither of us had watches and we hadnt seen a clock for hours.",
  "All the people inside the place seemed like they were all on shrooms from afar, but as I walked closer to ask them if they were, they began to seem normal. Lance and I had been fucking around for a long time when we realized that we couldnt find hole #14. We spent 5 minutes trying to look for it when we realized that it was right beside us. The rest of the time spent in there was a complete blur to me. I remember a tornado that took my ball, and a strange weasel driving an airplane on the wall. But as I walked outside and reality rushed back into my eyes, I began to come to my senses.",
  "When we got out of the building, I saw a child and I scared it by making strange noises and faces at it. Lance started to run for some reason to I ran after him. We sat down near a lamp post and tried to tell each other what we both experienced, we could barley speak straight. I picked up a tiny rock and I put it into my pocket to keep a note that what I experienced actually happened, and wasnt a figment of my imagination. We needed someone to tell us if we were alright or still fucked, because we couldnt tell ourselves. So we called up one of our random friends. Lance couldnt speak properly on the phone, so he hung up. I guess that pretty much explained if we were still fucked.",
  "We walked back the way we came and picked up the hubcap. Back across the bridge that seemed much shorter now, and into a Tim Hortons. Lance made me leave the hubcap in a nearby bush before we went in. When we got in, we both bought food and saw some really weird older guys. They werent speaking English, and they seemed like they were high off their asses. We ate our food and left Tim Hortons. As we were going through a field, a rabbit ran out in front of us and scared the life out of Lance and me. We got to the road and I saw a fence and couldnt resist to piss, so I did and ended my trip for good.",
  "We walked back to my Dads house as Lance started to come down. He claimed that he still was a bit messed up, and was thinking of sleeping in the forest because of his state. I talked him out of it as we got to my house. We walked inside and I talked to my Dad quickly. He seemed to wonder if I was myself, but I quickly ran downstairs with Lance. We played Nintendo 64 and talked about our night.",
  "Lance was still tripping out a bit and told me that my face was morphing. He said that I looked like the Sloth from The Goonies. We sat in the basement and couldnt think of anything to do. So we came up with a plan to sneak out and get the hubcap back because we forgot it in the bushes. We both quietly strolled up the stairs and put our shoes near the back door. I slid the glass door as slow as I could. We got outside and ran for Tim Hortons.",
  "We smoked another joint while walking in the middle of the road on our way. When we arrived there we decided to get some food before we got the hubcap. So we bought dozens of cookies and asked the lady to put them in the microwave for us because they were hard and cold. We finished most of them and got the hubcap. We walked back home and talked about what we just did. We got home and snuck in slowly, crept to the basement, and thanked God that we didnt wake anyone up. We finished our game of Nintendo and fell asleep."
 ],
 "erowid": {
  "id": "34314",
  "citation": " Floyd. \"Glow-In-The-Dark Mini Putt: experience with Mushrooms & Cannabis (ID 34314)\". Erowid.org. Jul 24, 2007. erowid.org/exp/34314",
  "substance": "Mushrooms & Cannabis",
  "views": "3613"
 }
}
