{
 "id": 15431,
 "title": "For an Instant I Thought He Might Be Real",
 "date": {
  "submission": "2004-12-16T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Gemini Windcrow",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "smoked",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea"
  },
  {
   "time": " T+ 0:30",
   "amount": "2.0 g",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "<p>I had recently been given as a gift from a friend a joint worth of blue lotus. My friend had never smoked it before, and was interested in my perspective on its effects. I've been involved with some very traditional shamanism, so my view on psychoactive plants is one of extreme reverance and caution.",
  "I took the joint home, broke it up and smoked it from a wooden pipe that I use to smoke any other herbs. I smoked one bowl, roughly two grams, with a small variance from the weight of individual herbs. After this I waited. There was ver little sensory input, as I was in a dark, quiet room.",
  "Within about ten minutes I could tell there was a difference, but mostly on a very subtle, edge of perception type level. I focused on that particular feeling, and within another ten to fifteen minutes, I felt a very relaxed, but energized feeling come over me. It's like being able to move extremely fluidly. I stood up and moved around the room a little, and found that I had a hard time just sitting still at first. The initial buzz wore off in about twenty minutes and left me extremely mellow, but also extremely lucid.",
  "After about ten more minutes of meditation, I packed a bowl of cannabis into a bong and smoked the entirety of the bowl in about four hits (small bowl).",
  "As soon as the high of the cannabis hit me, the experience changed drastically. In my experience, weed has always given me a light, disassociated feeling. I use it for really deep, inward meditations. However, mixed with the blue lotus I was not nearly as debilitated. I believe that the lotus allows me to be more lucid in that state, and able to focus extremely well.",
  "I found myself laying down, and staring at a small dark spot on the ceiling above me. Probably a shadow from the street light outside. As I stared at it, I was able to allow it to take up my entire visual perception, and felt my center of awareness move from my head down to my solar plexus, where I felt physically drawn up and out of myself, and into the spot. Perhaps seconds after this, based on the timing of the following event, I found myself standing above and behind my partner, who was at the time in new york. I saw him standing against a black background, and was thoroughly transfixed by his image. He was wearing a polo shirt with a blue top half and a white bottom half, a pair of slightly faded blue jean shorts, wearing his glasses, as opposed to his contacts - I could see the stems coming out slightly behind his ears. He looked at something for a moment and for an instant I thought he might be real. So, I reached out to touch the back of his head, and at the moment I did so, he reached into his pocket, pulled out his cell phone, and pressed two buttons. He put the phone up to his ear, and then I came back to normal consciousness when the phone rang.",
  "The clock read 12:25 am, and I had smoked the cannabis sometime around midnight proper. I answered the phone after much searching, and answered it. I knew for certain it was my partner, so I answered the phone 'hey, baby'.",
  "After that I described to him what I had seen him wearing and he confirmed exactly that, including the pocket he had pulled the cell phone from. He explained that he had suddenly missed me a great deal and had decided to call me to see if I was still awake.",
  "Now, my partner and I have had previous experiences with pyschic phenomena, and are both students of metaphysics and shamanistic spirituality, so this likely played a large part in this experience. Also, having smoked both herbs with the intention of having a spiritual experience naturally gears the psyche towards causing those kinds of experiences.",
  "I fell asleep after doing some work internally - including releasing some of the particular energetic tension that this particular combination tends to produce, i.e., I went to sleep with a sore right arm. While I can't speak for the average person, I can say that my ability to direct and localize energy inside my body was phenomenally acute and intense.",
  "All in all, with no side effects and a truly reality altering.... experience... I would highly suggest this combination to anyone seeking enlightenment through traditional sacred herbs. I'm confident even a layman could find themselves experiencing things they never thought existed should they give it a try.</p>"
 ],
 "erowid": {
  "id": "34328",
  "citation": " Gemini Windcrow. \"For an Instant I Thought He Might Be Real: experience with Blue Lotus & Cannabis (ID 34328)\". Erowid.org. Dec 16, 2004. erowid.org/exp/34328",
  "substance": "Blue Lotus & Cannabis",
  "views": "20182"
 }
}
