{
 "id": 1543,
 "title": "Archetypal initiation",
 "date": {
  "submission": "2002-05-22T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "rawbear",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "DMT"
  },
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.0",
    "quantity": "3.0"
   },
   "administration": "oral",
   "substance": "Syrian Rue"
  }
 ],
 "report": [
  "I could never hope to capture the essence of the psychedelic experience in words but hopefully this record will consolidate some memories and possibly help someone else out.",
  "This trip started the previous day really: smoking a huge amount of pot over the course of it at a friend's house with an additional threshold dose of LSD about mid-day. This resulted in a state of mind quite clear and unproblematic. It was also fun to hike into some pathless old forest near the river, where I found an omen (an owl feather), and later out in the open under a sunny big sky.",
  "The next day seemed ideal to try a major experiment, because of the omen, with ayahuasca of a sort: Syrian Rue in combination with DMT, the only way to make it orally ingestible. From D.M. Turner's 'The Essential Psychedelic Guide' I got the idea that doing it near the sea would be a good idea, since DMT is supposed to be 'water spirit,' (I even took a morning trip out to the beach to check out a site) but I'm glad I didn't because I did some projectile vomiting at one point. This is often a feature of the ayahuasca experience but may have been due to a food allergy invoked by the harmala/harmaline in the Rue in spite of fasting all day. But even this was part of a marvellous experience of insight, however difficult physically.",
  "The first thing I recall was a fear that I did something wrong (like ingesting the DMT an hour too early by mistake) and that the trip would misfire. But then I started feeling the awesome power of the tryptamine coming on. I had put on a recording of surf crashing on the beach to replace the missing beach site but found it kind of disturbing and put on Tulku's 'Transcendence' instead and hit the Repeat button. I don't know how many times I listened to it but it was different every time. I got chills and crawled under a blanket. Back to the story...",
  "The first visions were unpleasant, either boring or disgusting. Boring because I often find myself (under tryptamines) in a very infantile environment. Apparently, the spirit of the mushroom particularly considers me to be a baby. In this case, it seemed to be a place in the mind where impressions of discarded toys are stored. Once I decided to get out of this junkyard, I found myself in a garbage bin full of rotting, disgusting filth. As bad as this sounds, I found it humorous because I could see that it was a community of living beings. Each of them had their eyes, or eye, open and looking at me in a 'smiling,' friendly way; they wanted to be friends and were inviting me to join them! I certainly was made to feel welcome but decided I had other things to do. However, I did appreciate being reminded that everything is alive and aware, even garbage! In the past, with psilocybin, I'd had success using my voice and/or a rattle to create a vibration that I could audio-drive the experience with. This time, this didn't work too well because my will seemed impaired. However, I did gradually rise to a higher level. I also tried to focus on the heart chakra in order to prevent the third eye from running rampant with visionary excess.",
  "There seemed to be an accelerating growth process at work. I found myself going from infancy to small child to adolescent. All this was from someone else's perspective, e.g., the higher Self or God the Father, not someone who showed themselves visibly. But his presence was powerfully felt. The fact that I'm only a spiritual neophyte isn't too difficult to accept. By the end of the trip I felt like a young man, a prince, on that scale.",
  "This progression in maturity does not refer in any way to my personal ego, except indirectly perhaps. The spiritual self was shown to me to be a son of God. In that regard, I travelled the same path and reached the same levels that Jesus or the Buddha did at the same stages. I realized my status as a prince in the kingdom of God and understand that I must behave accordingly. Though my responsibilities at the moment are minimal due to my spiritual youth, there were given to me gifts of the spirit to practise with, kind of a soul technology in terms of initializing abilities of the psychic mechanism to navigate through various realms such as the astral planes. At some points I seemed to be soaring through that aspect of nature that is implicate in terms of archetypal natural forms. For example, I found myself in the deeps of the sea travelling above a pod of creatures that resembled whales or dolphins.",
  "I remember other visions of perhaps times long past. The label I put on it now is Atlantis, if only because I can't identify the culture according to my knowledge of history. For instance, there were scenes of docks in an ancient harbour with muscular, shaven-headed sailors hauling beautiful, straw-coloured ropes.",
  "The most beautiful vision, among many, is unfortunately indescribable because the forms were unrecognizable. Perhaps it's on another planet. However, I did recognize a blue sky with clouds and some tree-like structures: a landscape. In the midst of it though was something that looked to be made of molten metals of different colours, flowing and reforming like some strange flower, very symmetrical.",
  "The beauty and peace were such a prize that even the physical nausea was acceptable. But at a certain point my body could stand no more. Either that or I was about to pass through a barrier protected by a demon. I was sitting just a few feet away from the bathroom but still didn't quite make it. I didn't know a person could vomit so much! However, it wasn?t unpleasant. In fact, it seemed quite natural. I just closed the bathroom door afterward, not being in any condition to clean up. Back in my armchair, the peace and beauty took on a new intensity, possibly because the nausea wasn't nearly so distracting.",
  "I am profoundly grateful for the reassurance that I am part of a divine order and have a role to play in it. My understanding now is that each person is a child of God and that we each are co-creators with the divine intelligence. My freedom of thought was unimpaired and, indeed, I could direct it to whichever subject I desired. I decided to review my relationships with certain people since that's where all my personal problems seem to lie.",
  "I could see clearly that we are all very immature beings and that we all make mistakes in our blindness and ignorance. Regrettable as the situation is, compassion is the only attitude to take.",
  "I also feel that all is well in the kingdom despite my usual misgivings. Everything that occurs in each person's life is no accident. However, at some point, it is feasible to grow up spiritually so there are fewer misjudgements and consequent suffering. Only then are we responsible for our creativity, though it's obvious to me now that the world we live in is a result of the creative output of each living being of every species. This is the meaning of the 'royalty' motif on this trip. The role I must play as a prince implies power, authority, and dominion but it's not quite ready for application. I still need much training and much practise. I can only assume this is true of most people I know, even if they haven't yet made to the gates of palace or even the border crossings.",
  "By the time the trip was over (about 7 hours), I felt as if I'd been given everything I need to know to make sense of my whole life up to this point. I can see now that it's only a beginning.",
  "The next day was spent recovering because I had a splitting headache. However, due to the overwhelming benefit of the experience of contact with hyperspatial realities, especially the archetype of the King, even this wasn't too unbearable. The pain could have been induced by the Syrian Rue because of not fasting long enough. It could also be result of going too far too fast, expanding and then contracting back to baseline.",
  "One further note: the two nights since the trip have included many dreams with a common theme: in the dream I am someone else with a different name, a different body, a whole life that is not mine. These kinds of dreams have happened occasionally before but never with such abundance. It could be that a latent psychic power, telepathy perhaps, has been stimulated."
 ],
 "erowid": {
  "id": "14823",
  "citation": " rawbear. \"Archetypal initiation: experience with DMT & Syrian Rue (ID 14823)\". Erowid.org. May 22, 2002. erowid.org/exp/14823",
  "substance": "DMT & Syrian Rue",
  "views": "11477"
 }
}
