{
 "id": 15436,
 "title": "Seeing Clear",
 "date": {
  "submission": "2007-12-13T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zman",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I have been smoking pot for a while and have become very comfortable with doing so and have even had some mild trips from smoking highly potent bud. But other than that I had no experience with any type of psycadelic. My friend who is very into natural mind altering drugs and such, purchased a plentiful amount of extremely good mushroom caps. We planned it out so that me and my friend would go over to his grandparents house with another mutual friend and his girlfriend.",
  "We both ate our mushrooms (me, 2 grams and likewise with my friend) feeling very ready and comfortable. By the way, my friend had tripped about 2 other times during the summer. As we played pictionary while waiting for the effects to come on I felt an unbelievable surge of giddiness. Both my friend and I could not stop laughing at the couple we were with (they were not tripping). I felt very comfortable with what was happening. Slowly this would change. As things truely started to become distorted we all decided to go outside.",
  "Before even being able to get out of the house I felt a surge of sadness. It was the most pure and untouched genuine sadness I had ever felt. My other friend's girlfriend (who was not tripping) gave me a hug and I can not begin to explain how comforting that felt. At this point my emotion were feeling extremely vulnerable. I am very glad that we were in a most chill place without many people. As I said my emotions were very unstable, earlier I commented that the skyline looked very panoramic, upon saying so the mutual friend's girlfriend seemed to disagree with me and I almost cried.",
  "As we went outside I was tripping balls. I was tripping and I was tripping hard. My friend who was tripping realized this and quickly pulled out a hash rolled joint. We seperated from the couple and sat on the deck and smoked the joint. It felt so good to smoke, my friend just listened to me and let me try to just explain what I was feeling as we toked on the joint together. He played much of the role of a shaman. I felt and thought things that I couldn't even explain in words. I truely saw myself as myself and understood my life and my relationships with others.",
  "We continued to talk for what felt like hours. After so we got up and both felt the most amazing sensation. We both agreed that we felt one with the earth and extremely powerful. Most amazing were the trees. The trees had an ora and power to them that was truely amazing. My friend all of a sudden started dancing wildly and this was so funnnnny. I have never laughed soo hard. I was rolling around laughing. My lungs hurt I was laughing so hard. Later we decided to investigate the pool. All I can say is that the pool was the trippiest shit ever. It looked like a vortex and we could feel ourselves being sucked into it when we put our hands in. We later smoked another fat spliff and just chilled out with the couple."
 ],
 "erowid": {
  "id": "34340",
  "citation": " Zman. \"Seeing Clear: experience with Mushrooms & Cannabis (ID 34340)\". Erowid.org. Dec 13, 2007. erowid.org/exp/34340",
  "substance": "Mushrooms & Cannabis",
  "views": "2742"
 }
}
