{
 "title": "A Trip to the Zoo",
 "author": "Tren",
 "citation": " Tren. \"A Trip to the Zoo: experience with LSD (ID 15436)\". Erowid.org. Apr 26, 2005. erowid.org/exp/15436",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  " ",
  "",
  "LSD",
  "",
  "",
  " ",
  "",
  "LSD",
  "(blotter / tab)"
 ],
 "report": "<p>The event was inspired by a previous tripping experience we had. Here is a brief background that led up to the day.</p><p>This was the second time I'd had lsd, the first time was a couple of months before and I loved it. 5 out of 8 of my friends had gone completely crazy the first time, their minds got stuck in personal hells and vowed never to do it again. The first time, one of my friends who flipped out couldn't say anything except 'key to the zoo' and was obsessed, ringing random numbers on his phone asking people about the key. He was acting kind of like a monkey and trying to trade various objects of no value (like his socks) with anyone. At some point in the night, we decided that perhaps it would be cool to trip at the zoo, so 2 months later that's what we did.</p><p>I was looking forward to this day for weeks due to the fact that the first trip I had was such an uplifting and positive experience. I'd heard that setting was important, and a relaxing environment was necessary but the first time we had gone to see the fireworks in vast crowds and I didn't mind. About 10 of us went to the zoo but only 4 had the blotter (myself, C and 2 friends of C I'd never met that hadn't had it before, lets call them S and R). It is good to have a couple of co-pilots around if things turn sour. I'd eaten only a small meal for breakfast and drove round to a friends to meet up with the other people.</p><p>10am -</p><p>Pile up in 2 cars, 5 people in each. 4 of us in 1 car drop our tab on the way to zoo, the other car detours and takes another 30 minutes or so to get to the zoo.</p><p>10.50am-</p><p>The other guys finally get to the zoo, we'd just been sitting at a bench waiting for it to kick in. In the mean time I'd been to a shop and almost forgot to pay for my oj, or had thought it unnecessary. By the time the other guys got here, me and C had started seeing the woodwork move in the normal breathing-like fashion. The other 2 guys were unconvinced that it would affect them.</p><p>11am-12pm</p><p>We visited various exhibits, first a bird sanctuary, all of us that were tripping were in mouth-gaping awe at the beauty of it all, the tranquility and pleasantness of the experience. This experience was often interrupted by a non-tripper making small talk. This slowly got on my nerves but I ignored the person making the comment, feeling on a higher plane to them. Everyone that was tripping was feeling it now, the 2 guys I didn't know were a little freaked as they didn't really know what to expect. I already felt more at ease and closer to these 2 guys than I did with my other friends who I'd known for over 10 years. Myself and the other 3 elected to do a detour through a botanical garden which was probably my best choice of the day. A light mist coming from overhead sprinklers was so pleasant, and my friend made me put my hand through some spiderweb, it felt smooth and pliable. I guess when you're tripping solid objects feel a bit more web-like in any case: movable but still firm. I could of stayed in the garden forever.</p><p>12pm-1pm</p><p>After the garden detour, S became very freaked and said he couldn't go on, we alerted the group to this fact and said we needed a chill-out point. We sat on the grass for a few moments but I still felt on top of the world, a little freaked by S, I guess I thought it could happen to me shortly too. During the next half hour I walked with all non-trippers to several other exhibitions. Some animals I felt a strong connection with, such as the elephants. Several exhibited a coloured glow and I thought how pleasant this primeval existence would be. I trailed the group and reflected on several things regarding our behavior to animals. Somewhere around this point I decided I really have to visit africa at some stage in my life. A forced people to visit the african exhibit with me and the meer cats were wonderous. Their behavioural patterns changed so quickly and they seemed as content as I. They quickly moved from digging to play fighting, to sleeping. The ground around them and everywhere was starting to swirl quite vigorously at this point, it was getting very intense. I could feel my senses starting to merge, light, sound, touch, hearing, smell and for all of them starting to intensify. I tried to follow people through the nocturnal house but after 5 steps I became terrified and fell to the floor. I couldn't see anything at all, everywhere was black and it felt like I was stuck in a box full of mirrors. My friend had to lead me crawling out, I felt like a bit of a fool seeing other visitors coming in the entrance. Things were definitely starting to heat up.</p><p>1pm - 2.30pm</p><p>We returned to the grass and one of the girls we were with (the only one I didn't know besides S and R) possessed a mobile phone and seemed like she was constantly on it. I became paranoid, convinced she was some sort of spy, telling the authories about us. At this point in time, time distortion became so strong and time loops so common I couldn't communicate with anyone properly. I tried to tell her to get off the phone but it obviously didn't work. I could feel the universe was seperated into layers and they were a fundamental concept in our understanding of it. I exclaimed that I could see in all directions at once, and I believed i could do so. People's small characteristic actions were magnified and repeated to a point that drove me crazy. I must of seen one of my friends push the glasses back on his face about 500 times in a row. At this point I could do nothing but lie on by back and look at the sky, hoping that my body would instinctively remember how to breathe as I felt I couldn't do so. The sky dimmed and lightened several times, it felt as if many days had passed. Casino numbers rolled through the sped up clouds, and card suits followed after them. It was interesting, confusing and scary at the same time. It is easy to have opposite emotions at the same time on lsd.</p><p>3am(guess)</p><p>One of my friends came running back to us, he was shouting that another of our friends had fallen in the polar bear exhibit and was being mauled to death by the polar bear. I was in unimaginable fear, wanting to escape this place but unable to use my limbs. Shortly after this we departed, I cant remember most of the trip home, parts of it sped past so fast and some of it took forever. I was convinced god was punishing me (and I dont even believe in god in the conventional sense) for taking too much of this drug and entering too far into the 'real world'. For the next hour or so I had no control over my body, it seems that my actions were pre-determined and the future was set, I could do nothing but follow my bodies basic instincts. One of the more unusal things that happened on the way home was I heard a song - star69 being played loudly on the radio. Later I learnt that we hadn't listen to anything on the way home but I had chosen that song when we got to my friends house 40 minutes later. My senses were so muddled I wasn't sure I was going to escape this madness.</p><p>4pm</p><p>I had to deal with my friends parents, he told them I was sick. I couldn't converse with them, the images of them talking was muddled with sound from events in a different time. I tried to drink water, hoping it would calm me down, I must have drunk about 7 glasses. The strange thing was I couldn't feel myself drinking the water until later when I was lying face down on a bed. Time was going very slowly, not one minute had passed on my friends bedside clock since I went to lie down. I walked the corridors of his house, shadows were intimidating, almost hellish and then lay outside for what felt like 30 minutes, came inside, got another drink, checked the clock and it was 2 minutes later than when I last checked it. I was in hysterics, I thought I was trapped in this distorted time forever. I went to see what my friend was doing, he was watching stigmata: this did not help my experience. At some point I snapped out of my auto-pilot like state the drug had given me and suggested we go to the beach.</p><p>5.30pm-2pm</p><p>It was so cool and refreshing in the sand, and the sea breeze was amazing, the intensity level had dropped back to a level I really enjoyed. For the remainder of the evening we went to a black tie party, I chose some funky multi-coloured bow tie because it looked so cool and wore totally inappropriate clothes. I couldn't converse with people very well and enjoyed more to sit and observe everyone's reactions at the party. Shadows dancing on the walls captured my interest as did the wall-vines ability to keep in time to the music being played.</p><p>4pm (18 hours after dropping)</p><p>I arrived home and was still getting strong visuals but could feel it calming down. I was shaken by the experience and it took forever to get to sleep, my heart pounding, my head full of images when I closed my eyes. Finally I did get to sleep at around 7am.</p><p>Although it was frightening at the time and I was shaken for several weeks afterwards, I am keen to do it again in a smaller dose and a calmer environment. This blotter was so soaked you could see the stain marks on it. It lasted far longer than the first time when I'd had double. It is an excellent way to learn more about yourself and what you believe life and the bigger things are really about.</p>",
 "year": "2000",
 "id": "15436",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-04-26T07:00:00.000Z",
 "views": "4729",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "LSD"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": " ",
   "substance": ""
  }
 }
}
