{
 "id": 15433,
 "title": "A Clown on a Light Switch Cover",
 "date": {
  "submission": "2007-12-12T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dillinger",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "ground / crushed"
  },
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Well, I wasn't big into drugs, I had smoked pot 4 times and been drunk once. I had read something about nutmeg giving you a high, and my friends were going to ecstasy (I wasn't about to go there), so I drove down to the store and picked up a little bottle of ground nutmeg. Everyone thought I was stupid for downing half a bottle of nutmeg. I simply scooped 3 tablespoons into a small glass of water and chugged it as fast as I could, then chased it with a Sobe. Oh man was that some nasty stuff.",
  "Well, about two hours later, I didn't feel anything, and apparently the pills of ecstasy they had taken were nothing at all, so everyone was pretty bummed that their experiments hadn't worked. Little did I know that nutmeg doesn't kick in right away. So they decided to bust out some good ol' weed. I probably smoked about 3 bowls worth. One thing about me, I go balistic when I smoke, like nothing you have ever seen. Right about the time the weed started kicking in, I noticed that it wasn't quite the same. I wasn't sure why, I wasn't very experienced in smoking it, so I just assumed it was good weed.",
  "I started laughing uncontrollably, for minutes at a time, so much that I couldn't breathe. I was literally afraid I would suffocate, but I still couldn't stop laughing. I got up in front of everyone, about half of them I didn't really know, and put on what I thought was a hilarious comedy show. I don't know if they were laughing at or with, but no matter. The details are a little sketchy, but I remember two things about the trip extremely well. I was sitting on the couch, zoning out, when the vertical blinds in the house started to change colors, from red to blue and back again, and were changing places with each other. This went on for about 10 minutes, and I decided I needed to go outside.",
  "I sat on the steps for who knows how long, then crashed in the back seat of my car. I woke up while it was still dark, and saw in my head an extraordinarily vivid picture of a light switch cover I had when I was no more than four years old. It was a clown holding balloons, with the switch right under his face. I don't know why I saw this, I had completely forgot about something of such little importance long ago. But it captivated me, because I could see it as clear as if it were right in front of me. Right now, look at something sitting next to you. Yes, I could see this light switch cover that I had not seen in 14 years just as well as you can whatever it is you're looking at now. I just stared at it, perplexed, for at least a half hour before crashing again.",
  "I woke up in the morning, fell out of the car, and proceeded to relieve my bladder in the front yard, not realizing what I was doing. That's about the time the bad feeling started hitting. I dropped down in the lawn, and felt my chest swelling up. My heart beat faster and faster, and I thought that I was having a heart attack. It was hard to breathe and I thought that I was going to pass out, possibly never to wake up. I started dry heaving over and over, but the heaving didn't hurt like it does when you're sober. My breathing and heartbeat are what scared me.",
  "My friend drove me home, stopping once for me to relieve my bladder again on the side of a deserted road. I have never urinated so long in my life, not sure why. I went into my house, and took a shower, not sure why I did that, I just did. Then I immediately crashed on in my bed at about 9 am, and didn't wake up until 9 pm that night. I felt pretty much normal after that, except for the memories. And the image of the light switch is still in my head today. Even though I got sick, the experience was well worth it, because the trip blew my mind, I was in complete and total awe. I'm sure the weed had a lot to do with it. Besides, my memory is faint of the morning I was sick, but pretty clear of the night before."
 ],
 "erowid": {
  "id": "34330",
  "citation": " Dillinger. \"A Clown on a Light Switch Cover: experience with Nutmeg & Cannabis (ID 34330)\". Erowid.org. Dec 12, 2007. erowid.org/exp/34330",
  "substance": "Nutmeg & Cannabis",
  "views": "5905"
 }
}
