{
 "id": 15432,
 "title": "When Did I Become ET?",
 "date": {
  "submission": "2007-12-12T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Live Yarf",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "1.5"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "* * * * * * * * * * * * * * * * * *",
  "Some background information:",
  "* * * * * * * * * * * * * * * * * *",
  "This past year I have grown more than I ever thought possible, and a big part was due to the expansion of my mind. In justice to that, Ive tried several new illegal substances, including MDMA, mushrooms, crystal meth, and acid. Now I have a greater understanding of their cultures, but also many new ways to look at the world.",
  "I have many stories, most of which are probably only interesting to me and the people I've shared them with. Regardless, I wanted to put one in here and I figured my first trip with LSD would be the most beneficial; for you, for me. I do feel that most of the submissions in these vaults are very dry and I dont believe you could ever explain a drug experience to someone who hasnt used it before with just the simple words were given. Anyway, moving along",
  "Thanks to certain movies, music, and common curiosity I had always wanted to try acid. I never really took it seriously though. I thought it would give a nice high, strange and unusual visuals, and frequent use would burn me out, what I can only gather from word of mouth. I did however consider it to be the best thing I could get my hands on, the idea of altering my sight was unimaginable at the time.",
  "The stuff is hard to come by. Ive gotten my hopes up more than once and had them shattered. One time I even was tricked with fake sugar cubes. Well, the first day of the new year, 2004, a friend of mine scored a nice sheet of acid. I was so excited! A group of six gathered at my best friends house. Those tripping took at least one hit, some more than others.",
  "* * * * * * * * * * * * * * * * * *",
  "The trip:",
  "* * * * * * * * * * * * * * * * * *",
  "We sat around for a good while, watching a Strawberry Shortcake movie. Though for little children, that show sneaks in some pretty trippy effects, we were all confused on what was actually there and what we were possibly be hallucinating. I had no idea what to expect, so I probably imagined a lot of it.",
  "We moved into another room and lounged around listening to music, talking, and watching videos on the computer. The ones I remember us seeing were the Rejected video and the music video for Queens song, Bicycle. None of us were feeling it too much yet, quite some time had passed. I was wondering if that was it?",
  "Suddenly, I realized everything was really enjoyable. My friends were funny, we all were laughing a lot, and we were bonding. Although the drug modifies most of the normal world, I didnt notice the change at all for the longest time. Once we all realized something was different and the drug was working, we naturally went about whatever flowed. I started spacing out, conversation was all around me. One person couldnt stand up straight. It seemed like good times to me. Everyone was happy. A lot of confusion though.",
  "I was staring at my hand for a while, watching my perspective go back and forth. For a moment my fingers elongated. I was stunned. I broke the others conversation, Wait! (Silence). When did I become ET? I thought my hand resembled that little alien. I did lots of staring at my thumb nail, bending my thumb forward and back, noticing the amazing change of shape. To this day it still works and I cant tell if its a type of flashback I am having or just some natural kind of trick. It appears my thumb nails expands when I bend it away from me.",
  "My perspective of the world, and what it had in it was different. People looked like animals. I cant explain it, but the basic anatomy and functions we possess seemed so alien and awkward. Everyones face and the room were so distorted, kind of like when I daydream and everything looses shape. I looked in the mirror at one point, stood unaware for a bit, lost in the previous moment, until I realized that the misshapen soup of eyes was actually my face. I panicked and looked away. The moment was happy again shortly after that.",
  "I love to draw, so at one point I was squeezed and twisted between two close walls drawing on a sheet a paper, on the most creative of surfaces; my shoes especially. I drew some of the most lifelike and amazing (cartoon) images, I have it framed now. They all carry a very strange and creepy soulless feel to them. I love it! Ever since then my art has been very expressive, individual, natural, and full of life. Thank you, LSD.",
  "We started to watch some Powerpuff Girls movie. I never got to see how well that went. I got a phone call, I checked the screen and it was my dad. I'm usually not as messed up as I think I am to others. I talked to him and he told me Id have to come home that night, I had an appointment early the next day.",
  "This was great. I was peaking at the most intense trip of my life and I have to go get in a car with my dad and play straight. I was freaking out, I wasnt supposed to even be at the apartment I was tripping at. It was forbidden. My mind snapped into the most confusing state its ever been in. I was worried, terrified there was no way out and that I was going to loose at this game. I remember thinking at the time that my brain had lost all of the instincts and structure of thought that it had carried my entire life. I was constantly trying to rebuild my thinking process to a rational state of thought, but itd get jumbled and Id have to start all over again.",
  "* * * * * * * * * * * * * * * * * *",
  "The trip gone bad:",
  "* * * * * * * * * * * * * * * * * *",
  "Two of my friends, a couple, had walked me to a curb where I could get picked up. I kept asking one of them if I was acting okay enough to get in a car with my dad. They assured me that I was going to be good. I didnt believe them. Mainly because I was watching her right eye trail off her face. That thing was trying to escape I tell you!",
  "I got in the car, the majority of this day was a haze, but this part is especially hard to remember. I remember thinking I was appearing nice and normal. At one point I felt the urge to scream something about a fence we were passing, but somehow I held it in. Somehow I snapped into some sort of phase where I was still tripping balls but no one could tell.",
  "We got home and I ran out of the car before the other passengers could get out. Something that wasnt questioned for some reason. I ran up to my room, avoiding some company that was visiting my house. I ran into my room and laid on my couch. I was extremely confused. I tried calling the place I just left, but that was too confusing for my end of the line and theirs. I was lost, forgotten. I sat there for what seemed like forever, and I really mean that, and nothing seemed possible to do. I thought, I might as well ride this trip out, but even that was hard. Id lose track of what I was doing and get worried. I turned on the TV. None of the channels had a happy feel. Everything was giving off the wrong vibes. I saw a clip from Pee-Wees Playhouse and that was madness.",
  "Then the worst thing happened. I was on a channel featuring a clip from the remake of the horror movie, The Fly. The scene of a decaying man was so terrifying. I somehow kept it together and changed the channel. Stand up comedy, how could I go wrong with that? Then something, I cant explain too well, went on. I think the show was on mute because I remember no sound. I think it wouldve been too scary. Well, something about the mans mouth seemed terrifying. I could hear the mumbling twisted sounds he was making in my head. I had to turn the TV off.",
  "Much to my disadvantage, I left my CD case at my friends. I had no music. Nothing to calm me. I went into my bathroom and laid in my tub staring at a wall until it all toned down. Eventually, I brought my courage up enough to go to the computer downstairs. I needed to talk to someone. Luckily a friend, who had tried acid before, was on messenger to help me through my trip gone sour. I was very grateful for it. I could barely read the screen though.",
  "The next thing about that night I remember is getting to sleep surprisingly easy. I woke up the next morning and looked in the mirror. I was still tripping out a little bit! I was aggravated, but still amused. Every time I looked in the mirror for the following month, I could feel something not right. In fact, my eyesight can get sort of distorted and off-skew from time to time ever since then.",
  "I had to go to that appointment, which was so frightening. A dentist-lady all up in my face with sharp utensils scraping at my mouth while her face went this way and that. I was much more in control of myself though.",
  "I felt an acid-like vibe every time I smoked marijuana for a while after that day. It took a while for my eyes to go back to (almost) normal again, but I didnt care. Even though I can still visualize things differently, I welcome it and consider it a part of who I am."
 ],
 "erowid": {
  "id": "34329",
  "citation": " Live Yarf. \"When Did I Become ET?: experience with LSD (ID 34329)\". Erowid.org. Dec 12, 2007. erowid.org/exp/34329",
  "substance": "LSD",
  "views": "4690"
 }
}
