{
 "id": 15438,
 "title": "Stoned Without the Mental Confusion",
 "date": {
  "submission": "2004-09-23T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Experi-MENTAL",
  "gender": "Male",
  "weight": "60 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Amitriptyline",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:35",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Amitriptyline",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:35",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  {
   "time": "7:00",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I came across a large amount of Amitrityline so I decide to do some research to see what it does and how it could affect me.  From the little internet info I was able to get my hands on I managed to find out that it is a Anti-depressive, but is also used for sleeping disorders and as a pain killer.  After finding this info and reading the two other trip reports I was expecting a buzz much like Tramadol.  Sweet free opiate buzz, I'm in.  Research indicated that smaller doseage ie. 25-75 mg was used more for pain killer and sleep disorder while the higher doseages ie. 100-275 mg was for the anti-deppresant effects.  After trying this drug I don't know how the hell anyone could take 275mg but oh well.",
  "I thought a good starting dose for me would be around 50mg.  As with most drugs the situation in which you take it can make or break your buzz/trip.  So I took this at home, alone, with some chilled out music on in the background and prepared for a day of, what I thought would be mainly, Tv buzzing. Note: I had just eaten before taking the initial dose of 50mg's.",
  "T +0:00 (10:30am) Consumed 50mg Amitriptyline",
  "T +0:35min (11:05am) Not really feeling to much, am wondering when this is gonna kick in, and how the hell people got so messed up from smaller dosages.  Was expecting to feel it now, and judging from the research I decided another 25mg's wasn't going to kill me. TOP UP: 25mg",
  "T +1:15 (11:45am) Am starting to feel the effects in a minor way now, seems the kick in is really slow.  Am feeling brain tingles in my frontal lobe and am quite light headed.  My body is slowing down a bit and I am feeling lethargic.",
  "T +1:35 (12:05pm) I got back from walking to the store.  Paranoia towards others.  Having a coffee due to tiredness, I don't want to miss this buzz because I fell asleep at the start of the onset.  Brain tingles are still present, no pupil dilation, more and more lethargic.  Am wondering if the top up was really needed.",
  "T +1:45 (12:15pm) My breathing is slowing right down and while chilling out on couch I can feel my breathing pulsating through my body.  My eyes are becoming really hard to focus and tele is becoming blurred.  I am experiencing disassociation from my legs.",
  "T +2:15 (12:45pm) Am buzzing out hard while watching the tele.  My whole body is tingling and am getting pulsations through my body.  It feels like being really body stoned from hash but without the mental confusion ontop of that.  Am really unmotivated and am becoming really tired.",
  "T +3:30 (2:00pm) Still feeling much the same as before, this is quite a downer buzz and it is close to being on synthetic opiates.",
  "T +6:30 (5:00pm) Wow, time has flown by while I have been on the couch.  I feel like I must lie down for a bit but am going to will myself not to sleep.",
  "T +7:00 (5:30pm) Got up from laying down for half an hour tripping out.  I was lying down reading a book on the bed, listening to the sounds of the house.  While I was lying down I shut my eyes but didn't go to sleep.  With my eyes closed I was tripping out and it was as if I hadn't shut my eyes.  The whole room around me was clear and I was still reading my book, with my eyes shut.  I do know I was not asleep during this time because I was still able to hear the sounds of the house.  I got up and had a coffee because I didn't want to coma out early.",
  "T +9:00 (7:30pm) I feel like I am back to my base line right about now.  If I am come down then it was very gradual, like the onset, and wasn't really noticable except for feeling a bit more tired.",
  "Interesting and vivid dreams.",
  "I will, and have been experimenting more with this drug.  I have found that even 25mg is a very enjoyable experience with the buzz being present but not as strong, and without serious amounts of tiredness. ",
  "Amitriptyline positives : euphoria, closed-eye hallucinations, audio hallucinations, lethary, creative mind-set",
  "Amitriptyline negatives : consipation, (minor) stomach cramps, (very minor) urination problems",
  "Onset : approx 1 hour (in pill form) will be less if in gel cap",
  "Duration : approx 6 hours",
  "Comedown : approx 2 hours (very easy comedown)",
  "After effects : up to 12 hours after comedown"
 ],
 "erowid": {
  "id": "34343",
  "citation": " Experi-MENTAL. \"Stoned Without the Mental Confusion: experience with Amitriptyline (ID 34343)\". Erowid.org. Sep 23, 2004. erowid.org/exp/34343",
  "substance": "Amitriptyline",
  "views": "62228"
 }
}
