{
 "id": 1545,
 "title": "Yopohuasca!",
 "date": {
  "submission": "2002-05-21T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "PaGe 27",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(liquid)"
  },
  {
   "time": "1:00",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "Anadenanthera colubrina",
   "form": "(dried)"
  }
 ],
 "report": [
  "Prologue:",
  "As a 15 year old, I have up to date tried 20 substances + with much gained. I'm sure you've read my DXM HPPD report. DXM as a psychedellic was intriguing, but I found a different love with tryptamines. I had odered a pack of around 70 A. colubrina seeds. After many failed experiments roasting,smoking and snorting the seeds, I decided to take advice from 'Persistant'.",
  "Preperation:",
  "Syrian Rue:",
  "I ground roughly 3g of Syrian Rue seeds to a fine powerder. I then placed the powder in 1 cup of boiling water, which also had 1 tbs. of vinegar(acetic acid). I let the mixture boil with occasional stirring for 10 minutes. I then strained the contents through a paper towel into a measuring cup. I mesured roughly 50ml of extracted liquid. I then mixed it with grapefruit juice and other fruit juices to hide the nasty taste.",
  "A. Colubrina:",
  "The seeds were placed in a wet paper towel and then placed in a teperware container for 1hr. Then seeds were removed and cut up with a knife. I then let them air dry on a saucer for 6hrs.",
  "Procedure:",
  "I drank the Syrian Rue extract around 1hr. before munching on the A. colubrina (big mistake, uughhh). I suggest using a chaser with the mashed seeds.",
  "Experience:",
  "I first felt the effects of the Rue. I had eaten quite a bit of food before so I wasn't sure how the experience would be effected by this. I retreated to bedroom where I felt an odd body sensation. I was starting to experience nausea and cramps. I enjoyed the effects of the Rue and some CEVs associated with it. Then it took and odd turn. The Rue shifted gears, I was aware this would happen. I was feeling quite sick so I ran to the bathroom. I layed half on the floor and against the wall. The 5-MeO was begining to take effect. The colour of the room started changing - from bright to dark. Hazes of coulours appeared everywhere. I noticed more CEVs.",
  "Syrian Rue usually makes me tired, but stangely enough I was feeling quite stimulated. This must be due to the 5-MeO interaction I'm guessing. I watched the floor breath and admired the colours of the CEVs.",
  "I was feeling better so I dicided to go on IRC. I chated and watched visualsation web sites. I was astounded by the visualsations. I wasn't acting myself, I was altered sort of like a 12g Morning Glory experience. I watched some Amazon Flash movies and this effected the experience.",
  "I lost complete tack of time. I decided to go to bed. I put on a Fear Factory album and watched the Amazon patterns on the wall. This was amazing! The figures were fluresent and geometric.",
  "I was getting alot of cramps and feeling nauseated. So I decided to give in to the nausea. I threw up alot in the bathroom but it didnt bother me that much. I attracted the attention of my dad. I made up some cheap excuse for the puking. I then went to bed for good and slept till the next morning without disturbance.",
  "Epilogue:",
  "I will definetly try this combination again. Probly with most of the remaining seeds. I plan to take maybe 20-30 seeds with 6g of Rue. I want to wait abit though. I'm very glad this worked and I thank 'Persistant' for his methods, they proved very helpful."
 ],
 "erowid": {
  "id": "14828",
  "citation": " PaGe 27. \"Yopohuasca!: experience with A. colubrina & Syrian Rue (ID 14828)\". Erowid.org. May 21, 2002. erowid.org/exp/14828",
  "substance": "A. colubrina & Syrian Rue",
  "views": "18644"
 }
}
