{
 "title": "Showing Me My Place in the Universe",
 "author": "Triode",
 "citation": " Triode. \"Showing Me My Place in the Universe: experience with DOB (ID 1545)\". Erowid.org. Jul 18, 2000. erowid.org/exp/1545",
 "substance": "DOB",
 "bodyweight": "170 lb",
 "report": "<p>Two good friends and I decided to take a weekend and trip on DOB.  My</p><p>initial expectations were of a trip very much like 2C-B, but spanning</p><p>sixteen to twenty hours and fueled by the presence of amphetamine.</p><p>What occurred was something not entirely different, but not something</p><p>I'd been anticipating.</p><p>[T+0h] Saturday noon.  After I munched on a breafast of bacon and eggs,</p><p>we three wanderers each ingest 2.5mg DOB dissolved in distilled water.</p><p>Mixed with orange juice; taste imperceptible.  Here goes.</p><p>[T+0:30] First twinges of a psychedelic drug in my system.</p><p>[T+0:45] The psychedelic is clearly taking over my brain.  Interacting</p><p>with the world around me is difficult.  If I know nothing else, it's</p><p>that I'd better get the hell outta public view.</p><p>[T+1h] Two of the three of us arrive at a Safe location.  We have a</p><p>friend who'd volunteered to drive us around that weekend, and so we</p><p>wait for him to get ready to take us home.  We step inside (out of the</p><p>sunlight) and immediately my field of vision explodes into</p><p>characteristically 2C-B visuals.  I notice as well a wave of</p><p>amphetamine crash over my body, and I am soon feeling like the</p><p>strongest man alive.  I help my chauffeur lug some very heavy cargo to</p><p>the van -- effortless.  This shit is SPEEDY.  I am smoking pot because</p><p>I am compulsed towards it; it seems like a good idea to head off any</p><p>GI discomfort at the pass.</p><p>[T+1:30] We two arrive at home and meet the third, who's been coming</p><p>up on the same schedule.  At this point, when I am in a darkened area,</p><p>I am completely unable to distinguish visual effects from real</p><p>objects.  Amphetamine high is still CRUISING. </p><p>[T+2h] I am so amped, I could gnaw the head off a puppy.  Fortunately,</p><p>the fact that my entire perspective is moving, breathing, pulsating,</p><p>billowing, and crawling keeps me from doing anything useful.  More</p><p>smoking, and it is noticeably hard to keep it together long enough to</p><p>pack a bowl.  I am floored.</p><p>[T+2:30] I am thanking my lucky stars that I am going to have to</p><p>interact only with people I know very well for the next 20 hours.  I</p><p>am quite sure that I am having a good time, though -- still feels like</p><p>2C-B, but HARDER.</p><p>[T+3h] I would trade a kidney for a pack of Bazooka gum.  I have been</p><p>becoming more and more disoriented with my surroundings throughout the</p><p>whole three hours, and it is here that I would call myself 'lost' in</p><p>my own house.</p><p>[T+4h] A delightful, non-tripping-his-eyeballs-out friend shows up,</p><p>and we three enjoy talking to him.  I think it is at this point that</p><p>the trip begins its second leg; the 2C-B visuals start to fade (very</p><p>slightly, at this point) and get the hell out of the way, and a very</p><p>profound, intellectual DOB experience begins.</p><p>[T+4:20] I pack a bowl.  'See you in 12 hours, guys.'  *rrrrrrrip*</p><p>[T+5h] I can feel a slight tension lifted from my body as I</p><p>simultaneously feel my brain kick into high gear.  I eat something</p><p>because I can somehow tell I need to. </p><p>[T+6h] Over T+5-6h, I am able to clear the visuals out of the way</p><p>(although they're still _very_ strong) and think, think, think.  I</p><p>suddenly questioned every fact about reality I'd taken for granted. </p><p>[T+7h] The amphetamine din has settled into a dull roar, and I am</p><p>leading my appreciative brain through an odyssey of metaphysically-</p><p>deep insights into the real and perceived worldview I call 'Reality',</p><p>leaving open at every corner the chance for anything to be possible.</p><p>The three of us are happily and hungrily announcing and discussing our</p><p>current thoughts.  We are settling down into a dark room in the middle</p><p>of our house, almost like a cocoon, each person in turn putting on the</p><p>music he believed to be perfect for the situation.</p><p>[T+9h] We are devouring any knowledge we can, eager to share our</p><p>amazing experiences and contemplations.  We eat when we need food,</p><p>drink when we need water, smoke when it feels right.  I feel as though</p><p>I'm overseeing my body at a higher level than I ever have; I have a</p><p>good and innate sense of how to take care of myself (food, water,</p><p>pot, music) without dwelling on the individual feelings and pains in</p><p>my body.  It is apparent that the 'peak' (T+1-8h) has passed and the</p><p>effects are beginning a very slow, gradual taper.  Three non-tripping</p><p>friends appear, and it is very comforting to see faces from the</p><p>outside world.  We talk and enjoy each other.</p><p>[T+12h] Less visual, more brainy!  DOB thoughts are leaving me</p><p>dumbfounded.  I am anxious to wrap my brain around any scenario I can</p><p>conceive.  I have a correct and instinctual understanding of</p><p>electricity and magnetism, quantum mechanics, thermodynamics, organic</p><p>chemistry, algorithmic mathematics in such a way that I can simply</p><p>'feel' in what trend a particular system will act.  By possessing this</p><p>deep understanding of physics and mathematics, the rules of my</p><p>universe, I can detect patterns shared among wildly different systems</p><p>(the ties that bind between social, chemical, and physical</p><p>interactions).  I cook pasta for the six of us, and as it is</p><p>well-received I ponder the satisfaction of crafting something for my</p><p>friends and having it appreciated. </p><p>It's interesting to note that this experience was more what I would</p><p>call 'Ecstasy' than MDMA is.  My past drug experiences were</p><p>embarrassed and belittled by the DOB's gravity, its unique</p><p>characteristic of allowing me to invent a constant stream of Heavy</p><p>Shit for my mind to happily plow through.  I felt like I'd never</p><p>thought about anything so important; my most fundamental concepts of</p><p>reality were shaken to the core for the first time, and in comparison</p><p>it makes the visceral high of a 'quality' MDMA or mushroom trip seem</p><p>positively rude.  Whereas MDMA might allow me to reach a comfortable</p><p>synergy with the people around me, DOB provided a glimpse of what it</p><p>might be like to achieve Nirvana, to exist as pure thought.  When it</p><p>comes right down to it, this is why I ingest psychedelics.  This is</p><p>what it's all about.</p><p>I had some very momentous insights into heritage and family ties, from</p><p>my relationship with my dad to my kinship with the creatures from</p><p>which I evolved.  I was given a chance to grasp the infinity of the</p><p>universe; understanding its specifics was clearly out of reach, but I</p><p>understood why it was acting how it was acting, on the whole.  DOB is</p><p>completely orthogonal to the emotional realm; it does not alter my</p><p>mood at all, and only allows me to enjoy it because I enjoy thinking. </p><p>[T+14h] 2am Sunday, and it is here that things really begin to screech</p><p>to a halt.  Our conversation becomes less frequent, and I become more</p><p>introspective.  It's time to let the music take over.</p><p>[T+16:20] 4:20am and I'm keeping true to the previous afternoon's</p><p>promise.  We are content to keep ourselves warm, hydrated and fed, and</p><p>bathed in music.  Very faint visuals.  Coming down, no question about it.</p><p>[T+20h] It is around this point in time when each of us three dozes</p><p>off in turn; we're right on the tail end of the DOB's effects.</p><p>[T+22h] At 10am Sunday, I declared the DOB's mental effects 'over'.</p><p>[T+33h] After a full day of doing stuff and feeling generally ok, it's</p><p>sleepytime. :)</p><p>DOB tore me a new asshole.  I cannot describe it without its power</p><p>making itself apparent in my speech; DOB will forever hold a special</p><p>place in my heart, a place earned as a Truly Psychedelic Drug.  If</p><p>treated with respect, I believe DOB can show us how awesome the</p><p>human condition can be.</p>",
 "year": "2000",
 "id": "1545",
 "gender": "Male",
 "timestamp": "2000-07-18T07:00:00.000Z",
 "views": "28096",
 "dose": [
  {
   "time": "0",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "DOB",
   "form": "(powder / crystals)"
  }
 ]
}
