{
 "id": 15466,
 "title": "Effex or Defex",
 "date": {
  "submission": "2004-07-27T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "TripHeart",
  "gender": "Male",
  "weight": "85 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Cannabis",
   "form": "(daily)"
  }
 ],
 "report": [
  "I got on Effexor during a post addiction to ephedrine and cocktailing. I went into the worst bout of suicide drive I have ever felt. It took all of my resources to get through a day without throwing myself into the sea for good. After 6 weeks it settled down and I started to feel balanced but sedated.",
  "I cannot stop taking Effexor [150mg-300mg] because of the extreme side effects of withdrawal. Wyeth Pharmaceuticals are on a good thing with the Australian Government financing my habit at $50A a pack of 28. The side efects include the jangles every time I move my eyes or head, like a plucking of all my nerves, the feeling of moving through syrup, sudden waves of despair and anger.",
  "It is hard to separate the effects of seratonin depletion and drug taking but cannabinoids ameliorate symptoms (daily use). Psychodelics, including DMT, have little effect on the medication but if I combine MDMA with cold turkey on the Effexor then I go into a catastophic depression. I am now resigned to an ancillery addiction to venlafaxine. Put it on the bill please, along with tobacco and codeine phosphate to the multinational drug cartels. One of these days I will try to wean myself but the recovery time is torture. What a brilliant trip to be addicted to both legal and illicit drugs. Non of this changes who I am and a drug cannot bring out in me what is not already here. Keep on tripping if that is your passion but be cool. Low doses of anything is always better. Life is addictive, try stopping, it's very hard."
 ],
 "erowid": {
  "id": "34429",
  "citation": " TripHeart. \"Effex or Defex: experience with Venlafaxine & Cannabis (ID 34429)\". Erowid.org. Jul 27, 2004. erowid.org/exp/34429",
  "substance": "Venlafaxine & Cannabis",
  "views": "14404"
 }
}
