{
 "id": 15484,
 "title": "Deep, yet Unobtrusive",
 "date": {
  "submission": "2007-01-26T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Shamanny",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I ate about 5mg to start around 1pm, I followed the best word of advice to always start with a low dose when trying out new things, being my first RC experience as well, I was a tad nervous but confident, knowing that my source was pure and reliable. ",
  "About T+0:40, mild stimulation in the body began, almost like a good sativa high.  Colors did begin to perk up and such, and the feeling was good, but barely noticeable. ",
  "At T+2:00 with effects about the same, I ate another 15mg, I couldn't resist the curiosity burning within me to find this drug's true potential.",
  "Within an hour the visuals started to become noticeable, similar to mushrooms but easily forgotten or 'washed out'.  I decided to take a shower.  Staring at the tiles in front of me proved to be a humorous event.  The wall in front of me seemed to push outward at my face, bending and bending back again any time I moved my head.  When I stood still it would stop. ",
  "T+1:00.  There are some deep empathetic feelings being understood, involving family and friends and loved ones who I missed dearly.  But at the same time, it wasn't the sort of empathy that washed you up and almost makes you ecstatic with emotion, like MDMA does.  It was more 'real' feeling, less guilt-ridden.",
  "T+2:00 I've been relaxing in and outside of the house, the trees have extreme blossoming effects.  A noticeable visual effect occurs when staring for more than a few seconds.  The entire array of colors/patterns becomes 2-D, as if flat on a painting, and then reconstructs itself into a 3-D surface, like a tileboard or topography of the earth or something.  I began to see faces in just about everything outside, very warm and happy feeling. ",
  "T+2:30 This is when the inspirational feelings started happening.  Being a musician and appreciator of art, I started to feel as if this was the state I was looking to be in for the rest of my life (quite a noble but infeasible wish).  I felt myself immersed with the music I was listening to (a delightful mix of Keller Williams, The Crystal Method, and moe. throughout the experience) I also began feeling like I had once on mushrooms, trying to see things from a Dali-like perspective.  This was very cool, and staring at my giant tapestry led me to discover all the fine details of the art that could never have been distinguished otherwise.",
  "T+3:00 The visuals remain vivid but it's hard to even notice that I'm tripping still.  If I stare outside, it becomes immediately obvious.  However, walking around and keeping busy, I would never know I was under the influence.  Very light on the body for the most part.",
  "T+3:20 I realized upon gazing into the mirror one final time that the 2C-I had not made my pupils dilate much at all, surprisingly.  They had at peak gotten distortedly larger, per se, but never increased to more than 75% open.  For some reason this thought comforted me, I am unsure of why.",
  "T+3:30 I decided to go into my room (where it was dark) to check out black light effects and such.  I became totally immersed in a song called 'Over The Line' by The Crystal Method.  This has long been one of my favorite songs, but listening to it this time proved to be more meaningful than ever, and here is why.  One time, dosed on about 3.5g of cubensis, the song had taken me to a different world, psychedelia had consumed me and shown me a distinct picture of what 'could be'.  This song, I think, is about going off the deep end, figuratively, with drugs or whatever consumer indulgence you might want to argue works, but I'm pretty sure its about going 'over the line' with drugs.  Well listening to it under the 2C-I gave me an entirely different perspective on the song.  I began to wonder if it could be argued to mean human nature had gone 'over the line' creating such a beautiful drugs as 2C-I or anything comparable that would make this music sound so exquisite and breath taking...the song took on entirely different meaning as soon as that idea hit me and makes me love it even more.",
  "T+7:00 still tripping, the come-down has been long and slow, and generally pleasant.  No real harsh feelings, just a bit tired and head feels heavy.  This was one of the best psychedelic experiences I've ever had and didn't hinder my ability to communicate either.",
  "50mg would have probably shot me to the moon...but 20mg was not at all too overwhelming."
 ],
 "erowid": {
  "id": "34483",
  "citation": " Shamanny. \"Deep, yet Unobtrusive: experience with 2C-I (ID 34483)\". Erowid.org. Jan 26, 2007. erowid.org/exp/34483",
  "substance": "2C-I",
  "views": "2668"
 }
}
