{
 "title": "Close to Death",
 "author": "DMac",
 "citation": " DMac. \"Close to Death: experience with Diazepam, Cannabis & & Alcohol (ID 15491)\". Erowid.org. Apr 23, 2003. erowid.org/exp/15491",
 "substance": "Diazepam, Cannabis & & Alcohol",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  "5.0 mg",
  "oral",
  "Pharms - Diazepam",
  "(pill / tablet)",
  "",
  "2.5 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  " T+ 1:30",
  "5.0 mg",
  "oral",
  "Pharms - Diazepam",
  "(pill / tablet)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Wish I had found experience reports such as this before last weekend.  I play music professionally in addition to my day gig and had shown up to a gig with a sore back.  While playing this 4-hour gig I met an ordained minister (no shit) who had recently suffered a pretty bad back injury and was prescribed Valium.  We talked; I spoke of my slight (in relation) back soreness.  He offered me a blue 10mg tab which I stuck in my pocket.  I knew I'd have to drive an hour home later that night, and not having any experience with Valium, I wanted to be cautious.  I am a reasonably small-framed guy in my late 20's and have gained a pretty experienced knowledge base of drugs/experiences and also what to not do.  I assumed that I put a reasonable amount of thought into taking the drug.  I saw 2-3 folks swallow a 10mg tab that night.  They had a few beers and seemed in coherent (albeit a bit silly and slurred) shape. </p><p>The next night I had another gig and I decided to split the Valium and take 5mg.  Waited about an hour to try and perceive what effects.  Taking it easy.  After the hour passed I began to drink a beer and smoke a bowl (done that every time I've played for 15 years or so).  Felt pretty good yet entirely in control.  Decided to swallow the other 5mg tab maybe 1.5 hours after the initial dose.  A second beer for the 2nd set and following the show shared in a bowl of commercial grade pot and a hot dog.  Felt a little Jell-O like but I wasn't going to drive and felt OK.  Kind of liked it.  Back pain was gone.  Still articulate and in control.  In the 10 minute ride home I began to feel very light headed.  Cold sweat rush feeling.  No good - I think upon arriving home I'll puke and be OK.  My driver stops the car at home and I get out heading for the closest tree (I think).  In retrospect, these 3 substances at this moment likely have my blood pressure akin to a hot, flat soda. </p><p>I put my 2 feet on the ground took a step, counter balanced my wobbliness and, reportedly, I collapsed like a wet noodle.  45 minutes later I begin to regain consciousness with 2 large gashes on my temple/eye brow area.  Lots of blood, confusion, scared....wtf did I do?  2 days later I am still confused from the head injury.  I look back and winder if I came close to death.  I dont recommend this for any self-respective, slight good time seeker  or as a way to combat back pain.  Careful.</p>",
 "year": "2002",
 "id": "15491",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-04-23T07:00:00.000Z",
 "views": "60277",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "2.5 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "2": {
   "time": " T+ 1:30",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
