{
 "id": 15496,
 "title": "A Truely Mind Opening Experience",
 "date": {
  "submission": "2007-03-05T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "_eb0La_",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "75",
    "grams": 0.075
   },
   "administration": "smoked",
   "substance": "DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I obtained roughly 2000mg of pure DMT powder which was made synthetically. At night, i went into my backyard, lit a candle, relaxed and prepared my DMT dose, this was done by previously measuring 75mg of the powder. The dose was then placed on aluminium foil and heated till it had completely vaporized and i had inhaled all i could.",
  "I held my breathe for what seemed like 5 seconds, then exhaled, half way through exhaling i was blasted onto my back and everything i previously saw was exploded into a mixture of very unusual hyper shapes that are undescribable, and colours i can never imagine. This then proceeded to take me into a alien space ship type room, with 2 'beings' that resembled large praymantis. They knew i was there, i do not know how i knew this, i just 'felt' it, i was like a particle of air to them, yet i could sense they didnt want me there and were not happy of my presence, but never the less they tollerated me.",
  "These beings were controlling the universe, i was nothing compared to the grand scheme of what they were part of and this is something i feel i will never understand, the rest of my trip is far too difficult for me to describe, but i felt assured we as humans were being looked after and watched, and this life as we know it is merely the tip of the ice berg of what is yet to come, it is a place i feel everyone should visit, i feel it was something more than just a chemical reaction, but i do think i am not welcome back there again until they decide it is ok to do so... that dmt is some weird stuff, get it if you can..... ebola . ......"
 ],
 "erowid": {
  "id": "34523",
  "citation": " _eb0La_. \"A Truely Mind Opening Experience: experience with DMT (ID 34523)\". Erowid.org. Mar 5, 2007. erowid.org/exp/34523",
  "substance": "DMT",
  "views": "5017"
 }
}
