{
 "id": 15492,
 "title": "Beyond Sleep",
 "date": {
  "submission": "2006-12-26T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "JackHaven",
  "gender": "Male",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Trazodone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "The recommended dose for sleep-aid(25-100 mg) is just that. A sleep-aid. This drug is not designed for any kind of high or buzz. It should also be noted that those who take Trazadone daily as a sleep-aid it is possible to become so de-sensitized to this pharmaceutical that not even a larger dose will help you.",
  "Now to the good part: I take Trazadone as a nightly sleep-aid, as I am afflicted with extreme insomnia. However, I am also deep into the use of recreational drugs and mild-altering substances as a spiritual means. (My family and I are involved in the Medical Field, you should NEVER experiment with new drugs without someone experienced who can help you in a worse-case scenario) I had a talk with my friends, and did a little research to find the highest non-lethal dose it was possible to take for a person of my size. (I am a 5'9' muscular Male) I ingested 200 milligrams of the pills. Starting with 2 100 mg pills.",
  "Very quickly, about twenty minutes or so after the initial dose I began to feel very drowsy and was unable to function without the danger of falling asleep. I assumed that this would be the only effect, so I rested on the couch, setting an alarm for twenty minutes. I slept deeply and soundly, and was pulled awake slowly by the alarm, it is odd that I can actually describe the feeling of waking as a VERY physical and emotional feeling, which I have never felt prior or since this incident. After achieving a fully-awake alert state I sat in front of my computer and began to read various articles and such. It was then that I began to feel a sensation of rushing, with elevated blood-pressure and heart-beat, accompanied by the feeling of thousands of tiny needles across my body, much the way a limb would feel after it has fallen asleep.",
  "I was unable to concentrate on what I was reading and typing, and my friends' words seemed to take on different shapes as if they were alive. I was overcome by an overwhelming panic, and upon closing my eyes, I was met with a scene which I can only describe as Hell. The closed-eye visions were vivid and quick, and left burning after-images wherever I looked. I saw countless depictions of torture and rape and murder, I saw flames and death... I was left feeling terrified and upset.",
  "As I have found works with most bad trips where you remain more or less grounded to our world, I turned on every light I had, bringing my surroundings to a very brightly illuminated setting. The feeling of dread and panic slowly left me, and left a feeling of satisfaction. While in this state, I became lost in abstract thought, and was overcome by happiness. During this time, the elevated 'rushing' feeling grew even more, as if I had ingested amphetamines instead of tranquilizers.",
  "It was now approximately one hour and forty-five minutes after the dose, and I found myself dropping quickly away from the rushing feeling, my body was drained and exhausted, and I fell fast and deeply asleep soon after. During this sleep I had no dream activity that I can remember, and I slept very deeply and for a very long time.",
  "I don't think that Trazadone has much use a recreational drug, as it can bring about frightening visuals, which could drive the inexperienced or easily disturbed people well over the edge of their mental cliff. It was my own experience with previous bad trips that I was able to overcome the vivid visuals I was plagued with that night. I would also like to point out that the visuals play on the horror and such that I had already exposed myself to, such as images of violence and death. Especially the 'Beheading of Nick Berg' video, which affected my greatly, this image repeated itself many times in my minds eye, resulting a very terrible experience."
 ],
 "erowid": {
  "id": "34507",
  "citation": " JackHaven. \"Beyond Sleep: experience with Trazadone (ID 34507)\". Erowid.org. Dec 26, 2006. erowid.org/exp/34507",
  "substance": "Trazadone",
  "views": "89032"
 }
}
