{
 "id": 15493,
 "title": "Random Access to Other Dimensions",
 "date": {
  "submission": "2001-12-18T08:00:00.000Z",
  "experience": "2"
 },
 "author": {
  "name": "Nate",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.375 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "<p>I had the house to myself, was feeling confident, and had the urge to trust my sanity with something chaotic.  Call it thrill-seeking, but it helps to alleviate fears in the real world.  So I packed a 3/8 bowl of 10X salvia down tight and prepared myself. ",
  "I thought it might be fun to try to resist the trip.  I sucked down the smoke, which was almost too much for one hit and held my breath.  Twenty seconds later I could feel the trip coming on and began to laugh, like I was going to resist it!  As reality slipped away I had a powerful sense that I had to be somewhere else.  I was no longer myself, I was a different entity entirely, with its own motives and responsibilities.  My being fragmented into two entities, one that had to be someplace and one that was beckoning it to that place.  I got up and walked to my basement stairs, but do not remember climbing them because this is when the trip took over completely.  I was in a tan colored void, accelerating at an incredible rate towards something virtually indescribable.  Visually, it resembled a spine whose vertebrae were replaced with horizontal blue bars.  Its motion resembled a Chinese dragon as it swam through the void.  But conceptually, I understood that it was the essence of its reality, the sum total of all the attributes that made up the space. ",
  "I was trying to join it, to be a part of something I thought I had always known.  As I neared the spine, the force of acceleration grew more intense, I could not reach it.  Then, out of the spine grew a geometric abstraction, reaching for me to pull me in.  Suddenly I was in my kitchen, still believing I had to be somewhere.  Five seconds later I thought: Wait, whats happening?  Then I was back; I began laughing euphorically at the sheer diversity of experience available in the universe.  Saying that a salvia trip is like visiting another dimension may be an understatement.  It is a whole new mode of existence.  I had always believed that radical modes of consciousness existed because it is my philosophy that infinite realities exist in infinitely diverse ways, but I never thought I could experience them directly. ",
  "Salvia extracts are not for recreational use; they are for people serious about exploring the immense diversity of experience.  In my experience, fear is an impossibility in the trips, I assimilate my place in the salvia reality so completely, that I understand that place as if I had lived my entire life there.  But my reaction to salvia is abnormal, my trips last only about one minute, which is much shorter than other experiences I have read about.  Also, sensitivity to salvia is very subjective.  I am very sensitive, while a friend of mine smoked an entire half bowl of 10X and only felt tingly.  Another friend who was having a bad day only had his depression intensified, he babbled and wondered around aimlessly, not knowing what to do.  So I would start with the 5X and be careful.  Salvia can lead to amazing experiences but one will never experience them if one is scared shitless of the stuff.</p>"
 ],
 "erowid": {
  "id": "3451",
  "citation": " Nate. \"Random Access to Other Dimensions: experience with Salvia divinorum (10x extract) (ID 3451)\". Erowid.org. Dec 18, 2001. erowid.org/exp/3451",
  "substance": "Salvia divinorum (10x extract)",
  "views": "25584"
 }
}
