{
 "id": 15505,
 "title": "How to Make Hell Look Beautiful",
 "date": {
  "submission": "2007-05-10T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jon",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I myself am not a person who regularly partakes in doing illegal drugs. I for one barely smoke marijuana and when I do it's once in a great while. I only take Adderall to help my studies and for snowboarding, but besides that I have not taken any other drugs. But for some reason mushrooms have always intrigued me. A journey that many of my friends have partaken in but I had not yet had the opportunity to try. Well finally my friend who I will call 'A' had received some top quality mushrooms that I was willing to try. I finished school by 9:30 and took a car trip down to the beach.",
  "The mushrooms were gold in color and had spots with white stems, I didn't pay too much attention to the details, what I was worried about was eating them. My friend 'A' desperately wanted to know what they were like so he told me to tell him what was going on. To my surprise the mushrooms tasted a lot like stale popcorn which wasn't that bad. The Gatorade washed it down real well and I was wondering what the trip was going to feel like.",
  "About a half an hour later we arrived at the beach and nothing had seemed to happen for that time. 'A' went down to the beach to check the surf and see what it was like. I told him I would stay in the car because I didn't want to go out and get noticed by people. I was looking out the front window of the car and suddenly everything seemed to flow a lot more. In front of me there was a row of houses with trees in the front yard. All of the trees seemed to get bigger and more jungle like. Before I knew it, there was a whole jungle in front of me. Tons of palm trees everything was so bright and fluid. The trees had sprouted blue, purple, and pink flowers out of their bright green leaves. I felt as if I were going to go on a safari. For some reason I saw little orange creatures crawl out of the trees. It confused me because I never thought you would get full on animals as hallucinations while on shrooms. When I turned around though all I saw was sand from the beach and it seemed as if it were a desert behind me. I noticed a slight sense of queasiness in my stomach but nothing too disturbing to pry me away from the visions I was encountering. I saw 'A' run back from the beach and for some reason I felt a sense of safety. I wanted to tell him everything I was seeing but when he came back into the car all he said was 'how's it?' and the only thing that came out of my mouth was 'crazy.'",
  "Since we had a whole day in front of us with nothing to do 'A' wanted to go check out some more surf spots. I was completely fine with this. I was in my own little protected bubble in his car. Everything had changed around me, the road we drove on looked like something out of Tommorowland. The cars all looked like they were hovering and elongated. The most interesting thing was that everything I looked at seemed to have a message that needed to be deciphered. Some may see these marks as patterns but I saw them as an archeological code to find buried treasure. Treasure was mine and 'A' who now had an Indian Mohawk was my guide to find this treasure. The only problem was that all the secret encodings were outside of the car and the car was moving too fast to decipher them. They were on other cars, roads, buildings, and the hills seemed to each have holographic projected images that had those codes. I seemed to get frustrated and it gave me a little headache but nothing strong enough to stop my experience. We put on some Bob Marley which I thought would make the trip seem much more soothing. When I read reports about people that took shrooms, they said that music had seemed much more fluid and interesting. I tried to listen but got bored quickly and forgot that the music was playing.",
  "'A' had finally found a good place to surf but he wanted to go off-roading before he went home to get his surfboard and wetsuit. I recall when we were going into the hills our car was riding on lava. All the hills had turned to volcanoes and the roads leaving to the top were lava. The off-roading really made my headache worse. At this point the hallucinations seemed so intense and I had such a bad headache all I wanted to do was go to sleep. The bad thing about this when I closed my eyes, I didn't get darkness; instead I got more annoying patterns that won't go away.",
  "I decided that maybe if I went into a dark room the patterns would go away and I would be able to sleep. That was a very bad idea. Unfortunately for me 'A' has a room that is way too trippy and distracting. His sheets were full of Hawaiian flowers, and he had way too many posters on the wall. For some reason I felt I wanted to get naked. Not that I needed to but I did. I got in the covers but then decided to put my clothes back on. I then got back in the bed and looked at a surfboard that was constantly changing. I felt the need to get naked again. I did this but for some reason I got naked exactly like before, like a deja vu. I looked in the mirror that was next to the bed and I could see myself from my young self turning fat and then skinny then to same stage I was at before. I also remember grabbing myself and feeling as if I were some liquid crystal substance. Someone had created me and I had not even existed. For the next half an hour I was living through this horrible deja vu. Everything was repeating itself and now I had lost complete sense of who I was and pounding vibrations were going into my head, intensifying my headache. All that I could remember was a sublime song where they mentioned the word psyche ward and that was exactly where I though I was going.",
  "That half an hour seemed to last around two weeks. For some reason I got some memory back. I couldn't remember my name but I remembered 'A.' If I found him I would get that feeling of safety again. I walked out of the room into sunlight. I could tell that walking into a bright place made my trip a little better. The pounding vibrations calmed down into little beats. I found a note saying that 'A' went surfing and that he'd be back later. All the pounding that had subsided came back worse than ever. It seemed as if time had completely stopped. I went upstairs remembering that you could tell time by watching TV because the shows are in half hour increments. Unfortunately the TV was what I think was Reservoir Dogs and every time I would look at the TV, it would become uninteresting and I would have to leave.",
  "I had to leave the room and I went into another room which had pictures all over the wall. For some reason the pictures reminded me of some serial killer's notes and pictures of a family he was going to kill. God had put me in hell. It's exactly what hell is, a constant repetition of blurry unpleasant visions or being in some killer's mind. The worst thing about it was that I was in hell alone. I contemplated calling someone to come walk me through this but the phone had no numbers it was just blank with a screen. I doubted I would have remembered any numbers though. I remember placing the phone at the end of the stairs and I accidentally knocked it over. The phone fell and shattered into four or five pieces. I went down, picked them up, and went back up the stairs but to my amazement the phone was still where I left it on the end of the stairs, fully intact. I looked in my hands and nothing was in them.",
  "And to think that all things would have come to an end, 'A's' dogs came out. I had been avoiding them all day because I thought they were menacing beasts, Satans guard dogs. But the dogs came over and they liked my hands and I new that they were good. Everything was still in repetition but now I was happy, flowers were budding; the dogs were playing with me, and for some reason time were moving. I had come to the conclusion that even though everything was evil and repetitive, it became beautiful and fulfilling. I was able to calm myself down sitting outside near the garden and with the dogs.",
  "About an hour later 'A' walked through the door. I told him about my horrible but great trip. I was about 90% back to normal about 5 hours after I took the shrooms. He took me to this sub place and we ate and I told him about my journey. It had been the longest day of my life with 3 of the 6 hours I had been tripping seeming like a month. Even though I had those horrible experiences with the trip I believe I would do shrooms again. That is what you have to deal with when you do these types of drugs. But next time I would definitely have a person with me at all times and try and stay at one place."
 ],
 "erowid": {
  "id": "34547",
  "citation": " Jon. \"How to Make Hell Look Beautiful: experience with Mushrooms (ID 34547)\". Erowid.org. May 10, 2007. erowid.org/exp/34547",
  "substance": "Mushrooms",
  "views": "3891"
 }
}
