{
 "id": 15504,
 "title": "What the Heck is Going On?",
 "date": {
  "submission": "2007-01-15T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Salvia Divinorum",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "Date: June 2004",
  "Location: GMM (Giant Man Mountain) which overlooks a city.",
  "Accomplices: Myself 'Rabbit' and the Guerrilla, T-Davis, Chode #2",
  "Time: 8:30 (sunset)",
  "I ordered a package of Salvia Divinorum 10x from the internet and it was sent to Chode #2's house because it doesn't seem like it matters to his parents what drugs he is using these days. I recieved a phone call around 3:00 in the afternoon from him on a thursday. I decided to go pick it up from him at his work. When I walked up to the counter I was greeted with a small cardboard box and a free pretzel (He works at a Pretzel shop).",
  "I was pretty excited to try out some of the Salvia 10x because I previously had a nice trip off of the Salvia 5x with some of my buddies. The 5x only seemed to get us completely stoned. We took about three or so hits of a bong of the 5x and in about 20 seconds we were as stoned as we could possibly be. Me and three buddies shared a gram of this stuff for about $20. It was a fast, cheap way of getting seriously messed up. The bad thing, or good thing for some people, is that you only trip for about 5 minutes and then the other like 10-15 minutes is stoned-like.",
  "The night had arrived. As we all marched up the hill to the top of GMM we decided that the newcomer (T-Davis) should take the first hit since he hadn't hit the 5x earlier on that month. We were all sitting in lawn chairs in a circle. Me and the Guerrilla thought we were experts on this sort of thing so we told him to totally cash the bong load, which was about a 1/4 of a gram or so. He decided to sit on the group and as soon as he lit the bong the salvia was completely cherry. He took down about almost all of the bong load before pulling away. We told him to hold it in for about 20-25 seconds and then let it out. We knew that effects would be sudden, most likely within 30 seconds. He then proceeded to cash the entire bowl. Suddenly he pretty much demanded me to take the bong away from him.  'Take it quick, now!' T-Davis did not know what was going on as he really couldn't explain was what goin on.",
  "After he handed me the bong he has a dumbfounded look on his face. He would look at me and quickly look at the querilla. Basically he didn't know where the hell he was. He knew that he was messed up big time but he never had actually figured out that he had taken anything. 'I don't feel like I'm on earth' explained T-Davis. He was sitting indian-style and he would continue moving around in that same position. He was terrified out of his mind. He said that at times he would blink and the world would be white. He thought that he was dead or had been dieing. He had this helpless look on his face the entire time and I was actually scared of what he was going through.",
  "During his 5 minute panic, he actually stood up and sat in between me and the guerilla. I think that he felt safe sitting close to two of his best friends. Me and the guerrilla decided not to take the salvia while he was still tripping because he kept on telling us that we shouldn't do it and that he needed help. At one point he started to dig in the ground for no apparent reason at all. He started coming down a little after that and actually he felt quite well afterwards. He was happy that he had tried the salvia but it was a experience that he couldn't describe and an experience he wouldn't want to do for awhile.",
  "After T-Davis's bad trip I was kind of reluctant to try it. But as I know my buddy Guerrilla well, he said 'I'll do it.' I packed the bowl about the same as T-Davis's but I don't think the Guerrilla got as much as his trip was different. With the 10x we only needed 1 good hit. The Guerilla made it count. As soon as he took the salvia in and held it for about 20 seconds, he was smashed. He busted out laughing right away for about 6 seconds and then suddenly stopped. 'WOW What is going on!' 'This is like nothing ever before!' The Guerrilla had taken shrooms, weed and LSD before and this trip was nothing like anything before. He spent most of his trip on the ground thinking god knows what while looking at the starry sky.",
  "My turn was next. I had the bong between my legs so that when I was jacked up, I wouldn't drop it. The bong was my good friend Chode #2's. I quickly took a hit and proceeded to hold it in for about 25 seconds. I felt nothing and I heard the Guerrilla ask 'How do you feel' I replied 'I feel good, don't feel anything yet tho...wait hold on...ya I'm fucked up. It was such a fast onset from feeling nothing to being totally messed up. I suddenly felt this tingly feeling in my toes and move fast throughout my body all the way up through my head and out my ears. I was completely lost.",
  "I could hear my friends talking to me but I wasn't sure what they were saying. When I tried to answer them, only slurred words came out of my mouth. I couldn't speak and it was kinda hard to swallow. I couldn't feel the chair that I was sitting in, as I visioned we were all in a hole or grave of some sort. I thought that I was sitting against a wall of dirt and that we were all suddenly in this weird place. I had a sudden urge to jump up and see what is out there to experience. I could still feel the tingly sensation throughout my body as I jumped around. When I decided to sit back down, the chair looked disassembled. It took awhile to figure out how to sit down and when I sat down all I did was look at the stars. It seemed like the stars were moving in a circular motion and that they were close enough to touch. At one point I blinked and saw a young girl in the corner of a window at an old shack. This made me panic a little bit. Soon after I came down and we were all a little relieved.",
  "We soon climbed down the mountain, barely making it, and reached our cars. It had been about 40 minutes since T-Davis took it, 25 minutes since Guerilla took it and about 15 minutes since I took it. We were all pretty stoned still and I started staring at these bushes. The bushes didn't seem normal as it looked like someone had just painted them in there. It seemed like a moment from 'Who Framed Roger Rabbit' where it was real world in the backround and something cartoony within. That was my last experience with Salvia so far. We ended up driving to Jack in the Box for some grub. It seemed like we all were pretty tired about 2 hours after the Salvia and we all bounced home.",
  "Salvia is a fun experience to have but all experiences are different, as me and two buddies all had extremely bizarre ones which can only be explained by the ones who take it, if possible to explain."
 ],
 "erowid": {
  "id": "34546",
  "citation": " Salvia Divinorum. \"What the Heck is Going On?: experience with Salvia divinorium (ID 34546)\". Erowid.org. Jan 15, 2007. erowid.org/exp/34546",
  "substance": "Salvia divinorium",
  "views": "2721"
 }
}
