{
 "id": 15514,
 "title": "Bad Juju",
 "date": {
  "submission": "2009-10-10T07:00:00.000Z",
  "experience": "1989-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Been there DONE THAT",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 tablets",
   "administration": "oral",
   "substance": "Pharms - Haloperidol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This happened 10 years ago, but broke me from taking unknown pills, for sure!",
  "A friend got several pills, calling them 'generic Valium,' I suppose because of the H in the center and the same blue color as Valium. My boyfriend took six or seven, and I took about 5. What followed was 24 hours of getting up and feeling tired, but then when I laid down I had lots of energy.",
  "After 24 hours of not being hungry and having the weird up and down feelings, my boyfriend started having strange facial ticks while sitting on the couch, and managed to say 'hospital.' I finally realized he wanted to go to the hospital, and handed him his sandals and told him to put them on. He just sat there, twitching, and I looked down and saw that his toes were curling up backward. I managed to get his shoes on him and get him out to the vehicle.",
  "When we got to the doctor's office, the doctor asked him if he had done Compazine or Haldol, and being afraid of getting in trouble he claimed neither, so they sent us to the emergency room. He was rigid by that time, and had to be taken in on a stretcher. I was feeling fine, but while driving everything had a bright halo around it and I could only see about 10 feet in front of the vehicle because of the glare.",
  "The hospital administered Valium and something to counteract the drug, and admitted my boyfriend to the hospital for an overnight stay. I was starting to feel strange, and as I walked the halls of the hospital my knees wouldn't bend and they promptly admitted me to the ER. I started to feel like there was an iron band around my head, and begged them to give me the antidote. As soon as they started the IV I started to get relief.",
  "Over 20 people ended up in the hospital over this batch of pills."
 ],
 "erowid": {
  "id": "34585",
  "citation": " Been there DONE THAT. \"Bad Juju: experience with Unknown (Sold as Valium) - Suspected Haloperidol (Haldol)  (ID 34585)\". Erowid.org. Oct 10, 2009. erowid.org/exp/34585",
  "substance": "Unknown (Sold as Valium) - Suspected Haloperidol (Haldol) ",
  "views": "12602"
 }
}
