{
 "id": 15518,
 "title": "Schoolwork and Beyond",
 "date": {
  "submission": "2007-07-27T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Anomie",
  "gender": "Female",
  "weight": "230 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Pharms - Methylphenidate"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Amphetamines"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Cocaine"
  }
 ],
 "report": [
  "<p>Situation: four weeks before the end of the semester in my senior year, I was failing three out of four of my courses and didn't know how I could pull myself back together in time to graduate. ",
  "One of my friends kindly supplied me with some 8-hour time-release capsules of 20mg Ritalin.  These capsules have two big kicks, one as soon as you take the pill and one four hours into it.  My friend warned me that it would make me extremely thirsty, so I filled myself a pitcher of water beforehand, which worked extremely well for me--it meant that I didn't have to break my focus to go get water).",
  "The first time, I tried only 20 mg.  The experience came in waves; when the time-release dose kicked in, I felt a tightening in my head, like the beginning of a headache, quicker heartbeat, euphoria, an intense ability and desire to concentrate, and a whole lot of mental stamina.  As the doses died down, I felt a release of concentration. ",
  "Work-wise, my first time was a mixed experience.  I ended up writing about 25 pages for what should have been a 10-page paper.   When the Ritalin was in full force, all I wanted to do was keep writing, keep working.  This was mostly good, but I had to spend the whole next day cutting the paper back down to the required length.",
  "My euphoria and productivity lasted after the dose ended.  For a couple of days afterwards, I found myself able to work and concentrate even without the Ritalin.  After that time, though, the feeling wore off and I was back to my previous depressed state. ",
  "I decided to do the Ritalin again, but tried to manage it better this time.  I prepared by making a detailed outline for my papers, including strict page limits for each section.  I cleared out my workspace in advance and set up a pitcher of water and some energy bars.  Then, I took 20 mg and then another 20 mg two hours later so that the time-release 'waves' would be smoother.  This system worked extremely well for me--in 10 hours, I finished 2 papers and hundreds of pages of reading. ",
  "I went on like this for the rest of the semester.  I would do a day on Ritalin and a day off, since the effects seemed to last beyond the actual dose.  I started doing three and then four pills at a time, always staggering the doses two hours apart so I could get a smooth time-release.  Eventually I ran out of Ritalin and had to substitute 20 mg time-release Dexadrine, which was the same experience.",
  "Near the end of my finals period, I needed to pull some all-nighters, so I supplemented the Ritalin/Dexadrine with Red Bull. At this point, I was staying up for 48 and 72 hours at a time.  The caffeine/stimulant combo definitely made it possible for me to stay up later, but also made my hands tremble and my heart beat extremely hard and fast, which worried me a little, but seemed to have no permanent ill effects.",
  "Until the last crush, I was careful to keep up my health. Though I didn't feel like eating while I was high, I forced myself to take a few bites of an energy bar from time to time, and I also took a multi-vitamin every day.  I also made sure to take the Ritalin in the early afternoon, so that I could get a full eight hours of sleep each night.  The only major problem cropped up when I got fixated on something other than my work--watching TV, for instance, or talking with friends.  Generally, I was most productive when I gathered everything I needed in my room, including plenty of water, energy bars, and all my papers and books, and locked myself in before taking the first dose.",
  "Ritalin and Dexadrine allowed me to pass all my classes and graduate.  I could not have done it without them.  I stopped using for about three weeks after my semester ended, but now I've started using again, this time recreationally.  I snort crushed (non-time-release) tablets of Ritalin which I mix with coke.  I find that the combination makes me more euphoric than coke alone, and it also gives me the extreme concentration effect that I like.  At this point, I'm somewhat worried that it's turning into an addiction.</p>"
 ],
 "erowid": {
  "id": "34598",
  "citation": " Anomie. \"Schoolwork and Beyond: experience with Methylphenidate, Amphetamines (Dexedrine) & Cocaine (ID 34598)\". Erowid.org. Jul 27, 2007. erowid.org/exp/34598",
  "substance": "Methylphenidate, Amphetamines (Dexedrine) & Cocaine",
  "views": "9930"
 }
}
