{
 "id": 15528,
 "title": "Feels Like I Am Floating",
 "date": {
  "submission": "2001-10-27T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "pinkwarrior",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "70 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "It all began about 11:00 at night, I had just got back from Wal-Mart with my friend, we were ready to extract some hydrocodone. I had 14 10 milligram Watson hydrocodone pills. (Watson is a generic brand of pharmacueticals). If we had ate 7 a piece, we wouldve been f**ked for sure due to acetamineophen, so I extracted them using the extraction method described in the codeine FAQ.  It took about 2 hours to fully extract, but it was worth it.",
  "12:30",
  "My friend and I take turns taking swigs of the solution, we get about 3 swigs a piece, I guess we got an even dose, I think we did anyway. I figured we lost some hydrocodone in the extraction, so I didn't know what was gonna happen.",
  "12:40",
  "We smoke a bowl of marijuana out of a homemade bong. Then, I get out my glass pipe and we smoke 2 more bowls.",
  "12:55",
  "I start spinning very fast, the buzz is like being very very drunk and floating at the same time. I am sure that I am going to puke, I run to the bathroom, but I don't puke and I feel better within seconds.",
  "1:10",
  "My friend and I walk upstairs to his room, I can't walk straight. I feel some nausea, so I lay down, we turn on Dark Side of the Mood by Pink Floyd and start to drift away. My friend chats on the computer most of the night",
  "Heres what the buzz is like:",
  "Emmense physical and mental high. Feels like I am floating.",
  "Some nausea, but I am laying down, and it goes away while I am.",
  "Music is the greatest thing, I start drifting away to the cd and snap back into reality after a while.",
  "It's very hard for me to keep my eyes open.",
  "Euphoria is intense and great.",
  "I have lost all track of time.",
  "3:00? (I am not sure cause time went so fast)",
  "I suddenly feel like a hole has been torn in my buzz, I am still high as hell, but I figure that the weed has worn off.",
  "So, I smoke 2 more bowls with my friend and lay back down, the weed replenishes my buzz and it's just as good as before.",
  "5:00",
  "My friend hits the sack, both of us still high as hell, we probably didn't actually get to sleep until about 5:30, but I didn't want to sleep.",
  "7:00",
  "We are woke up by my friends grandma, my friend is supposed to go somewhere, but he fakes sick and gets to stay home. We are both still very high, I try not to go back to sleep, but I do.",
  "11:00",
  "I wake up with a slight hangover, nothing compared to a night of beer drinking though. I do not feel sick at all, just a bit hungry and very thirsty.",
  "I recommend hydrocodone to anyone, but extract it!",
  "If you don't extract it, you are heading towards a night in the hospital."
 ],
 "erowid": {
  "id": "3463",
  "citation": " pinkwarrior. \"Feels Like I Am Floating: experience with Hydrocodone & Cannabis (ID 3463)\". Erowid.org. Oct 27, 2001. erowid.org/exp/3463",
  "substance": "Hydrocodone & Cannabis",
  "views": "55914"
 }
}
