{
 "id": 15529,
 "title": "Up Down Up Down",
 "date": {
  "submission": "2007-02-21T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hieroglyphics",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "pill / tablet"
  },
  {
   "time": "5:30",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Ephedra sinica",
   "form": ""
  },
  {
   "time": "15:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "pill / tablet"
  },
  {
   "time": "16:00",
   "amount": "500 mg",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder / crystals"
  },
  {
   "time": "18:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "My consumption of drugs",
  "Simple Time Log:",
  "[9:30 AM] [Substance: Zoloft 100mg]",
  "I normally would take 100mg a day as perscribed but I missed about 4 or 5 days in a row leading up until today. The heavier side effects will not come unexpected later in the day (fatigue).",
  "[3:00 PM] [Substance: Ephedra 25mg] [Currently Ingested: Zoloft]",
  "I took this as a weightlifting supplement. I had planned on going about an hour after I had taken it in hopes it would be reaching its peak levels as I began lifting weights. Instead of feeling the powerful, stimulating onset of the ephedra, I was slowing down. I became extremely tired.",
  "I think the Zoloft is playing a roll in this. It once in a while can sedate me. I will accept the zoloft as the catalyst for the resulting nap. Sleep time.",
  "[3:30 PM] [Substance: None] [Currently Ingested: Ephedra 25mg, Zoloft 100mg]",
  "  ZZZZZZZZZZZZZZZZZZZZZZZZ sleep time",
  "[6:00 PM] [Substance: None] [Currently Ingested: Ephedra 25mg, Zoloft 100mg]",
  "I had slept approximately 3 comfortable, uninterrupted hours and went to my summer school class, where incidentally, my professor chose to dispose with the students that he suffered severe pain over the weekend and is now loaded up on painkillers. He informed those present that the class would be taking on a condensed and abbreviated strucutre for the night in an effort to get everyone home soon. So when he finished up, I came home and killed some time until I could go to bed and get ready for tomorrow's class. Killing time is always easy when you're sleeeeeping :]",
  "[12:30 AM]  [Substance: Zolpidem 20mg] [[Currently Ingested: Ephedra 25mg, Zoloft 100mg]",
  "I toss 2 more ambiens down the hatch at about 12:30 and relax, listen to music, chat with friends online, watch baseball recaps on sportscenter. I feel no physical discomfort whateversoever aside from mild cottonmouth.",
  "[1:30 AM]  [Substance: Cocaine 500mg - Insufflated] [[Currently Ingested: Ephedra 25mg, Zoloft 100mg, Zolpidem 20mg]",
  "A friend of mine called to make arrangements to pick up a gram of coke. Me being behind the road after taking the Zolpidems may have been a bad idea. I felt a bit doped up and my reactions were noticeably slower - Not dangerous, but not crisp. So we get our yeo and have a few blows for our noses. I estimate I took in 500mg cocaine. No ill effects thus far. It was time to return to home and try to get some sleep with a class in the morning. Once again, I turned to my Zolpidem's to put me out.",
  "[3:00 AM]  [Substance: Zolpidem 20mg] [[Currently Ingested: Cocaine 500mg, Zolpidem 20mg,Ephedra 25mg, Zoloft 100mg]",
  "I take the last 2 Zolpidems and everything falls in place. The Zolpidem sets in as I notice my vision begin to slow down. My most common 'hallucination' if it could be termed that, is inanimate objects moving in humanistic ways. For example, the water bottle on my desk is pushing a 'guy' forward, then leaning back and twisting what would be his neck. It's quite fun to watch them and everything else just sorta of do its own thing all at once. This circus of inanimate objects continues on. Quite an experience.",
  "I'm summarizing at this point, though still heavily under drugs. The zolpidem has always had a hallucinogen effect on me. Using it in combination with an antidepressant (SSRI) may have been irrelevant. The cocaine, however, really got it going. My heart was racing and so was my mind. On the whole, it's been a very interesting and repeat-worthy experience."
 ],
 "erowid": {
  "id": "34631",
  "citation": " Hieroglyphics. \"Up Down Up Down: experience with Zolpidem (Ambien), Cocaine, Sertraline (Zoloft) & Ephedra (ID 34631)\". Erowid.org. Feb 21, 2007. erowid.org/exp/34631",
  "substance": "Zolpidem (Ambien), Cocaine, Sertraline (Zoloft) & Ephedra",
  "views": "14793"
 }
}
