{
 "id": 15520,
 "title": "Weeklong Wedding with Acorus Calamus",
 "date": {
  "submission": "2001-05-22T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Terrence Brannon",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tsp",
   "administration": "oral",
   "substance": "Calamus",
   "form": "(extract)"
  }
 ],
 "report": [
  "I am mainly submitting this report because my experiences with Acorus Calamus were very different, yet similar to those I read in the Vault. I got my concentrated root extract from an online ethnobotanical supplier.",
  "One day when I was stressed, I just sorta grabbed the bottle and slammed down a few drops. It was acrid but I scarfed down a bit more to make sure I got some effect from it. For a little while nothing happened. Then my pulse got stronger and faster. Then I had to vomit. Then, for intervals of no more than 15 minutes for the next 6 hours, I was vomiting and defecating --- sometimes simultaneously.",
  "The next morning all the vomiting and defecating was over, but I remember trying to crawl into my closet to drive away the sunlight. I was crouched into a ball and trying to dream some more. When I got to work, the other drug user at work was giving me this quizzical look --- I really wasn't very much in my body --- I could look in the mirror and see that my soul was floating free and wasn't as concerned as usual with putting its efforts into making socially acceptable masks and gestures for me.",
  "I got on the bus that night and as I rode I would fade in and out of awakeness. Once, there was this green-brown buzz that just sorta took up my visual and audio fields for about 30 seconds. Some loud-talking girls clambered on the bus, immediately, my body said: 'you dont need to tighten up and get angry at that, you can do something else' and I just relaxed.",
  "This night, when I slept, I was given whole new realities and whole new solutions to problems, but I simply could not bring them back into this dimension. This went on for about 1 week... I remember at work I was taking a nap and after a few minutes, my body could be in sleep state and I could watch it: I would take long deep in and out breaths and my mind was totally relaxed and I was watching the whole scene.",
  "Regarding the first day's vomiting, I do feel my vomiting had to do with the two grilled cheeses I ordered from a grease castle earlier that day. 4 hours later, I was heaving up whole rubbery chunks of american and swiss cheese."
 ],
 "erowid": {
  "id": "3461",
  "citation": " Terrence Brannon. \"Weeklong Wedding with Acorus Calamus: experience with Calamus (ID 3461)\". Erowid.org. May 22, 2001. erowid.org/exp/3461",
  "substance": "Calamus",
  "views": "23262"
 }
}
