{
 "id": 15539,
 "title": "Visuals for Days",
 "date": {
  "submission": "2004-06-25T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "dc",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Ive taken 2c-i now about 7 times in total. I thought i would talk about flashbacks as i havent really seen very many posts about them. Two friends and myself purchased the 2c-i about 3 months ago, we started at low doses and slowly worked our way up the scale, not receiving any negative effects from the trip or the come down aside from slight headaches during the trip which always disappeared quite quickly. This was my first experience with a psycadelic and since having the 2c-i ive only had mescaline and im a regular marijuana user. After having the 2c-i i have been receiving flashbacks, and having spoken to another 3 people i know personally who have taken the substance, they have confirmed im not the only one. Bascically the flashbacks are lines of colour that shouldnt be there, for instance looking at a car while driving i will see flurecent blue coming from under the car. This doesnt always happen but seems to mainly be at night and is when some type of light is reflecting off my eye. The flashbacks arent by any means disturbing. They seem to be quite prevelant a week after taking the 2c-i and continue for another week or so quite regularly then die off although not completely. Longest break i have taken off it since the purchase was probably a month. Sometimes the flashbacks can also bring back the feeling of the 2c-i in the body as well. i dont get this very often although a friend has said he does get them quite a bit during the following weeks. This is a nice drug but compared to something such as mescaline is really not worth the possible long term side effects."
 ],
 "erowid": {
  "id": "34661",
  "citation": " dc. \"Visuals for Days: experience with 2C-I (ID 34661)\". Erowid.org. Jun 25, 2004. erowid.org/exp/34661",
  "substance": "2C-I",
  "views": "14262"
 }
}
