{
 "title": "Very Sudden Onset of Incoherence",
 "author": "Pennsylvania",
 "citation": " Pennsylvania. \"Very Sudden Onset of Incoherence: experience with GBL (ID 15539)\". Erowid.org. Jan 18, 2005. erowid.org/exp/15539",
 "substance": "GBL",
 "bodyweight": "175 lb",
 "report": [
  "<p>My friend drank a 'capful' of GBL - an amount he had done before with no problems - as I drove him to a club where we were going he told me he was 'really starting to feel it' and then IMMEDIATELY became incoherent.  It happened so quickly I honestly thought he was messing around with me - until he started drooling on himself. He did not respond to my voice - so I stopped the car and an ambulence was called - he vomited twice in my car not knowing what was going on at all - during the next 10 minutes his seizure remained but he started moving less and less - like he was passing out.",
  "The ambulence arrived quickly - they pumped his stomach - and intubated him because he was vomiting too much to keep his own safe airway.  At the hospital, to stop the seizure, they had to give him medication which shut down his nervous system, as a result he was put on a machine that breathed for him.",
  "He stabilized a few hours later and is supposed to be ok - but he will have pnemonia (from the vomit that accumulated in his lungs) and we still don't know if he had any oxygen deprivation from the seizure (apparantly that can happen).",
  "This is what can happen - it was quick - so quick that I didn't think it was really happening in the beginning - if you see this - CALL AN AMBULENCE - do not let the person try to 'vomit and then pass out'  - if seizures start you HAVE to intervene.  You have a very VERY short window of time - do not weigh the pros and cons of reporting it.",
  "The police did not aggressively pursue us - due to the fact that there was nothing in our car and no one else was messed up - I am only sharing this because I want people to know that they SHOULD NOT be afraid to call an ambulence - as long as you don't have GBL lying around (or anything else) then you won't get in trouble - and he didn't get in any trouble also - so don't worry the cops will bust your overdosed friend.",
  "Lastly - this was an amount he had done before - understand that - he wasn't going out of this world with overdosages - he had done it before, but this time there was a violent reaction.  This isn't Ectasy - you don't build up a tolerance.  He didn't.",
  "Read this - know how to respond in case of emergency.</p>"
 ],
 "year": "2002",
 "id": "15539",
 "gender": "Male",
 "views": "10479",
 "dose": [
  {
   "time": "0",
   "amount": "1 cap",
   "administration": "oral",
   "substance": "GBL",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2005-01-18T08:00:00.000Z"
}
