{
 "id": 15534,
 "title": "Walking the Path of Bliss - Briefly",
 "date": {
  "submission": "2007-01-10T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Genshed",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Kava",
   "form": "(extract)"
  },
  {
   "time": "0:00",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Cannabis - Hash",
   "form": "(extract)"
  },
  {
   "time": "0:00",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  },
  {
   "time": "0:45",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0:00",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "report": [
  "This was an experiment.",
  "At approximately 9:00 p.m., I prepared the liquids.",
  "Two tablespoons each of commercial kava kava extract,",
  "homemade marijuana tincture, and absinthe. This mixture",
  "was put in the freezer to chill.  At approximately 9:30,",
  "I removed it from the freezer and added as much cold",
  "sparkling water as the total mixture.  It turned an opaque,",
  "swirling greenish color - the fabled louche of absinthe.",
  "I downed it in one gulp. The aftertaste was not as",
  "unpleasant as expected - the bitterness of absinthe with",
  "sweet anise overtones.",
  "I was at home, relaxed, with no pressing concerns.  By",
  "10:00 p.m., I was the only one still up.  My lips were",
  "beginning to feel numb, the sign that the kava was taking",
  "effect.  I was feeling slightly numb in my extremities.",
  "By 10:15 p.m., I was feeling quite good - even more relaxed,",
  "optimistic and peaceful.  I set up my Dreamachine (a homemade",
  "device that produces light flickers in the low alpha range).",
  "I then smoked a small bowl of high-grade marijuana.  As",
  "it began to take effect,  I sat down at the Dreamachine.",
  "The visual effects came on quite rapidly.  The initial",
  "entoptic imagery gave way to a ceaseless kaleidoscopic",
  "array of color, shape and light, reminiscent of some",
  "accounts I've read of mescaline's effects.  I began to",
  "see clear images within the swirling vortex, forming,",
  "rising up to full prominence, then being sucked down and",
  "replaced with new ones.  My spirit soared as I began to",
  "see _through_ the vortex, into a calm and glowing level",
  "marked by a stable geometrical pattern. It appeared to be",
  "hexagonal, in glowing green and yellow - although colors",
  "such that I've never seen with mortal eyes.",
  "After some ten or twelve minutes of this rapt contemplation",
  "of the fiery fractal mandala that lies on the other side of",
  "darkness, I got up, went to the couch and laid down.  Immediately",
  "upon closing my eyes, I began to see closed eye visuals (CEVs).",
  "These morphed and transformed as inexorably as the ones",
  "before.  After settling in and becoming quite comfortable,",
  "I took up a whipped cream dispenser, exhaled, and took in",
  "a moderate lungful of nitrous oxide.",
  "As I exhaled, I could tell the sensation of air passing",
  "through my trachea had already changed. Inhale, exhale. . .",
  "and my body began to experience Pure Pleasure.  I felt myself",
  "ascending the World Tree and emerging into the brilliance",
  "of the Living World.  Every joy and pleasure of mortal life",
  "was a mere shadow or gossamer simulacrum of this experience.",
  "Even as I soared above the canopy into the clear blue beyond,",
  "I knew that gravity was pulling me back.  A long long descent",
  "back to my body, where simply being stoned out of my gourd",
  "felt like being stone cold sober by contrast.",
  "I put everything away, brushed my teeth, took two ibuprofen,",
  "drank a glass of water, and went to bed. Got up seven hours",
  "later feeling fine.",
  "Do NOT attempt this if you are going to be in public.",
  "I intend to repeat this experiment, but not soon and not",
  "very often.  It was an extreme experience."
 ],
 "erowid": {
  "id": "34644",
  "citation": " Genshed. \"Walking the Path of Bliss - Briefly: experience with Kava, Cannabis, Absinthe & Nitrous Oxide (ID 34644)\". Erowid.org. Jan 10, 2007. erowid.org/exp/34644",
  "substance": "Kava, Cannabis, Absinthe & Nitrous Oxide",
  "views": "22120"
 }
}
