{
 "id": 15545,
 "title": "Entering the Garden",
 "date": {
  "submission": "2004-06-26T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pat",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "0:40",
   "amount": {
    "unit": "mg",
    "quantity": "30",
    "grams": 0.03
   },
   "administration": "oral",
   "substance": "2C-C",
   "form": "powder/crystals"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "16",
    "grams": 0.016
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder/crystals"
  },
  {
   "time": "6:00",
   "administration": "oral",
   "substance": "Diazepam",
   "form": "pill/tablet"
  },
  {
   "time": "7:30",
   "amount": {
    "unit": "mg",
    "quantity": "40",
    "grams": 0.04
   },
   "administration": "oral",
   "substance": "Fluoxetine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "These drugs are a beautiful combination! I'm very familiar with most drugs and feel I use them (relatively) responsibly, including the absolute necessity of knowing HOW MUCH I am taking, e.g. using a very accurate scale. Anyway, I prepared for the journey with 2400mg Piracetam, Ginseng, Gingko Biloba, 100mg 5-HTP, 1000mg Tyrosine, and 1000mg DLPA. Drove to the Getty Museum in LA with my girlfriend and as soon as I got there took 5 hits of extremely weak acid (probably closer to 2 hits?) followed 40 min. later by the 2C-C. Once I felt the effects of the acid kicking in, I swallowed the 2C-I so as to combine the peaks of the two drugs. My girlfriend took 18mg 2C-I only. Here's the quick breakdown:",
  "+0:00 take LSD on chewing gum",
  "+0:40 30mg 2C-C",
  "+1:00 16mg 2C-I",
  "+1:45 starting to peak? wow, great body feeling, colors!",
  "+2:30-6:00 long, amazing, transcendent peak",
  "+6:00 20mg diazepam",
  "+7:30 residual effects of acid, nice mellow comedown",
  "I've wanted to trip at this museum for a long time. For anyone not familiar, the Getty is amazing! First of all, its on a hill overlooking Los Angeles with beautiful architecture, secluded, and a garden that rivals many of the famous museums in Europe... These drugs were the perfect combination for experiencing the museum. I've done LSD plenty and 2C-I 3 times prior to this trip, but never in combination, and this was my first taste of 2C-C. Wow! The 2C's clean up the visuals of the acid so that color is super pronounced, but without much radical morphing (which can be fun, but I enjoyed the more subtle fluidity of this combination). Feels kind of like candyflipping, 2C-I definitely has the E feel, but much more clearheaded (I actually liked this combination better than candyflipping; seems closer to reality while equally intense). The rush of serotonin sometimes felt overwhelming, the same 'dripping' sensation as E, but I never felt anything in the way of anxiety, possibly due to the reported relaxing effect of 2C-C. How to explain this combination? I felt 'normal' while tripping very hard, which is perfect for a public place. The paintings jumped off the walls, and the impressionist paintings, Monet, Pissaro, Van Gogh !!! This is how these works of art were meant to be seen!! The colors so profound; glimpses into Eden... And the garden: wow! Laying in the grass, watching children and examining the flowers, talking with my girlfriend, closed eye visuals... many moments of transcendence.",
  "Layers of mental filters were stripped away. The peak was relatively stable, very long lasting, and never became overwhelming. After taking a Valium to ease the comedown, I feel extremely hungry. Considering the intensity and beauty of these drugs, I wonder: is it too good? am I doing damage to my brain? I came down gently as the museum was closing for the day, and when we got back to the car me and my girlfriend both took 40mg each of Prozac, figuring it might protect our brains similar to Ecstasy (considering the 'similarities'). Before more is known about 2C-I, I'd like to be as safe as possible. Very tired afterward, but no negative side effects that I noticed. Overall, an amazing experience!"
 ],
 "erowid": {
  "id": "34677",
  "citation": " Pat. \"Entering the Garden: experience with 2C-I, 2C-C, LSD (ID 34677)\". Erowid.org. Jun 26, 2004. erowid.org/exp/34677",
  "substance": "2C-I, 2C-C, LSD",
  "views": "33955"
 }
}
