{
 "id": 15553,
 "title": "The Mind Awhirl...",
 "date": {
  "submission": "2000-10-25T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Remedy=Chill",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I took my 25 mg of 2ct7 orally at about 9 in the evening. I spent about 2 hours noting the slow climb of the drug - Then it hit me.",
  "A wave of nausea that resulted in emptying my system completely.",
  "Within moments, though, my mind was spiralling upwards integrating a vast array of ancient superstition, modern science and the timelessness of the explorers spirit into a spiritual kaleidescope of self discovery.",
  "Having been (in my own mind anyway) experienced with psychedelics (LSD, Mushrooms, Mescaline - most for a period of ten years or more) I thought I was prepared for whatever psychedelic experience 2ct7 had to offer. I was, to put it mildly, completely off the mark.",
  "The clouds outside seemed to tear through the night in a violent rush - while at the same time flowing quite tranquily and peacefully by - A true lesson in duality.",
  "Visually I could ask for no greater psychedelic. Things seem to glow with an inner light that I've never so much witnessed as experienced once removed in Huxley's Doors of Perception. I had to make the point out loud that all reality had only a 'fuzzy' core and that it was the interpreter of that reality who laid a template over it to draw the core in to focus.",
  "This fuzzy quality could be the beginnigs of some cartoonism as I have experienced off mescaline. (Perhaps at a higher dose)",
  "I've yet to detect any true auditory hallucinations, although sounds seemed to be definitely altered. The sound of my glass sliding on the table - while in reality a very subtle noise to be sure, merged together with a television commercial featuring a closing arm at a train crossing to fill the room with a train-rushing sound (the t.v. sound was off).",
  "Spiritually I would call it a rush. Physically it's jittery and full of energy. The urge to be in the world - interacting in this highly altered state - is almost irresistable.",
  "Surely I could compose myself to talk to police and explain myself away as mildly drunk. But the nature of the drug is to compound your stimuli. A room with 5 people for example seems to carry the weight of a room with a party of 15. Certainly a club could easily become an ocean of conflicting torrents and drives.",
  "This drug seems to draw me in to an odd perspective of seeing how my past has helped to structure my future - hence the spiriual 'blending' of ideas I referenced earlier. (i.e. the superstition of a childhood spent in fascination with the occult becomes a lifelong interest in psychedelia, etc.)",
  "In short - I would have to call 2ct7, in a word, definitive.",
  "Written under the influence in Oct of 2K."
 ],
 "erowid": {
  "id": "3471",
  "citation": " Remedy=Chill. \"The Mind Awhirl...: experience with 2C-T-7 (ID 3471)\". Erowid.org. Oct 25, 2000. erowid.org/exp/3471",
  "substance": "2C-T-7",
  "views": "15697"
 }
}
