{
 "id": 15558,
 "title": "The Calm Shock Waves of Resonating Objects",
 "date": {
  "submission": "2007-07-06T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Dispel",
  "gender": "Male",
  "weight": "90 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "65 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(fresh)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Living in Holland, I am used to the highest quality of all drugs, its lucky for me I have taken a shine to psychadelics in a big way. I am 19 now and I have been taking shrooms about once every 3 months for about 2 years, not bragging just offering some background. Generally 1 box of Mexicans, but my maximum until this particular trip was 3 boxes of fresh Mexicans, which was pretty intense visually. However, nothing could have prepared me for the wonders I was about to witness with this cocktail of cubensis.",
  "It was Easter time, and most of my usual tripping buddies were away on holiday, leaving me with probably my best tripping buddy J, and one of my friends O, who has attention deficit disorder. We got bored smoking up in O's free house, and figured a trip to the dam was in order. We stayed there for a good 3 hours squeezing in as much coffeeshop time as was physically possible. We figured a christianing of the Easter break was in order and what better way than to intoxicate ourselves further with some shrooms. We arrived at a smart shop and noticed they were selling fresh Hawaiians. It is rare to find anything other than dried Hawaiians in the Hague where I live so we felt instantly blessed. Me and J being the more experienced decided we would get a box of Mexicans for the mellow feel, a box of Thais for the body trip and a box of Hawaiians for truly intense visuals. O being the least experienced of the group bought a box of Hawaiians and Mexicans.",
  "We hadn't eaten anything all day and mixed up some strawberry nesquik to dampen to rancid taste of the shrooms, and began to chew. It took a good half hour to finish that lot off, and not 5 minutes later the effects were becoming apparant, I could feel the usual watery stomach tingling, and remember feeling very impressed with the swiftness in activation of the shrooms. It was clear to me the effects were hitting O much faster and harder at this point in time than me or J, but I put this down to his small body weight.",
  "Another 30 minutes and we were stationed downstairs in O's basement room, watching as everything was breathing in sync with DJ Shadow, I knew that this was what tripping was all about; the calm shockwaves of resonating objects, the weightless but at the same time pinned down feel, and the tripping induced giggles. I noticed O was becoming increasingly more silent as each minute passed, but I again dismissed this as him just enjoying the trip. Some more time passed (cant really tell you how long), the trip was definately on a steady upward curve towards the ever fathomed peak, O began getting very fidgety and anxious, me and J asked if anything was wrong, and he replied in a state of pure terror, 'We have to leave this room!' me and J looked at each other inquiringly, and decided to keep O happy and moved to the living room.",
  "Here is where the peak set in, all I can remember is lying on the sofa and within an instance of me closing my eyes and opening them everything became intense by a factor of about ten, I remember everything around me was melting, morphing breathing in ways that truly stretched the boundaries of my perception and proportion, I remember the most interesting of these visual experiences was blue circular blobs that made up the pattern on O's living room carpet were extending upwards in a series of oscillating columns, and a giant ball type entity was trying to push its way through the wall behind the carpet in the rolling manner of the old school windows screen saver style. My body was at a state of pure intoxication and bliss.",
  "O once again became extremely agitated, his eyes were darting from one item to the next, and I remember asking him if he was ok, he replied 'Fots t qwik' which I interpreted as 'Thought's too quick'. I then realised that O's ADHD was probably the cause of this, and we were stupid not to have researched it beforehand. However, I can pull myself together when I need to, even though this time it was the most intense experience I had ever had on shrooms, and tried to comfort O. All the fear and panic that had been emitted into the room had gotten J a bit worked up. I had the feeling he was under alot of stress prior to the trip anyway, and he began to feel extremely cold. He left the room and lay down in O's bed. O's fear began to subside and he started pacing up and down in a very hyper sort of way, I tend to like to relax and enjoy the trips and I remember letting out a long sigh which seemed to confuse O a bit, I then thought a joint was in order while O went to annoy J for a bit.",
  "The joint was almost impossible to roll, I can normally fix together some form of cone shape even on stronger psychadelics like LSD, but this appeared almost pointless. I ended up with a diamond shape spliff and headed on outside for a bit of gander in O's garden. I got outside and remember contemplating alot of things, the first being about how I wish I had enjoyed the peak without any hassle, but I came to the conclusion that it happens to some people and felt it better not to judge. I also thought about my life in general, I thought about my family and girlfriend, and associated a sense of security with them, this was a lovely warm feeling that made the bubbling in my stomach subside for a while.",
  "The colour of everything outside was very vibrant, it was dark but a friendly blue glow came from everything, the smoke of my joint lapped out into the cool night air like tentacles and I watched it for what seemed like hours. Everything was still breathing in tandem and I heard the Beatles being put on in the background, I felt overwhelmingly content with myself and the earth around me that I almost forgot about O and J, but it turns out it was J who had put the music on and O appeared much more calm.",
  "We spent the duration of the trip having the most intimate moment with the Beatles, as the music seemed to enter every object in O's living room. The effects wore off and we all shared our experiences and J agreed it was extremely intense, O could only remember fragments of his peak and remembers seeing no astounding visuals (shame really).",
  "This was a brilliant trip for me despite the scares I got from both J and O, I worked alot of problems out in my own sort of way and realised how everything has its worth and purpose rather than just being about pretty colours and visuals."
 ],
 "erowid": {
  "id": "34717",
  "citation": " Dispel. \"The Calm Shock Waves of Resonating Objects: experience with Mushrooms - P. cubensis & Cannabis (ID 34717)\". Erowid.org. Jul 6, 2007. erowid.org/exp/34717",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "2454"
 }
}
