{
 "id": 15562,
 "title": "Medical Application of Provigil",
 "date": {
  "submission": "2004-11-12T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "archaeo",
  "gender": "Female",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>I suffer from depression, sometimes with anxiety, and one of the side-effects is called 'leaden paralysis', an inability to get up from bed.",
  "During my Junior year, this became quite frequent, and I began to miss a lot of school. My psychiatrist perscribed wellbutrin and provigil. It's been about a year, and I am now graduated from the High School that once encouraged me to seek alternate education. I went from missing 60 days out of 180 to only 8. Provigil gives me increased awareness and helps me get to school, as well as keep a regular sleeping patern.",
  "A happy side-effect is the weight loss that accompanied the regular use of provigil. My metabolism increased dramatically, and I now weigh roughly 30 pounds lighter. I also eat less. This isn't surprising, considering the relation it has to amphetimines and other drugs commonly used to lose weight.",
  "I continue to use other drugs, and I can give the following information:",
  "With marijuana, there is no noticable effect. I have never noticed the high becoming shorter due to metabolizing. However, I generally only smoke marijuana in the afternoon or late night, long after the morning dose of provigil. In direct combination, I imagine the faster metabolic rate might affect the duration of the high.",
  "With tobacco, I notice the stimulating effects of smoking are generally made more apparant. A cigarette before school often caused a euphoric lift and an increase in the 'stimulated' feeling. Mild, and not unpleasant.",
  "I've noticed no effects on benzodiazepines such as xanax or lorazepam, nor does it seem to effect the Wellbutrin.",
  "The various research chemicals I have tried are the only drugs that seem to cause a problem. On both 2c-t-2 and 2-c-t-21, I noticed headaches and body loads other trippers didn't feel. A low dose of LSD didn't seem to have any adverse reactions, but it was a single, stale hit. The problem, however, may not be due to the provigil, but instead due to the wellbutrin.",
  "There have been no real problems in taking provigil. My school work was increasingly well done, and I finished sixth in my class. I also scored higher on my SAT. There was a lull before it started working fully, and it wasn't until at least a month after I began taking it that I noticed a real difference in sleep patterns.",
  "I have never used this drug recreationally, nor do I plan on it. I am not generally a fan of recreational stimulants (excepting tobacco). The medical uses for this drug have been infinitely helpful to me.</p>"
 ],
 "erowid": {
  "id": "34739",
  "citation": " archaeo. \"Medical Application of Provigil: experience with Modafinil (Provigil) (ID 34739)\". Erowid.org. Nov 12, 2004. erowid.org/exp/34739",
  "substance": "Modafinil (Provigil)",
  "views": "26889"
 }
}
