{
 "title": "Deep Relief",
 "author": "OxyWoman",
 "citation": " OxyWoman. \"Deep Relief: experience with Oxycodone (Oxycontin) (ID 15565)\". Erowid.org. Dec 8, 2004. erowid.org/exp/15565",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "160 mg",
  "insufflated",
  "Pharms - Oxycodone",
  "(pill / tablet)"
 ],
 "report": "<p>Erowid Note: Beware of dosages described by an individual who uses Oxycodone regularly as their dose could be dangerous for a non-user due to tolerance.</p><p>I have experiemented with many other things, alcohol, other pharmacudicals, weed, MDMA, Mushrooms, acid, etc. But the greatest feeling i have gotten from any drug was Oxycontin. The feeling that Oxycontin gives me is overwhelming. I have been using the drug for about a year straight. I am aware that I am an addict, but the feeling is too great to stop. I continue to use it because through my stressed out life, it actually allows me to relax and stay calm.</p><p>I usually end up doing the drug whenever I feel that I am unrelaxed. Whether I am at school, work, home, at a friends house, or party. The drug is relatively easy to get and its free. So why not. Right now I am at the point where snorting 160 mg is the least I can do to feel any kind of relief. I started off at 5 mgs about 11 months ago, 5 mg being enough to fuck me up for a couple hours. Gradually increasing when the normal dose wouldnt fuck me up anymore.</p><p>My experiences have been about the same everytime I do the drug. I just wait about 3 minutes for the sensation to hit me. When it does its the greatest overwhelming feeling ever. I feel such relief and relaxation. Your entire body begins to tingle and my entire body feels great. Sometimes I would take other drugs with it. Whether it be weed, or MDMA, or acid. it all works together just allowing me to be more relaxed. It's hard to describe the feeling its like I've wanted something for so long, and I didnt know exactly what it was, but when I get it its like pure excitement running through my entire body, but instead of the excitement being energetic its relaxation. For the first couple months of doing it, I threw up just about every damn time I did it. I am a weakling when it comes to drugs though. I always end up throwing up, sometimes even when I smoke weed. Odd enough. Oxycontin defiently supresses my appetite. I used to be a lot heavier, about 165 lbs. Ive lost 40 pounds without even dieting.</p>",
 "year": "2001",
 "id": "15565",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-12-08T08:00:00.000Z",
 "views": "21339",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "160 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  }
 }
}
