{
 "id": 1557,
 "title": "Oh My God This Is Intense..When Will It Stop?",
 "date": {
  "submission": "2004-07-05T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This was my first experience with this material and the intensity of it was quite surprising.",
  "Materials",
  "approx 8mg 5Meo-dipt",
  "cannabis smoked occasionally",
  "Report",
  "The previous night I had tried 2CB for the first time. Me and my friend X were in a good mood and decided to try some 5meo-dipt of which I had a small quantity. At this point I hadn't slept but was surprisingly awake and a quick shower fully refreshed me.",
  "I carefully measured out 8mg 5meo-dipt by dissolving a quantity into vodka and using a 2cc capacity syringe to measure out the required dose. I chose 8mg as I worked out the possible error from measuring to be +/- 0.5mg but I had heard of the weight of chemicals purchased from suppliers being quite a bit over weight so I erred on the side of caution. 10mg would be the maximum dose I could've measured out and from reading reports that seemed pretty manageable.",
  "At 12:30 X and I downed our 'shot' of vodka. Yuck! This stuff tasted absolutely disgusting. The taste lingered in my mouth for ages and I drank a fair amount of water to try and get rid of it. X didn't manage his entire shot in one go, leaving about 1/5 of it in the bottle. We sat back and put on 'Fear And Loathing In Las Vegas' (again!).",
  "2 minutes after dosing I turned to my friend and we agreed we were feeling first effects. This was rapid. Within 10 minutes I was starting to get heavy breathing and I could feel my stomach knotting up. I was getting MDMA style body rushes which would travel up my entire body. They felt cold as opposed to the warmth of a MDMA or 2CB rush.",
  "After 20 minutes I was already heavily fucked. I felt quite nauseous and the rushes were intensifying. This is strong. I begin to wonder how much stronger it could get. Did I take too much. I run through the process in my head again. I convince myself I've accidentally taken a double dose then realise all the maths is right and I needn't worry. My friend sat with his eyes wide open with a look of amazement on his face. 'Fucking hell ' was all he could manage to say before blowing his face up and breathing heavily.",
  "At 40 minutes it was getting crazy. I was rushing so heavily I couldn't actually function properly. I kept opening and closing my eyes. I curl up on the bed and grab at pillows, scrunching them up with quite a bit of force, trying to ride out the rush. I could feel every bit of my body tingling. I looked at a poster on the wall and the colours started changing slightly. Out of the window I could see yellow spots on everything. All this time I was trying to hold onto my stomach which really did feel rough. A friend came into the room and all I could do was roll round the bed and giggle before saying 'this is soooo strong'.",
  "At 1hr my friend decided we need music. He disappeared off to get another friend's cd player. I lay down on the bed and felt an incredible burning sensation in my arm. I look down and see it's just the pillow has been in the sun and is warm. This stuff increases my sensitivity to stimulation incredibly, way more than E or 2CB.",
  "At 1hr 10 my friend reappears having completely forgotten what he was doing. We put on a tape instead. He just stands in the room looking like he's about to pass out or something. I'm starting to get control of myself again. Music sounds amazing. I don't notice any distortion in sound like people have mentioned getting off this material before.",
  "At 1hr 20 I felt like I've reached the peak. I could speak and walk around. Me and X discussed what just hit us. It was like walking into a brick wall - a complete shock to us. I felt really happy and wide awake. I looked in the mirror and I was flushed pink across the tops of my cheeks and my nose. The skin there felt incredibly smooth; in fact just touching my clothes felt good. Walking round was a bit much as my feet had gone incredibly sensitive.",
  "At 2hrs we were still on the plateau. We managed to make our way outside and to the park. X had consumed the remainder of his dose and walked along the street giggling. We decided we must look like the public's idea of a depraved dope fiend. The sun was shining and it felt wonderful, like sun when stoned but far more intense. I wished I'd brought sunglasses as it was all far too bright. Colours were much brighter than normal. Once we'd sat down on the grass I felt calm. I could look across the park and pick out individual things. Each blade of grass was glinting in a different way. Brushing my hands over the grass was very strange but not entirely unpleasant.",
  "We sat in the park for about 4 hrs. We smoked quite a few spliffs which chilled me out even more. They didn't give me any visuals like I was hoping for. I seemed to be at the same level for this 4hrs. Nothing changed and I was wondering whether it would ever end. We played a bit of rugby once some other friends came down but I found this to be far too much effort and kept dropping the ball. Obviously my coordination had been affected somewhat.",
  "About 6hrs after taking the 5meo-dipt I could feel it start to drain out of me. We went and sat in a bar but I couldn't stomach a drink. It had been a long session with 2cb followed by this and no sleep in between. I started to get tired really quickly but I wasn't feeling paranoid or irritable. After 8hrs I decided to call it a day and headed up to my room. After a quick shower I felt refreshed and fell asleep almost immediately.",
  "I woke up feeling pretty fine. I was tired to the same degree as when I do e but I hadn't eaten or slept for 2 days and this was to be expected. I didn't feel mentally tired, just physically.",
  "****************************",
  "The comeup on this was the most intense experience I've had apart from salvia. I really did think I was going to lose it and it was bordering between amazing and scary. The nausea wasn't too bad and our stomachs were already in a pretty bad state after our 2cb adventure the night before. Vodka + 5meo-dipt on a rough stomach would probably cause anyone nausea. I didn't experience any problems with diarrhoea and apart from my stomach I didn't find the body load too bad.",
  "Once up the experience was actually pretty mild. I was fucked but still able to function, talk to people and walk around without looking weird.",
  "Next time I get the chance to try this I'm going to do a smaller dose. The comeup was a little too harsh and I would like to explore to find a dose that would be pleasant recreationally, rather than a 2hr hell ride followed by 4hrs of calm."
 ],
 "erowid": {
  "id": "14899",
  "citation": " Anonymous. \"Oh My God This Is Intense..When Will It Stop?: experience with 5-MeO-DiPT (ID 14899)\". Erowid.org. Jul 5, 2004. erowid.org/exp/14899",
  "substance": "5-MeO-DiPT",
  "views": "9385"
 }
}
