{
 "id": 15575,
 "title": "The Late Night Show",
 "date": {
  "submission": "2007-06-23T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Phyx",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.25 gal",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0:30",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I started taking 100 mg of Tramadol, 2 pills of 50 mg each at 23:30 (11:30).",
  "I was sitting in my room in front of my computer and nothing happened for about half an hour (00:00). I took 2 more pills, that makes the total dosage to 200 mg. I started to sweat, but that passed a few minutes later. All over I felt calm and my pulse/breathing was very slow. I felt nothing other for about an hour when suddenly att 01:00 it started to itch all over my body, that went on about ten minutes.",
  "Around 02:00 some pain started to come back, I felt pain in my shoulders from sitting down to long so I moved around a bit. The clock went on to 03:20 when I started feeling nausea so I laid down on my bed. Thats when things started to happen. I got some weird sound hallucinations, it could have been sleep oriented but I felt awake and warm.",
  "The nausea passed after 10-15 minutes so I got up and felt disoriented, kinda, whats the word, 'new awake'(?). I turned on the tv and watched some cartoons and later decided to masturbate to test aphrodisiac effects. I had a hard time there, I couldnt get an orgasm for a long time, and Im not one of those guys that can work all night if you know what I mean. So my guess is that some functions got sedated, perhaps it could work as a sex prolonger.",
  "I did 2 hours before, 21:00-21:30, drink 1/4 gallon of beer (1 liter) and ate some candy. So I got a lot of carbohydrates in my stomach, but no real food.",
  "Over all it was a nice experience, not so intense that I hoped for, perhaps 100 mg more would have done the trick."
 ],
 "erowid": {
  "id": "34761",
  "citation": " Phyx. \"The Late Night Show: experience with Tramadol (Ultram) (ID 34761)\". Erowid.org. Jun 23, 2007. erowid.org/exp/34761",
  "substance": "Tramadol (Ultram)",
  "views": "5565"
 }
}
