{
 "id": 15577,
 "title": "Not Necessarily the Most Fun",
 "date": {
  "submission": "2006-08-16T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Slipslop",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "5-MeO-DiPT",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I have had two 5-MeO-DiPT experiences now, and I must say neither of them was very satisfying.  The only reason I even tried it the 2nd time is because the first time I ended up on a plane, landing and then passing through customs, which was, stressful.",
  "Ingestion of a very low but inexact dose (4-8mg was measured out by eye from 50mg, aiming for a dose of 6g) was followed by a fairly high amount of stomach distress. I had fasted for quite a while beforehand and there was no vomiting or other unpleasant occurrences, just discomfort.  This was followed by the beginning of the trip, which started out very mild (and after sex seemed to becoming even milder).  Some marijuana was smoked, changing things very little.  All this was done in a private setting.",
  "Mildness was not really to be had, however, even with the low dosage.  Or maybe it was our change in surroundings.  But either way, being out and about in the windy city proved somewhat stressful, what with avoiding cars, dealing with pedestrians, getting into bars, etc. The effect was far above what my previous experience with foxy (at about 15mg) would have led me to believe about a dose this low, though there was little head noise, a sort of pleasant body feeling after the nastiness had subsided (which took quite a while), and a general feeling of 'being on drugs' that accompanies most psychedelics.",
  "Subjective notes: I don't really plan on using this chemical again.  I understand what people say about the 'foxy' feeling, but honestly being outside with a cool breeze on my skin was more of a pleasant sensation than having sex (and this foxy was done with sex definitely in mind).  The positive sexual side effects were nothing compared to those of MDMA or LSD.  Combined with the nasty come up and difficulty in social situations (akin to LSD or psilocybin or any other psychedelic really), even on this low a dose, it basically doesn't seem worth it."
 ],
 "erowid": {
  "id": "34764",
  "citation": " Slipslop. \"Not Necessarily the Most Fun: experience with 5-MeO-DiPT (ID 34764)\". Erowid.org. Aug 16, 2006. erowid.org/exp/34764",
  "substance": "5-MeO-DiPT",
  "views": "3674"
 }
}
