{
 "id": 15592,
 "title": "Serotonin Syndrome",
 "date": {
  "submission": "2004-08-19T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "sick girl",
  "gender": "Female",
  "weight": 49
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "This is a warning! I take Lexapro (escitalopram oxalate), an SSRI prescribed for depression. SSRI is a Selective Serotonin Reuptake Inhibitor: it increases the levels of serotonin in your brain to reduce depression symptoms. This medicine has been VERY effective in curing my depression. The problem is, I have a long history of Tramadol abuse, which started when I was hospitalized about a year ago and was given it for pain.",
  "I had been taking Lexapro for about 3 weeks when I stupidly decided to indulge in some Tramadol. I only took 150mg (i usually take about 200-250).",
  "The high was one of the best ones I've ever had, but that's not my point. The problem came the next evening, when I woke up in the middle of the night feeling really, REALLY, REALLY sick. I started shivering and in 3 seconds my ENTIRE BODY sweat so fast that I became completely soaked. I had diarrhea and threw up at the same time. I screamed for help and told my husband I was going to die. It is hard to describe how horrid of and experience that was. If you know what a bad trip on ecstasy is, (Ive had one), multiply it by 100 and you have an idea of what I'm talking about.",
  "I survived. The next day I did some research online on Tramadol interaction with SSRI and found out I had Serotonin Syndrome, an excess of serotonin in the brain that can be FATAL, so I DID almost die that night."
 ],
 "erowid": {
  "id": "34829",
  "citation": " sick girl. \"Serotonin Syndrome: experience with Tramadol & Escitalopram (Lexapro) (ID 34829)\". Erowid.org. Aug 19, 2004. erowid.org/exp/34829",
  "substance": "Tramadol & Escitalopram (Lexapro)",
  "views": "49305"
 }
}
