{
 "id": 1561,
 "title": "the time that always happens",
 "date": {
  "submission": "2002-08-14T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "sysyphus",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "<p>I spent almost the entire day painting.  This is something I find extremely important in my life.  It defines me, it makes me who I am.  When I was not painting, I was in meditation.  I was playing in my head, feeling my body release and bend, seeing images appear beyond the undersides of my eyes and form as I believe in them more.  Although most of my days are like this, today was different and special because I was preparing to dive into an experience that I can only describe as the most holy, meaningful thing I have ever experienced.  I wanted this experience to be light, not extreme, but just enough to show me reality and the inner workings of myself.",
  "The time was three o'clock and I was preparing the salvia for its journey through my body.  I prepared the pipe, densely packed to the top, with ground up bits and pieces.  I had only once undergone the full experience with salvia, but I have also experienced the full scale of lower effects as well.  I always know that Im well aware of what Im about to get into, but I also always know that it is impossible to be aware of a feeling that is completely unexplainable.",
  "Three Fifteen and I was sitting on my floor, listening to David Arkenstone, repositioning myself, stretching, breathing, trying to find myself, trying to prepare myself for what was to come.  I was waiting to be ready, for my mind to allow me to ignite and inhale this experience.  But I felt like I was still waiting for something.  I wanted the perfect moment, of complete relaxation and channeling of the positive, I wanted to be able to have the exact time right before I embarked.",
  "Three Thirty, I found the position in my room, the one I felt was most comforting and peaceful.  The music was now as I wanted, the room exactly as good as it could be, my mind as pure as it was going to be, my body comfortable and relaxed.  As the flame lit, I almost felt sorry for the plant, playfully, and understood its sacrifice for me.  I took as much as I could, held it in, exhaled and finished the rest, hoping I didnt take so much that I would be throw into infinity and intertwining unbelievably.",
  "I believed I knew that it was more than I wanted.  It was there, it was coming back for me, I could feel it all around me, getting more and more intense.  I reach the ultimate point of the trip before I was to leave my body and enter the ultraverse.  This is where it left me.  The thoughts inside my head were as profound, if not more profound then the ones I had experienced before.  This time was extremely similar to the last, incredibly hallucinogenic, being able to feel everything around me as something that was myself, and everything else, all at once.  The bodily sensation of what I can only describe as being flipped repetitively in the same direction, always returning to the first millisecond of the flip and stopping after the second, was all about me.  The music playing, which was now inside my head had become me, and was perfect for the occasion.  Its entire creation was intended for this moment I was having.  And it is the only music that ever plays, that day that I experience salvia.",
  "I was connected to the one above me, the giant whole of what this life means.  I could span my entire existence in the time that I was in now.  I could sense my future, I could feel my past, I knew my immediate future, I knew my immediate past.  I could understand so much about the inner workings of my thoughts and memories. ",
  "I felt like I was someone.",
  "I felt like I was ready to create and explore this world, and show people what I know.  But there was so much more.  I felt like I could explain everything about myself, why I paint what I paint and why I draw what I draw and why I do what I do, it all made sense, the whole world was intricately connected to me.  It was like it all revolved around me and the energy inside my head, my drive to create.",
  "I felt extreme fear, extreme unknowing of the substance that I had taken, like it was the key to something so powerful and overwhelming, and I was able to see it and the fact that I was witnessing it made my life make so much more sense, and I understood even more of what I had to do within my life.  Feelings of never using the substance again were on top of me, I felt like it was a key to something that was to assist me, and I was to never take it again.  I felt my death in it, I felt as if my death was part of the whole experience, followed by rebirth of pure thought.  I felt like my life was ending, and there was no time left.",
  "I felt too many things",
  "Looking back on this present state of my mind, I believe what I was missing inside myself was love.   I feel incredibly isolated, distant from everyone.  This brought on feelings of disconnection and need for contact.  The thoughts that I knew I was going to have came, and I planned on my contact with other beings of my planet.  I began yelling, unable to hold back the traveling span of unbelievably thought, blazing through my brain, emptying out.  I could see the thoughts forming inside my head from ultimate points and traveling downwards as they were being created, different thoughts latching on to those, and being organized and store in the most efficient way.  I began to write down everything that I had thought, and that I was feeling.  My head was pure, I knew what was right, was life was, how to live it and how to view other living beings.  At this point I began to see godly LSD like patterns beyond, but on top of what was directly in front of me, like I was floating in front of an ever-psychedelic background in another body, as well and being here on earth.",
  "I scribbled out all my emotions and feelings, most of it at first was just loops and edges, unreadable later on, because I could not empty my ideas out fast enough.  I experienced incredible nostalgia to my earlier, more extreme experience.  I felt the same connection to the same person, and it reassured the truth of all things.",
  "I felt like my current mind state was madness, but I knew I was going to return, I knew that it was okay, and I knew that I would soon be off at college, pursuing my artistic abilities.",
  "Looking at my works posted on my wall I felt like what I had accomplished was impossible, like I could not have done it, and somehow, something so far up was who I was, and I was channeling incredible thoughts and imagery through this greater being, that I in another plane of existence, was.  I suddenly had the urge to create, that I needed to do something in ink, to the best of my ability, in simple of honor of being able to do anything at all, and in honor of exploiting the power and gift that I have to create.",
  "It began, I felt unsteady, but this I ignored, because it would only be righted as I moved my pen across blank space.  It all came out as it always comes out at this moment of my life, since I was at the time that I smoked salvia.  I felt like this was the millionth time my life was being played.  I knew I could not make an error, I knew that whatever error I did make, it would only be fixed and it would eventually turn into exactly what it would be, and always was.  Each time I felt like it could have been completed, I looked at it as if I had seen it complete before, feeling for what was missing, or what could be added to it.  I continued, with a few pauses of jotting down thought and mind travel, but eventually finished.",
  "The time was six oclock.  In a flash, this moment in my life had passed.  I felt refreshed and more clear headed than I could possible be.  I felt incredible, alive and breathing.</p>"
 ],
 "erowid": {
  "id": "14915",
  "citation": " sysyphus. \"the time that always happens: experience with Salvia divinorum (ID 14915)\". Erowid.org. Aug 14, 2002. erowid.org/exp/14915",
  "substance": "Salvia divinorum",
  "views": "10939"
 }
}
