{
 "id": 15614,
 "title": "In a Pub",
 "date": {
  "submission": "2005-08-25T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Dan Himself",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:00",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:50",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>It was last Friday and I had been working all week and was a little bit poor due to money being owed etc. and I wanted to get wasted.",
  "Arrived at my local pub about 7pm and bumped into some pals who were outside in the pub garden enjoying a few joints. I got a beer and sat with them and joined in on the smoke. I managed to pick up an eighth of hash and and began to roll. One of my friends had been on E's for the past hour or two and was obviously 'coming up' at this point. He had two bags of mushrooms too which I was delighted to see! We began chatting and he told me to help myself to the shrooms, which I did. I didn't want to take too much as they werent mine so I ate about three of the shrooms there and then at about 7.20pm and washed the taste down with my beer. My girlfriend turned up at the pub shortly afterwards and I just sat and relaxed.",
  "About half an hour later (7.55pm) I began to feel the shrooms and it was very pleasant. I had a rather warm feeling in me and I was just happy to be with friends and loved ones. Shortly afterwards I began to just drift off away from conversation and just daydream. I became easily distracted by a red car parked in the car park. The car kept moving ever so slightly in the corner of my eye but when I looked at it, it wasn't moving. This was fun to watch! I remember pointing out to my friend about the car but he hadn't been shrooming so he didn't get it.",
  "About 8.15pm me and my E-head friend went inside the pub to get another beer. We then went to the toilet along with a friend of his and we finished off the bag of shrooms in the toilet. I took about four or five more and again washed them down with a beer.  Twenty minutes later is when the real fun began! I decided to sit in the pub for a while for two reasons. 1. There was a band setting up and I wanted to listen and 2. The muscles in my legs became very weak and I had no choice but to sit and rest for a while anyway. I began chatting to the guy who joined us in the toilet for the shrooms and he too was coming up on them. I asked how he was feeling and I told him I felt great. I realised at this point that I had left my girlfriend outside in the garden for sometime now so I dragged my legs back outside to my girlfriend and friends again.",
  "I rolled a joint and it was a pleasure to smoke. I began to see little flashing stars in my eyes and everything I looked at had these little flashes in my vision. At about 9.00pm I started to go through fits of laughter which only me and my E-head friend were getting because no one else was shrooming which was a bit of a disappointment. This went on and off for about ten minutes before I realised I must of looked stupid to everyone else.",
  "9.30pm and my girlfriend and I along with with three other friends went back to her house. I didnt think I would be able to walk because my legs felt so tired but thankfully it wasn't much of a walk. On the way home people were talking to me but I really didn't care what they were saying, all I wanted to do was just stare at the trees because they were amazing! The branches in the wind were waving at me like they were all my friends. I wanted to go shake a branch like it was a hand. I became very confused too, simple things like where we were going, I kept forgeting but at the same time, I was loving it!",
  "10.00pm and we got back to my girlfriends house and I rolled another joint but found it very hard to roll. I sat down which I really needed to do and began drinking more alcohol and smoke some more. Ten minutes later and I went to go for a piss. I was so lazy that I did a piss like a woman and sat down. After pissing I was still sitting on the toilet seat just staring at the ceiling which looked like it began to melt. It was really intense but great at the same time. The walls were ever so slightly forming a swurling pattern.",
  "10.17pm and I realised I had been in the toilet for too long now so got up and spoke to my friends in the other room. I went through a bad paranoid stage at this point. My three friends were really stoned and just silent and I thought it was me they were being silent with so I reassured myself but asking them all if they were cool with me which they were. I wanted to make sure everyone was happy just like me.",
  "10.30pm and I realised I was very forgetful and stupid. I kept on forgetting where I had left my hash and phone and drink and ran around the house gathering all my things together. I really felt fucked now at this point, my whole body felt real heavy and I was thankful I wasn't out anymore at the pub. The flashy stars in my eyes I mentioned earlier were really strong now. Everything I looked at, I had these white and blue flashes in my vision. I really began to see things in the corner of my eyes now too. Everytime I smoked it didn't get me stoned anymore either, just seemed to help the mushrooms become slightly more intense.",
  "At about 11.30pm I realised that the shrooms were wearing off and I had a craving for more but there wasn't any so I just accepted this and cuddled up to my girlfriend in front of the TV and smoked some more. I didn't trip out in an extreme way just flashes and things in the corner of my eyes. Although the bathroom was cool when I was pissing because the walls melting and so on.",
  "All in all, a great night which I hope to do again this Friday only I want to do more this time. I have also realised that mushrooms are now my favourite drug. I have done MDMA, coke, acid, speed and use canabis often but nothing is as great as shrooms in my opinion. And as an added bonus, no come down! Throughout the evening/night I never felt sick or bad at any point and the same the next day.</p>"
 ],
 "erowid": {
  "id": "34912",
  "citation": " Dan Himself. \"In a Pub: experience with Mushrooms, Cannabis & Alcohol (ID 34912)\". Erowid.org. Aug 25, 2005. erowid.org/exp/34912",
  "substance": "Mushrooms, Cannabis & Alcohol",
  "views": "3402"
 }
}
