{
 "title": "Talking to Pigs while Tripping",
 "author": "Tetrapsilolysergic",
 "citation": " Tetrapsilolysergic. \"Talking to Pigs while Tripping: experience with Police (ID 15610)\". Erowid.org. Jun 30, 2006. erowid.org/exp/15610",
 "substance": "Police",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I've dropped LSD a number of times, under a few different circumstances.  From what I hear, the acid that I have always taken has been fairly mild.  However, this 'mildness' means nothing to me, because it sure as hell does its job.</p><p>One day, me and six friends decided to get together on acid, smoke some weed, and hang out.  My friend L's mom's house was empty and for sale, so we decided to take advantage of its vacancy and use it as a place to hang out while we tripped and smoked.  Just above this house was L's grandparents' house, which also happened to be vacant and empty.  So myself, L, J, K, G, T and C all met at L's mom's place one evening.  We were all on acid, some more than others, (myself and T on the highest doses) and ready for fun. </p><p>We hung out at L's moms place for a while, taking a little journey onto the roof to look at the view, and smoking weed on the porch.  My acid was just starting to kick in as we decided to move on up to L's grandparents' place.  L didn't have a key to get inside his mom's, but there was one for his grandparents' house! It was getting dark by now.  Two of us had cars, T and K.  T moved his car up to the grandparents' driveway, and K left his at the mom's place.  We were all inside for only about 5 minutes, when the shit hit the fan.</p><p>Technically, none of us were supposed to be there. Not even L. His grandparents' didn't know he knew where the key was, and he didn't have permission to be inside.  On top of this, according to L, his grandparents tended to do some crazy shit sometimes.  K brought his guitar with him, so he could jam inside.  A few of us gathered to the deck where we could continue to smoke some bowls.  K and G were in the basement playing guitar, and I went to get them so they could come and get higher.  On my way back up the stairs, I got the fright of my life. </p><p>L came charging at me, yelling that somebody was there!  He took off down the stairs and I followed him, scared shitless. We turned out the lights and it was pitch black.  Everyone made it into the basement, and for the next few minutes, there was complete confusion.  Seven kids tripping on LSD were running around the dark basement of a house that didn't belong to any of them, and from what I heard, two cars had just pulled in the driveway! </p><p>All of a sudden, flashlights began to shine into the basement.  We didn't know the house well, and remember, it's pitch black.  All of us were dodging the flashlight, shitting our pants at the same time.  The idea of the possibility of it being cops was in all of our heads I'm sure, but being on LSD wasn't really helping the situation much. L mentioned that it could be his grandpa shining the light in, (remember, the old man has the potential to do 'crazy shit'), and we were still all freaking out.  We managed to gather into one of the empty bedrooms, all of us lining up against two of the walls.  This was when the flashlights shined right on K and G, and the fact that we were busted was just kicking in. </p><p>We were thinking up excuses in the dark, even though we still weren't sure who the hell was there, and why.  It was about this time when the doorbell rang, and L went up to confront whoever it was. A few moments later I could hear that it was a cop...oooh boy.  A few of us had weed and at least one of us was still possessing acid.  I had a joint in my wallet, which I stashed somewhere for a minute or two while L was still upstairs talking to the cop.  The piggie sounded confused, I could hear him asking something about why there was a car down at the other house (L's mom's).  L came downstairs, we were all aimlessly sitting or wandering around, and said it was time for us to go up. </p><p>I thought we were screwed.  I picked up my wallet, joint still inside, and put it back in my pocket.  We all went upstairs, and outside to face the consequences.  I was fucked up.  My heart was pounding like a motherfucker and I was tripping pretty damn good the whole time.  We all somehow managed to keep our composure though. </p><p>All seven of us were outside.  Another cop car pulled up with two more piggies inside.  L explained that we were there to listen to a couple of them play guitar, and that he didn't think anything was really wrong.  He explained who owned both houses, and that they were vacant.  Fortunately for all of us, the cops just asked a few questions, checked T's license, and took it for a misunderstanding.</p><p>Holy shit, we coulda been so busted.  One false move or wrong answer to a question coulda been the end of us all, or at least some of us.  Apparently, a neighbor called the cops when they saw us on the roof of L's moms house or something. </p><p>Crazy shit. But now we were leaving, and T had to drive on 2 hits! K also had to drive away from the situation. T spent some of the time driving with cops on all sides of him, but we sure as hell got away with it.  I was riding shotgun at this points, fighting my bowels.</p><p>It was some fucked up shit when it happened.  I'll never forget that.  None of us will.  We were actually joking around with the cops in the end, making friends with them almost!  Shit, if they only knew.  As we drove around the rest of the night we saw a bunch more cops.  One pig shot by us as though it was chasing someone (scary shit), we saw one parked in our school parking lot as we all drove right by it, and another one had pulled over a speeder.  As we passed that cop, it looked to a few of us as though he was coming to get us, but that was probably the acid talking.  It was a scary experience, but a memorable one.  And we got away with it.  Oh yes.</p>",
 "year": "2002",
 "id": "15610",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-30T07:00:00.000Z",
 "views": "6832"
}
