{
 "id": 15629,
 "title": "Definitely an Adventure",
 "date": {
  "submission": "2007-12-14T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MayheM",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "A short time ago I was at a point in my life where I felt I needed some kind of adventure. You know, an epic quest sort of thing. Well, I came up with a plan:",
  "1: Ask two friends (who were experienced psychonauts) to assist me.",
  "2: Purchase and consume 3.5 grams of psylocibin mushrooms.",
  "3: Consume a shitload of vitamin C",
  "4: Have my assistants steer the trip into some kind of adventurous quest.",
  "Now, as the plan evolved and grew into the final product, it was decided that we would go up Montezuma (I live in dillon, in summit county if anyone is wondering) to an area that was known to be a 'ghost siting' area. Me and my two friends, A and K, had also experienced strange happenings up there, most of them experienced in a sober state of mind. So we felt that this would play in well with the adventure idea. So, I ate the mushrooms, drank about ten times the reccomended daily value of vitamin C, and we began the drive. As we approached our destination, I was already tripping quite nicely. The path we were taking had many strange trees and rock faces, and they all took on the look of a sort of underground crustacean structure. This, along with the fact that the headlights were changing colors, gave me the impression that this would be an amazing night.",
  "I was not dissapointed.",
  "We parked at the top of the area, put on Les Claypools Frog Brigade, and began taking bong rips. I began to consume sweet tarts, which became the most incredibly awesome cany ever made. At one point A handed me a roll of sweet tarts, which I quickly lost, along with my ciggarettes, a lighter, and a bag of weed. After crawling on the floor of the car for what I am told was only about 40 seconds, but seemed like at least ten minutes, I found the lighter, the weed, and the sweet tarts, all of which I gave to K for safekeeping. And this is where the wierd stuff begins. I was unaware of this at the time, but apparently A was a little freaked out about something he'd seen coming up the road, and while at first I thought that this was just them trying to create some sort of adventure, he eventually made it very clear that he was truly, honestly freaked out, and serious. I was the only tripping person in the car, and it made me a little uneasy to find that A was frightened.",
  "At this time I felt the need to take a piss, so I looked over at my car door and noticed that the car had grown to mammoth proportions. I was sitting in the right rear passenger seat, and seeing this gave me a strange agorophobic feeling. No matter. I stretched my arm out that incredible distance, and opened the door. I looked out to make sure I'd know where to step when I exited the car, and, being rather sure of my ability not to fall on my ass, I took a step. Just as I began to step out of the car, the car shrank to it's original size, but elevated itself another six feet off the ground. I fell flat onto the dirt, face first.",
  "I got up, and made the necessary preperations to piss, and as I began relieving myself I noticed that I could not see farther than five inches in front of my face. My entire vision was filled with what seemed to be a puzzle, made from strange, ameobalike colorwheels. For some reason I found this incredibly funny, so I began to laugh and stumble a bit. I finished up, zipped up, and realized that I had no chance in hell of finding my way back to the car, even if it was only ten feet away. I turned around a few times until I saw a light through the ameoba puzzle. I stumbled towards it, still laughing, and ran face first into A's window.",
  "The light in the car was on, and when I smashed against A's window, he flipped out. I got back into the car. More bong rips. Then we turn to leave. As we are about to leave, K shuts the engine off and he and A wait silently. I ask what's wrong. K and A saw somehing move in front of the car. Not fucking around, they actually saw it. I was freaked out. Suddenly the overhead light bulb in the car blew out. I looked up at K and he turned and looked at me. As he did so his face morphed into a shadowy combination of the grim reaper and a traditional demon. I became, not really frightened, but rather angry that this entity had attempted to invade K's car. I pulled my leg back and yelled 'I'm gonna kick your face in, mother fucker!' repeatedly, for what seemed like hours.",
  "K eventually fixed the lights, turned on the engine, and began to drive at a very fast speed away from the area. Or rather, he drove at a normal speed, but I percieved it as being very fast. Despite A and K actually having their own little adventure, they decided that I was deep enough into the experience for them to start the adventure sculpting. From this point forward, all things are described as what I percieved, not what actually happened. As we sped through this crustacean hell I got the distinct impression that we were fleeing from something. I then got the impression that the entire area was a part of that one entity. Various pieces of the walls and various creatures in the cave seemed to attempt to attack the car. I asked K if he knew where he was going. He replied 'Yes, look, theres a gaurdrail'. I looked up to see what could have been a gaurdrail. I felt slightly calmer.",
  "Then K screamed 'We're gonna go over the edge!'. He was just trying to fuck with me, but it worked. Suddenly any floor surface dropped out from in front of us, and we flew over the edge. As we fell into what seemed to be a never ending pit, K and A laughed and handed me the bong. Suddenly I realized we were on the road back to K's house. We reached K's house, and with a lot of struggle I found my way into his basement (I had to crawl most of the way).",
  "As I found myself analyzing the various trippy artwork he had on the walls, I remembered the pack of ciggarettes I had lost earlier. I went outside and proceeded to walk back to the car to try to find them. I looked around for a while, found nothing, and turned to go back inside. I then looked down at his gravel driveway, which had become a bubbling liquid, the consistancy of lava, with each individual piece of gravel bubbling up and popping. I laughed at this, and suddenly, I felt a rush go through me. It is incredibly difficult to describe, I felt as though I were incased in ice, but the ice was part of me. I could feel anything that touched the outside of the ice, and I was being whipped through space at about a million miles a second. Keep in mind, this was just a feeling.",
  "I walked back inside, sat on the couch, and began to scare the living shit out of A and K. I began to scream rantings that a madman would scream. I only remember bits and pieces, with excerpts like 'I am god and my world is collapsing' and 'You fucking meat bags and your egomaniacal bullshit!'. At some point I fell asleep. I don't remember that.",
  "This was, all in all, although frightening at points, the most rewarding and incredible trip I've ever had. I WILL be trying this again soon."
 ],
 "erowid": {
  "id": "34972",
  "citation": " MayheM. \"Definitely an Adventure: experience with Mushrooms & Cannabis (ID 34972)\". Erowid.org. Dec 14, 2007. erowid.org/exp/34972",
  "substance": "Mushrooms & Cannabis",
  "views": "2295"
 }
}
