{
 "id": 15622,
 "title": "Pleasantly Psychedelic",
 "date": {
  "submission": "2007-06-10T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Darkstar",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(extract)"
  }
 ],
 "report": [
  "First of all, I'd like to share what I believe to be the easiest, and cheapest way of preparing these glorious little goodies. First, take the seeds you plan to ingest, then rub them between a folded sheet of rough sandpaper. This should be done until the seed is light tan in color, and smooth. A few darker spots may remain; that's OK. Next, put the seeds into a high quality pepper mill - the kind that will grind pepper into a fine powder. Grind the seeds over clean, dark colored paper. Then, gently fold the paper in half, collecting the seed powder in the crease. Now, pour the powder into a cone-shaped coffee filter, fold it from the bottom up a couple times, and then cut off the excess filter paper. For the last step, put the filter containing the seeds into a small glass, pour in some spring water, and let it sit for at least 1/2 hour.",
  "When youre ready to ingest this wonderful brew, pull the filter out, squeeze it to get the last remaining goodness out, then down the potion. The taste is not bad at all - no worse than green tea I've had at some Chinese food joints! I've used this method on many occasions and have NEVER gotten the slightest bit ill. My friend ingested six seeds via the 'crush, soak, eat, drink' method, and felt sick to his stomach. I used the method above the next day with six seeds and felt GREAT!",
  "Regarding the effects of these seeds, I'd have to say that they are extremely pleasant. I've taken LSD hundreds of times, and LSA is experientially similar. The salient differences between the LSD experience and the LSA experience are the following:",
  "1. LSA peaks later in the trip.",
  "2. LSA does not give me the tight - almost nervous - feeling that I experience with LSD. Indeed, the effects of LSA are more like alcohol; somewhat sedative and very pleasant.",
  "3. Visuals are nowhere NEAR as intense with LSA as they are with LSD. Generally, with a medium dose, I will notice trails, the 'fan-effect' of light, and slight patterns. Everything will seem bright and colorful, but not overly so.",
  "4. LSA puts me in a contemplative state of mind, and allows me to focus 'in between' my thoughts, where the real Jewels of Consciousness reside. Conversely, with LSD, my mind is cooking along at light speed (not always a bad thing!).",
  "Overall, I'd have to say that LSA is a wonderful substance, The best way to describe the experience is 'pleasantly psychedelic'. If I am looking for an 'ego death, mind blowing, life on the head of a pin and exploding into billions of fragments' experience, than the best choice is LSD, in my opinion. However, if I want to dip my feet into the psychedelic stream, but still remain tethered to Earth enough to carry on a conversation, I'd go for LSA in the form of Hawaiian Baby Woodrose seeds."
 ],
 "erowid": {
  "id": "34948",
  "citation": " Darkstar. \"Pleasantly Psychedelic: experience with H B Woodrose (ID 34948)\". Erowid.org. Jun 10, 2007. erowid.org/exp/34948",
  "substance": "H B Woodrose",
  "views": "18016"
 }
}
