{
 "id": 15626,
 "title": "PCP and Crystal Meth = bad idea",
 "date": {
  "submission": "2000-10-29T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Suedehead",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "PCP"
  },
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Methamphetamine"
  }
 ],
 "report": [
  "I am well experienced with strong drugs.  I can handle taking 10 hits of acid without ever getting paranoid.  I've taken acid and dxm, which is the most intense mix of drugs ever.  So naturally I wanted to try PCP and see what all the fuss was about. ",
  "I didn't intend to mix it with meth earlier, but the guy with the PCP was tweaking and he said it was safe and he mixed it lots of times so I shrugged and smoked one fat rip of crystal meth.  An hour later I smoked a joint with a line of PCP in it.  This is mixing the strongest tranquilizer with the strongest amphetamine.  I was worried after the first hit that it wouldn't get me very fucked up, but by the time the joint was finished, there was no way in hell that I could stand up.  I could kind of stumble if I used all my strength, but I was way beyond walking.  I was just kind of so jacked that I didn't hardly know what was going on.  I could barely stay conscious.  The guy who brought the stuff over was sitting up and talkative, but I could barely move.  Later I crawled into the other room and took one more hit of crystal meth thinking it would wake me up.  After the hit, I laid back on a bed and damn near passed out.  I was so faded that I was in a dreamlike state even though I was awake.  Later I remember taking a gravity bong rip with PCP.  I spent the rest of the night laid out on a couch unable to move or see straight.  It felt like I would imagine a 12 ounce dxm trip would be.  After 5 hours, the guy who sold us the PCP said he came down off it and felt sober.  He's some crazy hardcore tweaker.  When he said he was down, I still couldn't even walk. ",
  "The next day I smoked a bowl and felt like I was full on tripping on PCP again.  It instantly made me so tore up that I could pass out.  I felt intoxicated for a few days straight.  A lot of that was probably due to smoking the meth with it.  That was my only experience with PCP.  If I were ever to do it again, I would make sure I have a good 3 or 4 days to recover from it.  Seriously, if I smoked it on a Friday night, I don't know if I would be recovered by Monday.  I don't know if it was just that bomb or if it was the meth that made it so crazy.  I've heard of people going crazy on meth but I couldn't even stand up, let alone get violent even if I'd wanted to.  I'm no lightweight either.  I can take 10 strips of acid casually."
 ],
 "erowid": {
  "id": "3496",
  "citation": " Suedehead. \"PCP and Crystal Meth = bad idea: experience with PCP & Crystal Meth (ID 3496)\". Erowid.org. Oct 29, 2000. erowid.org/exp/3496",
  "substance": "PCP & Crystal Meth",
  "views": "107487"
 }
}
