{
 "id": 15641,
 "title": "It's Good, Maybe Too Good",
 "date": {
  "submission": "2007-03-19T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "CP",
  "gender": "Male",
  "weight": "245 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:15",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 3:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>I had just gotten back from visiting my dad who is dying of prostate cancer.  It wasn't much of an enjoyable visit at all, and pretty much just consisted of my cleaning his filthy house while he lay on his chair in a drugged and motionless state.  See, the doc's got him on percocet because he hurts so much he can't even move.  Anyway, so, my dad's wasted, and it's really depressing.",
  "Since I've been interested in mindstate-altering substances lately, I figured I'd gank a few of my dad's painkillers for use later when I got home.  I put 4 of them in my pocket - they each contained 5 mg of oxycodone and, like 325mg of acetominophen.  From what I later read here on the site, percocet is not exactly the best way to get your oxycodone, since it's got all that acetominophen, but whatever, it'll work for my purposes.",
  "At home, that night, comforted by the glow of my computer screen (sadly, it's the only friend I know since I moved from my hometown), and hoping that maybe these painkillers could help me to forget the depressing events of earlier in the day, I prepared myself for dosage. 20mg seemed like a safe dose, and since I'm a pretty big guy anyway, I figured I'd be fine.  Just to be even safer, I decided to only take 10mg at first.  This being my first time taking painkillers I was really scared and almost didn't do it, but I chased the fear away and just swallowed two of the pills. ",
  "I chilled out typing to friends on AIM, and playing some guitar.  I just tried to relax, and go about the night as I usually would. ",
  "About 30 minutes later, I started feeling a slight buzz.  For some reason, I wasn't scared at all anymore, and I somehow knew that I was going to be ok, and that this was going to be an enjoyable experience.  My guitar playing soon turned to shit, however, and my sense of musical pitch was thrown way off.  ha ha, I just put the guitar down, and stood up.  THAT's when I first felt it strongest. ",
  "After about 45 minutes, I figured I wasn't going to get any more buzzed than I presently was, so I took the other two pills.  My dosage was up to 20mg now.  I don't remember getting any more buzzed, I just remember the good, floaty, light (some say they feel heavy, but I swear, I felt light as a feather) feeling staying steady and lasting longer than I thought it would.  And that whole bit about the itching, VERY TRUE.  I itched all over, but strangely enough, it wasn't annoying, and it felt really good to scratch it.",
  "Then I made a bit of a mistake.  I thought I felt the effects of the drug wearing off after about 3 hours, so I thought I would try a beer to boost it.  My previous knowlege of mixing alcohol and painkillers being a bad idea totally didn't matter at this point, and I'm glad I only took ONE beer.  That one beer was enough to make it so I had to literally fight myself to keep my eyes open.  I noticed this strange effect with the lights too:  I would see quick flashes, like I had a bad fluorescent bulb, or something.  Things would get suddenly bright and then dark again.  I don't know if these were actual visual distortions, or my eyes being heavy and then opening suddenly, and then drooping again.  I was so out of it by then I wouldn't know the difference.  Also I started seeing things.  I kept thinking I saw bats out of the corner of my eyes or something.  Just paranoia, I think.",
  "Overall though, it was very relaxing, very pleasant, and I didn't want it to end.  I didn't have a care in the world, and it was honestly the first time in years that I didn't feel the least bit stressed out and run ragged.",
  "I wouldn't drink alcohol with them again, and shouldn't have in the first place.  In fact, I wouldn't take these pills again for a very long time.  I could see myself getting hooked, and the last thing I need right now is a drug addiction!</p>"
 ],
 "erowid": {
  "id": "35003",
  "citation": " CP. \"It's Good, Maybe Too Good: experience with Oxycodone & Alcohol - Beer (ID 35003)\". Erowid.org. Mar 19, 2007. erowid.org/exp/35003",
  "substance": "Oxycodone & Alcohol - Beer",
  "views": "97167"
 }
}
