{
 "id": 15644,
 "title": "Pleasant",
 "date": {
  "submission": "2007-06-05T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Joh",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 tsp",
   "administration": "oral",
   "substance": "Ginger",
   "form": "(tea)"
  }
 ],
 "report": [
  "Hello, I have never experimented with ginger before. I just found some ground ginger from my kitchen and remembered that it was mentioned online. I searched about it, read all the experiences and decided to make some tea. I'm very tired at the moment, I've been awake the whole night.",
  "9:18 - The water is warming up and 1 & 1/2 teaspoonfuls of ground ginger is waiting in a cup.",
  "9:22 - Okay, the water reached 100C. I poured the water in the cup, stirred it and now I'm gonna let it steep for 5-10 minutes (stirring continuously).",
  "9:30 - Here we are. The tea is coloured grayish-brown, like sand. The smell is kinda weird.",
  "9:31 - It's VERY bitter. Ouch! And it's also hot, it like burned my throath. Going to kitchen. Maybe I can find something to mask the taste.",
  "9:35 - Added 4 teaspoonfuls of sugar and took a cup of milk. It's still so damn bitter. It's alright with milk - I'll now drink it as fast as possible.",
  "9:40 - Ah, done. It wasn't pleasant. It took like 3 cups of milk per one cup of tea.",
  "9:44 - I'm already feeling it's stimulative effects - at least I think so :) I put on some quiet trance music.",
  "9:48 - I feel a slight discomfort in my stomach but also feeling very relaxed. Mentally and physically. Mild headrush.",
  "9:53 - I feel mildly euphoric and full of energy I just don't feel need to use ;) Very relaxed.",
  "10:00 - The effects are almost totally wore off.",
  "Overall, it was a positive experience. There are only two negative sides - the effects wear off quickly and it's awfully bitter taste."
 ],
 "erowid": {
  "id": "35010",
  "citation": " Joh. \"Pleasant: experience with Ginger (ID 35010)\". Erowid.org. Jun 5, 2007. erowid.org/exp/35010",
  "substance": "Ginger",
  "views": "30291"
 }
}
