{
 "id": 15649,
 "title": "Slapped in the Face with a Splash",
 "date": {
  "submission": "2007-12-14T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FYrE",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Last night I got a good 4-5 grams of new weed. It had little blonde hairs, but they were nothing special, they were short and generic. Amazingly, this was the most stunning weed experience I'd ever had. I took 5 long hits out of a water bong a friend made for me. I wasn't expecting anything new -- but boy did I get a surprise. My memory went extremely bad during this experience, so I might leave out a lot.",
  "First of all, I noticed all the regular feelings: smiling, giggles, confusion, and as usual I couldn't remember where I put my bag of weed and my lighter. Once I found them, I went inside to use my computer, but walking around in my house seemed uncomfortable because it reminded me too much of being sober. Because of that, we decided to go for a walk outside on a bikepath. I brought along 2 cherry cigars for all of us so we could have a good time. At this point people's voices had already begun to get messed up, I was having the whole tin-can effect. Anyway, we proceeded with walking along the pathway, and about 1/2 of the way down this bike-path, everything got slightly blurry and a little harder to focus on. We stopped to rest at a large tree by the ditch, and I noticed a repeating pattern in front of my eyes, like a sheet of this pattern was layed over my field of vision. To put it simple, it was like looking at something thats 99% transparent, so I could barely make this pattern out. At this point I assumed we had some extremely good weed.",
  "Anyway, my 2 friends told me to close my eyes. I had heard of people seeing 'closed eye visuals' on shrooms, so I thought 'why not?' So I closed my eyes. For the first 5 seconds I saw nothing, but then I saw little rainbow zig-zags, 4 of them, then 8, then they shot out in every direction making a geometric pattern, then they filled my vision and disappeared. Next came squares made out of rainbow, and they did the same thing. I was getting sick of things made out of rainbow color patterns so I tried to make something else appear, and startlingly, I could visualize anything I wanted to like it was right in front of me, though I could still tell it wasn't real.",
  "Next I thought of icebergs, and they doubled everywhere and waved up and down then zoomed away. So we kept walking along the path, and at this point I think im qualified to say that I was tripping. The more I closed my eyes, the more vivid the hallucinations were. If I wasn't trying to see what I was thinking, my mind would usually generate some pattern that you might see on a stone-tile floor, like a blue flower carved into a grey tile (this is the floor at my grandparent's house, but I still can't see the connection). It was like my mind designated a certain pattern to be repeated. I also learned that I could visualize whatever I wanted without it turning into a pattern, but it was more fun to visualize patterns so that's what I did.",
  "Probably the most stunning part of the whole trip was when I visualized a splash of water very small and far away from me, then suddenly it zoomed up and slapped me in the face. Basically the whole way home I had my eyes closed, and I was just pissing off my 2 friends who had both had less hits than me. I sat down for about 10 minutes and just 'watched' the amazing fireworks display. After that the visions were fading so I decided just to keep my eyes open. We went to burger king and got some food, then we went home and pretty much fell asleep.",
  "All in all, this was the best high I've ever had."
 ],
 "erowid": {
  "id": "35025",
  "citation": " FYrE. \"Slapped in the Face with a Splash: experience with Cannabis (ID 35025)\". Erowid.org. Dec 14, 2007. erowid.org/exp/35025",
  "substance": "Cannabis",
  "views": "2666"
 }
}
