{
 "id": 1565,
 "title": "A Brief Trip to Wrath's Domain",
 "date": {
  "submission": "2005-04-22T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SalviaSpence",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "5"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "Before I even begin, I would just like to say that I am EXTREMELY lucky that I am still alive after what happened two days ago. My mindset, the setting, and my babysitter were all substandard. Like many first-timers I highly underestimated the sheer power of this herb and its ability to completely skew its host's perception of reality.",
  "My friend Mike and I had been awaiting the arrival of some Salvia 10x that I ordered about a month ago. On tuesday when I came home from school I found said package in my mailbox and immediately called Mike. He walked over to my house and we broke out my makeshift bong that I had crafted out of a vase, a pen, a soda can, some chewing gum, and a lot of cling-wrap. We stuffed a big fat bowl of Salvia, using some tobacco for a plug, and went to my back porch, we decided that first he would babysit me, then I babysit him. After I drew my first hit, I immediately felt like I was being pulled downward into my chair. I felt somehow overwhelmed so I grabbed the bong and got to my sofa as soon as possible. I felt like one hit had been enough, but Mike insisted that I take a few more. I took two more small hits, cashed the bowl, then Mike proceeded to pour more in and have me take two more hits.",
  "As soon as I fell back into my couch there was this incredible sensation that I was sinking, I closed my eyes for a few seconds and saw the most amazing closed-eye visuals I've ever had. When I opened my eyes and looked across the room, everything that was previously there was no more, the room had become a sort of underground cavern. Everything was red and black and rust. There were these two conveyor belts coming out of the back wall, the one on the left wasn't moving, but the one on the right was rythmically pushing little toy steam-engines along it's course. About fifteen feet directly infront of me was a short red man, I knew instantly that He was the entity which Christians believe to be The Devil. His head was at least four times the size of the rest of his body and it was in the shape of an upside-down triangle with all of his facial features (which much resembled those of a fetus) at the bottom. He was mouthing something to me, I tried desperately to understand him, but all I heard were agonized groans and grunts, they seemed to be the verbalization of all of the anger and frustration ever felt in the history of the universe.",
  "I turned my head to the left to see if Mike was still there, he was. He had become a sort of demonic elf, in some twisted Santa's workshop, taking the little toy trains off the assembly line and putting them in white boxes (I am reminded that Satan and Santa are composed of the same letters). I had this deep-seeded inclination that I was in great danger, so I violently jumped up and started screaming at Mike. I grabbed the bong, went back out to the patio and smashed it against the wall. I then went inside where I continued to (like an enraged Tourettes patient) scream vulgar things. I then fell to my knees, rolled on my side and wept. When I was totally sobered up, I told Mike what happened and insisted that he have the Salvia because I never wanted to do it again.",
  "That was two days ago, and I have done it again twice since then. In reflection I think that while it was terribly frightening, perhaps the most horrible experience of my life, it was also perhaps the most wondeful thing that I have ever experienced. My last two trips haven't been quite so out of control, but I think the first one was most fruitful. I think what scared me so much about it at the time is that it was real. No, it didn't just SEEM real, it WAS real, and I know that to be true even today.",
  "What I realized that day is that every dimension that runs parallel to our own, is the epitome of an emotion. I happened to punch through the fragile fabric of space and into the dimension of anger, a place that I have labeled 'Wrath's Domain'. I've come to the realization in the last couple of days that the reason I was so angry when I came back to the world of sobriety is because I broght some of the energy back from Wrath's Domain. The dimension in which we currently live is the dimension of indifference, or perhaps confusion, I don't really know. And I realized that where we go when we die, is dependant on our emotional state in the moment of our death.",
  "During the duration of the trip Mike says that I mumbled a few things, the only thing he says he could really make out was 'Am I a part of this?'. He says I was only really out of it for about a minute, it feels like an hour.",
  "In retrospect, I believe that my first Salvia trip, while not a failure, could have been better had I prepared more. Perhaps some meditation, some incense, less daylight. If what you seek is self-discovery and enlightenment as to your place in the universe, I suggest trying Salvia. Just use a sitter, or a guide your first time and don't even begin to think that you can preemptively comprehend the amazing power of this drug.",
  "Be safe and smart so we can keep it legal, because I know that I for one plan on using Salvia for a long time. It has taught me more about the universe that anything else ever has. I know that the course of the rest of my life is now completely different than it was before I smoked salvia, and I am ever-thankful for that."
 ],
 "erowid": {
  "id": "14924",
  "citation": " SalviaSpence. \"A Brief Trip to Wrath's Domain: experience with Salvia divinorum (10x extract) (ID 14924)\". Erowid.org. Apr 22, 2005. erowid.org/exp/14924",
  "substance": "Salvia divinorum (10x extract)",
  "views": "4427"
 }
}
