{
 "id": 15655,
 "title": "Watching Over Us",
 "date": {
  "submission": "2007-11-09T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "eternal_frost",
  "gender": "Male",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "Recently I have become deeply interested in more psychedelic drugs, wanting to learn more about myself and the nature of our surroundings then just getting 'fucked up'.  Salvia Divinorum seemed like a good place to start. Very easy to acquire and short fast effects, no mind melting acid trips, at least yet ;).",
  "BEFORE",
  "After dinner I started getting into what I thought would be a good mindset for my upcoming experience.  I spent a hour listening to some music with theta and delta wave binural beats in them. This basically encourages the mind into levels of trance like states, on par with hypnotism or meditation ect. After this I was extremely relaxed and in touch.  surprisingly I had the phrase 'Let them show you, they know best' come to me during my meditation.  I tried to use that advise during my trip and it very much helped. ",
  "DURING",
  "It was a dark, cool night with lots of stars and softly chirping crickets, my house is out in the country. I packed my gravity bong very tight with 2 pretty large leaves.  Having heard that salvia smoke can lose potency quickly I filled the chamber and took the very large hits as quickly as I could.  Effects set in very quickly, before I am even done smoking, but subtly, didnt quite remember that I had actually taken any drug at first. The following is a portion of what I wrote down immediately after the experience.",
  "'First hit. Feeling body pulled strongly backwards. My whole surroundings are melting in that direction as I turn to look. Exhale, take another hit. Im in a crouded place. We are all rushing somewhere, getting ready for something. Going someplace important, someplace new.  Surrounded by woshing droning noise, it is saying something in some language but I dont know what.  Three pillars, they are living entities, I cant see their tops, they are the leaders of our croud. They are not pillars like on a building, but seem to be made by their surroudings. They are there but not made of anything, much like a flame. The voices are rushing because of them. They are the ones taking us wherever we are going. I dont visually see any of this but rather feel it, a sort of new sence, like a recent memory. I take the next hit. Then fumble and drop the bong.  I feel a change in the pillar entities, they are annoyed at my carelessness. I promise to return to their space to learn the lesson they were going to teach me. I am assured that I will be watched over by them until I return.'",
  "This all happened very quickly, only about 3 minutes real time, but seemed much longer to me. It is very hard to describe the experience and my quote dosent do a very good job.  This is because it happened in a whole different world, with a whole new set of rules for reality and how I perceive it. For example my whole conversation with the pillars involved no verbal speaking, I just 'felt' their words. One really must experience it for themselves.",
  "This was my third meeting with Salvia, but the first time I have 'broken through' or even had any effects at all.  I believe it was the use of a gravity bong, which greatly redused the tempurature of the smoke and allows me to take massive hits very quickly.",
  "AFTER",
  "There was a slight heightening of the sences lasting about 30 minutes after the primary effects had ended, especially in touch and hearing.  I suffer from insomnia and very rarely sleep through a whole night and never feel rested when I wake up. but that night I slept soundly till one o clock the next afternoon, with many vivid lucid dreams, a unexpected but very enjoyable side effect of this experience.  The next day I am extremely at peace with the world and in tune with everyone.",
  "CONCLUSION",
  "All in all it was a very plesant experience, not at all scary and overwhelming like some of the reports.  I think that not using extracts, especially on my first exposure to the plant, helps alot for this."
 ],
 "erowid": {
  "id": "35052",
  "citation": " eternal_frost. \"Watching Over Us: experience with Salvia divinorum (leaves) (ID 35052)\". Erowid.org. Nov 9, 2007. erowid.org/exp/35052",
  "substance": "Salvia divinorum (leaves)",
  "views": "2624"
 }
}
