{
 "id": 15665,
 "title": "Not Worth It at All",
 "date": {
  "submission": "2004-07-12T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DopamineHead",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "insufflated",
   "substance": "Pharms - Bupropion",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I recently read a report on erowid about someone snorting 150 mgs of welbutrin, so I decided to try it and write a journal of the experience.  I crushed up a 75mg tablet and snuffed it up each nostril a little at a time.",
  "T+0:00 My nose burns!  I felt some of it pass down into my lungs and I have a cough.  Wellbutrin makes everything numb, my nose, my cheeks, the roof of my mouth, but for some reason it still burns.  It 'smells' aweful.  Like some kind of rotten vegetable.  I feel giddy but I'm sure this is just psychological. ",
  "T+0:05 My nose feels dead, but still hurts.  This sucks.",
  "T+0:10 I think there is drip, but I cant tell because the back of my mouth is so numb.  Everything is weird.  I cant really describe how but my senses are altered.  The whole center of my face burns and it almost itches inside my nose.  It feels like I'm gonna sneeze every couple seconds, but I cant...",
  "t+0:20 Anxiety, horrible anxiety.  I feel like I'm shaking.  I might throw up.  This stuff tastes so aweful I might blow my nose.  My nose is still completely numb. ",
  "t+0:30 Mild my ass! I'm messed up.  Strong euphoria(maybe disphoria, it almost feels like both, good for one minute, bad the next) and a strong body high.  I'm curious to see if my pupils are dilated.  They arent.",
  "t+0:45 I finally had to blow my nose.  I've noticed visual distortions and I can feel music in my spine in an unpleasant way.  I'm no longer anxious but I'm still shaking.  The thought of seizures popped into my head briefly, and I almost took a dilantin, but decided against it.  I cant stop sneezing!  This isnt pleasant, but atleast my nose doesnt hurt.  I almost feel like I have the flu.",
  "t+1:00 Tracers.  Lots of tracers.  Phish improved the overall feel of the experience.  I'm really hot and I'm starting to sweat. Its completely diffrent than expected.  I'm fairly sure I'm still coming up. ",
  "t+1:30 Body effects have kinda worn off.  Mild hallucinations (the faces in the pictures on the wall are shifting and appear almost liquid, colors are much more pronounced) and aphrodisiac properties noticed.  Feeling a bit tired.  Not speedy at all.",
  "t+2:00 Effects have leveled off.  Its very neutral now.  Visual distortions still strong.  No anorexia, food actually tastes slightly enhanced.",
  "t+4:00 I'm going to bed.",
  "All in all the positive effects of insuffilated buproprion arent  worth the negative. This is nasty smelling stuff, and the taste is even worse.  I dont know if its buproprion or some kind of filler, but its horrible.  I'm definately not trying it again."
 ],
 "erowid": {
  "id": "35089",
  "citation": " DopamineHead. \"Not Worth It at All: experience with Bupropion (Wellbutrin) (ID 35089)\". Erowid.org. Jul 12, 2004. erowid.org/exp/35089",
  "substance": "Bupropion (Wellbutrin)",
  "views": "47340"
 }
}
