{
 "id": 15671,
 "title": "Unexpected Reaction",
 "date": {
  "submission": "2004-07-13T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "electricmayhem",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "24 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "While I have taken Ho-Dipt myself, I'm writing to submit the experience of a friend. I was present for her experience.",
  "Having recently purchased a nubmer of research chems, several of our peer group had taken Ho-Dipt before and had had an interesting experience with 24 to 30mg doses.  All those who tried the substance reported significant visuals and a strong similiarity to psilocybin, the active chemical present in many psychadelic mushrooms but without 'body load' of mushrooms.  All of our group that had tried it also reported a significant tension in their muscles, resulting in a constant clenching of muscles throughout the body.  While this feeling was disconcerting at first, it became more pleasant after some experience.",
  "The evening began smoothly enough.  Several of our group took a dose of 24mg of Ho-Dipt.  I myself had chosen to stay sober for the evening, which turned out to be a blessing.  About 30 minutes after taking the dose, one of our group, we'll call her Jane, began feeling violently ill.  After emptying her stomach,  Jane began to shake violently and lost conciousness.  For nearly a half an hour Jane's limbs would shake spasmodically and she would slip in an out of conciousness for very short periods of time, at which point her breathing would become almost undetectable.  Upon regaining conciousness, Jane was still largely unable to move, speak rationally, or even remember the names of people in the room with her.   ",
  "After half an hour, at the point of heading to an emergency room, Jane regained and was able to maintain conciousness.  Jane began speaking somewhat more coherently, though she was still relatively unable to move.  Jane herself explained that while she felt the need to talk and to move, she was unable to control her body.  As the evening progressed, Jane's limbs continued to shake, often painfully, though spasms lessened with time.  Throughout the experience Jane had difficulty remaining calm and experienced strong open eye visuals and later in the evening had difficulty staying concious due to exhaustion. ",
  "Effects finally subsided nearly seven hours after ingestion and Jane was able to think, move and speak normally.  While many of our peer group have taken and enjoyed HoDipt, we have disposed of the remaining quantity of the chemical for fear of similiar results in the future.  If you intend on trying this substance, I highly recommend starting with very light doses and working your way up as this chemical is very subjective and can react very, very strongly in certain individuals."
 ],
 "erowid": {
  "id": "35116",
  "citation": " electricmayhem. \"Unexpected Reaction: experience with 4-Ho-DiPT (ID 35116)\". Erowid.org. Jul 13, 2004. erowid.org/exp/35116",
  "substance": "4-Ho-DiPT",
  "views": "14636"
 }
}
