{
 "id": 15684,
 "title": "Seeing with Closed Eyes",
 "date": {
  "submission": "2007-12-14T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "T",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "450"
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Well it was around 9:30, and I was chilling at a friends house planning to try dimenhydrinate. I took a total of 450mg. Below are the events that unfolded.",
  "T: 9:35 pm -> Took 350mg (7 pills) with a bottle of water.",
  "T: 10:35 -> Feeling sight body high, very similar to DXM. Limbs are extremely heavy. I had to go to the bathroom VERY badly, I don't know if this was from the bottle of water or the pills. When I stood up it hit me fairly hard. It felt as if my body weight tripled, and although trying my hardest to walk normal, I did a zombie walk arcoss the hall to the toilet. When I sat back down I looked at the upper cornor of the wall in the room. It looked like is was pulsing and being distorted like a subwoofer does when you crank the bass up. Still visuals were very minor and I was fairly disappointed so I took 100mg (2 pills) more for a total of 450mg.",
  "T: 12:05 -> At this point I'm pissed. I've felt nothing beyond what was described above. The only explination I can think of at this point is that I was watching a movie, and I was so focused on the movie I killed my trip. I decide to go to sleep. What happens next was extremely interesting, and I didn't understand it until the next day. When I was lying in bed, I thought I was dozing in and out of sleep. I would close my eyes, but I could still see. To prove to myself that this was not possible I pulled my eyelids down with my fingers and held them shut. I saw black for about 5 seconds, then like magic, I could see the room again.",
  "I was still holding my eyes shut. I looked around the room and saw my cell phone sitting on the nightstand. I took my finger off of my eyes and picked it up. I scrolled through it and made sure I had set a alarm on it for the morning, then set it back down on the nightstand. I closed my eyes for a couple of seconds and opened them. There was no nightstand in front of me, and my cell phone was sitting in the pocket of my shorts. 'That's some weird shit' I thought, and I went back to sleep. The entire night was filled with extremely vivid dreams of things happening, I was talking to people, wandering around my friends house, wandering around in my house. When I woke up I just thought those were some wierd dreams, and drove home @ 7:30am.",
  "T: 8:00 am -> Driving home was normal, no problems or intoxicated feeling at all, just a bit groggy and and mild neausa. I get home and go back to sleep. THE SAME SHIT HAPPENS. As soon as I doze off I can see again. It was like my brains was making up situations and rooms from how I remember them. I'm starting understand this now, and freely allow myself to doze on and off into these 'renderings' my brain has created. Nothing about this was weird as all these 'dreams' (or where they?) were just of me chilling in my room. I woke feeling tired, but completely normal.",
  "T: 11:00 am -> I woke up and am trying to make sense of what happened. It's very weird because that morning I remember driving home with no problems; but now I can't remember driving home at all, or getting in my bed.",
  "This was a very awkward trip. I plan on trying this again except using about 550mg-650mg, and having a sitter to watch exactly what I'm doing. My suggestions to people who would like to try this is start with a small dose. If I had done this during the day it's VERY possible that the results would be different. This is not a 'cool' trip like LSD or shrooms. I don't get these heavy visuals like that, I see normal things and people, then just watch them disappear. It's interesting, but frightening."
 ],
 "erowid": {
  "id": "35165",
  "citation": " T. \"Seeing with Closed Eyes: experience with Dimenhydrinate (ID 35165)\". Erowid.org. Dec 14, 2007. erowid.org/exp/35165",
  "substance": "Dimenhydrinate",
  "views": "6151"
 }
}
