{
 "id": 15698,
 "title": "Hangover From Hell",
 "date": {
  "submission": "2007-07-31T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MissK",
  "gender": "Female",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:00",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:30",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "After closing down the bar 2am, my friend comes by with one of my favorites, some good ol coke, and after a few little bumps says he's got some pharmies too, Effexor. He told me if I take two it will make me all happy sort of like when you take E. Why do I listen to these people sometimes? So, what the hell, I take one at 3:00am to start and tell myself I'll take the other later.",
  "Gone back to my house and by this time I've got a good little buzz going on, and go for a few more lines. An hour later I'm grinding my teeth like I never have before, and after a little of that for some reason I decide it's time for the other effexor 4:30am.  The high I notice doesn't really differ from a coke high, maybe a little more intense, but the point of taking the effexor was really insignificant because I felt no different, just some teeth grinding, a lot of talking about nothing important that seemed important at the time and a general pretty tweeky/speedy feeling. But that night didn't compare to the next two days.",
  "We tried to go to sleep around 7:00am or 8:00am and I think I slept for a whole 30 minutes but all in pieces. I woke up around 10:00am shivering like it was freezing, but I was almost sweating it was so hot, teeth chattering and shaking. I figured it was just a hangover of sorts, cause my stomach felt sick. I ate some tums and my stomach felt better. Normally after a night of partying I always want to eat, but the thought of eating almost made me more sick.",
  "My eyes are completely dilated in whatever light I'm in, and so I come to the conclusion that yes, I'm still pretty fucked up, but there is no high, I don't feel the slightest bit of good, all I feel is shitty. My muscles are clenching, almost spasms that go from my legs to my arms to my torso and my eyes. Every once in awhile there is a break and I feel almost normal. But then it starts over, the shaking and clenching. My mouth is completely dry which I really am perplexed at how dry it is. I feel totally sketchy/tweeky and can't keep my eyes on one thing for any period of time, a general feeling of anxiety almost a panic attack but not there just yet. The best I can describe is the anxious feeling I get right before I am going to throw up. I felt like that all day.",
  "12:30pm I'm sitting in my room still shaking and sketchy so I decide to go online to figure out what the hell I took. I find out that efexor is a 24 hour med, and I took two. Great I say, I don't think I'm gonna come off this today. I'm gonna be like this all day. I decide to try and sleep again. At 1:30pm I guess I fell asleep and slept till 7:00pm. I got up and thought I felt better but my eyes were still dilated and after I was awake for about 15 minutes it came back again, much less than the morning, but back all the same. Finally I could eat something around 10:00pm and tried to drink some water. I walked around the block cause I thought it would help, but as I was walking I just wanted to lie down and sleep. Then I was kinda scared. I called a friend and had him come over cause I was pretty concerned. Around midnight I am feeling a bit less of everything, but still pretty tweeky. At 1:00am we walked down the street to get some movies and then all of the sudden I felt much better. The anxiety had gone away. I got back to my house and lied on the couch and watched part of a movie and finally felt sleepy again and went to bed.",
  "I woke up in the morning at 8:00am ate some cereal and went back to bed, got back up at 1:40pm, felt wonderfully better, my eyes weren't dilated anymore and the shaking had subsided but still feel mildy tweeky, but its getting better and I feel almost normal so I stop worrying about it. By 4:30pm I almost back to normal and in the morning all back to normal again.",
  "I will never do this drug again, every side effect it had listed I had for nearly two days, it was ridiculous. No good for recreation, but I seriously wonder how doctors prescribe this with all the side effects that so many people get."
 ],
 "erowid": {
  "id": "35226",
  "citation": " MissK. \"Hangover From Hell: experience with Alcohol, Cocaine & Venlafaxine (ID 35226)\". Erowid.org. Jul 31, 2007. erowid.org/exp/35226",
  "substance": "Alcohol, Cocaine & Venlafaxine",
  "views": "12841"
 }
}
