{
 "title": "Buprenex High",
 "author": "recoveryguru",
 "citation": " recoveryguru. \"Buprenex High: experience with Buprenorphine (Buprenex) (ID 15694)\". Erowid.org. Nov 26, 2002. erowid.org/exp/15694",
 "substance": "Buprenorphine (Buprenex)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "0.3 mg",
   "IV",
   "Pharms - Buprenorphine",
   "(liquid)"
  ]
 ],
 "report": "<p>Well dear friends, I have a solid history using every drug known to man. However, when I decided to look for an opiate to use which doesn't cause an addiction from hell, Buprenex fell into my lap.</p><p>I saw all the posts on the net about how Buprenex is used to treat Heroin and other opiate addiction.  In addition, I noticed that it was also a drug of abuse in Europe, especially France, BAM! I had an idea.</p><p>After days of searching I finally found a Mexican dude who sold the stuff.  And better yet, it was the injectabe type.  I received my order a few days later.  Needless to say I was very excited.</p><p>I shot the stuff into one of the few veins I have left, my leg.  All the other ones are gone due to years of abuse.</p><p>I felt a mild tingly feeling, but nothing like the rush of shooting heroin or oxyontin.</p><p>Then about 15 minutes later I had the most glorious mild opiate high I had ever experienced.  Not only was that pleasing but I felt all the anxiety and depression of my work and life stresses lifted.</p><p>It was like a nice dose of vicodin and xanax all working together.</p><p>I didn't feel the powerful nod, or extreme euphoria of heroin or morphine. Instead, this high was honest and pleasent lasting for hours.</p><p>The next day I still felt very positive and upbeat.</p><p>Buprenex withdrawals are the only opiate withdrawals anyone can tolerate.</p><p>The only problem is the stuff is expensive $25 per vial and hard to get.</p><p>Keeping it real up in da field arigh, RAHJEN BLACK RECOVERY GURU</p>",
 "year": "2002",
 "id": "15694",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-11-26T08:00:00.000Z",
 "views": "60032",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.3 mg",
   "administration": "IV",
   "substance": "Pharms - Buprenorphine",
   "form": "(liquid)"
  }
 ]
}
