{
 "id": 15694,
 "title": "Take the Ticket",
 "date": {
  "submission": "2007-11-07T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Shane",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "Me and my 3 friends, C,D, and A, were sitting around in my car with some dope and nothing to do. It was D's idea to buy some salvia and just kill the afternoon. So we did. We went back to D's room, where C and A played x-box, and I packed a bowl in a waterbong and torched it with a butane lighter. I inhaled slowly and steadly to my threashold of coughing and held it in. It hit me before I could even let my breath out.",
  "Soft at first, but increasingly violent, it felt as if waves of water were slapping against my back, and the backs of my limbs. The sensation was neat, but it made it hard to keep my balance. I kept sinking back into D's bed, which is what I was siting on. Every time I tried to sit back up, I sank further into the bed. I started sweating bad, and the sweat was cold to my skin. It was freezing actually. I could feel it coming out of my pores.",
  "I sat there constantly trying to regain my balance and sit up-right, when my friend, D, screamed at me 'Take the Ticket.' He scared the shit out of me, and I was absolutely stunned. The only thing I could think of to do in response was pass him the bag of salvia. For some reason, I thought that is what he wanted. I tried to talk, but could not. The only noise that I could make was a high pitched grunt, similar to that of laughter in the midst of an intense mushroom trip. I tried once more a few seconds later to squeeze out words, but no luck.",
  "Not long after, I could feel my trip ending as the water that was slapping my back dissipated. The first thing that I said when I was able to speak again was 'Why did you yell 'Take the ticket' at me?' All of my friends looked at me, and explained that he did not yell at all.",
  "The trip only lasted about 4-5 minutes, but that was all I could handle, for then. I hit the bong three times that day, and each trip was as insane as the next. I had tried salvia prior to that, and had minimal effect, and until this day have never had a trip anywheres near that ridiculas."
 ],
 "erowid": {
  "id": "35201",
  "citation": " Shane. \"Take the Ticket: experience with Salvia divinorium (5x extract) (ID 35201)\". Erowid.org. Nov 7, 2007. erowid.org/exp/35201",
  "substance": "Salvia divinorium (5x extract)",
  "views": "2188"
 }
}
