{
 "id": 15736,
 "title": "Makes you stoned",
 "date": {
  "submission": "2000-11-01T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Phil",
  "gender": "Male",
  "weight": "65 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I saw a trip report on this substance, so I thought I'd describe my own experience with it. It is a hypnotic-sedative which my friend was prescribed for insomnia. On the box it says it can produce alterations in personality/consciousness and hallucinations.",
  "I took these tablets of 10mg each a few times when I was stayin with my friend, because I was having trouble sleeping, and I noticed definite psycoactive effects. It initally seems very similar to cannabis inebriation, with the same kind of mellow body buzz, slight loss of equilibirum, and alterations in lights. Three of us were all mildy stoned off it, except the mental side is very different from cannabis.",
  "For a start, this stuff has its own very distinctive chemical 'feel' to it, which I can still remember clearly several months later. Also, the mind is quite agitated, and I remember feeling a bit bothered by this. I was almost having conversations in my mind, about how my I was feeling. I could also picture/imagine objects flying before my eyes when in a dark room, and these had a specific theme to them. On this occasion it was clockwork/cog-wheels, so all the shapes incorporated this. Some aspects of it are more like alcohol, e.g. the drowsiness and slight loss of inhibitions. My friend has been on this stuff for months, and cant sleep without it --it can form dependency-- so its not something to abuse. He has experienced visual hallucinations/distortions with it on occasion. Personally, I found it wasn't anything like as good as marijuana as a sleeping aid."
 ],
 "erowid": {
  "id": "3533",
  "citation": " Phil. \"Makes you stoned: experience with Zolpidem (Ambien) (ID 3533)\". Erowid.org. Nov 1, 2000. erowid.org/exp/3533",
  "substance": "Zolpidem (Ambien)",
  "views": "44988"
 }
}
