{
 "id": 15743,
 "title": "Effects of High Doses",
 "date": {
  "submission": "2007-03-12T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Spart",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "800",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "On two occasions, I have purposely set out to take large amounts of caffeine into my system.  I've done the same thing countless other times, but it wasn't planned and documented and therefore I don't remember much about it.",
  "The first time I came upon the idea of documenting everything was when I was writing an article for our (admittedly humorous) school newspaper.  I and a friend set out to drink the equivalent of about ten cans of Red Bull energy drink.  We didn't actually drink Red Bull, being as it tastes medicinal and is too expensive.  We instead used a product from SoBe called No Fear.  For the same price, I get twice as much energy drink and caffeine and a better taste to boot.  No Fear has about 160 mg of caffeine per 16 oz. can, and we drank five of them in the shortest amount of time possible.  After drinking well over a half gallon of energy drink in less than an hour, we experienced increased alertness, mild paranoia, and a strong inability to keep still.  My resting heart beat was 112 bpm, far beyond my normal 65 bpm.  I would say that I had to urinate more than enough required to become mildly dehydrated. This is all from about 800 mg of caffeine, or about eight cups of coffee.",
  "The second time, I managed to drink a gallon of Mountain Dew, which contains about 587 mg of caffeine.  Although it took a while to drink that much liquid for the obvious reasons, I managed to drink it all in a little over two hours.  I experienced many of the same things I did with my previous experience, and more.  The problem with drinking soft drinks such as Mountain Dew to get a caffeine rush is that I have to drink large amounts of it, which makes me sick.  So I experience an upset stomach, excessive urination, a racing heartbeat, mild paranoia, an inability to keep still, and a disturbing kind of wakefulness all at the same time.  Paranoia and feelings of discomfort don't spawn good things."
 ],
 "erowid": {
  "id": "35348",
  "citation": " Spart. \"Effects of High Doses: experience with Caffeine  (ID 35348)\". Erowid.org. Mar 12, 2007. erowid.org/exp/35348",
  "substance": "Caffeine ",
  "views": "9163"
 }
}
