{
 "id": 15756,
 "title": "Overdose Freaked Me Out",
 "date": {
  "submission": "2005-08-12T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "d",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "180",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Mirtazapine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "cig."
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "my doctor had just put me on a new antidepressant called Remeron.  it came in packs of six, and they dissolve in your mouth, tasting like oranges and aspartame.  one day, just for the fuck of it, I decided to triple my recommended dose of 60mg.  so I took the pills and smoked a j. about 45min to an hour later I was lying in bed with a blacklight on I began to feel strange, like I was trippin.  With my eyes closed, I saw a kaleidescope of the most brilliant colors, forming so many different insane designs.  then I opened my eyes and looked up at an abstract picture that I had painted - and cartoon characters formed resembling the simpsons - and they were talking to me.  Things in my dark room would suddenly take a new shape and become animate - this shit was really freakin me out to the point that I thought I was going to die.  Among the things I saw the most memorable was the face of a demon or devil of some sort while my eyes were closed.",
  "I have used it about 3-4 times after then, but none as intense as the first.  Random visual hallucinations - especially with closed eyes - moderate to extreme hallucinations. One time I kept on 'hearing' pages over the intercom at work all fucking night - but I was at home the whole time.  I have also seen books held by someone else's hands in front of my eyes with an indescribably strange writing.  I let one of my friends try it one time and he saw a book also.  He said that he felt like there was a tv on in his head flipping through channels and shows that he had never seen before - really weird shit.",
  "The bad part is that whenever I finally fall asleep - I don't plan on getting up for at least 12 hrs - I wont have a very productive next day."
 ],
 "erowid": {
  "id": "35381",
  "citation": " d. \"Overdose Freaked Me Out: experience with Mirtazipine (Remeron) (ID 35381)\". Erowid.org. Aug 12, 2005. erowid.org/exp/35381",
  "substance": "Mirtazipine (Remeron)",
  "views": "26809"
 }
}
