{
 "title": "Great Body High",
 "author": "Jason",
 "citation": " Jason. \"Great Body High: experience with Nutmeg (ID 15753)\". Erowid.org. Oct 2, 2004. erowid.org/exp/15753",
 "substance": "Nutmeg",
 "bodyweight": "150 lb",
 "report": [
  "<p>When I first heard that nutmeg could be used as a psychoactive, I knew that I had to try it. I mean hell, it's legal and it's cheap. Why not? I decided it would be best to do some research on it first to see what the dangers are and what exactly it would do. The following is my experience with nutmeg. I apologize for it not being the best approach to describe the experience, however I didn't have a paper and pen to document my experience.",
  "I went to my kitchen, got out the nutmeg that we had and weighed out approximately 10 grams of it. I took it upstairs along with a glass of milk to wash down the god-awful taste of the spice. I decided it would probably be best to take it all at once so that I wouldn't have to taste it more than once. At approximately 6:30 p.m., I dumped the whole 10 grams in my mouth and tried to swallow it, however I found this was very difficult without any liquid. I grabbed the glass of milk I had and washed down all the nutmeg....this eliminated the taste fairly quickly and, of course, helped it down the hatch.",
  "I didn't feel much of anything for about the first 20 to 30 minutes. After this, I began to feel relaxed and comfortable. This feeling grew stronger as time passed. About 1 to 2 hours later, I reached the peak of the relaxing body high that the nutmeg had given me. However, once I peaked I never really came down, but instead stayed at that level of relaxation for the remainder of the evening.",
  "I had read other people's experiences and found that after a while, they started to hallucinate. Well, for me it wasn't until about 7 and a half hours after taking the nutmeg (2:00 a.m.) that I noticed any of this. However, when I noticed this, it was nothing extreme. I heard the occasional sound that I knew wasn't there such as my dog barking, doors slamming shut, etc. I knew this wasn't actually happening though due to the time of night. The only actual visuals I had would be the occasional fly that I thought I saw out of the corner of my eye. But, this only occurred 2-3 times before I fell asleep. I wish I would've done something to keep my attention so that I could've stayed up longer and possibly had more visuals, but I was just too tired.",
  "It's now 1:30 p.m. the next day and I am still feeling very relaxed. Most people have described this as a nutmeg hangover, but I just think that it's the nutmeg still in effect without the hallucinations.",
  "Overall, I'd say this was a positive experience. It's cheap, legal, and it relaxed me completely. I'd like to try this again, however maybe earlier on in the day and with a slightly higher dosage than before as to hopefully hallucinate more.</p>"
 ],
 "year": "2002",
 "id": "15753",
 "gender": "Male",
 "views": "10576",
 "dose": [
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2004-10-02T07:00:00.000Z"
}
