{
 "id": 1575,
 "title": "More Intuitive?",
 "date": {
  "submission": "2005-04-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Ninni",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>I recently tried H.B.W. for the first time. And after reading many other people's written experiences, my expectations were low.  I was expecting it to be a very mild 8-hour mild LSD-like trip. Boy, I was in for a pleasant surprise!!! I took 10 seeds and crushed them to a powder and added to a cup of warm water in a bottle, and shook and shook and let sit for 2 hours. Then I drank it and swallowed the pulp that remained at the bottom of the bottle.  Then it was time for me to go to work.   ",
  "I work at a home for the severely mentally handicapped. I know this sounds 'Bad'... going to a job in which I care for the mentally-retarded while under the influence of an intoxicating plant.  But I can tell you that my 'intoxication' of HBW did not interfere with my responsibility of properly caring for the mentally retarded residents.  In fact... I found that I could care for them better... I could better understand... I was more intuitive to their needs.    I started to feel the first effects of the HBW after only 15 minutes after ingesting. (I had an empty stomach) I first noticed a 'dreamy and sedated' feeling.    What seemed odd to me is how the 'mentally retarded' residents responded towards me. It's as if they knew that I was somehow different. They were more loving towards me.  They laughed more than I have ever seen them laugh.  And somehow I felt that we were mysteriously communicating better telepathically. (none of the residents I work with are capable of communicating verbally)    They were all more 'energized' when I was with them. And they were more happy than what they normally are.  I know this was not my mind playing tricks on me.  Other employees also noticed that all the mentally retarded residents were being more loud and hyper and happy this day. SO I know it was not just all in my mind.   ",
  "Well, I had a hard time trying to keep a straight face.  It was hard to keep a permanent smile from my face.  I was afraid other employees would notice that I was smiling too much.    I have done LSD and mushrooms before on numerous occasions. And I personally think that HBW is most similar to shrooms.  I had that same feeling in my heart and solar-plexus, that warm fluttering feeling. And the trees outside seemed more alive and the earth seemed to be more alive and everything was beautiful and perfect.  I noticed every detail in everything I saw.     Walking home from work was very magical, with the shadows on the road of the branches of the trees dancing gracefully in the light of the full-moon.  And the moon-light was pulsating like a strobe-light.    I saw a fairee light here and there that would fly up into a great old tree. I can best describe these 'fariee's' as being blue sparks that fly around. I used to see them regularly before I reached puberty. And now for the first time since my childhood... I could finally see them again.   ",
  "My trip lasted a good 12 hours.  And though it was mellow... it was quite intense.  And the peak that I got from HBR lasted longer than any LSD I done.  Though the visuals were not as intense as LSD... the spiritual and mental effects from HBR exceeded the effects of any LSD I have done.</p>"
 ],
 "erowid": {
  "id": "14952",
  "citation": " Ninni. \"More Intuitive?: experience with H.B. Woodrose (ID 14952)\". Erowid.org. Apr 12, 2005. erowid.org/exp/14952",
  "substance": "H.B. Woodrose",
  "views": "7356"
 }
}
