{
 "title": "The Most Beautiful Things",
 "author": "Journeyman",
 "citation": " Journeyman. \"The Most Beautiful Things: experience with Mushrooms (ID 15762)\". Erowid.org. Jul 11, 2002. erowid.org/exp/15762",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "0.125 oz",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>Well, I finally got my hands on some mushrooms and wowie zowie it was the most incredible experience in my life, to date.</p><p>They had been floating around for awhile with some of my hookups but they always seemed to slip through my fingers, until one night a friend invited me over to fry with him and a bunch of other people. There were eight total, six of us were going to fry. We'd worked it out so everybody would take an 1/8th of mushrooms ground up and placed in a small glass of chocolate milk. One of us wanted to eat them, so he did and the rest of us drank it. Went down fine, had no real trouble with gagging at all (but one thing I've learned from gag, but you still have to eat drugs, is that you can always do something the first time, but after that you gag).</p><p>First stage, body fry. Felt a little bit of discomfort in my stomach. Not an ache, not nausea just a little bit of discomfort, it was tolerable. Go downstairs to watch a movie and I'm already feeling something after about 15-20 minutes. Slight distoritions in perception kind of similar to 'visuals' when I'm way stoned, only, my mind seems more clear. We move up to my friend's room and we chill there. About 30 minutes after dosing probably, and I get hit with ecstasy. I was happy as all hell, laughing my brains out, enjoying looking at more or less anything. Things seem to stretch, colors are accented and move rapidly, some things bulge and the ceiling 'womps' up and down. Walking is possible, with some weaving. After the happiness passed everything was still slightly distorted and I thought after that, that I had perhaps peaked (ha!).</p><p>Well, starting to get bored up in single room, I decided to move out to the back yard where everyone had been slowly trickling. I was a little scared, to move downstairs in view of some supervisors perhaps that I might be weaving or something, but I made it out back alright. The backyard I was in was small, but it had a lot of very pleasant looking plants and the main thing, a large trampoline that could fit probably seven people comfortably. It is very dark out back, but my eyes in utter dilation made it so I could just barely make things out, the ideal environment for visuals. Utterly confuses your brain, it doesn't know what anything is, so it makes everything look like something it's not, it's beautiful. My friend placed his hand on a magazine and told me to stare, it decomposed before my eyes.</p><p>Now, it's time to hit the piece. Suck, suck, suck, taking huge hits was no problem and I had to conciously make sure I blew the hit out at some point, I felt like I could have held it in forever.</p><p>It's probably been about an hour and a half now and I just took a hit off a pipe and I get cottonmouth like nothing else, I decide to move inside and grab a drink but a supervisor was right inside so I decided against it and start to move back to the trampoline, click, the door behind me reveals the supervisor. That's it, the jig is up we're done for. Talking ensues, a conversation I remember well, but what was actually said, I'm not sure of. Jargon, I know the word sniffer was used so I don't believe any of it. It seemed to last an eternity, me standing there two feet away, conciously becoming aware I'm slowly inching away. It took a lot of effort to stand and stay quiet and not laugh shrooming.</p><p>Eventually, and mercifully, it left us and we all burst into laughter untold since we knew we were rid of it for the night.</p><p>Now, it's time to start passing the bong around. Finally, it's my turn I take a huge hit, which I could not feel in the slightest, and after nearly ghosting it I spewed what little was left and my brain began to melt. Twenty seconds after my hit I was enveloped in colors, patterns, shapes, objects, designs, all melting in and out of everything, everyone, all objects had rainbow hues dancing over patterns which melted and danced in unison over my vision. I was seeing it all. I closed my eyes, it served no purpose, I saw the same thing I saw with my eyes open, indescribable colors and patterns. I saw a red liquid dumped over my vision and it started to drain inward towards the center on a background of green glowing stars which then also started to drain towards the center. I remember having the thought that the shrooms changed and warped the world, and smoking added color and texture to those distorions, it was incredible.</p><p>Hit after hit, I would lay back on the trampoline and stare into the sky, which was purple and my eyes (so dilated) could see every star and any and all interactions in the sky. The trees in his backyard were incredible, I layed back, looked up and through the small spaces between the leaves I began to have hallucinations of color and pattern for incredible length. I could look into some of the plants and see acient rituals, or people dancing, always in vivid rainbow colors. I lost track of the voice inside my head and my true voice, at most points I didn't know whether I was talking or thinking. And I became aware that at some points I was whispering some pretty nonsensial things. It was truly the most wonderful and entertaining experience I've ever had.</p><p>Everyone, now wallowing in their own deep state of frying were milling about, inside and out all doing different things, but there were always at least 3-4 people out back smoking. I guess someone had ventured inside and busted out a black light on a pool table. It was incredible, colors were so vibrant and distorted none of the pool balls could remotley have been the colors they truly were. The red solid ball was neon orange. Then, one of the fellows begins to dance with the black light. It trailed, oh boy did it trail. It was beautiful to watch the dark purple light interact with the environment around. Throughout it all the theme was almost always of happiness, laughter and uncontrolled giggling were the name of the game. The whole thing was very much like an incredibly vibrant dream, but one that I could remember.</p><p>At a few points I had to venture inside to use the restroom. Mirrors were awfully intersting to look at. At some point, every person who fried ventured into the bathroom once and got lost in the mirror. The actual process of going to the bathroom was also interesting. As soon as the flow started immediate bubbling up of the ground and boiling of vision was intense. Add this to the fact I was in a bright bathroom after I'd been sitting in a pitch black environment for two hours with saucer eyes, and everything was absolutley shimmering gold and silver and bubbling and boiling all over the place. A gaze into the mirror and you were locked looking at yourself, while everything around you respectivley did their own crazy thing, thoughts would flood your mind. Beautiful ones, almost always good and happy.</p><p>The only time I ever got scared during the whole fry were the few times I had to venture inside to use the restroom, even then it wasn't like I was wallowing in terror, it was just the usual uneasiness that you would experience walking down a dark hall or something, no biggy.</p><p>I was absolutley frying and having full hallucinations for a good 4-5 hours, before I finally fell asleep. I'm sure I could have milked it for a few more hours and then a come down, but I settled for sleep. I was coming up on 24 hours without sleep, and I'd worked 12 of them outside doing labor. I was tired when I dosed, but the mushrooms pepped me up and kept me going for the ride. I didn't even really feel the need to sleep, it just felt so nice and warm on the couch and I could see all I needed to with my eyes closed, I eventually just drifted off.</p><p>Truly, though, it gave me a much greater understanding and appreciation of how it could be used on a spiritual level. I knew that night I had reached something I would never touch again, at least not for some time, it was a different level, a different plane of existence and I understand now why so many cultures pursued spirituality through the use of natural psychoactives (mushrooms, peyote, etc.) It was so clean and pure, I could feel that it was natural, it was from a living organism, not a chemical. It was beyond any high I'd ever experienced, psychadelics truly are a different class of drug from anything else. After seeing the most beautiful things I've ever seen in my life, I can understand that now.</p><p>By far it was the most incredible and exhilarating experience I've ever had in my life. It saddens me I will probably never achieve such an experience from mushrooms again, as it was my first time, even, with true psychadelics at all. But for that one brief shining moment, I knew that this was truly a little taste of heaven.</p>",
 "year": "2002",
 "id": "15762",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-07-11T07:00:00.000Z",
 "views": "6721",
 "dose": {}
}
