{
 "id": 15765,
 "title": "Blissful And Beautiful",
 "date": {
  "submission": "2007-07-22T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "jack",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Oxycodone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "Oxycodone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "Hydromorphone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "DXM",
   "form": ""
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Diazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Methylphenidate",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "Heroin",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  }
 ],
 "report": [
  "Last night, was the first night in 3 months I got a hold of an old friend... oxycontin...",
  "Let me start at the begining.",
  "I'm 19, and a year ago, anything besides booze, and low level painkillers such as propoxyphene, codiene, and vicodin were obtuse to me. however, on thanksgiving 2003 that changed.",
  "Growing up with a childhood friend who snorted aderall and ritalin and ate pills with me, I was introduced in my first college year to a small pink tablet marked oc 20 by my gratious stoner brethren. at this time, we had no tolerance, and when we had no booze and took all of our parents darvocet or tylenol 3, we were desparate to try new things. I had grown weary of drinking and marajuana and gave up the later permenantly, and stopped using my money for alcohol, as my tolerance was too high.",
  "so my friends walked into my room on that novemebr evening and pulled out a pill and crushed it up on my desk before I could object. he divided it into two lines, ahanded me a rolled up dollar bill, and told me to sniff. now, I hadnt sniffed anything before because I thouhgt addicts only sniffed and injected things, and after peer pressure, I sniffed one of the powdered lines, and felt nothing for a few seoncds. I started to say somthing but my friend silenced me, and then it hit.",
  "oh",
  "my",
  "god",
  "I fall backwords in pleasure. the grestest thing I had ever felt in my life. we did another together, then ate. so, when I had to return I did so with 10 of the pills he had offered. they were gone within a week, averaging once a day.",
  "I started to get prescriptions for norco and vicodin, and snack down hungrily any painkilelr I could... it progressed until S and I would go on drug binges with my girlfriend, eating any kind of opiods, dxm, valium, ritalin to stay constantly high. it was like drugstore cowboy, but much more sloppy and stupid.",
  "eventually I couldnt get oxy anymore due to stings and busts around our suburban indiana area, and no one had it back in chicago where I went to school.",
  "one day after a few months, S got a full prescription...90 pills of 20 mg oxy. in return for 35 of them, I got him 400 mg of aderal and some coke.  that was when I began to fall into the hole.",
  "I stole some needles from a walk in clinic, along with general anestetic(sp?) and experiented with shooting up until I finally mainlined(I had intended to do subcutanious but tried the vien as well) and was amazed at how beautiful the high was..... the fuckign rush...and how little the needle hurt..I  had been lied to! this was amazing... this was in february 2004...",
  "Because I had only 15 or 16 oxy left after a month or two, (pretty good for me!) I looked into trying heroin, and after asking a beggar if he knew where to get it, I bought two bags. this lead to a lengthy addiction to heroin, and me meeting a dealer in my shcool and a few junkies, and all of us became a sort of heroin club, the elite chicago art institute junkies. everyone was into coke and weed, but not us.",
  "After I had shot all my oxy, and couldnt get dope because I had been nearly arrested and caught seevral times, and all my junkie friends got kicked out or put away, I went to go to the walk in clinic, in hopes of getting a pinkiller to stave off the withdrawl....",
  "...no such luck. I was given valium, and hen no one looked I stole a medical script pad, and forged the signature and rx code from the doctor, and wrote a script for 20 4 mg dilaudid tablets.",
  "they believed me, and I got it. I was so amazed, that I shot 3 pills, and was high for 5 hours, walking around the city in a daze, loving life for once... but it couldnt last.",
  "I sold the rest of the script for 60 bucks so I could buy some food and booze(I needed to relax without too much junk). the next day however, I tried to fill another script. the pharmacist said she knew the doctor and that was not his hand writing. I panicked and took off, and this incident nearly landed me a convicted felony, but they didnt press charges and I got away. I eventually was kicked out of school however for this, and for admitting my withdrawl.",
  "Now there was nothing to do, but face my withdrawl form heroin and dilaudid, and pray I die in my sleep. that was april.",
  "3 months later, me and S bumped into a dealer selling 20's for a buck per miligram, we did a deal and got 17 for 300 bucks.",
  "At this time, I had only done codiene and darvon and vicodin as far as opiates go, for the longest fucking time. I had detoxed and tried everything from shooting coke to ketamine to MDMA. I had gotten deparete and sloppy. but, its been 3 weeks since I had done any drug besides pain meds for my wisdom teeth. S and I paid our man and received our shit. We each did a pill at 8, and then proceeded to snort all of it save for 3 by the early morning.",
  "I saved three for my girlfriend who only tried oxy 2 times, and I promised to shoot it with her when she comes back to town(she has my needles anyway so I cannot inject).",
  "Last night S and I did somewhere between 140 mg per person, giving bumps to another guy who had not tried it. we laid around in a doped stupor, and I vomited many times due to the drug being reintroduced to my body, however I didn't lose any of the high, and it was one of the best nights of my life.",
  "When I meet the man again, we are getting even more, and this time conserving them, and most likely using the needle.",
  "I can't say that I am a responsible drug user, or that I'm not a complete moron, all I can say is that out of all the drugs I've ever wasted money on, this is the only one that leaves me feeling fulfilled after its gone. So I'm a junkie, and always will be.",
  "at least I am happy."
 ],
 "erowid": {
  "id": "35396",
  "citation": " jack. \"Blissful And Beautiful: experience with Oxycodone (ID 35396)\". Erowid.org. Jul 22, 2007. erowid.org/exp/35396",
  "substance": "Oxycodone",
  "views": "27881"
 }
}
