{
 "title": "Tomorrow Never Knows (1966)",
 "author": "Steve",
 "citation": " Steve. \"Tomorrow Never Knows (1966): experience with Morning Glory Seeds (ID 1577)\". Erowid.org. Jun 15, 2001. erowid.org/exp/1577",
 "substance": "Morning Glory Seeds",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "report": "<p>\nIt was the summer of 1966 and we were all looking for adventure. I was an innocent 16 year old from the suburbs eager to experience all of those melting colors and sounds as described in Time, Newsweek, and all the other publications that were at the time heavily covering the emerging world of Hippydom/Tim Leary/Pschedelia and, my heroes, The Beatles.</p><p>My friends and I had of course heard about LSD but we didn't know where to get any. My knowledgable friend, Craig, had heard that Morning Glory seeds packed an effect similar to LSD, so one afternoon after school my friend Bob and myself acquired about two dozen packets of Morning Glory seeds from the local garden store. I'm sure they were the Crossman brand and of course we made sure we chose 'Heavenly Blues.' I took mine home and waited until I thought no one was home and then crushed them with a hammer down in the basement.</p><p>Friday night, we all met at Craig's house (no parents around). Bob and I ingested our crushed seeds with some coca-cola about 7:00PM. About an hour later we began to feel quite nauseous, although I wouldn't characterize it as unbearable. My friend Bob eventually decided he'd had enough and vomited his up. I decided to tough it out. Don't remember exactly how long the nausea lasted but it wasn't too long, probably around 90 minutes. Anyway, I ended up feeling disappointed because nothing had happened.</p><p>Around 11:00PM, we left Craig's and I went home and went to bed. At some point after midnight, I suddenly began to feel something strange and I was absolutely terrified because I was alone and didn't know what was happening or what to expect. As it turned out though, I was able to control the fear and spent the night lying in bed with my eyes shut with all manner of cartoonish patterns spinning wildly behind my eyballs while my mind was busy with all manner of disconnected 'stream of consciousness' rubbish.</p><p>In the morning, the worst thing was the lack of rest. The very best thing was being able to brag to all my friends about my 'psychedelic' experience. I was disappointed that Bob hadn't hung in there with me so that I would have someone to share and compare notes with. I was sure he'd wussed out, afraid of what he was getting into. I felt especially fond after that of John Lennon's 'Tommorow Never Knows' off the Revolver LP. It seemed to fit what I had felt that night. A year later, after I had left home, I was able to obtain some genuine LSD. Only then did I come to appreciate just how mild my little Morning Glory experience had really been. I'll leave those LSD experiences though for another report.</p><p>P.S.....was never tempted to take any MG seeds again. Just didn't seem worth it.</p>",
 "year": "1966",
 "id": "1577",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-06-15T07:00:00.000Z",
 "views": "9790"
}
