{
 "id": 15783,
 "title": "Out-of-body Insight",
 "date": {
  "submission": "2004-09-15T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Cheshire Kitty",
  "gender": "Female",
  "weight": "115 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "You say it's impossible, I say the human mind mixed with drugs has no limits. To me this looks like a trip...from marijuana. You be the judge.",
  "A year or so ago, I invited several friends over for a couple drinks. Yet, at my house, a quiet get-together quickly turns into a raging drug binge. Also, two or three friends soon becomes every teenage inhabitant in the town. Where I live, the kids get quite cliquey...but on this very night...geeks, preps, even some random people I've never seen before have all joined together at my home, chatting and bonding peacefully, all in the name of intoxication. A beatiful thing, I dare say. Yet, another pro of this situation is the more people that show up, the more drugs that seem to find themselves being spread out and broken up on various surfaces in my house. After about 45 people have invited themselves in, the place begins to look like some sort of black market headquarters. An array of substances in baggies, containers, freesprawling over tables and countertops were being consumed and smoked in rediculous amounts. Beautiful stuff...yet, enough of my ranting.",
  "So here's my experience of the night. The party was producing wonderful vibes...strange rotten looking smoke hovering around the ceiling... cottonmouthed faces... iris-less eyes... splendid stuff. Yet, they were soon disrupted...several unfortunate dudes had to go and start breaking things... this lead to a few bitchslaps and some painful knee-testicle contact... a beautiful advantage to being female. Although this problem was solved, it had set my spirits a bit low. Being a smart party host, I have learned that staying sober while crazed drugees rampage all over your property is the best thing to do. Yet, being in a bad mood at your own party is simply non-tolerable, in my opinion anyways.",
  "I searched my house for a delightful drug to clam my nerves, and finally found a group of kids passing a blunt on my porch. It looked like a grand opportunity to step in, so I pulled up a chair and joined the rotation. After it was smoked to a roach, I felt the familiar euphoria which I had experienced many times previously. Company began to look even more friendly. Their spirits and actions seemed to be... well I suppose silly would be the word... and the environment in general took on intensifying qualities. The usual effects of pot.",
  "Well this wasn't enough for me. I wanted to see how intense things could get. As people joined and left the rotation, I stayed for another hour or so. Enjoying bowl after bowl after bowl, until I reached a certain brink where I felt my body was at its maximum capacity of THC.",
  "Now, I have smoked like this many many times before, but something was different about this experience. Normally the fuzzy silly funny feeling erupts and rises until a fit of laughter amongst all who are stoned creates an enjoyment climax, followed by an insightful period of wondering, which doesnt last long before the menacing frenzy for food breaks loose. After the stomach is full to the point of bloating, heavy fatigue sets in, and the body begs for sleep. This time, it was different.",
  "At first, all was going as usual routine. I sat in my living room with several friends giggling at each others' hair. The mild snickering continued until I popped in the movie Kung Pow, a must-see for pot smokers, especially at the 'geeking out' stage. As the movie began, the quiet giggling exploded into gasping laughter, a joyful time for all of us. After the fit was calmed down, the movie was turned off and some random show on the discovery channel raided the screen. Surprisingly, most stayed and watched, seemingly entrigued by the mating cockroaches. I must admit, I was also taken. I couldn't stop staring at the TV. The way they squirmed about, the all-knowing documentary voice, it was all intensely fascinating. After the show was over, all except two who were on the couch with me dashed to the kitchen to satisfy their appetites. I expected the same to set in with me, but surprisingly sleepiness slowly took over. I found this strange, hense this didn't usually occur until after I stuffed my face with various junk foods. But anyhow, I proceeded to the floor to rest, too tired to make it all the way to my bed.",
  "This is where the experience gets interesting. As soon as I shut my eyes, things began to get weird. Slow, swirling colors and checkered patters decorated the darkness- I was experiencing closed eye visuals. This boggled my mind because never before had I tripped on pot, nor did I think it was possible. Yet, the colors were as real as the sky is blue, and I knew I was not sleeping. I could still hear the goings-on of the party, and I had not fallen into the semi-concious stage you experience just before sleep. Although tired, I was fully there and awake. Suddenly the twisting nonsense on the back of my eyelids took form - a black frame around a white scene. The whiteness was in the form of a convex square, like the shape of a TV screen. Suddenly, this screen began to host images. As the images (they were moving, by the way, kind of like movies- changing every 30 seconds or so) played, they seemed to be quite farmiliar. I then recognized them to be clips from dreams. Dreams I had had long ago, mostly between the ages of 2 and 5.",
  "Never would I have remembered these in soberness. I had forgotten about them for years. It was as though this screen represented a vault deep within my subconcious which held my farthest, hardest to access memories. What confused me the most was that I thought these childhood experiences were long lost, forgotten memories. But this showed me that memories are never erased, just forgotten.",
  "This went on for a decent 15 minutes or so. Suddenly, a change in pattern. On the screen appeared myself. Not a 3 year old or long forgotten form of myself, but me exactly how I was at that moment, lying on my living room floor. My eyes were closed, arms and hair sprawled out. After about 10 seconds, the black frame faded and disappeared. There I was, about two feet away and two feet off the ground, looking at my body lying helpless on the floor. The sensation was extreme. My mind could sense no physical form of myself. Then again, if I did have a body, I would be halfway thru the floor. I began to look at myself. I imagined the warmth and comfort my body was feeling, but shuddered at the cold I felt several feet away. I looked up at my two friends on the couch, chatting away. They had no idea I had left. They were happy and high in their bodies, oblivious to my state. If only they knew... they would miss me. They need me.",
  "What horrible emotions I began to feel... I had never felt this depressed in my life. My life was not over, I had so much more to live for... people needed me... I needed to complete my life. And my poor body, lying there lifeless. I had spent so much of my time caring for it, cleansing it daily, and now it was gone in wasted neglect. I began to cry. I felt the crying sensation, but I don't believe my bodyless form actually produced tears. I needed to go back, continue on with my life. I reached out with a non-existant arm, and began to glide back towards my body. Closer and closer, until finally I touched my own face, and at that instant, my eyes opened. Me, inside my body, opened my eyes.",
  "I was back, and grateful for life like never before. Now I'm not exactly sure how I generated an out-of-body experience on pot, but anything's possible in the drug kingdom. Not only this, but I also learned some interesting information on the power of the memory. This experience gave me a great appreciation for life and the human mind, and as depressing and painful as the actual event was, it taught me the values of both and to appreciate them while you still can. Plus, you have to admit....out-of-body experiences are pretty damn nifty ;o)",
  "happy intoxication",
  "cheshire~"
 ],
 "erowid": {
  "id": "35449",
  "citation": " Cheshire Kitty. \"Out-of-body Insight: experience with Cannabis (ID 35449)\". Erowid.org. Sep 15, 2004. erowid.org/exp/35449",
  "substance": "Cannabis",
  "views": "22065"
 }
}
