{
 "id": 15788,
 "title": "Ketashrooms : Synergistic Bliss",
 "date": {
  "submission": "2006-04-06T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "plexus",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.0",
    "quantity": "1.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "line",
    "quantity": "1"
   },
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "K is a completely different experience on higher doses. There's a whole other side of the keta-spectrum to consider. But this report is about Ketamine AND Mushrooms. When I did the two together, it was such an incredibly synergistic experience. One that came to be one of my most blissful and benevolent psychedelic experiences.",
  "I ate about a gram (about 6 tiny, home grown, dried mushrooms) and waited an hour. I knew I wouldnt feel that one gram by itself, but the mushrooms wasn't the point. So when I was at the point of feeling a little bit stretchy, I retired to my room with a mixed Shpongle CD and a pair of headphones.",
  "I sat at the edge of my bed with a hefty line of K in front of me. This was my first time doing a dose that big of ketamine. I had maybe done 1/4 to 1/3 that amount before. My earlier experiences being bumps and small lines. So, 'SNNIIIFFFFF'.... up it went, immediately feeling small effects. I turned on the CD player, put the headphones on, and laid down, waiting for the drain. Then it came. A flood of burning liquid down the back of my throat, and with it, a surge of effects came with it. A head rush. The burning liquid, to my surprise, actually felt quite pleasant. Then, more and more pleasant. It felt great. I just laid there with the drainage slowly seeping down my throat. Not swallowing, letting it go slow to enjoy the new sensations.",
  "The first effects were a head rush effect. With a stretchy, laid back feeling. I felt more and more sensations. I felt new dimension in my body. My skin felt like velvet. When, I closed my eyes, I saw CEVs. Beatuiful, dancing geometric patterns of color brought to life for my viewing pleasures. I just felt like lying back, rubbing my skin, and listening to the supersonic soundscapes that shpongle brought.",
  "And, my god. Shpongle never sounded so good. No. Music never sounded so good. Every instance of every song was on freeze frame for me to examine the sheer brilliance. And I thought, 'Wow. They knew EXACTLY what they were doing.' Flutes going through my head, deep beats spinning around my head, synths running down my body, and vocals speaking on so many levels 'I am a shaman, magician, the sun is purple'. Oh. The sun IS purple! I could see it when my eyes were closed. And I AM a shaman. I AM a magician! If I wanted to be. All parts of the songs flowing through the different dimensions that I couldnt percieve merely minutes before.",
  "The experience was the hallucinogenic side of ketamine. My walls and ceiling were no longer connected, but flowed freely in whatever direction they pleased. That isnt to say that one whole wall was connected to itself, but parts of the wall would float and swirl away from another part. I felt better than I ever felt. And I felt a presence. I felt God, and I felt I was a part of God. I was never that comfortable in my life. I felt stretched like putty.",
  "And I felt the gravity of the K-Hole. It was kind of like that scene in trainspotting where Ewen McGreggor sinks into that carpet. Yea. Just like that. My glow in the dark stars that I placed around my room's light in a spiral shape were all spinning around, swirling around, and smiling at me. I felt free. I felt like things were getting off my chest. I started forgiving everybody for everything they've ever done to me. None of it really mattered in the end anyway. There really is no point in holding some silly grudge for my life. I felt Love for everything. It was great.",
  "The whole trip lasted for about an hour. When I was done, I felt fantastic. Refreshed. Wonderful. One of my favorite psychedelic experiences. I have never put two drugs together that worked so well with one another. I'm looking forward to doing the same thing on a higher dose of shrooms if I can ever come across Ketamine again.",
  "But Ketamine will always remain my chemical ally."
 ],
 "erowid": {
  "id": "35465",
  "citation": " plexus. \"Ketashrooms : Synergistic Bliss: experience with Mushrooms & Ketamine (ID 35465)\". Erowid.org. Apr 6, 2006. erowid.org/exp/35465",
  "substance": "Mushrooms & Ketamine",
  "views": "9212"
 }
}
