{
 "id": 15794,
 "title": "The Way of the Jogger",
 "date": {
  "submission": "2006-06-14T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Mirth",
  "gender": "Male",
  "weight": "67 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Yerba Mate",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>PREPARATION:",
  "There are several ways of preparing the mate brew, but the easiest way (while still tasting good and with effects) is to use a teapot. First, I put the mate into the. Mate is very sensitive to 'extreme' heat, therefore I must not use boiling water (only hot), and I also pour a little bit of cold water on the leaves a minute or two before adding the hot water.",
  "I Let it sit for about 4 minutes or so. Letting it sit too long will cause it to taste very bitter. I filter out the leaves afterwards.",
  "It's also a good idea to add about a half teaspoon of honey to get rid of most of the bitterness.",
  "TASTE:",
  "One could somehow compare it to green tea, but Im not sure. What's certain is that it's got a very earthy taste that's just awesome in its own subtle way. It takes some time really appreciate it. A twist of honey makes it easier to like, I just don't overdo it.",
  "EFFECTS:",
  "I know that what Im about to write is partially contradictory to what the chemists say about mate, but this is what happens to me:",
  "At first I can feel that something is happening to my muscles, Im not sure what, but its kinda pleasant. Halfway down the cup I feel that my muscles start to relax, followed shortly by a mental relaxation as well. I sit there and feel peaceful for a while.",
  "I've also noticed that feelings of hunger tend to disappear very quickly.",
  "If I then decide to move a little around, like stretching and jogging, then after a minute or so I suddenly get lots of energy. Not like tensing up, I just get an energy kick and I can endure more and longer than before. And it really feels good to run and climb and such.",
  "But, if I choose to perhaps meditate, then that's no problem. If I don't show that I could need some energy, then I stay relaxed.",
  "Actually, one of the first times I drank it I laid down, and suddenly I found myself at the edge of sleeping.",
  "That's probably a coincidence since mate is reported to contain much caffeine.</p>"
 ],
 "erowid": {
  "id": "42008",
  "citation": " Mirth. \"The Way of the Jogger: experience with Yerba Mate (ID 42008)\". Erowid.org. Jun 14, 2006. erowid.org/exp/42008",
  "substance": "Yerba Mate",
  "views": "12696"
 }
}
