{
 "id": 15818,
 "title": "The Short-Term Drug",
 "date": {
  "submission": "2007-08-22T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Antikillerturkey420",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "Before this experience I had already experimented with other inhalents, a couple different pills (xanax, lorezpam, hydrocodone), and marijuana, so my expectations of drugs had increased dramatically from the last time I had taken inhalents (inhalents were my first drugs I've tried). My first experiences with inhalents earlier in the previous year were very disappointing, since I didn't get high at all. This experience was different.",
  "One boring afternoon I decided that I should take some drugs, but I was all out. No pot, no pills, no nothing. But I did notice a can of computer mouse cleaner that was full. So I took the can, went to my bathroom, and started inhaling. I used a long cylinder-shaped object to use as a pipe, and it worked very well. After taking a couple big hits, I began to really feel the effects. Everything began to become a fizz, everything seemed to be moving at a frequency that I could recognize. It seemed as if I could hear the frequencies, and as I got higher the frequencies became faster and more intense. It took me only about 10 seconds to start feeling the effects of the first few hits, and by the 30 second mark I was as high as a kite.",
  "I was feeling great, maybe a little confused and distorted, but great nonetheless. After I came down a few minutes later I decided that I should take some more, just a few more hits, right? Well those few more hits turned into probably 15-20 hits, and I'm talking about some pretty big hits. I was high for an hour, as I continued to take a hit every 30 seconds or so.",
  "I felt great though. It really did feel like I was as high as a kite, as the saying goes. I feared that my parents would hear me, so I did try to keep things on the DL as much as I could, but I really didn't care. The fear and anxiety really went away, and I just taking hits over and over and over again. After about 45 minutes of doing this I started thinking about the dangers of continuing taking so much, as it is definatly not a healthy thing. So after about 10 more minutes I stopped.",
  "It took about 10 minutes for me to come down, because I keep redosing. I started reflecting on how I felt during the experience, and I remembered that I felt very confused and disorientated, on top of the euphoria. But it did give me a euphoria that's hard to explain, and it was similiar to that of pot in many ways. I was suprised that it did so well for me, but I decided that I shouldn't do that again, as I feared for my health. My poor, poor brain cells.",
  "Later that day I tried some more, but vowed to myself that I would only take a few hits. And that's what I did, I took just a couple hits. But this time I was high for maybe a minute at most, and the high was not as intense as my first hits from my first experience. After taking a couple hits I decided it really wasn't worth it and that I should stop. I haven't used inhalants ever since then. Not because it gave me a bad high or anything (as my first experience was very pleasant), but I decided that there were better drugs out there that wouldn't harm my body anywhere near as badly.",
  "Overall I had a very good first experience, maybe a little too instense. But inhalants are not exactly the most healthy drug out there, and I am staying away from it for my health's sake. The euphoria I got was actually quite similiar to pot.",
  "Overall Experience- 6.5/10",
  "Highs: Gave me a great euphoria, very inexpensive",
  "Lows: Short experience, long-term health effects</p>"
 ],
 "erowid": {
  "id": "42108",
  "citation": " Antikillerturkey420. \"The Short-Term Drug: experience with Inhalants (ID 42108)\". Erowid.org. Aug 22, 2007. erowid.org/exp/42108",
  "substance": "Inhalants",
  "views": "7594"
 }
}
