{
 "id": 15814,
 "title": "1st Plateau Experience",
 "date": {
  "submission": "2001-03-01T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Robere",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "115 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>Drank (1) 115 mL bottle Robo Honey Cough.  Severe stomach pains ($5.00 for all that honey and corn syrup!!) for about 40 minutes. Wheat Thins helped enormously with the cramps. DXM started having effects after about an hour.  I got into some of my old records (vinyl), and had a very positive experience. I'm not a musician, but I tried to follow the suggestion of 'making music' by playing DJ and recording a mix tape.  This was the second time I've tried this dose; I had planned to do more, but I just can't stomach the stuff they put in the syrup.",
  "I would classify this as a nice plateau 1 experience: I had a gentle, soothing buzz that 'rolled' somewhat like E, but didn't falter.  If nothing else, I've discovered that I like 'Donovan'... Also, burned some jasmine and patchoulli incense which seemed to heighten the experience.  Stretching is also rewarding for me at this level, as is curling up on our overstuffed couch with the headphones on.  My motor actions were very deliberate. even at this low dose I would NOT consider driving or going among the 'normals'. No visuals at this dose, and I can't say this is _quite_ like anything I've tried.  It has elements of pot, heroin, ecstasy, but so far nothing like LSD, shrooms, or salvia (didn't like the last: felt like nitrous). The whole thing lasted a good 2 hours, with some time for chill down ('Scorn' or 'FSOL' worked well). Good luck, and stay safe.</p>"
 ],
 "erowid": {
  "id": "4210",
  "citation": " Robere. \"1st Plateau Experience: experience with DXM (ID 4210)\". Erowid.org. Mar 1, 2001. erowid.org/exp/4210",
  "substance": "DXM",
  "views": "12057"
 }
}
