{
 "id": 15811,
 "title": "Welcome to Hellraiser...",
 "date": {
  "submission": "2005-06-10T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bluemeanie",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": ""
  }
 ],
 "report": [
  "After trying 2c-b I was quite curious about 2c-T-7 and 2c-T-2. I obtained 50mgs of T-2 and kept it in my room until one night after drinking way to much, I decided at 1am that it would be a good idea to try some. 50Mgs was way too much for a new substance, but I had a fair bit of experience with LSD, mushrooms and salvia, so thought I would be fine.",
  "The threshold experiences started about half an hour later - no unpleasant apprehension - everything seemed fine. I dont actually remember when things went the opposite direction, but about half an hour later I attempted to walk to my room. I fell over because I could not adequately work out how to balance and support myself - something I've never experienced before. I landed with a painful thud and suddenly my body felt terrible - my stomach ached and I felt very unwell. My vision seemed somehow obscured by this strange greenybrown smudge. My friend asked me if I needed help, but I was adament that I just needed to be left alone.",
  "Things started to get really weird - I started to get this strange feeling of being too far out of my head - like my visual perception was about two inches out in front of my eyes. It was a very disconcerting and uncomfortable feeling. Then the greenish smudge started to get thicker and thicker until my vision was totally obscured by this thick green black landscape that reminded me of snake skin or the walls in the movie Hellraiser. I calmed myself and reminded myself that it was all just the 2c-t-2 and that it would end in no time. I had been through rough mushroom experiences so knew that sometimes youve just got to ride it out.",
  "Four hours later nothing had changed - the intensity was identical - I was still positionally disorientated, so couldnt walk around since I couldnt work out up or down, my vision was still completely obscured by green brown snakeskin blotches, I still felt very unwell physically, and I still had that uncomfortable feeling of being outside my eyes.",
  "Eventually, my girlfriend dragged me to bed and sat down next to me. I was beginning to be able to see through the green hellraiser stuff, but everything I could now see was distorted in the most incredible ways. My girlfriend, who I think wanted some lovin', looked like a wobbling mass of blue liquid - which I found incredibly revolting and which made me shudder. He laughter was bizarre to me and greatly alarming. When she realised that I was freaking out a bit, she tried to calm me with touch, but I couldnt stand to be touched at all, and got up to walk away - only to again realise that up and down no longer made sense. She helped me back on the bed where I lay for about seven hours, feeling completely unwell physically (like I was poisoned), watching my room fluctuate between hellraiser's hell and a liquid mass, unable to discern direction in any way, and feeling downright sorry for myself.",
  "The weird feeling of being outside my head didnt go away for months - and it often returns even now when I'm getting a migraine. The halluciinations lasted until 11am the next day - it was a long haul, and I didnt feel emotionally stable for another week after that. I got hot flushes and dizziness.",
  "In short I dont think I enjoyed any aspect of the experience - it has actually put me off psychedelics in general. The feeling of being poisoned was overwhelming and when combined with the strange 'out-of-body' feeling it was like a long, drawn out migraine.",
  "Following this experience, a month or two later I came down with a chronic nerve illness. Whether this was connected or not I've often wondered, and it is possible I guess, since its only just been around for a short period."
 ],
 "erowid": {
  "id": "42092",
  "citation": " Bluemeanie. \"Welcome to Hellraiser...: experience with 2C-T-2 & Alcohol (ID 42092)\". Erowid.org. Jun 10, 2005. erowid.org/exp/42092",
  "substance": "2C-T-2 & Alcohol",
  "views": "12667"
 }
}
