{
 "id": 15813,
 "title": "Forced to Swim in Hexagon Ocean",
 "date": {
  "submission": "2007-08-02T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "SwAY",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 leaves",
   "administration": "buccal",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>I have been on a mission to experience those drugs which are not mentioned or oblivious to the public. A few of these Drugs have included Nutmeg, Salvia Divinorium, Syrian Rue, and a drug known here as Hells Bells. I am writing this to mention my experience with Salvia, everything I've tried seemed like nothing else I've experienced but salvia stood out. It wasnt just the trip but it was the erie feeling of which I felt punishment and loss of authority over my own mind but then felt joy and incredible satifaction including that night and the following days. In a way those month after I experienced this I became scared of it, I desperately feared it. It wasnt just a drug anymore. It was as if a entity had my mind and thoughts on a leash and whether I  disobeyed or obeyed was whether that leash was pulled or not.",
  "I read material on this drug excessively and scrutinized every little detail of what effects it had and on how to obtain these affects. I had the option of buying extract or buying leaves. I bought leaves seeing that affects can last longer and be obtained sometimes greater then that of smoking.",
  "I left it in the box it came in for around a week",
  "Approx.",
  "10:00 pm: I finally had the time to take it. Despite warnings of absolutely needing to have a sitter (someone to watch for my safety) I went along and rolled two quids 7 fully dried leaves per each quid. And soaked them in cold water.",
  "10:15 pm: I took one quid and began to chew it, they taste wasnt pleasent at all I would suggest a odd tasting fish would be equivelent. For 15 minutes I chewed on the quid not swallowing or spitting any saliva at all. 10 minutes in, the quid had been shredded. I was now swishing saliva inside my mouth. It became hard to hold inside as saliva kept overfilling my mouth but I kept almost all the saliva inside.",
  "10:30: Spit all the saliva inside mouth out and took out the last quid from the cup of water. Repeated what I had done with the first quid.",
  "10:25: Began feeling something, it was vague and hard to describe.",
  "10:30: Spit out the second quid and spit. Felt something but was very undescribably. Almost like daydreaming yet with out the dreaming",
  "Approx. 11:15: As I was in this dazed state it seems that my eyes began either open eye hallucinating or twitching, I personally think it was twitching due to it looked like the same light visuals of closing my eyes and rubbing them but more intense and rapid. I was motionless lying on my stomach at this time.",
  "11:30: I began to have other visuals along with either the twitching or the hallucinations. Those rapid lights became a red and orange ocean of Hexagons all connected and forming waves. I was following something that had resembled a worm or snake made out of hexagons through an ocean. It wasnt only visual stimulation but also I felt touching stimulation. I felt each wave as I went over and down them along my sides and back. What added this effect I consciously notice afterwards was I had a rotating fan in the room. Showing the my reality and break from reality became in unison at a time. My eyes were opened at this time.",
  "Unknown Time: I mentally forced myself to tune back into reality resulting in a headache and noticing the my eyes seemed very stressed.",
  "2 minutes later: I let myself back into that trip of Hexagons but this time I felt no wave and saw no snake.",
  "Unknown Time: Instantly I came to this odd picture of two black ovals vertical set on a white background, it resembled those oval eyes you see in cartoons sometimes. The white background began filling from the right side with a black liquid. Knowing that salvia sometimes causes those who experiment with this to think that there's an entity that usually seems to guide and control their thought I took this as a sign. I began to think it wanted something, it kept filling with ink and soon covered those oval eyes. I thought to myself it must mean something those eyes, black ink overflowing the vision. I came to the conclusion that it wanted me to close my eyes. Remembering of reading that it is best to give into its demands. I closed my eyes.",
  "Unknown Time: This is when it came to its peak of Hallucinations. Yet I always ponder wether the next visuals I had were hallucinations or very vivid dreaming. Instantly I was in the air not flying but more like floating down. At the time I was not too high but I would consider it to that of a 50 story building. As I was floating down I saw jungle almost everywhere. A river and a waterfall were slightly to the left below me. And to the right near the bottom of the waterfall I saw a structure. It looked like a squared structure. As I started to float down I noticed that the squared structure was a very small squared castle like building. Everything was beautiful. As I started to come closer and closer to the ground. I started to worry that I was gonna hit the ground but instead of hitting it I went through it. I went through it and looked back upward. I could see everything above ground from the bottom up. I saw the bottom of the river and the empty castle. I then snapped back into reality from wherever I was.",
  "Uknown time: still seeing open eye visuals of the hexagon ocean I picked up the phone and called my girlfriend. I remember telling her that I was scared and this it was amazing explained in light detail my trip so far. I didnt say much I noticed their were long periods of silence. Talking was hard and annoysome usually coming out in whisper and studder. Her talking was also annoysome. It seemed that actual noise created a kind of disturbing feeling. I told her I would call her when it ends and I hang up.",
  "1:20 am: I go back into my ocean of hexagons over and over again snapping back into reality whenever I pleased. Although when I did my eyes and head began to throb. I then notice how late its gotten and that I have school tommorrow so I choose to try and force myself to stay in reality and fall asleep. Soon I begin to understand the entity and what others mean of obeying it. The trip was still coming down when I wanted to fall asleep. Sometimes I dazed back into my ocean of Hexagons but forced myself back into reality. After awhile I began feeling major itching coming from parts of my body while in reality. As anyone would do I scratched it and instantly I slightly convulsed. I didnt know what this meant until it seemed that everytime I scratched I would convulse. The itching didnt stop. I began to get scared. I realized that the entity didnt want me to fall asleep, it wanted me to respect and finish my experience. I felt now that I wasnt in charge anymore I just took orders. I finished my experience and finally got a few hours of sleep.",
  "Days following:",
  "*For a few days I became extremely sensitive to daylight and noise",
  "*felt Enlightened the next few days. Not any feeling of being high but mentally I felt amazingly happy.",
  "*Grew a great respect and fear of Salvia Divinorium.",
  "This experience involved learning and enlightning. It almost seemed to change my moods permanently for the better. I warn though this drug is its own master and at times became my master.</p>"
 ],
 "erowid": {
  "id": "42095",
  "citation": " SwAY. \"Forced to Swim in Hexagon Ocean: experience with Salvia divinorum (ID 42095)\". Erowid.org. Aug 2, 2007. erowid.org/exp/42095",
  "substance": "Salvia divinorum",
  "views": "4597"
 }
}
