{
 "title": "Like a Feminine Version of Being Really Stoned",
 "author": "Vicious",
 "citation": " Vicious. \"Like a Feminine Version of Being Really Stoned: experience with Nutmeg (ID 15827)\". Erowid.org. May 20, 2005. erowid.org/exp/15827",
 "substance": "Nutmeg",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "17.5 g",
  "oral",
  "Nutmeg",
  "(ground / crushed)"
 ],
 "report": "<p>I can't beleive all the fuck-ups giving a bad rap to all these wonderful drugs. Especially nutmeg. It is this simple:  I've tripped a number of times on nutmeg and noticed that I'll easilly finish off a 64oz thing of Gatorade (not pop), and then not experience cottonmouth, nausea, or ANY negative effects at all.</p><p>Also in regards to taste. I found it pretty nasty, but not as much as others led on. You won't catch me shoving teaspoons of powder down my throat though. The first time I tried nutmeg, I dumped 15 grams in a big cup of soda, and well, it was nasty as fuck. The far superior way to do it is to take smaller parts of what I intend to take, mix and ingest those one at a time. The next time I tried nutmeg, I split the 20g of what I planned to get fucked up on into 4 parts, and dumped one in a cup of any drink, finished that, dump the next, drink, etc. Not only did I get it down overall faster, but I also went into the trip without the nauseating aftertaste already sickening me.</p><p>Another thing that affects the quality of my trip is mindset. If I do feel nausea, I try to acknowledge it objectively rather than assume 'oh, I've fucked up', 'this will be horrible', or 'oh christ, I'm gonna die painfully'. On many occasions I'd be on something, feel shitty, keep a zenlike or positive mindset, and have the nausea fade away, leaving only the bliss of drug-induced fuckedupness...ahhhhh. I don't beleive in anything, but there's a lot we don't know about the mind, and it's easy to understand that if I panic or dwell on the nausea, then it will continue and probably get worse.</p><p>My take on the nutmeg experience:</p><p>On an empty stomach, I noticed some effects within 20-30 minutes. A gradually increasing stoned-type feeling, with an emphasis on happiness and lightness. I wasn't supplementing it with weed or anything at the time so what I felt was just the nutmeg. This feeling came back in random waves with varying degrees of intensity. I did kill the buzz at first by focussing on something (a report for my college class I think), and I regretted it because the effects were less obvious afterwards. It does come back though, and it will be a few (3-12 usually) hours before its intensity peaks. I personally didn't hallucinate while on nutmeg, but it could be the dose, or any number of things that prevented that. I have seen things on other otc (diphenhydramine), and illeagal drugs, but not yet this.</p><p>Overall what I experienced is like a feminine version of being really stoned. It seemed less aggressive than weed, but powerful in its own way. A 100% positive experience.</p>",
 "year": "2001",
 "id": "15827",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-05-20T07:00:00.000Z",
 "views": "24595",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "17.5 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 }
}
