{
 "id": 15828,
 "title": "Do Not Overdose!",
 "date": {
  "submission": "2005-07-25T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "javisst",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(plant material)"
  }
 ],
 "report": [
  "One day I read that nutmeg was usable as a drug, and I got really interested and started to read all the experiences I could find. I didnt think it would be powerful at all, after what Ive heard from my friends. Me and two of my friends bought 48 grams of nutmeg nuts. We ate this and it didnt give any effect (4 nuts each). We bought whole nuts from the convenience store, but I think these nuts miss the magic ingredient.",
  "My friends thought that nutmeg was total bullshit, but I didnt think so. Thursday I saw a guy who was selling fresh nutmegs. I bought 75 gram (13 nuts) for about $2,5. The different thing about these nuts was that when I tried to cut them with a knife, I could see some kind of black liquid appearing, something which hadnt happened the other times. I cut the nuts in small pieces and put them in my mouth and started to chew: 6 nuts equalling to about 35 g. Well, here is the stuff you probably want to read:",
  "(I was having a test in German the following day. Take the test high, and get high scores (Redman) :p )",
  "00:45 - 6 Nuts ingested",
  "01:00 - Nothing except nutmeg burps. Went to bed.",
  "06:30 - My dad tries to wake me up. I try to walk to the bathroom, but it feels like if my body weighs 300 pounds. When I got to the bathroom I was really nausea and I tried to puke. My heart raced like it have never done before. I was so dizzy that I felt absolutely NO GRAVITY. I told my parents that I wasnt feeling any well, and got back to my bad. (This was extremely difficult, I crawled back into the bed.)",
  "Around 13:00 - My mom wakes me up and want to give me something to eat. I dont remember much of this, but I remember that I tried to eat while I was in bed. Suddenly I see white figures flying around in the room and my vision was flicking. Seconds later I was sleeping.",
  "I woke up on Saturday at 06:45. I had been sleeping from Thursday night till Saturday morning. And when I woke up I was still dizzy and my vision was totally fucked. I wouldnt see straight and the image was very blurry the entire day.",
  "Summary:",
  "This was a WAY to high dose for me. If the house would have caught fire, I would have had NO CHANCE to get out. I was glued to my bed. Nutmeg forced me to stay in bed for over 30 hours straight. I was really calm the entire trip, so I got out of if quite easy. But if I wasnt that calm the trip would have been hell. I am going to try it again, but this time with half of what I had now. This was the most powerful thing I have ever done. USE AT EXTREME CAUTION!! You dont want to end up in your bed the entire weekend. Or at the hospital!",
  "And I dont get it when people say that nutmeg resembles marijuana effects? On that Saturday when I woke, I was still dizzy from the nutmeg and I drank 9 beers (0,33l) and smoked little less than 1g in one joint. After the joint I could barely stand and think straight, but the nutmeg was so MUCH, MUCH stronger. I think this drug is for people who have tried a lot of similar drugs, not by teenagers who want to find a legal way of getting high (as myself)."
 ],
 "erowid": {
  "id": "42155",
  "citation": " javisst. \"Do Not Overdose!: experience with Nutmeg (ID 42155)\". Erowid.org. Jul 25, 2005. erowid.org/exp/42155",
  "substance": "Nutmeg",
  "views": "30949"
 }
}
