{
 "id": 1583,
 "title": "Pleasant But Unexciting",
 "date": {
  "submission": "2002-05-28T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "fairnymph",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "IV",
   "substance": "4-Acetoxy-DET",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Background:",
  "I've done a number of other psychedelics -- LSD, shrooms, 5-MEO-DIPT (foxy), 5-MEO-DMT, 2-CT-7, ketamine as well as most other recreational drugs. I am female, weigh about 115 lbs, and have a fast metabolism. This was my first time trying 4-AcO-DET. I have a high natural tolerance to many psychedelics thus my reasoning for IVing.",
  "Dose: 10-15 mg IVed (eyeballed out of 20 mg measured dose -- note: do not try this at home!)",
  "Duration: approx. 2.5 hours",
  "2:30 am",
  "I IV the stuff and about 5-10 seconds later feel that strange buzzing/tripping feeling that is unique to psychedelics. I can feel that there is a drug in my system but by no means does the it hit me all at once. I still experience a fairly normal (though sped up) come-up.",
  "3:00 am",
  "I am hanging out with two friends (both tripping on the same) in a dorm room, lying on couches chatting. I feel rather giggly and quite altered, and my thinking is somewhat confused, but if I make an effort I can still think fairly clearly. I have a body buzz that is fairly strong but not particularily unpleasant. Very mild euphoria and slight empathetic quality. My stomach feels kind of tight/knotted but I am not experiencing any nausea. I am thirsty and experience mild dry mouth. Mild time dilation.",
  "3:15 am",
  "By this point I have fully come up and plateaued. Body buzz is stronger and now very slightly overwhelming and thus mildly unpleasant, but not so much that I feel dysphoric. I'm still feeling in a positive mood. I'm not seeing any visuals per say, other than that things look 'prettier' than normal. My eyes like looking at things/colours/lights and my ears like listening to music, but there nothing appears distorted or altered. The knot in my stomach is still present but has weakened slightly. The time dilation seems to be even less mild than when I was coming up.",
  "4:00 am",
  "I'm still pretty much in the plateau. Confusion is mild but not overwhelming -- I can still overcome it at will. I'm feeling less giggly but still positive. I get into a good conversation with a friend and feel happy about bonding with him. The body buzz is still present and sligthtly annoying but I've gotten used to it. The knot in my stomach has virtually disappeared.",
  "4:15 am",
  "I've definitely started coming down, but it's a gradual, smooth comedown and I'm having a good conversation with my friend still. The effect of thinking about things in an intense/creative way (as is typical on many psychedelics) is present, though rather mild.",
  "5:00 am",
  "I am pretty much completely down, and still feeling positive and in control. I drive home and sleep without any problems. No effects are lingering the next day.",
  "Summary:",
  "Overall, I found the experience to be interesting and fairly pleasant. I enjoyed IVing as I believe doing so prevented any potential nausea, and it also made for a quick come up -- which is always preferable to waiting around for the drug to hit you. I liked the fact that this drug did not last very long (about 2.5 hours) and I liked that there was not much time dilation (as with acid and shrooms).",
  "I found the drug to be fairly similar to shrooms, though not as intense mindfuck/visual/audio-wise -- also the body buzz was stronger -- and no nausea. I don't think I would try this again, however, as I didn't find the experience to be overall that enlightening or that euphoric -- and there are other drugs I could be doing which would offer me more in these respects. Also, I did not like the intensity of the body buzz. Were it not for this, I would possibly consider a higher dose in hopes of obtaining a more shroom/acid like experience.",
  "This was my first time IVing a psychedelic, and I must say it is the best way (IMO) to do a psychedelic -- I think it offers many benefits (comes on immediately, cost effective, shorter trip duration, cleaner/purer high, reduced gastrointestinal effects) over other methods of administration.",
  "Warning: I don't suggest that anyone else try IVing a dose this large. It turned out to be a fairly mild trip for me, but I typically react abnormally to psychedelics so it would not be wise to model your actions on mine."
 ],
 "erowid": {
  "id": "14968",
  "citation": " fairnymph. \"Pleasant But Unexciting: experience with 4-AcO-DET (IV) (ID 14968)\". Erowid.org. May 28, 2002. erowid.org/exp/14968",
  "substance": "4-AcO-DET (IV)",
  "views": "14452"
 }
}
