{
 "title": "Too Much Bupropion",
 "author": "Tir",
 "citation": " Tir. \"Too Much Bupropion: experience with Bupropion (Wellbutrin) (ID 15844)\". Erowid.org. Jul 11, 2002. erowid.org/exp/15844",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "900 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "15844",
   "Female",
   "",
   "Not Given",
   "Jul 11, 2002",
   "61080",
   " "
  ]
 ],
 "report": "<p>\n[Editor's note: Dosage and Administration instructions for Bupropion clearly state the maximum daily dosage as 300mg/day, taken as 100mg tablets every 8 hours. Following one month of treatment, the dose may be increased to a maximum of 400mg/day. The following account serves as a reminder to always check with your pharmacist and other reliable sources of information before blindly taking pharmaceuticals prescribed by your doctor or psychiatrist.]</p><p>I was recently prescribed Wellbutrin to treat 'severe depression with psychotic features' and ADHD. She was also wondering if I might also be bipolar, because I showed many of the signs of it. I was started at 100mg, then 300mg, then 700mg, and finally 900mg. My psychiatrist upped the medication every two days until I was at my current dose (900mg, once per day).</p><p>I was doing fine for the first week of medication but while at school after taking the 900mgs earlier that morning I had a very 'interesting' reaction. I was sitting in math class around 9am paying attention (for once). Then everything got *really* bright and loud. I started having very stong hallucinations and thought for a time that I was in a coffin being buried. I have used other hallucenogens but this was not anything like those experiences. It was very frightening because I was not expecting this to occur on a medication that was prescribed to me by a well-known psychiatrist.</p><p>This lasted for about 8 hours, not stopping until I was walking home at 5pm  (accompanied by a friend who knows about my medications and was able to realize that I had definatly overdosed). During that time I found out later from her that I had been sent to the nurse for a drug test because I looked really stoned and had VERY dialated eyes. She had determined that I was on cocaine and told my family. Luckily, however, they were able to explain that I was on a very high dose of bupropion so I didn't get expelled. I went to the psychiatrist later that night and she got rid of the Wellbutrin and put me on Ritalin and Zoloft. After that I had no experiences like that and I am quite glad.</p><p>To anyone who considers using bupropion recreationally: This drug is NOT going to give you the hallucinations you want. It is a terrifying experience and to get those kind of reactions you need to take a LOT of it and at that dose it is very easy to end up dead like I almost did. Please, *please* do not use this as a recreational drug! If it is prescribed to you be very careful with it and if you have *any* bad reactions tell your doctor and get them to change you to something else.</p>"
}
