{
 "id": 15844,
 "title": "The First Time: Psychogical Aspects",
 "date": {
  "submission": "2000-06-22T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Thor",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "A friend of mine gave me an eighth of an ounce for my birthday. After doing a lot of homework on advice (set and setting, etc.) I decided to split them with someone I trusted. This was my first time and, so far, my only shroom experience.",
  "I did not experience anything unusual within the first hour or so, possibly even two hours. What I did notice (upon analyzing the events later on) was a slowly rising giddyness and an inability to hold a train of thought for very long. During the course of the walk from where my friend and I took them to my apartment I would forget a line of thought then it would bubble up maybe five, ten minutes later. The giddyness felt something like being drunk, only with hyper overtones.",
  "The whole night I did not experience any visuals beyond some meager trails. But the mental aspect was...illuminating. Over the course of the next few hours I was to go through a seemingly unrelated series of emotional states, such as extreme confidence, paranoia, bewilderment (did I mention paranoia? more on that later). I ran into the friend who had given me the shrooms that night, after I'd parted ways with my shroom partner. (Newbies: it is not recommended to separate from your partner(s) at any time during the experience).",
  "My provider expected me to be having vivid hallucinations and to be unable to separate hallucination from reality. Instead, my mind felt like it was in some kind of uncontrollable turbo mode. I found myself pacing around at one point. I think the calmest moments I had during the peak was, perhaps pathetically, while listening to Jimi Hendrix. You think that stuff is good when you're sober? It spoke to my soul in those moments. Then my provider distracted me and wanted me to see something cool. Another note: when somebody's trippin', just let them do whatever, as long as they're not endangering themselves or others, of course. It tends to disturb and already teetering emotional control and will make them extremely agitated.",
  "I could have sat there for hours, just drinking up Jimi's riffs, with a stupid smile wide enough to make my ears fall off. Well, he (my provider) had to go to sleep. It was late for him, so I moved on. During the walk from his location to mine, I got that classic feeling that people were looking at me. Not like they thought I was high, however. It was like I felt for the first time I saw, all around, people looking at me when they thought I didn't see them looking. Who knows what that was all about. It got to the point where I felt I was altering events just by my presence, like I was a mote, determining possibilities, and people whirled around me and did things they would not have done had I not been around.",
  "I went to see some friends for a few minutes, to see what was up. I felt uncomfortably aware of their personae. I felt as though I could divine their thoughts from their facial expressions during a discussion, in those moments when they were not talking or waiting to talk, merely watching the conversation themselves. Well, I felt really obvious and eventually ended up back at my apartment, alone. This is where the paranoia really took hold. In retrospect, I believe what I was doing was resisting the fading away of identity. Don't get me wrong; I still knew who I was, but only on an intellectual level. After about ten minutes of struggling here, I lay down and purposefully blocked out all thoughts. I replaced those thoughts with music I just created in my head (I did music in primary school and all of secondary school). It's not a hard thing to conjure music under those conditions. I just let Jimi take over for a while, turning up the mental volume whenever the heebie-jeebies got too close up. Then I expierenced something magical. I told myself to 'Just be.'",
  "For the next hour or so, as I drifted off to sleep, Jimi's extended jam faded away to be replaced by--silence. No thought. No emotions. Just calm. Relaxation. I let my mind drift naturally after a while, and I got some of the most unusual aural sensations I've ever experienced. Imagine your brain as being equipped with full-surround sound. I heard sounds I didn't expect or force. Rumbling and revving motorcycle engines scooting off from my left and into the distance. Snatches of conversation like a television turned up loud, then quiet.",
  "Gradually, these sounds seemed to fill in a picture that eerily matched the conditions outdoors. This was a late saturday night in a college town; people still walking around, milling, conversing. I saw those streets, as if I was walking into a dream. And with the escalating rapidity of water going down the drain, things became more vivid, more vivid, more vivid, then--pop! The sensations had become so real that I had got mentally jarred and came out of it.",
  "To this day I don't what to make of that event. I'd always had a hopeful curiousity about out-of-body experiences, perhaps this was merely some psychological manifestation of Freudian wish fulfillment. Or maybe it was actually my spirit floating around there. That would have been truly awesome, however unprovable, and I would take shrooms again in the hopes that I could recreate that experience.",
  "So, the brief version: giddyness evolving into a whirl of mental activity, no audiovisual hallucinations, some paranoia. Oh, and I had a little talk with myself, speaking alone to myself in the third person. That was unsettling. But no lasting side-effects. I felt fine the next morning.",
  "Oh, one more thing before I go to bed: I had a lot of grand notions about levels of being and existence; I envisioned interesting physical models to represent the levels, and where humans fit in. I was absolutely sure of our place in the midst of a multi-planar Universe full of all different kinds of sentient creatures both bodily and ethereal. That chiseled-in-stone conviction was nothing more than a bemusing notion the next day. My interpretation: don't let sudden 'revelations' about the Universe allow you to do things in public that you wouldn't usually do. I didn't do anything stupid, but I saw how easy it was to go flying off the handle, so to speak."
 ],
 "erowid": {
  "id": "422",
  "citation": " Thor. \"The First Time: Psychogical Aspects: experience with Mushrooms (ID 422)\". Erowid.org. Jun 22, 2000. erowid.org/exp/422",
  "substance": "Mushrooms",
  "views": "3077"
 }
}
