{
 "id": 15852,
 "title": "I'm Set Free",
 "date": {
  "submission": "2007-07-24T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Steelcow85",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "capsl"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "capsule"
  }
 ],
 "report": [
  "The Setup:",
  "The night was going to start out with a trip to a downtown club with three of my good friends. We were armed with an arsenal of vodka, scotch, and absinthe. Around 10 pm we get in my car and prepare for the long drive to the club. About 2 minutes after leaving my friends house we passed a small shopping center, a popular hangout spot in our area, and decided to cut through it to see if our Asian friends were there. My friend Chris especially wanted to stop because it was his last night in town as he was going to live in California for a while until things at home settled down.",
  "We entered the parking lot and saw a big group of our boys hanging out and smoking cigarettes, we join them for a quick chat, and learn that they are about to buy some good quality mollies, supposedly pure MDMA capsules. Chris orders one, but I hesitate and decide to just drink tonight. We learn it will be an hour wait, so much for the club.",
  "Pregame:",
  "Our foursome drove back to J.'s house to drink and hang out, spending some quality time with Chris. We called 7 or 8 of our good friends over, and while waiting form them I broke open the absinthe. I poured about 50 ml of Absinthe (72% alcohol) over some sugar, lit it on fire, added some water, and took a sip. Wow! That tastes bad.",
  "About 30 minutes later I was feeling the effects quite strongly. A great alcohol body buzz, but with a sense of clear-headedness and mild euphoria. With my inhibitions significantly lowered I call up our E connection and ask for another. 'It's Chris's last night' I argued, and at $15 bucks a pop how can I go wrong. At 11 pm we pick up the pills and end up dosing at 11:23. The capsule looks full, and supposedly contains 200-250 mg of MDMA. All of my friends are over now, and I am excited for a fun, bonding roll.",
  "Xtatic:",
  "While waiting for the effects to come on we all head to the basement and begin to dance. Approximately 25-30 minutes after dropping the pill I look to my right and see Chris lying on the couch with his eyes closed, mouth in the shape of a smile, something I haven't seen from him in a while. I look down at my body, and a beautiful sense of comfort flows over my limbs, as if someone was pouring warm pleasure all over my arms and legs. Time for a walk.",
  "Me and Chris walk in the clear night, smoking a cigarette, and sharing our thoughts. Everything is beautiful, from that house to that telephone pole, and Chris begins telling me how profoundly the drug has opened his mind. Normally depressed he described to me the strongest feeling of contentment and acceptance of his hard times. It was hitting me a bit more slowly, but as we sat on the curb smoking I knew this would be different from any of my past ecstasy experiences.",
  "Back to the house, waiting for my best friend D. to arrive. She was at a keg party, and all I could think about was how much I wanted her to safely arrive, so I called her several times making sure she was all right driving. We waited outside until she was dropped off, and when she came I thought I would explode with joy, but I struggled with words, feeling them inadequate to explain to her how much she meant to me. We embraced and I knew we understood without words. In holding her I felt the energy passing between us, uniting us, and expressing all of our feelings perfectly. Relieved, I decided it was time to dance.",
  "Dancing was amazing. The sound waves passed through my body, each one like an orgasm in my arms and legs. I was the music and it was me. Others watched on and cheered as we became one, and after 10 minutes or so I sat down and started talking. Ecstasy is the must unselfish drug ever. It's all about love, so I talked to my friends and made some new ones.",
  "This was truly a pristine moment. I felt as if my friends and I were going to change the world, together. We sat and hugged and talked and laughed and all I could feel was joy and understanding.",
  "At this time D. was feeling sick so I went with her to the bathroom so she could throw up. Normally I could never stomach this. I had a conversation with her several days earlier about how when I became a father some day I would never be able to clean up my kid's puke. But I understood now, the love that would make me do anything for my friends and family. So I gladly waited with her trying to comfort her, and then went back to conversing.",
  "A small more bit of background info. I am addicted to drugs. Painkillers mostly, but for the past year or so I have needed to be high all the time. I became a slave, tried to break free, failed, and remained a slave until this day.",
  "I'm set free:",
  "The talk moved to my friends' concern for me. My drug habit. Thoughts came easily, and I listened intently and was touched by their concerns. My bonds were broken, I felt lighter, relieved, and touched by their promises of support. I wanted to get on a loudspeaker and tell the entire world that I was free! Originally I was going to title this report 'Ecstasy Saved my Life', but I thought, 'What the hell am I thinking, my friends saved my life'. Drugs come and go, they make you happy for a few hours. But friends, they'll make you happy for an eternity, will embrace you, share the energy passing between you, and give you the best high imaginable."
 ],
 "erowid": {
  "id": "42219",
  "citation": " Steelcow85. \"I'm Set Free: experience with MDMA (Ecstasy) (ID 42219)\". Erowid.org. Jul 24, 2007. erowid.org/exp/42219",
  "substance": "MDMA (Ecstasy)",
  "views": "2996"
 }
}
