{
 "id": 15853,
 "title": "It Is Indeed a Pauliverse Afterall",
 "date": {
  "submission": "2007-04-12T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mike",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "LSD: A crystalline compound, C20H25N3O, derived from lysergic acid and used as a powerful hallucinogenic drug. Also called acid.",
  "The Players: Frankie,Robbie,Matt,Brian,Matt in the Hat,Myself.",
  "The night was calm and fresh, the type of weather you'd expect from a small beach front community in the middle of April. The Isla Vista sky was ravaged by stars and the moon hovered above us like a sniper up in the trees. A perfect evening to ingest some strong ass hallucinogenic drugs. Sure, why not? We had nothing better to do that Monday.",
  "'So you place the tab on your tongue like so. Try putting it under your tongue. You'll absorb more of the acid that way.' College is 1/3 learning about your major, and 2/3 Drugs 101. But I have an excuse. I'm a liberal. Whatever that means.",
  "There is something surreal about walking in the street at night with your friends, talking about something profound such as music, all while waiting for the acid you all just took to kick in. But whatever, I was always more into Expressionism anyways.",
  "Sitting. Waiting. There's a lot of waiting and sitting and looking around for clues that I'm starting to trip on acid for the first time. Tick. Tick. The clock is ticking. The Beach Boys on Robbies wall are starting to move. Yea. I might be starting to come up. Lets all smoke some weed like a family. We're such hippies.",
  "Theres a knock on the door. Its Brian. He enters the room with an awkward grin on his face and a bag of food in one hand. 'Im starting to trip the fuck out. The lady at the sushi place confused me. I think there was someone in front of me named Ryan. Or it could have been Brian. You can clearly see my dilemma.'",
  "Time to smoke a cigarette. Sitting outside on the steps leading to the second floor of Robbies apartment complex, inhaling and exhaling smoke, I notice that I am starting to see everything in small segments. Sort of like my eyes are taking snapshots of the world around me. Up, up, up.",
  "I enter the apartment once again with the same awkward grin Brian had when he walked in a while ago, look around, and finally answer mans life long question: What would the world look like if all matter were made out of liquid? Everything was a wave moving up and down, up and down, up and down, then suddenly the room would violently jerk for a split second as if there were an earthquake with no sound.",
  "Knock, knock. Its Frankie. After taking the acid, she biked home so she could shower and gather her things as quickly as she could so she didnt have to bike back while tripped out. I dont think that worked out exactly as she planned but she was all in one piece. Now that everyone was in one room together, we were ready for our adventure to begin.",
  "'My mania is chill.' Matt is clearly, what in-the-know college students call, tripping balls. What I should have mentioned earlier is that Brian and Matt each took 1 1/2 tabs, 1/2 a tab more than everyone else. But it was good to know that even though Matt was slowly going crazy, his mania remained chill. Don't ask. I wouldnt know how to answer anyways.",
  "We have entered Pauliverse. The perfect centerpiece for any acid trip is a poster of Paul McCartney with multi-colored cartoon animals bouncing around him mounted on the ceiling. Now thats no joke. Someone actually thought this would somehow sell. And it did. And now we had Paul staring down at us the entire night as if God were looking down on his from Heaven. If you stared at him long enough, his face would transform completely and he would look like a totally different person. At one point Paul had one of those really thin mustaches and a flat top haircut. He looked classA.",
  "One of the other many in adamant objects that would rule our universe that night was the all encompassing Moshi. And yes, Moshi is a proper noun. Now what is Moshi, you might ask? Good question. Moshi is what makes any drug experience that much better. Moshi relaxes and soothes the brain. Moshi is red and blue cloth stuffed with tiny balls of something. Don't laugh. If you felt it, you wished you could have one, too. Now the reason I even mention Moshi is to lead into the next segment of the night. According to Matt in the Hat, the word 'Moshi' sounds a hell of a lot like the word 'ocean.' And even further, the sentence 'Pass me Moshi', sounds like 'Let's go to the ocean.' So there we were, six kids on acid walking noisily toward the beach at 10pm on a Monday.",
  "'Where are we going again?' We had to keep reminding ourselves where we were going. To Moshi, I mean the ocean. To the beach. To the beach. Dont laugh. Cops. Shit. Silence. Its amazing the ability cops have to make a group of kids tripping on acid shut the fuck up for 10 min. Or it could have been 4 min. Time was of no relevance at that point.",
  "Even though the cops were out of sight, thanks to Matt and his chilled mania I thought they were following us until we reached the cement hill leading to the beach. I looked back before descending to the ocean in the clear. Looking down to the shore form the top of the steps that lead to the sand, I didnt know what the fuck was going on. I saw water but not the same as before. Everything looked like a glob of black. Darkness. This wasnt as cool as I thought it was going to be but the fresh air felt good against my face.",
  "Quick exit. Apparently Robbie was either tripping out or wasnt impressed by the Moshi Ocean so he started walking back up the hill. I was indifferent about the whole situation so I just followed. As we were all walking back up the hill, out of the mist and ambient glow that stood in front of us appeared a group of people, seemingly out of nowhere. Now this freaked the fuck out of me. I didnt know whether these people were real or not. I looked over to Frankie and asked her what the fuck was going on. I think she was as freaked out as I was because she didnt seem to know either. For some reason Michael Jackson's Thrillar video came to mind. They all seemed like walking zombies that were ready to attack us and eat our flesh. I exaggerate. As soon as we all moved forward towards the crowd of people that were on top of the hill, they all quickly dispersed, which only made me even more confused.",
  "The Outside World only got stranger. We all decided that it would be a good idea to just head back to Robbies apartment. We took a short cut through a park. Bad idea. Just as Matt in the Hat mistook 'Moshi' for 'ocean', I mistook a man walking a dog for a man mowing his lawn. Don't laugh. As I saw this, I realized that I didnt know where the fuck I was. The confusion only lead to fear as in my own delusional mind I realized that we had all somehow ended up in someones back yard and we were going to get caught any minute. I could just picture someone coming out of their house, finding six kids wandering aimlessly in their backyard, and having to talk to cops while on acid. Just as quickly as this hallucination began, it disappeared and I found myself breathing again. Phew. 'Where are we going again?' Oh yes. Robbies apartment.",
  "We are about to enter the Pepsiverse. As we inched our way forward to Robbies apartment, Frankie and I decided that it was time to get some Pepsi. Its our addiction. Note: Liquor stores look fucking weird on acid. The lights are a thousand times brighter and the vegetables are so much more vibrantly colorful. I was in charge of retrieving the soda while Frankie picked out candy. As I walked to the back of the liquor store, I somehow felt like Frankie and I were on a mission. Like a heist. A Pepsi heist. I weaved my way though the aisles and around people, making sure not to make eye contact with anyone. For some reason making eye contact would surely ruin our plan to successfully make it out the door with this stolen Pepsi. The worse part about liquor stores on acid is the cashier lady. The whole buying process sort of confused Frankie and me. We didnt really know why, but we were glad when we finally got out of there.",
  "We are about to enter the Fishiverse. Robbie has a fish monster in his apartment named Lance. Lance is like the fish version of Grendel from Beowulf. That day Robbie dropped a school of fish into Lances tank. Then the massacre began. Fish tanks look fucking awesome when youre on acid. The colors and the movement of the fish remind me of the Wes Anderson film Life Aquatic. For those of you who havent seen it: Please do. You'll thank me later. But moving on. Every so often we would all gather around the tank and admire its beauty (aka trip the fuck out). During one of our excursions into Fishiverse, we noticed a fish head floating at the bottom of the tank. Lance was a natural born killer. He would hide in the murky shadows on the bottom of the tank, study his prey, and come out with a violent attack where no fish was safe. It was like a cannibalistic Jaws. So of course this grisly sight became the focal point of our trip, along with the Paul McCartney poster that loomed over out heads.",
  "From it we were able to conjure up many philosophical ideas, most of which we quickly lost track of how they even started or why we were even talking about them. Conversations are hard to follow on acid. Conversations started which stemmed to tangents which started other conversations and so forth. Everything from free will, the existence of a higher power, bestiality, to the type of monster you would be if you could be one was covered. Somewhere in the middle a game of chess was played.",
  "I am about to enter the Universe. Thats right. The actual universe. Dont laugh. At one point I walked out to Robbies balchony to get some air and look up at the stars. If you stare at one thing long enough it becomes closer, brighter, and starts to move in all directions. So as I sat there, looking at the stars, everything else disappeared and all that was left was the sky and what seemed like a million shooting stars. I pictured myself being in a spaceship flying all around the galaxy. Then I got lost in the trees, saw a picture of an old Asian couple form from the cracks on the ground below, and headed back inside.",
  "As we were flipping though the channels, we stumbled across some music videos. The face on the TV looked familiar. Holy shit! It was Paul McCartney in some weird fucking psychedelic music video. We could not escape the Pauliverse. It was omnipresent.",
  "The night continued on with more conversations we couldnt follow, a block of Legends of the Temple, and some terrible George Harrison music videos. I was convinced there was some sort of Beatles conspiracy going on that night.",
  "Ill end this with the wise words of !!!:",
  "'LSD taught me a lot about me, but then again maybe not. I cant remember what I forgot.'",
  "The End."
 ],
 "erowid": {
  "id": "42221",
  "citation": " Mike. \"It Is Indeed a Pauliverse Afterall: experience with LSD (ID 42221)\". Erowid.org. Apr 12, 2007. erowid.org/exp/42221",
  "substance": "LSD",
  "views": "4218"
 }
}
