{
 "id": 15869,
 "title": "Riding the Downward Spiral",
 "date": {
  "submission": "2008-08-25T07:00:00.000Z",
  "experience": "1990-01-01T08:00:00.000Z"
 },
 "author": {
  "name": "Neecho",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "During the end of my high school career and throughout my college career I dabbled quite a bit with weed. I was never a hard drug user; I never tried cocaine, LSD, X, heroin, crack, or fried banana peels for that matter. We tried shrooms one night but were later disappointed to learn that our stash was bunk since nothing happened. I don't know, I guess I figured that I had too much going for me to fuck everything up with the hard stuff.",
  "Coming from a very Christian family, I developed an alter ego, so to speak, at the age of 15. When I reached my teenage years, I started thinking for myself, listening to heavy metal, hanging out with the wrong crowd...you know, what every teenager does at one point in their life. My parents finally hammered down on me the law of god and almost threw me into a Christian boarding school to straighten me out, but decided against it after me begging and pleading for a second chance with my old school and friends. It was after this point that my Mr. Hyde came to existance. At home with the folks, I tried to act like a good Christian boy whereas when I was away from them I acted like myself (quite non-Christian). And this trend has pretty much perpetuated to this day, although they've pretty much caught on and gave up on me about 5 years ago.",
  "Throughout college, I was a pretty heavy cigarette smoker and quite a champ with alcohol and there was always room in my life for a nice fat sack of bud. Ive had many a good trip and I have had many a bad with the stuff. Ive come to the conclusion that marijuana really brings the id out of me and sits it in front of my face, for me to thoroughly examine and tear apart. My first REAL relationship was with this tall, leggy, busty blonde with a healthy sexual appetite. She also happened to be quite Methodist and tried to save me from myself on several occasions. She had her days of dancing with the smoke of hell, but decided to give it up to grow up and mature. I however, was not even at my peak with the stuff. The girl had actually got me to go to church with her and even teach a Sunday school class to 6 year olds.",
  "This is where the retrospective trips hit me hard. Id get high on Saturday nights with my friends (minus the girl's presence) go home and fall down the spiral of self loathing. How dare I, this drug induced fiend who hated god and all that he stood for, have the audacity to teach his way to a group of young children? Then Id start thinking about how my parents would perceive me if they saw me like this. How could such a good Christian kid, who is his little sister's biggest role model, act like this? How in his mind does he think that its acceptable to teach kids about god in Sunday school 9 hours after getting high while listening to nine inch nails and hangin around with friends who are all athiest? Then Id wake up on Sunday morning, still not completely sober, get dressed and go put on this facade of being a 'good role model' with a pierced eyebrow and reeking of a cached bowl. I had many nights alone with my other 'good' half, and the internal battles nearly drove me to the point of insanity.",
  "When Im sober, I don't tend to think these things, but when Im under the influence, I really step outside myself and see how I am through other peoples' eyes. Every time I got high and sat around with my friends, Id look at all of us as a whole and then individually and think about how we'd look if we were in our 30's or 40's with wives, kids, jobs, and houses with white picket fences.....and how we looked now at 2:00 am, all sitting in a room together with small glossy eyes, staring into oblivion, not saying a word to each other, half of us passed out. Not the picture that would make women wet in the panties.",
  "That era of my marijuana use was probably the most retrospective. After that, I had good trips and bad trips, but nothing like then. Sometimes Id get so wasted that Id end up vomiting my internal organs out on the parking lot. This was probably due to the fact that I was also drunk. The absolute worst trip that I had was one night while at a party with a friend. I had been ill that week with bronchitis and was on antibiotics. This Friday night a friend and I went to a house party. I downed a couple beers, was feeling pretty good when we stumbled into a back room where a guy and a girl where taking hits off a gravity bong. They invited us to partake, and while I was on my third hit, the girl started to tell us about this acid trip she experienced once where she was having visions of a post-apocolyptic scene, complete with debris from fallen buildings, burning cars and a horde of nazi skinheads whipping and beating each other with chains under an old movie theater marquis that displayed CLOCKWORK ORANGE as the feature film.",
  "Going into depths of this, she in turn gave me this trip. I started to think about this into depth and the visions I saw scared the life out of me. I started to panic and ran out of the room, where I made a spectacle of myself in front of my fellow party-goers by vomiting all over this guy's living room floor, front yard, drive way and sidewalk. I wanted nothing more but to leave, however my friend's sister, who drove us to the party, had left to another party, and would return in an hour to pick us up. My friend and I stayed in the front yard and waited, hidden from the eyes of spectators, while I vomited and replayed these visions in my head. I really don't remember how I made it to my bed that night.",
  "After a while, I wasn't the big pot head that I used to be. Id smoke it when it and I were available, but I didn't really make myself wholly available a lot. As an upper classman civil engineering student, I found myself hanging out with pot heads a little less frequently. Plus, I got older and a little burned out from that scene.",
  "Since being away from school and in the real world, Ive had very little opportunities to get high. An old co-worker from my last job was still a big pot head and we'd smoke out sometimes while car-pooling home, but I wouldn't do too much as my wife wouldn't approve of me being high to the least bit. But now that Im out of that company, and in a new company that conducts drug tests, its been a long time that Ive had a bowl. And now that Im a dad to a four month old little girl, I really dont see marijuana in my future. But I had some good times with her and some bad times as well. It was one hell of a ride.",
  "15 years from now I can only hope that my daughter makes the right choices. Im not going to force religion down her throat like my parents had done to me. But I can't expect her to never try the stuff, afterall she has mine and my wife's genetics and we're both quite versed in the underworld. Im not going to encourage her to do it, but then again, if I find it in her possession, Im not going to throw her into a nunnery. Shes going to have to pick the good from the bad like I did and go from there."
 ],
 "erowid": {
  "id": "42276",
  "citation": " Neecho. \"Riding the Downward Spiral: experience with Cannabis (ID 42276)\". Erowid.org. Aug 25, 2008. erowid.org/exp/42276",
  "substance": "Cannabis",
  "views": "3268"
 }
}
