{
 "id": 15861,
 "title": "4 Days of Nothing",
 "date": {
  "submission": "2006-08-21T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anotherlogan",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "225 mg",
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "pill/tablet",
   "specific": "Phenobarbital"
  }
 ],
 "report": [
  "It was summer in Los Angeles and I had just moved in to my first apartment with a friend of mine. I was a 19 year old pot dealer on a mission to experience every drug known to man. One person helping me accomplish this goal was a customer of mine that worked for a Veterinarian. She would always bring something new and exciting to trade for pot. Everything she had brought previously was something that I had heard of before and generally knew what to expect.",
  "When my friend arrived she had brought 4 different drugs for me to try. She explained in detail what the first three drugs were and what to expect. For the bottle with the big purple pills she unraveled the info that comes with the drug and pointed out where it listed hallucinations as a side effect of the drug in higher doses.  Cool.",
  "A few days later after selling my last sack I decided to try the Phenobarbital. I was watching TV with my roommate at 8pm when I swallowed three 75mg coated tablets. My roommate had been drinking beer which was a big no-no according to the patient information. So he was content to watch. I was more or less sober besides some marijuana smoked an hour or two earlier. My plans were to relax and enjoy the trip from my couch in front of the TV.",
  "At 8:10 I started to feel a sense of calm and sedation. At 8:15 I felt extremely sedated and drowsy. No hallucinations. My only visual was my bed in my mind. My body felt heavy and out of energy. It took me a good 20 seconds to get up from the couch. I told my roommate I was tired and going to bed. I managed to stay awake for the trip to my bedroom. I was asleep before my head hit the pillow. It was 8:15 on Monday.",
  "I awoke some time later in a pool of sweat. It was about 90 in my room and the mid day sun was beating down on me. It took about 30 seconds to figure out where I was. I looked at the clock and it was 2:30pm. I felt just as tired as I did when I laid down. The only reason I got out of bed was to pee and drink something. I dragged myself out of bed and took a long piss while resting my head against the wall behind the toilet. Then I held myself upright on the faucet knob while filling a glass with water. I downed the water and then immediately face planted again into my pillow.",
  "I awoke the next time feeling slightly less groggy. I looked at the clock and again it was 2:30. I started to realize how long I had been out. I peed and drank 2 glasses of water. I went to the kitchen and started making a sandwich, still  feeling like I could use a nap.",
  "My roommate walked in and asked where I had been. I told him my story and asked what day it was. He started to laugh and said it was Thursday. I couldn't believe I had been asleep for almost four days. I'm still not sure if I woke up on Tuesday or Wednesday. I lied down on the couch and slept until 8. I immediately called a friend and asked him to bring me speed. I checked my pager and it had over 30 new pages. I made a few calls to inform people I was alive when my friend arrived with the speed. I snorted about 200mg and finally felt like normal. Over the next few days I gradually returned to a normal sleep pattern. I'd say it wasn't until Saturday that the drug had left my system.",
  "After that experience, I had no plans of taking that drug again anytime soon. I tried the drug again a few months later and found 30mg to be a good dosage to put me out after a long night. No matter how little I took, Phenobarbitals effects lasted 12 hours before it left my system. I never took a drug after that without researching it thoroughly first."
 ],
 "erowid": {
  "id": "42251",
  "citation": " Anotherlogan. \"4 Days of Nothing: experience with Barbiturates - Phenobarbital (ID 42251)\". Erowid.org. Aug 21, 2006. erowid.org/exp/42251",
  "substance": "Barbiturates - Phenobarbital",
  "views": "24277"
 }
}
