{
 "id": 15864,
 "title": "Fire Eyes",
 "date": {
  "submission": "2008-07-24T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tech",
  "gender": "Male",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "My friend Kenny told us he had some salvia divinorum he was going to let my friend Harley and I smoke. He said we should probably not just smoke it anywhere and that we needed a quiet safe place to trip at and that we should have a trip sitter, Harley volunteered his house, as we were only going to be there for lunch. Kenny volunteered to sit. We went into Harleys house and there was a grey cat lying on the floor. He warned us, 'Don't mess with that cat, he's real mean. I picked him out when I was sooo high'.",
  "We went into his room and after a bit of seeing his bongs and pipes and such the salvia was ready, so we loaded the bowl and I was the first to smoke it. As I was lighting it they put on some kind of music. I inhaled. It seemed very odd to hear Harley singing the way he was. It just sounded like some kind of weird war cry to me. I held it in for as long as possible, but eventually coughed it out. I felt like my body was covered in plastic that someone else controlled. I decided if this was all that I needed another hit, so I lit whatever was left and held it in again, this time being high, had a much easier time. My whole arm had fused to the table, within the plastic that was surrounding it. Kenny was talking about his first trip on it and how he smoked it then went straight to the table. It was all I could do to not do what he was demonstrating, simply because he was doing it.",
  "I decided this physical sensation might be a problem in a chair, so moved on to the bed, which I couldn't fall out of. The bed was moving way too much, so I sat on the floor, between the chair and the bed. This was no better, so I went back to the chair, then remembered what I was thinking in the first place and decided the bed was the best idea anyway. The plastic made me contort my body in odd shapes, and fairly soon I lost track of how big I was for moments, just writhing on his bed alone. I couldn't really get comfortable. I had the urge to shut out all the light from my vision and basically hid in my sleeve for a bit.",
  "When I opened my eyes again I was looking through my mouth. My eyes had been removed and placed in my mouth, but I was still looking out with them. I made sure I didn't bite them. I grew accustomed to this rearrangement of anatomy and looked up to see some energies drifting in across the ceiling. I reached out to them, because they seemed cuddly, and manipulated them. They were my play things. I made a starfish out of them. My skin felt like it was stiff and not the shape of my body. It was VERY uncomfortable, and I wished I could take it off. I sat there and watched Kenny and Harley talk. It looked like Harley was talking to the door, which just happened to have a moving painting of Kenny's head on it.",
  "I thought about my two of my friends, who had come up with odd words while on LSD, like 'Skud'. I decided that since I was tripping, there should be some kind of word presented to me, as a token of this other realm that I could take with me, but I had no such word. I looked everywhere for one. Something LIKE skud, but my own would have been nice. I heard a pounding. It came from a wall that had a sheet over it, and was getting louder and louder. I asked Harley what was behind the sheet and he said it was just a window. I started panicking. Kenny went to go see what it was, and after what seemed like about 20 min I decided to go see where he went. I got lost as the hallways rearranged themselves just outside my vision.",
  "Finally I found the living room and he was there sitting casually on the couch. There were 4 other people suddenly in the room. I thought, 'Damn, these people look so real!' then Harley and I ran back into the bedroom. He had seen them too, so I decided they were probably actually there. I went back and tried to talk to them, as they were my friends, but I was scared of them. Everyone looked unfamiliar except for one girl I was previously attracted to, even though I knew them all. I wanted to just cling to her, but something was physically holding me where I stood. Harley was on the couch and when one of them went to touch the cat, he couldn't think of why, but just screamed as a warning 'Don't touch the cat! I saw the cat attack her hand and it started bleeding all over the place, but nobody did anything about it.",
  "I was held there twitching from the uncomfortable skin I was in. I glanced over and saw a rubber thing on the floor, but later 'realized' that it was a bug. I looked away and looked back and it had moved closer to me, with those million little legs that just blended right into the carpet. The rug looked like a jungle to me, but not quite. I could hear tribal drums somewhere off in the distance. I saw something out the corner of my eye and turned quickly to look. The cat was there staring at me, and I thought it was going to bite me too. I ran to the other side of the room, and he didnt follow.",
  "I felt more normal soon after that, and a lot the things went away, but my skin still itched and didn't fit at all. We decided we should go to class, as the trip had worn off now. While I was waiting for everyone to get ready I found a nickel in my pocket. I decided it would be interesting to watch it drop, to see if maybe it would go in slow motion because my perception was still altered. It did the exact opposite and was on the floor quicker than I had expected. I dropped it a few more times before flipping it spinning into the air with my thumb. I thought 'that would be cool if I could flip into the air like that' and imagined myself doing so. I afterward just HAD to sit on the spot where the coin had landed. Then I needed the coin where it had been, so I put it back under me.",
  "We finally left and when I stepped outside my eyes felt like they were on fire. I covered them and opened them as little as I had to to get to the car, which I ran to. The sun was burning me. I told Kenny about this and he said he can't turn the sun off. I told him I'd find someone who could.he just chuckled. I didn't get it. I got in the car and covered my eyes with the bottoms of my palms, as this was the only way I found to completely shut out the light. I decided that I could face this evil sun, and slowly pulled my hands away, then slowly opened my eyes. They were up in flames. I could see the flames pass through my vision often, in flickers of orange and yellow. They hurt so badly. I then realized it was all in my head, and that I control it, and suddenly it all went away. I had control over the sun, and its damaging effects. I was a god. I controlled everything. I pondered 'if I control everything, then why am I still alive?' I figured it was because I'm invincible. I was covered in metal armor. I felt a fire burning in my chest. I could taste the smoke billowing up through me. I thought it would have been fun to breathe fire onto the 4 people that had appeared in the apartment earlier.",
  "It all then went away. And I felt calm and reflective. I got out my handheld computer, Axim, and wrote a poem:",
  "The sun's been set high today",
  "Stepping out is your dismay",
  "It's sun's shine",
  "And your time",
  "Connect with your mind",
  "This kind",
  "Is over",
  "You are now invincible",
  "Breathe the fire",
  "You create with zire",
  "In your chest",
  "Burn your friends",
  "They appear",
  "In the line of your blaze",
  "Walk now, metal man",
  "We walked up the ramp to school and I remember thinking 'now that we've been where we've been, we're more powerful'."
 ],
 "erowid": {
  "id": "42261",
  "citation": " Tech. \"Fire Eyes: experience with Salvia divinorum (40x extract) (ID 42261)\". Erowid.org. Jul 24, 2008. erowid.org/exp/42261",
  "substance": "Salvia divinorum (40x extract)",
  "views": "2794"
 }
}
