{
 "title": "Fun Times Indeed",
 "author": "Devin",
 "citation": " Devin. \"Fun Times Indeed: experience with Diphenhydramine (ID 15878)\". Erowid.org. Jun 30, 2007. erowid.org/exp/15878",
 "substance": "Diphenhydramine",
 "bodyweight": "120 lb",
 "report": "<p>It was the Fourth of July and my plans to do LSD, AMT or even just get drunk kind of fell through at the last minute, so I was left alone in my house with no friends or parents, a bottle of sixty-seven Benadryls, and my dogwell refer to him as P. I laid out ten pink tablets by my laptop, decided to take six with a gulp of water. I then went outside to watch the fireworks with P and smoke a cigarette. I thought ironically to myself as I went out on the upstairs balcony: Fourth of July, what a great night for hallucinations and unexplained sounds.</p><p>I watched the fireworks show for half an hour and I was starting to feel a little stoned, but not totally sure if it wasnt my imagination. I asked P if he wanted to go inside, but when I tried to open the door, the knob wouldnt turn! I started to freak out because I was on Benadryl and trapped outside; I also figured Id have to jump the ten feet down off the porch before I got too stoned. However, it turned out the door just needed a push and my fears were relieved. I dont think this happened because I was on any drugs, it was just me being a dork. J</p><p>Anyway, I went downstairs to my room to talk on instant messenger and play minesweeper. P sprawled himself out on the floor near me and went to sleep. I took two more pills an hour after the first set of six and the final two a half hour after that. I didnt feel anything except a little slower until I decided to stand up to go to the bathroom. I then all of a sudden felt intensely weird, looked over at P sleeping, and his fucking fur was dancing to the music I was listening to! At this, my whole body just went Zang! I went to the bathroom, feeling a little off balance but not too bad, on the lookout for more visuals. However, nothing happened, and then when I got back to my room, the music was still on, and Ps fur was still dancing with it. And it stopped when I pushed pause on the player! I found this to be totally hilarious and told my friend on instant messenger about it.</p><p>The music I was listening to didnt take on any new dimension like it does with mushrooms or acid, but there was a few distortions in it. A female voice was singing and suddenly it became very deep, as well as other sounds where it just sounded like someone putting their finger down on a record. It was somewhat amusing. I did realize in one song that they were saying the title of itNeverever Landreally fast and that my sober mind had never picked up on it. Very cool. As for the other auditory hallucinations, I heard people come in the door and have conversations in the kitchen and I probably wouldve gotten up about six times to allay my paranoia, but P was my ground control for the evening. I deduced that he wouldve barked had their been real people and hed ignore the imaginary ones, so I ought to as well.</p><p>P was an important ally in this venture, but for some reason my damn hallucinations kept attacking him. I saw a snake slither away from him, as he was sleeping, and a weird two-legged insect that I first thought was a spider crawling around on him. I flicked it but it disappeared. Then, at one point, I looked over and one of the floating jellyfish Id seen earlier was sucking on P! I also thought I heard him making funny noises; he may have been dreaming or I was hallucinating. I tried to wake him up, but he didnt react right away and I thought the jellyfish had sucked the life out of him. Finally, he sat up, gave me a stranger look than I thought a dog was capable of, then left to go sleep on the couch. And there went my trip sitter. Oh well.</p><p>I got tired of doing things on the computer since all the pictures and music visualizations werent as cool as when Im tripping on other drugs, so I went to go stare at the shadows in my room. If I looked long enough, they would move as if the source of light was changing. They also vibrated, again in time with the beat of the music. My shadow actually began to dance a little as I looked at it, but it was a twitchy nerdy dance. I wasnt too entertained by that and went to stare at my desk. I remember I told my friend online that the walls looked like sand. When I stared into my desk, faces would appear and then reform, but I was barely able to notice them change. It was a bit indescribable, I suppose. I watched this interesting show for awhile, and then I stared at the floor. There formed a very nifty view of the city of Tokyo (Ive been there twice). I very much appreciated that, I would say.</p><p>I went to the bathroom again, this probably being the fifth time, because I was drinking plenty of water to combat cottonmouth and seemingly pissing out more than I was taking in. After I went, I got stuck staring out the window on the back door at the ghost cats. These things would walk or run around, rub themselves against things like a cat would do, and then disappear. I saw a guy walking down the way and I wondered if he was a hallucination, but I didnt want to stare as that would be creepy of me and I was in plain sight. I saw a bird walking around by the side of the house, and then when I went back to my room, the same one flew out and disappeared above me. I chuckled at that and then, just like that, I figured that my trip had ended. I brushed my teeth and went to bed, to a few nonspecific closed-eye visuals and abstract thoughts.</p><p>So, in conclusion, I had read and re-read all the information in the Dramamine FAQ but to tell the truth I wasnt too excited about this particular route to a state of altered consciousness because of some of the reports Id read online and my knowledge that it would probably make me really drowsy. However, I thought the hallucinations people were having sounded pretty hilarious and mine proved to be no different. My side effects werent that bad, all things considered. I felt a little off balance, had a few short moments of vertigo, and my legs felt sore for some of the time, like with morning glory seeds. Nothing too nasty; I wasnt drowsy and I didnt get sick, most importantly. I think that is because I take Benadryl (yes, the recommended dose of two) pretty frequently for my allergies and perhaps my body is just used to dealing with it. I didnt have much of a hangover, except that one of my eyes was bloodshot for awhile after I woke up. Another thing I would note is that my eyes werent dilated at all during this, and I checked them every time I went to the bathroom. I thought that was weird since others have reported pupil dilation, but Ive seen it before in the mirror and it just wasnt there.</p>",
 "year": "2002",
 "id": "15878",
 "gender": "Male",
 "timestamp": "2007-06-30T07:00:00.000Z",
 "views": "9679",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:30",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ]
}
