{
 "id": 15887,
 "title": "Long Term High Doses",
 "date": {
  "submission": "2001-12-24T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Paul D",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "[Warning: Coricidin Cough and Cold contains Chlorpheniramine Maleate which is dangerous in high doses.  See DXM Brand Warnings for more info.]",
  "I started taking DXM in High school, A few doses here and there, maybe once every few months, then I stopped for a few years, never really getting into it. I had a lot of really good experiences on it during that time though. Body flowing feelings, extremely nice colorful shifting plasma-like hallucinations. A few years later, someone introduced me to Coricidin and I was like, 'Hey, I haven't done that in a while, Why not?' So I took 8 and had a pretty good time.",
  "A few months later I started taking the stuff about 2-4 times a week, 8, then 16 then 24, then extended doses. I reached the 'Sigma' plateau once and I think that's where the problems started. It was absolutely incredible, I can say that, like a lucid dream, free flowing, complete disassociation, but in control. Unconscious, but somehow awake. . No thought disturbances at all. It was beautiful. Then I came down and tried to hit that feeling again and again. Trying more pills, extensions, syrup, never again did I get the feeling, and In the meantime, my brain was slowly Turing into mush. My personality started to disintegrate, I suffered a stab wound in this state while on some LSD and became totally withdrawn, I guess you could say almost schizo. All my friends became alienated, they said I was different, and I pretty much said F*** Off-I'm exactly the same.",
  "I was living in a apartment with 2 other people, kind of like a frat-you could say- A few of the people that were not nice, and in that phase, DXMed and LSDed out, they completely F***** with my head. Anyways-I moved out back home for a few months, the c+C boxes piled up-I swear, I could have made a house with all the boxes I had hidden away. The TV started talking to me, I went out and thought I was a vampire. Once I took 40 C+C's and wound up in the hospital think Oh shit the aliens finally got me. There was this weird large bumpy feeling moving through me, like a ball under my skin moving through my whole body. You'd think I'd learned my lesson, but nope. Started taking Freebase DXM, about 1000-1500mgs 1-2 times a week. That's when I thought I really did it-I seriously thought my soul had left me, I thought I had died after kneeling on the floor, my vision penetrating deeper and deeper thought absolute darkness to a pool of black oil that bubbled and then I knew I was fuc** I got up and thought I was 2 bodies, one ethereal in the chair and one material, walking around. A most unpleasant feeling. I half expected to see myself in the chair when I returned. I came down from that one and decided to quit.",
  "I have not been on DXM for about 7 months, and I sometimes cannot think straight or concentrate. I get very upset and frustrated sometimes at work and home, and I have great pains to try and not upset my coworkers-who I love very much, I just want to go in the cooler or the back room and hide, but I know I can't do that I have to try to be half-way normal in reality, My old self is coming back slowly, I may never be the same again, and It's a scary and depressing thing sometimes. Mental and physical exercises help, drawing and writing helps. It's feels like I'm slowly being reprogrammed. All I know is-No more DXM for Ol' Paul here."
 ],
 "erowid": {
  "id": "4236",
  "citation": " Paul D. \"Long Term High Doses: experience with DXM (with CPM) (ID 4236)\". Erowid.org. Dec 24, 2001. erowid.org/exp/4236",
  "substance": "DXM (with CPM)",
  "views": "31953"
 }
}
