{
 "id": 15891,
 "title": "Surprising Reaction",
 "date": {
  "submission": "2006-11-29T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "7into1",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "2C-T-21",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Hello, I am writing this report about mixing alcohol with 2C-T-21. I have tried combining alcohol with 2C-I, AMT, 2C-T-2, and a few others, and the second that the alcohol hit my stomach with those substances, I and several others that I regularly tripped with immediately felt nausea and/or vomited. So it was known to be a bad idea to drink while tripping in my group or circle of psychonauts.",
  "So anyway, one day I introduced a friend who is a very heavy drinker to 2c-t-21 and he loved it, but he told me that he drank a lot of Jack Daniels during the trip and it intensified the effects for him. I just thought that he had an iron stomach from drinking all the time and the effects were all in his head, but I eventually tried this combo with an moderately strong dose of 2c-t-21(I never used an accurate scale as I am very familiar with how 2c-t-21 effects me), and found his statement to be true. I started drinking shots of whiskey in the middle of my trip and the alcohol didn't cause any nausea at all like the two went together perfectly.",
  "Shortly after drinking a few shots I got this burst of tripping really hard, and the strange thing is that the alcohol added like a very strong speeding sensation like I just downed a bunch of amphetamines, huge waves of tingly energy. I couldn't believe how hard this combination made me trip, it's like the alcohol multiplied the effects of the 2c-t-21 in the same manner as with opiates or benzodiazepines.",
  "The trip lasted the same amount of time maybe a little less than usual as it seems that the liquor pushed the chemical through my system faster. I just thought that this combo would be interesting to note because alcohol does not seem to have this effect with most other tryptamines and phenethylamines."
 ],
 "erowid": {
  "id": "42371",
  "citation": " 7into1. \"Surprising Reaction: experience with 2C-T-21 & Alcohol - Hard (ID 42371)\". Erowid.org. Nov 29, 2006. erowid.org/exp/42371",
  "substance": "2C-T-21 & Alcohol - Hard",
  "views": "7193"
 }
}
