{
 "id": 1590,
 "title": "Poison Tea",
 "date": {
  "submission": "2002-05-29T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Metal",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 oz",
   "administration": "oral",
   "substance": "Datura",
   "form": "tea"
  }
 ],
 "report": [
  "In my quest for self, for centeredness, I have made a few wrong turns, a few blunders, but none as serious as this. Datura, 'Angel Trumpet', was my selection for conciousness expansion one day. Several leaves placed in a pot, and boiled in a small quantity of water. The tea was nutty and earthy, as described in other accounts I had read in my research beforehand. About fifteen minutes after my 4oz cup of tea, my memory stops. I came to the next day in Intensive Care, strapped down to the bed, still hallucinating.",
  "Ten to fifteen minutes after drinking the tea, my speech became slurred and I was unable to walk. I sat down on my friend's bed and leaned against the wall. Everything from here on is what I've been told, as i have absolutely no recollection of the events. I sat there, my condition slowly degrading, fading in and out of conciousness. The more attentive of the two friends in the room checked my heart rate and breathing often, to make sure I was okay. I muttered a lot of things that didn't make any sense, smoked imaginary cigarettes, and scratched madly at my skin. I eventually slipped under and didn't wake up. My temperature steadily rose, and then D and T decided to call my roommate, who called my father. I was driven to the emergency room.",
  "Somewhere along the way, I regained conciousness, and continued smoking my imaginary cigarettes and muttering to myself. I had a cold stare, and looked through people without recognizing them. At the hospital, I became violent. I assume this is because they were attempting to put an IV in my arm, or something equally unpleasant, and I, in my hallucinating state, didn't take kindly to it. After taking several clumsy swings at the doctor, my father punched me in the forehead hard enough to knock me back onto the bed, where I was quickly strapped down. I shortly went into respiratory arrest, and my clothes were cut off of me to facilitate the nurses.",
  "My memory starting up again does not coincide with waking up, I simply start remembering. I was fighting with all my strength against my bonds. The nurse would ask me to stop, and I would comply, but then forget and resume my struggle. I saw ants crawling all over the far wall, and wouldn't believe the nurse when she told me there was nothing there. I begged for her to untie me so I could go look for myself, but she wouldn't. The ceiling rippled whenever I looked at it, and spots on the wall grew legs and walked around as huge spiders. I caught myself talking to people who were neither in the room, nor the state several times. There were moments of total lucidity sandwiched between hallucinations. I had an IV in my arm, a tube in my nose, a cathoter (which was none too comfortable), and bandaids all over from various injections.",
  "It took a couple days, and several psychiatrists before I was permitted to go home. My eyes are still dialted, and my chest hurts from fighting the straps that secured me. I'm riddled with needle holes, and completely lacking physical strength. I am left with the same nagging questions about life, thousands of dollars in hospital bills, and now most of my family and friends think I am completely out of my mind for drinking that poison tea. I had intentionally consumed very little, going by a guide another user of Datura had posted, but apparently my biochemistry differs from his.",
  "Death was not the object of the game, and if it isn't what you're after, stay far, far away from the Devil's Trumpets."
 ],
 "erowid": {
  "id": "14996",
  "citation": " Metal. \"Poison Tea: experience with Datura (ID 14996)\". Erowid.org. May 29, 2002. erowid.org/exp/14996",
  "substance": "Datura",
  "views": "40893"
 }
}
