{
 "title": "Twitch, Twitch",
 "author": "Robonaut",
 "citation": " Robonaut. \"Twitch, Twitch: experience with Caffeine (ID 15908)\". Erowid.org. May 4, 2011. erowid.org/exp/15908",
 "substance": "Caffeine",
 "bodyweight": "260 lb",
 "report": "<p>2:05 pm Took 5 pills of No Doz equivalent to 1 gram of caffeine total.</p><p>2:20 still waiting for any good effects to happen. Feel a burning in my stomache. Caffeine has always made me get indegestion real bad.</p><p>2:45 everything looks real foggy like when I have a bad case of red eye. I feel real nervous, like something is going to happen but it is taking way too long.</p><p>2:51 notice when I try to sing to a song that my voice is all scratchy and I can't talk real loud. My hands are shaking too much to be able to type very good. Have to keep stopping and thinking of what to type. GOD DAMMIT I still can't connect to any server at all on irc.</p><p>3:00 I keep seeing starbursts like when you stare at a light too long and then look away. still feel very edgy.</p><p>3:15 I decide to take 700 mg more to see if I can feel anything more. That brings the total to 1.7 grams of caffeine.</p><p>3:26 I still can believe how weird my voice sounds. Its like I'm a little kid or something. Everything looks distant, like my eyes are in the back of my head looking through a tunnel. I notice that my typing is better and I keep hitting the keyboard very very fast and very accurately. I have to drink alot of water to combat the insane acid in my throat.</p><p>3:38 My hands won't stop shaking and I have trouble focusing on the computer screen.</p><p>3:48 I feel like I'm on a mild dxm trip. I feel like my mind is not really in my body and I'm sort of remotely controlling my body. I'm dreading mowing the lawn in about an hour.</p><p>4:00 Very restless and nothing interests me. Everything seems very boring.</p><p>4:05 Finally connected to dalnet. Jesus that took forever.</p><p>4:08 I still feel like I'm on dxm. My hands feel huge and I don't feel any strain on my muscles when I do stuff that would normally take alot of exertion. I bet I could do 20 push ups and not feel it.</p><p>4:33 Starting to come down a little. Not as nervous. I better start mowing.</p><p>The rest of this report is written 2 days later. It took me about an hour to finish mowing the lawn and afterwards I was soooo sick. I felt like I needed to sleep for a week. Unfortunately 12 hours later I still couldn't sleep. After about an hour of resting I decided to open my mail and...WOW the government won't give me ANY money for college. Thanks. This is when the shit hits the fan and I go crazy. I was so pissed that I was ready to kill someone. I took some nerve pills and some sleeping pills but nothing helped, I was wide awake till 5 the next morning. Overall the actual trip was weird. The dxm-like body high was cool, but the moodiness and shaking just pissed me off. I won't do it again.</p>",
 "year": "2002",
 "id": "15908",
 "gender": "Male",
 "timestamp": "2011-05-04T07:00:00.000Z",
 "views": "3508",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:10",
   "amount": ".7 g",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 ]
}
