{
 "id": 15918,
 "title": "Unknown Danger of Seizing?",
 "date": {
  "submission": "2007-08-10T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "amstone",
  "gender": "Female",
  "weight": "250 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 6:00",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>This is the story of my scariest and strangest drug experience to date. I am a 21 yr old stoner, who has taken her fair share of drugs (especially LSD, MDMA, Cocaine,and Mushrooms) and I am a regular drinker as well. In the fall of 2004 I found myself with a free day and an eighth of mushrooms. At the time I was living in a thickly wooded area, and decided I just wanted to have a  day to myself, trippin in the woods, drawing, thinking, centering. I have used mushrooms by myself before, for the same reasons, and was not apprehensive about the trip at all. I know that many people swear by fasting before ingesting mushrooms or other hallucinogens, but I have always found that I feel much better if I eat something beforehand.",
  "So anyway, I was fed and happy and relaxed and proceeded to have a fairly normal trip. I ended up eating almost my whole eighth, so I would estimate about 3 grams. A couple of times during the trip I caught myself 'not breathing,' meaning that my respiration had slowed down so much (or I thought it had) that I couldn't remeber the last breath I'd taken. I've had similar experiences before on Mushrooms and always chalked it up to being mostly psychosomatic, so I wasn't to worried, though a little unnerved. Upon later reflexion, I think I should have paid more attention to this.",
  "About 6 hrs. after taking the mushrooms, and feeling pretty much sober, one of my housemates came home and offered me a drink (Vodka Cran). I have drunk beer before when coming down off mushrooms as well as MDMA, so, honestly, I didn't even think about it.",
  "This is when things got weird.",
  "I was standing in my housemates kitchen (all one building, two residences), and I had only had 2 or three sips of my admittedly strong drink. All of a sudden, I started feeling very strange, almost as if I were about to start rolling. An intense pushing on my chest, rapidly blurring vision, and I started having a hard time supporting myself. I remember mumbling something about needing to go lie down and got myself outside as fast as possible. By the time I had shut the door behind me my vision was entirely black and I could no longer stand. I fell to the ground hitting a metal/wood table on the way down and flattening a plastic kitchen style garbage can. I was on the ground, I was shaking violently, I couldn't see, and my ribs hurt from hitting that damn table. I was terrified. I finally pulled myself together, as my vision started coming back, and pep talked myself into standing up. While trying to make it to my door (about 20 feet away) the same thing happened, and I fell again, blind, shaking uncontrollably, the whole thing. I don't know how long I lay there, but I don't think it was very long, maybe a couple minutes. I finally made it inside and fell on my bed. I probably could have made myself move, but I just lay there still for about 15 minutes until I felt ok.",
  "I felt really woozy for the rest of the night, but basically ok. When I took the last bit of the mushies a couple weeks later, I was in the shower and the same thing started to happen. I was able to overcome the shakiness, lie down and get myself back together. I think this second attack may have been partly or mostly psychosomatic, since the dose was much lower and I have freaked myself out into having panic attacks before when inebriated.",
  "I still don't understand what created that unfortunate reaction. It seems likely it was just a bad batch of mushies, though the majority of the trip was fine, and I didn't have any nausea or cramping. I've never heard of anyone else undergoing the same thing, but I know I will never drink with mushrooms in my syytem again.",
  "Have fun. Be safe.</p>"
 ],
 "erowid": {
  "id": "42465",
  "citation": " amstone. \"Unknown Danger of Seizing?: experience with Mushrooms & Alcohol - Hard (ID 42465)\". Erowid.org. Aug 10, 2007. erowid.org/exp/42465",
  "substance": "Mushrooms & Alcohol - Hard",
  "views": "13565"
 }
}
