{
 "id": 15938,
 "title": "Unique and Vaguely Interesting",
 "date": {
  "submission": "2007-08-09T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25"
   },
   "administration": "oral",
   "substance": "Lamotrigine ",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Something entirely unusual just happened to me that I thought was worth sharing. I don't know what provoked it, but it may have had to do with a number of factors. For some quick background, I'm a somewhat experienced tripper (I stress this point, only because this is the type of report where people often assume the author is somewhat new to psychadelics) - I've taken plenty of all of the following things, in no particular order: ecstasy, shrooms, LSA, DXM, various pharmaceuticals, nitrous, cocaine, crystal, and of course, my favorite, cannabis.  Which is what this odd little report is about.",
  "Some factors that may have influenced it is that I was just diagnosed with being bi-polar and was a little shaken by the news - not upset, just not sure how to take it. I took my first 25mg tablet of Lamictal (lamotrigine, a mood stablilizer for bi-polar disorder) earlier today, and don't know if that has any bearing on this at all. I also took 1mg of xanax last night right before going to bed and woke up feeling much better than normal.",
  "Anyway, I had just gotten home from running some errands a few minutes ago, and stepped out to the back yard to take a hit or two of my brother's joint that I knew he had left there the day before. I didn't want to get high, just get that slight mood lift and relaxation one gets from a couple hits. I lit the joint up and took two giant hits and held them in for as long as I could each time, trying to get the most out of them. I went back in and got sent some distressing news by a friend on my phone, and laid down on my bed. It gets a little shaky here, but I suddenly remember looking straight ahead and not being able to move my body, feeling completely sucked to the bed, and I got extremely paranoid suddenly, my mind screaming suddenly that I was about to die. Ridiculous thoughts about my medicine perhaps clashing with the weed, the weed being laced, etc, began to run through my head. I tried to move and found it impossible, my eyelids were half-open and I couldn't open them any more. I was seeing a blurry view of everything and tried to sit up but was still immobile.",
  "Suddenly, something snapped, and I jerked my whole body around. After that, it was like nothing had ever happened, and I actually got a big grin on my face and thought, 'Holy shit. That's what all those people who thought they smoked PCP were talking about'. Now, about ten minutes later, I feel great yet vividly remember the temporary terror I was in. I'm by no means an inexperienced smoker, I've been doing it for many years, but nothing like this has ever happened before. Frankly, if I knew how, though, I'd do it again. Albeit terrifying, it was certainly unusual and fun. Just thought I'd share."
 ],
 "erowid": {
  "id": "42540",
  "citation": " Anonymous. \"Unique and Vaguely Interesting: experience with Lamictal & Cannabis (ID 42540)\". Erowid.org. Aug 9, 2007. erowid.org/exp/42540",
  "substance": "Lamictal & Cannabis",
  "views": "17535"
 }
}
