{
 "title": "Working on 4-Methylaminorex",
 "author": "maison",
 "citation": " maison. \"Working on 4-Methylaminorex: experience with 4-Methylaminorex (ID 15935)\". Erowid.org. Jul 10, 2002. erowid.org/exp/15935",
 "substance": "4-Methylaminorex",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "4-Methylaminorex",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>10:10 AM: 20 mgs 4methylaminorex insuf</p><p>After finishing my morning phone conference, I opened up a gel cap that a friend had brought up for me. It was labeled 20 mgs and I didn't brother to reweigh it. A straw shoved into the cap allowed me to insufflate the majority of it, but a few crystals were too large to want to be picked up by a little nose suction so they were crushed with a knife and insufflated from a plate. Both powder and the crystals were slightly off white. The tasted was not awful and the pain from insufflation not significant.</p><p>Within 30 minutes I was a little buzzy. This was advertised as the champagne of speed and I've never taken speed so it is hard to tell if this is what to expect. There was a small amount of jaw tension and little clenching of the teeth and a bit more happiness than is usual for me. I think I'll take a shower. When I'm done, I'll make a to-do list and see if this can really push me through alot of work.</p><p>I met a lover for lunch at noon. On the sunny walk there I noticed I was doing more smiling at strangers than usual, just generally feeling quite happy. Some work thoughts, things that I would do when I got back from lunch flowed through my head, but didn't stick very well. Lunch was very enjoyable, we had deep and pleasant conversations, the sort that I'd expect from a light dose of mdma perhaps. Although to be clear, the fond feelings caused by the fact that this dose was given to me by a dear friend who I miss could well account for my happiness on it.</p><p>Tried to get back to work when I returned and found it difficult. What I do for a living is a combination of software development, and project management. The parts of the work that required more human interaction: discussing project plans with people, writing emails, and so forth, I found to be very easy. The more analytical tasks: system architecture, software development and design, etc, I found to be more difficult than usual and I ended up putting them off.</p><p>The rest of the day was unremarkable except for a bit of zippiness and a bit of happiness above and beyond my normal baseline joy. I stayed up fairly late picking a friend up at the airport and found driving to be no problem. Finished off the evening with a vodka tonic.</p><p>Over all I would classify this as a fun but subtle substance suitable for encouraging tasks like creative writing but not so good for more analytical tasks.</p>",
 "year": "2002",
 "id": "15935",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-07-10T07:00:00.000Z",
 "views": "24476",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "4-Methylaminorex",
   "form": "(powder / crystals)"
  }
 ]
}
