{
 "id": 15935,
 "title": "Nearly Threw My Life Away",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ches",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "substance": "Heroin"
  }
 ],
 "report": [
  "I'm writing this during my third day of being off of heroin.  I've been hooked on a couple of drugs before, but nothing this serious.",
  "Getting off of alcohol after drinking daily for months was hell.  Sweating profusely while rolling around in bed trying to fall asleep for hours was torture.  Severe depression followed the detox.  I now only drink a few times a month, but it's still a bit of a problem because I always seem to get too trashed and black out or feel horrible the next day.  Shortly after chilling on the alcohol I decided to stop smoking pot daily.  I reduced my habit to a few times a month, as with the alcohol.  Also, as with the alcohol, sever depression followed the reduction of my habit.",
  "None of these come close to what I felt after quitting heroin. ",
  "My heroin habit started when one of my friends that has had a serious habit in the past suggested I try a bag.  We drove to the south side of Chicago and got what was probably a 20 mg bag of China White. I immediately snorted half of it.  What I felt was pure bliss.  After about an hour of sitting back and enjoying the numbness and the fuck-all feeling, I decided to snort the other half.  The feeling was now intensified four-fold.  I enjoyed my high, threw up a few times, and went to sleep telling myself this will be a once-a-month thing.  The next day I got another bag and split it with my friend.  I didn't feel like I was abusing it because I only did a half.  A few days later I got bored and decided to go down and buy an entire bag to do by myself all at once. ",
  "Although I would continue doing a bag a day, every day, for the next two weeks, I never got a feeling that came close to the one I got doing a whole bag at once for the first time.  That is, until, I did two bags at once.",
  "After doing two bags at once every day for a couple of weeks, I decided to cool it for a while before I really get hooked.  I had no idea I was in for two days of the worst feelings both physical and mental I have ever had in my life.  I needed more H and I needed it now.  I went back to doing a bag to two a day and preceded in losing my job for coming in looking fucked up one too many times.  I was now stealing from friends and family daily just to scratch up twenty bucks to get my fix.  Of course I also needed gas money to get to the spot, seeing as how I'm white and can't just walk around in that neighborhood, and I needed cigarette money because smoking and zoning out to music is the only thing I would do when I was high now that I was no longer working. ",
  "Three days ago I just up and decided to quit.  These last three days have been even worse than the last time I tried to quit.  I though that in three days I would feel perfectly fine but I don't.  Not even close to fine.  I'm writing this because I can't sleep.  I can't listen to music or watch tv.  Nothing is the same without heroin.  I'm just glad that I never took my habit further than a couple of months and I never injected.  I definitely would have been way more screwed right now.  Between sitting on the toilet with alternating diarrhea and vomiting fits, sweating by the bucket-full every time I try to sit still, and shaking violently when I walk around, I pray to God that I can live again without the constant need to score more dope."
 ],
 "erowid": {
  "id": "42532",
  "citation": " Ches. \"Nearly Threw My Life Away: experience with Heroin (ID 42532)\". Erowid.org. Jun 25, 2007. erowid.org/exp/42532",
  "substance": "Heroin",
  "views": "6208"
 }
}
