{
 "id": 15941,
 "title": "French Fry Space Cadet In the Land of Zainy",
 "date": {
  "submission": "2006-08-19T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Habilis",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": "9.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "insufflated",
   "substance": "Pharms - Alprazolam",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "It was a beautiful and sunny day, perfect for walking around and seeing the world. I awoke with my girlfriend and we each had 2mg's of Xanax to start the day off right - and it did my friends, it sure did.",
  "We found ourselves strolling along sidewalks of the upper-middle class neighborhood and having delightful thoughtful conversations.",
  "Then later in the day, around 4pm, we found ourselves together again and decided to pop a few more zainies(3mg) and walk up to the local upscale mall around here.",
  "When we got to the mall, about an hour later I decided that I was going to get well cooked so I decided to pop another 4mg's(bringing my total up to 7mg).",
  "We were walking around in the place having the time of our lives for about an hour, I was feeling absolutely tremendous and empathetic towards every person I saw. I wanted to sit down and talk to strangers and have fun with everyone. My mind was telling me that everyone was feeling the same way I was.",
  "Well, we needed to get some food so we went to the food court and got McDonalds. Things get fuzzy from here, but from what my girlfriend told me - I was sitting in the food court and popped 2 more zainies(bringing me up to 9mg's within a 2 hour period) THEN I took out 3 more zainies and smashed them with my credit card right there on the glass tabletop and took the straw from my coke and snorted the things right there in full view!(Now up to 12mg in 2.5 hours) My girlfriend was so wasted that she just thought it was hilarious since I was pretending to act like a total drug fiend - but how much was pretend I don't know.",
  "I would stare people down and freak them out. I felt like I was 5 years old. I was making my girlfriend laugh so hard that I decided to get more and more into the maniac mork comedian role.",
  "I then started throwing french fries at this old lady who was sitting near me. I would throw a fry at her head then she would turn to see who it was and I would act all innocent and then my girl and I would start busting up in total uncontrollable laughter - the kind that makes our ribs hurt. I was basically in a complete stupor and thought I could do any fucking thing I wanted.",
  "My girl was starting to realize things were getting way out of hand and she was trying to hustle me out of the food court because I was walking up to complete strangers and messing with them, kinda mocking the rich snooty types and making a complete buffoon of myself. I put French fries behind the frames of my glasses and some sticking out of my mouth and walked up to people like that spitting French fry chunks on the floor and stomping on it. I didn't care what the hell happened - if I got arrested right there I would have been laughing my ass off. I still can't believe I DIDN'T get arrested. I remember some of this through the fog and it was funny as hell, all the people's expressions.",
  "Note: Most of the following is an account from my ex-girlfriend, since I have absolute zero recollection of this:",
  "My girlfriend managed to get me into the Barnes & Noble store to sit the fuck down before security came, so she got me a cup of coffee and I dropped it and it broke right there on the floor. I was hitting on just about any girl that walked near me - even with my girlfriend by my side. Anyway, we did manage to get the hell out of B&N and walked around the mall looking at interesting things a little longer before stuporing our way back to my apartment.",
  "I woke up the next day and had found that I bought stupid shit, like a Hawaii tourist shirt and valentine heart silk underwear and a stupid ass pair of sunglasses that I can't even wear. I wish I knew all the other things I did cuz I bet it would have been funny. My girlfriend doesn't remember much either.",
  "The whole problem with zainy-bars is that the buzz off 2 or 3 mg's is so fucking awesome that I just want to make it better and better by doing more until Im suddenly in a drug-frenzied blackout stage. Having an addictive personality doesn't exactly help things out either."
 ],
 "erowid": {
  "id": "42549",
  "citation": " Habilis. \"French Fry Space Cadet In the Land of Zainy: experience with Alprazolam (Xanax) (ID 42549)\". Erowid.org. Aug 19, 2006. erowid.org/exp/42549",
  "substance": "Alprazolam (Xanax)",
  "views": "48397"
 }
}
