{
 "id": 15953,
 "title": "The Anticipation Dissolved",
 "date": {
  "submission": "2008-08-25T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Xsjado",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0:45",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "My first trip: 'A Jack Kerouac Night'",
  "Friday, April 22, 2005",
  "A little bit about myself- I'm 19, a freshman at college, absentminded, 'chill', like all sorts of different music, predomintantly underground. I am a quiet person, stick to myself, but Im still friendly and enjoy social settings. I did not drink or do drugs in high school, started during the summer occasionally, and I do on the weekends since going away to college. I started smoking weed last October, and I do it couple times a month, sometimes weekly. I still have a low tolerance for drugs, but I also do not need to feel an extreme amount of inebriation to enjoy something.",
  "I had not smoked weed for about a month prior to this, and the last time I had drank was the previous Saturday night. The only other drugs I have used are amphetamines (Adderall), nicotine, and caffeine. I have taken Adderall 4 times, one 20mg each time, I had not taken it for 2 weeks prior. I dont smoke cigarretes often, just occasionally.",
  "My friends and I decided to take mushrooms one Friday, and it was all of our first times, so one of our friends decided not to take them and act as a sitter. It was a Friday; it had been gloomy all day, but I dont feel it affected my mood. We tried to get mushrooms around 5 o clock, but were not successful, so we decided to go to the basement of our dorm and jam. I feel this contributed to my experience, it put us all into a good mood as it was the first time we played music together. After we were done playing music, we went back up to my friends room to relax. While my friends smoked some nugget (I chose not to) we discussed tripping on mushrooms, and mystically, my friend Larry, whose room we were in, received an instant message on aol from a friend asking for some weed. Larry replied by asking for shrooms, and his friend replied 'yes.' After this discovery, we all decided after some debate to take mushrooms.",
  "We started the experience at 10:00 pm in a different room of another one of the group that had been together all afternoon. I started out by eating half of a gram with peanut butter on a semi-empty stomach -- I had eaten dinner at 5:30. My other friends also ate half a gram, and another ate a whole gram as it was his third time tripping. After about a half hour I began to feel some onsets; mild relaxation, a sort of relaxation of my legs as I was sitting in a chair. Also, I felt slightly giddy, and laughed easily at peculiar things.",
  "The sitter, and 2 of the trippers went back to Larrys room to smoke more weed, John and I remained in his room. The first surprise came as I looked over John's shoulder as he clicked around on this computer. Suddenly, John, being a joking funny witty person, and also because of the mushrooms, yells 'AHHH!' at me, sending us both into a fit of laughter. He then opens up adobe photoshop, bringing up funny pictures of friends and drawing foolish things on them (mustaches, cigarettes) and we continue to laugh.",
  "I then walked out of the room and decided to see other people in the dorm, as I wasn't feeling very inebriated (the forementioned effects were very mild). I went into a friends room, where rowdier people were talking, drinking, and playing guitar. I walked in, and as everyone said 'Hello' to me, I felt I was having trouble keeping my composure, but was still able to be social and talk to them. Suddenly, one of the people started yelling nonsensical things, and I found it very perplexing, I quickly muttered 'Uhhhh I gotta go guys' and left the room. I went back up to the room and decided to eat another half gram, as the effects started to wear off, and I suspected I had measured less than a half gram. A also ate this with peanut butter.",
  "I returned several times to my other friends room, but found the loud environment hard to deal with. I felt the stronger onset of the mushrooms: the feeling of inebriation throughout my body, a fascination with light fixtures, and having a hard time controlling laughter. I decided to return once again to the original room, where it was a much better environment for tripping.",
  "Soon, my other friends returned to the room, clearly showing the effects of smoking weed, and also showing signs of tripping. I was much more comfortable in this environment, as I felt we all shared a feeling. As the shrooms kicked in more, we all felt extremely giddy, bursting into laughter at simple things. I also felt slight disorientation and loss of balance. I also had an odd sort of tunnel vision. I didn't simply see just what I was looking at, but as I lay on the top bunk, I felt a strange sort of isolation from the rest of the room, until I diverted my attention back to it. One thing I found peculiar was my disinterest in music, which was my only disappointment to this experience.",
  "After we calmed down a bit and the effects weren't quite as intense, we decided to go for a hike through the woods, along a river overseeing dam, then along train tracks which lead us to a stunning gorge. I'll spare the details of the hike to keep the length short, but what I noticed during a hike was the intensity of light. Areas lighted up by streetlights had an extreme contrast from darker areas, and things such as airplanes and cars were very impressing. As I returned to the dorm around 1:30 am, I was still feeling mild effects. We stayed up till 5:30 watching Fear and Loathing in Las Vegas (very entertaining), talking, and watching the sunrise. I went to sleep at 5:30 barely feeling the effects, and took tylenol pm to help me sleep. I woke up feeling no effects of the mushrooms.",
  "Looking back on the experience, I am very glad I did it. It allowed me to become closer with this group of friends, sharing an experience that was very unique. When I decided to write this report, I decided to write it to describe it to someone who had never experienced it before. If I were to describe the feeling, it helps to compare the drugs I've done before. The inebriation was comparative to marijiuana -- laughing and intense lights, and also speed, as the euphoric feeling was felt more in the chest and body than in the head, and also because my head felt racing as opposed to the feeling of marijuana."
 ],
 "erowid": {
  "id": "42587",
  "citation": " Xsjado. \"The Anticipation Dissolved: experience with Mushrooms (ID 42587)\". Erowid.org. Aug 25, 2008. erowid.org/exp/42587",
  "substance": "Mushrooms",
  "views": "3509"
 }
}
