{
 "id": 15963,
 "title": "Useful Rather Than Recreational",
 "date": {
  "submission": "2007-09-06T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Irishmafia2020",
  "gender": "Male",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Gotu Kola",
   "form": "(capsule)"
  }
 ],
 "report": [
  "<p>I am a Graduate student who has a talent for procrastination. At this moment I should be researching something or writeing a 20 page grant proposal or, you get the idea.  Well anyway, on a recent trip to the health food store I happened to see this herb, Gotu Kola in a bottle of gel caps.  Thinking that the 'kola' meant kola nuts or something, I purchased the bottle.  It turns out that this is not related to kola nuts, and it has no caffiene in it.",
  "I decided to try it anyway, and I have found it to be a profoundly powerful for focusing my mental acuity during prolonged periods of tedious studying or writing.  I took some at midnight knowing that I had a Powerpoint presentation the next day, and I could immediatly feel my brain clear and my mind focus.  I was able to finish my project in only a couple of hours.",
  "This stuff works, but I have to use it to focus on a task.  I think that it doesn't work well with caffiene, but everyone has a different biochemistry, so who can tell.  Also, if I take this herb late at night, I am unable to go to sleep.  I have been unable to find anything substantive on the net, but this is considered a nervous system stimulant.  I find that it clears my mind and allows me to focus unequivically on lengthy assignments, but that it is not speedy or like coffee.  The best comparison of this herb in my own experience would be to a strong dose of Ginseng.  I have not noticed any euphoric or intoxicating effects.</p>"
 ],
 "erowid": {
  "id": "42621",
  "citation": " Irishmafia2020. \"Useful Rather Than Recreational: experience with Gotu Kola (ID 42621)\". Erowid.org. Sep 6, 2007. erowid.org/exp/42621",
  "substance": "Gotu Kola",
  "views": "12233"
 }
}
