{
 "id": 15972,
 "title": "A Warm Welcome",
 "date": {
  "submission": "2001-04-17T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "5crown",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "I had been researching Salvia D. for weeks and then finally decided that it would be very rewarding for me to explore this plant.  It had been years since I had experimented with any hallucinogens. After receiving the salvia, I decided I should wait until the right time and have an available sitter.  I let my sitter read about the plant and he and I both were somewhat anxious about trying it. I was excited about the reported possibilty that this could stimulate the dream center of the brain as I have been practicing and researching lucid dreaming for some time. ",
  "I loaded about 1/2-1 gram of crushed leaves into a brand new bong with a large wooden bowl.  I said a small prayer to whom it may concern and then went and sat on my bed.  My sitter lit the bowl for me and had been instructed to take the bong when needed.  I pulled deeply and slowly. Then the smoke got a little harsh, but I continued to pull.  I held it in for a long time and it seemed as if I could hold it in forever...but I blew it out...and then it hit me pretty fast.  My sitter stared at me in anticipation, as if he expected me to say something.  I signaled for another hit.  He lit it and I cashed the bowl, then laid down.  It was as if the salvia asked me not to let her go.  She wanted to stay inside of me. I complied as long as possible.  I had vangelis playing softly on the stereo, and as if to the music, an energy or voice said 'welcome'.  It was such a warm feeling, as if it was glad I was here.",
  "I could hear myself trying to mumble what was happening to my sitter.  I was almost in a waking dream state (best I can describe).  A force was pressing on my legs but it wasn't scary.  I saw a three-dimensional 'X' appear above me and it passed trough me. I could feel the tingling energy of where it pierced my body. I remember saying aloud 'Whoa...this is so weird' over and over.",
  "I almost fought to maintain a lucid state so that I could describe the trip.  Images and feelings of me being carried away faded in and out. Soon I opened my eyes to try and 'see' any open eye visuals.  Nothing happened. As soon as I stopped trying, vaporous waves of something drifted across my vision.  I had a huge grin on my face as I tried to figure out if this was real or in my mind.  It was almost like gasoline vapours.  Sitting up, it felt like I had awakened from a long deep sleep and was very sedated. ",
  "The whole experience lasted about 15 minutes, though I still feel wierd an hour afterwards.  I've recounted this to the best of my ability, but I know there was so much more that happened during the trip that I can't remember...it lies just below the surface.  I would like to go much deeper than I did. I know that I was welcome there and it all felt very familiar. Next time I do this, I'm sure She will be just as glad to see me as I am her."
 ],
 "erowid": {
  "id": "4265",
  "citation": " 5crown. \"A Warm Welcome: experience with Salvia divinorum (ID 4265)\". Erowid.org. Apr 17, 2001. erowid.org/exp/4265",
  "substance": "Salvia divinorum",
  "views": "7335"
 }
}
