{
 "title": "Pretty Nice Time",
 "author": "GoulKid",
 "citation": " GoulKid. \"Pretty Nice Time: experience with Carisoprodol (Soma) (ID 15973)\". Erowid.org. Jan 28, 2003. erowid.org/exp/15973",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "6 tablets",
   "oral",
   "Pharms - Carisoprodol"
  ]
 ],
 "report": "<p>\nIm submiting this trip report cause there is not to many others. Well i read one and that would scare someone away from soma's and i dont think that should.</p><p>I was afarid of doing them because erowid didnt have much info on them at all. Well i had bought 12 soma's for 27 bucks and the dealer said not to do more then 5 but he said 5 is a nice high and was ok to do. So I looked up more about soma'a when I got home and didnt find much. Just to note One picture that didnt look like the pills i had, it said that most somas are 350mgs are something i have no idea how many mgs are in the kind i took so dont go think you can take 5 and be ok.</p><p>Start Low, then work up. Dont be stupid. So i took the 5 pills and just hung out with my friend J that took 2 and we just chilled and played video games and listined to music. I began to feel sorta funny like i knew something was coming up and then i felt dizzy a little. And i couldnt think really hard to well. No notice to music like weed or anything but I had the urge to stretch and lift some wieghts for some reason. After i was done i felt like I was pulsating with blood and evergy inside. I got light headed every time i stood up.</p><p>I felt really good. J and I took turns hitting each other and kept saying it felt good and it really did. I kept getting up to work out for some reason every ten minutes or so and i couldnt feel it lifting up or down it was pretty cool. I then set down and chilled some more and got sleepy a little. Then there was no way i could get up and work out anymore all i could do was just sit there Me and J smoked the fine chronic after awile and played some more video games. So To sum it all up it was a good time felt really good the whole time. On the other hand though 24 hours later my stomach was hurting really really bad for a long time. I dont know if thats from that or that im just coming down with the flu.</p>",
 "year": "2002",
 "id": "15973",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-01-28T08:00:00.000Z",
 "views": "62430"
}
