{
 "id": 1598,
 "title": "The Many Subtleties of Opioid Ecstasy",
 "date": {
  "submission": "2008-09-09T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "badly drawn girl",
  "gender": "Female",
  "weight": 45
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Narcotic painkillers have been my drug of choice ever since I was prescribed a bottle of percocet after getting my wisdom teeth out my junior year in high school. After reading that codeine could be used recreationally I decided to take two on an empty stomach: my first real drug experience. Prior to that I had only smoked weed once or twice, and needless to say it made a dramatic impact on me. The pleasure I experienced was very physical (as opposed to the largely psychological effects of marijuana), what people often refer to as a body buzz, and lasted almost 6 hours, the afterglow still lingering until I fell asleep for the night.",
  "Impressed and eager for more, I began searching the house for other codeine-based products, and happened upon a few vicodin ES and a bottle of tussionex, a prescription cough syrup containing about 5mg hydrocodone per dose. The syrup tasted absolutely disgusting and I nearly gagged trying to swallow a double dose, but diluting it with water helped somewhat (although I later read that diluting it was dangerous as it increased the toxicity of something or other...I cant be sure of the details, and it didnt seem to do me any harm, so oh well). the high I experienced was much mellower than the percocet, but still quite relaxing and enjoyable. The vicodin was much the same, albeit a bit stronger than the cough syrup; it took somewhat longer to take effect than oxycodone, and its effects were less intense, but it was a smoother buzz and lasted even longer than the percocet with less tapering off as time went on.",
  "Some months later, I happened upon a supply of T3s, or tylenol with codeine phosphate (30mg). after hearing many negative reports about the effects of regular codeine  itching, nausea and vomiting - I wondered if it would even be worth it, but I decided to give it a go, taking two on an empty stomach. About 30 minutes later I began to feel the familiar twinges of an opiate buzz, but it was an extremely rough, uneven high, pleasant at times but then either fading slightly or becoming almost too intense...the sensation I associate with oxy and hydrocodone, that of a sort of warm pressure underneath my skin, was slightly different and even uncomfortable. And then...the itching. It started (strangely enough) on the top of my head: I could not stop scratching my scalp, as if Id suddenly contracted the worlds worst case of psoriasis. Eventually I forced myself to sit on my hands, since not scratching seemed to be the only way to get rid of the maddening itch. Eventually it faded as well, but the buzz only became more unpleasant. At times it even resembled a strange sort of headache, with undertones of pleasure but a predominant feeling of discomfort. Minor waves of nausea also rolled over me, and though I didnt throw up I felt certain that if I'd taken 90 instead of 60mg (as I had been considering before) I would have. I felt grateful when the effects faded. All in all, a disappointing experience.",
  "Needless to say, codeine and its relatives are an extremely varied group of narcotics in terms of their recreational value. Though hydrocodone provides an excellent, enjoyable high, oxycodone remains my indisputable favorite among the three varieties I have encountered. Its effects are intense, almost overwhelming at times, and the relaxation from the afterglow lasts well into the next day. My normal dose is 10mg on an empty stomach - I dont weigh very much and have an extremely fast metabolism (which is lucky for me since I can make my supply last longer). I often time it so that I take them around 9 oclock at night since I find it much more pleasant to fall asleep (usually around 3am) while still feeling the tail end of the high than to have it completely wear off. It normally takes only 20 minutes to begin taking effect, and about 30 to 40 minutes to reach its full strength. It first begins with a general feeling of relaxation, like the type you would normally feel without any drugs. I start feeling the need to sigh, inhaling deeply and exhaling slowly (this, I assume, is due to the depressive effects that oxycodone has on respiration) which further enhances my relaxation. As I begin to peak a steady, warm pressure forms underneath my skin, and I experience sort of warm prickly feeling, as if each of my nerve endings are being individually and expertly massaged. Standing up and walking becomes difficult, and movement seems to increase the body buzz, but normally I'm very content to do nothing but sit very still, breathe deeply, and either close my eyes or concentrate upon a fixed spot. At times my face feels both warm and cool at the same time. Despite the intensity of these sensations, I am not intellectually incapacitated (I'm actually quite stoned as I write this, lol) and I can carry on normal conversations with people who would never guess I was under the influence of a narcotic. Intense pleasure continues to roll over me in slow, almost imperceptible waves. Psychologically I find myself experiencing very few of my normal feelings of anxiety or depression  negativity is all but erased, as I can concentrate on nothing but the physical sensations. After several hours the buzz begins to wane, but I am left with an enjoyable sense of calm, physical relaxation, and a feeling of being cleaned out and refreshed.",
  "I have tried many other drugs...cocaine, acid, amphetamines...yet my loyalty remains with my beloved codeine. Due to natural circumstances, prescription painkillers are often hard to come by, and so my full-blown addiction is prevented by the simple fact that there is very little supply. As a student at a high-pressure university, I manage (or, at least, have managed so far) to avoid the trappings of dedicated drug use simply because one cannot scour the streets for prescription narcotics like one can for heroin or coke. It is, of course, a dubious balancing act. Yet when I do come across those lovely white pills my day is brightened considerably, in anticipation of the soft, comforting, indescribable warmth that is to come. Highly recommended...four stars...viva la percocet!"
 ],
 "erowid": {
  "id": "15016",
  "citation": " badly drawn girl. \"The Many Subtleties of Opioid Ecstasy: experience with Oxycodone, Hydrocodone & Codeine (ID 15016)\". Erowid.org. Sep 9, 2008. erowid.org/exp/15016",
  "substance": "Oxycodone, Hydrocodone & Codeine",
  "views": "28995"
 }
}
