{
 "id": 15990,
 "title": "Bits and Pieces of an Awesome Trip",
 "date": {
  "submission": "2008-08-27T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Vir",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This was my third (maybe second? can't really remember) time to drop acid, however it was my first time to really trip hard.  My previous trips had been off no more than 1.5 hits, this time I went all out and took four.  I was feeling really good when I took the pills; We (myself and a friend) took them at another friend's house.  His parents were out for the night so we knew that we could really cut loose.  His house is really fun, he has a big backyard with tennis courts and a small forest type area.  There were two other nontripping friends that we designated as our 'babysitters' just in case. ",
  "The first effects started about 20 minutes after I ingested the pills.  It was a mild euphoria, but growing greater every minute.  I was feeling so happy that I could not help but give all my friends a big hug. ",
  "The acid was really starting to kick in, I was getting black flashes much like a strobe light, and I was feeling quite euphoric.  We decided to go out into the back yard.  My other two friends were laughing at us as we got accustomed to our new acid world.  I found it very difficult to walk, and my perceptions were getting altered, when I tried to move a limb it was extremely exaggerated.  For example, I remember once I was holding a cigarette, and moved my arm to take a drag.  I could not judge how much I was moving my arm and I swung the cig into the air and it fell on the ground next to me.  When I reached down to pick it up, my hand slammed into the ground.  This 'transitory stage' only lasted about 10 minutes (I think).  However the exageration of everything lasted throughout the night.",
  "Anyway, we got outside and that's when things really started getting groovy.  We walked out to the tennis courts, and my friend was messing with us.  He saw my tripping partner Nick outstretching his hands to the sky and said 'Hey John (that's me), I need you to find me the moon.'  Though I knew he was just messing around, I felt compelled to find the moon and I delightfully skipped around until I found a pine cone, which I decided must be a moon dropping.  I then reported back with what I had found, proud of myself. ",
  "We went back inside after about 15 minutes?  My sense of time was starting to get really out of whack.  Anyway, we got back into his room.  Nick's face was flushing and he had a mild case of the sweats, but given my state of mind, I thought he was about to explode.  I thought that he must not be breathing.  I told my non-tripping friend what I thought, and he played along.  I kept telling him, 'Nick's not breathing, Nick's not breathing,' (I thought I was whispering but was really talking quite loudly) until I convinced Nick himself that he was not breathing.  Surprisingly enough, neither of us really got freaked out, especially since I was comforted by the fact that if someone stopped breathing, they would go unconscious and would begin breathing again. ",
  "After about 30 minutes I think, my two non-tripping friends were getting really bored of babysitting and wanted to go out to eat.  They assured us that we were acting normal enough to not screw up, so Nick and I agreed that it would be ok since they left.  They told us that we could crank up the guitars and the music.  We started peaking right about the time they left.  I felt like I was sharing thoughts with Nick - if he said he was seeing or feeling something, I would almost always see or feel it too.  I don't remember a lot, but there are lots of separate parts I do remember.",
  "I remember playing the guitar, and everything I played sounded awesome even though I was playing awful sounding chords with tons of distortion and delay.  While I was playing, I noticed that I was twitching my eye.  It wasn't just a normal twitch - my whole face was scrunching with every note I played, and my eyes were going wild.  The uncontrollable eye twitch continued throughout the night.  I started to listen to music, and when I finally came to later that night I realized that I had gone through about 20 CDs.  I must have not listened to all of them because I was only listening to music for about an hour total. ",
  "The coolest and most memorable part of the trip was while listening to Pink Floyd's 'Atom Heart Mother.'  Me and Nick were convinced that we were tribal leaders, took our shirts off, and wrapped them around our heads like turbans.  We ran all over the room, and made faces at each other in the bathroom.  Nick's face looked like a Picasso painting.  We made up an elaborate dance that included banging pillows on the bed as hard as possible.  When my other two friends returned they were greeted to two shirtless men with turbans on shooting them with guitars.",
  "After that things started to settle back down, but neither me or Nick could sleep that night.  The eye twitch continued until the next evening, and the intense trip made me stay away from acid for a while.  It was not a bad experience, don't get me wrong, it was probably the most fun thing I have ever done, but the crash afterward was just a little too much and I had to step back and recover.  There is a lot more that I could tell you, but I don't remember the sequence much and I am tired of writing so I hope you have enjoyed my story."
 ],
 "erowid": {
  "id": "42715",
  "citation": " The Vir. \"Bits and Pieces of an Awesome Trip: experience with LSD (ID 42715)\". Erowid.org. Aug 27, 2008. erowid.org/exp/42715",
  "substance": "LSD",
  "views": "3857"
 }
}
