{
 "id": 15993,
 "title": "Dropped into the Night",
 "date": {
  "submission": "2007-08-25T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Codrum",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "In January, I decided to spend some time with a friend of mine that lives in Baltimore. We'll call him S. Now, I've known him for about a year or so, and he was a decent user of heroin. I told him that whenever I get around to seeing him, I'd like to try some with him.",
  "Well, I finally get around to setting some time on a weekend to hang out with him. We venture to score some dope. Now, I've been in some sketchy areas up and down the East Coast, but Baltimore's junk scene was by far the weirdest. I saw three narcs stop people on the street and make them empty their pockets. This really spooked me as I had recently turned 18, and therefore, a legal adult. Anyhow, we somehow made it out unscathed and we returned to his house with seven little gelcaps filled with white powder.",
  "I broke open one, and sorted out about half the contents into two piles. Familiar usually with coke, I thought I had to chop it up, S told me that there was no need. Well, it was now or never. I snorted the first pile. I waited about 15 minutes, and I couldn't really feel much, so I did the other pile. And BAM! Just like that, the high hit me. A beautiful wave of warmth and tranquility that held me up and made me feel so good. I remember thinking to myself: 'This is how people get addicted'.",
  "We went up onto his roof. By God it was one of the coldest nights that winter. Totally crystal clear, I could see the skyline of Baltimore and I didn't have a care in the world. The cold didn't bother me, and we just sat up there and rode the high and talked. I didn't think this would ever end. About two hours later, I decided to snort half of the other pill. Wow. I just never wanted this to end, it was like I could do anything in the world.",
  "S told me stories about how when he lived in Florida he was shooting up all the time. All the junkies we're all very nice and cool to each other, and all the junk was decent and not crap like he gets in Baltimore sometimes.",
  "Around 2am, I decided to lay down on S' bed. I looked over at the alarm clock and I started to feel the room spinning. I tried to make it stop my concentrating on the far wall. Nope, this wasn't gonna happen, I ran to the bathroom and vomited twice. S looked in from the doorway and kinda laughed. He said it was normal. I puked about four more times that night. Ugh, this must be the comedown for feel so goddamn good the entire night.",
  "That next morning S and I we're totally fucking bugged out. Tired and sick feeling, he said the junk we did was probably the higher grade stuff, and we probably over did it a little. I shrugged and snorted the rest of the half I leftover from the night. The high I got wasn't as amazing as the night before.",
  "That must be a catch, I thought. Tolerance. Damn, I knew it was all too good to be true. S gave me a ride back to my Mom's place and gave me an extra pill filled with junk. I still have that sitting in my top drawer of my drawer. The allure of heroin has all but faded for me, it was good the first time, but I think it can easily take control of my life."
 ],
 "erowid": {
  "id": "42733",
  "citation": " Codrum. \"Dropped into the Night: experience with Heroin (ID 42733)\". Erowid.org. Aug 25, 2007. erowid.org/exp/42733",
  "substance": "Heroin",
  "views": "14177"
 }
}
