{
 "id": 15998,
 "title": "Taken Licitly in Hospital, Mixed Results",
 "date": {
  "submission": "2005-09-16T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "KachinaDoll",
  "gender": "Female",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Fentanyl",
   "form": "liquid"
  }
 ],
 "report": [
  "I went to the hospital for an operation, and my boyfriend accompanied me.  A nurse hooked me up to an IV for a very long time before the doctor was ready to operate.  I walked to the room with my boyfriend, lay down, and the nurse asked me to describe someplace I liked to go.  I assumed it was meant to relax me for the procedure, so I started talking.  It was while I was describing this place to her that she injected the fentanyl into my IV.",
  "It hit in about three seconds.  My boyfriend says he could see my pupils dilate almost instantly and my speech slow to a near halt.  I remember everything getting warm and fuzzy, just so cozy, like I was curled up in a blanket right next to a fire.  They had a poster of some kind on the ceiling (probably to distract patients like me); I think it had a kitten on it.  Partway through the operation, I felt the dull pain of the scraping inside me, and requested more fentanyl.  The nurse complied and gave me another dose of unknown quantity.  I closed my eyes and remained semi-conscious of my surroundings, for a little while.",
  "Shortly thereafter, the procedure was finished and the nurse and my boyfriend walked me back to my bed in the previous room.  I don't recall having any trouble walking, but being grateful for the support.  My boyfriend said I could barely walk/stumble and needed both of them there to practically carry me back.  I then lay down and promptly 'rested', or so I thought, for maybe 15 to 20 minutes -- again, eyes closed, pleasantly dark, but not sleeping.  I checked my watch, and asked my boyfriend to get me a frozen yogurt from the confectionary afterwards, and again 'rested' for a few minutes, 10 or 15 tops.  He returned, and I asked him what time it was.  Close to 45 minutes had passed.",
  "I suddenly became aware that I had been blacking out, losing consciousness and regaining it so seamlessly that I wasn't even aware of the breaks.  I recognized it from one prior experience: the first time I had tried cannabis, when it had been (unknowingly) laced with crystal meth.  I had blacked out once, or possibly twice, on it, and simply recalled regaining consciousness while sitting on the couch thinking 'wtf, there's a big fat blank spot...what just happened?'.  I realized that the fentanyl was doing the exact same thing to me, only much more smoothly.  I was waking up and not even realizing that the blank spot was there.  I felt the need to rest for 'just another half hour' until the hospital department was closed for the day.",
  "Well, an hour later I woke up again...I felt really bad for making the nurses stay because I was such a wuss about pain and required more fentanyl, and also because I couldn't get over the effects of it as quickly as I'd hoped.  (I've always had a sensitive body chemistry.)  I managed to get up and change into street clothes, and we called a cab to go meet some friends. (Hah!)  I promptly threw up in the car, even though I was lying down, and apologized profusely to the cab driver, who was nice about it.  That weirded me out for some reason.  I was standing outside a fast food joint looking ill and feeling ready to puke again when a 5 year old child offered me his juice.  It was very cute and touching, but I told him I'd be fine, and went home to go crash out for the rest of the evening.",
  "In summary: It was supposed to be a painkiller, but I needed a stronger dose than normal, and it had the most peaceful high I've ever experienced -- but also the least lucid.  The comedown was terrible.  I assume that people doing it recreationally must take smaller doses.  I have no idea how much the nurse gave me, although looking online it seems like 100 micrograms is par for the course, so I probably took 200 mcg...",
  "I really wish it had numbed my body more during the operation, and made me less nauseous afterwards.  It did what it was supposed to, albeit not very effectively, in my view.  I wouldn't take it recreationally, but I can see how others would for the narcotic high.  Personally, I think it would turn me into an uncoordinated drooling zombie.  I've also no wish to OD on it, having read a couple of experiences."
 ],
 "erowid": {
  "id": "42757",
  "citation": " KachinaDoll. \"Taken Licitly in Hospital, Mixed Results: experience with Fentanyl (ID 42757)\". Erowid.org. Sep 16, 2005. erowid.org/exp/42757",
  "substance": "Fentanyl",
  "views": "14380"
 }
}
