{
 "id": 16005,
 "title": "Like No Blackout Ever Before",
 "date": {
  "submission": "2006-11-13T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Cgt",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "insufflated",
   "substance": "Pharms - Zolpidem",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "At a small party my friend and I decided to take some Ambien he had acquired but we were leery of any actual effects, so we decided to snort 1/2 one each.  Other people around us noticed dramatic differences in our demeanor shortly after, but I felt fairly normal.  I felt very similar to being drunk but in a much more relaxed and good way.  We decided we needed more because we were expecting more... so we each snorted another 1/2 pill.  Here's where things started to get insane.",
  "We blacked out and remember very little of the rest of the night except what others have told me.  My friend stood up very quickly and walked around the room and started banging on his bed in a very comically nonviolent way.  I was immersed in selecting music for about half an hour, unable to decide on something.  Apparently people kept trying to tell me what to put on but I was oblivious to all external stimuli.  I remember getting visuals - the walls were moving and various patterns moved on the floor.  My mind was in a constant state of blankness.  I couldn't focus on a thought for very long, but I didn't seem to care.  Apparently we tried to write an experience report at some point during our experience but couldn't get anywhere.  We acted drunk but not in a belligerent way but more of a spaced out kind of way.  Our motor skills were way fucked up but I didn't seem to notice.  Usually when I'm drunk I at least notice that I have a hard time walking, but not on this shit.",
  "About 1-2 hours after we took the Ambien, everyone else at the part left.  I have no recollection of practically anything for the next 2-3 hours.  I have never blacked out like this before in my life - not even on massive amounts of alcohol.  I vaguely remember leaving with my friend to get food.  We made a mess of the kitchen, throwing pots and pans around and having a mini-food fight.  I remember leaving the apartment so we could get food.  Walking to a Mexican restaurant I kind of remember stopping so we could snort another whole or half a pill, but I'm not sure this really happened because I BLACKED THE FUCK OUT.  I think the restaurant was closed since it was 7am in the morning.  My friend was even worse, he has no memory of anything but leaving to go to a restaurant and then waking up in the morning.  I vaguely remember stumbling about 3/4 of a mile home from the restaurant to go to sleep. ",
  "Ambien was a lot of fun but it sucks because I do not remember shit the next day.  The comedown leaves me very spacey in the morning - at least from the quantity we did.  I woke up in the morning extremely sore from sleeping in weird positions all night long.  What a shitty sleep aid.  I wouldn't do Ambien again just because it's not fun to black out that hard.  It's also scary that I couldn't remember how much we actually did and that I didn't have any problems just doing more even though we were extremely fucked up and in public.  In short, it was an indescribable black out experience with some minor tripping effects and good drunken feelings."
 ],
 "erowid": {
  "id": "42787",
  "citation": " Cgt. \"Like No Blackout Ever Before: experience with Zolpidem (Ambien) (ID 42787)\". Erowid.org. Nov 13, 2006. erowid.org/exp/42787",
  "substance": "Zolpidem (Ambien)",
  "views": "41121"
 }
}
