{
 "title": "Like Taking Speed... Too Much Speed",
 "author": "Lord Vitamin",
 "citation": " Lord Vitamin. \"Like Taking Speed... Too Much Speed: experience with Trazodone (ID 16003)\". Erowid.org. Sep 14, 2005. erowid.org/exp/16003",
 "substance": "Trazodone",
 "bodyweight": "230 lb",
 "report": [
  "<p>Trazodone, an anti-depressant I used to be on, was discovered by me in my parents medicine cabinet recently. Back then I had no interest in drugs, now (under two years later) I did. I took some of the old pills, nobody would notice as they were no longer in use. The pills, though I don't know the mg, were about the size of an Aleve, I took 10 of them. A few nights before I had 4 and enjoyed it, so I figured why not boost the dose.",
  "Keep in mind, at this time, though not suicidal, I didn't care if I DID die from the experience... or so I thought. The pills numbed me and made me happy after about 20 minutes, as I watched TV. Then I realized something was very, very long. My heart was beating like a humming-bird, and my body was telling me it was definately a problem. The rest of my body started giving out, and due to the extreme fear this put me in, I attempted going to my bathroom and trying to puke out some of the pills, realizing now that I DID care if I died, and didn't want to. I failed trying to purge them, and ended up lying down and going to sleep on the bathroom floor, completely unable to get back to my bedroom. I",
  "A little goes a long way. I'm 230 pounds, so I'm far from a lightweight, and I'd definately consider the 10 I took to be a near-death experience. From this experience I'm now completely done taking anti-depressants to get a high, and I strongly caution anyone who entertains the thought of trying it out.</p>"
 ],
 "year": "2002",
 "id": "16003",
 "gender": "Male",
 "views": "31641",
 "dose": [
  {
   "time": "0",
   "amount": "10 tablets",
   "administration": "oral",
   "substance": "Pharms - Trazodone"
  }
 ],
 "submissionDate": "2005-09-14T07:00:00.000Z"
}
