{
 "id": 16010,
 "title": "The Worst Year of My Life",
 "date": {
  "submission": "2005-07-25T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "rlmgo",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>The year that my parents decided that I was depressed was when I was 15; a sophomore in high school. They didnt really know me, and I suppose I preferred it this way, but eventually they came to the conclusion that I was anti-social and depressed, so they set up a meeting with a counsellor for me. Of course by for me, I mean that I was dragged along, they did all the talking, and let the shrink decide based upon their fucked up conclusions that they had invented.",
  "The first counsellor (psychiatrist, whatever you like to call them; Im going with counsellor) informed my parents (after they had blatantly asked, right in front of me, if I needed to be institutionalized for a while - great to be loved by your parents, isnt it) that I was relatively normal and didnt need any institutions or medications. This of course, didnt suit my parents intentions at all, and I never saw that counsellor again. But I wouldnt get off that easy, they would eventually book me with two more psychiatrists over the next couple months, determined to invent something wrong with me.",
  "The second still refused to put me in a mental hospital, but admitted that I may have some minor depression (after much coaxing from my mother). This wasnt either what they had wanted to hear, and so we moved on again. Did I mention that both the previously mentioned counsellors thought long term therapy would be a good idea? I was of course opposed, but it wouldve been better than being taken away, or drugged up.",
  "Eventually we got around to the third counsellor, who seemed a bit more empathetic towards my parents, and though disagreed with the fact that I was a danger to myself, he did feel that a daily prescription of Prozac would help me right out.",
  "This seemed to appease the evil beasts with whom I was residing, and as such, I began taking Prozac daily.",
  "The first day that I was on it, I only remember fragments of. I know I screamed at my mother and sister a whole lot, because they wouldnt leave me alone. I threw a cup at my mom after them still not leaving. She got 8 stitches from that, but I wouldnt learn that until about a year later.",
  "I know youre probably now thinking, Oh, so thats why they thought that about him, makes sense. But, I really had never done anything like this before, I felt like the medication had driven me mad. I was extremely sensitive to light and sound; I spent about 15 hours straight, after that episode with my mother, huddled up on the floor of my room in the dark, unable to sleep or concentrate on anything.",
  "Of course after that episode, I really qualified for their vision of mental instability, so, my dosage was increased - again in the interest of making things easier for me.",
  "After this point, life became really hard. Im missing a fair amount of memories, due to how confused and disconnected the Prozac always left me.",
  "I would sleep through every single class at school (achieved an amazing 0.987 GPA that semester; 1.112 the next. Previously I had always been an honor roll student, even getting the occasional 4.0). Then I would come home, eat (and I mean eat a lot - I gained 60 pounds that year), sleep until dinner, eat again, waste a bit of time trying to pursue the fragments of what I considered life before they had put me on this medication, and then sleep some more - wake up, do it again, always sleeping through all my classes.",
  "Within not too long I had no friends left; I had always been somewhat introverted, but prior to my medication, I had a best friend that I was quite close with, a girlfriend, and a couple more guys that I hung out with enough to consider friends. I never wanted to be bothered by anyone, I was quite an asshole I guess, but the medication made it so I just wanted to sit in my room alone, Id yell at my parents if they tried to talk to me.",
  "Through a few moments of clarity, I began to realize how fucked up things were getting, that I was essentially ruining my life, and tried to stop taking the Prozac, but my mom started watching me take every dose, to make sure I was getting better.",
  "I had quite a few thoughts of suicide around and following this point. I couldnt do anything, I was always confused and wanted to be left alone and go to sleep.",
  "There isnt much else to say as far as raw experience goes, except for my one suicide attempt - nothing special, I took the remaining half bottle of Prozac one day, mostly for the irony to my parents of killing myself with their tool they thought was curing me. They found me pretty quick, took me to the hospital, etc. It was all quite unpleasant.",
  "I continued this way, wishing I was dead, unable to even carry on a conversation (I was especially known around school for mumbling at people and then going back to sleep - I even slept through lunch hour, stretched out on the floor of a hallway. I didnt give a fuck, nothing made sense enough to care about things like sleeping in a hallway.) Anyhow, I continued like this for about 10 months; the whole of my sophomore year, plus a little. All the while my mom ranting about her crusade to get me healthy.",
  "I failed that year of school, lost all my friends, my girlfriend, and attempted to kill myself once (by overdosing on Prozac! What irony. Stomach pumps arent fun.) I was left alone, overweight, and still confused about what had happened the last year.",
  "The next summer I told my parents to go fuck themselves and refused to take another pill. This lead to more counselling visits and the like, and really in retrospect, Im a bit surprised I wasnt put away for refusing to take the pills, but once I was completely off of the pills, it was pretty easy to have a normal conversation with a counsellor and assure them I was well, sane.",
  "Ive read a few reports online (though more so with Zoloft than Prozac it seems) since that year about people (teens especially) becoming suicidal, violent, or just generally worsening due to medications like this, but I havent seen many long term accounts of being force fed the medication daily, it mostly seems like took it once type stories, so I thought I would share my story, in hopes to alert people about this drug.",
  "It absolutely fucking sickens me that we live in a society today that can demonize and illegalize things such as marijuana and mushrooms (just examples off the top of my head that have never left me with anything but positive repercussions), and support things such as nicotine, alcohol, and anti-depressants. (Such an ironic naming.) I suppose for some people these may help the symptoms, and intended, but I dont see how any parent could be so ignorant to force feed their child unnecessary medication.",
  "To conclude, Id just like to say that anti-depressants are not a cure all trendy drug like society wants you to think today; not everyone is depressed, and I dont have to be on a fucking pill to be happy (unless the pill is MDMA  thats another story though).",
  "The only way to describe my year on Prozac would be confused.",
  "Oh, and P.S. - masturbating on Prozac takes about an hour and a half and hurts like fuck.</p>"
 ],
 "erowid": {
  "id": "42810",
  "citation": " rlmgo. \"The Worst Year of My Life: experience with Fluoxetine (ID 42810)\". Erowid.org. Jul 25, 2005. erowid.org/exp/42810",
  "substance": "Fluoxetine",
  "views": "53025"
 }
}
