{
 "title": "My Little Addiction",
 "author": "Bassmunky8",
 "citation": " Bassmunky8. \"My Little Addiction: experience with Triazolam (Halcion) (ID 16010)\". Erowid.org. May 27, 2006. erowid.org/exp/16010",
 "substance": "Triazolam (Halcion)",
 "bodyweight": "200 lb",
 "report": "<p>I have been plagued by insomnia for years, and it was only recently that I went to the doctor for pharmaceutical assistance. I was prescribed Sonata and that usually did the trick. I sometimes took it during the day for a mellow 'high' feeling.  Then my sister (who suffered from short-term insomnia, brought on by stress) came home from college with a whole bottle full of Halcion. I decided to give this small white pill a try. </p><p>I took it the first time and fell asleep much fast and calmer than with Sonata.  Three nights later I once again found myself without sleep and went to the bottle again.  Two nights later I did the same. This continued to happen until I was taking them every night just to fall asleep. The bottle was running low, and I was relieved when my sister ordered a refill, no questions asked. My life and sleep pattern dragged on, a slave to the Halcion. During the day I was numb, strung-out and indifferent to the world. I felt overjoyed when night came and it was time for the pill. Eventually I needed two pills just for an effect. I finally recognized the addiction I was in.</p><p>My first night without the Halcion was absolute hell.  I had hid the bottle far under my sister's bed earlier in the day, figuring I'd be wanting it later and knowing I wouldn't retrieve it there for fear of waking her and needing to explain.  I was absolutely restless and twitchy all night, and did not fall asleep at all.  The next day I was irritable and cranky and started craving the pill, something I had never done during the day. The same followed the second night and day, and the third.  I normally smoke one pack of cigs a day, but during this small time I went through eleven and a half. It was not until the fourth night off that I slept, and this was only for three hours. After that, it became easier, and within two days the cravings were basically gone. I now stay away from Halcions completely and stick with my Sonatas.</p><p>After using recreational drugs for two years, I was surprised to find my first real drug addiction (besides cigarettes) to something that wasn't even real fun.  I got hooked just trying to sleep, and getting off of it was an absolute torture.</p>",
 "year": "2002",
 "id": "16010",
 "gender": "Male",
 "timestamp": "2006-05-27T07:00:00.000Z",
 "views": "11361",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Triazolam",
   "form": "(pill / tablet)"
  }
 }
}
