{
 "title": "Better Smoking Through Pharmaecuticals",
 "author": "Echo",
 "citation": " Echo. \"Better Smoking Through Pharmaecuticals: experience with Salvia divinorum (5x extract) & Atenolol (Tenormin) (ID 16012)\". Erowid.org. Jul 14, 2002. erowid.org/exp/16012",
 "substance": "Salvia divinorum (5x extract) & Atenolol (Tenormin)",
 "bodyweight": "150 lb",
 "report": "<p>  I ingested a tiny (.5cm) white pill that held 25mg of Tenormin in preparation for smoking Salvia divinorum.  I had read around and was fairly certain that this was uncharted territory, but I felt I was safe.  Tenormin is a pharmaceutical in a class called Beta-Blockers.  Beta-Blockers DO NOT get you high.  Beta-Blockers simply regulate and normalize body functions such as blood pressure and heart rate.  They are prescribed to pianists who would shake horribly on stage or people afraid of heights getting on an airplane etc.</p><p>  I was a little nervous about my experiment because, well, everyone I know gets nervous when Salvia is waiting.  My goal was to have the strong (and generally unpleasant) physical rush of Salvia eliminated without hindering the psychoactive effects.  I thought this might work because when people I know smoke Salvia, they feel a tremendous rush of adrenaline with symptoms ranging from tingling to being pulled in some direction or another.  The rush of adrenaline and weird inconsistent physical sensations fit well into my mind as a good old-fashioned panic attack.</p><p>  Since Tenormin is not a fun drug, I had a little trouble discerning when I thought it had reached its full potential.  But then I felt a familiar settling of my heart rate and I knew I could begin when I wanted.</p><p>  I loaded a small dose of good quality 5x Salvia divinorum extract into my water pipe (you heard me, water pipe, bongs are illegal).  Then I prepared myself for a typical Salvia journey or a quick jaunt to the speed-dialed 911 on my phone.  As soon as I cleared the first bowl I knew the experiment was a success.  The psychedelic effects were not quite as strong as usual, but I had taken a small dose.  Of course, this was easily remedied by smoking a couple more bowls of the bugaboo (loving monster).</p><p>  I definitely achieved a Salvia experience that was among the strongest I have ever had.  I could continue smoking unhindered by the immobilizing physical side effects.  I had quite an intense experience and it had the exact same feel as I am used to Salvia having.  I had all kinds of uncomfortable and extraordinarily odd thoughts, but along my usual path in the Salvia world.  The only thing that I believe might have changed was that I may have had less auditory distortion.  Though this happens with me sometimes without Beta-Blockers.</p><p>  I will run this experiment again, and I intend to try a larger dose of Beta-Blockers at some point.  Though I imagine that as one increases the amount of Beta-Blockers taken, Salvia will lose some of its characteristic feel.  However, I do think a large amount of Beta-Blockers will allow me to push further into the strength of the psychotropic experience.</p><p> I believe, though I have absolutely no evidence, that the combination of Salvia and Beta-Blockers should be safe.  If anyone is to try this, always remember the golden rule of experimenting with psychotropics: START SMALL.  Huge doses of Beta-Blockers will eventually make the amount of Salvia needed astronomical, and the Beta-Blockers still won't be fun.  Do not be careless with what you are trying to explore.</p>",
 "year": "2002",
 "id": "16012",
 "gender": "Male",
 "timestamp": "2002-07-14T07:00:00.000Z",
 "views": "18865",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Atenolol",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
