{
 "id": 16016,
 "title": "Just Perfect",
 "date": {
  "submission": "2008-08-28T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Existensialist",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "40",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "2600",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I guess you could say that Ill try anything that will potentially make me feel 'good'. As is the case with my personal favorite drug, Hydrocodone.  My drug history includes: Diazepam, Alprazolam, Hydromorphone, LSD, Codeine, and of course, Hydrocodone.",
  "For the past 6 months my parents have gone to the doctor for chronic back and leg pain.  Each month they both come home with a decent amount of prescription painkillers. My dad is prescribed 180 8mg hydromorphone pills and last but definetely not least, my mother is prescribed 120 Loracet 10/650's (10mg hydrocodone, 650mg acetaminophen). So Im pretty much set to have a good time whenever I want.",
  "Last night I took 4 hydrocodone pills from the huge prescription bottle. I then came to my room, cleaned it up a bit so I wouldnt have to worry about messing with anything while I was feeling the effects. I also dimmed the lights to make the experience more mellow. I then proceeded to take each pill one by one, crushing it up with my teeth until it became a chalky paste, and then washing it down with some soda.",
  "It was about 10:10 and I had just taken the 4 pills to make a total of 40 mg of hydrocodone.  I sat back and turned on some incubus, and prepared myself for the induced heaven I was about to experience. 5 minutes later I was feeling the gradual coming on of euphoria, and warmth common in all opiates.  The stereo really felt wonderful, the music felt good, as if the music was about me, it made me happy.",
  "About 10 minutes later I was feeling slightly more euphoric, and a tiny feeling as if I was being tickled all over by little waves of comfort.  This was accompanied by a feeling of butterflies in the stomach which I might add, was feeling pretty darn good.  My body was becoming less tense, and my cares were slowly becoming less and less important.",
  "20 minutes into the trip the 'butterfly' sensation had gone from slight, to pretty strong, never the less, it still felt wonderful. The reason I love hydrocodone is because my body feels fucked up as ever, and everything is just perfect, but my mind becomes sharper, I am able to concentrate easier, its almost like this drug is a 'smart' drug.",
  "30 minutes after ingestion I can feel a slight itching behind my thighs, and my nose. I felt very friendly and warm, so I called my girlfriend, the conversation was great, not a dull moment passed. I was more open minded, and my ability to imagine things was amazing.",
  "45 minutes into the trip I felt wonderful, nothing could go wrong, my body was in perfect heaven on earth, I wish it was possible to feel like this all the time. I can definetely see why this drug is one of the most addictive.",
  "An hour from taking the pills I still felt very calm, and still 'super friendly' the warm feeling is still flowing through my veins. all my cares are of no importance anymore.",
  "At about 1:30 (3 hours and ten minutes after I took the pills) I noticed that I had come down, I felt perfect still, a little tired, but wonderful.",
  "I then laid in bed, and listened to some more music while I drifted off to sleep. I woke up the next morning with no hangover, no remote feeling of uncomfortableness."
 ],
 "erowid": {
  "id": "42835",
  "citation": " Existensialist. \"Just Perfect: experience with Hydrocodone with Acetaminophen (ID 42835)\". Erowid.org. Aug 28, 2008. erowid.org/exp/42835",
  "substance": "Hydrocodone with Acetaminophen",
  "views": "23327"
 }
}
