{
 "id": 16027,
 "title": "The Funeral of Life",
 "date": {
  "submission": "2008-08-28T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Chris",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:45",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "The first time I tried mushrooms was in January of this year. I had wanted to try them for a while, but never actually took the time to go out and ask around for them. Finally, in January my two friends came over. It was freezing outside and snowing heavily. It was the first snow day (night) of the year. My friend pulled out a large ziplock bag with a couple grams inside of it. Strangest looking little bastards I've ever seen. The caps were surprisingly small with long, foamy stems. He seperated the gathering of shrooms into 3 piles, one for each of us, and said 'This is about 2 grams each'. We all started chewing away. Holy shit did this stuff taste terrible, although it was kind of intriguing, in a strange way. My friend saw the way I was chewing and told me not to swallow them right away and that I should chew for a while in order to suck all the juices out so that I can get the 'full effect'.",
  "I truly had no idea of what to expect. The only other drug I'd done before shrooms was pot. I've heard that people have tripped on shrooms and saw walls melting or breathing, colors coming to life or dripping, and distorted images of regular objects. I guess this is partially what influenced me to want to try the stuff, but all in all, I was just looking for a new, interesting experience.",
  "I finished in about 15, maybe 20 minutes. For about a half hour after that, I felt nothing. My two friends were laying in areas in my room, while I was pacing around wondering if I was even going to get high. I leaned on my wall, facing the other wall, on which a mural of John Lennon's face is painted. I stared at it for a while, still feeling nothing, then it just sort of snuck its way in. The mural seemed to be floating away from the wall and up into the ceiling. I thought this was pretty cool but, I wasn't that high just yet.",
  "About 45 minutes after eating the mushrooms, we all decided to go out and do something, anything. We came to the conclusion that we would walk the streets in the snow while smoking a blunt and go to Chevy's to get something to eat. We bundled up and set out on our journey, and let me tell you this, it was one of the most life-changing experiences I've ever had. We walked down the streets, which were filled with snow, passed around some good-ass weed (purple kush), and finally made it to our destination.",
  "The restaurant was pretty much empty. There were about 2 other tables that were occupied aside from ours. I took a seat at the booth, feeling kind of normal, but then things started to get a little weird again. For some reason, we all just impulsively began several conversations dealing with philosophies and theories about life. I remember this one theory my friend Max and I came up with: The Theory of Nothing. We came to this conclusion that life is just nothing. Everything is nothing. Nothing matters, but it's alright, because we have 'acceptance', which, by the way, is also nothing. Ha..pretty stupid, but it freaked us out at the time. At one point, we felt that we were actually realizing and discovering things that God had never intended any humans to realize. I felt like we had broken into some sort of secret dimension that God has kept hidden from everyone since the beginning of time.",
  "Pretty soon after this, I proceeded to break out into intense laughter uncontrollably. The restaurant manager and waitresses would occasionally look over at our table and laugh and whatnot. I just kept laughing and laughing and laughing. I remember when the waitress came to bring us our drinks, I had a tortilla chip hanging from my mouth and silly grin on my face as if I was holding in a huge burst of laughter, because, for some reason, this situation seemed to be the funniest thing in the world to me. My eyes were glued to her hand movements, and the minute she walked away from the table, I started cracking up heavily. My friends did also.",
  "Then we had a conversation about the world that changed everything. I suggested the possibility that 'snow' is like 'The Funeral of Life' and proceeded to explain to my friends how the world seems to be dead when it snows like this. Everyone stays inside and does, yep, you guessed it, NOTHING!!! haha. That brought us back to 'The Theory of Nothing'. It was an extremely spiritual experience for me. I got up from the table and hung out outside, had a cigarette, hoped to keep it together and not lose my mind. From that point on, I was convinced that the snow was causing the world to end or some shit. I walked around the parking lot freezing my ass off but not caring one bit, took my cell phone out, and called almost every person I knew, to tell them that the world was ending, and that everything is nothing, and that it was okay, everything was going to be okay. It was a magnificant and at the same time frightening feeling.",
  "We finally left after what had seemed like ages, and walked to the train station. I waited for the train with my friends, said peace to them, then walked home. That I do not really remember much of. But when I got home, I was tripping out of my skull. I had this incredibly strange feeling that seemed to be attached to the back of my brain that kept trying to tell me that thing would NEVER be the same again. This made me feel nervous and paranoid. I grabbed a notebook that I use to jot down random thoughts and shit and chilled in my bathroom for some reason. I didn't have to go to the bathroom or anything, I just hung out in there for an unknown reason. I wrote down a bunch of stuff like: 'I assure that this entry is 100% different than any other entry in this entire motherfucking book.', 'Snow makes you realize things.', 'We are currently at the Funeral of Life.', 'This will be important to me one day.' 'Life came to me tonight.'",
  "I got some food and a drink, then laid down on my bed and threw on an Eddie Murphy comedy special on tape to try to bring myself back to reality. I felt that watching shit that I love or I'm used to watching would help calm me down and bring me back to the place I was before taking the shrooms. Eventually, everything settled down, and I fell asleep.",
  "When I awoke the next morning, I had sort of a slight hangover feeling and tried to compute the last night's events. I wasn't sure at that time if I even liked the experience. I haven't taken them since, but I definitely would. They gave me more a spiritual experience and an incredibly deep realization about life than a drippy, melting, distorted one, but it was still pretty awesome, and I would definitely use them again in the future."
 ],
 "erowid": {
  "id": "42867",
  "citation": " Chris. \"The Funeral of Life: experience with Mushrooms & Cannabis (ID 42867)\". Erowid.org. Aug 28, 2008. erowid.org/exp/42867",
  "substance": "Mushrooms & Cannabis",
  "views": "3180"
 }
}
