{
 "id": 1602,
 "title": "Mild Euphoric Trip",
 "date": {
  "submission": "2002-07-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mome Ath",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Calamus",
   "form": "liquid"
  }
 ],
 "report": [
  "One night a friend of mine, who was living me at he time, were really bored.  We didnt feel like drinking, and he doesnt smoke, so I began riffling through my hag of herbs.  We were looking for an exciting experience, not just something relaxing or stimulating.  So we decided on the Calamus Root.  I had heard that it was stimulating and possibly hallucinogenic but had heard of no serious side effects, so it seemed like a good choice.",
  "I began by crushing about an ounce of Acorus Calamus root in a food processor until it became a nice consistency; not a powder, but not big and chunky.  I then boiled about three cups of water, removed from the heat and added the Calamus, letting it steep for about 20 minutes before filtering out the roots with an old tee-shirt.  It was a dark brown, slightly cloudy liquid, with a pretty awful smell. We split the tea into two mugs and began drinking.",
  "The taste really foul, in fact, the only things that I have had which taste worse were a really strong nutmeg tea and a wormwood brew gone awry.  It tastes kind of like gin, without the alcohol, if that makes any sense.  It was around 8 pm when we finished drinking the horrid brew.",
  "After about 20 minutes we began to feel some stimulation, calm and euphoric.  It was really nice. We began talking and laughing like we had not done in a long time.  It really made me open up and it seems like a good social drug at this point in the experience.  The laughing and philosophical talk went on for about an hour before we began to feel any kind of real psychoactive effects.",
  "We were in my (our) room, myself on the bed and he in a recliner when we started getting silly.  I have a pretty fair amount of experience with drugs, so the effects, while very interesting, did not get too intense.  But my friend was rambling on about inane things and looking out the window and laughing.  He said, Look Nate! Its the trilinguistic vortex, pointing to the starry reflection of a streetlight on the window.  He seemed to be in a very silly hallucinogenic state, like a small dose of mushrooms.  A permanent grin on his face, he looked very comfortable with the experience.",
  "I was also enjoying myself, lights seemed to take on a new feel and there were some mild traces.  I turned off the light and played with a lit stick of incense, twirling it around over my head for what seemed like forever.  Eventually, we grew tired of being inside, as the streetlights and stars looked so interesting.",
  "We went out into my backyard, and my friend imagined that we were in some oriental fishing village.  He said that my neighbors house had paper lanterns and we should go look at them.  I assured him that there was no such thing, and we sat down in the grass, looking at the night sky, smoking cigarettes, and talking.  Eventually we went back inside, where we both had a pretty good nights sleep.",
  "Calamus is a very fun drug.  It was a euphoric mild trip, comparable to small doses of shrooms.  Other than the bad taste there were no unpleasant side effects.  I experienced no nausea and no over-stimulation. It was a great night, and I would say that Calamus is one legal psychedelic that is worth the effort.  Give it a try!"
 ],
 "erowid": {
  "id": "15029",
  "citation": " Mome Ath. \"Mild Euphoric Trip: experience with Calamus (ID 15029)\". Erowid.org. Jul 15, 2002. erowid.org/exp/15029",
  "substance": "Calamus",
  "views": "26969"
 }
}
