{
 "title": "Salvia Healing",
 "author": "Reality Construct",
 "citation": " Reality Construct. \"Salvia Healing: experience with Salvia divinorum (ID 16020)\". Erowid.org. Jul 14, 2002. erowid.org/exp/16020",
 "substance": "Salvia divinorum",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16020",
   "Male",
   "",
   "Not Given",
   "Jul 14, 2002",
   "17471",
   " "
  ]
 ],
 "report": "<p>\nI've done Salvia divinorum approximately 15 to 20 times (smoked, regular strength and enhanced 5x). It has changed me as a person and made me realize that there is a reality behind the reality we normally perceive to be real. It has also cured my depression. That said, I no longer wish to, or need to, take Salvia.</p><p>The first time I smoked Salvia I freaked out. I was not expecting such intensity so fast. It was overwhelming and could not be controlled. I lost all perspective of self. I realized that all matter is identical, that atoms combine into molecules and that atoms are nothing more than vibrations and that the reality we think we see is essentially something else. All this in the span of 5 minutes.</p><p>The second time I smoke Salvia--I only took one small hit--the person I thought I was dissolved and I realized that I was but a construct of memory. I experienced pure consciousness in an infinite void. It was brief, but life-changing.</p><p>Subsequent trips have resulted in beings--male and female--contacting me from the 1950's. These two beings were happy to meet me and they were at a fairgrounds (in one trip) and at at Dairy Queen (in another trip). </p><p>I no longer wish to engage in Salvia trips, as it is the grandmother of all hallucinogens and will reveal to the user a reality that is beyond unsettling. Imagine, 'waking up' from the reality you think to be real. This is a gateway substance to a portal that is beyond comprehension. But it definitely has curative powers.</p><p>My advice: take extreme caution when trying Salvia divinorum. What you think to be real is but a construct, and when that construct is deconstructed you may not like what you see. Also--avoid the extract, as the trip may last too long. I cannot imagine triping on salvia for more than a minute or two (smoking duration). Although I have purchased extract, there is no desire on my part to experience a 20 minute trip. </p><p>Set and setting: be with a trusted sitter, away from people. Avoid social settings and don't do it at parties. The Salvia Goddess does not like idiots, fools, or people who seek a cheap high.</p>"
}
