{
 "id": 16024,
 "title": "Timeless Hysterical Utter Insanity",
 "date": {
  "submission": "2008-08-28T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Captain Sunshine",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "165 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "I still don't know exactly how to describe what just happened a few hours ago. After years of thinking about it, I finally decided to take the Salvia plunge. I went to the smoke shop 3 blocks from my apartment, got a vial of 5x, and drove over to my friend C's house. We waited around for awhile for his friend to show up, and I tried not to get too anxious. Finally, we gave up on the third party and went upstairs to C's bedroom. He went first, loading up 1/6 of the vial, the recommended dosage on the package. Imagine, in this day and age, being able to walk into a store and purchase a psychedelic with a recommended dosage printed on it, this won't last much longer.",
  "He pulled in a big lungful, most of the bowl, and held it in for the recommended 30 seconds. I took the bong from him and he lay down on the bed, exhaling the smoke. He kind of laughed and said he felt like he weighed a million pounds, then he went away for a couple minutes, occasionally babbling some gibberish. He quickly returned and said he just got inside, wasn't there long enough to make sense of it. 'The curtain just came down', and then everything sort of was 'lego blocks'. That's all he could tell me, so while he went to the window, I loaded up my bowl, noticing that while he left probably a lungful of smoke in the bong, he burned through his whole bowl. I felt a moment of regrettable anxiety then I was inhaling a lungful of the magical smoke. I held it, and C said 'that should be enough, you should be fine'.",
  "Within 10 seconds, while I was still holding the smoke, I felt a physical sensation with no resemblence in normal life, or on any other substance. I've seen references to the salvia 'twist' and I bet money that's what's being referred to. It was a feeling of a corkscrew (of vines or plants, perhaps) twisting their way through my torso, inside and out. It feels like sharp pressure poking into my body, and then through and through. NOT pleasant, but not quite unpleasant either, it just is. During those seconds, I felt possession being taken of me by a plant. There's no other way to describe it. Well, that was all before I exhaled. As I was exhaling, I suddenly thought of something I was going to do tonight, some plans. Then I thought, but first I have THIS to contend with, as purple and red started obscuring my vision.",
  "The actual content of my trip is very hard to make sense of. Within seconds of exhaling, I had lost all sense of identity, time, place, etc. C was only, and had always been, the person by the window. He laughed a couple of times because I spent the whole experience laughing hysterically. All I could think was 'what what what what what, why why why why' as he stood by the window, laughing at me. I don't know how to put into words how timeless it all was. I had always been there, whoever I was. So had he, whoever he was. He was the antagonist, the one that caused this all. I had no recollection of smoking anything or putting anything in my body. But I knew he was responsible, even though I went and bought it and brought it over and was the first one to tell C about Salvia in the first place.",
  "I felt like an enormous joke had been played on me, and now when I think about it, what I kept trying to say to C (the person by the window) was that I didn't do enough to go anywhere, I just went insane. But enough what? I had the vague idea that we had played a game or something, but I had no recollection of what it was. The whole time, I was laughing hysterically and feeling the vines twist through my body, sometimes painfully. When I first started feeling like a horrible joke had been played on me, C kind of nodded and laughed and I felt my pelvis flatten out and vines poke through it. The bastard! Why did he do this to me? All I could do was laugh and laugh. And keep trying to sit up, but I couldn't.",
  "I've read about the female presence before and it was there in full effect. I don't know how to describe it, but it sort of infused everything. Kind of like when I feel the mushroom's presence, somewhere outside the fringes of the universe.",
  "Anyways, my first salvia experience was spent mostly trying to make sense of a universe that had gone utterly insane. Everything still pretty much looked the same. The room seemed bigger, and at some point, either I said something, C said something (he claimed that he just stood by the window and smoked the whole time) or somebody THOUGHT something, but whatever the word was, I saw it in red, in the air, going past me on both sides of my head. I wish I could remember what the word was. Or maybe it was a pattern from the room.",
  "I have a feeling that this plant has much to offer and I'm not sure if I'm done with it yet. I suddenly snapped back to regular reality, not even drifting out, just snapping back. Suddenly I was able to tell C what I had been trying to say, that I hadn't done enough to go anywhere but insane. The difference now is that I remembered who he was and who I was and where we were and what we had just done. It's still bizarre how totally that all went away, and how I can still remember not knowing who I was. I'll be back, salvia. I might not have gotten enough smoke this time."
 ],
 "erowid": {
  "id": "42859",
  "citation": " Captain Sunshine. \"Timeless Hysterical Utter Insanity: experience with Salvia divinorum (5x extract) (ID 42859)\". Erowid.org. Aug 28, 2008. erowid.org/exp/42859",
  "substance": "Salvia divinorum (5x extract)",
  "views": "3319"
 }
}
