{
 "id": 16031,
 "title": "Intense OTC Combination",
 "date": {
  "submission": "2007-12-31T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dex Junkie",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "300",
    "grams": 0.3
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150",
    "grams": 0.15
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "",
    "quantity": "0.3333"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "400",
    "grams": 0.4
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200",
    "grams": 0.2
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "800",
    "grams": 0.8
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Saturday night: I'm bored.  I had previously had a remarkably intense trip on dxm polystyrex, although it had unpleasant consequences the following day.  So I decided to do it right this time, looking for DXM HBr.  I found it in Robotussin cough gels.  I took all 20 pills each 15mg of DXM HBr over the course of an hour.  I was feeling light headed, a buzz similar to being slightly drunk, so I decided to go out for more.  While I drove to the gas station the effects started to become a bit more intense, I felt one second like I was almost floating, and another second like I was walking on Jupiter, making it difficult to cover-up my condition as I walked into the gas station.",
  "I saw a bottle of Tussin DM but it had Guaifenesin so I also picked up some Dramamine and No Doz so I wouldn't fall asleep and miss the trip.  I took 150 mg of Dramamine, and chased it by drinking about 1/3 of the bottle of tussin, and chased that with 400 mg of No-Doz.  I started really tripping after that.  I was delerious and I decided to take 200 mg more of Dramamine and 800 mg of No-Doz to intensify the high.  I should have taken more No-Doz, cause I ended up falling asleep before I planned.  I was lying down on my bed entranced by music visualizations on the computer for about an hour, and the room felt like it was spinning and I was overwhelmed with euphoria.",
  "I plan on repeating this some time by taking dimenhydrinate instead of dimenhydrinate in the future, along with more dxm to produce more intense visuals, and of course pot would have made the trip much better, but then again, pot makes EVERYTHING better. haha"
 ],
 "erowid": {
  "id": "42881",
  "citation": " Dex Junkie. \"Intense OTC Combination: experience with DXM, Dimenhydrinate & Caffeine (ID 42881)\". Erowid.org. Dec 31, 2007. erowid.org/exp/42881",
  "substance": "DXM, Dimenhydrinate & Caffeine",
  "views": "10049"
 }
}
