{
 "id": 16045,
 "title": "Unzipped Ego",
 "date": {
  "submission": "2008-08-29T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "42",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "125 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "As far as preparation goes, there wasn't a lot of preparation.  A friend came over with the quick trip drug, salvia.  To be honest, I was excited to take it and was expecting to have lots of fun.  I can't put my experience into the category of fun, but I can certainly classify it as an experience well worth having.  The provider of Salvia told everyone to be completely silent while I was on my trip.",
  "My friend loaded the PURE, a glass on glass 2 foot single perk bong, with an 1/8 of a gram of Salvia.  It was in the form of crunched up dry leaves, like I was smoking horrible shwag.  I burned it slow to ensure that I didn't pull it through the down tube too early and I shacked a full tube of Salvia.  The last thing I remember is sitting back on a couch with my arms up on the backrest trying to keep all that smoke in my lungs for as long as possible in my friends dark bedroom. Note that I don't remember exhaling.",
  "The onset of salvia was instant. I instantly forgot where I was, that I had taken any drug, and was now enjoying some grub with some people I thought at the time were my family.  Oh, but wait, why is everything shaking? Excitement rushed through me because I thought I was in my first earthquake.  Imagine the confused and terrified look on my face when I realized that it was just the people that control the universe unzipping their handbag and we, human beings who are supposed to be the highest power, are just molecules that can communicate with each other.  Everything that I knew in the whole universe ended up existing as a small patch of some other lifeforms handbag.  The handbag must have been mostly plastic because as the trip went on, I could see that people, walls, and everything had a plastic like texture.  I was just plastic, dumb plastic.  My soul was crushed completely.",
  "Oh, now comes the rediculous part. It turns out that the zipper to the handbag that we are all apart of runs right through earth, my house, and some of my friends.  I will glance over the completely confusing unzipping of the zipper.  I saw I coming.  The ground was shaking and from a distance I saw the edge of the earth split and lift up into the sky as if I was looking up from someone's feet as they unzipped their pants and folded down both sides of the zipper.  I can't explain that more clearly.  About the zipper, their was no head to the zipper, there was just a zipper seam running across the earth that was being pulled apart.",
  "Everything became 2D and pancaked together including myself to the wall.  My friends were with me again but they were either pancaked to the bed which was in turn pancaked to the floor or the were of the other wall. I could not move as I was lifted hundreds of feet in the air as the splitting zipper was getting closer and closer.  I was a nothing piece of plastic that could do anything but watch the earth be unzipped.  The seam ended up splitting right next to me but avoiding me all together.  One friend was cut in half but not bleeding because he was just plastic and my house split in two. Everyone, including myself was screaming.",
  "The effects that I think are important to note are the following.  I believed for that short while, which my friends timed to be 10 minutes, that I actually was just a dumb pointless piece of plastic.  That does something to your ego.  I must say though, I am completely normal now and understand that it was just a trip. I have suffered no flashbacks of any kind from that trip.  Another note, after ten minutes, I zapped back to reality told my friend that I needed a breather, I stepped outside and was completely distraught about whether I would ever be normal again because for about ten minutes following my ten minutes of trip my brain seem to just race with thoughts I couldn't calm down.  I lied down until my mind stopped spinning and, cold water helps, and I was completely fine again. ",
  "I don't remember what I was actually doing while I tripped, but my friends told me that I crawled slowly to the opposite side of the room, stood up and sprinted into the wall head first.  The bump on my head was massive enough to prove that.  I plan on doing it again because dealing with such an extreme experience helps at least me grow as a person.  I can remember it like it just happened and I could imagine telling it to others as if it really happened. 'Yeah, life's a bitch, just yesterday my friend was cut in half by a giant zipper and found out my life is worth less than a $5 handbag.  Those memories change people for sure. I give the trippiness of Salvia an A+."
 ],
 "erowid": {
  "id": "42953",
  "citation": " 42. \"Unzipped Ego: experience with Salvia divinorum (leaves) (ID 42953)\". Erowid.org. Aug 29, 2008. erowid.org/exp/42953",
  "substance": "Salvia divinorum (leaves)",
  "views": "3129"
 }
}
