{
 "id": 16048,
 "title": "I Wonder How This Is Possible",
 "date": {
  "submission": "2005-05-11T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Collin",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "DXM"
  }
 ],
 "report": [
  "<p>It is 4 am.  I am sitting bolt upright in bed, legs dangling off the side, only too aware of the increasing intensity.  I look down, concentrating feebly on the spinning porcelain bowl of vomit, my vomit, and wonder when the next one will come.  And then it hits me, flush on.  My skin is burning.  I am on fire. ",
  "'You are only imagining this.  This is a figment of your imagination,' I tell myself.  But is it really?  Perhaps I really am burning up.  Does it even matter?  I stare straight ahead and suddenly wonder whether my eyes are open.  The burning passes, and I flop down on the bed clutching at my face.  I think I hear a voice, possibly my own laughter, but it passes after maybe a few seconds. ",
  "Suddenly I am moving.  I need to hear Beethovens Ninth Symphony, in all its glory, in its entirety, immediately.  It is a matter of life and death. ",
  "Motion does not come easily, however.  I find gravity extremely confusing, and I can do little more than stumble drunkenly in what I believe to be the right direction.  I am holding a black and white CD case.  The tray slides out, and I am grasping the disc with my right hand.  It will not fit. ",
  "This is catastrophic.  I realize I am burning again, so I throw off my sweatpants and step onto my balcony.  It is pouring rain, and with absolutely no hesitation I sit down on a drenched plastic green chair. I realize the problem: I need to take off my socks. ",
  "I cannot feel the moisture against my skin even though I am soaking wet.  In the grip of insanity, I tear at the insipid cotton suffocating my feet, but I realize that I am shivering, so I go inside, and I hear the choral section of the Ninth jumping to my ears, and I wonder how this is possible. ",
  "I am lying on the sofa, looking at my watch.  The numbers are spinning in a circle, and I feel I could decipher them if only I could perceive them.  But then I wonder why we always try to decipher, always try to make sense out of everything, and then I wonder what it means to contemplate deciphering.  And soon I am caught up in the vicious cycle of meta-thought, where thoughts never dissipate, they simply iterate, thinking about thinking about thinking, and everything is so obvious yet so distant all at once.  Recursion, recursion, recursion.",
  "And then the paranoid thoughts come.  Any minute they are going to knock on my door, tell me my music is too loud and they know who I am and what I believe and they are taking me away.  But I recognize these as illusory figments: they must be rejected.",
  "So I lie down on my couch, covered loosely in a blanket of astounding redness, and I reach over for water.  It spills; I search for repercussions, find none.  Perhaps this is actually my right mind, and only now do I realize that my actions have no consequences.  I will never leave this train of thought.",
  "I am having considerable difficulty making any sense out of the music.  It is soothing, yet distant and confusing.  I am touching my arms and face, and the resulting sensation is one of touching together two completely incommensurate substances, perhaps rubber and existentialism, and it seems to be draining like sand through my fingertips, through my nails. ",
  "I have never been more tired in my life.  I can no longer tell whether it is getting more intense, less intense, whether I am even high.  I am not sure I care at this point.  Everything is losing its meaning, and I melt into my bed, ferried off into an open field of shamanic revelation.</p>"
 ],
 "erowid": {
  "id": "42957",
  "citation": " Collin. \"I Wonder How This Is Possible: experience with DXM (ID 42957)\". Erowid.org. May 11, 2005. erowid.org/exp/42957",
  "substance": "DXM",
  "views": "128024"
 }
}
