{
 "title": "What I Saw in the Looking Glass",
 "author": "Ja",
 "citation": " Ja. \"What I Saw in the Looking Glass: experience with Salvia divinorum (herb & 10x extract) (ID 16045)\". Erowid.org. Jul 15, 2002. erowid.org/exp/16045",
 "substance": "Salvia divinorum (herb & 10x extract)",
 "bodyweight": "180 lb",
 "report": "<p>Me and two friends were out on the town the other night and were bummed for weed. Jose says to me 'hey i just tried salvia with my brother a few nights ago, and it was a lot of fun, lets try that' (because neither i nor the other guy we were with had done it before) and he simply refused to tell us any more about it.</p><p>Now Jose and i had tried it once before, ordered a bag of salvia 'regs' online 2 years ago, before anyone else had heard of it. we both tried it then, but it did nothing for us, so i dont count it. but jose insisted that it worked this time and told me that the trick was a blowtorch lighter.  i didnt believe him at the time, but went with it anyway.</p><p>so, jose, adam and i went to a local head shop and bought a couple grams of it for $35, plus a blowtorch lighter. then we went back to adams apartment. lucky for us he had just moved in and really just had furniture there, everything else was in boxes. we decided we would commandeer his front room for our purposes. the only way i can really describe this room is as light and airy. it was almost a porch, fully blown with screen windows. anyways, jose tells me that it lasts 10-20 minutes and it would be best for us to take turns, like smoke it, enjoy the whole trip, then the next person.</p><p>so thats what we do, and i go first. i admit that i was not being fair in my estimation of this stuff. i went in with really no expectation, and came out with a completely mind bending experience. if i could only tell you one thing about salvia, it is a very busy drug. i thought many things that night and every one of them had something busy going on in it.  the first two times i did it, i experienced worms made of burning incense marching, covering and taking over everything. (we had some nag champa incense burning in the room, so probably...) laying on my back watching the fan on the ceiling it transformed into a guy harvesting salamis that were danglings from the cieling, and the walls were where he couldnt harvest cuz a man can only do so much, and the salamis grew all the way down to the floor. i also think that salvia has a very overpowering taste to it too, but jose and adam dont think so.</p><p>the third time i did it was magic. now we had been taking turns, so jose and adam had done it twice also by this time. and these thoughts came in very rapid succession: before it hit i was thinking about just us taking turns. then as it hit, it became very funny how we were taking turns. (becasue things get very funny on salvia, and youre prone to uncontrollable laughter) then an image flashed in my mind of a bunch of small children climbing over each other and jumping to look through a small window. then i became one of those children, and noticed that adam and jose were there with me too. and in real life i sat up and looked at the makeshift water bong we were using, and saw the window in that. and then salvia became that window. and then it was my turn to look through the Looking Glass. and this is the really amazing part, everything in my life became so clear. all of society became clear to me. i saw EVERYTHING. Sept. 11th flashed through my mind and an amzing thing happened. right there, laying on adams couch, i resolved to change the world. a bit idealistic, to be sure, but ever since that day, i have never been the same. i am no longer content to sit around on my ass all day. because i saw what was in that looking glass. what i saw i cant explain, but a good deal of it was what the human race has become. and why it needs to be changed.</p><p>Why cant we have a society where you can trust a stranger? why do we have to have terrorists? is ignorance really necesary? why is it human nature to destroy? or is that just societal conditioning?</p><p>This is probably not the best place to be saying something like this, but i feel i need to say it to someone. anyone. even if it never gets read.  ever since that day, i have been thinking about this Change. weed has been transformed into a sort of jet fuel for my mind. i even picked up a few text books and just started to read them and go through them. and ill let you know something, the more i think about this Change, the more possible it seems. a long and hard ordeal, yes, but still possible.</p><p>Salvia has changed my life, and i would like to think that it has changed the future of the entire world too. it can also change your world. If ever you are confronted with your own Looking Glass, dont be shy and dive right in, who knows what can happen.</p>",
 "year": "2002",
 "id": "16045",
 "gender": "Male",
 "timestamp": "2002-07-15T07:00:00.000Z",
 "views": "14340",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
