{
 "id": 16055,
 "title": "Unexpected Change Of Reality",
 "date": {
  "submission": "2005-06-06T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "M.A Wilkes",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "This is my first experience story so I'll get right to the chase.",
  "It was a pretty nice day out; went to school, and was released at 3:05. My best friend Mike was the person who gave me a ride home after school; as my car was buggered. Well we got in his car and I asked him what he was up to, he didn't have to work, so I asked him if he wanted to chill. He brought up the suggestion that we try some Salvia, because he had never tried it; and he's heard a lot about it from other people. I was down; I enjoy any kind of Mind expanding drug; and weed being my recreational drug of choice.",
  "So we phone up Adam and Jeff; they're brothers who are part of our 'stoner circle' and they were all for it. so we get some money together and go to the head shop and buy some Salvia. We head to our favorite stoner pad outside; which is on a hill behind this Cylindrical round building. Anyway we started playing some foot-hack for about 10 mins; but I told them all we should smoke; they were all down with it; so we did. We had 2 pipes; and 4 people, we rock,paper,scissored for whoever gets first dibs. Me and Adam won out of the group.",
  "(First Try 0:00)  So we take out hits. These were about half sized bowls; but good enough for full lung hoots. We both held it in as long as we could and released it, immediately we knew what we just got into especially me since I had smoked this stuff previously a few times, but not a lot at a time; (only about the amount we just smoked). I burst into laughter; and got up; we both started laughing histerically and the other two (Mike and Jeff) took their blasts and joined us. We all ran down the hill and they kind of danced down the hill like Leprechauns, so that made me laugh even more. Anyway then my buddy Adam was staring at the sun, and then I got attached to sun;  but realized how stupid it was; so I pushed him over telling him not to look at it, (as if it would kill him) or something. This lasted for a good 15-20 mins. Then we started playing some foot-hack again for a good 30 minutes.",
  "(Second Try 0:50) So we decided we wanted to go for round two, this time I packed a bigger bowl, and so did Adam, as soon as me and Adam start taking our hits; my buddy Jay arrives who is one of my best stoner buddies haha. Anyway he knew something was off, right off the bat, so Mike informed him of what we've been doing all night. Anyway, I gave all the pipes and shit to the other guys as fast as I could cause the Salvia was hitting hard. I fell onto my chest, and lied in the grass and rested my chin on my arm. all I could see was my black sleeve, Blades of Grass (which were right in front of me) and then the dirt surrounding the edge of the building, and then this black tape that was under the edge of the building that wrapped around the entire base of the building all the way around. It was spattered in what looked like mineral deposits or something. Anyway. I lied on my chest there for a few seconds... and something didnt seem right... I was standing up... on this black pavement, on the edge of it as if I was looking over a world that had its own history, peoples and civilizations.",
  "All of a sudden I started talking as if I was a narrator to a story or something. I started explaining the different levels of society upon which I was standing on. I started by the people on the black cement, as we (the black cement people) are the gime of this world and do the labour work that needs to be done; then you have your forest people; the people that live umongst the thousand feet high grass blades, they were like the middle income people. I talked about how their role was very crutial to the survaval of the civilization that we lived in. Then I moved to the people in the dirt and rocks surrounding the building; I explained how not too much was known about these people as they were part of a secret society that none dared question about, and they were the 'rich' people of society. Then came the really weird part, I explained the black part, with the white spatters. I pictured it as the edge of the world; going into space, they were the space docks, and the blackness and the white were the beyond; the stars. I explained how these people were the Elite, they were the ones who dominated our lives. I went on about how they controlled everything, the whole time talking in a very deep, intimidating voice (it was fucked). Then my trip started to wear off. We played some Hack and went to our cars for a bit to warm up.",
  "I lied there on the grass kind of shocked... I had never hallucinated off of Salvia before... I had new respect for this plant, and realized its effects are more powerful than most may think.",
  "I have been looking for acid for a long time; and I still haven't found it, so I've been trying other psycadellics, like Mushrooms and stuff. Anyway, I decided I wanted another blast, but much larger... the bottom of the bag. So we divide the Salvia 2 ways for me and my friend Jay, me and him are the only ones in his car, the other people are in their cars just chillin'. So Jay packs his bowl very large, he wanted to have a good run, so he blazed away.",
  "I remained silent so he could enjoy what came his way without interruption, he started talking to people that werent there (not making a whole lot of sence) but he remained calm, then proclaimed 'I fucking hate you guys'. I didn't know how to react, as I knew he would never say that to me, but he said 'Guys' but there was only me, so I realized he must be tripping pretty hard. He was on a Harbour dock, and was talking to some girl, and then started getting pushed by these two jocks, and then thats when I assume he said 'I fucking hate you guys'. (dont worry this trip has signifigance).",
  "Jay finished his trip and we were reflecting on it, facinated by what he just experienced, in this time Mike and Adam come into or car to chill. So I pour all the rest of the salvia into my bowl. It was a HEAPING bowl of salvia, it must say I was quite intimidated, but I went ahead anyway, because I just didn't care, haha.",
  "(Third Try 1:20 est)I took in a mighty hoot as much as my lungs could hold. I held it for 30 seconds and released, quickly re-lit the bowl and smoked the rest of it. After filling my pipes chamber about 4 times, I yelled 'I SMOKED TOO MUCH' and threw the pipe and lighter at Jay.",
  "Everyone knew to be quiet as I was just about to enter somethign so radical and intense that they didnt wanna interrupt it for me.",
  "Well I immediately got sucked into this square tunnel, and I was leaning up agains my seat, and I also felt like I was being pushed   into it; until it broke down (when it really didnt) and I kept getting pushed through (time?) I didn't know where I was, I felt like I was being pushed through days, and I hated it, I screamed out things how I wish I had a mom and crazy shit like that (I do have a mom, so I dont know what I meant) And then suddenly I slowed down, and it became clear to me that I wasnt being pushed through days, but it was whole worlds. I had landed in Jays world of the Harbour. (Jay's car interior was blue like water so it was hard not to trip without thinking of water).",
  "But I wasn't at the docks, I was up the stairs on the edge of the cliff where all the stores were and stuff. But the buildings had personalities, and faces, and those faces looked like the Round headed pringles guy (on the chip can). Anyway, they talked really weird, but they talked, and I was talking with them about how the weather was, and how the seagulls were really beautiful today, and some other things I cant really remember very clearly. Then as I'm still tripping Jay decides to interact with me. He asks 'Hey Mike, does San Pedro own the store?' And I wasn't sure where this voice came from at first, so I looked up (remember I'm still fucked up) and I see the sky turns green at the top, and his face was another  pringle guys face, except his moustache was all jagged, and he spun in circles in the sky laughing like 'Oh Hohohohohoh' all Jolly like, it was rediculous. He contined asking me questions, and I found it harder and harder to answer, and I started getting scared for some reason, as I felt I was going to get in A LOT of trouble for something, but I didnt know what it was. My best friend Mike knew I was starting to head down, so he asked me what we did in our class today, as we have 1 class together. He said this in hopes that it would bring me back to reality.",
  "Well #1 hearing his voice made me feel really safe and calm cause he asked me very calmly, I recognized the voice so I felt like I was able to not fret about anything, I dunno how to explain it, but yeah, I  instantly had a complete vision change when he asked me that question, and it was just color splotches and things running into each other (as if my current world kind of smeared away very slowly).",
  "Instantly I had visual contact again with reality, and I felt somewhat re-assured knowing where I was, but I was just starting to come down, not much else interesting came after that, I talked to my pipe for about 30 seconds, cause it kept hitting me in waves. But once I came back, yeah it was very off feeling, I felt very uncomfortable, and wanted the feeling to end, everything was bothering me on the come down. The whole car incident seemed to last for weeks, when it was merely 10 mins of craziness.",
  "Sorry for my bad punctuation, I just went through this experience, this evening, so my mind is a bit tender still.",
  "I underestemated Salvia, the first 3 times I tried it I only had 1 smaller hit, and it was pretty crazy, made me laugh lots whatever, but it was nothing compared to what happened this evening, as this was as bad as (if not worse) than when I ate 5 grams of mushrooms.",
  "Thankyou for letting me tell my story!",
  "Peace!"
 ],
 "erowid": {
  "id": "42977",
  "citation": " M.A Wilkes. \"Unexpected Change Of Reality: experience with Salvia divinorum (ID 42977)\". Erowid.org. Jun 6, 2005. erowid.org/exp/42977",
  "substance": "Salvia divinorum",
  "views": "3886"
 }
}
