{
 "id": 16052,
 "title": "Transgression into the Forbidden Abyss",
 "date": {
  "submission": "2006-06-18T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kronos05",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 ml",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(gas)"
  }
 ],
 "report": [
  "My experience with ether has been over the past 72 hours when I obtained 500mL of the pure stuff from a chemical supply company. It is expensive in purified form, but I do not think that other organics dissolved in the 'starting fluid' encourage a positive experience free of side effects including tissue damage from those other volatiles. I have tried chloroform and halothane previously in my lab, the latter by accident, but decided to be 'old fashioned' and consume ether on my own away from the laboratory.",
  "The dose I took was very large, and resulted in loss of consciousness multiple times, complete loss of all motor skills, vision, and some difficulty with breathing for a short time. I blacked out several times and tumbled to the ground only to wake up and breathe more from the cloth - it is horribly addicting stuff and care really needs to be taken with how it is consumed. The body literally craves the stuff and will go to great lengths to get more even when nearly completely incapacitated.",
  "During this binge, I can rightly state that I felt nothing else except a complete sense of euphoria and peace. I felt like the all of my consciousness evolved into a higher plane where the reasoning for everything was placed out for me to understand. Quite literally, an equation was drawn up before my eyes explaining the origins of the universe where God and the Devil (both things in which I do not fully believe) planned a series of events during which humanity came forth from nothing. This timeline was vast unwinding kinetically just like a chemical reaction and explained the existence of freewill as an illusion created by the Creator's powers as a crutch for human beings constantly in search of an absolute truth. The absolute truth, when revealed was a molecule - the physical representation of the ether molecule whose chemical formula became the key to solving the mammoth 'life equation'.",
  "This happened, after talking to my roommate about when he heard me pass out against the door in the bathroom in less than three minutes. Time was distorted to the point where it was impossible to recognize anything as real and only this bizarre dream world and the attempt to comprehend the infinite nature of my own mind mattered to me. This quest became an obsession followed quickly by a final drift into semi-lucid dreams and eventually peaceful sleep."
 ],
 "erowid": {
  "id": "42973",
  "citation": " Kronos05. \"Transgression into the Forbidden Abyss: experience with Diethyl Ether (ID 42973)\". Erowid.org. Jun 18, 2006. erowid.org/exp/42973",
  "substance": "Diethyl Ether",
  "views": "20322"
 }
}
