{
 "id": 16057,
 "title": "Breathing Difficulties",
 "date": {
  "submission": "2005-07-15T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "SeeChao",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>It was on the last dying trails of and LSD trip that I decided, I would like to kick it up a bit and see if I can go back into outspace, and that I would smoke a bit of 2C-I to tickle my brainmeats a bit more.",
  "Now, I have done 2C-I five times as of this writing, the 2C-I that I have had has been obtained from two seperate research chemical companies, and I can be pretty certain about its authenticity, fluffy cotton candy like puffs of ickyness.",
  "I seem to have a differant responce to the substance than most, after injestion, even on an empty stomach, it takes 2:30hrs to hit my feelers, 3:00 to 3:30hrs to peak, two fellow explorers have the same timeline, and one feels it in 30 minutes and peaks at 1hr, I dont know why the huge variation in time for this chemical to take hold...",
  "My dose range is also higher than listed, as well as for the two with the long wait, our 'sweet spot' is 40mg.",
  "Back to the story, I had wanted to avoid the 3hr wait by smoking the 5mg(eyeballed from a premeasured 40mg dose) 2C-I in a freebase pipe I had purchased for DMT and other such journeys.",
  "The smoke was horrid, burnt my lungs, but didnt make me cough. After exhaling, the burn kept getting worst, I became asthmatic, and had alot of trouble breathing, I felt like a layer of my lungs had been stripped away. I lay on the couch and tried to breath, I got slight visuals, for a breif momment, and then they where gone. My breathing kept getting worst, after about 1:30 to 2hrs, I was having so much difficulty breathing that I was feeling faint, and fearing passing out, my lungs still hurt.",
  "I asked a friend to drive me to the emergency room. I was given sabutimol(spelling?), ventilin, in an oxygen mask, after telling the Dr. I had accidentaly mixed bleach and amonia while cleaning the washroom. Once the asthma subsided, and my lungmeats stopped spasming, I felt alot better, I was breathing normaly, and no longer felt like I was passing out. My lungs where sore all day, and still a bit sore in the morning, but nothing serious.",
  "I think that If I had had an asthma inhaler(I had asthma as a kid) I could have avoided the whole hospital bit, but the pain itself is enough to make sure I never try to smoke 2C-I again. However, I still love the stuff, I'm going to the zoo on 2C-I in just a few houres, but I will never complain about the 3hr come up again, well, that not true, im sure I will, But I wont be trying to do anything about it anytime soon....</p>"
 ],
 "erowid": {
  "id": "42982",
  "citation": " SeeChao. \"Breathing Difficulties: experience with 2C-I (ID 42982)\". Erowid.org. Jul 15, 2005. erowid.org/exp/42982",
  "substance": "2C-I",
  "views": "13832"
 }
}
