{
 "id": 16064,
 "title": "Ether Binge",
 "date": {
  "submission": "2000-10-07T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Matt"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 ml",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(gas)"
  }
 ],
 "report": [
  "One day my roommate and I got it in our heads to do some ether... he had taken 100 mL pure diethyl ether from his college chem lab.",
  "We poured it onto a rag and inhaled the vapors. It smells like turpentine and is a little difficult to take big breaths of at first. Seconds after I took a few lungfuls I felt the effects, which were mainly a mild euphoria and blurred vision, which lasted a few minutes.",
  "It was kinda fun, but nothing great- so we decided that we must not be doing enough. A few nights later I decided to sit down and get crazy with it. I buried my nose deep into the rag, to the point where it burned slightly as I took my first few breaths. I really had to inhale sharply in order to breathe enough in before it all evaporated away. Again, the same effects - stronger but still not what I expected. I figured I might as well huff the rest, have a few cheap thrills, and be done with it.",
  "I walked over to where my roommate was and began to do more. I poured about 10 mL out onto the rag at a time, huffed until it had all evaporated, and then waited a few minutes to come down before my next dose. I poured another 10 mL out and huffed the rest of that... by the time I had inhaled about 3/4 of what was on the rag I realized I had blacked out between breaths of ether, while I was talking to my roommate. I was wobbling heavily, I couldn't move, and I was talking but only gibberish was coming out. I tried to step forward and nearly fell. I felt an intense euphoria, which lasted for about 4 or 5 minutes. The loss of motor skills lasted about 45 seconds.",
  "I continued to do more, taking a few breaths of ether every 5 minutes, or whenever the euphoria started to wear off. Each time I got the euphoria back, but I never lost my motor skills or blacked out again. The desire to do more immediately was pretty strong but went away a few minutes after the effects wear off.",
  "It was a fun experience once I finally went all out and did enough. The smell is terrible, and it lingers slightly for the rest of the night, but it worth it if you can inhale enough to get to that second plateau."
 ],
 "erowid": {
  "id": "43",
  "citation": " Matt. \"Ether Binge: experience with Ethyl Ether (ID 43)\". Erowid.org. Oct 7, 2000. erowid.org/exp/43",
  "substance": "Ethyl Ether",
  "views": "115926"
 }
}
