{
 "title": "Absenta Serpis",
 "author": "LaPrimeras",
 "citation": " LaPrimeras. \"Absenta Serpis: experience with Absinthe (ID 16060)\". Erowid.org. Jul 16, 2002. erowid.org/exp/16060",
 "substance": "Absinthe",
 "bodyweight": "90 kg",
 "report": [
  "<p>The mystic liquid was ours for discovering yesterday night. As a couple we engaged to get to the bottom of it :)",
  "Since it is now legal, my husband went and bought a bottle of Absenta Serpis (10mg Thujon/kg, 55%alc). Surprisingly it was red, which was a bit of a letdown in trying to recreate a early 20th century bohemian experience.",
  "We set up the table with two glasses, a decanter filled with ice water, sugar cubes and of course, the star of the evening (directly from the freezer). We placed a sugar cube on an absinthe spoon atop  the glass and poured the Absinthe slowly over it until the glass was filled to 1/3. We then lit the sugar which burned in a lovely blue hue.",
  "Then dissolved the rest by pouring the ice water over it and fascinated watched the opacity rise. (being red it looked like a refreshing orange juice and very healthy ;) )",
  "Sant!",
  "The expected aroma of anise overpowered the taste of alcohol. The first notable effects were talkativeness and complete relaxation. Combined with a nice feeling of warmth. After a short while we became quite euphoric and started talking lightheartedly about problems, which now didn't seem to weigh that much. Also the mental creativity was very much a thing that wanted to be exercised. So we tried our luck in writing some poetry and yes, reading it today doesn't really make you cringe. Up to this point a really pleasant experience.",
  "I drank three glasses and my wife two. We decided that that was the limit. Later the alcohol took over with all its nasty effects, which kind of ruined the pleasurable work of the Thujon.",
  "With the head spinning and feelings of nausea we went to bed.",
  "Resum",
  "The Thujon has its very own life and is nothing like any other drug we have encountered. You feel relaxed and most important you still have control over your mind. We recommend you try it but in not too great quantities, unless a really really big hangover is your thing! If you are looking for a kick or trip which you can get from marihuana or lsd THIS IS NOT FOR YOU. On the other hand if you are looking for a nice evening with some friends and lots of laughter and honest talk, Absinthe is your friend.",
  "Four thumbs up from us :)</p>"
 ],
 "year": "2002",
 "id": "16060",
 "views": "30574",
 "dose": [
  {
   "time": "0",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2002-07-16T07:00:00.000Z"
}
