{
 "title": "Smoking Shrooms? What Are You Thinking?",
 "author": "The Wood",
 "citation": " The Wood. \"Smoking Shrooms? What Are You Thinking?: experience with Mushrooms (Magic Mushrooms) (ID 16070)\". Erowid.org. Jul 27, 2005. erowid.org/exp/16070",
 "substance": "Mushrooms (Magic Mushrooms)",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "1.0 g",
  "smoked",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>Well, I ate about one eighth of mushrooms about 4:00 am one fine Saturday morning (the sunrise was awesome!). I had a very revolutionary and spiritual trip, etcthen went home. I then worked for nine hours. At about 11:30 pm Saturday night, I went over to see my two best friends. I told them I tripped that morning, and the things that happened during my trip. They were quite pissed that I did not bring any shrooms for them. I told them I had another bag but it only had a gram left in it. They asked me to smoke it, and of course I replied, 'you cant smoke mushrooms, heat destroys the psychoactive agent, blah blah.'</p><p>They replied that you indeed can smoke mushrooms, but the experience is very different. They told me it was comparable to tweaking for a short while, rather than tripping. I said that is a complete waste of the wonderful fungi, but they were pissed I had no shrooms for them, so I gave in.</p><p>We smoked one fat cap and several stems in a glass bowl. The shrooms were very difficult to light. The taste was wretched! I dont mind the taste of chewed mushrooms, but burnt was disgusting! I began to feel a strong energy surge (was good since I was awake for over 24 hours at this point). It was nothing comparable to tweaking from crystal meth, but it was a tweaked, speedy feeling nonetheless. I only wanted three or so hits, the taste was horrible and I had no desire for a speedy drug when I sure needed sleep! I received no mental trip sensation whatsoever, and no visuals of any sort. Just a strong, alert, awake feeling. My two friends proceeded to smoke the rest of the gram, which took them a minute or five. They had some very tweaked out looks on their faces. I laughed at a very close friend of mine, and he became extremely paranoid and told me not to look at him (paranoid tweakiness I guess). Well basically nothing interesting at all happened.</p><p>I would conclude that smoking mushrooms is a terrible waste of the wonderful fungi. EAT THEM!</p>",
 "year": "2002",
 "id": "16070",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-27T07:00:00.000Z",
 "views": "33763",
 "dose": {}
}
