{
 "title": "Tricked",
 "author": "freaked out",
 "citation": " freaked out. \"Tricked: experience with Salvia divinorum (ID 16071)\". Erowid.org. May 2, 2005. erowid.org/exp/16071",
 "substance": "Salvia divinorum",
 "bodyweight": "50 kg",
 "report": "<p>My partner came home with what looked like a bag of chopped parsley.  He said it makes you feel like you are tripping on acid.</p><p>He wanted me to be the guinea pig and go first, which I foolishly did. I told him its probably bullshit and does nothing.  I packed a full cone stuffing in as much as possible. As I pulled the cone I thought how strange it was that it didnt taste like anything. I could feel the effect before I even blew the smoke out. I put my hands under my jumper and it looked like my arms were stretching for miles.  The room got very bright and I felt like I was in another world. I have done lots of different drugs but this made me feel terrified. I felt trapped in another world and that I would never be able to communicate with anyone again. I looked at the TV and the news was on but the news reader was only talking to me. My partner told me latter that I kept saying why is that man talking to me.  I totally believed he was speaking to me. I remember thinking that I dont like this trip and I want it to stop. I then started begging my partner to help me.  Over and over I kept saying help me help me and all I could see was my partner looming over me laughing. I started to feel really desperate to get out of this trip so I was trying to slap my partners face to make him realize I needed help. I came back to my senses and he was holding my arms so I couldnt hit him anymore and asking me what happened.</p><p>All I could say for the next hour was 'you're fucked' to my partner. My head still felt really weird for a while and I couldnt believe how betrayed I felt towards my partner. I kept saying how could you do that to me. But he had never seen its effects either so he had no idea how strong it is. I can honestly say I have never felt so scared on a drug in my life. I felt really detatched from the world and thought I was going to be trapped in this drug hell forever.</p><p>To sum it up it was the worst drug experience ever and I will never touch that stuff again. It was not a fun trip it brought out all my worst fears and then some more I didnt know I had.</p>",
 "year": "2002",
 "id": "16071",
 "gender": "Female",
 "timestamp": "2005-05-02T07:00:00.000Z",
 "views": "13264",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ]
}
