{
 "id": 1607,
 "title": "Walking in Circles",
 "date": {
  "submission": "2007-04-16T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Crooked arrow",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "ground/crushed"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "glasses",
    "quantity": "4"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "mg",
    "quantity": "90"
   },
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "One night, while all alone in my house, I decided, 'Hey, why don't I do something OTHER than just get fucked up silly?'  Well, my friend (a very nice friend) had given me to 60mg pills of prescription morphine.  So, I crushed up the pills, and they made a nice powder, similar to Ritalin or Percoset.  I proceeded to divide the pile into four individual piles, 30mg each.  To be safe, I blew one pile and waited about a half an hour, drinking a couple beers to pass the time.  I only felt the buzz from the beer, so I decided to blow the whole damn thing.",
  "After about ten minutes, I was pretty fucked up.  I was just wobbling around my house, for really no reason at all, just walking.  While this was going on however, I was experiencing the happiest drunkeness ever.  I didn't even care that I was walking in circles.  Eventually, everything really kicked in, and I was sent crashing down to the ground in front of my TV.",
  "When I woke up, about an hour later, I FELT LIKE SHIT.  I had that feeling where throwing up was inevitable, I just don't know when.  So after about an hour, I coughed up a lovely pink shaded pile of bile (pink from the morphine pills, I assume).  After that, though, I really felt fine.  My pupils were TINY, similar to the effects of codeine, but without the splitting headache.  All in all, it was worth it.  Just don't blow 120mg in an hour is my only suggestion."
 ],
 "erowid": {
  "id": "15061",
  "citation": " Crooked arrow. \"Walking in Circles: experience with Morphine & Alcohol (ID 15061)\". Erowid.org. Apr 16, 2007. erowid.org/exp/15061",
  "substance": "Morphine & Alcohol",
  "views": "15402"
 }
}
