{
 "title": "It's Not Me. It's the World.",
 "author": "eliav",
 "citation": " eliav. \"It's Not Me. It's the World.: experience with Mushrooms - P. cubensis & Cannabis (ID 16076)\". Erowid.org. Apr 21, 2005. erowid.org/exp/16076",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "78 kg",
 "report": "<p>In the parking lot of ben gurion airport in israel we unpacked ourselves and our luggage from shay's car, and realized that all the ganja we have smoked so far was almost faded away. It was early morning, our flight to amsterdam was leaving in about two hours, and we have been 'preparing ourselves', mentally speaking, for the flight all night. Without questions asked we pulled out the small but more-than-enough-to-terminate-large-mammals amount of homemade hash shay had stirred up, and puffed away.</p><p>There were four of us: my friends - shay, dan, nimrod and me. All hyper stoned and overwhelmed we made the necessary arrangements and got on the plane that that took us far, far away from the burning middle east to the busom of the liberal world, the land where the water's flowing, the people are smiling and the grass is free.</p><p>The first two days went by in an unbeliveable haze of colourful disorientation, cosmic, mind shattering highs and a vast spectrum - like array of sensations both visual and mental, superficial and profound, real, unreal and beyond real.</p><p>We have been smoking fiendishly & maliciously strong breeds of the fabulous herb from the moment we've opened our eyes (before even brushing our teeth) untill we were forced to cease for our mortal bodies have reached certain boundaries and limitations that forced them to terminate all physical activity. On the morning of the second day, while sitting on our packs outside the hostel we had just left, a few characters materialized out of the confusing morning reality and approached us, smiling, like nothing seemed particularly extraordinary to them at the moment. They appeared to be a group of young pleasent-looking americans, and, as we gazed, trying to figure out what, why and where the fuck, offered us a few small bags of pot and four or five doses of dried shrooms. I, in my drug-enhanced stupidity, was certain that they are trying to sell us the goods, and refused. The nice, virtuous children of uncle sam understood our situation, and made clear that they are not asking for return, they are on their way home and have nothing to do with the drugs on the way, except for being arrested.</p><p>I accepted their generous offering quite silently, withholding an impulse to offer a lifetime matrimonial commitment to the girl handing me the psychoactive substances. I was thrilled. The day went by in the same manner of intensified, blissful awareness to things outside the normal preception of what's true. We found another place to crash in, bought several different kinds of pot and hash and experimented combinations along the way. All was well.</p><p>In this close group of stoner friends I am considered to be the extremist. The one that will jump right in the pool just to see how freezing the water are. Thus, I was the most eager of all to try shrooms, and was excited by that long before we went on the trip to holland. My friends, knowing me well, decided to let me try first the shrooms, wait and see if I'm alive and well, and only then try it themselves. So it came to be, that tuesday afternoon, after a day of relentless smoking and aimlessly strolling around in the insanely beautiful vondelpark, we sat down on the lawn near the water, and I got down to business.</p><p>The shrooms tasted ok. I ate something like 75% of the bag, thinking that if I'll find the sensation positive, I'll eat the rest, and if not - at least I haven't eaten the whole dose. We just sat there exploring the wildlife of the park which consisted of several species of ducks, some with cute chics, cute human chics (we don't have so many blond, tall and positive-looking females back home), smoked and enjoyed all that was happening (or not really happening) around us.</p><p>Something like 45 minutes later, I started feeling a little different. Something just wasn't as always, it was very mild and subtle, I couldn't actually put my finger on what it really was. I looked down to my feet. There was a small green plant there, just a weed in the grass, but seeing it was somewhat very odd to me. I realized that everything I see gives me some kind of sensation I can't comprehend. I lay down on my back and looked at the trees above me. Their multiple, complex branches started combining strange shapes and forms. Strange currents seemed to run chaoticly in the treetops. I sat and looked around. The feeling that hit me was sudden, but the time my mind took to realize the nature of the experience kind of softened the blow.</p><p>The enormous trees around me glew in an utterly bizzare way. A shade of green that I have never seen, colours that were much, much more than just appearance - they were also feelings, charges, voices, thousands of different things altogeather and at the same time, most of them I could hardly even grasp, let alone express in words. I then realized that I was having the first trip in my life. I was seeing the world with eyes so different from my own, a form of vision and sense that not only was new to me, but I haven't - not in my wildest dreams - even thought it up.</p><p>I fell into a completely euphoric state. I felt like being in a vast primordial wild forest. The trees were talking to me in ways I couldn't even begin to comprehend. The grass beneath my feet was toiling like millions of green worms, that also started talking - no - transferring certain information of wild, bizzare nature in some mysterious way. By that time we got up and started walking around in the park. In some point we found a tree leaning to the water, stretching above the canal, sending it's tentacle-like branches into the water. We climbed it and sat down. Looking down between the branches to the water, I felt a very odd urge to throw up. I have to, I told myself, this is the place you have to throw up in. This was accompanied by a weird gagging sensation that didn't come from any source of physical stimulation. I looked up and shook my head. It was gone.</p><p>By the time we left the tree and started walking again I was feeling dazzled. I completely lost any feeling of space and time. I bearly knew who I was, and I didn't really care. I also had no idea where am I, where am I comming from or going to, completely unaware of time. I didn't care for all that. It had no significance to me in the state I was in. The thoughts running through my head were, for the lack of other words, completely insane. For a minute I was sure that I had many many fingers and that they were flying from my palms. Nimrod's long black hair appeared purple, and was also talking in a certain way. Nimrod himself looked somwhat like a goose. I couldn't stop smiling although a was beginning to feel afraid. I felt out of my mind. I felt lost.</p><p>We went out of the park and sat in a coffeshop. I was completely not there. It still is very hard to me to recollect neither what happened, nor what was happening to me in that stage. My friends were asking me all the time how am I, how is the trip, what's happening and stuff - but I couldn't bring myself to answer them. I couldn't even pronounce a single thought. We wandered around a bit and waited for a trolley back to the hotel. As for me, I didn't have a single clue about what's going on. The sky made faces at me, my friend's stoney, silly conversations blew me off track and I had to grip myself every now and then and remind myself that I am a human being, I am walking in a city, and there are people all around me. We saw a very, very bizzare gargoyle on the roof of some building - nimrod stated that it was an interstellar chic, and only hearing that sent me to a world of unearthy paradoxal descriptions.</p><p>I was literally going crazy. The feeling I had before, of all nature pulsing with life together with me was gone and made way for a feeling of being completely out of my mind. I wasn't able to focus on anything or any thought. Zillions of sensations, feelings and things for which there are no words flew simultaniously inside my mind. I was afraid. Afraid of losing all sanity, afraid of this state of true mental shifting to a universe of pulsating, cascading craziness that threatend to take me away. Far away. Maybe forever. I wasn't myself anymore.</p><p>Soon enough, using my powerful mental resources and might, I understood how to take this trip. I realized I was pondering deranged, complete insanities that appeared to come from nowhere instead of looking around with my new found eyes. I came to grasp. I began feeling very powerful, like riding some kind of force comming from within. The realization came to me. It wasn't me that was freaking out. It was the world.</p><p>On the way to the hotel I ate what I had left for later. We got up to our insanely decorated and structured room (the whole building was designed by a maniac, I tell you) and I sat on the window ledge, looking out at the street. Suddenly, a row of windows on the building next to me moved very fast back and forth. A cloud smiled. There were some writings on a stone board on that building (really). The letters started floating, circling each other. I felt like I'm on fire. You stupid, irresponsible little stoner, a voice in my head said. How much drugs have you stuffed in your system?? Look what's happening to you! I paid no attention to that. Instead, I rolled down to the bed and told nimrod I'm completely in a strong trip. He appeared to be swelled, somehow strange and extremely large. I sat up, and started taking off my shoes and socks. Suddenly, my whole vision narrowed down to a rectangle that appeared like a movie screen. I lost any sense of my body. I noticed that I can still control what was happening on the 'movie screen', and went on undressing. I saw my hands taking off my shoes and socks, reaching to the money-sock (much safer than a belt!) That stretched away from my foot with weird rubber-like movement. As I held the money-sock and looked at it, it began to move in my hands like an amoeba. It was insanely beautiful.</p><p>My friends decided that now's the right time to eat their shrooms. Soon enough, nimrod was starting to get weird and hyper, and dan seemed unrestful. A little later he started stating how afraid he was, and that he is getting the trip really bad. He wanted to throw up the shrooms, but we stopped him and calmed him down a bit. I decided to go out for some sweets, because I had read sugar is supposed to relax the trip and hold it a little.</p><p>It was already pretty late, like 23 pm or something. I wondered around the central station region looking for something sweet to buy, endlessly having to remind myself where am I, what's going on, what am I looking for and where I should look for it. Drug dealers offered me anything on the market and more. People were spiraling quickly and fading away, returning, saying inane bullshit and making unreasonable faces. I didn't know what was real and what wasn't. Walking about, I felt like a tiger in a dark, mesmerizing, urban jungle. The feeling was very funky. I began to understand much about life, myself and others. Conclusions overwhelmed me - I am not living free enough. I am not concentrating enough on here and now, on seeing things the way I wanted and not the way society dictated. A certain feeling of low self confidence I always had (which decreased greatly in the past few years) seemed rediculous to me. You are what you think you are. You'll see whatever you want to see and be whatever you want to be. It's all in the mind, and one little switch of perception is all you need to make the world look completely different. To make it look any way you like.</p><p>The euphoric feeling was back. I felt capable of everything, strong and undefeated. With a huge, stupid grin on my face I went into mcdonalds and bought some milkshakes (sugar, you remember). When I got back to the hotel, I saw that dan was much encouraged and enjoying his trip. Everyone was there, slammed senselessly on their beds, laughing, talking bullshit and amazed at the changes the psilocybe world had to show them. Through the night we talked, laughed, described hallucinations (the walls were moving like water, frectals appeared everywhere, mirrors and lamps floated, the whole universe seemed insanely crooked), writing down ideas and philosophies.</p><p>Since then, the high I get from grass is different. My imagination had obtained imagery that I haven't known before. I feel, as a person, much more confident and potent because of all what I learned of myself and my surroundings. Yet, a certain fear of the dark I had as a young boy came back in a much milder way.</p><p>I am yet to try stronger substances like lsd and such, but I don't worry. All will come in good time. :)</p><p>Have fun, be happy, enjoy your life and explore your mind!</p>",
 "year": "2002",
 "id": "16076",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-04-21T07:00:00.000Z",
 "views": "3841",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
