{
 "id": 16082,
 "title": "Dazed and Sleepy",
 "date": {
  "submission": "2009-10-26T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Impreza22B",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Pharms - Trazodone",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "A friend and I decided to try Trazodone-something we had never tried before and were skeptical concerning its effects-with Hydrocodone-something that I had gotten very familiar with during the week before, and our experiment turned out to be a good one. Trazodone is a sleep aid, and it is a good sleeping aid at that. That, mixed with Hydrocodone, made for a sleepy, pleasant high.",
  "At around 10pm my friend and I took one Hydrocodone (5mg of Hydrocodone, 500mg of Acedometephon or however you spell it) and two Trazodones. The effects of both pills began to kick in about 30 minutes after injestion. The beginning effects were small but noticeable. My friend probably got a more intense high from the Hydros because he had tried them once before and I had taken at least 2 every day that previous week. Then by 11pm we were both dazed and tired-dazed or high by the Hydros, tired from the Trazodones. We continued to become more tired as time went by. At 12am we decided to try some good inhalents, but fortunately we both passed out before we could get up. I attempted to get up several times but just didn't feel like it, so I just passed out.",
  "Both of us went into a very deep sleep, and we had very vivid dreams. We could remember many of our dreams the next morning, but even though the memory of them soon faded away we were still fully aware that we had very intense and vivid dreams. When I wook up my eyes were bloodshot and very glazed, which are huge signs of deep sleep. I had read experiences with Trazodone on the internet. The only side-effects of the pills were that it was hard getting up from such a deep sleep (if you can call that a side-effect).",
  "Overall, our first experience with Trazodone mixed with Hydrocodone (one of the best pills for recreational use in my opinion) turned out to be a very rewarding one. The Trazodones did what they were suppost to do- made us VERY sleep and gave us a great night of sleep- and the Hydrocodone made it better. I would have to try Trazodone more- which I will do- before I recommend it, but I would give it a big thumbs-up. And by the way, taking something like Hydrocodone, Oxycodone, Xanax, or Percicets makes it MUCH better too."
 ],
 "erowid": {
  "id": "43062",
  "citation": " Impreza22B. \"Dazed and Sleepy: experience with Trazodone & Hydrocodone with Acetaminophen (ID 43062)\". Erowid.org. Oct 26, 2009. erowid.org/exp/43062",
  "substance": "Trazodone & Hydrocodone with Acetaminophen",
  "views": "24213"
 }
}
