{
 "id": 16093,
 "title": "My Language",
 "date": {
  "submission": "2000-07-20T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Vera Lynne",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter / tab"
  }
 ],
 "report": [
  "It was April 1997 and I was packing for a school band trip to Tennessee. We would be gone for 5 days, so I wanted to be certain I had packed everything necessary. As I was in the middle of this, the phone rang. It was one of my friends telling me she had found some good acid for me. As my parents were at home, she couldn't bring it to the house, and I was leaving in the morning at 6:30, so I told her I would put the 15 dollars in an envelope and throw it out into my front yard, I even put in a couple of quarters in order to make the envelope heavier, in order for it to fall where I wanted it...So, I opened my second-story window and threw it down. My friend came by, picked up the money and taped the cellophane which enclosed the dipped paper into the inside of my mailbox. Upon rising in the early morning hours, I took my suitcases down to the driveway before my parents could follow me and quickly extracted the package from its hiding place. I had 3 hits in my possession now. I was so anxious. When would I take them? On the road trip? When I got back? On top of all this, it would be my first trip! What amazing experiences I was expecting! I accidently lost one of the squares of paper, though, when I was cutting along the penciled lines which separated each hit...it somehow fell behind my dresser, but I had to leave, so I departed with my two hits.",
  "I got on the bus for the long ride at about 7:00 that morning. It was extremely boring. I attempted to listen to some music on my headphones and do some schoolwork, but nothing of interest came to me. Then, I remembered that I had the acid. Wow, I thought, that's something to do. (something extraordinarily stupid, but i didn't realize it at the time.) So, not actually realizing how incapacitated I was about to become, I placed one of the squares onto my tongue. By this time, it was about 9:00. Although I was aware of the effects of LSD, anyone who has ever tried it knows that there is no way to tell someone inexperienced exactly what to expect. I waited for about 30 minutes, and, not feeling anything yet, decided to take the other hit. By 10 AM, I was hit with the most utterly fantastic experience that I could never even imagine. Each of my friends was being seen for the very first time. My friend in the seat in front of me turned around and placed her over-sized headphones on my ears for a minute. I explored every note touched in the song. I swam around on the sound waves. The music flowed straight through my mind. I was completely overwhelmed.",
  "Since all of my frineds on the trip were completely anti-illegal anything, I was the only one who was aware of my situation. One friend inquired as to the strange state which my eyes were in, but i just said i didn't know, and continued to awake for what seemed like the first time ever. Every voice on the bus surrounded my mind. One would call out my name in slow motion while the other would echo an infinite number of times. I almost couldn't bear the liveliness around me. I felt as if I was essentially progressing forward, but at the same time, one stream of my consciousness was jetting into the future, while another was lurching behind in the past. everytime someone said something I felt as if I knew what they were going to say before they did, but at the same time I was hearing it for the first time when it left their lips, but then I felt as if I was hearing it just after they  said it. I was enveloped in a battle between the past, present and future. I felt like spinning.",
  "Once we arrived at our mid-point hotel, I was in the midst of the most glorious trip. I had also become obsessed with the foreign nature of my toes and the skin that covered them. I could not stop examining them in my clear plastic sandals. Later, after the most intense bites of salad and sips of coke at dinner, I acquired the most wonderful feeling. I, in about 10 seconds, figured out everything. I discovered the language that human should be speaking. It was the most perfect laguage. It was so perfect though, and it was all jetting through my bring so incredibly quickly, that I could not relay it to a single soul. My thoughts were not compatible with any known words. In this time, I had discovered how to obtain perfection in the world. I found the beauty in every single image that flashed through my mind. I realized the perfection in all life, which is normally viewed as just the opposite. I was so sure that I would be able to tell people of the most wonderful language when I came down. Finally, 15 hours after I dropped the hits (yes, I said 15), I started to come down. I was able to force myself to sleep and try to remember everything I had learned that day.",
  "Unfortunately, of course, when I woke up, the language and the perfection were gone. Every thought and insight that had seemed so intricate in the weaving of my existence had been pushed behind my consciousness. I could not retrieve it. Yet, from that day on, I have continued to find beauty in unexpected places, and people. That day is still regarded as home to one of the most significant experiences of my life. Hopefully, it will never all fade away, and I will be able to look back and remember something about that utter perfection that I saw for that short time, and the most beautiful sounds from the perfect language that ran through my head. I will always have a desire to go back to that point, and I wish that everyone could have experienced that with me. It was truly amazing, and I believe I will cherish it for the rest of my life."
 ],
 "erowid": {
  "id": "431",
  "citation": " Vera Lynne. \"My Language: experience with LSD (ID 431)\". Erowid.org. Jul 20, 2000. erowid.org/exp/431",
  "substance": "LSD",
  "views": "8749"
 }
}
