{
 "title": "Confessing Embarassing Stuff",
 "author": "Alpheus",
 "citation": " Alpheus. \"Confessing Embarassing Stuff: experience with Alcohol (Beer) (ID 16104)\". Erowid.org. Dec 5, 2007. erowid.org/exp/16104",
 "substance": "Alcohol (Beer)",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "6 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>The first time and only time I got drunk was a nightmare for me. My friend and I are both 15.  I told my older brother that we were going camping in Grandpa's woods and wondered if he could get us some beer, so my faithful brother came home with a 12 pack of Budweiser for us.  My friend, whom I'll call 'Adam', and I went back to the woods, started a fire and relaxed.  I got the beers from a secret hiding spot in the woods and we began to drink.  The beers were a little warm, and Budweiser tastes really gross anyway, so it was a little hard to drink.  We had a few laughs and chugged a few. </p><p>Eventually I had finished my sixth and I started running around the woods, running into trees and doing stupid shit like that.  It was fun 'cause it really didn't hurt so much and I had a hard time walking.  I ended up breaking one of my grandpa's chairs and my gym bag got burned in the fire.  About ten minutes later Adam and I were wasted.  We tried walking around but he kept falling down and he puked.  I laughed because I saw onions in his puke.  Things got really horrible from here on.  I'm usually spooked at night in the woods, but with the alcohol I really didn't care.  We stumbled through the woods.  Adam kept falling down.  He seemed like he was passed out, so I talked like crazy.  I kept saying how I couldn't believe the chair was broken.  The whole thing seemed like a dream.  I began talking about my secrets and stuff I really shouldn't talk about.  I told Adam about how I had felt gay before.  These are feelings that I would rather forget about and move past.  We joke around a lot about being gay, but I was really telling him.  It was really fucking scary, but I started to get attracted to Adam.  In the sober world I find him not attractive at all, but I kept asking him if he would kiss me, and he said he would. </p><p>Luckily I could control my retardation and stop myself from doing something stupid.  When he got up I did kiss his shoulder, though.  We did other really gay stuff, like I rubbed his chest and layed on top of him when he fell down.  This stuff was really embarrasing and I'd rather just forget about it.  We walked into the creek, walked back on a path and somehow got back to the camp area.  I have no idea how we managed to get back to the campsite from the creek.  When we returned I felt really sick to the stomach.  I have a strong stomach and I didn't puke, but I felt horribly nauseous and my head was spinning.  I began to pray to God to help me get over this.  I had said and done so much stupid stuff, I was ashamed.  I began to question my life, and I felt like I was a horrible person.  I told Adam about all the bad things I'd done.  I felt like I let my mom, dad, brothers, and friends down.  I hated myself and I hated this situation.  I hated absolutely everything about being drunk.  Sure it was fun the first 10 minutes, and it was fun being numb.  But I felt so sick to my stomach and I hated how I blurted out all those things to Adam when he seemed to be passed out, but he remembered most all of what I said.  He kept telling me that I kissed his shoulder the next day.  I felt like I wasn't worthy of God's love and I missed my mom and dad. </p><p>I went to sleep for maybe an hour, woke up, and told Adam more embarrasing stuff about myself.  I even asked him if he thought I'd go to hell if I died.  I slept for maybe two more hours and awoke feeling fine, no headaches at all.  But I did still feel a little sick to my stomach the rest of the day.</p><p>I totally don't understand why people are into drinking.  Even without a hangover or vomiting, my experience was not fun at all.  There are too many side effects, and it's only pleasant for about 10 minutes.  I think alcohol is not worth it at all because:</p><p>1. It tastes like shit.</p><p>2. It makes me say stupid shit.</p><p>3. It makes me do stupid shit.</p><p>4. It makes me feel like shit.</p><p>Maybe if we had something that tasted good and was cold, like hard lemonade or wine coolers it would've been more pleasant.  But I still vow never ever to get drunk again.</p>",
 "year": "2002",
 "id": "16104",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-05T08:00:00.000Z",
 "views": "3630",
 "dose": {}
}
