{
 "id": 16106,
 "title": "Unlocking Chi",
 "date": {
  "submission": "2007-08-22T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Kung Fu Student",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "<p>I first tried Salvia at a Wiccan Beltane festival, everyone there seemed to know I was on it and know alot about the substance. Since then I've been using the herb on a basis of about twice a month; sometimes the effects are overwhelming, and sometimes I am only left with a feeling of my surroundings being different. My Uncle However has a total mental breakdown in my front yard on Salvia, He claimed 'It felt like thousands of spikes stabbing into my head at once.'",
  "I've been studying Tai Chi/Kung Fu for about 2 years now and since the first few months I've really been into the Inner aspects of the arts. I don't claim to have any sort of super powers or anything you see in anime or in movies; however I've gotten fairly good at the Shaolin practice of Iron Fist consisting which is basicly coordinating your concentration with your breathing and body, and creating energy that the chinese call Chi between your hands, causing them to strongly repel each other. The object is to make this repel as strong as possible by concentrating and pushing inwards with your hands until you cannot go any further. Planning my next Salvia experience the idea came on me to see what would happen if I practiced Iron Palm on it.",
  "Starting by practicing some breathing techniques and meditating to prepare my mind for the intense 'Coming up' stage of Salvia which is sometimes intense enough to make me regret smoking it at all. So I turned on some Tai Chi music and began meditating, after about 20 minutes I load up my metal pipe and begin to take 2 long drags out of the bowl; Quickly reloading before the drug takes over I smoke one more bowl and then place my pipe down next to my bed. Sitting with my legs crossed I try to focus and slow my breathing as I stretch my arms out in a circular motion, inhaling deeply and slowly letting it out as my arms come within a foot of each other.",
  "I can feel the Saliva effecting my mind as I begin to notice the energy between my hands growing, from time to time relaxing my arms to watch my hand move away from each other without moving them at all, and then pushing back in to feel the energy growing stronger. I close my eyes and focus on the closed eye visual of a blueish aura between where my hands are, the harder I focus the stonger and more defined this gets.",
  "After about 10 minutes of this I feel myself begining to come down. The Comedown period of Salvia is great compared to other drugs I always have a refreshed relaxed feeling of coming back to a familiar reality; and as I gradually come down I stretch my arms which are worn out from the Iron Palm exercise.</p>"
 ],
 "erowid": {
  "id": "43160",
  "citation": " Kung Fu Student. \"Unlocking Chi: experience with Salvia divinorum (10x extract) & Bodywork (Tai Chi) (ID 43160)\". Erowid.org. Aug 22, 2007. erowid.org/exp/43160",
  "substance": "Salvia divinorum (10x extract) & Bodywork (Tai Chi)",
  "views": "5546"
 }
}
