{
 "title": "Time of My Life",
 "author": "Peachy",
 "citation": " Peachy. \"Time of My Life: experience with Ecstasy (ID 1611)\". Erowid.org. Oct 23, 2000. erowid.org/exp/1611",
 "substance": "Ecstasy",
 "bodyweight": "",
 "report": "<p>My first time 'rolling' was about one month ago on my Junior prom.  All week I had been anticipating the experience cuz I had heard how great it was.  I wasnt really looking forward to prom because Im not a formal dance kind of person.  But the theme of our Prom (time of my life) actually stands true. Only by actually experiencing the drug could you realize the effects on you, and the world you are brought into.</p><p>About a half an hour or so before the dance is when I popped my pill.  Two of my friends also took it but they had done it before.  It took about ahalf hour to kick in.</p><p>When we arrived at the dance, I had just started to roll.  The music took a hold of me, and I couldnt stop moving.  I knew I probably looked dumb, or weird, but that did not even bother me.  My vision was all distorted in that the lights seemed extremely dim.  As I danced, I could feel the music flow right through me.  With every touch from my surroundings , shivers ran through my whole body.  All I have to say is that I recommend Ice; have someone rub it on your back & it feels so good.  It also feels good when someone makes an 8 shape with their fingers on you temples, or stokes your hands or back.  Anyways..I felt totally exhausted, and my heart was racing like crazy, but I couldn't stop dancing.  I was so hyper and I felt invincible.  I felt at peace with everyone around me, even those I didnt care for.  I went around hugging everyone telling them how much I loved them, and how beautiful they looked.  It seemed like nothing could go wrong, and I felt so beautiful.  The world was a sort of utopia in which i couldn't escape.  Of course I didnt want to escape the feeling.  As I danced for 3 hours with out stopping, I still felt the effects.  I couldn't stop smiling, and my eyes were twitching involuntarily.  My jaw was clenching and I also was biting my lip.  But this wasn't my biggest concern.  The dance was over and I didnt want to leave. </p><p>As we left the dance, and got into the car, I fell into this world which I can't even explain.  I lay across my dates lap in the back seat as he massaged my back.  We were listening to the most trippy music (Tool live), and it made me feel as if I was at the concert, on stage with the band.  I was totally tuned into the music.  It was weird because I became totally unfamiliar with my surroundings and I wasnt aware of where I was for brief periods of time.  I was stuck for a while too, not being able to move, even though my brain was telling me to move.  I watched the street lights as we drove down the streets, and they somewhat resembled tiny shooting stars.  My hands were clenched in an odd way that I couldn't stop.  When my date did so much as run his fingers across my back, my breathing became heavy as if I was going to orgasm or something.  I ran my fingers along the ceiling of the car and the fabric made my fingers tingle.  The cold leather also felt good on my legs.  I ran my fingers through my friend's hair, and despite my date's jeers, I wouldn't stop.  It felt so neat.  After we ate, we went and chilled at our friends house.  Thats when I came down.  I was still clenching my jaw, but unlike an hour before, I was in a total chill mode.  I felt so sleepy, yet I didnt want to fall asleep.  It was so weird.  So me and my date chilled on the back proch and watched the stars.</p><p>The next morning I woke up and I was exhausted.  I felt extremely depressed, but that faded after about six or so hours of being awake.  I must say that since that day I've wanted to do it.  Im not saying it is addictive but you definitely want to do it again after you do it.  This drug brought me much closer to those I shared my night with, Especially my friend L and my date who is now my boyfriend.     </p><p>There are so many more feelings that I felt that night but I cant even begin to put them into words.  I guess you have to personally try X to understand the unexplainable feelings.  That night, I had the 'Time of My Life'.</p>",
 "year": "2000",
 "id": "1611",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2000-10-23T07:00:00.000Z",
 "views": "9292",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
