{
 "id": 16115,
 "title": "23 Years With The Glue Gods",
 "date": {
  "submission": "2005-07-17T07:00:00.000Z"
 },
 "author": {
  "name": "Seb",
  "gender": "Male",
  "weight": 90
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "My first experience with inhalants was when I was 11. I'm from a loving 2-parent family and didn't have any reason to escape. There was however lot of publicity at the time about inhalant abuse that simulated my interest and lead to my experimentation.",
  "My first experience saw my body turn in to a blow-up castle or dome that 2 visiting spirits young were able to play and bounce around inside of. As an 11 yr old it was an empowering and special feeling to be interacting with these unseen entities and I also felt good to be able to provide enjoyment to these beings. When I asked who they were I saw an eye and then the eyelid shut as if the spirit was shy and didn't want to reveal its true self.",
  "Another early experience I had was where a poster on my wall seemed to morph into a mountain. Then from out of the mountain came hot rocks that seemed to flow out of the picture and into my body. A bizarre experience never the less very interesting.",
  "I should mention I was not religiously inclined having never attended a church or even really believed in any religion.",
  "Experiences through my teenage years were varied however all seemed to have a companion(s) present.  Some of the best experiences Ive had were flying were through out of body experiences. Id fly through space reaching the speed of light and also travell inside my own body through my blood vessels. I've experienced flying with cherubs, becoming an asteroid in space as well as floating around my bedroom in my bubble. Ive spent an afternoon with a Buddhist monk from Tibet seeing a power centre or charka through to sitting on canopy of a rainforest in the middle of South America. Ive ridden on the back of a giant bumblebee through purple crystal caves and seen a minotaur making love to with a beautiful young girl. These experiences although every hard to truly explain where not so much like watching a movie but rather being part of the movie. I dont make this up rather share the weird and wonderful experiences Ive had in my 23 yrs experience with my personal drug of choice.",
  "I would also experience glimpses of the future and insights into both the physical and spiritual worlds. I'd see events that would come true and be shown things about other people that also turned out to be true (and often their darkest secrets). For example I've riden on the tail of aircraft and experienced the plane crashing only to wake up in the morning to read in the news of an actual plane crash during the night. I'd experience wars in other countries and more recently I experienced the tsunami disaster in Asia through the eyes and shoking experience of one of its victims.",
  "While at uni I sniffed glue before a multi-choice exam and walked into the exam pretty out of it (and probably smelling like a glue factory). I was however 'given' the answers to the exam by one of my spirit minders. Although I didnt get 100% I scored 92% - higher than my usual 50-60%. It was because of these experiences and 'powers' I've continued to dabble with inhalants through to the present time.",
  "I'm now 34 and married in a good job earning a just under $100K. Im mostly able to keep my sniffing hidden from my wife by only inhaling a small amount at a time and talking plenty of breath fresheners. I find if a sniff large amounts my spiritual tv becomes blurred and Im often unable to remember my experiences. Although the glue has had a definite effect on my brain, it doesn't seem to have impacted my life as greatly as one would think. Perhaps the biggest effect is the occasional hurt and frustration of those who close to me when I get caught. I will go through months where I won't sniff that I think allows my brain to almost completely recover. The Glue Gods have indicated I may struggle in my older years due to lost brain function.",
  "I once tried to quit and went and saw a shrink. All my experiences were explained through the chemical effects of inhalants on the brain and resulting hallucinations - however I am sure this is not the case.  The Delphi oracle would inhale sulphurous fumes and impart his/her wisdom in ancient days. I would never claim to have the power of an oracle however I have gained an appreciation of how this was possible.",
  "I feel inhalants open a door (as do other drugs) through to an unseen world. I should say however those who come through the door from this hidden world (although playful) are generally not what I'd call good spirits.",
  "If you do sniff or huff I recommend doing it out of a cup. Youre able to control the fumes a lot better than a bag or a rag and you minimise the danger of suffocating on a bag. I do it some place quiet and never give anyone a fright who is sniffing.",
  "What I write are my true experiences. Thanks to all those who have shared similar stories."
 ],
 "erowid": {
  "id": "43186",
  "citation": " Seb. \"23 Years With The Glue Gods: experience with Glue (ID 43186)\". Erowid.org. Jul 17, 2005. erowid.org/exp/43186",
  "substance": "Glue",
  "views": "18353"
 }
}
