{
 "id": 1612,
 "title": "Inspiration",
 "date": {
  "submission": "2007-11-08T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Y- knot",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 5x"
  }
 ],
 "report": [
  "No 1. Leaf",
  "Recently tried smoking dried leaves in my favourite set and setting. I have a giant mexican hammock hung across my living room, surround music and dim lighting. The experience was much milder than the extract and did not lead to the overt 'otherworldliness' but lead to a very relaxed state with a few swirling visuals. I was holding my breath for what seemed like minutes at a time without entering the other realm and kept taking more hits and holding. I found I could hold my breath without any effort and I started to feel the withdrawl to the inner self, where I can look at my body as just flesh and bones, a vehicle for this other entity that is me.",
  "I did, at one point, become concerned that I holding my breath while in this state, thinking that the state had somehow enabled me to override the very important function of breathing. This theory soon passed as I realised that the brain would automatically shut down my conscious processes if I tried to starve it of oxygen; i.e. I would pass out and start breathing anyway. From this breath held position I calmly thought about the body and it's decaying/regenerating cycle and the end point. Feeling a separation from my normal biology, this concept was not distressing. In fact it was comforting and I felt honoured to inhabit an organism so exquisitly evolved. This concept of death confrontation is a very strong motive that re-appears when reading about psychoactives. It is certainly an element of our unconcious to avoid death and it may be supposed that the corresponding element of the ego would be fear. Facing this fear may therefore strip us of this part of ego's defence and lead to a powerful experience of the unconcious.",
  "In this relaxed and contemplative state I had forgotten about the music and I only came to realise it as I realised that my mood changed with the music. Difficult to describe - on listening closer the music and myself seemed almost inseperable. I remembered that on using the extract previously I had experienced the music as movement and pattern in the other landscape.",
  "No 2.  5x extract",
  "I used dimmed lighting and chilled-out music to help the experience. It's as if my brain stops recognising shapes and colours in the normal 3-D way and tries to make sense of it and gets it wrong. My head felt like it was being forced to turn in every direction at once before feeling like being sucked into another space. This gives way to a landscape made up of shadows and music, but a landscape that makes sense and no-sense at the same time. It is as if I am looking at a grand palace at night, with lights shooting across the land and through the sky (my stereo has some lights on it). A shadow figure moves quickly across the scene and back again.  This happens several times but I am unable to see it, I only feel it.  I feel I am an entity without ever having owned a body and move my legs without actually realising I own any. Everything feels like it has always been this way.",
  "The landscape moves (in reality my legs) and I feel what it is like to be the land and my breathing is the breathing of the land. Suddenly the landscape and my face split in half (I have no face but it is the nearest analogy) and I am distressed that my face is not together. Having felt this before, I relax. It is still unpleasant but bearable.",
  "My face continues to split time and time again like being sliced  very thinly!  This feeling subsides and I regain some power and recognition of movement. Reality and altered vision intermingle until I feel that I understand that sight is merely one tool we use to explore the world, one that we rely on heavily, and I feel I connect with an inner self simply using this body as an experience. It is like looking down a tunnel with the body anaesthetised. I am experiencing a deeper, more stable self. One that watches over my usual ego and has none (sorry  fewer) of my usual human prejudices.",
  "An inner message strikes me. It is late and I have a responsible job in the morning. I have no sensation, hear no sound, no smell.  My will is the only feeling, my body takes over and I am a mere spectator as I clear up without effort, not something I consciously willed, and take myself to bed, wondering how I'm doing any of this. My dreams and the salvia space merge almost seamlessly in bed and I am able to direct my thoughts. I think of the things that have inspired me. The one memory-image that came to my head was of the view from the top of a cliff overlooking the spectacular scenery at Petra, Jordan.  It was a place where I shared sage tea with a bedouin who lived there. The feelings (of awe) and images came flooding back. It was a magical feeling and I realised that the penniless man would still be there (or wherever he chose) while I was in a less-than-inspiring place."
 ],
 "erowid": {
  "id": "15090",
  "citation": " Y- knot. \"Inspiration: experience with Salvia divinorum (leaves & 5x extract) (ID 15090)\". Erowid.org. Nov 8, 2007. erowid.org/exp/15090",
  "substance": "Salvia divinorum (leaves & 5x extract)",
  "views": "2146"
 }
}
