{
 "id": 16126,
 "title": "Pleasant Smoke",
 "date": {
  "submission": "2006-12-05T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "SB",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 bowls",
   "administration": "smoked",
   "substance": "Wormwood",
   "form": "(extract - 6x)"
  }
 ],
 "report": [
  "In Eastern Canada, wormwood is extremely cheap (around a dollar an ounce), and even easier to get. Any good plant or health food store will have it.",
  "The other night I tried smoking some wormwood extract (6x) a friend of mine picked up on the internet. It was a fine dark beige/brownish powder. I tasted it, and it had no discernable flavour, but there was a mild bitter taste. Raw wormwood plant is by far the most bitter thing I've ever tasted in my life.",
  "Myself and two friends took turns smoking 4 full loaded bong bowls at my friends apartment. It was a beautiful night, so we sat on the deck and listened to the city around us. We used some 'Smokin' Joe's' erbal cigerette tobacco on the bottom of the bowl so the powder wouldn't be sucked through the screen.",
  "The powder torched and stayed like better than pot does usually. The initial hit of each bowl was a little hard on the throat, but was very easy to hold (like a light cigarette) and tasted pleasent on the exhale. Each hit got easier and easier to smoke. My throat was a little sore to begin with, so maybe I'm just being a baby.",
  "I felt the effects immediatly after my second hit. I'm not big on smoking pot, and therefore, any time I do I get pretty high, and can actually tell what it's doing to me, unlike where some potheads may be so used to it they don't notice.",
  "After the wormwood hit, I felt a buzz very similar to that of pot, except that it wasn't as hazy or 'dirty' as pot. Also, I felt energized, and found I was quite able to talk, and felt like going into long elaborate stories. I'm told that's a large part of the high from cocain: a heightened social attitude.",
  "After the last hit, The feeling was more or less the same. It seemed like you couldn't get higher. Perhaps a larger first hit is needed.",
  "I felt a slight buzzing in my body, and it was quite pleasent. I noticed a siginfigent positive lift in my attitude. It seemed like I was more easily able to go into detail about past events, and felt like gabbing.",
  "I did not have any visual effects, other than what someone has called the Dollhouse Effect, where when you look around a room for example, everything looks like it's where it belongs, and things are easier to single out, like in a carefully built doll house.",
  "I found that it made thinking about things easier, and brought nice thoughts to mind, but did not really give the typical psycadelic effect of wholistic or introspective thoughts.",
  "The feeling lasted for over 2/2.5 hours, when I went the one block  to my house and went to sleep, very quickly.",
  "I had no negative side effects at all. I woke up the next morning feeling clean and peacefull.",
  "Over all, it's a very light feeling drug, not a whole lot unlike THC. It's legal, it's cheap, easy to get, and is quite pleasent.",
  "I hope that research will be done on the substance, or that more information about it will become available."
 ],
 "erowid": {
  "id": "44059",
  "citation": " SB. \"Pleasant Smoke: experience with Wormwood (extract) (ID 44059)\". Erowid.org. Dec 5, 2006. erowid.org/exp/44059",
  "substance": "Wormwood (extract)",
  "views": "24936"
 }
}
