{
 "id": 16134,
 "title": "Detachment",
 "date": {
  "submission": "2007-10-05T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "George M. S.",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "I have been hearing a fair amount of what I initially regarded as pure hyperbole regarding Salvia divinorum for the past few years. After having read a few reports regarding the plant in the early 90s my grasp of the substance was certainly dated. Upon hearing first hand reports of intense experiences from an intelligent person who I felt inclined to trust, my interest was sparked. However, as a creature of habit I maintained my skepticism. I had good friends tell me ten or more years ago that you could get high from smoking cooked banana peels. Needless to say the banana peel trip report will never be written. This trusted individual gave me a bag containing about  oz dried S. divinorum leaf which to my knowledge was not fortified with extract.",
  "My first experience occurred early in the afternoon one Saturday after I had worked the night shift. I had been awake for approximately 26 hours when I decided to try smoking a bit of this substance. Initially the process of preparing to smoke this leaf created a great deal of nostalgia as its appearance reminded me of datura leaf, which I had experimented with in the summer of 1995. I opened the door for my beloved yellow lab Lily, who was wanting to go outside, and proceeded to load about a gram of leaf into a wooden tobacco pipe which I affectionately refer to as the 'Father Knows Best' pipe. I took a seat on my couch and smoked the first hit. I was surprised by the relatively smooth smoke produced by this dark leaf matter. The first hit was held for about 15 seconds. The second hit was as unremarkable as the first. Upon holding the third hit for what seemed like a very short time I became overwhelmed by intense pressure in my lungs.",
  "Involuntarily and abruptly I exhaled what seemed to be a tremendous amount of smoke. I quickly stashed the rather hot pipe and my dangerously hot lighter in a safe place. While I was able to accomplish this without much trouble I did notice a definite heavy sensation in my limbs. After placing the pipe on a near by table my arms immediately fell to my side, the heaviness spread throughout my body. The appearance of the room I was in looked to be somewhat stretched laterally. My visual acuity was slightly increased, however at the time I was uncertain if this was placebo resulting from my heightened attention seeking to ascertain any psychoactive properties of the plant, or if the phenomenon was something I could directly attribute to S. Divinorum.",
  "About this time Lily, having no thumbs, began barking at the back door requesting to be allowed in the house. Despite the pleasant heaviness I peeled myself off the couch to go open the door. Upon standing I noticed my balance was off but not so much to dissuade me from walking the seven yards to the door. While walking I began staggering from side to side as if I had drank way too much wine however my senses were not dulled as I would expect from an alcohol intoxication. As I walked a zigzag pattern to allow entry to an increasingly frustrated Lily I noticed a very remarkable sensation. Though the trajectory of my body was far from point A to B my consciousness seemingly floated with ease straight to the back door, my body was of no more consequence than my shadow, the chief difference being this shadow was made of flesh with a central nervous system able to send messages to my now detached consciousness regarding its current position.",
  "Lily walked in and went straight for the couch, I followed and sat down beside her, this displeased her so she relocated to the floor directly in front of me. I began watching her wondering what I might feel or experience with full view of an alien mammal before my eye. In short I felt nothing. The sensation of heaviness disappeared, my consciousness slipped back into and attached itself to my brain.",
  "Each subsequent experience with this plant has produced an increasingly more pronounced effect ranging from the altered perception of physical weight to iridescent visual hallucinations. It is my opinion that S. divinorums paradoxically subtle nature is what accounts for the reported reverse tolerance effect. I must first allow myself introductions into this state of awareness before the full effects can be noticed. I think an interplay between the plants inherent chemical properties and the intentions of the individual experimenter are about the only limitation to how far one can carry, or be carried by, S. divinorum. Granted this is my personal and highly subjective interpretation of the plants effects."
 ],
 "erowid": {
  "id": "44107",
  "citation": " George M. S.. \"Detachment: experience with Salvia divinorum (leaves) (ID 44107)\". Erowid.org. Oct 5, 2007. erowid.org/exp/44107",
  "substance": "Salvia divinorum (leaves)",
  "views": "2434"
 }
}
