{
 "id": 16139,
 "title": "Almost There",
 "date": {
  "submission": "2007-06-12T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Matti",
  "gender": "Male",
  "weight": "65 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 flower",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": " seeds",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>This was my first time using Datura. I think this was a rather threshold dose of Datura, since I was aware of the fact that I was tripping. This took place in June, 2005.",
  "For my trip I used one large yellow flower about 15cm long and a green seedpod. I boiled the materials for 2 minutes and then let it cool for two hours. I was left with a brown liquid, which resembled ordinary tea. I drank half of the cup and waited for half an hour. I started feeling funny and ingested the rest of the brew. I went to take a nap.",
  "I woke up about 21:00 and was feeling really drunk. I actually thought that it was already Friday night. The first thing I did was to check if my pupils were dilated, and they were. I could hardly walk. I decided to chat a bit on msn, but noticed that I could hardly type and I couldn't see anything that was on my computer screen. So I decided that it was a good idea to just lay down and watch TV. I don't remember exactly what I was watching, nor do I remember if the TV was on or not. Everything was quite blurry and looked like it was all liquid.",
  "According to my notes I also took a shower that evening, but I don't recall any of it. I remember that I had slight visuals and audio hallucinations. I remember eating some sandwiches and being unconsciously aware that someone else was sitting beside me, but as soon as I thought about it consciously that person would disappear.  Sometimes I tried to talk to these entities, but as soon as I opened my mouth they would disappear. Mostly I could only see these things on the corners of my sight and never directly in front of me. In fact as soon as I turned my head towards them they would disappear. So I was pretty sure I was tripping. ",
  "Another interesting thing was that everything around me had a yellow tint in color. As I walked in the bathroom, the whole bathroom was bright yellow. I must say however that when I looked in the mirror I was pretty sure that it was myself I was seeing and not someone else.",
  "I must also add that I was feeling as if I would vomit anytime and I was feeling more like I had a food poisoning. That part was very unpleasant. I also had a slight cottonmouth.",
  "Finally I went to bed and woke up this morning feeling rather normal. It was a rather interesting experience if I don't count the side effects.</p>"
 ],
 "erowid": {
  "id": "44128",
  "citation": " Matti. \"Almost There: experience with Datura  (ID 44128)\". Erowid.org. Jun 12, 2007. erowid.org/exp/44128",
  "substance": "Datura ",
  "views": "3591"
 }
}
