{
 "id": 16136,
 "title": "Switching Channels",
 "date": {
  "submission": "2007-02-09T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Vic",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "First, let me tell you some things about myself. I'm pretty lightweight, and most drugs that I do have a greater affect on me than on other people. For example, from 2 tabs of not fully saturated acid, I tripped out like no other, while my friends were only mildly tripping.",
  "When I went over to my friend's house, two of my friends had already taken 10 mg of 2-CE each, snorted, and they seemed pretty normal except that they were laughing a whole lot. I couldn't stay out that long because I had to go and talk to my parents later, but because my friends seemed fine, I decided to split the 20 mg capsule with my friend. It hit me almost immediatly when I snorted it, and the first ten minutes were not so pleasent. My body felt really tired and heavy and all I wanted to do was lie down. I also felt kind of nauseous and my breathing became heavier. My friend and I started to freak out just a little bit but were soon calmed down by my other friends who told us that this shitty feeling would go away after a little while. We started walking outside and I had to don a sweater even though it was about 75 degrees outside because I was insanley cold. When we got outside, my mood immediatly lifted and I stared at the trees and the grass, just admiring the nature. My friends and I started walking around our apartment complex, just talking and laughing.  At one point we realized that we were really loud but none of us cared. I noticed that I didn't really care about consequences at that point and I couldn't really make normal decisions. A car was pulling into the parking lot and we didn't know if we should get out of the way and wait for it to pass or cross infront of it, so we just kept going back and forth in front of the car for a minute until we finally got ourselves together and pulled each other away from the car. ",
  "We decided to sit down in the grass, and I was talking to my friend about some job but in the middle of her sentence, I lost track of what she was saying, and all of a sudden I erupted in laughter. It was the greatest feeling ever, the laughter just pealed out of me. Soon enough my friends joined in, and we laughed and laughed at nothing in particular. My state of mind kept switching from extremly energetic to mellow, to energetic again. I started thinking about acid, and all of a sudden I felt like I was in an acid state of mind.  My friend started describing to me what she was feeling and my mind immediatly switched to that mind set also. Whenever any of my friends described a sensation, the rest of us immediatly switched into that mind set also.  We were also extremly easily distracted. We started saying how we needed to get out of the area because we were being really loud, so we stood up and stood in a circle. It took us about an hour to move anywhere because we just kept talking. We noticed something and had to explain it to everyone else. During all this, we were laughing like mad, and generally having a really good time. I felt happy and light inside and super energetic at the time. My friend pointed at the pavement and we immedialy kneeled down. As soon as we stared at it, it began forming patterns and shapes, and we just sat there in a circle, tripping out on the pavement.",
  "We were able to snap in and out of it when we needed to. For example, my friend's mom came out to talk to us, and we immediatly were able to snap back in and talk to her like normal, albeight happier than usual.",
  "The funniest thing that happened was when we saw my other friend's mom. (We kept seeing parents everywhere).  She was standing behind a fence, signaling to us and for some reason we didn't recognize her. I stared at her for a full minute, thinking she was some hobo asking for money. It freaked us all out until one of my friends asked 'Is that your mom?' We all said that no, that couldnt be her mom...could it? My friend started laughing like crazy, ran up a little towards her mom and then ran back saying that she was scared. It took us a while to recognize her, and realize that she wasn't just some hobo.",
  "This was my first experience with 2-CE and I enjoyed it immensly. The whole day I was light and happy and laughing. I even had a nice sincere conversation with my mother, which is pretty rare because we usually don't get along. During the trip, and afterwards, I was completley unaware of my body, a sensation similiar to the one I experienced when I did acid. I didn't need to go to the bathroom, eat, or drink. In fact I couldnt eat that night at all. My body felt so light and purified that I couldnt put any food in it because it was too heavy.",
  "Later on, I did 2-CE again and experienced a bad trip, but that's another story."
 ],
 "erowid": {
  "id": "44115",
  "citation": " Vic. \"Switching Channels: experience with 2-CE (ID 44115)\". Erowid.org. Feb 9, 2007. erowid.org/exp/44115",
  "substance": "2-CE",
  "views": "5139"
 }
}
