{
 "title": "Spun",
 "author": "LaKrista",
 "citation": " LaKrista. \"Spun: experience with Methamphetamine (ID 1614)\". Erowid.org. Jul 17, 2001. erowid.org/exp/1614",
 "substance": "Methamphetamine",
 "bodyweight": "100 lb",
 "report": "<p>My first experience with meth was at my boyfriend's house.  My friend Jessica, her boyfriend, and mine were all in his room.  They started smoking it and I felt left out so I asked if I could.  I took about 4 or 5 hits and then we left.  We had to drive quit a way back to get home and I felt totally in control and I knew all the roads to take and I felt really mature in the way I was talking.  But I went to sleep that night.</p><p>The second time I done it, I smoked alot more.  I just kept smoking more and more because I couldn't feel the effect.  We smoked it all then we started driving back into town when it hit me.  I suddenly felt like my hands had to be moving at all times.  I even started hitting my wrists together like as a reflex or something.  Then I talked and talked and I cared about people so much and I got along with everyone GREAT.  I totally cared about what people were talking about.  I also always have an excited feeling in my stomach after I do it. </p><p>In my experience, snorting gives you the quickest high.  You can feel it alot more too.  Its a burn in your nose, but not a bad burn, it actually feels good.  And then when it starts draining down your throat you get so happy cause you know it's just about to kick in.  I also found myself drawing alot when I was spun out. </p><p>I quit the drug because I got really sick from staying up and not really eating for two weeks and I decided to stay off.  But then a few weeks later I did it again and it felt sooooo good.  I quit for awhile again though.  I haven't done it in a while and when I think about it, like right now, I get shaky and my stomach kinda gets that excited feeling.  I don't see anything wrong with this drug as long as you take a break from it every now and then.</p>",
 "year": "2000",
 "id": "1614",
 "gender": "Female",
 "timestamp": "2001-07-17T07:00:00.000Z",
 "views": "16160",
 "dose": [
  {
   "time": "0",
   "amount": "8 lines",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ]
}
