{
 "id": 16158,
 "title": "A Night Like No Other",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "MR P",
  "gender": "Male",
  "weight": "132 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0:30",
   "amount": "0.5 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "5:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "This night was truley amazing.  I have been saving the coke acid and X for awhile now and I decided tonight would be the night.  I ate the 2 hits of acid at 12am and waited untill 12:30am to blow a half gram of abusolutlty fanatstic coke.  the coke made me feel wonderful then the acid took me and slammed me into a wall.  the only way to describe it is screaming.  The words and boxes from instant messenger were dancing and morthing and the white walls were multi rainbow colored and the painted on vines slithered and danced over the walls.  My mind raced I ended up standing in the corner for some time with all the lights in the room pointing on me staring at the light thinking about the new challenges that will be presented to me now that I have graduated high school.  An overwhelming feeling of mind bending intesity strangled my brain for the next few hours.",
  "At around 5am the trip had peaked and was starting to fall so I decided to take the X.  It only took 10 to 15 minutes for it to take affect.  it exploded my mind.  I could only see the color yellow my vision was fucked I moved my head but my eyes couldnt keep up. It was like a movie in slow motion.  I grabed for the trash can a barthed.  I need fresh air I thought. It was what ever time the birds wake up when I left the house and still a little dark I walked for hours talking and rambling to my self about the beauty of the neiborhood and how its a damn shame the trash is moving in shaking my fist at no one waving my arms at houses and shouting to my self.  The color of the sky was simply beautiful along with all the other colors.  It was about 8:30am when I made it back to my house I laid down but couldnt goto sleep the majority of the trip was over. It had boggeled my mind and left me fucked for the rest of the day, rambling about nonsense and completely drained of all energy.  It was an amazing night."
 ],
 "erowid": {
  "id": "44209",
  "citation": " MR P. \"A Night Like No Other: experience with LSD, Cocaine & MDMA (ID 44209)\". Erowid.org. Jun 14, 2007. erowid.org/exp/44209",
  "substance": "LSD, Cocaine & MDMA",
  "views": "5709"
 }
}
