{
 "title": "Enjoy in Moderation",
 "author": "Mr. Marbles",
 "citation": " Mr. Marbles. \"Enjoy in Moderation: experience with Codeine with Acetaminophen (ID 16154)\". Erowid.org. Nov 8, 2007. erowid.org/exp/16154",
 "substance": "Codeine with Acetaminophen",
 "bodyweight": "117 kg",
 "header": [
  "DOSE:",
  "330 mg",
  "oral",
  "Codeine",
  "(pill / tablet)",
  "",
  "3.3 g",
  "oral",
  "Acetaminophen",
  "(pill / tablet)"
 ],
 "report": "<p>[Erowid Note: this person took 3.3 grams of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]</p><p>After rummaging through my grandfather's pharmaceuticals, I discovered a container of Tylenol 3. Each pill contained 30 mg of Codeine, and 300 mg of Acetaminophen. I tried taking 3 pills, with only mild euphoria. Several days later, and after some research, I decided to take 11 pills, for a total of 330 mg of Codeine, and 3.3 g of Acetaminophen. Although this was quite a lot, I figured that my large body (117 kg) could handle it. I was wrong.</p><p>The trip started nicely enough, with slight euphoria about 20 minutes after consumption. 10 minutes later, I felt a strong tingling sensation, as if my muscles were being tickled from the inside. From here the trip took on a very unpleasant character. I had the alarming sensation of labored breathing. It wasn't that I wasn't capable of breathing, but rather that I had to force myself to breathe. When I held my breath for example, I had no urge to breathe again like you normally would. It was as if I had no automatic urge to breathe at all. This was perhaps the worst part of the experience, as I was afraid that if I passed out, I would not be able to breathe on my own. I later learned that labored breathing is the first sign of codeine poisoning. Fortunately, those symptoms did not worsen, and I was able to enjoy the trip a little. I discovered that it was much more enjoyable when I lied down and closed my eyes. The Codeine lasted for a couple of hours, and then faded away, to be replaced by nausea. It felt as if I had the flu for two or three more hours.</p><p>The next day, I had trouble urinating, and experienced constapation, as I had expected. I also feel somewhat hung-over. My advice to anyone experimenting with Codeine would be to use it in moderation. Despite the fact that I was below the daily maximum of both Codeine and Acetaminophen, and that I am quite a large person, I believe that I experienced Codeine and Acetaminophen poisoning. It is not a pleasant experience. Keep in mind that the Codeine does not become any more euphoric after a certain dosage. My dose was 2.8 mg/kg.</p>",
 "year": "2002",
 "id": "16154",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-08T08:00:00.000Z",
 "views": "18098",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "330 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "3.3 g",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 }
}
