{
 "id": 16163,
 "title": "This Trip Lasted for 3 Days",
 "date": {
  "submission": "2007-02-28T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gonzo",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "roots"
  }
 ],
 "report": [
  "This is a story detailing my couple of experiences with Datura root. My friends and I had read about it in Carlos Casteneda's books. It was a sacred plant to the native americans and they would take only a small part off of the very tippy end of the bige tube root of the plant and they had a purification process for it also that lasted a couple days before they would ingest it. They believe that plants like Datura or like peyote have a spirit that is associated with it. They believe that the spirit of the Datura plant is very powerful and often will overtake the person who takes the plant.",
  "Well, my friends and I were in California and noticed the plant on all over the place by it's beautiful fragrant flowers. We gathered a root and went out camping in the high desert. My friend Donny decided to make some tea out of part of the root, while I and another friend simply took a bite out of the small end of the root. After a half hour seemed to pass without any effect other than the worst cotton mouth EVER! we decided to eat some more of the root. Another half hour or so and I decided that this stuff sucked and was going to lay down in the tent...on the way I drank some of Donny's tea.",
  "The next thing I know I was waking up and thinking that I really had to pee. It was night time, but when I stepped out of the tent it was a beautiful sunny day outside! It was cool because as I went towards some trees to pee I found that the trees had faces and I could talk to them. There was also this large rock just off of the trail and it turned out to be hollow! That's right, and not only that but someone actually would hide under it and they could see out through it and would spy on people hiking on the trail! I was having a whole new world revealed to me in this dilusion, it didn't seem like I was tripping, only that this was reality that I hadn't been able to see before the spirt of the Datura became my allie. Then I saw a couple of my friends. They didn't speak out loud to me, but it was like we all knew each others thoughts and we decided to play hide and seek. But not just normal hide and seek, we could turn invisible! So this went on for a long while and I got lost off talking to the trees and mountains and finding whole little worlds I hadn't known before of little people living in the trees.",
  "This trip lasted for 3 days...I didn't think I was tripping...on the third day my friends were saying...'Nice to have you back.' And they related to me that I was pretty much gone from reality for the last 3 days.  I then realized that this had not been reality and the spirits in the trees and little worlds withing worlds that lived in the holes of the trees were not real. I was astonished! Non of what I had experienced was real at all!",
  "At one point we had gone out to breakfast. I actually had this little window pop up in my peripheral vision that would show me the translation of any word on the menue into whatever language I wanted. My friends said that I sounded like I was speaking in perfect dialect of German, Chinese, and some other weird made up languages too. I honest fealt like I knew the language and could speak it too, fluently!",
  "Another experience I had with Datura was on the coast of California. The most notable parts of this trip were that I had remembered going to the ocean and leaving my sweater there and my friends insisted that I never left their sight and that we did never go to the ocean. Well, my sweater was missing several days when I saw it on another friend, I asked her where she got it and she said she found it on the beach. The most amazing, although frightening thing that happened though, every one of my friends and a police officer saw happen.",
  "A cop saw me running around and stopped to ask me some questions...my friends came over and he told them that they needed to keep me away from public in the state I was in. I was squatting at his feet saying that I had to plant these good seeds and eat the bad seeds and this seemed to annoy him quite a bit so he put me in the back of the cruiser with cuffs on while he spoke to my friends. I remember having the thought that I really wasn't comfortable in the car and wanted out...next thing I, the cop, or my friends know I am mysteriously out of the cop car without cuffs on and eating bad seeds and planting good seeds at the cops feet again! He grew afraid and eyes widened...as he ran away and got in his cruiser he yelled that he didn't want to see me again and to keep me under close watch!",
  "Datura is amazing, but causes delusions and complete other worlds to seem like reality. There was another kid we met while in California who said that he'd done Datura several times before...he seemed that he was locked in this other world of unreality and although very nice kid...always weird smile on his face and little chuckles for no reason...I think that the spirit of the Datura took him over.",
  "Be careful with this plant, it is not a toy!"
 ],
 "erowid": {
  "id": "44249",
  "citation": " Gonzo. \"This Trip Lasted for 3 Days: experience with Datura (ID 44249)\". Erowid.org. Feb 28, 2007. erowid.org/exp/44249",
  "substance": "Datura",
  "views": "19723"
 }
}
