{
 "id": 16182,
 "title": "Tripping the Shelves Were Streching Out of Control",
 "date": {
  "submission": "2007-06-08T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Aly",
  "gender": "Female",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "There's a lot of buildup here before I get to the actual trip report, and for one very good reason: when I finally tried LSD, my experience carried the weight of ten years of expectations. Because I am absolutely certain that this long-term, positive way of thinking about acid influenced my eventual experiences with the drug to a profound degree, I feel that I should go into some detail.",
  "A few months ago, I told a friend of mine that I had wanted to try acid since I was ten years old. She laughed and said that I reminded her of Marla in 'Fight Club,' who says at one point says, 'I haven't been fucked like that since grade school!' It's easy to see how, in this society, one would be as shocking as the other. I have, in fact, been fascinated by LSD ever since (oh, and I know it sounds cliched) fifth grade, when I discovered the Beatles. I was never around drugs of any kind, except for alcohol as a child; and don't take my interest at the age of ten to mean that I actually tried it then.",
  "Once I hit my mid-teens and drug experimentation became a real possibility, I tried to find acid, but couldn't--it is very difficult to obtain in my area, especially without a network of certain kinds of connections. So, long story short, by the time I was twenty-one, I had long since taken up smoking cigarettes, used marijuana on a fairly regular basis, had discovered and waved good-bye to alcohol, and experimented with ecstasy and cocaine--but I had yet to try that one substance whose reputation originally interested me in this whole drug thing.",
  "Pot was a great way to relax or kill a lazy afternoon; alcohol was, on the whole, not worth the next day; e was loads of fun but not something I would want to do on anything approaching a regular basis; coke was one hell of a high--but something was missing. I had, in all honesty, expected more. Drugs, I had found, were mostly good fun but lacked the one quality that had sparked a ten-year-old's imagination. I didn't want a mood-enhancer or just a way to get really fucked up. I wanted the world around me to change for just a few hours. I had tried mushrooms, but they were weak and the trip was, well, barely a trip at all. Bright colors and soft, friendly towels and the feeling of being incredibly stoned were all well and good--but I wanted to SEE things.",
  "And finally, eleven years after the dawn of my curiosity, I got some acid.",
  "I'm here to write about my third LSD experience, specifically, because it was by far the most intense trip I've had. The first time I tried it was spectacular, and three other friends were there experiencing it with me--I got some definite visuals, but that trip was still mostly mental, like the mushrooms to the tenth degree. My second trip was only on one hit, and was not very intense at all; mostly it kept me awake, and very aware of and interested in my surroudings.",
  "But the third time...",
  "This was not a planned trip, but it couldn't have worked out better if it had been. I'd had two hits of LSD bumming around in my freezer for 'whenever' for a while, and it was only at about 12:15 on the night in question that it even occurred to me to do them. I had some friends over, and we were sitting around, doing nothing, smoking some pot, when it occurred to me that I didn't have to work the next day--so hey, why not? At 12:30 I took my two remaining hits, quit smoking pot for the night because I figured anything I smoked would be good pot wasted on someone who wouldn't notice it, and sat back. No one else was tripping with me.",
  "The effects began within about half an hour--I was giggly and high-feeling. We were watching 'Team America,' and I was laughing myself to tears. Within an hour of taking the acid, I was beginning to trip. The signs of an oncoming trip were by now familiar to me--a vague purplish tint to everything, shadows that grew, moved, breathed, and generally crept about in ways that shadows shouldn't. It was time, my roommate Kate decided, for a run to get a sandwich (for her) and cigarettes (for me). My hallucinations were quickly becoming much more intense than anything I'd ever experienced; putting on makeup before going out became a 30-minute adventure I'm not even going to bother trying to describe. When we finally made it to the convenience store (let's not give out names here), I was beginning to peak--and this peak lasted hours.",
  "I highly recommend a bright, busy, neon-lit convenience store at 1:45 am to anyone who is tripping for not-the-first-time and who is with a responsible babysitter. I had to be careful and not make remarks on what I was seeing for anyone to hear--no one likes it when people on drugs cause scenes in public. On the way in, I told K, 'As your attorney, I advise you not to let me say a fucking word in here.' Then we giggled about that for a while, but I'm pretty sure that's as druggy as either of us acted. I say 'either of us' because, in my experience, people 'babysitting' people on drugs often act far shadier than the person who's ON drugs. Not so in K's case. It was AMAZING inside--the colors were insanely bright, the neon looked beautiful, the floor was crawling and alive. The touch-screen were K ordered her sub was probably the most fascinating thing I've ever encountered on a trip. The screen was moving; the words were wavy, crazy and all-over-the-place. I was seeing different fonts. I was seeing pictures in place of words. I was seeing the LCD screen in 3-D.",
  "We made it out of there without actually causing any kind of disturbance at all; at most we were being loud and giggly, but I held it together and didn't let the ~really~ hysterical laugher set in till we were back in the car. Then we went for something of a country drive, stopping briefly back at the apartment to pick up one of the friends we had left there during the sandwich run, because he wanted to be on this drive. Hey, who can blame him? So I was driven around for about an hour on a beautiful summer night--we drove down by the creek and smelled the summer air.",
  "I was tripping so hard at this point that it's very difficult to maintain a coherent narrative. I remember the music we were listening to--first Make Believe (the band, not Weezer's latest disappointment), then some 80's mix which gloriously featured both 'Come on Eileen' and 'Enjoy the Silence'; and finally--flawlessly--Crystal Method. Perfect. It was one hell of a drive, and I can remember pretty much every specific--but nothing ties them together, so I can't maintain a readable narrative if I go into them.",
  "When we got back to the apartment, I was still peaking. I sat around and watched K play Prince of Persia, which was amazingly interesting. This is one of the rare video games that's actually interesting to watch when you're not playing even when you are NOT on a hallucinogenic drug. Being on a hallucinogenic drug, I happily watched K play for several hours. The screen grew and shrank, got more and less purple, and I had difficulty seeing that the colored shapes moving about were anything but colored shapes.",
  "There was one very interesting moment of note. I briefly went in to my bedroom to change my away message online. In typing my new one, 'tripping in 7-11 the shelves were stretching out of control' (note: that's a Nada Surf lyric; the store we were in that night was not a 7-11), I had a definite weird, weird, weird moment. I wasn't typing so well because my hands were shaking somewhat and I wasn't, for obvious reasons, seeing the screen too well, or to rephrase--I was seeing the screen VERY well, thank you, but not entirely, well, correctly.",
  "The most difficult part for me to type was '7-11'; finding the numbers and the dash was not easy, and required a lot of concentration. So BECAUSE they required so much concentration, I distincly remembered typing them--or did I? When I looked up to read my message to check it for typos (yes, even in that state), what I saw was, 'tripping the shelves were stretching out of control.' To be sure of what was there, I had my roommate read it out loud to me. Yup. I had been concentrating so hard on getting those numbers and that dash right that I had--you guessed it--only done it in my head. But I'd thought that I'd really done it. And that tiny moment, the confabulation of having typed that simple little phrase, innocuous as it may seem, is the only time I've ever actually become disconnected from reality when under the influence of any drug.",
  "When I realized what had happened I was amazed and elated. Now THAT was a trip--an actual voyage to the inside of my own head, while in a waking state. By the time K put away the PS2 and our guests filed out the door, I was coming down a little bit--by which I mean that shapes were no longer crawling out of the walls and furniture and I was probably even able to type without having a minor psycho mind blip occur.",
  "So she went to bed and I (of course!) stayed up, watching movies, then playing Prince of Persia myself when I had come down enough to control a videogame, then watching another movie--'Kinsey'--as the sun came up. I'm not sure exactly when I stopped tripping; my best estimate is between 10 and 11 am, though for the whole day after that I was still feeling kind of spacy. As for how much of that was drug and how much was lack of sleep, your guess is as good as mine. I did get some very interesting visuals IN my head that night as I was finally drifing off, though, so I think the drug probably had some definite lingering effects.",
  "I'm still in the afterglow of that trip--those few days following a really great, intense experience. I feel like I've seen things in a way that's, well, wholly new. I also, having come down from the trip, have a great appreciation for the way things ARE normally. Tripping is a great experience, but by the twelfth hour it gets wearing. The next day, and the day after, and the day after that, it's still a little comforting to look at an LCD touch screen and SEE an LCD touch screen, the way you know it really is; to be able to look in the mirror without your face stretching adn melting and morphing around itself; to put on makeup without feeling like you're in danger of rubbing your nose away; to buy a pack of cigarettes and not really notice all that garish neon.",
  "I don't, and have never, bought into any mystical theories about drugs. I don't think that acid helped me to 'see God' or become enlightened, or anything like that. I do think that acid was a tool that helped me to get back a little bit of childlike wonder. It's enough, after a trip, for everyday things to be everyday things. And at the same time it's comforting to look at them and remember what they were like when they were NOT everyday things.",
  "There are very few experiences in life that can withstand eleven years of buildup without being even somewhat of a letdown. LSD, I am relieved and very happy to report, is one of those things. I doubt I've seen the last of it."
 ],
 "erowid": {
  "id": "44321",
  "citation": " Aly. \"Tripping the Shelves Were Streching Out of Control: experience with LSD (ID 44321)\". Erowid.org. Jun 8, 2007. erowid.org/exp/44321",
  "substance": "LSD",
  "views": "3836"
 }
}
