{
 "id": 16191,
 "title": "Very Good for People with Anxiety",
 "date": {
  "submission": "2008-09-11T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ClimbingLake",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Lorazepam",
   "form": "daily"
  }
 ],
 "report": [
  "I starting having panic attacks 9 years ago.  They kicked in after a majorly unpleasant corporate takeover occurred and I got promoted into a job that required lots of travel and working with evil people.  I had also split up with my partner, moved, graduated from college; way, way too many major changes all at once.  It would have been nice if the team of EXPENSIVE Doctors I had 'helping me' pointed out that living across the street from a Starbucks was a big part of my problem.  Six cups of Venti Drip Java a day.  Living in Manhattan.  Rat races.  You get the drift. ",
  "Tried every non-pharma, non narcotic charm such as meditation, hypnotherapy, Yoga, standard talk therapy.  Kava Kava worked but did evil things to my stomach and kept me awake for 12-14 hours after a cup.  Kava Kava also tastes really, really bad.  One day my general Doctor heard me flip out and prescribed 2 mgs of Lorazapam three times a day.  Immediately, I calmed down and was able to finally feel that horrible weight lift off my chest. ",
  "Problem #1.  I was taking an awful lot of a sedative, 6 mgs a day.",
  "I went to work one morning at 7am and decided it would be completely okay to slip under my desk for a bit of a snooze.  Just like that.  Try major sleep.  Scared the heck out of the receptionist when she came to work hearing me snore under my desk.",
  "Problem #2.  After a month I ran out of Lorazapam.  I thought okay, no problem. ",
  "I fell into the worst panic attack at a major meeting with a bunch of evil bigwigs around a table.  I thought it would be entirely rational to ask someone to call the fire department as I thought I was going to die.  No one told me about the addictive side affects of Lorazapam.",
  "Asset #1:  Cuts out the crazy, panicky, 'world is falling apart' theme for people who have panic attacks.  With proper supervision of an MD, I can function.  Make decisions.",
  "Asset #2: I was able to slow myself down and benefit from other practices.  Change my outlooks, habits.",
  "Asset #3. I was able to move out of Manhattan (this was like trying to pull a cat off a tree) and move to a much quieter career and city. ",
  "Side Effects; I take 1/2 mg in the morning.  I take the other 1/2 mg in the noon and feel relaxed, mellow, a bit tired, but able to measure all the conversations, issues and decisions I need to make through the day.  I take the other 2 mgs in the evening and can sleep right through the night.  I had insomnia for three years prior to taking Lorazapam.",
  "Trips/Feelings/ETC:  I don't receive much of a high, just a nice calm.  I generally am in a more relaxed mood with my dosages.  If I take 3 mgs of Ativan, I will go to sleep. It isn't really a trippy or major mood altering pharma.",
  "Benefits: Very good for people with anxiety or panic attacks.  Does not cloud thinking, slow me down, etc.  No need to attain street drugs to calm down or drink cocktails to mellow out and show up at the office a drunken mess.",
  "Disavantages: Very addictive.  After 8 years of using Lorazapam, if I want to cut it out, it must occur VERY SLOWLY.  Also, if I run out, I know the ensuing panic attacks are more about withdrawal.  Interestingly, after two major incidents, a car accident and a serious hurricane that ripped my roof off of my house, I chose to go no Lorazapam and deal.",
  "Recreation: I wouldn't really say this is a recreational pharma.  I don't get great rushes of euphoria, or visions, hallucinations. ",
  "Basically, if you take too much of this one, you will sleep.",
  "Written By: ClimbingLake, July 2, 2005; Florida, USA"
 ],
 "erowid": {
  "id": "44345",
  "citation": " ClimbingLake. \"Very Good for People with Anxiety: experience with Lorazapam (Ativan) (ID 44345)\". Erowid.org. Sep 11, 2008. erowid.org/exp/44345",
  "substance": "Lorazapam (Ativan)",
  "views": "38404"
 }
}
