{
 "title": "Opening the Soul's Eyes",
 "author": "Tathra",
 "citation": " Tathra. \"Opening the Soul's Eyes: experience with Ketamine (ID 16193)\". Erowid.org. Jul 21, 2002. erowid.org/exp/16193",
 "substance": "Ketamine",
 "bodyweight": "150 lb",
 "report": "<p>After securing a small amount of liquid ketamine (~50mg, 1/2cc of 100mg/ml solution) and finally securing a rig, my personal quest to mainline ketamine is now becoming reality. Im over at my friends' house and they know what Im preparing to do, so they wish for my safety. Ive never IV'd before, and I had some problems getting the needle properly into a vein, so my friend does it for me. After a few seconds, my body begins to tingle. 'Oh god, here it comes,' I say, and I sit back.</p><p>Suddenly I have forgotten all the knowledge I have obtained in this mortal life, as if Ive just woken up from a dream. I look down at my arm; not through my physical eyes, but through other eyes. I not only see reality, I feel it. Since it was my first IV experience ever, I spend the entire experience gazing at my arm, making sure its ok.  It seems I can still feel the needle in my vein, even though it was removed before I fell into the hole.</p><p>I can see in more than just 3 dimensions, its hard to describe...everything had much more depth and was way more refined. Simply by looking at my arm, I could see all the valleys and mountains that are my flesh with extreme clarity. I feel completely at peace, as if this is the only reality that exists. I regret that I was worried about my arm and did not get a chance to look around at other things before coming back into my body. After a short time, my soul's eyes merge in with my physical eyes, and once again, I am confined to my body.</p><p>While coming down, I begin to remember my mortal knowledge and remember that its recommended you begin to describe the experience as soon as you can, so I begin thinking on what has just happened. While out, I couldnt think of anything, I was in awe of how incredible everything appeared, but coming down, I can put things into perspective. Now I can look back and realize what just happened. I attempt to find words to describe the experience to my trip sitters. All I can think of is 'wow.' I lay down on the floor and continue to think.  The human mind cannot comprehend that sort of experience.</p><p>About an hour after returning to my body, I feel safe enough to drive myself home, so I can attempt to write out what I have experienced, to help me remember. One thing stands clear in my mind: I must return, on a slightly higher dose, and I need to make better use of the short amount of time this gift gives you.</p><p>This was definitely a spiritual experience. My first ego-loss. I know the answers I seek can all be found right outside my body, so I await the chance to return.</p>",
 "year": "2002",
 "id": "16193",
 "gender": "Male",
 "timestamp": "2002-07-21T07:00:00.000Z",
 "views": "11289",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "IV",
   "substance": "Ketamine"
  }
 ]
}
