{
 "id": 162,
 "title": "My Minds Got a Mind of Its Own",
 "date": {
  "submission": "2013-10-02T07:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "my3rdi",
  "gender": "Male",
  "weight": "245 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "150 ug",
   "administration": "sublingual",
   "substance": "LSZ",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "<p>Preface: ",
  "I am a very experienced drug user.  I have tried a whole spectrum of substances, and I would estimate my total trip count to be between 250-275 trips.  Including single or combined use of LSD, LSA, DMT (oral and smoked), 4-aco-dmt, Mushrooms, 25i-nbome, ketamine, DXM, 2cb, mescaline, MET, Allylescaline, DPT, and 2c-I",
  "My mood for this trip, I was very relaxed, and joyful.  The weather was beautiful outside, and I was excited about trying a new compound. ",
  "I had eaten about 3 hours prior to dosing.  I had also had 3 beers prior to dosing as well. ",
  "Trip report:",
  "Substance report LSZ",
  "1 tab",
  "LSZ",
  "150ug",
  "3:48pm tab placed on tongue",
  "3:55pm no bitter or numbing effect similar to the 25i series.  Has a very similar taste to LSD.  Slight light headed feeling setting in",
  "[post trip comment- it set in quite quickly and in a very subtle way]",
  "3:59pm come up commencing.  Very similar to LSD.  Alert, euphoric, spacey, and dreamy [color enhancement was immediate, I also had a very strong urge to be outside]",
  "4:11pm dreamy euphoric state.  Very similar to a base LSD feel.  I feel very relaxed.  The speedy head feeling of the Phenethylamine class is absent, which confirms the compound being rooted in the ergot family.",
  "4:20pm visual distortions occurring.  Little to no body load.  I feel like closing my eyes.  It feels like I am being enticed to fall into a trance[it very much perpetuated the notion of being in a dream]",
  "4:30pm sedated dreamy feel.  Definitely shares a core physiological feel like LSD.  Seems to slowly be creeping up.  [the come up was an elongated process.  The peak didn't start until the 3rd hour into the trip]",
  "4:34pm feels like a slower version of LSD at times.  I continue feel/watch this slowly unfold",
  "5:09pm I have just returned from a nice walk.  This substance continues to slowly develop.  I like this.  A lot more than the 25x series.  I def have a heightened sense of awareness.  Minor CEV's.  Open eyed visual distortions increasing.",
  "5:29pm visuals increasing.  Still no body load.  Very relaxed, spaced out high.  Very able to function in public at this dose level.",
  "5:49pm I feel like I have plateaued in terms of effects.  I feel high, kinda tripped out.  I think this would be an excellent substance for introducing people to the psychedelic realm.  Very mellow.  Very comfortable, gradual ego loss was nice.  Music is enhanced on this.  The room is 'brighter' than normal.",
  "5:55pm this substance works in waves, just like LSD.  It definitely has the magic, connected feeling of LSD as well.  Huge spiritual potential.",
  "6:18pm I feel like it is levelling off.  It is definitely at a level to function socially.",
  "6:56pm visuals still active.  I definitely think I am still in the thick of the peak.  It's mellow.",
  "7:15pm comedown ensuing",
  "8:05pm visuals still happening.  I feel high but also feel like I am down slightly",
  "9:57pm visuals still present.  Still wide awake feeling",
  "11:53pm 6mg melatonin consumed. Oev and cev still present.  Physically tired, mentally stimulated",
  "9:30am I had a lot of trouble sleeping, I would classify it as a night of restless sleeping.  I had profound visuals within and around my 3rd eye.  Very complex imagery.  Very powerful looking faces morphing into geometric patterns.  Bright and dark color contrast.",
  "This compound definitely requires a more extended period of time.  At least 10-12 hours at the dose taken.  I tried to commence sleep eight hours into the trip.",
  "Overall, I really like this compound.  It shows enormous potential and power.  It has what the 2c series lacks, the magical and mystical component, along with the necessary ego softening/ death.</p>"
 ],
 "erowid": {
  "id": "101434",
  "citation": " my3rdi. \"My Minds Got a Mind of Its Own: experience with LSZ & Alcohol (Beer) (ID 101434)\". Erowid.org. Oct 2, 2013. erowid.org/exp/101434",
  "substance": "LSZ & Alcohol (Beer)",
  "views": "1604"
 }
}
