{
 "id": 16209,
 "title": "The Breath Of A New Day",
 "date": {
  "submission": "2007-07-20T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "found, again at 37",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 ],
 "report": [
  "<p>The last 6 months of crack, spawned from a year of snorting blow brings me to this time with the questions how? when? why? I knew better having known a drug culture 25 years. Was a cocoanut for 2 years snorting a ball a day for free at 22 (this is when the greying started) only to be saved by a love for a woman. Got hung up on crack for a week at 27, and ran 1000 miles away. At 36 having spent most of 10 years a pot-head & being back home I thought been there - done that, I can handle some lines. Six months later I'm doing all day from morning to night. At least I was turning down repeated offers from friends to do crack only because I liked the taste & the smell. Then the day came I took a hoot. The next weekend I bought my brillo & pipe found my friend & ordered up my HB & proceded to puff my way to the next morning, I slept till Sunday and felt drained & tired yet with in 2 weeks I was stopping in at crack shacks during work. Five months later sick with myself, the paranoia, seeing bad guys in the shadows I had had enough.",
  "I gave away all my new toys for doing crack to my friends, save for 1 simple glass pipe. The one I used for another month weening myself down, yet I never seemed to clear 2 days clean in a row. At this time the (clean) girlfriend I seperated from 9 months earlier was back in town & I sure was happy because I was more interested in her than crack. The downside was she wasn't impressed with me chasing shadows with a shot gun after 5 days with no sleep her 2nd morning here. She was leaving again, I can't blame her for I would have run had I been in her shoes. My shame smashed the pipe that day, but depressed about my lost love a friend cheered me up with a hoot and a free pipe. 5 days later I've smoked a few 8 balls when I found a photo of me at work 2 years earlier & I could clearly see the muscle bulging through my shirt. I sat there for awhile a tear in my eye pondering where that man went. I promptly called my friend up, ordered a 40. When he arrived I thanked him filled his arms with his shop leave arounds (reasons to come over with temptation no doubt) and asked him to get out of my life. We had been friends 18 years.",
  "I wrapped up my 40 in lung quickly & tossed my gifted pipe as far as I could into a dump and went to bed.",
  "I woke on time tired as usaul today, opened the office, pulled the shades back looked out to the mountains, breathed the fresh morning air when a thought stirred a tear of emotion, & here it is,",
  "In the breath of a new day,",
  " the glass wall has gone its way.",
  "Alone in the beauty of mornings light,",
  " my friends are but a blight.",
  "Family has become lost,",
  " a cost mine alone.",
  "Found peace in my love for a woman.",
  "My shame turned to courage,",
  " in the wake of her sails full with the breath of a new day.",
  "I stand on the rock,",
  " glass at my feet.",
  "Shameless courage borne from all that is lost.",
  "Alone I tremble,",
  " too breathe the air of a new day.",
  "This my 1st day my will power has said no, I have been tempted by a visiter, 2 very stressfull spots at work, punched in the face at another job, having to fire my friend because of his problem getting to work during daylight only to have him offer me a stress hoot.",
  "I said no to all offers, acceppted the cravings as my own mind game. 9 months ago I gave into my better judgement and bit into Eve's apple.",
  "I beat the urge today, tomorrow I breathe the air of a new day.",
  "I'll deal with the day after that when it comes, it won't be any better than today I'm sure. One thing is for sure though, I wasn't seeing things in the shadows last night & I won't tonight and thats the pat on the back I need right now.",
  "Be strong, live long & be well</p>"
 ],
 "erowid": {
  "id": "44413",
  "citation": " found, again at 37. \"The Breath Of A New Day: experience with Cocaine & Crack (ID 44413)\". Erowid.org. Jul 20, 2007. erowid.org/exp/44413",
  "substance": "Cocaine & Crack",
  "views": "4089"
 }
}
