{
 "title": "Adderall has Got me Hallucinating",
 "author": "C M B",
 "citation": " C M B. \"Adderall has Got me Hallucinating: experience with Aderrall XR (ID 16218)\". Erowid.org. Jun 29, 2005. erowid.org/exp/16218",
 "substance": "Aderrall XR",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Okay, First off, my boys call me CMB.  I don't really even understand it, it's supposed to mean something.  I think it has to do with weed. I've always wanted to do one because I've had a lot of experiences but this one stands out more than any other.  Do I love my medication!</p><p>My main reason for experimenting with my medication is because I'm on probation and I'm going to programs where they test me for all  illegal substances.  I'm legally allowed to take Adderall and Paxil.</p><p>When I normally take Adderall it doesn't really do much except what it's supposed to.  I have only been taking it five days as of today.  I have severe ADD.  If Adderall is a safe, legal for me, hallucinogen then I think I might be in heaven.  But when I chew it or crush it up it's a completely different form.  It goes from a sprinkling rain to a pouring thunderstorm.  Lightning included.</p><p>Oh I don't know if I mentioned this.  As I'm writing this report.... Seeing things.  This is my first time ever seriously seeing objects when I'm hallucinating.  I've done mushrooms and acid and the most important one sounds kinda stupid.  I was at somebody's house I didn't know, these two girls I was shroomin' with brought me.  I started petting a pillow because out of the corner of my eye it was a cat.  But it went away as soon as I looked at it.  Which is very much like the hallucinations Adderall is giving me.  Well I should start from the beginning.</p><p>Okay I started This two days ago.  First I took one normally in the morning at 8:30 AM.  Then I tried chewing the Aderrall for the first time at 7:00 PM.  I love experimenting so I wanted to try and see if it's possible to fall asleep on Adderall.  I thought maybe since the pills help me pay attention, I'll be able to control my dream and remember it better.  Well, it's completely impossible, at least for me.  That night went by normally, just there was no sleepiness whatsoever.  I bet people could take these and run without sleeping as long as they want or until they die.  Or something.  Uhh, some of the stuff I'm saying might sound a little confusing sometimes.  I'm pretty messed up.  That's my excuse, ok here we go.</p><p>Then I started the morning of the Second Day.  Chewed my first pill at 10:00 AM.  Then I chewed my second when I got out of my program at 6:00PM.  About an Hour later is when the effects started happening.  Here is what happened in order.</p><p>(Times are majorly guesses. Except a few *special* cases.)</p><p>7:00 PM - Odd feeling Head Buzz.  Can't really explain it to well.</p><p>8:30    - I was pissing in my bathroom.  I was noticing how my urine looked so bright.  and then I looked around and Every color looked brighter.  I felt wind blowing on my back.  When I finished I looked towards the window, and it was closed.</p><p>I remember two occurrences happening and checking the time on both of them, but the problem is... I forgot which one came first.  I will write it in the way I believe it was.</p><p>*11:29       - Well first of all I was afraid to get up and walk around my house because I wasn't sure if my parents were sleeping.  I think the fear might of had something to do with it. My head buzz was somewhere around a quarter-ounce of normal swag weed.  Well I had super ultra severe cottonmouth so I got a drink and when I was bringing it to my lips somehow one nickel sized drop made it out and landed directly on my heart(no shirt on).  Not sure why, but for some reason it just seemed to be of so much importance.  Plus when it was falling, it looked like it stopped and took a break in the air for a second.</p><p>*11:31-11:36 -   This is when things started gettin' really freaky.  But I liked it.  I looked at the top of my arm checking the tan I got today.  Then I turned my arm over and there was a green spot in the middle of my arm.  If I tilted it or moved it it stayed, so it wasnt because of my vision.  The longer I would stare at it, the more it would spread.  My arm actually started tingling like I wasn't supposed to let it spread.  Then my vision distorted.  When you're looking at something that is straight in front of you it looks fine.  Anything on the very edge of either corner is strange.  It looks similar to when you look over a heater and the image kind of waves back and forth.</p><p>11:45-12:15 - The auditory hallucinations start.  Normally nothing too bizarre, random clicks, small knocks, but some sounds get strong later.</p><p>12:12 - First visionary Hallucination.  It was strange in so many different ways.  I got a very strong head rush all of a sudden, and seemingly for no reason.  So I covered my eyes for a minute and it scared me.  Not sure why, it wasn't really fear, more like a surprise.  With my eyes closed it was all red with different types of red lines running through it in a perfectly symmetrical design.  But it would change whenever your eyes look somewhere else.  Then I opened my eyes and there was a woman standing on the right side of me, and a man on my left.  When I would look at them they would almost turn invisible until I looked straight again.  They don't like the light, they skulk in the shadows. I don't think that means they're necesarily evil, just dont like light.  Maybe sunburn or something j/k.  Strangely I didn't feel frightened at all towards either of them.  Almost like, maybe, calming?  I couldn't see them very well unless I shut the computer monitor off, and when I did was when the spooks came out.  The experience of when your eyes are adjusting back to the light has to be THE most beautiful thing of all.  Every object seems to separate itself from the rest.  The cups on my dresser float off of my desk.  It is so insane and so real at the same time.  With no lights on, every object in the room remains moving at all times.</p><p>The rest of the night was pretty much the same.  Occasionally something extremely different.</p><p>One time that I turned off the monitor for a visit or whatever I should call it, upset me.  It was because all the people were upset.  There was a girl trying to fix something on the ground, but I couldn't make it out.  A teenage girl laying in my closet rocking back and forth.  A child that looked almost exactly like my young cousin, but he was dressed in probably a 30's outfit.  They were all crying, I couldn't hear it or see it, I could feel it.  Then I heard footsteps behind me and I looked back and saw an older man, with white hair, white goatee, 30's clothes, I think he had a pipe or some type of object with him.  This is the only part of the whole experience that actually scared me.  I looked forward and I could feel the old man reach towards my head, then push my hair towards the way it grows.  Like how you pet a dog.  But I actually felt him touch me.  Then looked up and saw him.  I didn't think or expect them to be able to do that.  I also saw my deceased Grandmother, which really upset me.  She was holding a newborn baby which was crying.  Although again, I couldn't hear it.  I just knew.</p><p>3:16 - Right now... I just saw a chicken walking in my closet.  alright.</p><p>3:20 - I'm going to now turn of the monitor and get a good subject.  well I got one.  I think I saw the same girl that was fixing something before.  I also saw someone wearing some type of armor.  I've never seen it before.  I put my hand out toward the child and I could almost feel something like energy or heat or warmth.  I think it's my mind doing it though.  But I like the feeling, my hand feels extremely strong now.  One thing that attributes to the scariness factor is the hallucinations tend to swarm you.  It's like they all want attention.  I don't even know how long I've been writing.  I think I should go lay down in a little while.</p><p>A couple things First:</p><p>I know some of the things I said might sound impossible or that hallucinations are never this real.  Try to see.  I'm in this right now as I am writing.  I can see some weird creature floating in the upper right corner.  It's hard to type...</p><p>I don't know what it's going to be like in the morning.  I wonder if I'll be able to see them in the morning.  Now, it's almost like they know I'm almost done.  I just heard a very loud knock on the ground, and four or five knocks in a row on a counter.  Also I forgot to mention.  I've been hearing vacuum cleaners running since around 1:00.</p>",
 "year": "2002",
 "id": "16218",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-29T07:00:00.000Z",
 "views": "17103",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ]
}
