{
 "id": 1623,
 "title": "Stomach Pulse",
 "date": {
  "submission": "2002-06-03T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "-bC-",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 hits",
   "administration": "inhaled",
   "substance": "Inhalants - Nitrites",
   "form": "(gas)"
  }
 ],
 "report": [
  "Note:",
  "1. I did not take medication 2 weeks prior to this experience.",
  "2. I have explored many various psychoactives in the past.",
  "3. I am a mellow individual with very little stress.",
  "I noticed a lack of reports on the variety of inhalants so I decided I would contribute.",
  "While the use of any inhalant may prove to be bad for your health, I decided to log an experience I read a lot of review about.",
  "Isobutyl Nitrate is commonly known as poppers, used in clubs in combination with other drugs, by themselves, or for sexual purposes since it has the effect on relaxing the rectum and the vagina.",
  "I opened the fresh/pure bottle of isobutyl nitrate and cuffed the bottle with my hands, I filled my lungs with the fumes completely and then exhaled, to make a total of 8 inhalations. Around the 4th inhalation I felt my pulse in my forehead and in my stomach.",
  "Experience: I sat back in my chair and felt a rush of blood swell in my entire body. My thoughts sped up slightly as I tried to remember all the effects while they were taking place. It felt very good physically, it was very invigorating. The peak effects were a maximum of 2 minutes. My face began very flushed red and my blood vessels dilated. my neck also felt swollen and looked red.",
  "The 30 minutes after the experience brought me a mild headache and tired appearance. I continued to experiment with this substance throughout the rest of the day only to find the headache to grow in intensity and last throughout the next day.",
  "Overall: This is mainly a party drug. I could not find myself to sit around all day at home being and getting 'high' off of poppers. I imagine the effects will intensify the general rush feelings of other substances."
 ],
 "erowid": {
  "id": "15132",
  "citation": " -bC-. \"Stomach Pulse: experience with Isobutyl Nitrite (ID 15132)\". Erowid.org. Jun 3, 2002. erowid.org/exp/15132",
  "substance": "Isobutyl Nitrite",
  "views": "29983"
 }
}
