{
 "id": 16232,
 "title": "The Fifth Plateau",
 "date": {
  "submission": "2012-04-27T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "r e d h e a v e n",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "16",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "pill/tablet"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "pill/tablet"
  },
  {
   "time": "1:00",
   "amount": {
    "number": "40",
    "unit": "capsls"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "capsule"
  }
 ],
 "report": [
  "Ok, so Im not new to DXM, or drugs for that matter, weed, ex, DXM, lsd, etc... but the 5th plateau was something that was so totally unexpected and amazing I just had to tell.",
  "It was the fourth of July (a few days ago) and we were all going to go watch the fireworks at the green (where EVERYONE in town goes for the 4th) and there were about 600 people there, so I figured this would be a great trip, so its about 6:30pm and I down a bottle of NyQuil, thinking Ill have a good buzz, and left with my friend MYK. About 45 mins later Im only feeling a slight buzz so we ride over to the store and I grab a box of Coricidin and down all 16.\r[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]",
  "About an hour later Im only feeling a little trippy, so I go BACK to the store and get 2 bottles of Robitussin cough gels, down all 40 of em. Whoo. Good idea? That depends. Im up to 1380mg of DXM to this point, and its about 9:00pm. The fireworks start going off and its like theyre right in front of me, flying by, Im thinking that this is pretty cool, its a good trip. But little did I know that the 'trip' I was having was only the come-up. Im used to 2nd and 3d, on special occasions 4th plateau trips, but man, I was flying by plateaus like it was yesterday.",
  "The fireworks end, everyones gone, and me and my friends are sitting around talking, I sit down and Im starting to go fuzzy, like Im fading out of reality. I manage to keep my cool for about a half hour. Then I see an ambulance and get paranoid so I want to leave. By this time Im robo walking and slurring my words as Im told, and my vision is dim and blurry, Im not really concious of what is going on around me. Knowing I cant drive back to MYKs, he takes my keys and helps me walk back to the car. As we walk back, I was told I threw up two or three times and repeatedly asked what time and how I was walking. We finally get to the car, me not realizing I had walked anywhere, got in the car, and started to faze out of reality. My vision is starting to swirl lights and turn them into geometric patterns and contort them until all Im seeing is wierd lights and swirls like thats all the world was composed of.",
  "The next thing I know is that were stopped at 7-11 and I look over at MYK. He looks like hes saying something, but I hear nothing. I try and speak 'Im tripping so hard' but he laughs and keeps going. I start to fade out again and I come back to reality after what seems about an hour. During this time I was informed that we had taken my car back to his house, gotten in MYKs truck, and gone back to 7-11. So when I snap back into it, Im standing around some new friends smoking a cigarette, no clue how that happened, but it was. I feel a little tired of standing so I start floating (not literally, but thats how it felt to walk) over to the sidewalk and I guess everyone follows me. At this point Im fading out into tussin space again but I was told that I was walking around happily, also looking very wierd, and talking to everyone about random things. I have no recallection of this. I feel myself floating around what seems to be a void of hallucinations and stars when suddenly I feel someone poking me. Then a face forms into my vision and Im sitting back on the sidewalk and someone is trying to talk to me. I look at them, look back up at the sky, (Im guessing at that time thats where I thought I was before and wanted to go back) reach my hand up and try to grab the stars that are somehow flying around like a game of chase in the sky and I feel myself get tugged up into the sky. I am completely unaware I have gone anywhere, floating around grabbing stars in my hand thinking, 'This was always here along. this is part of our conciousness that we dont unlock in our normal state of mind. It takes a shamanic amount of DXM and concentration to reach this place and I just get this feeling that Ive reached the outer plateau, and I am amazed. I just enjoy being in this realm like place.",
  "Next thing I know Im back in MYKs truck and I can hear him now sort of, in a echoing blur telling me that my mom has been calling and wants me to go home. He later told me that he had given me a flashlight to dilate my pupils and that I had put it in my mouth and looked in the mirror. Now were at MYKs, and I tell him Im ok to go home (dont know how that would have worked) and I get in my car. Some other kid is sitting there next to me (I later realized this was a friend that was gonna help me get home) and my mom pulls up. I dont really connect that Im in trouble, or who she is for that fact. She comes up to the window and Im confused. I dont know whats going on or why she is here, or how I got in my car. She gets me out of the car, and I seem to float to her car and get in. I was later told I got out and stumbled out of my car, stood there in the middle of the road, looked confused, and my mom dragged me to her car. The whole way home I was confused and not all there looking at my mom yelling at me, but I cant hear her.",
  "This experience both compels me and interests me. I wonder if I can ever get back to the place that I was that night, but at the same time, I also remember that most of my trips have been different each time, so is unlikely. Ive heard of another person who says they reached the 5th plateau and didnt like it, Im not sure what their situation was. maybe I was just in the right mindset to handle it because I didnt realize what was going on outside of me (reality), or that Im just expirienced enough that I knew what I was doing. I think I will try and reach sigma again, in the meantime, Im saving money for a good amount of DXM."
 ],
 "erowid": {
  "id": "44492",
  "citation": " r e d h e a v e n. \"The Fifth Plateau: experience with DXM (ID 44492)\". Erowid.org. Apr 27, 2012. erowid.org/exp/44492",
  "substance": "DXM",
  "views": "9042"
 }
}
