{
 "title": "Lessons from the Universe",
 "author": "Erica.Smerica",
 "citation": " Erica.Smerica. \"Lessons from the Universe: experience with 4-Acetoxy-DET & Ketamine (ID 16230)\". Erowid.org. Jul 23, 2002. erowid.org/exp/16230",
 "substance": "4-Acetoxy-DET & Ketamine",
 "bodyweight": "109 lb",
 "header": [
  "DOSE: T+ 0:00",
  "18 mg",
  "oral",
  "4-Acetoxy-DET",
  " T+ 1:00",
  "120 mg",
  "IM",
  "Ketamine"
 ],
 "report": "<p>It was Thursday, and I was visiting my old friend, the UFO scientist.  We were getting pretty metaphysical today, discussing the philosophical intricacies of existence and reality.  Being in his presence is very electric, very universal and psychic.  Upon leaving, I decided that the planned voyage into the realm of the unknown, which was scheduled to occur over the weekend, would now happen tonight.</p><p>I returned home and discussed my interesting visit with my partner (M), and before I got the chance, he asked if I would like to take our journey tonight, rather than waiting until the weekendso we began to prepare the material and our environment.  M has this pre-trip ritual that he likes to go through, and I must say, I enjoy the calming he brings to me as well.  He lights incense or a bundle of sage, and walks about the house in a meditative fashion. Typically, while he's preparing the house and himself, I sit quietly and prepare myself.  There isn't a much one can do to prepare for a trip without causing expectations to arise, so I meditate and smile and attempt to let go of thought completely. </p><p>A bit hesitant at first, our best friend (J) made the decision to join us; so M prepared 3 capsules of 4-AcO-DET.  J took 14 mg, as it was his first experience with this substance, and we each took 18 mg.  I had experienced 4-AcO-DET three times prior to today, and am very comfortable and happy with this material, and with psychedelic experiences in general.  I find this particular material to have no mind overload, no mental interferece of thought, no anxiety, and absolutely no body load.  I have also noticed that 4-AcO-DET is a good one to experience in nature; it typically lasts for only 3 hours, with some effects only slightly lingering still at the 4 point, and is quite non-invasive when taken in lower dosages (14mg-18mg).  Many people seem to compare this material with mushrooms; I think all psychedelics have their own identity, but I can definitely say 4-AcO-DET is more mushroom-like than LSD-like for me.  It was 7:45pm when we each ingested our capsule, and then out we went for a nice evening stroll in our sleepy little mountain town.</p><p>At 8:00pm, I was already noticing some of the effects; my body was beginning to feel warm and movement produced nice visual tracers.  On our walk, I noticed the brilliant colors of nature, the luminous hues of green Earth, blue sky and red sunset.  The walk seemed effortless, and purely enjoyable.  I was with my partner, my love, and our best friend, and nothing could have been better.  The connection that the three of us have is very unique and very strong, beyond my ability to express in words.</p><p>We arrived back home at 8:40, and began to prepare the Ketamine.  J was kind enough to be our keeper and join us only in spirit.  M and myself each took 120 mg IM.  Although I am familiar with this dosage of Ketamine, because I had not yet mixed the two compounds together I had no expectations of what the experience would hold.  We selected some music to guide us, DJ Cheb i Sabbah, which is an interesting union between both transcendental and electronic science intertwined with ancient ragas.  Personally, I believe that the music you select is one of the most important aspects to guiding the direction of a trip.  That is, the music can take you to specific places, but should not interfere with the mind in such a way as to produce thought.</p><p>The Ketamine was injected at around 8:50, just at the height of the 4-AcO-DET peak, maybe at a +2.5 on the Shulgin scale.  Only 10 minutes later, I was entering a land of enchantment.  My trip began in a familiar space, that is, almost exactly where my last very powerful Ketamine trip had ended.  I was greeted back by familiar beings, who existed only as energy in the form of light.  I was being taught and rewarded with beautiful strings of music for each lesson that I learned completely.</p><p>I can only describe the lessons as philosophical eastern-type proverbs of good living.  The teachers were both kind and giving in their teachings, passing on ancient knowledge in such a way that I could comprehend and take in the entire lesson without adding thought.  Both J and M were experiencing the same thing, as we discussed the events after we came back to our bodies.  At one point, the energies were providing quite a fantastic light show for us all, dancing around us and displaying a most beautiful show of color, shape, and movement.  In fact, at one point M quite gratifyingly remarked that he hadn't paid for such an incredible show, and I remember giggling ecstatically with thanks.</p><p>I recall hearing the music and not realizing that it was a CD, or that we were lying in our bedroom.  I was completely unaware of my human body and existed not as Erica, but as an energy on which the universe relied.  In my transformed state of light, colorless light, I felt the presence of many other energies, including M's, and many old energies who seemed happy to reunite with me.  It seemed as though we were gathering in a timeless space, black like the moonless sky, and infinitely large like the universe, and we were gathering to witness something most profound.</p><p>I must preface what occurred next with an explanation of the recent inquiries I have been making in relation to understanding the universe, as I know it, which directly preceded my trip today.  Specifically, I have been very interested in understanding the birth of our universe, and how it is that we came into this existence, when it was that time, as we know it, came to be.  My readings have led me to combine the sciences, especially physics, and the corpus of disciplines that make up cognitive science (philosophy, psychology, linguistics, computer science, engineering, and education) with eastern philosophy and religion.  Learning, for me, tends to immediately become biased by the limits of human perception.  That is, I have difficulties with letting go of the desire to form concepts and labels, which has hindered me in my studies and meditation.  Rather than simply looking and being, paying attention with an open mind, I find myself seeking answers in a goal directed way.</p><p>What happened next is literally the most spectacular experience that I have ever been so fortunate to be witness to.  In the blackness of infinity, I witnessed the union of two energies, M's and mine.  We were, again, joined by all of the energies of the universe, and we all existed as white light.  I was a particle, being united with my anti-particle, and when our streams of white light collided, we were all witness to the birth of a universe, a new existence, and we were all very happy.  I suppose in some sorts, it was like the Big Bang, energies colliding and causing such disruption that existence was changed, and time began.  Our light was now white, with hints of soft blues and yellows, and was glowing much stronger than it had before.  The universe seemed to be unfolding as it should, everything was in its right place, and I felt an infinite love for all universal energies.</p><p>By now, the Ketamine was beginning to let go of me and I was returning to my body, which was lying next to M's on our bed.  One nitrous balloon, taken in by M, took me right back to the kind energy beings. I can't say that I felt overwhelmed by the vast amount of information that I had received, but because I was now slightly aware of my body I felt as though I needed to integrate what I had just learned and experienced into my mortal life here.  Therefore, rather than taking in more lessons, I just existed with them in pure bliss for several timeless moments in a world unclouded by thought.</p><p>I feel surprisingly good at 10:30, when I become fully aware of my body and environment again.  Although J didn't play an integral part in much of my experience, I felt his presence the entire time.  We all discussed our experiences, and as usual, we were all in the same place together.  In fact, although J didn't indulge in Ketamine on this particular evening, he was still experiencing and existing in our realm just as if he had.</p><p>For me, this trip has reinforced my both personal beliefs and the progress as to the course of my studies.  I have the highest respect for all psychedelics, especially Ketamine, and feel so very fortunate to have been given the opportunity to apply these useful tools to my own spiritual development and enrichment.</p><p>It took me a couple of days to fully integrate what I had learned into my daily life.  In fact, to say that I have achieved full integration and understanding would be a bit misleading, but I can at least describe where this trip has left me in relation to my course of study.  In my trip, I got a glimpse of how it was that the concept of time, as I know it, actually began.</p><p>Billions of years ago, the molecules that currently make up my human body existed only in the cosmos.  I was once simple energy, existing only in the form of light.  I came to understand that I have always existed, and I will always exist in some form or another.  I have never been one to call myself religious, per se; I prefer to use the term spiritual.  This is because I have never found one particular religious discipline that fits all of my personal beliefs; maybe it's a simple case of semantics. </p><p>Before this trip, if I were questioned about my religion I would usually classify myself as a Buddhist, only because my beliefs are very similar to what Buddhists believe, with one major exception.  I never really felt comfortable calling myself a Buddhist because I don't believe in Nirvana.  In fact, the idea of living this life in such a goal directed way, as to attain enlightenment and to be direct to Heaven or Nirvana, seemed counterintuitive.  That is, living in the here and now is not done in order to achieve something in the future.  By living in this goal directed way - living in hopes of reaching Heaven or Nirvana - one is contradicting the real teachings of Buddha or God.  THIS is Nirvana, THIS is Heaven, we are living it now, and we will continue to live it after our human bodies no longer exist.</p><p>I do not do goodwill now in hopes of receiving something good in the future; I do good only for the sake of good.  It is all a bit overwhelming, I must admit.  Now, I must practice and be mindful of the gifts that I have been given.</p>",
 "year": "2002",
 "id": "16230",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-07-23T07:00:00.000Z",
 "views": "20041",
 "dose": {}
}
