{
 "id": 16249,
 "title": "A Novel Euphoria",
 "date": {
  "submission": "2005-07-11T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "enquirewithin",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  },
  {
   "time": "0:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "bk-MBDB"
  },
  {
   "time": "1:23",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "bk-MBDB"
  },
  {
   "time": "6:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam"
  }
 ],
 "report": [
  "Set: mentally relaxed, apprehensive that the material might be dysphoric.",
  "Setting: subject relaxed at home with a friend present",
  "Subject has previous experience with psychoactives. He is familiar with MDMA and Methylone. He had had an experience with methylone two weeks previously, which could have affected his tolerance and had taken 100 mg 5-HTP earlier that day.",
  "Summary",
  "Very satisfying material. Empathic, tactile, euphoric. Has similarities with methylone and MDMA, but has a very unique character. It may be more challenging that the MDMA or methylone, that one may have to consciously channel energy rather than feel positive automatically. Quite stimulating. Some appetite suppression. No real visual effects, but some intensification, shifting visuals are obtained when cannabis is added.",
  "Dosage: probably about 100 - 200 mg (stronger than methylone)",
  "Duration: 3-4 hours (residual stimulating effects 3-4 hours more?)",
  "21: 07 pm. The subject took 150 mg mebylone orally in water. The material tasted bitter, somewhat like methylone.",
  "21: 30. He felt alerts after only seven minutes. After 10 minutes reported methylone-type surges of energy and feeling very euphoric. Music was intense and emotional, almost felt physically.",
  "21: 40 He reported tingling in his fingers, lower arms and behind the ears. His breathing was shallow. He was at a 3+++, barely able to speak. Smoking some marijuana deepened and intensified the state.",
  "21: 47 A peak was reached for about half an hour smoothly descending to a 2++ after about an hour. The subject experienced a very special state. His hands were shaking internally with energy, which spread to other parts of his body. He felt slightly alarmed. This was not expected. He felt that if he did not channel the energy it would not be positive. He focused the energy into a visualization of the heart chakra. The focused energy resulted in a novel euphoria. At that time he would not have wanted to take more but thought he had taken slightly too much. At one point he gasped: I feel f*** amazing.",
  "22: 30 A speedy phase is entered, all rapid enthusiastic thoughts and empathy. A 50mg booster is taken.",
  "He looks at his friend and understands his unhappiness in his marriage without the need for much verbal communication.",
  "He said: There is only here and now. Nothing matters but here and now. Life can be so light, but sometimes its so heavy. His friend insufflates some ketamine and is happy and apparently resolves some of his internal conflicts.",
  "23: 00 Euphoria and stimulation still felt (although diminishing), although has little desire to move. He drifts off into internal fantasies.",
  "23: 45 Some crashing experienced. The main effects of the material are gone.",
  "00: 25 Residual stimulating still present.",
  "03:00  04: 00 Subject slept with the aid of 10 mg valium.",
  "Next day: slight hangover and lethargy, diminished appetite.",
  "The subject expresses a desire to repeat this experiment as soon as possible. Synergy with methylone and perhaps ethylone are expected."
 ],
 "erowid": {
  "id": "44549",
  "citation": " enquirewithin. \"A Novel Euphoria: experience with bk-MBDB (ID 44549)\". Erowid.org. Jul 11, 2005. erowid.org/exp/44549",
  "substance": "bk-MBDB",
  "views": "56417"
 }
}
