{
 "id": 16244,
 "title": "One More Night",
 "date": {
  "submission": "2005-11-10T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "LaBlue",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.0",
    "quantity": "2.0"
   },
   "administration": "smoked",
   "substance": "Lactuca",
   "form": "dried",
   "specific": "L. virosa"
  }
 ],
 "report": [
  "I want to start off this report with a quote. 'To fear it, is to repect it.' I fear all herbs and I am cautious about them all.",
  "Mind set: A little stressed from the day and excited about my prospect of finding a local herb shop and the thoughts of a continued supply of herbs to experiment with.",
  "Time frame: it was at 22:00, I got done eating 4 slices of pizzahut and a chaser of cranberry juice. And watching Iron Monkey and chatting online with my sister.",
  "Preparation: I removed all the stems from herb and hand crushed it so I can better use it with zigzags (I also always use filters).",
  "1.Smoke: during the first joint I noticed that the smoke was thicker then what I'm use to and I was amazed that I was able to completely inhale it without difficulty *is it possible the herb has a numbing effect to the throat?*.",
  "1.Effects: no noticeable effects except the possible numbness of the throat. I expected the filter and saw that is was dark brown... Much darker then a cig filter after use.",
  "2. Smoke: the second joint held some effects. A very slight body numbness and a tingling feeling around the face (feels like it was coming from the third eye). A slight desire to lay down. But complete control of the body and mind was still there. The effects lasted for 10 minutes and afterwards I continued on in my normal night life (but for safety's sake I refrain from drinking and using other herbs and drugs that night). I went to sleep and stayed a sleep until my alarm clock woked me (normally I'll wake up a few times before my wake up call)."
 ],
 "erowid": {
  "id": "44528",
  "citation": " LaBlue. \"One More Night: experience with Lactuca spp. (ID 44528)\". Erowid.org. Nov 10, 2005. erowid.org/exp/44528",
  "substance": "Lactuca spp.",
  "views": "17687"
 }
}
