{
 "title": "One More Hit, One More Chance",
 "author": "Crack",
 "citation": " Crack. \"One More Hit, One More Chance: experience with Crack Cocaine (ID 16250)\". Erowid.org. Jul 24, 2002. erowid.org/exp/16250",
 "substance": "Crack Cocaine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Crack",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>All along I thought nothing could ever happen to me, but I was wrong.  I was out of high school and going to college, working and partying on the side. I had done other drugs before like weed, coke and x, but this time I wanted to try crack.  I did it with one of my ex-boyfriends who was a previous crackhead but had quit and bought quantities from his friend.</p><p>At first it was small amounts like $20 or $30 worth then it got to $100 a day. I started skipping college first to go get high, then work, finally I wouldn't even come home for days. I didn't know myself anymore and neither did my family.  This went on for months, I would get mood swings when I didn't have any and I started pawning my things, even my sisters jewlery.  We would go to hotel rooms to get fucked up and I remember crying every morning when the crack would finish.</p><p>I  would try to blame these feeling of depression on my family and myself and I didn't give a damn about anyone.  All I wanted was to do some rock and die if I had to.  I began to isolate myself from family and friends that cared about me and didn't let anyone know about my problem.  Anywhere we would smoke crack I would feel paranoia and my heart would race I felt like someone was out to get me or that someone was gonna catch me smoking.  I dropped alot of weight because I wouldn't eat.  I remember sleeping at 7 in the morning waking up at 3 or 4 P.M. taking a shower and then buying more crack and starting my same routine each day.</p><p>Now I think of all the time I wasted and the trust that was lost.   I wouldn't have stopped if it wasn't for my oldest sister who went to get me.  I had to move to another town and start my life again with no friends or nothing.  Sometimes I think of going back to my hometown but the thought of crack hurts my chest and I can't take the chance of starting that shit again. I feel like I still want it sometimes, just one more hit on the coke can, one more inhalation of rock.  I can't forget it, but I try to take one more chance in living my life and erase the past.</p>",
 "year": "2002",
 "id": "16250",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-07-24T07:00:00.000Z",
 "views": "28411"
}
