{
 "title": "Just a Nice Day at the Beach",
 "author": "Erica.Smerica",
 "citation": " Erica.Smerica. \"Just a Nice Day at the Beach: experience with 2C-I (ID 16267)\". Erowid.org. Jul 24, 2002. erowid.org/exp/16267",
 "substance": "2C-I",
 "bodyweight": "109 lb",
 "header": [
  "DOSE:",
  "14 mg",
  "oral",
  "2C-I"
 ],
 "report": "<p>June 2002</p><p>We were on vacation, my partner and I, camping in California in a state park that overlooked Stinson Beach.  That morning, we decided to stay in the area as we had been driving back and forth to San Francisco nearly every day.  Since there wasn't much to do in the area besides hang out on the beach, we decided to put a sparkle on the day by taking a small dose of one of my favorite materials, 2C-I.</p><p>What can I say about 2C-I?  Well for me, it provides very nice visuals, isn't mentally overwhelming at the low doses that I have tried, and seems to be good for providing some introspective thought.  Although it doesn't make me nearly as nauseous as its propylthio cousin, 2C-T-7, I definitely prefer to take it on an empty stomach.  This morning, however, we had a light breakfast to prepare for the 4.5-mile hike down to the beach - granola and black tea.  We also planned ahead and drank plenty of water, as we both seem to be prone to getting a slight headache with this material.</p><p>We each ingested our capsule, smoked a bit of pot, and headed for the hiking trail.  The hike down was quite nice and relaxing.  I felt a slight bit of nausea, and was glad that I hadn't eat more than I did for breakfast, although I never actually felt sick enough to make myself vomit.  Roughly 30 minutes into the hike, I began to notice some very nice visuals, and the forest that we had walked through the day before seemed much more colorful on this occasion.  I also felt incredibly alert and alive, and the walk seemed effortless.</p><p>By the time we finally made it down, nearly 1.5 hours later, the sparkle was definitely glimmering on the day.  We took what was supposed to be a little rest on the beach, which actually turned into our entire day.  We must have sat in the sand for 3 or 4 hours, watching the people play and the ocean waves rush to the shore.  I remember one person in particular, a transient-looking fellow, who seemed to be quite intoxicated.  He was carrying around a portable radio, listening to some classic rock, and was dancing wildly about the beach.  It seemed for him that where there was music, there was also a party.  We both got quite a laugh at the whole event.</p><p>Sunset seemed near, and we thought we should probably begin the ascent back to our campsite, seeing as we estimated it would take us about twice as long to go up as it did to get down.  The hike was exhausting, to say the least; after having sat in the sun all day, hiking up a vertical cliff was the last thing I wanted to be doing.  I must admit though, the lasting visual effects and marijuana that M had remembered to bring made it much more enjoyable, as did the frequent breaks we took to watch life in the forest.  It seemed as though it took much less time than it actually did; I suppose the altered perception of time was working in our favor for a change.</p><p>When we finally returned to our site, maybe 7-8 hours after ingestion, only some slight visual effects were still prominent, namely the colors of nature seemed a bit brighter and movement created nice tracers.  We built a roaring fire that evening, and had actually remembered to stop in the local beach market to pick up some marshmallows before our hike back up.  The end to the day could not have been more perfect; we sat in front of our fire all evening chatting and watching the stars, simply absorbing the events of the day before finally retiring to our tent for the evening.</p>",
 "year": "2002",
 "id": "16267",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-07-24T07:00:00.000Z",
 "views": "8901",
 "dose": {}
}
