{
 "id": 16289,
 "title": "Lowering My IQ to 70",
 "date": {
  "submission": "2006-12-22T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Datura Metel Tea",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 flowers",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ],
 "report": [
  "The other day I decided to go to my neighbors house and pick a few Datura Metel flowers.  They are a pretty long flower, ranging from 6-8 inches on this particular plant.  These were the double purple variety.  I have eaten these raw / uncooked before, anywhere from 1-4 at a time.  Every time I have done it, I have gotten _horrible_ cotton mouth, extremely dilated pupils (enough so I can't even read up close for a few days), and a very heavy feeling that makes it quite difficult to walk / talk.  Out of the 5 times I've done it, about 3 I can actually remember talking to objects / people who aren't there.  Basically the only way I can describe this drug is insane delerium, constantly pacing my house looking for something, just not knowing what it is.  Anyways, this time I decided to boil 3 Datura flowers, so I got a pot about 12 inches in diameter, filled it with a little less than half a gallon of water, and boiled it on high for about 15 minutes, then let it simmer on medium-low for another 15 minutes.  After it was done I put the water through a metal strainer and let it cool a bit.  I noticed the water was now a deep green / brown tint, and smelled somewhat similar to regular tea.  The flowers, or now they were mush that caught in the strainer, I ate too.  I added honey and sugar to the tea, and drank about 3-4 glasses over the course of an hour.  It was quite drinkable, and it wasn't unpleasent at all.  I started noticing the effects within 15 minutes of drinking the first glass, and by the time I was done with everything I definately felt a strong body high.  Colors were more vivid, most likely because my pupils were starting to dilate.  I also just noticed increasing interest in non-interesting things, like staring at myself in the mirror and just zoning out / pacing the house.  I eventually started getting that familiar heavy feeling, which I truly dislike and I don't know why I keep playing with these flowers.  I also get the feeling that I cannot think straight or talk straight, and it is very frustrating.  I decided to lay down, and I was having very vivid lucid dreams, and I heard a lot of things.  Mostly voices, but sometimes animals, too.  I can't recall much of those 4-5 hours, it seems like they just dissapeared.  This is common with Datura; I am lucky to remember 1/4th of the experience.  I can't recall talking to any inanimate objects / people that weren't there, though.  The only strong feeling that stood out during this trip was that horrible heavy feeling.  I am sure more interesting things happened, and I just can't remember them.  Anyways, I wouldn't recommend Datura Metel -- it isn't a social drug, not to mention it is very hard on the mind.  It leaves you quite confused the next day, and possibly longer.  It doesn't trigger any sort of euphoria or mood elevation.  The best way I can describe it is lowering your IQ to about 70 and constantly jumping in and out of dream-like states."
 ],
 "erowid": {
  "id": "44689",
  "citation": " Datura Metel Tea. \"Lowering My IQ to 70: experience with Datura Metel (ID 44689)\". Erowid.org. Dec 22, 2006. erowid.org/exp/44689",
  "substance": "Datura Metel",
  "views": "8530"
 }
}
