{
 "id": 16291,
 "title": "Boredom and Insomnia",
 "date": {
  "submission": "2007-04-24T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Nakor",
  "gender": "Male",
  "weight": 109
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  },
  {
   "time": "0:35",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  }
 ],
 "report": [
  "BACKGROUND AND MISC INFO",
  "I was somewhat bored tonight.  Lately I've been doing A LOT of research on legal drugs and have chosen a few that I'm interested in trying.  Today I ordered some of these things, Blue Lotus, Prickly Poppy, Salvia leaves, and it came with some free amanita muscaria mushrooms.  I wanted Kola Nuts and Kratom as well but the store was out of them.  It will however take a while for this order to make it to my house so I was doing some more research for fun. Yes I'm a bit of a geek. Fun for me is programming, studying, or reading. I also love video games, movies, and music however.  So, while I was studying I came across something I thought was a bit odd.",
  "Catnip Tea.",
  "Now normally I'm an extremely cautious drug user.  I generally don't touch anything I don't at least know a good bit about, and I don't bloody well care what anyone thinks of me for it.  I've always been strong minded and somewhat stubborn lol.  I am very high strung I guess you could say and powerful hallucinagens are often not a good idea for me.  I used to love shroomz...but after a few really bad comedowns I have pretty well written them off.",
  "Despite my cautious nature however I decided to try this Catnip Tea out. What the hell right?  From what I had read it would mildly sedate you when drunk as a tea, but there aren't many reports from people having done this.  I love sedatives unfortunately and the reason I have been researching legal drugs is because I'm a bit of a Percoset addict and if I had alternatives it could help me from constantly escalating.",
  "PROCEDURE AND EVENTS",
  "(+0)",
  "I started out by putting the remainder of the Catnip that we had from our old cat into this tea steeper thing that I found in a drawer (2 teaspoons worth.)  I boiled some water and poured it in the mug with the steeper and I let it sit for 20 mins.  When it was done I added some cherry syrup and some sugar for flavour.",
  "I sat down on my bed and drank the tea fairly quickly...under a minute.  (+1)",
  "(+6)",
  "I have been reading articles on Nutmeg, another legal drug that amuses me, but does not in the least interest me.  I am beginning to feel a very slight difference in my body at this point in time.  A slight calm feeling accompanied by an extra bit of indolence.",
  "(+12)",
  "I decide to make another tea out of the same steeper load (I don't have anymore anyway).  I get up and notice my legs feel a bit heavy, but not uncomfortable.  I feel pretty good in fact.  Not really stoned as I would normally define it, but good and fairly relaxed.  I make the tea and then sit down while it steeps for 20 mins.",
  "(+35)",
  "By this time I do not really feel any of the high at all.  I still feel a bit relaxed however.  I get up to add the syrup and sugar to the new tea.  While up I notice moderate chest pains...but I can not tell you whether it was resulting from the tea or not, as chest pains are a bit normal for me, even though I quit smoking cigs years ago and VERY rarely smoke weed anymore.  Ignoring the chest pains I touch up the tea and sit down.  I drink it over a period of maybe 5 minutes.",
  "(+40)",
  "The high has essentially come back to the peak strength (which isn't very high).  My legs are again heavy and I feel comfortable.  In fact I feel possibly more comfortable than before.  I notice that while I am as tired as I normally am at this time of my sleep cycle (abnormally rampant and chaotic as that is), I do not feel the anxious jumpy energy that is normally accompanied with the tiredness.  This is a nice change since that anxious feeling sucks.",
  "(+50)",
  "I am semi-normal at this point.  I still feel pretty relaxed however.  I think I can sleep, which is not normal for me.  The chest pains have returned a bit, which means one of two things (or possibly a completely unknown I guess).  Either the chest pains have been there for the whole last hour and the tea just made me not notice them when it was peaked, or the chest pains are caused by the tea.  My guess is that they were there the whole time, as the tea does certainly seem to possess some sedative qualities.",
  "CONCLUSION",
  "If I ever make this tea again, it will be because I really enjoyed the flavour.  It worked very well with the cherry syrup and the sugar.  This is cool because I hate Coffee and almost all Teas.  The other qualities of it are ok but not really worth the trouble."
 ],
 "erowid": {
  "id": "44692",
  "citation": " Nakor. \"Boredom and Insomnia: experience with Catnip  (ID 44692)\". Erowid.org. Apr 24, 2007. erowid.org/exp/44692",
  "substance": "Catnip ",
  "views": "36522"
 }
}
