{
 "title": "Herbal-E Stopped My Trip",
 "author": "Ment",
 "citation": " Ment. \"Herbal-E Stopped My Trip: experience with Mushrooms, Ephedrine, Gingko biloba, Ginseng & Kola (ID 16294)\". Erowid.org. Mar 30, 2007. erowid.org/exp/16294",
 "substance": "Mushrooms, Ephedrine, Gingko biloba, Ginseng & Kola",
 "bodyweight": "55 kg",
 "header": [
  "DOSE:",
  "2 tablets",
  "oral",
  "Various",
  "(pill / tablet)",
  "",
  "1.0 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>After reading some articles on herbal-E, I've decided to conduct some experiments with it. I've used 200mgr of Ephedrine in pills and two pills of a dietary supplement called 'Brain Booster', which contained Gingko Biloba, Siberian Ginseng, Gotu Kola and Bee Polen. It worked quite allright, but that's not the issue. Some time later at night, me and friend have got 2 grams of dried shrooms, which I must say were very potent, because the other day I've consumed 1gr and was triping for 7 hours just 20 minutes past after eating.</p><p>So, we ate the shrooms and went to a park. We were hanging around over there for 3 hours or so with no noticeble mushroom effect. Then in deep sorrow I went home to have some sleep. After approximatly 1 hour of sleep, I woke and realized that my room is full of hallucinations, but the feeling was that the trip will soon end. So I went back to sleep. In other words, our shroom session sucked. And the cause of it was most probably the mixture of herbs, because we did not use anything out of ordinary that day except for herbal-E. Beware of this, and have a nice trip!</p>",
 "year": "2002",
 "id": "16294",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-30T07:00:00.000Z",
 "views": "7029",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Various",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
