{
 "id": 16293,
 "title": "A Great Fitness Tool If You Are Not Stupid",
 "date": {
  "submission": "2007-01-24T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "pimpdog",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "25",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "In High School, I played offensive line for the football team and was severely overweight.  After football was over I decided I didn't need to be fat anymore so I got into weight lifting and running.  I was introduced to an ECA stack (ephedrine, caffeine, asprine,) by a clerk at a local supplement store.  I had heard all the horror stories contributed to taking ephedrine, but decided to by some under the counter from the man, desperate to lose my excess weight.  The first time I took it, it was before I went to my weight lifting class.  I took 25 mg. of ephedrine, and 200 mg. caffeine, and I felt like a million bucks.  I had never had more energy in my life.  The first couple times I took it, I got jittery and restless, but I was in a great mood.  My workouts had gotten ten times more intense after I discovered ephedrine. ",
  "I started taking 25 mg. of ephedrine and 200 mg. of caffeine three times a day.  After a while my body got immune to stimulant effects of the e.c. stack, so the jitters went away, but I still got the positive affects of a lower appetite and increased metabolism.  With the help of ephedrine and hard work I have up to date almost 90 lbs.  Ephedrine, when used responsibly is a great aid in weight loss and could help thousands of people get healthy.  But its people that have used ephedrine irresponsibly, that have made this wonderful supplement off limits to the rest of the general public. ",
  "The good news however is that the supreme court repealed the ephedra ban and we might even be seeing it being sold in stores again.  So people who use it irresponsibly, stop! Don't ruin it for people who really need it."
 ],
 "erowid": {
  "id": "44701",
  "citation": " pimpdog. \"A Great Fitness Tool If You Are Not Stupid: experience with Ephedrine & Caffeine (ID 44701)\". Erowid.org. Jan 24, 2007. erowid.org/exp/44701",
  "substance": "Ephedrine & Caffeine",
  "views": "13954"
 }
}
