{
 "id": 16298,
 "title": "Picking Sweat Out of My Skin",
 "date": {
  "submission": "2007-06-26T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "David",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "My experience with Adderall was a truly horrific one.  It all started out about 10 months ago when I went to a psychiatrist soley for the purpose of getting a script for speed.  Psychiatrists are real assholes and this guy wrote out the script on the first visit, even after I told him all about my drug problem (I was using anything I got my hands on- pot, cocaine, alcohol, ice, acid, crack, anything). Anyways, I got the script for 30 10mg Adderalls and the guy tells me, 'Find a dose that's right for you.'  Yea, so I thought about 100mg a day was the right dose for me, he he. ",
  "Just like every other Adderall story, it started out great.  I had energy to do ANYTHING and not sleep for days, sometimes weeks.  I lost weight (thought that I looked better, but really looked like an Ethiopian) and gradually focused all of my efforts on finding drugs, specifically Adderall.  I was smoking pot, but only about 3-4 days out of  the week.  One time I bought a couple crack rocks and was already tweakin balls...man I tell you I thought I was gonna die! ",
  "So here I was, a high school student that lived in a very shitty motel, screwing crack-whores and taking enough Adderall to get probably 5 or 10 people high.  The best thing that Adderall did for me was make me into a 'picker.'  I would go for hours upon hours basically picking sweat out of my skin.  If you don't know what a picker is, it is someone who picks at their own skin(sometimes with tweezers, needles, pliers, etc.) thinking that there is either bugs, worms, shards of glass, or something else in their skin.  Amphetamine is great, I am scarred up on my chest, arms, face, and back from picking because I was tweaking and ran out of a job to do. ",
  "The last time I tweaked, I got my month prescription(3 grams) and popped all of those suckers in about a day and a half.  I did some really sick things that you really don't need to hear. ",
  "Luckily I had people that cared about me, and got me into a treatment center for addiction.  Even in rehab, people avoided me because I looked like a pizza.  I haven't used anything in 2 months and have never felt better.  I was heavily addicted to drugs for 4 years, starting when I was 14.  I was sick and tired of being sick and tired.  I was living in my own personal hell. If anyone feels like I did, there is a group called Narcotics Anonymous that helped me and is in just about every city in the US. I never have to use again if I don't want to."
 ],
 "erowid": {
  "id": "44731",
  "citation": " David. \"Picking Sweat Out of My Skin: experience with Amphetamines (Adderall) (ID 44731)\". Erowid.org. Jun 26, 2007. erowid.org/exp/44731",
  "substance": "Amphetamines (Adderall)",
  "views": "8070"
 }
}
