{
 "title": "K is for Kitties",
 "author": "Casey K-Hole",
 "citation": " Casey K-Hole. \"K is for Kitties: experience with Ketamine (ID 163)\". Erowid.org. Jul 30, 2001. erowid.org/exp/163",
 "substance": "Ketamine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "IM",
   "Ketamine",
   "(liquid)"
  ]
 ],
 "report": "<p>\nFirst and foremost, I would like to say that I don't usually tell people this. They tend to think I'm a little off my rocker if I do. First a little background information for you. I started doing 'Special K' back in 1993 at Rave parties. I would sniff a twenty or two when I was coming down from my Ecstasy. We liked it because it made you feel like you were peaking all over again. It was fun and the thing to do at the time.</p><p>Now the thing that I'm really writing this about is not how fucked up I used to get but a certain level it took me to. I really believe that when you are on 'K' you can communicate with other species, specifically CATS. I'm not saying that I had intelligent conversations with a cat. I believe that I communicated with them in ways that just aren't normal.</p><p>So with that in mind I will tell you why I believe this. I had gone to a party in Richmond at a friend's house. We decided to see what would happen if we pushed the limit with Ketamine. I had a pretty high tolerance so instead of the usual 150mg I loaded up three syringes full at 100mg's each. I had two of them and my friend had the other one. On the count of three we simultaneously injected all three into me. Two in my legs, one in my arm.</p><p>Now I'm not going to bore you with the initial feelings and the colors (which were great, by the way). I remember that I definitely wanted to go outside because of the weather. I ended up in your basic dirty, trash-filled back alley.</p><p>At this point I felt like I was dreaming, as though I was slipping in and out of reality. At the same time I also felt like I had control of the situation.</p><p>I saw a cat running at the end of the alley. I knelt down and called to it and I knew inside that it would come. It came directly to me. Now I know that this sounds completely normal. You are probably thinking that the cat must have been someone's pet. That is what I would probably think too. It isn't that odd for a cat to get lost from it's home. It could just look like an alley cat, dirty and hungry. But the thing is, other cats started approaching. I called all of them over to me and they came. All of them were loners. Quite honestly I really don't believe that five or six cats, that were lost from their homes, all lived in that alley together.</p><p>They were dirty, hungry, wild looking animals. If you don't know about alley cats, pretty much about 99.9% of the time, they run like bats out of hell at the sight of a human being.</p><p>I remember that I wanted to shield and protect them from their lives. I think that because of the Ketamine my mind was opened to a level of connection and understanding. I felt as though I could feel their fear and their pain and they could feel my empathy. I petted them and talked to them for how long I don't know.</p><p>My friend who was looking for me turned the corner and the cats disappeared into the hiding places they called home. At first I thought I must have hallucinated the whole thing because it was just to incredible. But thanks to my friend, I had an eye witness. He told me that he saw me sitting Indian style with a bunch of cats milling around me and he saw them take off when he got closer.</p><p>I remember that I was just in total awe. I felt so connected with a bigger picture. Also, it was like a dream come true. When I was a little girl I used to pretend that I could communicate with animals. It happened with the help of Ketamine.</p><p>When I tell people about this, they pretty much agree that it could happen, but don't really believe in it. My friend who found me believes in this higher level. Sometimes it's hard for me to believe that six alley cats came to me at one time, but it happened. It was not a dream.</p><p>Anyway, that was one of my many experiences on Ketamine. It was the best and by far the most memorable.</p>",
 "year": "2000",
 "id": "163",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-07-30T07:00:00.000Z",
 "views": "9439"
}
