{
 "title": "My Fake Existence",
 "author": "a_bored_guy",
 "citation": " a_bored_guy. \"My Fake Existence: experience with Salvia divinorum (ID 16300)\". Erowid.org. Jul 19, 2005. erowid.org/exp/16300",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2002",
   "16300",
   "Male",
   "",
   "Not Given",
   "Jul 19, 2005",
   "7997",
   " "
  ]
 ],
 "report": "<p>Allow me to preface by saying that none of my salvia experiences have been positive  this does not mean, though, that I am discouraged from future trials</p><p>I am a 23 year old male, who weighs approx 170 lbs. I do not think any physical measurements make any difference when it comes to this material, though. The first few times I tried salvia were with dried leaves and extract from the same company  these attempts yielded no result. When I purchased from a second shop I didnt realize that the first purchase was of dud material, and that made me go too far, I fear.</p><p>My first actual experience was with a 15x extract  big mistake. Not only that, but I took 2 huge tokes off a bong (I only did this out of skepticism, since my first three attempts failed), and this was done without a sitter (again, I didnt want to bother a friend, since it wasnt going to work). My twisted experience began about 15 seconds after the second toke on my way to my bed. It started with what seemed like an unzipping of reality  almost like a slash through my field of vision (violent) and another world was pulled around me. Weird part is that this new world looked exactly like the real one. I then blacked out and came to in my closet (about 20 feet away in another room) tearing it to shreds. I had this feeling of overwhelming terror, as if the only think I could do to put an end to whatever suffering I was going through was to end it all.</p><p>And then things started to make sense little by little as I came out of it. I looked around my room and saw that everything had been knocked over, broken, strewn across the room, and just basically trashed. I was also bleeding from several places  I assume from bumping into furniture. T+ 0 was at 12:00 am on a Friday night, and when I came out of it and realized where I was it was 2:30am. This drug is supposed to be a very short acting one  I obviously overdid it by far. I cant say that I got anything positive out of that evening at all, since I dont recall a single thing about the experience. But I do know that my body was active for the whole time  so what I really have is a memory gap and that scares the crap out of me. I am afraid that some day I might remember what it was that terrified me so.</p><p>I really wanted to know what I was missing from that experience, so I decided to do it again, but this time with less. With the 15x extract I also purchased a 5x extract  I figured that one small toke of that should be sufficient. This time I asked a friend of mine to serve as a sitter and he did so willingly. I put a very small amount of the 5x extract in my bong and took a very small toke. Within 10 seconds I was thrust back into that world of hell  I saw the saw slashing/unzipping of reality, and although I knew it was just the drug, and that reality wasnt going anywhere, it didnt help. I stood up, turned around and told my friend that it was going to be badand thats all I remember. In my mind I told him that, turned and went down to his basement where I knew it was a safer environment.</p><p>In reality, so it seems, I was ranting and raving for 20 minutes or so all around his house trying desperately to find a way out. He also said that I took a knife out of a drawer and attempted to slit my wrists before he grabbed the knife away from me (this supports my idea that I knew what I was doing at the time, but lost the memory after the fact). This time, though, I remembered more  it took me about 10 minutes to reach baseline, and for the first few I was half-in and half-out of it. I was certain my world was fake  that I was a poor psychotic who went mad years back, and that everything and everyone in my world was fakethe people actors, the environment a plywood set. I envisioned my world as a series of individual seconds strung together meticulously in order, but being built as we went. Someone messed up and the next scene of this fake life was never built  it was the end of the world, my life.</p><p>Now that I figured it all out they would have to explain it all to me. That was where the terror came from  the thought that when I went outside all the characters in my life would have to explain it to me, and that I was actually insane and since this method of treatment failed I would be confined to a mental hospital for the rest of my life. I dont know what happened during the 20 minutes or so I cant rememberbut that is what I gathered from the few minutes I do remember after the trip was coming to a close.</p><p>Salvia is not a recreational drug, I CAN tell you that. I helped me learn a lot about myself  not from the trip itself, but from the few days after the trip. Something in my head changed  and as a result the way I see the world and people around me changed. Please make sure to have a sitter  and also work your way up to the extract if leaves dont get you anywhere. Also realize that it could take up to a minute or two for a hit to register  be patient. You can always do more, but you cant go back once youve toked. Also, it has been my experience that buying from England yields MUCH better ethnobotanicals that the US, and there are many sites on the internet to purchase from  even abroad.</p><p>And to close  even after these experiences, these bad trips I am planning to try this stuff again. Except this time I will do it more slowly and with more respect for its power.</p>"
}
