{
 "id": 16302,
 "title": "In all Seriousness, This is a Dream",
 "date": {
  "submission": "2009-01-13T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tba",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "17"
   },
   "administration": "oral",
   "substance": "2C-E"
  }
 ],
 "report": [
  "I obtained 100mg of 2CE from a reputable source.  I took about 15mg-20mg, and what follows is my account of what happened:",
  "T-00:00 Decided to take a walk with the girlfriend.  Took 15-20mg 2CE before our walk began.",
  "T-00:30 Noticed slight tingling in my legs.  Maybe its actually aching in my legs turned to euphoric sensations.",
  "T-00:45 Tingling went from leg to leg.  Then, as the drug absorbed into my mind it shot through my veins into ever region of my body.  Felt tingling everywhere.  Felt a slight change in mind set as well, very euphoric; ecstasy-like.",
  "T-01:00 Still tingling all over.  Very euphoric.  Everything is good in life, though it may not be.",
  "T-01:30 Some visuals noted with my eyes closed, regular lsd patterns.",
  "T-02:00 Played some tetrinet and chatted online, concentration OK, typing fine.",
  "T-02:30 Saw what looked like eyes on my laptop screen.  My girlfriend is playing some music and its surreal.  Amazing.",
  "T-03:00 Screen changes from white to yellow and back again.  I decide to check out the back of my eye lids.  Closed my eyes and am bombarded by interesting patterns.  Not geometric patterns but more organic in nature.  Like vines intertwined in each other.  Feeling very good now.",
  "T-03:15 The patterns change into more distinct things, the one I remembered the most is two dragons, dancing around each other; morphing in and out of each other.",
  "T-04:00 Definitely peeking now.  A little body load; body feels heavy, and urging me to move about.  I was lying in bed and I felt the need to move my arms and legs.",
  "T-04:15 Questioning things.  Where do I end and where does the drug begin?  Where am *I*?  If I began cutting pieces of myself off I can still be me.  Legs, arms, various organs, still me.  Into my brain, where am *I*?  What is ME?",
  "T-05:00 Spent the last few minutes questioning and admiring patterns.",
  "T-05:30  Time to sleep.  Or maybe not.  Thrash about for the next 2 or 3 hours attempting to sleep.  Still getting visuals once I close my eyes.  Too tired to keep them open, so I return to the intense patterns.  Coming down slowly.",
  "T-8:00 Sudden drop off of effects.  Slight open eye visuals are left, with waving and moving of patterns.",
  "The next day I noticed a slight headache.  Took an aspirin and felt fine afterwards.  Otherwise a very intense, wonderful psychedelic."
 ],
 "erowid": {
  "id": "44745",
  "citation": " Tba. \"In all Seriousness, This is a Dream: experience with 2C-E (ID 44745)\". Erowid.org. Jan 13, 2009. erowid.org/exp/44745",
  "substance": "2C-E",
  "views": "2715"
 }
}
