{
 "id": 16313,
 "title": "Drifting Thoughts",
 "date": {
  "submission": "2007-11-28T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Everfrost",
  "gender": "Male",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:26",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>11:08pm  I take 200mg of caffeine with juice. At this time I am feeling slight tired due to the fullness of my day.",
  "11:24pm - My tiredness that I was feeling at the time of taking the caffeine is almost completely gone. I feel more alert and less lazy, I have more interest in everything, but these are not feeling I enjoy, they feel forced.",
  "11:36pm -  I feel very alert, my eyes are wide open. My heart beat has increased steadily and noticeably, as though I was jogging.",
  "11:48pm - I feel too awake and too stimulated in my head, my body isn't moving any faster than normal, and I dont notice any trouble keeping my hands steady like I thought I would. Things are a little bit brighter than normal; I have a slight head ache. My heart is beating stronger and faster, but at a steady pace.",
  "11:59pm - I feel like my muscles are about to explode with energy at any minute, my legs feel like they have a bunch of tension waiting to be released.",
  "12:48am, - Ive been filled with consistent endless energy. I feel restless, except when exerting energy. Still have a slight headache. I feel bit jittery still, not as much as before. Im able to relax a bit more compared to right after the caffeine kicked in",
  "12:57 - The tension in my legs has almost disappeared. My heart beat feels of a normal strength and speed now. Things aren't as bright as before, but they still are noticeably bright compared to normal. My headache is almost all gone. I dont feel as energetic as before, but still quite energetic. I usually tap my hands fingers and feet, since I drum, but since the caffeine has taken effect I find myself doing it almost twice as frequently as normal.",
  "1:15am - Slight/mild chest pain around my heart, peaking when heart beats.",
  "1:31am - My thoughts are racing in my head, but not from subject to subject, instead it feels like my brain is set on a faster speed which makes it harder to concentrate on one thought thoroughly. I can concentrate vaguely on the same thing, I have to think it over and over in my head to sort the thought out, although I stay on the same thought easily",
  "1:34am - Took 100mg Diphenhydramine, for sleep use to counteract the caffeine. 100mg being a very low dose of dip for me, even for sleep use. Started to be able to relax a lot more, something Im used to .doing through most of my days. I feel no noticeable muscle tension. My headache is gone. Slight muscle tension left in my legs. Very slight jitteriness is still present. Vivid sight has almost returned back to normal. My thoughts are still scattered while on the same subject. Music has been enjoyable to listen to the entire time, as well as TV. Talking to people has been difficult, in the way of establishing an emotional contact. I felt like I was talking to someone I didn't know, just typing words that didnt mean anything",
  "2:00am - Almost all of the effects of the caffeine have diminished. The diphen is start to make me feel sleepy and more relaxed. My muscle tension is all gone. My thoughts are much more controlled and more well thought out and fluid. Slight disassociation with senses when concentrating on one thing, and then moving around suddenly. Slight nausea, very, very slight dizziness, more sleepiness.",
  "2:47am - The dream like effects of the dip are coming into effect. It feels as if your energy that is normally distributed throughout your body is concentrated in your head. Everything is louder and feels more personal in terms of sensory functions. Every sense is move vivid and calming, nice to hear, feel, touch, smell and taste, but yet all of my senses are relaxed. It feels like the stage before I start to fall asleep, but also feels like the beginning of a dream state.</p>"
 ],
 "erowid": {
  "id": "44789",
  "citation": " Everfrost. \"Drifting Thoughts: experience with Caffeine & Diphenhydramine (ID 44789)\". Erowid.org. Nov 28, 2007. erowid.org/exp/44789",
  "substance": "Caffeine & Diphenhydramine",
  "views": "9640"
 }
}
