{
 "id": 16317,
 "title": "A Floating Trip",
 "date": {
  "submission": "2007-03-19T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "PhyschdlicDayTripper",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Zolpidem",
   "form": "pill/tablet"
  },
  {
   "time": "0:30",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "Recently I was in New York city visiting some cousins of mine. I had brought some mushrooms because I find that there is nothing better than tripping in the city. The chaos seems to enhance my trip audibly and visually.",
  "When I pulled out the sack of mushrooms my cousin told me of this sleeping pill he had been prescribed that had caused him to have hypnotic and physchedelic effects. I was skeptical but was willing to give it a try.  I took 10 mg of Ambien, the recommended dosage on the prescription bottle.  Within thirty minutes I could feel the effects.  A slight change in light and a resistance to movement, body tension, etc.",
  "The high was nice but not as intense as what I was looking for. So I decided to take out 5 good looking caps from my bag.  I quickly downed them, grabbed some water and set off for my days adventure.",
  "Within 1:00 my trip was in full force, but with some slight changes.  Normally when I trip I cannot sit still and often find myself pacing and talking incessantly. Instead this time i felt that my limbs were heavy, and often times found myself sitting instead of standing.",
  "I welcomed this feeling as sometimes the nervousness associated with tripping balls is unnerving.",
  "About 1:30 minutes I started to feel a floating sensation when I was walking.  I'm sure I looked retarded to anyone who saw me moon-walking through the park I had resigned to. The floaty feeling was actually quite strange because it didn't some from my head, but rather my stomach.  The feeling lasted about 2:00 hours.",
  "4:00 hours into my trip I started to feel the comedown. This was the only part of the experience that I did not enjoy.  Normally when I eat muchrooms the comedown is quite tame.  I smoke a bowl or two, try to sleep, or take a shower.  However because Ambien is a sedative it made me pass out into a harsh sleep. I had a few bizarre dreams and awoke about three hours later feeling drowsy and slightly nauseated. In all this experience was quite enjoyable."
 ],
 "erowid": {
  "id": "44797",
  "citation": " PhyschdlicDayTripper. \"A Floating Trip: experience with Mushrooms & Zolpidem (ID 44797)\". Erowid.org. Mar 19, 2007. erowid.org/exp/44797",
  "substance": "Mushrooms & Zolpidem",
  "views": "6489"
 }
}
