{
 "id": 16311,
 "title": "2 Minute Nightmare",
 "date": {
  "submission": "2008-09-29T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "KalvinKobra",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "I received my salvia on Friday, with no sitter present, I decided to smoke a minute pinch, not even a 1/10 of a gram.  Loaded my bong, took one big shot.  The smoke left no taste, but I do remember a distinct feeling of being pulled down.  I remember myself saying 'O.k., give me a minute.' I still have no idea why I said that out loud with no one home.  The minute I took in the smoke, I felt this big tug.  It was almost as if I was asking someone to let me put my bong down before we began.  Once I laid down on the bed, there was this distinct feeling of melting into the bed.  I literally saw my body becoming one with the bed.  This scared the living shit out of me.  I've used some psycho active drugs before, but this was just insane.  With most drugs there are usually some side effects, upset stomach, dizziness, something that lets me know I am high.  With this drug, there is none.  One minute I'm in my bed room, the next minute the entire bedroom is folding inward on me, and there is no one on this earth that can convince me that it is a hallucination.  Lucky for me, I only smoked a small amount, so it only lasted about a minute.  The real nightmare came 2 days later. ",
  "Sunday",
  "The night before, a friend of mine and I were suppose to try some serious doses, but he chickened out after I gave him one of my test hits.  He said he had seen enough and would stick with weed.  I decided to save mine for a better day.  The next day, I wake up in the morning and say 'Fuck this, I wanna see the true power of this stuff'.  God damn that had to be the dumbest idea I've ever came up with.  I loaded up about 2/10 g in my bong, sat down on my bed and inhaled.",
  "The sad thing about this story is that I have no recollection of what happened after that.  I do remember returning to consciousness though about 3 minutes later and realizing what I had done.  Although conscious, I was still heavily influenced by the salvia.  I remember panicking and wanting things to be the way they were again.  I knew I was on my bed although with eyes open I couldn't see a thing.  I tried to move, nothing.  It was as if someone had parked a truck on me.  I could not see or move.  I am not a religious person, but I began to pray and just asked god to help me through this because I could feel myself beginning to freak.",
  "About a minute later, my vision began to return.  I started recognizing my T.V., my shoes on my floor.  I remember seeing a cliff bar wrapper on the shelf next to my bed and being so happy.  For some reason seeing that cliff bar wrapper made me feel like it was almost over.  Even with my vision returning, still no movement.  Then, using all my strength, I managed to lift my arm, then the rest of my body.  I knew I would not be able to walk yet, so I just sat there as I was watching the world slowly (and I mean slowly) return to normal.  I have no idea what I saw when I was out, but it must have been something terrifying because I have never been so happy to be alive.",
  "When I finally got all my functions back (10 minutes after ingestion), I went outside and lit a cigarette.  While I was smoking, memories began coming back, like I had amnesia or something.  I remembered my girlfriend, I remembered that I played guitar, I remembered that I had beer in the fridge.  Just really stupid stuff.  The strange thing about it though was that all these simple things had special meaning to me now.  Something in that salvia gave me a reason to believe I would never be able to do these things again.  I ran and grabbed a beer and I swear it was the best beer I'd ever had.  Called my girlfriend, told her how much I love her.  I picked up my guitar and played through a few of my favorite songs.  I was amazed that I could play the guitar at all.  You'd think that after 7 years of religiously practicing, I would have gotten used to the fact that I could play, but at that moment it felt as if I had never touched it before and instantly knew how to play.  I just went around the house for about 45 minutes doing and enjoying what had once become a bore for me.",
  "To make a long story short, in the end, I think salvia made me appreciate life alot more.  I woke up this morning happy to be alive.  I probably won't ever do salvia again.  I like to have fun when I'm high and salvia is definately no 'high' or 'fun.'  It may provide teachings for all the weirdo shaman types, but for me it was horror.  That shit wasn't a hallucination, it was real, and I never want to feel that way again.  I suppose I was punished for not taking the drug seriously.  I seen enough though to know that a 'true' salvia experience is definately something I'm not interested in right now."
 ],
 "erowid": {
  "id": "44772",
  "citation": " KalvinKobra. \"2 Minute Nightmare: experience with Salvia divinroum (10x extract) (ID 44772)\". Erowid.org. Sep 29, 2008. erowid.org/exp/44772",
  "substance": "Salvia divinroum (10x extract)",
  "views": "2747"
 }
}
