{
 "id": 16322,
 "title": "Salvia and MDMA: a synergistic combination",
 "date": {
  "submission": "2001-02-18T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Itsuoda",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "T+ 2:00",
   "administration": "3 hits",
   "substance": "smoked"
  }
 ],
 "report": [
  "Setting: a medium size rave celebration held in a local church.",
  "Set: Pleasant mental state aided by a friendly crowd, and the company of good friends.",
  "1am- We drop the MDMA",
  "1:45am- The first tingles of MDMA quickly develop into the wonderful open hearted expansive feeling typical of clean MDMA. We see ourselves voicing deep words of affection to each other, renewing vows of friendship and commitment, and making new connections with scintillating individuals who immediately feel like friends.",
  "3:00am- The initial MDMA push has leveled off into a nice mellow loving state. But we are still high, and I am still grinding my teeth . Salvia Divinorum 5x is shared with two others in our group. The Salvia hits hard and fast, the ecstasy drowned out by the raging salvia space. I feel that my two other fellow salvia journeyers and I are stuck outside of time, standing on the edge of infinity, looking back onto the world, in this case, the rave. I feel the deep implications of such an event, and quite suddenly witness how the structure of the church is affecting the energy of the event. I see/feel the energy going from the altar area out onto the dance floor, and then up and out of the church. I feel how this energy dynamic is entirely different from that inherent in the circle pattern of wiccan or native America spirituality. This dynamic does not contain energy, but submits people to a blast of it, which moves through the crowd in a linear fashion: down from above, through the congregation, or in this case, the dancers, and then out the back. I also feel a certain twinge of regret at seeing the raw, animistic, and utterly spontaneous energy that used to manifest at raves in earlier days, now so tamed and structured. Surely this church is a safe space, but I see less of the wild trance dancing than I used to. Is this how ritual and religions are born, I wonder, out of a desire to tame and manipulate what essentially defies manipulation and control: divine ecstasy, merging with the unknown? I try to communicate my thoughts to my two other companions, and we seem to understand each other, though sentence formation feels unusually difficult to me, even useless. So I finally give up on the conversational impulse, and return to the experience.",
  "3:45 A full 45 or so minutes after the smoking the salvia, my fellow travelers and I find ourselves finally re-integrating into coherent mental spaces. This is extremely interesting, as the length of the salvia experience seems to have been extended for all three of us from the usual 10-15 minute flash, to a 45 minute ride.  It also takes us another 20 minutes to fully come down. Obviously something had interacted synergistically with the Salvia to produce a trip which was, while not more intense than usual, at least 3 times longer than usual. We came to the conclusion that it was likeley the combination with MDMA that produced this extended experience."
 ],
 "erowid": {
  "id": "4482",
  "citation": " Itsuoda. \"Salvia and MDMA: a synergistic combination: experience with MDMA & Salvia divinorum (5x extract) (ID 4482)\". Erowid.org. Feb 18, 2001. erowid.org/exp/4482",
  "substance": "MDMA & Salvia divinorum (5x extract)",
  "views": "27549"
 }
}
