{
 "id": 16338,
 "title": "Through Near Death Came the Answer",
 "date": {
  "submission": "2006-03-09T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Firestorm",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "1.5"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "Yesterday was my first time to try acid and I was slightly worried that with all the crap going on in my life, I'd have a terrible trip and feel horrible. However, I did it anyway and within about two hours, I was feeling great.",
  "The three of us were sitting around listening to some Pink Floyd song when a very funny comment was made about it. Unfortunately, I had a mouthful of soda in my mouth and I inhaled it into my lungs and began to choke. This was my first time to ever choke, so I freaked out a bit when it felt like there was a golfball lodged in my airpipe. As I stood up though, time itself began to slow down. When I got on my feet, time had stopped and the room began to fade to black until I was alone with the universe. Suddenly, there was a small light in front of me and I reached out towards it. When my hand got as close to it as it could without me walking towards it, the light rapidly expanded until it flowed through me and everything else out there. As it happened, the 'answer' to the universe and life suddenly was inside of me and I felt like for that split second, everything made sense.",
  "The next thing I knew, I was coughing up strawberry soda onto my friend's floor. Nothing like that happened for the rest of the night, but the experience has changed my outlook on life from hating it to loving it with every ounce of my being."
 ],
 "erowid": {
  "id": "44890",
  "citation": " Firestorm. \"Through Near Death Came the Answer: experience with LSD (ID 44890)\". Erowid.org. Mar 9, 2006. erowid.org/exp/44890",
  "substance": "LSD",
  "views": "4967"
 }
}
