{
 "id": 16346,
 "title": "Sally D: The Counsellor",
 "date": {
  "submission": "2008-10-03T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FeelinGood",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "8",
    "unit": "oz"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "In general, I am not a heavy drinker and do not enjoy the effects of alcohol, but I have used salvia divinorum quite a lot recently, with varying results. It has ranged from just dizziness to feeling glued to my bed to seeing vague things on my ceiling. I was camping out with a few good friends, and another guy coming down with some weed later. I drank about a third of a bottle of wine, maybe a bit less, through a bottle bong. I then decided to smoke a bowl of salvia in my pipe, which has quite a big bowl and can hold 3 big hits. I cleaned the bowl and nearly instantly was hit by a huge wave of power.",
  "I felt as if I was in a big rotating cube, being thrown around like a rag doll and bouncing off all the walls. It was like God was having fun with me by putting me in a box and shaking me around. I was told I was getting up and falling over for about 5 minutes. I completely lost all sense of where I was and what was happening. I saw a small cup of baked beans on the floor, so I picked it up and started to run with it. I nearly instantly felt like I was pushed over. The boiling hot beans fell all over my hand, and I hit my head on the floor with such force it bounced. I got up and grinned. I couldn't feel any pain. I saw one my friends pointing at the sun shouting 'Come on, let's run to the sun!' So I did.",
  "I sprinted faster than I normally did. I was building up inside me this huge sense of excitement. Everything would be okay if I could get5 to the sun. It was getting closer, getting very close but my feet just wouldnt hold me anymore. I fell, hitting my face on the floor before anything else. I got up, scared, and tried to run back to the camp. My feet gave way again and I rolled down the hill. I lay there for a while, slowly regaining my sense of self. I wanted to be alone. I went and lay down on a gentle slope away from everyone else. I lay there, feeling the grass in my fingers, like it was the hair of my girlfriend. I loved the earth. It was supporting me, comforting me during a time of utter craziness.",
  "This is where what I consider to be the true benefits of salvia use came through. I myself have depression, which is persistant but gets very bad sometimes. I felt as if being thrown around in the box had beaten every last scrap of sadness out of my body. I felt like a clean slate. The world was bright and happy and beautiful for the first time. I lay down and cried to myself, and walked up to the top of the hill to sit on a tree stump and call my girlfriend. She didn't believe what had happened (she doesnt approve of things like this anyway) and this annoyed me slightly. I spent the next couple of hours thinking about things. Everything would be alright. Nature was beautiful. To explain this feeling to someone who has never experienced it is impossible. The only way to get the happiness out was to shout and scream, sing or cry. If I think about this feeling, I get tears in my eyes. I am feeling shivery now. The feeling of utter joy is undescribable.",
  "Another friend of ours came back to the camp with a small bag of weed, so I had some. It was taking ages to come up, so I had some more to speed the process. This, I feel, was a mistake. When it came on, I was totally overwhelmed. I was confused and feeling extremely silly. It wasn't happy and relaxing as weed usually is with me. After about an hour of feeling extremely high, we decided to have some salvia. Put simply, I don't remember much at all after this. I remember one of my friends lying on the floor, shouting that he had seen god. 'Ooh shit, it's running at me', he screamed, then continued to dance around and sing.",
  "The morning after, I felt a bit woolly headed, but no major headaches or anything. I still felt good. To this day, that one experience has been the most intense and has changed my life so dramatically. I am a new person. I now appreciate things I never used to."
 ],
 "erowid": {
  "id": "44931",
  "citation": " FeelinGood. \"Sally D: The Counsellor: experience with Salvia divinorum (leaves), Alcohol & Cannabis (ID 44931)\". Erowid.org. Oct 3, 2008. erowid.org/exp/44931",
  "substance": "Salvia divinorum (leaves), Alcohol & Cannabis",
  "views": "4079"
 }
}
