{
 "id": 16347,
 "title": "All the Bad of Other Pills, None of the Good",
 "date": {
  "submission": "2007-11-03T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Don",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "ground/crushed"
  },
  {
   "time": "0:15",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "ground/crushed"
  },
  {
   "time": "0:40",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "ground/crushed"
  },
  {
   "time": "1:10",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "ground/crushed"
  },
  {
   "time": "69:40",
   "amount": {
    "number": "120",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Morphine",
   "form": "liquid"
  }
 ],
 "report": [
  "This is actually two experiences with the same substance 72 hours apart. They are closely related so I figured I would put both in one report.",
  "I am a huge fan of pain pills; it is the only drugs I take anymore. I have had every opiate imaginable besides heroin. I smoked opium once and it was a great experience, and I have taken every pill I can get my hands on and compared the experiences of them all looking for the 'best high'. Hydromorphone still holds this place for me.",
  "Morphine sulfate was about the only pain pill I had not tried. I got two 120 mg pills and decided to experiment. The pills were 120 mg of morphine sulfate, instead of powder inside the caps it comes in the form of dozens of little balls. I used to have a fairly high tolerance; I could do 160 mgs of Oxy and still be good enough have a fluid conversation or drive.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "T 7:00 PM",
  "I take apart the 120 mg pill and get all of the little balls together. I then spend about 15 minutes crushing the balls into a fine powder. Eventually the powder is smooth enough to the point it looks like cocaine. Since it had been a few months since Id had opiates and I wasnt sure of my tolerance I decided to do it a bit at a time. I divided up the powder into 8 lines of roughly equal size",
  "7:20",
  "I clear out my nose and snort the first two lines. It burns but I have had far worse so I deal, after about 5 minutes I start to feel the good old opiate come up I love so much. However it isnt very intense, I feel kind of warm but nothing else really. ",
  "7:35",
  "Decide to do two more lines. Feel it a little more intense, the drip is getting pretty wicked now, nothing too great to show for it. Starting to be let down by the whole experience, maybe I should have done all 120 mg in 2 huge lines. Decide to wait and see if it will kick in,",
  "8:00",
  "Do two more lines, burns like hell now, not very enjoyable. I have an awful headache that the morphine isnt countering. Honestly 30 mgs of Hydrocodone filtered is a better high than this and that isnt saying much. My body feels very heavy but my head hurts and I am having little Euphoria.",
  "8:30",
  "Do the last two lines. Nothing really changes, nose is killing me, eyes are bloodshot, head hurts, and have a pseudo-opiate buzz.",
  "9:00",
  "I get really hot and sweaty, like my hair is drenched in sweat. I know what is coming next. Soon enough I got horrible nausea and rush to the bathroom, vomit 6 times over the next two hours. Attempt to go to bed. Cannot fall asleep, finally at 3 in the morning I drift off to sleep.",
  "T Next Morning 8 am",
  "I get to work, run into the bathroom, throw up twice, have some Pepto and feel a lot better. Feel lethargic all day. Worst opiate trip I have ever had, all the negative of an opiate trip and very little positive.",
  "I recover for a few days and decide to try something else when I am at baseline. Obviously the nasal route didnt work, I wouldnt want to do that much powder at once as my nose would be in bad shape, so I decide a quick oral route may be best, I have tried this with other opiates with good results.",
  "T: 5 pm",
  "I take the other pill and grind it up again, this time I spend more time getting it as fine as possible. I grind it up to very fine powder. I then scrape all the powder into an empty cup. I run some water till it is slightly hot, not too hot but very warm. I pour this into the powder. I swirl it around till no powder is left, and it is completely cloudy. I then quickly shoot this down on an empty stomach. Tastes pretty horrible but I have had worse.",
  "5:30",
  "I feel it coming on a lot like the previous time. More substance too it now as I am taking the full 120 mg at once. Body becomes very heavy and I feel very out of it.",
  "5:45",
  "Have a little more euphoria. Still not what I expected from such a high does. I prefer just about every other pain pill I have tried to this.",
  "6:00",
  "Became very sedated now, almost as much as Methadone but not quite. Temped to close my eyes and lay my head back. Decide to listen to music in the dark. This is my true test of how good an opiate is. How good I feel listening to my favorite music in the dark, it is my ritual. I feel pretty good, easier to lose myself in the sound compared to when I am sober but this is a far cry from the best opiate experiences I have had.",
  "9:00",
  "The last few hours have been very similar, mild Euphoria, heavy body sedation, nothing too exciting. I come down slowly, and have a little difficulty falling asleep but not as bad as the previous night.",
  "Conclusion",
  "Morphine was a very big letdown. I imagine the liquid form for fixing is great, but the sulfate leaves a lot to be desired. I had very high hopes for this experience as all the conversion charts online led me to believe this was a strong opiate at this dosage, and obviously it was given how sick I was the first time, but all of the best parts of opiates, the complete lack of anxiety, and the overwhelming euphoria were nearly absent. I wouldnt recommend this even if you could find it for cheap, even common Hydrocodone filtered is a far more powerful and pleasurable experience than Morphine Sulfate."
 ],
 "erowid": {
  "id": "44932",
  "citation": " Don. \"All the Bad of Other Pills, None of the Good: experience with Morphine (ID 44932)\". Erowid.org. Nov 3, 2007. erowid.org/exp/44932",
  "substance": "Morphine",
  "views": "52575"
 }
}
