{
 "id": 16356,
 "title": "Not As Strong As People Think",
 "date": {
  "submission": "2005-08-12T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "marklar",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "ug",
    "quantity": "750"
   },
   "administration": "oral",
   "substance": "Bromo-Dragonfly"
  }
 ],
 "report": [
  "1100mg of DOB-Dragonfly was dissolved in 1ml of ethanol that was then poured into 21mls of distilled water. This allowed each ml of liquid to contain 50 micrograms of the substance.",
  "The equivalent of 750micrograms was taken at 4:10pm. Here's what happened.",
  "Nothing.",
  "Here's what happened in detail:",
  "T+3 hours. Something feels different, but I'm not sure what.",
  "T+6 hours. Is anything going to happen? I'm not even thinking in a tripped out way. It's just normal me. Should I take the last bit in the vain hope that it will make me trip out? Or will it just keep me in this boring state for a longer? I decided against taking the rest.",
  "T+8 hours I watch tales from the trip side. Its as bad as this trip. But it makes me want some 2c-t-special-G. Am I tripping? Nope. How do I feel? I'm dreading the next few hours when TV turns into infomercials and bible shows. And to top it off my girlfriend has a friend over so I can't do anything else other than lay in bed. I feel just like when I've had some meth and the fun has worn off and all I want is to sleep. Let me sleep damn you drug! ARGGH",
  "T+14 hours I think I fell asleep.",
  "T+24 hours. I definitely fell asleep. Slight headache. Other than that, I feel ok. Can I remember last night? Every boring detail.",
  "In short, 750micrograms was not enough to do anything noticable to me, but it did keep me awake and extremely bored.",
  "I'd like to up the dosage  but this is such a rare chem, that I doubt I will get the chance again..."
 ],
 "erowid": {
  "id": "44959",
  "citation": " marklar. \"Not As Strong As People Think: experience with Bromo-Dragonfly (ID 44959)\". Erowid.org. Aug 12, 2005. erowid.org/exp/44959",
  "substance": "Bromo-Dragonfly",
  "views": "17877"
 }
}
