{
 "title": "Zonked Out",
 "author": "Jud",
 "citation": " Jud. \"Zonked Out: experience with Hydrocodone (ID 16356)\". Erowid.org. Feb 8, 2003. erowid.org/exp/16356",
 "substance": "Hydrocodone",
 "bodyweight": "135 lb",
 "report": "<p>One day, I happened to be rummaging around my pantry for some food, and I found a bunch of pills.</p><p>I looked up what they were, and low and behold found out that they were opiates. So, for about three weeks I held on to them, taking 1 or 2 at school about 4 times. Although I liked the feeling that the 1 or 2 pills gave me, I wanted to try a larger dose. So, I decided to take 5 pills one night to see what would happen.</p><p>I am not an experienced drug user by any means. Weed maybe a couple times a month, Alchohol maybe once a week or more, DXM twice, and MDMA once.</p><p>T+ 00:00</p><p>5 pills of 7.5 Hydrocodone each, taken orally, on an empty stomach.</p><p>T+ 00:15</p><p>Warm fuzzy feeling that accompanies opiates. Sense of well being and mild euphoria.</p><p>T+ 00:30</p><p>Feeling very tired, beginning to nod off. Warm fuzzy feeling still there.</p><p>T+ 01:00 hrs</p><p>Completely knocked out. I am slipping in and out, almost a semi-sleeping state. I can still hear and understand people talking, but I am very incapacitated. Unable to speak lucidly or move beyond a slugish crawl.</p><p>T+ 03:00 through T+ 04:00</p><p>I can move and talk again, although not very well. Feel completely zoned out, with a nice euphoria similar to alcohol, very mild nausea.</p><p>T+ 05:00 through T+ 06:00</p><p>Effects reduced to a nice buzz, I seem more sociable and happy to my friends.</p><p>In conclusion, the experience was not too bad. I liked the euphoric effects and zonked out feeling I got. The 2 hours or so that I was completely dead weren't especially interesting. They slipped by rather quickly actually, and I found myself laughing internally and thinking 'wowwwww...' alot. All in all, a nice experience, but not quite as wonderful as I expected. Perhaps next time I will reduce dosage to 3 or 4 pills at a time and just space them out over a couple of hours in order to produce the nice euphoria and reduced the cracked-out feeling that I got.</p>",
 "year": "2002",
 "id": "16356",
 "gender": "Male",
 "timestamp": "2003-02-08T08:00:00.000Z",
 "views": "69156",
 "dose": [
  {
   "time": "0",
   "amount": "37.5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ]
}
