{
 "id": 16355,
 "title": "Concert Rolling",
 "date": {
  "submission": "2008-10-03T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zoink",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "As had become a summerly tradition, we were on our way to the Dave Matthews concert. Like last year, it was at the alpine, outdoors, and we had lawn seats. Though the view is bad, the room is great, we can dance, and the drugs are plentiful with minimal risk from authority. I had come with a pretty close group of people I know, so everyone was pretty tight. I had been saving 2 MDMA pills for over five months just for this event, since they are somewhat hard to get a hold of, or at least legit stuff.",
  "We had been partying before the concert, just the usual drinking and smoking, nothing hard. About a half hour before the concert, I went to the bathroom and downed one pill. I was still reluctant to take the other, since I did not know how strong these were. After that I went back to the concert. Soon enough OAR started opening, which was tight. I felt nothing from the pill so far, but previously I ate 2 caffeine pills, and smoked a joint. I was just feeling groovy in general. Then it started.",
  "Now, before I get into the trip, let me tell you the weather conditions. The day of the concert, and huge heat advisory was sent out. The temperature was in the 100's, not including the fucking sun beating down on all the half naked people dancing around. Everyone was completely drenched in sweat, and walking through tight crowds was similar to sliding on a slip n slide. Disgusting, yet awesome. I myself was just wearing shorts, and frequently pouring water on myself to stay cool.",
  "When OAR started to wrap up, I began to feel the pill a little. I felt bubbly, bouncy, and pretty happy. Things were beginning to get more and more vibrant, and I began to become and feel the music as much as I heard it. Finally, Dave came on, and shit was rolling. Now, Im a white boy from the suburbs of Chicago, and white country boys are not exactly huge on dancing. Most of the time, I have to be rather drunk to even think about dancing. But now, it was different. At very most, I would only dance with a girl, because I just felt so goddamned stupid dancing about on my own. Like some kind of fucking fairy. With the MDMA kicking in full force, all I could do was dance. I didnt care with who, where, when, I just wanted to dance. It felt so good, so expressing, so natural.",
  "As the concert went on, I just felt good. I had a huge smile painted on my face, felt overly euphoric, like a rolling ball of energy was just turning over and over inside of me. I loved everyone, and everything was beautiful. I would move from person to person, and dance. I could feel a personal connection with each person I danced with, and upon physical contact it was increased. Also, I noticed my inhibitions were basically destroyed. I had almost none. I danced like a fucked up freaky fuck, most likely putting my hand in places I shouldnt on people I dont know that well. The freakiness went on, and I danced more creatively than I have ever seen. I even danced alone, in public, something I never have done before. It required no effort, in fact, the music did that dancing. All I did was make the audible connection of the music available to take physical form of dancing. Amidst all this crazyness, I realized that it was indeed very hot, and that I needed to start making some trips to get water.",
  "In lieu to MDMA empathetic qualities, on one of my water trips I met a girl from my school. She was by us with her boyfriend, but now she was alone getting water. I barely knew her, but I had talked to her a few times during a class. I could feel that something was off, so I asked her what was wrong, and she said she didnt know where her boyfriend was. So we walked back together and tried to find our group, and I tried to help her find him. Even though I never saw her find him (maybe she did later on?), I could feel exactly how she felt, just kinda lost and helpless, and undesirable to enjoy the experience to the fullest without the other half of her soul.",
  "Once I was back, I continued dancing. Some songs I really liked were being played, and many people were singing along. This started getting me really loved up, and when I talked to people I noticed that I would touch them before I would talk, as if it were some means to communicate more efficiently and honestly. Finally, in the middle of one dance, I just looked around, at the stage, at the lights, the people, the screens, and then the sky. I just looked up at the sky, and closed my eyes, and could feel my soul being lifted to a higher level, to the same level as everyone else there, and for a while, everything was linked by soul. Everything, sounds, sights, smells, physical feelings, emotions - it all mixed into one beautiful mess, and it felt amazing. Everybody was one.",
  "That was most likely the peak. After the concert, I was still a little loved up, and continued my crazy dances to the radio while we waited to leave. For the most part, I was just really tired, physically. My body was fucking beat. Besides that, I did notice many other physical side effects during the concert. I felt that my eyes were looking very crazy, and I kept asking if I had 'crazy eyes.' Most likely because they were dilated fully, and wiggling and darting around for no reason, and also WIDE open like I had just done some fat lines of speed. also, I grinded my teeth quite a bit, but I prepared and brought gum. Also, I smoked a lot a hitters, and hardley felt any effect from the cannabis. In fact, I just felt like I was rolling a tad be harder each hit, but not high at all.",
  "To wrap things up, it was a great experience. Not only did I have quite possibly the best time of my life, I feel that some of that crazy funky psychedelic dancing has remained with me, because I find myself dancing around to things that I would usually never dance to, even after the trip. MDMA has opened me up a lot as a person, and let me feel more comfortable with almost everything, not just while rolling, but even after."
 ],
 "erowid": {
  "id": "44957",
  "citation": " Zoink. \"Concert Rolling: experience with MDMA (Ecstasy), Caffeine & Cannabis (ID 44957)\". Erowid.org. Oct 3, 2008. erowid.org/exp/44957",
  "substance": "MDMA (Ecstasy), Caffeine & Cannabis",
  "views": "7660"
 }
}
