{
 "title": "Not What I Had Expected",
 "author": "MMX",
 "citation": " MMX. \"Not What I Had Expected: experience with AMT & DXM (ID 16369)\". Erowid.org. Jun 25, 2007. erowid.org/exp/16369",
 "substance": "AMT & DXM",
 "bodyweight": "140 lb",
 "report": "<p>I'm not going to make this a trip report about AMT because my experience on AMT was pretty standard, you know, I saw some stuff on the walls and stayed up all night blah blah blah.  So anyway, mixing the drugs.  I was just beginning to come down off a loooong AMT trip, and my friend and I decided to make hash.  We realized we were a lot more intoxicated than we had realized and had accidentally spilled out all of the rubbing alcohol used as the solvent in the extraction in an attempt to extinguish the massive patio fire that we had started (long story). </p><p>Anyway, once the fire was under control we were kinda bummed out about losing our hash.  So, we figured, lets knock back 250mg each, we have nothing to lose.  When we dosed it was about 4:30 AM (that AMT keeps me up, I tell ya!).  We popped in a Star Trek episode (Kirk era, too bad I can't remember what episode it was).  I didn't really focus on the show at all, I let my mind run off and to tell you the truth I can't really recall what was happening during this first episode. </p><p>When the tape had ended, we put on 'Mirror, Mirror', one of the *best* episodes ever and the DXM started to really kick in.  I had almost complete double vision and it felt like I was on a moderate 3rd plateau trip.  It seemed like the voices were somewhat hollow and mumbled, and I found it extremely difficult to follow the plot (big surprise).  It felt like I was forgetting what a person was talking about before they finished their sentence.  It wore off faster than any dose of DXM I've ever taken -- about 3.5 hours after we had dosed.  We spent the rest of the day just chilling around the house.  No hangover, surprisingly.  Slept like a baby the next night.</p><p>Summary:</p><p>Body -- total lethargy.  This may have been a result of the time (4:30AM) and not the combo, but either way, this is the way it happened.</p><p>Mind -- relaxED, and took a break for a minute to just let everything clear out.  This had it's positive and negative aspects, in that it was nice to feel so clear but I generally enjoy the feeling of thoughts rushing through my head (AMT did that nicely earlier in the night, the DXM somewhat spoiled that aspect of the trip for me).</p><p>Soul -- this combo has no spiritual aspects, IMHO.</p><p>Not euphoric, per se.  Interesting, yes, but I didn't really do anything.  I don't think that I even *would* be able to do something on this combo, even watch a movie.  DXM is better suited for a lonely night.  AMT is too happy to mix with DXM, and the DXM definitely took the excitedness and body high away.</p><p>Overall, if someone offered me the combo for free and I had nothing to do one night, I might consider doing it again.  But like I said, it didn't really strike me as 'fun'.  I was definitely intoxicated but it's just not exactly what I'm looking for in drugs.</p>",
 "year": "2002",
 "id": "16369",
 "gender": "Male",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "5485",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "AMT"
  },
  {
   "time": " T+ 8:00",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "DXM"
  }
 ]
}
