{
 "id": 16360,
 "title": "Latest Journey With Lucy",
 "date": {
  "submission": "2005-07-27T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "mattzdope",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "1:00",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "1:50",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "A little background information; At age 15, throughout the 10th grade of High School, I dropped Lucy every other day and was able to even keep composure throughout High School while doing so. Never once did I have a bad journey or anything that felt remotely wrong at this point in my life. At this point in my life I was a worry free kid. The drought set in and my life changed drastically. I got into hard shit and became very depressed with my life. My last trip with Lucy (11 days before my daughter was born) was a rough one but I had my daughters mother who I was very close with at that point to guide me through. She had also been my chemical companion throughout various past experiences.",
  "Alright so here it is all laid out. Not a very perfectly planned journey by any means but I did learn a few very important lessons about my life and life in general and all around it was a very good experience. Throughout the night before dropping I had around 4 or 5 beers. Around 4:25a.m. I decided to drop 3 hits of the blotter which I recently acquired from a loving brother. The first hour was spent in my room just laying down watching TV I dont exactly remember what was on the TV at the time. When it reached 5:25a.m. I was feeling nothing so I decided to drop two more. Layed there and watched some more TV until it reached about 5:40 a.m. when I felt like I had diarrhea coming on from some little caesars pizza and crazy bread I hate ate a few hours earlier. My mother was just getting out of the bathroom and getting ready to head to work.",
  "I got up and went into the bathroom and opened up the window nice and wide which faces to the east. While sitting there I could feel it coming on slightly and in my mind I got very excited and felt as if I was purposely purging out all of the negativity in my life. I felt nothing but good vibes radiating at this point. After getting out of the bathroom I went back into my bedroom around 5:50a.m. and sat back down and took a nice swig of beer and could still feel it coming on slightly. It felt like as soon as I sat down my mother called me from downstairs to print a report for my little sister because she couldnt get it to print. I went downstairs with minor anxiety and printed it and headed back to my room.",
  "At this point it was 6:00a.m. Upon getting back into my room I laid there feeling out Lucy and letting her get a good feel of me. Everything felt right at this point. Everything was beautifully coming together but I was not totally satisfied. Around 6:15a.m. I went to grab for the last 2 hits and my phone started ringing immediately as I reached. It was my mother asking me to wake up my little brother for school. I felt like this was an omen not to drop anymore because she had stopped me while my arm was outreached. I woke up my brother and went back upstairs. Sitting on my futon things were starting to take hold even stronger but I still was not satisfied and while looking at the last two hits I thought to myself well I can either sit here and have a low to mild experience or I can see how far the rabbit hole will go with all of these. Seeing as this has been my first experience in over a year I dropped the last 2 hits.",
  "At this point it had reached 6:35a.m. The sun was up in the east but my windows face the north and the west so my room was fairly dim at this point. This is where things really started to go into overdrive. Laying on my futon I was watching Funny Farm because it was on HBO at the time and seemed suitable and non violent/threatening. At around 6:55a.m. it hit me like a ton of bricks. I was totally blown away. I laid completely flat on my back on my futon breathing deeply in and out keeping a good mindset and watched spots on my wall begin to swirl and take on what looked like a life of their own moving in various motions. At this point all was good and I was enjoying. I turned back to the TV and it was annoying me so I shut it off and laid back watching the ceiling. The visuals were utterly phenomenal. At first in a good sense but then they started to get a dark feeling to them. I brought my blanket up over my head and shut my eyes and inside my mind I was having some very wild visuals that I have never experienced to this intensity before. Things that seemed to look like skeletal figures with geometric lines forming their shape. Utterly amazing but at the same time frightening.",
  "It felt as if the demons (how my mind put it at that time) were closing in on me. I felt like I was fading out and I became very claustrophobic and felt as if something was making it hard for me to breathe while under my blanket. Very overwhelming feeling. I pushed off my blanket and laid on my side staring at my futon gazing into what looked as if it was the fourth dimension. While gazing it became dark again and what looked like a demons face came before my eyes totally white face made up of total energy nothing physical with black eyes. This fucked with me bad so I sat up and tried to regain composure. At this point only a very small amount of time had passed. It went from 6:55a.m. to only 7:15a.m. I couldnt believe my brothers and sisters hadnt even left for school yet because I wanted to go downstairs where it was more open and bright. Things were very intense so I decided to try and give my daughters mother a call who used to be chemical companion and would guide me through when times got rough. With 3 back to back failed attempts at calling I think it set me off very bad.",
  "I laid down on my back again and stared at the ceiling. The next visual was the most intense I have ever seen in my entire relationship with Lucy. Above me on the ceiling were physically lifeless forms. They were made up of complete energy with a light white glow. They were in a circular shape all connected at the head, arms at their sides, and legs spread out. They were moving in a circle in a counterclockwise rotation. I felt like fading out again and began to but things started feeling negative and I felt as if the demons  were grabbing for me (this is what was running through my mind).",
  "I closed my eyes and I was seeing some very fucking cool but scary shit. Things that looked like ancient egyption pyramids and peoples of that time along with skeletal figures and demonic looking faces. All incredible and I'd do it over any day of the week but at that point where I was at right then it was a little too much for me. I needed somebody to be there with me and help me understand and comfort me. I attempted to call my daughters mother again with no luck and became upset and realized that it had only hit 7:40a.m. and that my little brothers and sisters were gone at school. At this point I totally lost track of time up until the end.",
  "Downstairs I went and turned on a fan and pointed it at the couch and headed to the bathroom. In the bathroom nothing too spectacular happened. Just the usual off and crooked look to everything. I came out of the bathroom and laid down on the couch and watched the TV hoping it would keep me leveled off. This did not work and I found myself gazing off and getting an overwhelmed feeling of anxiety. I forgot the purpose of why I was journeying in the first place and only wanted to come down. Things felt off and not right and generally blue. I tried calling Erica one last time with no luck. The air from the fan started to annoy me so I turned it off. I stared out the window and became annoyed because I couldnt go outside feeling that overwhelmed and not knowing the purpose of what I was doing in that realm and feeling like nothing was being accomplished and very overwhelmed of the intensity of what I was seeing.",
  "I had to figure out something to do. Right in front of me was my answer. The computer. I walked up and hit the mouse and the screen saver shut off and Windows popped up. I looked at my desktop and it was distorted looking, the buttons seemed larger, the color was off, out of the corner of my eye the printer looked like it was lifting off the desk and coming back down over and over again everything on the desk out of the corner of my eye was floating and pulsing. The exact words that came flying out of my mouth were Fuck That. I got up and sat back down on the couch. Everything was just so very intense and I felt so lost after only a few minutes I jumped back up and made my way back to the machine determined to get online to talk with some people I knew would understand where I was at and be able to help me through.",
  "The visuals were still intense and throughout my whole time on the computer it was very intense. I felt like I was inside the monitor at some point and others I just watched everything on the desk float. I made my way here with little trouble. Ive been a computer nut since I was 11 years old. I went to my post where I asked earlier around the time I originally dropped for people to send me some good vibes. On the screen I read a post that I hadnt previously read before dosing saying Its been a long time coming. You know what to do. Its like exactly what I had been thinking. That I had no clue what I was supposed to be doing. I had totally forgotten the purpose of my journey and why I was gazing into the astral plane.  I have so much respect and appreciation for everybody who helped me out throughout that thread especially in the beginning. Everybody was throwing short and compact hard hitting good spirited punches at me. I will never underestimate the value of words even on a computer screen ever again in my life. Where I was at that point in time I was clinging on those words. I will also never forget what those guys did for me. They may not realize it but they truly helped set me in a good place. I have much love for them and I feel a much deeper connection with that forum then I previously had.   Sitting with my face close to the monitor I felt like I had a connection with each and every one of them. It was absolutely beautiful. I could honestly feel their good intentions and felt like I was making a connection with their spirit through their words and avatar. It was like I have known all of them my whole life and they understood me and where I was at that point. I became very calm at this point. This is when I could not connect to the forums. I had just started to feel better and I felt like something very demonic was keeping me away from the love I was feeling while here. While here I felt as if all of the negativity in my body was being purged with the help of the vibes I was receiving.",
  "I went back and laid on the couch and reached out and felt like I made a spiritual connection with me uncle who I was very close to growing up. He was like my role model and I respect him. He is a very wise spiritual man. I felt overwhelmed with good vibes again and once again felt like I was purging out the negativity in my body. I called him and when he heard me rambling about how I dropped 7 doses and was tapped the fuck in and didnt remember what I was supposed to be doing here and I am totally lost and on and on and on he laughed. He said Matthew you need to go outside. Its a beautiful day and the earthly spirits will love you right now. Get up go outside and lay down in the grass and let yourself be engulfed with the positive spirits who will help you figure out what you are trying to do here. I replied saying I cannot go outside. He shot back Its not that you cannot go outside its that you are setting boundaries for yourself as you always do. Let go of your boundaries and travel outside. I looked out the window and it all looked so big out there (mind you I havent been out of my house at all in literally 3 or 4 months.. except for a few times with my daughters mother. I ditched most of my friends due to my anxiety that I have a hard time controlling) I just couldnt do it. My uncle continued to laugh and told me that everything would be alright and to keep purging out the negativity and thats the reason I had come to purge the negativity, the boundaries, the fear of responsibilities and maturity, and thinking to much of what other people think of me. It still didnt seem to clear to me at this point. What he said made since but he cut me short because he was at work leaving me confused and sort of upset with him.",
  "I got back on the computer and read back to see what happened from there. The pictures posted were absolutely beautiful. They produced some wild visual distortions and I had to close some of them because they were very intense. Especially one of a girl on the blotter.  From time to time between posts and such I laid down on the couch. I watched the ceiling and many geometric patterns that looked like grafitie letters and designs were pulsing on the ceiling and changing form constantly. At one point the ceiling looked as if one big spiders web. I think the web represented many personal problems of my own that I have weaved. I could see it perfectly but became lost inside of it and lost my way.",
  "At one point I tried to call Erica my daughters mother again and things were slowly coming down at this point. This time she answered and I tried to tell her where I was at but she didnt want to hear me. She started screaming nonsense at me that I couldnt understand. One thing I did understand was her last line. How often in the past year have you been here for me Matt? I was there for you last time this time you are on your own.. It made perfect sense to me and I needed to hear this from her. It helped me contemplate on many personal issues and set me back on track as to what I was doing and trying to accomplish.",
  "Things slowly faded out. Visuals became less and less robust. The mind grip let go slowly. Around 1:30 p.m. The effects were totally gone for the most part. The afterglow is still upon me as we speak. From 1:30p.m.  4:00p.m. I laid on my futon and contemplated many personal things. I have come to some conclusions and some things are still left unsettled.",
  "All in all it was a very very good experience. It taught me a few valuable lessons and left me with a few questions to answer on my own.",
  "I am anticipating my next meeting with Lucy with open arms which probably will not be for a while.",
  "And this chapter comes to a close. Damn that was a long time coming."
 ],
 "erowid": {
  "id": "44974",
  "citation": " mattzdope. \"Latest Journey With Lucy: experience with LSD (ID 44974)\". Erowid.org. Jul 27, 2005. erowid.org/exp/44974",
  "substance": "LSD",
  "views": "4559"
 }
}
