{
 "id": 16369,
 "title": "Multiple Types of Fake Opium?",
 "date": {
  "submission": "2001-01-23T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Catnap",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Red Rock",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Over the last year, I have come into contact with two substances that were sold as opium, but I beleive are not. ",
  "The first is 'red rock' - i came to the conclusion that it was fake after i discovered an ounce of 'Dragon's Blood' insence at a Wicca store.  It cost about $5 an ounce, and i had recently paid $50 for an ounce of 'red rock'.  I had been selling the powder for $15 a gram, so i can't complain about getting ripped off...  Anyway, i presented the two bags, unmarked, to my dealer and told him that i had bought one from him and one from a store.  When asked to tell which is which, he was unable to tell (as was anyone else.)  Afterwards, he asked me where the store was, and it turned out that his supplier lived on the same street, and that the bags his supplier used were the same ones as the store...  case closed. ",
  "As for the effects of 'red rock', I am convinced that it is all psychosomatic - i have smoked it since, and it has no effect that I can discern.  In the past, when I thought it was opium, I always smoked it with pot and was of the opinion that it gave me a much more clear-headed high.  I can't work (especially write) when i'm stoned, but after combining pot and 'red rock', I found it much easier to concentrate.  That's the main reaction I used to have before finding out the truth behind 'red rock', and I will admit that I used to tell potential buyers that it was a very subtle high and should always be combined with pot.  I suppose that by the time someone smoked enough 'red rock' to feel the 'effects', it would have been with 3 or 4 bowls of pot, at which point they'd be high enough to imagine all kinds of feelings.  Personally, I no longer smoke 'red rock', and wouldn't buy it either, legal or not. ",
  "Right now, I have 1 and 1/2 grams of something that was sold to me as 'black tar' opium.  It cost $10 a gram.  It is a brownish/black gooey paste that has a sweet smell, sort of like grape bubblegum.  The dealer who sold it said that he knew about the red rock hoax, but i think that this stuff is fake, too.  I base this assumption on the fact that I have now smoked it three times without any discernable effect. ",
  "The most recent was 30 minutes ago. I smoked three consecutive bowls of this stuff out of a bong (straight, no pot).  I have not ingested any other drugs, nor have I eaten in the last 8 hours.  I am very experienced with codeine and morphine, so I think I would be able to identify any opiate-induced feelings. ",
  "The 'black tar' was very sticky, and it burned into a thick, fragrant smoke.  In the bowl, it actually caught fire and continued to burn with a small orange flame long after i stopped lighting it -much the way that 'red rock' has in the past.  When finished, it burned all the way to a fine white ash. ",
  "I hope this info is useful, and I hope that no one else is suckered by this new crap.  Personally, I believe that this may be another kind of insence, and will be taking a trip to the Wicca store to see if my hunch is right.  I'll let you know if I find out."
 ],
 "erowid": {
  "id": "4500",
  "citation": " Catnap. \"Multiple Types of Fake Opium?: experience with Red Rock Opium & Opium (ID 4500)\". Erowid.org. Jan 23, 2001. erowid.org/exp/4500",
  "substance": "Red Rock Opium & Opium",
  "views": "17617"
 }
}
