{
 "id": 16379,
 "title": "Mild, Nothing Note-Worthy",
 "date": {
  "submission": "2005-08-12T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "DeeBohDamn",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 hits",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "[Erowid Note: Some blotter sold and thought to be Bromo-Dragonfly has been shown to actually contain DOB. There is reason to suspect that some or even all descriptions of Bromo-Dragonfly on blotter are instead, DOB, LSD, or another long acting compound.]",
  "A little background...",
  "I'm about 5'11, 130 lbs (very lean), and have had multiple experiences with mushrooms, salvia, Ecstasy, and most of all pot.",
  "11 days prior to this trip I had rolled (E)",
  "I had been smoking pot as usual",
  "A friend of mine called me one night and said he could get acid. I had been wanting to experiment with LSD for a long time, but I was always hesitant because of rumors of fake acid in Miami. Some friends of mine had bought bum acid a few months earlier. But his connect assured him it was real. He basically had me on speakerphone with his buddy while he got the blotters, a single hit for himself, and a double for me. After a few days my friend told me he had taken his, and believed it not to be LSD but Bromo-Dragonfly. He believed this because of his unbearably long come up time (3 hours until mild effects, 4 hours until full effects), and also the range of effects seemed to be that of Bromo-Dragonfly. I had only hardly heard of BrDf once before, and I had never heard of anyone doing it.",
  "The stamps were average size, a square about the size of a pencil eraser head, with a yellow sun outlined in red with a red heart in the center on one side, and a navy blue back. My friend's had a yellow back.",
  "After some research online, and sifting thru forums he discovered that other people had been getting the same stamps, and were having similar trips, and all believed it was bromo. I did my own research, as I dont like taking anything I'm not sure of, and decided to go ahead with the trip. My friend had told me his trip was very mild, uncomfortable, and 'not worth it'. I believed that because of his historically higher tolerance to hallucinogens I would have a better experience. So I went ahead.",
  "The actual trip is nothing note-worthy. Id had much more intense trips before, but this one was unique. I split the stamp in half with a friend, so we each had a single dose, like my other friend. It took both of us a full 4 hours to feel any effects at all. This is the time-table.",
  "6:40PM- ingest.",
  "9:40PM- Mild nausea, fatigue, and restlessness all over my body.",
  "10:40PM- I wake up from a short nap I took to settle my stomach, and upon opening my cell phone in the pitch black room, I was completely blinded with light, and I almost dropped my phone. It was at this point I would say I began 'tripping'.",
  "10:55PM- I went into the bathroom to collect myself, and drain my lizard, and everything was just different. It had the spacial-distortion feel of a mushroom trip, but the energy of a roll come up, accompanied by an extremely pleasent floaty body high. In the bathroom the tiles bent and waved a little bit, nothing drastic, but I still enjoyed it alot.",
  "Around hour 5 (11:40PM) my girlfriend had to go home, so we hopped in a sober friends car and took off. The car ride was amazing. I had the feeling that there was no car around me, and I was floating in the air, zooming around at 55mph. Contrast in light and dark was very nice, colors and lights were a little visually pleasing as well.",
  "At about hour 6, all visuals had ceased, with the exception of some spacial distortion. The body high remained, and I smoked some pot to try and kick the visuals back in. The effects were moderate at best, but pleasing. I decided to call it a night at about 1:30AM, almost 7 hours after ingestion. I sat in bed alternating between Adult Swim and Stankervision for the next 4 hours (television was extremely nice throughout the whole trip). Occasionally Id turn off the TV and try to fall asleep, but I found my body too restless, I could still feel it in me. Id estimate I fell asleep somewhere in the neighborhood of 5:15-5:45AM.",
  "I woke up later that morning (today) at about 10:30AM, and for the small amount of sleep I got I felt surprisingly well rested. I could feel no after effects, no hangover, no burnt out feeling, completely normal.",
  "Id say I was very pleased with the trip, and so was my friend who took the other half. I'm sure that if I would have taken the full stamp myself I would have had much more intense and longer lasting visuals, but the uncomfortable restlessness could remain longer as well. I plan in the next month or so to obtain another double hit, same as this, but to take the whole thing myself, and see what some of the more intense effects of this weird chemical are.",
  "All in all? If it really was bromo (which we're almost certain it is) than I personally suffered no ill side effects, and had a mild but lovely trip. My only complaints would be the long time frame of the experience, and of course, the restlessness. But I expected both things to begin with, so it wasn't an unpleasant suprise.",
  "I really enjoyed myself, and look forward to the double dose."
 ],
 "erowid": {
  "id": "45015",
  "citation": " DeeBohDamn. \"Mild, Nothing Note-Worthy: experience with DOB (suspected Bromo-Dragonfly) (ID 45015)\". Erowid.org. Aug 12, 2005. erowid.org/exp/45015",
  "substance": "DOB (suspected Bromo-Dragonfly)",
  "views": "14086"
 }
}
