{
 "id": 16385,
 "title": "I Felt Like a Zombie",
 "date": {
  "submission": "2008-06-05T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mr. Shifty",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "pill / tablet"
  },
  {
   "time": "4:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]",
  "This was my third time experimenting with Coricidn Cough and Cold pills with DXM. My first experience I had taken 8 of these pills and felt no more than a slight intoxicating, like being drunk, only when I was actice and walking. My second experience I toke 16pills (a whole box) and felt dizziness with minor closed-eye visuals.  This time I decided to take 20 pills. I have never heard of people taking this many, but I guess I have a slight tolerance to DXM.",
  "12:30pm I toke the 20 pills and my brother toke the left over 12 pills.",
  "2:00 first feelings take effect. I felt a slight tingling feeling through out my body. I felt no nausea whatsoever.",
  "3:00 these feelings became more intense like being in a new world.  Sound was and touch was different.  As I was going up in the intensity I had less body control. I saw both open eye and closed eye visuals of color and shapes. Colors were brighter.",
  "4:00 I'm not quite sure when I reached the peak. I had very little body control and even speaking was hard for me. My brother and I sat in my room and listened to some music, and we both felt comfortable with the settings.",
  "4:30 we decided to try smoking some MJ and seeing the effects it had on us.  We smoked three bowls between the two of us. As the Mj effects kicked in a total different state of mind came in.  My eyes were wide open and pupils really dilated. My vision was extremely sharp. Everything seemed to have the 'cardboard' or 'painting' look to it. Things were definetely more colorful. The music seemed to play with my head and had an unexplainable feeling.",
  "4:45 We decide to go out back and have a smoke.  The lightheadedness from the cigarette felt different as well.  The clouds in the sky were fake looking and everything else seemed rather motion less.",
  "The effects slowly came down for about three hours after that. Going to sleep was easy that night and felt really comfartable."
 ],
 "erowid": {
  "id": "45038",
  "citation": " Mr. Shifty. \"I Felt Like a Zombie: experience with DXM with CPM & Cannabis (ID 45038)\". Erowid.org. Jun 5, 2008. erowid.org/exp/45038",
  "substance": "DXM with CPM & Cannabis",
  "views": "4037"
 }
}
