{
 "title": "Mushroom Forest",
 "author": "Superman",
 "citation": " Superman. \"Mushroom Forest: experience with DXM, Mushrooms, & Cannabis (ID 16398)\". Erowid.org. Jul 31, 2002. erowid.org/exp/16398",
 "substance": "DXM, Mushrooms, & Cannabis",
 "bodyweight": "155 lb",
 "report": "<p>This trip was originally supposed to be a recreational DXM trip with my buddy Zach.  I went to the store around 9:00 pm to pick up 3 8 oz. bottles of Robo and returned home.  This being one of our first times using DXM, we were going to stay around the first plateau.  Zach came over around 10:00 pm.  He brought 2 grams of Shrooms and a joint.  We figured it was only a gram each, and it was only a joint, so we drank the Robotussin, then took the Shrooms and smoked the joint.  Oviously we didn't know what we were getting into.</p><p>On the plus side, I had the house to myself for the next few days, so we were in a safe environment.  On the down side, we had no sober trip watchers with us.  Oddly, the DXM didn't kick in until around 12:45, which made us wonder if taking DXM w/ Shrooms and Cannabis would cancel out the effect.  Not even close.</p><p>When 12:45 came around, we felt the first plateau come into effect.  We didn't feel any urge to vomit at all, which was a good sign.  From this point on I will describe my experience, because I am not clear on the experience of my friend's at this time.</p><p>Laying on my bed, I was listening to music.  Although it sounded familiar, I could not grasp the name of the band or the song.  I'm not sure exactly when I could feel my peak hit, but I do remember what I felt.  I was stumbling downstairs when it hit.  All of a sudden, I wasn't in my house anymore.  I was in a jungle.  All I could see was trees and giant mushrooms all over.  There was a path, so I started down it.  I came to a huge boulder shaped like some kind of four-legged animal.  I knew I had to climb it to get to where I was going to.  But where was I going to?  I didn't know.  All I knew was that I needed to get there.  I started climbing.  When I was about 50 ft. up, I fell.  As I was falling I could see them all laughing at me.  I don't know who they were, but they were all laughing.</p><p>Silence.  I woke up on my living room floor.  I am very confused right now.  I remember my friend being over, but I don't know if he's still at my house.  I don't even know if I'm still at my house.  After what seems like hours, (probably about 30 seconds) I attempt to get up and find my friend.  I stumble up the stairs.  It takes me a while, but I finally make it back to my room to find Zach.  I don't remember how I got to my room, but I got there.</p><p>It turns out I was only downstairs for 20 minutes.  It seemed like 3 days.  To the best of my knowledge, Zach spent the 20 minutes in my room listening to music.  As we come down, we both listen to music.  My friend wanted me to drive him home, but I restrained myself in fear of killing us both in an accident.</p><p>To this day I haven't tripped harder then that night.  I warn everyone who takes DXM and everyone who takes DXM along with other drugs.  It didn't take much Robotussin to make me trip that hard, with the help of Shrooms and Cannabis.  To the best of my knowledge, if you take more the one kind of drug at a time, the results make astonish you.  It sure caught me by suprise.</p><p>AGAIN I WANT TO WARN ANYONE WHO TAKES DXM WITH SOME OTHER DRUG, PLEASE GET A TRIP SITTER OR MAKE SURE YOUR ENVIRONMENT IS SAFE AND SECURE.</p>",
 "year": "2002",
 "id": "16398",
 "gender": "Male",
 "timestamp": "2002-07-31T07:00:00.000Z",
 "views": "18650",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "12 oz",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": "",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
