{
 "title": "Sensual Overload",
 "author": "Kosmo",
 "citation": " Kosmo. \"Sensual Overload: experience with 5-MeO-DiPT (ID 16402)\". Erowid.org. Jul 31, 2006. erowid.org/exp/16402",
 "substance": "5-MeO-DiPT",
 "bodyweight": "210 lb",
 "report": "<p>12:00 pm - Insufflated 3mg crystals</p><p>12:15 pm - Slight surge in energy, colors are brighter, especially reds</p><p>12:30 pm - Insufflated 3 mg crystals</p><p>1:00 pm - Definite surge in energy, the come up is almost too fast, surprisingly speedy feeling.  I go about doing chores around the house, cleaning and putting things away while listening to music. </p><p>1:30 pm - Insufflate 1mg- begin to really feel this now.  The energy is similar to coming up on mushrooms, although more 'synthetic' feeling.  Music is lush and powerful, moving around is very enjoyable.  No OEV or CEV, although when I lay down for a few minutes to relax I have visions of people dancing.  I don't normally like to dance but this makes me want to for some reason. </p><p>2:00 pm - Very sensual now.  Rubbing my skin feels wonderful.  I believe this would be a great aphrodisiac at low doses.  Emotionally I feel happy and relaxed, although there is quite a bit of tension in my body. </p><p>3:00 pm - Coming down, but still full of energy.  Still feel that 'mushroomy' buzz, almost like my body has too much oxygen. Drank a beer to calm my body a bit.  It definitely helped, as did a cigarette.</p><p>I came down very slowly after this, still feeling the drug at around 7pm.  Later that night I was quite tired and slept soundly for 8 hours and had very vivid dreams.</p><p>At this dosage I felt effects similar to low dose mushrooms along with the more pleasant aspects of MDMA.  In fact there were several moments where I felt just like I was on MDMA, but they came and went unpredictably. </p><p>There were moments when the physical sensuality of it was almost overwhelming and uncomfortable, even at this rather modest dose.</p>",
 "year": "2002",
 "id": "16402",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-31T07:00:00.000Z",
 "views": "4128",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "3.0 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 1:30",
   "amount": "1.0 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 3:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "4": {
   "time": " T+ 3:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
