{
 "id": 16404,
 "title": "The Microsecond",
 "date": {
  "submission": "2005-12-22T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "*CrUsTy  The Cl0WN*",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "insufflated",
   "substance": "Amphetamines"
  },
  {
   "time": "0",
   "amount": {
    "unit": "0:10",
    "quantity": "T+"
   },
   "administration": "40 mg",
   "substance": "oral"
  },
  {
   "time": "4-Acetoxy-DET",
   "amount": "(pill / tablet)",
   "administration": "T+ 0:00",
   "substance": "20 mg"
  }
 ],
 "report": [
  "A little about myself. My name is Jonathan but everyone call me John and I live in Sweden. I am kind of trapped on psychedelic music, substances and behaviour :). I have tried a lot of substances, and I am very Sceptical against new stuff because I need a big dosage for it to be able to have any effects on me at all. I have tripped on Acid many times and thats what I prefer, but this combination is an exception!",
  "I called a friend to ask him why he didnt show up to a party that took place three days earlier. He later on told me he had something for me and that hed come by later.",
  "When he arrived at my place he gave me 2 Pills of 5-MeO-DiPT and 4 pills of 4-Acetoxy-DET 10mg each, and told me to combine them cause they would kick ass if so. Later on I took all of them in a row just about 10 minutes after I snorted some speed (very little) to reinforce the trip.",
  "About 30-40 minutes later the first wave came on and it felt like a combination of psilocybin and MDMA (+ the Erotic feeling) but not to strong though. About 60-80 minutes after the ingestion I was lying on the couch watching some TV when it felt like someone superior grabbed my hair and dragged me up through the roof, up to the sky and through the universe and back again in one microsecond (Wow!). The intense disoriented feeling of the nothingness made my body feel a strong falling. I admit that it was one of the scariest and most incredible moments Ive been through. When that microsecond of incredible appearance ended I was naturally back on the couch and you can imagine what my face looked like :), but it was only about to begin. Lying on the couch I then looked down on the floor and realized that the couch was floating. All I thought of was how to also make the TV float, so I could be able to see it from the wonderful floating couch created by the wonderful mind travel that by the way was white when it actually is black (the couch).",
  "The only thing that worried me was the bathroom. There is nothing more helpless and irresponsible than a man completely wasted on psychedelics on the depths of a bathroom floor. Too bad I completely understood thanks to someone superior that Id get in that rut pretty soon. After another hour of visually appearance on the couch, I jumped down and landed in a different room of the house (condo) witch was really strange because it had been 2 hours from the moment I teleported to the other section of the house. I have no goddamn clue what the hell I was doing during those two electromagnetic hours. (After about an hour after ingestion I started to feel what I call electromagnetic which didnt stop until the next day). Physical and mental collapse is now very real' with a nasty voice was what I heard in my head every 2 minutes for the rest of the trip while I was walking around the house watching the retrospective hallucinogenic show, wondering What was the meaning of this trip? was I just walking around in the craziest hall in the mind of a five year old kid? I dont know. I knew that the influence of the hall and all the mirrors on the normality of a Friday afternoon could lead me to the absorbance of a retrospective nightmare, and I really didnt want that.",
  "I know there is a lot more to tell but that is all I remember. And one more thing, I am not sure if I am right but I think it was my LSD damaged mind that created this strong trip. All in all I loved these substances especially 4-Aco-Det + 5-Meo-Dmt combined And I will definitely do it again and again and again =D."
 ],
 "erowid": {
  "id": "45107",
  "citation": " *CrUsTy  The Cl0WN*. \"The Microsecond: experience with 4-Acetoxy-DET, 5Meo-DIPT & Amphetamines (ID 45107)\". Erowid.org. Dec 22, 2005. erowid.org/exp/45107",
  "substance": "4-Acetoxy-DET, 5Meo-DIPT & Amphetamines",
  "views": "6950"
 }
}
