{
 "title": "My Life on Ether",
 "author": "Universal U",
 "citation": " Universal U. \"My Life on Ether: experience with Diethyl Ether & Inhalants (Starter Fluid) (ID 16413)\". Erowid.org. Feb 11, 2004. erowid.org/exp/16413",
 "substance": "Diethyl Ether & Inhalants (Starter Fluid)",
 "bodyweight": "165 lb",
 "report": "<p>[Erowid Warning: The water extraction method is ineffective in separating diethyl ether from the volatile hydrocarbon liquids/gases in starter fluid. Our understanding of the literature is that there is no such thing as safe use of volatile hydrocarbon gases: their psychoactive effects are inseparable from nerve and organ damage.]</p><p>This is the account of the first time I ever tried ether. I tried it several more times afterwards however this trip was definitely the wierdest.  It all started during spring break of my sophmore year. I was walking around downtown with two of my good friends. While the only drug I take part in normally is weed we were fresh out.</p><p>Anyway, one of my friends suggested we huff ether, he said he had tried it before and you couldn't die from it (which I later found out was bullshit). I became interested and asked what we would do. He said we could go to a gas station and buy a can of starter fluid, we would also have to purchase rags. We did these things then went to a nearby wooded area.</p><p>In this area we sprayed the ether into the rags and began huffing. My other friend did not huff which turned out to be helpful later, but back to the story. After about a minute everything I saw became very glossy and soon i was higher then I'd ever been in my entire life. My friend who was huffing with me stared acting very strangely I merely became confused. At this point I realized he was the devil. Which is stange becuase I'm an atheist. But I became convinced the devil was trying to kill me and just as i was preparing to do something about it the ether kicked into high gear.</p><p>First i will tell you what my friends saw during this period of time. They noticed me twitch a little and then fall to the ground. After a while they started to worry about me so the one who was huffing poked me. I quickly got up and tackled him. Then started running after my other friend trying to tell him something. After a while I calmed down and told them what I'm about to tell you.</p><p>Here is what I saw. First I realized I was the universe and all this time I had just been playing a trick on myself. Nothing truly exsisted except for my thought. In my mind I just kept falling and trying to catch myself however this was impossible. After a few minutes of this I started to come to. I saw my friends, but I couldn't move. I WAS DEAD! He was the devil, and he had succeeded in killing me! At least I thought that. I thought I was a ghost so I would go right through him. So I attacked my friend. At this point I knew I wasn't dead. And that's when I knew everything. Literally everything. Thats why I tried to chase my non-huffing friend so I could explain everything to him. But at the exact second I caught him I forgot.</p><p>All in all a fun experience and a good story to tell but personally I wouldn't suggest ether.</p>",
 "year": "2002",
 "id": "16413",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-11T08:00:00.000Z",
 "views": "39034",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(gas)"
  }
 }
}
