{
 "id": 1644,
 "title": "Intense Painkilling Combo",
 "date": {
  "submission": "2008-02-05T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Harpo Marx",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol"
  },
  {
   "time": "1:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I had a most intense experience recently with the combination of Tramadol, DXM, and a little marijuana. I started off by taking 150 milligrams of tramadol. Since it usually takes 2 hours to hit me, I waited an hour and then took 100 milligrams of DXM, so that the two would come on at the same time. When they did, I experienced a mild and pleasant general painkilling effect, similar to a strong hydrocodone buzz.",
  "After a bit, I shared a joint with a friend, and that's where the intensity began. I immediately got a rush of euphoria and was getting very sleepy. Time was going very slowly, and my throat dried up like sand. I could no longer walk straight. I attempted to walk around my apartment complex to get some fresh air. I wobbled and stumbled around outside. It seemed to take forever to get anywhere. I could not feel my body at all. I was totally numb. Mentally, the same thing began to happen. As the marijuana wore off, I found myself in a profoundly 'dumb' state. The painkilling effect was so great that I could not think incredibly deeply, and later, when I listened to music, it seemed dull and uninteresting. My imagination was almost blank.",
  "I must admit, this buzz was NOT the most pleasant in the world. It was too much for me. I felt more fucked up than I wanted to be. I enjoy a nice buzz. With this, I was just 'trashed'. My eyes were glassy and dilated (from the DXM). At one point I slurred a comment to my friend that I felt like I was on acid and drunk.",
  "I had read before trying this combo that DXM is used medically to potentiate the effects of painkillers, so that patients can take less of their pain meds and lessen dependance. I urge strong caution here, however. It was indeed true. I get only a mild buzz from either the tramadol at 150mg, or DXM at 100mg, but the combination of the two turned out to be more than I wanted. And the marijuana, I am positive, intensified it even more.",
  "The effects lasted around 5 hours, and I fell into a deep sleep. I awoke feeling fine the next day, with no sign of a hangover.",
  "I may try this combo again, however I would lessen the dose of DXM by half, and probably avoid the marijuana until at least halfway though the experience."
 ],
 "erowid": {
  "id": "15181",
  "citation": " Harpo Marx. \"Intense Painkilling Combo: experience with Tramadol, DXM & Cannabis (ID 15181)\". Erowid.org. Feb 5, 2008. erowid.org/exp/15181",
  "substance": "Tramadol, DXM & Cannabis",
  "views": "13061"
 }
}
