{
 "id": 16441,
 "title": "The Glow is Over",
 "date": {
  "submission": "2001-01-08T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Trinity",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "For a while, i thought that ecstasy was INCREDIBLE. In fact, i still do, but things have changed. In May, I tried rolling for the first time at a rave, and there were no words to describe it. All of a sudden, everything was perfect, my friends were amazing, and i had a new respect for glowsticks and vicks inhalers. My summer turned into roll-fest. My friends and i were consumed by pills and raves. I did not think that life could get any better. I'm normally a sweet and friendly person, but I was so open on E and i never wanted the feeling to end. I've always loved techno, but now i bowed down to the genre. Honestly, there was absoultely nothing better than being blown up. It was like the unspoken meaning of life. Our free time was spent reflecting on the previous night's experience. We had a blast acting stupid, being massaged by random guys, etc...im sure you can get the picture. I didnt even mind the next day spent recovering my poor body. I've always stuck to just one pill, until one night, when i became adventurous, and bought two-WOW-once again, there are no words. I did not have a care in the world, my life seemed to improve so much by mdma...i was gaining a new appreciation for things when i was sober, as well. I saw no end to my rolling days...the dosages increased until one night i reached my peak-i swallowed 4 motorolas, and i don't think that anything will ever compare to that night. Thoughts flowed through my head a mile a second, and i could not talk fast enough, or stop dancing.",
  "Since that night, however, i have rolled 4 more times, and nothing has ever compared. I dont know if it is the quality of the pills here in south florida, or that i have simply just grown up. I rolled again at zenfest, and it was a total disappointment. Peaking does not have the same effect on me anymore, and the negative effects were outweighing the positive ones. I decided to give E one more try, on new years night, at a party with my boyfriend. The pills were definitely top quality, and i felt a return of the old feelings i had once felt, just a few months ago. However, i did not want to be blown up with glowsticks, or pretty much anything. I just wanted to sit and talk and kiss  my boyfriend, who i love. And even thought i felt amazing, there was a feeling of familiarity in my head the whole night-it was BORING, as much as i hate to admit it.",
  "Watching a girl rolling for her first time, i felt sad in a way, because there is no way i will ever feel as great as she did that night, now i only feel 'fucked-up.' It's not worth it anymore. There is a rave in march that i am going to, and maybe if i wait until then, the old feelings will completely return, but i doubt it. Unfortunately, ive outgrown ecstasy. My advice to anyone that is reading this is to appreciate the times you have on E, and do not overuse it, because it will lose its magic."
 ],
 "erowid": {
  "id": "4528",
  "citation": " Trinity. \"The Glow is Over: experience with Ecstasy (ID 4528)\". Erowid.org. Jan 8, 2001. erowid.org/exp/4528",
  "substance": "Ecstasy",
  "views": "6594"
 }
}
