{
 "id": 16445,
 "title": "Retry",
 "date": {
  "submission": "2006-12-05T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Windchild",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "seeds"
   },
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "After a rather disappointing non-trip with insuffulated ground columbrina seeds I decided to give this substance and route another try, this time with better preparation.",
  "5 seeds of anandenanthera c. were microwave-popped, and crushed in my new-bought mortar (tadaaa! - did I mention that? get a mortar if you plan on doing such preparations), together with some limestone and baking soda (after learning that limestone is nothing more than chalk [CaCO3], I got slight doubts about its solubility - might be that actually caustic potash [CaCO - quite dangerous stuff!] is to be used - these things often get confused in translations - so I added some baking soda to have at least *some* base. End product was nearly a teaspoon of grayish-brownish powder (about as fine as flour) with some dark speckles of seed shells which I just wasnt able to grind down.",
  "The insuffulation was uncomplicated this time, no pain to speak of, and not as nasty a taste (just grind this stuff FINE, then it's ok).",
  "The effects were milder than the last time, though the peak was far more noticeable (quicker insuffulation). I learned that maybe my limestone was none, though, so that might be explained by less base (baking soda).",
  "The effects basically were: noticeable intoxication, slight motor effects, some visuals, general mood elevation."
 ],
 "erowid": {
  "id": "45287",
  "citation": " Windchild. \"Retry: experience with Anadenanthera colubrina (ID 45287)\". Erowid.org. Dec 5, 2006. erowid.org/exp/45287",
  "substance": "Anadenanthera colubrina",
  "views": "8577"
 }
}
