{
 "id": 16456,
 "title": "Unlocking the Door to the Real Existance",
 "date": {
  "submission": "2007-11-15T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Spectre",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(cookie / food)"
  }
 ],
 "report": [
  "Mushrooms, the key to unlocking myself and new perspectives on life.  Before I start I just want to say, mushrooms made my life better.  They made me see the silver lining, the truth. About 3 years ago, a few of my friends and I decided to take shrooms.  They have done them a couple times before, and I had tried it once, with little to no effect.",
  "We each bought 2 grams in brownie form (mmm) and ingested them sometime around 8 pm.  After the initial hour or so waiting period, we finally decided to leave my friends basement and walk around, and let whatever was going to happen, happen.  Around 9 pm we arrived on foot at a local park.  We sat on the bleachers and let the shrooms take hold of us.  I remember quite vividly the onset, the shift from this perspective to the next.  This perspective, or life that we all live and exist in everyday was finally slipping away.  I was now entering the real existance.  The existance we all once knew, but for whatever reason forgot, and chose to block out. ",
  "The first signs of the shifting perspective was my vision.  We were sitting on the bleachers at the park, in front of us was a huge chain link fence that was for the baseball diamond.  I remember just gazing at the chain links, slowly but surely, they were all melting downwards, almost dripping to the ground.  I remember looking at the wooden planks of the seat we were sitting on.  I glanced at it and noticed 3 knots in the wood.  They took the form of 3 felines.  One a tiger, one a panther, and one a lion.  Im fond of cats so I dont know if this had any impact on what I saw, but I definitely saw these images of 3 large cats in the wood, as knots.  I did not tell anyone of my friends what I was seeing.",
  "We sat there for about an hour talking about everything we could think of.  Namely, my friend S, told me he could not picture himself as me.   He thinks I dont talk much, but rather I only speak when its needed - I dont gossip, Im not that type of person, although I do like engrossing conversations, just hate gossip and the like.  I told him I couldnt picture myself as him either, for whatever reason.  I dont think anyone can picture themselves as anyone else.  Different mindset, ideas, etc...",
  "After about an hour or so we got up and started walking towards my friends house again, the field of grass surrounding us felt like a jungle.  The grass felt so soft when I stepped on it (I had shoes on) that it was undescribable.  Once we got on the pavement is where things really got weird.  On the street near my friends house there is long lines of concrete that the city patched up with asphalt or whatever to fill the cracks in.  I stopped in disbelief to see these lines flowing.  Almost matrix like.  Everything was flowing, everything was moving. Tree's, bushes, grass, everything related to nature was breathing or moving in some way or another.  It was a great feeling, everything was alive. ",
  "I felt that this was the true nature of things.  This is how we were meant to see things.  This is how things were meant to be.  I had so many ideas flowing through my head.  Things I've done in the past that I regretted, things I wish I would do in the future.",
  "Every thought came with crystal clarity.  It all made sense, sort of.  Why we have certain habits? Why we treat people a certain way.  Why we act certain ways in different situations.  How predictable we all are.  How stupid we are.  How ignorant we are.",
  "For the first time in my life, I was truly happy and astonished by this existance we call life.  It was almost as if all along I was just skimming along the surface, not breaking through and really experiencing anything.  I felt sad but happy at the same time knowing what I've found and that I could use this information and new perspective to live a better life and treat people better.  After about 3 or 4 hours of hanging out with my friends, they decided they wanted to smoke a joint in their car.  I decided against it.  I didnt see a point in smoking weed to 'try and get more high' - I was more high than I could ever be. I was high on life and didnt need anything else.  So I started walking home, it would only take me about 25 minutes. ",
  "As I started the walk back home, the same thoughts of what am I doing here, how can I make my life better, etc, continually went through my head. I passed my hand through a bush on the sidewalk, it felt surreal.  My sense of touch was magnified 100 times.  I neared my house and as I was walking up my driveway, I noticed one of our cats was outside in the front yard.  It started walking towards me as I neared my door.  I pet its back and I can still remember to this day how soft it felt. It meowed at me as if it were talking to me.  I meowed back.  It was awesome.  I then realized there's beauty in everything, sometimes you just need to stop and take a look at what it is.  Beauty is all around us.  We have just become so used to it that it's nothing to us now.   For most people at least, I think.  The cat seemed so innocent and happy.  I was happy that it was happy.",
  "I walked inside and everything had a 'new' space age type feel to it.  Bathrooms were weird, computers were weird.  Especially my keyboard.  I tried playing a computer game and talking to my friends on MSN, the keyboard seemed flat and different, and it took me a while to get my typing skills back, as weird as that may sound.  Later that night when I was still high, but coming down - I wanted to walk into the living room to tell my parents that I was on mushrooms, and I wanted to tell them everything that I've discovered about myself and life in general... but I couldn't.  I didnt think, no, I knew they wouldnt understand, and they would most likely get angry more than anything for me being under the influence of shrooms.  Even though shrooms are the key to unlocking the door to real existance.  The way to make our ignorant minds sober again.  To really see things, the way they were, and are meant to be seen.",
  "To this day, I have not changed all my habits.  I still somehow conform to society's standards even though I know I shouldnt have to, nor do I want to.  But it's so hard, we're all conditioned this way, but why?  What's the reason?  Why cant we all live in this existance, all on the same plane? ",
  "I still dont know.  Maybe our minds can only take so much of the 'truth'.  The truth to what really is, and what isnt.  Our minds are the most powerful tools on this planet, yet we still fail to master it.  It's the human condition.  We're all in this existance together whether we like it or not.  Why cant we just all get a long and make this paradise we call earth a better place?  Why?  Because of ego.  People need to feed their ego and live for the materialistic things in life.  And not living for a real reason.",
  "But who am I to say whats to live for? Who am I to say whats right and whats wrong?  Im just a simple man that has seen the right way of things.  Im just an ego stuck in this organic machine like the rest of us.  The only difference is Ive seen the truth.  Im only human."
 ],
 "erowid": {
  "id": "45349",
  "citation": " Spectre. \"Unlocking the Door to the Real Existance: experience with Mushrooms (ID 45349)\". Erowid.org. Nov 15, 2007. erowid.org/exp/45349",
  "substance": "Mushrooms",
  "views": "3149"
 }
}
