{
 "id": 16463,
 "title": "Lonely House Party",
 "date": {
  "submission": "2006-08-28T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Xacci",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "420 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "64 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Datura",
   "form": "seeds"
  }
 ],
 "report": [
  "[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]\r[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]",
  "The Day starts at 4pm.  I go to pick up some Tripple C's and went to go pick up a friend that was about 15min away (took one box) I drove there, but the friend (Mr.2) wasn't there. But another friend was (Mr.1) We decided to go back to my house, about 30min drive.",
  "I get to my house and we sit around playing perfect dark when I ask if he'd like to try something new with me. Datura. He said yes so I pulled out my mason jar of extract from one 3ft. plant (seed pods and stems) and shared tsp each of seeds.",
  "Waited about three hours play Perfect Dark. Losing badly.  Left to go to another friends house (30-35min drive) I black out after we left the house in the car and came too about 10 min later in the middle of an intersection at 8pm.  I looked over at Mr.1 and his face twisted in two and came back again as someone else trying to say something to me. I just took at as a look of confidence for some reason and drove on, instantly blacked out again and came to in Mr.2's house.",
  "I blacked out thru most of it, but my girlfriend called and told me I said a house party was going on and that I said I was someone else on the phone then yet again another person then another then myself. [I found out later no one was there but me and Mr.1] I left shortly after someone showed up and wrecked into 2 parked cars a bank and did 60mph into a dirt pile and ramped into a ditch. I woke up 3days later in jail. Heard a lot of stories of all the 'weird things' I had been doing over the last few days, and sat in jail for over a month.",
  "As time went on, I've remembered more and more... I can recall now opening the car door after I wrecked and seeing the night sky flow out from my feet and being scared and shutting the door and seeing the white powder of the air bags and thinking it was clouds with faces that hated me and tried to choke me. And parts of the questioning I received at the police station. I wouldn't answer and kept begging for water so they took me to a water fountain and I couldn't figure out how it worked so they kept saying they'd give me something to drink if I told them something so I just laid on the ground."
 ],
 "erowid": {
  "id": "45371",
  "citation": " Xacci. \"Lonely House Party: experience with Datura & DXM (with CPM) (ID 45371)\". Erowid.org. Aug 28, 2006. erowid.org/exp/45371",
  "substance": "Datura & DXM (with CPM)",
  "views": "24048"
 }
}
