{
 "id": 16467,
 "title": "Trippin and Slippin",
 "date": {
  "submission": "2008-12-18T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Jim",
  "gender": "Male",
  "weight": "185 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I first moved into my college dorm room not knowing what to expect. I had transferred to a new school, with my girlfriend and another friend. The campus seemed, well dull and dry as could be. So all we had to keep ourselves entertained was the local liquor store that did not id. From the looks of most of the other students I wouldnt be finding anything to smoke until I returned home. I had no idea that a drug dealer lived only a few rooms down the hall!",
  "Eventually this came to my attention, as the familiar smell of cannabis filled the hallway. Being that this was a freshman/transfer student dorm building I figured hey they are probably looking to make a few friends who also smoke. So I gave his door a knock, and nothing. Somewhat depressed I headed back to my room mentioning what I had smelled to my girlfriend. Fortunately the next day I saw him in the hallway, so I decided to start a conversation with him. Eventually finding out he sold weed, acid, shrooms and other various drugs. At first I just stuck to good old weed. After about a month of knowing him, and becoming fairly good friends with him, he offered me acid for $10 a hit. So we (my girlfriend, friend and I) decided to try it.",
  "The first 45 minutes went by and absolutely no effects were noticed. After about an hour and a half after taking the acid I began to intensely feel the effects. I began to question the nature of things for some odd reason. This led me to my 30 gallon fish tank, which I had recently purchased. I began rambling on about how these fish should be free, and what a shitty life they must be living now. This conversation brought my friend and girlfriend to the tank. They began gazing, and my girlfriend agreed with my comment. I began to hate the people that must have captured them and sent them to the pet store ultimately doomed to swim in my rectangular tank for the remainder of their lives.",
  "I suddenly realized someone was knocking on my door. I was relieved to find out it was just the kid from down the hall. He instantly knew we were on acid and began to smile. We invited him to spend the night with us and he took 2 hits. Seeing this I decided to get each of us another hit. So after taking that we decided to go outside. Little did we know there was a rather large amount of snow falling in our area, which made the experience wonderful. Everything was blanketed with snow, and glistening. At first I wanted to run back upstairs to grab my jacket because it happened to be a fairly cold night. However, we began walking towards this large parking lot on the campus and the longer I walked the warmer I became. Eventually I felt perfectly fine wearing a t-shirt and jeans.",
  "Once at the parking lot, we were in for a hilarious experience. While walking around we all managed to end up on a sheet of ice that built up on the blacktop of the parking lot. For some reason I felt like ice-skating in my sneakers, and my girlfriend began to follow my lead. She fell backwards and we all started laughing so hard. I slipped and fell to the ground from laughing and that only made everyone laugh harder. After a few minutes everyone was on the ground laughing. Eventually we all regained our balance and headed back into the dorm.",
  "Before I met them in my room I went to one of the many shared bathrooms in my building. My school had these already trippy looking floor tiles that we all used to joke around about on the bathroom floors and walls. They now began to swirl but only when I concentrated on the toilet bowl. It was one of those out of the corner of my eye kinda things. Every time I looked at the tiles they stopped, and began swirling every time I looked back at the toilet. This kept me entertained for what seemed like 10 minutes but what was probably only 1 or 2 minutes.",
  "I decided to head back to my room and meet back up with my friends. After only half an hour I decided to go for a drive. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  It had to be 11 pm and because of the snow storm nobody was traveling on the roads. Also I figured I swerved slightly because of the effects of the acid I could blame it on the snow. It wasnt really that bad at first. I really tried to concentrate only on driving and that wasnt all too difficult. I began to feel connected through the car somehow while driving along. Especially so when I pressed the breaks, I could feel the pulsation of the anti-lock breaks. It seemed to shoot up through my entire body and it almost felt like a pain. Similar to that sort of pain associated with nails on a chalk board.",
  "In any event we arrived at the 7eleven and purchased random snacks, although the acid didnt give me the munchies at all. We decided to smoke when we arrived back at the dorm so we grabbed some cigars and snacks for the expected munchies. We began to watch The Butterfly Effect, and I almost shit myself. I love the movie straight or even while smoking weed, but definitely not on acid. Everyone unanimously wanted to stop watching it, so we turned on some techno and Winamp visualizations. I normally dont listen to much techno, unless high, but its excellent while on acid.",
  "Eventually the night came to an end, everyone left except my girlfriend and I, so we tried to sleep. Unfortunately this didnt seem possible, as we laid there for half an hour with no progress. So we talked the night away, about every subject that came to mind. Overall an amazing experience and I have taken acid several times after this first time."
 ],
 "erowid": {
  "id": "45384",
  "citation": " Jim. \"Trippin and Slippin: experience with LSD (ID 45384)\". Erowid.org. Dec 18, 2008. erowid.org/exp/45384",
  "substance": "LSD",
  "views": "3017"
 }
}
