{
 "id": 16461,
 "title": "Riding the Snowline",
 "date": {
  "submission": "2007-11-06T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Happy and sober",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol"
  }
 ],
 "report": [
  "<p>The first time that I was exposed to coke was in 1999 in a trip to Canada. My boyfriend at that time was heavily into coke and I insisted on trying it to see what the hell it was all about (and where all my $$ were going.)",
  "My first tiny line was in a bathroom in Toronto and it felt like nothing that I'd ever experienced  - a real 'buzz'. After that my usage increased slowly as availability was a real issue and my 'partner' had some real paranoia issues and after experiences with 'people' finding their way into our fifth floor apartment through locked doors, I moved on! (Even Star Trek transporters would be hard pushed to get as many people into the space as my ex imagined were there.)",
  "Later on I managed to avail myself of a direct source and began experimenting with considerably increased doses and eventually lost a few very enjoyable weekends with myself and a ball.",
  "Coke has always been a solitary yet sexual experience and one that I have thoroughly enjoyed. My sexual drive went through the roof with that first (increasingly large) line and I could jerk off to porn, written or visual for many, many hours - drinking large amounts of vodka or red wine and snorting larger volumes of coke and having a wonderful time. An amazing high, an amazing waste of a weekend but all in all, the weekends were something that I would repeat - I enjoyed the experience, had a great time that didn't hurt anyone else directly and had the physical luck to be able to fucntion normally afterwards.",
  "I don't agree with doing this if it affects anyone else, although I would love to have one experience with a willing partner - the sexual feeling might be one hell of a ride.</p>"
 ],
 "erowid": {
  "id": "45367",
  "citation": " Happy and sober. \"Riding the Snowline: experience with Cocaine & Alcohol (ID 45367)\". Erowid.org. Nov 6, 2007. erowid.org/exp/45367",
  "substance": "Cocaine & Alcohol",
  "views": "3838"
 }
}
