{
 "id": 16473,
 "title": "Wild Ride",
 "date": {
  "submission": "2008-12-18T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Babydoll",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "1900 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I was bored and had nothing to do one night, so I decided to experiment with my prescribed anti-anxiety med, Neurontin.  My prescribed dose is 200mg so I figure 1900mg would be fun.  Hmmm, maybe not so smart - but hey, look who's talking.",
  "Anyway, shortly after popping the pills my girl calls to hang out.  So I figure hey, why not and I drive over t pick her up. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]   Hmmm, not smart - don't drive under the influence, kids.  But anyway we're riding along and decide to try to pick up some guys.  I'm usually shy, but within an hour after popping the pills all I want to do is meet people.  I'm singing at the top of my lungs to the music and just having an amazing time.  I thought that would be the extent of my high but I was wrong.",
  "Soon after, my vision starts to get blury and all the lights on the road start to blend together.  Eh-oh.  But of course I keep driving.",
  "We decide to go over to 7-11 to see who's around.  We meet some guys and I agree to drive one of them home to a town that I've never been to.  So I pick up him and his friend and we're driving - having a blast with total strangers.  Hmmm, usually I would be freaking out, but I was having the time of my life.  We finally get him home and my friend and the other guy's friend drive back to my town, but of course, we get horribly lost.  So we're driving around and me with fucked up vision runs a red light.  Shit.  After about an hour of driving around at 1 am we find our way home alive.  I drop everyone off and go back to 7-11.",
  "I try to get out of the car and I feel like I'm drunk.  I can barely walk and I'm stumbling around.  I feel ridiculously stoned, sort of like a cross between marijuana and pot.  I end up getting coffee and hanging out on the curb.  Somehow all the lights of the cars are really interesting to me and I spend about an hour just watching people, absolutely absorbed in it.  I finally decide to go home, but I can't get up.  My space and depth perception is really distorted and I just feel really heavy.",
  "After a dangerous ride home, which I survived thanks to no one being on the road, I stumble home and lay on my bed listening to music.  I close my eyes and get amazing CEVs similar to those on dxm.  Then I just kind of floated away into sleep.",
  "When I woke up I was slightly dizzy but generally felt fine.  Overall, it was a pretty good high.  I would describe the high as a mix between marijuana, alcohol, dxm, and xanax, all social inhibitions are gone and there's a huge sense of euphoria.  I wouldn't do it that often, but it's definately good for social anxiety."
 ],
 "erowid": {
  "id": "45396",
  "citation": " Babydoll. \"Wild Ride: experience with Gabapentin (Neurontin) (ID 45396)\". Erowid.org. Dec 18, 2008. erowid.org/exp/45396",
  "substance": "Gabapentin (Neurontin)",
  "views": "33667"
 }
}
