{
 "id": 16485,
 "title": "First Time with any Hallucinogen",
 "date": {
  "submission": "2008-12-15T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Herbals",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder / crystals"
  },
  {
   "time": "1:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder / crystals"
  },
  {
   "time": "2:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "2:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": ""
  }
 ],
 "report": [
  "I was recently hanging out a friends house around 6pm and was just sitting around and I was looking for a little extra smoke from a friend so I asked him if he had any , he said 'No,but I got some other stuff' and I found out what it was and all and said sure I try some.So he weighed out about 5-10mg and I mixed it with a glass of water.",
  "I waited about and hour or so,but didnt feel anything. So before I left my friend offered me some more,and since I wasnt feeling anything I was like 'Sure'. So i took about 5 more mg.Then left my friends house and headed home.By the time I got home about 8-8:30, I took  the 5mg I felt it a little bit.Then I decided to roll a j , and after i did I was watching the tv and I thought the tv was getting fuzzy or something but it was me.",
  "Since I had never done anything except pot,and e ,I didnt really know what the signs were when your starting to feel it.So here I am an hour later just staring at the doors and ceiling and its insane because everything is waving and floating like water.So then my door opens and its my dad.AHHH!!!So here I am straight tripping trying to keep it cool with my pops in the room.So im looking at him and the chair he's sitting in looks like a water bed just moving.He eventually leaves and I'm like 'Whew'.",
  "So after he leaves I continue to embrace everything around me and I call my friend that gave it to me and tell him its the craziest thing ive ever done and told him to save some more.So its about 10-11 o clock somewhere around there and its still going pretty good,then I go to the bathroom and notice some even trippier things with the cracks in the walls started getting bigger.I eventually decide to call it night about 2 in the morning still feeling ok,so I smoke a bowl and lay down and goto sleep.So overall its was a very nice experience and I plan on doing it again."
 ],
 "erowid": {
  "id": "45435",
  "citation": " Herbals. \"First Time with any Hallucinogen: experience with 2C-I (ID 45435)\". Erowid.org. Dec 15, 2008. erowid.org/exp/45435",
  "substance": "2C-I",
  "views": "3088"
 }
}
