{
 "id": 16496,
 "title": "Superior Heroic Remedy",
 "date": {
  "submission": "2012-01-12T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Serenity",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Poppies",
   "form": "extract",
   "specific": "Opium"
  },
  {
   "time": "0",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "Around the start of the sixteenth century the Swiss physician Paracelsus wrote 'I possess a secret remedy which I call laudanum and which is superior to all other heroic remedies'.",
  "According to an article by Sir William Osler, 'A significant advance in opium-processing occurred in the sixteenth century. In freebase form, the alkaloids found in opium are significantly less soluble in water than in alcohol.'",
  "Laudunum [literally: 'something to be praised')is simply a tincture of Morphine in alcohol.",
  "Obviously not many have a chemistry set to make a true batch of laudanum but this simple kitchen recipe comes pretty close. Now, since I am a chronic pain sufferer who used to be hooked on oxy's and norcos I have to say that this has been a very good alternative to ordering pills online and/or copping dope on the street. I even used this stuff to detox from methadone once. Albeit a small habit, (20 mls a day)",
  "It can make me nauseus and will give me withdrawal symptoms if I suddenly stop but its nothing taking some valerian and/or kava won't help.",
  "If you are in pain and either cannot or will not take meds, or do dope, this recipe works fairly well. If you are trying to detox this stuff helps. If you're just trying to get high between fixes....good luck.",
  "Anyway here it is: Keep in mind this recipe is for poppy SEEDS ONLY as I have no experience with the pods.",
  "1. 1.5 lbs of bulk poppy seeds. (Papaver somniferum)",
  "2. 1 lemon or lime.",
  "3. 2 12oz bottles of some kind of pale ale",
  "4. quart size or larger french coffee press",
  "(it really doesn't matter what kind of alcohol I use. I like pale ale because it blends nicely with the poppy seed and lime plus has enough alcohol content to get the job done. Also, the colder the mixture the better as warm fluid seems to only extract the oil making my stomach hurt. Adding any alcohol stronger than sake just makes the nausea more apparent.)",
  "So here's what I do:",
  "1. add seeds to french press to 1 inch from top",
  "2. slowly add alcohol and one lime using a chop stick or butterknife to mix it well. You will need just over one beer or 14 ozs for the standard press.",
  "3. cover seeds with liquid and let sit for 10 minutes stirring frequently.",
  "4. put top on press just to hold the seeds back, then pour into a clear glass. It's barely going to drain but just be patient and it should fill a tall glass. It should look yellow/brown.",
  "Experience will vary according to strength and quality of the seeds as well as however big one's dope/pill habit is.  Start with that first batch, wait at least an hour and if you need to, resoak and drink the original seed batch before the next. There will still be a significant amount of good stuff in there. Obviously the more I drink the more I'll feel it. Alternatively, the more I drink, the more likely I am to spin out and puke. Go slowly and work up. Take your time and be patient.",
  "PEOPLE HAVE DIED FROM THIS STUFF!!!",
  "This is no super awesome buzz but the point is to help with pain and/or withdrawal symptoms. It will definitely warm me up and release some joint tension. It may make me slightly nausea but its a happy trade for WD symptoms. Just lie down and be still. Nausea will pass.",
  "Serenity"
 ],
 "erowid": {
  "id": "45481",
  "citation": " Serenity. \"Superior Heroic Remedy: experience with Poppies - Opium (Seed Extract) (ID 45481)\". Erowid.org. Jan 12, 2012. erowid.org/exp/45481",
  "substance": "Poppies - Opium (Seed Extract)",
  "views": "8362"
 }
}
