{
 "title": "Confusion About Everything",
 "author": "Kimmy poo",
 "citation": " Kimmy poo. \"Confusion About Everything: experience with Mushrooms (ID 16497)\". Erowid.org. Oct 24, 2002. erowid.org/exp/16497",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>In the begining of July 2002 I took a trip to Belgium to see my best friend - we lived in the same neighborhood when I was in morocco, but now I live in the US and she lives over in Belgium.</p><p>We drove from Brussels to Rotterdam (a city in Netherland) to buy mushrooms from this store called Smart shop where they sold three kinds of shrooms, herbal XTC and bongs... We picked up 2 grams each of this mexican kind because it was the less potent. I am an experienced druggie but my friend wasn't, and i know how people freak out on shrooms if they take too much or take something too strong. I have experienced DXM, i knew it wouldn't be the same because i did a lot of research on shrooms, but i had a rough idea what it would be like.</p><p>8:30 - both took 2 grams each, they weren't that nasty. My friend ate them in 2 seconds, I took my time, and sipped on orange soda to get rid off the weird taste.</p><p>9:05 - We got back to Belgium, it was only like an hour drive, returned the car to the person who let us borrow it, and started walking back to my friend's boyfriend's house. On our way back, I started feeling strange, all the uninteresting things became interesting, I had to stare at them and notice every little detail.</p><p>9:30 - got to the house. My friend already started tripping, but I had a feel she was exagerating, because she's heavier than me and we ate the same amount and there was no doubt she was tripping. When we walked in the house, she fell in the hall and didn't wanna get for 15 minutes, she was saying things that didn't make sense, we were just laughing so hard we couldn't stop. We laughed for a good hour for no reason.</p><p>10:30 - Looked at my watch, I was like damnnnnn, that was my first reaction, i couldn't decide if time had passed by fast or slow. the whole trip was like that; i couldn't decide anything, it seemed like there was confusion about everything. we sat in the living room, my friend took her top off and started going crazy, she ruined my trip, we had to take care of her the whole time, i didn't have time to enjoy myself and my trip. but when i was sitting down, i started staring at this wooden table, you know wood has patterns, well everytime i stared at them, they would start moving, i saw a sun, a beach with no water, just sand and the sky. everytime one of my friends touched the table, i screamed at them and said NO, DON'T TOUCH MY LIFE!! I kept thinking it was my life.</p><p>That's when I would say I was tripping, my body felt so light yet so heavy, my face looked like i was on XTC, big eyes, big pupils, drinking water felt wierd on my throat, my heart was beating fast, I felt this rush my whole trip, it was like i felt my blood going through my vessels and felt every other part of my body and I understood the purpose of everything.</p><p>11:00 - my friend became uncontrollable, she screamed so loud and was going crazy. ADVICE: DO NOT TRIP WITH OF GIVE SHROOMS TO ANY STUPID PERSON. THEY WILL RUIN YOUR TRIP AND DON'T THINK FOR A SECOND YOU'RE NOT GONNA CARE ABOUT THEM. IT'S HARD, YOU WILL END UP TAKING CARE OF THEM BECAUSE THEY COULD LITERALY KILL THEMSELVES!! OR KILL YOU !!</p><p>11:30 - we got out of the house to calm her down, because it felt like we were gonna go crazy in the house. we sat outside the steps of the house, and everyone was staring at us, or it felt like it rather, everyone looked mean, and their faces got long everyone i looked at someone. everything once again looked weird, and the trip changed once we got out of the house, the place affected the trip. how? well, because we were in a small room, not much was going on, but when we went outside, there are cars driving by, people talking and walking, lights... and that influences your trip.</p><p>11:45 - left them at the steps and started walking by myself. i know you think i'm crazy that i took a walk by myself while mildly tripping, but it was easy to handle, the only thing that was hard to handle was how my body felt, i had to play with my hands and jiggle them, and that made people look at me. If you saw fear and loathing in las vagas, and how the dude was walking when he was tripping on acid, it was the same thing, i was walking in a weird way, i couldnt control it :P it was funny though.</p><p>I know that i haven't mentioned anything about seeing things, well it's because i didn't take enough to hallucinate, i did see things but only on set, the rest of the time, it was just patterns moving.</p><p>Although i didn't see much, i was indeed tripping, even though everything looked the same, everything was new to me, it felt like i was in another world. Then i started thinking about all the things I did wrong in my life, automatically, I think the shrooms did that. and i thought about all the things I had to get done.</p><p>12:05 - got back, and the bitch is still screaming and going crazy so we took her for a walk, bought her milk and rolled her a joint or weed we bought from the netherlands too, it was probably midgrade, It costed 7 euros which is about $7/1 gram and it was called Pepsi. i dunno. We thought that could calm her down because she was still seeing bees and little shrooms everywhere. She calmed down, but that doesn't mean she stopped talking, she talked and talked about the shit she's done wrong, and she fuckin told her boyfriend she loved someone else, that girl would never tell the truth, and she did ON SHROOMS!!! the shrooms made her tell the truth! the shrooms made her realize the shit she's done wrong, like lying to me about having a place to stay, i fuckin went through hell in the vacation. I had to fuckin fight to stay alive.</p><p>1:00 - got back to the house, we stopped tripping, but we were still in shroom world, we still felt unnormal, very tired, and my friend started feeling the bruses on her body, cuz she kept falling when she tripping, and we layed down, and the ceiling was made with wood, and it had patterns, i thought i stopped tripping but i didn't. faces started shaping up on the wood and followed patterns, but i soon as i looked at something like the wall or mirrors, i didn't see any patterns, the shrooms started making me feel like i'm dying, it hurt me but it didn't (confusion again) but i knew i'd get through it, i've done worse things like taking 1.5 g of dxm 3 times, and i got through that. but i swear to god i looked dead, my friends thought i was dead every 2 seconds, i'd tell them no i'm awake, i zoned off, i didn't wanna talk, my body felt like it wasn't there, and it also felt so damn fuckin good. i loved carressing my feet against each other and with the blanket but my breathing got depressed and i forgot about blinking, my face was blue, big eyes, felt very damn weak, COULDN'T FUCKING SLEEP, i just wanted to fall asleep and wake up the next time and be like phew! i'm done tripping, it was too much, too long and definetly too tiring, i don't know why, but you feel incredebly tired.</p><p>2:30 - my friend passed out already. i couldn't. all the positive things i was feeling earlier went away, and all i was left with was the negative ones. It was like the shrooms gave me all the joy and happiness and laughter and good times and lessons but made me suffer later for eating them.</p><p>3:30 - still trying to go to sleep, just thinking about things i had to back home, and about how i lost my friend, she changed so much and we just simply couldn't be friends anymore, and specially seeing her act like a child on shrooms, made her look stupid. and other bad things she's done to me.</p><p>4:30 - started feeling sleepy, but it just couldn't happen. everytime i looked in the mirror, i still looked like i was rolling.</p><p>5:00 - I knew I would falling asleep soon, still felt beat and tired and hurt and burt and thirsty. I didn't about food or cigarettes the whole time i was tripping by the way.</p><p>5:30 - fell asleep!!!!!!!!yay!!! no dreams!</p><p>The trip was good overall. It was new yet the same as every other drug; you get fucked up and you don't know what the hell you're doing :P</p><p>It was good at first, but my friend ruined it, it didn't change the way i felt, but i just didn't have time to concertrate on my trip. I would do them again but only with my boyfriend, we've done almost all drugs together, we're both experienced and could handle each other, and I would do it somewhere fun, like amusement park, small concert, regular park, or at a club where there isn't many people, because it would be confusing and turn my trip to hell.</p><p>I would like to take it to the next level, and use it for spiritual purposes, specially that my boyfriend beleives in mother nature, i would like to share that trip with him :)</p><p>Kimmy poo</p>",
 "year": "2002",
 "id": "16497",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-10-24T07:00:00.000Z",
 "views": "9114"
}
