{
 "id": 16492,
 "title": "Reality in Double",
 "date": {
  "submission": "2007-11-18T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Aphony",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I'm going to start off by giving a little bit of background to the happenings before my first mushroom trip. This happened in April of 2005. I had just gotten my tax return check back and was looking to just do something different and fun with a few of my close friends. We had been talking about getting our hands on some mushrooms for a few months at this point in time and I by chance met a guy around this time that said he could get them for me. The day we decided to do it we called him up and made the deal. We met up at my apartment and he went to get them with my money. After waiting for a few hours we decided to see what was going on. We gave him a call and he said he would be on his way shortly. After we finally met back up (6 hours later) my friends and I got out the scales and measured what he had brought. The mushrooms were of good quality. But there was only about half of what we had purchased there. After a short discussion with my friends we decided that we would get the money back, or the rest of it the next day. Knowing that if you are overly worried or anxious about things that are going on around you could cause a bad trip we all agreed to let it go for the night and just have fun.",
  "At about 9pm we started getting everything ready. We purchased some orange juice, and smoked a few bowls of MJ before starting. Other than myself there were two other people. M and T. Both had done mushrooms before, and were there to help me along and make sure that I didn't start to worry. M divided up the mushrooms into 3 piles. Each weighing out at approx. 2.5 grams. M ate his as he would put it 'like popcorn'. I proceeded to eat the two small caps I had and follow them with some OJ. I then ate the stem I had and the spores that came from the shake in the bag. After following this with some more OJ I then smoke a cigarette. T hates the taste of mushrooms and ate his very slowly over the course of about 15 minutes.",
  "We then decided to clean up our place a little bit while we waited for the effects. This only took us about 10 minutes and we just chated for a little while we smoked another bowl. At no time did I experience nauseu. After about 45 minutes I started to feel the effects. My first feelings were a little bit like being drunk. I felt like my movement was hindered a little bit and my sight wasn't quite right but I could still control everything. I was able to stand up and have a cigarette and change the music that was playing from the computer. I then sat back down beside T. The drunk feeling started to go away and I felt as if they were already wearing off, like I was getting hyped up for nothing to happen.",
  "I then started to feel very stoned. this was about an hour into it and I knew at this point that I should not feel stoned, and it had not been the weed we smoked previously. M, T, and I are regular smokers, usually a quarter or more a day, so our tolerance is higher than many people. Along with the stoned feeling I could start to see thing in the wall. One wall had a wood pattern on it that very slowly was seeming to change where everything was placed. The designs were the same but the locations would switch around it seemed, like they were cells moving around on the wall.",
  "At about an hour and a half into it the music started to give me visuals. We had some mellow trance playing in the background and if I closed my eyes I could see and almost feel myself floating quickly down a road with little designs and visuals that were being made up in my mind from what the music was doing showed on the side of this road. Along the road I would see rabbits and people without faces. I could see roadsigns that said nothing, but had amazing coloration to them. The road would change colors and different patterns on it as well as I traveled. Much like a visualization on a computer to trance would do, but without actually seeing it at all. When this started T was at a point where he could not stop talking. He asked everyone to stay quiet so that he could 'trip in peace' but knew that he was the only one really saying much at this point. To the side of the computer monitor was a empty bottle of Sobe. By looking at the bottle I could see the reflection of the actual visualizations that were going on with the music on the computer.",
  "At this point we were probably about 2 hours in. We decided to turn off most the lights, leave the computer visuals on and just trip. I knew that I was not going to be uneasy about anything at this point. I was not feeling sedated, and not exactly euphoric, more of a mellow. Shortly after turning the lights off the music changed. The computer was on random, and the next track that came on was Pink Floyd - The Wall. This was the entire cd in one track. We were all flowing with the beginning music when all of a sudden we heard the lyrics 'is there anybody out there?'. T, M, and I all kinda looked around and seeing all of us do this made us start to laugh. We knew at this point we were well on our way to tripping for a good time. T commented at this point that he was 'tripping balls' and I quickly agreed. M mostly stayed quiet during the trip preferring to just flow with it.",
  "After a short time I moved across the room and onto my bed. Shortly after this we had a friend stop in. He came in and we told him that we had taken the mushrooms about 2 hours before he got there. He looked at me and said 'You guys are TRIIIIIIPPPPPPPPPPINNNNNNNNNNG, aren't you?' Which we agreed. He asked if we wanted to smoke another bowl and we asked him to go ahead and load it for us since we would be incapable at this time. While he was doing this he had a little bit of idle chit chat with us, trying to make us trip harder. This was a few days before the new 'Hitchhikers Guide to the Galaxy' movie was coming out. Being as we all knew it he started to say things along the lines of 'Where is your towel?' and explaining to us how to fly. I remember that while he was explaining to us how to fly I could imagine myself doing it, and I agreed with him on his way to fly.",
  "But then I had to interject with something that I can no longer remember on how you had to make sure that during a certain portion of the process you were very careful. He just started laughing, and so did M and T. I simply asked 'I'm way gone huh?' and they all just laughed a little more. Shortly after this he left and I layed down on the bed to let the visuals I was seeing, and the music take me away again. When I laid down I looked over at M and T and said, 'See you when I get back'. At this point we were probably about 3 hours in or so. I'm not quite sure after this seeing as how I never really looked at my watch and nobody else was paying attention either.",
  "In my mind I was actually starting to prepare myself for rest thinking that the trip would start to fade away. But I knew that I was still going to be peaking for awhile. I soon found out that I was just then starting to reach the highest I would get. Shortly after I started to prepare myself for rest I started to think about different things. Most of it just ran through my mind quickly and passed. But one thing that has always fascinated me has been death. My own, to be a little more specific. I found that in thinking about my death that I was not afraid of death itself, rather the way that I would be dying. Since I started to ponder on this while I was tripping, I started to wonder if in fact, since eating mushrooms gives you food poisoning, I would die from it. I knew I was simply tripping, but I allowed myself to trip on this further.",
  "While I was still preparing for this rest I started to think that I was not in fact preparing for rest, I was preparing for death. I was preparing myself to die during my rest. This way I would not feel it. I felt that I could make myself a death bed where I was laying. During this time my body felt as if it were very heavy and that it was already ready to pass on. Once I felt I was prepared enough I fell into what I felt as almost a dream like state. There was nobody else there at all, there was only the music and the visuals behind my eyelids. Then I heard somebody move. Suddenly I didn't want to be prepared for death anymore and I wanted to be part of my friends again.",
  "So now we are about 3 and half hours in or so. When T moved which shook me from my trance I started to think about reality. What was real. Was my trip real, or was what I at that time felt as a distant past real? My final conclusion was that since I knew I was tripping and wondering if my trip was real that it couldn't possibly be. And that the 'distant past' had to be reality. So I thought of things in reality to bring me back for just a little bit. One of the first things I thought about was my girlfriend. So since T was up and closer to my phone I had him call her. At first he didn't want to and asked me why. I tried to explain to him what I was thinking but it only came out as 'it's about our reality'.",
  "He ended up calling her. She asked why he was calling and he said it was because I was 'tripping balls' and wanted him to call her. After a little bit I talked to her myself. A few minutes passed and she said that she would be out there soon because I was making no sense and I think that she didn't feel like trying to understand what I was trying to say on the phone. Plus, she could see what was going on in person, and see how I was acting, to satisfy her own curiosity. During this time on the phone I got up out of bed and T decided to venture outside. I told him that he shouldn't and that we should stay inside. But when he opened the door and I saw outside and felt the air I had to go too. I grabbed my cigarettes and went with him.",
  "We stood outside by the door while I was on the phone with my girlfriend tripping on nature itself. We were looking at what almost seemed like a harvest moon in April, and the trees, and the way they seemed to dance. T said something about it looking like October and I started to think about Halloween and everything looked chilled and almost eery. It was actually a very fun feeling outside. My girlfriend showed up while we were standing outside, and I was still on the phone with her, and shortly after we went back inside. M had stayed inside and while we were outside had moved to T's bed. T sat in a chair and pulled the hoodie over his head to block us all out.",
  "My girlfriend and myself chatted a little bit and then our friend that had been there earlier showed back up. He talked to me a little bit, loaded a bowl, and then started picking on T. I later came to find out that at this point in time T didn't want anything to do with M or I and that the only person that he liked was the friend who had showed up. So he would only talk to him. M didn't talk to anybody the rest of the night, and I just tripped while my girlfriend kinda watched us. At one point in time I thought that she had flashed me, but this didn't happen. I started to come down about 4 and a half hours into it and was somewhat upset that I was. I wanted it to last longer. M didn't come down until about 6 hours after ingestion and T started to come down about 5 hours after.",
  "After I started to not really have the visuals any longer I simply passed out. Nothing seemed to be of interest anymore. By the time the visuals were gone I was only feeling tired and almost like there was absolutely nothing at all to do. My girlfriend went home, and I went to sleep and woke up about 5 hours later. When I woke up I couldn't go back to sleep. Throughout the next day I started to feel as if I had a almost sharp pain in my lower back. M was using the bathroom wherever we went and T was seeing tons of tracers. When we took a walk around town I really started to notice the tracers and had to pick up a pair of sunglasses to dim the light a little. We layed around most of the day after we got back and just took it easy, all feeling tired and a little sore.",
  "Overall it was a fun experience. I will do it again at some point in time. The main thing that I learned is just that if you start to think you are losing it, just remember, you are tripping, and it does stop."
 ],
 "erowid": {
  "id": "45467",
  "citation": " Aphony. \"Reality in Double: experience with Mushrooms & Cannabis (ID 45467)\". Erowid.org. Nov 18, 2007. erowid.org/exp/45467",
  "substance": "Mushrooms & Cannabis",
  "views": "2537"
 }
}
