{
 "id": 16495,
 "title": "Waiting for the Something That Never Arrived",
 "date": {
  "submission": "2007-11-19T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "J-Dizzle",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "A Little background first...",
  "I've been a regular drug user since I was 14, my main drug of choice being Marijuana.  over the past 5 years (I'm 19 now) I've experimented with multiple other drugs, but have only taken a liking to a few.  MY first synthetic experimentation was GHB, and after that, I decided to stay away from everything but weed. this plan worked for quite some time, but when I turned and entered college, I was exposed to cocaine, opium, mushrooms, and very good marijuana (among other things).",
  "Anywhoo, around february of 05', things went south with my mom, and she kicked me out of the house. I moved in with some cousins for about two months. One of my cousin's friends was a daughter of a Hell's Angel and I associated with many Angel's during this period.  I had heard about Methamphetamine, but had never known the Angels have classically been known as a large maufacturer of it.  Living by the philosophy 'try everything once', one night I asked if I could try some of the crank that they were using, and like any good friend, they said 'ok'.",
  "I started off with one line, but after 30-45 minutes of no results, I decided to stoop very low, and inhaled it through a lightbulb.  I was hoping that maybe a little bit more would make me feel something.  wrong. I proceeded to stay up until around 4 oclock that morning, but this wasnt out of the ordinary for me; I've always been a nightowl.",
  "The entire time, while everyone else in the room was high, I sat on the couch, waiting, and waiting to feel SOMETHING. but that something never arrived. so, I decided that this drug sucked - I had felt nothing the entire time; just stupid.",
  "So, after my first time I decided that this drug wasnt for me, and have had no desire to try it ever again (especially after seeing some family/friends get hooked BADLY, and the toll it takes on their bodies)."
 ],
 "erowid": {
  "id": "45477",
  "citation": " J-Dizzle. \"Waiting for the Something That Never Arrived: experience with Methamphetamine (ID 45477)\". Erowid.org. Nov 19, 2007. erowid.org/exp/45477",
  "substance": "Methamphetamine",
  "views": "4534"
 }
}
