{
 "title": "HPPD",
 "author": "paddy",
 "citation": " paddy. \"HPPD: experience with LSD, Ecstasy, Methamphetamine, Salvia divinorum & Nitrous Oxide (ID 16501)\". Erowid.org. Aug 1, 2002. erowid.org/exp/16501",
 "substance": "LSD, Ecstasy, Methamphetamine, Salvia divinorum & Nitrous Oxide",
 "bodyweight": "55 kg",
 "header": [
  "DOSE:",
  "3 hits",
  "",
  "LSD",
  "",
  "2 tablets",
  "",
  "MDMA",
  "",
  "30 hits",
  "",
  "Nitrous Oxide",
  "",
  "15 hits",
  "",
  "Methamphetamine",
  "",
  "10 hits",
  "",
  "Salvia divinorum"
 ],
 "report": "<p>This is not a report of one experience but of how I got HPPD, and what has occured with regard to substance use since I got it.</p><p>I have smoked dope for a number of years now, and although it often made me paranoid I suffered no serious adverse affects.  Being curious about alterating my conciousness, about a year ago I dropped 3/4 of a tab of quality acid.  I was in an intimate, relaxed setting with friends and good music, but even so I felt a little apprhensive.  However, I smoked a couple of joints, mellowed out and ate the tab.  The trip was fantastic- I saw some amazing fractals and had a fanatasic trip, although it was not particularly intense.</p><p>I had no adverse effects the next day apart from a comedown, and decided that acid was something i'd like to do regularily.  Immediately after dropping the tab (the next few weeks) i smoked dope heavily, and about a month post-trip I started to notice fractals whenever I got stoned.  I dismissed this at first, but as I continued to smoke the symptoms worsened (but perhaps they would have naturally anyway).  Today, the symptoms are as bad as they have ever been, but since they started so mildly I can still lead a normal life, though they sure get me down sometimes.</p><p>The interesting thing is that although most HPPDers say that even smelling pot smoke can make their symptoms permanently worse, I have smoked (and continue to smoke) shitloads of pot since getting HPPD.  In addition, I dropped small doses of acid twice after getting this syndrome, and have also done e, slavia, nitrous, heaps of alochol and I currently do speed fairly regularly (it's about the only chemical that doesn't make symptoms worse).</p><p>Anyway, just though I'd submit this because my HPPD experience is rather different to the conventional one- and yes, I do have genuine hppd: static, afterimages, floaters, fucked up peripheral vision et. al.</p><p>Anyway, i'm gonna go and smoke a couple of cones tonight- if I try and forget HPPD, it can sometimes forget me!</p><p>-------------------------\r2004 Follow-up Report</p>",
 "year": "1000",
 "id": "16501",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-01T07:00:00.000Z",
 "views": "73879",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "",
   "substance": "LSD"
  },
  "1": {
   "time": "",
   "amount": "2 tablets",
   "administration": "",
   "substance": "MDMA"
  },
  "2": {
   "time": "",
   "amount": "30 hits",
   "administration": "",
   "substance": "Nitrous Oxide"
  },
  "3": {
   "time": "",
   "amount": "15 hits",
   "administration": "",
   "substance": "Methamphetamine"
  },
  "4": {
   "time": "",
   "amount": "10 hits",
   "administration": "",
   "substance": "Salvia divinorum"
  }
 }
}
