{
 "id": 16513,
 "title": "Summer in Sweden",
 "date": {
  "submission": "2001-12-27T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "icbyd",
  "gender": "Male",
  "weight": 62
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "PRELUDE: Last Wednesday night, I bought fifty dollars worth of some home-grown bud off a kid in my driver's ed class. I took it home and, although the buds were somewhat big, I figured I had been ripped off due to the size of the bag. Saturday night my father and sister were away and my mother was out for the evening, so I decided to roll a small joint with buds in the tip and tobacco in the rest (so I could have something to hang on to). Once she left, I went outside and sparked up.",
  "TIME: 5:00 pm",
  "ENVIRONMENT: Cold day, snowing, vacant house (yay).",
  "MUSIC: Some Sublime CDs.",
  "After getting about three good hits from the joint, I put it out and went inside. I waited on the couch while watching 'Fear and Loathing in Las Vegas' for five minutes, having only a slight tingly effect in my lower body, similar to a nicotine buzz (normally I just get knocked on my ass). I got up and put some Visine in my eyes, threw on some CDs and kicked back on the couch. It hit me then.",
  "When I get stoned, everything takes on a dreamlike quality and I feel like I'm not quite there, almost akin to looking in on a picture. I've never tripped or seen anything odd (I have friends who claim they do), I just feel extremely detached and distant. What I find funny is that in most reports I've read people don't mention memories. When I'm stoned I can look at a magazine and think back to a memory, then connect that with some other lost memory and so on and so forth. My mind has a massive outpouring of all these thoughts, and while they're not 'deep' I can spend most of my trips just sitting and thinking.",
  "'Jesus Christ man, this is bat country!'",
  "A mere ten minutes in and I'm already beginning to feel too stoned. My mind recesses back into 'primordial' mode while I begin to think in abstract thoughts. 'Oh bats! Yeah, I remember back at Moe's house when I was a little kid bats would come out right at dusk and I would throw undergrown apples at them.' For some inexplicible reason I get a warm feeling and my mind keeps trying to tell me it's summer; most likely because I have some bright lights on and Sublime's self-titled album was playing (I generally associate Sublime with California and summer). This was the most interesting part of the trip.",
  "Time ticks on as the sun goes down and my shades get darker. It seems that whenever I toke when it's dark out my trips begin to shed their friendliness and take on a cold, mechanical feeling of isolation. I finally realized I smoked too much. I turn the light off because my eyes are bothering me, and I begin to feel alone and distant. I'm totally recessed into my brain, getting couched and not being able to move from my seat. My mind went through various memories I've never had. Inside my head I simply get 'feelings' of being at places I've never been at before (an odd thought of 'Christmas in Sweden' repeatedly flashed through my brain).",
  "Unable to concentrate on the movie and convinced that the Sacred Heart picture of Jesus on the wall above my TV is a dead ringer for that Captain Morgan's pirate advertisement, I decided I needed a drink (looking back, it was an extremely stupid thing to do). I took a bottle of some nasty shit that tasted like rotting licorice from my parent's liquor cabinet and drink a fourth of the bottle (which is 40% alcohol). At this point I was so out of my mind and thinking on such a lower level all I could think of was 'food. drink. Christmas in Sweden.'",
  "Once the alcohol kicked in, I was completely dissacociated and felt like I wasn't living in my body, rather I was watching a movie from the inside out of another person. I decided to go out for a roll in the snow, wearing only my jeans and Black Sabbath t-shirt. Suprisingly enough it was really fun, and I normally hate the snow.",
  "Eventually after frolicking around like an idiot for a few minutes, I became intensely paranoid and thought the cops were moving in on me from the trees in the woods behind my house. Close: my neighbors children come up to my backyard and begin trying to hold a conversation with me. I looked at them blankly, trying to understand what they were trying to say (audio was extremely muffled) and eventually becoming facinated with this really neato torpedo puffy Gap jacket the kid was wearing.",
  "I usually act weird anyway, but when the kid asked me 'are you high?' I stupidly responded with 'am I high? high am I!'",
  "The kid walked off, when the stupidity of my actions hit me. Forty-five minutes had passed after I smoked, and I was beginning to realize how fucked up I was (most likely due to the dizzying effects of the alcohol). I promptely returned to my house and set up a warm bath.",
  "After sitting in the bath for a bit, I just lay there and began to get paranoid: what if my parents come home? What if the cops come? Eventually my tensions began building up so much I began hearing odd tones that weren't really there along with other noise. I felt like I could scream or burst. I thought I heard the front door shut and my mother call out 'Honey, I'm back!' when I screamed out (slurring) 'HELLLLLLLLLLLO MOM!!!'",
  "Luckily it wasn't her and I was just hallucinating. The event freaked me out so much though that I decided to get out of the bath and throw on my bathrobe.",
  "After walking down what seemed to be a huge flight of stairs, the doorbell rang. Thinking I was just hallucinating again, I ignored it, but on the third time I finally got it. I was unpleasently suprised when I opened the door to see, standing on the porch, a pig. I nearly shit myself. Ends up my bastard neighbor complained to the police and they came over to check it out.",
  "The guy was pretty easy on me, explained to me that the neighbors called in to say that they saw me smoking a pipe out back (which is a lie, I don't own any pipes) and was smoking weed. I had enough sense in me to deny, deny, deny.",
  "'Can I come take a look at your house?'",
  "'Nope.'",
  "'Why? You hiding something?'",
  "'No, but I find it a blatant invasion of my privacy that you want to case my parents' house without a search warrent because my asshole neighbors called in a false report about me.'",
  "Luckily I looked fine enough (despite being in a plaid Japanese bathrobe) and was acting sober enough that he didn't even give me a breathalizer test (Massachusetts has zero tolerance for underaged drinking). He left, I went inside, threw on some more Sublime and tried to shake the bad karma but it stayed with me for the duration of the trip (which, for the most part, was completely uneventful)."
 ],
 "erowid": {
  "id": "4556",
  "citation": " icbyd. \"Summer in Sweden: experience with Cannabis & Alcohol (ID 4556)\". Erowid.org. Dec 27, 2001. erowid.org/exp/4556",
  "substance": "Cannabis & Alcohol",
  "views": "30355"
 }
}
