{
 "id": 16511,
 "title": "No Fear and No Loathing",
 "date": {
  "submission": "2007-11-19T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "gonzowizard",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>The afternoon and evening before the experience was full of some of the best stories I have heard in years: altogether a very refreshing and lengthy conversation that broke up the monotony of the summer of 2005. The amphetamine psychosis from the daily dose of Dex was catching up to me fast, so it seemed that some downers were in order. The 1 mg Xanax I had on hand did the job nicely, but reminded me how addicting they truly are, for the simple reason that they make me feel normal and mellow, as if the last three years of drug use had disappeared.",
  "The conversation was now shifting from happy stories to injury stories, but the room was still glowing with positive vibrations. Injury stories led to drug stories, and then drug stories led to more rampant brain destruction, as the Salvia was brought out. Luckily, I had the perfect item to smoke the material: a homemade hookah, contructed from a goldschlager bottle. A standardized 6x extract was weighed out to be enough for three people, with some powdered leaf added.",
  "Salvia is perfect for when I need to leave reality for half an hour, it is one of few drugs that can hit me faster than I can react. My co-psychonaut (who shall be known as Bobby) was first up: a torch lighter cooked the bowl quickly, and made the chamber white with hallucinogenic smoke. With the chamber cleared, he was off to Wonderland for the first time.  Next up was D, a SaDi veteran, who took her hit and spaced out in her chair while I prepared my bowl-load: one full bowl of extract, all for myself.",
  "I made every strange face that only a drug-user would know is the telltale sign of trying not to cough out a hit too big for my lungs. That thirty seconds of holding in smoke stretched out in a similiar fashion as 4:19 does every day. 'Time to see how far down the rabbit hole goes,' was the last thing I can recall saying, or doing for that matter. The visuals came right on schedule, only this time they stayed. The overwhelming first rush was now calm and gradual, I was slowly climbing to the peak of this mountain, instead of taking the express route.",
  "My next coherent thought came half an hour later, and even just an hour after the fact, the sheet that covers and alters the mind has not yet lifted. I feel a sedation which could only be described as, well, indescribable. The core of my soul has been slowed.",
  "The experience has left me floating in the ebb of the greatest surge of life, my brain has shifted to a low gear, and now I spend the evening at home, while my brain is out for a drive along a summer beach, cruising with the windows down, basking in the soft moonlight.</p>"
 ],
 "erowid": {
  "id": "45553",
  "citation": " gonzowizard. \"No Fear and No Loathing: experience with Alprazolam & Salvia divinorum (ID 45553)\". Erowid.org. Nov 19, 2007. erowid.org/exp/45553",
  "substance": "Alprazolam & Salvia divinorum",
  "views": "5629"
 }
}
