{
 "title": "Rapid Heart Beat",
 "author": "J-MAN",
 "citation": " J-MAN. \"Rapid Heart Beat: experience with Cannabis (Northern Light) (ID 16519)\". Erowid.org. Dec 2, 2003. erowid.org/exp/16519",
 "substance": "Cannabis (Northern Light)",
 "bodyweight": "160 lb",
 "report": "<p>Im a college student enjoying my summer.  Im not a weed veteran but I have probably had about 15 joints in my life.  I have smoked even strains such as white widow.  I had found a weed connection w/ some people in Canada.  They sold me a gram of northern light weed for 15 dollars.  The weed had orange hairs. </p><p>After one toke I started coughing.  I had to move to another area where nobody could hear me.  Every toke caused me to cough.  Its effects became immediate as I stood up.  Everything became shaky and distant.  Walking became a little harder for me and I had the urge to laugh even though I was all alone.  It became stronger within 5 minutes.  I started to see colors in everything I shadowed (red and blue streaks).  The computer screen was like 3d.  But what made it a very scary experience was that my heart began to beat faster then I could ever imagine my heart beating.  I thought my heart was going to come out my chest.  I pus my hand over my heart and could feel the pulse going so fast that it was like at a constant high speed.  I tried everything to  relax and when I finally was relaxed my heart was still at an extreme rate.  The high would have been great if I  took out the rapid heart beat.  That night I was up an extra few hours because I was very awake. </p><p>The next day I smoked just a little nugget that was like 1/8 of the gram that I had left over.  Just this little tidbit alone gave me chest pain (although I didnt have the rapid heart beat. I have a theory that it could be since I have depression that my heart is more prone for rapid beat after smoking marijuana.  I have come to this conclusion based on reading another smokers reaction being the same as mine and he had depression also.  But its more likely that I smoked some killer weed that is known to the world as a strong weed.</p>",
 "year": "2002",
 "id": "16519",
 "gender": "Male",
 "timestamp": "2003-12-02T08:00:00.000Z",
 "views": "10415",
 "dose": [
  {
   "time": "0",
   "amount": "0.33 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
