{
 "title": "Fresh Air for Old Fart",
 "author": "New2x",
 "citation": " New2x. \"Fresh Air for Old Fart: experience with Ecstacy (ID 16517)\". Erowid.org. Aug 4, 2002. erowid.org/exp/16517",
 "substance": "Ecstacy",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.75 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 2:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I first want to say that I recently turned 30 years old and I had yet to do X. To the young ones reading this thinking I'm an old fart, let me assure you that life goes on, yep, even at 30! I live in a metropolis where it's 'cool' to be single and 30, and the club scene is still going strong for twenty and thirty-somethings. I'd always wanted to do X, and when I hit 30 I decided this was the year to do it. I've had 2 experiences in about 2 months, both extremely different, which I'll share.</p><p>For starters, know that I've always loved dancing and have been to raves before (yeh, I was the one of the FEW who was not on any drug at raves). So I'm not new to the scene, just new to the drug. I had a chance to see Oakenfold one night and I was told if I was going to do X, this was the time. Unfortunately, my X-experienced friends were unable to go, but I really wanted to do this, and I was going to go there with some acquaintance friends of mine. I ended up meeting them there but they were not rolling, just sitting at the bar and drinking. Not quite what I was expecting, as I was told X was something you needed to do with friends (and one of these friend TOLD me I should do the X, so I ~thought~ they would be rolling too). While they were content to sit at the bar, once I was rolling I had to hit the dance floor, so I was pretty much by myself, at a club, doing my very first 'real' drug. Needless to say, I was very anxious about what was going to happen.</p><p>I took half a pill, waited about 40 minutes, and popped the 2nd half. I really felt nothing the first 40 minutes. I could tell ~something~ was coming on, but I didn't know what to expect, so I just popped the second half. I stood at the edge of the dance floor, drinking water and waiting for the drug to kick in. The first thing that hit me was the music. I just ~had~ to dance to it. While I was still a little unsure, I waited until the effects of the drug conquered my anxiety and I went to the dance floor and danced, danced, danced. I didn't need to be with friends - the music and I, and the dancers around me, were flooding me. I had a big grin on my face. I began dancing next to a very cute girl who appeared to be rolling, but I didn't know how to approach her. We were right next to each other, looking at each other, but I was afraid to respond. If I was NOT on X, I would have approached her - I'm not shy at all when it comes to talking with the opposite sex. But I didn't know what to do. Do you talk to people on X? How does this work?? This was the one thing I missed on my first experience - I didn't know how to react with the others who were rolling (who were easy to pick out, once I was rolling too). Now I know that people on X seem to be in their own special, friendly group. I laughed happily when I realized I finally understood what the deal was with the glow-sticks -- the lights were so vivid, so amazing! I would stand and just watch people play with their lights. I then noticed other 'rollers' who were touching and caressing each other. I really wanted to do this this with someone, but resolved to just rub my fingers together. I finally ran into 2 friends of mine by chance who were rolling as well, so I spent the rest of the night with them. But they were a couple, and after a few hours I let them go do their own thing -- I still just could not resist the urge to dance, dance, dance. I went home when the club closed, had no problems falling asleep, and the next day I felt tired, but fine. I think the pill was a little weak, which was good for my first time alone. The experience was great -- the feelings were so vibrant, I was one with the music. But I knew to truly experience X, you had to be with friends. About a month later, I had my 2nd experience, which was TOO MUCH and borderline dangerous, but still an incredible ride...</p><p>There were 4 of us - Two guys and two girls -  a couple, myself and a dear friend of mine, a gal I've known since I was 23. Due to a problem with our supplier, we first ended up taking only 3/4 of a pill each. We waited a couple hours, trying to find clubs to go to (a rave we went to had terrible music, so we went down the street to a new club, which was dead, and we finally found a busy club that would cater to us). Pushing 2 hours after the first dose, the original source came through, and we all got another pill. I took a full pill this time, which brought me to 1.75 pills. The first dose had yet to kick in. I felt the familiar 'something is coming on' feeling, but I was not yet rolling.</p><p>When everything kicked in, we were rolling our asses off. I experienced all the side effects of X. It was TOO much. The first time I did it, I felt in control, just euphoric. THIS time, I felt like a zombie. My body was jello, I was moving in slow motion. It was hard to do basic things, like unwrap a piece of gum. It was hard to dance. However, the 'good' effects of X were there - my friends and I couldn't keep from touching each other -- our hands, our arms. This is what I was missing the first time. I kissed a girl for the first time on X, and was blown away by it. I kissed with my eyes closed, but I swear I could SEE the kiss going on in my mind. It was amazing. The lights were jittering around me, the glow-stick people were mesmerizing. There were a few people with flags, waving them around, which blew me out of the water. It was the most amazing visual thing I'd ever seen. I remember yelling, wide-eyed 'Look at those fucking flags!!!'  The bad effects were kicking in too - we all had done too much; these were strong pills. The other guy and one of the girls vomited. I felt my eyes shaking rapidly. I could not focus on people - I didn't even get a good look at the girl I kissed - I just could not focus on her. I would be in conversation with people and would just zone out right in the middle of a word. There were times it seemed I would forget to breath. Occasionally I had to stop and take a deep breath. At times, I noticed my heart felt a little heavy, like my blood pressure or pulse were way up. The rolling was too much. I felt nauseous. If I did not continually chew gum, it seemed I would just freeze for a few seconds (or minutes?? Hard to tell), seemingly not breathing, not doing anything, until something snapped me out of it. I remember thinking that I could very well fall on the floor and pass out at any time. I understood how some people end up in the hospital from X; You CAN overdo it.</p><p>We rolled for over 8 hours, leaving the club at 10:30am out of sheer exhaustion. But we were still rolling when we got to my place. I had christmas lights on my ceiling from a recent party, and they were still jittering around like mad, telling me my roll was nowhere NEAR finished. I continued to roll until about noon, when I was finally able to sleep. My friend had a hard time and had the shakes all day (she was never able to get to sleep). We didn't eat at all that day. I still felt dizzy two days afterwards.</p><p>While some of the effects were awesome, like the enhanced physical sensation of touching others, and the amazing visual light show, the actual rolling was too much. I was not in control. I've read stories at this site where people pop multiple pills - 3,4,5, even more.. This just tells me these people are doing too much and do not understand how X works. I implore you to visit www.dancesafe.org and read how X works... You need to replace your serotonin levels between X use. Taking X every day will NOT work and will probably cause damage. Even every weekend can be too much. Without supplements to rebuild your serotonin levels, X can become dangerous if you overdo it.</p><p>I'm by NO MEANS an X expert. But I've had a normal, perhaps weak experience, and a way overdone experience. If I'd give any advice, I'd offer the following when you do X:</p><p>1) Do NOT overdo it. I will Never, NEVER, do 2 pills again in one night. If you are taking 2,3,4,5 or more pills at a time, this is UNHEALTHY. The feeling of X is incredible, absoultely, but you cannot keep popping pills hoping the effect will hit you. You have to know how X works. It's not the MDMA making you feel the way you do - it is your body's own serotonin being released. If you've burned it all up, you're only doing damage to your system if you keep filling it with MDMA. From NOW on, I will start with 1/2 a pill, and take the second half if necessary.</p><p>2) Drink water. Don't dehydrate yourself.</p><p>3) Go with friends. While I had a good time alone, I recognized my mistake. I'll never do X alone again.</p><p>4) Chew gum. One side effect is gritting your teeth, or clenching your jaws (there's a very disturbing story on this site about a girl breaking her teeth, she was clamping down so hard)... Continuously chewing gum will keep you from damaging yourself.</p><p>5) Have a great time. I find myself often thinking back to the great feeling of X, and honestly, I can't wait until I do it again. BUT, I'm keeping this in check, and I know that the longer I wait, the better it will be, because my serotonin will be back at 'normal' levels, and the MDMA will be ready to work. WAIT. I know, it's great. But just give yourself some breathing room and do it occasionally, and everything should be fine.</p><p>Sorry for going on so much. I hope that helped.</p>",
 "year": "2002",
 "id": "16517",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-04T07:00:00.000Z",
 "views": "10766"
}
