{
 "id": 16529,
 "title": "It Really Was Completely New",
 "date": {
  "submission": "2007-10-03T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Overman",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "Subject:  I am a 34-year-old male, married with three kids.  I have a bachelor's degree in Chemistry and a bachelor's degree in Psychology.  I have a pretty stressful job that pays well.  I possess no particular religious beliefs.  I rely on science as my 'guiding light'.  I don't believe the really big questions in life are knowable.  I am completely convinced of this, and I view any and all speculation (by myself and others) as merely that, speculation.",
  "Purpose:  I think that altered states and new ways of thinking are very important experiences.  I bought and tried Salvia for the experience.  All the trip reports were very valuable.  It was intriguing to me that many of the reports had some very common elements.  Namely I saw a lot of the following mentioned: a feeling of sinking, falling, shifting, or melting; the sensation of a 'presence'; separation from reality.  Many times, I heard that there was a feeling that couldnt quite be explained with words.  It was this feeling and overall effects on my cognitive processes that I wanted to experience.",
  "Background:  I've had a generous dose, numerous times of each of the following: weed, coke, opium, meth, LSD, DXM, hash, hash oil, GHB, various forms of ecstasy, mushrooms, nitrous, and about every pill imaginable.  I basically went through phases depending on what was big at the time.  A lot of this was during my college years.  I mostly smoke weed and drink a little now.  My first drug was LSD.  I did a lot of blotter and shrooms in my early 20's.  I was really into the psychedelic experience, and I must have tripped 40 times or more.  As I got older with more responsibility, I found it harder to trip.  I started having panic attacks and bad trips every time I dropped.  It didn't take but a few times of bawling for an hour before I swore them off.  I realize that my personality is such where I'm a bit of a control freak.  I understand why I respond like I do to tripping, which is why it's been so long.  About the sole reason why I wanted to give Salvia a try was its short duration of effect.  I knew that if nothing else, I could depend on that.  Also, I was comparing it to a dissociative that I rather like, nitrous.",
  "Set up:  My friend came over after work on a Tuesday.  I would normally not do anything at all during the week.  I don't like breaking my weekly routines.  I figured that my buddy could go ahead and do it, and I'd sit with him.  However after his first hit, he sat quietly.  After only about 7 minutes he felt fine and was describing a pleasant sinking feeling that came on pretty abruptly.  He compared it to anesthetic.  This sounded appealing to me, and so I said what the hell.  I knew I wasnt in the correct frame of mind, but my curiosity got the best of me.  It didn't last long right?  I had 1.5 grams of what was sold as 30X concentrate.  I was aware of some of the dosing requirements so we only put a pinch in the bottom of a small metal pipe.  We hit this with one of those blue flame, torch lighters and took in only one really good, deep hit.  We held it in until we had to exhale.  We were in a darkened room lying on a very comfortable bed with a fan going.  He was listening to New Age music via headphones.  I was not.",
  "Effects:  After I exhaled, I gave the pipe to my friend.  We did this purposely as we'd read that it was wise.  I would highly recommend doing this.  I would also recommend a sitter for damn sure.  I had just enough time to say, 'I don't think I got enough.'  After that, the shit hit me like a ton of lead.  There wasn't a subtle thing about it.  Basically, it was like someone flipped a switch and totally changed my reality.  I'd read where people would be caught off guard by this.  I was even ready for it. I'm telling you now.  You can't be ready.  You either go with it or panic. Of course, I'm always prone to panic, so that's what I did.",
  "I felt a very deep melting sensation.  It was as if my legs had instantly become one with the bed, and as such, I was melded in place.  I could not move.  I opened my eyes in an attempt to stave off the effects.  However, this is where it gets tricky.  The room did not look like the room I was in before at all.  The part that is so hard to get is that I'm saying 'look like the room' due to limitations in semantics.  For all intents and purposes, it was NOT the room I was in before.  It didn't look like it.  I didn't FEEL like it was.  I was having some very strong visual hallucinations together with severely impaired thinking and orientation.  The entire room began to 'shift' in sections.  I could feel my legs moving and shifting with the rest of the room.  It would shift and move like the side of a melting candle.  My legs were stuck and melting with everything else. ",
  "After a minute or two (I had a digital clock in view), I noticed that my consciousness stopped spinning enough so that I could think with that deep inner voice that almost never gets fucked up.  I had given up on my legs and had resigned them lost in the melting.  Somehow, I was okay with that.  I had begun to feel detached from my body anyway. I recognized that I was panicking and that I should calm down and wait it out.  I was aware and acknowledged that the experience was totally overwhelming me.  I'm pretty sure it was a combination of how 'real' it seemed paired with the fact that it felt so utterly and completely fucking bizarre.  I felt it so strong that it seemed like a 'place'.  I was filled with dread at the notion that I wasn't supposed to go there.  It literally feels like a genuine alternate reality.  There was no imagining or daydreaming like I can get when really stoned.  It was very real and very foreign.  I imagine its what it would feel like to be born if I could remember and think during my birth.",
  "Towards the end of the trip, I promised myself that I would not do it again.  Suddenly, I had the vague notion that I was in a carnival tent.  My walls are painted a dark burgundy, and the evening lighting was just coming through the curtains.  The TV in the next room seemed like a barker at a carnival.  He seemed to be yelling at me in a voice that sounded really authoritative and broadcasted over poor reception.  Each second that passed, I got a little more in control.  I made every effort to reach for the familiar world I had came from.  I made no movements to indicate my feelings to my friend who was watching to make sure I was okay.  I did this for several reasons.  1.  I was scared to move.  2.  I didn't want to make things worse.  3.  I knew it wouldn't last long.  In about 10 minutes, I could speak normally.  The effects subsided to what one would feel on a single sheet of blotter.  The after effects lasted for about an hour, and they were pretty pleasant.",
  "Conclusion:  Much of what is said about salvia in other articles is true.  I would agree with the following.  It is not something to do for 'fun'.  It should be respected as a powerful mind altering substance. The onset is quick and hard to prepare for.  The effects do not last long.  There's definitely a sinking or melting feeling.  It is much more intense and different than I had bargained for.",
  "That being said, I get the feeling that I could get better acquainted with salvia and get a lot more from it.  I just really have to go through that first plunge.  Even though, it sounds like a bad trip, I think most of that is from the initial surprise.  Im willing to try it again.  Overall, I am very glad that I tried it, despite my inevitable panic.  It really was completely new.  Very interesting.  It could have potential for a place of exploration if you wanted to give it the effort, and I do believe it is an effort.  It's actually kind of cool to get to experience that extreme of a loss of reality for only a brief moment and come back, no worse for the wear. I will probably take the 30X at least one more time, though I may pair it with a benzo.  I am interested in the leaf, since I found the lighter portion of the buzz pretty interesting."
 ],
 "erowid": {
  "id": "52823",
  "citation": " Overman. \"It Really Was Completely New: experience with Salvia divinorum (30x extract) (ID 52823)\". Erowid.org. Oct 3, 2007. erowid.org/exp/52823",
  "substance": "Salvia divinorum (30x extract)",
  "views": "5465"
 }
}
