{
 "id": 16528,
 "title": "Running Through the House of My Mind",
 "date": {
  "submission": "2008-02-24T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Mr. Chris",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "125 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "Right, Ive been meaning to type this up for a while, but it seems only now, approx. two weeks later, that Ive got the proper perspective to right something useful for people. Initially I was going to classify this as a Bad Trip, but now Im thinking Difficult Experience or even just as First Time. I hope this is useful or interesting as Im really going to try my best.",
  "Id like to preface this by saying that Im a VERY experienced drug user. For many years I have used cannabis, mushrooms (brilliant), MDMA (also brilliant), cocaine (waste of money), Meth (yuck), BZP and TMFPP (also yuck), morphine (interesting). I have also done things like experimenting with massive dose caffeine and prescription drug cocktails (stupid). Basically Im know what Im talking about. I would also like to add that I love psychedelics, theyre my favourite. Anyhow, I did all the reading up on salvia, and I mean thoroughly, for months. I knew to inhale deep and use a torch lighter. I knew to use a sitter. I knew how hardcore this stuff can be. I bought some 5x and despite my reading everything I made stupid mistakes.",
  "My girlfriend was out for a couple of hours, the house was empty, and I had nowhere I had to be for a couple of hours so I thought Hey, Ill smoke that salvia I bought. Ill see some shit and itll wear off by the time I have to go out. What an idiot. I would also like to say I was in a pretty good mental place at the time, but I should have been somewhere better.",
  "I cleaned up, locked the door (didnt want to go wandering off into traffic now, did I) and sat down on my bed. I filled the bowl with about 1/8 of a gram by eye (I had read this was a common amount  double checking I see this is strong  big mistake not checking). I had planned to smoke a threshold amount just so my brain had seen the chemical before, but I didnt bother  another mistake. I was feeling slightly anxious  as I torched and sucked in all the bowl in one massive rip. I thought the smoke would be harsh but didnt find it so. I held it and honestly didnt expect anything to happen as it was my first go  boy, was that a mistake.",
  "I could feel the salvia coming on after only a few seconds. I went to take another toke but I cant remember if I bothered. I reached down hundreds of miles to put the bong on the floor, scrabbled to turn on the CD player then watched myself lay back on the bed. I never felt myself touch the bed. I was instantly the highest Ive ever been. You know those graphs to show you how you go up and down? There was no line up. I went from baseline to fully high instantly. It was at the top of an asymptote.",
  "Reality got sucked away into a swirling vortex. I have noticed many people describe similar things but here goes anyway. There was an orange swirl going clockwise that was my bedroom, then a green swirl going in the same direction, yet in the opposite direction. The geometry of what I saw is completely impossible to explain as it can not exist in our reality. The green swirl was my living room. I was running backwards and forwards between them as my reality was being sucked away. I didnt remember smoking the herb. I didnt remember what reality is or was as it was being pulled from beneath me.",
  "This was almost complete ego loss and I was terrified. I mean, seriously, I had The Fear. I new that to bring reality back I had to be in the right room, but every time I reached one, I had to go back to the other way (the phrase kept repeating in my head) as the correct room had swapped again. I didnt want to be pulled along the twisting spiral and I tried to pull myself back by grabbing the banister of my stairs and pulling myself along. I could just do this, but it was more effort than I could ever explain. Also I should explain that I had no body and was using the hands of my mind.",
  "I am aware of the wooden porch my parents had when I was a child. I am also aware of how cross my mother is with me for being so stupid  screwing up my brain with this nightmare because I was a bit bored (I think the image/knowledge of my mother may represent the salvia itself  lady salvia, hey?). I try to say my name in my head but I cant finish it because a) I cant remember it all, b) it sounds ridiculous to me at the time, and c) language doesnt make sense. I try to say the name of where I live but I cant make language at all now.",
  "Im standing in my bedroom. Im confused and hot. I know Im in my room but I dont understand what the things in it are. Is this reality or somewhere else? Should I be here? Am I in someone elses house? I decide to find out if I really was running around the house. The door is unlocked. This confuses me, as I dont think I would have had the mental capacity to unlock a door. I creep down the hall and peek in the living room. The hall and the living room seem strange and disturbing I dont recognise them and I dont think Ive been here, although the scuffed carpet confuses me. I decide I definitely want to be in my bedroom. Im now just starting to get a handle on things. I change my T-shirt (Im really sweating). If I concentrate on something for a long time I know what it is, but if I concentrate too long I forget what everything else is, and I dont want reality to slip away again.",
  "I should mention that I still seriously had The Fear. Just remembering what happened in this much detail is still making me uncomfortable now. I want my girlfriend to come back and make it better (remember  no sitter = big problem) but I was scared she would be cross with me like my mum is/was. I also at some point around now spilt all the water out of my bong in attempt to put it away, because that might make it stop. I decide that acting normally will make me get better quickly, but TV seems so superficial and I cant concentrate on it. Plus as I said, when I concentrate I forget where I am. Also the TV program had an antique doll whos head had three different faces on it (this is true not a hallucination) which I didnt want to look at all  sill wouldnt. Adverts were OK.",
  "I spent the next hour/hour fifteen wandering between my bedroom and living room until my girlfriend came back. I instantly felt a bit better. I told her I was feeling confused by everything and she made everything seem better  God bless her.",
  "In retrospect Lady Salvia is not benevolent, not malevolent either. I went straight to I (level 5) on the S-A-L-V-I-A scale, and I dont want to be there again. I had nightmares about that complete ego and reality loss that night. Sometimes I look at how ridiculous the world is and I worry that Im not back in reality proper. This is just over two weeks later. Initially I swore off salvia completely, but I noticed I havent thrown away what Ive got. It was a profound experience and I may try (MUCH less) salvia again. I would, however, recommend it to no one. But I am glad Ive done it, even if it was the single most terrifying experience of my life. No one should have to feel what its like to be pulled from reality and forget who they are and where they come from  this last one worried me most How do I know if Im back if I dont know where Im from?",
  "I needed to get this off my chest as Ive only just managed to integrate what happened. Incidentally, my housemate was upstairs the whole time and said that I was definitely NOT running around the house, so I dont know what was going on there."
 ],
 "erowid": {
  "id": "52820",
  "citation": " Mr. Chris. \"Running Through the House of My Mind: experience with Salvia Divinorum (5x extract) (ID 52820)\". Erowid.org. Feb 24, 2008. erowid.org/exp/52820",
  "substance": "Salvia Divinorum (5x extract)",
  "views": "2743"
 }
}
