{
 "id": 16540,
 "title": "E.T. with Sharp Teeth",
 "date": {
  "submission": "2010-04-17T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hdasher",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:50",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I am submitting this about 4 hours into the trip so it may not be the most comprehensive...but, what the hay, here goes.",
  "11:30 - bought 1 box equate caffeine tablets (I was also looking for some kava kava but found none), taking 4 tabs with some root beer before leaving the store (subsequently leaving my friend stranded, but I figured at the time he was just playing hide and seek or had called someone to pick him up) and four more tabs after getting home to find my phone in my room with six missed calls from him.  All tabs were taken with the same can of barq's root beer.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I drove back to the store after contacting my friend and confirming he was in fact still there.  So I drove out there already feeling the initial buzz (about T+50 mins) and blasting the local jams station, driving a bit wreckless but feeling real nice, with slightly blurred vision.",
  "After getting to the store, I picked him up and threw a dollar for a soda and 8 tabs at my friend to try.  He took them and I finally agreed to drive off of the sidewalk of the store and head home.  But halfway home I decided to go to one of the 24hr pharmacies we have to look for some kava kava, but alas, they had none.  Meanwhile, my buddy was munching on fruit roll ups and following me around.  We came out of the pharmacy at about T+1.5 hrs.",
  "Once we got home, we stopped to meet up with a coworker who was smoking outside of our building.  I found that I became quite talkative, which triggered my awareness of the trip.  As I talked, my head began to loll around, and it felt about the same as either being drunk or robotripping and I described it as such to my coworker.  My buddy still wasn't feeling anything from the caffeine, which didn't trouble me too much as I was feeling rather carefree.  After about 15 mins me and my friend went inside, stopping at a stairwell to talk.  Mostly about the effects of the caffeine.  My friend a bit of a sugar high from the fruit roll-ups, but said he wasn't feeling anything special from the caffeine.  I talked about how I thought of myself as having a super low tolerance for drugs and I was trying to link it to something hereditary from my father, as I had never seen him ingest anything of drugs or even chemicals/hormones from food (he grew most all his own food).",
  "It was about T+2 hrs when my friend and I parted as my stomach had began to become upset. I have not mentioned it yet, But I had been ingesting senna tea, a laxative, and had evacuated everything I had eaten throughout the day, so this 1.6 grams of caffeine was ingested on an empty stomach.  I wanted to find a bed to rest my stomach on.",
  "When I got into my room my roommate asked if I was coming down yet, as I must have looked a lot worse than I felt.  However, I had not even peaked just yet.  I found my bed and crashed into it, the lights still quite bright.  The next 2 hrs would be the peak of the trip, as I tossed and turned, staring at my open doors, even when I was not facing them.  My mind was racing but I began to become removed from my surroundings, yet almost integrated into them at once.  I think it was due to me looking everywhere so quickly and trying to escape the gasping breaths and thundering heartbeat I held in my chest.",
  "At about T+4 hrs I decided I could not stand this trip anymore and decided to abort.  I decided this very quickly after I began to visualize something like an image of an E.T. looking thing with sharp sharp teeth, coming at me.  Though I wouldn't describe it as a hallucination, it made me uncomfortable enough to want to get away from the situation.  It must be noted that aside from the blaring bright lights, there was NO outside stimulus, and this might explain why my mind started making things up.  Anyhow, I promptly marched into my bathroom and vomited (not induced) this brackish brown particulate (where it came from, I don't know, as I was working with an empty stomach...the only thing I can think of is that it was a mixture of undigested caffeine tab and root beer).  I then put on some music (M.I.A.'s Arular) and tried to get my mind off the trip.",
  "It is T+5 hrs now and I feel mostly normal, still shaky, but have good control over my senses and am not struggling with overload.  Overall I am glad I took this step as I have found a definite limit for this kind of adventure (that is, I should stick with half of this dose, on a fuller stomach).  Oh, I do have numbness in my left arm - could be from lying on it and not realizing it, or maybe it is badness that I may need to write another article about.  Right now, though, I am just trying to chill out."
 ],
 "erowid": {
  "id": "52861",
  "citation": " Hdasher. \"E.T. with Sharp Teeth: experience with Caffeine (ID 52861)\". Erowid.org. Apr 17, 2010. erowid.org/exp/52861",
  "substance": "Caffeine",
  "views": "8627"
 }
}
