{
 "title": "A Fluffy Bubble",
 "author": "Draven",
 "citation": " Draven. \"A Fluffy Bubble: experience with Morning Glory, H.B. Woodrose, Calamus, Ginseng & Kava (ID 16544)\". Erowid.org. Jan 12, 2007. erowid.org/exp/16544",
 "substance": "Morning Glory, H.B. Woodrose, Calamus, Ginseng & Kava",
 "bodyweight": "165 lb",
 "report": "<p>Medication: None</p><p>Mindset/Setting:  I'm currently nearing the end of a gap year and to fill the endless bordom I decided to find and experiment with as many LEGAL drugs as possible.  I'm fairly new to any kind of 'drug like' experience so I was more than a little nervous not knowing what to expect.  I bought one 6 cap. pack of premixed herbs, I waited for a day when no one would be in the house for the majority of the day.</p><p>Preperation:  I'd been reading several accounts of other people's experiences in 'The Entheogen Review' and a common factor was meditation of one form or another.  One method in particular had stuck with me; laying on a comfortable surface (my bed) I placed my hands on my chest, closed my eyes and proceeded to take long, slow, deep breaths - smiling with each in-breath and relaxing as completely as possible with each out-breath.  While doing so I questioned my reasoning behind what I was about to do, came up with sound answers, strengthened my resolve and calmed myself down. I continued until I felt ready.</p><p>The Experience</p><p>Brief Note: My sleep paterns are a little strange at the moment, I wake up at ~3:00pm and go to bed at ~6:00am.</p><p>5:00pm - I sat down in my room and took the first 2 gelcapsules (the packet instructs staggering the dose by leaving 30-40 mins between each 2 caps in order to avoid nausea).  I'm pretty impatient so I decided to go for a long walk, and after the requisite 30 mins I hadn't noticed any changes in perseption so I stopped to take the next dose.</p><p>5:30pm - It was when I stopped moving that the initial effects made themselves clear.  Looking at the grassy countryside that surrounded me I was surprised to notice that the world was slightly effervescent.  All colours were mildly enhanced.  When still and staring at stationary objects (trees, etc.) they would change in perspective, appearing to zoom in and out ever so slightly.  Down went the next 2 caps. as I returned home.  I had little to do so I sat down to watch some T.V.</p><p>6:00pm - Before I took the last dose I got up from my bed to check my pupils.  F**K they were wide!!  I'm not kidding when I say there was equal to or less than 1mm of iris left to see.  I wondered briefly if I could damage them like this, but downed the last 2 caps. and realised that I felt quite light on my feet, almost floaty.  I was feeling quite giggly now, laughing at laughing had me rolling around on my bed for several minutes, several times.  I also noticed that EVERYTHING felt soft and tingly and nice, as if your incased in a fluffy bubble.</p><p>7:00pm - I think this must have been the peak because I was really euphoric and giggly.  I wandered around outside a fair bit just marveling at the beauty of mother-earth and her myriad facets.  I had several focused thoughts about the nature of mankind, my place in the comos and such.  This platau lasted a pleasurable 3 hours and then very gradually began to taper off.</p><p>5:30am - Up until now I'd felt full of energy but then, almost as 5:30 ticked over, I felt extreamly tired.  I did the necessary's and climbed into bed where I quickly fell asleep.</p><p>After Effects</p><p>None really, other than having one of the best dreams EVER the next morning.  I got out of bed almost instantly (this almost NEVER happens to me) and felt happy and revitalised.  Every time I gaze at some object of nature I'm still struck by its glory and begin to ponder our existence.</p><p>Conclusion</p><p>It's hard to describe what it actually feels like. It makes you want to have deep and meaningfull thoughts about Life, the Universe, and Everything.  The only real bad thing is that, although everything feels nice and soft and tingly, anything sexual seems a bit boring.  I'm a horny teenager but even my desires languished and faltered.  All in all a good experience I will try again.</p>",
 "year": "2002",
 "id": "16544",
 "gender": "Male",
 "timestamp": "2007-01-12T08:00:00.000Z",
 "views": "17423",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 capsls",
   "administration": "oral",
   "substance": "Various",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "2 capsls",
   "administration": "oral",
   "substance": "Various",
   "form": "(capsule)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "2 capsls",
   "administration": "oral",
   "substance": "Various",
   "form": "(capsule)"
  }
 }
}
