{
 "id": 16556,
 "title": "Two Siezures and a Trip to the Hospital",
 "date": {
  "submission": "2007-11-17T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "10.5 g",
   "administration": "oral",
   "substance": "Amanitas",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I have taken Amanitas on a few occasions.  I do not know why my reaction was as such this time, since it was from the same batch I had had before, which was from a very reputable online source.  So I don't think it was the mushrooms itself.  So maybe it was either the preparation, the 1 beer I had earlier, or a synergised effect between the Amanita and marijuana.  The latter seems unlikely to me because I have been a daily pot smoker for over a decade, but frankly I don't know what happened.",
  "It all started on a saturday night.  I had finished one exam the day before and had one more to go but I decided I needed a break from studying and thus decided to make myself an Amanita tea.  I took 10.5 grams (usually I take 7 grams),crushed them, added 1 lime, some green tea, a tbls of honey, and simmered the whole thing for 30 min.  Then I strained the tea using a cloth and slowly drank the mixture over a half hour period.",
  "Then I went for a walk. I smoked one joint and that took care of my nausea.  I continued to walk for about an hour.  I was increasingly reaching the peak. I stupidly decided that I wanted another joint, mainly as a habit of smoking on my 'journey' home.      By the time I finished the joint I noticed I was getting increasingly dizzy and going in and out of 'sleep'.  So I sat down out of precaution, so I wouldn't walk into traffic. I don't remember much after that other than a few incidents.",
  "I remember a couple that was walking asking me if I was alright.  Then I remember one of them saying they called the ambulance.  Then I remember what appeared to be the police and some paramedics standing over me and asking all sorts of questions which I could not respond too.  I thought it was all a dream.  Then I remember being in the emergency room with doctors and nurses stripping my close off, sticking all sorts of IVs in me, and a tube up my urethra (I remember this excrutiating pain). I heard a couple nurses or doctors (not sure) scream, 'He is going into seizure again.'  I then recall the doctor asking me if I took heroin a few times, and all I muttered was amanita, but he didn't know what I was saying. Then I remember coming to, with my mom by my side, about 6-8 hours later.",
  "I didn't know who I was or where I was for a long time.  I thought maybe I had been hit by a car, or maybe I had died.  I simply didn't know and really didn't care, it is the day after now, and all I have as memories of last night are about 6 IV spots on both my arms, and an extremely painful urethra, which is torture to pee out of.  I simply don't know what happened, maybe it was the drugs, the dosage, or something completely different.  I got CAT scans and I don't have a tumor.  I have never had a seizure in my life prior to this.  I also can no longer drive until I follow up with a neurologist."
 ],
 "erowid": {
  "id": "52928",
  "citation": " Anonymous. \"Two Siezures and a Trip to the Hospital: experience with Amanitas - A. muscaria & Cannabis (ID 52928)\". Erowid.org. Nov 17, 2007. erowid.org/exp/52928",
  "substance": "Amanitas - A. muscaria & Cannabis",
  "views": "17995"
 }
}
