{
 "id": 16551,
 "title": "Feeling like Johnny Cash at His Worst",
 "date": {
  "submission": "2007-06-19T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Travisbickle",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  },
  {
   "time": "13:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Propranolol",
   "form": "(pill / tablet)"
  },
  {
   "time": "13:30",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Okay, First of all I've been diagnosed with severe depression/insomnia.  I had been up for two nights in a row now, and it's about 7:30am.  Why waste the day, so I pop my prescribed 300mg wellbutrin for the morning.  Yep, I'm up and runnin' within 30 minutes now. ",
  "Later that day I was bored with no narcotics at hand.  So I pop 40mg propranolol at 8:00pm (not prescribed), then 300mg more of wellbutrin, prescribed, at 8:30.  Within 45 minutes I am sweating horribly, and tweakin' like I've downed 8 cups of coffee and took some amphetamine.  This sweating is starting to irritate me so I take my shirt off and turn the fan on.  Spiders and Vinaragoons is starting to wig me out, so I play something soothing hoping for a change in mood. ",
  "It's hard to concentrate because of my tweaking arms and pulsing heart rate.  I change the song to Bowie's 'Drive In Saturday'...aahhhh.  I keep  it with the Bowie tunes for a long while.  About 10:00pm I feel somewhat better, but still tweaking and my head feels warm, but a bloodrush loving type of warm.  Well to make this long story short now; day three of the insomnia occurred.  I smoked a pack of Reds/played guitar/took a shower/ and cleaned most of my room, (which was a wasteland)."
 ],
 "erowid": {
  "id": "52907",
  "citation": " Travisbickle. \"Feeling like Johnny Cash at His Worst: experience with Propranolol & Bupropion (Wellbutrin) (ID 52907)\". Erowid.org. Jun 19, 2007. erowid.org/exp/52907",
  "substance": "Propranolol & Bupropion (Wellbutrin)",
  "views": "19016"
 }
}
