{
 "title": "Rectal DXM",
 "author": "DXM",
 "citation": " DXM. \"Rectal DXM: experience with DXM (ID 16566)\". Erowid.org. May 7, 2004. erowid.org/exp/16566",
 "substance": "DXM",
 "bodyweight": "200 lb",
 "report": "<p>Rectal Robo</p><p>Okay, I was stupid, very stupid. Don't do this. And if you do, read everything I say!</p><p>11:15  injected about 7cc /water  4cc/generic light dry rum and approx  500mg pure dxm into my rectal cavity</p><p>11:43 slight discomfort in within my  lower intestinal region, similar to normal DXM gas</p><p>12:03 rush to the bathroom without even getting dressed, landing on the pot without even closing the door releasing more anal force than i have ever experienced, including my recent encounter with food poisoning</p><p>Okay, this experience is very similar to severe hershey squirts, with the addition of dxm ejecting itself from your body. I dont know how many times ive chatted with people before during and after they snorted dxm, and not to forget my own near death experience doing it as well, just  imagine that 100x!!!</p><p>I know the exact moment the powder hits my asshole, I bite my lips really hard while trying to scream, but I cant because all sensory is focused on the Birth of Satan. THis is truly horrible but not long lasting, and solved by wiping my ass with toilet paper. Unfortunatly I took this to be the alcohol coming in contact with my asshole....</p><p>12:15 all showered up and laying in bed in disbelief of what i had actually done, listening to music, suddenly noticing  a very slight enhancement and serenity to to my overall consciousness, with a deeper focus and involvment towards it.</p><p>1:03  after several trips to the pot to 'blow off steam' remaining inside me, i contemplate on Gdog's enema recommendation and grin to myself thinking  how could i possibly have anymore fecal matter waiting to be born? considering trying it again, this time with a lesser dose.</p><p>1:05 That becomes a reality and this time i find myself shoving about 300mg pure in a cap up my ass as far as it could go</p><p>1:11  reconnecting with feelings recently experienced, i found myself quickly squatting on the can hoping i dont poop out the dxm. yup. it happens. i quickly clean up and get myself showered and just sit on the toilet smoking cigarette after cigareette.</p><p>1:50  Realized that almost a very small fraction of my intestinal merchandise had been excreted the first time, and considering that maybe having shit deep within my bowels might be my problem i decide to give myself an enema, and try again.</p><p>2:00 on the dot i shove another pill up my ass, this time about 500mg</p><p>2:40  i sit here and think, man what if i took to much? what if i get so completely fucked up, this is the longest ive gone without discomfort of any kind yet, i guess ill wait and see. im pretty accustomed to running to the toilet and releasing pressure now. ill just lie down and ride it out.</p><p>2:50  okay fuck this bullshit. i got all gassy and shit again. only this time it was fucking BLOOD.</p>",
 "year": "2002",
 "id": "16566",
 "gender": "Male",
 "timestamp": "2004-05-07T07:00:00.000Z",
 "views": "27960",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "rectal",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "500 mg",
   "administration": "rectal",
   "substance": "DXM",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 1:50",
   "amount": "300 mg",
   "administration": "rectal",
   "substance": "DXM",
   "form": "(capsule)"
  },
  "3": {
   "time": " T+ 2:45",
   "amount": "500 mg",
   "administration": "rectal",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 }
}
