{
 "id": 16563,
 "title": "Bundle of Joy",
 "date": {
  "submission": "2007-03-13T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Syn",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Lotus/Lily",
   "form": "dried",
   "specific": "Nymphaea nouchali var caerulea"
  }
 ],
 "report": [
  "I had done my research on Blue Lotus. I had been looking for some time for a mild alternative to cannabis. However, I also seek the mental feeling of well-being that blue lotus purportedly imbibes on the user. I had just bought 5 grams of the flower the previous afternoon from a local dealer.",
  "I sat down in the plant room, ready for what would occur, unsure as what my reaction would be. (I am extremely sensitive to almost all substances, and in my experience, I am always 'hit harder' than anyone else I know.) I sat down, the window open behind me, and proceeded to break off a single leaf from a dried flower and snap it into small pieces so that they would fill my pipe. I sat down, relaxed and ignited my leaf in the bowl. It flamed hot and as I drew the smoke into my lungs, I found it much milder than cannabis. I held it for about 7 seconds in my lungs, then exhaled, letting the sweet-smelling smoke out (I have sinces used some of the flower petals as a very nice smelling incense).",
  "After about 2 hits, I began to feel drifty, as if I was being swept up into the clouds on a cloud, with a feeling of such quiet joy that I smiled and took two more hits. I put my pipe away, and felt extremely relaxed, not a care in the world, smiling gently with my mind clear as a mountain stream. I went to bed and laid down, thinking of many things and experiencing a shift into more mentally active, cannabis-like effects. I felt very happy and relaxed. I invented a term for being under the influence of Blue Lotus, as I felt that the term 'stoned' was more related to cannabis. I therefore termed my state as being 'Germinated', since I felt as if my mind were open like a glorious flower, at peace and joyously happy.",
  "I went to sleep shortly after, and awoke the following morning still a bit buzzed. This faded, but I was extremely satisfied with my experience."
 ],
 "erowid": {
  "id": "52962",
  "citation": " Syn. \"Bundle of Joy: experience with Blue Lotus (ID 52962)\". Erowid.org. Mar 13, 2007. erowid.org/exp/52962",
  "substance": "Blue Lotus",
  "views": "19395"
 }
}
