{
 "id": 16566,
 "title": "Playing with Pure",
 "date": {
  "submission": "2008-04-30T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jericanman",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Coffee",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "Caffeine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I have noticed their aren't any reports regarding the use of pure caffeine extract. I've recently purchased 100g of 100% pure caffeine extract.",
  "Background",
  "I'm a normal coffee drinker though I only injest 1 cup a day in the morning though with out it I barely function. Sometimes I will also have 1 or 2 cups of tea throughout the day. This amounts to about 200mg in a day (strong black coffee 120mg aprox and 1 - 2 teas at around 40mg each).",
  "Drank",
  "As with any day I had my regular morning coffee but I also added aproximatly 200mg of caffeine powder to my morning brew. The effects where very noticeable. I felt energised and slightly euphoric.",
  "Snorted",
  "Later I tryed snorting the caffeine. I have done this before when I purchased 2 grams of suposibly pure caffeine from the internet. This couldn't have ben pure as the burn from snorting was unbearable. Because of my previous experiments I was expecting a burn sensation from my nose when I snorted the powder (150mg aprox). There was no burn, a slight tingling and a bitter taste dripping down the back of my throat. The high was noticable almost instantly, but the downside of the quick up take is the crash also happens sooner, I'd say aproximatly 30 - 40mins after.",
  "I intend to keep the rest of my 100g of pure caffeine I intend to use it mainly in the summer (I hate drinking coffee and other hot drinks when it's hot and sunny). I can add exact amounts of caffeine to bottled water much better than red bull or the like nice clean high. Though I do intend to purchase some turine and try experimenting with caffeine as the combination of these 2 chemicals seems to increase the effects of the stimulant effect of caffeine."
 ],
 "erowid": {
  "id": "52973",
  "citation": " Jericanman. \"Playing with Pure: experience with Caffeine (ID 52973)\". Erowid.org. Apr 30, 2008. erowid.org/exp/52973",
  "substance": "Caffeine",
  "views": "18486"
 }
}
