{
 "id": 16569,
 "title": "Increase in Effects with BP Rise",
 "date": {
  "submission": "2007-04-25T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mr Dreams-In-Pink",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "36 g",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "powder/crystals"
  },
  {
   "time": "0:00",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "tea"
  },
  {
   "time": "0:30",
   "amount": "9.0 g",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "[Erowid Note: Combining MAOIs with other psychoactive drugs carries serious medical risks and can result in extremely unpleasant side effects, overheating, nausea, confusion, heart problems, and even death. Please see Erowid's MAOI Vault]",
  "Recently, AFOAF has been investigating the combination of MAOI and a mescaline containing cactus.  The idea was to decrease the amount of  powdered cactus consumed (The gas and bloating are uncomfortable) and maintain effects.  And so the experiment....San Pedro was prepared from fresh cuttings, despined, peeled, subjected to 2 freeze/thaw cycles, and processed in a blender until smooth foam was obtained.  Cactus foam was then dried in trays using fans and then powdered.",
  "Refernce run:",
  "Plain cactus: 36gm dried powdered San Pedro",
  "BP 144/84, then 146/92 after 3 hours, slightly before peak effect",
  "Dose was enough for mood elevation, color enhancement, and moderate visual distortions (marble floor tiles flowing).  Musical enhancement.",
  "Trial Run:",
  "Cactus + Syrian Rue brew:",
  "Syrian Rue  1.5gm dose.",
  "San Pedro: 9GM of the same dried powdered San Pedro was consumed 1/2 hour after the 1.5gm Rue brew.",
  "BP was measured at same time point and was 156/92.",
  "There was marked activity from the 9gm dose, about equal to a 20-25gm dose without rue. Duration of effect may also have been prolonged a little bit.",
  "Conclusions:  It works for sure but there was a slight increase in BP.  AFOAF would say it about doubles the effect at 1.5gm.",
  "Further trials will be done"
 ],
 "erowid": {
  "id": "52981",
  "citation": " Mr Dreams-In-Pink. \"Increase in Effects with BP Rise: experience with Cacti - T. pachanoi & Syrian Rue (ID 52981)\". Erowid.org. Apr 25, 2007. erowid.org/exp/52981",
  "substance": "Cacti - T. pachanoi & Syrian Rue",
  "views": "9797"
 }
}
