{
 "title": "Synaesthesia & Ecstacy",
 "author": "Butterfly Bomb",
 "citation": " Butterfly Bomb. \"Synaesthesia & Ecstacy: experience with MDMA (ID 16569)\". Erowid.org. Aug 6, 2002. erowid.org/exp/16569",
 "substance": "MDMA",
 "bodyweight": "110 lb",
 "report": "<p>Definitions: (from The American Heritage Dictionary of the English Language, Fourth Edition)</p><p>> synesthesia also synaesthesia : n.</p><p>1.A condition in which one type of stimulation evokes the sensation of another, as when the hearing of a sound produces the visualization of a color.</p><p>2.A sensation felt in one part of the body as a result of stimulus applied to another, as in referred pain.</p><p>3.The description of one kind of sense impression by using words that normally describe another.</p><p>> hyperesthesia also hyperaesthesia : n.</p><p>1. An abnormal or pathological increase in sensitivity to sensory stimuli, as of the skin to touch or the ear to sound.</p><p>-------------------------------------------------------------------</p><p>##begin</p><p>Synaesthesia, in this context, will be the first definition -- hearing texture, tasting sound -- and by that definition, I am naturally synaesthetic. This, then, is written from the perspective of someone who cannot concieve of an experience that does not involve all five senses nearly equally. Music, dance, and drugs are all full multimedia experiences for me. As a sidenote, I also have an exceptionally high metabolism, type I diabetes mellitus (an autoimmune dysfunction), and autoimmune-triggered hepatic porphyria. The only medication I take is insulin, an injectable hormone in the form of long protein chains in a liquid suspension. Personally, I blame the synaesthesia on the autoimmune dysfunctions.</p><p>MDMA, as far as i can tell, is euphoric, hyperaesthetic, and slightly synaesthetic in its actions in normal people. (eg. non synaesthetic folks). This is usually a good thing; it expands the horizons of the user and tends to allow the brain to believe that this is an ok thing. Most people, I've noticed, have problems expanding their realities when left to their own devices.</p><p>So, thinking more of the drug than of my peculiar condition, I decided it would be a fun thing to try. The room had no windows, and only mixed red and blue light from hanging lamps; there was one other passenger on this trip, and we were playing some really good darkwave. I took my pill, he took his. Within 20 minutes, I was feeling like I owned the world, but the worst thing I could imagine was being touched. I could feel every object in the room from feet away, and proved it by navigating with my eyes closed after having the other passenger move some things into the way. At 40 minutes, the volume was up so high on my sensory perceptions that I could taste the sour/sweet flavour of the silky shirt I wore so well that it seemed to burn my mouth. The cloth itself felt like burlap, and I could hear my own heartbeat like a huge kodo drum. Every heartbeat pulsed outward in my vision like a dark sphere, and during the split second intervals, the light was far too bright -- a high-pitched sound like metal on glass. I promptly had a seizure, and then assumed the foetal position on the floor where I had fallen. I made no attempt to move.</p><p>Needless to say, this was a hellish experience. It lasted another hour, after which no symptoms of the chemical remained. Thusly the entire experience lasted no more than 1:40.</p><p>Yes, I tested it; yes, it was MDMA.</p><p>Same batch, in smaller doses, weeks later, produced similar, but lesser, effects. Not enough to cause seizure, but enough to be uncomfortable. Repeated experimentation yielded the same results.</p><p>Moral of this story? If you're synaesthetic already, think twice about MDMA.</p><p>##end</p>",
 "year": "2000",
 "id": "16569",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-08-06T07:00:00.000Z",
 "views": "27119",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
