{
 "title": "First Real Salvia Trip",
 "author": "Salvia",
 "citation": " Salvia. \"First Real Salvia Trip: experience with Salvia divinorum (ID 16590)\". Erowid.org. May 17, 2005. erowid.org/exp/16590",
 "substance": "Salvia divinorum",
 "bodyweight": "160 lb",
 "header": [
  "DOSE: T+ 0:00",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(extract - 5x)",
  " T+ 0:20",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(extract - 5x)"
 ],
 "report": "<p>This was my second experience with Salvia. My first time, I smoked a large joint of the dried leaves and had a level one - almost two - experience. This time I had effects all the way from level six.</p><p>I've rolled, tripped, and hippy flipped. I've smoked cannibus and meth (which was extremely stupid IMHO, I only did it once - yuk). This was unlike any other experience. It was a completely unique presentation of information.</p><p>I began by taking two heavy hits from a glass water pipe of 5x salvia purchased at a head shop. The first hit was extremely smooth and easy to take. After holding the first hit for 20 seconds I noticed an extreme shift in awareness. It was nice to have a 'new' sensation to try to understand. After the second hit I found myself completely lost, not knowing what position I was in. Somehow I managed to pass the glassware to the next explorer and I fell miles back into my seat.</p><p>I don't remember, or perhaps do no understand all of what I experienced during the inital rush. I was shocked at how intense the feeling was given that the last time I'd smoked Salvia I'd gotten very little from it. I found myself trying to remember not to chew on my tongue. Somehow, the concept spewed from me outward, attached itself to the universe and began pulling it in towards me.</p><p>Once the rush subsided, I noticed an irritation to the skin and a general feeling of unpleasaness. I shifted my attention to the temperature and remembered that the lake-side air was fresh and cool. I thought maybe the sensation was coming from the fire but I then noticed that I was a good distance from the flame. I felt uncomfortable and wanted to get up and find a better location. This subsided and I started to explore the experience with more clarity.</p><p>While standing I noticed that I seemed somehow very large and the objects off in the distance felt closer to me.</p><p>When I focused on the fire, it became the center of the known universe. My field of view narrowed in on the fire and the fabric of space was pulled in on top of it.</p><p>I found myself wanting to find comfort in something. I took drinks of water hoping for some kind of satisfaction.</p><p>I felt a breeze of panic and paranioa and wanted the experience to end soon.</p><p>Time past extremely quickly. It felt like I was 2 minutes into the trip when our sober guide said 20 had passed. I felt the comfort of reality settling back in and while it was welcome, I felt the desire to go a little further.</p><p>I took two more hits. This time I fell back into the chair and completely lost myself. I wish I could remember more about that period, I do remember reminding myself to do little things like breath. I had several different strange hullucenations upon returning. The most frightening was thinking that I was alone. As I regained self realization, I found myself to be the only object in existence. I thought I was dead. I was scared. There seemed to be at least three visions pouring in together - perhaps alternating back and forth. One was me being attached to a cylinder type object by my back, trying to pull away, peel off. The object was everything and it was behind me. In front of me was nothingness and I was drawn to it - the reverse of gravity and the need to be independent. The second vision was more literal - I saw the world around me as colorless and without detail. Landscapes were smooth and flat. Objects were curved and without features. Unlike earlier, when I could only focus on the fire, I could now focus on 360 degrees of the world around me - only the world had no detail, just basic form. A third vision, or perhaps just a realization, was that I was the only thing that existed. I found myself fighting for my life in a strugle to not be alone. My awareness of my two friends showed itself in all of the visions.</p><p>At this point, I knew I'd been sitting silently in that palce for a long time. I didn't know what a chair was, how I got there, or anything previous to the moment I was in. I stood up and asked for help. Funny thing is - my guide has the same first name as me. He said I spoke his name specifically, but I believe I was asking myself for help. I remember being extremely confused when I realized his name was the same as mine and I'd just said it out loud.</p><p>After I stood, the world slowly came back into focus. It took a great deal of effort to let reality back in. I wasn't sober by any means, but all of the objects in my surroundings were once again familiar and showing up in the normal level of detail. I was able to converse with my friends again and I tried to tell them how I thought I was the only awareness that existed - and how frightened it made me.</p><p>I felt awake and very greatful for life. As I sobered up, I felt no negative effects both mentally and physically. I would recommend the trip to anyone seeking a deeper understanding of self, but would discourage anyone who's only looking to feel pleasant. This is not the type of trip I would take often. It wasn't 'fun' like a shroom or acid trip.</p><p>The only connection I found between the salvia trip and the shroom trip was the feeling that I died. With the shroom trip, reality came in very fast and very vividly. With the salvia trip, reality came in slowly and, like the other visions, in a completely different perspective.</p><p>I will likely do Salvia again, but not for a while. I look forward to being a guide for any of my friends who decide to explore.</p><p>-lucid</p>",
 "year": "2002",
 "id": "16590",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-05-17T07:00:00.000Z",
 "views": "15724",
 "dose": {}
}
