{
 "id": 16591,
 "title": "Spring Water",
 "date": {
  "submission": "2006-06-16T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Natheus",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "-19 years old.",
  "-Live in California",
  "-One year and out of college.",
  "-Currently unemployed.",
  "-Lots of time on my hands.",
  "I told my Doctor I was being treated by a therapist for Adjustment Disorder with mixed anxiety and depression without medication.  He gave me a month supply of five sample boxes, each with seven, 10mg tabs of Lexapro to try.  Knowing that 10mg is a relatively low dosage, I went home and crushed up five tablets and parachuted [swallowed it wrapped in toilet paper] to feel the medication in full force.  In opposition to time release, the entire contents of a parachute is absorbed and digested by my stomach much quicker than when in tablet form so I can feel the effects quicker and more intensely.  Ive taken SSRIs before (Paxil, Celexa)for leisure purposes and liked them a good deal.",
  "Ive had cereal for breakfast, and spaghetti for lunch with some orange juice and downed it all with some water.  My symptoms of anxiety and depression compliment each other on a daily basis.  I feel either one or the other during the day and sometimes both, but today, the symptoms are quite miniscule.  I might add that I do have a slight headache, although it is a hot day and I may have not drank enough water during my walk in the sun to meet my new Doctor.",
  "T+0:00= Dropped the parachute.",
  "T+0:19 = Coming up on the SSRIs already.  I feel relaxed and I can easily focus on tasks and feel good.  There are little or no momentary interruptions in concentration from my symptoms.  Ive recently been battling an addiction to marijuana (winningly) and feel zero desire to smoke, which is constantly present.",
  "T+0:30 = Feel completely normal with no desire to smoke or use any mind altering substance.  Frustration and irritation is usually present when doing curricular or creative projects.  Zero agitation or irritation is present now.  Headache pain has increased although it is easier to objectify my pain and ignore it.  Going to drink a glass of water.",
  "T+1:04 = Increasing nausea in conjunction with butterflies in the stomach; an interesting sensation I get from SSRIs.  Headache pain has leveled off but is now a major bitch.",
  "T+2:00 = Nausea has decreased significantly and is coming in and out.  Headache persisting.  A tingling sensation is being enjoyed throughout the muscles in my body and more notably my abdomen, calves, genitals and neck.  Im also experiencing a curious lump congregating at the base of my throat below my Adams Apple.  This is sometimes experienced when I try to force or suppress a need to cry and is curious as to why it is occurring now.  When these sensations intensify, my body goes tense along with my diaphragm and it is difficult to relax.  I played some xbox racing games and found it slightly difficult to focus due to these bodily sensations, but when Im focused, the game play is very enjoyable and is mentally more realistic and stimulating.  Despite my bodily sensations I had a comfortable conversation with my Mom when she arrived home from work and noticed comforting support from the drug that prevented me to experience frustration while conversing with her.",
  "T+2:15 hrs = Peaking nowfor sure.  Wow.  The bodily sensations are (dare I say) almost synonymous to ecstasy.  Im experiencing minimal jaw clenching and flowing endorphins.  I wish I didnt have a headache.",
  "T+3:21hrs= Rolled the dice on a cup of tea to shake my headache, and it is working.  The pain is still present but half as intense.  I hypothesize it will come back around nine or ten as I try to fall asleep, but by that time Im planning on taking Tylenol PM, melatonin, and some over-the-counter phyto-caps (tablets with valerian root and kava kava, stuff like that for sedation) any way.",
  "Caffeine is bliss when mixed with the SSRI.  I have zero anxiety/depression, and I have no trouble focusing on tasks.  Concentration is a pleasant state of mind.  I came back to my xbox racing game with more pleasure and better racing results than before.  My bodily sensations are still present but are under much better control and are very enjoyable.  My peak is tapering and long-lived and the sensations fade in and out, almost at will.",
  "T+4:00 hrs =  Whenever I yawn it releases a great amount of endorphins and makes me feel very sleepy and relaxed, increasing my body high in the noted regions above for a duration of eight to ten seconds.  My body high is coming in and out with greater amplitude and wavelength than before.  I can assure my readers that the peak is almost over and the effects of the drug are taking a very long time to taper off.",
  "T+5:05 hrs = Ate dinner with tryptophan rich foods (i.e. chicken and milk) in front of TV and took a shower which was an excellent idea.  After eating my body re-energized and got me another body high under the hot water.  Im in bed and about to watch a movie and fall asleep.  Im in a manageable state of mind.  Im able to isolate stress from my body and conscience move unimportant issues to the back of my mind, letting them evaporate from its periphery.  It is a very peaceful evening and it looks like Ill be falling asleep early this evening, which would be a miracle.  Typically, I only sleep from 2am-8am due to stress.",
  "T+6:13 hrs =  An epiphany hit me that hasnt been realized till now and was partially materialized during a shroom trip.  This whole time Ive been wasting my life chasing meaningless steaming mounds of shit.  Ive been chasing the foul notion of the American dream this whole time Ive existed on earth and have accomplished nothing in terms of individualism. ",
  "My whole life has revolved around chasing dollar bills, women, and fame.  I have none of these things spite my charms and handsome looks.  I am a piece of shit.  I have nothing.  I have no friends to turn to.  I have at least five solid hours to myself in the evening.  How do I spend this time?  Lying on my bed staring at walls or watching TV filling my head with air and eating bull shit.  There is so much I could be doing to live life every day, and I pass up those opportunities with each passing moment.  Im too busy worrying about what people are thinking about me this very moment, or thinking about how Im going to get rich when I dont even have the motivation to read a damn book for leisure or go to classes.  Then I spend even more time worrying about how Im not getting anywhere.  I could be building a shed or writing a song.  I could be drawing, painting, or even potting in the garage with my Moms old equipment.  I want to build something.  I want to create.  I want LIFE.  And finally I remember what it feels like at baseline again.  I remember what its like to stroll through that door again. ",
  "Until taking this drug and knowing it will be there for me tomorrow, I forgot what it was like to live, now that I know what living is.  I feel the weight of the universe begin to lift off my shoulders that was once to heavy to bear.",
  "I cannot promise that I will live my life like this henceforth, but I sure as hell must try.  As sure as HELL!",
  "T+7:17 hrs =  Cant sleep.  My creative energies are flowing like a cool crystal clear spring stream, running down the mountain.  It feels so fresh, bright and new.  I feel more awake than I have in a while which is bittersweet cause Id like to sleep tonight.  I have this hunger that comes to me now in the form of boredom, but instead of smoking weed, watching TV or playing video games to fulfill my boring life, I took out the only things I had to draw with; my pen and paper, and got to work.  I drew concepts for pots I would like to make.  God knows I dont have the skill to create half of one of the pieces I drew, but the ideas are great, on paper at least.  I only did it cause I felt like doing it.  I usually hate drawing because Im never satisfied with anything that I draw due to the fact that Im extremely critical, which takes all the fun out of it. ",
  "I just keep thinking, Ill never amount to anything.  This drawing looks like SHIT!!!  But right now, Im just letting it flow and turning my mistakes into new ideas.  Im letting the pen take me to places Ive never dared to go.  Im too excited to sleep, but I think its time that I try.  Music has never put me to sleep before, but then again, Ive never liked my drawings before either.",
  "T+15:55 hrs =  While falling asleep last night, I dreamt that I was staring straight at an object in my room like say my laptop computer, and when I opened my eyes, I would be looking straight at and it would be open with the screen upright, only in my dream, it would be closed shut.  I had various dreams like this until I finally did sleep, and then my dreams got really deep.  I dreamt of saying things to my father I never had the courage to say to him.  For instance, little things such as I just need some space right now dad, leave me alone.  Although I could not tell that I was dreaming, it felt so good to finally tell him these things I never had enough courage to say to him.  I still feel as though I could call him right now and tell him the exact same things.  Also, Im always standing out side of my body when I dream in a third person view, but in my dreams last night, I was inside my body in very real and half lucid dreams.  I was in much more control and they seemed stunningly real.",
  "This morning, I feel great.  I have a job interview and my stress level is one quarter what it should be.  Im going to slam it.  I have a good feeling.",
  "This drug is doing wonders for me.  I took way too much last night, but Im glad I didnt take more or less.  Im curious to see how this medication will impact my life.  As for now, Im going to dust of the potting equipment in the garage."
 ],
 "erowid": {
  "id": "53042",
  "citation": " Natheus. \"Spring Water: experience with Escitalopram (Lexapro) (ID 53042)\". Erowid.org. Jun 16, 2006. erowid.org/exp/53042",
  "substance": "Escitalopram (Lexapro)",
  "views": "38207"
 }
}
