{
 "id": 1659,
 "title": "Somewhere Between Meth and MDMA, Yet Unique",
 "date": {
  "submission": "2002-06-08T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "fairnymph",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "4-Methylaminorex",
   "form": "powder / crystals"
  },
  {
   "time": "1:00",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "4-Methylaminorex",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Drug: 4-methylaminorex, aka 'Ice', a member of the oxazoline family",
  "Dose: 30 mg orally (at t = 0:00), 30 mg snorted (at t = 1:00)",
  "Duration: time to kick in -- 15 min, come up -- 2 hours, plateau -- 3 hours, come down (effects still quite strong) -- 3 hours, come down (effects minimal) -- 3.5 hours TOTAL = 11.5 hours",
  "Experience: Experience with most drugs, very experienced stimulants, especially methamphetamine",
  "Setting: Hanging out with friends (4 males and me [female]!) at my house, listening to music and talking. We all partake in the icy goodness, they smoke and I eat/snort.",
  "Mindset: Very good!",
  "Although we were told that the stuff was 4-MAR, considering its rarity I was not about to be convinced until I had felt its effects for myself. If the stuff was NOT actually 4-MAR we figured it would be high quality crystal meth which wouldn't be too bad either.",
  "Upon acquiring the 4-MAR, we immediately opened the baggy and peaked in. I lent down to smell it and almost stepped back in reaction to the strong chemical smell. The smell was almost plastic-like. Although I hadn't smelled meth in a while, my immediate gut, intuitive reaction was that this drug was indeed a new drug, and NOT methamphetamine. Although meth has a distinct taste, it does not smell that strongly -- not like this stuff, which hits you in the face. I reckon that this is the only real way to determine whether something called 'ice' is indeed 4-MAR -- based on smell, and the judgement of an experienced meth user. I tasted a little and it also tasted different, though the aftertaste is extremely similar to meth's. This made me suspicious, but I was still not convinced one way or the other.\r[Erowid Note: the smell of the material may have more to do with the solvents used during crystalization than the smell of the chemical itself.]",
  "Since the others planned to smoke it, and I was eating it, I decided to get a jump start. I eyeballed a few of the larger crystals  (dosage later determined via a scale and math) and swallowed them down with some water. Almost immediately my stomach felt a little queasy/tight, which I contributed to placebo effect (correctly) and to anticipation. I had been looking for this drug for a while, being the stimulant lover that I am. I was extremely excited about the experience and also psyched about the people I would be sharing the experience with.",
  "We all piled into cars to go pick up a friend. The drive was short and along the way (15 minutes after dosing) I began to feel the effects. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  I felt a twinge in my stomach and the beginnings of a head buzz and a pleasant body high. I felt slightly euphoric and turned up the music the car (Paul Van Dyk). While it feels similar to both MDMA and meth, I can now tell (only minutes into my come up) for sure that this drug is indeed 4-MAR.",
  "After picking up the friend, we got back on the road for a 25 minute drive to my place. I was definitely feeling the effects as I was driving, but as I am a good (and experienced) driver on stimulants this didn't pose a problem. I was feeling nicely fucked up, even though only maybe 20 or so minutes had passed.",
  "Apparently, 4-MAR has been dubbed 'euphoria', supposedly because of notable euphoric effects. Now, while I did find 4-MAR to be fairly euphoric, it did not compare to MDMA in euphoria. I would say it is somewhere in between meth and MDMA in euphoric effects, but much closer to the former. Also, I would say that 4-MAR feels especially like ORAL meth in euphoric effects (and this I found to be true even later when snorting 4-MAR). Still, the quality of 4-MAR's euphoria was qualitatively different from either of the aforementioned drugs. It did not have the same 'pushiness' to it.",
  "The body high/buzz on this drug was very pleasant. In that respect, I would say that again, 4-MAR falls somewhere in between meth and MDMA, though this time it is slightly closer to MDMA. I was having a warm, pleasurable buzzing sensation throughout my limbs and skin. Like MDMA and meth, this drug dramatically increases the sensitivity of the skin. However, UNLIKE the amphetamines there were no rushes, no tingling, and I was warm (not cold and shivering as I am on the amphetamines).",
  "As with meth, I found 4-MAR to have a significant sexual quality. A warm feeling (though not quite as wet as with meth) permeated throughout my pelvic region, and throughout the night I was aware of my desire. I would say that the intensity of the 4-MAR sexual aspect is about equal to that of meth.",
  "I was more observant of music , though only slightly. More than I notice it on meth, but not as much as on MDMA. No visual effects.",
  "We arrived at my house and I ran around (similar to how I do on the amphetamines) setting stuff up and organizing. My productivity was increased, not surprisingly. The others smoked their ice (and they continued to do so over the course of the next several hours) and I decided to snort a bit of the 4-MAR to see how it changed the nature of the drug. An hour had passed since I first began feeling the effects of the 4-MAR.",
  "I snorted approx. 30 mg which burned a fair deal, though quite possibly in part due to my lazy chopping. The burn was very similar to, but not QUITE as intense as when snorting meth. The rush was comparable to snorting meth. Again, I smelled the distinct, strong odour of this drug, which now that it was in my nasal passages, smelt oddly fishy (i.e. like an amine). In fact, I commented that it smelled (and the drip tasted) almost exactly like methylamine. This feature of the drug again confirmed my conclusion that I indeed had 4-MAR.",
  "Although I was feeling pleasantly high before snorting, the snorting adds a nice intensity to the high. It adds a bit more of an edge, more of a stimulant (as opposed to roll-like) quality. From this point onward I start feeling quite nice indeed. My pupils were quite dilated, not as much as on MDMA, but a bit more so than on meth (although in the past 6 months I have found that meth no longer dilates my pupils nearly as much as it once did).",
  "As I sat chatting with my friends, I noticed more distinct qualities of this drug. For one, 4-MAR does not noticeably speed up time. I would wager that it has no effect on the perception of time whatsoever. Also, the feeling (partly due to time speed up, perhaps?) of speaking quickly and generally feeling speedy, is completely absent. I did not get the restless/agitated feeling that I typically get on other stimulants.",
  "Another unique facet of 4-MAR -- it is not truly empathogenic like meth (oral meth in particular) and MDMA. This really suprised me, as I am outgoing and talkative by nature, and stimulants always make me more so. 4-MAR seemed to have an almost introspective quality (though in a positive sense). I was more into listening to others than in talking myself, though I did still talk a fair deal (in this way, it resembled MDMA more than meth). Although the amphetamines do have this quality, it was still clear to me that 4-MAR does NOT increase talkativeness/socialness, unlike the amphetamines.",
  "Around 4 am (4 hours into the trip) I took some antioxidants (900 mg ALA) and some magnesium (1000 mg), as I had begun to notice mild jaw clenching (milder than with any of the amphetamines). I was still going strong and feeling good.",
  "I started coming down around 5 am, though it was an extremely smooth, gradual comedown. The initial come up was rapid in the sense that I felt 80% high (with 100% at peak/plateau) about 30 minutes into the trip. Otherwise, I found 4-MAR to be extremely smooth, much more so than meth and MDMA. I could barely discern any 'peak' (though if pressed I would say at the three hour mark), and the plateau seemed to last a long time. The gentle, gradual nature of the trip is, IMO, one of the best features of 4-MAR.",
  "12 hours later, I felt 75% sober, and slightly tired though I doubt I could have slept. I still had a very mild body buzz, and, amazingly, no headache or 'crash' feelings. Also, my back usually aches on the comedown of amphetamines, but I noticed that this aching was very minimal on 4-MAR. The afterglow feelings were not quite as pleasant as they are with MDMA (at least for me), but not nearly as bad as with meth. My typical reaction the stimulants (cold on the come up and during the high, hot on the comedown) was oddly REVERSED with 4-MAR, despite it getting quite warm as the morning progressed. Sexual desire was still substantially present.",
  "SUMMARY: Overall, I found 4-MAR very enjoyable. I compare it to meth and MDMA in order to provide common reference points. It is, overall, very similar in effects to methamphetamine. I was expecting a bit more (more euphoria perhaps?) out of the drug.",
  "Although I thoroughly enjoyed the MDMA-like body high, I somewhat missed the 'speedy' and 'rushy' (I am referring to body tingling/rushing here) of amphetamines. I would gladly do this drug again, although I think that the empathogenic qualities would be more drawn out by doing the drug only orally. Then again, I fear that doing so would only reduce the minimal speedy effects further.",
  "The smoothness of 4-MAR is, again, absolutely stellar.",
  "I would guess that combining some 4-MAR with some meth would produce a fantastic synergy. Also, I would agree with others who have commented that 4-MAR would be an ideal study aid (IMO, superior to amph/meth).",
  "A final note -- on the comedown I was responding to emails and posts and found the words seem to flow amazingly smoothly. There seems to be a pretty dramatic increase in written abiliity. Wow!"
 ],
 "erowid": {
  "id": "15255",
  "citation": " fairnymph. \"Somewhere Between Meth and MDMA, Yet Unique: experience with 4-Methylaminorex (ID 15255)\". Erowid.org. Jun 8, 2002. erowid.org/exp/15255",
  "substance": "4-Methylaminorex",
  "views": "39041"
 }
}
