{
 "id": 16590,
 "title": "Three Glasses of Wine",
 "date": {
  "submission": "2007-04-24T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tinkal",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Lotus/Lily",
   "form": "extract",
   "specific": "Nymphaea alba"
  },
  {
   "time": "0",
   "amount": {
    "number": "1000",
    "unit": "ml"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "Wine was made with 20 gr of Nympaea alba in a litre of white wine with two big spoons of honey. The drink was kept for two weeks. Then I removed the herbage from the drink. It's color was bright red with a taste that reminded me of apples.",
  "The whole drink was 3 glasses. I finished it in about 40 minutes. The first glass went down easily and its taste was pleasant but strong. After the first glass at about 20 minutes I started getting a bit dizzy.",
  "+20 My hands started shaking a little. I feel them very light. It's difficult to control them. A change of perception was noticed and everything felt soft.",
  "+30 I am starting to relax. I already drank the second glass and I feel waves of nausea.",
  "+40 With difficulty I drank the last glass because from the taste I felt like vomiting. My movement is normal and I can control it. Nausea has passed and now I feel calm and happy.",
  "I felt lethargic and I went to sleep. From the time I slept the first auditory hallucinations appeared. They were short and from some of them I woke up. The first one that I remember was something like someone was knocking on my door and then fell down to the ground. The second was similar to whispers."
 ],
 "erowid": {
  "id": "53040",
  "citation": " Tinkal. \"Three Glasses of Wine: experience with Lotus/Lily - Nymphaea alba (ID 53040)\". Erowid.org. Apr 24, 2007. erowid.org/exp/53040",
  "substance": "Lotus/Lily - Nymphaea alba",
  "views": "17382"
 }
}
