{
 "id": 166,
 "title": "A Disappointing and Underwhelming First Time",
 "date": {
  "submission": "2013-11-11T08:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "drb",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:35",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:18",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": "3:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "4:45",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I want to keep this brief, factual and to the point even though I may have written quite a bit in some areas",
  "Here goes: I ordered some Ethylphenidate after having read a lot of apparently wonderful experiences users have had on it; naturally, I was very intrigued.",
  "- the Ethylphenidate was bought from a loyal online seller whom I have consistently been satisfied with in past purchases.",
  "- the substance: looks exactly like and has an identical texture to standard fine table salt or caster sugar; no noticeable smell from the powder",
  "T 0:00 - 50mg line insuffilated. Firstly, it did not burn anywhere near the extent to which has been described by other users(!). Specifically, I had read quotes of eyes watering, absolutely horrific burning sensations etc. Luckily, I didnt experience this. I had noted that in the majority of reports describing Ethylphenidate  ingestion, quantities snorted have orbited mostly around the 20 - 30mg range. I am not carelessly pushy with drugs nor a high-chaser, but I thought 50mg would be more realistic for me if I was keen to have a glowing experience.",
  "T+ 0:15 - Nothing really noticeable",
  "T+ 0:20  No sign of euphoria or anything like it",
  "T+ 0:30  Somewhat elevated heart. No mood change noticeable",
  "T+ 0:35  50mg insuffilated. No burning; drip was totally minor",
  "T + 45  my least favourite effect of any stimulant: the rapid and almost aggressive heartbeat is apparent.",
  "T+ 1:00  I am genuinely sad to have to write this, but even by now I had not noticed any mood lift or euphoria. The effects which did however occur were: slightly on edge, somewhat paranoid, hands shaking slightly (I was with people who didnt know Id taken it so the not being able to pour a glass of wine correctly just fuelled the paranoia that I was acting strangely.",
  "T+ 1:18  Snorted another 50mg line. Pupils were not overly dilated. However I was certain my face as a whole did look quite odd, similar to someone who hasnt slept for days and who looks slightly manic  this annoyed me I must admit.",
  "T+ 2:00  Snorted a 50mg line. I now understood more how this chemical is described as being notoriously caustic and bizarre: some of the powder (now dissolved in a thin runny mucus) that had been insufflated earlier  was dripping out of my nose. I wiped it gently but soon after I noticed that this liquid had actually crystallised around the edge of my nostril and proved quick difficult to remove! However, absolutely no sign of blood was seen during the whole experience",
  "T+ 2:15 Were out shopping and by now I am definitely experience those hateful side effects similar to haven taken too much Speed (or similar). I was super observant of everyone in the store; constantly feared I was going to drop someone off the shelf; that I was somehow being a nuisance to the staff etc. And this is all, can I repeat, in the absence of any type of MDMA-like euphoria that others have described. At this stage I genuinely questioned whether it actually was Ethylphenidate because all it was doing to me was making me paranoid (though not severly), jittery, very restless and frequently trailed off in sentences because I couldnt focus long enough.",
  "T+ 3:00 My heart is beating uncomfortably, I feel uptight and stressed for no reason and just generally overly stimulated. I try not to let it take over me but it got to the stage of discomfort, I took 10mg of valium.",
  "T+ 3:25 Interestingly, the valium only helped to a very small extent if even at all, so perhaps this suggests that Ethylphenidate, subtly, is a particularly powerful stimulant and I immediately worried that if someone in the future  were to have an experience similar to mine with Ethylphenidate (whose goal was to experience euphoria or an MDMA-like experience), there could be a real risk of profound negative side effects occurring as more is taken in the nave hope of finally achieving positive effects. Research chemicals are mysterious and what I mentioned regarding the increasingly uncomfortable blood pressure of heart-rate could be an indication to throw the towel in if you feel youre not getting anywhere, contrary to continually taking more.",
  "T+ 4:30  this was interesting! A definite feeling of a comedown! I couldnt believe it for a moment because I failed to see what I was actually supposed to be coming down from!? But it definitely happened.",
  "T+ 4:45  I decided then a simple investigation: take more and see if I return to a plateau of some sort (4-MMC anyone?). I took 50mg more and within 10 minutes or so, I must admit: I felt a lot better. Not jubilant or anything similar, but I thought it was an important information to include to raise awareness that a comedown very much does occur after an hour or so but that it can be eliminated by just taking more.",
  "T + 5:30  I got to the point of genuine disappointment with the Ethylphenidate and just lost interest in it. It definitely didnt cause me severe problems, but it definitely wasnt a pleasant experience when summed up.",
  "My conclusion: I am aware this report is slightly negative and contradictory to a lot of experiences that others have written about Ethylphenidate. Hence my feeling of disappointment in the end that it just didnt work out. However, it is all about giving real experiences with substances so I felt really wanted to write what happened to me to show a different time had altogether. I would finally sum up Ethylphenidate as a weird, jittery, powerful stimulant which I can sadly see no use for in any activities in my life."
 ],
 "erowid": {
  "id": "101470",
  "citation": " drb. \"A Disappointing and Underwhelming First Time: experience with Ethylphenidate (ID 101470)\". Erowid.org. Nov 11, 2013. erowid.org/exp/101470",
  "substance": "Ethylphenidate",
  "views": "639"
 }
}
