{
 "title": "Terminating the Woodrose",
 "author": "redcap",
 "citation": " redcap. \"Terminating the Woodrose: experience with H.B. Woodrose & Risperidone (ID 16603)\". Erowid.org. Jun 27, 2005. erowid.org/exp/16603",
 "substance": "H.B. Woodrose & Risperidone",
 "bodyweight": "250 lb",
 "report": "<p>The first time I tried the seeds I ate 2 grams and had a wonderful time, although I terminated the experience with Risperdal (6 mg) because I felt I didn't have anything worthwhile to do since it was getting so late. I thought that if I took another gram I might see more intense visuals. I generally have to take more due to my large body mass. Also, I might add, that I had taken 1 to 2 grams (I don't quite remember) of Dream Herb (Calea zacatechichi), which might have made the trip more enjoyable. It has a tendency to calm and soothe me. I had not taken any dream herb on the second trip.</p><p>I had been diagnosed as Bi-polar and had been taking a regular amount of Welbutrin, Topamax, Effexor, and Risperdal for about a period of 6 months. But, I had stopped taking the Welbutrin, Topamax and Risperdal a few weeks before the trip. I had not taken any medication the day or the night before the trip.</p><p>The second time was a huge mistake. The day before I had a nervous breakdown in front of my parents, it had gotten so bad my moronic father called the cops on me, nothing happened although.</p><p>I had already removed the fuzz on the seeds and grinded up the rest of the 10 grams that I had bought from an online vendor. I put 1 gram inside of each pill and made 8 pills.</p><p>I took the three pills at 1:30PM. 40 min. later I was experiencing the trip slightly, I had expected to be completely in the trip an hour into it like I had the first time but it took two to three hours. I was feeling bored, and I was supposed to have the house to myself the entire afternoon. I didn't feel all too happy,  just down. Then my mother called and said she was coming home from work at 3. I had contemplated terminating the trip, but I didn't at that time.</p><p>I would eat quite a bit, the nausea wasn't really present. But, like the first time, I felt a lot of muscle pressure in my legs and feet, like they were sore from running. Later my mom came home, she didn't notice anything pecular about me, so I just went to my room. By now the trip was in full swing, and it was around 4. I felt bored as ever, trapped in the upstairs portion of my house. I begain thinking about what a bad idea it was to take the pills right after I had a breakdown. I went online and read a couple of reports about H.B Woodrose and decided that it would only get worse before it got better. So I took 8mg of Risperdal and layed down. I started listening to music and the trip was beginning to get better. But after 15-20 min. the Risperdal was kicking in and I was fighting it. I was beginning to feel drunk and tired, while at the same time the woodrose was still present trying to make me feel upbeat. I would yell and scream trying to just feel normal. I wanted the trip to end so badly, but it didn't. I didn't want to lay down, I didn't want to listen to music. I tried laying in my bed but it felt like the world was spinning underneath it, so I tried the floor. I felt like there was nothing for me to do. And I thought about ending my life. I thought about what a horrible substance it was, and what a mistake it was for me to take it.</p><p>I regretted taking the Risperdal. I thought about how I would feel the next day while coming down. I was starting to pound my head against things, and doing generally psychotic things like attempting to eat my fist. I would feel ok for a little while, but then my thoughts were turn sour. I felt like I had lost it. This was around 4:30-5:00 PM. Then I decided to take a bath. I leapt in and let it all sink out. The sound of the water filling the tub took my mind off things, and I had begun to relax. Things were turning around. I had felt extremely exahusted (because of the Risperdal), but I felt the trip leaving me. When the water had filled up, I quickly leaped out dried myself and went back to bed. I fell asleep shortly after.</p><p>I woke up at around 11:30 PM, because I needed to go to the bathroom. I could barely walk, I would stumble around, and I had great difficulty getting to the bathroom, which wasn't too far from my room. I even feared that I might be so tired and lazy that I might piss right there in my bed. I believe I took too much Risperdal, my normal every day dose is 2mg ,which I hadn't been taking 2 weeks prior. My mouth was extremely dry. Then I went downstairs to get something to drink. I felt like I had awakened from a coma.</p><p>The next day the Risperdal was still in my system and I slept and slept and slept only waking up to get something to drink or to use the rest room. I didn't feel normal until 6 PM the next day. I was glad it was over.</p><p>Looking back on the experience I realized to NEVER do a psychedelic drug if there is any doubt whatsoever of my mental stability. I might do it again, but with a much smaller dose. The increased dose didn't seem to do anything but make me crazy. I'm thinking 1 gram will be enough for my next trip. I'm just glad I have a large stockpile of antipsychotics to bring me out of bad trips, I wouldn't know what I would have done without my Risperdal.</p><p>This was the first time something like this has ever happened. And I had tripped on LSD, DXM and even salvia on several occasions without this problem. I thought that if something came up I could work around it, or I at least had a drug to end the trip. But ending an already bad trip can be just as harmful as staying inside the trip. I felt the Risperdal tearing down what the H.B. woodrose had carefully layed out putting me in a temporary state of psychosis. I felt like a lost sheep in a forest full of wolves. And the day after was no fun either.</p><p>The first time I had done it, I took the 6mg and just slept it off, no problem, just felt lagged the next day. I supposed the increased dosage and the absence of the dream herb might be the cause of my temporary psychosis.</p>",
 "year": "2000",
 "id": "16603",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-27T07:00:00.000Z",
 "views": "9094",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 2:30",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "Pharms - Risperidone",
   "form": "(pill / tablet)"
  }
 }
}
