{
 "id": 16604,
 "title": "Youth Reminiscence",
 "date": {
  "submission": "2008-10-17T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Satyris",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>Yesterday I have experimented for the first time with the notorious MDMA tablet. Although I consider myself an experienced psychonaut, I have done mushrooms, LSD, salvia, opium, codeine, and ketamine to name a few, for the longest time I was really against E because I witnessed its negative effects, and saw many walk the path of the E-tard. I also really dislike the culture around E - things like raves, glowsticks, hair dye, and pacifiers piss me off. However, lately I have been really curious about it, and having it easily available I decided that this was another big cheese I would inevitably have to wrestle with.",
  "Me and a good friend (let's call him Al) decided to have our trip at a park after school, before meeting up with another friend later that day to celebrate his birthday. We were at a bar in the company of two other acquainances when we dosed. We decided to eat before our trip, so we ordered some fries and onion rings with lots of water, and played a game of pool before heading to the park. It's during the pool game that I started feeling the effect of the powerful MDMA. I first felt a very stong buzzing, almost floating feeling followed by a strong wave of euphoria. As soon as the game was over I told Al 'I'm feeling it man', his state was similar and so we parted ways with our group and left the bar to smoke our first joint.",
  "Walking felt very good on E, unlike drugs like Ketamine where I would rather sit down and relax. I felt the strong euphoria I have experienced on mushrooms and LSD, but with amazing clarity and without the confusion and insanity of psychedelics. I could see now why so many people do e many times a day, every day. I was afraid that the same might happen to me, but there was nothing I could do at the time being so I just surrendered to the chemical bliss.",
  "Smoking weed on ecstacy was amazing. With every hit I took a wave of euphoria gently washed over me. I felt alert and awake, aware of everything. Conversations were incredible: I felt I had so much to say, like an overflow of information all trying to escape at once, and would oftentimes lose my train of thought because of this. Me an Al had intense discussions about music, art, friends, and worldly issues for what felt like hours. Soon we were both craving some cigarettes, so Al stayed behind while I went through the park to get some smokes.",
  "Everything in the park was gleaming with life, little kids were running around without a care. I came to the water fountain and went for a drink of water. Kids were all around playing with balloons and waterguns, and I helped some of them fill their balloons with water. I felt great after this, very innocent, almost like a kid again. I remembered what it was like to be a kid, without a care in the world, amused by simple things like water balloons.",
  "On my quest for cigarettes I also came by some Jamaican rasta-looking guys. I introduced myself and started a conversation. I really enjoyed meeting interesting people spontaneously in the park like this, and taking the time to talk to complete strangers. They were very friendly and gave me cigarettes, we talked for a while about life in general, I told them I was on E and they weren't judgemental at all about it, and gave me some beer before I headed back. I know beer and E don't mix but I doubt it made a difference from a few sips of beer, and I thought it would be rude not to accept.",
  "When I returned me and Al smoked some more pot, and played a bit of cards. We talked a lot about George Bush, evolution, human intellegence, spirituality and other fascinating things. We stayed at the park for a bit longer before heading to meet our friend in occasion of his birthday. The comedown was nowhere as harsh as I was expecting, and I felt really good the following morning. However, when I came home I was overcome with feelings of depression, guilt, and sadness. I unsuccessfully tried to sleep them off, but eventually I felt fine and decided to start writing this.",
  "I feel enlightened by this trip and it was a real bonding experience with my friend. But at the same time I'm scared at the possibility that this drug will turn me into an E junkie. I have promised to myself that I will treat it with respect, however I feel like another hole in me is opening up, one that I will want to fill. I think my will power is strong and I can make it close, however I am still very tempted to repeat this experience.</p>"
 ],
 "erowid": {
  "id": "53075",
  "citation": " Satyris. \"Youth Reminiscence: experience with MDMA & Cannabis (ID 53075)\". Erowid.org. Oct 17, 2008. erowid.org/exp/53075",
  "substance": "MDMA & Cannabis",
  "views": "5588"
 }
}
