{
 "title": "Fascinating Stuff",
 "author": "Zaphod",
 "citation": " Zaphod. \"Fascinating Stuff: experience with Mushrooms - P. cubensis (ID 16606)\". Erowid.org. Jul 19, 2005. erowid.org/exp/16606",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  "2.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)"
 ],
 "report": "<p>On Saturday at 11:35 am I took my second P. cubensis trip. This was 2 g of dried mushrooms selected from my recently grown PF batch. I figured this would be a modest increase over my first ~1.2 g trip.  My stomach was empty.</p><p>A Claritin-D Claritin/pseudoephredrine-like speedy feeling set quickly at 11:50 (T+0:15), just like last time but a little earlier.  I think this contributed to the anxiety I felt -- anxiety over what the coming hours would bring!  It was identical to the feeling you have when you're agonizing on whether to ask someone out on a date.  However I felt no nausea or other ill effects.  My girlfriend wanted to go shopping; I welcomed this but I wanted the effects to set in in familar surroundings, so I procrastinated and suggested we wait. By 12:25 (T+0:50) I was starting to see some subtle liquidity in the ceiling and I felt some gentle disassociation. At 12:50 (T+1:15) I had predicted that I would be nearing the peak, but the effects had only intensified slightly by this time.  I was thinking, prematurely, that might end up being a weak trip. I agreed that we could now go to the store.</p><p>My girlfriend had donned a colorful scarf to go with her deep blue dress. Needless to say, this array of colors with bright sunlight was quite captivating.  I saw nothing unusual about this in itself -- it's just that I was attracted to the colors.  It's hard to say whether this was the mushrooms talking.</p><p>We got to the grocery store around 1:10 pm (T+1:35). I was somewhat disassociated and the Claritin-like feeling was still there, so the shopping experience was a little uncomfortable and I was glad to leave. The somewhat annoying store Muzak and busy shoppers constantly squeezing past or following on our heels didn't help things.  I felt slightly like I was in a machine.  As we checked out I noticed how everything in the store was trying to lure me to buy items -- the music, the big displays, and the bright colors that we normally tend to ignore while shopping (or so we think).</p><p>The store was lacking a few items my girlfriend needed, so we went to Albertson's and got there around 1:45 (T+2:10). I still felt somewhat anxious and was enjoying the warm safety of the car, so I chose to wait for her. I closed my eyes and relaxed in the warm sunshine. At one point I glimpsed shimmer from a truck parked next to us, and I found it interesting that the retinal image remained prominent; I noticed a few other times later during the day that retinal afterimages from bright light sources were noticeable.</p><p>We left to go home at 2:05 (T+2:30). By this time I expected the Claritin-like feelings to subside, but they hadn't, so I remained slightly anxious. As we drove home I was intrigued by the shapes of the trees lining the street -- they seemed like they had all struck magnificent poses, and they were holding the poses as we drove by.  This was about the first definite sign that the trip was gently taking hold.  Wow -- 2 1/2 hours to reach this point.</p><p>We arrived home at 2:15 (T+2:40) and I started watching a little television. A song on television was playing and it sounded very three-dimensional, as if there were TV sets on in the other rooms with the same channel. I had to ask my girlfriend if the other TVs were on. They weren't. The disassociation had edged into a very slight dreamlike state which persisted for the next three hours.</p><p>My girlfriend and I talked for awhile. As we did this I continued staring up at the ceiling, my trusty gauge as to what was happening. Instead of merely shifting or distorting slightly, the ceiling was broken up somewhat into smaller-scale distortions (about 10 to 12 inches wide). I then noticed that many of the bumps on the ceiling were tinged somewhat chromatic (in red and blue), as if viewed through a diffraction grating. I looked at the skin on my arms, and could see it distorting slightly, almost flowing slowly like lava.  I looked in the kitchen at the water faucet.  It looked slightly creepy there by itself, and I was nervous that I'd see it bend or move around.  I satisfied myself that it wasn't moving or doing anything weird.</p><p>At 2:40 (T+3:05) my girlfriend went to her room to download a game driver. I continued to spend about five or ten minutes looking at the ceiling. I then looked at wood grain on the cabinets. On the first trip I had not seen any distortion; now the wood grain was flowing slightly. I looked at the wall and was intrigued by a small bump above the doorway. It seemed to have personality -- it was his job to just sit there on the wall and I empathized with it. By this time the Claritin-D-like feeling had subsided (yay!) and I now approached the magical third hour of the trip.  I felt like the slight anxiety had vanished and left me in a magical state of mind. As with the first trip, this vanishing of the anxiety seemed to be the indicator that Part Two of the trip was beginning and that the effects were plateauing.  It seemed that I was hearing various faint bell and chime noises, almost like an auditory sparkling; this didn't seem to come from my ears but from my brain (similar to the sensation of playing a song back in your head). It added to the entrancing appearance of the world around me.</p><p>At 2:50 (T+3:15) I went to see what my girlfriend was doing. She was conversing with her father on AOL Instant Messenger. I found it somewhat difficult to focus on the content of the messages; rather I was amazed at how the screen names seemed to radiate the personality of their owners. She then pulled up a plasma-type astronomy picture. This image looked three-dimensional, as if it was just beyond the screen. I was amazed; even after looking more closely the image was still three-dimensional.  A small white mother-of-pearl type jewelry box on the desk caught my attention. Its surface seemed to be flowing gently. I kissed my girlfriend's forehead and walked away. I had a fleeting impression that her hair was still in my mouth and it tasted sweet (the beginning of me associating a sweet-tasting aura with her for the rest of the afternoon).</p><p>My dog was sleeping on the kitchen floor. She looked quite content, and I gave her a good rub. Her fur felt good, and I knew she enjoyed the rub. When I returned to my girlfriend's room, she was playing the video game Bugdom. It was fun to watch, but the music was orchestrated to fade out slowly, then start again at full force, over and over every minute. I found this pattern very amusing.</p><p>She then took time to make some white chocolate pudding. I had a lot of fun watching her. I was still tasting her aura when I was near her, but since I had been snacking every now and then on Necco wafers during the past hour I wasn't sure if the taste was imagined or was amplified residual taste still in my mouth. She ate the pudding, which I had a lot of fun watching. The quiet interludes and her various activities during the afternoon made me feel like she was on a programmed schedule and that I was in a scripted play. I reflected on her preparation, eating, and cleanup with a lot of objectivity, as if it was a ritual, and found it amusing. I looked down at my dog, and found her relationship with us curious -- a lovable little mutt that wandered around the house day after day with little maintenance. Needless to say I was abstracting anything that I saw. Everything around me seemed to be painted in magical brush, and it occurred to me this is how the world looked when I was four years old. I distinctly remember those early years, and the richness and surprise of new colors and sounds was almost exactly identical. Psilocybin wasn't creating mysterious imageries or hallucinations for me, but rather it seemed to be assigning equal importance to all visual and auditory senses without interference from my mind, weathered and sanded down by three decades of life experiences, and distorting the inputs a little (from synesthesia perhaps?)</p><p>The high point of the afternoon was around 4:00 (T+4:25) when my girlfriend asked me to replace the pump on her bubble lamp. Once I found the parts I needed, I sat down to begin repairs, and as I began thinking through the problem I noticed that I was independently analyzing this thinking process. Needless to say I found it very distracting and she had to step in to help. Just when I had gathered myself and resumed working on the lamp, I found that the tube I was going to insert the hose in was actually a plastic flange. I wasn't of much further help.</p><p>Around 4:45 (T+5:10) I then went to try to do some normal stuff; namely sort through my three junk mail letters. It took about three minutes to do this, as I was caught up with amused self-introspection while trying to decide what to do with each item. I found that FedEx had sent me some magnets; I had a lot of fun punching them out of the mold and putting them on the refrigerator, and at the same moment I was wondering what I would have done with these magnets if I was my usual self. Would I have thrown them out or played with them as I was doing now?</p><p>It was 5:30 (T+5:55). My girlfriend had to lie down and rest, and I felt the dissociative state rapidly wearing off. I tried resuming some needed business E-mail work but found it difficult to do so with good accuracy.  Some important numbers I needed to type in were difficult for me to copy, and I couldn't process more than three or four digits at a time without becoming distracted. I went to the back yard and enjoyed the fading afternoon, then watched television.</p><p>By 6:00 (T+6:25) The disassociativeness had completely faded and I was totally myself again.</p><p>Some very subtle visual residuals persisted the rest of the evening; even by 9:45 (T+10:10) I could still see some weak liquidity in the ceiling and sporadic variations in ordered patterns (such as the lines of text on my computer screen).</p><p>My conclusions based on this limited experience?</p><p>-- The main effect of psilocybin seems to be that it removes the 'blocks' that you usually have on often-ignored visuals and sounds. I felt like I was viewing the world exactly as I did when I was 4 years old. Colors had the same richness (almost a taste), and any sensation can become important and captivating. Who couldn't enjoy this? I think the secondary effect is what takes place at higher dosages: the 'blocks' in your thought processes are removed and you get to 'set watches' (to use a programming term) on all your thought processes and scrutinize these threads. It's quite enjoyable. Imagine drinking a glass of water and noticing 4 different thought patterns emerge, each one critiquing or pointing out observations as you take the glass and drink. Fascinating stuff.</p><p>-- Psilocybin had absolutely no addictive properties.  Although there were 8 g of dried mushrooms in the freezer, I couldn't fit in a quality shroom-worthy 'play day'.  After about six months I was in doubt about the potency of the shrooms and had to chuck them (sacrilege!)</p><p>-- I saw zero hallucinations (hallucinations are things that are believed to be real but aren't there). Everything I saw was more or less a magnification of a particular quality of something I was seeing, feeling, or hearing. Anything unusual I knew quite well was just a distortion, and looking again usually changed it or got rid of it.</p><p>-- Psilocybin did not affect my mental alertness at all; there was no 'drunk' or incapacitated feeling as with alcohol. I could have functioned normally for any necessary tasks, though psilocybin produces distracting, captivating thought processes and requires a significant amount of focus to do anything intensive (especially involving numbers and left-brain work).</p><p>-- There was no negative or 'bad trip' feeling except for some slight tension and anxiety as the Claritin-D-like effects occurred. This always went away by the third hour as the peak of the trip approached, giving way to exceptionally positive feelings.</p><p>-- Trip toys or interesting settings are a great idea. The hands, the eyes, and the ears (and presumably the tongue and nose) always appreciate attention when the sacred mushroom is used.  If you're on a low dose, an arts & crafts shop is like a toy store!</p><p>-- U.S. law prevents me from using harmless psilocybin, yet allows folks to legally intoxicate themselves into a blathering stupor with an addictive, poisonous substance: alcohol. What's up with that? All it takes is one psilocybin experience to appreciate the disturbing double standard here.  I really have to tip my hat to the Dutch for their rational approach to these issues.</p>",
 "year": "1999",
 "id": "16606",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-19T07:00:00.000Z",
 "views": "3768",
 "dose": {}
}
