{
 "id": 1661,
 "title": "Zoomers on 4/20",
 "date": {
  "submission": "2012-04-20T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "blaze420",
  "gender": "Male",
  "weight": 53
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.7 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "It was 420 (april 20th) and i had no chronic, but i did have a little under two grams of mushrooms...",
  "At about 9:00pm, I chewed my shrooms and after about 15-20mins I started to feel really gitty and I laughed at just about everything. My brother and his friend asked me if I wanted to go to the store with them, so I went (this was about 9:30, still feeling gitty but not tripping too much). When we got home (9:45), I started to feel pretty high and my sight looked kinda blurry like I was drunk. I sat down on the couch to eat some munchies we bought. I went upstairs to lay down at 11:00 and this is when I started to see some crazy shit.",
  "I walked over to my bed and sat down on the side of my bed, I started see a tattoo-like design on my bookshelf and I was like 'whoa man, thats crazy!' so I layed down to see if i could see anymore halucinations...and I did. I started thinking about if I fell asleep, would I have a nightmare? or would I have a tripped out dream? then all of a sudden it felt like I was in a nightmare and I don't know if I actually saw this visual or just imagined it happening but I saw the grim reaper walk through my door, so I closed my eyes and I went into a state of euphoria. I had some mad closed-eye visuals, and the sounds of cars passing by drifted off for what seemed to be about 5 minutes each time. I would also see weird visuals of cars  passing by (it was actually the lights of cars passing by). Finally I snapped out of my daze and it felt like my bed was a huge field and my knees looked like hills.",
  "I don't remember too much else until my brother and his friend came upstairs too go to sleep (about 12:00 . They in my room to talk to me, all I could say to them is 'I'm so high right now man...'. When they left, I tried to get to sleep but i couldnt. My mind was racing with all these thoughts like 'why did i do this?' or 'Mary Jane(pot) would never do this to me' and I started to feel really depressed, most likely because i was coming down from a really hard trip. I believe I finally fell asleep at about 1:30 or 2:00am.",
  "I think the reason why I had such a hard trip was either because i'm sensitive too psylocibin and psylocin or they were reaaly good mushrooms."
 ],
 "erowid": {
  "id": "15259",
  "citation": " blaze420. \"Zoomers on 4/20: experience with Mushrooms (ID 15259)\". Erowid.org. Apr 20, 2012. erowid.org/exp/15259",
  "substance": "Mushrooms",
  "views": "1434"
 }
}
