{
 "id": 16619,
 "title": "A Drug that Ended All Drug Experimentation",
 "date": {
  "submission": "2007-06-19T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Robo",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I am telling this to you guys as a person who visits this site a lot and has done to much experimenting with a lot of different drugs to try to alter reality. Let me tell you doing Diphenhydramine ended all of this for me and I know have another outlook on life. This is a very powerful drug and is not to be messed with. Well now to my last experience with this drug.",
  "It was a Saturday night and I just got home after having a few drinks with some friends and getting into some deep conversation with them. I was a little drunk at the time and we got into a topic that kind of it me in a way and in this way I really just wanted to get out of my life. I ended up taking 28 pink allergy pills and lay down and watched some tv. At the time, it was about 1:30 in the morning and I couldn't stay awake and ended up going to sleep. The rest after this was basically complete hell for me.",
  "I woke up at about 3 in the morning and honestly had no idea what just happened to me, why I am feeling the way I am and whats actually going on. One effect I get with a high dosage of this drug is extreme dry mouth, very dry mouth. I decided to get up and try to find some water, but since I was tripping on this drug right when I stood up, I fell right back on the ground because it felt like I weighed about 500 pounds. I have no idea why I did this but I got back up and ended up putting hair gel all over my face. I woke up the next morning with a lot of dried out white gel all over me.",
  "After this barely got myself back up and grabbed what I thought was a bottle of water and was actually hair gel and accidently ended up drinking that. Took me a while before I knew what it was. After which I go back into my bed, go onto my laptop and at this point I dont remember what happened. Im not sure what I was typing and when I saw it in the morning it made no sense at all, just a whole bunch of random words. I cant tell you what was going on in my head at the time, but it must have been some really weird things. The rest of the night was just hell for me, a lot of physical pain and discomfort. A horrible sore throat from the dry mouth and countless other horrors that were going though my head at the time. I also remember I was trying to puke it up, but I really couldnt because my body and mind just seemed to fucked up to do anything. I was going though this till about 7 in the morning, where I fell asleep, woke up at 10 and was still feeling the effects horribly.",
  "I would really like to tell you what was going though my mind during the trip, but I really can't remember much at all. People also say that users have a lot of hallucinations during this trip and I probably did, which was why I did a few really weird things, I just cant remember. I have done it many times with around 400-500mg, just 700mg was way to out of hand.",
  "I am the type of person who usually does a lot of research before getting myself into anything, but this drug's effects were something I couldnt even deal with."
 ],
 "erowid": {
  "id": "53132",
  "citation": " Robo. \"A Drug that Ended All Drug Experimentation: experience with Diphenhydramine (ID 53132)\". Erowid.org. Jun 19, 2007. erowid.org/exp/53132",
  "substance": "Diphenhydramine",
  "views": "5572"
 }
}
