{
 "title": "Waves of Energy",
 "author": "C21H23NO5",
 "citation": " C21H23NO5. \"Waves of Energy: experience with MDA (ID 16619)\". Erowid.org. Aug 8, 2002. erowid.org/exp/16619",
 "substance": "MDA",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "75 mg",
   "IV",
   "MDA"
  ]
 ],
 "report": "<p>Setting: My living room in my apartment, low lighting, music of choice constantly playing, kind being smoked, etc, a very chill place for me.</p><p>This was going to be my first time injecting MDA, or any MDxx chemical for that matter, and I approached the subject with great care and consideration. The day started off with me feeling good and anticipating the night's activities. A few close friends were coming over and we were going to have a party of sorts. I visited my friend X and purchased 1,500mgs of pure MDA. I know the couple of people coming over didn't have any ecstasy and wanted some, so I graciously provided them with the chance to get in on this new hookup to extremely pure, crystallized MDA. I bought this much, because I, as do my friends, have quite a large tolerance built up, I usually eat anywhere from 150-250mgs of pure MDxx powder per session.</p><p>My friends arrived and we had a drink or two, and relaxed and talked and played around and had fun. It was about 10pm now, and we all wanted to drop our ecstasy, the plan was to either chill all night at my place, or go to a club around 1 or so. They stayed sober during my experience and dropped as I was coming out of it.</p><p>(the T+ (x) minutes is a complete estimation, as I have no idea exactly what time what happened)</p><p>T+0mins: I injected about half of a 75mg (weighed by digital mg scale) pile into my right inner elbow vein, I felt a small tingle throughout my body almost immediately.</p><p>T+.5mins: I injected the other half into my left inner elbow vein and almost before I could pull the needle out my hands started shaking from the surge that I felt.</p><p>T+3mins: I was definitely surging and coming up harder than I've ever come up before. I've quadruple dropped 4 excellent pills before too and this was completely different feeling. Much more intense, I was feeling extremely light headed and needless to say, extremely happy. My friend commented later that my eye were the most dilated that he's ever seen on anybody.</p><p>T+4mins: extreme nystagmus sets in, I always get pretty heavy nystagmus on heavy doses of MDxx, but this was ridiculous. I'll try to explain it best as I can. You know the effect of spinning a bicycle tire really fast, that it begins to look like it's going the other way, well, my eyes were shaking back and forth so hard, and everything was blurring, I began to see the image of the room bounce slowly back and forth across my vision, like I was slowly moving my head back and forth (I was told later, that I wasn't, it must of been some sort of wierd hallucinogenic effect, maybe my eyes didn't have time to focus in between the nystagmus and could just catch the picture every once in a while, I'm not sure).</p><p>T+6mins: Holy Shit. I have never felt this much in 'ecstasy' before on mdxx. I can't move, I'm peaking so hard, I can't feel anything, which is kind of disturbing, I'm almost completely numb.</p><p>T+10mins: My jaw starts chattering, which has never happened to me on mdxx.</p><p>T+15mins: I can sense some sort of plateau in the peak, which is wierd for mdxx, but i think I reached some sort of short term saturation point, i.e. maybe activated every single possible receptor and just had the mdma metabolites flooded around them waiting, heh, I dunno.</p><p>T+20mins: Lying on my bed, drenched in sweat, moaning, hallucinating, extreme patterning on closed eye, intense green/yellow (my classic visual colors  ) geometric patterning, very LSD-like actually. I have no concept of whether I'm alive or dead, or what. I can feel intense waves of energy course through my body, which literally shake my entire frame, sort of like convulsing. I was also experiencing some rather unpleasant muscle spasm, where every muscle in my body would tense for a few second then untense.</p><p>T+30mins: I can feel some of the effects wearing off, although I can sense no less of an intense rush. Extreme body heat, I feel like my core temperature is raised extremely high. Hindsight, I wish I had taken my temp, just outta curiousity, I'm sure it was sky high. The feeling has definitely waned some, but that isn't saying much, because I'm still rushing harder than I ever have from MDxx. I still have extreme nystagmus, muscle spasms, etc.</p><p>T+60mins: I can definitely feel the effects wearing off, still very euphoric, etc.</p><p>T+90mins: I'm coming down very hard. This is the hardest comedown I have ever experienced, it has immobilized me.</p><p>T+120mins: A dull ache pounds from my head. This isn't a headache or anything, it's like I'm missing part of my brain, it feels soft . I've experienced this feeling before on high doses, but this is ridiculous, I feel like I'm dying, no joke.</p><p>T+180mins: I tell my friends I can't go out, they drop their MDA, 100mgs each, start to roll, talk a little bit to me, and I tell them to go out to the club and have fun, while I pass out. I dose 40mgs of Valium and then, literally, pass out. A good experience.</p><p>That said, I don't think I will ingest MDxx for a good long while. I am extremely experienced with the MDxx class of drugs, and knew basically what I was doing. I hope you will practice a little more caution than I did.</p><p>This was a very introspective roll, I reached extremely deep inside myself and carved out corners I never knew existed. A positive experience overall, just with some very nasty negatives, i.e. extremely intense comedown, no motavation to even get out of bed for 48 hours, etc. I would not repeat this, or encourage anyone to do this. Hope you enjoy!</p>",
 "year": "2002",
 "id": "16619",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-08T07:00:00.000Z",
 "views": "37652"
}
