{
 "id": 16656,
 "title": "I Met My Spirit Guide",
 "date": {
  "submission": "2007-06-18T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "SJ",
  "gender": "Female",
  "weight": "143 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "10 mg",
   "substance": "oral"
  },
  {
   "time": "Methadone",
   "amount": "",
   "administration": "",
   "substance": " "
  },
  {
   "time": "oral",
   "amount": "Alcohol - Beer/Wine",
   "administration": "(liquid)",
   "substance": ""
  },
  {
   "time": "0.25 g",
   "amount": "oral",
   "administration": "Mushrooms",
   "substance": "(fresh)"
  }
 ],
 "report": [
  "This first part is just to explain how I got the mushrooms: it was a very 'butterfly effect'-like chain of events that led us to the mushrooms, which we were not looking for.  I also felt somewhat psychic, and that I unknowingly 'called' the mushrooms without trying.  To make a long story short, my boyfriend and I  were at my sister's pool and saw a car catch on fire.  We and a lot of others from the neighborhood went over to watch and wait for the fire trucks.  A guy was standing next to us, talking about the fire and about how he was just about to go to Shell to buy beer.  I told him that's what I was about to do also. ",
  "After the fire, when I went for the beer, I could not shake a burning desire for the guy to come to the pool and hang out with us (me, my sister, and my boyfriend).  I kept looking for him at the gas station.  I didn't know why:  I am faithful, my boyfriend was there, and I was not physically attracted to the guy.  It was not because I wanted to flirt or pick him up or anything, I just felt a strong sense that I needed for him to come to the pool. ",
  "After the fire was over and I had the beer, we were at the pool and I kept wishing the guy (I never got his name or anything, at that point) would come by, confused by my strange desire.  Eventually, he did show up.  And later I found out why...I think I sensed he would provide us with the mushrooms that gave me the strangest and most amazing experience of my life!",
  "This may start off sounding like an experience report that would be rejected, about what we did while shrooming and how we got them, but I think everything I have to say is important to my story, and I will get into my amazing mind-blowing spiritual experience in a bit :)",
  "I am a 28 year old female, I love mushrooms and have done them about 8-10 times over the past 5 years or so, and my boyfriend J really wanted to try them, since he had only used acid and never had tried 'shrooms.  Something told me to ask the guy (when conversations about drugs came up) if he could get them.  Right as I was about to ask, he said to me, 'do you like mushrooms'?  I said 'that is so weird, I was just about to ask you that!'  I went on to tell him I've tried on and off for years to get them, b/c besides my prescriptions, they are the only drug I will do anymore. ",
  "(For my chronic back pain, I take percocet (oxycodone, 30mg) and Methodone (10mg), plus some muscle relaxers, but the oxys and Methodone were the only other drugs I was on.  They seemed to have no added effect to the experience (the other times I have shroomed, I was not on any painkillers), and J was not on anything else.  We both had 2-3 beers about an hour or 2 before shrooming.  I just wanted to add what other substances we had in our systems. ",
  "Well, when I said I was looking for some, the guy said he had some.  I asked if he could get us any now, and he said that he in fact had just harvested some and had an 8th he could spare and went to get them. They were not dried.",
  "Well, J and I hung around a while and then went back to our apartment since it was almost midnight, and Friday night (that night) was our only chance to do them before J had to work again...the mushrooms were not completely fresh, and our next chance would be next Wednesday, so we had to do them Friday or waste them. ",
  "Now, I kinda would have preferred to wait, I was tired and we had had a loooong day.  I also got up early and had little sleep the night before.   But J, even though he has had psychedelic drug experiences before, like acid and X, has never taken psilocybin mushrooms.  I had been telling him forever that if he did them, he would never want acid or ecstasy again...because mushrooms have all the good things that come with those two drugs without all the 'bad things' (side effects, crashing, physical harm) and it's a much more natural experience in which one can still keep a grip on reality (unless one takes too many, but I have always only taken about a quarter of an eighth, which is what we both took last night).  Our seller said to split them b/c normally an eighth would be what one person should take, and if we wanted to make the most of the trip we should definitely take them all.  I didn't want to trip hard so we decided to each take a quarter of them.",
  "We ate them at 1:17 a.m., on top of Cocoa Krispie treats, which the guy provided (which was awesome, they are perfect for balancing the taste and almost covering it up.  Mushrooms don't taste great dried, and this was the first time I ever had them wet.  They are even less tasty wet. But the krispie treats...best thing to dull the taste!)",
  "J started tripping very quickly, he has very high metabolism and it only took about 20-30 minutes at the most for them to kick in.  Me, I took a lot longer and was starting to think I may not even trip.  But, after an hour or so, I started feeling it.  We were not sure what to 'do', so we just sat in the back room where we smoke, and figured we would see what we wanted to do when we were tripping good.  J was feeling so good he didn't care what music I put on, so I put on my three favorite mushroom tripping CDs (Radiohead's 'The Bends', Coldplay's 'Parachutes', and Tori Amos's 'To Venus and Back'), in that order.  We listened to Coldplay and Tori twice in a row.",
  "We had a lot of fun, J said he has a new favorite drug ever, blah blah blah.  But I'm going to highlight the moments that made the night really special.  When I really started to feel it, J was already lying on the bed alternately looking at the ceiling, and closing his eyes enjoying whatever he saw behind them.  I decided to lie beside him. ",
  "At first, I just watched the ceiling for a while, which became purple and green (it is just me, or does everyone who trips on acid or shrooms see white things become purple and green?  I know me and J do, and so does my cousin). ",
  "Anyway.  The ceiling looked really thick (it has that 'popcorn' style plaster, so it's bumpy rather than flat) and I saw a lot of stuff up there.   When I closed my eyes, I felt like the bed was moving in waves along with the ceiling, like I was floating on a raft on a calm ocean or lake.  I left myself slip into a trance and felt the body high and music, and let them become one with the visuals behind my eyes.  While Coldplay was on, I had my first real spiritual awakening.  I still don't know exactly how to describe it or what it was, so I can't really call it an epiphany or revelation just yet.  Just an 'experience'.  While my eyes were closed, I first saw patterns that beat the hell out of the visuals on windows media player.  Then, I started reliving fragments of dreams from not only the night before (which I had forgotten until then), but dreams from many different times in the past.  I told J I was seeing 'all the dreams I've ever had'.  While that was happening, I felt a presence hovering just above me.  I couldn't see her, or really 'talk' to her, but I could feel her and we could communicate without words or even by forming words in my thoughts, or hearing her say words in my head.  I did say a few things out loud, though, because J thought I was talking to him.  I opened my eyes and looked at him, and said to ignore me unless I talk directly to him, because I may be talking to myself, or 'someone else', for a while.  He said 'okay' and went back into his own head. ",
  "The presence (who I still have not found out her name, but I am currently calling her my 'spirit guide')  was touching me from above, but I felt her 'arms' (not really like arms, but that's the best I can describe them, and there were more than two) reaching into me and touching my back, and all the parts of my body that are in pain.  I have major back problems, and my back, neck and shoulders were hurting especially bad last night after the long day we had.  She was moving my head, shoulders, and body into positions that would be more comfortable for me and relieve the pain.  She was telling me without words that I would be okay, that everything I had been worrying about with my pain, my reliance on my painkillers, and relationship problems with J and my family, were all going to be okay and that everything would work out.  I believed and trusted 'her' totally (I don't know why I say she's a woman, I couldn't see her or hear a voice, but I felt like she was female, and that she had blond hair (?)  I also felt like she had a feline quality...like she was part cat and part woman.  No, not the Catwoman). ",
  "When the song on the Coldplay CD 'Yellow' came on, I kind of asked her wordlessly if I could leave the trance for a moment to hear the song (it's one of my all time favorite songs).  I felt like she laughed and said okay.  I think I opened my eyes, but then I kept them closed and just enjoyed the song and the feeling it gave me, like I was doing before I met my spirit guide.  The beauty and wonder of the experience and the song hit me really hard all at once, and I began to cry tears of divine joy.  I heard J say my name and ask if I was okay.  I kind of just nodded and grinned while the tears were flowing, so he would know they were happy tears.  I noticed how strange and incredible the tears felt rolling down my cheeks.  I continued to cry and just enjoy the feeling of letting my emotions go.  It was amazing. ",
  "The song ended, and I stopped crying and just sat up in bed with my eyes open, and said 'wow'.  J said 'whatever just happened, it must have been wonderful!'  I told him it was, and tried to tell him about it while we had a cigarette.  He told me that he found his spirit guide (who he called his 'protector') a long time ago, in a different way.  We talked about how every person needs to find God on their own terms, and that's why neither one of us belong to a religion or believe in organized religion.  I've always felt very spiritual, but not sure what my beliefs or ideas were. ",
  "I still don't know...but that experience with my 'friend' felt like the beginning of something wonderful that I will discover more with time, and probably with the help of mushrooms.  I know that early American Indians used psychedelics like peyote and mushrooms to find their spirituality, and I guess that's what I need or want to do.  Friday night/Saturday morning I felt very at peace, and one with the Earth and the Universe.  I told J I felt like a total hippie .",
  "Well, we tripped more, I didn't feel the presence of my guide again though.  We talked and started coming down after about 3 hours since we took the mushrooms.  I'm glad we took a low dose, b/c it was just enough to have that experience and enjoy the beauty of it all.  I wish I could have been on a mountain or somewhere beautiful in nature rather than in our apartment.  When we decided to trip, I thought I would just have 'fun' like the other times I've done mushrooms, I never expected a spiritual awakening of sorts. ",
  "Anyway, something else very strange happened later.  As we were coming off the trip, J said his heart was beating really fast, and he thought he may be having a panic attack.  I tried to calm him and ask what I could do to help.  He said he needed to lie on the couch, so I took him to the living room and he laid down.  I sat beside him and felt his heart, it was racing.  I decided to try something even though I had only heard about it and had someone do it to me once, but I never learned how or tried to do it before.  I wasn't even sure what I was doing, but I just got an idea. ",
  "I felt like I needed my cat, and my one year old cat T (although she is the one that is usually not affectionate and does not like to be held) ran up between me and J and laid her front paws and head on him.  I touched her and J, and told him to put his hand on T, to feel her purr and for her to comfort him.  Cats can sense when their owners are in distress and will show support.  I held her between us with my left hand, which she would normally run away from (being held and/or restrained in a spot...she hates it), and I held my right hand over J's chest, not touching it.  I focused on absorbing energy from the universe, and from T, until I felt like I would explode. ",
  "I concentrated on using the energy to slow J's heart rate (I did not tell him I was doing this, we did not talk at all while I was doing it or before).  T meowed, and I felt it was time, so I put my right hand on J's chest and released the energy into him, focusing on slowing his heart.  He exhaled sharply and said 'wow'.  I felt his heart slow.  I asked him what he felt when I touched him.  He said he didn't know, but it was indescribable and amazing, and he felt something.  And felt his heart slow, and the panic attack subside.  I have never tried an energy focus/transfer before, and could not believe I did it without ever having tried it or without knowing what I was doing.  I just felt I needed to use T's feline energy, and also silently called on my spirit guide for help, and it worked!  T, who had been running around when we came into the living room, jumped off the couch after I did it and flopped on the floor. ",
  "I also felt very drained and had to lie down, and all the energy I had earlier just left me.  I also realized that my trip had almost completely gone.  Before J's panic attack or whatever it was, I was still tripping good, and after that it was just gone.  In my past experiences with mushrooms, I've never crashed, it just sort of wears off slowly until you go to sleep or whatever.  I wasn't upset that the trip was gone, but kind of relieved actually.  I felt like I made an incredible journey in just about 4 hours, and neither of us could believe it had only been that long since we first ate the mushrooms. ",
  "After that, we watched 'Friends' on DVD and talked a lot, about religion, our relationship, life, everything.  I felt very close to him, closer than ever.  He said he felt 'proud' for lack of a better word that I experienced what I did.  I also then told him about my strong and confusing desire for the guy from the fire to come to hang out with us at the pool, and said I must have felt that something important would come from seeing him again (we would not have had the shrooms if not for him).  That's when I finally understood my need for him to come to the pool...and wondered if he felt my need, because we never invited him to the pool.  He just...showed up!  And he wouldn't have been coming to hit on me and my sister, since he knew our boyfriends were there, and he also said he had a girlfriend with whom he lived.  I have felt like I have mild psychic powers before, but usually with silly things like songs popping into my head, and then them coming on the radio, or thinking of something right before someone says it (like the guy asking me if I liked mushrooms when I was about to ask).  But that night...wow, I felt like some sort of powerful witch!",
  "Thanks for reading this, if you got through it.  You may think I'm a freak and a hippie, and I gotta say 'I'm just me'.  I'm discovering myself, I guess.  Things I didn't know.  I have a lot more to discover, and I can't wait!"
 ],
 "erowid": {
  "id": "53281",
  "citation": " SJ. \"I Met My Spirit Guide: experience with Mushrooms (ID 53281)\". Erowid.org. Jun 18, 2007. erowid.org/exp/53281",
  "substance": "Mushrooms",
  "views": "3387"
 }
}
