{
 "id": 16668,
 "title": "Merging with Infinity, Losing Identity",
 "date": {
  "submission": "2008-01-04T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kuba",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "No words can fully explain what I've experienced, as I still have very little comprehension as to what I exactly experienced, but here is an attempt:",
  "The original plan was for us (J and I) to get acid, but it fell through. We desperately wanted some psychedelic drugs, so our plan B, the only other psychedelic drug we could obtain without any hassle was salvia.",
  "After we picked it up we went to J's room, and through a game of rock-paper-scissors, J was going to be the first to smoke it.",
  "There was a slight concern of it not working, so J decided not to use any water in his bong, rendering the thing into one massive chamber. J sat down in his chair, held the jet lighter to the bong and inhaled deeply for a long time. And then he held his breath for a long time, and finally he exhaled.",
  "I asked him how he felt, and he simply raised one finger and said 'Just wait'. The expression on his face was one of intense concentration, and he repeated 'just wait' several more times. My impression was that he was waiting for the full effects to come on, so naturally, I gave him more. I held the bong to him, and instinctively he inhaled deeply once again, even operating the choke himself. After he exhaled I asked him once again how he felt, and repeated what he said before. Then he got up and started looking out of his window, while muttering 'just wait' to himself.  Then he looked at me asked, 'What the fuck is going on?' I told him to sit down, but he didn't respond. I grabbed his hand and tried to lead him towards the chair, but he refused. Oh well, my turn.",
  "I packed the bowl, lit, and inhaled, all while standing. I remember seeing the smoke, thinking, wow I'm starting to feel a tad weird, and then everything that I ever knew including myself ceased to exist.",
  "Picture nothing. When one pictures nothing, the shade of black comes to mind. But this wasn't even black, it was nothing. No color, no shade, not anything. I didn't feel anything, I didn't even feel. I didn't even exist as a person, nothing existed. Nothing had ever existed. This is simply the way things are, and that's how they always were, and that's how they will always be.",
  "I don't know how long I was in this state for, but it didn't matter. Time didn't exist. My first memory of this state of nothingness was when I realized that something was horribly wrong. It's as if at that moment, time was created, along with the tiniest shred of myself recovered. However, only enough had been recovered to realize that something was wrong, and nothing else. Then in this state of nothing, I heard a voice reverberating from everything. 'This is pretty sweet, but I want to go back now.' At that moment, by the command of this voice (which I now know was actually me, but it seemed like someone else) everything changed. I slipped from nothing at all into a dimension of some kind. I felt great relief to be back, but then I realized that this dimension was something else entirely, the closest I can come to describing it is 'swirling color', however it was neither swirling, nor was it color.",
  "Once I realized I was elsewhere, the voice once again said 'This is pretty sweet, but I want to go back now.' And once again things changed, however a completely different dimension this time. And so the voice said again, and dimensions switched again, however it still wasn't where I wanted to be. The voice kept repeating itself, each time louder and more frustrated, and dimensions just kept changing faster and faster. It was like rapidly changing channels on a TV. Things changed so fast that it became a blur, and then, in this blur, I saw everything. Every single reality or dimension or whatever you want to call it. It was as if I was outside of it all looking at a closed book that was infinitely tall, and each page was a reality.",
  "At not one instance during this time did I have a body, I was simply a presence that stretched across infinity, yet was nothing at all. I didn't know I was a person, I didn't know anything about myself even existing. All I knew was that I had to get back to the reality I was most comfortable in. All this time I felt the most intense terror of my life, the terror of not knowing what I am, not knowing where I am, and the terror of the complete unknown.",
  "Anyhow, I realized that I could keep dipping into these realities and experiencing them, but all I wanted to do was get back. Finally, at one moment for a few seconds I managed to get back, but I lost it again. Once I was outside again, everything became a lot more sinister. There was some sort of evil presence that lurked everywhere. Not from a distinct source, it was more like a gaseous substance that occupied part of everything. I felt it, and I felt it cling to me and invade me. It followed me back on my next dip into reality and it possessed my body.",
  "I was in my body as well, but it was in complete control of everything. Including my brain, and hence, my mind. I was standing at this point, and I remember the thing looking around (through my body) and realizing it was confined to a room. I remember what it was thinking, however it wasn't thinking it words. It realized that it had to leave this place and started making its way to the door. Since it was the first time it was inside of a human body (or this universe for that matter) it had very poor control of my physical body. It was only able to walk very slowly and make uncoordinated movements. It reached for the door to open it and attempt to escape, but couldn't quite figure out how a doorknob works.",
  "At this point, J, snapped out of his trip, grabbed me, said 'What are you doing?! Lie down!' and pushed me onto his bed. At this point I left my body again, and the thing along with me. J's voice seemed like it was playing on a distant television somewhere. He didn't seem like he was a person, rather just an unfamiliar voice coming from somewhere, it didn't really matter because as far as I was concerned, he didn't even exist.",
  "Things slowly began to return to normal. I broke into an intense hot flash, and began sweating profusely. My mind was slowly returning. However, my ability to think had reverted to a woman's voice that kept repeating the same thought over and over and over again. It didn't have full control over these voices, but for some reason I knew that it was me. Things began to take form physically once again, I realized I had a body, objects in J's room began to take shape, but still no surface detail. I remember the sheer horror of this trip, and the great feeling of relief when I was finally me again was unparalleled by anything I had ever felt before.",
  "This trip had made me realize that reality (this reality) wasn't actually real. It means nothing at all. It's the haven for things that seek material pleasure and comfort. I was in true reality, and I know why I am here instead of there. I am simply not ready for the truth, its so vast and hard to comprehend, that the only way one can ever understand it is to completely lose individuality and merge with it."
 ],
 "erowid": {
  "id": "53309",
  "citation": " Kuba. \"Merging with Infinity, Losing Identity: experience with Salvia divinorum (10x extract) (ID 53309)\". Erowid.org. Jan 4, 2008. erowid.org/exp/53309",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2645"
 }
}
