{
 "id": 16665,
 "title": "A Little Bit of Ecstasy ...",
 "date": {
  "submission": "2008-02-10T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Enlightened",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "2:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "4:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "Life has always taken place in a tumult without apparent cohesion, but it only finds its grandeur and its reality in ECSTASY and in ecstatic love.",
  "~Georges Bataille",
  "Heres what a little bit of Ecstasy did for me.",
  "There are certain periods in life so uplifting, so enlightening, so amazing, the experience cant be described in words. The first time you get a tax refund, the first time you have sex, the first time you finish school, the first time you roll, and many others. This experience youre about to read was one of them. Never before had I felt so alive, so enlightened, so in rapture and awe of life and the world. Its not an experience Ill forget soon, and its one that has, without a doubt, left a significant imprint on my psyche. It was truly a therapeutic, spiritual experience in all aspects.",
  "I love Ecstasy. Simple as that. I had rolled about seven or eight times before this experience, and always saw it as a really fun time. But that one Saturday gave me a brand new perspective on it. After that session, Id begin to see the experience for the beautiful, deep, powerful spiritual journey it really is. Its buttered toast and tea for the soul. To paraphrase Jocelyn Enriquez, a little bit of ecstasy really did set me free.",
  "Anyway, some of my friends wanted to go to a club that night, so we split into two groups  one that would pick up some people and go to the club, and the other that would roll at home. We had all the essentials at home  gum, glowsticks, strobe lights, toys, candy and two pills to jump start my night.",
  "Just as I started to feel lightheaded, about an hour after I took the pills, I turned off the lights and turned up the music, I got a call from my friends saying they werent going to the club and were staying put at a group of girls house. So we pack our supplies and call a cab over there.",
  "I started to blow up in the cab, and must have read the cab driver the wrong address five times. Still, we eventually made it to their house (I wonder what the driver must have been thinking as he drove away). The house was a very conducive environment. I knew the girls, and everyone was starting to come up. I set up the supplies, mingled and eventually took my third pill (two hours since I started) and started moving about, twirling glowsticks and mauling gum. I was loving life, very pleased to be rolling again.",
  "Then at some point the third pill kicked in, at around a time someone was giving me an incredible light show. I remember blowing up, up and away into the stratosphere, completely losing reality. My senses completely took over as I went through an incredible journey of light and sound that took me off to the moon and back to the deepest corners of my mind  I couldnt tell you exactly where I was, but Im certain it wasnt Earth. I marveled at the wonderful complexity of my mind, the simple joyfulness of my emotions, and the greatness that was life, my friends, and the universe. Everything made sense. Everything was perfect.",
  "As I was watching the lightshow, one of my friends held some Vicks Vaporub to my nostrils, and I took a couple of huge whiffs while another friend played with my hair. That put me in another dimension. My eyes werent even following the lights anymore and I could only think about the profound thoughts that were racing through my head, a million miles an hour, that nevertheless made perfect sense to me. I discovered the secrets of the universe (I just cant put them into words. As any raver will tell you, you cant explain the many wonders of E. Only by doing it will you truly understand).",
  "I then leveled out, still rolling hard, but sort of back to Earth (I was still flying, though!). I thought about what just happened  the hardest I had ever blown up until then. I caught my breath, then went outside for a quick walk and to feel the fresh air, which was very refreshing. All the while, my friends were amazed at how hard I was still rolling, considering I ate less pills than them, and earlier to boot. But by the time I got back, I leveled out more, and took half a pill (four and a half hours into the session).",
  "I went back in and lied down on a mattress that was set up, relaxing and staring at the strobe light. Then a friend of mine lay down next to me, and we started cuddling. As we wrapped arms and I touched her skin, I really- started soaring. I had rolled with girls before (including the other girls there, which were also loads of fun), but I knew this girl well, which not only made us more comfortable, but made the connection I felt that much deeper. It made a huge difference.",
  "I hadnt felt that attracted to this girl before  I thought she was cute, but I was just not that interested. Now, here I was looking at her, thinking she was the most beautiful, adorable thing in the world. We ran our hands through our skin  hers was so soft and fuzzy, but even that was nothing compared to her hair. Oh, the hair  silky and smooth, and it smelled great as well. Likewise, her hands sent ripples through my own skin.",
  "Mentally, I felt an intense connection  I had never felt so emotionally in-tune with anyone before, not even my old girlfriends, and it was almost overwhelming. I showered her with kisses, which she returned and we started sweet-talking. By now, I was blowing up so hard I must have caused a rupture in the space-time continuum. We went outside to chill out, so we talked and cuddled more. By now, I had long peaked and was starting to come down, but it was still wonderful. I didnt let go of her for about 20 minutes (or at least it felt that way).",
  "I then went in to join everyone else in coming down. We sat around for a minute, then agreed to bid farewell and hopefully get to my bed and hibernate for a few days. We packed up, gave our regards, and drove away. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I didnt sleep much the next few days, as I was still processing the sheer volume and intensity of what I had just experienced. It sunk in all throughout the next day. I thought about and analyzed it. A lot.",
  "They say things dont always come out as you expect them to. This holds especially true with psychedelics, which almost never come out as planned or expected. My roll that night didnt turn out like I expected to  it exceeded all of my expecations. I expected to roll mildly (or at least not as hard, as I had rolled a few weeks before) with two, maybe three people. I ended up rolling with eight people and enjoying the experience of a lifetime.",
  "I experienced a degree of bliss, understanding and closeness with others, the world, and myself that I had never experienced before, and many probably never will. That incredible night tore down some pesky mental barriers (that needed to be torn down, at that) and truly united me with everything and everyone around me. And these words do not do it justice  no words can. Ive always maintained that Ecstasy is the one drug whose name exactly describes the effect, but in this case, even that is a colossal understatement.",
  "I wont do E for a while now, if anything to give my body a needed break and to let my mind soak that night all in. Still, this experience left a mark on my mind, for the better. Its barely half a week since that roll, and yet I can still feel the change. Never have I been so at peace with the world, knowing my experience was real, profound, and has made me a better, happier person. Is there any wonder Ecstasy was used for marital counseling, and research is being conducted into it as a treatment for Post-Traumatic Stress Disorder?",
  "It doesnt surprise me. A little bit of Ecstasy really can set one free, even for a reasonably sane and level-headed like me. Just imagine what it can do for the troubled, the bitter, the lost and the hopeless, if just for one night, they can experience pure, unadulterated bliss  a true cleansing of the spirit.",
  "And remember, as always - be safe, dont overdo it, know your mood and environment, and follow your senses. :-)"
 ],
 "erowid": {
  "id": "53302",
  "citation": " Enlightened. \"A Little Bit of Ecstasy ...: experience with MDMA (Ecstasy) (ID 53302)\". Erowid.org. Feb 10, 2008. erowid.org/exp/53302",
  "substance": "MDMA (Ecstasy)",
  "views": "21462"
 }
}
