{
 "id": 16674,
 "title": "5 grams of Enlightenment and Truth",
 "date": {
  "submission": "2008-10-30T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Vortex",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.25 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0:30",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0:45",
   "amount": "1.25 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "History:",
  "Cannabis  Regular user for 1.5 years",
  "Alcohol  Occasional user for 1.5 years",
  "Tobacco  Very occasional user for 0.5 years",
  "DXM  5 experiences: 1 @ 150mg, 3 @ 300mg, 1 @ 450mg",
  "Codeine  1 experience: 150mg",
  "Psilocybin Mushrooms  2 experience: 2 @ 1.25g (both had little effect)",
  "Background:",
  "I first became intrigued by Psilocybin Mushrooms around the beginning of grade 10. After hours of researching into Mushrooms and other Psychedelics I decided that at some point during the year I would take a trip.",
  "As a warm up I had two experiences with DXM, one at 150mg and one at 300mg. On December 23rd I took my first dose of mushrooms. It was 1.25g and it had very little effect whatsoever. I took the same dose one week later, again, few effects. Over the next few months I had more experiences with DXM until my source had more Mushrooms in. This time I made sure I would trip by purchasing 5g of more potent Mushrooms for $40CDN.",
  "Setting:",
  "The trip took place alone, in my room, as is my preference with psychedelics, including Cannabis. For the majority of the time my room was dark, candles were lit and music was on an ambient level. I had 3 mixed CDs set up with bands like: Tool, Pink Floyd, Black Sabbath, and The Beatles. Spent the majority of the time in my bed. The time I dosed at was 10:25PM.",
  "The Experience:",
  "T -11:00 - Meet with L and get 5g of dried Psilocybin Mushrooms. Smoke a 2g blunt and eat at Tim Hortons.",
  "T -3:00  Have the last food that I eat before the experience. I had Hamburgers and fries.",
  "T -2:30  Watch a movie with the family. The movie was Flight Plan starring Jodie Foster. It was slightly disappointing but not a bad film overall.",
  "T -1:00  I wait anxiously for my parents to go to sleep. I go on to forums to inform people of the night I have planned and I do some last research online to figure out the approximate time I will be able to sleep after my experience. I must have at least 8 hours of sleep before my work starting at 2:30PM. I chose 10:30PM as a good time to dose.",
  "T -0:15  I spend 15 minutes meditating. I respect this substance and I know that a bad trip is possible, at this time the planned dose is only 2.5g. I do all I can to ensure a good time and meditation puts me in the perfect mindset, calm, relaxed, tranquil and any similes thereof.",
  "T 0:00  10:25PM: the meal begins. I have split the 5g into quarters. 1.25g are in each baggy. I put the stems and caps in my mouth and chew them up. I dont mind the taste at all and actually find it nicer than normal mushrooms one would eat. I then place the powders at the bottom of the baggy in my mouth and chew it all for about 2 minutes and then suck on the pulp for 10 minutes. I swallow. I then wait and watch TV for 20 minutes.",
  "T +0:30  At this time I feel absolutely nothing and anticipate another failed attempt. I want this to be an epic experience, a turning point in my life, so I vouch to take two more 1.25g doses instead of just one more. I do the same as I did with the first 1.25g but with 2.5g at once. I swallow it at 11:11PM as I love this time for its the only time you see 4 of the same number on a clock. A knock on the door, its my mom. This makes me very nervous as she just caught me a week earlier smoking Cannabis in this same fashion. I hide all my stuff under my bed and let her in. She says good night and leaves. I was relieved nothing happened yet this set my heart in motion. I feared this would bloom into a bad trip later on. I relax myself, slowly.",
  "T +0:45  Nausea begins to kick in. I am happy for this means I must be coming up. I welcome the nausea and I relax. As it begins to subside I notice the first effects. The blinds on my windows have turned a blue-green tinge rather than their normal white. Also the frames around them are curving and waving, this will be of huge importance later. I realize I only have 1.25g left. What a waste to keep this. I down it and realize I have just done 5g. Twice as much as I intended for. A, Heros Dose, according to Bill Hicks. I brace my ego for a beating. I know that I will never forget this night.",
  "T +1:00  My last dose is beginning to set in, lights are vibrant, music feels exotic and extremely meaningful, and colours are becoming distinct, yet only a few are easily recognized: red, yellow, green and a very bright and light shade of blue. Everything is becoming curved and even my body feels slightly skewed.",
  "T +1:30  The lights go out. The trip takes a turn for the good and I feel far more at peace than I did an hour earlier. I hear voices in my head. They scare me to an extent but are comforting. They have a divine feel to them. They sound wise and at ease. They gave me advice and comforted me. I now think of this as simply my subconscious coming to the surface. Everything passed to me from these divine spirits I already knew. This makes me feel rather divine and omniscient.",
  "T +2:00  This is around the time that my second dose peaked. I felt as flat as a piece of paper. My hands felt elongated and it was as if everything I touched had the same texture and temperature yet a different feel. I knew cloth from glass, yet it felt the same. I had trouble holding onto objects because of space being so extremely skewed. Gravity was a distant memory. When I got up to go to the washroom I felt as if a wind was pulling me to the side. I was now curved along with everything around me. When I reached the bathroom I looked in the mirror. My eyes were dilated but not that much. My face began to morph. It went upside down, back to normal, and then flowed like water. I returned to my bed to watch some TV.",
  "T +2:45  For some reason I was watching CNN and I remember the TV screen was very messed. It was as if there were maybe 20 pixels and they all blended into each other. The anchor woman looked so small and disproportioned. I felt extremely fucked. How long will this last? I asked myself. The time was about 1:30AM. I turned off the TV and threw on some more tunes.",
  "T +3:15  Everything was still flat. I felt so weak. I was exhausted, yet I was still peaking. I just lied down, my mind filled with racing thoughts. I wanted to just think about life and how I could improve my own, that is of course, the reasoning behind this experience. I just couldnt get the thought of, I am messed beyond reason, out of my head. There was plenty of time for self thought in the near future so I just cruised, listening to Third Eye. What a great song. It put me into another world full of art and Aztecan rituals. I was just another entity floating through space. My life has no reason. The universe is infinite yet always expanding. How does my small life hold any significance in such a large space? What am I doing? Why do I worry about grades and responsibility when my life really means nothing? Am I just following instinct? No, we are continuously suppressing our instincts with notions of law and science. This was a thought process I had and wrote down. It felt very important, but to a sober mind it sounds cold and ridiculous.",
  "T +3:50  At this time my head was killing me. I thought I gave myself a concussion. I was just lying in bed with no real sense of space or time, flying through an infinite universe of nothing. I felt small and powerless. Yet, I felt divine. I felt I had a new understanding of life and I was looking forward to moving on. I had experienced spiritual awakening. I had experienced ego-loss. I had experienced a part of life that few dare to experience.",
  "T + 4:30  It was nearly 3:00AM and I needed sleep. I clean up all the crap I had changed and turned off the music. I actually expected to be getting some sleep. I sat in bed, looking out the window into a new world. A world of promise, a world of life and a world so meaningless it hurt. I finally drifted into sleep around 4:30AM. I was so exhausted and felt so uncomfortable, it was all worth it.",
  "Conclusion:",
  "On that night I said goodbye to the Mushroom. I promised I would return one day. I promised I would never forget what I had learned and I would carry it with me wherever I may go. I am a changed person, there is no doubt about that. My appearance hasnt changed. My personality hasnt changed. What has changed is how I perceive the world on a personal level. My place in the world is now clearly defined for me.",
  "I have yet to schedule a next experience, its been about 1 month since this one and I am still a little shaken. My world was turned upside down and I came out a much different person than I was when I went in. One things for sure, I will return."
 ],
 "erowid": {
  "id": "53326",
  "citation": " Vortex. \"5 grams of Enlightenment and Truth: experience with Mushrooms (ID 53326)\". Erowid.org. Oct 30, 2008. erowid.org/exp/53326",
  "substance": "Mushrooms",
  "views": "8493"
 }
}
