{
 "id": 16676,
 "title": "Abuse Potential?",
 "date": {
  "submission": "2009-05-18T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Student",
  "gender": "Male",
  "weight": "205 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.2 mg",
   "administration": "oral",
   "substance": "Pharms - Clonidine"
  }
 ],
 "report": [
  "<p>Recently reports have been emerging in medical journals of opiate addicts abusing clonidine to get a opiate like high. I also found a government website that lists clonidine as a emerging drug of abuse and found reports that clonidine is being sold on the streets of new york. Also a new finding in a medical journal showed that the opiate antagonist naloxone could reverse clonidine ODs. This suggested mu opiate receptor involvement in clonidine OD symptoms. Further more medical texts list clonidine OD as presenting similar symptoms to narcotic overdoses. This evidence suggested to me that clonidine ODs would be similar to narcotic ODs. I could find no evidence in drug forums or on any drug website that people were using clonidine and thus I had no dosage guidelines to go by for experimentation. My one guideline was of a heroin addict that took 2mg of clonidine and said it gave him a nod better then heroin.",
  "I chose to slowly titrate my dose from .600ug (micrograms) to a total of 1.2mg. This had the advantage of being slightly safer then taking all my pills at once. Also considering clonidine has a long half life I would most likely not lose any of the effect by waiting.",
  "It took approximately two hours to reach my total dose(1.2ug). At 600ug I felt slightly sedated. There was no real opiate buzz present, no feelings of contentment, just sedation. At 800ug the sedation was increased but again feelings of opiate contentment were not present. Once I reached my total dose of 1.2mg  I felt very sedated and dizzy. Concentration was hard but I didnt feel all that messed up. I decided to go to sleep and I slept very nicely for a few hours. However I woke up frequently with numb limbs presumably because there was insufficient blood flow to the area. Also my mouth was very dry.",
  "After waking up again I decided to get something to eat to combat the dryness in my mouth. On the way up the stairs to the kitchen I nearly passed out. I went back down stairs and took my blood pressure. It was 90 over 60 (pulse 90). Presumably upon standing it dropped even further. This bothered me, but it was not unexpected. This stuff is made to lower blood pressure after all. At this point (4 hours into the trip) I decided to stay confined to my bed since if I tried to do anything I would pass out from insufficient blood to the brain.",
  "These blackouts were the worst I have ever experienced. My hearing became hollow and I heard a rushing sound I have never heard before. My vision went into tunnel mode and was very annoying. Just so that it is clear these effects were directly caused by low blood pressure, they were not primary effects of clonidine, although clonidine caused the low blood pressure. I decided to just sleep it off and make sure my blood pressure didnt go any lower. I drank a lot of water and I treated my dry throat with some chewing gum.",
  "The sedation that was present was similar to zopiclone sedation or even valium, but I would not rate it as being as fun. It was sedation without any mental change. Unlike valium which relaxes me this was just sedation nothing more. It is now ten and half hours since the experience and I am still fairly sedated even though I have drunk nearly a pot of coffee in an attempt to reverse some of the side effects. Currently my blood pressure is 120 over 90 and my pulse has decreased to 60. I still feel dizzy upon standing up.",
  "Overall I think this experience was not fun. I dont like not being able to stand up. I dont like sedation when there is no exhilaration. I dont like a constant dry mouth.</p>"
 ],
 "erowid": {
  "id": "53336",
  "citation": " Student. \"Abuse Potential?: experience with Clonidine (ID 53336)\". Erowid.org. May 18, 2009. erowid.org/exp/53336",
  "substance": "Clonidine",
  "views": "41769"
 }
}
