{
 "id": 16677,
 "title": "A Kick to the Head",
 "date": {
  "submission": "2006-05-25T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "madprossor",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "DOB",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "A few years ago I came across a bit of DOB I know came from a 2,5dma bromination.",
  "I dosed 3mg via liquid measure on the first occasion, fearing that a lesser dose would merely make me agitated without the redeeming trip aspect. It does indeed take 4 hours to come up, felt very little during the first two, then an increasing speedy buzz manifests.",
  "After the comeup my girlfriend (who I had given a lesser dose to) and I were riding in the back of a friends car, and I noticed, well, the most incredible deep-space ambient techno I have ever heard playing. I of course asked my friend what was the name of the CD? He said there was none. I said, then how is music this good on the radio? He says the stereo is off. I fail to believe him, and at this point my girlfriend chimes in- 'really now, what station are we listening to?' at this point it is pointed out to us that we are having a spontaneous shared persistent auditory hallucination. Yay!",
  "Now, back in the old days I danced more than a few nights away acid-tripping at raves. I sometimes would enjoy persistent beats after leaving the party, on one occasion 'synthing' 6 simultaneous tracks of noise-music chaos-seeded by birds chirping and traffic noise outside the window. However this acid-music still felt like a mental creation of my own, acid-fractalized and twisted but still a reflection of actual fairly-recent sensory input.",
  "This dob music sounded more like the doorway to the other world cracked open and the tunes were leaking through. As the realization set in I heard what I later classify as the single most full, round 'aaaauuuuuu' tone I have ever heard. At face value nothing less than a choir of 36 angels or so could make that tone that full. I suppose if I had stayed tuned it might have turned into an 'aaaauuuuuummmmmm.' then it passed and most of the rest of my trip was uneventful. Thought space was altered, flattened somehow or another, making complex tasks frustrating. I once managed to drive out of an unfamiliar city the morning after a dob trip, the hardest part was trying to use the sun as a compass when it was too high overhead... My thing has always been that I know when I'm high but still capable of recognizing and making key decisions which have resulted in 0 collisions per, uhm, several thousand acid-miles. However I tend to designate a navigator to read the street signs at around 400 micrograms. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I didn't notice many visuals, though I suppose suburbia ain't all that conducive to me melding with nature. My 110 pound girlfriend would get lost in visuals for 12 hours however with 3mg dob. Go figure, girls and artists always getting the best visuals...",
  "On the 12 hour comedown I managed to idly web-surf, with no real focus. Was able to sleep after 24 or 28 hours... Substance is not habit forming..."
 ],
 "erowid": {
  "id": "53337",
  "citation": " madprossor. \"A Kick to the Head: experience with DOB (ID 53337)\". Erowid.org. May 25, 2006. erowid.org/exp/53337",
  "substance": "DOB",
  "views": "9819"
 }
}
