{
 "id": 16682,
 "title": "What Happened?",
 "date": {
  "submission": "2008-05-10T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "WalMartEmployee",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem"
  }
 ],
 "report": [
  "Since I don't know too many people who have access to drugs I've resorted to purchasing prescription drugs through online pharmacies. Pretty pathetic, huh? What I wouldn't do for just one puff of a joint! Anyway, I recently recieved 30 generic Ambien tablets from a European pharmacy and I've dabbled around a bit with the pills, but last night was just crazy. I took 4 Ambiens within a 30 minute period and preceded to listen to some music. Within minutes I am overcome with this rush of euphoria that literally knocked me on my ass. I am very alert at first but then I begin to progress into a weird, semi-conscious state and then into a coma-like state in which I remember nothing but being around a bunch of people in the dark and walking through a black door made of velvet, WTF!!! This experience was kind of like a dream, but I assume that I was fully awake while this happened.",
  "Anyway, the next thing I remember is stumbling through my hallway which leads to my bathroom, calling out 'Who's there?' and finally arriving at the bathroom and turning on the light, all disheveled and disoriented. I relieve myself, turn off the light, and head back to my room. When I got to my room I found CD cases lying all over the floor and my alarm clock unplugged and sitting on a couch outside my room. Why I did this beats the hell outta me but if I had to guess it MIGHT have been because the alarm was going off and I was too lazy to disable it.",
  "The rest of the night I remained in a drunken-like state but fully conscious and functioning. The drug lost most of it's effects after about five hours due to it's somewhat short halflife. Eventually I just turned on the TV and crashed. Will I ever use Ambien again? Absolutely, but a much smaller dose though. I should also note that I take 30mg of Paroxetine (Paxil) daily, which may have effected my experience."
 ],
 "erowid": {
  "id": "53358",
  "citation": " WalMartEmployee. \"What Happened?: experience with Zolpidem (Ambien) (ID 53358)\". Erowid.org. May 10, 2008. erowid.org/exp/53358",
  "substance": "Zolpidem (Ambien)",
  "views": "6259"
 }
}
