{
 "id": 16681,
 "title": "3 Heads Full",
 "date": {
  "submission": "2007-09-20T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lance",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "My Girlfriend Tess lives in a town not far from mine, I visit constantly and always stay over. At this point, we've been going out for over 6 months. My friend Dan was invited over. Her house is a 10 min walk away from her university with fast food chains all over the place, as well as paths that lead to forests and open fields. Anything and everything you can think of, is in a 15-20 min walk from her house. An ideal place to trip comfortably. I had bought a bunch of LSD on blotter paper and sold some to Dan and my girlfriend. Dan, Tess and I had all tried LSD before, me twice, them once. Though my girlfriend didn't really have much of a trip her first time, she had to focus on her university lecture.",
  "Tess and I wake up to Dan calling my cell phone saying he'll be over in an hour or so. He arrives an hour later, and we all start chilling in Tess room. It's in the basement, she lives in a house with multiple house mates. I decide to try to eat as many crackers as I could before taking the tabs, because I knew I wouldn't be able to eat while tripping. So I ate like 25 crackers or so. Not very many. I then cut up the tabs, I had 20 or so all stuck together. The picture from the sheet were anime characters standing in front of a tripped out background.",
  "I gave my girlfriend 2 and a half hits, and Dan and I both took 3 each. Before this I've tried acid with only 1 hit. I wanted a trip I'd never forget. We took the hits at 1:15 pm. The three of us are all very experienced drug users, and couldn't wait to all trip together. What are the chances of something like this actually falling through? I'm glad we took advantage. The acid taste somewhat metallic, kinda gross, but not a lot. Maybe a bit salty perhaps. I held it in my mouth for 5 minutes or so, and swallowed the hits. I took a picture of Dan sticking out his tongue with 3 hits on it, I hope I get that picture back.",
  "We all decided to put on Fear and Loathing in Las Vegas on to get us in the right mindset to trip. Also, the movie is like 3 hours long, so we knew we would be feeling it by the time it was half way done or so. We smoked a small bowl in my bong while watching the movie, just to kick start the acid a little bit. Personally, it's one of my favorite movies and I enjoyed watching it as much as I always do, perhaps a little bit more that day.",
  "By 2:30 we were feeling the LSD fairly strongly, and decided to stop the movie. The room didn't seem all that dark, we left the lights on, but once we got outside we felt like we were living in a cave! It was a gorgeous day, extremely bright and the sunlight felt nice and warm beaming down on our black sweaters. We decided to hang out in the back of the house, and smoked a cigarette or two. We did this often, moving from Tess room to behind the house. We usually smoked weed indoors though.",
  "While we were in the back I began noticing detail standing out in everything. Visuals are interesting on LSD. I've learned how to control them, it's very hard to explain how, but it's almost like being skilled at zoning out. I didn't want to explore my visual powers, so I kept that at a minimum, just gazing at everything in awe because I could see contrast in light and shadows like never before, every line, wrinkle, or mishape in anything. I could see certain colors standing out better, and would notice anything that is blue. Blue was very vivid to me.",
  "One of Tess house mates needed our help with his car. He was testing out the pressure of the engine. Tess got in the drivers seat and revved the engine. After she was done I got in and did the same thing. He didn't know we were on acid. It was a lot of fun being in the car, I haven't driven in months.",
  "We went back into Tess room, and I decided to spin a joint. At first I didn't think I could do it, when I was spinning the joint I kept tripping out to how the paper felt. It's so thin, yet I could feel the texture of it more than ever. Without even thinking about what I was doing, I ended up with a perfectly rolled joint in my hand without hardly noticing what I was doing. I put the joint in my pocket for safe keeping. After that we decided to go for a walk, and just kinda went where our legs took us. On the walk Tess said she felt like she was going to throw up for a second, but it went away very quickly.",
  "We walked down a path for about 15 minutes, and came across a gorgeous field I had found earlier while skateboarding around. It was near a busy road, but far enough off so all we could hear were the birds. The grass was soft, and felt like we were walking on the moon, kinda like soft earth I guess. We sat down, and it was real nice. This is one of my favorite parts of my trip. I was spread out like a flower, absorbing all the sunlight. We spoke about anything and everything. We spoke about religion, life, drugs, fears, whatever we wanted. We were feeling the LSD very strongly, yet could communicate fine. 'Buy the ticket, Take the ride, you're going for a trip!'",
  "I would stare into the grass, and just gaze at all the leafs in the grass, and the hairs, and the detail was standing out so much it was almost moving and felt alive. I would then flip on my back, and stare into the clouds, which were giant and magnificent. I've never been able to focus so well on a cloud, watching it float around and away. So incredible, I could hardly believe my eyes. I would then focus to what was closer to my face, and notice a bunch of bugs flying above my face. As we layed there and spoke, and soaked up the sun, I could feel my body slowly closing up. We talked a lot about how religion is like a cult that got too big. As the sun went down, and the wind picked up, the flower began to close. At one point I was curled up into a ball, at this point I knew it was time to leave.",
  "Next time I do LSD I want to make myself a schedule. It's too hard to make up my mind while on acid. I'd almost wish I had someone with me that would lead the way, or tell me what to do. I thought of making a list of things to do, and when we could do them, follow a schedule. There was another forest and little stream I wanted to visit, but we didn't have time, and we were starting to get cold. Apparently we were laying in that field for over an hour, although it really didn't feel like it. Dan was hungry, so we started following him to Subway. It took him awhile to decide what he wanted. Tess and I knew our stomachs were pretty much empty, but couldn't eat. As we were walking back up the path Tess went to a bush to take a piss.",
  "Dan and I kept walking and went under a bridge. Before while passing it we spoke about how cool it looked, and we kinda wanted to climb it. Without much hesitation this time, we bolted up the side of it and sat down on the top edge underneath the bridge and looked at each other, then looked at our feet, and how high up we ran and then looked back at each other. Dan says 'Oh shit, how are we going to get down?' At this point we both blasted into uncontrollable madman laughter for about a minute. I got up and began slowly making my way back down, and then began jumping down. It was pretty sketchy. We told Tess what we found, and got her to run up. She understood how amazing it was once she was up there. The patterns up there were confusing, it felt like I was in the labyrinth. After that we began walking to Subway.",
  "When we went inside, our vibes were much different. It was uncomfortable sitting in the subway with people coming in and out constantly. Tess didn't like it at all, and I didn't really feel like baring it, so after Dan grabbed his sub we got the fuck out of there. It was VERY hot inside, and once we got outside it was hard for me to tell what temperature I was at. I couldn't tell if I was hot or cold. We began walking back to Tess house.",
  "Once we were about 2 minutes away from her house, with it fully in sight I caught a glance at a woman walking a small dog on the other side of the street. It kinda looked like one of my high school teachers. As we got closer, I realized my eyes weren't fooling me, it was Miss Carroll! She is always telling me how she is going to break my fingers, how she knows everything, how she'll give me the weekend off if I'm good in class, never truly serious, but tries to seem like it. Our relationship is weird, she yells at me, cause she likes me. I sometimes catch her smirking in class, I know it's all jokes and she loves to scare kids. She is a psych teacher, what do you expect? She loves messing with my mind.",
  "So ya, I bumped into THAT one. The one teacher that I'd actually care about running into while tripping hard on LSD. We crossed the road and met up with her. I was all smiles, and could only really say 'Oh my God, Miss Carroll! Fancy seeing you here! Wow, hahahaha, can't believe you're here! Whoaaa hahaha' and was trying not to look into her sunken eyes. She knew I was fucked, my eyes were like black holes. Dan doesn't have her in any classes, and had sun glasses on, so he just kept his distance. Tess jumped in and fully had a conversation, which I don't recall all of. Her eyes must have given it away too. My teacher knew we were on something and before she left us told me 'You never know who you're gonna run into! Buy a comb, and I'll see you in class on Monday Lance!'. As we were walking away all I could constantly repeat was 'Oh my God, that just changed my life!!!'.",
  "We got inside, and took her easy while in Tess room. By this time it was around 5:30 I think, my time perception was completely lost. We decided to smoke that joint that was in my pocket. To Tess and Dans surprise it was perfectly fine, and they were amazed by that! They thought since it was in my pocket that whole time it would have got bent, but I shrugged and lit it.",
  "When I smoke weed while tripping on LSD all it seems to do it make me retarded. I mean like, I can hardly form sentences or keep conversation after smoking. I put on a CD or three. We all layed down, Dan on the ground and Tess and I were on the bed. I remember at one point all I could really mutter was 'Music!!! mmmUUUSIC!' which frightened me a bit because I reminded myself of Dr. Gonzo, and laughed it off. We ended up listening to Supergrass, Broken Social Scene, and I think something else, can't remember right now, but similar music I'm sure. I believe it was The Music, yeah.",
  "While listening to these CDs we just zoned out completely. I layed on the bed, and closed my eyes. I had awesome closed eye visuals. My body felt amazing, almost as if I didn't have one. It was a crazy body buzz, and I was totally digging it. Another high point of the trip for me! At one point we all got up and realized we had been laying there without saying a word for over an hour. Almost two I think.",
  "At this point Tess had to call her sister, and let her know we couldn't join her at the bar. She just got into university, and wanted to celebrate. Tess went upstairs, and Dan and I began zoning out to Supergrass while trying to start conversation. It didn't last too long. This is where I had my most hardcore hallucinations. Tess walls consist of pictures taped on, a mirror, and a poster or two. Suddenly the pictures started to slowly flap up and down, and I told Dan that I was beginning to hallucinate pretty hard. I told him the pictures were moving, and then suddenly they began moving much quicker. I told him everything was coming to life, and he seemed to think I was going crazy. Suddenly Tess wall slipped off into blackness before my very eyes, it was like watching paint fall off a canvas and into blackness. With my eyes open all I could see what pure darkness. I quickly closed my eyes and rubbed them, and everything was back to normal. While the wall dropped I screamed and was very shooken up from the experience. It kinda caught me off guard.",
  "I was a little shaky after that for awhile, I couldn't keep my hands straight, very annoying. It was hard for me to calm down after seeing that happen. Tess then came back, and I thought Dan thought I was going crazy or something after that happened, so vibes got a little weird at this point, but not for too long. Tess told us some pretty intense news, apparently her sister got in a horrible car crash! The car was totaled, but she was fine thank God! Her boyfriend was also fine, they went to the hospital as a precaution, but they were only a little bit sore. Tess then had to call home and speak to her mother, but she said it wasn't too bad.",
  "After that I began asking Dan about his visuals, and if he was hallucinating as much as me. He didn't really seem to understand. Apparently my friend Dan has never really had a visual, they don't seem to effect him. He has the idea of what the beginning of a visual is like, but that's about it. I tried to teach him how to see things move and stuff, but he couldn't get it. It really weirded me out, because my visuals change my trip a lot and the way I think.",
  "After that it was starting to get late, and Dan had to drive home that night. He couldn't leave much later than midnight. He kept going outside and smoking ciggys. Tess and I would stay inside and go outside to keep Dan company, but it was getting cold to stay out long. Something very strange happened to me the first time Dan left Tess and I alone. Tess and I were looking at each others eyes for a minute or two, when suddenly I felt like I was going to puke. I told her 'Oh shit, I feel like I'm going to puke!' and within those 5 seconds that I felt that way I was holding my mouth shut and ran to the closest garbage and puked up my crackers and water. It wasn't too bad, but pretty gross.",
  "It was finally time, Dan left and we all said Goodbye. What a great experience to share with each other. Being on the same levels as each other, and knowing it. I remember when we were at the field I would say 'LSD makes the world feel big again, and that's exactly what I want. I hate how media and technology makes the world feel small. It isn't. We are the ones who are small, and I feel FUCKING GREAT knowing that I'm a piece of shit in this world. I'm nothing, I'm meaningless. I just a piece of shit, and I know it. And I feel great about it.' I'd probably say that this trip was one of the most religious trips I've ever had. I enjoyed it VERY MUCH.  I tell Dan to call me when he gets home, so we know he made it fine.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "Tess and I begin watching a bunch of trippy movies I have, short films, Music videos, and radiohead dvds. An hour passes by and we realize Dan never called! My heart almost stopped, I ran to my phone and called his cell. IT WAS OFF. I almost fainted. I was like 'This cant be fucking happening.' the shaky hands started to come back. I then realized I turned my ringer off, so I checked my missed calls. But it didnt show that Dan called. I was freaking out like mad now. I went on MSN, no sign of Dan. I realized this was it, time to find out for sure. Everything pointed towards Dan being dead, or something seriously bad. I made up my mind, and decided if his parents answer I'd say 'Hey is Dan there? Oh he isn't? That's strange, he seemed tired when he left, and it's been an hour. He should be home by now, I'm kinda worried.' Tess and I began getting extremely worried. It was like a near life experience. I thought my life was fucking over. I thought they would find their dead son, think he drove drunk, realized we let him leave the house drunk, or worse find the acid. Wed get sued, go to jail, end of our lives.",
  "To our fucking mad relief he picked up the phone instantly. He said he left a message, but my phone never tracked his number. It was fucked up, a really stupid reason for that to happen. After telling him what happened, we both laughed it off. But we were extremely weirded out from that experience.",
  "Tess and I reflected on what we could about our trip, and ate as much jello as we could. It was peach flavor, very tasty! The whole trip was a great experience, I feel much closer to Dan and I feel like Tess and I bonded more and are closer than ever. All in all, it was one of the best trips I've ever have. I can personally say that I love LSD and think it's one of the best drugs I have ever come across.",
  "At the moment, I am fully satisfied and don't think I'll be touching LSD for at least a month. I've tried 2c-I after getting a package, and love that drug. I think I'll experiment with 2c-I a bit more before going back to LSD.",
  "Remember,",
  "'Your head is the car, the acid is the key, the key can start the car, but you have to be the one to drive it and switch the gears. You buy the ticket, you take the ride, you're going for a trip.'"
 ],
 "erowid": {
  "id": "53356",
  "citation": " Lance. \"3 Heads Full: experience with LSD & Cannabis (ID 53356)\". Erowid.org. Sep 20, 2007. erowid.org/exp/53356",
  "substance": "LSD & Cannabis",
  "views": "2716"
 }
}
