{
 "id": 16693,
 "title": "Weakened and Strengthened",
 "date": {
  "submission": "2007-03-31T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Martin",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.16 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "cookie/food"
  }
 ],
 "report": [
  "Overview:",
  "Mushroom Experience: 15",
  "Date: 24-05-2006",
  "Start Time: 20:00",
  "Dose: 1.16 grams Copelandia Cyanescens ('Hawaiian') dried mushrooms in chocolate (1 chocolate bar = 2 grams in 12 chocolate squares - 7 squares were eaten)",
  "Setting: Alone, Indoor.",
  "Preparation:",
  "I spent some time preparing for the trip, cleaning myself and my room, washing my clothes and bedsheets and preparing a music playlist, as usual. My preparation was completed sooner than it had been on previous trips and allowed for 90 minutes to sit in silence and contemplate what was to come. I hadn't eaten for about 6 hours and decided to dose at 20:00 so that the sun would be going down as the trip was reaching peak effect.",
  "Background:",
  "My life situation was good, having just graduated from university and awaiting the start of a new job abroad in the Netherlands, I had no perceivable loose ends to worry about, and having had 14 experiences with mushrooms, 10 of which were alone, I felt that the experience would be a comfortable and relaxing break, despite being the strongest dose I've taken yet, at 16% higher than my previous highest dose. I had no particular goal in mind, just a desire to see where the experience would take me.",
  "0 minutes:",
  "I eat just over half a bar of chocolate and click the play button on XMMS as the clock reads 20:00. The music begins, and I feel an unusual confidence about the upcoming experience, as I spend the first 20-30 minutes sitting on my bed, trying to allow myself to relax and observe any changes in perception. Nausea began to hit fast, and I soon begin to feel both physically and mentally very uncomfortable. There was a sudden realisation of an image within one of the posters on my wall, as though it had instantaneously jumped out at me, which startled me for a second.",
  "25 minutes:",
  "In my weakened state, I dragged my mattress onto the floor in the middle of the room in order to get the optimum centred position for hearing the music, but still felt very uneasy and disoriented. Standing and walking was beginning to become very challenging, especially since most of the floor of my small room was covered with the mattress. I am a firm believer in the principle of not interfering with the course and plan of a trip, and so changing the music was totally out of the question. There were brief moments of comfort at times, but the experience was predominantly anxious. I was hoping that once the first section of my playlist had passed (a selection of Royksopp and chill-out tunes), I would begin to gain more confidence and feel better as something more familiar to me played. This was not to be.",
  "40 minutes:",
  "The second section of the playlist began, a selection of video-game remixes (mostly house, synth-melodic-techno, etc.) and the trip just seemed to intensify further. Much further. A brief moment of relaxation at the beginning of the new sound was quickly washed away. Vague closed-eyed fractal patterns became visible.",
  "The music that I was accustomed to hearing within my every day life was sounding immensely powerful. The bass was turned all the way down, and yet the thumping still drove through me. The melodies screamed out and I began to experience synaesthesia with the music no more than 45 minutes after eating the chocolate. This grew stronger throughout the first track of the playlist's second section, but the intensity was far from reaching its peak.",
  "45 minutes:",
  "As each track played, a new hope for comfort came, but was soon washed away again as anxiety began to return. The feeling of being physically weak, disoriented and unable to breath properly was not something that I would wish upon anyone. It only got worse as the next track played. Usually very upbeat and happy, listening to the track reminded me of how weird music can be, as I recalled the first time I had heard this music only 3 years ago. It felt as though my mind was being segmented into pieces, that the music was somehow wrong. It seemed to break my mind down into a plethora of random abstract bizarre patterns that didn't make sense and defied the conventional patterns of thought that I had previously only believed possible. Each time I opened my eyes, I could see the light from the window behind me, and hoped that the sun would disappear soon as to leave me to rest in darkness, free of external visual intrusion.",
  "47 minutes:",
  "The strangeness was too much for me to handle, and I had to leave the room. I went to the bathroom, which felt incredibly strange. I was totally unable to stand and had to sit down. I felt some relief, but knew that the trip would only increase in strength from here onwards.",
  "50 minutes:",
  "As I returned to my room with a glass of water in hand, more anxiety followed as I felt that I betrayed my principles of not interfering with the course of the trip by leaving the room. I lay down on the mattress, wrapping myself in the quilt that would be my vehicle that would carry me into the trip. The anxiety began to manifest itself within the environment around me. The desk under which my feet lay became the mouth of a giant machine, some kind of bizarre colourful mechanical device with lights that was pulling me inside to an unknown realm of possibilities that knew no limits. The mattress on which my vehicle lay was the conveyor pulling me inside, and the entire scene looked dominating, towering over me and surrounding me. With closed eyes, the concept manifested itself as two-dimensional animated patterns of rotating and moving mechanical devices, defined strongly by the tone and mood of the music against a backdrop of rainbow gradients. I felt helpless and weak, but knew that this was the safest situation that I could hope for. Interfering with the trip could only lead to more serious anxiety.",
  "55 minutes:",
  "The music sounded simpler and considerably more familiar, but this was no comfort to my physical state by this point and the positive aspects inspired by the music were quickly washed away again by the discomfort. I reached towards the desk were the glass of water lay, but was so disoriented that I was unable to find it and gave up. Unable to bear the discomfort, several more clumsy attempts followed until I found the water that I was looking for.",
  "60 minutes:",
  "The music became more aggressive. Synaesthesia became stronger than ever, manifesting itself clearly in my minds eye as a long vicious silver dragon wrapped around an orb of pure energy, animated with fast moving colour and shiny surfaces. It was a representation of pure strength, but I was unable to interpret its meaning beyond the basic idea that was presented. For a brief few minutes, I found it extremely difficult to differentiate between myself and my surroundings. My being was beyond strange. My body felt extremely odd, my arms like tentacles stretching inwards, originating at my hands from each side of the environment. I was unable to properly map the shape of my body to the physical senses that were fed to my mind.",
  "65 minutes:",
  "The music became more fun. The sound of sirens in the background were anything but alarming. It was almost like a feeling of preparation and initiation of movement. It reminded me strongly of the feeling one might get at a carnival when sitting in the bumper cars as the ride is started. But the physical discomfort and weakness continued to plague the experience as more familiar tunes played. I was very unsure whether I was physically OK, and began to worry whether I should seek help. Only the knowledge that so many people have survived the experience before gave me the courage to continue alone. Visuals within the minds eye continued for some time and disorientation was extreme as the room seemed to sway and tilt from side to side. Time dilation was also very strong. It felt like hours had passed since I had been sitting on the bed waiting for the trip to begin. Looking for visual distortions was now the least of my concerns.",
  "75 minutes:",
  "The middle of the second section of the playlist was reached, as noted by the particular track that was playing, which was distinctively different to the others. It was not a pleasant tune, despite being very enjoyable in a sober state. Too much percussion and speech dragged the experience to a too outwardly focus. The music following this changed back to the house and synth-techno remixes that were more typical of this section. The trip was growing intense faster than I had anticipated, and I longed for the relaxing sound of the Myst 3: Exile soundtrack that seemed so far away. I felt as though I was going insane and that anything I could possibly do would only lead to further feelings of insanity. I lay down, trying hopelessly to relax.",
  "85 minutes:",
  "The descent began. The music began to get smoother and calmer. Hope was returning, but the experience was certainly far from over. I decided to take the opportunity once again to leave my room to go to the bathroom before the third section of the playlist began. I was astonished to see that there was still a significant amount of daylight left in the evening sky from the window of the landing. The night seemed to be progressing extremely slowly and I began to wonder how I could possibly ever return to normal by the following day. I returned to my room with more water and lay down once again. A drastic tempo change effect in the music was perceived as a profound alteration to the mind-state, inspiring an uncontrollable onslaught of thought and ideas regarding perception of time.",
  "95 minutes:",
  "Deep orchestrated strings and full choir sounds flooded my room for a short time, inspiring a dark mystical or evil religious angle to the experience. Thoughts accompanying the perceptions were not positive. Thoughts about the fragile nature of existence, life and death were dominant and seemed impossible to shake off. More mystical, yet calmer soundtracks followed, deepening the contemplation of these issues that no young person should have to face. The uncertainty was overwhelming.",
  "105 minutes:",
  "The second section of the playlist reached a calm closure and the third section of the playlist began. But the calm, distant and magical sounds of the Myst 3: Exile soundtrack served no resolution to my situation and the deep thought and contemplation continued regardless. I cried, occasionally crying out loud, tears pouring down my face. I felt like a lost soul. Something had gone awfully wrong and I had no idea what it was. For some reason, my life was over and this was the end. I would never enjoy anything as I had before. My strength was gone. I had grown past my peak and the rest of my life would lead downhill. These thoughts continued, and my weakened state only made matters worse, causing strong feelings of my inadequacy towards everyone around me that I knew.",
  "My remaining strength was directed towards lifting the mattress from the floor back onto my bed, after which I fell to the bed, trying hopelessly to rest, occasionally stopping to cry at the sadness that I felt.",
  "As time passed, it slowly began to occur to me that I wasn't alone. The sorrow and sadness that I felt was not only for myself, but that of the entire civilised world. The realisation that the vast majority of us are lost souls, caught up in the games and insignificant acts of every day life that society has taught us to expect and accept. The realisation that there is little escape, and the feeling of being trapped. But yet I still felt very alone, not accepted, knowing that I was soon to move away to a country with no friends or relatives to live by myself. For the first time I began to question whether this was a step I really should be taking - to risk eternal loneliness for material gain and the untethered freedom of movement that is unheard of within most countries for those like me who cannot drive. The opportunity that only several hours earlier had seemed to be the high point of my success was no longer what it once was and could ultimately lead to a life of failure and misery.",
  "135 minutes:",
  "In my disoriented state, my improperly co-ordinated hands were unable to properly position my glass of water to my mouth, and I spilled the water on myself. The shock of the cold water on my skin caused me to breath heavily, taking in air and calming my nerves. It was only a short time before anxiety and sadness returned, but repeating this proved to be a valuable way of staying calm. I contemplated the idea of a cold shower, which seemed very attractive, but was not feeling physically able to do so. Turning on the lamp in the corner was extremely bright, leaving a vivid blotch of colour in my field of vision for long after I turned it off. The blotch morphed from blue, to green, to purple and to red, looking at first like a doorway and then like a skull that I was unable to remove from my perception, which eventually faded as I fetched more water from the bathroom.",
  "155 minutes:",
  "Uncertainty in my life has never been so strong. I thought of the people I knew, such as my friends, who always seem happy on the outside, but ultimately seem to have no idea where they are in their lives or where they are going and how they are going to get there. And worse yet, they are so tied up with social boundaries and expectations that they aren't even able to see this. It was a terrifying thought to realise that the people closest to me such as my friends and family may never experience the joys that can be comprehended under altered states of consciousness through these realisations, and yet that are reachable by the vast majority of us with enough will and effort.",
  "It wasn't until this point that I truly appreciated just what powerful tools psychedelics are, offering us vast insights and invaluable answers even to those questions that we never think to ask ourselves in our normal life. They are truly amazing gifts, and I began to feel lucky to have been given the opportunity to experience what psychedelics have to offer. I realised that the experience was not something to feel sad about. It was a realisation of potential, of what's possible in life, not through material or social gain, but from pure raw emotion, love, lust, joy, happiness, creativity, internal freedom, the things that we fail to appreciate and notice in life as we become tied up in every day life and behaviour. This realisation makes it extremely easy to envy those who lived thousands of years before us, like animals with no worry of possessions, abstract morals and other burdens that we are forced to live with. The unprecedented level of freedoms offered by this way of life, no worries and no concerns. Just a desire to live by pure instinct as nature intended. I am a firm believer that instinct, sub-conscious knowledge, God, or whatever you want to call it can lead a person towards a life full of experience and happiness if only we're willing to put aside our learned expectations and listen to it.",
  "175 minutes:",
  "Still feeling rather frustrated, but I have calmed down a bit. Confidence in myself begins to grow again. A contemplative sense of peace and understanding grows. I feel a desire not only to respond to my own life situation with unprecedented effort, but also a desire to use the experience as an opportunity to help the vast number of others who are in similar situations find similar insights into their own lives and break free from social expectation in order to give them an opportunity to make their own decisions and experience life to its full potential.",
  "The third section of the playlist ends too soon, and I am amazed to find that less than 3 hours have passed. Knowing that it is the right thing to do, I set XMMS to continuously loop the soothing and relaxing second half of the third section. I feel no desire to return to the music that I listen to every day that makes up the final section of the playlist. The soothing Myst 3: Exile background soundtrack music gives me a strength and will to contemplate ideas through until their end.",
  "I sit upright in my room on the bed with crossed legs and folded arms, eyes closed in a meditative and euphoric sense of piece and understanding under the glowing red light. Many answers and insights come to me during this time, each one adding to the strength of my confidence. My perception of myself is still not fully re-assembled and my body seems strange and beautiful, and not the dying piece of flesh that I perceived it as only an hour or two earlier. Everything is utterly amazing. The privilege of being given life and a physical body within which to travel in a consensus environment inhabited by the bodies of other souls. Every part of the body provides a unique and amazing function, and I feel extremely lucky to have the experience of life. Never have I appreciated the physical body so much as I did at that time, and it also strongly occurred to me how such a psychedelic experience could be utilised as a powerful natural aphrodisiac.",
  "I continued to contemplate my situation until I feel ready to end the experience, confident in the new life that will follow when I move away from home country, without neglect to those many aspects that I had previously not thought of.",
  "255 minutes:",
  "Confident in my new found insights, I decide to end the night with a few episodes of The Simpsons, a vindaloo with rice and a couple of beers. I feel relaxed and alert beyond normal consciousness. I do not, for one second, regret any of the experience. I feel that I learned more of value in a single night than I have in this entire year so far. There is absolutely no doubt in my mind that it was a positive life changing experience, and one that I will remember forever. I will continue to look to the mushroom as a source of inspiration in my life direction and as a versatile tool at its various levels of intensity and variety of uses.",
  "360 minutes:",
  "I go to sleep, ready to execute the actions as planned from what I have learned during the experience."
 ],
 "erowid": {
  "id": "53394",
  "citation": " Martin. \"Weakened and Strengthened: experience with Mushrooms - Copelandia Cyanescans (ID 53394)\". Erowid.org. Mar 31, 2007. erowid.org/exp/53394",
  "substance": "Mushrooms - Copelandia Cyanescans",
  "views": "3333"
 }
}
