{
 "id": 16692,
 "title": "I Am It, It Is I",
 "date": {
  "submission": "2008-10-14T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Quoiyaien",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": " T+ 14:00",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "This trip is the one that showed me the way.  It has since proven to be but a glimpse of the doorway to enlightenment. The date of experience is February 15, 2005.",
  "I dosed at 8:00pm.  My mindset going is was incredibly calm.  It was probably due to the amount of time I spent meditating in the last 4 months prior to the experience.  Anyways, after dosing, I got into bed and just lay there.  Complete silence.  It was the first time I have ever tried tripping in complete, silent darkness.  About 15 minutes in I started feeling the initial mind whirl that I always get coming up on acid.  I felt incredibly drawn into everything.  By now I had turned on the light and was vividly staring at a stopwatch that I had been using.    Things continued on, and I called up to my buddy via the 2 way radio, just to say 'What's up'.  At this point, I felt incredibly light, like my skin was evaporating into the air.  At that same moment, I said to myself 'Here we go' for I knew what lay just beyond the hour. ",
  "I as I continued to lay in my bed, (t+ 0:30) I got incredibly bored just sitting there, so I said 'Fuck it, I'm gettin' up.  By now, I was totally feeling the effects of this 'wondrous molecule' as I so eloquently put it in my inebriated state.  I got out of bed, turned on my main overhead light, and looked at the amazing display I had created for this very purpose.   The room was covered in multiple pattern sheets.  I hung them like drapes from the ceiling, boxing off an area with my bookshelves, and weight set (which I covered with its own blanket, a Canadian flag with a pot leaf replacing the traditional maple), which became a cool area in of itself. ",
  "Anyway, back to the room, I covered everything with blankets and floral sheets: the floor, my dresser, everything except my nightstand.  On top of my dresser, I had some really cool looking plants, which really looked like fractals even when sober. It was the coolest looking room I have ever seen.  My bed was a haven of blankets and pillows.  I was in heaven at this point.  Just taking it all in.",
  "I started feeling a little anxious as I approached the hour and a half mark.  Now this is just a rough estimate of what time it could have been.  I removed all source of time, except for that of my stopwatch, which I had conveniently placed out of sight.  I remembered all my previous acid trips, but not just those, Theres this feeling, that, like, Ive done this a million times before an infinite number of times before which gave me a sense of great calm.   I felt connected with a force far greater than that of which my mind could conceive.  Then it hit me.  To truly know it, is not to know it",
  "I had to play guitar.  I came out of my room, turned everything on, and just wailed!  I have a looper that I can record a progression, then I just jam over it.  As I continued to play, I looked up at this poster of Jimi Hendrix, and it looked like he was smiling and nodding his head at me.  It made me shiver.  I was playing exactly what came into my head without any effort.  My fingers could fly up and down the neck, at speeds I couldnt comprehend sober.  Any note, melody, chord, or sound could be produced at will.  I merged what I was thinking, with what I was sensing, and I was the sound.  I became the vibrations in space that created this, like one big ass Super-string (for those familiar with the string theory in quantum physics).",
  "I remember at one point, I could see the fields of sound coming out of the amp.  Each frequency was seen as a different color, and I could change the note feeding back by simply moving my finger, and walking into another field of visual sound.  These fields were everywhere, a beauty beyond compare.  It was like a massive collage of sound, layering infinitely on top of each other.  I played for a little while longer, then, just like that, felt it was time to stop.  I put the guitar down, powered off, gave a nod to my Hendrix poster, then proceeded back into my room.  ",
  "That is when I disappeared.  I felt this wave of energy flowing through me, it was the eternal life force that is all consciousness.  There was an immediate connection to all beings, I was now simply a letter to identify my body.  It had no connection to my true self.  At this point, there was no difference to what I was seeing with my eyes open, vs. closed.  So I decided to head upstairs to converse with my buddy.  In previous trips, where I have encountered non-tripping people, it really brings me back to reality, but for some reason, he was just as much a part of the trip as the plants, or the wall for example.",
  "It's funny, when I hear this, I feel that all of a sudden, Im everybody thats going to hear this, and also the voice speaking it, AT THE EXACT SAME TIME!",
  "My buddy had a fire lit, which I found quite amazing.  I kept staring into the fire, and I would become the fire.  I am sure a lot of you know what I am talking about.",
  "As time went on, I saw vision after vision, just constantly flowing.  I knew I was totally emerged in the experience at this point, and just started walking around slowly, contemplating life and existence.  I got this vision of a graph.  I related the graph to awareness being brought into nothingness, or the zero point.  Then I started attaching words to this, and BOOM, it hit me.  When I analyzed my experience I would always start spinning in my head, pure chaos at its finest.  But when I just felt my experience, not attaching any thought, opinion, idea, or any other construct of the rationalizing human mind, I became everything and nothing at the exact same moment.  There was no experience to be felt, for I was the experience, and to feel it, would imply knowing I was feeling it, and knowing is a function of the human brain.  I became the same as everything around me.   I simply did not exist. ",
  "I am the wave I felt that everything was flowing, moving, and eternally changing and I was part of it all.  Every time I gained self-awareness, it simply felt like I was me, coasting on a wave, which would instantly cast me back into the realm of nothingness.  I wondered around in this ego-less state for what seemed like hours.  At one point I remember thinking that it must have been at least 8 hours into the trip, but upon further inspection,",
  "It's only quarter to twelve!  Holy Shit!",
  "I figured Id better get back downstairs.  I headed downstairs, and lay in bed for a minute or two, but I was far to energized to stay there.  I got out and began just wandering around.  I went upstairs, and just started walking around my house, in a constant circle.  Through my living room, then past the kitchen table, into the hallway, past the bathroom, back into the living room.  I did all this incredibly slowly.  Taking about 5 minutes to make one rotation.  Once I had been around about 10 times, I realized that I was just walking and observing, which instantly reminded me of my Zen practice, and Kinhin (walking meditation).  As I continued to walk around, I recognized the fact that there was no internal dialogue.  If there was, I was not aware of it.  I was just one big antenna, receiving every bit of information at the exact same moment in time.  RIGHT NOW!",
  "Its all sensation, just, sensation. Just feel. Dont analyze the feelings, just feel.  Thats it.  Anything else is just purely itself.   FeelSensation cannot be expressed in any way shape or form.  It can only be perceived",
  "I dont know when I said this. It was sometime during my kinhin practice.  I continued doing this for quite sometime, not sure how long though.  But at least another hour.  I have no idea, I cant really remember much about the next few hours, other than incredible feelings of my own omnipresence.  Details are lost.  But the sensation I remember, was this ultimate calm.  Everything was perfect.  It was the most blissful experience of my life. ",
  "Zen is the practice of everything and nothingness, being sensation, yet being beyond sensation I understand.  Some would call this enlightenment.  Others would just call it words.  Beautiful  Zen practice, is Zen practice.  It is after all, a practice.  Its not about understanding Understanding is great and all, but understanding is something that we apply to it. You cannot know, to know is to not know. It goes beyond the sense of wonder, because the sense of wonder in itself, is just that. A sense of wonder and to apply anything to a sense, is the mind at work.",
  "There was a point, where I could perceive an infinite number of dimensions.  Both spatial and temporal.  Like for every single perceiving being in the universe, there was another dimension of existence, and I was aware of all of them.  I remember seeing all this again relating to a graph.  It was like a cube.  But there was also a vision of time as a spatial dimension, constantly unfolding to reveal a more, different reality.  I remember seeing fractals everywhere as well.  Everything was a fractal.  Time, was a fractal.  It didnt matter what I looked at, it would become a fractal. ",
  "The last thing I have recorded is All those shit meanings, that don't mean shit I have no clue to what I was referring to, but I figured it necessary to get down.  Ah well.  The rest of the night is a big blur of events.  I remember dicing up some gingerroot and making some ginger tea, and I dont know what else happened.  I remember after my buddy had gone to bed, I was sitting upstairs, this was like 10:00 am now, and I just kept smoking joint after joint, but due to the nature of my trip, I just couldnt reclaim my ego.  For I felt doing so would be ignorant.  Then I smoked a joint, and realized that I am in fact a separate physical being (for now anyway) and that life is about feeling, interacting, and most importantly of all, loving.  Every moment, just love.  Not any one or any thing, but just for the sake of love in itself.   ",
  "There was not one difficult moment.  Every time something unpleasant would come up, Instead of trying to drop it, I just marveled at the fact that this was going on.  I remained selfless for who knows how long, because I remember waking up, in my own bed, like I had actually taken the time to get ready to sleep.  I have no recollection of this whatsoever, just that I finally regained my ego after waking up.  The last time I do remember (probably right before I went to bed) is 8:00pm Thursday, exactly 24 hours after dosing.  I had no concept of it being Thursday however, I simply know it didnt just disappear.",
  "I woke up at 4:00am Friday morning, got out of bed, and realized that I was back.  I rolled up a joint, threw on I Robot which I thought would be the perfect movie for right then, and it was, it put me in a massively introspective mode.  I cooked up some burritos, then chilled.  I watched another movie (Cellular, horrible IMHO) and went back to bed at 9:00am or so.  I got up again at 2:00pm Friday, smoked a joint, and thought to myself, Where the hell did Thursday go?  I remember Wednesday, and then waking up on Friday morning, but Thursday is nowhere to be found.  I gave a little chuckle, and with a flick of my lighter, lit up another joint."
 ],
 "erowid": {
  "id": "53392",
  "citation": " Quoiyaien. \"I Am It, It Is I: experience with LSD & Cannabis (ID 53392)\". Erowid.org. Oct 14, 2008. erowid.org/exp/53392",
  "substance": "LSD & Cannabis",
  "views": "12095"
 }
}
