{
 "id": 16709,
 "title": "Midnight Kites, Walking and Talking",
 "date": {
  "submission": "2006-07-02T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Ben",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "13 mg",
   "administration": "oral",
   "substance": "4-HO-MiPT",
   "form": "(liquid)"
  }
 ],
 "report": [
  "0:00h - I was at my friends house, comfortable location, ingested ~13mg 4-ho-mipt in alcohol solution [It is very slightly soluble, it took about half an hour to dissolve 60mg in 80mL vodka with a lot of shaking] this was my first experience with this chemical which was why the dosage was so low. Empty stomach.",
  "~0:20h  My reality is beginning to change, there is no consciousness shifting whatsoever and I am able to think clearly, I feel somewhat disassociated from my body, there is some mild physical tension similar to a low dosage of mushrooms, things are starting to appear different. There is slight nausea at this point, which was to be expected, it quickly passes.",
  "~0:40h  We decide to go outside and fly a kite in the field across from my friends house [it is the middle of the night, and we had fashioned the kite out of garbage bags, very surreal] The effects are really manifesting themselves now, I believe the fast onset is due in part to the fact that it was dissolved in solution beforehand. Everything in my field of vision has developed a yellow tint to it. There is a familiar morphing/breathing effect when focusing on an object exactly the same as mushrooms. I also noticed something that I have never experienced when on mushrooms, the visual effects seemed more complex and 3 dimensional, flat textured surfaces would take on the appearance of depth and slide over one another.",
  "~1:20h  We had been flying the kite for 40min now, and it was very surreal, I am not sure if that was due to the chemical or the fact that we where flying a kite in the middle of the night alone in a field. I am still experiencing the morphing/breathing effect, objects will change size, or take on the appearance of other objects, and everything looks very different. It is impossible to say when the peak of the experience was, there is no well defined peak with this substance, within a few minutes of unset the experience was already as strong as it was going to get, and it stayed that way for quite some time.",
  "~1:50h  We has stopped flying the kite, the string had become tangled and two of my friends where trying to unwind it, I walked around the field and had a very pleasant conversation with another friend, there was a loss of inhibitions associated with any intoxication, and some mild empathetic effects. During the entire experience there was no shift in perception, my thought process was left unchanged, and there was little body load with respect to the intensity of the visuals. I think the best way to describe this is how I would assume a hallucinogen to be, there were visuals but my consciousness remained untouched, it was unlike most drugs in this respect, and rather than changing me it was almost as if everything else was different and I was the same. I was able to maintain my balance perfectly, there was still the tense body feeling associated with mushrooms but this was alleviated by moving around, and my speech was not impaired in anyway.",
  "~2:50h  I decided to walk home with a friend, it was a long walk and I talked for the entire trip, it seems very social. Most of the visuals where over now, things still appeared to be different and I no longer felt an anxious feeling in my body, I was left with what I can only describe as disassociation. I was able to reflect on my experience [and still am] I think one of the attractions to this chemical is that my experience is portable, when I do a standard hallucinogen like mushrooms my consciousness changes so much that any experience I have while it makes sense at the time is completely alien when I am sober. With this chemical there seems to be little consciousness shifting, the experience will make sense the next day, I am not left with a what the hell was I thinking feeling. I think this makes the experience over all much more valuable, as I can actually take something away from it.",
  "~4:00h  All the visual effects have worn off now, I feel very slightly physically stimulated, I eat, there is no nausea or any loss of appetite, and I could sleep if I wanted to but I dont have to. I stay up for another hour or so.",
  "Aftereffects  I feel fine today, there seem to be no negative after effects [at least at this dosage] I was a bit dehydrated when I woke up.  I found the experience very rewarding and enjoyable, I think I might try it again in a few months at 25-30mg, depending how I feel."
 ],
 "erowid": {
  "id": "53437",
  "citation": " Ben. \"Midnight Kites, Walking and Talking: experience with 4-HO-MiPT (ID 53437)\". Erowid.org. Jul 2, 2006. erowid.org/exp/53437",
  "substance": "4-HO-MiPT",
  "views": "10888"
 }
}
