{
 "id": 16704,
 "title": "Adventurous Mentality",
 "date": {
  "submission": "2007-10-05T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nathan",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "12",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "seeds"
  }
 ],
 "report": [
  "Talks of hallucinogens circulating my mind.  Tried mushrooms two weeks before-hand, and was looking for something else to experiment with.  So I went to a local nursery and grabbed about 6 packs of seeds.  On the way home, passenger in a vehicle, I ingested seeds by chewing up as much as possible and swallowing.  I ate approximately 12 grams which I wouldn't recommend.  For the first hour I had my doubts accompanied by stomach cramps.  My head felt floaty, and I had light nauseau.",
  "After about one hour and fifteen minutes my perception of time seemed distorted.  I was sitting on a computer at my friends apartment trying to check my email and then all of sudden I just felt like I had been sitting in that same spot looking at the computer for hours.  I asked my friends how long I had been in the chair and they told me about 5 minutes.  At this point I knew that they were going to work.  I remember feeling very spacey and my ability to concentrate and read was greatly effected.  From here on (about 2 hours into the trip) I began to have intense visual hallucinations.",
  "I remember going outside, being dark at this point, and there was an orange street light on a newly paved parking lot in the apartment complex.  There were little pieces of gravel that had been kicked up onto the pavement and I started staring off into pieces of gravel close to my feet.  The pieces of gravel looked like stars and I picked one piece and began to kick it and follow it.  Everytime I kicked the piece of gravel I would follow it approximately 3-5 feet that I kicked it and would look down and it seemed like I was kicking a planet around and just ending up in orbit in some other galaxy.",
  "The visuals were amazing.  I could see dimension in the galaxies of gravel and it seemed that the orange light that hung above was the sun.  I remember feeling large and omnipotent kicking my star into other parts of the space but at the same time small, that I resided on some small planet in some small galaxy in comparison to the entire universe.  I felt free.  I eventually kicked my rock off the pavement into some grass and realized that I must have looked really crazy out there staring at my feet kicking rocks around awe struck so I went back inside.  I could not really communicate with my friends when I went back in.  I couldn't understand their moods.  My mind felt like it was rotating in between knowing exactly what was going on to complete confusion.  I gave up on conversation and involved myself in more visuals.",
  "The visuals on these seeds are more geometric.  Everything has definite shape and fit together like parts of a clock during peak. I remember points in my trip where I could look at my whole field of vision at one time and watching different parts of my vision slowly start turning like those little glimmery pinwheels.  The trip went on for close to two days with sleep in between and extremely vivid dreams.  The dreams lasted for over two weeks after I had done the seeds.  My dreams felt like I was really in them, with enough detail to sit around and notice things while I am in your dream.  I would also add in that I was really spaced out for two weeks to a month after I did the seeds, but it's not so much confusing as it is dreamy and stress relieving."
 ],
 "erowid": {
  "id": "53422",
  "citation": " Nathan. \"Adventurous Mentality: experience with Morning Glory (Blues Brothers) (ID 53422)\". Erowid.org. Oct 5, 2007. erowid.org/exp/53422",
  "substance": "Morning Glory (Blues Brothers)",
  "views": "3386"
 }
}
