{
 "id": 16719,
 "title": "Damn Tired",
 "date": {
  "submission": "2002-01-12T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Face",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "45",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "I had heard that nutmeg could get you intoxicated for a while. I was interested in trying it, particularily after my friend had tried it years before and confirmed that yes, nutmeg gets you high.",
  "So eventually I decided to try this out for myself. I went to the bulk barn and purchased about 70g of the stuff. I decided I would try to eat it at around lunch so it would kick in at around 2 o'clock. After makeing plans with my friends to go drinking I noticed it was 3:00 and I felt no effects. I thought that this nutmeg thing was all a hoax when 4:00 rolled around and was pissed off at having to eat so much nutmeg, and the taste was still in my mouth. So I decided to go catch a bus and make my way to my friends appartment to go drinking.",
  "While on the bus I noticed I was feeling fairly restless and slightly paranoid. 'About time', I thought. By the time I got to the appartment, which is about an hour away, I was stoned. It wasn't so different from being really stoned off ganja at first. Soon I found I was really tired, and slightly shakey. By the time it was 10:00 I was dead tired and would have loved nothing more than to be able to sleep, but I had to go home.",
  "So me and another friend caught a bus and while waiting for the bus I realized I was extremely thirsty. At first my mouth was dry, but soon I could feel my eyes drying up. I wear contacts and I was trying to keep them from falling out. When I got home I drank a ton of water and quickly fell asleep.",
  "I woke up and went to work the next morning. While serving customers I found I was still mildly stoned off the nutmeg, I felt awkward and still very tired even though I had just had about 9 hours sleep.",
  "Anyway, I would sum up the experience by describing it like being burnt out for a long long time.",
  "All in all it was interesting, but I don't think I'll be doing it again anytime soon, consuming about 45g of nutmeg is not something extremely tastey."
 ],
 "erowid": {
  "id": "5346",
  "citation": " The Face. \"Damn Tired: experience with Nutmeg (ID 5346)\". Erowid.org. Jan 12, 2002. erowid.org/exp/5346",
  "substance": "Nutmeg",
  "views": "14298"
 }
}
