{
 "id": 16737,
 "title": "Two Weeks of Stench",
 "date": {
  "submission": "2006-06-13T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Durandal",
  "gender": "Male",
  "weight": "55 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 tablets",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "13 shots",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>It was a Thursday night after work in the factory I worked in.  I had the next day off and had next day off, thus I invited over a friend to binge drink as was the norm for me then.",
  "I was 20 at the time and had a bad run of relationships and death.  Feeling depressed and sore, I turned to alcohol to ease the pain of a night, often having straight shots immediately after I got home from work to get past the initial soberness then drinking for 5+ hours.",
  "Drinking since I was 14, bourbon no longer had much of a effect on me, so I turned to stronger stuff:  Absinthe.",
  "My friend had recently been experimenting with pharmaceuticals + alcohol, and encouraged me to try this.  I had had 3 shots of Absinthe before he came over, and we proceeded to take straights shots of our alcohol (him vodka, me absinthe).  Over the course of the next 4 hours I had 13 shots of absinthe and 4 valerian tablets.",
  "I awoke with a room full of vomit.  The rest of the night can only be told from what I think happened.  I fell down my stairs from 2nd  storey to first at some point, I found a pool of vomit and blood in my bathroom (I believe I had a blood nose from smashing it on the stairwell)  My bedroom was covered in vomit and there was a towel in it.  I believe I passed out trying to clean it up.  I also knocked my stereo speakers off its cabinet and I had a bloodied knee, I recall bumping into something in the night and having a fire in my kneecap.",
  "It took 2 weeks for my room to smell normal again.",
  "I awoke without any traces of a hangover and I thought the night ended normally with me going to bed drunk but ok.  Was I in for a surprise that morning?</p>"
 ],
 "erowid": {
  "id": "53491",
  "citation": " Durandal. \"Two Weeks of Stench: experience with Absinthe (ID 53491)\". Erowid.org. Jun 13, 2006. erowid.org/exp/53491",
  "substance": "Absinthe",
  "views": "18130"
 }
}
