{
 "id": 16731,
 "title": "A Pleasant Addition to My Bathroom Cabinet",
 "date": {
  "submission": "2006-06-11T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Syphiluke",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Mirtazapine",
   "form": "daily"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This is a description of my experiences with Remeron (generic: Mirtazapine) as prescribed to me for depression, with some additional commentary on minor recreational usage as well. It is not however, a high dose experience report of anything outlandish or exciting.",
  "I had been on and off anti-depression meds for about 15 years, running the gamut from Prozac, Zoloft, Wellbutrin, Lexapro to Effexor. I suffered from low grade but mostly chronic depression that I was unable at that time to deal with without medication.  Having been thoroughly frustrated with the aforementioned drugs, and wanting to find a remedy that didnt include either being completely disinterested in sex, unable to maintain an erection, or endless sex without an orgasm, a friend had suggested I try Remeron, 30 mg/day, one pill before bedtime.",
  "The results were delightfully positive! Not only was the substance effective at assisting to alleviate my depression, it seemed to be devoid of sexual side effects, at least to the extent that they were noticeable. I had finally found My Drug!  On top of this, I found the substance to be an outstandingly effective sleep aid, and when taken before bedtime, it resulted in a very deep and peaceful sleep. Getting up in the morning was difficult at first, but this subsided after the first couple of weeks.",
  "The first mistake however, occurred one morning when I realized I had forgotten to take my dose the night before, and popped the little red-brown pill before leaving to work, driving from my home in Seattle, to my workplace in Tacoma.  Halfway there, I found myself somewhat overcome by a dreamy, sleepy state,  and it was very difficult to keep my eyes open and hold my lane on the freeway  and I mean VERY difficult! [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] Far more difficult than say, driving a car after ingesting 6 drinks.  Granted it was 6:00 AM.  Thank God I managed to make it to work safely.  Suffice it to say, from then on, if I missed my dose, I missed my dose, and that was that.",
  "While going through a particularly difficult breakup, and having been prescribed Xanax (generic: Alprazolam 0.25 mg) for anxiety, I soon found out that when Xanax and Remeron were taken together, a very pleasant and dreamy stone would result. Effects included loss of coordination, slurred speech, overall body numbness, and pleasant euphoria, much like an opiate high. I began to take my dose earlier in the evening, so that I could enjoy the escapist effects after a day of grieving the loss of my girlfriend.  When topped off with two or three glasses of wine the feeling was even more pronounced. ",
  "I find that this combination is fairly debilitating. For example, one evening after my daily dose of Remeron, .5 mg of Xanax and almost a bottle of white wine, I was awoken from my slumber by a call from my ex-girlfriend.  Upon answering the phone and hearing her voice, I was unable to identify that it was her due to my severely inebriated state. Needless to say, after I came to my senses enough to recognize her voice, it scared her badly to hear my barely coherent, slurring voice on the other end of the phone, and I began to smarten up and cut back.",
  "Im off prescription meds now thankfully, and have remained as such for about a year and a half. I suspect and hope I might never return to them. Ive made incredible positive inroads into my mental health with the help of a sketchy mindfulness awareness practice and a regular and conscientiously applied program of psychedelic substances.  That however is a series of other stories.",
  "I have occasionally returned to my leftover supply of Remeron, taking one prior to a plane flight with a glass of wine and a Gravol pill (Diphenhydramine 50 mg). The combination lends itself well to passing time in a wonderful dreamy state, zonking me out thoroughly. The flight can then be spent in a euphoric, semi-conscious state, listening to music on my headphones.  Music is greatly enhanced, and I have had some really wonderful and powerful experiences this way.  It does however leave me with minor but negative side effects the next day, like trembling, upset stomach and occasionally a headache, so I do it sparingly, and only when I have a particularly long flight and my lower back is acting up.",
  "Mindfulness awareness has been instrumental in helping me to understand and regulate my struggles with depression. There are always underlying reasons for depression, and I truly believe it is ultimately preferable to find the answers in the soul, rather than relying solely on regulating brain chemistry with a pill. Godspeed!"
 ],
 "erowid": {
  "id": "53483",
  "citation": " Syphiluke. \"A Pleasant Addition to My Bathroom Cabinet: experience with Mirtazapine (Remeron) (ID 53483)\". Erowid.org. Jun 11, 2006. erowid.org/exp/53483",
  "substance": "Mirtazapine (Remeron)",
  "views": "12774"
 }
}
