{
 "id": 16730,
 "title": "Sleep Aid Comparisons",
 "date": {
  "submission": "2008-10-21T07:00:00.000Z",
  "experience": "20046"
 },
 "author": {
  "name": "Theodore",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Various"
  }
 ],
 "report": [
  "Here follows a few experiences about the comparitive effects of a selection of drugs acting on the benzodiazepine receptor to increases GABAergic transmission in the brain. These drugs all share some similarities but a number of important differences exist which can have significant effects on the potential usefulness. Having experienced all a variety of drug classes at various doses from single tablets to more than 6, here follows a short account of their subjective effects.",
  "Diazepam - sedating and relaxing in lower dosages, mildly euphoric if several taken at once. Effects are definately longer lasting than others and there is a noticeable hangover effect in the morning consisting of feeling groggy and poorly rested. Most effective in its action. This is the 'safety drug' I keep with me when using psychedelics. This drug appears most effective at destroying the trip.",
  "Temazepam - similar but milder and shorter in duration. This is probably most useful as a sleep aid with fewer side effect than the stronger diazepam.",
  "Zolpidem and Zopiclone - Faster onset and noticeable intoxication. Very swiftly induces strong ataxia. The first time I tried one I could hardly walk. Nasty metallic taste which persists into the next day is one of the greatest drawbacks. Also these have a much shorter duration and if you are prone to early morning waking then I doubt the effectiveness these will have at providing a long nights sleep. Also noticed some visual changes from blurring to mild hallucinations.",
  "Once in combination I had diazepam and tomazepam with some zolpiclone (around 8 or so tablets in total). Having attempted to sleep on a bus we found all our efforts futile and so continued to increase our dosage (myself and a friend) until we had finished all the tablets we had. Instead of sleeping we were hyper-excitable, commenting on entities that did not exist and certainly not resting. We were told we had many conversations with our neighbours but the majority of this experience we had no memory of. Although we did not feel in the slightest bit poisoned, I would not take this for sleep or to get high as it appears to have been pretty ineffective in both."
 ],
 "erowid": {
  "id": "53482",
  "citation": " Theodore. \"Sleep Aid Comparisons: experience with Benzodiazepines & Various (ID 53482)\". Erowid.org. Oct 21, 2008. erowid.org/exp/53482",
  "substance": "Benzodiazepines & Various",
  "views": "22850"
 }
}
