{
 "title": "Change of Life",
 "author": "Curtis Tanner",
 "citation": " Curtis Tanner. \"Change of Life: experience with Cannabis (ID 16736)\". Erowid.org. Apr 11, 2008. erowid.org/exp/16736",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>My experience with marijuana was all positive. I am not addicted, and could quit at any time I like. Marijuana has changed my life, and my way of thinking. Here is the story.</p><p>I was 14 years old at the time, I was depressed, and suicidal, I cryed every day and always thought people hated me. One day I was at my friend's (Eric) house, he pulled out a pipe and some pot and asked me if i wanted some, I didn't really want to because I was scared of what it might do, but I didn't want him to think I was a wimp, or that I would tell on him, all though he didn't pressure me, I took a couple of hits.</p><p>I started feeling different, my eyes felt like they were marbles, it felt weird when I walked and I kept forgetting things, but only the things of short-term memory which I remembered the next day. I liked pot, so I started smoking it and buying it more often, I used to be suicidal, but pot made me feel like my life was all good, I felt like I was lucky to have the life I have, plants as well as other things for some reason looked better to me and more pretty, although I could still see straight, to this day I don't know what made things look prettier. I started feeling more spiritual and like the feelings in my heart were put to my head and life seemed alot better and instead of hating my life and myself, which I did before, I know felt good about my life and I loved it.</p><p>I still smoke pot till this day and probaly will till I am not able to smoke it anymore. My opinion is that marijuana is a stress reducer, as well as a depression reducer, my depression went away after I started smoking pot. I have tried other drugs such as Meth, cocaine and alchohol, but I still think by far marijuana is the best experience I have had so far, I mean sure, meth, coke, and alchohol are fun, but I still like pot the best. When I am on pot I fell relaxed and my body and mind feel good and I don't feel like hurting anyone or doing something like yelling or hitting people or committing crimes, even stealing I used to steal, but once I started smoking pot I didn't see a reason to steal anymore and didn't feel like doing it.</p>",
 "year": "2002",
 "id": "16736",
 "gender": "Male",
 "timestamp": "2008-04-11T07:00:00.000Z",
 "views": "5921",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
