{
 "id": 16745,
 "title": "Very Light, Pleasant Buzz",
 "date": {
  "submission": "2010-01-21T08:00:00.000Z",
  "experience": "1984"
 },
 "author": {
  "name": "BrianB",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Poppies - California",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>I first tried it when I was already stoned, and didn't notice anything.",
  "The next time was a quiet morning, home alone.  After breakfast I rolled a fat joint of dried california poppy leaves and sat at the dining room with a cup of coffee.  Lighting up, I first noticed that the smoke was very harsh, akin to marijuana leaves that haven't been sufficiently dried.  I kept the smoke down, and by the time my coffee was done so was the joint. I felt a very light, pleasant buzz, quite similar to a single hit of some Columbian weed.  Not enough to be disorienting, just a warm, pleasant feeling that was somehow energizing at the same time.  I walked down to the park with Smith The Dog and watched him roll in the mud.  After about half an hour I felt the buzz going away. I decided to smoke some more when we got back to the house.  I dried it a bit more in the oven first, which got rid of most of the harshness.  I smoked two more joints, but never got off again.  Bewildered, I gave up and went to work.",
  "The next day I tried some more, and got the same warm, pleasant buzz for half an hour or so.  Another joint that afternoon did nothing for me though.  A few days later I tried another joint, sharing it with a friend before a party.  I told him about it's odd effect of only working once a day, and he seemed to think it was strange as well.  Shortly after arriving we smoked a bowl of some mediocre marijuana.  Knowing this smoke from prior experience, we were both surprised to find that we got higher than normal, and that the buzz from the pot lasted much longer than we would normally expect.",
  "Since then I've verified the 'once per day' experience, as well as the augmentation of the effects of marijuana.  It's a nice thing to have around.</p>"
 ],
 "erowid": {
  "id": "53510",
  "citation": " BrianB. \"Very Light, Pleasant Buzz: experience with Poppies - California (ID 53510)\". Erowid.org. Jan 21, 2010. erowid.org/exp/53510",
  "substance": "Poppies - California",
  "views": "7154"
 }
}
