{
 "id": 16740,
 "title": "Smack, Bup n Mysteries",
 "date": {
  "submission": "2010-10-10T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ratherhomicide",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 mg",
   "administration": "",
   "substance": "Pharms - Buprenorphine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": ""
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": ""
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": ""
  }
 ],
 "report": [
  "[Erowid Note: The doses of heroin described here are considered extremely high, see Heroin Dose Chart]",
  "I am addicted to Heroin since 2002. Now, I am in buprenorphine substituion program for about a year. My daily dosage is 8mg.",
  "Situation 1. : I get up at 10:00. Crush 4mg Subutex (Buprenorphine tabs) with cards, make a fat line and snort it. It takes about 20-50mins till I start to feel the effects.",
  "My mood lifts slowly. I watch MTV and as time goes by I enjoy watching it more & more.",
  "At 14:00 a friend arrives with 5g of some real good Heroin. We make 1g lines (each) snort them, and I light a cigarette. By the time I finish my cigarette I feel the effects of the Heroin about 70% (because of the Subutex). 14:30 we take another gram each. I wait 10 mins, and my face is already itching and I'm scratching myself like every junkie does when hes high on smack.",
  "We chill for about 40 mins and share the last gram. 15 mins later I'm fucked up, my cigarette falls from my hand, and my eyes are closing. I feel like in a cosiest blanket in the world. If I have enough heroin, it wins over the bup and I can get wasted like I wanted to.",
  "Now Situation 2: I wake up at 10:00. A friends come to my place and brings 5g of heroin and some 3g of some good peruvian coke. We chill, mix speedballs, snort about 2g Smack & 1g coke. We are high as hell. Cant stop chatting, cant stop smoking cigs. We play poker. We do anything. Anything we do is just great fun. With the time we snort everything away. At 16:00 we beep a dealer, he arrives with another 5g of horse and 2g of the same great coke. So we chill, get high, smoke some weed, havin a blast. Time goes by. Its already 22:00 in the evening. All the drugs are gone, and I'm too high on coke. I need something to calm down so I go sleep soon. I smoke weed, but it dont really help. I dunno what to do. Then I remember I still got Subutex.",
  "I crush 4mg and snort it. I also take 2 Alprazolam pills. Within an hour I start feeling relaxed and calm. Then I take hit from my bong, watch a porno, jerk off, take another bong hit and am ready for bed.",
  "Once I snorted 1/2g heroin, and 30 mins later I snorted 2mg buprenorphine and nothing special happened."
 ],
 "erowid": {
  "id": "53497",
  "citation": " Ratherhomicide. \"Smack, Bup n Mysteries: experience with Buprenorphine (Subutex), Heroin, Cocaine, Cannabis & Alprazolam (Xanax) (ID 53497)\". Erowid.org. Oct 10, 2010. erowid.org/exp/53497",
  "substance": "Buprenorphine (Subutex), Heroin, Cocaine, Cannabis & Alprazolam (Xanax)",
  "views": "12898"
 }
}
