{
 "id": 16741,
 "title": "How Do I Get Back",
 "date": {
  "submission": "2008-02-11T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Still Learning",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 10x"
  }
 ],
 "report": [
  "I have no mental illness and no one in my family has ever been diagnosed with such.  Salvia is the only hallucinogen I have ever tried.  A couple of weeks ago I had a particularly enlightening experience with Sal that has basically continued to last until now.  Even as I write this I am still effected, not in a bad way, but I am very confused.  Let me explain why.  To understand where I am today I think I must take you back to the previous trip, which was a couple of days before. ",
  "I packed a generous bowl and took my two standard hits which consistently takes me deep into a level 5 experience usually lasting 10 to 20 minutes.  I use a Coleman refillable butane lighter with a flexable head which is great when using a pipe.  Something different happened shortly after this trip started.  I went straight to the land of quantum physics but without any real experience I was back!  I was 'compelled' to smoke more and although I felt I was under the influence of Sal for sure I was able to pack some more and prepare myself for another hit.  I adjusted the head on my Coleman, pulled the lever that starts the familiar gas hissing sound then pushed the lighting trigger with my thumb.  Click... nothing.  Click.... nothing.  This thing never fails to light, but I absolutely could not make it work.  My rational mind began to take charge of the situation that Sal had me in and said that maybe the flame was there but that I was just not seeing it.  I tested this theory by trying to light a paper towel... nothing.  The lighter simply did not work.  Ok, I got another lighter and fired up... no problem.  I remember the trip and it is hard to remember at the same time.  Nothing remarkable comes to mind anyways. ",
  "I remember dreaming vividly that night, though I don't remember about what.  The next day I distinctly remember having lunch with a friend and being able to put my finger on why I felt so funny.  If my eyes were small glass windows, I felt as if I had taken a step back.  Now I was watching 'myself' from a position that was just ever so slightly askew of normal.  I felt a slight but certainly noticeable detachment from what was going on.  I tried to understand this feeling and how I could be carrying on a conversation with my friend and the conversation with myself at the same time!  I knew is was the Salvia causing the experience and reasoned that the lasting effects were due to the 2X dose the night before.",
  "The next day a friend and I lit up again.  This experience has already been reported (See http://www.erowid.org/experiences/exp.php?ID=53391).  I originally thought this trip was the origination of my insights which were strangely very religious in nature.  I don't need to go into that again here but it is important to note that this process of remembering information that deep down I already knew has gone on for two weeks now.  It ebbs and flows.  Sometimes information comes on so hard I have to sit down.  Other times it comes like vapor.",
  "The first was written off as a product of the extra Salvia I smoked on Friday night in conjunction with the trip on Sunday but I week two wore on I began to wonder.  I came to the experience reports to see if there were other similar experiences but couldn't seem to find a match but I did get the strangest idea.  I noticed in several reports that when people were first coming back they seemed to be in their world again but it wasn't quite right.  A TV didn't work or something that was just a little off.  One report that gripped my mind was that one guy came back to a world where fire did not work. At first I sort of laughed but hours later my mind drifted back to this one report and I thought of my own Coleman lighter and how it had suddenly stopped working in the middle of my trip.",
  "I went straight to the kitchen to examine the lighter closer.  I had assumed it was out of butane.  It was 2/3's full.  It seemed to be working fine.  You could hear the gas hissing.  It was making a good spark but it still would not light.  I got the extra butane and topped it off hoping it was a pressure issue but this did no good either.  I told myself it was a mechanical thing and there was a good explanation for why it would not work but I couldn't shake the feeling I had.  Every day that has passed I have tried to mentally quantify how I felt.  I still have the detached feeling but I have to be still and quiet now to notice it.  It is still there I just think I have grown used to it. ",
  "The strangest sensation is that I feel like I am dreaming.  This is hard to explain but I feel as though I could and should wake up at any moment.  Now that it has been two weeks I am starting to get a little paranoid I suppose.  This trip should be over.  No Salvia trip lasts two weeks... right?  Now I am asking the questions that test my sanity.  Am I back!?  Am I still sitting there, pipe in hand spilling ashes in my lap, and THIS IS THE TRIP?!  Am I going to snap back into my bedroom any second now and go WOW that was really cool?  Is this why my trusty lighter doesn't work here, because I am still in Salvia world?  No, none of this makes sense, of course I am here, I can tell reality from 'savality'. ",
  "My mind grapples with the possiblites.  Could I really be back but my conciousness linked back up maybe a fraction of a degree off so I am not really back where I should be precisely?  I could just be letting my imagination get the best of me but I am sure that I am not imagining the information overload and the high powered, electric, brighter than Las Vegas, sharper and more vivid than technicolor dreaming I have been doing either. ",
  "I had a particularly disturbing dream a couple of nights ago.  It was pure Salvia.  I was in bed, arm around my wife with her head on my chest.  Just as I dosed off (note not deep in normal dream sleep) I encountered a blackness like none I had ever seen and bright white, like electric and hot white, light roughly in the shape of a square or rectangle and at a bit of an angle.  It seemed to be at some distance from me.  I heard voices to my upper right.  They were very clear but the only thing I can remember they said were about 'him' and 'upstairs'.  The him seemed to refer to me.  There seemed to be cold 'entities' going by in front of me.  When one would go by it left me cold...like a chill when someone from outside walks by you in a warm room.  I became very uncomfortable and I think I was scared.  I began to move and I am not sure that maybe I was even fighting something!  I was definitely struggling for some reason.",
  "At this point I was telling myself that I was probably scaring my wife with all my thrashing about but I was not in control of the situation.  Then I realized that I was indeed very much in Salvia world in this dream and I could tell that my arms were waving madly and I was rocking back and forth.  I began to notice something however, when I moved my left arm I could feel it move through my wife!  When I rolled to the left I could feel my body roll into hers!  I was able to tell myself this was some sort of Salvia dream.  Then just as suddenly I awoke with a start!  I had not move on inch.  My wife was still sound asleep and she wakes very easily.  I only included this dream in the report because it was very different, disturbing and seems to be important, at least to me so maybe it will have some significance to others while attempting to work through their own experience.",
  "I suppose this is an ongoing report.  For me it is not over yet and maybe never will be.  Maybe this is a tale of divine knowledge being bestowed or maybe it is a cautionary tale about how Salvia can fuck you up.  Keep in mind that I am not complaining about any of this.  I would not trade this experience for any amount of money.  I mean this.  What has happened has been inspirational and beyond anything I have ever seen or done in my life.  I am just trying to better understand though something keeps telling me that there is no point in it.",
  "One more thing.  We can't know everything there is to know as long as we are attached to this world by our body and senses but we can not cheat the system.  The system does not allow one to take his or her own life to get 'there'.  This seems to trigger some sort of default 'culling' process.  I am sorry, I can't help but let these stray thoughts come out without realizing it and though it doesn't exactly belong here I will leave it because it is part of the ongoing experience."
 ],
 "erowid": {
  "id": "53502",
  "citation": " Still Learning. \"How Do I Get Back: experience with Salvia divinorum (10x extract) (ID 53502)\". Erowid.org. Feb 11, 2008. erowid.org/exp/53502",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2711"
 }
}
