{
 "title": "Kitty Heaven",
 "author": "Projekt Skunkjar",
 "citation": " Projekt Skunkjar. \"Kitty Heaven: experience with Catnip, Ginger & Cannabis (ID 16754)\". Erowid.org. Feb 24, 2007. erowid.org/exp/16754",
 "substance": "Catnip, Ginger & Cannabis",
 "bodyweight": "145 lb",
 "report": [
  "<p>Made tea from 7 1.5' catnip flowers, 1 Tsp ful of ground ginger,",
  "1 Tsp fresh clover honey.  Here is the report.",
  "T+ 5 min: Tastes like real strong mint tea.  I like it.",
  "T+ 12: Smoke 1 cig (aprox 1 gm) catnip flower, tastes a lot like the tea, quite minty and tasty! Aprox 1/2 done with Joint, I feel more relaxed.  Could this really be working??!!",
  "T+ 20: About 1/2 tea left, heavy menthol flavor.  Not at all trippy, but certainly slows mental processes.  I did smoke aprox 2 gm of Beasters (commercial, Cansdian hydro buds) throughout the day, unsure if this is like a rebuzz, or something wholly different.",
  "T+ 40: Still not baseline, Try More tea, only stronger.",
  "T+ 1.10: Just finished second cup of tea, no ginger this time.  Again I used the same amount of catnip, but I boiled it instead of steeping it, to the same effect.  Time seems to go a bit faster, whilst remaining very relaxed.  The real strong flavor in the first cup was the ginger, which had seemingly no effect other than flavor.",
  "T+ 2.20: Smoke 3 more hits of Beasters, reach expected high.  About to smoke another J of catnip (deseeded this time).  Joint adds another dimension to my stone.  Taste of catnip is much more pallatable w/o seeds!",
  "Overall, there is a nice but very mild sedative/depressant effect to catnip.</p>"
 ],
 "year": "2002",
 "id": "16754",
 "gender": "Male",
 "views": "9954",
 "dose": [
  {
   "time": "0",
   "amount": "7 flowers",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Ginger",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:12",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(flowers)"
  },
  {
   "time": " T+ 0:40",
   "amount": "7 flowers",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  },
  {
   "time": " T+ 2:20",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 2:20",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(flowers)"
  }
 ],
 "submissionDate": "2007-02-24T08:00:00.000Z"
}
