{
 "title": "A Wild Dance with Foxy",
 "author": "White Rabbit",
 "citation": " White Rabbit. \"A Wild Dance with Foxy: experience with 5-MeO-DiPT & MDMA (ID 1675)\". Erowid.org. Sep 16, 2000. erowid.org/exp/1675",
 "substance": "5-MeO-DiPT & MDMA",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "5-MeO-DiPT",
   "(powder / crystals)",
   "",
   " ",
   "oral",
   "MDMA",
   ""
  ]
 ],
 "report": "<p>We were all hanging out in the amazingly jungle setting of agua azul, chiappas mexico. A friend of mine was throwing a wonderful outdoor party, big speakers and intense trancy music. I met this guy, who we both realized are connected to the same cool person, who had sent this guy down to the conference with the 5-MeO-DiPT. so I dove into it with the same naivite I always do. in the beautiful jungle setting, after about 20 min, I felt very relaxed, I sat down and looked for visuals, and there they were, very slight but there and very tryptamine like.</p><p>After a while I felt my body filling up with more tense energy and realized I must move. As I stood up to dance, another friend of mine offered me some mdma, yeh. spent the rest of the night dancing like a mad man, and every once and a while snorting more MDMA to keep it all going nicely. At one point I had totally lost all control of my dancing, it was wild, almost violent in nature, I felt possesed by some intense african dance spirit, I opened my eyes and realized everyone had made space for me and my chaotic limbs, so I settled down and took more MDMAsat on the grass and talked to friends abbout the experience.</p><p>This is definetly worth trying in conjuction with MDMA, and if yer into it at some crazy trance party or something. Me personally, I need to try it again to figure out what the buzz was all abbout, but nothing I or anyone else would not somehow find enjoyment within its realms.  Nice one chemists, keep up the good work!</p><p>p.s I would maybe not recommend taking with certain physical ailments or damages, during the time of this trip I had just acquired staph inffection, and realized I could intensly feel the bug working its way inward an every infection point, very intense and weirdly painful, good thing for the mdma to keep my mind off the infection.  All's good now, pez y amore, good trippin folks!</p>",
 "year": "2000",
 "id": "1675",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-16T07:00:00.000Z",
 "views": "8848"
}
