{
 "id": 16770,
 "title": "Coming Down Can be a Bitch",
 "date": {
  "submission": "2009-06-19T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Vincent Vega",
  "gender": "Male",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 mg",
   "administration": "insufflated",
   "substance": "Hydromorphone",
   "form": "ground/crushed"
  },
  {
   "time": "0:45",
   "amount": "8 mg",
   "administration": "oral",
   "substance": "Hydromorphone",
   "form": "pill/tablet"
  },
  {
   "time": "4:15",
   "amount": "20 mg",
   "substance": "Amphetamines"
  }
 ],
 "report": [
  "This was my second experience with hydromorphone, it was enjoyable until it was time to come down, that sucked until I took some speed (Aderall).",
  "5:00pm - Snorted 2mg hydromorphone. Small effects, felt nice for awhile.",
  "5:45pm - Swallowed the other 4 tablets(2mg each).",
  "6:15pm - I felt very significant effects, sort of euphoric, but then again not really. It was a very plesant buzz though.",
  "7:30pm - Fell asleep for maybe an hour.",
  "8:30pm - Still feel a strong buzz, I was starting to come down, but I still felt good.",
  "9:15pm - Starting to really feel the full effects of coming down, everything I say is too loud, any noise (there is alot of noise in my house, 6 kids) I feel like telling my whole family to shut the fuck up. They want to know what's wrong with me, so I tell my mom I'm niccin (need a cigarette). So she drops me off at a gas station. I see a few of my friends there. I tell them how bad I'm crashing so he sells me a 20mg Aderall. After about 10 minutes within consumption, I start to feel much better. I find some dude to buy me cigarettes, I then get picked up. I go home and feel sooo much better from the Aderall, smoke a few cigarettes, then go on the computer.",
  "11:00pm - I feel energized, yet very relaxed. I listen to music for what seemed like hours, in fact it was hours. Just sitting there listening to music, I felt so wonderful.",
  "1:00am - I still do not feel tired in least, keep listening to music.",
  "2:00am - Start getting bored with music, so I download 'That 70's Show', and smoke another cigarette.",
  "2:30am - Watch the show, didn't find it funny like I usually do, so I put my music back on.",
  "3:30am - Decide I really should try to get some sleep, so I go to bed.",
  "5:00am - wake up, if you could say that, I wasn't really asleep. Just half asleep laying there. So I get up, and go back to my computer.",
  "5:30am - Try to go back to bed. Lay there for what seems like hours, until I finally dose into a daze. I must have finally fallen asleep, because I woke up at about 10:00am, not feeling tired.",
  "That's about it. Overall I enjoyed hydromorphone, until I came down, then it sucked. I really enjoyed speed, I just wish I hadn't taken it so late :)"
 ],
 "erowid": {
  "id": "53601",
  "citation": " Vincent Vega. \"Coming Down Can be a Bitch: experience with Hydromorphone (Dilaudid) & Amphetamines (Adderall) (ID 53601)\". Erowid.org. Jun 19, 2009. erowid.org/exp/53601",
  "substance": "Hydromorphone (Dilaudid) & Amphetamines (Adderall)",
  "views": "23738"
 }
}
