{
 "title": "Double Dose Leads to Emergency Room",
 "author": "Major Bliss",
 "citation": " Major Bliss. \"Double Dose Leads to Emergency Room: experience with H.B. Woodrose (ID 16788)\". Erowid.org. Aug 13, 2002. erowid.org/exp/16788",
 "substance": "H.B. Woodrose",
 "bodyweight": "144 lb",
 "report": "<p>Double dose of what normally produces a pretty positive experience proves to end up an EXTREMELY NEGATIVE experience.  The psychological uneasiness and anxiety was so intense that I felt the need to call 911.  When I did I said, 'I really don't want to waste an ambulance but I feel very bad.  The 911 operator decided to forward me to the poison control center, but when there was nothing but an automated voice there, he went ahead and sent an ambulance.  When the ambulance arrived I told the paramedics that I was experiencing extreme anxiety that I couldn't control, and that I felt I needed observation through the night.  (The LSA-Ethanol was taken at night.) I remained on my side in the ambulance, as any other position seemed to make me feel worse.  It was the same when I was being checked in to the emergency room by a lady who wanted me to sit on a chair while I answered her questions, but I remained on my side on the floor by her.</p><p>Before I called 911 I tried to get myself to throw up but couldn't.  When I asked the paramedics if I should try to make myself throw up, they advised against it, and all the doctors I saw at the hospital advised the same.  Given the time I told them I ingested the stuff, they figured the psychoactive substance was no longer in my stomach and therefore vomiting wouldn't help.  Once on a bed in an observation room I continued to stay on my side, which seemed to reduce the suffering slightly.</p><p>The doctors were in no hurry to make my suffering stop.  Apparently they wanted me to learn a good lesson via the suffering.  Also, evidently all the blood-pressure and pulse readings they took showed me at a fairly normal level, so they didn't see the need to administer something to me immediately.  Regardless of my physical readings, I was in hell, mentally and physically.</p><p>Felt like I was dying.  Somehow a bad thought took root in me, and expanded to the point that it enveloped my entire mental and physical being, like a single fungal spore growing to the point of a lethal reaction.  Since the doctors were in no hurry to help me, I felt compelled to go against their advice and try to force myself to throw up in front of them.  They told me it wouldn't help because the stuff was no longer in my stomach, but I said maybe it could psychosomatically help me vomit up the bad thought.  I stuck my finger in my throat and made some hideous noises as I tried to force the vomiting, and the doctors jumped back, possibly wondering if I would vomit up some ghoul, some living demon that was in my stomach.</p><p>Nothing came up.  I told them if learning my lesson was the issue, that Ive learned it and that I would post this experience on the internet so people would know what is possible when taking this stuff.  Finally one of the doctors said he would give me something to settle my stomach.  They took so much time to administer that to me, or so it seemed to me in my torment, that I again tried to force myself to throw up, sticking my finger farther down my throat than I ever have in my life, and making some noises Ive never heard myself make.  This time I got some junk to come out and I did feel a bit better, so I did it again, and got more to come up, again feeling a bit better.  The violent act of vomiting does help expel bad thoughts.  One doctor said that one reason they advise against sticking your finger in your throat is that you can harm your throat, and as far as I was sticking my finger down my throat, I could see what he meant.  My throat was sore from it for quite a while.</p><p>Shortly after the vomiting, I was injected in the ass with atavan, which helped me mellow out.  Their policy is not to completely knock you out so that you suffer some to learn a lesson.  After a few hours they thought I was stable enough to go home.</p><p>I said 'Are you sure you aren't sending me home too soon?' as I was still feeling kind of shaky altogether, and I felt comfortable in that hospital bed, but they felt I was well enough, so they called me a cab, I got in it, remained on my side, still feeling a bit dizzy as the cabby made his twists and turns.  When I got home I slept it off.</p><p>At the worse points of the suffering I prayed to any true God to alleviate my suffering.  One message I got was to help myself as much as I could, to utilize the 'God within' as much as I could, and then whatever 'God without' would help, so I tried to use my will to think as positively as I could.  That's largely what this whole ordeal was about, a negative thought budding to the point of a panic attack.  One feels that one can give oneself a heart attack simply by allowing the wrong thought to take hold.  One can get so sensitive on a psychoactive substance, which one can actually worry about being worried, causing a vicious circle.</p><p>I'm thankful for ambulances, hospitals and doctors, and last but far from least, the almighty finger and the vomit reflex!</p>",
 "year": "2002",
 "id": "16788",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-13T07:00:00.000Z",
 "views": "38778",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(liquid)"
  }
 }
}
