{
 "title": "A Visit to the Green Fairy",
 "author": "TheNeuralchemist",
 "citation": " TheNeuralchemist. \"A Visit to the Green Fairy: experience with Absinthe (ID 16793)\". Erowid.org. Aug 15, 2005. erowid.org/exp/16793",
 "substance": "Absinthe",
 "bodyweight": "160 lb",
 "report": "<p>Ive been interested by the infamous ambrosia Absinthe for some time now. So, I decided to make some. I researched a recipe for the drink and took a month of my time to prepare it.</p><p>First I took wormwood, star anise/anise seed, hyssop, Calamus, angelica root, fennel seed, coriander, and some lemon balm and put it in a two-quart glass jar. Then I poured just under a litre (905 ml) of 95% ethanol (brand name Everclear) into the jar. I let this macerate for about two weeks, shaking every two or three days.</p><p>While this was taking place I constructed a crude still out of a two-litre Pyrex flask, copper tubing, a bucket, a jar and a shit load of ice.</p><p>Two days before the two weeks were up, I added 700 ml of purified water to the substance and mixed it well. Then waited for the day it was done. (I say purified because my tap water is shit.)</p><p>I distilled this substance on my stove. (VERY dangerous. I do not recommended you try this at home. A leak someone in the crude still could cause a nice explosion or fire.) It took about three hours to yield about a litre of a clear, liquorice-scented liquid. The remaining liquid in the flask was a dark brown colour and was EXTREMELY vile.</p><p>I then put the distillate into a glass jar and added more wormwood, some mint, more lemon balm, liquorice root, and lemon peel. I let that sit about another week.</p><p>Then it was done. I strained off the botanicals and bottled. (Of course, I live in a location where distillation of small quantities is legal  of course.) It was definitely absinthe. And I definitely was not drunk. It turned white with water and sugar like it should.</p><p>At first the intoxication was merely a drunk without the stupor. Though lights were a bit more distinct. Then I mixed it with some cannabis (of course, thats legal where I live, too  of course) and the experience became all the more psychedelic. More of a mental aspect, but all the more interesting.</p><p>Over all, it was a great experience.</p>",
 "year": "2002",
 "id": "16793",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-15T07:00:00.000Z",
 "views": "15075",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 oz",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
