{
 "id": 16807,
 "title": "Trans-DiMensional Tea",
 "date": {
  "submission": "2001-02-25T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "shaman2323114",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "rootbark"
  },
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Harmala Alkaloids",
   "form": "seeds"
  },
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I just thought you friends might like to hear about my recent dream.",
  "For the second time in my life I feel I have really reached my highest aspirations as a psychonaut. Under the supervision of the the Mimosa goddess and her close ally Peganum, My soul was lifted to new heights. Within 5 minutes of dream onset, I was rolling on the floor in a transcendental psychic state. All of my unconcious thoughts from the last month came rushing at me, It seemed as if I were thinking ten thoughts at once. All thoughts were interrelated and organized as if to provide a maximum learning experiance. I stayed within this state for nearly three and a half hours. Most of the thoughts were very personal and related to my present life condition. But for a period of about 1 hour during the most vivid part of the dream, my thoughts expanded to a planetary level, I felt as a part of mother earth, a child of nature. But the guilt was overwhelming as the true reality of our planet came to me. We are worthless as humans. Our whole world was given to us and we were given the secrets to live in harmony with nature. And what do we do with it, spray chemtrails, cut down trees, make chemicals, hunt and kill the animals.",
  "I felt an empathy that I can not describe, I began to sob and feel horrible for the things I do, drive a car, buying packaged/synthetic products, use electricity that isn't solar or wind powered. The guilt was immense, I felt as if I was jesus dying on the cross for the sins of humanity. Then finally after an eternity of hell, and remorse I returned to my 'self-conciousness' and could start to understand what had happened. What I figure is that I had uplink to a sort of collective concious, using my nervous system and spirit as a dimensional anntenae. I connected to the sumation of many peoples feelings all at once, I think that many people feel this way and this caused my experiance to be shaped.",
  "Even though it was an uncomfortable learning experiance, I feel better now as I have realeased an enormous load of mental stress, and held back emotion. Another main component of the experiance was a felt influence of brainwashing upon everyone I know. The TV and institutional propaganda has had way too much influence upon the human race, the elite are using subliminal/hypnotic audio and visual imagery to control the mind of man, and every day these things just grow stronger. The mind of man must free itselfs at any cost and the time we have seems to be running out.I honestly think that DMT is persecuted and supressed because it poses a threat to those who seek to control. An enlightened mind is a powerful thing and best of all it can only be used for good purposes. One only reaches the state of true understanding once he has morals in place."
 ],
 "erowid": {
  "id": "5370",
  "citation": " shaman2323114. \"Trans-DiMensional Tea: experience with Mimosa hostilis & Peganum harmala (ID 5370)\". Erowid.org. Feb 25, 2001. erowid.org/exp/5370",
  "substance": "Mimosa hostilis & Peganum harmala",
  "views": "22120"
 }
}
