{
 "title": "My Leg Still Hurts",
 "author": "Morrolan",
 "citation": " Morrolan. \"My Leg Still Hurts: experience with Morning Glory (ID 16808)\". Erowid.org. Aug 11, 2005. erowid.org/exp/16808",
 "substance": "Morning Glory",
 "bodyweight": "285 lb",
 "report": "<p>I'd never tried hallucinogens before, although I'd always been curious about 'expanding my mind' etc. Weed is the only drug I've ever done. About a month ago, I discovered that Morning Glory seeds contain a hallucinogenic compound, and, seeing as they are legal to buy and easy to procure, I decided to give them a try.</p><p>Last Saturday I went down to my local store and bought every pack of Heavenly Blues they had (7). I called a friend over and we decided that we'd split the packs between us. I washed all of the seeds thoroughly with dish soap and water, scrubbing them well to remove any fungicides or other nasty coatings that may have been applied, divided the seeds into two portions, and we ate them. Three and a half packs of seeds isn't very many. They aren't too hard to chew and they taste kind of like raw sunflower seeds. Easy. It was 1:30AM.</p><p>We sat back and listed to Rush '2112' and then some Led Zepplin, but by the time the CDs finished all we felt was anxiety. Around 3AM, I noticed that my pupils were completely dilated, which was really cool, and that I seemed to have a HUGE amount of energy. This was pretty fun. I wanted to get up and dance or something (very unusual for me). My friend was feeling the same way. We were both really anxious for the walls to start melting or something; we KNEW it was gonna be a great trip.</p><p>WRONG!!! By 4AM we were both feeling sick. My friend fell asleep (I think...) and I put on some Palestrina, turned off the lights, and lit some incense sticks. The glowing tips of the incense turned into orange spiders, and I felt spiders crawling all over my body. The smoke from the incense turned into a purple spaceship, and the music gave me a calm, spiritual feeling. I knew I was tripping, and it would have been enjoyable, except for the increasing pain in my stomach. Around 4:30, I got my friend to go outside with me, because he was moaning and I didn't want him to vomit on my couch. He complained of excruciating leg pain on the way out. I threw up a little bit (no seeds, just some orange juice), went back inside, and laid down on the floor. My mind was spinning and I felt like I had a really bad case of the flu and was delirious. My friend came in, laid down on the couch, and made squeaking noises (he said it made him feel better). I came out of my spinning stupor at around 5AM, and felt great and really energetic again. I laid back and watched some patterns on my ceiling, noticed that my legs were getting longer and shorter, and enjoyed myself for about 10 minutes. Then I noticed that I couldn't lay in one position for more than 3 seconds, was sweating profusely, and had trouble breathing. And my stomach still hurt. At some point, after much tossing and turning, I fell asleep.</p><p>When I woke up around 3PM, my friend had already gone home. I felt normal again, except for a bad pain in the back of my right leg. I'm writing this nearly a week later, and it still hurts like someone whacked me with a baseball bat, although there are no external marks. I don't think I'll ever try MG again.</p>",
 "year": "2002",
 "id": "16808",
 "gender": "Male",
 "timestamp": "2005-08-11T07:00:00.000Z",
 "views": "7613",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.25 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 }
}
