{
 "id": 16801,
 "title": "Positive After-Effects",
 "date": {
  "submission": "2001-02-27T08:00:00.000Z",
  "experience": "1987-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Falcotron",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Since there are so many negative posts, I thought a positive statement from someone who's been using X for 14 years might be useful.",
  "At my peak (in 1987), I was using 2-6 times/month. For a long period during the 90s, I took X only once/year or so. As long as I'm not taking it twice in the same week, the frequency doesn't seem to matter much.",
  "I do not get second-day depression. In fact, if I can get a full night's sleep, I wake up the next day with my mood significantly elevated. If I can't, I generally have a bad next day, but once I get a good night's sleep the elevation begins then. A few times this has reached hypomanic levels (but than I am bipolar), but usually it's just a warm 'up' feeling.",
  "Along with the elevated mood, I'm sometimes a little more empathic than usual. For example, one time I introduced my girlfriend at the time (of about three months) to X, and over the next week we were much more open with and tolerant of each other. (And of course even after the feeling had faded, it left a positive effect on our relationship.) Another example: a friend of nearly a decade recently took X for the first time (with me), and three days later we were able to resolve-some long-standard problems that we'd never been able to discuss before (and still find it hard to discuss now).",
  "These after-effects tend to gradually fade out over about 4-8 days. (And taking X again during that period doesn't seem to extend them at all, although I haven't tested that too much.)",
  "The only real negative (other than insomnia on the night I take it and minor problems related to smoking too much while I'm on X) is that X can interfere with the 'creative' after-effects of some other drugs. After taking certain drugs  (2C-B, Ketamine, etc.), I wake up the next day with a feeling of increased creativity, and my work on music, fiction, and even computer software is definitely enhanced. X seems to block this effect most of the time.",
  "I nearly always eat a full meal before going to bed (as well as drinking plenty of water, taking vitamins, etc.), and this may be important. I have generally not taken 5-HTP, l-tryptophan, or other 'specialty' supplements (except for DMAE, which is for combatting problems with staying up until 5am or noon or whatever rather than problems with X).",
  "Responding to Jonas: From watching friends who _do_ have hangovers, I don't think it has anything to do with purity. The differences in trips and hangovers is probably completely psychosomatic.",
  "On the other hand, according to one friend, pure MDMA causes him a hangover, but MDMA combined with MDA or MDE (as little as 10%) does not. So searching for 'purity' may actually be counter-productive."
 ],
 "erowid": {
  "id": "5369",
  "citation": " Falcotron. \"Positive After-Effects: experience with Ecstasy (ID 5369)\". Erowid.org. Feb 27, 2001. erowid.org/exp/5369",
  "substance": "Ecstasy",
  "views": "7323"
 }
}
