{
 "title": "Dying Inside",
 "author": "Jadegate",
 "citation": " Jadegate. \"Dying Inside: experience with Salvia divinorum (ID 1681)\". Erowid.org. Jul 18, 2001. erowid.org/exp/1681",
 "substance": "Salvia divinorum",
 "bodyweight": "98 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "report": "<p>\nI had the unusually good luck to try salvia in a self-controlled and rather safe environment, with someone I respect and trust, who is somewhat experienced. I have no history of mental illness of any kind, and have tentatively experimented with small doses of LSD and slighlty larger doses of mushrooms, spaced out well over time. I have rarely used any form of psychedelic in a crowd or party situation, with the exception of Marijuana, and have tried to limit my trips to some form of usefulness for my own growth or knowledge. Call me a nerd!</p><p>I smoked and began drawing in my sketchpad, and fairly soon had a feeling of intense vertigo. I have never really had visual 'trips' on any psychedelic, and this was fairly strange for me-as i sat drawing, i began to see my sketch finish itself. It became more and more difficult to keep up with it, until I was struggling to draw at all. I sat back and closed my eyes and began to hear what sounded like my own voice, saying 'I'm going to die, I don't want to die...' in a tone almost like a mantra. Upon opening my eyes I found that my friend had not turned to look, and that I still heard myself saying this, though I wasn't speaking aloud. It was more intensely real than a thought, it had a weight on the air that comes only from a voice close at hand. I closed my eyes again and tried not to panic, thinking (I clearly remember) 'I'll only die if I get scared.' I was soon hearing myself screaming at top volume, hurting my eardrums, as if in pain. I sounded like I was being ripped apart!</p><p>I have been in intensely painful and life-threatening situations before, but never anything that would elicit such a terrifying response. I couldn't feel any pain, but I expected to at any moment. My physical being becaame alert, my hair stood up all over my arms in goosebumps, my mouth went dry.  The sound smoothly changed into a chorus of my voice(s), screaming and gibbering, talking, almopst like I was hearing every word I've ever spoken all at once, played back, with my anguished screams as a counterpoint over and above it all. It's hard to convey the density or tone of this noise. It was literally hellish. Not at all like a smooth river of white noise, or a highpitched tone, which I have heard from others is common with some entheogens. About as far from this concept as you can get, actually. TERROR.</p><p>I began an emotional, internal argument that frightened me. I'm not in the habit of 'talking to myself' much...finally realizing that my death was inevitable. I began to feel physically cold, shaking and chattering my teeth. I kept my eyes closed, but was aware that my friend was now looking at me, making sure I was okay. This, though vaguely comforting, began to make me self-concsious. I tried to remain still but couldn't fight the shakes. My body's functions, almost like during my meditations, came surging to the forefront. I was inside my heartbeat, feeling the structure and texture of my vital organs pulsing and moving.</p><p>I focused on my heartbeat as a safe sensation, and found I could control it at will, to my perception. I became ecstatic, and opened my eyes. The light was extremely bright, almost painful, as if I had forgotten completely where my awareness usually was, i.e., in my head somewhere behind my eyes and between my ears. I felt my consciousness radiating through my body, and yet I wasn't able at the moment(though I tried) to remember my name, or where I was, or my friend's name. My friend smiled at me and turned back to his own sketchpad. This lack of care comforted me more than his watchful eye. I lay on my side and felt the whole room shift, like a lens had just come into focus. I was exceedingly tired, almost as if I had exerted myself physically. My muscles ached and I couldn't stand up...I felt ungainly and tall. I said ' Maybe I'll go to the zoo...after I sleep' and fell asleep for about three hours afterward. When I woke up, there were no noticeable aftereffects. I would say that the physical effects of my experience were very minmal, I sat still and (so I was told) made no noise except deep breathing during my trip.</p><p>I didn't feel that the initial panic soured my experience. Actually, at the time that I tried Salvia, I had recently been behaving in a rather careless way with my own safety (driving high, too much coffee, smokin!</p><p>g a pack and a half a day, living in an abusive relationship) and I feel that the physical scare, the VERY real fear of a VERY real death, not just frightened ego spasms, but the reawaking to my body's safety, was exactly what I most needed at the time.</p><p>The after effects on other levels have been immense. I have curtailed my excessive partying, I've become more focused on my art and my spiritual growth as interrelated forces in my life, and I've left some bad situations behind. My meditative practices (15 minutes a day of sitting pranayama) have surged forward, my ability to maintain focus on my work has increased, and I'm in love again with a much healthier human being...that I'm not ready to pursue yet.</p><p>I hope to try Salvia agin in about six months, and see again if she can offer me exactly what I need.</p>",
 "year": "2000",
 "id": "1681",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-07-18T07:00:00.000Z",
 "views": "6204"
}
