{
 "title": "Picture This",
 "author": "Lobo",
 "citation": " Lobo. \"Picture This: experience with Mushrooms (ID 16810)\". Erowid.org. Jun 29, 2005. erowid.org/exp/16810",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "0.125 oz",
  "oral",
  "Mushrooms",
  "(plant material)"
 ],
 "report": "<p>Picture this:</p><p>It was a warm, not hot, but warm and sunny summer afternoon in a little suburban area neighborhood as Forrest Woods.  I had eaten a pretty thick dinner and in about ten minutes, I took a short trip to some nearby condominiums,  Anxiously, I stood there...waiting...waiting...but finally!  The white American sedan rears its tattered head from over the hill, and my friend, Ben sharply pulls into a parking spot.  The few buddies and I quickly crowd around the car, anticipating Ben to roll down his window to show us his bounty.  Within moments, I remember, I was fondling a beautiful ounce of dried mushrooms, neatly separated into eighths and quarters.  As the sacks began to disappear at a rather alarming rate, I found myself about half finished with the eighth that I had purchased only minutes ago. </p><p>The company was, as my friend would put it, crucial.  This was key to what was about to happen next.  As four friends and I began to pull out of the Monroe complex, the driver, Alan, almost totally smeared a redneck biker on the road with his bigass Tahoe. We laughed a lot about how we almost killed the bastard (that was mean) and how he was totally pissed as hell!  Next thing I know, we were being chased.  The intense, slowly growing body high began to kick in at about this moment.  The redneck biker, with his Harley, his tattoos, and menacing look chased us all the way to another city because we figured wed see how dedicated this motherfucker was.  By the time the guy disappeared, everyones body high was enormous.  The thumping, forceful, excitement made my head swim with every turn in the large American SUV, and I frequently felt like I was stepping on foam instead of ground when I was walking.  Id sorta fall through.   Additionally, I became more curious and daring.  In other words, I wouldnt be apprehensive about exploring with this drug.  Id feel like I was kinda #1.  </p><p>Once the psychological trip began to follow the warm, comforting body high, we were looking for a cool place to chill.  This was now an hour later from when I ingested my shrooms, dipped in chocolate.  In a few moments, we located a beautiful little abandoned field behind a church not too far from the center of the Vestavia community.  Stepping out of the car was AWESOME!!!  I had never tripped this hard before, so this was a little unusual.  Let me explain.  I looked at the sun in the 5 oclock deep blue summer sky and found it totally amazing that it hovered among the thousands of shimmering lights that would appear every time I closed my eyes.  Speaking of closed eye visuals, I noticed later that each time I closed my eyes and stared, my imagination would immediately translate into a cartoon on the inside of my eyelids.  Pretty cool, huh? </p><p>Okay, so approaching the quaint spot of the greenest grass, I noticed the black concrete below mewaving like a gentle ocean.  I stared for a few minutes.  At this time, I would like to mention that, at this point, I had not done any other drugs since I took the mushrooms, which is pretty irregular of me.  I did not even have the craving to smoke, and ultimately, I did not do anything in addition to my shrooms.  I rested, leaning with my two arms on the grassy meadow and observing a graffiti wall, many trees, but most importantly, the sky!  For approximately two and a half hours, we were enveloped by the sky.  The clouds made amazing patterns, real and moving people, dangerous tunnels (which sucked me in), and the ground, it never stopped rocking back and forth.  When I beneath the sky, I surely saw some astronauts connecting to a space capsule in the thick green trees directly in front of me. </p><p>As the clouds began to dissipate, we felt like becoming a little more active.  Granted, the overall shroom experience isto put it shortlysimply a burst of knowledge.  Nevertheless, enlightenment and tremendous thought release may be accompanied by some serious physical action.  SomethingI dont know whatsorta jumped into me, and I said to my friends, Im gonna run and fall.  I ran, like a drunk bastard (which I really wasnt), and dovefucking hammeredinto the moderately hard grassy ground.  Naturally, I felt no pain, but we all still laugh about it every now and then.  So, my buddy Alan decided to maneuver his Tahoe into the little knoll.  Soon, I found myself going in circles at about fifteen miles an hour, standing on the rear bumper of a black Chevy.  This was such a thrill; to put it bluntly, exhilarating.  I felt the cool evening wind blowing through each one of my hairs, as though they were sensitive fingers.  On the car ride, with the windows down and my face out most of the time, I took a moment to reflect on the serious trip so far.  I had thought about some of the most esoteric and, I would even say, erudite matters!  I pondered and totally expanded my mind, allowing for thoughts to fester and then sink into my brain.  We all said some very observant and generally funny phrases. We were philosophical!</p><p>We ended up at another beautiful area known as The Point.  The Point overlooked the Over the Mountain area of Bellowham, and that night, it was definitely the place to be.  My mushroom trip made the skys scarlet and dark purple colors blend to form a wonderful backdrop for the incessantly sparkling stars in the distance.  I floated in the sky, as I thought about jumping from star to star.  All five of us began throwing around glow sticks, which surely helped cease our incredible six-hour trip.</p><p>I know why they call it a trip now.  Its not because you fall over your shoelaces, but because youre mentally absent, like on a trip, when you ingest mushrooms.  You are transported into a whole new dimensionmaybe even the fifth?  My stomach hurt me only slightly, a little while after eating the shrooms, but I never noticed it throughout my trip.  I guess it stopped.  All in all, this was a perfect time to spend a lazy Sunday afternoon and evening.  I love mushrooms, and most importantly, I suffered zero hangover-type effects the next day.  Sometimes, however, I felt like I wasnt tripping anymore, but then another wave of Psylocibin would cycle through my veins.  And the trip would remind me of its lurking presence.</p><p>The perfection of the whole experience mainly stemmed from the combination of the five people who tripped.  I would rather selectively pick out a rather small group of people with whom Id like to trip.  I wouldnt confine myself to friends or certain close people; instead, I just think, With whom would it be fun with to do this right about NOW?  Moreover, I would make sure that everyone in your group is tripping.  As with my case, the people who tripped with me were all different in their unique ways, but we all got along and were nice to each other.  Each of us had our quirky moments and whacky ideas, but the camaraderie prevailed, and we were very loose, yet friendly during the trip.  This was vital to decreasing the stress that sometimes punishes the mushrooms potency.  All in all, mushrooms rock, and everyone should try them, but try to do it right!</p>",
 "year": "2002",
 "id": "16810",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-29T07:00:00.000Z",
 "views": "3114",
 "dose": {}
}
