{
 "id": 16826,
 "title": "Nothing Matters Anymore",
 "date": {
  "submission": "2008-12-05T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DestroyedMatter",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Methadone",
   "form": "pill / tablet"
  },
  {
   "time": "2:00",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "ground / crushed"
  },
  {
   "time": "2:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "4:30",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "ground / crushed"
  }
 ],
 "report": [
  "I have a been using for over a good 4 years now, and have many experiments with various types of drugs. However Ive always considers myself a huge fan of opiates, and always got very excited whenever I could get my hands on them. I have tried codiene, tramadol, hydrocodone, darvocet, morphine, methadone, oxycodone, and fentanyl. Out of all the highs Ive tried oxycodone would have to be my all time favorite. To me there is no better high, and feeling of when my body feels so warm and completely relaxed to the point were thats all I can think about, and without a doubt it would have to be my drug of choice. I live for that feeling of itchiness and nodding off in and out of consiousness.",
  "A few weeks ago I obtained 4, 40mg oxycontin pills, then traded 1 of those for four 10mg methadone pills. I had worked up a somewhat decent tolerence over a few days on at 40mg of oxycodone a night, and 10mg methadone. So last night I started with 2 10mg methadose pills around 7pm or so.",
  "Around 9pm I started to feel the full effects of them kicking in, heaviness body type high, with slight euphoria, I never seem to get too much euphoria out of methadone, but what I liked about it was that it lasted forever and some people say 20mg will last 24 hours. So after that dose that got me going, I decided to snort half of that oxycontin pill, and thats when the itchy warm fuzzy feeling that I love so much kicked in.",
  "About 30min later a few of friends came over and smoked a joint with me, never really considered my self a stoner type person but when mixed with opiates have always known to give it quite a kick/push in the high. They left a little after 11:30 or so and thats when I decided to snort the other 20mg left remaining. After that is probably the most strongest nod off and itchy opiate high Ive ever had, I just layed around my whole body felt like one giant puff ball and I had no idea what pain and sorrow felt like, the only thing that was on my mind was how nothing mattered to me anymore. I popped in my opiate cd mix that I made for times like these with acoustic songs and some trance type songs with heavy bass lines, and again just layed around and felt complete happiness about my life at the time.",
  "I continued to nod off for about 5 hours or so, whenever Im on opiates I tend to stay up for the high and make sure I dont pass out, just and old habbit I have I guess. At one point I did start to feel a little neseaus, so I just made a few peanut butter sandwiches to help with the stomach feelings, and when I finally woke up, I had a few scratch marks on my legs and back.",
  "But other than those minor side effects I enjoyed the high like no other experience Ive ever had. And as I said before I live for that nod off felling on opiates. I myself have never had a complete steady source for opiate, I just have my binges when I get ahold of lots every now and then like times like these. If I did, I could most deffinetly see myself being a straight up addict, so I guess its a good thing that I cant always get them. But none the less opiates will always be a part of my life, and I will always have a love for them. Like William S. Burroughs once said 'There is no such thing as an ex-junkie.' That state of mind will always live with me no matter what."
 ],
 "erowid": {
  "id": "53773",
  "citation": " DestroyedMatter. \"Nothing Matters Anymore: experience with Methadone, Oxycodone & Cannabis (ID 53773)\". Erowid.org. Dec 5, 2008. erowid.org/exp/53773",
  "substance": "Methadone, Oxycodone & Cannabis",
  "views": "17959"
 }
}
