{
 "id": 16833,
 "title": "Part of a T-Shirt, Two Different People",
 "date": {
  "submission": "2008-12-06T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Firstimetripperj",
  "gender": "Male",
  "weight": "60 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "<p>I thought I should write a report as without reading other reports, I would probably have not bought Salvia and certainly not known what to expect at all. I'm 15 and me and two friends had been researching it vaguely on and off for about three months. Finally though, on a trip to London, we decided to buy some from Camden.",
  "A few days later we went to an empty field to try it in daylight. We were all in a great mood, but had smoked the normal salvia leaves to little affect a few hours earlier. All I had got was a come-down feeling (monging) that I get at the end of being stoned. My friends had said the same. We sat there and my first friend G took the first 5x bong. His eyes glazed over when he exhaled a big hit and then he laid back and babbled high pitched nonsense. He came out of it saying he had been in a factory surrounded by millions of neverending lines of workers, like a cross between The Wall dvd and Willy Wonka.",
  "His good trip made me feel comfortable with doing the extract. I packed myself a big bowl and ripped it easily. As soon as I exhaled it everything goes very vague. I just remember realising I was part of my friend's t-shirt and I tried to arrange everyone in a pattern, but apparently I was babbling about going home and I got up and tried to leave. Nobody realised I was tripping until near the end, not even me. To me, this t-shirt world seemed like the only reality, and I didn't even known I was on salvia.",
  "A week later we sat down with the rest of the extract and I had another big bong. I was about to pack another one when I got a feeling I recognized. It's this kind of pushing feeling on the inside of my head. I knew I was about to trip and so I put down the bong. I stood up and announced I was tripping, unlike the last experience. I then got into a discussion about the trip which got me angry, not externally abusive, just in my head. I realised that I was completely unreasonable to be angry and suddenly realised I had unlocked a different person in me on salvia. Then it occured to me that the two trees next to me were making me do this and that they had faces and were looking at me. When I looked at them directly though, their faces dissapeard.",
  "I felt very happy after both the trips, possibly due to salvia's apparent anti-depressant qualities.",
  "Because my visuals were not strong, it just completley fucked my sense of reality, I am going to try 10x in the hope I can go to this hyperspace/dreamscape people talk about. It's my first hallucinogen and it's shown me that reality can be completely shattered.</p>"
 ],
 "erowid": {
  "id": "53798",
  "citation": " Firstimetripperj. \"Part of a T-Shirt, Two Different People: experience with Salvia divinorum (5x extract) (ID 53798)\". Erowid.org. Dec 6, 2008. erowid.org/exp/53798",
  "substance": "Salvia divinorum (5x extract)",
  "views": "3617"
 }
}
