{
 "id": 16830,
 "title": "Amazingly Spiritual",
 "date": {
  "submission": "2007-05-01T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Absinthe750mL",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pregabalin"
  },
  {
   "time": "0",
   "amount": "T+ 0:20",
   "administration": "150 mg",
   "substance": "oral"
  },
  {
   "time": "Pharms - Pregabalin",
   "amount": "",
   "administration": "T+ 0:00",
   "substance": "0.75 cups"
  }
 ],
 "report": [
  "T: 0  200mg Lyrica (Pregabalin)",
  "T : 20  150mg Lyrica",
  "T : 2:00  1 cup of Coleus tea",
  "Weight  130lbs",
  "I managed to get a hold of some Lyrica, (pain reliever, among other things) and upon research found that it had somewhat psychoactive properties like many pain relievers. The fact that it was not an opiate intrigued me because it would be an entirely different experience from the usual analgesic highs.",
  "I initially took 200mg (4 50mg pills) and waited 20 minutes until I got discouraged and took 3 more pills. About an hour passed before I noticed anything. I was definitely feeling dissociated, vision was minutely blurred, my mind was clouded, and I felt very lazy. There was a definite sense of contentment and well being, but it is sorta indefinable considering it was not an opiate, nor was the sensation anywhere near that of an opiate. It was almost like DXM or DPH, but differentunique.",
  "Everything had a sway a sort of subliminal and natural groove, walking was impaired by swaying and fluid staggering, with exaggerated movements. Everything seemed closer than it really was, going around corners had a staggering effect similar to alcohol.",
  "Music was mildly enhanced, especially mellow music like The Postal Service. Listening to this band gave my mind the feeling that it was being aired out and cleanse.  Trees and clouds transcended their mundane shapes and became sharper, bolder images.",
  "With the Lyrica high beginning to recede, I picked about  to 1 cup of fresh coleus leaves and shredded them, putting them into a coffee mug. I boiled some water and poured it into the cup to soak up the plant material. Even as I type this the tea is steeping, and though the Lyrica is waning, it still has a profound impact upon my typing, confusing me and I am practically having to retype every word at least 3 times to get them right.",
  "I know drinking the coleus brew will not result in any high, but it will be an excellent dream enhancer. I have tried this before with positive results ( though not as strong or amazing as the dreams induced by passionflower).",
  "----------",
  "It has been a couple days since that night here I am to finish my report. The Lyrica was not coming down at all at that time, quite the opposite. It persisted in repeated waves. I even experienced one hallucination, a picture of some family make up the background on my computer. This picture hypnotized me, the faces seemed to take on life as if they would say something at any moment. What is more, is that sections of color in the picture separated from the picture and began to quiver and shake and pulse.",
  "Eventually I was lulled into a deep sleep. The coleus dreams were nothing short of mesmerizing! The dreams I remember best was being in an Edgar Allen Poe poem, residing in the very creative energy that made it, fighting a Windigo!, and getting my dog high. Most of the dreams I could not remember due to how deep the sleep was and how unbelievably abstract they were.",
  "The next morning I woke with some difficulty to find that I was still very much under the effects of the Lyrica! Walking, cognizance, speaking, were all impaired. I kept thinking people were talking to me, but when I asked What? (my voice, by the way, was incontrollable, the volume and the syllables and my tone were exaggerated) they would tell me that they didnt say anything. This lasted most of the day, ending soon after waking from a very deep afternoon nap (which I am sure was induced by the Lyrica).",
  "In short, the Lyrica was amazing, spiritual in a way I have found opiates to be lacking. I highly recommend it."
 ],
 "erowid": {
  "id": "53791",
  "citation": " Absinthe750mL. \"Amazingly Spiritual: experience with Pregabalin & Coleus (ID 53791)\". Erowid.org. May 1, 2007. erowid.org/exp/53791",
  "substance": "Pregabalin & Coleus",
  "views": "55029"
 }
}
