{
 "title": "Homemade San Pedro Alchohol Extraction",
 "author": "Muad'Dib",
 "citation": " Muad'Dib. \"Homemade San Pedro Alchohol Extraction: experience with Mescaline from San Pedro (ID 16840)\". Erowid.org. Aug 17, 2002. erowid.org/exp/16840",
 "substance": "Mescaline from San Pedro",
 "bodyweight": "187 lb",
 "report": "<p>I followed the recipe found in Psychedelic Shamanism by Jim DeKorne for this extraction.  About 16 inches of San Pedro 3 1/2 inches in diameter was reduced to 113grams of powder and extracted with vodka over the next couple of months.  I had the extract in this tarry form for a year and a half and only last night did I decide to eat it. I had heard that peyote found in ancient burial chambers was still active today, so I figured the mescaline would not degrade.  Perhaps I was wrong...</p><p>10:10pm- Ingested .25 of the extract</p><p>10:30pm- Ingested .25 of the extract (possible effects already being felt</p><p>10:45pm- Ingested .25 of the extract</p><p>11:00pm- Ingested the rest of the extract, slowly growing stronger</p><p>11:30pm- Slowly growing stronger, drinking water</p><p>11:45pm- NO NAUSEA SO FAR!!  Slight jaw clenching</p><p>12:03am- Going for a walk</p><p>12:55am- Got back from walk</p><p>1:14am- I feel pretty trippy, but can still hold it together to talk to someone, drank some juice</p><p>1:30am- went to sleep, still fazing in and out, got up a couple of times to pee</p><p>7:48am- Woke up, I feel pretty 'normal'</p><p> So Mescalito was gentle with me and I am extremely grateful that I experienced NO nausea the whole time.  The trip was mild and peaceful...I felt really loving.  It is hard to say how hard I was tripping, at times it felt like a full dose of LSD, and other times it was harder to tell if it was placebo.  I guess if I was tripping very hard I should not have been able to sleep (it is a psychedelic amphetamine), but I think perhaps my own psychology overpowered the effects of the drug.  I used to trip out hard, but then again I did not know myself like I do now.  Spiritually I feel very at balance, there are not many parts of my everyday psyche that are unexplored.  Last night I was thinking that 'ok, this progress needs to be stepped up to the next level of internal silence'...</p><p>One other thing that should be noted is an aphrodesiac effect, as I was in my room going to sleep I was seriously considering seducing my housemate who was hanging out in the living room.  I had been thinking about doing this in the previous days, but I feel like the mescaline gave me a confidence that would be bound to say yes if I asked in the correct way.  I ended up deciding this would be a bad move for me and if I was going to make it I should do so when completely sober.</p>",
 "year": "2002",
 "id": "16840",
 "gender": "Male",
 "timestamp": "2002-08-17T07:00:00.000Z",
 "views": "18705",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "28 g",
   "administration": "oral",
   "substance": "Cacti",
   "form": "(plant material)"
  },
  "1": {
   "time": " T+ 0:15",
   "amount": "28 g",
   "administration": "oral",
   "substance": "Cacti",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 0:30",
   "amount": "28 g",
   "administration": "oral",
   "substance": "Cacti",
   "form": "(plant material)"
  },
  "3": {
   "time": " T+ 0:45",
   "amount": "28 g",
   "administration": "oral",
   "substance": "Cacti",
   "form": "(plant material)"
  }
 }
}
