{
 "id": 16842,
 "title": "Interesting Sleep Aid",
 "date": {
  "submission": "2006-06-16T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Joe",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.3 g",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  }
 ],
 "report": [
  "I have experimented with Valerian root several times my only complaint is that I have to take so very much it often causes me to have an acid reflux reaction otherwise I would up the dose. I found it to have a pleasant side effect which sparked an interest in dream research. It was years ago that I had tried it and since then I have lost some weight and seem to have less of a likeliness of acid reflux occurrence. Last night I tried it again and had a mild effect not as strong as before. I believe it may be a chemical that can build up in the blood stream. So I will stick to the same dose and consistently try over a few days.",
  "The symptom is like others have described I get the intended restful sleep as a bonus though vivid dreams. In the morning I start to wake an hour or so before I get out of bed naturally always have. However with the Valerian I can distinctly remember a dream Im having and close my eyes starting where I left off. I can even remember the dream and think of interesting scenarios managing to go right back into the same dream and experience the envisioned scenario. I seem to be half awake and half asleep however lucid and aware of my surroundings. My wife asked me where her car keys were for example and I suggested where she might find them after going through last nights steps after arriving home. All the while having my dream on pause, I then closed my eyes and went right back into the dream.",
  "In the past I have experimented with combinations of Melatonin, Kava, Ginko-Biloba, I tend to get up in the middle of the night with a sweet tooth having a large bowl of ice-cream It seem to be that a large calorie / carbohydrate intake on an empty stomach such as this may increase the effect though Im not sure why.",
  "I think it could simply be that on the occasion of the midnight snack and taking the Valerian at that time might mean that the blood level of the drug my be higher approximately 6 hours later when awakening."
 ],
 "erowid": {
  "id": "53846",
  "citation": " Joe. \"Interesting Sleep Aid: experience with Valerian (ID 53846)\". Erowid.org. Jun 16, 2006. erowid.org/exp/53846",
  "substance": "Valerian",
  "views": "43651"
 }
}
