{
 "id": 1684,
 "title": "Bad Idea, But A Lot Learned",
 "date": {
  "submission": "2001-03-05T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Peachez",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  }
 ],
 "report": [
  "I was not at all an experienced drug user. It was my freshman year in high school and I had been smoking weed for approximately 2 years and I drank, but that's as far as my drug use went. Well, I had been wanting to try harder and better things for a while and then my friend gave me 2 geltabs (I cannot recall what kind, but someone I know who has tripped over 120 times told me it was very strong!). Well, it was after school and I was alone so I decided not to take it.",
  "The next day in school I realized I still had the 2 tabs on me. I was really bored and it was right after 2nd period, 10 am. I told my druggie friend what I had and she told me to take it. I thought it sounded like a good idea since I figured she could take care of me if something went really wrong, and I was really bored. Well, I popped both in my mouth. Not much later, I started feeling crazy and out of control. Everything looked really funny. They took me to the locker room in the gym and I sat there and started bugging out. They knew it was a bad idea for me to go to class, so I just sat there. I started seeing all sorts of crazy things, even though none of it was there. I was really scared and I realized I was fucked up badly. The teacher came in to yell that we couldn't just sit there, we had to go to class. I saw monkeys dancing around and a dog on the floor.",
  "My friends realized that if an official saw me they would know I was fucked up. They tried to take me out of the locker room but I was too busy crying that the dog couldn't come with us. They picked me up and dragged me out of there. They decided to bring me to lunch where I could sit and relax. But the walls in my school were really curvy and there are like a million turns. I kept feeling as though the walls were going to get me and hit me. Then I finally got to the stairs and they totally bugged me out. I refused to walk and began to crawl up the stairs. Then they heard the dean start to come to scream for us to get out of the hallways and into class. They knew they couldn't have the dean see me crawling up the stairs so they brought me to the bathroom. I started bugging out in there.",
  "They decided to bring me to my bio lab class and I could sit there because the teacher already knew me and my friends were druggies, so we knew he wouldn't care. I sat at my table just staring at it, thinking there were all sorts of colors even though it was white. The teacher just ignored me. Then I got real hot and went to the window. I was so hot I stuck my whole body out the window and almost fell out. Then the dean came into my class and said they had to speak to me. I was so scared. I left the room and said I wanted my friend that was with me in class to come with me. So they said she could come. They brought me to the bathroom and started questioning why I looked so funny. I said I had been sick and vomited and also had an asthma attack. They said ok, they were going to go get the nurse and to stay there.",
  "Now, I wasn't really seing crazy things as much, but I was so scared and nervous and paranoid they would figure out what was wrong. My friend kept trying to calm me down but I just started crying and couldn't stop. Then the nurse and the dean came back and they were like, what's the matter, are you okay? Why are you shaking so much? I said I just didn't feel well and that after my asthma attacks I start to shake because I get myself so worked up and scared, and that I would be fine and I wanted to go back to class. They said no and took me downstairs. They said my friend had to go to class, though. I really didn't want her to leave and started crying again. They took me to the office and made me call my mom.",
  "I told her I just hadn't felt well and I would be fine and she was like, you want me to come pick you up and bring you to the doctor? I was like nooo, because I knew a doctor would figure it out. Well, to make this very long story end, they let me go and suggested to my mom that I get drug tested. After that I was fine and felt better the rest of the day. I learned a lot from that day. I put myself in a bad situation. You should not do something where there is a chance you can get in trouble around a lot of officials and school is not a place for drugs.",
  "If you want to try something or do drugs, don't do them in school. Also, I should have learned more about the drug and the effects and I should have been more prepared for what could happen. I have since done acid again many times and have now done many other drugs as well. I have never again had a bad trip or any other experiences or problems like that and have never come so close to being caught again. That was the worst experience of my life and it taught me a lot of life lessons. It prepared me really well for the drugs I have done since then."
 ],
 "erowid": {
  "id": "1534",
  "citation": " Peachez. \"Bad Idea, But A Lot Learned: experience with LSD (ID 1534)\". Erowid.org. Mar 5, 2001. erowid.org/exp/1534",
  "substance": "LSD",
  "views": "6780"
 }
}
