{
 "id": 16849,
 "title": "A Double Reality",
 "date": {
  "submission": "2008-12-08T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "LadyFirestorm",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "It was the end of March, 2006.  About a week and a half before the one-year anniversary of my first time smoking cannibis.  I hadn't smoked in about a week and a half, because of being sick, but I finally felt a little better and my friend invited me out to smoke a bowl with him before class.",
  "All I could think of as I walked to meet him was getting as high as I could off this little bit, because I was eager to start smoking again.  I met my friend at about 10:30 AM in a cemetary on campus, where we usually met to smoke.  I didn't expect much, having been smoking weed of similar quality as what we smoked that day for months now.  After we smoked, it took a few minutes for the high to set in, while we walked out of the cemetary, each of us lighting a cigarette.  I felt a typical high as we parted and I walked back to get my books for the day.  I was very relaxed, kind of distant from reality.  I made it back to my room fine, and after grabbing my books I walked to one of the dining halls for a quick lunch before class.",
  "By the time I got inside, I started viewing things in frames.  By the time I sat down to eat, my memories of getting and paying for my lunch were like snapshots my mind took, and all I could remember seeing was the stack of trays where I grabbed one, the salad bar, and the woman who was working the register that day.  Even now, that's all I can remember of lunch.  I thought it a little odd, only having experienced vision like that with much larger amounts of weed.  But I was in a good place by then, and didn't really care that much, so I ate my lunch and left for class.",
  "This part of the day I remember in vivid detail, though it still amazes me how it happened.  I had made the walk from the dining hall to my first class enough times, I knew how long it took.  The walk to the building was about 13-15 minutes, and then it took another two or three minutes to get to the classroom.  I started the walk with about 18-20 minutes before class, just enough time to get there if I walked at my normal pace.  Of course, my normal pace was only normal when I wasn't as completely high as I was that morning, but the worry of being late to class barely registered as I turned my mp3 player on while walking outside.  I lit another cigarette once outside and started walking to class.",
  "I usually favor trance-based music when I'm high, because it always seems to make the time pass that much more enjoyably.  I put on one specific song to listen to the entire way to class, and turned the volume up.  About 10 feet into my walk, I started having these crazy hallucinations.  It was almost like there was this sphere surrounding me, and it moved with me as I walked.  Images based on the music were projected onto the surface of this sphere, and I could barely see reality past it.  The images weren't even very fluid now that I think about it, but they were at the time.  I was amazed at this, as it was the first time I had ever seen any kind of visuals while high, especially during the day.  The part that really amazes me, is that somehow, even though I know I was walking slower than normal to pay more attention to the halluciantions, and the fact that my schedule that day was slightly different and I was going to a different class than normal, I made it to class with 4 or 5 minutes to spare.",
  "To this day, I have never had a similar experience, even with the other drugs I've tried since.  I have never seen any kind of visuals during the daytime, nor have I ever been able to achieve the same level of 'highness' as I did that day.  I believe that there was something going on with the virus in my system at the time. I was on week three of recovering from a pretty bad case of mono. I would give anything to reach that intensity again, short of having mono."
 ],
 "erowid": {
  "id": "53877",
  "citation": " LadyFirestorm. \"A Double Reality: experience with Cannabis (ID 53877)\". Erowid.org. Dec 8, 2008. erowid.org/exp/53877",
  "substance": "Cannabis",
  "views": "4057"
 }
}
