{
 "title": "Buzz of the Bumblebee",
 "author": "Zaphod",
 "citation": " Zaphod. \"Buzz of the Bumblebee: experience with Nitrous Oxide (ID 16859)\". Erowid.org. Apr 10, 2008. erowid.org/exp/16859",
 "substance": "Nitrous Oxide",
 "bodyweight": "190 lb",
 "report": "<p>On 8/16/02 I conducted an experiment with nitrous oxide (NO2) using two ISI whippets and a soda syphon, one ready to go after the other. I taped myself with a video camera to quantify the experience.</p><p>After the first breath there were no effects.  As I drew the second breath, a gentle intoxication washed through my body: a gentle buzz. The following four breaths gradually took me into a state of deep intoxication.  My body, particularly my head, felt heavy and dense. I felt all the signs of alcohol intoxication, perhaps on the order of about 5 beers, but instead of having a smooth, fluid characteristic, the blanket of intoxication was jittery.</p><p>It felt like my head was buzzing -- not the buzz of a mosquito but the slow buzz of a bumblebee: slow and ominous, the intoxication literally buzzing me.  I felt that in the microseconds between each beat of the buzz I was normal, myself; but on top of this was overlaid the giddy buzz of NO2 intoxication. Perhaps a close analogy is getting drunk, then pressing your face against the case of a household fan and feeling the vibration wash through your head.  I then realized that this was the proverbial helicopter sound that NO2 users talk about. It was absolutely not a sound of any kind, but a sensation, certainly one that can be imagined.  It was what dominated the entire experience.</p><p>Time became fractal and slightly distorted.  A musical commercial I was hearing on television seemed to go on and on in an endless loop, seeming to last nearly 45 seconds.  I was darn well aware that the commercial wasn't that long, and I felt tickled by this revelation and laughed.  I decided to do an experiment: count to ten.  Judging by the clock (after the fact), this took 15 seconds. It was me who was becoming slow this time!  NO2 does not change the apparent flow of time but confuses it.  The second time I tried this, at a slightly lower level of intoxication, I got the estimate right.  I was able to get up and move around, with the same sort of dissociation that I feel on alcohol: I command my body and it responds clumsily, carrying me around.</p><p>The effects started wearing off 30 seconds after my last ingest of NO2.  I crossed the halfway point 15 seconds later, and was about 10% intoxicated after another 15 seconds.  Talk about a rapid descent into reality!  A very slight, pleasant lightheadedness, accompanied by tinnitus, continued for the next hour.</p><p>The 'helicopter sound/feeling' effect is quite interesting.  I speculate that since it is cyclic in nature, there could be some sort of link to the brain's beta wave cycle.  Knowing something about audio acoustics, this jitter felt to me to be on the order of 15-20 Hz.  This matches quite well with the cycle of the brain's beta waves, which show a frequency of 14+ Hz and are the ones that are dominant when we are awake. I wonder if the brain loses its ability to act as a 'rectifier' for whatever this wave cycle drives, and the smooth flow of sensory signals we normally experience turns into a choppy stream of data.  Maybe we are blacking out each time the wave cycle crosses the zero line!  Who knows?</p>",
 "year": "2002",
 "id": "16859",
 "gender": "Male",
 "timestamp": "2008-04-10T07:00:00.000Z",
 "views": "7075",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ]
}
