{
 "id": 16851,
 "title": "Fuzzy Oblivion",
 "date": {
  "submission": "2010-12-30T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Bleh",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "Pharms - Carisoprodol",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:45",
   "amount": "350 mg",
   "administration": "insufflated",
   "substance": "Pharms - Carisoprodol",
   "form": "(ground / crushed)"
  },
  {
   "time": "1:30",
   "amount": "175 mg",
   "administration": "oral",
   "substance": "Pharms - Carisoprodol",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:30",
   "amount": "2 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "2:30",
   "amount": "1/4 tablet",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "My best friend recently returned from Costa Rica and, being the considerate person that he is, brought me gifts of oxycodone, soma (carisoprodol), Cuban cigars, cigarettes, and coffee. This report is only about the first twooxycodone and carisoprodol. According to my friend, pharmacies are like bars in Costa Rica. You order from a menu (drug dictionary) and purchase by the pill.",
  "If Id been in Costa Rica, I would have bought a whole beautiful spectrum of drugs. But my friend, being poor and pressed for time, settled for two oxycodone pills of unknown potency and seven 350mg somas. After he got back, I spent the night at his house, and we indulged in the goods.",
  "T + 0:00",
  "We each took two somas (totaling 700mg for each of us). They looked about the same size as other somas Ive taken, but they had a weird neon-yellow coating. I was suspicious, but I took them anyway.",
  "T + 0:25",
  "Typical soma relaxation there were very few mental effects, except perhaps a slight mood lift. But my body felt relaxed and comfortable, and there were some pleasant tingly sensations in my limbs. I could sit in any position and feel totally comfortable.",
  "T + 0:45",
  "The somas peaked, and we were both liquidassuming the shape of our containers (in this case, chairs). We werent sedated, but we were totally relaxed. My friend put in Austin Powers, and we watched it with blank smiles on our faces. We crushed up two pills, and took one (350mg) each: a small booster dose to prolong the effects.",
  "T + 1:30",
  "We split the seventh and final pill. The effects are subtle as ever, but pleasant. To wash down the pills, we took a couple huge swigs of rum. Immediately, our relaxation was magnified. Soma and alcohol is a great combination. The euphoria is stronger than either of the two alone.",
  "T + 2:30-3:30",
  "We tested the oxys carefully, starting with the assumption that they were 80mg. Beginning with snorting small bumps and working our way up, we found half a pill to be more than enough for both of us. That probably means that the pills are either 40mg or 80mg. The opiate + soma + alcohol combination is divine, but you can imagine how it would be dangerous. Its a lot of downers to ingest in one night.",
  "Anyway, I slept on the (hard) floor that night, but it felt like I was sleeping on a cloud. The combined effects soma, oxy, and alcohol put me in a dreamy, content state. There was a bit of that waking dream effect that I sometimes get with opiates. Mostly, though, it was like falling into fuzzy oblivion.",
  "All in all, a good time was had by all."
 ],
 "erowid": {
  "id": "53882",
  "citation": " Bleh. \"Fuzzy Oblivion: experience with Oxycodone, Carisoprodol & Alcohol (ID 53882)\". Erowid.org. Dec 30, 2010. erowid.org/exp/53882",
  "substance": "Oxycodone, Carisoprodol & Alcohol",
  "views": "9088"
 }
}
