{
 "title": "Black Tar - White Time in Texas",
 "author": "Jon",
 "citation": " Jon. \"Black Tar - White Time in Texas: experience with Heroin, Prison, Etc (ID 16866)\". Erowid.org. Aug 17, 2002. erowid.org/exp/16866",
 "substance": "Heroin, Prison, Etc",
 "bodyweight": "",
 "report": "<p> I've been to prison 5 times, in November 2001 I made parole again. In 1990 I received a Life sentence and waited til 2001 to finally gain my freedom once more. All my crimes have been drug related, either petty thefts of some type to get money to buy drugs or, as in this last trip down, possession and/or delivery.</p><p> During high school at the age of 13 or 14 I got into the experimental stages of drug use. Smoking a little weed, trying acid (LSD), ate a few uppers and downers.</p><p>I didn't know anything about the effects of drugs on my thinking then, or the long term consequences to be seen in the future.</p><p>  Today, after over 30 years of crime and addiction, a lengthy inner struggle with the habitual abuse of heroin and 5 trips to prison, I better understand how much this has cost me.</p><p>  I have been asked about the context of the circumstances surrounding the beginnings of my involvement with using heroin. Peer pressure, above all other things in my life, was the most influential. For me and I believe for a large number of the people who begin to use drugs, at any age, the desire to want to fit in with a group of our peers plays a major role in making harmful decisions.</p><p>    It took a long time and a lot of pain for me to realize I have a problem and that I needed some help overcoming this problem. Twelve Step programs AA, NA, CA, or whichever applies to the person. There are also many programs sponsored by churches, State agencies, and/or non-profit organizations that offer treatment of one kind or another.</p><p>    I'll tell you a secret, once you stop using and begin to see that there are thousands and thousands of others who have the same types of problems you have and who want to help each other, you'll feel better than you ever have in your life.</p><p>    You have to take the first step before the fun will start, back up</p><p>look at your life stop denying that a problem exists, seek out some help. Things will get better sooner than you imagine ...</p><p>     Til next time I close with this... Once I knew I had a problem my 'high' was never the same...        Jon</p>",
 "year": "",
 "id": "16866",
 "gender": "Male",
 "timestamp": "2002-08-17T07:00:00.000Z",
 "views": "45688",
 "dose": []
}
