{
 "id": 1686,
 "title": "Revelations in Wonderland",
 "date": {
  "submission": "2002-07-11T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MW",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "Me and a good friend of mine discovered the vaults of erowid while researching a school project and decided we were ready to try mushrooms (among other things). We traveled to a city a few hours away from our small town and prepared for the trip by bringing money, a vehicle and meeting up with a friend who could buy us the mushrooms, stay sober to drive us around, and provide us with a place to stay. We bought an ounce of dried mushrooms, I ate 4 grams, and my friend ate 3 grams. We ate them straight and both didnt mind the taste (my friend said they just tasted like stale ice cream cones). We ingested at about 10pm while driving some back roads in a forest a few minutes from town. We decided to drive back to town while we waited for the mushrooms to kick in. About 30-40min later we were driving through the city and I felt a little upset because I could notice no effects, i thought the mushrooms were too weak or I didnt take enough. A few seconds later i felt my hands (which were resting on my lap) sink through my legs. I looked up and saw a green traffic light which seemed 10x brighter than normal, it was not glaring, it was soft and inviting. I felt like I could hardly move. I looked back at my friend in the back seat, he was looking out the window laughing. His eyes were wide and he looked like a child seeing things for the first time. That observation set the theme for the rest of my trip. I began seeing things for the first time, in many different ways.",
  "Our driver wanted to eat so we went to Boston Pizza, I didnt think I could walk but felt no difficulty in doing so. We found a booth and sat down, I began feeling a bit sick but was fine as soon as i rested against the table. I looked around and saw many electric signs on the walls and many neon lights, I waited for the crazy hallucinations that I expected but instead, after closing my eyes for a few seconds all the colours changed into earthy pastel colours, deep purple and pink were prominent. Everything had a purplish halo around it. I couldnt stop moving my legs (quickly tapping my feet as if I were listening to music, but i had no rhythm or pattern). The background noises began to mesh together, people seemed to talk very rapidly, I couldnt pick out any words and soon all i heard was synthetic type noises, like cheap computer effects: 'bloop' 'bleep' 'blop' 'doodle-ooo' etc. I felt nervous, I thought everyone knew I was high and I wanted to hear what they were saying because I knew they were talking about me. I asked some of my driver's friends who had joined us at the booth, if I looked messed up? They assured me I looked fine and were astounded I was even feeling high because I looked bored.",
  "I asked my friend how he was feeling and he said he was fucked and that we probably shouldnt be in public. I looked back to table, it seemed gigantic, I looked up to the people sitting around the table and was amazed. Their faces seemed so symmetrical and smooth, their were no imperfections. I looked at the square rimmed glasses on one of their faces and was amazed at how perfect the edges were, the light reflecting of the blue rims from the overhead neon lights intrigued me. I felt the overwhelming urge to share this sight, i wanted to paint what i saw, I immediately started thinking of famous paintings i had seen, I thought that this must be what the artists were trying to share with us, this perfection.",
  "Then a glass of water was placed in front of me, I marveled at its perfect edges, and symmetrical straw, I was infatuated with the point that the straw met the water. I stared at it for a long time. I started to try and define the quality I seen in all these things, the only word I could come up with was 'self contained', the word doesnt make sense to me now, but it did at the time. I took a small sip of the water, as I was unsure how to drink, and I couldnt remember how to swallow. The water going down my throat felt indescribable, I immediately related to the scene in the movie 'the matrix' when Neo touches the mirror and begins to metalize, it was how imagine it would have felt when the metal entered his mouth and went down his throat.",
  "We then left Boston Pizza and got in the car, I was in the back seat and had I hard time sitting upright, I felt it fun to sway around. I layed down on the seat and looked at my shoe, it looked like a muppet, it looked mean and was saying negative things to me (in my mind), i said negative things back (not aloud, just in my head), i looked to the front seat to see if they heard the mental argument I was having with my shoe. I was sure they could but they gave no sign of being able to. I looked back at my shoe and felt mad, I took it off and immediately felt happy again. My driver informed me that we needed gas, I began to laugh as i realized i had spent all my money on mushrooms. I found my situation very humorous, I was stranded in a foreign city with nothing, a car with no gas, pockets with no money and a little bag of dried up vegetables that i couldnt really use as food.",
  "I borrowed $40 from my friend to fill up the car, I layed there and struggled with how much money $40 was. I had no sense of numbers or value, I looked at the clock and could not figure out what time of day it was by the numbers displayed. All i knew is that it was dark, I didnt even think of it as nighttime. I began to laugh again, I dont remember what at, I found great entertainment in the little ironys and uselessness of everything around me. I wish I could remember examples. Though it was extremely hard to articulate my thoughts, I managed to share my observations with my friend, words didnt really matter, by looking at him I knew he understood what I was thinking, just as I understood what he was thinking. We continued laughing for hours. Our driver took us to the university, it was snowing heavy outside and their were many loaders clearing the parking lot. We got out and my friend remarked that the place looked like an amusement park, I immediately felt like the whole world was my amusement park, open for my observation and interaction, then i thought of the remaining mushrooms in the car as my ticket to this wonderland.",
  "We went into the university, I was amazed that we were allowed to just walk around inside, when nobody was around. There were stores (closed of course) and fooseball tables. I couldnt believe that this was a school, my whole notion of school had been work, and being told what to do. Here you seemed free, you were in control, the school was a place for you to use, not a place you were obligated to go. The concept boggled my mind. We went to the bathroom, instead of a door it has a swervey 'S' path, as we walked through it, my friend seemed to jump back the same time as i did, as i noticed the wall swelling towards me. Inside there were a whole wall of urinals i took one and my friend took one a ways down. While i was pissing i looked over, it seemed like there were a thousand urinals and my friend was at the far end, laughing to himself. The image is permanently ingrained in my memory.",
  "While in the bathroom i saw myself in the mirror, I noticed my earthy brown sweater and loose pants with a big belt. The clothes looked natural to me, they looked earthy somehow and i began to think that this is how man should live. We should live more natural, live off the earth, take mushrooms every once in a while to learn more. I felt in a very observant mood, I can't really remember what i was thinking, except that i was noticing all the things wrong with the way i was living. I was living negatively, i was destroying instead of creating, i was using and exploiting everything, instead of giving and helping. I didnt feel sad, I felt liberated. I felt like i was finally awakening from the ignorance of my previous self and beginning to see things as they really are. I wanted to change and imagined how i should live, I also felt this was hard to do because of ties to my parents and to society, they seemed like they were in another world and couldnt possibly grasp the notion of how I thought things should be. It was the greatest state of mind I have ever experienced. My perception of things seemed to be on a whole new level. It was like i had broken through a mental barrier i hadn't known existed.",
  "We then went back to my drivers house and watched MuchMusic (Canadian music video station) on t.v. While sitting on the couch I began to slowly come back to reality. My friend made some clever observations about the videos and we joked about them a little. I noticed it was about 4 or 5am and I understood what that meant. I layed there and reflected on my thoughts and felt completely satisfied, I was happy in every way and drifted off to slept.",
  "The next morning I felt fine, while driving back home My friend and I talked about what we experienced. He had a very similar trip to me. He had a lot of laughs for the first half or three-quarters, then a lot of deep thoughts about life (his were different than mine). We agreed that it was impossible to fully understand or appreciate our thoughts that night because it was impossible for either of us to re-create the state of mind we were in. We both agreed that it was the funnest time of our life and that we would definitely try mushrooms again."
 ],
 "erowid": {
  "id": "15345",
  "citation": " MW. \"Revelations in Wonderland: experience with Mushrooms (ID 15345)\". Erowid.org. Jul 11, 2002. erowid.org/exp/15345",
  "substance": "Mushrooms",
  "views": "9421"
 }
}
