{
 "id": 16863,
 "title": "First Dream Failure!",
 "date": {
  "submission": "2006-06-18T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Blue Guyuu",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 g",
   "administration": "oral",
   "substance": "Banisteriopsis caapi",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Virola spp.",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>Ground up all ingredients to fine powder, into a non-reactive pot appox.5-cups purified H2o,add 5 Tbs Apple cider vinager, combine all ingredients with 1 once H20, bring to quick simmer, strain entire mixture, return marc. to pot & repeat 3X, using fresh H2o and vinegar each time, combine all 3 strainings, filter entire mixture 3X until very clean no particulate matter, after all is filtered & combined, transfer appox.15 cups filtrate into a wide shallow non reactive pan, & proceed to slowly evaporate entire mixture until only a very small amount of dark reddish/brown thick liquid remains, Appox. 1/4 cup, while letting cool down, swish & gargle mouth & throat with a combo. of xylocaine, & procane hydrcld. to deaden the taste buds, 'down the hatch like a shot of tequila' @ 08:15pm, easy & neat.(don't see what everyone complains about the taste?)",
  "Anyway, with anticipation and puke-bag in tow, the kind of plastic bag I get at the super market, with the two loop handles, I wrap the handles around my ears, I go to special place with only a beautiful blue/green light that fills the room, relax with puke bag hanging from ears in reclined supine position, I wait for la purga.......",
  "15-20 mins. & I feel the salivary glands and solar plexus signaling the coming purge, I am reluctant to do this because I want to absorb as much as possible, but I also know that I will NOT fight it when it comes, hence the wonderful plastic puke bag that adorns my silly mug!",
  "So with that, all AT once, in an instant, thank you for my technological invention it works like a million dollar-Govt. engineered high-tech device & perfectly catches the fire-hose force fed pressure spew that rockets from my mouth & nose, 1st purge up and heading for the bathroom, get to sink, unhook the puke-bag form my ears, & while I am fumbling to get it off, the weight of the expellation in the bag causes the loops to seat firmly onto and around my ears actually like it was designed for this & find it's actually kinda hard to get off plus it's a mess in the bag and my concern is that during the removal and the 2nd purge that is now rearing it's ugly head, I struggle to get the bag off and make it into the sink proper and of course as the bag unhooks, & because of the weight, the whole thing blows up as 2nd purge blasts over the missing bag & into the mirror, faucet, everywhere, and the bag drops into the basin where it splashes everywhere, GREAT!",
  "Then me thinks, 'This better be worth it'",
  "A total of 30mins has past since ingestion, I clean-up, feel the same as B-4 ingestion, go back to special place to wait, 4 my pay-off? Wait& spend the next 2+ hours waiting, 4 nothing to ever develop. Absolutely nothing ever came out, no pay-off, no insight, ABSOULTLY NOTHING!!!! I am completely disappointed, wonder what went wrong?",
  "Actually I have my doubts this stuff really does anything other then make me puke?",
  "As for my experience I am reluctant to try it again because everything seemed to be in order, the amounts were within specs, if one can only receive the purge without any results then there is no purpose in trying it again, seems only a waste of time, money, plant material, & patience.",
  "Signed, Resigned to failure, worthless!",
  "No further experiments considered in the crypt in any foreseeable future, Me thinks it's all hogwash, & a bad dream!</p>"
 ],
 "erowid": {
  "id": "53929",
  "citation": " Blue Guyuu. \"First Dream Failure!: experience with Banisteriopsis caapi, Virola spp, Syrian Rue & Mimosa hostilis (ID 53929)\". Erowid.org. Jun 18, 2006. erowid.org/exp/53929",
  "substance": "Banisteriopsis caapi, Virola spp, Syrian Rue & Mimosa hostilis",
  "views": "15496"
 }
}
