{
 "title": "Sprayed with a Powder of Ideas",
 "author": "Yaksha",
 "citation": " Yaksha. \"Sprayed with a Powder of Ideas: experience with Salvia divinorium (ID 16872)\". Erowid.org. May 16, 2005. erowid.org/exp/16872",
 "substance": "Salvia divinorium",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "4 bowls",
  "smoked",
  "Salvia divinorum",
  "(dried)"
 ],
 "report": "<p>The following account is a disciplined and accurate account of my first trip on Salvia D. I hope that it will foster an understanding of the effects of Salvia and allow the un-experienced to obtain a thorough understanding of what they might be getting themselves into if they decided to smoke Salvia. I wrote this report to contain answers to questions that I have not found in any other trip report.</p><p>I take the bowl in two hits and lean back. This will be my first experience with Lady Salvia.  She creeped up tentatively and docily poked it's head here and there as I imagined every form in the room conforming to shapes which resembled exactly the decorative cubic illuminations seen around ancient myan glyphs. I closed my eyes and was dragged along a current backwards somewhat more sharply than the smooth and perfect logarithms of LSD.</p><p>My dad asked, 'What's it like?'</p><p>I examined the rivers of forces that had dragged me along and realized that it was the base of a giant leaf, and I had been carried outward on it's central vein. All around was the texture or rustling leaves. 'Vegative.', I reply, falling through a moving maze of churning leaf.</p><p>He then starts haranguing me with a barrage of questions. My eyes are open now and I see a matrix of fleshy bumps like those underneath the petals of a sunflower, except they seemed arranged in a hexagonal matrix rather than a spiral one. The design was colored with concentric hexagon bands of rainbow colors each tinted as deeply as a thick cobalt blue, yet the entire ornament was transparent and the colors were watery around the edges like a watercolor which was still wet. I was under a barrage of questions from my overzealous father which I was having trouble answering though my leafy haze so I left the room.</p><p>I laid down in my old room and turned the lights off. I was pulled through long vegetive corridor with no walls, but a ceiling and a floor. There was a female voice singing clear and zephyrous off from the horizon somewhere. I also got the impression that there was a bright, sharp light in the direction of the singing, but where I was, the landscape was dark and seemed to be illuminated by the walls or the air. I traveled through mazes and was pulled like taffy through organic machinery, sometimes interrupted by memories or wind-swept imagined skits that would bring my lambrynth-journey to dissolve, but upon returning, I would notice that the fantasy actually was a part of the lambrynth. Once back, I could see that the fantasy actually was a physical fold in the maze. I would recognize the central theme of each fantasy had a structure very similar to the part of the maze I was expecting to be pulled past.</p><p>In time the maze became translucent against the black of my eyelids and through it, there were subtle and stunning visuals akin to the ending sequence of 2001 Space Oddesy or a heavy DXM trip. Eventually, I drifted off to sleep an knew no more of the vegetable.</p><p>The next day, I woke up from an ordinary dream except for the prominent and constant preoccupation with giant and distorted fungus or mold-like plants, trees, and grass all of which seem to be parodies of actual plants that grow around here. The dream didn't heavily involve the plants, rather they seemed quite secondary to the dream, regardless of the fact that they practically dominated the dream. There were a few decompositions into Dalinian wind-swept fantasy throughout the dream though.</p><p>It was morning, and I decided to see if I could do any better today. I went to the nicely overgrown backyard and smoked a few more bowls in a shady hidden spot especially constructed for that sort of activity.</p><p>My first bowl brought brightly to my attention The wind sweeping though the green leaves around my smoking spot. There was a tension at the top of my head much like an LSD trip and the usual LSD somatic hallucinations, though much more subtle. My thoughts were simplified towards the humble beauties rather than the roaring sensory indulgence of Acid. The mental high is a lot more closely akin to good cannabis. I wanted to record the birds singing, but then I noticed that what made them particularily beautiful today was the fact that their sounds seemed to have been sent through a matrix of stacked crushed and dried leaves, each resonating with the sound of the birds and outputting a crystaline and reverberant sound akin to how I imagine a choir of angels would sound. Gestalt perception was just beginning to change when I started coming down. With deliberation, I climbed down to the house to bring my bag of dried salvia. As I descended, it seemed every bird on the property began singing loudly.</p><p>Upon returning, I smoked two bowls in sucession. The effect was much more marked. My gestalt perception began grouping and blending my vision giving an effect which might, with a grain of salt so to speak, be compared to the strange images that appear while sleepily gazing at black and white photos of high contrast. Soon, the plants around me were walls of green, and there was a high current wind blowing from all over through the tunnels between plants to a central place about a yard diagonally foreward and to my left. There, it seemed there was a creature praying  which was somewhere between a locust, a human, and a plant. It seemed to be absorbing the energy of the wind in meditation. Upon reflecting on the vision, I lost it, so I decided to close my eyes. My left eye was ablaze in colorshifts and movement, yet my right was luck to have a few traveling stripes. I followed the current upstream and it began to even out as it was now a black stream with infinite grey striations and was now moving with me, though I was above it and was no longer submersed in it. I saw embers traveling through it and it was then that I was struck with the idea that each particle in the stream was a singular idea and that the entire stream was flowing at a rate of billions of ideas a second. I followed the stream further where it encountered a cross-current and bent quickly about 70 degrees to the right.</p><p>A little further down and the entire physical reality flowed in the opposite direction turning me back and making my journey take on a convoluted shape, that I will not burden the reader with a detailed description of except to say that it was quite something!</p><p>Over the next corner, there outstretched a plain of dirt with a construct ahead of me, though it would be imossible to say whether it was a hundered or a thousand yards away. The convoluted path of my stream formed a short weathered and hearty stump like a bonsai tree maybe. Except at the top, there were no branches. There, the dust of ideas simply issued out in a spout to the open air carried off in the wind. I climbed up onto the plain, effectively being powdered in the spray of ideas. and started off towards the construct which had a throne and what I believed to be a holy creature siting with a light in it's stomach and a scepter in one hand and an orb in the other. Though it's difficult to say for certain, since the entire thing visually was nothing more than flecks of geometric color. I fell just short of the threshold of the room and my face was nested in the corner. I could see the patterns leaking off of the room and into the dirt, but the more I tried to approach the being, the harder I pushed my face in the corner.  I looked back at myself to see that I was a long leafy worm-like cyllendar with a face at the end. I was somehow stuck to the side of a cylendrical cavern. No that I knew my shape, I could begin moving. I contracted my muscles in such a way that I could roll up the side of the cavern and hopefully right myself in a more mobile position. It was a bit akward at first, but I got the hang of it.</p><p>My command to move my muscles manifested as an iconic sound. A tone, a lower tone, then a three note arpegio up from the bass, and finally a rest which was almost as long as the sound, the sound accompanied abstract myan glyphs which were pushing my long body up the wall along with my muscular comtractions. This experience was absolutely realistic and could be felt, seen, and heard just as if it were actually happening. I landed at the foot of the figure with a thud. I was actually partially inside of it. My eyes were inside the glowing heart. The vision began to dissipate, and I opened my eyes to find that I was not moved from my origional chair on the hill.</p>",
 "year": "2002",
 "id": "16872",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-05-16T07:00:00.000Z",
 "views": "7389",
 "dose": {}
}
