{
 "id": 16873,
 "title": "Gone Stargazing",
 "date": {
  "submission": "2008-01-10T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Slakr",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30",
    "grams": 0.03
   },
   "administration": "oral",
   "substance": "Morphine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "plant material",
   "specific": "Cigarettes"
  }
 ],
 "report": [
  "A girl I work with told me she had some good pills. She said they were 'codeine coated morphine'.  I had never heard of it but was curious.  After research I found that they were generic for MS contin made by Watson.  So I got 3 and ended splitting them with two friends.  We took them at ten oclock and after about twenty minutes the first effects were coming, keep in mind that around 9:30 I smoked a blunt, and my friends felt the same way.  At about 10:30-10:40 I had my first wave.  It was a wonderful feeling I just felt like I weighed a ton and that I was I going to sink through the chair.",
  "Around 11, the buzz had kind of gone away.  I still felt it, it was just a little weaker.  We thought it was because we only took one. We decided to smoke a joint, and right about the time I got high the second wave of morphine came. And then I just went off into nothing. I could think of things to say to my friends but they wouldnt come out.",
  "Now, at about 11:20, Im sitting outside in a camping chair stargazing with my head leaned back.  I also tend to be smoking a lot of cigarettes (almost chain smoking) but it just helped my buzz so much. After a couple more waves I decided to go home. I had thought that I had come down but then I smoked a bowl and that just brought it right back for about twenty minutes.  I also had a very dreamy sleep, it was a very nice buzz.  They were 30 mg but the company makes them up to 200mg so I will definitely go for a bigger dose next time."
 ],
 "erowid": {
  "id": "53957",
  "citation": " Slakr. \"Gone Stargazing: experience with Morphine, Cannabis & Tobacco (ID 53957)\". Erowid.org. Jan 10, 2008. erowid.org/exp/53957",
  "substance": "Morphine, Cannabis & Tobacco",
  "views": "17640"
 }
}
