{
 "id": 16872,
 "title": "Experimental Narrative - Complete Ego Loss",
 "date": {
  "submission": "2007-11-06T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Johnny Appleseed",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 10x"
  }
 ],
 "report": [
  "I smoked Salvia while coming down off a cannabis high.",
  "Sit after hit. Sweep blindingly past the initial physical, grainy, molecular dancing effects. Sudden and violent struggle of being de-spirited, like the metaphysical breath of existence being exhaled from my body (from lower brain/brainstem area). Struggle to maintain pilot's seat in my body. I am literally helpless and incapable of curbing the experience. I am even unable to explain my predicament to the two people with me. I forgot they were people. 'W' is not apparent anyway, though 'D' is still sitting next to me. We glance at each other's body, seemingly confused and lost. He nudges my shoulder and I his knee. Thats the last I notice of him, not a person at this point anyway.",
  "Next, full-blown psychedelic experience, extremely intense: being pulled back to source from behind, simultaneously being yanked forward to be forced into the fabric or puzzlework of the physical world. Colorful geometric pieces like a three-dimensional zipper compose the earth around--- first signs of ego loss: inability to respond while senses (I realize) have been wiped out, nothing is the same. I vaguely remember exclaiming through haphazard verablizations my involuntary endeavor, with all senses stripped of me, save a sliver of touch, just enough to move my tongue and mouth to mumble/shout, though this may be impulsive verbalization.",
  "I leave myself, return to vast, infinite pool of everything imaginable: back to source. I had no control over my body. The guys say they saw me drooling, they say I keeping blurting, 'What the fuck', moving my arms and hands. Was I standing or sitting? I do feel some physical sensation, but it is so infinitesimal and so nearly undetectable that I speedily break through to the everythingness, loosing entirely all of my perceptive processes. My body survives involuntarily, nerve impulses, stands up. No recollection of how I ended up standing, how I moved, if I even moved, spoke, anything. Nothing was done by me, being that I was absent for the time. Though the ego has been disconnected from the body, my existence as merely the unthinking mind-matter is not unconscious--- I am aware of being expanded over eons and illimitable spaces eternally. This is what god must be. God is everything and is within it all, look around, and look at myself. I see god, but this god is not an intervening creator, but simply the inspiration, the soul that fills this coincidental concoction of organic pieces that is my body.",
  "After merging with the pool of all, though I had never left it for all of eternity anyway, I tangent, returning to the costume of my physical self. It feels like suddenly taking the wheel in an unfamiliar vehicle. Is my body becoming inspired by the same tangent as before? Am I now someone different? I realize that we are obligated to experience this life subjectively. Death is sweet bliss, nirvana, complete and utter neutrality, indifference to everything and also to nothing. Death is the finger of spirit being curled back into the secure palm of all things within all universes, anything and everything that has ever existed. I saw the spring of inspiration for a brief yet interminable period--- unbelievable.",
  "I wonder to myself, then aloud if, being that it is possible to have such a near-death experience (an ego death), if it were possible to sever the life and actually decay physically, physically die. 'Wouldnt be so bad,' I think. But I have a duty, it seems, to live a lifetime, however long. More importantly, I have the total, true, and undying freedom to make my experience of life. It doesn't matter that much either, since I will just become every experience, substance, entity animate or inanimate at the sudden pull-out we call death. Really the return to the soul-stuff that gives vibrancy to the (beforehand) lifeless, biological mass we refer to as a body.",
  "There is no fear in death. There is no fear in failure. There is no happiness in success. Only a neutral ecstasy in response to it all. Life and death are shimmering. The monks come down from the mountains and laugh at everything that moves and everything that stands still. Life is amusing. We have to experience this. The things we miss out on we just become, mutate into, anyway, so why bother with anxiety and stress? Alls well that ends as all. The death of me ('me' being everything to begin with) will be the return to the blissful stew of every single vibrating atom and energy in the universe. I get you now, Uncle Walt. I am you. We are each other. And we are all things, ever, while they are us."
 ],
 "erowid": {
  "id": "53954",
  "citation": " Johnny Appleseed. \"Experimental Narrative - Complete Ego Loss: experience with Savlia divinorum (10x extract) & Cannabis (ID 53954)\". Erowid.org. Nov 6, 2007. erowid.org/exp/53954",
  "substance": "Savlia divinorum (10x extract) & Cannabis",
  "views": "2741"
 }
}
