{
 "id": 16898,
 "title": "Green Pills of Death",
 "date": {
  "submission": "2009-10-10T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Frank",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "Pharms - Haloperidol",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": ".25 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "After obtaining the circular green pills of death, I continued on to ingest the pills by parachuting the one and a half pills.  At this point I was under the impression that what I had was actually Marinol - synthetic THC.  This is what I thought I was buying for $20 and what my 'friend' who sold them to me said that they were.",
  "After I ingested the pills with my two buddies 'A' and 'K,' we went outside to enjoy the beautiful weather and smoke a bowl.  After about 1 and half hours I started to feel a bit strange.  My friends and I were out getting food from a deli when 'K' had said that she was feeling really strange and wanted to go back to her dorm room.  I thought maybe she was just really high, so we went back and dropped her off.  'A' and I went back to our room and were laying down in our own rooms.  About a half hour later I noticed that I felt really anxious as if something was about to happen.  I couldn't explain what the something was but it just felt like every second that passed, something horrible was going to happen. ",
  "To make a long story short, I couldn't sleep well for the next week, couldn't go to class because of serious anxiety of having a panic attack, I literally felt like a zombie for the whole week, and I ended up in the hospital because I had a dystonic reaction from the medication.  Besides the reaction, the most horrible part was waking up every morning hoping the effects wouldn't be there anymore, only to realize that they set in again after a good 10mins of being awake.",
  "This drug is probably the most horrible thing I have ever done and it was because of my sheer ignorance to what I was taking that lead to my awful experience."
 ],
 "erowid": {
  "id": "54057",
  "citation": " Frank. \"Green Pills of Death: experience with Unknown (Sold as Marinol) - Suspected Haloperidol (Haldol) & Cannabis (ID 54057)\". Erowid.org. Oct 10, 2009. erowid.org/exp/54057",
  "substance": "Unknown (Sold as Marinol) - Suspected Haloperidol (Haldol) & Cannabis",
  "views": "14584"
 }
}
