{
 "title": "GHB Withdrawl and the Dopamine Rebound",
 "author": "MMB1",
 "citation": " MMB1. \"GHB Withdrawl and the Dopamine Rebound: experience with GHB, GBL & 1,4-Butanediol (ID 169)\". Erowid.org. Sep 10, 2000. erowid.org/exp/169",
 "substance": "GHB, GBL & 1,4-Butanediol",
 "bodyweight": "210 lb",
 "report": "<p>First of all I would like to say that I am an advocate of GHB and it's relatives (GBL 1'4 BD); I have used GHB for over 3 yrs with great benefit to my health, social life, and overall well being. However there does seems to be an issue of addiction and withdrawl from GHB which is causing some confusion which I hope to help clarify.</p><p>First, GHB is not addictive in the classic sense. The body doesn't react to a lack of GHB in the brain. GHB addiction is at first psychological. Everyone likes to feel good. The fact that GHB has such a lack of toxic effects on the body allows for the user to abuse it in a way you couldn't do with almost any other drug without ill effects. This often leads multiple dose use throughout the day. I myself found I could consume nearly 15-20 grams throughout the day, and I have found many with similar habits.</p><p>GHB's 'buzz' is caused by the action of neurotransmitters Seratonin and GABA, the levels of these two transmitters is increased due to the fact that GHB blocks the release of dopamine. Although dopamine release is blocked the product of dopamine is not. This means when the GHB wears off a dopamine rebound occurs. This is the energized feeling most expirence as the GHB wears off, also responsible for waking in the night when a larger dose is used. When GHB is used in multiple doses over weeks, monthes, and even years an excessive amount of dopamine is stored in the brain. If the user then attempts to stop GHB use this dopamine floods the brain causing numerous effects which could be catergorized as withdrawl. The most common (and the ones I myself experienced) are Insomnia, shaking (of hands or limbs), Anxiety, Rapid heart-beat, sensations of hot and cold, general sensory over stimulation, and depression.</p><p>The duration of these symptoms varys depending on the frequency, as well as duration of use. Tapering off GHB helps quite a bit. First lower your dosage, if you were taking a cap (2-2.5) grams every 2-3 hours cut to half a cap but in the same intervals. Then decrease the time between use. This will help but expect to experience a few sleepless nights if you're a heavy user. Benzos (valium, xanax) are extremely helpful if you have access. Most doctors will not have a problem perscribing them if you are displaying such withdrawl symptoms. I found .25mg of xanax 3 times daily to be sufficent. The best thing to do is never get in the situation of massive use to begin with. I now believe that GHB should not be used more then 5 days in a row without at least 24-48hrs off to allow from the dopamine to clear. Even this may be too excessive. I hope this is helpful to someone out there. Best of luck. Don't be afraid of medical attention, doctors are there to help.</p>",
 "year": "2000",
 "id": "169",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-10T07:00:00.000Z",
 "views": "27527",
 "dose": {}
}
