{
 "id": 16916,
 "title": "In A Relaxed State",
 "date": {
  "submission": "2007-12-18T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Paulmer",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Methylphenidate",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Let me preface this report with some background information on myself. As a child, I was diagnosed with ADD and some developmental disorder. I was prescribed Ritalin when I was 7 or 8 and used it tell I was around 10.",
  "The other day I acquired some Ritalin. Two pills, ten MG each. I went home, and insuffalated them. Then I took a shower. During my shower I felt the effects come on slowly. I felt happy, almost silly. When it kicked in I started beat boxing for a second haha. After that I got out, and went to my room and I sat down on my lazy boy chair. I felt happy and sociable. But one thing that I really didn't expect was, I didn't feel like it was a stimulant. I felt sleepy and lazy - relaxed and at peace. I even felt hungry. Really made me wonder. I felt a urge to socialize. I grabbed my phone and I called my friends and I said something along the lines of 'Man I feel so good!'. After that I popped on my iPod and listened to some music and relaxed for a while. Sounded great. I even layed down for a bit and listened to music.",
  "The whole experience lasted around two hours in its entirety. During the come down, I felt a strong urge to do more (unfortunately I didn't have any more :( ) The night after I took it, and the day after, I experienced some eye twitching. It didn't happen often, like twice a hour. In general, I say I had a excellent time. I felt better than I have in months. I can't wait to do this again :)"
 ],
 "erowid": {
  "id": "54103",
  "citation": " Paulmer. \"In A Relaxed State: experience with Methylphenidate (Ritalin) (ID 54103)\". Erowid.org. Dec 18, 2007. erowid.org/exp/54103",
  "substance": "Methylphenidate (Ritalin)",
  "views": "4909"
 }
}
