{
 "id": 16914,
 "title": "Deep Sleep",
 "date": {
  "submission": "2008-01-10T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Christ",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Hops",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(capsule)"
  }
 ],
 "report": [
  "One night I really felt like taking something so I searched through my cupboards for something that would affect my sleep. I found some pills called 'Valused'. They're supposed to help with sleep and nervous tension. I took a look at the instructions. They said to take 1-3 pills half an hour before sleep. I was randomly wondering if it was powder or liquid that was in the pills so I cut one open. It was in fact a brown, smelly, liquid. So I swallowed the open pill. I got drowsy pretty quickly after that, I'm guessing because the pill was open hence no time release. Soon after that I took 4 more.",
  "I sat around for a bit, cleared my mind, and got ready to go to sleep. When I finally went to bed I immediately started to fell my body numb slightly and tingle. It was a bit strange and uncomfortable. Then I got this feeling of weightlessness for a while. Usually it takes me a while to fall asleep but this time I was out within a minute or two. My dreams were extremely vivid that night. I tried to become lucid in these dreams but I think I was too sedated. I had long dreams with complicated plots. In one of the dreams I even died and a moment after I died in the dream I woke up with a strange body high. I quickly went back to sleep and had some more crazy dreams.",
  "I woke up very refreshed and felt like I had been sleeping forever. Valerian is definitely a good way to get a deep sleep. I'm sure the other herbs in the pills contributed to the experience but it I think it was mainly the Valerian."
 ],
 "erowid": {
  "id": "54100",
  "citation": " Christ. \"Deep Sleep: experience with Valerian, Hops, Passion Flower & Dreams (ID 54100)\". Erowid.org. Jan 10, 2008. erowid.org/exp/54100",
  "substance": "Valerian, Hops, Passion Flower & Dreams",
  "views": "13056"
 }
}
