{
 "id": 16926,
 "title": "Thought Provoking",
 "date": {
  "submission": "2006-08-14T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bats",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": {
    "number": "25",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "2:15 ",
  "I swallowed about 25 mg of 2c-t-2 after about 5 beers at 2:15pm.  I can't be sure because I don't own a scale.  I'm chatting on IRC with friends that don't know I still use psychedelic substances.  I'm listening to 3 Doors Down  Kryptonite.  It's Sunday afternoon so I'm hoping this drug has little body load since I have to work tomorrow at 8:00am.  My last experience with a high dose of 2C-I left me sleeping over 24 hours.",
  "2:30 ",
  "I feel a little light headed.  I put together a play list of my favorite songs.  Crystal Method, NiN, Interpol, Placebo, Pink Floyd, etc.  I think this is going to be more intense than I originally imagined.",
  "2:45 ",
  "I feel like I'm about to start tripping.  The taste of 2c-t-2 in my mouth from swallowing makes me sick.  Keep drinking more beer.",
  "* at this point I had to lie down *",
  "3:30",
  "I am too fucked up to write.  Patterns and colors are everywhere.  Mirror Mask is entertaining.  Faces in the carpet.  The girl in Mirror Mask is beautiful.  Feels good to close eyes and think.  Slight nausea.  Like LSD, patterns, similar to 2c-i.  Too fucked up to play guitar.  Fun drug, must take it with others sometime.  Everything looks electric.  Yellow, orange, and red flow everywhere.  Makes me think about things that went on last week at work.  Maybe accidentally a good career move?  Possibly.  Hopefully.  Can I tell co-workers?  No!  Shame.  I want to talk about it!  Smoking a cigarette.  Need water.  Water is good.  Beer is not.  Listening to Mirror Mask is entertaining but the visual effects elsewhere are much too entertaining to watch the movie. ",
  "3:45 ",
  "Movie ended but I don't want it to end.  Restarting.",
  "4:00",
  "Still intensifying.  Patterns are coming out of everywhere.  Enjoyable but not pleasurable.  Not like MDMA.  Much more psychedelic.  I feel like I could be very truthful.  Probably too truthful.  It's becoming too difficult to write or spell.  I might have to put my pen down.",
  "4:15 ",
  "This is an awesome experience.  Think about past.  Not fun.  Think about future.  Much more positive.  Past is hell.  Never want to go back there.  Ever.",
  "5:00",
  "Mouth is dry.  Too dry.  Drink water.  Too fucked up to talk to anyone.  Could not drive.  Ceiling fan is funny.  Very optimistic about my future.  Need to drink less and never do drugs again.",
  "5:15 ",
  "Spill my fucking water.  What a fucking mess.  Mirror Mask ended again.  Hate when it does that.  Restarting!  Talking to a friend via IM on my Treo.",
  "5:30 ",
  "Thinking about work and things that happened in the last week.  This movie is awesome.  Still patterns and faces everywhere.  Words cannot do this experience justice.  Nausea is completely gone.  Beer tastes like shit.  The chicken is so funny.  OMG.",
  "6:00",
  "Refilled my spilled water.  Still tripping.  I found the urge to fill out a check to American Express for a balance that is due in 3 days.  I hope I remember to mail it!  Did I mention the girl in this movie is beautiful?",
  "6:30 ",
  "Playing guitar is fun.  Seem very creative, trying things I've never tried before.  Played for 30 min straight until my arms hurt and I had to stop.  Oh shit, I have to talk on the phone with a guy from work.  That was not fun at all.  Movie ended yet again.  Can't watch it again.  Crystal Method sounds awesome.  Crystal Method  Acetone.  Beginning to yawn but I know I'm not tired.  Beer tastes better than before.",
  "7:00",
  "Effects are slowly wearing off, I think.  Still faces are everywhere, on my skin, table, walls, especially when not focused on them.  Music sounds noticeably different.  Hear things I've never heard before.  Trying to get on the Internet but stealing my neighbor's WI-FI isn't working out too well.  How many times do I have to type ifup eth0?  Listening to Crystal Method's Trip Like I do.  I remember how the opening lyrics are from the movie The Dark Crystal.",
  "7:30 ",
  "Finally effects are wearing off.  I'm drinking a beer listening to music and retyping my notes from my pad.  All in all a very enjoyable experience."
 ],
 "erowid": {
  "id": "54136",
  "citation": " Bats. \"Thought Provoking: experience with 2C-T-2 (ID 54136)\". Erowid.org. Aug 14, 2006. erowid.org/exp/54136",
  "substance": "2C-T-2",
  "views": "6744"
 }
}
