{
 "title": "Cheesy",
 "author": "zeta",
 "citation": " zeta. \"Cheesy: experience with Mushrooms - P. cubensis (ID 16936)\". Erowid.org. May 16, 2005. erowid.org/exp/16936",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "150 lb",
 "report": "<p>I am a healthy male New Zealander, 20 and 361 days old. I first smoked marijuana at the age of 17. I enjoyed my first and only (so far) acid trip at the age of 20. Today I consumed an unknown dosage (probably about 2g) of dried P. Cubensis, strain Ecuador. The weather: warm and sunny. I hadn't eaten anything since the night before. At 5pm, I ingested all the shrooms I have ever grown. The taste, not too bad, but undeniably linked to smelly socks.</p><p>At 5:30, I began to feel 'warped'. At 6, my mother rang. Stupidly, I talked to her, probably for about 20 minutes. During this time, the carpet and curtains became infinitely more fascinating than mother. Intricate patterns began to flow gracefully over the lounge. The curtains became neon, flashing. Mother got quite negative, but I didn't let that affect my trip. I have to wonder whether she could tell I was tripping, I was well into the trip by the time she hung up. Then I chatted to friends online for a while before realising it was my turn to cook dinner for my flat. This was a HUGE mistake. I REALLY should have said, 'sorry guys, I'm not quite myself. please get your own'. Instead I chose to cook garlic mashed potatoes and panfried fish. Peeling potatoes was pretty fun, while watching faces melt in the formica.</p><p>The kitchen floor proved a huge distraction: scenes of the Andes and South American peasants unfolded. I find it quite difficult to believe that C12H17N2O4P can have such an unmistakable 'geographical character', but this was pretty convincing. Throughout my trip, Aztec-influenced patterns prevailed. Back to dinner: somehow I managed to cook it, but for unknown reasons I gave ALL of the mashed potato to my two flatmates and 3/4 of the fish to myself. And I didnt even feel like eating! They're pretty understanding guys, but afterwards I was wishing there was some way I could surgically remove that dinner from their memories. Hopefully they can laugh it off...</p><p>Washing the dishes was great, the sinkful of suds a mass of rainbows. After cleaning all the mess up, it was 8:00. Time was incredibly warped. I was feeling pretty insane to be honest. The trip had an intensely cheesy, 'carnival' feel.. walls breathing, everything melting, faces everywhere. I lay under the stars for a while and felt a cheesy sort of 'cosmic connected-ness'. I never had any CEVs, because for some reason I couldn't keep my eyes closed.</p><p>Music never seemed that remarkable. I was amused by the thought of 'myself', who seemed like another person, with his grand plans of growing pounds of shrooms without ever having tried them. Walking along the street, I found it very easy to believe I had been transported 20 years into the future. The comedown wasn't so bad, but I was really looking forward to getting back to reality. There were aspects of the trip that weren't ideal, but I've learnt from them. My next trip will be very different, but I won't ever forget this trip, a great introduction to psilocybin.</p>",
 "year": "2002",
 "id": "16936",
 "gender": "Male",
 "timestamp": "2005-05-16T07:00:00.000Z",
 "views": "3902",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
