{
 "id": 1693,
 "title": "Salviation",
 "date": {
  "submission": "2002-06-30T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "pretty tony",
  "gender": "Male",
  "weight": 107
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "I am a 24 year old male who considers myself well versed in LSD and",
  "P. cubensis shrooms.  However nothing I have ever experienced prepared me for the salvia intoxication. ",
  "It started at my best buds house with myself and girlfriend my bud and his girlfriend. My friend obtained some 5x off the net after trying the leaves with no satisfaction. I first must say I underestimated this substance very much. For some reason in my mind I was about to smoke some yubba gold or wizard smoke like in the high times mag.",
  " After smoking the before mentioned dose in one healthy toke I held it in for as long as I could. I guess the results were instantanious. There was a harsh feeling of nonexistence all the while there was some unseen beings almost gingerly discussing where to place me. There was a lot of darkness with 2 dimensional realities readily acessible. I felt a definite sense of metamorphisis although it was more complicated than just turning into something. I barely recall hallucinations with vivid colors and highly complex geometrical patterns.",
  "All of this happened in about 5 minutes.",
  " When I came around I remember going through one of the 2d realities I seen earlier. I saw my girlfriend and grabbed her telling her to pull me through. I started to sweat heavily. I was still unable to see completely and felt unsure of where I was. I had mellow eye candy for about 20 minutes and then all physical effects were gone.  I felt very smothered as if underwater and scared during this time.",
  " At first I was totally, 100%, never ever ever going to try this again. however my resolve is fading rapidly."
 ],
 "erowid": {
  "id": "15362",
  "citation": " pretty tony. \"Salviation: experience with Salvia divinorum (ID 15362)\". Erowid.org. Jun 30, 2002. erowid.org/exp/15362",
  "substance": "Salvia divinorum",
  "views": "8518"
 }
}
