{
 "title": "Wall Shattering Fungus",
 "author": "Angelmengele",
 "citation": " Angelmengele. \"Wall Shattering Fungus: experience with Mushrooms - P. cubensis (ID 16946)\". Erowid.org. Mar 27, 2007. erowid.org/exp/16946",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "125 lb",
 "report": [
  "<p>My most recent mushroom trip was one of astounding (mental) anguish, yet I have grown all the more for it. I dosed roughly around 7:30PM, wanting an exciting way to pass the time before my Long Isalnd vacation with my girlfriend which was to begin the proceeding day. With the brief respite from city life in mind, I went into the experience slightly elated and prepared for a 'fun' trip.",
  "This is, by no means, a recreational drug for me. I see why it is used for intellectual/spiritual enlightenment.",
  "After about fifteen minutes of watching TV with my roommates, I began to feel to onset of the nausea characteristic of this toxic substance. My thoughts became increasingly confused, and I soon began to question my ability to stand. After several minutes (hours?) I retired to my room, thinking myself about to pass out/vomit/?. It was in my room that it finally peaked.",
  "My thoughts, my emotions, the posters on my wall, the house itself, my roommates, the music coming from my stereo (Converge's 'Jane Doe' Album), the stereo itself, the air in my room, and everything in my immediate vicinity (and anything that could be fathomed) seemed to be connected, as if all things (those physical, emotional and mental) were comprised of the same cosmic particles and were, ultimately, the same things, just differentiated by my consciousness.",
  "I then sat helplessly as my 'walls' were broken down. My rational mind returned, and I was forced to experience, on an emotional level, my every thought. While I normally view all things with bemused detachment (my protective coating of cynicism), I was rendered as a child, helplessly and hopelessly effected by all things around my.",
  "I soon became very paranoid, shocked by the stupidity and complacency of the world and angered beyond words by the government and the way in which, I feel, it cruelly domesticates its  citizens. I could not go outside, for I felt too sensitive to simply shrug off the ignorance and hostility with which I would be confronted in my south Bronx neighborhood. I became a prisoner in my own home until I had sufficiently come down (about six hours later).",
  "I then purchased food, attempted to consume it, nearly threw up and the began to watch 'Natural Born Killers,' which almost provoked a tearful tantrum. I stopped the video until I had completely come down.",
  "I remember, at some point, calling my girlfriend and leaving a very frantic and rambling message on her machine. I also attempted many times to defecate while still in my room. I was, luckily, unsuccessful.",
  "This drug, I think, has the same effect on my system as cocaine, save for the euphoria. The physical ramifications make me think twice about doing it again soon, but I probably will anyway. I would recommend this drug to anyone that has, for reasons of self-preservation, complacency or apathy, become disconnected from their true feelings. It will provide great emotional insight.</p>"
 ],
 "year": "2002",
 "id": "16946",
 "gender": "Male",
 "views": "2560",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2007-03-27T07:00:00.000Z"
}
