{
 "id": 16959,
 "title": "A Soul-Cleansing Liftoff, A Crash Landing",
 "date": {
  "submission": "2001-04-01T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "zooz",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "",
   "substance": "2C-T-7"
  }
 ],
 "report": [
  "<p>My third experience with 2C-T-7 really took me where I had been trying to go, but with a somewhat harsh landing... Before I received the 2c-t7, I had not done any psychedelics (except Salvia) for about one and a half years. The first two attempts with this substance, I took around 25-40 mg and had an interesting time both times, but I wasn't all that impressed.  I mostly got a mood lift, some speediness, passing euphoria, enhancement of music, etc..",
  "50mg did the trick!  The trip started off the same, a little uneasiness for about 30 minutes to an hour, then a sense of climbing, and after about 2 hours I began feeling passing waves of euphoria.  I was listening to a great, kinda slow Elliot Smith song (great music by the way, if you haven't heard him, absolutely beautiful), and began feeling as if I were lifting off to some sort of mental 'heaven'. Seriously, I'm not exaggerating.  It's as if the music, the time of day, my mentality, the air in the room, all came together in unison for a brief moment and felt like cosmic perfection. This faded in and out for about an hour, then some fairly nice visuals kicked in.  Not full-on hallucinations, but just patterning, color fades (a la mescaline), things like that.  Not really any trails or actual hallucinations of things that weren't there (thank God). I've heard people say this was overwhelming with visuals, which it kind of can be, but in more of a soft, comfortable, mescaline way and not in an LSD or other tryptamine kind of way.  If you've ever done mescaline, this is like mescaline, crossed with Ecstasy, except a little rougher. ",
  "After about 6 hours of having fun, I got a massive headache, and couldn't sleep for another 6 hours. I hate this part! It wasn't too bad though, no vomiting, no real nausea even to speak of (but I have never thrown up on a psychedelic, except the one time I tried peyote!). ",
  "An intersting sidenote :  I had torn ligaments in my shoulder the week before, cliff-diving into a lake, and had not been moving it much because of pain. While I was on 2c-t7, I begain moving my arm all over the place, thinking I was working out the pain, and telling my girlfriend that 'Cool, it's like it's lubed up with cosmic jello or something'. It did not hurt at all to move, but I could tell I was damaging it further so I stopped!",
  "Overall, a fun and fairly safe experience.</p>"
 ],
 "erowid": {
  "id": "5426",
  "citation": " zooz. \"A Soul-Cleansing Liftoff, A Crash Landing: experience with 2C-T-7 & Cannabis (ID 5426)\". Erowid.org. Apr 1, 2001. erowid.org/exp/5426",
  "substance": "2C-T-7 & Cannabis",
  "views": "9039"
 }
}
