{
 "id": 16952,
 "title": "Never Again",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BJ and the Ninja",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Anadenanthera peregrina",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "My hallucinogen history: I have taken LSD, 2CP, 2CE, 2CT7, 5-MEO-DMT, Mushrooms, HBWR seeds, DXM, 5-MEO-AMT, DIPT, 4-ho-DIPT, and DPT.",
  "The only ones of these drugs that have given me stomach discomfort was my first experience with HBWR, and my 4 experiments with 5-meo-amt.",
  "I had heard that the yopo seeds are very painful to snort (I imagine that it's pure hell, just like snorting the 2C compounds).",
  "I had the seeds lying around for a month, because I had heard of the body discomfort that they can cause. 2 days ago, I got the desire for a journey, but I didn't feel like taking the enormous journey that salvia provides.",
  "I slowly heated 2 yopo seeds until they popped, and then I de-shelled them. I crushed them up and put them into my favorite glass bong. I took all the smoke in one big hit, and it didnt taste too bad. Kinda nutty. I awaited the effects, but none came. 10 minutes later, I tried again with 3 larger seeds. I made sure to hold the smoke in for 20 seconds or so, then I exhaled, and went into my bedroom, so I could lay down and relax. About 2  minutes later, my stomach started churning. After another minute, the churning sensation had developed into full-fledged nausea. It felt even worse than the 5-meo-amt nausea.",
  "I was very glad that I was already lying down, because moving my body caused the nausea to increase. Upon closing my eyes, I saw faint patterns, sort of like a colorful chain-link fence. Mostly, however, I was focused on the horrible stomach pain.",
  "About 15 minutes later the pain faded, and I decided to never ingest those evil seeds again."
 ],
 "erowid": {
  "id": "54228",
  "citation": " BJ and the Ninja. \"Never Again: experience with Anadenanthera peregrina  (ID 54228)\". Erowid.org. Jun 14, 2007. erowid.org/exp/54228",
  "substance": "Anadenanthera peregrina ",
  "views": "11852"
 }
}
