{
 "id": 16953,
 "title": "My Entire Body Was Being Crushed.",
 "date": {
  "submission": "2008-12-18T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Valerian",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I started taking valerian to ease some anxiety and general stir-craziness.  I was at the point where I was easily aggitated by many tiny stressful situations.  I took these pills with a cup of water before bedtime usually around midnight.  This first time I took one valerian pill, and felt tired within a half hour, the next day I woke feeling like a saint, and felt unusually kind during situations that bothered me before.  I also had felt more energetic the whole day, after an hour or two of mild grogginess upon awakening.  The next time I took two pills and had the same effects.  It began as a miracle.",
  "After taking a week break, and having such success I decided to try it again.  Two pills did nothing for me the third time, except make me tired and somewhat unwilling to sleep for 2 hours while being exhausted.  The fourth time I took it I felt aggitated and could not sleep for 3 hours, the next day was never the same, and I felt no different.  So I cut the dose to 1 pill the next day, and I felt like my dreams were becomming too deep, I would wake up several times in the middle of the night because of numbness in my arms and legs. ",
  "The sixth time, the numbness came on within 30 minutes of lying down.  The seventh time I tried to dodge the numb feeling by taking it immediately before bed - this time was weirder because I felt like I couldn't wake up, like I had been paralyzed.",
  "Finally, the eigth time I took this pill, I had the worst dream inside dreams.  I felt like I wanted to wake up - I decided I would start moving my arms - but the more I tried to move them the more numb / restrained I felt.  Then I tried to do a sit up and felt completely paralyzed.  I felt like my entire body was being crushed.  Then an overwhelming pain entered my brain - like my jellybrain had been turned into a giant brittle potato chip and that someone was crushing me in.  I was certain this was the end - that I had finally killed myself with herbs.  I told myself 'No, you can't let it end this way' and willed it away.  I don't know it was a dream or reality to this day, but I suspect it was a dream inside a dream.  It is a shame because I was so sure the effects were GREAT and then it never worked the same.  Even when I cut the dose to half a pill I had the same insomnia/numbness."
 ],
 "erowid": {
  "id": "54229",
  "citation": " Valerian. \"My Entire Body Was Being Crushed.: experience with Valerian (ID 54229)\". Erowid.org. Dec 18, 2008. erowid.org/exp/54229",
  "substance": "Valerian",
  "views": "12183"
 }
}
