{
 "id": 16957,
 "title": "Numb & Aware",
 "date": {
  "submission": "2007-05-01T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "D. Theman",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "9.8 g",
   "administration": "oral",
   "substance": "Piracetam"
  },
  {
   "time": "24:00",
   "amount": "2.4 g",
   "administration": "oral",
   "substance": "Piracetam"
  },
  {
   "time": "29:30",
   "amount": "20 ug",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl"
  },
  {
   "time": "31:30",
   "amount": "20 ug",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl"
  },
  {
   "time": "0:00",
   "amount": "10 ug",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl"
  },
  {
   "time": "35:20",
   "amount": "17.5 ug",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl"
  }
 ],
 "report": [
  "I have been reading a lot of positive experiences about nootropils and I just started using Piracetam yesterday and started with an attack dose of 9.8g. I have already started to feel some of the effects, such as enhanced memory recall. I could not, however, find any experience reports on Pirecetam mixed with opiates. Well, today I got my hands on a Fentanyl patch, 100 mcg, so I decided to write a report. I have experience with Fentanyl, having used it 10-15 times in the past. I am also experienced with other opiates such as Oxycontin and Heroin. Although I don't consider myself a habitual user, I have been using opiates quite a bit over the last month, with my last Fentanyl experience roughly 2 weeks ago.",
  "I took 2.4g of the Piracetam in the morning shortly after waking up, around 7:00 am. Definately feel some change in my overall mood and perception. My brain seems to process the information I take in a lot quicker and with greater understanding than normally.",
  "At about 12:30 pm I took my first dose of Fentanyl, roughly 20mcg. I don't expect to feel any effects for at least an hour as is normally the case with the Fentanyl patches. In anticipation of the high that is to come my good mood is heightened as I watch some entertaining video clips online. I find myself finding things a little funnier than I usually do, and since the Fentanyl couldn't have kicked in already I attribute this to the Piracetam. This seems to be an interesting substance in itself. I wonder still how it is going to affect my Fentanyl high. I don't expect anything in an attempt to avoid placebo effects.",
  "As 2:30 pm comes around I feel only a slight buzz. This is very strange because in the past the dose that I took would at least have me itching and sweating. I wonder if my tolerance has gone up, and take another 20mcg of Fentanyl. Very soon after this my high itensifies, but as it does I notice something different about it, I'm not drifting in and out of conciousness, zoning out. My thoughts are still existent as I feel the need to keep myself occupied, far from my normal experiences of vegetating on my couch. I decided that I still may not have taken enough, so I take another (approximately) 10mcg.",
  "It's 4:15 pm, and I am still not THAT high. The psychological effects I described before are still bothering me. This is VERY strange because I have taken close to but less than this amount 2 weeks ago and was nodding off into dreamland. I now notice another difference which is my visual perception. Normally on this drug my vision becomes fuzzy and my eyes become unable to focus on anything. Now, I am able to read the words I type on the computer screen with no problem, a feat unaccomplished on past Fentanyl experiences. I now know that this is not a matter of drug tolerance, as I have only used opiates once in the past 5 days, and must be attributed to the addition Piracetam to the mix. This makes sense to me because the Piracetam would be working on keeping the brain going while the opiate is trying to shut it down. That is not scientific but a logical statement. My body high is still decent throughout the experience so it is not all a waste. Well, I might as well keep on going so I take another 15 to 20mcg dose at 6:20 pm, bringing the total dose to about 70mcg which is more than I have ever done before. Now I'm kinda pissed I didn't get some H 'cause it woulda been a helluva lot cheaper.",
  "Conclusion? It seems to me that Piracetam has a negative effect (matter of perspective) on the psychological effects of Fentanyl and possibly affects the user's tolerance as well. I am still interested to know if it is just a matter of my recent opiate use, so I will try this again with the Piracetam completely out of my system."
 ],
 "erowid": {
  "id": "54251",
  "citation": " D. Theman. \"Numb & Aware: experience with Piracetam & Fentanyl (ID 54251)\". Erowid.org. May 1, 2007. erowid.org/exp/54251",
  "substance": "Piracetam & Fentanyl",
  "views": "13961"
 }
}
