{
 "id": 16962,
 "title": "Optomistic Herb Day",
 "date": {
  "submission": "2009-08-27T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Illuminaire",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:15",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "(tar / resin)"
  },
  {
   "time": " T+ 0:15",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:25",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(extract - 10x)"
  },
  {
   "time": " T+ 0:25",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Leonotis leonurus",
   "form": "(extract - 10x)"
  },
  {
   "time": " T+ 0:45",
   "amount": "1.5 Tbsp",
   "administration": "oral",
   "substance": "Lactuca - L. virosa",
   "form": "(tea)"
  },
  {
   "time": " T+ 1:10",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Argemone spp. ",
   "form": "(extract)"
  },
  {
   "time": " T+ 1:45",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(leaves)"
  },
  {
   "time": " T+ 3:45",
   "amount": "1/4 tsp",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(extract)"
  },
  {
   "time": " T+ 3:45",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>Background:  Daily Cannabis, occasional alcohol, no nicotine.  Interested in decreasing cannabis dosage completely for a few months. ",
  "Greetings,",
  "On Herb Day, I decided to abstain from cannabis entirely. Although, after being somewhat disappointed with most of my herb purchase and lung taxation I felt it would be largely therapeutic. ",
  "T+0   I began by smoking a couple bowls of damiana. Slight mellowness felt.  Smokes well, nice aroma.  Didn't really do much - I can get a slight buzz by smoking lots of different kinds of plant leaves.",
  "T+15   Smoked a bowl of Kanna 15x resin extract (little balls), then two bowls of powdered Kanna.  Whew, Lots of harshness from the powder.  The extract was considerably smoother but a bit harder to burn.  Once again a slight mellowness, maybe a pinch euphoric!  I'm optomistic.",
  "T+25   Tried to smoke some Wild Dagga 10x extract (tar). Very hard to get smoking.  Only got like three hits before my lungs were tired from trying so hard to earn a hit.  immersed one gram 10x extract (attached to wax paper) in water.  Dissolved nicely when agitated with a spoon.  Downed It.  Once again, maybe a pinch euporic after 20 minutes of chilling outside on a nice evening.",
  "T+ 45   Followed that with an opium lettuce tea brew from 1 1/2 tbsp. of lettuce brewed for about 20 minutes.  Very, Very, Mild but noticeable.  Kinda like a nice cup of green tea, relaxing.",
  "T+ 1:10  I decided I'd like to feel something so I downed a gram of prickly poppy 15x extract (little balls).  Its bitter, like oxycodone.  This gave out ever so slight opiatative activity.  I can tell that its definately milder than a tiny little piece of an oxycodone pill (30mg blue, no coating) crushed and swallowed.  I mean a tiny little dab on the end of your index finger. ",
  "T+ 1:45  Ate a homemade double cheeseburger even though I wasn't hungry cause the family was eating.  Still yearning for a little psychoaction.  I smoked a bowl of grade a cannibis leaves, I was all out of bud.  Ahh, this is definately more of a smoking plant than the others.  Felt good for a while smoked another bowl about a hour later and felt good again.  Getting tired now. ",
  "T+ 3:45  After a little evening activities I decide to lie down.  I'm really not feeling like I'm gonna doze off.  Anxious to try blue lotus as that is one I've heard some good things about. Put about 1/4 tsp 20x extract in a small bit of red wine.  It gave out more of a buzz than anything else.  Mild euphoria, very cozy feeling.  I'm going to try a higher dose next time.  This is probably the only one I will buy again. It mixes well with alcohol and is reported from times long past to be a wellness tonic for the body and a natural ecstatic (like being in love). ",
  "Conclusion: I'm a pretty sensitive person when it comes to substances compared to most of my friends.  Actually, I'm Lightwieght Illuminaire.  Just takes a touch.  If I wait until evening to smoke bud its definately more enjoyable and just seems more correct than smoking all day b/c I have to keep re'uping to keep from coming down or get into an exercise activity, or sleep.  I have ingested cannibis orally on multiple occasions and would say it is a really satisfying stimulative high that I can go to work on and not feel real paranoid and no one will really notice.  That is with about a gram dosage. I used professer tee's miracle tincture or break up the bud and work it into some cookie dough and cook at 400 degrees for 14-15 min.",
  "Tinture: 1/8 bud simmered in 1 tablespoon honey. As soon as the honey starts to barely cook the bud, I throw in three shots of vodka or similar alcohol.  I mix this very well or my tinture will be gooey and not liquid like it should be.  I cook on the lowest heat I can for at least 15 minutes where I can see the crystals leaving the bud and going into the mix.  Probably at least half of the alcohol will evarporate leaving a little liquid. I strain it and squeeze the liquid from the bud, then I can through out the bud or try to reuse again and get every little bit of THC out.  I start with one regular spoonful and wait an hour, then boost as needed.",
  "******NOTE*******",
  "It takes about a gram of A grade cannabis for me to really get a buzz the first day.  The next day it will take less and so on to where if I consume it every day it starts building up and I need less to activate it.  By the fourth or fifth day I won't need but like a half of a gram to get high.  Also, if I smoke after eating or drinking cannabis it is way more intense.  In fact I prefer to ingest some so I don't need to smoke as much to get high.  One bowl will last way longer this way even if I ingest only a half a gram. Anything less than a half a gram without continuous use for a week or so won't get me too far unless I smoke an hour or two later.",
  "I wish I knew of this before I Started smoking as I think I would have not smoked so much for so long (4 years).  Its definately a less offensive way to get high during the day and if I smoke a bowl at night I will get zonked and sleep hard.  After 4 or 5 days of eating and smoking maybe a dozen bowls, I hibernate for like 12 hours which is unusual cause I usually sleep 7-8 max.  Then I feel I need a break of a couple days to clear out a bit. I will get high like the first time after eating a good bit then smoking.  I'm trying to get to where I only eat or vaporize the bud but smoking has been a longtime habit and sometimes I want that 'burning lung' feeling.</p>"
 ],
 "erowid": {
  "id": "54266",
  "citation": " Illuminaire. \"Optomistic Herb Day: experience with Damania, Sceletium tortuosum (Kanna), Leonotis leonurus (Wild Dagga), Lactuca - L. virosa (Opium Lettuce), Argemone spp. (Prickl (ID 54266)\". Erowid.org. Aug 27, 2009. erowid.org/exp/54266",
  "substance": "Damania, Sceletium tortuosum (Kanna), Leonotis leonurus (Wild Dagga), Lactuca - L. virosa (Opium Lettuce), Argemone spp. (Prickl",
  "views": "21300"
 }
}
