{
 "title": "Relearning Self-Awareness",
 "author": "THCo",
 "citation": " THCo. \"Relearning Self-Awareness: experience with Cannabis (ID 16978)\". Erowid.org. Jun 10, 2005. erowid.org/exp/16978",
 "substance": "Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I did not start smoking cannabis until I was in my 20's, and I never became a chronic user. I used to partake at parties, and would sometimes binge on a Saturday. My use was about once every month or so.</p><p>While I was in university, I did a planned binge with a friend. We stared out doing 'subs' (bottles used to force 2 litres of smoke into your lungs at a time). We went on to using a homemade ice bong, and finally down to smoking joints. We probably did well over an ounce between us. I was chair-bound, and my friend was having minor visual hallucinations. I felt fine the next morning.</p><p>That night I went to a concert. Before we left, we shared a few joints from the same stash we used the night before. I felt very good and euphoric, and we headed out. I noticed at the concert that I was insensitive to pain, as I was moshing and getting royally banged up with no real feeling.</p><p>I woke up the next morning, and felt strange. The euphoria was gone, but my ability to focus and my sense of reality and my part in it was altered. I felt disjointed. I went to classes, and forgot the lecture 10 minutes after I heard it. I wandered the campus feeling a bit paranoid, and wondering if anyone could tell I was different. I got home, ate, and went to bed.</p><p>I woke up the next morning, and still felt disjointed. I tried using meditation and other techniques to fight the feeling. I did a bit of research, and found out that I probably had a concentration of THC still in my system, so I just relaxed and went with it, under the assumption that it would be over when my body flushed it out in a few days.</p><p>That did not happen. This went on for a bit over a month. I found that I had photographic recollection of trivial facts, but still could not focus on the here and now. I could recite lines from movies I saw a year ago word for word, but couldn't read a book without constantly going back a few paragraphs to remind me of what I'd already read. I wandered around a park late one night, and came to the realization that the cannabis had somehow altered my perception of self, and that this might be the 'no-mind' that buddhists try to achieve. I became diligent in performing simple tasks immediately, as I would forget about them within 10 minutes if I didn't.</p><p>As mentioned, this state eventually resolved itself. I theorize that I just had to relearn self-awareness, much like a stroke victim has to relearn how to use his muscles. I have smoked cannabis a few times since. Partaking large amounts once is fine. Small amounts over a long period is fine. Heavy use over a couple of days recreates this altered state, but it goes away within a week or so. I am always careful with how much I smoke now. I don't want to have that type of hangover again!</p>",
 "year": "1995",
 "id": "16978",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-10T07:00:00.000Z",
 "views": "3884",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
