{
 "id": 16983,
 "title": "LSD-Like Properties?  Nope.",
 "date": {
  "submission": "2008-12-28T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rattrap",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-6x"
  }
 ],
 "report": [
  "Two years ago, I tried salvia and felt a slight physical pull and some odd thoughts.  Therefore, I was not expecting much when I tried it again recently.",
  "I was instructed to take off my shirt due to perspiration issues.  I was skeptical that I would need to.  I took my (large) hit, held it in and laid down on the bed.  I was in a small bedroom.  As the effects increased, I did not have time to remark how powerful the salvia seemed.  I quickly forgot that I had taken anything, and just about everything else that I had come to know about anything. ",
  "In this new world, I felt bodily sensations but perceived myself as some sort of speck without a body, traveling along a new plane of reality which seemed hauntingly familiar.  Time and space had altered to the point where there was no direction, or stimuli to judge the passage of time.  My best description of these new dimensions is that the walls, ceiling and floor had sandwiched together.  I was traveling along the edge, but was being carried or pushed  nothing was voluntary.  I was along for some sort of ride, but not the kind of ride that has an end.  I immediately felt that this was my permanent reality, and this scared me.  Keep in mind, I didnt know how I arrived here.  There was no context at all, no frame of reference.  I didnt desire to go back because I had forgotten what sober reality was, and couldnt comprehend the notion of an altered state.  Very odd.",
  "At one point I had to pass thru a wall of cubes of some sort, like I was on an assembly line at a factory, and was thinking Theres no way in hell Im making it thru there!.  I was worried that my arms and legs would be flattened or lopped off.  In my journey I had no body, but I suppose another part of me insisted that I should.  I remember hearing the voices of my family and friends talking to me as if everyone had to travel thru this ride.  The voices were saying things to the effect of Youre almost there!  Come on, you gotta squeeze thru!.  I was wondering to myself, why do I have to?  What am I squeezing thru?  Does everyone in the universe have to endure this?",
  "As mentioned before, there was a familiarity about the process.  I felt intense bodily pressures, like being forced into the neck of a bottle and thinking I would never fit thru.  I felt a distinct wave of expanding or contracting pressure pass thru me, feet to head, as if I was being zipped up in a jacket, or being run over by a steamroller.  An analogy that occurred to me at the time (and I reportedly said aloud) is that Im being swept away like a broom!.  What I had meant was, I felt like a speck of dirt being carried by a broom, surrounded in bristles that prevented me from judging up from down, where I was, etc. ",
  "I distinctly remember pulling everything out of my pockets and tossing them on the floor, but I dont exactly remember why.  This was ironic, because my friend had said I might have the urge to take off my clothes. ",
  "As I came down over the next few minutes, I felt extreme relief as I slowly realized why this had happened to me.  I felt relieved that I didnt have to exist in a tumbling sea of altered dimensions for eternity.  It felt great to have a body, and to feel the nearby fan blowing air on me.  In this way, I enjoyed the post-trip introspection much more than the peak, which was frightening but more than that, simply too bizarre to categorize or qualify. ",
  "My friends said I had slid around the bed onto the floor, had tried to climb under the bed, all around the room, etc.  I dont remember any of that. ",
  "During all of my previous trips (LSA, LSD, shrooms, 2ci, etc.) I was always able to attribute any effects to the drug and my setting.  I could not do this with salvia, and herein lies my discomfort with it.  It took over completely.  I dont think I couldve prepared myself.  This stuff makes the notion of writing you are tripping on ones hand seem like a joke.  It is extremely powerful, but not in an ego-rooted, self-analytical despair kind of way.  It is powerful in a 'complete transformation of everything I thought I knew about everything' kind of way.  It scares me that the media is labeling salvia as a legal hallucinogen with LSD-like properties.  That is a crock of bullshit.  They should say it is a legal hallucinogen with Salvia-like properties.  From what I have read and experienced, the salvia experience is unlike any other."
 ],
 "erowid": {
  "id": "54341",
  "citation": " Rattrap. \"LSD-Like Properties?  Nope.: experience with Salvia divinorum (6x extract) (ID 54341)\". Erowid.org. Dec 28, 2008. erowid.org/exp/54341",
  "substance": "Salvia divinorum (6x extract)",
  "views": "3240"
 }
}
