{
 "title": "Interlaced Geometric Manipulations",
 "author": "Teacher of Wisdom",
 "citation": " Teacher of Wisdom. \"Interlaced Geometric Manipulations: experience with Mushrooms - P. cubensis (ID 16981)\". Erowid.org. Aug 1, 2005. erowid.org/exp/16981",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "200 lb",
 "report": "<p>I have had experience with other psychotropic substances such as cannabis, anti-cholinergic, stimulants, narcotics, and depressants. Although there is much beauty in the world of altered mind states, none provide the sparkling beauty as provided by psychedelics. It is because of my experiences with these drugs that I refuse to call them hallucinogens. It is clearly pointed out through experience that something much deeper occurs than mere hallucinatory phenomena. I always try to start my trips in a mind frame that is free from worry, pain, sorrow, so forth and so on. It is important to me to make sure that the environment in which they plan to consume and experience in, is one in which they are comfortable.</p><p>I generally make no fuss about the preparation of psychedelic fungi, I like them just the way they are naturally found. However, because I like to keep a reserve, I do labour to dry them. All of the accounts mentioned will be experiments carried out with dried carpophores.</p><p>Account Number One</p><p>Upon sunrise I begin to consume the fungi. After about an hour and a half I feel an alert - a signal that I am being lifted to the realms of the mushroom. I feel an odd emotional-physical feeling which is accompanied with heightened perception. The carpet looks many times richer in green than before, and now that I notice this, I notice that its color is not only enhanced, but it has a three-dimensional surface never detected before. I tend to detect three-dimensional surfaces when I take mushrooms. I feel a sort of detached feeling, like I am a separate entity. Conversation is somewhat difficult. While I am talking to a very close friend, I see some sort of shadow in the window which resembles some sort of pre-historic dinosaur-bird. It flaps its large leathery wings to empower its graceful flight over the mountainous landscape. The wood grain-like patterns on the wall are shifting around, some resemble human faces in various emotional states. However, all faces are greatly distorted; nothing like normal portraits.</p><p>As I walk outside I realize that the effects are fading away, I was sad to see it leave, yet I knew it had to and that was the way things worked. I felt relaxed the whole day, I also had a resurrected feeling of a being of total divinity, I wonder to myself maybe there is a God.</p><p>Account Number Two</p><p>This time my environment is somewhat different from my previous environments. My cousin, whom I call Al, has decided that he would like to experience the effects of the Psilocybe. So I agree to lead him into his first experience - somewhat like the curandera Maria Sabina, of course different, I mean, I am not a catholic/shamanic/Aztec healer!</p><p>My cousin has not the will to eat the mushrooms, for fear of a taste he might not like. So, I prepare a beverage for him by boiling the fungi in water. I must have boiled them for too short a time, because he noticed little effect. Although this sorrowful thing has happened, I have not given up on the idea of making him believe if he shall want to. While waiting on the effects to occur, me and my close friend smoked a cigarette of cannabis. I suppose this is not only a shitty thing to do but it also sets a shitty example. I do not like to mix different drugs. However, we must all break the boundaries of human failure and try againOH BOY!! Here it is! The horizontal lines which are painted on the outside of my home begin to converge together on an infinite scale. A large pecan tree shows me that it is made of many small units. I am in a harmonious utopia, filled with the sounds and sights of nature. A thing that stands out with this particular experience is that it seemed to be centered around spatial distortion of images.</p><p>I begin to feel isolated, however this time I dont want to go with the mushroom, I want it to go by itself. I rationalize that this is because Al feels nothing and I do not want to go without himI close my eyes, I lose the feeling of isolation and do not realize until sometime later that I am traveling down an immense tunnel which is composed of interlaced geometric manipulations, all spiralling contrary to one another yet forming a whole The music Al has been playing brings me back to the feeling of not wanting to leave normal reality, except this time it is much more pronounced. As the music wails its sorrowful notes I want to moan in anguish. I have a strong desire to use the bathroom, drink, and lay down all at the same time. I go to lay down upon the bed after several attempts to do all the above mentioned task at the same time. When I lay there I feel slightly better. I seem to think I can sleep my way out of these feelings. Only when I try to escape by the methods of sleep I am encountered by strange visions of electrical/biological/annoying creatures traveling on some kind of electrical railwayUpon the floor I see beings that seem to be mythological mammalian/plant-like/deities, all rising out of the floor. There also rainbow like hallos, and colorful burst</p><p>You may be wandering why I refuse to call them hallucinogenic when I have spent a vast amount of text describing perceptual aspects of the trip? The answer is because, not only did the psychological manifestation unveil itself last, it was to good to be put forth first. I suddenly after much trying to identify the psychological cause of the anguish, I suddenly seen it all unfold. Years ago as a child I had read a book, it was a scholastic book that in a story presented a scene in which a girl flicked a booger at a shy boy named Eddy. As stupid as this seems, it was down-right revelation. I felt comfortable, all the complexity was resolved. I came to baseline in about four hours total. I enjoyed a nice nights sleep.</p><p>The psilocybin containing mushrooms are certainly something to add to someones psychedelic repertoire.</p>",
 "year": "2002",
 "id": "16981",
 "gender": "Male",
 "timestamp": "2005-08-01T07:00:00.000Z",
 "views": "3066",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
