{
 "id": 16997,
 "title": "Empty Stimulation",
 "date": {
  "submission": "2001-05-22T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "CBill",
  "gender": "Male",
  "weight": "194 lb"
 },
 "dose": [],
 "report": [
  "Towards the end of the year 2000 I started experimenting with cat. I tried a few different methods of synthesizing it from psuedoephedrine and found, although it was the longest and most boring, the cold reaction works best because it isn't so demanding of precision in measurements. The first batch I made was pretty weak and only gave me a glimpse of the effects. Just that constant awareness of your forehead and a jaw clench. This was at around 20 to 30 mg, railed.",
  "Cat is just an 'o-kay' drug in the first place. There isn't anything about it that is cognitively or 'intellectually' stimulating. I used to wonder why there isn't a lot of info on it, now I know why; there isn't a lot to cat.",
  "I didn't really appreciate its effects until I took a decent oral dose dissolved in orange juice. I put 70 mg in my drink and choked it back in about 5 minutes. Typical of ketones, cat smells divine when in solution. If you've ever smelled cherry juice concentrate, you know what cat smells like. That isn't the only good thing about it, though. It has a nice body high and gives you tingles all over. My dick tried to retreat back into its foreskin and inside my body. That didn't feel nice, but was tolerable.",
  "Smoked: The coldsynth batch of cat I made had a pretty neutral pH so I tried to smoke some. I put 100 mg in a test tube and got a straw to breathe in the smoke. I was already stoned before I smoked the cat. It didn't taste too bad and was easy to take it. I could really feel a definite change in my mood and high when I smoked it, but none of the euphoric or really edgy effects were present. It just made me more awake.",
  "Intranasal: On new years eve I railed 50 and 100 mg lines all night long, and when it was finally time to go to sleep I took an antidepressant and smoked some nice sativa bud which laid me out nice and smoothly. Supposedly railing is the most efficient method of ingestion next to slamming it, but I found oral ingestion better.",
  "Oral: All I had left after the long-run on new years was about 400 mg. I felt safe with taking 400 mg so dissolved it in some juice and drank up. I felt the effects really strong this time. It was good, pure energy I could have used to play sports or clean the house. The mind still wasn't going anywhere though.",
  "This was when I found out about the bad, bad effects of cat. Not having taken this large a dose all at once before, I wasn't prepared for the crash. It is pure hell. It made me very moody and depressed after the good effects wore out. Not only that, but I smelled like shit. I literally smelled like shit. Those are pretty much the down sides. Oh yeah, did I mention it's VERY ADDICTIVE. It'll leave you jonsin' like you haven't ever jonsed before after the first time you take it. Over all, if you are going to use it, use it spairingly. Having something like cannabis or GHB to mellow out the effects may be a good idea, and wear a lot of deodorant if you take a hefty dose."
 ],
 "erowid": {
  "id": "5441",
  "citation": " CBill. \"Empty Stimulation: experience with Methcathinone (ID 5441)\". Erowid.org. May 22, 2001. erowid.org/exp/5441",
  "substance": "Methcathinone",
  "views": "19523"
 }
}
