{
 "title": "Wrigglin' Out of my Pants",
 "author": "Leah",
 "citation": " Leah. \"Wrigglin' Out of my Pants: experience with Cocaine (ID 17)\". Erowid.org. May 31, 2000. erowid.org/exp/17",
 "substance": "Cocaine",
 "bodyweight": "110 lb",
 "report": "<p>What I had really wanted to get was ecstasy but all my friends were dry that night. and you know how it is when you get it in your head to be fucked up. you have to get something. so a friend was selling eightballs (3.5 grams of coke)and I went ahead and made the purchase. My best friend had done coke before - is still fighting the addiction - and so I knew that if I was going to do this I would at least have someone experienced around me.</p><p>I was so nervous before I did that first line. My stomach was all in knots. In retrospect, I did a monster line. Almost immediately my pulse sped up and I felt a little edgy. After a few minutes I calmed down and did another monster line. I began to feel almost as though I was on X, only I had much more energy and couldn't stop moving around. My friend chooses to use coke with needles, and though at first i refused to even watch him, I was so out of my head after maybe an hour that when he offered to give me a hit intravenously, I didn't have any problem with it even though I hate needles. I'm not sure where my self-defense mechanisms went, but all I cared about was how to get a better rush. I wanted to know what my friend was feeling. I was talking a mile a minute, feeling very open. In that respect it was similar to ecstasy, but without the physical sensetivity. The intravenous rush was more like smoking rock than snorting the powder. Almost immediately I felt something pushing me back, making me relax, making me feel good. I had to close my eyes. I did that twice (though I'd said only once and never again), and I hope I never do it again. I don't like the idea of having no real self control. I did so much coke that night that I physically could not stop moving around. We started using at around 11:30 PM and the next time I looked at the clock it was 4:30 in the morning. I couldn't believe that so much time had passed.</p><p>By 6:00 the entire eightball was gone. I don't know who had the majority of it, but my friend was coming down hard while I was still wriggling around in my underwear and a tank top (at some point during the night I had decided that the pants needed to come off).</p><p>I left his house with a bad feeling. Using cocaine can be a social thing, but not if an addict is involved. It wasn't as though we were hanging out together and doing this. He was using and I was using and we were in our own separate worlds. I don't feel good about that. I feel drugs should be used to enhance, not to separate.</p><p>So from that first experience I learned that 'everything in moderation' should be applied to cocaine as well. ODing on coke, a line that I believe I was teetering on, is no fun. Coke can be fun, but not if you use it for the wrong reasons (eg: because you need more, because you're depressed, etc). Be smart, listen to your body, and be careful. </p>",
 "year": "2000",
 "id": "17",
 "gender": "Female",
 "timestamp": "2000-05-31T07:00:00.000Z",
 "views": "56297",
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "IV",
   "substance": "Cocaine",
   "form": ""
  }
 ]
}
