{
 "title": "When They Found Me My Lips Were Blue",
 "author": "P",
 "citation": " P. \"When They Found Me My Lips Were Blue: experience with Heroin (ID 17004)\". Erowid.org. Jan 14, 2005. erowid.org/exp/17004",
 "substance": "Heroin",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "IV",
  "Heroin",
  "(liquid)"
 ],
 "report": "<p>I have been using heroin for around a year now, injecting for 5 months. This experience was probably my worst and last experience with heroin.</p><p>WARNING : Heroin potency varies dramaticaly. ALWAYS test with a small amount to check the potency. We did not this time. That was the problem.</p><p>9:00am - A friend and I decided to go to my house and do the rest the heroin we purchased the night before.</p><p>Yesterday</p><p>9:10 - We arrive at my house and get situated. We gather our tools and get ready. We cook the first dose and my friend took it (IV). After I made sure my friend was comfortable and feeling alright, I got mine ready.</p><p>9:30 - I cook my doses and sucked it up in to the syringe. I leaned back against the wall, stuck the needle in to my vein, and injected the heroin.</p><p>Around 10 seconds later I felt 'the rush' come one along with a strange burning sensation that my friend had described the night before. I leaned back and complained to my friend about the sensation while also enjoying the pure bliss running through my body. This is the last thing I remember.</p><p>Note : this heroin was extremely potent. My normal dose was probably twice as strong with this.</p><p>10:15 - I wake up in an ambulance convulsing ,soaking wet and freezing cold (my friend had thrown me in a cold shower along with giving me c.p.r. befor calling 911). People were holding me down, asking me questions and holding a mask to my face. All I could think was 'WHAT THE FUCK IS GOING ON?! WHY CANT I STOP SHAKING!?' They had givin me Naloxone/Narcan to block the opioid receptors so I would be able to breathe again. I was breathing fine but could not keep my body still. They put a blanket over me to try to warm me up from the cold shower.</p><p>Note: My hearing was VERY muffled.. I don't know what this was from. Maybe a side effect of the narcan?</p><p>10:45 - We arrive at the hospital and they bring me out of the ambulance. I see my sister standing there. They take me in to the hospital and lay me on a bed with a new blanket and start taking blood samples, administering an IV, and a catheter (which was not very pleasant). After fading in and out of conciousness for around an hour, my friends and family were allowed to come see me (2 people at a time). In a few hours I was released and we went home.</p><p>I feel fine today after a lot of sleep. Still drowsy with some discomfort in my chest from my friend banging on me when c.p.r wasn't working. Also my upper legs/hips are very sore for some reason. Either because of all the convulsing/muscle tension or minor withdrawals from the Narcan.</p><p>Final note: If you are planning on doing heroin, PLEASE BE CAREFUL. Take a small dose before you go all out to make sure the substance is not too potent for you. Use clean needles. And if possible, purify your heroin. There is an article on how to do that called How to Purify Street Heroin. Heroin is a serious drug and is to be taken SERIOUSLY. When I went out, my friend found me... my lips were blue, tongue was purple, and my skin was turning a greyish color. I DIED. Luckily my friends were smart enough to CALL 911 instead of trying to revive me themselves and not calling because of the threat of them getting in trouble. You might not be so lucky...</p>",
 "year": "2002",
 "id": "17004",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-01-14T08:00:00.000Z",
 "views": "36816",
 "dose": {}
}
