{
 "id": 17007,
 "title": "Hyper, Happy, Itchy, and Drowsy...",
 "date": {
  "submission": "2006-07-12T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "desperate psychenaut",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Methadone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I acquired regular access to methadone through someone else's prescription (given for treatment of severe, chronic, long-lasting nerve pain).",
  "I've generally consumed it orally, in the form of a few tablets.  Sometimes I've snorted it, but, FYI: I get that burning sensation of snorting something acidic combined with the there-are-worms-burrowing-into-my-face/someone-is-sticking-needles-up-my-nose sensation of snorting dxm.  It's not quite as bad as snorting diphenhydramine or dxm but it's pretty close, so I'd advise against it (quick treatment: snorting a little bit of water, but not too roughly---I don't want to get it farther into my sinuses, and the water will temporarily make the pain worse---waiting about half a minute, then starting to blow my nose until the pain starts to subside).",
  "I prefer 30-40mg.  Dosages above that tend to make me uncomfortable and sometimes make me drowsy or cause that constantly-nodding-out-effect like large amounts of muscle relaxers sometimes do.",
  "Side note: I tend to take DXM often, and I've heard that may affect opiate tolerance.",
  "The experience goes something like this:",
  "T+0:30 to T+1:00 - onset of stimulation and a bit of itching",
  "T+1:00 to T+6:00 - a little happy, a little stimulated but calm, and pretty itchy (I hold off on scratching as much as I can, scratch lightly, don't scratch the same spot over and over, and only scratch a few seconds at a time, hydrocortisone usually doesn't help that much)",
  "T+6:00 to T+10:00 - less itching, less hyper, and more calm and contentness, I can fall asleep at this point, if I can hold off on scratching myself (a little xanax would help)",
  "T+10:00 to T+30:00 - effects slowly trail off, and I may get really drowsy during this period, on-and-off, periodic caffiene or a bit of ephedrine tends to help",
  "The itching tends to come and go in waves.  The stimulation effect is something that I won't notice much, but the people around me do, it's similar to percocet or oxycontin, but not as strong.  The happy and content feelings creep up on me gradually, but if I've been feeling down, I won't feel down any more, although I don't tend to become so euphoric.",
  "I've enjoyed this drug, and I haven't gotten hooked on it.  I think taking it only once to thrice a week and the DXM may have helped this (although I tend to not crave drugs in general).",
  "This might be good for a night out dancing or socializing, taking a couple benadryl an hour or two before dosing helps with the itching.  I can also take another benadryl every handful of hours after dosing, but discomfort, confusion, and sedation comes with taking more than 3 or 4 benadryl!",
  "If prone to itchiness, this is probably a good thing to avoid.  Might be pretty tired the next day, this may have something to do with the high half-life and long comedown, or may be from the stimulation of the first hours that the drug is in one's system."
 ],
 "erowid": {
  "id": "54462",
  "citation": " desperate psychenaut. \"Hyper, Happy, Itchy, and Drowsy...: experience with Methadone (ID 54462)\". Erowid.org. Jul 12, 2006. erowid.org/exp/54462",
  "substance": "Methadone",
  "views": "20081"
 }
}
