{
 "id": 17021,
 "title": "A Successful Combination",
 "date": {
  "submission": "2008-03-21T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "PsycheDevil",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>I had several positive DXM experiences while taking 150 mg of Effexor XR (venlafaxine) daily.  I took DXM in the form of Robitussin Maximum Strength Cough, since it contains only DXM (besides all the icky syrup).  My usual dose was 2.7mg/kg.  My DXM and Effexor experiences took place mostly in the presence of a loved one and/or friends, in a private setting.  Listening to electronic music always was pleasant for me.  Sound would seem like it was coming in waves at times, as opposed to a continuous stream.  Also, visual information, and especially motion, would come in frames.  I found this to be quite entertaining.",
  "One possibly negative perceptual alteration involved being somewhat cut off from my bodily senses, such that I may not be able to detect my own heartbeat.  Nausea definitely was not uncommon, but I found that not eating anything heavy for a few hours before ingesting DXM was a good idea.  At the same time, I usually would eat something very light before ingesting DXM, such as crackers or bread, so that my stomach would not be entirely empty (which also can contribute to nausea).",
  "My DXM experiences were not blunted or reduced by being on Effexor, and I had no negative reactions as a result of the combination.</p>"
 ],
 "erowid": {
  "id": "54522",
  "citation": " PsycheDevil. \"A Successful Combination: experience with DXM & Venlafaxine (Effexor) (ID 54522)\". Erowid.org. Mar 21, 2008. erowid.org/exp/54522",
  "substance": "DXM & Venlafaxine (Effexor)",
  "views": "8037"
 }
}
