{
 "title": "Uncontrollable Laughter, Then Sheer Terror",
 "author": "Luke",
 "citation": " Luke. \"Uncontrollable Laughter, Then Sheer Terror: experience with Salvia divinorum (7x extract) (ID 17021)\". Erowid.org. Apr 23, 2003. erowid.org/exp/17021",
 "substance": "Salvia divinorum (7x extract)",
 "bodyweight": "200 lb",
 "report": "<p>This report describes two experiences on the same evening.  I had tried salvia before and the effects had been mild at best.  I smoked untreated leaves and achieved nothing more than a 'loopy' feeling that lasted for around 5 minutes.  Last night was a little more intense.  I bought some 7x extract off of the 'net for a second trial.  I hoped the more potent preparation would give me the pychedelic roller-coaster ride that had been described in other reports.  I got myself sat down in my comfy recliner, packed a small bowl into the 'water-pipe' I had purchased for this experience.  I took a big hit, smoking all of the material in one shot.  Before I could get the pipe put down I started to giggle.  The giggle rapidly grew into a total body laugh.  I was laughing so intensely that I couldn't get the pipe put down, so my sitter (my roommate) had to take the pipe away from me.  What happened next was all kind of fuzzy. </p><p>I just remember laughing.  Not really because anything was particularly funny, but just because I couldn't stop.  My laughter was really the only thing I was aware of.  I couldn't really remember where I was, nor did I care.  This lasted for about 5 minutes.  I then started to drink some beers, had dinner and just hung out for about 5 hours.  Then, after I had gotten fairly drunk, I decided to give the green stuff another shot.  I loaded up a similarly sized bowl and hit it again, smoking all the herb, again, in one toke.  I started to laugh again, but that only lasted a few seconds.  Then I was terrified.  I sat with my face covered for a good 5 minutes according to my roommate.  All I can remember is a overwhelming feeling of being scared out of my mind.  Again, there were no visuals to be scared of, but terror was the only thing my mind and body were aware of.  Its like turning the treble all the way down on the stereo, and the bass all the way up to where that is all I can hear. </p><p>The only thing I was capable of feeling while on that trip was fear, very intense fear.  I eventually came down and was ok of course.  Its really hard to say if this was pleasurable or not.  I will definately be trying it again, probably this evening if nothing better to do comes up.</p>",
 "year": "2002",
 "id": "17021",
 "gender": "Male",
 "timestamp": "2003-04-23T07:00:00.000Z",
 "views": "7913",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "2": {
   "time": " T+ 5:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
