{
 "id": 17040,
 "title": "GHB for Anxiety; Dosing Requires Great Care",
 "date": {
  "submission": "2006-09-18T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SPD",
  "gender": "Male",
  "weight": 67
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "GHB",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I first decided to try GHB after reading about it on the web and it sounded like something that might be useful for my own situation. I have been suffering with anxiety for most of my adult life, particularly in social situations. I tried pretty much every type of med you can be prescribed for anxiety including all the major SSRIs and finally ending up spending 3 years on Valium. So I decided to take matters into my own hands and explore other forms of treatment.",
  "At the time when I first heard about GHB it was quite easy to get hold of online and there were several sites selling it and shipping to the UK. It wasnt even illegal to buy it in the UK. It was only later when GHB gained a reputation as a date-rape drug it became harder to get.",
  "I purchased around 200g of GHB from a manufacturer in South Africa and it came in a plastic tub with a lid. I can't remember exactly how much it cost back then, but it wasnt much more than 25, which seemed good value considering the low doses used. It looked a bit like salt. Slightly granular crystals, but softer and lighter than salt.",
  "The first time I tried it I was a little nervous and wondered if it was safe so decided to try just half gram. Inside the container was a handy measuring spoon for 1g. So I half-filled the spoon and mixed it into a glass of water and necked it down. It didnt taste unpleasant, slightly salty and chemically.",
  "After waiting 30 minutes I didnt really feel anything much and decided to try a full gram of it but thought it best to wait a while. Later in the afternoon I measured out a gram and mixed it with water again. This time within 20 minutes I started to feel something. It was a very subtle mentally and physically relaxed feeling, kind of a head clearing. No other physical sensation really.",
  "Keen to experiment further and remember the guidelines about the dosages, I decided to try 2g the next day. This time it was a bit harder to drink in water, so I necked it down quickly. This time the experience started with a slight physical buzz and the same mentally relaxed feeling.",
  "Taking GHB in these carefully measured stepped doses is very useful (and important) and I was glad I did for reasons I will go into later. Back to the first experience though. After trying 2g and feeling the physical buzz I wanted more of a buzz so decided",
  "to up the next dose to 3g. I waited a few hours first to let the earlier dose pass through my system so as not to accidently overdose.",
  "I took 3g in a glass of coke and it went down no problem. This time the feeling came on much stronger and felt like being intoxicated by alcohol. About the same as drinking a strong beer, but with that now familiar physical buzz and warm feeling. It lasted about an hour or an hour and half and then gradually wore off without any comedown.",
  "Over the course of the summer I began to use GHB almost daily in place of alcohol, which I had previously used to mask my anxiety and difficulty socialising. GHB did the job of alcohol but with the added benefits of a nice physical buzz and no hangover or sick feeling. I kept my GHB measured out into little 3g bags so I could just empty it into a cola whenever I needed it. The only problem was doing that in public isn't a good idea as people think you're doing cocaine when you start emptying little bags of a white powder into your drink!",
  "Anyway I kept to 3g doses and had no problems, really enjoyed it. Overall I would say GHB is a useful substitute for alcohol, or for anyone needing to relax and chill. It's not really something I want to take if I am looking to get high or after a rush. It's more a tranquilising or sedative effect. Another good thing about GHB is that it makes me sleep better and more rested so I wake up refreshed.\rPART II",
  "I had been using GHB for 2 or 3 months and felt pretty ok with it and the dose I was taking at that time which was 2-3g. But I started to get a bit careless, and one time I had already taken 2g in the morning, and then I decided to take 4g a couple of hours",
  "later while on a bus of all places! It was a long journey and I was feeling a little anxious, the 2g I took earlier had began to wear off so I thought what the hell, and and emptied the 4g bag into a can drink. About 15 minutes into the journey I began to",
  "feel quite drowsy and had trouble keeping awake. Strangely I didnt associate this with the GHB initially and just thought I was tired from my lack of sleep the night before.",
  "But as the journey continued I realised it wasnt a normal kind of drowsy. It was more like being anesthetised. Everything sounded distant and I felt like I was inside a tunnel. I was fighting to keep my eyelids open and got scared thinking I might pass out and end up in hospital. I began drifting in and out of consciousness and it took every bit of strength to keep awake to the end of the trip. By then, walking around started to wake me up and I although I felt quite groggy (like after an operation) I was able to function ok still. This experience scared me though and made me realise how easy it is to overdose on GHB and what the consequences could be.",
  "The dosage curve is steep after 3g."
 ],
 "erowid": {
  "id": "54578",
  "citation": " SPD. \"GHB for Anxiety; Dosing Requires Great Care: experience with GHB (ID 54578)\". Erowid.org. Sep 18, 2006. erowid.org/exp/54578",
  "substance": "GHB",
  "views": "15556"
 }
}
