{
 "id": 17047,
 "title": "Intensely Profound Awareness",
 "date": {
  "submission": "2010-02-13T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "de Tokinchicken",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I recently obtained 500mg 2c-t2. I know it is heavily reccommended to use a scale when working with such sensitive drugs, but i did not have one. I did use extreme caution and slowly moved my dose up, and i am guessing this experience was between 25-35mg.",
  "9:45: parachute the fluffy powder.",
  "(+1 hour): I am slowly taken over by a very strange feeling, kind of cold running through my entire spine. The world begins to take on a different sheen then before. This all builds very slowly over 1 and a half hours.",
  "(+1.30 hour): I quickly observe open eye visuals have begun, including items shifting around, appearing larger and smaller then normal. Everything just kind of moves around ever so slightly.",
  "(+2 hour): I realize i will finally have a very strong t2 experience as im already hitting the point i hit, a little after peak in previous experiences.",
  "(+3 hours): T2 had an EXTREME mental effect on me. It was not the egodying confusing mindfuck shrooms gives. It was not the semi breakthroughs lsd gives. Basically it took everything I ever have learned in my mind, and attempted to sort and pick through trying to explain what really happened in history. ETC.",
  "(from +3 hours until +9 hours): still feeling it very strongly, the exact same effects present, and very very slowly dying down. It took a long time to go through my entire mind and figure out the universe.",
  "I am 100% suprised this wasnt the drug to prove drugs are not as evil as the government says. I think this could be the key to every psychological illness people go to psychiatrists for. I find it just fascinating they cover these things up so well."
 ],
 "erowid": {
  "id": "54600",
  "citation": " de Tokinchicken. \"Intensely Profound Awareness: experience with 2C-T-2 (ID 54600)\". Erowid.org. Feb 13, 2010. erowid.org/exp/54600",
  "substance": "2C-T-2",
  "views": "2602"
 }
}
