{
 "id": 17054,
 "title": "Just Like Truman",
 "date": {
  "submission": "2002-01-16T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "indole",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "The first time I tried Salvia Divinorum I was waiting for my arms to grow like a long vine plant or something.  Nothing grew except slight anxiety.  The second time I tried I inhaled not one but two tokes -- an experience worlds apart.",
  "First, slight anxiety like the coming on of a bad trip, but no time to unfold, I was hit with a force that decided to dunk my head up and down in water struggling for air.  Over and over and over again, until like in that movie The Abyss, your lungs get accustomed to the vibrational flow of water down your lungs or energy flow and you continue! My girl friend, standing in front of me just staring at me (very annoying) turned into a Jabba-the-hut girl with tail and all.  She kept the same face, but her body grew big and fat.  This grotesque image took up my whole visual field.  It was like a Jabba-the-hut room with the edges of the room peeling in a psychedelic manner.  Next segment: I'm suddenly in a vaguely familiar but alien bedroom of a friend from high school and there are about 8 of us but everyones behind me for some reason.  They all know something I don't and are waiting for me to speak as some sort of evidence of my condition.  This is really starting to freak me out so I don't say anything, or should I say I can't say anything! I have that uncomfortable feeling of 'on the tip of your tongue' and then it turns into a big joke, and/or lottery of some sort and feel really quite embarrassed like I'm sitting there nude, or worse like I am a poor animal trying to understand a human joke of some sort. ",
  "After this segment I start to remember my name and what I am doing there.  I had the common feeling that my whole life was leading up to this one point in time of all these friends from high school + my girl friend ready to tell me the secret of my life (exactly like The Truman Show).  I now know how it feels to be Truman! It feels kinda cool actually.  I also had a flash of a sort of greenhouse room I dreamed many years ago that was neat.  I finally had the courage to walk out of my room into the hallway and felt extremely fucked up and unsure.  This comes close to the best acid I have ever experienced.  TOTAL EGO LOSS, except no good thoughts more like sick, twisted, demented, dumb, funny, nonsense, scizophrenic, paradoxical, struggling thoughts. I dont even really consider it a drug because I can't even relax and watch like a movie.  I have come to the conclusion that I have a way too complex mind for smoking this material, so next time I have decided to try sublingual extract instead."
 ],
 "erowid": {
  "id": "5463",
  "citation": " indole. \"Just Like Truman: experience with Salvia divinorum (10x extract) (ID 5463)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5463",
  "substance": "Salvia divinorum (10x extract)",
  "views": "6242"
 }
}
