{
 "id": 1705,
 "title": "2 Tee Hee",
 "date": {
  "submission": "2000-10-10T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Prana",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "capsule"
  },
  {
   "time": "3:15",
   "amount": {
    "number": "6.0",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "powder/crystals"
  },
  {
   "time": "5:30",
   "amount": {
    "number": "10",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Well, I started out the night with my friend coming over with some 2C-T-7. I had done my research and I was excited to try it. I had just eaten something light (a baked potato with hot sauce), so I was ready. I started out taking a 20mg dose in a capsule at 10:30PM. Now the fun starts. The waiting.",
  "My friend and I are musicians, so we started fooling around with our synths and stuff, just experimenting with sound. My friend had taken some before he came over, and He started feeling effects about 1 hour after coming over(11:30 ish). I was still waiting. 12:30 and nothing. 1:30 and nothing. Yikes, 3 hours? And a stomach ache to boot. I don't think the 2C-T-7 liked the hot sauce in my belly! So, I went and took a shower. That helped to sooth my belly-ache. When was this going to kick in?",
  "So, my friend and I each inhaled 5 to 7mg more. It really burns. Not as bad as snorting E or Crystal though, so it's at least tolerable. At 2AM, I finally started feeling something. Just a 'fuziness' inside my body and mind. At 2:45AM a slight bending of visuals in my periphery. 3:30AM and the experience did not intensify. I was expecting more visuals. The substance made me feel very open and gave me a 'clarity' about where I was in life and what I wanted to do. Much like E, but without the body tension.",
  "So at around 4AM we decided to inhale 10mg more. Well, that was it for me. Not 5 minutes after snorting, the visuals started whirling around me and became very colorful and fractal-like. I had a hard time concetrating and even standing. We also got very, very nauseous. My friend did go and throw up. But I tried as hard as I could to psych my way out of it. Well, I wonder how much the last bit we did pushed us over, becasue at 9AM we were still experiencing visuals. I did notice after we took more, my lower back, neck and legs were very tense. Around 11AM we were able to finally fall into a rough sleep with the help of Sleeping pills. (The words 'strung-out' come to mind.)",
  "It was a long comedown time. We woke up at 5PM and continued about our day. I really didn't feel like talking. I just wanted to enjoy how pretty everything was. I was very introspective. The next day I was able to return to work as normal, with no agitation I've commonly felt after taking E or Acid. This is definatly NOT a Party drug. I would suggest inviting some trusted close friends over for a very enjoyable evening. I will not hesitate to try this again."
 ],
 "erowid": {
  "id": "1540",
  "citation": " Prana. \"2 Tee Hee: experience with 2C-T-7 (ID 1540)\". Erowid.org. Oct 10, 2000. erowid.org/exp/1540",
  "substance": "2C-T-7",
  "views": "7081"
 }
}
