{
 "id": 17050,
 "title": "Clonazepam and Me",
 "date": {
  "submission": "2007-03-03T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sothy",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "4.0",
    "grams": 0.004
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0:45",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "plant material"
  },
  {
   "time": "1:49",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "plant material"
  },
  {
   "time": "2:01",
   "amount": {
    "unit": "mg",
    "quantity": "0.5",
    "grams": 0.0005
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Because of the lack of information on clonazepam, I thought I would add a report to start off the experiences database :)",
  "A little on me- I'm a light drug user, I mostly stick to marijuana. I do smoke relatively heavily, I'll go through an eigth in a week or week and a half. I barely ever drink. Every month or two I like to trip on DXM.",
  "I've tried clonazepam about 5 or 6 times in a 4 month period, at first by itself and later with alcohol. In those 4 months I've had a full bottle of 40 or so .5 mg pills available to me pretty much constantly, and I never had any unfightable urge to take the pills. Of course, addiction varies from person to person and I never got high off them two days in a row or even within a week at the minimum from the last time I had used. Your mileage may vary, but please be careful =]",
  "The clonazepam high itself is quite mild and very empathic. I don't get blatantly stoned or wasted, but it has interesting and subtle effects on the mind that other drugs don't have. It also has had a noticeable effect on memory- I find it hard to recall events from a clonazepam day",
  "It has been about a month since my last use of clonazepam, so tolerance should not be a problem.",
  "It's 11:05 pm and I have taken 8 .5 mg pills. From my experience, the effect comes on in about half an hour. We'll see :D I smoked 2 hits of pot earlier to get over a bad headache I've had all day.",
  "As a side note, alcohol greatly increases the effects of clonazepam, but for the sake of an untainted report I am taking the pills alone, as plenty has already been written about booze ,), and drugs sometimes have completely different effects when mixed, especially this one.",
  "11:16 Put on some weezer and jumping into the shower, no effects whatsoever yet.",
  "11:31 Out of the shower, feeling very care-free, very loose, and quite content with everything =] The music is engrossing.",
  "11:41 Things seem a little strange, I think my speech is slurred, or at least different- harder to control. I'm debating packing a hookah bowl or not, it's just flavored tobacco, shouldn't really skew the results. And it's a killer way to waste some time hehe. By this time my motor coordination is a bit off 'clumsiness'. Stiff feeling in my legs, it makes it hard to walk.",
  "11:58 My hookah is finished. I have noticed a lack of motor control and overall 'carefree' feeling. I can accept everything for what it is and see its beauty. Can't wait to hit that hookay =] Also feeling slight cottonmouth- no where near what you can get from pot, but a little bit.",
  "The smoke from the hookah is very relaxing, and the banana flavor is quite nice (it's only tobacco and sweeteners) and the intricate patterns it forms in the air are beautiful and unsually relaxing. Still listening to weezer (pinketon :D) and turning on adult swim for some hopefully decent anime.",
  "12:18 I'm feeling quite emphatic and happy, I have the urge to go for a walk, but I'm going to hold on for a little while. My mindset also feels altered, I don't have a care in the world.",
  "12:31 I keep forgetting what I was going to do hehe. I couldn't care less though. I feel very heavy and clumsy, definitely should refrain from driving.",
  "12:54 Packing another hookah bowl :D I feel very subdued and relaxed. I keep bumping into things, but who cares.",
  "It should be noted that I never found a good reliable dose to get high with while surfing the internet, so little by little I've been trying to find the best dose. I'm debating poppping another .5 mg to see the effect. I might just wait a little while before going for another .5.",
  "1:06 I popped another .5 mg pill. That will be the last of the evening.",
  "1:19 I really feel the characters I'm watching. It's hard to seperate the fact that they aren't realy =]",
  "5:45 I woke up. I didn't intentionally fall asleep but somehow ended up in my bed. Still feeling the effects of the drug. I have 'I'm strarting to feel deeoplu ti' written down last, but I can't quite decipher it. My memory is fuzzy... I'm not sure when I fell asleep or how.",
  "I think I either might have taken too much, or did it at a bad time. Late at night, I might have been naturally sleepy.",
  "I personally don't think I'll take anything past 4mg at a time. The drug also has some sexual side effects I've noticed.",
  "Hope this helps someone :)"
 ],
 "erowid": {
  "id": "54613",
  "citation": " Sothy. \"Clonazepam and Me: experience with Clonazepam & Tobacco (ID 54613)\". Erowid.org. Mar 3, 2007. erowid.org/exp/54613",
  "substance": "Clonazepam & Tobacco",
  "views": "114209"
 }
}
