{
 "id": 17053,
 "title": "Disappointment",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rapkarla",
  "gender": "Female",
  "weight": 107
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "Sertraline",
   "form": "daily"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "mg",
    "quantity": "300"
   },
   "administration": "oral",
   "substance": "Bupropion",
   "form": "daily"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "4:30",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "I take 200 mg sertraline and 300 mg bupropion daily for depression.  I had read that anti-depressants can lessen the effects of psychedelics such as LSD.  I figured that a little trip is better than no trip at all, right?",
  "I took just one tab at first, because I am sensitive in general to psychoactive substances.  I was with a very experienced psychonaut friend, R, just hanging out in my apartment.  I was a bit nervous because I've landed in the ER with bad drug interactions before and it sucks.  But I felt pretty confident that my day wouldn't end in a hospital.  R and I watched tv while I waited to feel something.  I did feel pretty weird.  It felt a little like the body high from a low dose of DXM, with almost none of the mental/emotional intrigue.  My neck got very stiff and sore, and I couldn't focus my eyes properly.  I had no visual or auditory hallucinations of any kind.  The most noticeable aspect was a kind of buzzing feeling in my whole body, like it was antsy and ready to blast off to outer space but couldn't quite make it off the ground.  I took a second tab about 4-5 hours after the first one just to see if it was a matter of dosage.  It wasn't.",
  "One thing that was mildly interesting: I couldn't taste food.  My brain was receiving the information all the same, but I was experiencing it in a way other than tasting, I don't know what exactly.  I guess that's a kind of synesthesia, like hearing colors or whatever.  I spent most of the 'trip' laying around watching tv and trying to sleep off the neck and jaw stiffness.  I couldn't sleep though.  Overall a huge disappointment followed by a massive 24-hour headache.  I will have to plan very carefully if I want to try to go off the meds for a few days so I can attempt to trip.  It's not usually worth it."
 ],
 "erowid": {
  "id": "54624",
  "citation": " Rapkarla. \"Disappointment: experience with LSD, Sertraline & Bupropion (ID 54624)\". Erowid.org. Jun 14, 2007. erowid.org/exp/54624",
  "substance": "LSD, Sertraline & Bupropion",
  "views": "10297"
 }
}
