{
 "id": 17079,
 "title": "Musical Experience",
 "date": {
  "submission": "2009-03-25T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Vilde Chaya",
  "gender": "Female",
  "weight": "55 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "<p>Im standing in a room the size of a warehouse, dark and crowded with bodies shimmering with energy that will soon turn to sweat and cheers.  I feel waves of excitement through my body  is it from the chemicals inside of me or the tension of a crowd of people nursing cheap beers and trying not to stare expectantly at the empty stage?  The room goes black, a collective yell comes from our throats, both primal and civilized at the same time.  And then our noise is eclipsed by drums, guitars, synths, and a voice like liquid meets velvet, like wine.  My body shakes, my toes tap, my head nods, my energy radiates outward and mingles with that of the people around me.  I can feel an involuntary grin spread across my face  the music, the energy, the acid surging through my veins, it all brings me closer to bliss.  I turn to J to see if he feels it and can see it in his smile, in the ways his eyes glow a bit brighter, in the movements of his body.",
  "Before long I desire some distance from the sweaty energy of the alcohol saturated crowd, and I also want to actually SEE the show, enjoy the colors and appreciate the artistry of the band, which my mere 51 stature wont allow.  So we zig and zag through a maze from the floor to the side balcony and find a secret vantage point where we can watch the mass below without being consumed by it.  As I allow the band to transfix me with music and lights, I surrender to the retreat into my own mind.  Sensorily, Im here, watching and hearing and feeling a Wolfmother concert at the T Theater.  But psychologically Im in my own reality  and it occurs to me that we all are, from the girl who must be crushing her poor boyfriend by perching atop his shoulders, to the crowd surfer pumping her fists as hand after hand grazes her body, to the middle-aged woman bopping cheerfully in the aisle beside me, to my dreadlocked tripper buddies nodding their appreciation of the entire spectacle.  I flow with it. ",
  "The music explodes in my ears, the brightly-colored lights are both beautiful and confronting.  They almost crash into my eyes but I dont want to look away, instead I smile and relinquish control to the sensory overload.  I feel the power coming from the stage, watch the rest of the crowd equally transfixed in their own way.  And yet Im relieved when the song mellows, when more subtle, fluid noises warble from the synth and gently vibrate my ear drums.  I am aware of my brain again.  It is sharp and smart, I can see everything clearly.  I can see my weaknesses and I can see the truths that make them bearable.  I want to tell my sober self so she can have some peace, I only wish that she will someday understand.",
  "The journey continues.  I dont know for how long, is there any time on an acid trip?  And then its over.  The music climaxes, the crowd surges, the energy peaks.  Wolfmother have gone and the lights come on and we have to deal with reality.  Get out of the concert hall, try not to grin too much at strangers, find my friends, make our way home.  We attempt to collect ourselves and start to walk in the direction of the city, looking for a taxi.  My legs are weightless and I cant feel the cold, I want to walk until dawn.  But the speed and the headlights of the zooming cars are jarring, and finally we climb into one and ride to the embrace of home.  With trance cranking on the stereo, a book of Alex Gray paintings to transfix me, and my friends beside me on the couch, I can drift calmly through my altered reality.</p>"
 ],
 "erowid": {
  "id": "54727",
  "citation": " Vilde Chaya. \"Musical Experience: experience with LSD (ID 54727)\". Erowid.org. Mar 25, 2009. erowid.org/exp/54727",
  "substance": "LSD",
  "views": "4902"
 }
}
