{
 "id": 17075,
 "title": "A Miracle Drug",
 "date": {
  "submission": "2007-10-07T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shane",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "2.0",
    "grams": 0.002
   },
   "administration": "oral",
   "substance": "Buprenorphine",
   "form": "daily"
  }
 ],
 "report": [
  "I wrestled with addiction to Vicodin, OxyContin, and Methadone for nearly 2 years before I discovered outpatient treatment with Buprenorphine (aka Suboxone). In no uncertain terms, this is a miracle drug.",
  "I'm sure many addicts feel the hopelessness that I felt. I've never met an addict that didn't want to stop. For me, I had a job. A mortgage. A car payment. I convinced myself that I have to keep using because I couldn't possibly take 2-3 months off of work to go away to a treatment center. For over a year I moved my addiction from OC to methadone (acquired illegaly, not thru a clinic) and just kept feeling more and more out of depressed and helpless.",
  "Then one day my Mother confronted me and we began searching for treatment options. When I discovered Suboxone I was intrigued. Unfortunately it was nearly impossible to find a doctor near in my (midsized) city that didn't have a huge waiting list for patients. This is common because the Federal Gov't only allows doctors to treat 30 patients at a time. I found a doctor 3 hours away and within a week I was undergoing the initial stages of Suboxone treatment, known as induction. You have to stop using any other drugs for 1-2 days before starting Suboxone, so you do have to tolerate the withdrawl for at least that long.",
  "When I left the doctors office with a prescription for 300 pills, one month supply, I was filled with a strange feeling, Hope. I looked forward to tomorrow. To next week. To next month. To next summer. The daily anxiety surrounding 'What will I do when my supply runs out' was just immediately plucked from my life. In the matter of one week, this hopeless situation I was in was instantly relieved. In one week I was given my life back.",
  "I have to travel 600 miles round trip once a month for my prescription, and I see that as giving up one day a month in exchange for the other 29. It's difficult to express, but as an addict I felt consigned to the life I was leading. It was my reality and as much as I wanted to, I just can't break from it. I tried three times to quit opiates on my own without success. Each time I was overcome by the acute withdrawl or the depression that followed it. I had to spend hours every day scoring my drugs and that was just how it was. I had to feel the deep anxiety of a dwindling drug-supply and even worse anxiety if I was running out of drugs with no cash for more. I would steal from the office petty cash. I would steal from anything I could. My life was hardly worth living. I felt dead inside.",
  "And this drug just lifted all of that. In a single day I went from an addict to a recovering addict. In a single day I was given back the promise of hundreds of hours and thousands of dollars that would once be spent acquiring drugs. This is the most remarkable drug that exists today. At first I was worried about fixing a pill-addiction by taking more pills. But now it's routine. Take them when I wake up, and when I go to bed. And when I started I was taking 5 pills twice a day. Now, 9 months later, I take 1/2 pill twice a day.",
  "I'm blessed with an outstanding doctor and I'm sure there are hundreds out there just like him. Since doctors have to take special training in order to prescribe this drug, the ones that do have an understanding and empathy for the disease of addiction. Months ago when I was able to describe to my doctor the wonderful gift he's given me we both were reduced to tears. Suboxone is not right for some addicts, but there are millions of us in America and most of them have no options available to them."
 ],
 "erowid": {
  "id": "54714",
  "citation": " Shane. \"A Miracle Drug: experience with Buprenorphine (Suboxone) (ID 54714)\". Erowid.org. Oct 7, 2007. erowid.org/exp/54714",
  "substance": "Buprenorphine (Suboxone)",
  "views": "29127"
 }
}
