{
 "title": "Problems Seemed Unimportant",
 "author": "Skandre",
 "citation": " Skandre. \"Problems Seemed Unimportant: experience with Blue Lotus (ID 17084)\". Erowid.org. Nov 11, 2002. erowid.org/exp/17084",
 "substance": "Blue Lotus",
 "bodyweight": "185 lb",
 "report": "<p>Since I have read the reports on Blue Lotus, I have been very curious about trying it. I found an online vender, and purchased 10 grams of the dried flowers for about $25.</p><p>The first thing that I tried was smoking the substance. I packed a full bowl (roughly 1/2 gram) and started smoking. The smoke was somewhat fragrent and pleasing, and not really harsh at all. However, after smoking the entire bowl I felt only relaxation and just a mild sort of buzz. I went to sleep shortly after and has some unusual dreams. I decided that smoking this much of the material was not worth the effect.</p><p>Most of the reports and information I have read on Blue Lotus refers to making a tea or steeping the substance in wine. I decided to try the tea option. I put approximately 9 grams in a perculator and let it boil for about 15 minutes. I then removed the boiled plant material and set it aside. I drank the tea over the course of about a half an hour, surfing the internet in the meantime. After about 15-20 minutes, I began to feel a distinctive buzz. I could not really relate it to anything I have tried...maybe the closest thing would be opium. I began to feel very happy and relaxed. Sounds seemed distant and there was a slight ringing in my ears (not unpleasant). Problems seemed unimportant, and I even felt a bit horny. There was a strong 'hypnotic' effect as well. The effects seemed to increase for about 1/2 hour, then stabalize. At this point, I decided to eat the boiled plant material to sustain the buzz. I washed it down with a couple of beers. This did seem to help sustain my buzz. After about 2 hours, the effects began to taper off, but I still felt relaxed and serene the entire night.</p><p>In conclusion, I really enjoyed my experience with Blue Lotus. I think it is a plant that is well worth experimenting with. The effects from 9 grams were somewhat mild, so perhaps a larger dose or a different preparation is in order. I do intend to try further experiments with this substance, and I would recommend it to others. The only drawback is that it is somewhat hard to find and is not really cheap either, considering the amount needed to achieve effects. I would not consider this to be a 'marijuana substitute', it has effects that are unique unto itself.</p>",
 "year": "2002",
 "id": "17084",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-11-11T08:00:00.000Z",
 "views": "65583",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "9.0 g",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(tea)"
  }
 }
}
