{
 "id": 17089,
 "title": "Losing My Mind",
 "date": {
  "submission": "2009-03-25T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hamster",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I only smoked cannabis once but it was such a negative experience that it still affects me now, 7 years later. For years after the experience, I suffered from acute anxiety and panic attacks that caused me to nearly become housebound. I suffered from paranoid thoughts, mostly to do with poisoning or drugging in my food or drink. I was obsessed with the idea that I was Schizophrenic or developing Schizophrenia. I could no longer trust my perceptions, in particular of sounds and my eyesight. I noticed every little detail such as the TV picture jumping or strange sounds and wasn't sure if this was just my imagination. I felt completely isolated in a way I never knew was possible, psychologically and emotionally unreachable. However, I researched my condition, had a small amount of counselling and now I feel that I am 99% healed.",
  "The day after I smoked, I wrote down my experience:",
  "We load up the pipe. Sarahs sitting on my toilet in my room at University and Im on the floor. This isnt working, I complain. We keep smoking. I feel totally normal apart from the fact that Sarah looks really odd from down here, like a hamster with huge cheeks.",
  "Oh well, she says, Better luck next time mate. I laugh. But then her head looks really huge, like its behind a magnifying glass or on a TV screen. Help. Is this a dream? Somethings wrong so I get up. Sarah asks whats up, and I cant tell if she feels the same so I ask her. She tells me she doesnt and asks how I feel? Theres a hot feeling at the back of my neck, Im fading in and out of reality like a messed-up dream and everything is fragmented like pixalised squares going in and out of focus.",
  "Sarahs lying to me, how can she not feel the same as me? Im repeating myself and I know this is beyond my control, Ive got to get out but I cant tell if the room is clear enough to open the door without setting off the smoke alarm. Sarah will know. She says its too smoky but I cant tell if shes lying. Then she says Ive fallen over and cracked my head on the sink and its bleeding everywhere. So thats why I feel so odd. Ive left my body and Im unconscious. Sarah puts her hands on the back of my neck and asks me cant I feel it? Although I know its her hands, I know its only her hands whilst Im unconscious and that in reality what I can feel all warm on the back of my head is my own blood. But although I know I am on the floor unconscious, I also know that she is lying, but then again I cant work out if she really is lying or if Im unconscious and its at this point that I realise I am going to believe everything she says, so I beg her not to say anything else bad. For the rest of the trip I feel like I am in a dual reality, separated from my body.",
  "I need to phone somebody.",
  "I phone my Dad, Ive smoked too much weed and I cant tell whats real and whats a dream. His response will be vital, he is the only element of truth and rationality apart from Sarah, but she keeps lying.",
  "Well you cant tell anyway, he says.",
  "Everything goes messed-up and hazy  it must be a dream or he would have made sense. Im really scared now.",
  "How long will before this goes away, Dad?",
  "A few hours.",
  "He tells me that weed is much more speedy than solids and I wonder if my heart is beating really fast so I ask him and he says It shouldnt do, but he thought for too long so I can tell hes part of the conspiracy and hes lying too. Dad tells me that if I cant cope with a little bit of dope then I should never drop any acid. I then start to wonder if maybe someone laced the weed with acid as this is only meant to be a little bit of dope but it feels like a huge load of something nasty.",
  "I want to go to sleep but Ive realised that what nobody else knows is that the weed has triggered off schizophrenia and Im going to be like this forever. The only way I can escape is to kill myself but I dont want to do that. I need air. I can only go if Sarah will let me, so I pretend Im normal so she will take me and she does. We start walking but I realise I cant remember how I got to the end of the road so I must still be in bed, but then I know Im not so I say wed better go back. Im scared Im going to fall over. I think about the knife in my kitchen and I know that Sarah is going to ask me to kill myself and I wont be able to say no because shes my only link to reality.",
  "We get back and I need the toilet. I cant tell if my thoughts are really in my head or if Sarah can hear them and I look at her and I can tell shes pretending she cant hear",
  "what Im thinking but I know she can.",
  "Sarah says she needs to go to her room and goes outside. I hear a blokes voice saying Is this her first time? and I know that Sarah has gone and got some paramedics or drugs counsellor or something. I look outside for the ambulance but theres nobody there. Its because theyre hiding. Sarah comes back. Theres someone with her, I look in the corridor and ask: whove you brought with you?",
  "Nobody, she lies.",
  "I cant see anybody but thats because theyre hiding, so I pretend I believe her. Theyve told her how to act so I wont freak out. She sits and offers me a biscuit. No thanks. But she keeps asking me so I know I mustnt eat one. How come shes so calm? When are the authorities going to come and take me away? Maybe Im in some psychotherapists office and there are people trying to bring me back to reality. I need sleep. I want Sarah to stay so Ill be safe but she says she needs to sleep in her own room. She says shell leave her door open and mine so it will be okay. But Im scared theyre going to get me. I agree, however, in case I choke on my tongue or something.",
  "Im alone and I know if I dont go to sleep I will never get back to reality, but I cant sleep. My rational mind starts to tell me that its okay, its just drugs and Ill be okay in a few hours, but I know its part of the conspiracy and is lying and that what it and nobody else realises is that this is no ordinary trip. Ive gone schizophrenic.",
  "I can feel a burning in my lungs and I realise that theres a lump of weed resin stuck all along my windpipe and Im never going to recover because every time I breathe, I breathe more weed. I need to drink some water but the glass is near my knife and Im scared I might cut my wrists. I control this long enough to get water.",
  "I go to the toilet but when I get up to flush the loo, theres a bit of weed floating in the water, and I think: Oh my God, its fallen out of me! Im full of weed!",
  "I try to go back to sleep. But I keep on needing the toilet and every time I go I cant tell if Im on the toilet or if Im really in bed still. Also I cant tell if this is the same as last time and I feel stuck in a never-ending cycle of going to the toilet. Every now and then I see a glimpse of reality and I know I havent lost it completely and that it will come back. I feel that if I accept that I am not afraid of dying then this experience wont be so scary, so I say Im not afraid and actually its alright to be unconscious on the bathroom floor and dying. But then Im still terrified.",
  "Reality starts coming back in larger pieces and I try really hard to hold onto it. I know Im going to be okay but my irrational mind still thinks Im crazy and that Ill be like this forever.",
  "Eventually I fall asleep and in the morning when I wake up things seem relatively normal. Except that for about a week, I cant quite tell if people are telling the truth about totally normal, innocent things."
 ],
 "erowid": {
  "id": "54760",
  "citation": " Hamster. \"Losing My Mind: experience with Cannabis (ID 54760)\". Erowid.org. Mar 25, 2009. erowid.org/exp/54760",
  "substance": "Cannabis",
  "views": "7727"
 }
}
