{
 "id": 17083,
 "title": "Dizzy and Disoriented",
 "date": {
  "submission": "2008-03-28T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Colo",
  "gender": "Male",
  "weight": 41
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Yesterday was fucked up. It was a friday, and I almost always take Tramadol (a painkiller) on friday to give me that awesome buzz after school. I got home, and I went to get some vitamin C from the medicine cabinet, and I noticed some clonazepam.",
  "Because I've been reading about all sorts of drugs for months now, I already knew that clomazepam could be used recreationally. I stole three 2mg tables and went upstairs to finish my mcdonalds meal. I decided to take one 2mg tablet of clonazepam, figuring that it would be the right dose for me.",
  "I started feeling a little floaty on the clonazepam and decided to follow it up with some tramadol to give me a feeling of happiness. But after taking the tramadol pills I realized that I the clonazepam was getting more and more intense. It was almost impossible to walk straight, and I felt a little 'spinny/loose' (not dizzy or nauseus though.)",
  "It turned out that the 2mg of clonazepam was waaay too much for me. And at this time (1 hr after taking tramadol), I shouldve started to feel the tramadol effects already, but the clonazepam pretty much masked the tramadol, which sucked. As the day progressed I became more and more disoriented (right now I dont even remember exactly what happened.) I rmember vomiting at least once, after dinner. I think I feel a sleep in on the couch right aftetr vomiting, woke up at 11, and decided that I was so fucked up that I should just go to bed.",
  "Now I can barely remember what happened yesterday. It wont stop me from taking clonazepam thought, but next time I'll be more responsible and be sure of the ample dose for my body."
 ],
 "erowid": {
  "id": "54739",
  "citation": " Colo. \"Dizzy and Disoriented: experience with Clonazepam & Tramadol (ID 54739)\". Erowid.org. Mar 28, 2008. erowid.org/exp/54739",
  "substance": "Clonazepam & Tramadol",
  "views": "32116"
 }
}
