{
 "title": "Awakening",
 "author": "Awakened",
 "citation": " Awakened. \"Awakening: experience with H.B. Woodrose (ID 17093)\". Erowid.org. Aug 28, 2002. erowid.org/exp/17093",
 "substance": "H.B. Woodrose",
 "bodyweight": "175 lb",
 "report": "<p>I had the most intense experience imaginable.  I was very ill for most of the experience.  However, it seemed like a cleansing, a purging of all toxic beliefs, as well as of guilt and shame.  In this experience I met with the mother.  She told me the truth of myself and of her ownself.  The essence of tantra and yoga were revealed.</p><p>I now understand the mystery of the trinity (I am trying to figure out how to put it all into words).  It is in the meeting place of the inward and outward breath that bliss lies.  My life will go on as it always has but I will never be the same.  I found that joy and sorrow are the same.  There is no need now to take a substance like this again.  There can only be one awakening like I experienced.  I know it wasn't the substance the caused this but my own desire.  That desire is fulfilled.  Now I must try find a way to live in balance between the opposites apparent in this life and try to give to others what I can of the gift that was given to me.  This experience was both horribly frightening and intensely blissful.</p><p>I would recommend that anyone who uses a substance like this do it with respect and reverence and not as entertainment.  I have done LSD, mushrooms, peyote, as well as other psychedelics with intense experiences with each.  I also have practiced meditation for a awhile.  None of this compares really, to revelatory nature of what I just experienced with baby woodrose seeds.  However, as I said earlier, I will never do this kind thing again.  It has no further value now for me.</p>",
 "year": "2002",
 "id": "17093",
 "gender": "Male",
 "timestamp": "2002-08-28T07:00:00.000Z",
 "views": "12222",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "8 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 ]
}
