{
 "id": 17109,
 "title": "Uncomfortably Sleepy",
 "date": {
  "submission": "2008-05-13T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dakota",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "10"
   },
   "administration": "insufflated",
   "substance": "Cyclobenzaprine",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "One fine summer afternoon, my friend and I were headed to my house to drop me off because she had to get to work. I asked her about the 'valium' she bought and if she'd sell me a couple. I bought two for two dollars. When I got home. I looked up the pills on the internet to find that they weren't Valium, but were really Cyclobenzaprine. Oh well. I snorted one anyway.",
  "I very clearly remembering that it hurt so much. My nose was on fire after snorting it. But less than one second later, I felt the effects. I got really sleepy, kinda felt like I was moving really slow. Felt like I was talking like I was really stoned. My brother got home, I asked him if I was talking weird or moving weird and he said no. I sat down on the couch and talked to him a bit about whatever. I couldn't get comfortable worth shit. I changed my position a thousand times. I just could NOT get comfortable at all. It was really frustrating. I felt really relaxed, yes, but I couldn't just get into the right position. It felt like I almost felt perfectly relaxed, but no, there was just one little thing that would make it imperfect and it frustrated me so much.",
  "I was also feeling rather sleepy. My eyes felt like they were going to stay shut each time I blinked. I went ahead and went to my bed and slept for a good 4 or 5 hours. I had some really interesting dreams. That was the best part of this 'high'. When I woke up, though, I was kinda groggy and still feeling it a very little bit. Later on that night I hung out with my friend who sold the pills to me. She said that she felt really weird and similar to how I felt. I've heard of people really enjoying them, though. And some people eat them like candy. I just don't particularly enjoy them. I'd only use them to help me sleep."
 ],
 "erowid": {
  "id": "54845",
  "citation": " Dakota. \"Uncomfortably Sleepy: experience with Cyclobenzaprine (ID 54845)\". Erowid.org. May 13, 2008. erowid.org/exp/54845",
  "substance": "Cyclobenzaprine",
  "views": "37610"
 }
}
