{
 "title": "Passion Flower",
 "author": "Scarab",
 "citation": " Scarab. \"Passion Flower: experience with Passion Flower (ID 1710)\". Erowid.org. Sep 11, 2000. erowid.org/exp/1710",
 "substance": "Passion Flower",
 "bodyweight": "150 lb",
 "report": "<p>For about the last four years i have been doing the passion flower thing.  This consists of quitting caffine at the beginning of spring at about the time that the passion flower starts to bloom.  This is done in order to not have the horrible headaches that you WILL get if you mix the two of these chemicals together.</p><p>My method of preparation is pretty simple.  I gather the leaves off the side of the road near my house.  The flowers taste better, but wiping them out means wiping the plants of the next harvest out.  The fruit sucks, don't eat it, it doesn't do anything except make you sick.</p><p>After having gathered the passion flower leaves, boil them in some water for a while.  Keep an eye on it cause i can't give you exacts on the time and the temp.  Strain out the plant material and you have a yellow / brownish tea.  This tastes like shit.  So unless you like the way shit tastes don't drink it.  What i suggest (and have used for years now) is getting a frozen concentrate fruit drink and mixing them together using the tea in place of the water in the mix.  Got that?</p><p>Ok, let's do a run down.</p><p>Leaves, Concentrate fruit drink, Pot to boil, strainer, jug, mix concentrate and tea.</p><p>I suggest making a lot.  This shit gets better with age, throw some under your bed and forget about it for a month or two.</p><p>What it does to me: Less of a high and more mood.  The first dose was the best because i could feel it hit.  Since then it's been more subtle and it's just like being really fucking happy.  Mixing with marijuana gave myself and several friends a similar effect.  Depth perception got messed up in a bizzare way.  People, trees, cars, houses, all looked like cardboard standups.  Like if you've ever played Doom, it's like how when you walk around items they are the same from every angle, it's like that.  When people talk they look like the voice-ins on Forest Gump where the lips are moving.  Thinking about this shit makes me laugh.  Hope someone out there enjoys this delicious plant.</p>",
 "year": "2000",
 "id": "1710",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-11T07:00:00.000Z",
 "views": "64385",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(tea)"
  }
 }
}
