{
 "id": 17110,
 "title": "Body Refresher",
 "date": {
  "submission": "2008-03-27T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SnoGoat",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Catnip",
   "form": "tea"
  }
 ],
 "report": [
  "One day I was bored and picked some catnip (about an ounce with stems and leaves and everything fresh from a catnip plant in my backyard).  Then I smashed the catnip into a coffee mug in no special way.  Once the water was done boiling, I added it to the catnip in the mug, then covered the mug and let it sit for 10 minutes.  After 10 minutes I pulled the catnip plant out of the water with tongs.  The newly made tea was a shade of murky lime green.",
  "So then I drank the tea at first sipping, then gulping.",
  "+1 minute: It felt like the hot tea was spreading all around my body, not just to my stomach.",
  "+5 minutes: There was a mild body relaxation feeling happening.  My body also felt warm.  No physcological effects or imparement.",
  "+7 minutes: The relaxed body feeling was slightly increasing.  Breathing in seemed a little easier.  When breathing in, it felt like I was getting more energy and oxygen than normal.  It was similar to the feeling of taking a deep breath after riding an amazing roller coaster, but not as strong.",
  "+10 minutes: The effects have reached their peaks and are starting to fade away.",
  "+20 minutes: Back to normal and it feels like I just took an amazing shower in a waterfall.",
  "Overall, all I experienced was a mild body buzz for a short time.  There were no effects similar to normal drugs, instead it was more like taking a vitamin or a health drink.  For being bored and wanting to pass the time, it was worth it.  If you want to get a good buzz, I wouldn't recommend catnip, because the effects are minimal.  If you have nothing to do and are at grandma's house, go for it."
 ],
 "erowid": {
  "id": "54848",
  "citation": " SnoGoat. \"Body Refresher: experience with Catnip (ID 54848)\". Erowid.org. Mar 27, 2008. erowid.org/exp/54848",
  "substance": "Catnip",
  "views": "11135"
 }
}
