{
 "id": 17113,
 "title": "My Feet Had Weights Attached to Them",
 "date": {
  "submission": "2008-01-03T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jizzle",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "glasses",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.5",
    "quantity": "1.5"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "0.5",
    "quantity": "0.5"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I already knew it was going to be a great night my parents were out of town.  I had a fat sack of herb a gram of that white girl and a lot of alcohol.  A friend of a friend came over and was like 'Thanks for having me over I got these pharmies if you want them.'  Of course I cant deny free pills.  So he brought down a huge bottle of 200mg. Seroquel.  I was very interested because I have never taken them.  He could not stress the fact enough to only take a quarter of the 200mg. pill.  I put it in my pocket and continued to party.",
  "It got really late or really early (5a.m.).  I needed to go to sleep but I was geeked out.  So me and my partner in crime decide we want to pass out.  I split the Seroquel into 4ths and me and my friend took about 50mg. each.  I was skeptical at first but after about 30-45 min. I was slurring my words and felt like my feet had weights attached to them.  I continued to drink and do more lines.  I usually rely on cocaine to bring me out of what ever slump I am in.   Oh no not this time! I would do a line and the seroquel start to release me but 10 min later I was in the same spot.  Fucked up!!"
 ],
 "erowid": {
  "id": "54856",
  "citation": " Jizzle. \"My Feet Had Weights Attached to Them: experience with Quentiapine, Cocaine, Alcohol & Cannabis (ID 54856)\". Erowid.org. Jan 3, 2008. erowid.org/exp/54856",
  "substance": "Quentiapine, Cocaine, Alcohol & Cannabis",
  "views": "12250"
 }
}
