{
 "id": 17114,
 "title": "A Strange but Pleasant Surprise",
 "date": {
  "submission": "2010-09-30T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "throttle",
  "gender": "Male",
  "weight": 67
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "500",
    "grams": 0.5
   },
   "administration": "smoked",
   "substance": "Products",
   "form": "dried",
   "specific": "Spice and Synthetic Cannabinoids"
  },
  {
   "time": "6:40",
   "amount": {
    "unit": "mg",
    "quantity": "500",
    "grams": 0.5
   },
   "administration": "smoked",
   "substance": "Products",
   "form": "dried",
   "specific": "Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  " day I decided to buy the 'famous' legal herbal blend called Spice. The seller told me it was one of the few legal drug that works (here in Italy salvia divinorum is not legal). On the seller's website was written that Spice should give a mild cannabis-like high, so I wanted to give it a try.",
  "After dinner the adventure began. I rolled the first joint with just Spice in it (no tobacco, no weed), more or less 500 mg (half the pack) and I started smoking with reggae music in background (to simulate a ganja situation :D). It tasted good (probably because of the vanilla and honey contained in it), but sometimes it made a bad effect in my throat.",
  "After smoking I was a bit disappointed because I felt no real effect, apart of a very mild numb-like sensation that happens to hit me whenever and whatever I smoke (even cigarettes). So I turned off the music and went to my computer. I thought that maybe the effect could hit me later, so, even if I was thisty, I decided not to drink coke because I didn't want caffeine to interfere.",
  "After ten minutes or so I began to feel the effects. I realized it when I turned my head to watch the tv, and I felt like someone hit me on my neck. Then I felt like the perception of my movements was a bit delayed compared to the movement itself. I lay down on the sofa, moving in turn every part of my body. If I moved my leg I felt the movement starting from my foot and spread to the whole body.",
  "After another twenty minutes or so, the effects was vanishing So I decided to take a second dose. Actually I had some difficulty rolling it. So I smoked it, this time being prepered to the side-effects in my throat. After that I watched two movies, just playing with the effects of Spice, moving my body to feel the sensation it gave me. Then I decided it was time to go to bed. And here the experience started to become amazing. I turned of the light and closed my eyes. After some minutes I started seeing multi-color geometrical shapes dancing in front of me. I suddenly opened my eyes and they disappeared. So I closed my eyes again trying to second the visuals.",
  "After a while I realized: I was having a closed-eyed trip. I started seeing what I was thinking about in tunnel-like shapes, dissolving and recomposing with different images. In the beginning I could not control what I was seeing, but then I found a way to do that: think about what I wanted to see and then think to what I was seeing at the very moment. So what I wanted replaced what I was seeing. After a while I began to have a mental 'stream of consciousness' (better than Lucky in 'Waiting for Godot'). My mind was wandering. I needed to go to bathroom, so I got up and went. I couldn't stop my thought even while there. Then something strange happened. When I thought something it seemed that another part of my mind would answer to the other one or contradict it, like there were two personalities in my head. It's been the only 'mystical' moment of the experience, since I understood that there are two parts in everything (ying&yang).",
  "Then I went back to bed and continued having closed-eyes visions. After a while I fell asleep. I can't remember what I dreamt about, but I know I didn't sleep enough. In fact the following evening I was very tired and I had headache.",
  "It had nothing to do with cannabis. First I felt the effects on my body, then I had closed-eyes visions, and finally free-thinking, everything remaining lucid, just physycally numb.",
  "[package ingredient list: Baybean, Blue Lotus, Lion's Tail, Lousewort, Indian Warrior, Dwarf Scullcap, Maconha Brava, Pink Lotus, Marshmallow, Red Clover]"
 ],
 "erowid": {
  "id": "54862",
  "citation": " throttle. \"A Strange but Pleasant Surprise: experience with Spice Product (ID 54862)\". Erowid.org. Sep 30, 2010. erowid.org/exp/54862",
  "substance": "Spice Product",
  "views": "9850"
 }
}
