{
 "id": 17126,
 "title": "Like LSD and PCP Mixed with Insanity",
 "date": {
  "submission": "2007-10-10T07:00:00.000Z",
  "experience": "1980-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "J. Moore",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Scopolamine",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "IM",
   "substance": "Scopolamine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "This experience was so radical I still remember it vividly after 30 years.",
  "My friends came up on a pallet load of expired drugs from a hospital headed for the hazmat dump site. We went thru the hard stuff MS, Diluadid, Dexoxyn, etc. With a rip roaring drug habit I started digging thru all the little bottles of unknown stuff. Thats when I came across the vial of pure Scopolamine Hydrobromide used for compounding and formulation.",
  "The Drug Reference said it was used in over the counter sleep tablets, and I needed some sleep bad. I swallowed about  grain and injected  grain. BIG MISTAKE.",
  "It was about 9:00pm and I dont remember much of the next 12 hours. My stepson said I crawled around all night eating lint balls off the shag carpet and mumbled to myself. At times I felt perfect, except I couldnt walk and the hallucinations were so vivid I thought they were real. I was so bad my stepson helped me get to a payphone to call the ambulance but the numbers on the phone were backward like in Russian.",
  "The fire department came and took me to the ER. My body was like on a PCP overdose, and I could not even stay on the exam bed but kept slipping off onto the floor. It was funny cause I would go from a clear mind to talking to people who were not there. They shot me with valium 3 times to no effect. My heart rate was over 200 and my mouth so dry I could not talk.",
  "The cops came, accused me of resisting arrest, and put me in a choke hold. After beating my butt right in front of the nurses, they took me to jail and tossed me into the rubber room. There I kept seeing a detective shove his handgun into the cell and pull the trigger. Click but no shot. He would laugh and pull his hand out. This happened over and over. Then I saw my grandma get thrown into the bull pen right across the hall. I saw the thugs rape her over and over. I was sure I could knock down the cell door and slammed into it with all my weight over and over. It was screaming I would kill those punks and they were all pointing and laughing at me.",
  "It was 12:00 am the second night, the watch commander opened the cell to check on me at change of shift. I leapt from flat on my back like a cat and bit him so bad he had to go on work comp then retire. After that, they called me the biter. All the time I was in the padded cell I thought I saw pills all over the floor. I kept eating the pills hoping to come down. I thought there was a bowl of valiums in the middle. It was really the crap hole in the rubber room. Gross.",
  "They took me upstairs the 3rd day to a medical unit. I thought I had a long sword stuck down my pant leg. I was walking with a stiff leg and the cops kept asking why I was walking funny. Over the next 12 hours my toilet was singing do-wop, my towel was Popeyes kid Sweetpea swinging around the bars, and I was stuck in a standoff between the Hells Angeles and the Black Panthers. I must have killed a dozen men with my sword.",
  "The third night I was afraid to move because I would set off a war and I was right in the line of fire. I lay frozen for at least 10 hours. The Black Panthers kept throwing dead cats into my cell.",
  "The fourth morning I had to go to court so Mental Health interviewed me. I denied taking any illicit drug, knew who was president, what day it was, and where I was. I told them everything was fine cept they keep throwing dead cats into my cell.",
  "When I got back to my cell I noticed I could see more clearly, was able to shave (Had to threaten a fellow prisoner with beheading if he didnt give me a razor) and went to court. I mustered every ounce of strength and told the judge it was all a big mistake. My wife had filed a police brutality report over the hospital incident and they let me go.",
  "It took over a week and a lot of downers for it to wear off completely. I know what it is to be insane and come back. Dont recommend it."
 ],
 "erowid": {
  "id": "54912",
  "citation": " J. Moore. \"Like LSD and PCP Mixed with Insanity: experience with Scopolamine (ID 54912)\". Erowid.org. Oct 10, 2007. erowid.org/exp/54912",
  "substance": "Scopolamine",
  "views": "711786"
 }
}
