{
 "id": 17128,
 "title": "They Weren't There",
 "date": {
  "submission": "2009-03-04T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Black Bird",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "325 ",
   "administration": "oral",
   "substance": "Datura",
   "form": "seeds"
  }
 ],
 "report": [
  "I had heard about this drg while I was in school one day and I decided to tell my sister because I knew where I could get  a lot of this so called 'trumpet' my sis and I went and took one large seed pod and split it down the middle. the seeds were very ripe and brown in color . I took the seeds and washed them down with water. I felt nothing at first then after approximatly 30-40 mins I began to feel very flushed and drunk.",
  "I was beginning to talk about how much I loved eveything and how great everything was then the halucinations started. my sister left to the kitchen but I could still see her in my perifial vision so I kept talking to her about life and how awesome it was. I continued for about 15 minutes before I looked in her direction to find that she left. she came back into the room and was confused because I was talking to no one.",
  "I then asked her for some of the popcorn that she made and a glass of water. the popcorn was the most amazing experience Ive had with food ever. It was so delcious I filled my body with a warm glowing feeling and the taste was so intense it made me tear in the eyes. and the water was so pure cold and refreshing I felt like I was floating about two feet off of my chair.then when I told her how good everything was she asked for some and I looked down to see there was no food or water to be found I had hallucinated really bad.",
  "I then proceeded to go to my friends house and I couldnt figure it out but my legs kept giving out and I couldnt talk coherently. I remember getting to my friends house and telling him I was reallly high so he brought out a lot of hard drugs so I left and went downtown. I started looking at birds and seeing them in my perifial vision every where. colors were very intense and I felt very drunk.I wen back home and tried to talk to my brother but all that came out was garbled nothing and he laughed at me .",
  "I started to mumble and rave so I went into my room and looked in the mirror and saw my best friend sitting on the bed . I was very calm and excited to see her so I talked to her for about an hour before I turned around to ask her opinion and she wasnt there. I remember feeling the weirdest silence come over me and I started to think that I didnt want to be high any more.",
  "The hallucinations lasted another 4 hours or so and when I woke up I couldnt read small print or see properly for about three daYS. THIS STUFF REALLY MESSES UP YOUR EYES FOR A COUPLE DAYS AFTERWARD. all in all its a very mind blowing calming experience that I reallly enjoyed. in fact I did it six days straigh at increasingly lower doses until two kids in my school died from it and 5 more were hospitalised. I researched it and found it was vey toxic so I never did it again. I do not recommend this one for the weak minded. its a great spiritual trip. cheers"
 ],
 "erowid": {
  "id": "54919",
  "citation": " Black Bird. \"They Weren't There: experience with Datura (ID 54919)\". Erowid.org. Mar 4, 2009. erowid.org/exp/54919",
  "substance": "Datura",
  "views": "9229"
 }
}
