{
 "title": "A Visit To The Hospital",
 "author": "Mike121785",
 "citation": " Mike121785. \"A Visit To The Hospital: experience with Carisoprodol (Soma) (ID 17120)\". Erowid.org. Jan 28, 2003. erowid.org/exp/17120",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "116 lb",
 "header": [
  [
   "DOSE:",
   "4900 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>  It all started when i found a bottle of my dad's muscle relaxants, known as Carisoprodol (Soma). Over time i developed an addiction and tolerance. And also made a mistake me or my family will never forget, i almost lost my life.</p><p> First i would like to describe the effects of Soma</p><p>-dizziness</p><p>-euphoria (happy, giggly appearance)</p><p>-Relaxation all over your body.</p><p>-Mild Analgesia effects</p><p>-similiar to being drunk.</p><p>   (The Mistake)</p><p>  Since i been using this drug for a period of time, i developed a tolerance, and addiction. When i first started using, one pill got me fucked up. Now it takes me 6 pills to get a buzz. So at 5:00pm, i took 6 pills. I noticed the effects, which lasted for 2 hours, being upset, i decided to take 8 more pills right away. (Even if your high is gone, the chemical is still affecting your CNS) So it would be dangerous to take more after a short period of time. There you have it, i took 14 pills total within 2 hours.(i then passed out)</p><p>   8:37pm- My parents found me on my floor, they picked me up and woke me up. I was in a stage of overdose symptoms. I had tremors, i couldnt walk, or talk. Also i was foaming out of the mouth. I was brought to the hospital, and had to stay overnight. with an Iv in my arm all night. The only thing i remember is my parents finding me on my floor, and waking up in the middle of the night in the hospital. I went home the next day.</p><p>They gave me a drug test, and for some reason it showed up as LSD?? that made me confused also. The next morning i came back home, and went into drug counseling to help my urges to not use again. So there you have it, i took 14 pills in a 2 hour span. I am lucky to be alive.</p><p>dont make the mistake i did.</p>",
 "year": "2002",
 "id": "17120",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-01-28T08:00:00.000Z",
 "views": "52096"
}
