{
 "id": 17134,
 "title": "On the Mountain Trail",
 "date": {
  "submission": "2006-07-29T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dondante",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT"
  }
 ],
 "report": [
  "I just thought I'd share a beautiful/funny/terribly frightening experience on 4-aco-dipt. Tripping in nature is great  but it can bite me in the ass if Im not careful.",
  "My girlfriend and I set up our tent in the mountains on the Appalachian Trail. This seemed like the absolute perfect setting. We had an amazing view from our camp spot. The weather was forecasted to be clear and moderately cool. We went on a short hike in the afternoon and took 25 and 30 mg 4-Acetoxy-DiPT respectively at around 7:30 p.m. as the sun was going down. The come-up was almost unnoticeable. We were lost in the beauty of our surroundings. The sun dipped below the horizon and left us staring out at the ancient mountains cloaked in their signature deep blue mist. I marveled at the age of these mountains.",
  "We found our setting and state of mind very amenable to a deep conversation. She is quite inexperienced with psychedelics (I still consider myself somewhat of a novice as well) but Im glad she joined me to facilitate conversations like this one. We made our way back to the tent and I made a fire. The wind was kicking up a bit, but I figured that it would die down after dark.",
  "In what seemed like minutes, we both began tripping pretty heavily, the wind picked up, the fire was blowing dangerously, and the temperature was dropping. There was a forest fire on an adjacent mountain. It could have been a controlled burn, but I was afraid our mountain was next. Embers from our fire were being blown well outside of the cleared area. I was becoming very worried, but I just brushed it off. We stayed outside under a blanket until it got too cold. We moved in the tent, but our position out in the open provided almost no protection from the wind. The tent was blowing furiously now and it was almost too loud to even talk inside the tent. For a while we just figured we'd wait it out.",
  "The fire was now under control, but we realized that the wind was ruining our plans. At one point my girlfriend was inside the tent, I was outside, and the stakes anchoring the tent were popping out of the ground. I was trying to nail them back in. I would nail one in and another would pop out. It was like bailing water on a sinking ship. My girlfriend thought she was being swallowed by the tent, and I was afraid it was about to blow away. She was laughing hysterically, and was convinced it was just an effect of the drug. Fortunately we both found this, for the most part, extremely funny, but we were beginning to have moments of panic. I finally secured the stakes, but knew they wouldn't hold long.",
  "For what seemed like hours, but was probably only 10 or 15 minutes, we sat in the tent unsure of how to get ourselves out of this predicament. We went through cycles of hysterical laughing and panic. Finally, the stakes came loose again, and we knew we wouldnt be able to wait it out. I couldn't even get to the door of the tent because it was on top of me. Somehow, feeling like I was in some horror movie, I found the flashlight and located the zipper.",
  "We decided to undertake the monumental task of packing up the tent (a huge, but crappy 6 person tent). This of course took every ounce of our focus and sanity to accomplish. Somehow, we finished packing the tent. Now we had a short hike that took us about 5 minutes in the light. Unfortunately, the moon wasnt too bright, and three quarters of the hike were in the woods.",
  "At least three times, I stopped and could not make out the path in front of us. I would crouch down and shine the flashlight around in a circle, which totally freaked out my girlfriend! Despite being confused in our tripping state, 99% of the time we found our situation hilarious. The other 1% was fear, but when I felt it, it was magnified by 1000x. I envisioned us being lost in the woods forever. Then I would snap back to reality, and realize that the trail was quite well defined, and we would eventually make it back to the car. Somehow, we made it out of the woods safely.",
  "We were now 4 hours into the trip, so we put on some music in my car (My Morning Jacket and Radiohead) and had two more hours of a fantastically beautiful 4-Acetoxy-DiPT trip. This is an exquisite sexual enhancer! Eventually, we laid back comfortably and receded into the inner parts of our minds. I drifted through the psychedelic landscapes guided by the music, almost unconsciously. I felt like a spectator as thoughts occasionally passed through my head. I love this part of a trip when I can just let go of my surroundings and drift. There is no real thinking going on here. It is a completely passive state, where I dont even have to acknowledge my own thoughts. 4-Acetoxy-DiPT is a great substance, and has a much smoother and longer curve than its hydroxy counterpart. The experience lasted about 7 hours total and left me feeling refreshed and glowing the next day.",
  "I still wonder what would have happened if I had taken something a little less forgiving, or if I had actually gotten lost on the path back to the car  gives me chills thinking about it."
 ],
 "erowid": {
  "id": "54933",
  "citation": " Dondante. \"On the Mountain Trail: experience with 4-Acetoxy-DiPT (ID 54933)\". Erowid.org. Jul 29, 2006. erowid.org/exp/54933",
  "substance": "4-Acetoxy-DiPT",
  "views": "6352"
 }
}
