{
 "id": 17152,
 "title": "My Ride on the White Pony",
 "date": {
  "submission": "2010-07-15T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Canuhbis",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Well, yesterday was quite a day I must say, while hanging out at my good buddy's house with a couple of friends, had connections for the YAY. So, my friend BA and I bought a half a gram off the guy, and everyone in that room that day had been chattering about the purity level being at a high percentage. This being my first time doing the drug, I always express a caution level with waters I am unsure of especially with manmade drugs, considering that if you dont know the source. You have no idea what is in the substance until you find out, or until perhaps it is too late to find out. I digress.",
  "+0:00, I grabbed a pen that was cleverly converted into a straw, looked at the substance one more time before inadvertanly knowing the true extent of its wondorous affects, I close one nostril hole. Slightly bend over and inhale the devil's dandruff with one huff of my lungs.",
  "+2 mins later: I felt this intense rush throughout my whole being and I just felt the urge to get up and walk around, My psyche at this point has grown wings of confidence, hell its like I grew physical wings. not quite as intense as an MDMA buzz, but definately along the same grounds. Also, my linguistic capacity increased and it felt like I was puking up torrents of thought, that seemed crystaline and pure to the ears. so my friends said. but for me what seperates this drugs from the other stimulants, is the type of euphoria expirienced, its a very very high energy euphoria I feel like I need to do something with that energy.",
  "+15 mins later: it just seemed to me like the buzz that I once had minutes earlier had faded but was still prevalant, the talkative gibberishness that was once expirienced wasnt prevalant to the high anymore, but I felt comfortable, energetic and poised at this time.",
  "+30-60 mins later: the high had faded, it almost felt like the energy that was so moving, so gripping had just been cruely and tyrannicaly stripped from my body. My mind cried out to my body, it wasnt so much a ravenous hunger as it was just a hunger to keep that wonderous high going and going ..."
 ],
 "erowid": {
  "id": "63620",
  "citation": " Canuhbis. \"My Ride on the White Pony: experience with Cocaine (ID 63620)\". Erowid.org. Jul 15, 2010. erowid.org/exp/63620",
  "substance": "Cocaine",
  "views": "4298"
 }
}
