{
 "title": "Best and Worst",
 "author": "Ketasex",
 "citation": " Ketasex. \"Best and Worst: experience with Ketamine (ID 17163)\". Erowid.org. Dec 23, 2005. erowid.org/exp/17163",
 "substance": "Ketamine",
 "bodyweight": "90 kg",
 "report": "<p>I just finished a medic's course and during that course I managed to get 10cc vial of Ketamine from a hospital. I don't remember the name but it was 500mg/10cc. So I got together with 4 friends from the course to try it out. We heard that in operations they use 2cc IV of that stuff, so we though that 0.5cc should be good.</p><p>One guy was brave or stupid enough to try it first, so I injected him. A few seconds after I injected him he seemed totally 'out'. It looked like he was enjoying it, so I asked someone to inject me. I never did anything harder then Marijuana before, so I have no point of comparison but I can't imagine how I could do better then this. It felt like I was just about losing consciousness. I was in this state for about 15-20 minutes (from what my friends told me). Then I started to walk around, it felt like I was flying. After another 5-10 minutes or so, I could start talking and realized what was going on around me. At one point I remember that I saw a window, and though that I could fly out of it. This really scares me because I think that if it was an open balcony I might have jumped of it.</p><p>By this time another guy injected and had a good experience, he said that he had an out of body experience, that he came out of his body and walked around the room for a bit.</p><p>Now, one guy was afraid to do it, he kept asking whether it was safe to do it, and what are the risks. So we told him that if he doesn't want to do it, he shouldn't. But he wanted to do it anyway, so someone injected him, and he got into a really bad trip. He started saying stuff like 'I want my mommy' and 'I'm going to die', then he started puking, he was in a really bad state for about half an hour.</p><p>After that one time I never did it again because I knew that if I did I will be hooked on it in no time. Just thinking about it makes me nervous.</p>",
 "year": "2000",
 "id": "17163",
 "gender": "Male",
 "timestamp": "2005-12-23T08:00:00.000Z",
 "views": "5916",
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "IV",
   "substance": "Ketamine"
  }
 ]
}
