{
 "id": 17162,
 "title": "I Was, I Am, and Ever More Shall Be So",
 "date": {
  "submission": "2010-06-23T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nosmartyr",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "leaves",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "dried"
  }
 ],
 "report": [
  "June 11, 2007",
  "I don't know the time, because it does not exist.",
  "I am alone in the dark. Radiohead, Hail to the Thief album, plays on the stereo. I know.",
  "Alex had left to take February home. It was late in the early morning and I'd decided to settle down at the foot of my bed, planning on leaning back and resting on the floor. I took a large painful pull from the Prisoner and when the experience began it was intense. I could sense the fragility of reality like I and everything in the cosmos were one, a mass of sand like particles joined for a brief momnet in time.",
  "I felt the knowing over my left shoulder and became aware of a stuck sensation. See, a thought I had was that I had already ascended and sat down in this experience and got stuck, so I panicked. I could see myself from the viewpoint of my ascended self (standing on wispy path in the dark) and I was looking down at myself sitting in what I can describe as being like a snow globe (without the snow) window of a point in time. But as I realized that and tried to fit into my mind I lost control of the experience and went backward through time.",
  "I was experiencing every other moment of pychosis I'd ever had in this life. Insanity is the doorway to the heaven within. While I'm flickering with all of these me's I think like them and look like them and feel like them, so I am insecure and mad with rage and such a frightened little girl. I used to sit in my room while running down that path and I'd scream and Mom would lock the door. That feeling was scary enough to give me a bit of control, but just enough so that I could go forward. My mind keeps stepping in though and I get stuck sitting in Donny's room with a bong in my hand. What happened is precisly what I feared. I got stuck in a past experience.",
  "Well, it's better, but then I recall all the horrible experiences I'd had after that point and in my panic I become aware of the bong. So it starts flickering as every bong I've ever held in this lifetime, and bcuz I am aware of it I become it. As I am the bong I have the novel idea of sitting down in a trip in this lifetime just to do it and so embarassingly got stuck. That only happened cuz I was thinking very linearly, but I didn't know that at the time. I learned it. When I became the bong my mind snapped. It couldn't take it anymore, not any of it.",
  "All the while I'm still seeing myself and seeing myself through my future self and I'm telling myself that this is just what happens and the music, which was Radiohead, became a chorus of loved ones reassuring me that I was just flipping out on salvia, just like always. My mind became my enemy then. It made me think that I was a fool, an ascended on, but a fool none-the-less to have ever wanted to go back to this experience.",
  "So thinking that I had just stepped into this little speck of time I thought that I must get out(before I get stuck in this shitty life again). I began looking for help to leave the experience. Future self was really just telling me that I had always been there, becuz I had always, am always, always will be, every where and every time. My mind took that knowledge and filtered it so that the info I got was very wrong. Just a misperception, I'd say. As the intensity of the experience began to fade I was moving about the room, probably yelling quite loud, when I got very small and was attempting to scramble up the edge of the bed.",
  "Then I knew, becuz I am my future self also, that if I grew tall and flopped onto the bed, which looked like a pulsing vortex, like a tear in the fabric of reality, that I would be with them, myself. But I had another knowing, that I'd had all through this experience, I could not take my body with me. Not yet. When I flopped on the bed I was laying face down on a prismatic tecnicolor rainbow path. I was telling myself to get up, but couldn't move. When I relinquished control I was water in a water wheel and many other things, but my trip was waning. Good thing, too. I hadn't so much been alive through all that and when my heart started beating again it was POUNDING and I knew that I had to wait, just like I've always known, that I am waiting for evolution, when I CAN take my body. And I said to myself, 'breathe.'",
  "The thoughts that were pouring through my head were many more than should be possible. I feared death during it and asked myself(all knowing self), 'what if this is the test, what if I am too afraid to let go, just like I am now, what if I don't know how!?' And I answered, 'It doesn't matter, it just happens.'",
  "And it will, cuz it did, cuz it always will and always was, cuz i've always let myself be guided by myself. I had that unpleasant salvia trip, so that I could learn from it and now I have a message and an answer for all you who can accept it.",
  "It doesn't matter if you belive me or not. I know that I must spread this knowledge and that in doing so, in ranting insanity to strangers in my past, in waxing poetic in countless school papers, I am spreading this message, planting the seed, so that all I have touched will know this.",
  "When the time comes they will know as they have always known, deep in a room in thier mind, behind locked doors, as they will always know. This is hell and heaven awaits. It is only your mind that keeps the truth from you. When we evolve there will be no more locked doors, no way for the mind to filter your consciousness."
 ],
 "erowid": {
  "id": "63687",
  "citation": " Nosmartyr. \"I Was, I Am, and Ever More Shall Be So: experience with Salvia divinorum (ID 63687)\". Erowid.org. Jun 23, 2010. erowid.org/exp/63687",
  "substance": "Salvia divinorum",
  "views": "1905"
 }
}
