{
 "id": 17183,
 "title": "The Most Chill I've Ever Been",
 "date": {
  "submission": "2007-06-28T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Doobie",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 3:05",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>First of all I have been experimenting with many substances this summer and when one of my friends told me about painkillers it sounded interesting to I wanted to try it. I had some hydrocodone and instantly fell in love with the immense Chill feeling that painkillers gave me. One day I had some friends over and my parents werent home.",
  "We really wanted some painkillers but non of us had any so I was looking thru my medicine cabinet to find something I could get a buzz off of because both of my parents have had major surgeries in the past, researching every name I found on a prescription bottle online. I got nothing so far after lookin thru for about 20 minutes until I came across one of those sample packs labeled Ultram. I searched it online and planned on taking it. My friends didnt want to take it so I was the guinea pig. I took them and I fell in love with it. Since then Ive been trying so hard to get more.",
  "Finally I hit my personal gold mine-180 Tramadol tablets all to myself. I decided to take a few the day I got them.",
  "T+0:00  I am at my friends house just chillin and I decide to ingest 4 50mg tablets of Tramadol with a little food to pad my stomach.",
  "T+0:15  I go outside with my friend to have a cigarette with my friend. He had some Tramadol 2 hours earlier and is already chill as fuck. We enjoy our cigs and talk about life and stuff like we usually do only he was so mellow.",
  "T+0:30  I have to leave my friends house to go home, I still have not felt any significant effect.",
  "T+1:00  I begin to feel a moderate Hydrocodone feeling. Im very excited because I have done this before and I know whats coming is awesome. Nothing is bothering me except for very slight nausea, but it may just be there because Im thinking about it or Im moving too much.",
  "T+1:30  The feeling is slowly getting stronger and I just got hit with the itches.",
  "T+2:40  The feeling is very strong now. I am not nauseous at all and I feel so happy. Im walking around the house looking for something to do and just smiling and the setting of my house just seems so perfect. I am not hungry. I feel like taking a shower because Ive herd it feels good when one is on Tramadol.",
  "T+3:05  The shower was utterly amazing! As soon as I stepped in I was flushed with an immense Euphoria as the water runs down my body and thru my hair. I am so incredibly happy and decide to take another 50mg tablet of Tramadol.",
  "T+4:05  I decide to get on the computer after watching T.V. for what seemed like wonderful hours and hours but was only one hour. I started talking to people on AIM and Listening to some Music and it is so much fun, I feel like talking so much and Im getting into the music. I love these people that Im talking to and I let them know that, I feel like loving everyone and letting them know that. Im so happy and I cant keep a smile off my face Im enjoying myself so much.",
  "T+5:15  This is the strongest Ive felt! I am so indescribably happy!! At this point I am more chill than I have ever been in my life. I literally can not stop smiling as I continue talking to people and listening to music. Everything is so enjoyable I never want to stop feeling this way. Listening to the music is so euphoric and Im getting so into it because it feels so good I feel like the music is a part of me.",
  "T+5:40  I have started to feel kind of tired, I decide to get off the computer and watch more tv. Its a relief and it feels so good to lay down on my couch and just relax as I sink into the soft cushions and enjoy some late night television.",
  "T+7:00  It is now midnight and I stop watching tv because I feel completely exhausted, yet I still feel incredibly happy and wonderful. I feel like I will sleep well tonight. I am out almost as soon as I hit the pillow.",
  "The Day After  I still feel pretty good, Im tired but I still feel energetic. I think Im just tired because my fucking dog woke me up at 6:30 barking at squirrels (damn dog). I feel sort of a pressure headache, but its not enough to even bother me I can just forget about it. I also notice I am a little bit irritable but since I was expecting to be I can control my anger and just relax. I am still not as irritable as I would be off hydrocodone. Other than that I dont really feel any kind of hangover but I still feel like just relaxing. I LOVE THIS DRUG!</p>"
 ],
 "erowid": {
  "id": "63831",
  "citation": " Doobie. \"The Most Chill I've Ever Been: experience with Tramadol (Ultram) (ID 63831)\". Erowid.org. Jun 28, 2007. erowid.org/exp/63831",
  "substance": "Tramadol (Ultram)",
  "views": "32736"
 }
}
