{
 "title": "The Golden-capped Diamond",
 "author": "Leung Ka Chong",
 "citation": " Leung Ka Chong. \"The Golden-capped Diamond: experience with Salvia divinorum (5x extract) (ID 17196)\". Erowid.org. Jun 10, 2005. erowid.org/exp/17196",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "149 lb",
 "report": [
  "<p>Whisked away after mere moments, perception altered so quickly... If only you could get a little more in, you could join me here just for a a quick journey!",
  "It was truly amazing!  Starting with the first hit of 5x extract, the salvia went down easily with the help of a cheap water bong.  Its bowl filled to the rim, and a (necessary) strong micro torch lighter lit into it.  'Breathe deep' was what I heard, as I sucked the last of the smoke in.  Holding it as long as possible, and then slowly letting it out... No effect were felt.  I was confused about why.  I got up, moved to her bed, and like a quick rush the effects came on.  Now that I knew it was working, I needed to get more in!",
  "Another toke",
  "Another toke",
  "Another... *cough* 'Damn, that one didn't go down'",
  "One last in...",
  "I felt like a child.  I looked around, and found myself explaining myself to a book and an unlit candle.  But the book was really not just a book, I swear *LOL*.  Boy I must have looked like a fool!  Giggling in a raspy voice, saying stupid things to inanimate objects, without being aware of my stupidity, I finally closed my eyes!",
  "WOW!",
  "Amazing visuals, so beautiful... Why would I leave this, why would I open my eyes, when this is what I'm leaving.  I don't remember lying down, but I was!  It began with Aztec and Eastern designs, and after traveling through 'the mystical light', I found myself in a universe of beautiful objects, landscapes, and other things never seen by anyone else.  Eventually I lost total awareness of my real body, I could actually move and travel freely, and I wasn't even aware that it wasn't my real body traveling. It was all encompassing...",
  "I don't remember many of the beautiful visuals of objects in detail, but the two that stay in the most detail in my mind would be the Pegasus, and even more golden Aztec disc/coin!",
  "As my last strange image began to fade, from the earth below flew up a shining horse with angelic wings, in the red light of a sun quite different from out own.  It rose up, erupting from the ground below, just to let all marvel in it's presence, and then faded into the distance.",
  "But when the INDESCRIBABLE coin appeared, rotating around slowly, with a enlightening blue glow to its left, pieces of silky material wavering in the cosmic winds elegantly.  As certain lighting/cloth/coin crossing took place, I was presented with images of rainforest, and beautiful earth nature.  I don't think I can fully describe it until one experiences it for themselves, but it was just so tranquil.",
  "Finally, when the first bit of fading effect became present, the beings I knew were there decided to place me through a test.  It sounds quite easy to conquer, but I was placed in a 'box' of flowing cosmic blue cloth, as they telepathically chanted (they were shaped like the figures of Oscars, LOL).  I 'blew the cloth away' with my will, and the figures jumped high up into the air above me, touched hands together, and produced the most elegant diamond, with an Indian gold design atop it.  They slowly lowered it onto and into my heart, where it stayed, glowing majestically with the white-blue light.  It was there to stay.  They, without words, explained to me, that I needed to leave and tell my friend of my experience.  They also explained that the crystal within me would be so that I could rejoin them once again soon, because I had passed their test.  I thought I would have been afraid, but throughout the whole time I felt safe, cared-for, loved, without need to worry.",
  "By this time, I was beginning to be aware of my true body (especially my head), and I awoke though I wanted to return and learn more about them.  I turned over, looked at my watch, I felt ALMOST back to normal, and it had only been 25 minutes!  I just told my friend as much as I could remember of the experience, and that was it.",
  "Words cannot describe what I experienced, but this was my attempt to.</p>"
 ],
 "year": "2002",
 "id": "17196",
 "gender": "Male",
 "views": "5491",
 "dose": [
  {
   "time": "0",
   "amount": "6 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "submissionDate": "2005-06-10T07:00:00.000Z"
}
