{
 "id": 17197,
 "title": "I Felt Funny and Giggly",
 "date": {
  "submission": "2007-06-23T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Cherub",
  "gender": "Male",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "buccal",
   "substance": "Salvia splendens",
   "form": "(fresh)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I was very excited to find salvia splendens growing in my town since. Since Im experienced with salvia divinorum and the even more obscure mild high of coleus, I figure it wouldn't hurt to try. I was expecting to feel something new, but not trip like salvia divinorum.",
  "First I picked a bunch of leaves as well as flowers. I chewed them for ten minutes ( I would have chewed em longer but I had to talk to my friend on the phone and it would have sounded strange).",
  "After chewing I felt very funny and giggly. Not like cannabis. Things were wider and vibrant. I looked down at my grass and the wild flowers seemed like stars in a big sky, but not in a 'tripin balls' way.  It was opiate like, but surely not as intense. I surely don't agree that it's addictive because if it was, they would surely all be gone by the next day! Also I never felt the urge that salvia splendens was badly needed like cigarettes. Like everything I put in my body, I did it out of boredom.",
  "I then got picked up by some friends to go hang and everything was still very funny to me. Luckily the weed man was right near the liquor store so we picked up some beer and ganja. I told them all about salvia splendens and they seemed a bit intrigued but not enough to try it.",
  "When we got to my friends house to smoke the cannabis the salvia splendens was still going strong. As we smoked our ganja, things got a little bit more spacey for an hour and a half until it the salvia splendens slowly wore off without a hangover.",
  "Overall salvia splendens was defiantly worth it because:",
  "1. It made me feel, relaxed and vibrant",
  "2. It was free",
  "3. It is legal",
  "4. And readily available",
  "I should definetly try to grow this stuff as well as harvest. I give salvia splendens an a-...F It is truly splendid!"
 ],
 "erowid": {
  "id": "63910",
  "citation": " Cherub. \"I Felt Funny and Giggly: experience with Salvia splendens (ID 63910)\". Erowid.org. Jun 23, 2007. erowid.org/exp/63910",
  "substance": "Salvia splendens",
  "views": "5497"
 }
}
