{
 "id": 17195,
 "title": "Retrospective of Useful Semi-Habituation",
 "date": {
  "submission": "2007-08-14T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Seaborg",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ],
 "report": [
  "I've been frequently, but not continuously using kratom for the past month.  Years ago, I had a religious infatuation with DXM that turned into a destructive habit.  Also, several of my closest friends from high school became addicted to heroin and I have no desire to go through the physical problems of opiate dependence, so I am being careful not to become physically addicted and space my doses apart at a minimum of 48 hours.",
  "However, I cannot forsee stopping my use any time soon.  It's too damn useful.  I see limited, disciplined kratom use as a reasonable way to compensate for life in urban america.  I have committed myself to living alone in a city for a year where I know no one, and I toil 40+ hours a week at a physically difficult job.  Without a supportive group of friends around, and without any ready access to nature, I feel that living completely sober here would drive me to serious depression/exhaustion/frustration. ",
  "With kratom in my arsenal, the wearing and dehumanizing process of life/work in a lonely metropolitan wasteland is made bearable.  It provides me with a break from stress, and when I walk around under the influence, the urban sprawl takes on a special beauty and hidden meaning that isn't there when I'm sober.  Kratom has more grace than any substance I've ever used.  I feel so thankful to be alive when I'm high.  My self esteem improves, my aesthetic perception is hightened.",
  "The opiod/sedation effects are subtle but pronounced at 1-2 grams of extract (I make it into a tea and swallow all the sediment), with only a brief period of stimulation equivalent to a cup of coffee at the first half hour.  The taste prohibits me from taking more.  The best comparison I can make is that it makes me feel the way I felt when I was a small child and my mom held me.  The next day is always easier to face.  I've had more energy at work and generally feel more content as a person.  I'm a nervous, anxious, dissatisfied mofo, and this helps, it just tips the scales in my favor."
 ],
 "erowid": {
  "id": "63899",
  "citation": " Seaborg. \"Retrospective of Useful Semi-Habituation: experience with Kratom (15x extract) (ID 63899)\". Erowid.org. Aug 14, 2007. erowid.org/exp/63899",
  "substance": "Kratom (15x extract)",
  "views": "15617"
 }
}
