{
 "id": 1721,
 "title": "Not for the Nose",
 "date": {
  "submission": "2007-04-10T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SuperDarry",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "60"
   },
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "ground/crushed"
  },
  {
   "time": "0",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I recently stumbled onto quite a bit of morphine, up in the several grams area,in pill form. I actually think I had 50 60mg pills if my memory serves me correct. I had taken them many times, both with the time release coating on and with it peeled off. It makes for a very pleasant high in my opinion. I never had any problems with the doses I took, ranging from 60-180mg with time release, and 30-120 without time release, all oral. Most of the friends that I gave it to did not handle these doses well. Nearly everyone vomited, even with one unadultered pill (perscription bottle said 1-2 every twelve hours). I never did have a problem until this experience.",
  "Morphine makes for a very fucked up sleep. The day after, you will slowly have dreams return to you over the whole day, and you will be amazed at some of the wierd shit your mind is capable of formulating without your help. I figured I'd do a little experiment before bed. I had been discussing the varying severity of effects with different ingestion routes, and I decided to insuffulate about 20mg. I did so, without burning, but with a pretty bad drip. I waited about a half hour, and after no strong effects, I snorted the other 40mg. Bad idea. I was under the impression that insuffulated drugs hit you right away (past experience of snorting shit includes coke and speed). Morphine is not at all the same. I went to bed and read for about an hour without feeling any distinguishing effects.",
  "I woke up the next morning totally fucked up. It wasn't a bad high, just heavy and strong. Keep in mind that I was more fucked up than any previous experience with morphine, and this was a good ten hours after dosing. I had nothing to do, so I went out in my back yard and smoked a bowl of shwag. Normally, this would get me mildly high, but that morning, it knocked me on my ass. I sat at my picnic table and stared at a flower pot. I eventually gained horrible tunnel vision, which wasn't such a bad thing because in the black around my pinhole of vision were hundreds of geometric hallucinations, similar to CEVs from high doses of pot, but with open eyes. I got really freaked out and checked my pulse and heartbeat, realizing I had severaly overdosed on morphine. In hindsight, I realized I would have already been dead had it been that big of an overdose because it was eight hours post-ingestion.",
  "I dazedly made my way inside, and sat down in my living room. The Boredoms were on my stereo relatively loud, and the song Super Are was on. The song goes from a very soothing melody to a frantic thrashy punk song. The depth and appeal of the music were similar to my experiences with shrooms, as was the level at which it affected my thoughts and condition. At the transition, I began to get annoyed, as it was just too chaotic and hectic and I stumbled to the bathroom and threw up for a long time. After that, I was just really fucked up, but felt a lot lighter and bouncier, and I ate some breakfast.",
  "The next night, I decided to perform another experiment on myself. I was curious as to how fast tolerance builds up. I decided to take the same dose insuffulated (60mg) earlier in the day so I would feel the effects. I took the line while I was at work (I work at a greenhouse, and was stuck in the lawn ornament section, so I figured being fucked up didn't matter because no one ever even comes into the place (its a seperate building that few know about or go to). Well, three hours later, I was poking onies with a co-worker at his house watching a huge storm that blew up. I must say that I was very calm and euphoric. Pot causes a flood of ideas and morphine calms down this frantic thinking and lets me look at things in a linear fashion, rather than larry, curly and moe getting stuck in the doorway while all three struggle to get through.",
  "I went home and went to bed feeling pretty good. I woke up in the middle of the night still feeling good. I went downstairs to get some milk (morphine gives me worse dry mouth than anything I have taken), and things went bad. As I poured my milk, I began to shake like a senior citizen. My head hurt horribly and I needed to get to bed or I would fall over and pass out where I hit. I remember a conversation with my parents while I was like this, but I don't know if it really happened in my half sleep state. I remember thinking, 'Wow, how can they not know I am on my ass off some drug?' but I heard nothing the next day, which also makes me doubt the reality of the conversation. I couldn't have been acting normal. I was  still fucked up the next morning. I deduced from my experiments on myself that 1) insuffulated is very potent compared to oral consumption, and 2) tolerance doesn't build up all that fast. I have about seven pills left, and will not be snorting any of them."
 ],
 "erowid": {
  "id": "15451",
  "citation": " SuperDarry. \"Not for the Nose: experience with Morphine & Cannabis (ID 15451)\". Erowid.org. Apr 10, 2007. erowid.org/exp/15451",
  "substance": "Morphine & Cannabis",
  "views": "43817"
 }
}
