{
 "id": 17210,
 "title": "Salvia Causes a Memory Lapse",
 "date": {
  "submission": "2001-04-22T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "KaoServitor",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0:20",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "I might say first, I have done Salvia several times before, but I only achieved threshold effects (some CEVs, strong gravitational attraction, muscular fluidity)",
  "Last night, i had a very strange experience with salvia. I had a few crushed up leaves, homegrown, from a friend. no extraction. I did a meditation to the salvia plant beforehand, then filled my makeshift cokebottle waterpipe with water and made 2 foil bowls.",
  "Filled both bowls with crushed salvia, fairly packed. I tried one, but it didn't really work that well and it was very loud, so I emptied the water out and prepared to toke it straight through the pipe.",
  "I lit it, and filled my lungs. Removed the bowl, which was almost dead, and let it go out. Held my breath and covered the end of the pipe/bong. Slowly released my breath through my nose, then emptied the rest of the bong. Here, something happened. I went somewhere, I remember thinking something. Right before I emptied the pipe, i remember a thought like 'wow this is fairly harsh smoke.'",
  "Well, the next thing I knew, i was sitting there, the bong was set down beside me, and I wasnt quite sure where I was or what i was doing. Everything felt really weird, movement felt forced, and it was almost painful to move (kinda like when you first wake up to an alarm clock in the morning and have trouble rolling over to turn it off).",
  "After i got my bearings and realized what was going on, I tried to walk across my room to my computer. I made it finally, thinking that I was high on marijuana. But, i remembered that i had resolved to stop smoking marijuana a few weeks ago, so I realized it was the salvia. I went to my computer and rambled some incoherent things to my friend on AIM, then remembered the other bowl I had prepared.",
  "I went back and smoked it the same way, but I didn't experience the total memory lapse that time (btw, this whole time my short term memory was null).",
  "I went back to my computer, sat down, opened up MSWord, and turned off the monitor. Closing my eyes, i began to automatically transcribe what I saw and thought. Following is a general summary of the document.",
  "First thing I decided was that what I was experiencing was like the beginnings of memory within the dimension of time. At first, I could barely remember anything. My short term memory ability increased thereafter, and the following morning i was back to normal.",
  "I saw psilocybe cubenesis mushrooms, and equated the caps with flying saucers. I followed one into a strange, giant vortex. I saw buckets of water, then liquid nitrogen tanks (inside a basement). A really hot jock girl from my school was there, and she flipped a switch on the tank. Her football player boyfriend passed out in the middle of class when she did that. I became him. I jumped out the window and started flying. I saw myself in 3rd person, with psilocybe mushrooms growing out of my back.",
  "I opened my eyes at this point, and checked the time on my watch, but I don't remember what it said and I didn't write it down. I did, however, enjoy the trails left when I hit the Night light on the watch and moved it around really fast. I looked at my arms in the light of the computer monitor, and saw them as extensions of the keyboard, being controlled externally by my body.",
  "I decided for some music. I turned on the CD Infected Mushroom - Classical Mushroom (mp3 - I dont think i would have been coherent enough to sort through actual CDs at this point). Closed my eyes and began typing again. I saw a sperm moving along. It multiplied into thousands. They moved in a fluid motion, and became a piece of cubist art. They jumped onto a spring and were propelled upwards. They flew through a cave, and out of a mountain. I could see flowers and grass and feel the wind.",
  "I then saw an object's magnetic field lines (we just learned about this in physics). I saw the fields protecting the earth. Particlese from the sun deflected harmlessly off it. Slowly, it dissapated. The particles quickly annihilated the earth. The electromagnetic field lines reappeared, and turned so I could see down the poles. I entered into it; it was a vortex; a black hole.",
  "I saw a mailbox open, and bats flew out. An infinite array of parallel planes were on a field of space.",
  "About this time, the effects were starting to wear off, and I was really tired. I checked the time; it was 2:45 AM. I checked the AIM log, and my incoherent rants had occured at 1:59 AM. I had no idea that much time had passed.",
  "I jumped back into the CEVs. I saw Mycelium growing on a mushroom. A small box (machine) was sitting on a prairie. A tree began to emerge from it. It grew towards the sky. I tried to figure out whether the box represented the human pursuit of nanotechnology or the natural DNA process. I decided upon the latter.",
  "At this point, I left the experience and went to bed. I had a dream I toked up more salvia and wandered around incoherently trying to figure out where i had parked my car.",
  "I don't know what all this means, but i doubt any of it was of significant value besides the DNA, psilocybe, and memory messages. My previous experiences with salvia have shown that it induces conscious dreaming, so i assume the visuals are similar to those of a dream, in that some are random, some are based upon recent real-world events, and some are messages from the beyond.",
  "I am sincerely glad I did this in such a controlled environment. A sitter would certainly have been useful, but I was alright. I don't think I could physically go any further into the experience without an extract, but I have heard some amazing stories of living other lives in the initial breakthrough stage. This is certainly a substance worth experimenting with, but treat it with respect; it is indubitably one of the, if not the, most potent entheogen available to us."
 ],
 "erowid": {
  "id": "6396",
  "citation": " KaoServitor. \"Salvia Causes a Memory Lapse: experience with Salvia divinorum (ID 6396)\". Erowid.org. Apr 22, 2001. erowid.org/exp/6396",
  "substance": "Salvia divinorum",
  "views": "7923"
 }
}
