{
 "id": 17239,
 "title": "Dagga - Good Mix With The Real Dagga",
 "date": {
  "submission": "2008-09-19T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SS",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "flowers"
  },
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Leonotis leonurus",
   "form": "tea"
  }
 ],
 "report": [
  "Right, I've tried many different natural substances although my only regular drug is cannabis.",
  "I recently bought a 10g bag of Wild Dagga flowers. I knew this is one of the reputed 'herbs that work' and so along with all the others I had made a note to try it at some point.",
  "What can I say about the wild dagga having tried it?",
  "These flowers look pretty nasty considering the most typical method of consumption is smoking. They are long, thin orange flowers (resembling a lion's tail hence the name), and look perhaps a little like pipe tobacco. On opening a bag you may notice a slight floral smell that perhaps is a little like an antiseptic, I find you can tell quite a bit about a herb and perhaps its effects from its smell.",
  "I first tried it in a pipe with a little weed and noticed a good stoned effect, it combined with the weed well. It was looking like a promising way of making my bud go further.",
  "I proceeded to bong some with a little cannabis. The smoke is not harsh but was a bit stinky in the bong. Holding a hit was not hard, perhaps it is a tiny bit harsher than smoking good weed but then that could just be down to how it was dried. Ive certainly smoked worse herbs than this. The bong hits gave even more of an insight into the Wild Dagga  it gave a good and long-lasting cannabis like buzz. Of course its hard to differentiate between the two but by now Im pretty accustomed to the effects of different strains of cannabis so could tell the Dagga apart easily I would say.",
  "The Wild Dagga seems to have a high that is a stimulating buzz and tends to give an uplifting but not strongly impacting effect. I could easily go about my business on this stuff and be definitely buzzing but not appearing particularly intoxicated.",
  "I then tried it several times in a tea and the effects were much milder, even with higher doses. I think you would need a high dose and to keep boiling it up to get any decent effect  at which point for me the bitterness and hassle make it a less favourable option personally.",
  "After this I then put some in a spliff with weed and hit what for me is the jackpot for this herb. It works very well to extend the life of your weed and burns well in a spliff. There is no particularly nasty taste although a smokey taste does linger a little more than weed in your mouth and back of your throat. Its like smoking a good sativa  it doesnt mong you out or bring you down. The only real issue is breaking it up fine enough for a joint  a good grinder should help though.",
  "In summary I would say this herb is not necessarily worth it to smoke on its own, but is perhaps the closest I have come to experiencing a cannabis-like high without the weed. It does excel though as something to mix with cannabis which extends the effect and duration of the high which is vastly preferable to tobacco. And the price is definitely right too. I have tried others like Kanna and Blue Lotus which both have notably pleasant effects, but for me this is the best smoke and effect to go with weed. Its effect is lightly uplifting and goes perfect 50/50 with ganja in a joint. I have heard it described as having a hypnotic focus which is a very apt description: It really relaxes you but also lightly stimulates your mind making working under the influence of this herb very easy indeed. Although I never smoke tobacco, I would suggest this as a good replacement for it for those looking to kick the habit."
 ],
 "erowid": {
  "id": "64083",
  "citation": " SS. \"Dagga - Good Mix With The Real Dagga: experience with Leonotis leonurus - Lion's Tail / Wild Dagga (ID 64083)\". Erowid.org. Sep 19, 2008. erowid.org/exp/64083",
  "substance": "Leonotis leonurus - Lion's Tail / Wild Dagga",
  "views": "16896"
 }
}
