{
 "id": 17240,
 "title": "A Spiritual Journey",
 "date": {
  "submission": "2007-10-05T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Greg",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>As a brief background of my drug use, I am a daily marijuana smoker, that being the only substance I have used. I have always been interested in psychedelics, and about how the mind and perception can be altered by substances. Mushrooms are the most readily available psychedelic in my area, so I thought I would get some.",
  "I gave my friend (for the purpose of confidentiality, lets call him 'Bob') $20 to purchase 1/8th of mushrooms. I then went to a different friends house ('Nick') and waited for Bob to deliver the mushrooms. Nick and Bob had agreed to sit for me while I was tripping on the mushrooms. They would just smoke weed. Bob arrived at Nick's house about an hour after I got there and gave me the mushrooms. He said they where Aztecan, and quite potent. I then ate the mushrooms and waited for the trip to set in. During that time I dissolved 1000 mg of vitamin C (Emergen-C) into a glass of water.",
  "T + 55 min",
  "I was sitting on Nick's couch, when I felt my whole body start to cool down. I started to feel like I was sinking into the couch, and becoming part of it. My friends decided it would be better for me to experience mushrooms in nature, so we left Nick's house. We stopped by another friends house, and his grandmother opened the door. That is when I knew the visuals had started, because her face started to distort and blur off of her body. From then on, I had visuals throughout the trip.",
  "T + 2 hours",
  "Nick, Bob, and I arrived at a forest. I could feel how alive the trees and plants were, and felt very aware of nature. As I walked through the forest, I saw a spot on the forest floor, where I knew I had to lay down. When I laid there I felt energy surging throughout my body, as if it where the center of the forest. I then got up and sprinted 400 yards to a beach at the edge of the forest. When I was at the beach, I had the realization that everything in life comes in pairs. It was at that moment that I realized I had 2 hands. And 2 eyes. And 2 legs. Everything around me started to form patterns of two. I had my two friends. Every tree had its second.",
  "T + 3 hours",
  "Around three hours after I ate the mushrooms, I started to hallucinate vividly. I saw 2 swirling worms. I called them worms because I could not see where they began or ended. They moved like snakes, and seemed to be the key to structures. I looked at a fern, and when I closed my eyes, I could feel the snakes pulsing through it, giving it structure. Then, my body started to feel cold. It was as if I was cold blooded, almost like a reptile, a snake. I thought the best thing to do, would be to heat up in the sun. So I laid down on a log, and felt the sun's rays coming down, warming me, giving me energy. I laid in the sun for around 20 minutes, as my body's energy increased.",
  "T + 4 hours",
  "After laying in the sun for a long time, I felt the strange urge to shed my skin. It was as if I was covered in a shell, and I wanted to escape. As I gradually escaped from my skin, I felt understanding dawn on me. I realized how to control the worms. Once I could control the worms, I could control everything. I moved the structure of plants. I made rock formations with the sand from the beach. Everything was movable. I  formed the clouds into shapes, painting swirls with my hands. I felt at peace with everything, because I knew exactly how everything worked.",
  "T + 5 hours",
  "My friends explained to me that I had been in a daze for hours, but it was now time for me to leave the forest. To this day, I still feel a deep connection with that beach, but I realized I did have to leave. We left the park and got onto the bus. Once I was on the bus, I felt like I was the only one there. I couldn't get off. All I could do was look at the window and see my life. Every window on the bus, was someone else I knew. I had my parents in one window. My siblings. My cousin. My girlfriend. My friends. Every person I knew had their own window, and I could see what they were doing. Eventually the bus did stop, and I was able to leave.",
  "T + 6 hours",
  "When I arrived at Taco Bell with my two friends, I started to feel more in touch with reality. While we were ordering our food, I told Bob I had a feeling that his mom was going to show up. Bob's mom is very strict and does not like myself or Nick. Five minutes after I had said that, Bob's mom stormed into the Taco Bell. She took pictures of Bob, Nick and I, and threatened to call the police. She told all three of us that we were to get into her car, or she would call the police. At this point my trip kicked in again, and I saw her face become dark and menacing. She took Bob and Nick away, leaving me by myself at the Taco Bell. I felt lonely for some time until my friend Alex arrived.",
  "T + 7 hours",
  "When Alex arrived things started to calm down, and I realized things where okay, now that Bob's mom was gone. I told Alex, that I had the feeling that we should leave the Taco Bell, because bad things were going to happen. Alex thought I was just being paranoid, but we left nonetheless. The moment we crossed the street to the bus stop to go home, two cop cars pulled up to the Taco Bell, so we were glad to have left. I then took the bus home. I was still experiencing some visual phenomenon, the road the bus was taking seemed to breath as we drove along. By the time I got off the bus, everything had settled down and I was sober again.",
  "This was my first experience with mushrooms, but I am sure it will not be my last. I had a deep understanding of how everything worked when I was on that beach, and it is a feeling I would be glad to have again.</p>"
 ],
 "erowid": {
  "id": "64084",
  "citation": " Greg. \"A Spiritual Journey: experience with Mushrooms (ID 64084)\". Erowid.org. Oct 5, 2007. erowid.org/exp/64084",
  "substance": "Mushrooms",
  "views": "2864"
 }
}
