{
 "id": 17257,
 "title": "Extraction",
 "date": {
  "submission": "2007-09-04T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Thealuminumtaco",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Coleus",
   "form": "(extract)"
  }
 ],
 "report": [
  "Hello, I am a fairly inexperience drug user, having only tried alcohol, LSA, DXM, and weed.  I recently learned about coleus from a forum that I frequent and got excited about this psychoactive plant that can be found at pretty much any store that sells plants.  The day after reading about it I bought a fairly large plant and began experimenting.",
  "First I took 6 leaves off of it and rolled them up, stuck them in my mouth and chewed and sucked the juices.  I think I might have felt something later but it may have been placebo.  I tried this method two more times, with the latter having a decent effect, but I still wanted more.  So I figured I would try some experimentaion, even though I have very little knowledge about simple chemistry.  But I assumed that if I put broken up leaves into water and some how broke them down more, then evaporated the water, I would be left with a smaller amount of plant matter that would contain a more concentrated amount of the active substance in Coleus Blumei.",
  "First, I put 10 leaves or so into a blender with some warm water, and blended it until the leaves were ground up. Then I poured that, and a bit more water to wash out the stuff that was left in the blender, and a bit of lemon juice, into a pot and put it on high heat on the stove. I boiled this for 30 minutes or so until all the water had evaporated, and I was left with a mass of dark greenish plant matter. I collected this into a ball and then spread it out over some wax paper. I later dried it out and smoked two bowls, which was only like 1/3 of what the 10ish leaves produced.",
  "About 5 minutes after finishing the second bowl a stoned feeling came over me, present throughout my body, but most noticably in my face.  This was way more intense then the effect that was produced by the 8 leaves I had chewed earlier in the day. Looking away from the computer screen to the walls caused patterning and some OEV shapes that can be moved if I imagine them moving in a certain direction.  It is definately more than placebo, but mostly just a body high.  My thoughts don't feel very altered.  I would like to smoke a higher amount and see if the effects are more pronounced."
 ],
 "erowid": {
  "id": "64157",
  "citation": " Thealuminumtaco. \"Extraction: experience with Coleus (ID 64157)\". Erowid.org. Sep 4, 2007. erowid.org/exp/64157",
  "substance": "Coleus",
  "views": "23909"
 }
}
