{
 "title": "Pure Euphoria",
 "author": "tollla",
 "citation": " tollla. \"Pure Euphoria: experience with MDA (ID 17254)\". Erowid.org. Sep 5, 2002. erowid.org/exp/17254",
 "substance": "MDA",
 "bodyweight": "64 kg",
 "report": "<p>This happened some months ago and it was my first experience with MDA (yeah, I could have taken it thinking it was MDMA, but after experiencing this I believe I didn't). It was a saturday night and I went to dinner with my closest friends. We were planing to have dinner, go to a bar and then to a club, so I thought it would be nice to drop a pill. A very close friend of mine would be dinning with us and I knew he was selling pills, so I went to talk to him. He said he had white ferraris, which were MDMA and pink diamonds, which were MDA. As he had really good contacts and could get almost any drug, and of course, as he was such a great friend of mine, I trusted him and decided to give MDA a shot. God, that was a great decision!!</p><p>I decided to drop the pill at 1am, when my stomach should be completely empty.</p><p>We ate and left the restaurant, heading to a bar. I had only a few natural juices there, because I don't like to mix alcohol and E and because people say it is healthy to drink natural juice when doing E (well... it's always healthy isn't it ;) ). We had some really nice conversations and I was enjoying myself pretty much, thinking that the best was still to come. At 00:30 we left the bar and went to the club. We found some more friends of ours and chatted for a while.</p><p>Finally it was 1am. I bought a bottle of water, went to the bathroom and droped the pill. It tasted like any ordinary pill but I thought it was normal, due to the chemical similarity between MDMA and MDA.</p><p>The setting was great: the club was almost full, I was with lots of great friends (some of them had already droped pills, but only ferraris I think), I had no preocupations and the music was awesome, just the kind I like (deep and tribal house :) ).</p><p>Aproximately half and hour after that, I began to feel it. At first it was only a very mild high, I had to be a bit introspective to really feel it, but then it began to get stronger and stronger. It was defenitely diferent from MDMA. The feeling of stimulation and joy were similar at first, but there was something diferent: the urge to dance. I never really understood people that say thay MDMA makes them dance non-stop. I enjoy dancing on it but it's not absolutelly necessary. With MDA it was diferent: i had to make absolutelly no efort to dance, I just had to let my body follow the music. In fact, I had to make an efort so stop dancing and when I did it, I was filled with a feeling of unconfort, so I thought 'why to resist?'. Dancing was absolutely divine and my mind was racing and absolutely happy, reminding me the feeling of hapiness that LSD produces on me. I just kept thinking about how happy I was and how wonderfull everything was. I think I never felt so euphoric in my whole life. Music also sounded really divine, better than ever I think. I had a HUGE smile on my face, colors seemed more vivid than ever, lights had an amazing glow.... i felt SO alive! However I could understand that MDA wasn't producing a feeling of empathy as strong as MDMA does, and tactile sensations weren't also as pleasant as with MDMA but overall I think I really prefered that feeling.</p><p>After dancing for about 1:30h (drinking water regularly, of course) I decided to sit down with some friends and chill out for a while. The high was diferent at that point. I hadn't that urge to dance and I could sit down and have a nice chat (my friends had droped ferraris so they really were into chating :) )and half an hour later I went back to dance. At 5am I started to feel the high coming down, but it was time to go home so I didn't bother that much.</p><p>As it hapens to me when I do MDMA, I couldn't sleep that night, but I felt little hangover the following day.</p><p>Honestely I think MDA is really more of a party drug. It is more trippy, speedy and euphoric. It can also produce visual allucinations, although I hadn't any that night. MDMA is better to do when with a girlfriend or a very close person because of the empathy it produces. I really can't say which I love most, they're simply different.</p>",
 "year": "2001",
 "id": "17254",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-05T07:00:00.000Z",
 "views": "42686",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDA",
   "form": "(pill / tablet)"
  }
 }
}
