{
 "id": 17254,
 "title": "Heads and Tails of Reality",
 "date": {
  "submission": "2010-02-27T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mateo D",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "Quick intro for you guys, I'm a 17 year old male. I've been told I have an 'old soul' and have always lived life with an extremely open mind and open heart. Psychedelics and hallucinogens are nothing new to me as I've been a pretty heavy smoker for the past few years, in addition I've used Shrooms about 4-5 times in that period. I've also had plenty of experience with uppers/downers and whatever other prescription drugs you can think of.",
  "THE PREP-I and two of my good friends picked up on some salvia extract, really looking forward to this trip we drove just around the corner from the smoke shop and started to load up the piece with a pretty sizable bowl. Not knowing what to expect we figured we'll try out a quick hit each to get acquainted.",
  "THE TRIP-I was the first to go, I took a regular sized puff n passed the bowl. At first it seemed like a normal bud high building up but the easygoing fluttering feeling quickly seemed to concentrate into the middle of my field of vision. I was sitting in the driver's seat of my car, the dashboard seemed to sprawl out in front of me, then beyond that the street and cars/scenery etc. seemed to stretch out forever, yet at the same time it simply occupied all of the space it always had, very proportionally.",
  "About a minute later it felt like everything about me was being pushed carefully and gently, but at the same time with great force forward. I turned to my friend Luke sitting in the passenger seat who had just finished his hit, and it was the funniest thing at the time just to see him laughing and sweating as ridiculously as I was. Then out of nowhere he commented about how it felt like he was being pushed forward just like I had felt only a few seconds before. I knew we were all in the same place, very forign but at the same time still chillin in my car.",
  "After the bowl came back around I decided that I really wanted to experience what this plant could offer. I packed myself a pretty big personal bowl and went ahead and cashed the whole damn thing. I exhaled after about twenty seconds and again found all of my vision being condensed into the center of something (be it my field of vision, or my essential-being or whatever, it was an extreme sensation of becoming centered). As I reclined back into the car-seat an intense yellow/ golden light permeated my entire reality. No longer was I sitting in the car on a street somewhere in some neighborhood. But I had been thrown into this void of Golden-Yellow. To me it seemed that I was just floating there in the yellow nothingness, so peaceful so content just existing forever, then out of nowhere I was being bombarded with colors so vivid and vibrant.",
  "These colors yanked me out of that tranquil-golden zone. But with each circle of color that came at me, an entire set of memories of being alive rushed into my consciencesness with it. I would get to breifly look at what each color had to offer before it would flip with great force like a huge coin with a different color behind it and land on top of my being again. Each time this happened it seemed that every one of these experiences/emotions compacted on top of my being and gradually furthered my solidification into the regular reality. By the end of this 'flipping process' it felt like I was completely encumbered physically and mentally by these layers of color and life.",
  "THE COMEBACK-This was when I finally started to become aware of my own body again. I came to and realized that I had been talking the whole time. Saying nothing more than stupid things over and over again like 'whoa, whoa, whoa,' or 'wait, wait, wait,' It was the fact that I had enough control to speak, but not enough control to maintain ties with reality that completely blew me away. I was standing about 5 feet behind my car with no recollection of getting out, sitting up or walking. All I remembered was being flicked backwards like a coin then being pinned underneath it ('it' most likely being my body's interpretation of the sensory stimuli it was recieving back in reality, but had been unable to comprehend because of how far away I thought I was).",
  "After about ten minutes of being back I was covered in a cold sweat and was both burning up and freezing cold at the same time. A great sense of peace seemed to be the only thing that lingered on after that. And I felt really fulfilled, even though I ran out of my car and was muttering things in the road like a maniac. That was my first salvia experience, I would definiely do it again and I think that the experience is truly enriched when I am surrounded by those I know and am familliar with."
 ],
 "erowid": {
  "id": "64147",
  "citation": " Mateo D. \"Heads and Tails of Reality: experience with Salvia divinorum (10x extract) (ID 64147)\". Erowid.org. Feb 27, 2010. erowid.org/exp/64147",
  "substance": "Salvia divinorum (10x extract)",
  "views": "1902"
 }
}
