{
 "title": "Insane Dreams",
 "author": "Zeller",
 "citation": " Zeller. \"Insane Dreams: experience with Melatonin, Vitamin B-6, Valerian & Catnip (ID 17252)\". Erowid.org. Aug 13, 2005. erowid.org/exp/17252",
 "substance": "Melatonin, Vitamin B-6, Valerian & Catnip",
 "bodyweight": "138 lb",
 "report": "<p>I had read that melatonin, B-6, and valerian can potentiate intense dreams so I headed down to the the store and bought some of each.  at about 11 I popped 3 50mg B-6 and then I proceeded to make some valerian tea.  While the tea was brewing I took 3 1mg sublingual melatonin pill and disolved them under my tounge.  Since I hate wasting drugs I consumed the contents of my 2g valerian root tea bag and washed it down with the foul brew.</p><p>I settle down for bed at around 11:30.  I was craving a smoke but instead of tobacco I decide to roll a fat joint, half valerian and half catnip (provides a mild buzz). I then eat 3 more 50mg B-6 pills and go to bed. At 3:30 I awaken from a short, yet very intense and meaningfull dream.  Throughout the night I have a variety of dreams, Including one that could have been considered a nightmare (I havent remembered a nightmare in a LONG time).  I became lucid once and I noticed I had much more control than I usually do (normally I awaken shortly after achieving lucidity).  Though I awoke quite often it was easy to get back to sleep.  One time my back was hurting in the dream, realizing that changing my posture in the dream world didn't help. I awoke and rolled over. The last dream I had was very strange, I was with my brother and I was showing him the joys of flying in a lucid dream. Somehow my 'dream' turned into a video game and I passed him the controller allowing him to play. </p><p>I awoke to my alarm at 6:45 and was fully rested. Still I hit the snooze button and tried to re-enter dream world. Somehow reality seemed less real than my dream.</p>",
 "year": "2002",
 "id": "17252",
 "gender": "Male",
 "timestamp": "2005-08-13T07:00:00.000Z",
 "views": "15929",
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Vitamin B-6",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "3.0 mg",
   "administration": "sublingual",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:30",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:30",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Valerian",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:30",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Vitamin B-6",
   "form": "(pill / tablet)"
  }
 ]
}
