{
 "id": 17261,
 "title": "A Walk on the Beach and After",
 "date": {
  "submission": "2007-07-06T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Horselover Fat",
  "gender": "Male",
  "weight": "147 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "160 mg",
   "administration": "rectal",
   "substance": "bk-MBDB",
   "form": "(capsule)"
  },
  {
   "time": " T+ 2:30",
   "amount": "200 mg",
   "administration": "rectal",
   "substance": "bk-MBDB",
   "form": "(capsule)"
  },
  {
   "time": " T+ 3:30",
   "amount": "300 mg",
   "administration": "rectal",
   "substance": "bk-MBDB",
   "form": "(capsule)"
  },
  {
   "time": " T+ 4:30",
   "amount": "240 mg",
   "administration": "rectal",
   "substance": "bk-MBDB",
   "form": "(capsule)"
  },
  {
   "time": " T+ 16:00",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 16:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  }
 ],
 "report": [
  "<p>The author has been experimenting with a variety of drugs for a number of years.",
  "+00:00 hrs 160 mg bk-MBDB (rectal)",
  "+02.30 hrs  200 mg (rectal)",
  "+03:30 hrs 300 mg (rectal)",
  "+04:30 hrs 240 mg (rectal)",
  "+16:00  hrs 4mg alprazolam, 3g kava (gel caps)",
  "5.30 PM. I took 160 mg of bk-MBDB rectally in a gel cap. After 10 or so minutes I felt quite excited.",
  "5: 40 I went for a walk onto the beach near where I live. It was pleasant to look at the seascapes. I felt than usually benign towards my fellow people. On the beach, old guys were playing with paper kites. I'd taken my camera and took a lot of photos -- anything that appealed. I wanted to get the look the place in my photos (that thought seemed very significant).",
  "6:00 Felt the effects more strongly. I was certainly euphoric and somewhat on edge. In my mind, although I had had a somewhat trying day, I could see my problems form a distance. ",
  "6:30 Still walking, in the park, I realized that the effects were wearing... an hour or so.",
  "7:00 Got home and took another 200 mg. The effects were highly pleasurable. I watched some video clips and other things on my PC.",
  "8:00 Re-dose at 340 mg. Still excellent, hedonistic effects.",
  "10:00 Further re-dose of 260 mg. Even this dose was a highly effective. Afterwards I had no desire to redose, although I couldn't resist this one. Somehow with this drug, after dosing a few times, I reach a very satisfying stop -- an incessant sort of stimulant pleasure. (Its darker side is shown in hints of paranoia and a tendency to start think about trivial remarks as having too much significance. Over regular use would be negative.)",
  "11:30 AM  Finally got two hours sleep with aid of xanax and kava capsules. Fitfully slept for about 4 hours and awoke feeling uncoordinated but not too negative.",
  "I thoroughly enjoyed the experience.",
  "Aftermath:",
  "I would hesitate to do this again for a while. Felt very tired and rained for two or three days. The total dose was too high.</p>"
 ],
 "erowid": {
  "id": "64175",
  "citation": " Horselover Fat. \"A Walk on the Beach and After: experience with bk-MBDB (ID 64175)\". Erowid.org. Jul 6, 2007. erowid.org/exp/64175",
  "substance": "bk-MBDB",
  "views": "19862"
 }
}
