{
 "id": 17283,
 "title": "Very Nice Ride",
 "date": {
  "submission": "2009-09-21T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BladeRunner2",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Carisoprodol"
  }
 ],
 "report": [
  "I've tried a variety of drugs over the years and one of the best combinations for me has been Ecstasy and Soma.  Due to having experimented with various doses of each, I can't say exactly what combo levels have been optimal but I suspect that this would vary from person to person anyway.  Doing it alone is pretty cool, but with others it's absolutely phenomenal.  I've gotten to levels of insights through conversations and interactions with friends that I haven't experienced before with X alone.",
  "Both X and Soma seem to magnify each other in a sensational way.  However, I find that the interaction with the Soma makes me want to avoid the party scene and seek out the more intimate one-on-ones or small groups of 3 to 4.  Of course, this could be simply because I'm more introverted than the average person.  I wait until the X kicks in before hitting the Soma, since the Soma comes on real fast.",
  "On a side note, the sex is incredible - alone or with someone else!  Even better, in fact, than when I've used either of them individually.  I've heard the same from my friends as well, so I'm pretty confident it's not just my own personal take.",
  "When I'm feeling especially introspective, I'll take a walk by a lake in a wooded area near me (day or night) and feel like I'm the only one on the planet and with no cares in the world.  It's sort of beautiful but hard to explain.  That said, sharing the experience with a close friend or two is tough to beat."
 ],
 "erowid": {
  "id": "64275",
  "citation": " BladeRunner2. \"Very Nice Ride: experience with MDMA (Ecstasy) & Carisoprodol (Soma) (ID 64275)\". Erowid.org. Sep 21, 2009. erowid.org/exp/64275",
  "substance": "MDMA (Ecstasy) & Carisoprodol (Soma)",
  "views": "8867"
 }
}
