{
 "id": 17290,
 "title": "Potentiating Adderall with Baking Soda",
 "date": {
  "submission": "2002-02-26T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "waldo",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "18.9",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Amphetamines"
  }
 ],
 "report": [
  "I recently acquired a supply of 20mg Adderall pills intended to treat my ADD.  I really don't believe that I have such a condition, but I certainly enjoy the medications.  Anyway, I had been taking Adderall daily and performing brilliantly in my day to day activities.  After perusing the information sheets provided me by my  psychiatrist about  the drug, I noticed that alkylizing agents, i.e., baking soda, would 'potentiate the actions of amphetamines' by increasing their absorption rate.  Exctited by the prospect of an even stronger buzz, I consumed baking soda according to the instructions on the box and took my usual first pill of Adderall. ",
  "There was a dramatic difference between using the drug by itself and with the accompaniment of baking soda!  The initial wave of stimulation came on faster and stronger than usual, but felt great!  However, as matters progressed - and this is my main point - the usually smooth and happy effect of the amphetamine gave way to a state of excess energy and a marked decrease in mental acuity.  I felt paranoid and claustrophobic in the library where I was trying to study, and could not settle down.  It reminded me of too much Ritalin, or caffeine, or even low quality cocaine.  A few hours later I took a half pill of Adderall, and managed to regain the 'in control' feeling of unadulterated amphetamine I've come to know and love.  All in all, my message is this: baking soda definitely detracts from the good clean fun of Adderall."
 ],
 "erowid": {
  "id": "6430",
  "citation": " waldo. \"Potentiating Adderall with Baking Soda: experience with Amphetamines (ID 6430)\". Erowid.org. Feb 26, 2002. erowid.org/exp/6430",
  "substance": "Amphetamines",
  "views": "119742"
 }
}
