{
 "id": 17304,
 "title": "dO YOu waNt tO bEE a trEE",
 "date": {
  "submission": "2010-07-19T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "V",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "I had experimented with salvia on a few occasion and always enjoyed the results. But my girlfriend had never tried it before. After some persuasion she agreed to trip with me. I was hoping this would be a bonding experience that would bring our relationship to a new spiritual intimacy. I was loaned a batch of salvia 10x from a friend that worked at the local head shop on the grounds of the arriving equinox. I under estimated the strength of saliva because of all prior events had pot in the bowl.",
  "I walked over to my friends house with my girl. He wasnt their, but his father was on the porch and told me that he wasnt home. I had to get my friends bubbler and it was in his room. I marched in past him saying My house! and grabbed the sock wrapped bubbler and left hastily. We went to the heavily wooded campus of saint Martins University, where monks roam and live. I took her to the spot were me and my bud Ben tested out the batch with a bowl of pot. I named it the healing woods after a few strange events. After contemplating the perfect spot we leaned against a tree next to an uprooted tree looking at the swamp/pond. Loaded the bubbler, getting tingly with anticipation/excitement. Told her to hold the hit at least 20 seconds, handed her the bub and she lit it. Took a strong hit, cleared it and held it.",
  "Exhalation was immediately followed by squeal-ish laughter and gasps. I Immediately joined in the laugher, appreciating this moment of bliss we were sharing. In my experience uncontrollable laughter is a normal event with salvia. I loaded my bowl and thought here it goes and ignited the bowl. The watery pineish taste that is unforgettable.",
  "A fairly large rip.",
  "Hold.",
  "Exhale.",
  "Im grinning wide and feeling a bit hyper sensitive but mainly interested in my girlfriends experience. Shes disoriented and confused, but not in a bad place which is what I fear. I tell her Im going to write the healing symbol on a blank post-it note tacked on a tree near by. I try to get up but I cant really move properly. I have to stay put.",
  "Okay. Im telling myself. This is normal with salvia, youre fine.",
  "I look over to my girl friend, she looks alright. I guess everythings just fine. I turn to see any changes in the landscape. Nothing okayI guess 10x is too weak for me. I turn to see my girlfriend.",
  "*WHOA!*",
  "She has big golden cat like eyes and we are suddenly attached to the tree, spinning above and under ground, I can hear the tree spinning, growing, and breathing. I feel myself sinking into the tree and I have to fight to stay above surface. And time is on this strange new urgent time scale. The new landscape is dark and traveling, like crawling underground as well as flying through space. Everything is ultra-organic. Everything is a living personality. The whole forest is telepathically communicating with itself, like a bickering family almost. Whos the strongest, wisest? Whose who. Their was a definite hierarchy in the forest. All focused toward integrating us (anything) with the forest on every level and dimension. And the uprooted tree is trying to directly convince me of the decision to merge. Im unsure and a bit frighten.",
  "I ask my girlfriend DO YOU WANT TO BE A TREE? shes very confused by this. wha? I dunouh...",
  "Were spinning faster and time is running out. The root is losing its patent demeanor. Now its almost scolding me. Join us you fool. I can feel it telling me. Its almost invading. Im getting this paranoia/suspicion that when hippies take psychedelics in the woods, the woods knows and takes advantage of the vulnerability of a person for its own benefit.",
  "I ask her again in my broken slur. dO yOu WaNT tO BEE A trEE?",
  "Im imagining spending my life in the forest talking with the trees and being in a family with them. I didnt want that. I wanted to keep the family I was starting with her, not throw it away in the forest.",
  "noo  she quietly said.",
  "me too I said as I put my arm around her.",
  "The spinning had slowed and now we were in this golden bluish bubble of love. We were both glowing and merging into each other. A three eyed three legged two armed human. This was freaking me out. So I let go of that thought and could barley hear the forest calling. I thought what the hell. I join the forest just for a second and was disassembled. Every part of me was feeding the forest. I could feel my blood under the bark and in the roots. My eyes were the leaves. I was drinking the sun. I was so wise and grand. My life time was so great. I was legend. I was a tree. A forest.",
  "I give my head a shake back to reality/salvia after glow. I tell her Im going get up to put the healing symbol on now. I slightly struggle to get up and, walk there like Im drunk. Pen in hand I draw a circle, and then I scribble a plus sign. Thats the healing symbol I believe",
  "I smile to myself as I walk back to my girlfriend. I thought I had a mental fortitude too strong to be affected by 10x salvia but I guess I under estimated the salvia. I get back to her and ask her to tell me about her trip. She says after she took the hit everything went black. And when I asked if she wanted to be a tree, she thought I was talking about some pattern in the ground. She wanted the high to leave (not very experienced with psychedelics) but it was still lingering. I feel a strange tingle in my bones that I learn to ignore. We walked back to my house and lay in my bed till we felt some what normal.",
  "Overall, an amazing bonding experience that, disappointingly didnt connect us mentally at all. I guess I just have to do it the normal way.  May do it againmaybe for 2012."
 ],
 "erowid": {
  "id": "64379",
  "citation": " V. \"dO YOu waNt tO bEE a trEE: experience with Salvia divinorum (10x extract) (ID 64379)\". Erowid.org. Jul 19, 2010. erowid.org/exp/64379",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2101"
 }
}
