{
 "id": 1730,
 "title": "Violent Spasms",
 "date": {
  "submission": "2001-07-30T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "G Spin",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  },
  {
   "time": "12:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "13:00",
   "amount": "1 cap",
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  },
  {
   "time": "14:00",
   "amount": "1 cap",
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  },
  {
   "time": "14:30",
   "amount": "1 cap",
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  }
 ],
 "report": [
  "6 friends and I were hanging out in a house all day taking Ex and GHB. We had all been out at clubs the night before together doing the same drugs (since approx. 3:am) cocaine was also used by some of the people.",
  "One person joined us around 5p.m. and seemed sober. He took 2 double stacked Red Toyotas and about an hour later a cap of GHB. Within an hour he took another cap. For approx. 1 hr. he was alone and unknown if he'd done more GHB (he told us later he'd done one more cap) at about 5p.m. someone noticed him slapping at his face and kicking his legs. He was violent and unresponsive, and began kicking and flailing around violently and babbling sometimes recognisable words (like: No! Go! Leave! etc, but mostly groaning and grunting). Two people tried to contain him but it made him react worse. He ran into a corner of the room and began banging his head on a cement wall and cut his skin pretty bad. After being restrained for a few minutes he managed to get away and ran to another room which was empty and fell on the floor and lay there kicking and slapping and making noise.",
  "After about 10-15 min of this 'siezure' he was frozen and completely unresponsive. Breathing seemed normal although slightly erratic and he would sometimes twitch. After about 3-4 hours he was awake and coherent. He didn't remember anything since sitting alone in the room before the seizure. His head was in pain but it was unknown if from the drug or the injury from the wall. It was found out later by another friend that this same person had a similar expirience earlier (about 3 or 4am) in a car coming from a different party and had been doing just GHB at that point. He didn't remember that had happened, he thought he'd just fallen asleep on the way home."
 ],
 "erowid": {
  "id": "155",
  "citation": " G Spin. \"Violent Spasms: experience with GHB & Ecstasy (ID 155)\". Erowid.org. Jul 30, 2001. erowid.org/exp/155",
  "substance": "GHB & Ecstasy",
  "views": "16122"
 }
}
