{
 "title": "The Girlfriend of an Addict",
 "author": "Smusiesue",
 "citation": " Smusiesue. \"The Girlfriend of an Addict: experience with Heroin (ID 17310)\". Erowid.org. Jun 20, 2007. erowid.org/exp/17310",
 "substance": "Heroin",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "2002",
   "17310",
   "Female",
   "",
   "Not Given",
   "Jun 20, 2007",
   "7149",
   " "
  ]
 ],
 "report": "</p>\nI might not have taken heroin, but it certainly fucked up my life in a big way. My boyfriend is a heroin addict. Most people look at me as though Im mad. Youre shagging a smack head? Well technically no because its impossible but I can see what they're thinking, images of Trainspotting and dirty needles and Aids running through their small calculating minds.</p><p>I hate heroin, I hate how it turned my life into a living hell. It is good yes, but it hasnt got a bad reputation for no reason because it does turn the people who take it into monsters. My boyfriend was one of them.</p><p>Before gear was even introduced into my life, Mj and I had been going out for 3 years, and yes we dabbled in pills and coke and we went clubbing. But somewhere along the line it all went wrong. You see I lived away at UNI and only got to see Mj at weekends. I knew a couple of his mates had tried gear, but he said he would never touch it. Little did I know that he was smoking it in the week, with friends. What started off as a little bit of fun had totally started to take over his life, and thats when the money started to disappear. He lost his friends because they werent as into it as him and started to make new friends, or associates as I like to call them. And still I knew nothing. Why was he always ill when he came up to uni to see me. Violently ill, every time.</p><p>Eventually he told me. When he had to admit he had a problem. He lost his job and his beloved car and yet he still needed heroin. It made everything better. Everything revolved around smack</p><p>This is when the violence kicked in, the tantrums the sheer desperateness. But he wouldnt stop. He hated himself so much but he couldnt and wouldnt stop, I never knew whether or not to believe him. Crocodile tears.</p><p>I left so many times and then came back. People couldnt understand. But the truth is I loved him and knew that underneath he was still the good person that I had met 3 years previously. I knew that he was a liar a thief and a really manipulative person but it was the gear that made him like that. He needed it to get out of bed in the morning. It totally controlled his life. The stealing got really out of hand, what started as petty cash turned into credit cards and bank accounts. He stole everything electrical in the house and his mum was nearly having a nervous breakdown. It seemed that all we did was cry and go to counceling sessions.</p><p>We tried cold turkey so many times and I would turn my back and he would be gone, first opportunity.</p><p>I could see he was in pain, hot and cold sweats, aching, his legs were on fire. The being sick. But worst of all was the boredom and lack of sleep. I was awake 24 7, just listening to him go on about his craving. I need it, I want it. Im gonna get a taxi back (115 fare)</p><p>But he had to hit rock bottom to want to get off it. He felt no guilt about stealing off his nan or hitting me because I found sixty quids worth of gear and flushed it down the loo. He hated himself but he still needed it. Only the threat of prison got him off it. And he nearly went, busted for staling 4 grand. It all added up.</p><p>That was rock bottom, after a year and a half of misery that was rock bottom. So there is light at the end of the tunnel, I took him up to my house where he couldnt get gear and helped him through it, and he did it.</p><p>He was sentenced to pay all the money he'd taken back. Hes now got a job. But he will always be addicted to that shit.</p><p>Unfortunately we're not together anymore, I dont think I realised just how much it had taken over my life till it was all finished. I need to think about me for once. I watched heroin turn a good person into the scum of the earth and that is the only way I can describe what he was. I loved him and I still do but I cant forget what he reduced me too. A sobbing emotional wreck whose life revolved around his. Worried what a phone call might bring. There is so much I can tell you about, the suicide attempts, reporting him as a missing person to the police constantly worrying about whether he was ok or not but you just have to think.</p>"
}
