{
 "id": 17313,
 "title": "How Not to Trip",
 "date": {
  "submission": "2007-09-10T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Bilz0r",
  "gender": "Male",
  "weight": "80 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.2 mg",
   "administration": "oral",
   "substance": "DOI",
   "form": "(powder / crystals)"
  },
  {
   "time": "6:20",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "10:20",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "10:20",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "12:20",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "14:20",
   "amount": "50 ml",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "14:20",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "Pharms - Zopiclone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I have been humbled by DOI.",
  "To set the scene, I have taken amongst the largest doses of LSD and mushrooms as anyone else I know and have never lost control, never had a +++ experience in the sense of 'The subject is totally engaged in the experience, for better or worse'. While in these hallucinogenic experience I have had obvious CEVs in the form of fractals, and OEVs like shifting dripping and oozing surfaces. While my mind state my have been reduced to outwardly idiotic, I have never felt uncomfortable, freaked out, or overpowered.",
  "I took Friday off. I had some pharmaceutical grade DOI, 3.19mg I weighed out myself (on a related note, that DOI had been in its glass 100mg container for approximately 15 years at room temperature, and as you read, it probably hasn't lost any potency).",
  "6:40am Placed dry powdered DOI under my tongue in the vague hope of sublingual absorption. After about 5 minutes I washed out the eppindorf which had held the DOI with water and swallowed it. The DOI didnt taste too bad, or cause any burning in the long term. I dozed in bed.",
  "7:20am First alert? Maybe, maybe not.",
  "8:10am My fiance goes off to work. I am alone. Another alert? Definitely",
  "Between 8:20 and 9:20am I don't know what I'm doing. Am I partially asleep? am I having violent hallucinations? I am not sure. I am hiding under the covers of my bed. I feel I am too old (24 years old, lol) to be doing this kind of self destructive selfish behaviour, I feel very cold. Thankfully I have my 9-month old Labrador Dog to cuddle with. I feel physically uncomfortable, my feet are writhing. I am having bright, involved fractal closed eye visuals.",
  "9:20am I sit upright in bed, still nude. I flick on the TV, it is some breakfast show rubbish. The sensory input, the massively swimming walls, the open eye fractal patterns and the physical unease are too much. I throw up into the rubbish bin. Painful Dry heaves. Once over, I feel much better and assume that that will be the last of the nausea, I hide under the covers again.",
  "9:20 to 11ish. I am at the height of my experience, an easy +++. My CEVs are brilliant, clear and very interesting. But I am trying to fight them. I am wanting the experience to end. I roll from side to side under the blankets, in the pitch black and silence. I believe I may have had something very close to ego loss. In a closed eye hallucination, I saw 5 symmetrical boats being pounded on by waves, these 5 separate boats were all me, and I was all of them, I remember being concerned about 'us': I was thinking about myself in plural.",
  "~11:00am I am freezing cold, and I do not want to seem like I have lay in bed all day while my fiance was at work. I get up, my coordination is poor, I stumble into the lounge. I look at the walls, they are shifting violently in front of my eyes. I know a fair bit about neuroscience, and I think to myself 'This should be enough to set off my vomiting reflex'. The power of positive thinking perhaps, but my mouth fills with saliva and I am violently sick into the sink. Again, I feel much better. I eat a slice of pumpkin pie, realizing I have not eaten since last nights dinner.",
  "This is a very strange experience. At times the visuals are overwhelming, but when I focus on mundane activities, eating a slice of pie, having a shower, going to the bathroom, I feel largely normal. Unlike LSD or mushroom experiences, my cognitive abilities feel completely intact.",
  "I have a shower. It feel great, but I still can't get warm. I get back in bed and am quickly overtaken by CEVs again.",
  "1:00pm My fiance comes back for lunch, I get up and sit with her. My open eye visuals have largely subsided, I do not feel like talking. I feel selfish and physically weak. She leaves, I smoke half a gram of strong cannabis, but I feel nothing from it. I have another shower and go bad to bed.",
  "2:00-5:00pm I am still cold, I wish the hallucinations would go away. Both the CEVs and OEVs are a lot weaker, but some music videos still strongly set off the hallucinations. I get up at 5:00 to welcome my fiance home. I am still very quite and cold. I smoke another half gram of cannabis, but again feel nothing. Some of the muscle pains are getting worse and my mood is getting worse. I am having GI pains. I eat 2.5mg of Lorazepam, usually enough to get me very drowsy. Two hours later (7:00pm) I have another 2mg of lorazepam.",
  "9:00pm Physical unease still strong. Most visuals have subsided, I am mentally still very on edge. I have a large glass of cognac 7.5mg of zopiclone and get in a hot bath. I play some Indian sitar music. For the first time I feel comfortable, warm, satisfied. The open eye visuals return, a pleasant play of the ripples over my body. It is worth noting that this cumulative dose of benzodiazepines would normally have me semi-conscious, I barely feel sleepy.",
  "9:30pm - 10:30pm, I watched the last half of Indiana Jones and the last Crusade feeling largely normal apart from a sore throat and physical weakness. I close my eyes and fall asleep instantly.",
  "11:00am I awake, and feel normal apart from the Lorazepam hang over.",
  "What I learned from this experience:",
  "1 Get dressed warmly before you take hallucinogens, and at least get dressed",
  "2 It's too obvious, but no matter how experienced you think you are, get the set and setting right. Take hallucinogens in a clean warm room, with your loved ones approval, with some nice music, these drugs can always kick your ass.",
  "With respect to DOI: 3mg is not a middle dose, it is big.",
  "I should have taken lorazepam as soon as I felt uncomfortable.",
  "DOI is stable at room temperature in dry form for a long time."
 ],
 "erowid": {
  "id": "64401",
  "citation": " Bilz0r. \"How Not to Trip: experience with DOI (ID 64401)\". Erowid.org. Sep 10, 2007. erowid.org/exp/64401",
  "substance": "DOI",
  "views": "18847"
 }
}
