{
 "title": "First-Time E -- Theraputic and Beautiful",
 "author": "Lost&Found",
 "citation": " Lost&Found. \"First-Time E -- Theraputic and Beautiful: experience with MDMA (ID 17327)\". Erowid.org. Sep 8, 2002. erowid.org/exp/17327",
 "substance": "MDMA",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "MDMA",
   "(capsule)"
  ]
 ],
 "report": "<p>\nLong-time friend attending my bachelor party in Las Vegas suggested it might be time to give E a shot.  I felt I was in a safe environment to finally try it.  I brought many of the typical questions a person not experienced in drug use might have to my friend, whose research into the subject and assurances based on same convinced me to go for it.</p><p>We took it immediately prior to attending a showing of DeLaGuarda in Vegas.  For the first forty-five minutes, I spent much of my time while watching the show trying to analyze whether this or that sensation was an effect.</p><p>Needless to say that in retrospect, I find these episodes humorous.  The drug hit me very hard initally (next time I'll remember to eat something) and the first feelings were warmth and tingling, but also nausea (which proceeded to its natural end a couple of times) and a feeling of fear, which I now realize came from my strong instinct to always be in control of my body, thoughts, experiences, etc.  Desperate questions such as 'Am I going to die?', 'Are we in trouble?', etc. provided initial amusement and subsequent minor annoyance in those I was with.  This phase lasted perhaps 15-20 minutes.</p><p>Then I experienced what I can only describe as the best 4-6 hours of my life.  Went to a electronica club in Vegas and danced for what seemed forever--I was already a fan of the music and dancing, but this was unbelievable.  It seemed that all barriers to communication were swept away, and my friend and I had some amazing talks and worked out many of the issues that I hadn't realized were barriers to a greater friendship.  This is of course consistent with the drug's use in theraputic environments, but I was amazed at the depth of its effect in this regard.</p><p>The best part of the experience came in the next day, as I spent time reflecting on the many barriers in my life that I saw clearly, and how to use the experience during my regular life to change some of the negative aspects of my own life.  It also enhanced my belief in Christ and helped me to understand just the level of empathy I am called to provide to others.</p><p>Having discussed others experiences with this drug, as well as reading about same, it appears to me that this drug and its lessons may be wasted with overuse, or with use for some pedestrian purpose, e.g. overcoming inhibitions to get laid.  This drug has a compelling story to tell for your life as a whole--I would encourage all to listen and comprehend it the first time.</p><p>I experienced no 'hangover' effects whatsoever. </p><p>Hints would be (a) to realize that whatever fears you bring to the drug may be amplified in its initial stages, but it passes quickly; (b) I would be wary about taking this drug around others who are sober and from whom you have deep, dark secrets--I ran into a little bit of this and it created a problem or two the next day.</p>",
 "year": "2002",
 "id": "17327",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-08T07:00:00.000Z",
 "views": "10297"
}
