{
 "id": 17347,
 "title": "Strange Sleep/Dream Effects",
 "date": {
  "submission": "2010-07-21T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Enigmaticblake",
  "gender": "Male",
  "weight": "178 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  }
 ],
 "report": [
  "I have been taking mirtazapine for about 6 months now. I started at 30mg I now take 45mg before I go to bed and since I have had very vivid dreams. I have heard people speak of having dreams that there falling from a great height but always wake up before they hit the ground. Recently I had that sort of dream except I was having a very detailed dream that was very realistic.",
  "It started with me waking up talking on the phone to a friend who I went and picked up and we were driving away from the city I live next to and suddenly she screamed. Looking back and in my rear view mirror I saw a mushroom cloud. I drove trying to accelerate away from the blast wave, looking back in horror seeing trees and homes being knocked down along with houses. The blast wave overtook my car in slow motion, the glass shattering. I remember worrying what would happen after I am dead as I could actually feel the heat overtake me. It's hard to describe what happened next, it was like I disintegrated my body as well as my field of view, but was still conscious. I thought I was dead. In the afterlife I saw nothing, like I had no physical body. Then I woke up sweating. I could not move or breathe at first for several seconds.",
  "Prior to this dozens of times I had an experience that I dreamt that I had just woken up paralyzed, unable to move open my eyes or breathe. Sometimes dreaming I have kept waking up with the same experience over and over then actually waking up, gasping for breathe and sitting up quickly. Some of those times in the repeating sequences of waking up the experiences would different greatly. Sometimes I was being held down by something other worldly or simply that the ceiling had collapsed on me and I could hear a rescuers voice thinking I was paralyzed. Anyhow the common tread in all I dream I wake up but havent actually I end up fearing Im paralyzed dead or dieing, and I actually always wake up with my heart racing sweating and still fear full that I am still not really awake yet.",
  "I never had dreams similar to this before I started taking this medication. Fortunately I do have a wide Varity or positive/interesting more vivid dreams as well. Also I should mention sometimes right before I have actually fallen asleep completely it seems as if I am starting to dream some times but that is in infrequent. It does help with depression though."
 ],
 "erowid": {
  "id": "64589",
  "citation": " Enigmaticblake. \"Strange Sleep/Dream Effects: experience with Mirtazapine (Remeron) (ID 64589)\". Erowid.org. Jul 21, 2010. erowid.org/exp/64589",
  "substance": "Mirtazapine (Remeron)",
  "views": "6479"
 }
}
