{
 "id": 17343,
 "title": "Into the Woods",
 "date": {
  "submission": "2010-04-03T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Derkesthai",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I dont get many opportunities to use psychedelics, so when they arise, I like to take advantage of them. About a month after Id returned from Bonnaroo, my friend Steve announced his parents would be out of state for a week. Without hesitation, he, my girlfriend Jamie, and our friends Rene and Liam made plans to drop acid at Steves place.",
  "Steves house is ideal for tripping. Its located on a dead-end street in a quiet neighborhood surrounded by woods, orchards, farms, and meadows. Its equipped with a hot tub, a sauna, a deck, a porch, a hammock, comfortable furniture, pool and ping-pong tables, and a high-quality sound system with speakers in just about every room.",
  "3:45 PM - Jamie, Rene, and I arrive at Steves on a gorgeous Saturday in mid July, the day before my twentieth birthday. Steve and Liam have been chilling for a couple of hours, awaiting our arrival. We unpack our belongings from my car and make no effort to mask our excitement.",
  "4:00 PM - We ingest the LSD in Steves basement. Steve, Rene, and Liam each take two hits of potent Bonnaroo blotter, while Jamie and I each take a strong Bonnaroo gel tab and a hit of weaker blotter.",
  "4:20 PM - Im beginning to feel the initial effects, that strange sensation of somethings not quite right. Ive taken shrooms three times, but this is to be only my second time on LSD (though my first trip wasnt very powerful). We decide to go for a hike.",
  "4:45 PM - Walking down the street on our way to the trail, my breathing becomes heavy. I can feel happiness mounting from within, and its all I can do to suppress a huge grin. Liam begins laughing hysterically. This will be his first psychedelic experience.",
  "As we make our way further down the street, the countryside becomes more and more picturesque and I can definitely feel the LSD heaviness in my chest and stomach. We see a dog in a yard, who barks at us and looks totally alien. Jamie finishes eating a banana and places the peel in the middle of the road, an act that will take on a strange significance on the return journey.",
  "We turn left at the bottom of the hill. The road here is straight and follows a gentle, up-and-down sloping pattern for about a mile. I notice the colors of the sidewalk and grass, and wonder why they dont always look this varied and pronounced. I also notice the many insects flying in the air and leaping in the grass, they seem foreign and somewhat hostile. Suddenly, I see small, winged creatures zooming frantically over the grasswhich is now a Martian redon the side of the road. My brain cannot decide what they are, so it settles for a cross between a moth, hornet, butterfly, and miniature bird. On second thought, I am not sure these zipping, winged bugs are real or just figments of my imagination. Only when one plows into my bare chest do I realize these things do exist. I shout an expletive and dash into the road to escape these airborne menaces.",
  "Steve laughs and assures me they are just locusts. I am only slightly relieved. Seconds later, a motorcycle appears on the road in the distance, heading towards us. The sound of its engine is comical, it sounds much more like flatulence than anything else. The man riding it is overweight and astonishingly frog-like. When he passes us, Liam erupts in laughter and declares, That man just frumpfucked my soul!",
  "Later, Liam comes up with a senseless bit of wisdom. In the sands of time, he declares, we sit like rocks. That sends the lot of us into a fit of laughter.",
  "We reach a bridge overlooking a shallow river, where we pause and enjoy the wind on our bodies. I feel as though the gentle breeze is embracing me as a human would. It warms me and sends pleasant shivers down my spine. I am now in a definite state of euphoria.",
  "Further along the way, Liam plucks a large yellow lily and hands it to me. Its stamens reach out at me in an explicitly sexual manner. This sends me on a new train of thought, and I turn the flower over in my hand, marveling at its natural, organic sexuality and the way it stains my fingers yellow. When I mention this to my comrades, they just laugh, and Rene jokingly calls me a pervert. I am not upset at my peers for their reaction, but I do begin to dislike speaking in this state. I dislike the sound of my own voice and, occasionally, the sound of others. Throughout the trip, I will frequently recommit myself to vows of silence and request that others keep their voices low.",
  "We pass a sign that reads, ZELDAS VEGETABLES. A woman is working in a garden across the street from the sign, and I think, That must be Zelda. Everyone hushes as we approach the woman, all of us suspecting she must know were tripping. She doesnt look up when we pass. Normally, I would enthusiastically greet her, but under the influence of LSD, I feel most awkward and remain quiet.",
  "Shortly before arriving at the trail, we pass another sign, this one put here by the state. It says, NO PARKING SUNRISE TO SUNSET. I ponder the message and think its profound that, in order for one to understand the simple instructions, one must first understand what a sunrise and sunset are. I am in awe that such a basic traffic sign relies upon the human understanding of two beautiful, cosmic occurrences.",
  "5:30 PM - The five of us reach the entrance to the trail. I set the flower down by the side of the road, perceiving it as a symbol assuring our safe return.",
  "When we pass beneath the trees, I realize Im tripping hard, harder than Ive ever tripped before. Visuals kick in almost instantaneously, every plant continuously radiates copies of itself into the air, and when the wind rustles the leaves, bright green tracers flow in their wakes.",
  "Before we start the hike, we head down a familiar side path to the edge of a lake where wed had a campfire several months earlier. A rusty old barrel sits in the brush just off the trail, and I feel strangely comforted when I look upon it.",
  "The visuals I perceive at the lake are probably the strongest of the whole trip. The surface of a large tree in front of me ripples as if tiny raindrops are disturbing its liquid bark, and the shapes of its trunk spiral and squirm as if they are alive. I feel as though I am seeing sound. Across the lake, the trees blend into one another, there are trunks where the canopy ought to be, and vice versa. I look to the opposite shore of the lake and expect to see a moose at any moment. Everything here is bathed in a golden, peaceful light.",
  "6:00 PM - Soon after we begin hiking down the main trail, I realize I am not enjoying the trek. I feel like I am in a storybook but I have no control over the ending of the tale. The trees and on either side of me quiver and emit emerald vapors, crowding my vision. The Flaming Lips song It Overtakes Me comes to mind. I hum it for a while and it boosts my morale, but claustrophobia sets in when I notice how narrow the path is. Furthermore, I realize that every step I take I will have to retrace on the way back, since there is not enough daylight left to make the full loop around the lake.",
  "As it turns out, I am not the only one with qualms about this hike. Everyone seems to be expressing their dislike for heading deeper into the woods, and were all tripping so hard were having great difficulty communicating simple sentences to one another. With great difficulty, I suggest we agree on a time to turn back, and we settle on 7:00 PM.",
  "We continue moving forward. The group is talking incessantly, and to me it sounds like a bunch of shouts and screams. Then I realize that everyone really is shouting and screaming. I can feel a headache coming on, and Im starting to sweat. The mosquitoes are relentless. All I want is to turn back and get out of these damned woods, but I know that breaking our groups unity will only make things worse.",
  "The yelling escalates and so does my headache. There is still a great deal of disagreement about what to do. Should we leave the woods or continue hiking? All I know is that the chaos and confusion are mounting, and the trees are making me feel claustrophobic. Our group cant make it fifty feet without stopping, splitting up, and going bonkers. At one point, Liam leaps off the path and perches himself on a rock. Another time, wanders off to find a tree he can climb. Further along, Jamie runs ahead on the trail and I fear she is lost. Steve is relatively silent the whole time, but I can tell hes tripping just as hard as I am. The shouting continues and my head throbs. I sense that Im teetering on the edge of a bad trip, and I pray I dont start to panic. I am about to consider ditching everyone and getting the hell out of the woods, when somehow we come to a unanimous decision. We will turn around and head back. Hallelujah.",
  "7:00 PM - We had probably only traveled a hundred yards in the span of an hour. Thankfully, going back is much quicker than going forward. My bad mood dissolves within moments, and I cheer up with every step I take. Liam and I walk ahead of the other three and express our relief at overcoming such a trying situation. I comment on how dynamic the trip has been, and resolve to think twice before going for another hike on LSD.",
  "We return to the lake, and I am overcome with the same sense of peace and security as when I was first there. We relax and eat some food. I have some difficulty bringing myself to bite into an apple, it looks much more appealing whole. Eventually, though, I take a bite out of it, and Im amazed at how carnivorous I feel. Words like consume and devour play through my mind. I feel like I am killing the apple, like I am tearing it apart, but I dont feel any sympathy for it (which is good, because I am very hungry).",
  "When Im through, I toss the apple into the lake and read the first page of a book Steve brought along. I have a hard time doing so, because the words are moving too much for me to focus on them. I put the book down and take out a Magic Eye book. The images are astounding. Liam finds them hilarious, and laughs until he cries. Rene wants to order a pizza. Steve is fascinated by tiny holes in the log upon which we are sitting. Jamie squeals in lysergic bliss.",
  "7:30 PM - At last, we pack up and head back to Steves house. On the way out of the woods, we pass a small group of kids about our age. Only a few minutes ago, I had jokingly asked my friends, Whats the proper etiquette if you pass another hiker and youre on acid? I greet the kids, but my words feel empty and awkward. None of us speaks for a minute after passing the other group, then, when we are out of earshot, all of us burst out laughing. I hope I dont have to encounter any more strangers.",
  "Upon reaching the road, I spot the yellow lily I had placed on the side of the pavement. A frown crosses my face when I see its been flattened.",
  "The rest of the walk is great. Now that were out of the woods entirely, my mood elevates considerably. I feel much more sociable, and there is much laughter among my companions and I. At one point, I spot a tractor ahead, coming towards us down the street, except in my current state I cannot tell that its a tractor. In fact, I have no idea what it is, just like what happened to me earlier with the locusts. My brain seems to be trying simultaneously to classify the red machine as a robot, ostrich, and police officer. Though the tractor is many yards ahead, I cower until it turns off the road.",
  "A friend of ours calls one of our phones to see how were doing. I have great difficulty using a phone, so I give up and hand it to someone else.",
  "At a four-way intersection, the unthinkable happens. A man stops his car next to us and politely asks for directions. We stare blankly at him, our jaws hanging. The mans face is horribly disfigured. A few of us snicker. I try to take control of the situation and blurt out, Uh, Im sorry, Im not from around here. My voice sounds thin, awkward, and childlike. He waves in response, says Thanks anyway, and drives away. Well, most of him drives away. While his car and body speed forward down the road, his head reminds behind, suspended in midair, transparent and still dreadfully disproportionate. I blink, and then the head seems to realize it has been left behind and whizzes to catch up with its body.",
  "The remainder of the walk back to Steves, while relatively uneventful, is full of beauty and companionship. I take in the full splendor of the countryside and we watch the sun on its descent to the horizon.",
  "8:15 - We arrive back at Steves just as the daylight is beginning to decline. A realm of new possibilities opens, and suddenly there is so much to do. Weve been tripping for about four hours now, and I want to make the best of the time I have left.",
  "For the next hour or two, the five of us listen to music (primarily Jaco Pastorius self-titled album), relax in Steves hot tub, and sit on his back porch admiring nature. At one point, after smoking a Djarum, Steve turns pale and becomes ill. Though I know it isnt his fault, his nausea and general feelings of sickness bring my mood down tremendously. For a while, I develop a new sensitivity to other persons voices, and I find myself seeking solitude. Eventually, Steve vomits and feels much better. After that, my good mood returns and my irritability vanishes.",
  "I recall what a friend of mine had advised me to do if I take LSD. He suggested I lock myself in a bathroom and turn out the lights, promising me that I would be transported. I follow his advice. Hes right, as soon as the lights go out, the bathroom walls jettison away and I find myself on a vast, cold, empty plane surrounded by robots breathing heavily in my ears. Spirals and waves of spheres and colors fly around my vision, and I can make out prehistoric creatures roaming about in the distance. I emerge from the bathroom minutes later in a state of profound awe. I urge my friends to try what Ive just experienced. They do, and theyre all amazed.",
  "9:30 - Rene has been pestering us for almost an hour to invite two of our other friends to join us. Initially, all of us are opposed to the idea, as we had agreed earlier to limit the number of people to five. As time goes by, though, Renes insistence becomes unbearable and we agree to hang out with our other friends Tom and Seth. They arrive stoned out of their minds, and their arrival brings about a more sociable atmosphere.",
  "For the rest of the night, as the trip mellows out, we sit around Steves table on his patio and smoke cigars, drink a beer or two (no one gets drunk), and engage in good conversation. We go for walks and talk about the day, sharing our experiences and introspections.",
  "12:00 - I turn twenty years old. The seven of us celebrate by smoking two bowls of sour diesel. With the exceptions of Tom and Seth, who didnt take LSD, all of our trips are boosted significantly. We freestyle, experiment with words and phrases, and dance around to Snooks Eaglin.",
  "2:30 - Were inside now, making food and listening to music. We lounge around Steves great room in darkness and listen to the entirety of Dark Side of the Moon. Boards of Canada, Incubus, and the Grateful Dead also find their way into our ears. To conclude the night, we watch Disneys Fantasia.",
  "Around 4:00 in the morning, the true enormity of the trip settles in, and I conclude without a trace of doubt that today I had the most intense experience of my entire life. And, now that my mind has finally slowed down enough, I close my eyes and fall asleep next to Jamie."
 ],
 "erowid": {
  "id": "64562",
  "citation": " Derkesthai. \"Into the Woods: experience with LSD (ID 64562)\". Erowid.org. Apr 3, 2010. erowid.org/exp/64562",
  "substance": "LSD",
  "views": "3881"
 }
}
