{
 "title": "'Eh': Not Really Good, Not Really Bad",
 "author": "Don",
 "citation": " Don. \"'Eh': Not Really Good, Not Really Bad: experience with Barbiturates (Butalbital) (ID 17346)\". Erowid.org. Sep 22, 2005. erowid.org/exp/17346",
 "substance": "Barbiturates (Butalbital)",
 "bodyweight": "180 lb",
 "report": [
  "<p>Fioricet is 50 mg Butalbital, 40 mg caffeine, and 325 mg Acetaminophen. They are perscribed for pain and are addictive. I had these pill left over from an injury years ago and forgot about them. So they may have lost some potency. I have tried Vicodin and Demerol but no other pharms for fun. So I will use these as a comparison even though they are not exactly the same kind of drug. Fioricet is not an Opiate. I took these while hanging out with a friend who was drinking, I didn't have any to drink because of the Acetaminophen.",
  "10:00 pm - I take 2 of the pills on an empty stomach.",
  "10:30 pm - Start to feel a little drunk and heavy, no euphoria, I was hoping these would be Euphoric but no go. Like Demerol but with no Euphoria, just a heavy 'off' feeling. It would be a really bad idea to drive now.",
  "I take another .5 a pill to increase the effect, warry of my Acetaminophen intake.",
  "11:00 Pm - hits me a little stronger now, I feel kind of drunk and high, having fun hanging with my friend watching movies. Nothing spectacular. Just way chilled out.",
  "12:00 am - Take the other .5 a pill. I am not going to take more after this because I don't want to go over 1000mg of Acetaminophen.",
  "+10 min - I start to shake pretty bad, I am also very hot and my stomach is burning even though I am not hungry, force myself to eat some food and drink 3 glasses of water. This calms me down some, I hold my hands out to see how bad my shakes are, getting better. I am also pushed one notch 'deeper' into my intoxicated state, pretty null and void to my surroundings, very mellow and at ease.",
  "1:00 am - No more shaking, and my high is all but gone.",
  "4:00 am - The time of this writing, all effects are pretty much gone, I feel slightly off but nothing I would call a high, I can function fully, going to bed.",
  "Conclusion - These are ok if I want to be intoxicated but not drink alcohol, they simply aren't worth $, they don't have euphoric effect. I honestly don't see how anyone could get addicted to these unless they are taking them for pain for too long, as far as recreation goes, there are much better Pharms out there. Not really bad, but not really good, an 'Eh' drug.</p>"
 ],
 "year": "2002",
 "id": "17346",
 "gender": "Male",
 "views": "70444",
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "650 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:30",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:30",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "162.5 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2005-09-22T07:00:00.000Z"
}
