{
 "title": "3 Tries",
 "author": "Aztec Cricket",
 "citation": " Aztec Cricket. \"3 Tries: experience with DiPT (ID 17352)\". Erowid.org. Sep 9, 2002. erowid.org/exp/17352",
 "substance": "DiPT",
 "bodyweight": "125 lb",
 "report": "<p>My friend and I both ingested 6mg DiPT orally with no effect.</p><p>A few weeks later 24mg DiPT was ingested orally, on an empty stomach, with minimal mental and auditory effects.  40 minutes after ingestion I became nauseous, the stomach tension would come and go every minute or so.  After an hour I tried to vomit but could only dry heave air.  The dry heaves seemed to be propelled by a powerful force.  The task of actually vomiting was simple as laying a napkin down on your plate, signaling the end of your meal.</p><p>There was somewhat of an increase in the ability to think in metaphors, but this could have just been placebo.  My voice and other voices sounded much deeper than normal; this was the only auditory effect noticeable.  There was no comedown.  The drug wore off quickly, within 4 hours.  The next morning I had an unusual time waking up.  At 9:48 I looked at my clock and thought I heard the radio on, but it was not.  Between waking up and falling asleep in bed I distinctly remember a few more times that morning I thought I heard the radio on.  Dreams seem unaffected.</p><p>The next day I ingested 22mg DiPT orally on a half-full stomach.  I spaced the dose out over an hour and this time the nausea was tolerable.  Aspects of familiar music sound more pronounced.  I should note Nils Frykdahls voice on the faun fables cd is very pronounced.  Usually I can hardly tell its there.  My moms voice sounds much deeper than it should too.  Mental effects seem very placebo like.  There was very little body effect.  5 hours after ingestion the DiPT had worn off.  I think I would have trouble taking a higher dose, as the nausea seemed pretty bad the first time.  Dosing at this level anymore would be pointless, but it was worth trying.</p>",
 "year": "2002",
 "id": "17352",
 "gender": "Male",
 "timestamp": "2002-09-09T07:00:00.000Z",
 "views": "14179",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "DiPT"
  },
  "1": {
   "time": "",
   "amount": "24 mg",
   "administration": "oral",
   "substance": "DiPT"
  },
  "2": {
   "time": "",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "DiPT"
  }
 }
}
