{
 "id": 17356,
 "title": "A New Awareness",
 "date": {
  "submission": "2007-11-13T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Jon",
  "weight": ""
 },
 "dose": [],
 "report": [
  "<p>This is a log of an amazing event which happened to me.  I had been practicing Kripalu yoga for four months prior and only had recently (two months) begun to take it seriously and actually practice yoga and meditation at home.  I sat down at around 10 or so at night and begun meditating.  I had meditated before, but this time it was different.  I was able to really quiet my mind and focus it.  I entered into a state called Samadhi where my mind became quieter and quieter and I was able to focus intently on one thing.  That one thing happened to be a computer chair in my room, or the clock (which I found to be quite amusing, our dependency on time that is) or the carpet or whatever else happened to fall into my field of view.  My breathing began to slow down and it even stopped.  It was when it stopped that I was truly able to quiet the mind. ",
  "It was in this state of mind that I had my first revelation.  I began to have thoughts, not just thoughts, but strong feelings that I had lived many lives before this one and that this was my final life.  I will no longer be reborn after this life.  I will reach enlightenment.  This lasted for an hour before I decided to try and astral project.  I lay down on my couch and this is when I felt this warm feeling rising up my spin.  I smiled because I knew this was a kundilini awaking. ",
  "I had been trying to leave my body via astral projection for about a month now and was unsuccessful.  I had reached the vibration state before and had successfully done the first exercises described in Robert Monroes book, Journeys out of the Body.  I lay down on the couch, closed my eyes, and began to fall deeper into a conscious sleep state.  I thought about leaving my body, as instructed in Monroes book, and after a few tries my vision was turned upside down.  I also felt this feeling of freedom.  I felt the rigid ceiling against my back and my head and I opened my eyes.  Opening your eyes in the astral world was difficult at first.  I couldn't think of opening my eyes I just had to believe I could see.  Know that I can see and Ill begin to see. ",
  "Its very blurry at first, and if I have a bright light on then its nearly impossible to fully see.  I was able to see the couch below me, but not me.  I still dont know why.  I saw the room as it was and floated around for a bit.  Also, I should note that I was aware that I was still on the couch, i.e. I could feel the couch and my body, but my vision was elsewhere.  At the same time, I could feel myself floating.  If I opened my physical eyes I was instantly returned to my body.  After this I decided to return to my physical body and go take a shower.  This is where things really get interesting. ",
  "I was feeling content and peaceful at this point.  After the shower I was drying myself off when all of a sudden the bathroom got brighter.  It was as if I woke up, more like I was shocked awake.  It just sort of happened.  I felt no desire for anything.  My mind was split in two.  I was witnessing my ego trying to make sense of what was happening.  It was a loss of self.  Pure bliss flooded my body.  I was very joyful.  Immediately I thought of the Buddha and of what happened to him when he reached Enlightenment.  The demon of ego and desire sent his beautiful daughters to tempt the Buddha (in his mind), but he merely gazed upon them, feeling no desire for them, merely witnessing their presence.  Thats how I felt that night.  I was merely the witness.  I felt no desire for sleep, for food, sex, anything like that.  I was content with just being.  It was an experience of God consciousness.  Walking into my room, with a Buddha smile on my face, I remember this incredible energy radiating off of me and when I walked into my empty room, I felt this strong presence as I entered.  I felt like the whole universe could feel me and I could feel the whole universe. ",
  "Something very strange happened to me when I was trying to sleep.  I felt the presence of some malevolent force, some beings that seemed to be watching me.  I felt that they were from the future as crazy as that sounds.  I was also scared that they would try and hinder my spiritual development, try and stop me from experiencing this again.  Whether or not they really were there, I still am experiencing the side effects of that night, such as clearer thinking and a greater awareness.  I havent been able to recreate that night, but I know one day I will experience it again.  I look forward to that day.</p>"
 ],
 "erowid": {
  "id": "64621",
  "citation": " Jon. \"A New Awareness: experience with Meditation & OBE (ID 64621)\". Erowid.org. Nov 13, 2007. erowid.org/exp/64621",
  "substance": "Meditation & OBE",
  "views": "6097"
 }
}
