{
 "id": 17367,
 "title": "A Return to Humanity",
 "date": {
  "submission": "2009-08-25T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Sean",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1/16 oz",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>I'm reporting on my first time tripping on mushrooms several years and several trips later, but I think most first-time and/or regular trippers will find the story informative or interesting.",
  "I was 20. I didn't have what you'd call a hell of alot of experience with psychedelic drugs, or any 'hard' drugs for that matter. I was a pothead and had done LSD once in Argentina, at what I would consider a very strong dose (by American standards) and that experience had certainly blown my mind, but it had almost been too intense for me to retain any special intellectual sense of what I'd experienced. It had pretty much burnt me out and turned me off from hallucinogens for a while.",
  "It was a bright, hot summer weekday in Boston, MA and I took advantage of the weather by taking a day trip which started around 12:00 noon. I cut up half an eighth of stems and caps into tiny bits and spread them on a peanut butter sandwich which I ate. Then I left my apartment on foot. My plan was to take the train a couple of stops downtown to one of the main commercial streets in town, which I knew would provide plenty of action and colorful visual stimulus while I walked the rest of the way down to a friend's place.",
  "By the time the train arrived, I was feeling increasingly buzzed and euphoric, and there were subtle visual distortions occuring... wavy undulating patterns forming on any given texture my eyes fell upon. I remember getting giggly during the train ride which much have lasted about 15 minutes, and feeling a steadily growing yet not entirely unpleasant derangement of my reasoning and senses... bemused by the sighs and the people around me, confused as hell, but feeling pretty good about it.",
  "The randomest and most amusingly opportune thing happened to me when I got off at the designated train stop. As soon as I left the station (and keep in mind that the intensity of my trip was steadily increasing at this point) two young guys with a big video camera stopped me on the street. They told me they were interviewing pedestrians for an online video project of sorts, and the topic of discussion was 'your first love'... I remember thinking how fucking random and insane it was to be put on the spot like that so unexpectedly when I just happened to be tripping balls, but I went with it (and not without some trippy cosmic sense of this experience being in total 'mystical' synchronicity with my trip).",
  "I took off my sunglasses, and started answering some of their questions on camera while growing pretty paranoid that they could tell I was in an altered state. My eyes must have looked like huge black holes because of the dilated pupils and I couldn't help feeling that the guys were sorry they had ever stopped me... they almost looked scared of me!",
  "I believe I managed to coherently answer some of their inane questions regarding my first romance and what not... the last thing they asked me was whether I had any words of wisdom for the ladies out there, and with much amusement at my own spontaneous poetic randomness I remember looking into the camera and uttering 'Just feel the magic moment' before walking off.",
  "To this day I wonder whatever happened to that footage and if it ever aired. It would crack me up to see myself tripping on camera 5 years later. Then again, it's also amusing to wonder if it actually even happened... guess i'll never really know for sure.",
  "My next stop was a small cafe where I sat mesmerized for about half an hour (by now I had lost any real sense of time) while voyeauristically watching people and things around me.",
  "People especially, fascinated me to no end. I think alot of us tend to be rather self-absorbed and detached from other people in normal waking reality, rarely taking the time to stop and acknowledge them, listen, observe and take them all in... how often do I really give all of my devoted attention to someone else? Most of the time I'm just engaged ego-centrically in some internal monologue... going through the motions of listening to others and making eye-contact but never really opening my senses to them. ",
  "Yet I had this incredible sense of contemplative fascination with people... very hard to describe, but almost a childlike awe with the minutiae of their presence. Every movement and gesture I perecived almost in slow motion as a graceful and immaculate orchestration, radiating warmth and virtuous purpose. Almost the enjoyment and admiration of watching a ballet dancer or gymnast derived from watching someone involved in the most mundane thing, like tying shoelaces or lighting a cigarette.",
  "And yet there was something completely mystifying about watching other people. There was a comedic lack of understanding, a certain absurdity to them. I had forgotten the intricate behavioral codes of social humans and could not longer read them as anything more than aesthetic motions, like a dancing. The shrooms had broken down my rational ability to decode the conventional meaning behind things. But this wasn't a negative or disturbing loss of reason, instead it was replaced by the giggling awe of a three year old seeing it for the first time.",
  "I remember watching some college girl sitting at the bar nursing a cup of coffee, and asking the bartender whether the soup of the day was any good. Somehow I had a hard time grasping the meaning behind this most mundane of questions, and yet it fascinated me to the point of ecstasy. The very meaning of human existence seemed to be contained in that simple human exchange.",
  "The more I sat there mesmerized by the people around me, the more I wondered: Who are they? What do they MEAN? There was fundamental confusion mixed in with this fascination, a need to discover some ultimate secret. A sense of some grand playful conspiracy occuring out there, beyond the realm of 'I' which I needed to unveil.  ",
  "Eventually I continued my little trip down the street.",
  "By this point I was pretty much peaking and experiencing strong visuals as the intensity of my emotions was rapidly beggining to overwhelm me. The visuals are hard to describe... everything around me seemed to flow and breathe and interweave in some vivid animated dancing pattern. The plants and flowers along my path seemed to wave and draw near me as I passed them and I could almost sense them caressing me and whispering at me. No auditory hallucinations per se, but a sense of voices, not really auditory but perhaps extra-sensory... maybe my own thoughts and the language in my head resonating and echoing back through universal surround-sound speakers all around me. ",
  "There was a tremendous sense of earthy, organic vibrations all around. I felt embraced by 'nature'... I felt some great unifying energy tying it all together and I was basking in its warm orgasmic glow... 'it' was smiling and winking at me and prompting me along. I felt completely alone and yet never in better company... like the whole universe was confiding in me... I was 'in' on the great cosmic inside joke of the gods. I had never felt such a benevolent, heartfelt connection to the universe before in my life.",
  "But again, mixed up with this ecstatic cosmic reverie was an unexplainable confused feeling, a failure to grasp some great elusive secret... not unpleasant, but rather playful, like a game of hide-and-seek.",
  "All around me were people walking in and around shops, restaurants, driving around in cars. Who were they, what did they MEAN?",
  "The great unifying energy of the universe which I felt all around me also seemed to be concentrated and emanating from somewhere just beyond myself, beyong the realm of 'I'. I felt on some sort of quest to find it. My trip had taken almost mythic proportions and I was giggling with confounded delight.",
  "All of a sudden I perceived all the people around me like social insects... ants or bees, going about their industry while at some intangible, indefinable golden radiant 'center of the hive' all the motions were being orchestrated. There was a center to the universe, a source, a motherboard... and all human activity was in tune with this great metaphysical monster-machine of energy.",
  "I was becoming almost too emotional to continue. There was an unspeakable level of euphoria growing within me that threatened to impair me on the middle of the sidewalk. I became greatly disoriented. Though I was walking in a straight line down a street with intersections at every block, I became incapable of reasoning my way out of this singular path down the street.",
  "For what must have amounted to several minutes I stood prostrated on the sidewalk looking around frantically and trying to rationalize my way out of what seemed some sort of mobius strip, I was absurdly lost on an x-axis and couldn't rationalize my way through the y-axis or beyond this one-dimensional sense of geographic orientation.",
  "Eventually I found my way out and made my way down one of the intersecting streets to the Boston Christian Science Center, which also happens to be it's world headquarters with a huge domed Renaissance basilica and a quarter-mile long pool and lots of fountains. The place was full of people at leisure, lots of families with small children playing in the water spraying from the fountains.",
  "I sat down by one of the fountains and made small talk with a young mother watching over her little kids, and had never felt so reconciled and in love with humanity. I remember thinking to myself that I could die right there and then, and I would be dying at total peace with myself and the world. Years of bitter anger, deppression and nihilism were evaporating under the intensity of this mystical euphoria. I had come back 'home' to the universe. I wept tears of joy.</p>"
 ],
 "erowid": {
  "id": "64669",
  "citation": " Sean. \"A Return to Humanity: experience with Mushrooms (ID 64669)\". Erowid.org. Aug 25, 2009. erowid.org/exp/64669",
  "substance": "Mushrooms",
  "views": "2521"
 }
}
