{
 "id": 17363,
 "title": "Like Pulling Teeth (But Better)",
 "date": {
  "submission": "2010-05-02T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Soleta",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Diazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I decided to take valium as an alternative to general anesthetic during my wisdom tooth extraction. I had never taken it before, and I am generally somewhat hesitant with psychoactive drugs. So far, the only ones I have used, besides alcohol and caffeine, are marijuana, which I like, and LSD, which was a bit too much for me. At this time, I was not regularly using any other medications or herbal supplements, except for ibuprofen, for the pain I'd been having in my (already badly decayed) teeth.",
  "I arrived at the oral surgeon's office an hour before the surgery, took the valium, and then hung out in a quiet room, listening to my iPod, and waiting to see what would happen. The night before, I had made myself a mix of music I thought I would enjoy in such a state, and I did really enjoy it, particularly songs like Stairway to Heaven that are chill, but have interesting rhythmic stuff going on as well. I had recently (about 6 months before) started meditating, so to help myself relax I focused on my breathing and the music.",
  "Nonetheless, I was about to have oral surgery, and I felt nervous. I hadn't slept well the night before, nor had I eaten breakfast, because I had been advised not to in case they ended up needing to use the general anesthetic, so I was pretty tired, hungry and shaky to begin with. At first, I noticed my breathing and heartbeat were faster than normal, but after 10 or 20 minutes they seemed to fall into a more relaxed rhythm. I didn't feel any out of the ordinary physical sensations, like warmth or exceptional muscle relaxation, nor did I notice any distinct psychological effects, the way I had expected to based on my experiences with marijuana. So, at that point I had no idea what effect, if any, the drug was having.",
  "After chilling out for about 30-45 minutes, the nurse came and walked me into the operating room. They told me how to adjust my body, open my mouth, turn my head etc, and I did not experience any confusion or slowness in thinking, at least not that was apparent to me. Then they shot me up with 6 shots of novocaine. Normally, I am very put off by needles, and I experience slight panic even when giving blood or getting an immunization. But, in this case, I just let it happen. I noticed that it hurt, and that my mouth was suddenly devoid of all feeling, but I didn't have the immediate adrenaline response that I usually would in such a situation. Instead, I was able to lie still, focusing on breathing through my nose and enjoying my mix of music, while simultaneously aware of the surgeon plying my teeth out with a twisting motion and, at one point, using a saw. The physical sensations weren't pleasant, but I kept asking myself 'Can I tolerate this? Is it ok?' and deciding that it was.",
  "Luckily for me, my wisdom teeth took only 15 minutes to extract, and then, after 15 more minutes in a recovery area, my boyfriend came to pick me up. I was able to walk, understand all the post-op instructions, and go into the pharmacy myself to pick up my medication. After the surgery I lay down, iced my face, and changed the bloody gauze pads in my mouth every hour or so. I didn't feel high or sleepy, but I do think that the valium reduced my natural tendency to be restless, and helped enable me to just be still, not worry about doing anything, wait for the bleeding to stop, and change the gauze on my own without freaking out or worrying about whether I was doing it exactly right. After a few hours my mouth stopped bleeding, and I spent the rest of the afternoon reading a book in bed, quite alert and happy.",
  "I didn't notice any side effects from the valium, or any change in my mood or perception as it wore off. The only real effect was that it eliminated my normal tendency to panic uselessly in a stressful situation, and allowed me to maintain a calm, aware state of mind in the midst of a fairly unpleasant medical procedure. I don't anticipate trying to use it recreationally, but I would definitely consider using it in the future to help me get through similar situations, especially as an alternative to stronger anesthesia which, from my understanding, is harder on your body, takes longer to wear off and can have unpleasant side effects for the rest of the day."
 ],
 "erowid": {
  "id": "64652",
  "citation": " Soleta. \"Like Pulling Teeth (But Better): experience with Diazepam (Valium) (ID 64652)\". Erowid.org. May 2, 2010. erowid.org/exp/64652",
  "substance": "Diazepam (Valium)",
  "views": "52361"
 }
}
