{
 "title": "Feeling My Way Through the DNA",
 "author": "Fr Moonwatcher 343",
 "citation": " Fr Moonwatcher 343. \"Feeling My Way Through the DNA: experience with Syrian Rue & DPT (ID 17367)\". Erowid.org. Sep 9, 2002. erowid.org/exp/17367",
 "substance": "Syrian Rue & DPT",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1.25 Tbsp",
   "oral",
   "Syrian Rue",
   "",
   "100 mg",
   "oral",
   "DPT"
  ]
 ],
 "report": "<p>After drinking the mixture I did a few hundred mantra repetitions to get my head together.  About 30 minutes in I walked upstairs to use the bathroom.  Legs were very shaky, almost didn't make it back.  I forced myself to get to the couch, wasn't able to get off of it for the next 8 hours.</p><p>At about an hour the visuals started kicking in.  Most intense visuals I've ever seen.  Visual fields basically, but very complex and disorienting.  There was too much visual distortion to really see the room I was so I found it more comfortable to keep my eyes closed.</p><p>So, I found myself laying on the couch drifting in and out of physical consiousness for 8 hours.</p><p>I spent a good deal of time at the beginning going back over genetic code, mainly feeling my way through the DNA and conciousness of insects and reptiles.  The culmination of this was my concious form shifting to that of a human upper half and a slug lower half.  This form would be laying in the slime with others of it's kind.  This place of laying in the slime was kind of my homebase for the duration of the experience.  I would go off on different trips, but always end up returning there.</p><p>One of my first trips off of there was the remembering of a handful of 'past lives.'  I'm hesitant of information recieved from past lives simply because of the impossibility of validation.  Nevertheless these memories or visions contained lots of valid psychological information for my present incarnation.</p><p>The next trip out I encountered a group of men and women in grey monks robes.  They described themselves as a group of initiates studying and sharing the mysteries.  A felt that a few of them were people I know in this life, just in different forms.  We talked for a while and then did a ritual together.  I can remember very little about the ritual itself, though it somehow culminated in me making love to a woman in the mud and slime at a different location with the Brothers in gray watching in a circle around me.</p><p>Though this is only halfway through the experience I have no memory of the rest.  I'd be interested in trying it again at some point with some L-Phenylalanine to help remember it better.  I would say it was definitely a positive experience however.  Helped me to work through some psychological blocks and brought some new insights into my practice.</p>",
 "year": "2002",
 "id": "17367",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-09T07:00:00.000Z",
 "views": "11675",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.25 Tbsp",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": ""
  }
 ]
}
