{
 "title": "These Were a Lot of Fun",
 "author": "Gnostikoi",
 "citation": " Gnostikoi. \"These Were a Lot of Fun: experience with H.B. Woodrose (ID 17370)\". Erowid.org. Dec 23, 2003. erowid.org/exp/17370",
 "substance": "H.B. Woodrose",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "5 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "report": "<p>This was my first time trying HBWR seeds.  I've had them around the house for quite a few months, but I hadn't got around to trying them.  I've taken LSD many, many times, although not in the past few years, so I was curious about LSA. </p><p>I put my seeds in a cup of water and microwaved them on high for three and a half minutes.  Then I ate the seeds (which didn't taste too bad, actually) and washed them down with the water.  I felt the effects coming on within 10 minutes.  Within 30 minutes I was vomiting, which lasted for probably 15 or 20 minutes.  It was unpleasant, of course, but not unbearable. </p><p>By the time I was done vomiting, I was noticeably tripping.  My eyes were extremely dilated and I found it very difficult to move.  At first, the sensation was exactly like LSD, but as the experience progressed I decided that it actually reminded me more of MDMA.  I had the same little rushes of pleasure, and a sort of warm, 'everything is OK' glow.  I got only a very few slight visual distortions, but the other aspects of the experience were very enjoyable and I didn't mind the lack of OEVs.  I am planning on trying a higher dose to see if I can get some OEVs with these, but I will not be all that disappointed if it doesn't work because they are a lot of fun even without visuals.</p><p>One other thing that reminded me of MDMA is that I had a highly sexual response to LSA, whereas with LSD I was usually unable to perform (I know that this is not true for everyone, but it was for me).  When the kids went to sleep my mate and I spent two and a half hours joined at the hips, so to speak, and it was an intense and wonderful experience for both of us (my girlfriend was sober, but said that the intensity I displayed made the experience special for her, too). </p><p>The very best part to me, though, was that with LSA I was able to fall asleep after about five hours.  The main drawback of LSD for me was always that I couldn't fall asleep for 15-20 hours afterwards.  I slept about 10 hours and felt a little out of it the next day, with a sore throat (probably from the vomiting) and sore muscles, but NOTHING near as bad as with LSD.  Nice...</p><p>So I will definitely be trying these again, and I would recommend them to anyone who enjoys LSD, provided that they don't mind a little bit of purging at the beginning of the trip.</p>",
 "year": "2002",
 "id": "17370",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-23T08:00:00.000Z",
 "views": "17192",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 ]
}
