{
 "id": 17382,
 "title": "Glimpse of Perfection",
 "date": {
  "submission": "2010-05-02T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Escherian Mind",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "6",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Propoxyphene",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Alright guys, I have a little but of a 'trip report' for you. It's not much, but here goes.",
  "At 4ish AM I ingested somewhere around 1.2 grams of Propoxyphene Napsylate. Well, I had a sore throat, very, very sore, and I decided that since I didn't have class that day, I could take all that. What happened next was quite possibly the most blissful experience of my life.",
  "I lay there in bed in the beautiful, dark room. My head lay on the soft down pillowcase. I am swaddled in blankets to guard against the cold. It feels so good to be alive right now. I am wearing my headphones, piping music from my favorite band, Switchfoot, all three CD's, into my head. The notes fill my mind with beautiful visions. I am visionary. I see clouds and rivers and every grand vista that a god could possibly imagine, and I stand on the very brink of them all.",
  "I am at the climax of every orgasm that history remembers - from the first, from the monkey that realized it could masturbate, to the beautiful love making, to passionate and terrible rape, to loving kindness, to violent forcefullness - every kind of wonderful, terrible thing possible. My mind reels. Am I breathing?",
  "My rate of air intake has slowed. I must remember to breathe! I sharply intake air, only to be rewarded with the sweetest lungful I've ever tasted. Simply inhaling has the pleasure of a balloon of nitrous oxide. I am practically delerious with the beauty of it all. I want to stay here forever.",
  "But I know that is not possible. I lay, watching the sunrise as marked by light's slow progressing down the brick steps of the building opposite the window. I feel the buzz of activity outside. I feel the birds waking up, the insects preparing for their daily routines. I feel the early spring buds pushing forth from their sessile state, springing to life like so many verdant firecrackers stuck in slow motion, in the matrix bullet time, drinking the sunshine.",
  "Oh the beauty of it all. Behold, I am reborn anew to this world. I will never, ever forget this bliss. My skin feels alive, every cell an amusement park of activity, ever sight a new sight, every sound a new sound. I am a baby again, experiencing it all for the first time, but now I can focus on it, enjoy it all the more, appreciate the moment for what it really is instead of simply allowing it to pass into the recesses of my memory.",
  "I have finally understood the 'opiate bliss', the reverie associated with opiates. I did not feel nausea once. Oh God, and I speak that name in prayer, let me live long and well, and may I experience this forever when I at last this world depart.",
  "Amen.",
  "This trip report is written over a hot cup of tea and ramen noodles, foods that send thrills of joy throughout my body as they glide down my throat and slowly permeate throughout every cell that makes up the wonderful, amazing organism that is - above all things, without measure in its uniqueness, never forget that! - the beautiful, beloved - ME.",
  "Amen again, my friends. Amen."
 ],
 "erowid": {
  "id": "64722",
  "citation": " The Escherian Mind. \"Glimpse of Perfection: experience with Propoxyphene (Darvocet) (ID 64722)\". Erowid.org. May 2, 2010. erowid.org/exp/64722",
  "substance": "Propoxyphene (Darvocet)",
  "views": "10842"
 }
}
