{
 "id": 17384,
 "title": "Dulled, Then Intensified Pain",
 "date": {
  "submission": "2009-10-06T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Female",
  "weight": "97 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Pharms - Ibuprofen",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>I woke up one morning with the most extremely painful stomach cramps that I get with every period. I went downstairs to take my regular medicine I take for cramps, an 800 mg ibuprofen pill. When the pain is this bad, however I usually take one 800 mg and another half, so it amounts to about 1200 mg of ibuprofen. However, my mom just had surgery so she had a bottle of coedine pills for her pain. I decided to try one of those to see if they work better. I took one and went back to bed.",
  "After a while, I began to feel better and my cramps were reduced to a dull ache. My muscles relaxed and I felt lightheaded and dizzy. There were construction workers outside making a lot of noise and although is was 8:30 am, it didn't bother me like it usually does. I fell asleep peacefully and happily.",
  "I woke up around 10am with my pain increased and doubled. I still felt lightheaded, which was combined with a horrible nausea and ridiculous stomach cramps. I went back downstairs to take my ibuprofen pill and lay down on the bathroom floor, waiting to throw up and waiting for the ibuprofen to kill my pain. Instead of this happening, I endured about an hour of lying on the floor crying in pain begging for god to make it go away. I was sweating, shaking and throwing up. After an hour the pain finally started to fade. I threw up one last time and went downstairs to try and eat something. I threw up four more times over the day and felt lightheaded for 2 hours after feeling better. All pain finally went away around 9pm.",
  "I dont know if my bad experience was from the codeiene or the combination of ibuprofen and codeiene or my period or what. But it was horrible nonetheless and I would probable never do codeiene again.</p>"
 ],
 "erowid": {
  "id": "64728",
  "citation": " Anonymous. \"Dulled, Then Intensified Pain: experience with Codeine & Ibuprofen (ID 64728)\". Erowid.org. Oct 6, 2009. erowid.org/exp/64728",
  "substance": "Codeine & Ibuprofen",
  "views": "11512"
 }
}
