{
 "id": 17399,
 "title": "Caution With Effexor and Marijuana",
 "date": {
  "submission": "2010-04-24T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jeff",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "37.5"
   },
   "administration": "oral",
   "substance": "Venlafaxine",
   "form": "pill/tablet"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "dried"
  },
  {
   "time": "0:10",
   "amount": {
    "unit": "mg",
    "quantity": ".3"
   },
   "administration": "oral",
   "substance": "Lorazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have been smoking pot for about a two years now and I started taking Effexor XR 37.5 mg three days prior to this first event.",
  "A friend and I decided to smoke some weed, nothing out of the ordinary, so we packed a bubbler and started taking hits.  I felt fine but the high was a little dull, and I figured it was just because of the Effexor.  About fifteen minutes later we went outside to have a cigarette on the bench out front.  I only had about three puffs from the cigarette when i started to feel a buzz coming on.  Then my palms became drenched with sweat and i felt what can only be described as cold electric shocks in my brain and all the way down my arms legs and spine.  The electric shock feeling didn't last for too long, but my heartrate had gone up to nearly 150 bpm.  I just tried to relax and soon it was over.  We watched a movie and even smoked another bowl and i felt fine, a little shaken up, but pretty good and stoney.  I tried to make sense of what happened and figured that the marijuana had to have caused a spike in dopamine and when reinforced by the nicotine in the cigarette (nicotine releases dopamine in the brain) i must have put my nervous system into some kind of overload.  I figured that it was okay to smoke weed on the Effexor, but not with cigarettes.",
  "Three days later, still on the same dose of Effexor Xr, i packed another bowl and prepared to relax.  Everything went fine and i decided to go surf the net.  I was reading something when i noticed my pulse was around 140, i figured i'd be fine because it's gone that high when i was running before.  Then my palms began sweating buckets and i felt a tightening in my chest.  My pulse began to accelerate and i again felt electric shocks in my brain, lasting only a couple seconds.  My pulse was now hovering around 160-170.  I decided to take a bite from an Ativan (lorazepam), about .3 mg, to help calm my brain down.  Soon my heart rate was back down to 140 and i sat back down in my chair.  I was freaked out but shrugged it off, figuring i had learned my lesson and i shouldn't get high while on this drug.  Five minutes later, i again felt tightening in my chest and more shocks continued.  My heart rate again increased to 160 and i was sweating.  This quickly subsided and my heart rate fell back to 140.  Withing twenty minutes my heart rate had dropped to 100 and i felt fine.",
  "No need to say, these incidents scared the hell out of me.  I have heard that some people are fine on Effexor and pot, but i am now aware of even more serious incidents of seizures.  I would advise anyone on Effexor to be cautious if using cannibis."
 ],
 "erowid": {
  "id": "64766",
  "citation": " Jeff. \"Caution With Effexor and Marijuana: experience with Venlafaxine & Cannabis (ID 64766)\". Erowid.org. Apr 24, 2010. erowid.org/exp/64766",
  "substance": "Venlafaxine & Cannabis",
  "views": "14896"
 }
}
