{
 "id": 17394,
 "title": "I Am Part Of The Entire Musical Field",
 "date": {
  "submission": "2002-01-19T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Catfish Rivers",
  "gender": "Male",
  "weight": 120
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 in",
   "administration": "oral",
   "substance": "Cacti - T. peruvianus",
   "form": "liquid"
  },
  {
   "time": "2:00",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  },
  {
   "time": "5:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  },
  {
   "time": "7:00",
   "amount": "5.0 ml",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "liquid"
  }
 ],
 "report": [
  "It had been some time since my last mescaline journey and I was very excited for this experience. I had a 12' section of T. Peruvianus that I had despined, skinned, and forxzen overnight. These pieces were placed into a blender with a small amount of water and some lemon juice. The juice was then strained though a collander lined with cheese cloth. It took aproximately 4 hours of straining and reblending, adding water here and there. The remaining liquid was slimey and mucus like but was much smoother without all the muscilage. I then added several packets of splenda sugar substitute. It went down easily and I was surprised at the lack of bitterness.",
  "12 am>  Drank cactus juice. Surprisingly it wasn't bitter at all. This is not a good sign. I think my cactus may have been a dud. I have found, in my own experience, that the T. Peruvianus varies much more in potency than San Pedro. I smoked a few bowls of MJ to quiet any potential nausea.",
  "2 am> Slight head change noticed. I think I can confirm that the cactus was very low in potency, although I do feel a slight something. I have spent several days preparing for this experience by fasting, meditation and reading spiritual texts. I am not about to let the evening peeter out like a soggy firecracker. I measure out 100mg of DPT and split into two 50 mg. lines. I insufflate 50 mg per nostril. Moments afterwards I can already feel the Wonka-vater shooting skywards. I feel a dreamlike cacoon enveloping me. The burn/drip is present but tolerable.",
  "2:30 am>  Visuals are very engrossing. The character of the visuals is difinitely different than usual. Whatever mescaline I did imbibe from the cactus is affecting the trip for sure. I am seeing amoeba like nets, perhaps something like camoflauge patterning. I am listeng to music imbedded with theta waves. I feel supremely relaxed. CEVs are instant and detailed. I am imagining myself sitting next to a placid lake at sunrise. I feel an electric current moving through my body. Slight jaw tension seems related to this current. I am holding a piece of sceptar quartz to help channel any negative consciosness into it. I find this to be an effective technique for displacing unwanted energies. It works just as well with a stress ball or perhaps a worry stone.",
  "4 am>  I have been playing guitar along to Tortoise and 5 Style. I feel as if I am part of the entire musical field, as if I am part of the recordings. Playing guitar is very meditative, there are no thoughts arising from my mind. My mind is like the still water of the lake I was imagining earlier. I am at a +++ easily.",
  "5 am> I have come down considerably. It is getting light outside. I have smoked some MJ and it has kicked me into a pleasant lethargy. I decide I haven't had enough and decide to insufflate 50 mg more of DPT. Soon afterwards I am plagued by a fit of jaw clenching.",
  "I take .5 mg Clonazepam to alleviate this.",
  "7 am> The sun has come up. The rays of light coming through the tree limbs and into my basement window have an almost religious quality to them. The light feels warm against my face and shoulders. I can feel myself absorbing energy like a dry sponge. The jaw clenching is present but managable now. I decide to mix 5 ml of 1,4 Butanediol to start myself down the path of sleep.",
  "9 am> The 1,4B is starting to cause me to feel drowsily content. I take my puppy for a walk to the deli. I get some breakfast. The two of us chow down and then walk home and I crash."
 ],
 "erowid": {
  "id": "6475",
  "citation": " Catfish Rivers. \"I Am Part Of The Entire Musical Field: experience with Cacti (T. peruvianus), DPT & 1,4-Butanediol (ID 6475)\". Erowid.org. Jan 19, 2002. erowid.org/exp/6475",
  "substance": "Cacti (T. peruvianus), DPT & 1,4-Butanediol",
  "views": "12753"
 }
}
