{
 "id": 17393,
 "title": "Polypharmacy, Sleep, and Addiction",
 "date": {
  "submission": "2009-01-03T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Az",
  "gender": "Male",
  "weight": "300 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Barbiturates - Phenobarbital",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>I've been experimenting with solutions for my chronic insomnia for several years, and I've been through a veritable litany of depressants throughout my lifetime.  I count myself of my generation to be one of the 'lucky' ones to have experienced Placidyl in my recent memory, as I was given it as a teenager for my insomnia, and definitely experienced with chloral hydrate, and meprobamate.  My psychiatrist and neurologist both have been involved in this endeavour, and have signed off on nearly three dozen prescriptions, countless neurological tests and imaging series to find something that works and something that's causing it - but I still continue (without medication) to not sleep for 4-5 days at a time. ",
  "I had my first encounter with the barbiturates when I was 17 and my psychiatrist recommended that I try phenobarbital, dosed at 120 mg qhs, it worked somewhat, but it did not maintain my sedation.  I found myself waking up multiple times in a short succession and having difficulty returning to sleep.  This progressed to 180, and then 220 mg, each time after a day or two, the same effects.  Keep in mind, that by this time, I'd been exposed to Placidyl (ethchlorvynol), Valium, Librium, and Halcion, each to no avail.  My doctors were concerned about my ability to clear the large dosages that I required of Placidyl (4 greens, 750mg each), and my seemingly impossible tolerance to Valium, I could eat 30 mg and still walk an hour later, with no sedation whatsoever, after the first dosage trials.",
  "The decision to 'move to the big guns', as my neurologist said, was that a smaller dose of a more potent, shorter-acting barbiturate would benefit me because it would be cleared in shorter time, if I recall correctly.  So, in 1999, my psychiatrist and neurologist both signed off on what would turn out to be the most 'interesting' period of my sedation experiences - the Era of the Barbs, as I call it. :)",
  "Starting with 100 mg of Seconal (secobarbital), one, cute, little red capsule - we begin the journey.  About 15 minutes after dosing, I know something is different.  I feel like I'm a little less edgy, relaxed, I find that I'm content to watch TV and really just not move.  45 minutes into it, the same couch has hold of me - moving is difficult, and all I want to do is lay down and go to sleep for a while, which I'm thinking - COOL!  Finally, I found it.  Within another 10 minutes or so, I'm tanked, and snoring soundly.  I recall looking at the clock just before I faded out, and it was a little after 9 in the evening.",
  "I woke up shortly after 10 the next day - feeling like I'd been hit with a concrete block in the head.  I know now that this is a common experience to barbiturate users, sort of like the drinking hangover.  My psychiatrist laughed, and told me that if I had a problem with it, he would write me for something to fix it.  'Fixing it' resulted in a prescription from my psychiatrist for 10 mg dextroamphetamine (time release spansules).  Now, I can look back and call my shrink a complete and utter quack for writing me for what I term now as the Joan Crawford cocktail, but at the time, I was happy to have the energy and at least be functional in school, and sleep at night.  I was carrying high school courses and college courses at the same time for the last two years of my high school career, so anything I could do to help it was A-OK in my book.",
  "So, for the next year, I alternated between up with dextroamphetamine, down with secobarbital, and visits to my neurologist, psychiatrist, and a cardiologist once a month to test my cardiac function and make sure my heart wasn't being affected by the dextroamphetamine.  All tests came out great, until production of secobarbital stopped in 2000-2001.",
  "My psychiatrist mentioned to me that soon, supplies were going to dry up, and my pharmacist seconded it, and that we should look for an alternate treatment.  By now, I was up to 400 mg of secobarbital at night and 30 mg of dextroamphetamine in the morning.  Nobody was alarmed at the time - things were looking groovy, except for the pending halt of production.  My shrink told me that we could potentially switch to Nembutal, pentobarbital.  Consulting with my pharmacist, he decided to write me for an equivalent dosage of Nembutal, 300 mg, plus 120 mg of phenobarbital to smooth out the transition.  This worked great, except for the lengthy fatigue I was starting to experience as the dextroamphetamine started to wear off before the phenobarbital was completely gone. ",
  "This went on for another two years, until my cardiologist noticed my aortic valve was dilating, causing blood to backflow.  He attributed this to the amphetamines, and my psychiatrist started reducing the dosage, and recommended to me that I go into inpatient detoxification, as if I were to stop anything cold-turkey, it would cause me serious problems.  I declined, at the time, and went on for another month, having headaches, hallucinations, and having problems sleeping again.  Consenting to inpatient admission was more and more on my mind, and in January of 2002, I checked in to a large hospital on the Gulf coast for inpatient detox. ",
  "In eight weeks, I was completely weaned off of the Joan Crawford cocktail, but still having problems with sleep, and we started the cycle all over again with Ambien (causing me horrible hallucinations and night terrors), Sonata (more of the same), Lunesta (Yes, doctor, I like tasting iron bars in my mouth and not sleeping because I can't close my eyes), chloral hydrate (profuse projectile vomiting, both capsules and syrup + kool aid, but at least I slept some), and eventually, we returned to Nembutal, which for all of its faults, worked the best.  I continued taking Nembutal on and off for the next few years, until Ranbaxy started producing Seconal again, and now I'm taking 200 mg for sleep (as of July of 2007), one or two nights a week on average.",
  "I've managed to go through the depths and come back to normality somewhat, over the past few years, and I doubt I'll ever be able to sleep 'normally'.  My neurologist is pressuring me to try an off-label use for Xyrem, the GHB formulation used for treating narcoleptic cataplexy, so I might soon, we'll see.</p>"
 ],
 "erowid": {
  "id": "64749",
  "citation": " Az. \"Polypharmacy, Sleep, and Addiction: experience with Secobarbital (Seconal), Phenobarbital (Nembutal) & Amphetamines (ID 64749)\". Erowid.org. Jan 3, 2009. erowid.org/exp/64749",
  "substance": "Secobarbital (Seconal), Phenobarbital (Nembutal) & Amphetamines",
  "views": "29216"
 }
}
