{
 "id": 17402,
 "title": "Unrelenting Abdominal Pains",
 "date": {
  "submission": "2008-02-16T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "happypsychonaut",
  "gender": "Male",
  "weight": 153
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "500",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "3250",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "400",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "One day I was quite relaxed but curious about my Rx for fioricet, it was about 2pm on a monday (verry borring). Since I had had no luck with my one vicdin, I decided to take some fioricet since I was calm, alert and verry willing to experament.",
  "T-2:05 I take 10 fioricet and wait for my nirvana. slowly the the effects come like a gentle breeze. I am at home alone for the day, so it is a safe place. As I sit on the couch I feel slow currents of relaxation wash over me this occurs at 2:40.",
  "T-3:22 wonce again I am on the couch in the living room when I begin to feel really intoxicated, but somethings wrong. I begin to feel incredible abdominal pains accompanied by severe nausea. Uh-oh did I take too much tylenol or is it the barbiturate?",
  "T-4:09 I go to the bedroom but the pain is unrelenting I toss and turn for a couple of hours and the pain slowly subsides. later on I am glad just to still have a stomach.",
  "all and all a little buzz wasn't worth it."
 ],
 "erowid": {
  "id": "64780",
  "citation": " happypsychonaut. \"Unrelenting Abdominal Pains: experience with Barbiturates - Butalbital, Acetaminophen & Caffeine (ID 64780)\". Erowid.org. Feb 16, 2008. erowid.org/exp/64780",
  "substance": "Barbiturates - Butalbital, Acetaminophen & Caffeine",
  "views": "11638"
 }
}
