{
 "id": 17404,
 "title": "Enormous Dose",
 "date": {
  "submission": "2007-12-04T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "K",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "175",
    "grams": 0.175
   },
   "administration": "oral",
   "substance": "2C-I"
  }
 ],
 "report": [
  "[Erowid Note: 175 mgs of 2C-I is considered an extremely high dose, see 2C-I Dose Chart]",
  "No, that is not a typo. I did around 175mg of 2C-I one night (don't even ask why or how that happened) and am here to report that I am alive and well. For those of you that are curious as to the limits of this drug and possible side-effects of taking copious amounts of it, I must say that this was a pleasant experience for me and, apart from losing a night's sleep, I had a good time. If you are not going to read this whole report, at least skip to the bottom and read between the asterisks.",
  "2C-I has never affected me mentally whatsoever. I have always had completely sober thoughts throughout every trip and have never had a problem communicating. I have done 2C-I upwards of 50 times. This time was different, as my mental state was unusual. I noticed effects similar to that of mushrooms, thought loops, sudden confusion, and an overall shift in consciousness (not unpleasant, mind you).",
  "The visuals and body high were obviously ridiculous and very enjoyable. The visuals persisted strongly for about 20 hours, and remained noticeable until around the 31 hour mark, at which point I went to sleep. I woke up feeling fine the next morning. I have felt no negative long-term side effects from doing this amount of the drug. I have felt no negative long-term side effects at all, in fact.",
  "For those who are curious: the 2C-I ingested was tested to be over 99% pure. It was completely legit.",
  "That being said:",
  "** I do NOT recommend that you EVER attempt to do something that stupid, as I am fairly certain it could kill you if you don't know what the drug does to you. Again, DO NOT DO 175MG OF 2C-I. This report is merely for those curious as to how much one person has ever done in a sitting. If you decide to do this, it is in no way my fault and I accept no responsibility for your questionable actions. **",
  "Thanks for reading."
 ],
 "erowid": {
  "id": "64807",
  "citation": " K. \"Enormous Dose: experience with 2C-I (ID 64807)\". Erowid.org. Dec 4, 2007. erowid.org/exp/64807",
  "substance": "2C-I",
  "views": "3729"
 }
}
