{
 "id": 17425,
 "title": "Excellent Anxiolytic",
 "date": {
  "submission": "2007-09-04T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Enki",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "700",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Aniracetam",
   "form": "daily"
  }
 ],
 "report": [
  "Well-intentioned though misguided prepararation of approximately 2g of Aniracetam, an extremely hydrophobic powder, in a few oz. of fish oil: Knowing it was hydrophobic, erroneously believing it to be lipid soluble, I decided to mix it with fish oil and thereby take two alleged cognitive enhancers at once. Well, aniracetam is apparently no more soluble in fish oil than water, at least at the ratio used here. When the oil and powder were mixed as well as possible, I used a pipette to dribble the smelly, oily concoction into small (size 0?) gel caps from a health food store.",
  "Over several consecutive days, I would take 2-4 capsules with each meal. Within hours of the first dose, I noticed a marked decrease in fatigue and muscle tension, which continues even now. I did not sleep the first night, I was simply too excited to be getting work done and pushed through. Little seemed to bother me, I smiled more readily and could concentrate much longer and deeper on tasks and ideas, weighing their subjective value and amount of effort required to accomplish with relative ease.",
  "It had the effect of what might be called mood flattening without cognitive or emotional impairment: I was simply less responsive to conditions ordinarily bothersome or distracting. A more apt description may be that Aniracetam *elongates* attention, analogous to squeezing a bubble. My ordinary thought process is relatively inefficient, there is much inner monolog and FUD about resolving the smallest of issues.",
  "Continuing the analogy of the bubble, it seems the displaced volume of attention overlapped more harmoniously with pragmatic, directed action rather than the vague anxieties of imagination. I made more errors but learned quickly whereas normally I am more risk averse and try to get something for nothing. While taking Aniracetam & fish oil, my thought process became much more streamlined and effective. I worked on and finished several computer projects that had alternately fascinated and repulsed me for weeks. All began as purely personal interests but a few have commercial potential previously unimagined.",
  "On day 2, the productivity slackened off a bit, probably as a result of lost sleep. I did sleep through morning of day 2, dreaming quite a bit and waking up excited. All physical appetites were heightened, anxiety virtually nonexistent. It is difficult to overemphasize the novelty of that condition! Productivity was well over typical, though not as high as day 1. I had stopped taking Adderall (prescription amphetamine) two weeks ago and was pleased to notice I am putting weight back on.",
  "Day 3 saw a more moderate continuation of same, and emotionally felt quite good. I felt a full, stable sense of purpose and equanimity that had been missing for months, probably as a result of long term use of amphetamine.",
  "Today is day 4, and I intend to keep this dose up and order more Aniracetam soon."
 ],
 "erowid": {
  "id": "64904",
  "citation": " Enki. \"Excellent Anxiolytic: experience with Aniracetam (ID 64904)\". Erowid.org. Sep 4, 2007. erowid.org/exp/64904",
  "substance": "Aniracetam",
  "views": "34648"
 }
}
