{
 "id": 17431,
 "title": "Tingling Ice Crystals",
 "date": {
  "submission": "2009-10-04T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "PvcPatter",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "smoked",
   "substance": "Caffeine",
   "form": "ground / crushed"
  }
 ],
 "report": [
  "I am 6'4' and in fairly good heath at the age of 19. One night my friend and I were sitting around a camp fire bored and stoned as always and I brought up smoking some of the caffeine pills that I had. So we crushed up one of the Awake pills and loaded it into a bong with a bowl of weed.",
  "We proceeded to smoke about half of the bowl around the fire and them we took a stroll into the woods to check on my friends 'babies'. There I proceeded to finish the bong bowl. As we walked up the hill back to the fire I began to feel a strong tingling in my lungs and in the tips of my extremities along with a really hyper sensation. The familiar pot high was there, I have been smoking on and off for 3 years and I know pot pretty well but I was off in left field by the time I got back to the fire. My friend who has done ecstasy described it as the prehigh before the E really stated to kick in.",
  "By a half an hour after I finished smoking I felt like my lungs were full of tingling little ice crystals and I was as jittery. I had smoked this pot the night before and had not felt these symptoms so I am assuming its the caffeine. It took me about an hour or two to come down but my friend told be it had taken close to four hours for him. I intend to try it again to make sure that it was not a placebo effect but I was messed up far beyond what a 20 bag between me and my friend should have done. But I felt pretty crappy the first half of the next day and I had a really hard time getting to sleep that night."
 ],
 "erowid": {
  "id": "64928",
  "citation": " PvcPatter. \"Tingling Ice Crystals: experience with Caffeine & Cannabis (ID 64928)\". Erowid.org. Oct 4, 2009. erowid.org/exp/64928",
  "substance": "Caffeine & Cannabis",
  "views": "4702"
 }
}
