{
 "title": "Electric Blue Veins Shimmering Into the Void",
 "author": "Tiapan",
 "citation": " Tiapan. \"Electric Blue Veins Shimmering Into the Void: experience with DET (ID 17437)\". Erowid.org. Sep 12, 2002. erowid.org/exp/17437",
 "substance": "DET",
 "bodyweight": "80 kg",
 "header": [
  "DOSE:",
  "75 mg",
  "smoked",
  "DET",
  "(freebase)"
 ],
 "report": "<p>Diethyltryptamine - (freebase crystals) large white/translucent platelets (slightly gold/brownish) waxy-soft (disintegrated if rubbed between fingers) with strong pungent faecal odor.</p><p>Initial attempt at ingestion consisted of lacing 50mg of DET freebase crystals in standard hand rolled tobacco cigarette (7cm) then smoked. No effect was detected.</p><p>Second attempt: 50-100mg of DET freebase crystals were mixed with 2 times its volume of powder cannabis leaf. The entire mixture was then smoked in single inhalation through small bowled water pipe (a 'bong' using trumpet mouth piece as bowl bubbled through 200ml of water prior to inhalation)so full dose delivered in single inhalation. Any attempt at a second intake resulted in severe coughing fit with much irritation. The not so pleasant odor is distinctive pungent and persistant</p><p>Effects: Almost immediate overwelming (30sec) change in perception extremely strong visual hallucinations, lethargy, inability to talk, motor skills severely inhibited, heavy chest feeling.</p><p>Fantastic intricate coloured geometric and arabesque patterns appeared particularly along edges where a high colour contrast existed on all surfaces. The walls roof and floor had taken on the appearance of liquid with waves rhythmically rolling over them. The table legs writhed and moved as if alive and tensing to support some massive weight. Ordinary cracks in a concrete floor were transformed to living beautifully coloured filiments as if waving in a breeze. Stationary objects where transformed into textured almost living objects with rapid sometimes explosive movements. The floor boards opened up as if they were made of flexing rubber covered in moving tapestries of colour, revealing chasms with electric blue veins shimmering into the void. Faces, animals and other recognisable shapes appeared in garden rocks and pavements transforming rapidly, as if melting, into new and more amazing features. Patches of green moss turned into microcosmic jungles as if from a fairy tale, their symetry and intricate detail became obvious for the first time. Flower petals seemed soft and to have a beautiful coloured mist about them taking on a rich velvety appearance. Peoples faces distorted and became strangely coloured with pink green and mauve highlights and shadows, as if they were exagerated cartoon characters. Some of the colours - irridescent blues purples reds greens and yellows that steaked around objects where brilliant. It was, as if, one had a cloudy opaque film over ones eyes for the whole their life, and by partaking of this substance, the film was removed for the first time, allowing one so see colours with a range and clarity never experienced before. Truly a powerful and amazing visual hallucinogen.</p><p>The best comparison would be to that of a very high dose LSD or Psilocybin experience, entering at the peak immediately, rather than waiting for 2-3hrs. The initial DET effect is far stronger than anything experienced with high LSD doses. The initial effects begin within 30secs increasing in strength at a massive rate reaching peak of maximum effect within 5 minutes The 'non-compus stage' (immobile stage - you really dont feel inclined to move much) this part of DET peak lasts around half an hour gradually weakening in effect to the level of a high LSD peak after about an hour. (One could walk relatively easily again). The effect diminished gradually for a further 2-3hrs, fading back to normality and ending with virtually no indication the experience had occured - very clean finish.</p><p>Total duration 3.5-4.5 hrs. Having second or third experiences in less than 48hrs resulted in noticibly lesser effects, presumably due to rapid tolerance build up. A break of several days allowed repeatable experiences as strong as the first experience.</p>",
 "year": "1975",
 "id": "17437",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-12T07:00:00.000Z",
 "views": "22377",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "75 mg",
   "administration": "smoked",
   "substance": "DET",
   "form": "(freebase)"
  }
 }
}
