{
 "id": 17443,
 "title": "Wednesday",
 "date": {
  "submission": "2010-01-07T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Archimedes",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.25 hits",
   "administration": "",
   "substance": "LSD"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 ],
 "report": [
  "This is the story of my momentous first experience, ever after referred to only as 'Wednesday'. Coincidentally, this Wednesday happened to be the first day of spring, a good day for rebirth. I should preface what follows with this: This LSD was incredibly potent. Because it was my first time, and because of the reefer, I had quite the time trying to piece the events of the night together sequentially. Thus, I will stop reporting things as happening in ordinary linear time past a certain point in the trip, only to resume doing so when the story ventures into the morning after.",
  "I had been preparing for some time, along with my three partners in crime. One, lets call her Z, had not dosed before, the others, J and S, had both done this before. We had all made playlists, brought books, activities, even a video game console. Needless to say, in the end we did both less and more than we had planned. The day of the trip J was returning home from a college visit, I remember distinctly the waiting in front of his house for him to get home. The sense of giddy euphoria was overwhelming. The ride to Zs house, where the event was to take place, was filled with shouts of glee.",
  "We dosed at nine in the evening, almost exactly. The first thing that I noticed, and perhaps this was just nerves, was a feeling like energy in my spine. Then, for no obvious reason, we decided to go on a walk. It occurred to me, and I then informed my compatriots, that this was the first day of spring. They seemed to be delighted. There were no major perceptual distortions during the walk, only a few subtle ones. Shadows flickering in the corners of our eyes. Upon our return, however, things were distinctly different in an indefinable but extremely meaningful way.",
  "From somewhere in the house J procured a chess set and we began to play. We thought it appropriate to take on different names while playing chess: he became Morgoth and I, Manwe (for all you Tolkien geeks out there). Each piece seemed to have its own distinct personality, they were individuals with their own goals and hopes. This idea put a damper on my ability to strategize, I simply wanted to let these fellows do their own thing. J eventually triumphed. Later we would return to this same board, only to realize that we couldnt remember to rules. So, doing the only logical thing, we turned the board so that it formed a diamond and made up our own.",
  "At some point I looked up at a wall hanging, in sober life a rather drab abstract",
  "piece, but to me at the time a variety of images, reminiscent of Archaic Greek vase paintings were playing out across it. Its shape and size seemed to distort, and as a continued to watch it I realized that it was playing out a story for me. I couldnt make out the details, but I could swear it had something to do with Dionysious. We had brought paints, and I saw fit to cover a portion of my face with green, the wonderful color of the herb. The others, being a bit closer to the material plane at that moment, advised me to clean my face before it dried. I went to the bathroom and very strange things started happening. Looking in the mirror while tripping can be very rewarding, but very harrowing. I seemed to see all my faults laid out before me, spelled out on my face. As I washed it, they, along with the green paint seemed to fade. I was then struck by the urge to use the restroom. I did so, and then flushed the toilet. It sounded, as best as I can put it, like some combination of a jet taking off and a dying water buffalo.",
  "What I believe to be the peak of the experience occurred outside, lying on the ground. I looked up at a star and my vision extended like a tunnel towards it. The distance between me and it seemed to grow and shrink simultaneously, until I realized that distance had no meaning. Then the star transformed into a horse of burning white fire for just a moment, then everything jolted abruptly back to normal. Though they really cannot be conveyed, the emotions I was feeling were so pure and free",
  "We went on another walk, and this one was grand indeed. We passed a tree that seemed to me to be Telperion (sorry for all the Tolkien references) and lied down underneath it. Here I experience the first instance of what would be a persistent hallucination. The tree transformed into moving, flowing fractals that filled the entire field of my vision. As the walk progressed we encountered an alley that, at the time, seemed endless. We walked down it but at some point I had to turn back. There were things at the end I wasnt ready to see.",
  "Marijuana, I must say, never tasted so good. Though, embarrassingly enough, I was once overcome with the giggles and blew out the contents of a bowl mid inhale. I also discovered the joy of cigarettes, about the only negative thing I can attribute to LSD. Lets just say that smoke is quite fun to play with. Many more things happened of course, so many more. More than I remember and more than you have the inclination to read. But suffice to say, it all rocked. Pretty god damn hard. The morning after, I was still just a bit loopy, but I managed to help clean up the city of mess we had made. Afterwards, I made my way home and had the best sleep of my life."
 ],
 "erowid": {
  "id": "64991",
  "citation": " Archimedes. \"Wednesday: experience with LSD & Cannabis (ID 64991)\". Erowid.org. Jan 7, 2010. erowid.org/exp/64991",
  "substance": "LSD & Cannabis",
  "views": "2121"
 }
}
