{
 "title": "Keys To Awakening The Heart Chakra",
 "author": "light bringer",
 "citation": " light bringer. \"Keys To Awakening The Heart Chakra: experience with N2O (ID 17444)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17444",
 "substance": "N2O",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "100 lbs",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "report": "<p>My roommate and I were doing a tank of nitrous per 2 weeks for almost half a year.  Trips then were typical to what you read on this site.  During this time we were working on large doses and remaining self aware.  About a couple of months ago the trips just changed.  We were on a friends boat with a tank when all of a sudden I could see energy.  It took me time to figure out I was seeing people's emotional bodies.  The affect would last for about a day after the trips.  I also gained telepathic powers to some degree, but most often I read emotional states, and could see energy blocks in people's auras.  Needless to say this was one of the coolest thing that had ever happened to me.</p><p>Then my trips became tests, and I was constantly confronted with the nature of good vs. evil. I was convinced my roommate was an alien!, and I could see how he shot out energy blasts at people, trying to keep them in a state of fear.  It was like he fed off of the affect.  I was terrified for my life, that this is what is behind the reality game we play.  This is the deep dark secret and why we hide our true identity - we are slaves to an alien race of Demi-Gods.  Everyone I could see had been pretending in regular life and now everything made sense, and everyone seemed cruel.  I knew myself to be alone as someone standing for compassion and kindness.  And yet I was not going to give in - I had powers of my own and I sensed that there was fear that if I master myself I will be the dominant force.  I started to master my fears, and began to fight the dark forces.  But I hit a major dilemma - if I give into my anger and attack, then I am the new dark force.  If I let them overwhelm me then the dark wins. Shining love at the dark had no affect.  My faith was too little. I was stuck in a no win situation.  After the trips, everyone denied any such knowledge, but each was also having a new variety of trip where they were in fairy tales.  It was so bizarre we couldn't stop talking about it.  the next trips, and again my roommate is alien, again I am confronted. again I cannot win.  I am so intent on being a bringer of light that I will not accept middle ground.  I am then guided in my head by some 'force' that appears as a man, who just says he is a guide.  He instructs me that sometimes Light must fight dark, but only if dark will not accept balance.  I now understand.</p><p>BTW, my roommate who I see as evil has awakened himself permanently by now with his tripping.  He is an embodiment of unconditional Love and compassion, and turned into a wise teacher for me.  And yet I cannot get past that he is not to be trusted on a level.</p><p>The next trip is just the two of us and it turns into an initiation of sorts. I am tested immediately on forces, and I realize now that the Creator loves all sides of itself without conditions - the light and the dark.  The dark is necessary so that the light may experience and know itself as light.  It is the nature of duality.  Both exist (on a level), just accept the all of creation as an expression of Love in a free will universe.</p><p>After bringing the forces into balance, I must chose who I want to be in my experiences.  And with all my heart I choose service to God, and a bringer of light.  With all my heart I am swearing my service, feeling the love, and then my heart Chakra blew open.  I had a vision of a green lotus opening, the casts of heaven were there, trumpets played.  I stand before a Great being of Light and to his right is a beautiful Goddess - of Good Luck and she bends down and kisses my forehead and blesses me by giving me a cross.  I am then shown the road to my wake-up, the significance of 'co-incidences', people playing major roles in helping me to realize Love is the only Force. I am shown my future job, my soul mate, and anything else I want to see. I am shown creation power.</p><p>We create our own subjective experiences by thought.  Thought is creative energy and we have all created our own realities and can change them at any time. Most people create subconsciously or let the group consciousness create. Just change the sponsoring thought to Love (most of us have fear as our sponsoring thought.  Fear is the opposite of love and not real in and of itself, it is simply produced by forgetting/doubting who you really are) and then envision whatever you want.  In higher realms things materialize instantly. In the physical there is a time delay, but it is how it works. You are what you think indeed.  I remained in a heavenly realm until I had asked all my questions, and then I was back. I never passed out;  the vision simply pulled on my brain and dragged it into the show.  Needless to say I was in bliss, and my whole life has changed.  I am living my dreams now, still trying to master the creative process, but now I am finding hundreds of articles about this on the net, especially by the New Agers.</p><p>What more can I say?  Pot over the years has been very useful to me to overcome deep rooted fears, and I have been searching desperately for God for 2 years since entering the Light during an E and pot trip. Keys to awakening the heart chakra for me were - forgiveness, unconditional love, selflessness in service, overcoming fear at its highest level, and accepting that you must accept and love yourself as you are before you can offer yourself to the world.</p><p>When you focus your awareness between the eyebrows on nitrous and hold no thoughts is an easy way to attain meditation, which would take you years if not decades to accomplish without.</p><p>All this from two elements of nitrogen and one element of oxygen.  Sweet.</p>",
 "year": "2002",
 "id": "17444",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-14T07:00:00.000Z",
 "views": "6609",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "100 lbs",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ]
}
