{
 "id": 17441,
 "title": "Should Never Be A First Resort",
 "date": {
  "submission": "2010-07-12T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Swingsurfer",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "36 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 ],
 "report": [
  "My psychiatrist first diagnosed me with depression at the age of 15.  I am now 20.  Around that same time, I was also diagnosed with ADD.  They started me out first with only Concerta to see if my depression was simply a result of the ADD.  Unfortunately, this was not the case, and I soon wound up back in the doctors office.  After an unsuccessful trial with Zoloft, I was prescribed to Effexor.  My dose was started at 37.5mg in the morning and then increased, after two weeks, to 75mg per day.  Under the advice of my primary physician, I remained in talk therapy for the entire duration of my antidepressant use.",
  "The first effects of the Effexor began the first day I took it.  Almost immediately, I felt somewhat sedated.  Initially, this came as a relief compared to the exasperated state I had been in.  As I continued using the medication, I began to feel as though everything I felt, including the good moments, had become flattened by the drug.  I can remember walking through the hallway at school thinking Well, I guess if I dont feel anything, its better than feeling bad.  My need for sleep increased dramatically, to the point that I literally could not make it through the day without taking a nap in the afternoon, despite having slept plenty for nights on end, and it became increasingly hard to stay alert during class.  I also developed a tendency to yawn.  A lot.  Even when I wasnt tired.  I experienced some nausea and clammy hands initially, and as my dose was increased, which subsided as I adjusted to the medication. ",
  "I took Effexor all together for about 3 months.  The drowsiness problem never went away and I became increasingly emotionally flat.  I had no desire to do much of anything.  I also became aware that my libido was greatly inhibited and it was almost impossible to achieve an orgasm.  While irritability has always been a major problem for me, after a period on this medication, the only emotions that did seem to escape through the curtain were angry ones.  While in this agitated state, I also developed strange, sudden attacks of dizziness at random that were so strong that when sitting down (or standing) I would literally lean to the side in an attempt to compensate for the spinning room.  Thankfully, these attacks only lasted for a few seconds, but I was scared that I might wreck if I had one while driving.",
  "On top of all this uncomfortable-ness, I found that if I missed one dose in the morning, or was even a couple of hours off on the time I took it normally that withdrawal symptoms would start to show up.  I could not make it through the school day without it unless I was forced to.  On those days that I couldnt convince someone to bring my meds to me, I experienced electric shock-like sensations in my brain, irritability, and anxiousness.",
  "Suddenly, the idea that I had to get off this horrible drug obsessed me.  I could take it no longer and I had to prove that I didnt need it.  My first attempt to get off was to try cold turkey.  I made it three days before the zaps in my head were happening just minutes apart from dusk to dawn.  I was a mess.  I gave in and took that little pink pill and they went away immediately.  I let myself take the regular dose for a few days and then decided that I would taper myself off in quarter doses.  The caps are filled with beads, which made this fairly easy.  Doing so allowed me to taper in smaller doses than are available at the pharmacy.  I used  (approximately 56.1mg) for a week, and then  (approximately 37.5mg) for a week, and then  (approximately 18.7mg) for a week.  Despite doing this, I still experienced brain zaps the entire time, multiple times a day, and even for a few weeks after stopping.  It was the worst withdrawal I have ever gone through.",
  "If you are considering giving this drug a try for depression or anxiety or any other reason, please consider asking your psychiatrist or doctor if there are any alternatives that he/she might offer.  Even if this drug does help you, getting off of it is hell, and I would never recommend it to anyone unless they have tried other options first."
 ],
 "erowid": {
  "id": "64971",
  "citation": " Swingsurfer. \"Should Never Be A First Resort: experience with Venlafaxine (Effexor) & Methylphenidate (Concerta) (ID 64971)\". Erowid.org. Jul 12, 2010. erowid.org/exp/64971",
  "substance": "Venlafaxine (Effexor) & Methylphenidate (Concerta)",
  "views": "4825"
 }
}
