{
 "title": "Planting the Seeds in your Head",
 "author": "TKL",
 "citation": " TKL. \"Planting the Seeds in your Head: experience with Anadenathera colubrina (ID 17463)\". Erowid.org. Sep 15, 2002. erowid.org/exp/17463",
 "substance": "Anadenathera colubrina",
 "bodyweight": "190 lb",
 "report": "<p>SOURCE: seeds were sold by a friend in Argentina</p><p>Prep: 50 seeds were roasted until popping, left to cool then ground in an espresso grinder until they were a fine dust.  Seeds were then placed in a mortar and ground even finer while mixing in limestone paste bought from an Asian market.  This limestone paste is sold and used for betel nut chew preparation, it comes in two flavors white and red :) approximately 1/4 of the snuff is lime, this is done by eye balling, I use the red lime so that I can tell when the snuff has turned pink thats when I know the snuff is mixed well.  The lime is the most important ingredient.  Without the right amount of lime the yopo experience is a pale shadow and somewhat useless.  My bioassays have proven time and time again that with out the right amount of lime the experience is useless and is lacking in visual phenomena.</p><p>When I spoke with Jonathan Ott about his experiences he said he didnt really get visuals from it just shamanic ecstasy, and I think this is because he like every one else isnt adding enough base.  The limestone extracts the alkaloids from the plant while at the same time allows maximum absorption into the mucous membranes, not enough lime means not enough of the alkaloids are being absorbed into the sinuses, and at the most one will get a slight 5-meo-dmt rush.  However if the right amount of lime is added the effects are much like freebaseing N,N-DMT mixed with 5-meo-DMT, and its over all effects are much like a short lived ayahuasca session.  Filled with amazing visits with spirits and purging/healing.</p><p>The come on is fast and furious starting with the heaviness of a 5-meo-dmt insulflation and peaking with an amazing entrance into hyperspace, swirling vortexes of crystalline energies with the colors of dmt illumination, the entire trip lasting only 2 hours including pleasant after glow.  Open eye visuals and closed eye visuals being totally the same.  The color patterns eventually turn towards full on visions, so far I've hung out with mermaids, eagle, swan, raven, and my twin self-running around my teepee!  Many people I have introduced it to have full on visions regarding their paths in life and where they are going, very powerful life affirming visions.  After 30 min. the visual aspect dies down and one is left with a powerful psychic opening filled with insight and energy.</p><p>So far from all my reading and research not many people are getting this right.  The way I have prepared it has given steady dependable results in 20 sessions with over 12 people.  It has proven to be a great shamanic ally for healing and divination and due to its painful and unpleasant route of administration (snuffing) Im pretty damn sure all that will attempt to befriend it will do so with the utmost respect it deserves.  Yopo and the jaguar are one and it has a nasty bite, but it is a great teacher and healer and guide.</p><p>I would like to add that starting in low doses of four seeds and working one's way up is recommended.  Too large a dose can result in strong purging and in some cases memory loss of the entire experience, this has only happened in one person I've done it with, but it was nothing I havent seen from mushrooms or ayahuasca, so if you do find your self in such a dysphoric yopo experience don't get too upset.</p>",
 "year": "2002",
 "id": "17463",
 "gender": "Male",
 "timestamp": "2002-09-15T07:00:00.000Z",
 "views": "30702",
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina",
   "form": "(ground / crushed)"
  }
 ]
}
