{
 "id": 17474,
 "title": "A Look for the Opiate User",
 "date": {
  "submission": "2007-11-16T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FamousRoger",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Buprenorphine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Pharms - Buprenorphine",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "My name is Roger and I am an addict.  This is something that I had said more than a hundred times before ever trying suboxone. I said it, but I honestly didn't believe it.  First off, because I have had numerous drug tests for work and a short probation stint (6 months), and never found it hard to abstain from any substance when a test was likely.  Also, I had repeatedly quit using drugs under my own accord, just getting bored and sick of paying the money.",
  "Having said that, I must admit, I certainly am physically addicted to opiates, and this past week, when confronted with another drug test around the corner, I realized I was looking at another miserable three days of withdrawal.  Now I've been through withdrawal about 12 or more times in the year or so I have been using heroin, dilaudid (hydromorphone), morphine, etc., so I am pretty used to the misery, and even have found myself relatively capable in the midst of my despair, but this past week I really didn't want to deal with it, so I went to a suboxone doctor.  It cost a lot of money, and I had to make sure that I looked sick or she was threatening to make me wait until my withdrawal was 'severe enough that buprenorphine will be beneficial'.",
  "Well, I put on the show, made sure to yawn a lot, which made my eyes water, and my nose run.  I mean, I felt like shit, that was for sure, but I had gotten good at hiding it.  So, anyway, she finally gives me the buprenorphine after much deliberation, and decided to start me off at 2mg for 'induction'.  I have friends on this stuff, and I knew that 2mg was bullshit, but I took the dose with optimism, at least some of the symptoms will disappear.  And they did.",
  "Honestly, most of withdrawal was gone after an hour with the 2mg, but I still was acting sick.  In fact, I was able to keep up the show well enough to get prescribed 24mg a day, or three 8mg tablets.  This is a blessing, because, after I had taken about 12mg, I realized that it feels good.  In fact, it feels great.  I realized that suboxone gives me an opiate high that is mild but enjoyable, but it also gives me energy, and an almost laughing passion for life.  Honestly, suboxone has made me optimistic as hell.  I take, generally, 4-8mg every morning, and find myself very energized, buzzed, and content.  That amount easily lasts until night, when I usually take another 8mg to help sleep.  I feel peaceful and content the entire day.  I sleep less than I would normally sleep when on it though, but I still feel fine during the day.  Also, I am able to stash 8mg/day pretty easily, which I save for binging on the weekends.",
  "Turns out the naloxone in the tablets is not effective when you snort it.  In fact, when I snort a whole 8mg pill instead of dissolve it under my tongue, I get a very strong opiate buzz, often putting me 'on the nod'.  But, with buprenorphine 'the nod' isn't the vivid dreamy-waking iMax hi-fi special effects adventure, it's more peaceful and restful, and toned down.  It's not as eventful, but I enjoy it.  Really, the lack-luster nod is the only downside of Bup.  I love everything else about it.  I like mixing it with benzos for a nice body buzz.  I like drinking with it.  I like just taking it by itself, I get really productive.  Also, if I ever want to fuck with dope again, I don't have to worry about withdrawals...EVER!  Honestly, this is the best thing that has happened to me in a long time, it's like state-sponsored inebriation.  It's my safety blanket.  I also realized it helps a lot when coming off ecstasy, because it lasts for a very long period of time, generally as the effects dwindle, so does the blues from the pill. ",
  "This is how it feels as compared with heroin:",
  "It gives me the warm, butterflies in my chest like heroin, it certainly feels like an opiate.  Some sensations can be as strong as it is with heroin if I use enough.  My body seems to glow and float in the air with higher doses (18-24mg for me) and I smile a lot.  It's not quite as good as it is with heroin, and it certainly takes a lot longer to feel (about an hour, two hours to peak).  My head doesn't feel as good as dope makes me feel, that is for sure.  For example, I don't get the absolute melting of my troubles, and the dreamlike perceptions.  I don't get completely transformed into the music I am listening to like I do with heroin.  Also, the world isn't as soft as it looks, sounds, feels, etc. with heroin.  With heroin, everything is delicate.  With buprenorphine, the world can still hurt me, but I have knee-pads."
 ],
 "erowid": {
  "id": "65111",
  "citation": " FamousRoger. \"A Look for the Opiate User: experience with Buprenorphine with Naloxone (Suboxone) (ID 65111)\". Erowid.org. Nov 16, 2007. erowid.org/exp/65111",
  "substance": "Buprenorphine with Naloxone (Suboxone)",
  "views": "40605"
 }
}
