{
 "id": 17480,
 "title": "All Hail Lord Soma",
 "date": {
  "submission": "2002-02-28T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Dharma Bum",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(tea)"
  },
  {
   "time": "1:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "A friend and I decided to try the magnificant Amanita Muscaria mushrooms, ordered from a company in Wisconsin, and our experience was worth repeating.  We followed the recipe found online for fly Agaric tea, boiling the seven grams of dried mushroom caps for 15 min and adding tea and sugar to cover the taste.  We followed the recipe and added some chamamile tea, and it actually didn't taste too bad!  We dosed at about 5:30pm. ",
  "About an hour after ingesting, we both started to feel real relaxed and sedated.  another 30 min. went by, and we both felt a little uncomfortable in the stomach, so we agreed to take some bong hits of some high grade cannabis.  This was a great idea!  Not only did the nausea go away, but the experience became more intense and enjoyable.  We both agreed we felt a lot of energy, and happier then we had ever been before in our lives (and were happy people), and our stomachs felt fine, we even ate something.  so we took a walk around the city.  this was fantastic.  All the people looked so interesting, and we had this social energy streaming through our viens, something WAY more then a little cannibis would create. ",
  "We then returned home and wrote some music, which turned out quite wierd, but sounded amazing while we were delirious.  At around 9:00pm, the trip changed into something a little more 'trip-like'.  I would describe the earlier feeling like opium with the LSD mind, no real halucinations, more of a in-the-head feeling, but no scatter brain or inability to function whatsoever.  The new feeling was more psychedelic and less energetic, but this may have been because the cannibis effect had passed.  We sat down and smoked my hookha, (shisha tobacco) which felt wonderful, and I went home, feeling relaxed and happy.  I fell asleep easily and had some intense lucid dreaming!   ",
  "I would classify this experience as happy and easy going.  We both had a low dose (about 3.5g) which was great for a first time experience.  I think the tea brewing idea really helped, cause they have been known to taste nasty, and we never felt real strong nausea (of course, the cannibis helped).  I plan on doing this again, especially since we ordered 25 grams!  maybe a tad more next time, just for kicks."
 ],
 "erowid": {
  "id": "6514",
  "citation": " Dharma Bum. \"All Hail Lord Soma: experience with Amanita muscaria (ID 6514)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6514",
  "substance": "Amanita muscaria",
  "views": "18200"
 }
}
