{
 "id": 17488,
 "title": "Overall, Disappointed",
 "date": {
  "submission": "2002-02-28T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Geoff",
  "gender": "Male",
  "weight": "141 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Dimenhydrinate"
  },
  {
   "time": "0",
   "amount": " T+ 0:20",
   "administration": "6 seeds",
   "substance": "oral"
  },
  {
   "time": "H.B. Woodrose",
   "amount": "(tea)",
   "administration": " T+ 2:30",
   "substance": " "
  }
 ],
 "report": [
  "Two of my friends and I received 13 seeds each off of an internet site, in a package that promised an interesting, dreamy trip.  I hadn't had much experience with other hallucenogens (though I had taken mushrooms for my fourth time two days prior), so I had no idea what to expect.",
  "We each ground 6 seeds up, then put them in our respective cups, spitting on them to pull the LSA from them (we'd read saliva will remove it from the seed particles).  Then we poured a small amount of boiling water into each cup and allowed it to sit for approximately 10 minutes.  At this time, the water immediately took on a yellow color, and smelled like an herbal tea.",
  "T-20min - We each took 2 Dramamine pills in order to combat the sickness so many people describe in taking Hawaiian Baby Woodrose.",
  "T+0 - We began drinking the mixture.  It had a pleasant taste to it, except for the seed particles themselves, which were bitter and gummy.  By this time, I was feeling the dramamine pretty well.  I felt as though I had smoked marijuana, but was still able to think somewhat clearly.",
  "T+20min - I finished the mixture, and took another Dramamine, because I wasn't interested in puking (I had puked only twice in my life that I can remember and wasn't going for a third).",
  "T+45min - We all were starting to feel drowsy and incapable of moving without difficulty.  One of my friends, C., hadn't taken an extra dramamine, and the other, B., had.  C. said that he didn't feel sleepy, but both B. and myself seemed to.  Leaning against walls and lying on the floor sound good to everyone, and we all end up sitting in the hallway.",
  "T+55min - C. vomits once.  He says it helped him feel better and gave him more energy afterward.",
  "T+1:20 - B. is sitting in front of the toilet in the bathroom.  We decide to go for a walk and he comes with us.  Immediately as he goes outside he pukes up everything he has in him.  Meanwhile, I'm feeling more drowsy and finding it difficult to think, though I don't feel at all nauseous.",
  "T+2hrs - We return from the walk.  I'm still not feeling any noticeable effects except for the extreme lethargy that supposedly accompanies HBW.  Both C. and I take Vitamin C in hopes of increasing the chance of seeing visuals (even though it may be too late).  By this time, we were thinking we may not end up tripping.  My pupils are still massively dialated, however, with almost no color left in them.  My pupils are large to begin with, so this is how they usually look when I trip.",
  "T+2:10 - I decide to smoke some marijuana with a roommate in hopes of making the trip kick in.  It doesn't seem to have an effect, but I feel somewhat comfortable with my state afterwards, as being stoned is much more familiar.  Both B. and C. abstain from smoking with us.",
  "T+3hrs - B. reports that he is able to see in double and occasionally move the location of objects by will.  After a suggestion from C., I look in the mirror while in near darkness, and notice that the light seems to brighten and darken randomly, while my face distorts itself somewhat and I see for passing moments it might become that of a beast.  Nothing extraordinary happens, however.",
  "T+3:20 - My arms and legs start to feel cold and somewhat numb.  By this time, B. is passed out on the couch.  C. decides that he will return home, perhaps returning later if he feels any effects.  After reading more literature on HBW, I decide to take a short nap to see if I awaken to intense visuals.",
  "T+4 - I wake up and see a few brief patterns under the covers.  Other than that, I can only feel the intense lassitude and drowsiness as I step out of bed.  I go to the bathroom for what seems like the tenth time that night, and return to bed, this time for good.",
  "T+7 - I break from my sleep, but still feel nothing.  I return to bed.",
  "In the morning, after sleeping 13 hours, I was still tired.  Overall I was disappointed by the experience, and after talking with B. and C. in the morning, got the impression that they were, too, as they hadn't experienced anything after going to sleep.  We may take them again in a few weeks, with the following modifications:",
  "1. Splitting up one person's dosage and having two people take 10 or 11 seeds each.",
  "2. Soaking the seeds for 2-3 hours instead of making a tea.",
  "3. Taking only one or two dramamine instead of 3 to reduce the tired feeling.",
  "4. Taking vitamin C immediately after we're done ingesting the seeds.",
  "I think our biggest problem was too small a dosage and too little time allowed to extract the LSA from the seeds.  We didn't hold the drink in our mouths too long, either.  Most likely what happened is we took all of the poison in our bodies, and very little of the LSA.  For those who are thinking of taking HBW for the first time, I would suggest reading up on preparation methods extensively, as they can really make a difference."
 ],
 "erowid": {
  "id": "6517",
  "citation": " Geoff. \"Overall, Disappointed: experience with H.B. Woodrose Seeds (ID 6517)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6517",
  "substance": "H.B. Woodrose Seeds",
  "views": "18694"
 }
}
