{
 "id": 17494,
 "title": "Near Death Experience",
 "date": {
  "submission": "2007-09-04T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Ryan420",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "52.5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "administration": "insufflated",
   "substance": "Hydrocodone",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 1:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "[Erowid Note: this person took over 4 grams of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]",
  "It all started when I was going through my moms bathroom and found a bottle or lortabs 7.5 mgs and there was about 13-14 pills in the bottle, so I took them all and replaced them with generic cough medicine. I had done lortabs twice before and had taken 6 but had never mixed them with any other drugs. So at around 10 am I decided I would take 7 lortabs hoping it would be a little bit better. I took them and I felt good for about 30 minutes and then I didn't feel anything anymore except for a little stomach ache.",
  "So then I decided to call my neighbor 'H' and see if he would take the rest with me. He decided to crush the rest of the pills up and snort them so I took a couple of pretty big lines with him and he decided that was just too much too snort so he parachuted the rest. My stomach ache got a little bit worse after that and I felt like I was going to throw up, but after leaning over the toilet for about 5 minutes I felt better. That is when we decided to try and get some weed. So in about 30 minutes we had been able to score arond 4 grams of weed and we weren't feeling anything from before. So this was about an hour and 30 minutes after taking the first dosage. We then proceeded outside to smoke the weed we smoked about 2 grams out of my waterbong and where feeling pretty high.",
  "It was now around 2pm 4 hours after I took the initial dosage of Lortabs and all of the sudden my vision began to get blurry and I felt as if everything was spinning. Then I started sweating violently and became very hot. My stomach ache became even worse and I started throwing up non stop and all I was throwing up was water I had drank earlier. My friend H kept telling me no matter what I do I don't go to sleep he kept telling me don't go to sleep and then all of the sudden he tells me he doesn't feel good either and he is going to go home to take a nap and I should do the same.",
  "I was so close to calling 911 because I kept vomiting and my vision had became worse I could barely see and at that moment I faced the fact that I was going to die and it didnt seem to really bother me so I called my best friend and told him this is going to be the last time he would ever talk to me and what was going on. I then went to sleep and my friend called me every 30 minutes to wake me up to make sure I was doing ok. Then I woke up the next morning and I felt extremely hung over. This was for sure the worse experience I have ever had in my life and I would never take lortabs again. However I still continue to smoke marijuanna on a daily basis."
 ],
 "erowid": {
  "id": "65198",
  "citation": " Ryan420. \"Near Death Experience: experience with Hydrocodone w/Acetaminophen & Cannabis (ID 65198)\". Erowid.org. Sep 4, 2007. erowid.org/exp/65198",
  "substance": "Hydrocodone w/Acetaminophen & Cannabis",
  "views": "35556"
 }
}
