{
 "title": "Surrounded by Vines and Leaves",
 "author": "Jumanji",
 "citation": " Jumanji. \"Surrounded by Vines and Leaves: experience with Salvia divinorum (ID 175)\". Erowid.org. Aug 15, 2001. erowid.org/exp/175",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "0.25 oz",
  "smoked",
  "Salvia divinorum",
  "(extract - 5x)"
 ],
 "report": "<p>I decided to try Salvia divinorum after finding it on the web while researching herbal ecstacy and psychoactive herbs.  I looked at the various information sources on the web and decided this would be a good experiment.</p><p>My gram of 5x extract arrived by express mail (on a Sunday, no less) and I was immediately excited to try it.  The vial of herb felt warm in my hand after I removed it from the package, and I had a sense of urgency, but I'm not sure if it was from me or the Salvia.  The extract was too minced to make a quid, and I didn't have a bowl, so I rolled a joint out of about 1/4 gram of the extract, put on some melodic trance music, and smoked it as well as I could.  The smoke was surprisingly smooth and easy to hold in; I could hold a lungful until I needed more air.  Immediately I felt a difference, kind of like a shifting to a different world of some kind.  There was a tingling senstation running through the skin of my arms.  At this point there were also some faint visuals.  It was a very subtle change, like my senses were waking up to something new.</p><p>I laid back on my bed, listened to the music and relaxed in the shaded light of my room.  Slowly, I began to notice more sensations, like the faint trails my hand left as I waved it in front of my face, little patterns rippling through the ceiling, the music becoming fuller and more resonant within me.</p><p>Eventually, I felt warm, like I was being held tenderly.  A spark of electricity rode up my spine at this point.  My hair felt like someone was running her fingers through it.  By now my eyes were closed and I was just enjoying the sensation of being cuddled.  It was as if Maria (the Salvia) was giving me the tenderness and love I needed at that point.  I was very touched.  Throughout this, I had the sensation of being surrounded by vines and leaves, and there was a very 'green' feel to the experience.  She didn't want to talk much, just relax on a Sunday afternoon.  It was somewhere between being held by a lover and being a cat held on someone's lap.</p><p>After about an hour, the effects wore off substantially, and the presence was almost gone.  I stretched, rolled around in my bed, got up, thanked Maria again, and buried the ashes in the back yard, as an impulse that may have been her request (it felt like it was).  I felt quite mellow and rather pleasant.</p><p>It's about two hours later, and there are still some lingering effects as I'm typing.  I feel much less disconnected than I felt earlier, and much more balanced.  This was definitely a good experience, and I'm looking forward to experiencing it again, with perhaps a larger dose.  There may be more to this experience than meets the 'eye'.</p>",
 "year": "2000",
 "id": "175",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-08-15T07:00:00.000Z",
 "views": "6315",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.25 oz",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
