{
 "id": 1750,
 "title": "Being Sucked Into Another World",
 "date": {
  "submission": "2005-07-21T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nora",
  "gender": "Female",
  "weight": 51
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "OkayI have tried salvia 2 or 3 times before with what I was told was 1x extract. Each of those times I had minimal effects and was smoking marijuana also. I don't think that I held the salvia smoke in my lungs long enough to receive full effects. However, on one occasion I did experience time distortionwaking up and being told 10 minutes had passedbut I have no recollection of what happened during that time. I guessed it worked that time but I was very stoned.",
  "Yesterday my friend and I were sitting around smoking and he mentioned that he had some salvia 10x extract that had been sitting around for months because he was wary of how strong it would be. Being the eager-beaver that I amI volunteered immediately with the assurance that he would try it if I enjoyed the experience. I had no idea what this experience would be like. Based on my previous experience with the 1x and that of my friends, I thought it would be like tripping. I was not the least bit prepared for what would happen or what I was supposed to do.",
  "We lowered the lights and turned the television off (always turn the TV off!) and put on some music (Widespread?) He loaded the bowl half way for mewe argued about dosage and settled on one hit to see what happensthe wisest choice.",
  "I lit up, the smoke went down easy and I held it inI don't even remember exhaling. My friend took the bong from mefrom his account I said 'I'm tripping' and leaned back on the couch.",
  "What seemed instantaneously 'I' was somewhere very unfamiliar. Other beings were there and there was conversation among us. I don't remember any of the conversationthis lasted for approximately 90 seconds. I started looking aroundI had no concept of self and could not qualify any visual input as recognizable. I now realize that I was looking around the room seeing the colors and textures of objects but not realizing what they were. Upon reflection, I wonder if this is what it is like to be a new-born baby. I was outside of myself. I could not determine where my body was, after I realized that this was not normal. I was very confused and could not recall reality, where I was or why I was having such a weird experience or even how it differed from reality.",
  "My friend said that I was moving my arms around and trying to move and he had to keep leaning me back on the couch. I don't remember any of that. I do remember an unexplainable urge to get up and go outside, for surely outside would be normal. I stood up and my friend set me down again. In all, I spent 2 1/2 to 3 minutes not knowing that I was on a drug. Upon realizing that someone whom I knew was in the room I called to him and told him that I was VERY confused. He said, 'Oh, you smoked salvia. You can forget. You're supposed to tell people that they've smoked it or they won't remember.' Then everything made much more sense and I began to struggle to regain a grasp on reality. Looking back, I wish that I had just closed my eyes and lost myself in the experience (what I was supposed to do).",
  "But I kept looking around and tried to put together my surroundingsI would get a small grasp and then be sucked back into the non-physical world. I told my friend that I was being sucked into another world. My speech was very slurred and slow. Apparently I told him that he should not do this and that no one should do thisso he immediately got up and I remember him flushing the toilethe got rid of all of it and brought a glass of water telling me it would help. I messily slurped it down and he had to take it from me I was drinking so fast. During this entire time I was so disoriented that I could not see with normal visionI still could only interpret small parts of visual inputit was kind of like being blind. For the rest of the time I laid on the couch sweating and the effects slowly faded and returned to normal. The entire experience lasted about 10 minutes followed by a 20 minute return to baseline. After the retrieval of reality I was relieved and in quite a good mood. I had a mild headache for the rest of the day.",
  "I was later told that during the 'trance-part' of the trip I looked very frightened and confused and was distressed and nervous. I don't think the experience was particularly frightening, more disorienting and confusingespecially since I didn't know what was happening to me. It was stressful though.",
  "I had the feeling of being torn between two worlds and wanting to return to reality.",
  "TodayI feel as if I was on the brink of something amazing and wonderful and keep thinking about what myself and the 'others' were talking about. I feel as if I was on the path to enlightenment or to another dimensionbut instead I turned back. We are naturally afraid of the unknown. I am intrigued. This is the most interesting experience I have ever had.",
  "Under a better prepared situation, no lights or musicand someone to tell me what I had done and how I should react to the situationI think I would do this againthough I would work up from a smaller dose. The 10x extract should probably not have been my first experience with salvia.",
  "Do I regret it? Not for a second."
 ],
 "erowid": {
  "id": "15600",
  "citation": " Nora. \"Being Sucked Into Another World: experience with Salvia divinorum (extract - 10x) (ID 15600)\". Erowid.org. Jul 21, 2005. erowid.org/exp/15600",
  "substance": "Salvia divinorum (extract - 10x)",
  "views": "4451"
 }
}
