{
 "id": 17504,
 "title": "My Short But Beautiful Trip",
 "date": {
  "submission": "2010-07-18T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Jason",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "So here's how it went down. My girlfriend, Casey, had just called my cell to say good night and such as she headed to bed, but I had her stay on the phone for a moment as my friend Jeff, who bought the salvia for us, and I took our first hits.",
  "After Jeff took his first hit, he tried to tell me that he couldn't stand, but he explained afterwards that he was simply unable to. He kept saying 'Jason, I can't--' then something stopped him from telling me. He asked to talk to Casey on my cell, but he kept feeling like she was mad at him. He was totally paranoid. I explained to him that she wasn't mad at all, and was just laughing, but Jeff told me before that salvia makes him think people are mad at him.",
  "I take the phone back and take my hit. It was like, every time I moved my eyes, my vision kept moving even after my eyes stopped. I found it difficult to talk, and I kept laughing. I came out of that pretty fast, and told Casey that every thing's gonna be fine, yadda yadda good night, I love you. I was disappointed. I expected so much more, but still... I wasn't too bummed, after all, I had salvia in my system.",
  "Jeff takes his second hit, and while I'm preparing mine, he tries to tell me that in his hand he can see and feel the bow from the Zelda game he's been playing lately. He wasn't able to tell me what he'd been trying to explain until after his trip was nearly over.  All that came out was 'Line!.. LIIINNNE!'",
  "I take another hit. I'm holding it in my lungs, thinking that nothing's going to happen. Maybe I'm immune. Maybe this batch is bad. Then I glance at the computer screen with Guild Wars on, Jeff had been playing. Suddenly there was a ripple on the screen, and everything behind the monitor started to sort of.. shift... closer and farther from me. At this point I still have it in my lungs and I was bummed again because I thought that was all I'd feel. Just when I was about to completely give up hope I imagined the octopus from the Little Mermaid, and suddenly the computer monitor and speakers gave me the distinct impression of some sort of crustacean. My thoughts went like this: 'Nothing's going to happen... wait... a crab? Ohhh this is the salvia...' And I let my breath out.",
  "Everything changed.",
  "I had a narrow field of vision. Everything took on cartoonish colors, and nothing beyond that field of vision existed or mattered. Every object there became a block of color, and stretched away from me, and sort of turned sideways. There was a woman there, across the room from me. I couldn't see her, but I knew she was there somehow. I didn't hear her talk, but I knew she was calling me to her, to go with the waves of color that were moving away from me across the room. I needed to go. But part of me knew that if I did, I would knock stuff over and make lots of noise or get hurt. I resisted following the colours by falling over sideways onto the couch I was on. Everything started returning to normal, I was aware of Jeff being there again (although he sort of looked like a cartoon character) and I was brought back, to realize I was sweating all over.",
  "When I got back, Jeff tossed me the little baggy with what remained of the salvia and told me 'Merry Christmas'.  He had been tripping too while I was, although I had no idea he was even in the room with me at the time. He told me I was laughing a whole lot and making him laugh his ass off. I had to get back on the trip and follow the colours this time. It felt so right.",
  "So I light up again. As I'm holding the salvia in my lungs everything is the same as last time. The ripples, the dizziness, all of it. But then it changed. Before I let out my breath, there was a man with me, behind the couch. Again I couldn't see him, but he was there. I FELT his personality. He was kind, and nurturing. He wanted only for me to be happy. I felt that he wanted me to empty my lungs, so I did.",
  "With the exhale, my world was sucked away in every direction. It was replaced with a new world. A cartoon world at first. The man was still there, watching over me, keeping me safe. He was even kind enough to give me a job in this new world. I was instantly put to work in a sort of assembly line, the various things in front of me were part of this strange machine. It was like I was part of a machine with a conveyor belt and stuff, in a factory. The room around me was completely pink, and I saw a lot of objects were dark dark blue. I had a coworker, a girl I couldn't see, but she was there, as another part of the machine.",
  "My job was to pass along an endless supply of red, rectangular blocks, to keep the assembly line moving, passing them forward so the rest of the machine (the girl included) could do who knows what with them. But suddenly I snapped out of it a bit and realized I wasn't passing along red blocks, I was just waving the Dr Pepper can we smoked with up and down. When I realized this I dropped the can, and I felt so guilty, so ashamed that I had failed at my job. But the man reassured me, and 'told' me (no words were spoken) that he wanted to take me somewhere.",
  "I stood up from the green couch and I was transported once again. No longer was I in a room. No, I was somewhere much more beautiful. I was standing on a green platform, high up in the sky, surrounded by blue sky and pearl white clouds. A few meters away was Jeff floating in the black chair he was sitting on, way up there in the sky with me. He was with a woman, and I needed to tell them both exactly how I was feeling and where I was, but I couldn't. No words would come out. I instantly realized that this must be because the man I was with did not want me to tell them, he just wanted me to go with him and enjoy the journey. Now I knew there was a girl present as well, with the man, and they wanted to take me with them, but as I turned from Jeff and the woman, I fell from the platform and the man and the girl slipped away from me.",
  "That was it, I was back in my basement. Closed in by walls once more. There was Jeff, but no woman. There was my couch, not a green platform. I was still very disoriented and unable to speak, and I was trying to cling to the presences of the man and the girl, but they were gone. When I was mostly recovered, I started to tell Jeff all about my journey, but now paranoia was hitting me, and I had the impression that Jeff was mad at me, and that I was just annoying him with my story, but he eventually reassured me that that wasn't the case.",
  "Well that's it. My first experience with salvia divinorum. I'd say it was quite a big success."
 ],
 "erowid": {
  "id": "65223",
  "citation": " Jason. \"My Short But Beautiful Trip: experience with Salvia divinorum (10x extract) (ID 65223)\". Erowid.org. Jul 18, 2010. erowid.org/exp/65223",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2425"
 }
}
