{
 "title": "No Dream Amplification",
 "author": "dmttrinitro",
 "citation": " dmttrinitro. \"No Dream Amplification: experience with Calea zacatechichi (extract) (ID 17508)\". Erowid.org. Nov 19, 2003. erowid.org/exp/17508",
 "substance": "Calea zacatechichi (extract)",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Calea zacatechichi",
  "(extract)"
 ],
 "report": "<p>I am getting right to the point. I used Calea Zacatchchichi extract with no effects. None, actually I believe it briefly took me off rhythm with my dreams.</p><p>I dream nightly, in multiples, and know my dream cycle well.</p><p>Maybe it was the extract? However, I did notice how the extract made me feel. Not high or drunk but somewhat herbal in the feeling, mostly in my head. Nothing worth elaborating on. Although the Calea did seem to give me lighter sleep than usual.</p><p>I recommend if you have Calea extract put one drop on your tongue. Watch out! The taste is not extremely pungent in the beginning but the bitter, nasty, taste amplifies the longer it sits on your tongue, and have a strong mint ready! I find mint to be the best flavor for neutralizing the effects of this troll feces. As a matter of fact 'Mentos' I now particularly enjoy. Do you remember the Mentos commercials 'The Fresh Maker' you couldn't stomach the commercials let alone the candy, well I have found a use for these nasty candy-isle protrusions.</p><p>1. Chew on a Mentos, half chewed</p><p>2. Down the Calea juice, one swift drink</p><p>3. Have 2-3 more Mentos ready to chew, TRUST ME have them ready, and don't say I didn't warn you!</p><p>4. Dont go without Mentos.</p><p>5. Don't worry the Mentos will neutralize the effects of the Calea.</p><p>6. If going to bed brush your teeth with some mint toothpaste.</p><p>Here is a nice anecdote that came with the extract:\r</p><p>Calea Zacatchchichi:</p><p>Bitter Herb, Sweeter Dreams</p><p>'The Chontal Indians of Oaxaca, Mexico traditionally prepare a hot water infusion or tea, made from a handful of dried leaves of Calea Zacatchchichi, the plant they call 'thle-Pelakano' or 'leaves of God.' The brew is said to help produce dreams and promote visions in the dreaming state.</p><p>Calea is a fantastically bitter herb. It's easily the most cloyingly bitter botanical we've encountered. Natives gulp their Calea tea with a strange grimace and smoke Calea 'cigarettes' afterward to help quell the bitterness. This extract not only concentrates the active principles, but also the bitterness. Try diluting the extract with only as much liquid as can be downed in a single swift swallow. You can follow up with a chase of water or juice. A piece of hard candy, a strong mint or slice of fresh ginger can help provide extra relief. Then, of course, you can do as the natives do and light up a Calea smoke. Happy Dreams!'</p><p></p><p>In conclusion, I will say that I may try brewing some Calea tea, or possibly smoking some of the herb. The extract did nothing for me and I varied the doses considerably too: less recommended doses to more-than-recommended. I didn't loose much as my dreams are vivid as usual. Recently I bought some Valerian Root extract and find it relaxing, I like it better than the Calea, however no dream amplification with either product. I don't recommend NOT trying Calea however I would recommend brewing some tea or try smoking to notice any effects.</p>",
 "year": "2002",
 "id": "17508",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-19T08:00:00.000Z",
 "views": "15376",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(extract)"
  }
 }
}
