{
 "id": 1751,
 "title": "My First Intimate Trip",
 "date": {
  "submission": "2002-06-25T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Melissa",
  "gender": "Female",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "0.5 capsls",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I recently found myself in a new relationship, and I wasn't sure if I was ready for it. We had been seeing each other for about a month, and in that time, had been together everyday. I thoroughly enjoyed everything about Ryan. I had very strong feelings for him, but I have a really hard time opening up to people, whether it be good or bad.",
  "Ryan has been in the rave scene for a couple of years. I never was, but have dropped about 4 times before. We decided that we would like to try it together. It took a lot of frenzied phone calls to secure three (large) gelcaps, containing light red/pink powder. We both swallowed one cap and sat on his bed watching a movie to wait for it to kick in.",
  "It didn't take very long, perhaps 15 minutes. When I started feeling the first waves, I turned around and we started cuddling. In about five minutes, we were pretty fucked, but Ryan wanted to go outside and smoke a bowl. While we were in the garage, he said to me: 'I may say a lot of things tonight, but I want you to know that it isn't because of the drugs.'",
  "I like how E lowers my inhibitions, but not to a stupidity level. We both stripped (and we're both self conscious about our bodies), and pretty soon we were just laying there, me on top of him, and we just both started rambling about how amazing the other was. I easily said everything that I had wanted to say to him, but couldn't because of my lack of self confidence and fear of rejection. Everything came out perfect and right and carried the weight of what I was really feeling. I was also open to what he was saying (I usually don't respond well to compliments and will try to argue them away). It was very intense. It was also the first time I told him I loved him and vice versa - something we had both been wanting to say. I remember Ryan saying, in awe, 'this is what E was meant for.'",
  "That was the most important part of the trip.",
  "About an hour in, we both railed 1/2 of the last cap, and I started hallucinating hard (I was wondering why he had put his shirt back on, when he hadn't). I saw a cat, a clown, a melting man, and a woman in a wheel chair. We both saw the spinning stars on his ceiling. I had never hallucinated while on E before, and I was just mostly amused at the fact that I was hallucinating.",
  "I remember looking in the mirror and realizing how beautiful I was. A lot of people have told me I was pretty, but I have always, always had a horrible self image. I think the E allowed me to stop focusing on my imperfections and allowed me to see myself as a whole person.",
  "The best part of this is that is stuck. It still seems almost too good to be true, but I had more self confidence, and I was more open with Ryan. I still do and still am. I'm not always happy and euphoric, but the ratio of good days vs. bad has shifted dramatically (not all can be attributed to E, as I am with a wonderful person, but I believe the openess I experienced that night helped quite a bit)."
 ],
 "erowid": {
  "id": "15607",
  "citation": " Melissa. \"My First Intimate Trip: experience with MDMA (Ecstasy) (ID 15607)\". Erowid.org. Jun 25, 2002. erowid.org/exp/15607",
  "substance": "MDMA (Ecstasy)",
  "views": "9320"
 }
}
