{
 "id": 17515,
 "title": "Returning to a Level of Balance",
 "date": {
  "submission": "2007-11-06T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shasta",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "pill / tablet"
  },
  {
   "time": "4:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "pill / tablet"
  },
  {
   "time": "8:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "After developing a pattern whereby I functioned with minimal rest working a 4 day 10-12 hr graveyard shift for 9 years I was unable to return to a normal existence when I desired to. I changed jobs and even selected vigorous physical work that would exhaust me enough to sleep through the night. I soon acclimated to the hard work and hours yet still could not sleep when I wanted and needed to.",
  "My mental acuity suffered as well as my outlook on life. I have read that the military refers to the prolonged sleepless mental state as 'the zone.' I was able to function well enough but life was gray, flat and losing more of the spark as time went on. I would have moments when I would feel positive and happy but they were rare and easily wiped away by daily events.",
  "A good metaphor for life is surfing. Waves of opportunity ebb and flow. My ability to catch them let alone appreciate or ride one for any duration diminished. Modafinil (200mg start, then 100mg every 4 hours) returns me to ground zero. I am on a level playing field with life. I am not so easily made aware of things that would otherwise make me feel sad, mad, depressed or pessimistic. I am able to appreciate things and enjoy the moment. Mental acuity is enhanced. My sinuses even open up. The world is lighter both in terms of illumination and weight.",
  "The effect is subtle yet profound. It is not a 'high' it is a 'level of balance.' I have not experienced any side effects and there is not an overhead. By overhead I mean there isn't a price to pay like sluggishness, hangover, slurred speech, dizziness, depression, dulling of any senses, distracting mental preoccupations like hallucinations, lust, 'stoned out' drones, etc. I don't have to be concerned about operating machinery or driving a motor vehicle. It is exclusively productive, life-enhancing and focused.",
  "I can still go to sleep having taken it 2 hours earlier. I can sleep if I desire or I can work with a clear and rested state of mind. It depends on what I want to do. I can direct my attention either way.",
  "I needed to go 48 hours without sleep. With the Modafinil, I was able to catch a wave and ride it out. The effect is definitely mental more than physical. My body was tired and vulnerable as time went on without rest. However I remained happy, inspired and optimistic. Typically, I would have been able to go 48 hours without the sleep but I would have been in a gray drone and felt the emotionally draining impact of life's responsibilities.",
  "Being able to tread water and appreciate the waves, experiencing the mental clarity, heightened thinking and optimism makes me happy about life and empowers me to invite good things into my life. It is a result-based happiness and not an effortless euphoria induced by a chemical."
 ],
 "erowid": {
  "id": "65269",
  "citation": " Shasta. \"Returning to a Level of Balance: experience with Modafinil (ID 65269)\". Erowid.org. Nov 6, 2007. erowid.org/exp/65269",
  "substance": "Modafinil",
  "views": "14806"
 }
}
