{
 "title": "No Title Can Describe This",
 "author": "GB",
 "citation": " GB. \"No Title Can Describe This: experience with Methamphetamine (ID 17519)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17519",
 "substance": "Methamphetamine",
 "bodyweight": "178 lb",
 "report": "<p>This might sound stupid. But for some reason I had always wanted to have that 'special' drug of choice. I had tried x, weed, coke, acid, mushrooms, and nothing ever really hit me as good as meth. I loved meth. I loved how it stung my nose when I snorted it, I loved the metally weird taste in my mouth it gave me when I smoked it.</p><p>Everything else I had ever done I didn't like. I didn't like the way I felt before, during or after the fact. Except for meth. I didn't have a long run in with it, because of my history with family drug abuse but here is my story I want to share with you.</p><p>I met this guy at my work. He was such a character, I loved being around him. Anything he said I just totally ate up. My co-worker was telling me about her frequent experiences with meth, and I was interested in trying it. The guy, well call him M for now, well he talked me into buying my own quarter of it, and he would buy his own. I dabbled a little in it, it wasn't a major deal to me at the time. The next time we bought some, I had most of the money, and M didn't have much, but he still bought it own baggy. I on the other hand got a deal. I bought a quarter but got almost a half.</p><p>I noticed that at first I was just doing it for a little more energy. Then after a couple weeks, I noticed I would start taking it to work with me, and while I was on my smoke break I would snort a little bump in the bathroom. I would stay up for days at a time, and I knew it was wrong, I felt like shit, but I didn't care. On my days off I would do lines and lines at a time with my co-worker, and we would go to the beach and just chill there all day long. We felt like we where on top of the world.</p><p>I was working a lot at the time, so I was able to spend a lot of cash on it. I would buy 2 or 3 quarter grams a week, thinking that if I only buy quarter grams, I wouldn't be such a crack head. I hadn't smoked it yet. For some reason I felt like if I did that that I would really be an addict.</p><p>Some time passed where I wouldn't do any for a while, and then I would, and wouldn't again. Then I had to go to my sisters in new jersey for 2 weeks to go visit her and her family. I felt fine, I didn't crave it. I just told my friends to have some ready for me for when I got back. And they did. This is where it got bad. I was staying at my friend D's house. He was really bad into meth. Spending almost every dime he always made at work. This was fine to me at the time. I was just staying there for a while because my mom still had company at her house. So while I was staying there I started to smoke it. I loved it. But I still loved snorting it more.</p><p>One night, my co-worker stopped by and she and I went to the bath room to do a couple lines. While she was cutting them up I looked at myself in the mirror. I am a pretty heavy girl, and for the first time I looked skinny, but it was ugly, I looked sick and nasty. I put on some makeup after we got done doing some lines, and went back out to party. The rest of the night I couldn't think of anything but what I looked like, and what I must look like to the people at work, to my mom, and to whoever else. It scared me. So I got myself out. I told myself no more. I can handle it. I told D about it, and about how I feel he should quit too. He was a lot worse off than I was.</p><p>Anyhow.. to make this long story short. I had to move to new jersey, because of my addiction. I couldn't even stay in my town anymore. I wanted it so much, but I knew I couldn't have it. At the same time I knew that if I stayed in that town I would eventually get back on it. I was clean for 2 months before I moved to new jersey.  I barely have any friends there anymore, the only person I have left is my best friend J and my boyfriend Dk.</p><p>Meth ruined my life. I had plans on going to college, moving in with D and Dk. But because of meth, I blew my college money, I didn't save anything. I lost a lot of good friends and I had to move away from the town I grew up in. It might be my own fault. But I feel that if anyone gets as bad into like I did, or even worse, that they have ruined their life.</p>",
 "year": "2002",
 "id": "17519",
 "gender": "Female",
 "timestamp": "2005-06-14T07:00:00.000Z",
 "views": "6509",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ]
}
