{
 "id": 1753,
 "title": "The Start of the End",
 "date": {
  "submission": "2002-06-25T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rush",
  "weight": 68
 },
 "dose": [],
 "report": [
  "It's 5:36 in the morning.",
  "I tried crack tonight.  Let me tell you, it was something different...",
  "The best feeling I've had swept over my entire body.  My fears were gone, my body numb, my thoughts clear...",
  "I could decide whatever I wanted, I could feel whatever I wanted to feel.  Therefor, I finally felt happy... finally.",
  "I'm very much on crack right now.  About 1 1/2 hours ago I smoked a gram of crack with my friend on top of some prime resin we scraped out of two different bongs, one double chamber plastic, one single chamber glass.  Both PRIME bongs.",
  "After the first hit, I immediatly felt slightly awakened.  I had drunk about 1/6 of a handle of some generic brand crap ass vodka tonight too (or this morning and tonight).  So I was shitty, plus I had been smoking some chronic dope occasionaly through the night.",
  "My friend jon and i smoked the whole gram on top of some large resin bowls.  We let our other friend have like 3 or 4 hits.  And, our other friend was passed out in the other room from so much drinking and smoking :) good times good times :)!",
  "After I thought the gram was done after about 10 hits, we each had about 20 hits each of just crack on top of ashed resin.  The crack was sticky so it stuck in the bowl well.  We just kept hitting it and kept hitting it.  In fact i could hit it now, but it's probably ash.",
  "Either way, I've never felt more incredible in my life.  I have no idea why I'm typing this because it's so early in the morning, and what the hell am I doing awake typing long paragraphs... Well, who knew?",
  "I've done DXM 5 times, one time driking two bottles of the ROBO shiz...  I've smoked pot about 3-4 times a day for at least 7 months, before that it was weekly for like 5 months.  I've been addicted to ciggarettes for about 5 months, and I've been very very addicted to alcohol for about 3 months.  I'm 17. ",
  "A short phrase to describe the feeling...",
  "I can not believe it...",
  "I...",
  "I...",
  "Please I want to do it again."
 ],
 "erowid": {
  "id": "15618",
  "citation": " Rush. \"The Start of the End: experience with Crack (ID 15618)\". Erowid.org. Jun 25, 2002. erowid.org/exp/15618",
  "substance": "Crack",
  "views": "73438"
 }
}
