{
 "title": "Euphoric State of Consciousness",
 "author": "Steven Pollock",
 "citation": " Steven Pollock. \"Euphoric State of Consciousness: experience with Amanita muscaria (ID 1753)\". Erowid.org. Jun 11, 2000. erowid.org/exp/1753",
 "substance": "Amanita muscaria",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "4 caps",
  "oral",
  "Amanitas - A. muscaria",
  "(fresh)",
  "",
  "4 caps",
  "oral",
  "Amanitas - A. muscaria",
  "(dried)"
 ],
 "report": "<p>[From the Journal of Psychedelic Drugs, Oct-Dec 1975]</p><p>When we returned to a friend's residence, we boiled six caps of various dimensions. Frank consumed two in his mushroom soup and I ate four (the usual dose being one to four caps). The taste was something like chicken. Curiously, I became nauseated within minutes but the feeling was fleeting. Within a half hour I noticed many peculiar effects. Audition became enhanced and synesthesias became prominent with multi-modality overflow. I began to taste odors, to small tastes, and even to hear odors and tastes. Visual disturbances were almost non-existent, but I noticed frequent recurrent gustatory, olfactory and auditory flashes. Tactile sensation became markedly enhanced. Occasional moments of nausea occurred during the first two hours of the experience, but then the pseudo-delirium settled into a profound euphoric state of consciousness. Equilibrium was affected as by ethyl alcohol throughout the intoxication, but mentation in contrast remained unimpaired. After six hours, though still under the Amanita influence, I retired for a night of sound sleep. Frank experienced a state of wellbeing and restfulness without any nausea. He felt a sharpening of auditory, gustatory, and tactile sensations. While taking a shower during the evening, Frank seemed to taste cleanliness and he later slept well.</p><p>A few days later we again tempted our fate but with dried Amanitas. I ate four caps and Frank consumed three. Each of us experienced a pleasant intoxication with only mild sensory alterations including subtle echo patterns. Frank did feel nauseated, however, for the first half hour, but the predominant effect afterwards was induction of euphoria. A nonintoxicated observer noticed no distinctive changes in our behavior.</p>",
 "year": "1975",
 "id": "1753",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-11T07:00:00.000Z",
 "views": "19962",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 caps",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(fresh)"
  },
  "1": {
   "time": "",
   "amount": "4 caps",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  }
 }
}
