{
 "id": 17533,
 "title": "Teacher of Moderation",
 "date": {
  "submission": "2008-02-22T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "kenaz",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "27.5 mg",
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "insufflated",
   "substance": "Sceletium tortuosum",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Sceletium tortuosum",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "24 oz",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>INSUFFLATION:",
  "Upon receiving my package of 25 500mg Kanna capsules, I insufflated 500mg of Kanna in two lines of approximately 250mg.  This dosage was much larger than required: within a few minutes my flushing, cold sweats and general nausea culminated in vomiting.  As I was divesting myself of the 24oz. of coffee which starts my morning, I had the distinct impression the Kanna was telling me 'you need to take less caffeine.'  After this I (and my partner)noted that my consumption of coffee had dropped approximately 35% to 50%.",
  "I have not felt the urge to try sniffing Kanna again: I get the sense that when taken in this manner Kanna acts as a purgative and I haven't felt the need to purge again.",
  "SMOKING:",
  "Kanna is surprisingly psychoactive for a legal substance.  Upon taking a small hit, I notice an almost immediate head rush combined with a brief niacin flush.  Soon thereafter I notice a general feeling of well-being as well as mild 'butterflies in the stomach.'  While the butterflies go away within a few minutes, the elevated mood lasts for 1-2 hours.  My partner has noticed a mild mood-crash after smoking pure kanna, I have not experienced this personally but thought it worth mentioning.",
  "But Kanna REALLY comes into its own when combined with cannabis.  Not only is it considerably cheaper than marijuana, but the two substances appear to potentiate each other nicely.  Kanna increases the euphoria associated with THC and seems to slow down its metabolization, cannabis takes care of the butterflies and occasional jittery feeling that can arise from Kanna consumption.    (My partner also notices that it alleviates the brief post-smoke depression she has experienced). I've cut my cannabis consumption substantially since I started mixing it with kanna in an approximately 50/50 blend.  Since I was spending a lot of money smoking, this has been fabulous for me.",
  "My partner and I have both noted some similarities between Kanna and MDMA: in many ways, the Kanna high is like a very small dose of extremely clean MDMA.  The empathogenic connection isn't nearly so strong, but neither is the tooth-grinding, the appetite is suppressed but not eliminated entirely, the sensitivity to cold and love of tactile sensation is there, but at a far more moderate level.  (The appetite suppression is particularly useful in the cannabis combination, as it helps to stop binge-eating caused by the notorious 'munchies.'  Once again Kanna leads to moderation).",
  "ORAL INGESTION:",
  "This is not a particularly efficient way of consuming Kanna but the effects appear to be longer-lasting than smoking.  It could be useful in situations where smoking is not practical but a little uplift is required -- but in my experience said uplift will take 30-90 minutes to arrive, whereas it comes almost instantly with smoking.",
  "Overall I've found Kanna to be a powerful and underused plant ally.  While I'd recommend the usual precautions (be careful about taking this while on antidepressants, and I've found it doesn't mix well with caffeine or other stimulating substances), I'd say that Kanna definitely deserves further study and might well become an important part of any psychonaut's medicine bag.</p>"
 ],
 "erowid": {
  "id": "65389",
  "citation": " kenaz. \"Teacher of Moderation: experience with Sceletium tortuosum (ID 65389)\". Erowid.org. Feb 22, 2008. erowid.org/exp/65389",
  "substance": "Sceletium tortuosum",
  "views": "30284"
 }
}
