{
 "title": "Summaries of 7 Experiences",
 "author": "Various",
 "citation": " Various. \"Summaries of 7 Experiences: experience with Amanita muscaria (ID 1754)\". Erowid.org. Jun 11, 2000. erowid.org/exp/1754",
 "substance": "Amanita muscaria",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Amanitas - A. muscaria"
  ]
 ],
 "report": "<p>Siberian Koryak Use Description: --from Disembodied Eyes</p><p>'Other subjects became very jolly or sad, jumped about, danced, sang or gave way to great fright. Their pupils were enlarged. Lewin believed this was responsible for the distortions in size which occurred. Small objects appeared much too large.</p><p>In large quantities more severe hallucinations and rages occurred. The initial excitation could become more and more severe leading to attacks of raving madness. In some cases motor excitation was dominant. The eyes became savage, the face bloated and red, the hands trembled and the individual danced or rushed about until exhausted when he apparently slept. But he then experienced more hallucinations. This could then be replaced by another spasm of overactivity followed by more hallucinations and fantasy.'</p><p>\nHallucinari's Effects Description: --from http://www.heureka.fi/i/Illuusiot/hallu/apt.e.html</p><p>'The extract of Amanita muscaria is intoxicating and results in a depressed state (a stupor), with concomitant sleep, hallucinations, delirium, and muscle spasms. Stupor may be followed by behavioral excitment accompanied by visual and auditory hallucinations and distortions of sensory input.'</p><p>\nMycoFAQ's Amanita Muscaria Effects Description:</p><p>'Symptoms appear within 30 minute to 2 hours after ingestion, and last for several hours. Nausea and vomiting are quite common, but the principle effects are on the central nervous system: confusion, visual distortion, a feeling of greater strength, delusions and convulsions. Drowsiness is a common symptom and many who ingest these mushrooms fall asleep and can not be roused. This facet of the syndrome can be particularly frightening for the attending physician, as most cases involve patients who arrive in this apparently comatose state. The resulting panicked reaction and overtreatment, generally produces no benefit to the patient.</p><p>Treatment is largely supportive -- reassuring the patient that the effects are only temporary. Recovery is normally sponanteous.'</p><p>\nJohnathan Ott Effects Description: --from Jonathan Ott in Psychedelics Encyclopedia</p><p>'After oral ingestion, the full effects will begin in about 90 minutes. For me, these are characterized by wavy motion in the visual field, an 'alive' quality to inanimate objects, auditory hallucinations and a sense of great mental stillness and clarity. The effects are distinctly different from psilocybin, LSD, or mescaline, and may last up to eight hours. Side effects often include nausea, slight loss of balance and coordination and drowsiness. Smoking produces a more rapid effect of shorter duration.'</p><p>\nJ. Doe's Effects Summary:</p><p>'[I was] relaxed but not tired, flushed face, slight motor impairment no logic impairment, able to play logic games competitvely, easy to move into unsolicited conversation weirdness, seemed like stuff was moving, effects lasted 6-7 hours, no hangover, sleep came easily, pulverized in gel caps with milk thistle.</p><p>[my companion was comfortably sleepy], a bit hotter than usual, no adverse effects.'</p><p>\nPetri's Experience Summary:</p><p>'sleepy, nausea, no color patterns or visuals, internal visualizations, confusing, sometimes scarey, 'lost in a parking lot', euphoric, aphrodisiac, funny'</p><p>\n--- B's Experience Summary:</p><p>1/3+ of a 4 1/2 ' cap, nausea, body proportion change, body euphoria, motor impairment, desire for linear conversation diminished, mental 'discomfort', 'deliriogen', vomiting, lasted 3 hours, approach with respect and caution.</p>",
 "year": "",
 "id": "1754",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-11T07:00:00.000Z",
 "views": "57566"
}
