{
 "id": 17544,
 "title": "Felt the Universe",
 "date": {
  "submission": "2009-01-03T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bianconero",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "Felt the Universe",
  "(written after one month after the trip)",
  "(Poor English)",
  "I met it on March 2006, at Soulclipse Psychedelic Trance Festival in Turkey. Actually that trip to Turkey and all March was full of strange and important events in my life. First was Mushroom, then Festival with Psychedelic music and lot of news. Frankly, all the experience that night was like I could have all them without any acid. Nothing especially interesting about that legendary molecule. Even more, I felt some discomfort and was listening to Infected Mushroom 2-hours performance very disappointed and quite far from the stage. Looks like it was not the time, or I was not ready or something else.",
  "But the day came. Everything started slightly earlier. I was in Bakuriani and after all day skiing was sleeping like a child when my mobile rang at about 4 oclock in the morning. Looked over very confused, and when I saw nothing but dressed sleeping friends, took the phone not to awake also them. Benefactor was calling from abroad and was extremely happy to make me wake up. I was not surprised and was also happy that woke up! Said he was going to bring Alberts bike. I knew what he meant, said good night and slept again.",
  "He came back in 1 week, but the event took place only after month. We did not plan anything and this could happen either the next day after his arrival or even never. We almost agreed to meet at some cottage and have interesting night. Sounds strange, is not it?",
  ".. we entered the room. It was quite nice one: leather armchairs, low table, clear toilet, table was ready to use (plates, folks, glasses) and a bed where even a pretentious virgin could lose her chastity with great pleasure. We tidied up everything, everywhere put incense sticks, covered all the windows with towels and put bread (Georgian Shoti) and Georgian Red wine Saferavi on the table. Drank single glass, said toast for coming night and smoked some marijuana. It was about 6pm. After some talk about matter of life, we decided not to postpone more. Counted that by 2-3am we have to be humans again. Blotter has 5x5mm dimensions with smiling Sun pic on it. Took acid, drank some wine and continued talks about not materialistic but anyway quite real parts of the universe. The marijuana was doing its job but not intensively. Finally we took away all the sources of the light. The last he said was offer not to speak with each other, or in urgent cases only with telepathy. I did not pay much attention to his words but remembered well.",
  "What happened then is difficult to express with words, even more difficult to read and understand. I think its almost impossible to express at all using the ways humans usually communicate. Im not sure if somebody will read it, I suppose I wrote it for myself, not to forget something. But perhaps it will take long even for me to understand and remember what happened. From the other hand, its impossible to forget! Very strange, I cant touch the main topic so long time, like I cant bear to write it in words. Maybe Im afraid to make mistakes, and the remember the mistakes.. but I believe, fear is good force.",
  "When we switched off the lights I felt very alone. Marijuana effects were wearing off. Ive read much about the FEAR and some BAD feeling while initialization but, felt nothing like this. The only feeling was expectation. Was looking at chequered towel, hanging on the window and thinking about hallucinations seen in films (for instance Fear and Loathing in Las Vegas) but nothing was happening yet. While waiting I could not notice anything, but as I realize now (maybe even mistakenly) speed of thoughts fastened impossibly. I was thinking maybe 10, 20, 1000 times faster than normally. I was thinking on very many things and all these were leading me to somewhere very strange and unknown. This process I realized lately, but in that moment it was like light dream.",
  "Suddenly I woke up in a little piece of a second and this where I was going to was just before my eyes or a brain!! As I know this feeling is often called like understanding of matter of life, discernment, insight. I cant say I felt exactly this, but it was not too far away. Maybe Ill never be able to express this in exact words, but for that time it was expressed in: I know everything and I recalled. This feeling was very different then every other, even hard to call it feeling. So its difficult for me to compare with something but if its necessary I can say that I could touch it(!), exactly touch! It was the realest thing Ive ever seen or felt. I was confused, could not understand what was happening, but it was really known for me. I tried to remember and I recalled.",
  "As I found out in that moment, I had the same feeling before, at least 3 times! I did not know this before, or better so say, I did not remember. From these 3 moments one is clear: it was using magic mushroom, but this is another story. Only now I understood why I did not write report about mushroom trip  I did not remember almost anything.",
  "Another one was with Hashish (NB.: In the first version of this Trip report I did not remember anything about the second moment, but only after 6 months recalled it while another acid trip). And the third one (or to say the first) was most interesting and frankly to say I remembered it ok. Ill explain exactly:",
  "When I was about 7 and was playing with neighbor children in the yard, I fell on the ground and hit my head. For several minutes (4-5) I passed away. When I regained consciousness I found myself running up on the stairs of some block. I was already on 6th or 7th floor and frightened children were chasing me. This was not a dream, as my family knew this story. For almost 20 years I did not know, where I was and what I was doing during that several minutes. Only with acid I understood, or recalled. Again, understanding or recalling is only approximate meaning of that real feeling or knowing. By the way this story I recalled even during mushroom trip, but maybe I was not ready for that information by that time and forgot about that. After this the word recall (but only in Georgian) got very special meaning for me. Even when I say that word I can feel something unknown and very unusual very very close, but cant touch or see it.",
  "Another expression of that grand feeling, as I said was that I knew everything. Now I really cant say what that means but by that moment I really KNEW EVEYTHING. After I realized this some processes started, maybe not so important but they existed. Immediately Ive started to think how Ill tell about this great discovery to others, was trying to remember everything using usual ways (for instance, sent sms saying I know Everything). When I started writing sms, only then realized that I was not alone. He said: Without phone like he could read my mind. But then I thought activities like that were losing time. I concentrated my mind and started learning this new world, which was surprising every next second. That two feelings (I recalled' and I know everything) were with me all the time. But Ive used to them like breathing.",
  "By the way only once I remembered to check my pulse and found my heart not beating! But it was ok, I was not frightened even a bit. I was trying not to pay attention to visual and acoustic hallucinations that were accompanying all the process, all the time. By sms sending time the next day I found it was 2 hours passed after getting acid. Visual hallucination were both with open eyes (shadows transforming into strange beings, living things, moving pictures) and with closed eyes (fantastic patterns, moving in 3 and more dimensions). Music also was there, very low voice but all the time.",
  "Ive dreamed to see and hear hallucinations like this before, but that moment I decided it was wasting time and tried to understand everything. I knew that I knew everything about god and universe, or exactly to say I knew how, but did not know why! Why Im here, whats the sense in this, Why this exists. Soon I realize It was impossible to understand by that time and concentrated on other things. Soon some fear came to me: How do I look in normal world? Everybody supposed to think Im insane and from that normal view I was really insane and thought it would not be good to stay insane forever, even for that other people. Suddenly some vision about madness appeared.. who knows, maybe its my future:",
  "I was sitting in a little room with white walls, dressed in strait-jacket, with my back to window, was 40-50 years and knew I was insane (dont know exact disease). I could hear street voices from outside, but could not see anything and I knew I was patient in psychiatric hospital. The events happening in real time (in 2007) were my lucid memories and I was recalling them with regret. What would happen if I had not gone to that cottage that windy winter night?? Would I have been here? Would I be insane or maybe I could have family like others, have job.. AND WHAT WAS BETTER??? Several times I was frightened and confused while trying to find out in which reality I existed. Was it reality, my (or others?!) memory, dream? It was really difficult to orientate between these variants.",
  "One moment I decide always to come here and now when Ill be in the same state as that time. So to say to make meet several me-s from time and space. But then I thought if I do like this, than several me-s from different times have to be here now and I did not know which me have to wake up today and go back to this reality. So I declined this idea rapidly.",
  "Another moment I was my father. I was standing in the middle of the room in his specific manner, smiling and looking at myself like my father does sometimes. Only in his skin I realized how he loves me and my brother. It was like stimulus to wake up. Long time has gone already and we lit a candle. Light was disturbing, and I blew out it again. Hallucinations were still existing but not so intensive. When also they weakened we again lit the candle, drank some wine and ate bread. Ive never eaten bread like that before. It was not just taste, it was, maybe alive?! What about the wine, for some time it brought effects back. Interesting it anybody else experienced wine effect like this, or only Georgian Saferavi can do like this?",
  "The next hour we were coming back. Hallucinations still existed and once I thought that I could stay in this state forever. But now it was ok with it and Id have done it with great pleasure. By 2am we went to night club and were dancing on some minimal tech-house in really not-minimalistic way. by 6am we decided to go to Gudauri, but soon changed mind and by 7am I was at my parents home.",
  "Half an hour I was trying to sleep but because of flashlights in my eyes it was really hard. Light was the same with open or closed eyes so I even though I was blinded. But then I went asleep. After that I can feel the same sense or knowledge very close and try to make my dream real  to go to that other world with no help of any acids, mushroom or somebody else. By this moment I did not succeeded much, maybe itll take much longer then I think.",
  "Now I know: Our world is not only what we see and hear, or just think that we see and hear. There are lot of magic around us and no acid is needed to see that. I dont know why but, we close our eyes when all these magic appears. And as it exists all the time, we are blind and dumb. We think theres no need to see sunrise, as the Sun anyway will come and we can see it whenever we want. I was trying to see sunrise during 3 months, woke up early (in Georgia the Sun comes about 3-4 hours before working hours start) about  15 times, and only after that deserved to see it. But we dont realize that one day the Sun wont come up for us.",
  "February 21th, 2007"
 ],
 "erowid": {
  "id": "65436",
  "citation": " Bianconero. \"Felt the Universe: experience with LSD, Cannabis & Alcohol (ID 65436)\". Erowid.org. Jan 3, 2009. erowid.org/exp/65436",
  "substance": "LSD, Cannabis & Alcohol",
  "views": "3918"
 }
}
