{
 "title": "Perfectly Poisoned",
 "author": "Asil",
 "citation": " Asil. \"Perfectly Poisoned: experience with Cocaine (ID 17542)\". Erowid.org. Jun 15, 2005. erowid.org/exp/17542",
 "substance": "Cocaine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>This is insanity...I am in love and in hate all at once. And it all revolves around my addciction to this angel, this demon...Blow.....</p><p>I've used drugs since I was 13 years old. Ten years later, I've done it ALL...and this is the only thing that has imprisoned me so tragically, so beautifully. Poetically tortured, perfectly poisoned - it's such bliss,  such elation, to be high...life is beautiful, then....And it's such darkness when I'm alone, without, and facing work and bills and well, reality. I love to be high and I think I always will.</p><p>I used to be a coke-head...4 years ago. That ended with my overwhelming depression and suicide attempts....I broke away from that crowd and instead turned to a morphine and ecstacy diet...I said I'd never get that way again...blowin' all night, sleepin all day...only with the help of valium or oc's...And here I am again. All grown up, responsible, mature...with a Bachelor's degree and a cool job.....all addicted to cocaine.</p><p>It's one hell of an expensive habit....a hundred dollars every other day, and double that on the weekend. And I am not rich...but I will go without other things so that I can afford what i need....and I need to get high. I sit and daydream about being out with 'my boys' - my little group of all male friends who love me as I love them....as we love getting way high and talking, inventing, revelling!!!!! We are fucking geniuses, perfect intellects! So we think at the time.....Maybe we are...Always twisted up in the ride...up, up, up so high...down, down, DOWN hard...it hurts then. But there are always tomorrows.....i think.</p><p>I am depressed. I cannot sleep at night, even when I'm not high. I am irritable and pissy and selfish as hell....I am in the process of learning about myself....I impatiently wait to go out and rage, I think about the coke, the lines, the drip, the stimulation of the mind.......And I can't wait to numb myself again...all the suffering is worth it.</p><p>Here's my theory: some people get high. it's a way of life, just like it's a way of life to get hooked on t.v sitcoms or to raise kids all day and night.... it's just what some people do. if they are happy, when they get high....then that's all that matters. that happiness makes up for the time spent hurting. if they die from it, then that's that....that was their life, and they died doing their life's work. If you are unhappy doing drugs, then you need to stop. if you are happy....that's life...keep living.</p><p>And who's to say that living is not dying, or vice versa........</p>",
 "year": "2002",
 "id": "17542",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-06-15T07:00:00.000Z",
 "views": "4564"
}
