{
 "id": 17556,
 "title": "Being Ripped Into Death",
 "date": {
  "submission": "2008-01-29T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Rmcello",
  "gender": "Female",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "Last night I smoked salvia three times and two of the times had a very very bad experience. I wanted to share with you my story so people can be informed that there can be bad trips from this. First I must say I am a very experienced tripper and have tried LSD, 2CB, 2CI, 2CC, Mescaline, mushrooms, etc. Never once have I ever had a bad trip. I have always been able to handle my experiences and understand that I was tripping. This was my second experience with Salvia. The first time was with straight leaf and I barely felt the salvia take effect.",
  "I had the 20x for over a year and was waiting for the right time to experience it. After much research and hesitation, I decided to try it with a dear friend. We had a lovely dinner with a few glasses of wine and I had a few beers and a toke of herb about an hour before smoking the salvia. At first attempt I barely felt anything. It was very close to eating pot food and lasted around 10 minutes. My second experience was vastly different.",
  "I found myself having a near death experience where I was on a chopping block with thousands of chickens and was going to die alongside the chickens. The feeling was extremely real and I remember being surrounded by blood and feathers and torn flesh and a giant man with a huge meat clever coming to chop me up. It was very much like a bad nightmare and I had no ability to distinguish what was happening with reality.  Later my friend told me that I had grabbed him with both hands and was rolling around on the ground with him with a look of utter fear on my face.",
  "I chose to try it again after my bad trip because I thought that it was just chance that it was a bad trip. I have never in my life had a bad trip and that was with years and years of exploring the world of psychedelics.",
  "When I smoked the salvia the third time, I was instantly taken into blackness. I saw myself slip away and I started screaming my name over and over because I had lost myself into the blackness. Suddenly an arm reached out for me and it was myself trying to pull me back into the light. I knew if I let go I would die and it took every inch of power and strength I had to pull myself back into the light. I remember feeling as if this was my end and if I could not pull myself out I would die.",
  "The emotion and how real this moment felt is beyond words. I faced my death. When I finally came to I felt sadness like I have not felt before and was certain this plant and I do not agree. No drug has taken me that far down the wormhole nor to such a dark place before. I strongly urge people to be careful with this plant for it is not something to be taken lightly. Obviously everyone is different. My friend saw big bird and laughed the entire time and I faced my death in the most gruesome way."
 ],
 "erowid": {
  "id": "65501",
  "citation": " Rmcello. \"Being Ripped Into Death: experience with Salvia divinorum (20x extract) (ID 65501)\". Erowid.org. Jan 29, 2008. erowid.org/exp/65501",
  "substance": "Salvia divinorum (20x extract)",
  "views": "7975"
 }
}
