{
 "id": 17561,
 "title": "Mild Relaxation with Convenience",
 "date": {
  "submission": "2007-09-12T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Purple Banana",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Lactuca",
   "form": "tar/resin",
   "specific": "L. virosa"
  }
 ],
 "report": [
  "After hearing much about various encounters with 'Opium Lettuce,' and reading reports, I decided to give it a try. I began to look at pictures of the plant, and realized it seemed very familiar to me. I live in a very grasslands agricultutral area, with many fallow fields near me, so I grabbed my botany guide, and walked to a field in my backyard.",
  "Sure enough, after 5 minutes of searching, there it was. A nice-sized clump of the lettuce growing tall. I identified it correctly, and began picking leaves from the base of the plant. I then realized a milky-white sap was coming from the base of the leaves, and retrieved my pocket knife. I cut very shallow across the stalk of the plant, revealing a beading collection of the sap- much like blood beads from a papercut. I collected this sap with the blade of my knife and deposited it in a plastic container.",
  "I let the container full of sap dry in my hot attic for about 9 hours, before returning to it. It had turned a brownish color and coagulated. I packed a pea-sized amount into my bowl, and lit up...",
  "00:00- I light up, keeping a direct flame on the small ball of now sizzling residue. It doesn't taste too bad.",
  "02:00- Feeling a slight body buzz, muscles feel looser than normal, my head is just a tiny bit spinning.",
  "05:00- My body feels very warm and relaxed, similar to that of a true opiate buzz, and my vision is just a smidge blurry. This feeling continues.",
  "20:00- Still feeling a good amount of buzz, beginning to taper off.",
  "60:00 Buzz is mostly gone.",
  "Overall, I wouldn't go out and pay money for this stuff, but it's nice to know it grows plentifully in my backyard. I will probably try it again some time."
 ],
 "erowid": {
  "id": "65556",
  "citation": " Purple Banana. \"Mild Relaxation with Convenience: experience with Lactuca virosa (ID 65556)\". Erowid.org. Sep 12, 2007. erowid.org/exp/65556",
  "substance": "Lactuca virosa",
  "views": "17588"
 }
}
