{
 "id": 17566,
 "title": "Don't Worry, That's the Way It Is, Let It Go",
 "date": {
  "submission": "2002-02-28T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CoolBeing",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 ],
 "report": [
  "The lights were on, and I was setting up the room where Id have the experience. I took out of sight everything that could disctract me in the room. There was pratically only the bed  no music, no noise. I prepared my whater pipe, put in Salvia enough for 3 good hits. My sitter was my wife, and neither of us had any experience with tha Salvia. I had read a lot about it during the last 2 weeks.",
  "I praied, took the air off of my lungs, and had the first hit, a long hit. When it had passed about 20 secs, I began feeling small shake waves (like a vibration) across my body, from inside out. I tried to tell my wife that it is cool..., I could say it, but I realized it was not easy... it was like it was being said by someone else...",
  "Then I remembered that I had read several times that smoking it from regular dried  leaves, I would need to inhale more than 1 hit. It was about 25-30 secs after I took it, I exhaled, and without taking any fresh air, I took the 2nd hit.",
  "I cant remember anything that happened after what was supposed to be the second half of this long hit. I had told my wife, before the experience, that she was supposed to turn off the lights but she asked me instead (yes, during the trip) well, I cant remember any of this, but my answer was no. She left the lights on.",
  "I cant say if it would make any difference because I was not in this world anymore. What was happening is something really difficult to describe. In fact, it is even difficult to recall, because most of what I felt I think is strange to this world.",
  "There was a force pulling me to my right (west) it was like waves of force, but at minimum strength it was still pulling me. And I wanted to go in fact, somehow I knew that I wanted to go, it was not a decision, it was just how it was. My movement was not physical, but I was perceiving it as spacial, but in the new space I was, and not only to the right, but it was kind of circular right and then down it was very like a clock hand moving from 12 to 1, 2,. But this direction description is, in fact, not that important",
  "What I should leave behind to go to where I was being called, oh yes, thas was important. It was my world, all my life, the family, all my protected ones. And there was that presence at my right (and up), full of love, the one I was impelled by all my being to go with, and he (I felt him as a he) was sure about what was happening and telling me to dont worry, thats the way it is, let it go let it go.",
  "I was full of mixed feelings. There was the love, but there was the fear. It was too hard to let it go. Then some words were coming to my head, like a speech, and I didnt want to say them, because saying them would be letting it go. But then I said (and my wife told I was saying the words, but I was not looking to her it was to someone else): ok, and was going to begin the speech but right after the ok I could feel the movement, and it was so good I was going shut up  mooove   let me alone and I was moving, and I could see the world very, very down there. And after each move I could see how small our world is in the universe. Im not talking about Earth, Im talking about my ego world. And when I say small, it is not about size, it is about significance, about truth, about values. But even under this perspective, it was not easy to let it go, I was leaving behing all my relationships",
  "Then, suddenly I could see my wife. And only then I realised what was going on: I smoked Salvia, didnt I  I asked my wife. Yes, she said, with a peaceful and warm smile in her face. I was so glad she was there!!! Then she told me she would turn the lights off, I agreed, telling her that it was over already that I was back and that it was incredible. Weird. She turned the lights off.",
  "I begun telling her about the trip, and this came with reflexion: I could see that I was not who I thought I was (and to where Im back now). My world was just one play. But I am real and others are real but they are not their playing roles, and nor I was.",
  "My wife told me that I seemed scared, fragmented and disconected. It had took probably around 5 minutes between the begin and the time she turned the lights off. If Id need to tell how long it took, I wouldnt know how. One minute? Days? I wouldnt know.",
  "After that, for at least 2 days, I was in complete peace with myself, and the world around me. It was like I had died and born again. I could see the world through this new perspective. In fact, it was not that new for me in belief, but now, I knew it a little bit more by experience. And I could experience it during my life. I was doing it, or something similar to it.",
  "But I believe that because of the imersion in this ego world reality, it makes it difficult to sustain the new perspactive. The experience is not as present in me as it used to be, altough Im quite sure my spiritual future is in that direction. I already told my wife that I will need at least 2 more experiences to have a good conclusion on what Salvia represents to me.",
  "My current impression is that Salvia is not for recreation, at all. One must be looking for something, other than fun, when using it; be responsible (always with a sitter); and use of respect a lot of it. Id say this plant opens an important door."
 ],
 "erowid": {
  "id": "6559",
  "citation": " CoolBeing. \"Don't Worry, That's the Way It Is, Let It Go: experience with Salvia divinorum (ID 6559)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6559",
  "substance": "Salvia divinorum",
  "views": "20059"
 }
}
