{
 "title": "Ego Dies, World's Essence Flows",
 "author": "malkut",
 "citation": " malkut. \"Ego Dies, World's Essence Flows: experience with Mushroom - P. cubensis (ID 17560)\". Erowid.org. Jun 15, 2005. erowid.org/exp/17560",
 "substance": "Mushroom - P. cubensis",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Mushrooms - P. cubensis"
 ],
 "report": "<p>We were 7 people in a park, most of us first-timers. Dose was one of those bags you can buy in the Netherlands (took them from there).</p><p>First thing to note, even though I think it was a relatively high dose (an experienced tripper confirmed it so after the effects), the travel is really progressive, I don't really notice how it's filling me and changing my whole reality concept.</p><p>The first hour was the real hallucinogenic one; colors intensified and reality seemed to... expand? everything clear, as if conscience feeling it was cleaner; the park turned out to be a faery forest, and though it was just a 'whole hallucination' I wouldn't have been surprised if I saw any elves or so :). Grass was alive, behaving like green waves, and reality felt like if I have put on the Master Ring (well, not that much, but maybe one of the minor ones ;) )</p><p>When this new state began to become habitual, after an hour we started, then the internal fight came. I think shrooms somewhat make your psychologic mind nude, try to kill the logic mind and wake up consciuousness. But you've got to fight against your own mind and trauma. I visited my infancy, and in a fetal shape I cried for some forgotten things that are still hidden in my subconsciuous, that I had to fight.</p><p>I accepted them, I understood them, and abandoned the fetal posture. Looked around, at the people tripping with me, at the trees, leaves, branches... and felt and indescriptable peace, as if the child inside had arose,... at last, you're here, you're nothing, you're you... and a light but deep feeling on beggining to understand through peace of mind...</p><p>That happened in little more than an hour. When peace came, I (and some of the group joined as long as they finished their mental fight, somo earlier, some later) started rediscovering the world, as if I was born again. Everything was so intense... but it's so intense because no 'ego' was there to judge it, to attach emotionality to things; things just were, and for hours I observed it, amazed...</p><p>Some hours later, the trip finished. Slowly, smoothly, the ego barriers, the self, the emotionality attached to things, came again ... at least, magic shrooms showed the way.</p>",
 "year": "2002",
 "id": "17560",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-15T07:00:00.000Z",
 "views": "3384",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 }
}
