{
 "title": "Peaceful Rolling, Calm Mind, and Total Openness",
 "author": "Raoul",
 "citation": " Raoul. \"Peaceful Rolling, Calm Mind, and Total Openness: experience with AMT (ID 1757)\". Erowid.org. Jun 12, 2000. erowid.org/exp/1757",
 "substance": "AMT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "insufflated",
   "AMT",
   "(powder / crystals)",
   "",
   "60 mg",
   "insufflated",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I recently got my hands on some pure AMT and decided to experiment with it.</p><p>Experiment #1. ~40 mg insufflated</p><p>While pilling it up into 40 milligrammes pills, I licked my fingers at the end of the ordeal and snorted what I couldn't get into the pills. I am guessing I ingested about 40 milligrammes.</p><p>Visuals were weak, but very beautiful. I felt like I was rolling and was drinking lots of water. Music sounded wonderful and my conversations were very flowing and honest. After a few hours, I went home and while lying in bed trying to sleep, I had movies playing in my mind that were so real, more than twice I had to reconvince myself that I was in my bed and by myself. Truly a neat experience.</p><p>Experiment #2. Snorted 60 milligrammes.</p><p>I do not reccommend this. The burn was intense and lasted more than 30 minutes. I vomited. The only cool thing was that visuals started about one minute after insufflation. The visuals were stronger this time and I was over at a friend's house while everyone else was drinking. I felt like I had eaten about 100 milligrammes of MDMA and taken one hit of acid.</p><p>Talking was very enjoyable and I was grinding my teeth quite a bit. I was very honest and open and empathetic to everyone. Same thing happened when I went to bed that night.</p><p>Experiment #3. Ate 60 milligrammes.</p><p>Wow. Eating is the way to do it. I felt the effects about twenty minutes later and went up for easily almost two hours straight. I watched Moonstruck during that time and my visuals were stronger than five hits of acid. I felt like I was blowing up hard. The bad part was that I wanted to throw up as if I had eaten some mescaline. I held it down and by the time the movie was half-way over, the nausea was gone.</p><p>I had a really good conversation with my brother about our family life. I went out to smoke a cigarette and then went to bed after about two more hours of talking.</p><p>While in bed this time, I was listening to music, which was incredible this time. I was listening to oldies about young love and the like, and the songs were becoming structured in three dimensions in my brain. There really is no way to describe this concept except that I felt that I finally was understanding both sides of the love relationships in all of the songs, as if each line of lyrics built on or responded to the last one. It was the best experience I can describe with music.</p><p>AMT is truly a great substance, but is most definitely a social drug and must be used in that context. Having a bad trip with AMT seems impossible and having a good time is almost inevitable. Nausea is the main problem and trisma can be annoying. Drink lots of water and have some cigarettes if you're into that (they're a must). And make sure that someone can give you a back rub; they feel great.</p>",
 "year": "",
 "id": "1757",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-12T07:00:00.000Z",
 "views": "50955"
}
