{
 "id": 17571,
 "title": "Microdot Mayhem",
 "date": {
  "submission": "2002-02-28T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "mby",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>Now, I had tripped once before in my life but it was probably real weak acid, I had 1 1/2 hits and felt nothing but a light headed feel, a real base-line effect. My friend jack had gotten hold of three microdots for the weekend and he invited myself and our friend dave to trip with him (me and dave had both shared our rather weak first experience). Jack was a tad more experienced in the ways of class a drugs than us although we all are regular pot heads and not shy of popping pills when the chance arises.",
  "Anyway, we had got hold of our trips and decided to go to our mates house (pete) to ingest them. Jack told us that it wouldn't be wise to drop so early in the evening (it was 4.00pm) cos we would be flying when the rest of civilisation was still active. I thought 'fuck that, I wanna trip!' and dave agreed so we ended up taking them about 5.00pm. Now I thought that if the first trip was anything to go by I would be able to handle everyday situations quite easily (I had made arrangements to see my girlfriend that evening) so I thought we would drop, go round my girlfriends house, come up and be back at petes house before it started peaking and get out of hand. Pete and his flatmates, who I wasn't too familiar with, started their evening of getting heavily stoned so I thought it would be rude to leave so early after getting there so I stayed for a few spliffs. 5.20pm (20 minutes after dropping) I felt strangely inhibited but I couldnt tell if I was just stoned or if I was coming up.",
  "About 10 minutes later I found myself to be staring at a rug in the corner of the room, it seemed to be 'breathing' as if it had a life of its own, this facinated me and it took me a while to come to terms why I was looking at a rug, pete was looking at me smiling (they know all about acid) about 5.40pm we all decided to go down the chippy and get dinner, although I was in no mood for eating, we left the house and walked down the high street by this time I was for lack of a better word fucked, I felt as if I had dropped a couple of pills I had the energetic feel of beans and I noticed that my visuals were distorting, lampposts were swaying very gently as if hanging in the breeze and the pavement in front of me was a myriad of weaving lines that threatened to trip me up if I wasn't careful, goddamn! These dots are nothing like the shitty blotters I had before, this was madness and I had to take the drivers seat..by the time we got to the chippy me and dave we jabbering about getting some mdma, this was the best idea in the world and no one could tell us otherwise, 'snap out of it, you've taken microdots, you dont know whats gonna happen, give it time'.",
  "Pete and co. Went in the chippy while me jack and dave waited outside, jack started staring at a nokia mobile advertisment on the wall, the one with the ketchup seemingly sprayed all round the edges of it. The first thing I thought was 'fuck me theres a girl in that wall and shes covered in sauce, no it cant be it is! Its actual sauce on that there wall' I went in close and had a real good look, nope its just and advertisement but the light its emmiting is the dopest thing I've ever seen. By this time pete had been in the chip shop for what seemed like hours and was cracking up at our antics outside, we left eventually and made our way back to the house, by this time I felt the acid getting stronger and stronger, I found myself on a sofa in the house attempting to get a cigarette from my packet, it took goddamn hours and I wondered if I was just stupid, this was the simplest task ever and I found myself to be incapable of performing it! This sent me off on tangents, did I do well at school? Did my mum bring me up well enough? Why cant I do this? Whats wrong with me? Oh shit...reality flashback, I had to tell myself that I felt like this because of the drugs I had ingested, then everything became a hellava lot clearer. 'Hold on, I dont have to worry about this, I can control whats happning, I just have to realise it' this got me thinking about how the drug was working in my brain,",
  "I closed my eyes and eye could visualise my thought patterns flowing freely from thought to thought, I could see if anything bad happened it would make a blockage in my flow of thought and it would keep building up and building up and cause me to get bogged down on that individual bad thought, I just had to learn to 'let it all go' so to speak. I felt as if I had a major break-through and I was just about to tell everybody about it but had to restrain myself 'what the hell would everyone think if I blurted out all the shit thats been going through my head for the last god-knows-how-long, ill be a goddamn laughing stock, well maybe..eh? Who are these people? I cant remember any of petes flatmates names..' looked over at dave at man, he was having a real bad one, shit, he looked so down I couldn't believe it..hmm he would be the one that I would save, by passing on my new found knowledge of LSD I would turn his bad trip to a good one just like I did, time to talk... 'Err we are going out for a bit, umm come on...jack and d..dd..ave'",
  "Pete: 'where you going'",
  "Me: 'uhh to get my bag' (I had left it round jacks house)",
  "Jack: 'why?'",
  "Dave: '....flahgshblah'",
  "When we got out of the house I had no idea where I was in relationship to anything, I knew the road but where the fuck did it lead??!! Which way is north?? Godammit... I went blank and we walked towards jacks house we went in silence before I remembered what the hell I had came out here for, right time to let dave know the truth..",
  "Me: 'right, the thoughts in your head, they build up like stacks and stacks and keep building and they could be bad but let em go'",
  "Dave: 'wot??...",
  "He had a point what the fuck was that? I made no sense and seemed to be confusing myself and dave so much more than we originally were.",
  "I would leave it at that and I would try to explain later when I didn't feel so fried, 'how long does this shit last anyway?'",
  "Jack: 'bout 12 hours'",
  "'How longs it been?",
  "Jack; 'err 6'",
  "Bloody hell I feel as if I've been tripping for days this stuff is insane, keep going, ride the trip out, remember what you've learned before...let it all go, yeah, thats right.",
  "11.00pm the prospect of being out at this time when the pubs were being turned out was terrifying we couldnt get my bag from jacks house because he wouldn't let us go back for fear of his parents we decided to go back to petes after a very pointless walk,still, the tracers were interesting. It was at this point when dave decided to talk for the first time it was quite relieving to hear his voice cos I was beginning to think he was braindead he said he was having a real bad trip and I told him to remember that it was only down to the drugs why he felt like this I told him to let it all go again (sounding like a damn broken lp) and he simply just looked confused there was no getting through to this boy, although someone on acid trying to explain their thoughts to another person on acid is the most futile thing ever. We ended up at petes house again after walking what felt like miles and miles (actual distance - 1/2 mile)",
  "Back at petes house I was incapable of speech although I crafted a very fine spliff which I was incredibly proud of..then the bombshell hit, I was supposed to see my girlfriend hours ago!! This was bad, shes gonna dump me, im unreliable, im a bad person etc...more acidy thoughts blowing things out of all proportion, calm. Think. Forget thats better.. The rest of my trip was incredibly pleasant after I finally managed to handle myself and things were quite good really.",
  "My ideas of a few things if your gonna trip",
  "1. Location - v.important, find a free house for a couple of days, giving enough time to trip and comedown, parents coming home while tripping is a recipe for disaster",
  "2. Know who you trip with - things can get real sketchy if your not sure about the people you are hanging around with it can turn a normal situation into a real surreal experience",
  "3. For the comedown have lots of pot to smoke or alcohol, sleep is good after an acid trip I hate just sitting around, exhausted after the drug has ebbed away",
  "4. Remember anything that happens is only down to the drug remember that you are in the driving seat, you just have to realise it.",
  "Have fun!!",
  "Mby</p>"
 ],
 "erowid": {
  "id": "6560",
  "citation": " mby. \"Microdot Mayhem: experience with LSD (ID 6560)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6560",
  "substance": "LSD",
  "views": "9117"
 }
}
