{
 "title": "Wellbutrin + Pot = No fun.",
 "author": "J-Well-PA",
 "citation": " J-Well-PA. \"Wellbutrin + Pot = No fun.: experience with Wellbutrin SR (Bupropion) and Pot (Cannibis) (ID 17570)\". Erowid.org. Jun 16, 2005. erowid.org/exp/17570",
 "substance": "Wellbutrin SR (Bupropion) and Pot (Cannibis)",
 "bodyweight": "185 lb",
 "report": "<p>I left on a Friday to make the 6-hour trek to Toronto to witness two of my most favorite people in the world get married.  It was a wonderful event, the excitement and anticipation of which completely overshadowing the horrible week I had at work.  I can normally handle anything that comes my way, but this week I hit the limit -- and left mid-way through the day on Wednesday, shaking and crying, insisting that I was never coming back.  (It's my company, so the stress of that isn't quite the same as just 'quitting your job'.)</p><p>Anyway, I get there without a hitch, and halfway through the reception on Saturday, a friend offers to go outside and smoke a joint.  Four of us pile into my car in the rain, and I had one big hit followed by a small one.  I'm a lightweight, so I knew that would be the right amount to mellow me out enough to have even more fun -- but not miss anything.</p><p>Within about 5 minutes of smoking, I started to feel way too stoned for comfort.  I asked if everyone else was OK, and they said yeah, so we walked back in to the hall to continue the festivities.  As we got closer to the front steps (maybe 100 feet from my car), I began having trouble walking properly.  By the time I was inside, I was feeling so unstable that (to the amazement of my friends) I walked right past a huge table filled with chocolate.  (I'm a chocolate fiend when I'm not stoned -- and when I'm stoned, you can't keep me away from the stuff).  That should have been my first clue that something was going wrong.</p><p>I sat at my table in the darkness watching the lights on the dancefloor and listening to the music, all the time getting more and more fucked up.  After what felt like 20 minutes of staring into space, I started to freak out, having completely convinced myself that there was crack cocaine in the pot I smoked and that I was going to die.</p><p>As my heart raced faster and faster, I started to tremble, and my mouth got so dry that I actually had a problem peeling my tongue off of the roof of my mouth.  After almost choking on my tongue, I started reaching for glasses of water, and drank every one on the table -- 10? 20?  I have no idea how many.</p><p>At the same time, I was having increasingly more difficult just sitting upright, and I decided that I needed to go back to the hotel.  Of course, I was in no condition to drive, so I confided in a friend (who is anti-drug of course) that I had smoked some pot and was having a bad reaction and that I needed to go to the hotel, and possibly to the hospital.  He reassured me that I would be fine, and that he would find someone who wasn't drunk to take me back to the hotel.</p><p>In the meantime, once he left the table, I started getting paranoid that everyone knew what was happening to me, and I got more and more freaked out.  People were talking to me, and all I heard was 'bla bla bla', and amazingly, though I didn't have a clue what they were saying, I responded -- and was amazed at my profiency at speaking.  None of them talked to me about the situation at hand -- it was all random other stuff as they didn't even know -- but the more people that talked to me, the worse it got.</p><p>Finally I saw my friend who had supplied the pot and I managed to scream out his name loud enough that he came running over to me -- I accused him in no uncertain terms of lacing the pot with crack, called him every name in the book, and told him I was dying.</p><p>He dragged me (literally -- I couldn't stand up) out the back door, saying that I will be fine, I just needed some fresh air.  Outside, in the rain, on the steps, I realized that I wasn't going to be able to stand, so he led me to my car.  I told him that I just needed to be away from everyone for a while, but I needed him to stay and make sure that I was going to be OK.  He said that everyone else who smoked his pot was fine, so I had nothing to worry about.</p><p>It was about 50F (10C) that evening, but as soon as we got outside, I was freezing cold.  Once we got to the car, I started shivering uncontrollably -- I could barely talk without biting my tongue.  We started the car, turned the heat on, and turned the seat heaters on.</p><p>He talked me through everything -- and I had waves of being OK and waves of completely freaking out, shaking, crying, freezing...</p><p>Finally, after what seemed like 1/2 hour, as I was finally starting to feel better, some friends ran up to the car, freaking out that they had been looking for us for hours.  Apparently we were in the car, engine running, heat blasting, for 3 hours.  I was finally getting warm -- and no wonder, it was probably 200 in the car.</p><p>At that point I was just 'stoned' with a little anxiety, so we went back in, I consumed about 18,000 calories of chocolate as the wait staff was cleaning up.  A friend drove us all back to the hotel; I had great sex with an old friend who I was sharing the room with, and went to bed.</p><p>The next morning, Sunday, we all got up and headed out to the bride's parents' house for a barbeque.  About halfway there on the 30-minute drive, I realized that I was still more fucked up than I had ever previously been.</p><p>That afternoon, when I was supposed to be heading back home, I started to become more concerned when I was _still_ stoned out of my mind.  In fact I was still so stoned that the bride's mom asked me if I was ok after apparently staring at a wall for a half hour.</p><p>That evening, still fucked up, I told them that I was leaving and the Groom, packing for the honeymoon, told me that he wasn't letting me go anywhere; that I was still too fucked up.  So I stayed there, quietly hysterical to myself that I had fucked up my whole life and I would be like this forever.</p><p>I woke up Monday morning and packed my stuff to leave.  I was still stoned, but I was OK to drive, and I made it home and went straight to bed.</p><p>I finally felt almost normal when I woke up on Tuesday morning -- now more than 36 hours after I had smoked.  The whole weekend was a horrible experience, but I was glad I was finally coming out of it.  I was convinced that there was something in the pot (despite common sense telling me that if everyone else was OK, it was just my bad reaction.)</p><p>Two weeks later, I brought some of my own pot (that I had had before this episode) to a friend's house and smoked it.  The same thing happened -- though this time I was able to keep my composure on the outside by remembering that it was my own pot, so I knew it was OK.  No one noticed anything, and I wound up driving home 7 or 8 hours later, though I shouldn't have, and I don't know how I actually did it.</p><p>Now, any time I smoke, it's accompanied by an initial wind of anxiety that I can usually squelch right away... but if there is too much going on around me, too many people around me, or I'm stressed about something, I can't control it and I wind up in a complete panic attack.</p><p>Of course, I can't say for sure what's happening, but I've now been able to find similar stories of bad pot experiences while using Wellbutrin.  I won't stop smoking; it's the only drug I use, and I don't drink -- I need at least one outlet!  I'd sooner stop using Wellbutrin, which I take to treat Seasonal Affective Disorder (Winter Depression). </p><p>At any rate, if you're on Wellbutrin (or Zyban or any Bupropoion), please use caution when combining it with marijuana.  The experience I had was horrifying.</p>",
 "year": "2002",
 "id": "17570",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-16T07:00:00.000Z",
 "views": "8697",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 6:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 8:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
