{
 "id": 17587,
 "title": "Could have been Potentially Dangerous",
 "date": {
  "submission": "2008-01-28T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Z",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "seeds"
  },
  {
   "time": "0",
   "amount": {
    "number": "3.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "I had a a friend mail me some mushrooms, I decided to eat them the night I got them. I remembered I had some Syrian rue and I had wanted to mix the two for a while. So I took 2 grams of rue and waited 45 minutes then ate the mushrooms.",
  "Some friends came over and asked me if I wanted to go bomb a new hill they had discovered. I decided that I could do it before the mushrooms kicked in, so off we went. Skateboarding at night coming up on mushrooms was cool but a little scary, so I asked my friends to take me home. They were cool with it. I got home and noticed I was pretty high so I went and took a shower. The water felt absolutely amazing and the shower was melting like nothing I had ever seen. I thought to my self, wow I'm fuckin fryin balls!",
  "I finished my shower and went up stairs to my room. I tried to get dressed and couldn't help but laugh at how funny everything saw. About that time I started to wonder If I had gone completely crazy, and It actually concerned me. So I went and asked my uncle if he could come and hang out with me. We went down stairs and plugged in a movie. The visuals were to intense to watch the movie and I began to laugh uncontrollably for what could have been five minutes. I uncle asked if I was alright, I said 'yah, everything is just so funny.' For some reason I followed him to the kitchen, I remember the carpet was moving like nothing I had ever seen before, so fast. 300 mics of lsd don't even compare.",
  "At this point I became some what delirious and some thing skipped out of my memory. However I do remember having the realization that I can do any thing. I was in such ecstatic euphoria. I went out side and tried to explain it to my uncle, but could not form my thoughts into words. I told him I wanted to see D, his wife and tell her the news but she was at work I began to walk down the street but realized I would surely be arrested if I tried to walk to the store.",
  "I was amazed that I had the free will to choose whatever I did. I went back to the house (I only walked about 100 feet) Things became very fuzzy after this point, I remember grabbing my uncles dog but the tail to show him my newly found ability to control every thing I did. His dog is a big pittbull, but I picked up the dog by its tail and held it strait out and made a circular motion with my hands swinging the dog clockwise. The dog did not move or make a sound or struggle at all. This is not a dog that would ever put up with that, he should have bit by leg off.",
  "That action worried my uncle so he went inside to call my aunt and tell here there was a lunatic on their hands. I was so excited and happy with my newly discovered ability to do any thing that I walked off I didn't give a fuck if I got arrested or not. I vaguely remember running through the street swinging on light poles and playing in the street. I Remember stretching my mouth back around my face.The feeling of my bare feet on the ground was amazing It was very painful but, at the same time the most intense pleasure I had ever felt. It felt like my feet were connected to the earth by some sort of swirling energy.",
  "I also saw a swirling spiral of color that looked to be infinity. At that moment I knew that I was a being that started in infinity and will go on for infinity. The swirl felt as it it were a part of me. I felt like it was God. I then laid down in the street I think this was when I peaked. I remember only small blurbs form this point on.",
  "The next morning I woke up in the drunk tank and couldn't remember how I hot there. I thought I was dreaming at first, then I turned to disbelief. I could only remember Eating the mushrooms and up to the point where I went to my room after the shower. Things slowly came back to me over time.",
  "It was the most amazing experience of my life. things haven't been the same since. Nothing ever came of being arrested. They gave me a piss test and questioned me before they let me out. All I got was a piece of paper saying I was detained overnight for probable cause intoxication. I really wish I could remember everything from that night. I also highly reccomen being very very very careful with MAOI's. Every thing came out ok but it could have been potentially dangerous."
 ],
 "erowid": {
  "id": "65666",
  "citation": " Z. \"Could have been Potentially Dangerous: experience with Mushrooms (P. cubensis) & Syrian Rue (ID 65666)\". Erowid.org. Jan 28, 2008. erowid.org/exp/65666",
  "substance": "Mushrooms (P. cubensis) & Syrian Rue",
  "views": "4772"
 }
}
