{
 "title": "Couldn't Decipher What Was Reality",
 "author": "Kid A",
 "citation": " Kid A. \"Couldn't Decipher What Was Reality: experience with 5-MeO-DiPT (ID 17581)\". Erowid.org. Aug 14, 2006. erowid.org/exp/17581",
 "substance": "5-MeO-DiPT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "5-MeO-DiPT",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I found myself in a situation where I had the opportunity to imbibe 10-15mg of 5-MeO-DiPT. At the time I didn't even know it existed and I'm the kind of person that would do anything put on the table. So I popped the pill and started to feel a buzz and increased energy about 30 minutes later. Within the next hour my mind had completely left my body. I had traveled into a picture of Radioheads album cover of Kid A. I was seeing things in a very different light.</p><p>Absolutely incredible stimulation, almost felt like my brain was being cooked and melting out of the back of my head and running down my back. And when I would touch the back of my head to prevent this from happening. Id look at my hand and it would have blood on it. This was all of course an hallucination. So later I tried to sleep, but I could barely close my eyes so I got up again, and went for a walk hoping to expend some of this energy. That did not happen, it almost gave me more energy in a way.</p><p>So now I come back...and I'm listening to Queens of the Stone Age. And I'm tripping so god damned hard I keep responding to questions that are being asked by my friend who lives a thousand miles from where I do. And I would occasionally turn around to ask him what he said..and he'd be explaining what he said and then I'd realise that he wasn't even there. I even started smoking a cigar that he passed to me. I hadn't any cigars prior to taking the foxy. And I hadn't any money at the time to buy any. But nevertheless I had a 'Black & Mild' cigar in the ashtray the next day. Sleeping was not an option. I stayed up the whole night and still had enough energy for the next day. I've done it once since and the experience was basically the same. But I loved it.</p>",
 "year": "2002",
 "id": "17581",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-08-14T07:00:00.000Z",
 "views": "2973",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(pill / tablet)"
  }
 ]
}
