{
 "id": 17592,
 "title": "An Angel Made of Stars",
 "date": {
  "submission": "2010-10-20T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "R. Henna",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "sublingual",
   "substance": "Bufotenin",
   "form": "(freebase)"
  }
 ],
 "report": [
  "[ Erowid Note: One should not attempt to perform alkaloid extractions without first having an understanding of safe handling procedures for the chemicals and equipment required.]",
  "We had read several reports of free base bufotenin being a pleasant experience. We decided to give it a go and see for ourselves.",
  "We purchased 100 grams of Anadenanthera colubrina seeds and powderized them in a little blender. This was boiled for 1 hour in 1000 ml of water made pH 3 with citric acid found in our local vitamin shop at the mall. We used a pH meter to check that the pH was exactly 3. After boiling, the seeds were filtered through cotton balls and the water was saved. We added 1000 ml of water, boiled the same seeds again, and then filtered out the seeds and saved the water. This was repeated a third time and the seeds were discarded.",
  "The water was boiled down to about 200 ml. We added 50 grams of calcium hydroxide bringing the pH up to about 12.5. Then, we extracted three times with 200 ml of heptane. Because bufotenin is soluble in alkaline water, only the DMT and 5-MeO-DMT could be extracted. The heptane was saved (it contains DMT and 5-MeO-DMT) for later use. Then the extract was evaporated down to a completely dry powder to remove all water. The powder was ground again in a blender. At this point we extracted three times with 200 ml of heptane. Because no water was present, the free base bufotenin had no alkaline water to be soluble in and could now be extracted into the heptane. The heptane was evaporated and free base bufotenin was present as an amber waxy substance. This was scraped up and weighed at 1835 mg.",
  "The three of us each took 100 mg of free base bufotenin mixed with 100 mg of sodium carbonate. We heard that this would help it get absorbed. We all placed it under our tongues. After 15 minutes none of us noticed anything. Our mouths were filled saliva and we couldnt wait to spit it out! Robin swallowed some of it. Me and my girlfriend did our best not to swallow any. We heard it will ruin the effects to swallow. All of our tongues were sore. The mix burned a little. Probably from the sodium carbonate.",
  "After 20 minutes I started feeling really nice. My girlfriend started smiling really big. She said she started feeling a wave of euphoria flowing through her body. Robin said she felt a little bit nauseated.",
  "After about 5 more minutes it hit me really strong. Everything in the room started flashing different colors. The walls were rapidly changing colors, almost like a colored strobe light effect. Robin was getting more nausea and said she was starting to experience some light visual effects. My girlfriend closed her eyes and sat still with a huge smile on her face. I didnt bother her.",
  "After about 5 more minutes the effects were really intense. It was like being on a super strong LSD trip, everything was shimmering and swirling, and I heard angels singing all around me but saw no angels. It was incredibly intense, but I felt completely relaxed. My girlfriend sat there motionless, breathing in and out, still smiling really big.",
  "After another 10 minutes I closed my eyes and WOW!!!! I saw a bunch of stars dancing. These turned into angels. They were beautiful, nude, with wings, and were singing. Their faces kept changing, they were multicolored. One of the angels came close to me. I could see through her. I could see she was made of tiny colored stars. Millions of them. Suddenly she blew apart into a million stars. I started to feel dizzy. I opened my eyes. Everything in the room was multi-colored and flashing and waving as if made of water. I began to get a little uncomfortable when I saw my girlfriend was still sitting in the same place motionless. I got up and touched her. She jumped and opened her eyes. She said she was having an out of body experience and couldnt remember the details of it, but it was beautiful. Robin was no longer in the room with us. She was down stairs watching TV. She said she was bored, that the effects were pretty weak.",
  "After another 10 minutes the effects started to fade.",
  "I like the fact that the whole trip was over in about 1 1/2 hours. Its the perfect duration. I was back to baseline and able to drive Robin home before too late.",
  "The overall effects were very euphoric. It was sort of like a mushroom experience, but more relaxed. I never experienced visuals that were that intense from anything else. It surpassed my experiences with mushrooms, LSD, and DMT. During the peak, I felt completely relaxed and at home with the trip but was hallucinating to the extreme. It was the most beautiful experience I ever had. The sound of the angels singing was clear and loud. I never experienced sound hallucination ever before. Even on hi doses of LSD.",
  "I am surprised at all the negative stuff Ive read about bufotenin. How could such a beautiful compound have such a negative reputation? Robin did experience negative effects. She experienced lots of nausea and got a headache afterwards. She did swallow some of it, so that may explain her bad experience. Me and my girlfriend both had very beautiful experiences. My girlfriend who normally has bad trips on LSD said the experience was similar to dreaming and was completely unlike LSD. It was her first out of body experience. She said it was sort of like peyote without the rush, and the nausea, but that it was more dreamy."
 ],
 "erowid": {
  "id": "65684",
  "citation": " R. Henna. \"An Angel Made of Stars: experience with Bufotenin (ID 65684)\". Erowid.org. Oct 20, 2010. erowid.org/exp/65684",
  "substance": "Bufotenin",
  "views": "11058"
 }
}
