{
 "title": "Sunday Night Embraced by IT-290",
 "author": "Anonymous",
 "citation": " Anonymous. \"Sunday Night Embraced by IT-290: experience with AMT & GHB (ID 1759)\". Erowid.org. Jun 12, 2000. erowid.org/exp/1759",
 "substance": "AMT & GHB",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "AMT",
   "(powder / crystals)",
   " T+ 0:45",
   "2.5 g",
   "oral",
   "GHB",
   "(liquid)",
   " T+ 2:15",
   "2.5 g",
   "oral",
   "GHB",
   "(liquid)",
   " T+ 6:00",
   "3.5 g",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1997",
   "1759",
   "Not Specified",
   "",
   "Not Given",
   "Jun 12, 2000",
   "39526",
   " "
  ]
 ],
 "report": "<p>I received this report and thought I'd pass it on...</p><p>21:45 </p><p>Ingestion of 20 milligrams of IT-290 (Alpha methyl-tryptamine; AMT). Taste weak and not unpleasant, pretty insoluble in water. </p><p>21:55 </p><p>The first alert, a mild 'buzz' throughout the body. </p><p>22:10 </p><p>Hanging out on IRC. Good humour, and the music starts to sound better, more deep, and I can easier distinguish between different instruments. Communication was pretty easy, even to the point of discussing the mental effects of the drug, which is almost impossible for me on 2C-B. On the latter, I can for example paint in the air with the tracers after my hands, and not be able to tell anyone that I do it... It is as if the effect happened in one part of the brain, and the language center was situated elsewhere, with no communication whatsoever between the areas. A euphoria was also growing at this time, with increased self-confidence and such. </p><p>22:30 </p><p>The phone rings. Without considering my mental state, I answer it. *DAMN* It's my mom. I pretend to be in a hurry, and she hangs up a few minutes later without noticing anything. But during this time, I was under stress and developed anxiety, and a serious tachycardia. I get scared. The music (Enya) suddenly turns into a cold, evil howl, and I feel very small and alone... I take 40 mg of Propranolol, a beta-blocker to relieve my tachycardia, and 2.5 grams of GHB to relieve my anxiety. After that I call up a friend, and we talk for a while, while I also chat on the IRC. </p><p>23:00 </p><p>While directing my attention to the people I am discussing stuff with, instead of concentrating on my growing bad trip, the anxiety subsides, and I can't feel my heart anymore. Good. My keyboard seems very large, the keys must be at least an inch in diameter and my monitor shrinks, at most 10' square. I go to the kitchen to fetch some OJ, and I am surprised by my refrigerator, it is a lot larger on the INSIDE than on the OUTSIDE. I think for a while on new efficient psychedelic storage methods, but soon abandon the idea :) </p><p>23:30 </p><p>My humour is getting worse. On IRC, I start to play with words in the most hilarious ways, and some people begins to suspect that my neurochemistry has been chemically altered on purpose. :) I start to get really hungry, the IT-290 being the only thing I've eaten today. I find nothing interesting in the kitchen, and get the idea of going to McDonalds, about ten blocks from where I live. I grab a jacket and a pair of gloves (it's just a few degrees over the freezing point). (I remember an anectote of a FOAF, when he went out one evening on LSD, grabbing a pair of sunglasses to prevent people from seeing his dilated pupils, deciding it is too dark outside with the sunglasses, and proceeds with taking a flashlight with him... Five minutes later, a friend sees him, walking around in the middle of the night with sunglasses and the flashlight. He grabs him, and explains to him how ridiculous he looks... :) I walk out, and almost grab my bike, when I remember the following passage from PiHKAL: \r</p><p>IDIOT, n. A person of either sex who drives a car, motorcycle or even a bicycle for that matter, on a public road while under the influence of a psychedelic drug. </p><p></p><p>I decide to leave my bike, and head for the town square. The streetlights displays halos and rainbows, and the traffic lights are very interesting... I walk along a around 300 meter long street, It feels like I am walking and walking and not moving a single meter. After a subjective half-hour (more like five minutes) i reach the town square. An intensely red neon sign has an aura of one meter around it. Wow. A bus comes directly towards me. Ooooh. It's so BIG! The headlights almost blinds me, and from the glowing sun-like lamps it emanates millions of tiny rays in all directions, each in a unique color, together making the rays white...</p><p>00:01 </p><p>McDonalds. It closed at midnight. No other fast-food in the vicinity. I walk around in the city like a cartoon character, exaggerating every move, and I get lost about once a minute, because I cannot recognize the buildings around me. The body load is pretty heavy, I feel like I've taken an overdose of amphetamine, muscles are aching, the whole body goes 'Bzzzzzz' and I have an enormous energy. I start to get a stiff jaw. I decide to walk across town to another McD. I stop when crossing a railroad, the parallell tracks making silly things with my perspective perception. Interesting. I see some people. They are not hilariously ugly or caricatured like on 2C-B, but half-dead and bored... They look at me. They look like they are seeing the glowing 'energy field' around me...</p><p>00:20 </p><p>McDonalds 24h. It's open, but I couldn't find the door first, heh. I walk in, and I can feel I disturb some people with my presence. I order a QPC with fries and a Coke, and make sure the McD girl does not look into my wide open eyes and pupils. I sit down, and starts to eat my burger. Eating it is an adventure in food textures, and it does not taste anything in particular. I go to the bathroom and look in the mirror. I look so friendly. I stare into my reflection, and the reflection dissolves, and suddenly it isn't a reflection anymore. I look at myself! Then, if the guy in front of me is ME, who the hell am I?? :) Someone bumps into the door, and I almost jump out of my shoes, and everything goes back to normal again. I finish my meal, the paper bag of fries seems like it's NEVER going to become empty. I feel like I've eaten more than three times the volume of fries than the size of the bag, and as they go colder, it feels more and more like I'm eating stipes of wet styrofoam or something... I sit there and stare at people from behind, trying to get inside their heads, and most of them suddenly turns around after my psychological massage. How is this possible? It has no natural explanation, but I sit there and do it... I'm going to do psychedelic ESP research when I have taken my Ph.D. sometime I think... After the meal, I am not significantly less hungry than before, but my stomach does at least not hurt anymore. </p><p>01:00 </p><p>I leave McD, and it is COLD outside. I take 2.5 grams of GHB, and feel nothing. The IT-290 is a STRONG stimulant. I head towards home, but turns eastwards, and walks for a kilometer to a gas station, where I buy a soda, a chocolate bar and a pack of cigarettes. What am I doing? I don't smoke. I hate tobacco. And $5 for a pack of twenty, this is robbery! When the cash register prints the reciept, it goes on and on and on... A 10 cm reciept, but it's like the machine kept printing for five minutes. Remind me of throwing away the cancer sticks later... But as I DID buy them... I light one, and inhale the smoke. I get so dizzy I do not know where I am going. I stumble across a freeway, and find myself looking at a couple of 1000 Watt blacklight lamps, illuminating a department store sign. These lamps seems not to be for real. They look like as they were shining from another dimension. Wow. I want one of these. A police car drives by as I stumble along the freeway, but no paranoia. The blue lights at the roof was *really* pretty. </p><p>01:30 </p><p>On my way home a cat is sitting outside a house. When it sees me, the cat runs to me and jumps up in my arms as I stop to look at it. I stroke the cat along the back, and it starts to purr. Cats aren't normally this friendly, right? I am so happy. The cat is sooo cute and it likes me... I put the cat down and I come to a church, and stop by and look at a window made out of stained glass, it is SO beautiful. Although I am an atheist I'd like to visit a high mass (literally ;) in a cathedral when inebriated. That maybe approximates the feelings a true saint may have in a church. At one side of the church I find a door with the sign 'Elevator'. I freeze. I feel like this is THE elevator. The elevator to heaven. Why place an elevator in a church if it doesn't lead to God? :) </p><p>02:00 </p><p>Home at last. I still feel mentally overstimulated, and my body is SO tired after the long walk. I call a female friend up on a cordless phone, and talk with her for two hours, when the battery in the phone suddenly runs out, and she's gone. *shudder* It felt like it would if I was out walking with her, and she suddenly fell down in a deep ravine - terrible. Changed battery, and resumed the interrupted conversation. Nice. </p><p>04:00 </p><p>A bit boring... No one at IRC, I'm tired, but cannot sleep. I look out the window, and there it is! The Comet Hale-Bopp! *Muhaeaeae* Cosmic. I felt like it was a sign of some sort. Check it out, everybody who can see it from their corner of the world! </p><p>05:00 </p><p>Really tired, but still too stimulated. I downed about 3.5 grams of GHB and this really did it. I lay on the sofa with the Aldrich chemical catalog, and read the silliest names of the most incredible chemicals aloud, and laughed at myself, while glowing atoms against a fractal background connected themselves for my inner eye to form the molecules I was reciting. 'Tetraphenylphosphoniumacetatodichloro-dioxoruthenate(IV)' 'Wow, It was cheap too, only $500 per milligram' :) I pictured myself sitting in a white room without furniture, with a strait jacket, grinning furiously while slowly rocking back and forth, saying things like '1,1'-trimethylenebis-4-hydroxyiminomethylpyridinium bromide' over and over again... What a laugh. Psychotic.</p><p>06:00 </p><p>The effects began to decline for the first time during this hour. </p><p>10:00 </p><p>Woke up again. The GHB had probably worn off. Still stimulated, but no visuals. The pupils were not dilated to the max, but not completely back to normal. </p><p>19:00 </p><p>Heavy body, 25% bigger pupils than I have normally. Sleeping will be easy tonight.</p>"
}
