{
 "id": 176,
 "title": "Second Attempt",
 "date": {
  "submission": "2013-10-22T07:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "BilZ0r",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.4 mg",
   "administration": "oral",
   "substance": "TCB-2",
   "form": "(powder / crystals)"
  },
  {
   "time": "15:00",
   "amount": "1000 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": ""
  },
  {
   "time": "15:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": ""
  },
  {
   "time": "15:00",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": ""
  }
 ],
 "report": [
  "A year following my previous TCB-2 I felt it was time to attempt it again. There were some suggestions on the internet that as my last experiments involved several days of building up the dose, that I may have been suffering under some degree of tolerance.",
  "5.4 mg of TCB-2 (hydrobromide salt) was weighed out from the same batch as a year ago (which had been kept at 4 degrees C). 4.4 mg was weighed out for S (110 lb Female) to take.",
  "12:00pm (noon). Each dose of drug was 'dissolved' in a small shot glass and swallowed (drug did not rapidly dissolve, but the powered floated in the water).",
  "12:05pm. As with last time, rapidly there were subtle hints that the drug was taking effect. Light headedness, body tingles etc...",
  "12:10pm. We being to watch 'Rubber'.",
  "Over the next two hours, the psychedelic state builds. Initially not very visual, more confusion, disorientation, and difficulty in thinking clearly and a tendency towards 'profound' thoughts.",
  "The weather is terrible. We watch another film.",
  "2:10pm. Visual hallucinations are becoming very strong for me. I can not look at a face without it being heavily distorted. Each face has its own particular distortion: some people have hugely bulging foreheads, other people have vast double chins. S, on the other hand, reports less significant visual hallucinations, and only minimal closed eye visuals (CEVs). However, she has a strong psychedelic mind state.",
  "4:00pm. The rain stops, and we walk in the park. The sun is beautiful, as is the grass and trees. Movement is easy (though getting up off the couch is very difficult).",
  "We continue to alternate between watching movies and walking. However, as Saturday afternoon moves into Saturday night, we find drunk people on the street intimidating, and retire to the house.",
  "12:00am The open eye visuals have subsided, but I am still having highly detailed CEVs, the most interesting I have ever seen (for instance, instead of typical fractal, psychedelic patterns, I see fields of belt buckles, or complex patterns made from the edges of childrens' books). The whole night S has had very shaky hands, and this has progressed into large, whole body twitches. My jaw and neck are very stiff. S begins to suffer extremely painful stomach cramps, as well as a headache. I am afflicted with an extreme headache. We both take 7.5 mg of Zopiclone.",
  "3:00am My headache and S's stomach pain and headache continue. She is obviously suffering quite significantly. As soon as I took the zopiclone, curiously, the symmetry of my CEVs broke up.",
  "10:00am At some point, S and I have had some sleep. S reports getting very little. She no longer has stomach pain, but my headache is worse. I go back to sleep.",
  "3:00pm I wake again, still with significant headache. I drink two pints of water. I have 1000 mg or paracetamol/acetaminophen, 300 mg of aspirin, 100 mg of caffeine and 16 mg of codeine. The headache clears over the next hour.",
  "The experience was overall a good one thought it was heavily colored by S's discomfort. However, over the following day, I notice my urine is extremely brown. It continues to be for several days, even after significant rehydration and prodigious urine production. This causes me significant concern. While I will not necessarily conclude this was TCB-2s fault, this, combined with S's discomfort, the strength of the hallucinations and my headache means that I do not believe I will push beyond 5.5 mg of TCB-2 again."
 ],
 "erowid": {
  "id": "101627",
  "citation": " BilZ0r. \"Second Attempt: experience with TCB-2 (ID 101627)\". Erowid.org. Oct 22, 2013. erowid.org/exp/101627",
  "substance": "TCB-2",
  "views": "861"
 }
}
