{
 "id": 17609,
 "title": "A Different Kind of Oxy",
 "date": {
  "submission": "2010-08-28T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blackrocksmacker",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "4"
   },
   "administration": "insufflated",
   "substance": "Hydromorphone",
   "form": "ground/crushed"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "insufflated",
   "substance": "Oxymorphone",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "I am a 21 year old college student with an addiction to any and all opiate pain medicines. To support my addiction I often buy pills where they are cheap then come back to my home town to sell them (where they are astronomicly expensive). For several months Ive been getting cheap oxycontin from a guy who 'doctor shops' and usually has percocet, oxys, morphine, and many more opiates in varying doses. This past month, he came to town with a few new goodies Id never seen before, he had dilaudids (hydromorphone) with a strange symbol on them and instead of his usual OC 20's and 40's he had strange octogon shaped pills that I later found out were Opana ER (oxymorphone extended release), but at the time he just called them 'oxys'.",
  "I wasn't there to buy 3 or 4 pills for myself, I was dropping over $500 and selling these things so I wanted to try them first, and after flashing my cash he had no problem with that. He gave me a 4mg dilaudid (he also had 2mg) and a 20mg 'oxy' (he also had 10mg). I snorted the dilaudid and soon felt the familiar warmth spread right down to my toes (as always with my all time favorite opiate) and I was convinced of their authenticity. Next came the 'oxy'. I know there's a lot of legal battles going on due to copyright infringement on the original oxycontin so I figured this was a new generic that was different enough to be in the clear... yeah, sure.",
  "I removed the time release coating and crushed the 20 mg pill, and snorted it. Thinking it regular old oxycodone, I figured 20mg would be nice with a 4 mg dilaudid (I have an EXTREMELY high tolerance) but I underestimated its power. I didn't throw up (although I went through a few periods of extreme nausea) but I was doped to another level Id never been to before, I probably shouldn't have been driving but at the time I did alright.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I ended up getting a few of the 'oxys' but mostly dilaudids and oxycodone 5's and spent the rest of the day breakin' the law, hustling up some free ones for myself. I continued to think them as oxycodone until a friend bought some then looked them up online and informed me they weren't oxycodone but oxymorphone. I felt really bad and gave him his money back even though he'd already done the pills because he got much higher than he intended with that dose. He claimed he felt burnt out, confused, restless, and said he couldn't sleep, all side effects of the oxymorphone. Other people told me they couldn't distinguish the effects from those of regular oxycodone (just stronger for the size).",
  "My g/f did had a 4mg dilaudid and half a 20mg oxymorphone (which was half of my original 'tester' dose) before work and she threw up 7 times that day, I had to bring her a change of clothes twice because she couldn't leave being the only manager in the store.",
  "My addiction has messed up my life and hopefully I can stop before any irreperable damage is done..."
 ],
 "erowid": {
  "id": "65733",
  "citation": " Blackrocksmacker. \"A Different Kind of Oxy: experience with Oxymorphone & Hydromorphone (ID 65733)\". Erowid.org. Aug 28, 2010. erowid.org/exp/65733",
  "substance": "Oxymorphone & Hydromorphone",
  "views": "18129"
 }
}
