{
 "title": "A Lovely 13-Hour Tryptamine Visual Onslaught",
 "author": "Triode",
 "citation": " Triode. \"A Lovely 13-Hour Tryptamine Visual Onslaught: experience with AMT (ID 1763)\". Erowid.org. Jun 12, 2000. erowid.org/exp/1763",
 "substance": "AMT",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "45 mg",
  "oral",
  "AMT"
 ],
 "report": "<p>This past weekend brought a Sci-Fi Marathon at a local college. This is a very popular time for people to take psychedelics and stare at aliens for twelve hours. I decided it would be a good time to try AMT. I'd heard about its six hour peak and it's 24-26hr overall experience, so I was excited to spend most of the marathon tripping.</p><p>I ate 45mg AMT at 8pm, shortly after eating a small amount of couscous (remember, eat MAOI-friendly foods). At around 8:30pm I went to the marathon to watch movies while I came up. I felt slight hints of what was to come, mostly bodily anxiety, around 9:15pm. I had heard that AMT's second hour was unpleasant and I was starting to feel a little cold, so I went to a friend's room and chilled there for a while as the AMT was taking effect. I began to feel better around 11:45pm, and decided that I was going to be tripping soon so I grabbed a blanket and set out for the marathon. At 12:10pm I entered the room, not tripping at all. By the time I'd walked across the back of the room to meet my friends (about 15 seconds), I was tripping my balls off. This was to continue for the next 13 hours.</p><p>The trip was almost purely visual; I felt like I was thinking very normally and I wasn't experiencing any aural effects (as I do with most other drugs I've tried), but I was being saturated by *strong* tryptamine visuals the entire time. There was a speedy effect; I was constantly wringing my hands (which felt a little like MDMA-hands in the first three hours of the peak) and fidgeting. There were also jaw clenches that put those I experiences on MDA to shame, and my pupils were enormous. I noticed a sense of time warping; before I knew it, one or two hours had passed.</p><p>Since there was no mindfuck about AMT, the marathon was only marginally interesting, and so I spent a lot of time elsewhere. Around 5am I went to join my friends at their dorm. Most of them had taken some ass-whooping LSD and were coming down, and a handful of them had taken some 2C-T-7 and were still flying. I smoked a few bowls with people, and noticed very little synergy between AMT and marijuana (although it's still delightful). By 7am I noticed the visuals diminishing, and by 8am they were getting faint. Around 11am I went to my girlfriend's room to sleep, and proceeded to fidget and toss and turn and eventually resign myself to the fact that I was going to be awake for a little longer. I put some good music on, quietly, and eventually dozed off for a couple of hours around 3pm.</p><p>I awoke at 5pm with a slight headache and eyeache, but other than that I felt fine. I took some ibuprofen and set out for home to make dinner, and I slept very well that night.</p><p>Conclusions: AMT was much less intellectual (i.e., not at all) than I would have liked, but it was fun. It felt like a pure, strong version of the 'tryptamine signature' you read about here; I'd never been able to put my finger on it, but after experiencing 13 hours of it, I think I can do so now. I'm not anxious to do it again, but it was a fun way to spend a weekend.</p><p>PS- oh, make sure you have some Bazooka gum or a teething ring or something. :)</p><p>2000</p>",
 "year": "2000",
 "id": "1763",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-12T07:00:00.000Z",
 "views": "8176",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "AMT"
  }
 }
}
