{
 "id": 17648,
 "title": "Cloudiness",
 "date": {
  "submission": "2009-10-15T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Maximillion",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:30",
   "amount": ".25 mg",
   "administration": "insufflated",
   "substance": "Pharms - Alprazolam",
   "form": "(ground / crushed)"
  },
  {
   "time": "0:40",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Xanax is everywhere around my school, and being an experienced pill popper I decided to purchase five, one milligram pills. When I got home I researched very well and decided that my dosage would be 2.5 mg. I waited until the perfect night, and swallowed the pills at 8:30.",
  "SETTING:",
  "Pleasant night, around a campfire with parents.",
  "8:40-",
  "Playing guitar outside with my parents, arms and hands seem to move freely, and my whole body feels calm, and very comfortable.",
  "9:00-",
  "I got up to go inside and I feel very wobbly, it feels almost the same as having a strong buzz from alcohol. I was pretty excited at this point and decided to snort 1/4 of another pill, bringing my dose to 2.75. Almost immediately after snorting I attempted to walk to the bathroom to put away the pill bottle. When I got there I realized I had been standing in the bathroom for 5 minutes without moving. I quickly remembered what my goal was and returned the pill bottle.",
  "9:10-",
  "When I returned to the kitchen my mom offered me a beer and with all the force I could, I managed to say 'sure, sounds good' without slurring, after this I returned to the campfire and things began to get fuzzy.",
  "9:30-",
  "My parents were having a conversation about something, but every time I tried to talk I could hear the words in my head but couldnt get them out of my mouth. During this time I tried to keep my eyes open but as I stared at the campfire they seemed intent on closing. While this was going on, my mom tried to ask me questions but I felt like someone had just gave me head surgery. All my responses were just meaningless grunts. She asked me if I was on anything and I replied 'I would never touch anything besides weed' she was pretty drunk so she believed me and went on with her conversation to my father. At this point I was completely exhausted from the energy it took me to talk to her and decided I should probably get away from my parents before I get caught. When I stood up I felt like I had just rolled down a hill. Everything was spinning, and I didnt think I would manage to make it to the door. Thankfully I did and retreated to the couch.",
  "10:00-?",
  "From this point I barely remember anything. My sister said I went to the fridge and got out the orange juice, but did not take one drink. She also said that I didnt even take one sip of the beer my mom gave me, even though I thought I thought I remembered drinking it. I have a small memory of going back outside to the fire, just sitting there and drooling, but my parents were so wasted by this point they didnt even notice. I also have small, fuzzy memories of taking a piss, and standing in my living room. And the last thing I remember is talking to my sister, and telling her I was on Xanax. After that the whole rest of the night was spent completely blacked out. I woke up in the morning with my shoes still on my feet and fully dressed. I sat in my bed and tried to remember how I got there, but I couldnt. When I stood up I felt pretty wobbly and my brain was quite 'clouded.' at about 3:00p.m this wore off and I was back to normal.",
  "CONCLUSION:",
  "Xanax did not feel anything like I thought it would, I read that it would be mildly sedate like codeine, with mild euphoria. My experience was nothing like this. The whole time I felt incredibly drunk but also very slow, like it would be physically impossible to have a conversation. I would like to try it again at a lower dose, so I can actually experience and remember, the peak, and the come down."
 ],
 "erowid": {
  "id": "65926",
  "citation": " Maximillion. \"Cloudiness: experience with Alprazolam (Xanax) & Alcohol (Beer) (ID 65926)\". Erowid.org. Oct 15, 2009. erowid.org/exp/65926",
  "substance": "Alprazolam (Xanax) & Alcohol (Beer)",
  "views": "26762"
 }
}
