{
 "title": "A Pleasant Mellow and Long Experience",
 "author": "Sketchy Steve",
 "citation": " Sketchy Steve. \"A Pleasant Mellow and Long Experience: experience with AMT (ID 17649)\". Erowid.org. Sep 27, 2002. erowid.org/exp/17649",
 "substance": "AMT",
 "bodyweight": "",
 "report": "<p>A friend recently got hold of some AMT and being curious about the drug and having done my fair share of other psychedelics I thought I would give it a go.</p><p>I was slightly nervous as the only reports I had heard were from the internet and I didn't know anyone who had tried it.</p><p>An excellent opportunity presented itself when my friend's parents went on holiday leaving a nice house in the Hampshire countryside. Having heard the effects were quite prolonged not wanting the 5am 'I just want to get sleep!' feeling which I have had on acid so many times we decided to drop early at 1pm.</p><p>Two friends and me cut up three doses, dumped them in some wraps and necked them. After about an hour we started feeling a bit odd and slightly nauseous, over the next two or three hours we all started to feel more and more ill, one friend vomited and me and the other guy had to fight the urge pretty hard. One thing we all decided was if anyone asked what AMT was like that we would stress the 3 hours of grim nausea before telling them anything else.</p><p>To take our minds off feeling so sick we went for a walk through the countryside. This was pleasant and there was no paranoia (which I often get with LSD). We may have all felt sick but we were all grinning like idiots as there was a pleasant warm sensation that accompanied the trip almost like a small dose of MDMA though this was not very pronounced.</p><p>After two or three hours the nausea wore off and we had a mellow pleasant trip, we had mild visuals similar to a small dose of mushrooms or mescaline. The only difference was the length of the trip and constant tryptamine taste in our mouths. </p><p>At about 10pm or so we started to come down though we were not able to get to sleep until about 3am when the effects wore of, though like most psychedelics we don't feel normal until we had a good nights sleep. </p><p>All in all a good drug though I'd make sure to have got a full two days free as it took a big investment in time and it seemed to last even longer than LSD. It seemed to me (on the dose we did) it was more of a visual drug as we did not experience any of the head fuck which we get with most other psychedelics, though I expect this would change if we did a large dose. We only did a small amount and I would like to try a higher dose at some point though 14 hours is a long time especially if it is an intense trip.</p>",
 "year": "2002",
 "id": "17649",
 "gender": "Male",
 "timestamp": "2002-09-27T07:00:00.000Z",
 "views": "7609",
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  }
 ]
}
