{
 "id": 17650,
 "title": "Completely Sober",
 "date": {
  "submission": "2008-02-13T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Jeremy",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "725 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:30",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "After a great experience with taking 25 mg orally of generic Adderall, I decided to experiment with combining it with Benadryl in order to avoid the insane drowsiness that accompanies ingesting large amounts of Benadryl.  So I took 29 pills, or 725 mg, of Diphenhydramine.  I gave it a good hour and a half to kick in, since I planned to snort the Adderall so it would act immediately.  When I began to feel the 'small hands' feeling, a personal tell-tale sign that I am feeling full effects of the Diphenhydramine, I crushed and snorted the five 5mg pills of Adderall. ",
  "I expected the drowsiness to go away, and most likely some of the lethargy that also accompanies ingestion of Diphenhydramine, while leaving the visual and auditory hallucinations that I desired.  What actually happened was completely unbelievable.  It was as if the amphetamines cancelled the Benadryl out COMPLETELY.  I couldn't believe it.  I felt COMPLETELY sober.  I decided to give it time, that maybe the Diphenhydramine just hadn't started giving me any hallucinations.  After about half an hour of feeling completely sober, I decided to go to sleep.  I brushed my teeth just like any other sober night and went to sleep.  I fell asleep jacked up on 25 mg of amphetamines with no tolerance. ",
  "I don't know what it is about these two drugs, but they seem to cancel each other out.  I don't know what it is about this combination, but I did not expect anything like that. It's really weird that it cancels out any visual or auditory hallucinations.",
  "Summary:  I took Benadryl and amphetamines in an effort to stay awake and ended up feeling 100% sober for a half hour.  Went to sleep like normal."
 ],
 "erowid": {
  "id": "65930",
  "citation": " Jeremy. \"Completely Sober: experience with Amphetamines (Generic Adderall) & Diphenhydramine (Benadryl) (ID 65930)\". Erowid.org. Feb 13, 2008. erowid.org/exp/65930",
  "substance": "Amphetamines (Generic Adderall) & Diphenhydramine (Benadryl)",
  "views": "12377"
 }
}
