{
 "id": 17664,
 "title": "Methamphetamine and Anti-Psychotics",
 "date": {
  "submission": "2008-02-13T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Voo",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "number": "1200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Lithium",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "10",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Aripiprazole",
   "form": "daily"
  }
 ],
 "report": [
  "(Note: I have been on anti-psychotics since March 2006. I have been on the Lithium/Abilify cocktail since December 2006.)",
  "I am diagnosed Bipolar I-Manic. Generally, my mood is stable because of my medications. However, I tend to be lethargic and apathetic because of those same medications. I take frequent naps during a typical day.",
  "When I smoke meth, I feel 'normal.' I feel clear-headed, focused, energetic, and motivated. I am able to do my job more effectively and efficiently. I feel an overwhelming sense of happiness and calm. In effect, I feel like a normal person, not the heavily medicated crazy girl that I actually am in real life.",
  "Usually, I smoke half a gram to a gram over the course of a day. I stay up for one or maybe two nights. Generally, after 2 nights of being awake, I am exhausted and weary, and feel 'cracked out' and spacey. However, there have been precisely 2 times when I was skewing manic and then smoked meth and I was able to stay awake for 4-5 nights without feeling anything negative at all. In fact, it felt like I was sleeping 8 hours a night in terms of how my body and brain felt.",
  "To sum up, I didn't really have any problems with the combination of Lithium, Abilify, and crystal meth."
 ],
 "erowid": {
  "id": "66018",
  "citation": " Voo. \"Methamphetamine and Anti-Psychotics: experience with Methamphetamine, Lithium & Abilify (aripiprazole) (ID 66018)\". Erowid.org. Feb 13, 2008. erowid.org/exp/66018",
  "substance": "Methamphetamine, Lithium & Abilify (aripiprazole)",
  "views": "24128"
 }
}
