{
 "id": 1767,
 "title": "The Shakes",
 "date": {
  "submission": "2005-07-26T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A. Hamilton",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1800",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I never really considered caffeine a drug prior to this experience. I was aware of its addictive capabilities, but when I begin to lose control of my body and have a detached mindset, well, then I are in trouble.",
  "Let me start from the beginning. My friend took caffeine pills regularly simply because he liked the speedy effects. Because of this, I decided to try them myself. Taking one or two at first, I soon found he was right. They were okay. I often felt alert, stayed up later if needed, and could start my day better with couple pills rather than brewing coffee. No big deal.",
  "I was curious how high my dosage could go. Feeling competitive, as my friends record was six, I decided to take eight. The experience started out fairly normal, with moderate shakes in my fingers and feeling very uppity and on the ball.",
  "I had eaten a fairly large meal before this experience, maybe ninety minutes prior, but I got the urge to puke regardless. Being very experienced with alcohol, I knew the worst thing I could possibly do is try to hold it back, so I vomited up my entire dinner.",
  "This, suffice to say, shocked me. Looking into the toilet bowl - tingly and amazed - I saw everything I ate, but no pills. Every single caffeine pill had somehow beat my dinner through my system. I flushed the toilet, then got a severe urge to go to the bathroom. Then everything began to get frightening.",
  "Sitting on the toilet bowl, I first became extremely hot. I felt feverish, and, for fear of crapping on the floor, took off my clothes while still on the toilet. I grabbed a nearby book and started reading it. The shaking got worse, and it became actually difficult to hold the book. I found myself reading the same lines over and over again.",
  "I lost my sense of time and my feet fell asleep. This was normal, but I tried to wiggle my toes and realized I couldnt. I became nervous. I started to get a pounding headache, and all this time the need to puke or go to the bathroom did not go away.",
  "I dropped the book and clutched my stomach as the shakes took over. I decided to give up going to the bathroom and put my clothes back on, but I found I couldnt stand up. I was asleep from the waist down and completely certain I would die as the paralysis slowly crept up my body. I had mental images of my family finding me dead on the toilet like Elvis.",
  "My heart began to beat faster and faster. I feared I would have a heart attack. The world appeared to be grainy and pixelated. I felt extremely hot, and I opened the bathroom door to get the air moving; I didnt care if anyone would see me.",
  "I threw myself on the floor and waited for my blood to circulate. Eventually it did. I pulled on my underwear and pulled myself up to a standing position using the sink. I felt shaky and woozy at the same time, and it was all I could do to walk to my bed. I was unable to walk in a straight line like a drunk and I was incredibly dizzy. I fell on my bed.",
  "I looked at my clock and realized that the entire experience took about six hours, from taking the pills to laying down on the bed. About five and a-half of those hours were spent sitting on the toilet in pain. I passed out.",
  "I slept for about two hours, then got up and went to school as usual. Though the tingling was gone, I had shakes and mild nausea for most of the next day - something of a caffeine hangover.",
  "Losing control of my body was not cool, but I still take caffeine in liquid form. I took tons of caffeine before this experience, and I had no idea I could lose control of my body like that. I have not taken pill-form caffeine since the incident."
 ],
 "erowid": {
  "id": "15678",
  "citation": " A. Hamilton. \"The Shakes: experience with Caffeine (ID 15678)\". Erowid.org. Jul 26, 2005. erowid.org/exp/15678",
  "substance": "Caffeine",
  "views": "15792"
 }
}
