{
 "id": 17676,
 "title": "Sick For 4 Days And 10 Pounds Lighter",
 "date": {
  "submission": "2002-03-10T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "andy",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "liquid"
  }
 ],
 "report": [
  "This story is about a year and a half old now, but I have just now decided to submit it for whatever reason.  I am 20 years old now and I still drink, somtimes heavily.  I had drank many times before the night when this all happened and I had thrown up plenty of times as well as blacked at previously, but on this night I went way overboard.",
  "It all started off like usual myself and my now ex-girlfriend went to a party at my friends house so I got a shitload of Avalanche.  For several weekends my girlfriend and I had been on a big Avalanche and Aftershock kick, and I had gotten really drunk for a couple weekends in a row and she was pissed at me for getting so drunk the last few times, so I was supposed to 'take it easy' on this night.  So I agreed but as I started drinking I stopped careing and I just kept taking shots, one after the other.  In about 1 - 2 hours we had drank all the Avalanche.  I had no idea how many shots I took because I blacked out for a while somewhere around 13, but a friend of mine and I estimate that it was about 20.",
  "So after the bottle is finished I started wandering around looking for my girlfriend and then she later informed me that I found her and we got into it about me being so fucked up and I punched a wall.  Then I proceeded to stagger outside onto my friends pourch which is concrete.  The last thing I remember is falling forward onto my face and laying face down in my own puke.  The next thing I know I wake up inside the house with a wet wash rag on my face at 4:30 am, and all my friends are like 'Holy shit he's alive.'  Apparently while I was unconscious in my own vomit my friends found me and were worried about me.  They carried me in and wiped my face off and watched me to make sure I didnt choke or anything.",
  "So next day I go home and have to go out to eat with my dad and have to pretend I not hungover.  My dad thought I had the shits because I kept going to the bathroom to puke at Texas Roadhouse.  To sum it all up, I ended up being sick and not eating hardly anything for 4 days.  I lost 10 pounds and I didnt drink for about 6 months.  I couldnt eat mints or chew gum that was similar to the flavor of avalanche for a while.  That was the drunkest and sickest I have ever been in my life.  Being that drunk was great but being as sick as I was and the threat of being taken to the hospital sucked.  The whole thing didnt really scare me, but made me realize that there is a very real possibility that on any given night I could accidently drink myself to death."
 ],
 "erowid": {
  "id": "6608",
  "citation": " andy. \"Sick For 4 Days And 10 Pounds Lighter: experience with Alcohol (ID 6608)\". Erowid.org. Mar 10, 2002. erowid.org/exp/6608",
  "substance": "Alcohol",
  "views": "14690"
 }
}
