{
 "title": "The High Life Hits an Unexpected Low",
 "author": "Sikiamikanico",
 "citation": " Sikiamikanico. \"The High Life Hits an Unexpected Low: experience with Alcohol & Cannabis (ID 17685)\". Erowid.org. Mar 31, 2005. erowid.org/exp/17685",
 "substance": "Alcohol & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  "",
  "2 joints/cigs",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I'm a regular pot smoker; I've drank a lot and smoked a lot on more than a few occasions.  As far as substances go, this night should have been like any other.  However, I somehow managed to black out and have convulsions on my friends floor and I'm not sure exactly how this happened.</p><p>Like I said, it was just a typical night at a party.  I brought wine, so I had been drinking, but I was by no means heavily intoxicated.  A friend and I went for a walk and smoked a few joints, both of which I inhaled more plentifully than my friend and continuously held the smoke in my lungs for at least fifteen seconds every hoot.  I'm a welfare weed smoker, so I have to be sure to maximize my high with whatever weed is available to me at any given time.  Anyway, by the time we walked back to the party I was noticably intoxicated as a few of my sober friends took pleasure in pointing out, but I had been way drunker and way higher other times.</p><p>That night I learned that it's probably a better idea to participate in the the social life of the party rather than sitting alone on a couch, basking in your own altered state of mind.  There I was, just relaxing on the sofa, (apparently the party was happening outside more than inside and there weren't many people around to begin with.)  We all know the the 'spinning' effect of alcohol when you close your eyes, so usually I intentionally refrain from closing my eyes and if I do it's when I'm uncontrollably falling asleep on some dudes living room floor or something.  While I was just sitting there I kept closing my eyes and just loving the dizzying, spinning feeling that remarkably escalated the longer I continued to close my eyes and relax.  I had that feeling in my gut that I get when I'm on a crazy rollercoaster, times ten.  And for some reason I was just digging this, sitting there with with a huge grin on my face.  It was a real sense of euphoria.  I felt like laughing out loud and I didn't care that I was just sitting there smiling like an idiot.</p><p>After doing this for what I would think was a good ten minutes, I made my way to the washroom with a sneaking sensation that I might vomit.  I recall standing in the washroom just waiting to see what my belly was up to, and upon deciding that I wasn't gonna spew, I started walking back into the living room which now had about five people in it.  (Maybe there were some people around the whole time, that obviously didn't matter to me at the time.) After a few steps out the washroom, I am told, I literally just hit the floor and went into spasms.  My left arm in particular was twitching pretty good.  My eyes were rolled in the back of my head and I just freaked everyone out who was at the party.  I felt so guilty for putting my girlfriend through that.  They were gonna call an ambulance or something, but I guess I regained conciousness five minutes later.  After that, I was still out of it but I couldn't logically accept what people were telling me had just happened. </p><p>When I woke up the next day, it was just surreal; I had no recollection of fainting, of course, and I couldn't really concieve why it had happened, except for my intentional enjoyment of closing my eyes and spinning excessively.  This is my only bad experience with weed ever, not including those times when we run out of weed before we get a satisfying high, or when we are really high and we don't have any good food, it's not really the same thing.  Everyone I mentioned this to later claimed it was a freak incident, and I guess I might as well consider it just that.  All I know is that next time I want the feeling of being on a rollercoaster I'll go to a theme park, or go for a ride in the washing machine or something.</p>",
 "year": "2002",
 "id": "17685",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-03-31T08:00:00.000Z",
 "views": "14425",
 "dose": {}
}
