{
 "title": "Positive & Euphoric Combination",
 "author": "Sky Villain",
 "citation": " Sky Villain. \"Positive & Euphoric Combination: experience with LSD & 5-MeO-DiPT (ID 17684)\". Erowid.org. Nov 12, 2002. erowid.org/exp/17684",
 "substance": "LSD & 5-MeO-DiPT",
 "bodyweight": "125 lb",
 "report": "<p>I have mixed foxy and LSD on two occasions, both at the Burning Man festival, and had really positive results both times.  The first time I did it I took a microdot which had a moderate amount of LSD on it and then took the capsule of foxy powder about 30 minutes later. The two chemicals seem to complement each other in marvelous and unexpected ways, erasing any of the negative effects I usually have from either of the drugs.  The effects are very euphoric and I find myself filled with energy and feeling very positive and social.  I am having a lot of fun hanging out with different people and dancing and not feeling self conscious in the least bit as I usually do when I'm tripping. I walked a long ways with two of my camp mates and we explored various art projects on the playa and had a lot of fun laughing and talking.</p><p>Dancing seemed to enhance the high and I felt like I was dancing better then I had danced before. I spent about 4 hours dancing to breaks in a big tent full of about 400 people and firedancers. I didn't notice too many visuals apart from an extra glow and color to everything after several hours. The effects seemed to be more of a body high and euphoria. I felt very sexually charged as well, but released it through dancing. I danced into the morning and watched the sun rise for about 30 minutes.  Watching the sun rise on the Playa after being up all night is always an amazing experience, but I felt like it was enhanced in  and I felt very spiritual and happy with myself. I continued to dance for about another hour but had to depart on my bike because I thought my feet were going to fall off from dancing so much. That night I slept like a very happy baby.</p><p>My other experience mixing these chemicals was similar except that the acid I took was about 2 - 3 times as potent and seemed to override most of the foxy effects. I was also not in as positive of a mind state and so that probably took away from my whole experience. I felt much more psychedelic, which I liked, but it made it harder to control my thoughts. After hanging out with a friend for a while I began to feel much better and had a wonderful night. I would be curious to see what that experience would have been like if I had taken 15 mg of foxy. Or maybe even 20 since I had built up such a tolerance from that week.</p><p>Conclusion: LSD and Foxy mix well.</p>",
 "year": "2002",
 "id": "17684",
 "gender": "Female",
 "timestamp": "2002-11-12T08:00:00.000Z",
 "views": "7863",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 }
}
