{
 "id": 17692,
 "title": "Throbbing Reality",
 "date": {
  "submission": "2002-03-10T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "yellerfro",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.5",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Last night I decided to try Salvia Divinorum, and I was incredibly suprised by the intensity of the experience. Using a mortar and pestle, I crushed 5 grams of leaf into very fine powder for myself and a few friends. Using a 12' water-pipe I took a few lung-fulls and felt a pleasant body high with some relaxing results on my psyche.",
  "My friend broke the bowl on the water-pipe, and because I felt I wasn't achieving the full effect, we drove to a friends house to see if he had another smoking implement for us to use. It turned out he had a 5 foot high glass water-pipe, so I loaded it up with more salvia. After taking several huge hits, I began to hallucinate wildly. My entire reality became a throbbing and pulsing wave of color, which followed the beat of whatever music I was playing. Colors danced, and visual distortion made the size and shape of anything around me almost impossible to determine. I could say it was as intense as any LSD trip I've experienced, only much more relaxing. There was no intense anxiety or coming down. I felt a great urge to dance and join my throbbing world, but I was content to sit still and let my mind wander. The eyelid visuals were also very intense. I felt as if I was being 'enlighted' for the duration of the night. The most intense period was the first half-hour or so, with a very slow fade for around 2 hours. I was then more or less back down, with a relaxed and happy demeanor. I then went to bed for the night and slept very well.",
  "Waking up today was easy, and I feel a sort of appreciation for everything around me. I plan to experiment more with salvia in the future."
 ],
 "erowid": {
  "id": "6613",
  "citation": " yellerfro. \"Throbbing Reality: experience with Salvia divinorum (ID 6613)\". Erowid.org. Mar 10, 2002. erowid.org/exp/6613",
  "substance": "Salvia divinorum",
  "views": "6362"
 }
}
