{
 "title": "Death and Rejuvination in the Void",
 "author": "Hallucinajunkie",
 "citation": " Hallucinajunkie. \"Death and Rejuvination in the Void: experience with 5-MeO-DMT (ID 17693)\". Erowid.org. Sep 23, 2002. erowid.org/exp/17693",
 "substance": "5-MeO-DMT",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "27.5 mg",
  "insufflated",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>I am writing this report as fair warning to any trying this substance.  I have had some insane experiences on other substances before but nothing even previous 5-meo-dmt experiences could prepare me for this one.  I sniffed up the lines and put on a song I made especially for 5-meo-dmt.  It hit very quick not as quick as smoking but still very quick I went in the bathroom because I felt mild nausea that passed I returned to my bedroom to continue my relaxing breathing and preparation but by the time I sat down It was to late.  I had control over my body long enough to get up and head towards the bathroom.</p><p>By the time I got there I was starting to leave the planet It felt as if I had been shot out of a cannon backwards in 0 gravity in reality I fell face first into the bathtub knocking over all sorts of things I layed half in the bathtub screaming flailing my limbs and heaving the sound of my screams to me sounded like a 30 second long dryheave with many electronic effects at this point it was too terrifying for thought the substance had complete control over me at.  The intensity came in waves about every other second and when an intense wave would hit it felt as if I were dying by being pulled all different directions like when you make taffy.  Every second between the intense waves felt as if I was being brought back to life (this happened at least 150 times).  As soon as I got a rational thought back  (there were very few) despite the fact that I knew he wasnt home I found my self laying face down on the bathroom floor screaming my roommates name while pounding on the floor as said in one of the other reports it felt like in a dream when you need to scream but cant.</p><p>I got up off of the floor and walked very strangely as if It was the first time I had tried to operate a pair of legs I went from one end of the house back and looked out the window screaming Im dying to the construction workers on the other side of it luckily I had bolted the door earlier I attempted to open the door and run out and tell one of the construction workers to take me to a hospital but I couldnt figure out how to unlock the door so I started walking back to the living room with still no control over my arms and fell face down once again onto the carpet my eyes started getting heavy and this is when I really thought I was dying I had to talk  myself aloud out of letting my eyes shut because I was convinced that would be the end.  I crawled to the phone and after several fail attempts at dialing the number I called my girlfriend at work  'Nicole I need you here right now I took too much drugs' I said.  She left work but it was starting to mellow out even thought it was still at a more intense level than any other substance before.  By the time she got home I was at about the level of the average 5-meo-dmt trip</p><p>The whole thing lasted about 1hour and 15 minutes the void lasted about 20 minutes and the total loss of control for about 35 minutes at the end I was left in tears for days after I had really bad insomnia due to the fact that every time I dosed off I was confronted with a terrifying flashback that would wake me up.  I definitely recommend insufflation but be careful of your dosage because you arent coming back in 15 minutes I lucky permanent brain damage wasnt caused</p><p>No matter what you do to calm yourself before or during this intense of an experience you cannot escape the terror because you become possessed by the substance your thoughts arent your they are the substances your actions arent controlled by you they are controlled by the substance.  </p><p>Just be careful I wouldnt wish that kind of terror on my worst enemy.</p>",
 "year": "2002",
 "id": "17693",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-23T07:00:00.000Z",
 "views": "12492",
 "dose": {}
}
