{
 "title": "Was Able to View the World as it Truly Is",
 "author": "AtomicDaikon",
 "citation": " AtomicDaikon. \"Was Able to View the World as it Truly Is: experience with Mushrooms & Cannabis (ID 17692)\". Erowid.org. Jul 27, 2007. erowid.org/exp/17692",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "320 lb",
 "header": [
  "DOSE: T+ 0:00",
  "1.75 g",
  "oral",
  "Mushrooms",
  "(cookie / food)",
  " T+ 3:00",
  "1 bowl",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Well, my first experience with mushrooms was a little less than a week ago, and I'm still trying to wrap my head around it.  I'm a freshman in College, and my friend and I had been talking about trying mushrooms for quite some time now, and, he finally found some.  So, we came back to his apartment around 12:30 at night and ingested some of the mushrooms in the form of chocolates.  We sat around until about 1, and we weren't feeling all that much, so, we split what we still had between three people - my friend and I and one of my friend's roomates.</p><p>The first thing I began to notice when it kicked it was that all of us were getting extremly giddy - I couldn't stop laughing.  My body also seemed to feel like it was being tickled from the inside.  We sat around for a while, feeling pretty good, and the roomate decided to put in the movie 'Altered States' - which is one hell of a trippy movie.  After we watched that for a while, we turned off the TV and just enjoyed the experience.</p><p>Things seemed to shift around the room on their own.  I stepped out onto their porch, and it left like I was 'bending' everything with my mind.  After that, I came back inside and sat down.  I became very philosophical - I remember thinking about the relationship of order to chaos, and how seemingly miniscule, insignificant choices in your life actually changed the entire course of it.  I thought about the concept of Fate VS. the concept of Free will.</p><p>I felt the intense desire to try to explain what I was thinking about/feeling to someone else, and, I tried on many occassions to explain the concepts to my 'trippin' buddies' without success.  Words and language seemed so inadequate at the time (and they still do).  Next time, I'm bringing a notepad and pen.  I also felt as if I could step back and see the world/society as it truly was - without the automatic bias that sets in from being human.</p><p>I also thought that I could see chunks of my own future - I remember the intense joy I felt when I realized that one day, I will be someone's father.  Life seemed to be amazingly simple and beautiful at the same time.  I don't think I've ever been so overjoyed to be alive.  Then, my friend's other roomate came home at about 2-3, and we smoked a bowl (my friend abstained).</p><p>At about this point, my friend started to have a bad trip.  He went alone into his room (bad idea) and turned the lights off and tried to sleep (worse idea).  I tried to calm him down a bit, but it didn't seem to work.  I talked to him later and he said that he thought that the trip should have been 'over' by that point (about 4-4:30), and he had it set in his mind that he was going to be like this forever, no matter what anyone else said.  He also said he was hallucinating quite a bit.  He was puking into the toilet at about 5 A.M. when I was done tripping and started walking home.  He said he's never touching shrooms again, while I on the other hand, can't wait to go back on another 'trip'.</p>",
 "year": "2002",
 "id": "17692",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-27T07:00:00.000Z",
 "views": "2583",
 "dose": {}
}
