{
 "title": "Nothing Impressive",
 "author": "PhilG1",
 "citation": " PhilG1. \"Nothing Impressive: experience with Desmanthus illinoensis & Syrian Rue (ID 1770)\". Erowid.org. Jun 12, 2000. erowid.org/exp/1770",
 "substance": "Desmanthus illinoensis & Syrian Rue",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "3.5 g",
  "oral",
  "Syrian Rue",
  "(seeds)",
  "",
  "2 oz",
  "oral",
  "Desmanthus illinoensis",
  "(roots)"
 ],
 "report": "<p>Last weekend, a friend experimented with a Desmanthus/Syrian Rue potion. Quantities and procedures were taken from Ott's Ayahuasca Analogues:</p><p>2 oz. Desmanthus roots (chopped up, but pretty chunky) 3-4 gm Syrian Rue, ground in a mortar and pestle.</p><p>The materials were extracted 3 times with 1/3 lemon juice : 2/3 water. The last extraction was simmered 5 min, the first 2 just brought to a boil, then strained. Yield was about 1/2 liter. It tasted wierd, but wasn't that hard to get down.</p><p>Some effect noted after about 40 min.</p><p>1 hour, a definite 'stoned' feeling. Some slight nausea (which continued on and off all night), but it wasn't too uncomfortable, and was easy to ignore.</p><p>1 1/2 hours, my friend realized he was having trouble keeping his eyes open. He felt very relaxed, and would have described his feeling as 'euphoric', except he was so sleepy. There were no obvious psychedelic effects.</p><p>2 hours (= 1:00 AM), he was drifting into a reverie, and decided to lie down.He noticed some patterns with eyes closed, but nothing impressive.</p><p>He didn't sleep soundly, but rather faded in and out of dreamland. It was very comfortable. He awoke with a hangover, and would have liked to drowse in bed , but his 4 year old daughter wouldn't let him.</p><p>The worst part of the hangover went away in about an hour, leaving my friend tired, but in very good spirits. According to Ott, these amounts should give a threshold DMT dose, with a very mild effect from the harmala alkoloids. My friend felt like the effect of the Syrian Rue, which was pretty strong, accounted for most or all of the trip. In fact it pretty much matched Ott's description of 15 gm of Syrian Rue, with no DMT.</p><p>My friend wonders if he has a low tolerence to harmala alkaloids, or if his seeds(obtained from L.E.R.) were unusually strong. He is considering making an extract of the seeds next time, and smoking it, a la Gracie and Zarkov, so he can accurately measure out a dose without getting so stoned on the stuff.</p><p>My friend also wonders about the Desmanthus. The roots ( obtained from OTJ ) might be week. On the other hand, the extraction process might not be all that efficent, especially due to the chunky-ness of the material.Next time he will try to grind, blend or otherwise pulverize it to allow for better extraction.</p>",
 "year": "",
 "id": "1770",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-12T07:00:00.000Z",
 "views": "38084",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  },
  "1": {
   "time": "",
   "amount": "2 oz",
   "administration": "oral",
   "substance": "Desmanthus illinoensis",
   "form": "(roots)"
  }
 }
}
