{
 "id": 17704,
 "title": "Happy 4/20",
 "date": {
  "submission": "2012-04-20T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shadi",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "repeated",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "dried"
  }
 ],
 "report": [
  "My first hit of marijuana ever was when I was 14. I didn't feel much of anything except for the fact I was a little giggly.",
  "My next experience with pot was when I was 15. I'd smoke it every now and then depending on who I was hanging out with. I'd feel slight effects like feeling blood run through my veins or seeing real objects as something completely different.",
  "But it wasn't till my first 4/20 that I was truly introduced to the wonders of weed. It was April 20th and nearly everyone was celebrating it. I drove my boyfriend, at the time, and his friend out of the city limits to the top of a hill in the country. I was still 15 and didn't even have a learner's permit yet so it was pretty risky. There, my boyfriend rolled a nice fat blunt for us to smoke.",
  "Now one thing you should know, I hadn't smoked in about 3 months for school purposes, so I was extremely excited.",
  "We all got out of the car and passed it among each other. After my first hit I said, 'I haven't done that in 3 long months.' My boyfriend said 'then go ahead and hit it some more. We've got plenty more.'",
  "So I did as he said and kept the whole blunt to myself basically. I took a few small hits. Then a few big hits. I sat there by a bush smoking it and watching the two guys chillin there in front of me.",
  "I don't really know how much time passed before I started noticing some incredible things. I remember looking at the bush and then looking over at my car. It was as if my vision lagged or something. It was like watching a slideshow. It was simply amazing. I got up to walk and couldn't really tell if my feet were touching the ground or not because my legs felt light. Like a feather.",
  "I managed to walk over to the guys and I handed one of them the blunt and told them they could have some turns. My boyfriend's friend said, 'Damn look at her eyes! They're fuckin red!' I turned to look at my boyfriend and he laughed and said 'Baby are you stoned?'. I laughed and nodded. This made them laugh like crazy. My boyfriend told me he'd drive back to town since I probably wasn't able to. I agreed and after a while we all piled into my car. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "The CD player blasted one of my heavy metal CDs as we took off. It was so loud that it made me laugh again. The music sounded like it never had before. I could hear every instrument and the base echoed for a longer time than it should have.",
  "As we drove down the hill back into the city, I could see my boyfriend from the corner of my eye. But it wasn't him. What I saw kind of disturbed me in a way. It was him driving, but as a cartoon or something pretty close. I didn't want to look at him directly so I kept looking from the corner of my eye. This cartoon like hallucination tripped me out like crazy.",
  "Once we got back into the city limits he said, 'Wasn't that fast?' I turned to look at him, directly, and he looked normal. I started laughing.",
  "I don't really remember driving through town but I do remember going to Sonic. There we saw his mom who came up to the window to talk to him. I didn't really want her to know I was stoned so I looked the other way. But when she said hi to me, I had to turn and say hi. I tried to do it as quickly as possible although I guess she still noticed because she asked my boyfriend if he had gotten me high and he laughed and said yeah. She scolded him for it then left. I turned to him and laughed and he said, 'Baby you are so fuckin high.'",
  "It was getting late and I had to be home. So my boyfriend drove to his house where he and his friend would stay. I was afraid about driving home but I knew I had to. I didn't live too far but I still felt nervous. I kept thinking I saw cats in the road. Then it got to where I thought I saw babies. I was scaring myself pretty bad.",
  "I finally got home and went straight to my room. I looked at myself in the mirror. My reflection looked distored. My skin tone seemed gray and my eyes really were bloodshot. I decided to lay down. I pulled my blankets and covers over me. The softness of it all felt so fantastic on my skin. I rubbed my leg up and down and laughed to myself about the incredible feeling. As I closed my eyes I began seeing visuals. I kept thinking something was trying to get in my room and began feeling extremely paranoid. Around that time I fell asleep.",
  "Though some points of that day were scary, it was overall an amazing high."
 ],
 "erowid": {
  "id": "66166",
  "citation": " Shadi. \"Happy 4/20: experience with Cannabis (ID 66166)\". Erowid.org. Apr 20, 2012. erowid.org/exp/66166",
  "substance": "Cannabis",
  "views": "1384"
 }
}
