{
 "title": "Incredible Stuff",
 "author": "Dave",
 "citation": " Dave. \"Incredible Stuff: experience with H. B. Woodrose (ID 17711)\". Erowid.org. Sep 25, 2002. erowid.org/exp/17711",
 "substance": "H. B. Woodrose",
 "bodyweight": "165 lb",
 "report": "<p>After much research, I decided to try Hawaiian baby woodrose.  I bought some seeds off the internet and decided to take a dose of 8 seeds.  I crushed the seeds with a hammer and put the powdery substance in a cup of orange juice.  After I got off work, (about 5 hours later) it was time to test my concoction.</p><p>I drank the oj and then put the chunky stuff in my mouth and held it there for a few minutes and then swallowed.  The following is a description of my experience:</p><p>-30 minutes:  took a dramamine</p><p>0 minutes:  drank the stuff</p><p>30 minutes:  I felt a little weird while sitting at the computer.  Im thinking its just the placebo effect or just the dramamine.</p><p>45 minutes:  I drive to the store to get some cigarettes.  I had quit smoking but I considered this night special.  Still feel weird, kinda like a mild mary jane buzz.</p><p>1 hour:  I drive to a nice spot to listen to some techno.  I sounds nice, better than usual, although i feel a little sick.  Not really sick on my stomach but just like laying down.</p><p>1 hour 30 minutes:  Come back home.  Im starting to feel good.  I get some food because I'm starving.</p><p>2 hours:  That food was awesome, like food when you have the munchies.  Improved taste sensation.  My whole body feels good, like I was on MDMA, although i have never tried the stuff, but I have a feeling this is how it feels.  Im tingling all over and I love sitting on this leather couch.</p><p>2 hours 30 minutes:  I cant stop smiling and giggling.  Seinfield is halarious although I dont really remember what it was about.  I feel fantastic.  My dad shows me a black widow spider that he caught when it was in our poolhouse (these things are highly poisonous) and I cant stop laughing trying to say 'man thats scary.  I'm so happy bc i feel like I really scored with this HBWR.</p><p>3 hours:  I smoke a cigarette and can hardly stand up.  I cant finish it and a feeling of dread comes over me, thinking that i shouldnt have taken this stuff.  I lay down for a minute and it passes.  When I open my eyes Im starting to notice weird shapes and some very mild hallucinations with eyes closed and opened.</p><p>4 hours:  After a walk outside with my dog, I start to have a revelation.  I feel like Im in control of everything.  I realize that I am in fact control of my life and I need to do something about it.  I think about all the people I love and all the good times, and realize that I am happy and I like myself.  I had been mildly depressed before this experience due to relationship problems.  I'm wishing that my best friend could be here with me, but i couldnt wait two more days to try this stuff!</p><p>5 hours:  I get some chocolate chip mint ice cream and it is absolutely delicious.  I starting to think that this stuff is wearing off, but this was only partially true.  I finish my ice cream while some dark side of the moon is on the headphones.  I look down at the remnants of my ice cream in the bowl, and the little chocolate pieces are moving around and expanding and then shrinking.  Its like the coolest thing Ive ever looked at and i continue to stare for another what seems 30 minutes.</p><p>6 hours:  I try to sleep but am overcome by auditory and visual hallucinations.  they're mild and not very distinct, but i can control them if i try.  Its hard to sleep because I cant seem to get comfortable in my bed.  I finally go to sleep about an hour later and I wake up refreshed the next morning and I feel happy.</p><p>Overall, I'd say this stuff kicks ass.  I dont know if I just got some good seeds.  I had no nausea or bad side effects.  I kind of gained a new outlook on life and I guess thats what the hawaiians originally used it for.  I definitely wouldnt do this every night but Im definitely doing it tomorrow night with some friends this time.  This stuff is incredible!</p>",
 "year": "2002",
 "id": "17711",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-25T07:00:00.000Z",
 "views": "17878",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 }
}
