{
 "title": "Snorting Vomitous Seeds",
 "author": "Stefo",
 "citation": " Stefo. \"Snorting Vomitous Seeds: experience with P. harmala (Syrian Rue) (ID 1772)\". Erowid.org. Jun 12, 2000. erowid.org/exp/1772",
 "substance": "P. harmala (Syrian Rue)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "",
   "1772",
   "Not Specified",
   "",
   "Not Given",
   "Jun 12, 2000",
   "11491",
   " "
  ]
 ],
 "report": "<p>Tried the DMT thing on Friday. Still really recovering. It was a disaster.</p><p>Never, repeat, NEVER eat harmaline. Some people might be able to hack it, but Bear and I were sick as dogs. Its just posion. We might have tripped had we drank the ayuasca goo earlier...</p><p>events: spend 3 hours preparing the stuff. Drink harmaline goo...not so bad. just like very strong coffee. Takes a while to work, so we sat around playing chess, waiting until time to drink the really nasty stuff- ayuasca goo. I felt pretty ill after about 15 minutes and sort of stoned and trippy. I thought I would give it a few minutes to settle before drinking the other, but I just felt worse and worse. I chucked up most of the harmaline and that helped but I really felt shit. I had a nitrousy buzz going, and trip-o-vision of a different sort to acid and mushies was going on, and I just felt really tired and sedated and naseus like after a very heavy drinking session. One really bad part was that some of the vomit went up my sinuses which is worse enough at the best of times, but this vomit was composed of half ground up little seeds which I could feel all though my nose...it burned. I was blowing seeds out of my nose for aboiut 10 minutes. truly a disgusting experience. Finally I got sick of it and snorted water to clear everything out.</p><p>Anyway..I was in no mood to face drinking the other slop as I was sure to have a bad trip, even if I could force down more the goo which supposedly tastes 100 times worse than the harmaline. I just gave up and had a really unpleasant time for about the next 5 hours. Threw up again at some stage. Ugh.</p><p>Bears experience was much the same except he heroically downed his ayahuasca even while feeling sick but vomited it back up again 10 minjtes later before it could have any effect. Christain tried to drink his but was simultanesouly throwing it up and drinking it at the same time and had to give up. He wasn't as sick as me and bear on the harmaline, but he has built up quite a nice aversion to the taste/smell/thought of ayuasca brew that I have built up on mushies, so ....no go. I am definaitely the same about harmaline now...no way I could be induced to try that shit again.</p><p>Theory: harmaline is very toxic. I didn't eat the entire day before except for 6 slices of toast for dinner, and then nothing else the entire day of the supposed trip. The crap was chugged at 6.30pm, so I must have been totally empty of food...It must be the harmaline that makes most people chuck. If we had downed the ayuasca only 5 minutes after the harmaline, then by the time it was time to chuck the harmaline, we may have absorbed enough DMT to have tripped - but it would ahve been a bad trip. Imagine trying to snort vomitous seeds out of your nose while tripping intensely? </p><p>ps. You can stop laughing now, and any 'I told you so`s' will be reacted to with extreme violence...</p>"
}
