{
 "id": 17721,
 "title": "The Love Tree",
 "date": {
  "submission": "2009-08-28T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Indicus Maximus",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.75",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  },
  {
   "time": "4:00",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Yesterday was Monday, September 3, 2007. I believe yesterday was my best psychoactive exprience to date.",
  "I also note this as my most memorable experience so far. Ealier, the week before, I purchased an eighth of Psilocybin Cubensis.",
  "After several days, my counterpart's curiosity grew. She could never really begin to grasp the world that I was about to show her for her early anniversary present. So I picked the most beautiful part of surroundings that I could think of for my love and me. There is a gorgeous forest that is at the west end of town. After finishing my morning chores around the house, I told M she could go ahead and eat her half of the eighth and we set out for the forest.",
  "Roughly ten minutes before we entered the forest, I ingested my half as well. Then, we arrived at our destination in a beautiful part of the forest, nearby a manmade waterfall. We approached a vacant table nearby the lake, that meets with the waterfall. I sat down shortly before I heard my love speak, 'I'm trying to sit down without the ground moving out from underneath me.' She then explained that the grass was moving, and shifting in a much sharper neon green color. I laughed with her because I knew that the drug had taken hold of her. After a little time of small chit-chat and flirting, we hiked up one of the nearby nature trails. It was here that my trip came upon me. I recall when I sat down at the base of a fallen tree, I told her that I was 'almost there'.",
  "Thanks to previous experience, it is much easier tell when the effects are coming on. Unlike the last time though, I noticed I couldn't feel the insides of my body as well, like I did on other times that I've tripped. My body took on its newer, pain-free form. Euphoria kissed me, and my body became all a buzz. It was obvious when I saw the moss in the ground take on a likeness of neon green earthworms, that I knew weren't really earthworms, but seemed to crawl all the same. Then, the beauty set in. It was no longer just the slimy sluggishness of the moss, but the entire forest it",
  "seemed, trees, leaves, flowers, all began to pulsate and breathe, and take on a role more like a human than a simple example of plant life. So as I became one with nature, I felt their pain when I saw the cut/fallen trees. The conversation I had with my girlfriend seemed to last for hours. I had felt like I found a rip in time. Before moving onward, she picked up two leaves that had a beautiful light-white spindly pattern on them that was probably left by a couple of silkworms. All of a sudden, something amazing happened, she acted suprised and told me that the leaf she was holding was touching her. Then, after she told me, I begn to notice the plantlife feel like it was touching me back, or breathing, or dying because we had pulled them from the ground.",
  "Shortly after it didn't really matter how far we were away from other people at the park, the level of acuteness in our senses made it seem like we could hear them as far away as we would travel. Comparing maybe a quarter of a mile's distance to 3/4 of a mile, there seemed to be no loss of sound. My senses were sharp, albeit inebriated. I felt like the happiest/smartest drunk in the forest. We then came upon a fallen tree that took on a form that was very sad. The tree had looked like it was in pain. It didn't have much of a 'face', but it seemed it did have a painful looking frown, more like a human expression of death. The tree was covered with other flourishing plantlife that made me think in my mind that it was a sign of nature moving on, turning the pain of past death into a blessing of new life. Later on the path, we came to a bridge, by this time my girlfriend and I were hysterical with laughter. She decided it would be a good idea to lay down on this small bridge on the forested path, which I found hilarious. I joked with her, half-seriously, 'We must not lay down on the Nature Trail.' In response, she simply laughed saying, 'I don't fucking care, people can walk around.' I hadn't noticed the last time I had done something like this, but this time I noticed that my skin becomes very pale as well in response to the poison. It kind of concerned me, but with previous experience, I already knew that at this level of dosage, I should be just fine. Then, I began to think about my partner's welfare, but i also thought about how I started at this dosage. Still, I would remember to periodically check on her and ask if she felt okay.",
  "Things were great. The next scene we approached was yet another portrait of hapiness. There was a tree that had been carved into by lovers that had walked the trail before. My beauty simply called it, 'The Love Tree'. I found this hilarious as did she. She then exclaimed 'I want to hug the love tree!' I mimicked her 'Hug the love tree!', and with a big laugh I decided I was going to take a picture with my cell phone, which seemed like a good idea, but in my alien frame of mind, the technology proved too sophisticated for me at the time. (In retrospect, it is now Sept. 17th. Just a couple of days ago I found out that I managed to take a small video of it.)",
  "I decided that it was time that we kick up the buzz a little more so I suggested that I trek back to my truck to retrieve a lighter for the bowl of sunshine I was about to light. Unfortunately, no lighter, but I was back at the lake, which looked like a crystaline sea. When I was in my truck I caught myself dazing into the leaves and greenery that led back up to the trail. Without warning, an aural buzzing began to grow louder and louder in my ears until it sounded as if I was surrounded by a group of pissed of grasshoppers. For some odd reason, in response to all the static-like noise, my mouth drooped to an entirely opened stooper, uncontrolably. Then, when I looked away, all was well. I traveled back up the hillside and came into view of my beautifully blissful partner who was then sitting on the trail with a smile, awaiting my return. Following our trip back up into the wilderness we stopped and stared at several of the trees that all appeared to be breathing with life.",
  "After this, we had our first encounter with a sober one. She said hi and explained that she was sorry for sneaking up on us. We exchanged pleasantries letting her know that all was fine, and she was none the wiser of the nirvana that we had tapped into. After this, we somewhat followed her trail further into the path. We came to a clearing that deeply saddened us both. The clearing was covered with recently timbered trees. Among the trees that were stil standing, we found one that had a profund crimson color to it's bark. She suggested that we go look for the lighter again. On the trip back we walked past a family who had let their dog get ahead of them. They said they were sorry, but I didn't have a care in the world and just said it was fine. The father of the group asked me if it was a rough hike. I said yes, and also commented on the length of the trail. We then returned to the truck, which turned into yet another fruitless search for the lighter.",
  "We decided that we should just chill out by the lakeside. At the end of the lake we were on, we sat on a picnic table that had a view of the other lakeside. People aren't really allowed over on the other lakeside, so it was rather overgrown with flowers, weeds, and more greenery. It was beautiful. It looked like they were growing and flourishing upward and outward for our entertainment. It was like they knew how we were feeling, and they were just as happy. I found myself staring down into the lake, following a branch that seemed to descend into a dark green nothing.",
  "Now for some crazy reason, I got the idea to go to R's. R is a good friend of ours, but given the conditions of my non-sobriety, I really shouldn't have gone. Still, I got into my truck with her and off we went. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] The psychadelic music we were listening to set the mood for the entire ride, one of wonder and spirituality. In what seemed to be 2 minutes, we arrived at his house. I was amazed because I had always remembered the ride being at least 20 mins. Still, we arrived safely, amazingly, and told our friend about our amazing day. He laughed in amusement, and we offered him a smoke. He thakfully handed me the lighter and I gradually stepped off of the high-horse I had been riding for what seemed the entire day. Afterward, we took a walk to the local park behind R's house, and then another trip to her house to spend what time we had left romantically before going back home to retrieve my college things and go back. I recommend a psilocybin experience to anyone at least once in their life. There are just so many things that can't even begin to be explained that a person just has to experience for themselves, when they are ready."
 ],
 "erowid": {
  "id": "66260",
  "citation": " Indicus Maximus. \"The Love Tree: experience with Mushrooms - P. Cubensis (ID 66260)\". Erowid.org. Aug 28, 2009. erowid.org/exp/66260",
  "substance": "Mushrooms - P. Cubensis",
  "views": "2417"
 }
}
