{
 "title": "Not A Substitute",
 "author": "Chicken",
 "citation": " Chicken. \"Not A Substitute: experience with 4-Methylaminorex (ID 17720)\". Erowid.org. Sep 25, 2002. erowid.org/exp/17720",
 "substance": "4-Methylaminorex",
 "bodyweight": "200 lb",
 "report": [
  "<p>I was only able to try 4-MAR once, and obtained from a sysntesis 1.5g of product, yields were much lower then expected.",
  "4-MAR when compared to methamphetamine, in tolerant daily methamphetamine users, took away the desire to use meth during the duration of it's use.  The clarity of thought achieved was of a more ordered, less manic nature.  I find meth makes people very manic in addition to its other psycological activity, this was not felt.   The motivational get up an go part of meth is also absent.  Now what 4-mar does do better then meth is provide a euphoric body sensation.  4-MAR makes you feel very comfortable in the situation you are in, but not the feeling like meth gives you where you are in the supermarket, and you feel so at home that you could just sit on the floor, and it would be fine, a comfortable feeling like MDMA, but without the social lubrication.",
  "The 1g was consumed over 2 days with a grou of 4, so no long term sleep deprivation with 4-mar psycology is available; however, due to 4-MAR's non-manic, non-motivational nature it is more suited to a study group, or an interaction among friends, an exchange of ideas.  It is not suited to tweaking on projects, or going out and about to accomlish something, that you normally wouldn't be compelled to do.  In such 4-mar does not seem like much of a daily use drug, as meth does.  Meth also has the ability to allow you to change patterns in your life directly just by thinking about them and acting on the idea; whereas, 4-mar seems like more of a strait, very clairvoyent, stimulant, it lacks some of the special characteristics that makes meth such an interesting chemical.  4-MAR may also have these enduring characteristics with daily use, but it has never been tested that way.",
  "If I had all the chems to do a meth or a 4-mar synth I would choose to do the meth synth every time for personal use.  Although it was of great interest to me to try 4-MAR, it is not a drug I would put at the top of a psychonauts to do list, but if you have a pretty full resume then why not.  Personally I put meth in a daily use category seperate from other drugs, so I may not be the best source of information regarding a 4-mar/meth comparison, but I have experienced MANY differnt chemicals, and in the stimulant class, without hallucinations, or an entheogenic experience the 4-MAR is the way to go.   As far as a meth substitute, nope.  It really shouldn't be veiwed as a meth sub, it is a differnt chemical, which is also a stimulant, but it sure isn't meth.</p>"
 ],
 "year": "2002",
 "id": "17720",
 "gender": "Male",
 "views": "21578",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "4-Methylaminorex"
  }
 ],
 "submissionDate": "2002-09-25T07:00:00.000Z"
}
