{
 "title": "Trial Run",
 "author": "Matt Himself",
 "citation": " Matt Himself. \"Trial Run: experience with 5-MeO-DMT (ID 17740)\". Erowid.org. Sep 26, 2002. erowid.org/exp/17740",
 "substance": "5-MeO-DMT",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  "2.0 mg",
  "smoked",
  "5-MeO-DMT",
  "(freebase)"
 ],
 "report": "<p>Experience - First time</p><p>Setting - my bedroom</p><p>I had just recently gotten some 5-MeO-DMT. It has been a psychedelic I've been interested in for some time. However the effects really intimidate me. From what I had heard and read in reports it seems to be a very frightening experience. After receiving this chemical, I felt even more anxious about trying it.</p><p>I decide the best course of action would be to try a very low dose and work my way up. I would rather get a feel for things rather than have them come full blast and scare me away from it. I carefully weighed out 2-3mg. I put it on a piece of tin foil with a straw right above it. I then held a lighter underneath the foil and sucked down the vapor.</p><p>2:20PM - The vapor goes down into my lungs. It doesnt burn nearly as bad as I had been told. It also isn't too foul of a taste.</p><p>2:20.20 - I already feel the effects. I predicted at this dose I would possibly feel I had a chemical in me, but this is more than that.</p><p>2:20.30 - I hear a bell sound. I then realize it is not a bell, but my heart beat. It has seemed to increase tremendously. But rather than a thump, it is a ringing. There is a strong body feeling now. It almost feels as though I'm shedding my skin. I feel as though I being wiped clean.</p><p>2:21 - The effects increase. My head feels like it is expanded and then contracting at a fast rate, almost like a balloon being filled and then released. Mental effects are not present though.</p><p>2:22 - Effects continue. It feels like I have been like this for ages, but the clock says 2 minutes. I look back and forth. Everything looks normal except it seems to move towards me and away along with the contractions of my head.</p><p>2:23 - Effects are tapering. This lasted shorter than I had expected. I was thinking it would go for 5-10 minutes. But I assume this was due to my low dose. The bell sound of my heart persists but the feeling in my head is fading now.</p><p>2:25 - Main effects have left but I still feel different. I feel VERY large as I walk around my house. I feel like I do not fit. My hands also feel very far from my body. Sounds seem a bit distorted as well.</p><p>2:45 - I feel completely normal.</p><p>-------------------------------</p><p>I was rather shocked by how I felt off such a low dose. I had been told I should try 6mg my first time. I am glad I picked 2mg though. The effects were strong, but not necessarily intense. On the net, it says that a threshold dose is 1-2mg smoked. I definitely experienced more than what I would consider threshold effects. Im writing this a little before 3PM. I have been feeling sober for roughly 15 minutes now.</p><p>I wonder why this was so much for such a low dose. Perhaps I am just very sensitive to 5-MeO-DMT. Regardless, I am very glad I started small.</p><p>I think some more trials are definitely in order with this bizarre chemical.</p>",
 "year": "2002",
 "id": "17740",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-26T07:00:00.000Z",
 "views": "16209",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(freebase)"
  }
 }
}
