{
 "id": 17741,
 "title": "Shamanic Creek",
 "date": {
  "submission": "2008-09-05T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "HW",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "cig.",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "OK, Ill admit it right off the bat.  It all transpired while I was soaring skyward on the wings of a plump gold Columbian megajoint.  Ill let the reader determine how much was my expanded state, and how much was influenced by the setting.",
  "You see, I smoked the thing right down to the nub while sitting at dusk by a creek not far from where I live.  This is no ordinary creek, however.  An officious plaque posted nearby informed me that Indians had sanctified this site as ceremonial for millennia - of course, until the white man stole their land and used the creek to power a flour mill in the late 1700s.  Indeed, the Native Americans who had inhabited this area revered this roiling stretch of water which cascades down several hundred feet over a series of step-like falls, snaking to and fro with frantic abandon.  Yes, you could definitely sniff a hint of shamanic energy here!",
  "I let my mind completely relax while the marijuana took hold.  The color of the frothing water became darker and richer with the quickening night as the unbroken electric blue sky above the creeks frenzy darkened to lapus lazuli. I tried to imagine what one of these long abandoned ceremonies would have been like - a medicine man solemnly wafting a sage brush to and fro, its otherworldly odor christening the atmosphere, skilled drummers maintaining a hypnotic beat on special drums, a steady, mysterious rhythm cleansing psychic static from the atmosphere.  I envisioned reverent and open people sitting in eager anticipation of the Transcendent. My senses opened along with these imaginings.",
  "I let my eyes slacken and loose themselves in the rushing water.  The interplay of the brown and orangy hues in the churning liquid began to intensify before my flaccid mind.  Now there were reds and greens and golds, and these were brightening, ever spawning more color.  Suddenly my ears discerned a voice in the stream, it was as if each wet molecule was communicating with every other and all was definitely conversation.  Before I could possibly notice, my consciousness had gone right over the cliff!  Myriad millions of beings conversed simultaneously, speaking in tongues beyond any mortal orb.  Colors in the water bifurcated and intensified in flavor with disorienting rapidity.  More hues and sounds than my receptive faculties could begin to take in blossomed relentlessly.  Colors no man could ever name flashed from nowhere, than never were, babblings from millions of universes overwhelmed my ears in yet a fathomless silence. ",
  "I had entered a realm indifferent to time and space, and all was relentlessly dividing and multiplying, ever exponentiating and energizing beyond capacity of any sense of measure.  I was swallowed within and yet I paradoxically felt encompassed, and any sense of possessing self was rapidly breaking down in this akashic digestive juice.  To attempt to cling to even a sparkle of thought was ridiculous.  My poor, overwhelmed, unenlightened little heart simply couldnt withstand this onslaught!  It exploded, of course, in anguished panic, a pitiful cry searing into this cosmic miasma. The transcendent energy system, obviously offended at such an insipid response to its powers, effortlessly intercepted my miniscule ego pain, transmuted it and hurled it, radiating the fever back to its source, shimmering right back into me, mirror like.",
  "It was impossible now to do anything but surrender wholly, and even that choice came without any volition on my part.  The universe, however, does provide its mercies!  My surrender was the Key that engendered a blessed catharsis which washed through my soul, dissolving every agony of terror, anguish, and powerlessness and flushing it all away.  Fear had transmuted to power.  I was now engulfed in a wholly unfamiliar experience of majesty and nobility.  The drama of my stupid life expanded before my fresh eyes and I knew clearly, for the first time, my complete responsibility for its authorship.  I felt fresh doors open to every possibility, every dream, every endeavor, all new fruit.  My own power had taken full command, and it felt marvelous to relax into that. ",
  "The Kingdom of Heaven truly is within.   My soul soared with joy in its realization that my neurotic ego-clinging is, in fact, an absurd refusal to acknowledge my own godship.  I broke down completely and humbly thanked our Creator with tears and sobs, for I indeed had been made a King.  I blessed the Native Americans who had long vanished from this marvelous place, and I paid homage to very energy that still saturates this spot with unselfish Wisdom.  And, oh yes, I heartfully thanked my lifelong mistress Mary Jane for providing the alchemic key that opened that door!  She always ushers me into realms so antithetical to our insipid work-a-day, nine to five, shopping mall existence.  She shows me a magical life that outshines anything our philistine culture could possibly provide, and makes the universe sparkle with a sheen that no glittering jewel could hold a candle to.  But Im willing to bet you already know that!"
 ],
 "erowid": {
  "id": "66337",
  "citation": " HW. \"Shamanic Creek: experience with Cannabis (ID 66337)\". Erowid.org. Sep 5, 2008. erowid.org/exp/66337",
  "substance": "Cannabis",
  "views": "12807"
 }
}
