{
 "id": 17744,
 "title": "Anxiety Reducing Mixture",
 "date": {
  "submission": "2009-09-29T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ADayInForever",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1000"
   },
   "substance": "Smarts",
   "specific": "Phenibut"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100"
   },
   "substance": "Theanine"
  },
  {
   "time": "0",
   "amount": {
    "unit": "glasses",
    "quantity": "3"
   },
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "I have  for quite a while had a problem with anxiety. Namely social anxiety. I have realized that the most logical cause of this is GABA deficiency. I have a history of using Xanax considering it is the only thing that wipes out the anxiety for me. Even alcohol has only had minimum effects.",
  "So being no longer able to find Xanax I searched for a more accessible substitute. I have found many reports praising Phenibut as being a great supplement for anxiety so I tried it. By it's self it does very little for me. I used as much as 2000 mg at a time with no noticeable results. I tried taking it with Theanine, the amino acid found in Tea, and it helped some but not enough.",
  "Then I mixed it with alcohol without even thinking about it because the Phenibut wasn't all that noticeable in the first place. I generally have a moderate tolerance for alcohol. It takes about 4 beers for me to get a buzz and 7 to get drunk. But after taking Phenibut and Theanine and drinking just one beer I felt a nice buzz like I had already had 3 beers. I drank 3 beers and I felt drunk. But not just drunk, relaxed, calm, talkative and euphoric, all feelings I don't normally get even with alcohol. And I still felt a relative amount of awareness and concentration unlike with just alcohol. It felt as good as a 2mg bar of Xanax. So in conclusion Phenibut by itself does very little (in my opinion) but mixed with alcohol it produces a feeling that I rarely get and a feeling comparable to my favorite drug, Xanax."
 ],
 "erowid": {
  "id": "66344",
  "citation": " ADayInForever. \"Anxiety Reducing Mixture: experience with Phenibut, Theanine & Alcohol (ID 66344)\". Erowid.org. Sep 29, 2009. erowid.org/exp/66344",
  "substance": "Phenibut, Theanine & Alcohol",
  "views": "22838"
 }
}
