{
 "id": 1774,
 "title": "Stinky Tea, and Yellow Mountains",
 "date": {
  "submission": "2007-06-01T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "C.snap",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I awoke to the bright morning sunrays punching thru the glass in the room I was in, and filling it with a choking, stifling heat.  My throat had been dry for hours and it was way too early to be awake for such a special day.  It was a saturday in Waianae on the Hawaiian island of Oahu, and I and my trip buddy had only one thing on our minds this morning.... Shrooms!!  I was sleeping over at my cousin's house, let's call him jeb, and we had a good 7 grams of p.cubensis shrooms (coarsely chopped) to make a tea out of, and a bunch of herb to help us enjoy the mushrooms even more. ",
  "So back to the story, after my first waking at 10:00am to the baking hot atmosphere, I relocated to a cooler room of the house (jeb's parent's were out of town,) and got myself the rest I required.  We were both up at 12:00, moving around the house preparing things as we thought necessary, trying to make the house as comfortable and clutter/worry free as possible. ",
  "At around 1:30 we began with boiling 2 1/2 cups of water.  In with all 7 g's, a squeeze of fresh orange juice, and some miscellaneous tea we found in jeb's cabinet.  We boiled it for about 5 min's, and then let the mushrooms steep in the hot water for another 10.  During boiling, the dark brew fumed horrible smells, filling jeb's kitchen with a non-fungus-like smell, it was more akin to vomit and rotten oranges.  I felt like the unluckiest kid in the world, during the boiling process, knowing that I would soon be gulping down this liquid that causes the gag reflex just with it's aroma.",
  "When it was all done we had 3 cups of tea, 2 from the first boiling and a third from the second time I did it to make sure all the chem's were extracted.  At first sip it was kind of pleasant, reminding me of a tasty mushroom broth I get at a favorite restaurant of mine, but as the sips got bigger and the gunk on the bottom of the cup got closer to my tongue it all went horribly wrong.  I gagged and frowned, and made whatever kind of stupid face I could muster during the drinking of the second half of the cup, and thankfully finished as jeb placed his 1/4 full cup of tea in the fridge to save for later.  I was comfortable with the way I felt just from the initial buzz in the first 10 min's, so I saved the less potent 3rd cup for later too.",
  "I did one last run through my mind to make sure everything was in the right place, that I was comfortable with myself, that I knew why I chose to travel with the little shrooms today, and that I was happy.  Check, check, check, check.  All things accounted for, and ready for the journey to begin, I finally noticed a change at the 40 minute mark.  Having tripped many times before -mainly on shrooms and a couple times on acid- I could tell that it was the start of something heavy, and I relished in that knowledge.",
  "Jeb lounged on the couch while I zipped across the room, letting the energies around/in me push and pull me in whatever direction felt natural.  He looked pretty casual, while I looked like how I remember myself during the glory period of my ecstasy use, those many fun nights I spent at my sister's appartment floating across the floor feeling happy and light as a cloud.  Upon finding that I could experience similar and so many other much better feelings while tripping, I smartly quit my X use, and for the past few months have only been shrooming when the need for something beyond herb surfaces. ",
  "So as I was saying similar to X, mushrooms make me feel warm and happy, expressive and open, appreciative of life, a perma-smile is unavoidable, and unlike X, they make me feel so much more connected with everything, and they give me a huge sense of belonging and seem to offer an explanation and deeper meaning to thoughts that normally wouldn't be given light.  I enjoyed all of these feelings as I watched 2 candelabras slide around on the wall in comforting circular patterns, and the white carpet turn into a virtual zoo of living thread, and what seemed like alien life forms. ",
  "At first the open-eye visual patterns were held a little too tightly together, worrying me again about wether or not I had gotten enough psilocybin into my body, but as time came closer to the 1hr and 45min mark, they spread out and became constant and more interesting to view.  Jeb always has the upper hand during these journeys, since he is much more affected by shrooms and acid than most people.  I am in constant envy of his reports of seeing a whole room turn the color of a cartoon he was watching on tv, or catching crazy beams of colored light flying out of the most unexpected palces.  My closed eye-visuals are absolutley spectacular, and very satisfying as they are created by me, but I've never had a serious o.e.v or even seen trails. ",
  "After smoking a large J that jeb so masterfully rolled, we walked outside to his backyard which was very nicely landscaped.  Well trimmed grass looking green and healthy and beautiful, surrounded by an assortment of colorful indigenous plants, the sprinkler system was on, covering us with fine cool mist, and his two fully grown boxer dogs danced around our legs in a 'please pet me' frenzy.  There was no speech or sound that I could use to express how unbelievably lovely the world looked and felt at that moment, but I sure as hell could stand there and just enjoy it. ",
  "I've always hated being in public while tripping, and just being in view of the neighbors during such a peak point of the trip was starting to bother me.  I always know that I look weird while on shrooms, and I could just imagine what they thought of us two, sitting there on his patio looking at the things in his yard as though seeing them for the first time ever.  I ignored the feeling and it gradually went away as I allowed myself to be more and more amazed at the beauty of nature. ",
  "In the main line of my vision I could see a short mountain covered in dry yellow/brown grass, the outrageously blue sky above it, and then jeb's green yard below it.  The combination of the colors all stacked ontop of eachother, blew my mind for no reason other than that they seemed to belong in that order.  The mountain looked so cool when seen through shroomed eyes, it was covered in all possible places by dry dead grass giving it a bright straw colored look, and bringing to light the beauty that can be found in everything, alive and dead.  The colorful plants around the yard were very pleasing to look at, and seemed to me to be taken straight out of a jungle on jupiter. ",
  "Back in the house, jeb popped in a tape he recorded of funny and cool things for us to watch.  It began with the last 5 mins of a documentary on Jimi Hendrix, and it was the part about him dying which made me pretty sad, but was somehow fitting to see on shrooms.  Try to remind yourself that death only leads to rebirth, and you can escape such feelings of sadness.  Following the Hendrix thing, was a few episodes of Ed, Edd, and Eddy which is quite probably the best cartoon to watch while tripping.  The artist's choice of pastel colors blends in very well with the way colors look while tripping, and there are lots of funny things in it that I dont pick up on while sober.",
  "After the 3rd episode the video made a rough cut to wrestling.  And who was on the screen?  Rick Flair, the worst, and funniest wrestler to watch get beat up.  I do not watch wrestling at all nowadays (I'm 19) but as a kid I remember how wacky his character was, and watching hime have the piss kicked out of him during the mushroom trip was so funny that I couldn't even watch it after awhile.  Me and jeb, were pitched over on our sides laughing louder and harder than anyone should be allowed to, for a good 15 mins straight, unable to integrate what we saw occuring on the picture-box.  He begged for mercy, and just got slapped into a stupor, and then the ultimate funny part came as he stood on the outside of the ropes, and got drop kicked so hard that he did a backflip off of the ring and broke some tables with his fall.  It was toooooooo funny, and we literally could not watch it because laughing at it was too painful.",
  "I lost the rest of the trip after this, swallowed up in herb smoke and unhealthy splurge-like food eating, and a little video game playing.  I connected a lot of valuable thoughts during the trip, examined my face in the mirror and thought it looked old and timeless.  It was like gazing into eternity, giving me a feeling that I have been through a decent amount of lives thus far, and kind of creeping me out too.  Also had lots of intense closed-eye visuals consisting of colors washing over everything in my mind's eye in tune with the music we listened to.  The music was an important factor too, and I think it was very beneficial to mine and jeb's trip.  Mostly reggae and dub, a little bit of wu-tang, and a fair amount of 60's classics and masterpieces."
 ],
 "erowid": {
  "id": "15745",
  "citation": " C.snap. \"Stinky Tea, and Yellow Mountains: experience with Mushrooms - P. cubensis & Cannabis (ID 15745)\". Erowid.org. Jun 1, 2007. erowid.org/exp/15745",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "3833"
 }
}
