{
 "id": 17745,
 "title": "Surprisingly  Potent",
 "date": {
  "submission": "2008-04-11T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Acerbus",
  "gender": "Male",
  "weight": 53
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Kava",
   "form": "extract"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mandrake",
   "form": "extract"
  }
 ],
 "report": [
  "A few weeks ago I discovered a bottle of what I thought was nutmeg extract that I made at home, so I poured this bottle out into a dish to let the alcohol evaporate. Around this time i had been experimenting with kava and found it quite to my liking. So I emptied the remainder of my Kava extract bottle (about 12ml) into a different dish and waited a few days for each to evaporate off.",
  "When they both were free of alcohol and just the oily residue was left, I gave the dish of kava 3 good long licks, just enough to coat the top of my tounge each time. Then I gave the 'nutmeg' residue a lick just like the kava. To my surprise it did NOT taste like my favorite spice. It tasted like a mix between dirt and some other familiar herb.. Though I couldnt identify it. I Licked it once more and then got the idea to compare it to the herb it reminded me of most...Mandrake. So i placed a minute amount of mandrake root on my tounge and then licked my residue once more. No doubt about it, I was licking Mandrake extract. So I stopped licking everything and continues with my normal daily activities.",
  "About 40 minutes later, I was too exhausted to stand so I sat, and then had to lay down. While on my bed, the room started spinning. I started to hear a ring in my ears and I became very very warm. I felt like I was in a trance, just laying there. Until shadows started darting around my ceiling and manifesting themselves into dozens of moths at a time!  I swatted at the moths and they disappeared into dust, which glittered green red and a bit of purple as it fell. Where the dust fell on my sheets, the sheets began to BOIL! And then I fell asleep, I awoke 7 hours later to a trashed room with dishes with lickprints on them. Then I remembered it all."
 ],
 "erowid": {
  "id": "66356",
  "citation": " Acerbus. \"Surprisingly  Potent: experience with Mandrake (extract) & Kava (extract) (ID 66356)\". Erowid.org. Apr 11, 2008. erowid.org/exp/66356",
  "substance": "Mandrake (extract) & Kava (extract)",
  "views": "18964"
 }
}
