{
 "title": "One of the Best Xmas Presents Ever",
 "author": "Michael",
 "citation": " Michael. \"One of the Best Xmas Presents Ever: experience with Methamphetamine (Methedrine) (ID 17752)\". Erowid.org. Sep 21, 2005. erowid.org/exp/17752",
 "substance": "Methamphetamine (Methedrine)",
 "bodyweight": "60 kg",
 "header": [
  "DOSE:",
  "20 mg",
  "oral",
  "Methamphetamine",
  "(pill / tablet)"
 ],
 "report": "<p>On Christmas Eve of 1975, as a 14 year old, I visited my grandparent's house with the rest of my family. My uncle, a doctor who had first trained as a pharmacist, no longer lived at home, although his bedroom still remained much as he had left it. While the adults chatted and enjoyed the Xmas cheer, I amused myself rummaging through my Uncle's old room, examining his collection of gory medical texts, his complete human skeleton (imported from Calcutta, according to the label pasted inside the detachable cranium) and a whole human brain, found under his bed, floating in formaldehyde inside a 'tupperware' container.</p><p>The thrill of such trifles soon paled in comparison to the rush of euphoria experienced as I opened his desk, laying eyes on a small brown glass pill bottle labelled 'Methedrine'. I was _stoked_... these were the genuine article--Burroughs Wellcome's 'Tabloid Brand' 5 mg methylamphetamine hydrochloride tablets. The bottle had obviously sat in that desk for more than a decade, probably since the early 1960s when 'Methedrine' was withdrawn from presciption sale and totally prohibited in Australia. Perhaps my Uncle, being a perpetually overweight pharmacist, had used 'Methedrine' as a 'diet-pill' or maybe they were intended as an aid to study during his medical exams...</p><p>Being intensely inquisitive regarding drugs, I'd previously borrowed 'Drugs' by Peter Laurie, from the school library, and I seemed to remember him writing that the average London teenager's Saturday night dose of 'purple hearts' was apparently four tabs or 20 mg dexamphetamine. ('Drinamyl': legendary, extinct heart-shaped purple tablets produced by Smith Kline & French, containing dexamphetamine and amylobarbitone). Therefore, I carefully flipped the black plastic cap from what was now my 'Methedrine' bottle. Removing the cotton-wool plug revealed that the bottle still contained most of the 100 small white pills it had been orginally packed with! Happy with intense exitement, I extracted four tablets and swallowed my first 20 mg dose of 'Methedrine'. A bloody fantastic new experience unfolded for me on that first night. With a grinding jaw, and still powerfully wide-awake, by morning I'd realised that 20mg really had perhaps been too much for a non-tolerant 60 kg teenager like me. While the euphoria was a revelation--I had never felt so bloody great--physical side-effects like jaw grinding and pilo-erection (waves of goose-bumps) with the intensity and duration of the experience made me try a much smaller 5 mg dose the next time.</p><p>I'm glad I was able to experience a 'Methedrine summer' that year... Smaller doses taken an hour before my evening meal would see me taking long summer-night walks, revelling in my mind, in thought, enjoying the thinking through of interesting subjects and philosophies. All the while feeling calm, at ease and happy with the realisation of how wonderful the world and life itself really were! Far from any awareness of side effects, when using these lower doses I had to keep reminding myself that I had in fact taken a drug. I felt so natural and 'un-drugged'.</p><p>Soon I noticed that I needed to increase my dose in order to maintain the same experience. The bottle had contained 95 tablets of which I shared 7 with close friends. The remaining 88 'Methedrine' tabs ended up lasting me forty-five days. All good drugs will run-out sooner or later and the tolerance phenomenum doesn't help. On my last evening of recreational 'Methedrine' I used an 8 tablet (40 mg) dose, which while highly pleasurable, was still less intense than the first 20 mg experience.</p><p>As the effects of this final dose waned, I promised myself that someday I'd experience methylamphetamine again, despite it being a totally prohibited drug and virtually impossible to obtain. In the intervening years I've sampled a wide range of stimulants, including pharmaceutical cocaine, dextro and ethyl amphetamine, fenethylline, methylphenidate, diethylpropion, phentermine, pipradol, pemoline and prolintane and I've tried a number of batches of good quality 'street speed'. I've also experienced a broad range of narcotic analgesics. However, 'Methedrine' does remain my drug-of-choice...</p>",
 "year": "1975",
 "id": "17752",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-09-21T07:00:00.000Z",
 "views": "17711",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Methamphetamine",
   "form": "(pill / tablet)"
  }
 }
}
