{
 "id": 17767,
 "title": "An Evolving Relationship",
 "date": {
  "submission": "2001-05-05T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Treetop",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I received my 2C-T-7 the day before the last two deaths were reported. If I had seen these earlier, I would have never ordered the material. As it stands, I'm glad I ordered when I did.",
  "Having read the reports like everyone else, I expected a visual trip. Aside from a few mushroom journeys, it had been a good decade since my tripping days and I was primed and excited to reintroduce myself to these states. Because of this excitement, my first experience with 2C-T-7 was a major dissapointment. 20mg and another 10mg at T+2:00. Slight visual disturbance, annoying oscillations between hot and cold, no insights, no sense of awe, and a general feeling of irritability. I spent the majority of the trip dwelling an how 'bunk' it felt.",
  "My next experience proved much more fruitful. Having much lower expectations and the goal of understanding my apathy, I took 40mg on an empty stomach. The slow ramp-up (1.5-2hrs) gave me plenty of time to kick myself for trying this stuff again. Had a brief wave of fear thinking about the related deaths, which was quickly dispelled out of necessity, 'not going down this road!' with a smile and feline distraction. T+2.5, I'm in. 'Oooh, I see! This feels goood!'  I curl up in a ball on the rug, rocking back and forth letting warm waves of pleasure pulse thru my body. Friendly. Safe. Similar to E, but different. A taste of acid, but just a taste. Visuals were more pronounced, but their importance seemed irrelevant, just an after-thought in the full, sensuous body of the trip. Cut to the chase...",
  "The crying begins! After a couple of hours enjoying myself, I focus on my goal. 'What was it? Come to terms with something...' I start to weep. I realize how desperately lonely I am. How I push away my friends. How I've fooled myself into believing this is O.K. How I've distracted myself from years of pain. Deep, gut-wrenching sobs, snotty, wonderful tears. It's now that I notice I'm in two seperate and distinct mental states. My 'crying self' realizes it's being watched by my 'observer self' who's grinning ear to ear. 'Don't let me stop you boy! Carry on!'  I'm dissoriented and confused, I shift between these perspectives and can't resolve them into 'me'. I can't express how distinct these 'individuals' were.",
  "Was I so cut off from my true emotions that this is how they have to manifest? I watch this force of 'emotion' in my mind's eye. Wow, emotion is powerful! I realize my 'crying self' has been starving. The 'observer's' yelling 'Go baby, Go!' I finish my first true cry in years under the watchful, caring gaze of myself.",
  "At some point I became 'me' again and laughed, and thought, and laughed, till the wee hours of the morning:)",
  "My third experience with 2C-T-7 was pure fun. 30mg. I knew what to expect, I knew what it could do, and I knew that I liked it.",
  "My verdict on 2C-T-7? You get out what you put in."
 ],
 "erowid": {
  "id": "6646",
  "citation": " Treetop. \"An Evolving Relationship: experience with 2C-T-7 (ID 6646)\". Erowid.org. May 5, 2001. erowid.org/exp/6646",
  "substance": "2C-T-7",
  "views": "10282"
 }
}
