{
 "id": 17760,
 "title": "Sallyworld",
 "date": {
  "submission": "2013-07-12T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Socrates",
  "gender": "Male",
  "weight": 71
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 10x"
  }
 ],
 "report": [
  "Note: Effects were last felt 1 hour before this was written, so I hope that I can explain to experience while it is still fresh...:)",
  "I picked up some 10x Standerdized Salvia Divinorum Extract leaves 3 days ago at a local shop. Today, I got the chance to use it.",
  "I had not smoked the old Sally for about 2 months, and was quite excited to get it again, which I think made my experience as blissful and euphoric as it was. I loaded the ground leaves into a bubler, and picked up the torch lighter, like I had done many times before when I smoked Salvia.",
  "I took a large hit, burning almost all of the plant material, and held it in while inhaling more air for about 20 seconds, as I handed the bubler and lighter to my sitter. As I felt a tug on the right side of my body, I made one last comment to my sober friend.. 'Alright, See you in 5.' I closed my eyes, and laid back in the bed.",
  "This particular experience is extremley hard to explain, but I will do my best.",
  "I felt myself bieng warped into some tunnel, a continuation of that tugging feeling, and Immidiatley I began to laugh the sort of laugh that only Salvia (or DMT) can give you, Loud and as happy and honest as can be. Patterns appeared before me, colors warping and forming into shapes, my family, my sitter, all of these people appeared before me as I hysterically laughed at it all. The rushing feeling did not stop, as the colors all suddenly changed into yellow, and formed these abstract distorted Pacman like entities, which walked one after the other around me in a circle, while I felt as if another Entity had entered this relm.",
  "I immidiatley bonded to this new Entity, and immidiatley felt everything he felt, which luckily for myself, was extreme bliss and happiness.",
  "If we are to imagine that there is a 'membrane' Seperating our world and Salvia world, the above description happened deep in Salvia world. The next paragraph happens with what felt like bieng in between the worlds.",
  "I sit up, still smily and giggly from the trip, and begin talking to my sitter about the trip. Her face is yellow and a distorted pattern seems to still be engulfing her and the rest of my room, as she asks me if I'm ok. I say I have never felt better, and that she should wait until im fully back, so that I can explain to her these marvels. At this point she said somthing about cleaning the bubler so that she can smoke grass out of it later on. The entity I had bonded with found this 'Ignorant mortal comment' To be rediculous, and so, As he laughed, I too laughed at her comment for a good 30 seconds, before telling her its fine, as The entity pulled me back into Salvia world for a few more moments where I was met with a glowing yellow energy that entered my heart, and then I felt the Entity leave me and push me back into reality.",
  "I was now in the Salvia high, a state of Euphoria, floatiness, and some minimal visual 'quirks'. It was as if I was almost entirely through the membrane, yet my foot was still hanging out in the Marvelous world of Salvia.",
  "In reflecting this trip, I grow to appriciate set and setting more and more. I was so excited and happy before the trip, that these feelings carried themselves with me into Salvia relm, and intensified to incredible levels. The yellow energy I felt, and the yellow pacmen I believe were all represantations of my happiness and bliss, which I assume is yellow ( a light, happy color). My last trip on this strength extract (10x) had launched into space, and looking at earth. This just shows the variety and versatility of the types of things you can experience in Salvia world. I did not learn anything, or feel any spiritual breakthrough this time around, because I did not acctually persue one. I wanted this trip to just reaquaint me with this plant, which it did very well.",
  "This Herb is deffintly a powerful one, and should be respected and used responsibly, so that no bad trips occur...as I would hate to imagine what a bad trip of Salvia Intensity would be like (I have luckily only had good trips.)",
  "The sage of seers indeed......"
 ],
 "erowid": {
  "id": "66419",
  "citation": " Socrates. \"Sallyworld: experience with Salvia divinorum (10x extract) (ID 66419)\". Erowid.org. Jul 12, 2013. erowid.org/exp/66419",
  "substance": "Salvia divinorum (10x extract)",
  "views": "505"
 }
}
