{
 "id": 1776,
 "title": "Mulholland Drive Becomes Real",
 "date": {
  "submission": "2006-08-16T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Gigashadow",
  "gender": "Male",
  "weight": "230 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  },
  {
   "time": " T+ 2:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  }
 ],
 "report": [
  "[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I obtained a reasonable amount of 5-meo-dipt one night and I had some free time so I decided to try it for the first time. I had heard about this substance before so I was expecting mild visuals and some really good auditory anomalies such as pitch shifts and hallucinations. It was about 7:30 on a Saturday night when I took my first 25 mg dose in a gelcap.",
  "An hour goes by...I contact my friend to ask him how long it takes to kick in...he said about a half an hour to 2 hours so I wait another hour and a half and decide that I was feeling only slightly off center line so thats when I took my second 25 mg dose in another gelcap. 15 minutes later....uh oh....hyperspace. I started to get some intense auditory hallucinations and started to hear things like they were being spoken in reverse. I thought to my self if this is what one is like...I hope I don't get out of control. About an hour later the second pill kicks in I'm already peaking from the first and the experience just keeps building.",
  "I start seeing some long trails and while watching the stupid box (tv) I start to see strange anomalies in the screen. This is when I decided...I need to buy a movie! Its about midnight by now and the only place open that sells movies is a department store! I was in my boxers for most of this trip and I'm not sure if I ever did but I think I put on some pants and a t-shirt...slowly walked to my car and sat down.",
  "I started my car and Pigfaces a New High in Low came on...how appropriate I thought as I headed for the highway. Now is the time I realized that I might be a little too trippy to be driving but since I was halfway there it seemed logical to keep going. I'm not sure how fast I was going but it seemed as if the 20 minute drive took only five. When I arrived I took a few minutes to compose myself and went into the big blue building. This is when I realized that I was also having some really interesting color shifts in my vision...all of the walls looked slightly purple and wavy as if they were alive and breathing.",
  "I headed for the electronics and DVD section and started to peruse the selection. I was about halfway down the isle when I saw the movie I was destined to see this eve...Mulholland Drive by David Lynch (a very avant garde director). I picked up the DVD with an audible 'yoink' and proceeded to the checkout counter. I made a cartoon noise and slid in front of the cashier and said, 'I would like to purchase this DVD for my home viewing pleasure.' Not realizing how silly that sounded I gave her a very serious look as I paid her and left the store with movie in hand. When I drove home I decided to take a very convoluted long way back so as not to arouse suspicion...from whom, I have no idea.",
  "I arrived at my apartment and stuck the DVD in the player and sat back with some soda and a popcorn bag. Now if you have ever seen this movie you might know that it is literally terrifying at times....especially at the beginning...I was not expecting this. I started to get this creeped out feeling and had to pause the movie...to do what? Go for another ride of course! I did this for every 15 to 20 minutes of the movie...watch some...pause...and go for a ride in my car. The effects of this drug are supposed to wear off in about 4 to 7 hours....after watching 5 movies and making breakfast....I had been tripping for 14 hours!",
  "I couldn't believe what was happening to me! I had gotten so used to tripping that when I finally did come down it felt very strange as if coming down was the beginning of another trip...in the end it actually took me about 24 hours to completely come down from my long strange trip.",
  "I'm not sure if this is a good experience or not but I felt as if I had figured out the 'code' of David Lynch's movies...I probably won't take this large of an amount of 5-meo-dipt again."
 ],
 "erowid": {
  "id": "15749",
  "citation": " Gigashadow. \"Mulholland Drive Becomes Real: experience with 5-MeO-DiPT (ID 15749)\". Erowid.org. Aug 16, 2006. erowid.org/exp/15749",
  "substance": "5-MeO-DiPT",
  "views": "2987"
 }
}
