{
 "id": 17772,
 "title": "Never Once Got Old; Tolerance Raised Quickly",
 "date": {
  "submission": "2007-11-01T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alexander L.",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Pharms - Oxymorphone",
   "form": "daily"
  }
 ],
 "report": [
  "My background with chemicals goes back far. I feel as if I have tried almost everything there is to try in this country. I have created an almost 'Vampric Blood Lust' for Opiates/Opioids.",
  "One day my buddy N. introduced me to a nice woman claiming that she sold just about any type of opioid. I asked for oxycontin, I got oxycontin. I was impressed. I kept buying from her for a few weeks. I went to her house one morning and she welcomes me in. She has a new script. Opana ER 20mg. She apparently didnt know what to sell them for, she asked me to try it out and see how I liked it. Went home after an hour or so of conversation with her. I knew how powerful oxymorphone was, due to research. She gave me two pills for free. I took one, and Insulfated the other. About 3 miniuts, euphoria was rising through my body. After an hour of so after ingestion, full effects were echoing through the emptiness of my mind. I had to tell other people about this shit!",
  "I went back to the good old lady's house to pick up ten more of the tablets, name her price, I dont care. (that good!!)  She ONLY WANTED 10$ per pill!!!... WTF, Am I dreaming, nooo...hell I'll take the whole script. I left her house with 28 20mg Opana ER's. for 280$",
  "I contact my friends J. and C. who are excited as hell to try it for their first time.",
  "Their first experience with it was exactly the same as mine, except they required a much lower dose, aprox. 10mg vs. my 40mg.",
  "For the next week we were all just Laying around dreaming the opium dream and having great conversation. Everyday same thing. Snort oxymorphone, again, again...never once got old. Just tolerance is raised so quickly.",
  "(I've read of people paying 60$ for a single tablet.)",
  "This was all about 3 months ago, I continued to buy them whenever she would get the scrip refilled.... Now I have raised my tolerence to an insanely high level.. I rember the day back in middle school when all it took was 2 10mg hydrocode, now it takes me 80-90mg of oxymorphone? Damn. Long love for opiates, but have somehow managed to stay away from the needle. :)",
  "Even more weird is my ability to not feel much withdrawal at all just tolerance stretch. It is my perfect drug."
 ],
 "erowid": {
  "id": "66468",
  "citation": " Alexander L.. \"Never Once Got Old; Tolerance Raised Quickly: experience with Oxymorphone (ID 66468)\". Erowid.org. Nov 1, 2007. erowid.org/exp/66468",
  "substance": "Oxymorphone",
  "views": "22447"
 }
}
