{
 "title": "We Weren't Meant to Go There",
 "author": "Karadur",
 "citation": " Karadur. \"We Weren't Meant to Go There: experience with Atropa belladonna (ID 1778)\". Erowid.org. Jun 13, 2000. erowid.org/exp/1778",
 "substance": "Atropa belladonna",
 "bodyweight": "",
 "report": "<p>First of all I like to inform all that playing with belladonna is like playing with dynamite. LSD, X, DMT are no comparison to atropine based plants. With most these drugs no matter what you see (I do not call for example LSD a hallucinotory susbstance, it causes severe distortion of sight, sound and mind) you are still aware that the plant or chemical are responsible for the effects. With belladonna the entire concept of reality goes down the drain, the very fabric of reality will break down. you can be sitting down watching t.v. at one moment and next you see your dead grandmother next to you on the sofa asking for more tea. I am not kidding here you will not know what is real and what is not. I personally took a bath with over million insects and did not know that this was not real. You can be contacted by numerous alien entites (remember witches at sabbat using among many other things belladona, visiting satan himself) that either can frighten you to death or make you touch an angel. Now enough scaring you. No, not enough you can easily die and I mean easily.</p><p>I suggest to you to soak the belladona in the rubbing alchohol for a couple of days, and then evaporate the remaining fluid outdoor on the electric grill (alchohol and flame oven or grill do not mix) until you get a gum resin. Start by taking about 0.2 gram of this stuff. Definitely have someone with you, have a number of a hospital with posion center available (do not be afraid belladonna is not illegal).</p><p>Last note even seasoned trippers like Terence McKenna are afraid of where a belladonna trips takes them. As Terrance once told me, the places belladonna takes you, you were not meant to go. </p>",
 "year": "",
 "id": "1778",
 "timestamp": "2000-06-13T07:00:00.000Z",
 "views": "75398",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(extract)"
  }
 ]
}
