{
 "id": 17803,
 "title": "Diamond in the Rough",
 "date": {
  "submission": "2007-12-12T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Soma Psychosis",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Kratom"
  }
 ],
 "report": [
  "I would like to summarize my experiences with a ethnobotanical relatively new to the western world, known as Kratom (Mitragyna speciosa). First off, a little about me: I have experience with all of the familiar psychoactives (from marijuana to heroin) as well as some of the lesser known ones (2c-b, levorphanol, ketamine). I have since stopped all of these and prefer to limit my highs to legal drugs. I am a small guy and would last roughly five minutes in prison.",
  "I first came across this plant late last year and fell in love. It has a distinct opioid-esque quality to it, while retaining an individuality that sets it far apart from other legal 'psychoactives'. The best way to describe the kratom experience to the uninitiated is to start at the beginning.",
  "Halfway through dosing is when I usually begin to notice effects. It starts as a sort of weird warm feeling. I usually sweat and become jittery. After finishing the dose I will slowly climb from there to a point of comfort and relaxation. There is nothing mind altering about it, I can perform any task while on kratom (excluding driving, driving while on anything is retarded and akin to attempted murder).",
  "The first half hour to an hour feels a little like a low dose of hydrocodone or oxycodone mixed with a noticeable stimulation. I usually like to lie down during this stage and read a book or cuddle with my girlfriend. This feeling usually fades in under two hours, and depending on the dose may or may not be the end of the experience. Note: As this stage ends I definitely experience a crash. Although not as severe as a methamphetamine or cocaine/crack comedown, it feels similar but fades rather quickly.",
  "After this stimulation ends a heavy opioid buzz sets in (with higher doses, for me over 4 grams). Here is where I sometimes experience nausea. This can be avoided by lowering the dose. Strangely, I always get a severe case of the munchies at the same time, and eating helps me with this nausea tremendously. This buzz slowly fades, usually leaving me at baseline 6-8 hours after dosing. Note: Different batches seem to vary in duration and slightly in effects, usually not noticeable.",
  "One problem I have found with Kratom is that there is a crash. When I have used opioids in the past I am left satisfied and ready to sleep, with Kratom I always have the urge to continue to experience the high. Redosing works, but is not adviseable as negative effects are more likely to manifest. This brings me to my next point, addiction potential. As with any drug that provides a pleasurable feeling, Kratom can be and is addictive, much more so due to it's apparent activity on the opiate receptors. However, Kratom addiction takes much longer to manifest and I have used it for a week without experiencing any physical withdrawal. With opiates I became sick after a week of heavy use. However, opiates are very insidious and the time it takes to become hooked varies from person to person. After heavy use I experience tension headaches for up to a week after cessation. This may or may not be a form of minor withdrawal.",
  "While the main ingredient in Kratom is accepted as 7-OH-Mitragynine, I feel that like all plants its effects are a cocktail of chemicals present in the leaf. Like marijuana, different batches vary in effects, which I believe is due to differing levels of these chemicals. I also think these chemicals wear off at different speeds and are active at different doses which could account for the changes as the experience progresses or the dose is titrated. The crash could be the comedown from one alkaloid as the others begin to take hold.",
  "With regards to it's use as an opiate alternative in cases of addiction I regret to inform the public that I find it to be a crutch at best. After using opium daily for a month I was forced to stop and was catapulted into a private hell of sweating, panic attacks, fever, crippling despair and suicidal thoughts. While dosing Kratom relieves all of these effects within ten minutes, the relief is very, very short lived. I felt normal for about a half hour and then the symptoms came back, so for it to be effective a patient would have to dose repeatedly for the 5-7 days withdrawal takes place. So basically there is no such thing as a magic bullet for opiate addiction, and don't be foolish enough to assume kratom will save your ass.",
  "I believe that the chemicals present in this plant hold promise for a new family of painkillers. It seems to be much less addictive than classic narcotics, and in my opinion is just as effective for all ailments (sore throat, pain). I sincerely hope that research will be conducted in the future, as it is sad what OxyContin addiction has done to cancer patients and thier families.",
  "Lastly, I want to emphasize that this report applies only to me. I have seen other people use Kratom, and the effects seem to vary from person to person (more or less stimulating, more or less euphoric, more or less inebriating). What we have here is a legal psychoactive which is recreational and effective. Other legal alternatives seem to only be one or the other, too weak (blue lotus, valerian, kava) or so strong they are unpleasant (amanita, salvia), and it would be a tragedy to see this plant penned in with other useful allies like coca, khat, marijuana, and mushrooms as evil. Please be careful, and preserve this diamond in the rough for future generations to enjoy and utilize."
 ],
 "erowid": {
  "id": "66640",
  "citation": " Soma Psychosis. \"Diamond in the Rough: experience with Kratom (ID 66640)\". Erowid.org. Dec 12, 2007. erowid.org/exp/66640",
  "substance": "Kratom",
  "views": "38240"
 }
}
