{
 "id": 17808,
 "title": "Operating on a New Level",
 "date": {
  "submission": "2007-10-30T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fetus54",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": "0",
   "amount": {
    "number": "T+",
    "unit": "0:00"
   },
   "administration": "16 mg",
   "substance": "oral"
  },
  {
   "time": "2C-E",
   "amount": "(capsule)",
   "administration": "T+ 6:00"
  }
 ],
 "report": [
  "I have heard good things about a 2C-E and LSD combo, and seeing as there is not that much information on it I decided that I would try it. I am very glad I did, these substances work together incredibly well together.",
  "I begin by dosing 2 hits followed by a gel cap full of 2C-E containing 16mgs. Within a half hour my pupils were beginning to dilate, and I was beginning to feel the drugs coming on. At this point I left the inside to venture around outside on a walk with friends. Over the next hour or so I walked around with my friends. I was seeing slight trails off of almost any movement, and it seemed like my body was the wrong size. Everything was beautiful. I could not help by look at all the vibrant colors around me. As I was sitting on the grass about two hours after dosing, the most significant part of my trip began.",
  "My experience is almost impossible to put into words. I was tripping at two hours in incredibly hard. Yet it was almost as if I was sober. I was not seeing that much in the way of visuals, but it was as if my brain was operating on almost an entirely new level. I was in this world, all the time, yet I it was as if my mind was operating on a whole new level. Time existed because I wanted it to. It was almost as if I was a God. I sat on the grass and at the same time I was everywhere, everything, everyone. I felt such a great sense of power it was amazing. This power however just was. I felt happy just sitting, still enjoying the beauty around me.",
  "I was able to maintain this state of mind for around another two hours. At this point (around four hours after dosing) I was beginning to become a little less high. I was able to begin to attempt to communicate on a regular level, and I was trying to communicate the experience I was having with the people around me. I left with a few other friends to a coffee shop. I got into a huge debate with a friend. At the time I made perfect sense. Yet I was talking in huge abstractions and things that I said now are very hard to make sense of. All I can describe the state I was in was one of higher functioning. I was able to use and understand any abstract concept or idea. I was still stuck in this state, just not as much as before.",
  "After leaving the coffee shop about a half hour later, I slowly began to return more and more to reality, and my normal state of mind. I ended the night smoking pot and was able to bring my self  back into the state of mind just a little bit. This was about six hours after dosing. I was finally able to fall asleep around 4:30 AM after dosing at 2:00 PM.",
  "Overall this experience was a very hard one to describe. I saw almost no visuals the entire duration of the trip, which is strange because 2C-E and LSD are usually incredibly visual substances for me. I saw slight trails almost the entire trip. But none of the complexing patterning, melting, etc. that I usually see on these two drugs. Yet this is one of the most amazing psychedelic experiences I have ever had in my entire life. The state that my mind was in was an amazing one. I remember feeling like I was in a place mentally that should have taken me years of meditation and self reflection to reach. I definitely wish to try this combo with higher doses. Being completely lost in the state of mind I was would be an even more moving and introspective experience. I was still able to reach deep into my own psyche, and begin to de-construct and analyze the reality we all live in, I felt like I was truly functioning on another level."
 ],
 "erowid": {
  "id": "66656",
  "citation": " Fetus54. \"Operating on a New Level: experience with LSD & 2C-E (ID 66656)\". Erowid.org. Oct 30, 2007. erowid.org/exp/66656",
  "substance": "LSD & 2C-E",
  "views": "8132"
 }
}
