{
 "title": "Weak but Pleasant",
 "author": "Phase",
 "citation": " Phase. \"Weak but Pleasant: experience with San Pedro (ID 1780)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1780",
 "substance": "San Pedro",
 "bodyweight": "",
 "report": "<p>Yesterday I has a San Pedro cactus experience, and I'd just like to type up a quick post for those of you who are wondering about trying San Pedro. A friend of mine ordered 50 dried grams of San Pedro cactus from an online supplier. He boiled it in 6 cups of water for about 3 hours, and when the liquid was brown, murky and extremely bitter-soap tasting, he stopped. He strained out the cactus solids, and divided the remaining liquid into two glasses, and cooled it in the frige untill it was drinkable.</p><p>Due to the extreme bitter taste, he added orange juice to each large glass, but it did little to cover the taste. I am not exagerating when I say it tasted as if i was drinking pure liquid dish-soap.</p><p>We both drank it slowly over about 30 mins, and when i was finished drinking that foul, basic liquid..it felt almost identical as if i had consumed 2 alcoholic drinks. This light intoxication lasted approx. 2 hours, when we both began to feel the mescalines effects come on.</p><p>*There was no sickness or vomiting*</p><p>For the next 10 hours, we had a rather weak, but pleasant mescaline trip. It felt like a very long time to come on, compared with LSD or psilocybin, but it was soon unmistakibly mescaline. The intensity of the experience was weak, roughly comparable to ~40ug of LSD.</p><p>It faded away about 9 hours after the efects were first felt, it completely faded to baseline.</p><p>If i were to to it again, and prepare the cactus myself...I would boil it for at least 6 hours, and i would would drink the solution from all 50 dried grams of cactus...i would not share it with a friend. It's intresting to try once, but not really worth the time, effort and expense compared to more potent and available psychedelics, IMHO.</p>",
 "year": "1994",
 "id": "1780",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-14T07:00:00.000Z",
 "views": "38229",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 g",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(dried)"
  }
 }
}
