{
 "id": 17817,
 "title": "E and Weed=Dissociation?",
 "date": {
  "submission": "2011-01-16T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "KL",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "5:30",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I took ecstacy for the first time at this huge rave in LA. It took a while for me to start feeling something, but I would say the first sign was that I couldn't stop dancing. I normally don't like electronic music, but I didn't mind it at all when I was rolling. I would say I got a body high more pleasant than acid, kind of similar to being really coked up at a club or something (but not nervous or jittery though). Anyway, my body felt amazing as I was moving around.",
  "Some people say that E makes you really emotional and horny, but I didn't really feel too much of that. Maybe it's because I'm not really a romantic person and am more private with my emotions. I did feel more emotionally close to my friends though, but it wasn't anything  too intense like what I was expecting. I definetely feel more 'one' with the world and feel love towards people during the first two or three hours of an acid trip.",
  "Anyway, after about 5 or 6 hours of dancing, my friends and I left and drove back home. We smoked a bowl of some pretty strong weed in the car, and that's when I started tripping balls. It was kind of like acid, but also really different.",
  "First, I started to hallucinate, similar to an acid trip. My friends' faces looked different and from the corner of my eye some stuff looked really unusual (for example, I kept on seeing my friends face looking out the window in the passengers seat when in reality she wasn't even faced towards the window...)  I was starting to get a little nervous, but then I told myself that I am safe. I was looking out the window and I was fascinated my all the streetlights. I couldn't decipher what alot of things around me were, things that I would normally be able to comprehend. Then I started having close eyed visuals, but with bright lights, not intricate patterns. The unusual thing was that as I closed my eyes, I started drifting away from the universe. I couldn't comprehend what my friends were talking about and became really in tune with my mind and body.  Then I started to dissociate, and my mind and body were completely detached from one another.  It was the most bizarre feeling I have ever felt, I can't even explain it, but it was amazing.  It was almost as if my skin was vibrating and slowly drifting away from my body, I couldn't feel my body at all (it's not the same numbness you experience on opiates), but my mind was still functioning.",
  "I then started to think about about all these philosophical connections between body and mind, unfortunetely I forgot what they were. I was able to snap out of it, but I didn't want to because the feeling was so weird and so amazing. Oh yea, I also 'stepped out of myself', meaning that I was able to observe myself from a completely detached point of view, so I would 'watch' myself walk. My perception of depth and space was off, I thought things were closer by than they were and vice versa.",
  "The main difference between this and acid is that on acid, I feel the world around me is surreal, but when I was tripping on e/weed, it was me who was surreal.  When I got home, I brushed my teeth and washed my face, but even then I felt like my mind was totally seperate from my body.",
  "My friends didn't experience this, so I didn't have anyone to talk to later on who could understand what I was going through. I've never tried K, but I imagine it's something similar to what I felt. This experience has definetely gotten me more interested in dissociative drugs."
 ],
 "erowid": {
  "id": "66684",
  "citation": " KL. \"E and Weed=Dissociation?: experience with MDMA (Ecstasy) & Cannabis (ID 66684)\". Erowid.org. Jan 16, 2011. erowid.org/exp/66684",
  "substance": "MDMA (Ecstasy) & Cannabis",
  "views": "4723"
 }
}
