{
 "id": 17829,
 "title": "Still Stinging",
 "date": {
  "submission": "2002-03-19T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Angry Blonde",
  "gender": "Female",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "lines"
   },
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "At 3am in the morning, I write this about my first experience with Methamphetamine. Three days ago, a girlfriend of mine had been able to buy a gram of powdered Meth for $20, so we decided, today would be the day.",
  "Us two hunched over the glass table and our two other friends sitting on the couch next to us in my girlfriend's living room, we were about to snort Meth for the first time. Without even taking a breath, she shoves her clipped straw up her right nostril and snorts the first line. She hops up immediately, laughing and screaming about how much 'it burns'. I hadn't a clue what she meant, but couldn't wait to experience it, so I dove right into my first line as well.",
  "Immediately after sniffing my first line, I felt a burn as if someone was literally sticking a lit match up my nose that ran to my eye, making it water. Then, the back of my head tingles, which spreads to the front and soon my entire face feels hot and tingly.   ",
  "We ended up snorting two lines each. Only a few minutes earlier, I'd been lying on my girlfriend's bed, just about passed out from coming off the weed we'd smoked earlier. But now, my arms  felt as if they were attatched to balloons. I began pacing back and forth in the room, babbling on, 'I can get $40 a week, so that would get me 2 grams and I could get 8 lines for that, and that could last me 4 days a week per week . . .'",
  "Upbeat, energetic and talkative, we walked to the mall and mostly talked. By the end of tonight, my jaw was so sore from chewing the same peice of gum for the entire day so tensly, that I can barely bite down.",
  "I was not paranoid going into the act of snorting the powder, but an incident later tonight happened which would normally have put me into a position of concern. Instead, I was panicking and anxious. That is the only downfall of this drug that I have experienced SO FAR ... I hope I will be able to crawl out of bed tomorow ..."
 ],
 "erowid": {
  "id": "6674",
  "citation": " Angry Blonde. \"Still Stinging: experience with Methamphetamine (ID 6674)\". Erowid.org. Mar 19, 2002. erowid.org/exp/6674",
  "substance": "Methamphetamine",
  "views": "29672"
 }
}
