{
 "title": "2nd Encounter",
 "author": "Trypstar",
 "citation": " Trypstar. \"2nd Encounter: experience with TMA-2 (ID 17840)\". Erowid.org. Sep 30, 2002. erowid.org/exp/17840",
 "substance": "TMA-2",
 "bodyweight": "75 kg",
 "report": "<p>The first time I tried TMA-2, it hadnt left quite that positive impression. It appeared to me as a mild, visually uninteresting and above all, hypnoticing drug. This was an experience at 40mg, about 5 months ago, of which the report can also be found on the net.</p><p>First of all Id like to mention that I have, throughout the years, had my share of heavily intense entheogenic and introspective journeys. TMA-2 didnt seem to be an overwhelming headtrip, so I decided to double the dose to 80mg.</p><p>At 6:15pm (T+0.00h) I took 80mg TMA-2.HCl on a half empty stomach. The last time I took this substance, it took at least one and a half hours to climb up to a plus one, so I decided to eat a little. Not even a half hour into it, I got the first signs of an amphetamine stimulation: muscle tensions, big eyes and pupils and an upcoming yaw clench.</p><p>From this point on things started to really accelerate. It was climbing up to a plus two, my head was really warm and red and at the same time I had the shivers. My sense of taste had greatly diminished, so I decided to stop eating. I went upstairs to take a refreshing shower. A big task, I must say, because by now my visual field seemed to discover all sorts of movement in the shadows, which did make me quite desorientated.</p><p>The shower was great, but uncomparable with for example a shower in the afterglow of a mushroom trip. I felt some dissociation of my body. I dried my body and sensed that things were still climbing fast. I decided to go downstairs and give in.</p><p>It had passed by seven by now (T+0.45h) and I was forced to go downstairs back to front. My knees were knicking from the muscle tension and I was unable to maintain my balance.</p><p>I went to the back of the house and rested on a bed upstairs. Visually things were really, really getting intense now. I started with asian patterns, glowing all over the room. The colors pink and green seemed to be showing up a lot. Ive never had the opportunity to experience the effects of 2C-X or 2C-T-X, but I had always imagined the visual alterations to be something like this. Then within half an hour (T+1.15h) my visual field was completely filled with colour, movement and material objects which were crystallized into barely recognizable shapes. Intensly overpowering OEV as well as CEV.</p><p>The effects were still climbing, it even began to feel a little toxic. It felt like my liver was dissolving. I knew this pain was mental and quite quickly I was able to shake it off. I had enough water on me and drank a lot. Especially the muscle tensions contributed to some body load after a while.</p><p>The train of thought wasnt really one of thought, more of images. It was as if youre floating along sweeping images, fast and abstract, as a beautifully filmed martial arts film, in which the camera rotates along with the players. This made it feel quite passive and superficial. For quite some time I had the same flood of images, the same spiral, which always ended in chilly, rotten and forgotten places of the world which was home to starved and sick people. Very cold, very lonely. Apart from the theme of my movies, this is what I imagine the brain movies are like, as they are described in PIHKAL under MMDA.</p><p>I wasnt afraid, I didnt panic. But I didnt have the certainty I have for example with mushrooms: after two hours, the worst is over. I can clearly remember hoping that at 9:15 (T+3.00h) the peak would be over. But it wasnt, it was still climbing but the character of it all started to change slowly.</p><p>The first three hours were really intense, there were moments at which I doubted everything would turn out ok, but I knew these thoughts were relative. I decided a couple of times to stand up and walk about the house, to bring my train of thoughts/images on another track. Most of the time I succeeded in doing that. I took another shower at about ten, ten fifteen (T+4.00h) and after that I tried to watch some TV. I really couldnt see anything, everything was still moving violently and sounds were distorted, sounded hollow and were sometimes echoing, but it pulled me back to reality, which made me a little more comfortable at that time.</p><p>At this point I let the cat in. How marvelous! My big support in lonely nights! Great. Ive been cuddling him intensly for about half an hour and then I went back upstairs again. By now it was about eleven oclock (T+4.45h)</p><p>The visual aspect of the experience started to decline by now and the amphetamine character started to prevail. Yaw clench, muscle tension and being unable to remain still. Ive been twisting and turning for hours. Lights on, lights off. Constantly the same train of images, ending in the cold, lonely depths of the world. Throughout most of the trip an industrial, metal-like sound was heared.</p><p>Ive been awake till about 4.00 am (T+9.45h), after that I dozed of a little till 9.30am ..</p><p>I wrote this about an hour after I woke up. I was tired, which of course isnt surprising after such a short night and so much stimulation. I didnt really experience a hangover, but it took me a day to fully return to baseline.</p><p>Conclusion: the character of TMA-2 greatly changes at a higher doses. The true face of the visual alterations which it induces become apparent and however I dont consider it to be a heavy entheogen, I do think it is quite an entertaining substance at this level. Perhaps I would dose a little lower in the future.</p>",
 "year": "2002",
 "id": "17840",
 "gender": "Male",
 "timestamp": "2002-09-30T07:00:00.000Z",
 "views": "13443",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "TMA-2"
  }
 }
}
