{
 "title": "Acute Manic Attack",
 "author": "Crackerboy O'Brien",
 "citation": " Crackerboy O'Brien. \"Acute Manic Attack: experience with Caffeine (ID 1785)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1785",
 "substance": "Caffeine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "report": "<p>Just thought you guys be interested in a little bit of excitement that came my way last night...</p><p>After drinking an entire pot of coffee in less than an hour, around 4 AM this morning I became completely and utterly convinced that the world was going to end at exactly 6:11 AM this morning, just before first light. I'm not making this up. I completely lost my shit in a way that I have never lost it before.</p><p>I was so freaked out, I wanted to die. Not to kill myself, just die. I had absolutely no desire to write, speak, eat, blow my nose, kiss, think or be in general...I wanted to die and I was convinced that when the world did end in a blaze of hellfire, I was gonna be judged by the Lord Almighty and burn for eternity. I wrote four pages about it in my journal as I was hip deep in the shitpool that was a stimulant overdose induced, acute manic/paranoiac attack that triggered some sort of neoclassical, metaphysical, socio-religious and philosophical crisis.</p><p>Needless to say this sucked real bad, and I didn't real start to come down off this until around 5 in the morning. This particularly blew 'cos I had two labs to finish by today (already late...I only ended up getting one done), and I didn't feel a hell of a lot of incentive to expound on the vibrational-rotational modes of carbon dioxide molecules being that the world was going to come to a screeching halt and I was hurtling toward that inevitable eternity of suffering and agony reserved for unrepentant pagans and unbelievers like m'self...</p><p>I fully snapped out of it at 6:20 and now my stomach feels like I swallowed a pound of Drain-O and pixie stick cocktails...</p><p>If anyone ever tells you caffeine is not a psychoactive drug when taken in significantly large quantities, spit on their nose. And if you find the bastard that sprinkled LSD on my French Roast, cut out his tongue...</p>",
 "year": "1995",
 "id": "1785",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-14T07:00:00.000Z",
 "views": "36642",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 ]
}
