{
 "id": 17872,
 "title": "Ten Years Gone",
 "date": {
  "submission": "2009-03-01T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Greenfox",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "Pharms - Buprenorphine",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>Before I delve into the details, a little background information:",
  "I have been using various substances for almost 10 years (since I was 18, I'm 28 now).  I have done just about everything: 'uppers, downers, laughers, screamers' (to quote a favorite movie of mine).  In the end, though, my true love was opiates.  That love started with Percocets (for my wisdom teeth) and worked its way up to Oxycontin and finally heroin.  When I first started smoking weed, if someone told me in ten years I'd be an IV heroin user, I would have either laughed or gotten angry, I'm not sure.  Either way, here we are, ten years later. ",
  "About a year ago, I got very tired of 'the life' - waking up every day sick as a dog, trying to scam money to 'score' some opiates, getting overcharged for everything, and of course not being able to control my intake.  When I got something, it was usually gone the same day, no matter how much I had.  So finally I did a little research online.  I was originally looking for a Methadone clinic but the lines and having to go there physically everyday turned me off from the experience, but I came across Suboxone. ",
  "After going into treatment for a week and a half, it was one of the hardest things I ever had to do, looking my father in the face as he escorted me to the intake room, I came out with a Suboxone 'script.",
  "It was heaven - at first.",
  "Now, it just seems to get me by.  If I don't have it for more than two days, I have withdraw worse than the worst junk withdraws.  As I am writing this very report, I am patiently waiting four hours, (I pick up my next prescription at 8AM - it's a little after 4AM).  I've been up for the past few days, because, like I do every month, I fiend through my pills and usually I'm a week shy by prescription time.  And like all controlled substances, they are BASTARDS about when and how they give it to you.  I think there's a certain stigma that's associated with it, anyways, and that's also a horrible feeling.  Every month I go in there at the EXACT MOMENT that I'm 'allowed' to pick up my 'script.  By that time, I am usually sick and disheveled.  It seems that silly things, like writing experience reports, get me through without focusing on the symptoms too much.  It's interesting because as much as I hate it, I know for a fact when I get my hands on that bottle of tiny little hex-shaped orange dragon-slayers, we call them that name because of the 'sword' on each pill, I will be SO damn happy. ",
  "So in closing here's a few things you should know:",
  "THE BAD",
  "* I still withdraw if I don't have it, the withdraws are BAD.",
  "* Suboxone will NOT get me 'as high' as heroin or 'oxy's'",
  "* When I get back 'on' my pills at the beginning of each month, sometimes I babble and have trouble sleeping",
  "* It most certainly constipates me",
  "THE GOOD",
  "* It's NOT methadone, so I don't have to wait in line EVERY DAY to get it. ",
  "* It DOES get me high - just not AS high...",
  "* 'more' is not 'better' - for me I'm on 16mgs a day.  I found a comfortable 'ceiling' dose is 1 1/2 times my daily dose i.e. 24mgs.  That seems to do the trick nicely.  Any more seems to actually have less of an effect",
  "* Weed and caffeine seem to potentate the effect..nicely.  There's nothing more rewarding than slamming a caffeine drink when I am in withdraw from it, and then popping two or three pills",
  "* It's CHEAPER to pay for this crap than what my habit was costing me</p>"
 ],
 "erowid": {
  "id": "66947",
  "citation": " Greenfox. \"Ten Years Gone: experience with Buprenorphine with Naloxone (Suboxone) (ID 66947)\". Erowid.org. Mar 1, 2009. erowid.org/exp/66947",
  "substance": "Buprenorphine with Naloxone (Suboxone)",
  "views": "16988"
 }
}
