{
 "title": "A Stunning Experience",
 "author": "Steven",
 "citation": " Steven. \"A Stunning Experience: experience with Cannabis (ID 1788)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1788",
 "substance": "Cannabis",
 "bodyweight": "",
 "report": [
  "<p>The strangest thing happened yesterday, and I thought it would be wise to write my experience down, before I forget all its details.",
  "I usually smoke weed alone. I'm lucky enough to have a lovely setting, sitting comfortably in front of the window, with a nice view (trees, stars, etc.). I consider myself a rather experienced user - normally I smoke pot to relax and lift my mood. Therefore I wasn't completely ready for what happened last night.",
  "I'm not certain of the dose, but I only smoked one joint. Okay, it was what I consider a strong one - but still...I knew how powerful this weed was (I smoked the day before), however, I didn't know that pot alone could blow my mind this way.",
  "I started taking off after a few hits. After about twenty-five minutes, I felt really tense. My eyes were feeling strange. And before I knew it, I was on the floor. I don't know how I ended up there, though. I was literally knocked down by the power of the experience - it reminded me of the first effects of mushrooms, a heart that beats fast, and a different level of awareness.",
  "After maybe thirty or thirty-five minutes, the first hallucinations occurred. The window became 3-dimensional - in other words, I could see things come out of the glass, it looked like a mountain all of a sudden. I was completely out of reality (note : I smoke in the dark, with only the light of the day - there is one, even at 1 am). I fell off my chair again, and when I wanted to find it again, I couldn't. I felt like I was losing my mind, because I couldn't find a big chair in such a little room.",
  "And then the most impressive moment of the trip occurred. I got closer to the window to look outside. I could see an assembly of people, and strange patterns and characters moving on the tree. The hallucination was very real, because no matter how I looked at it, it was there, permanent. Then I saw a piece of steel with a ball on it, and the piece of steel was moving back and forth. For some reason, it was very important to me to make sure the ball wouldn't fall off. So I concentrated on it, and I noticed I could curve the steel each time the ball was about to fall, only with the power my mind.",
  "It's probably very unclear, but the whole experience was extremely disturbing. Making the hallucinations change just by my will is something I never went through before. It was very exciting. The whole experience lasted for about 2 hours, and then I started to come down a little. I didn't understand that weed (and only one joint) could be such a powerful, mind altering drug. It raises a lot of questions about awareness. During the trip, I had moments when I felt I was going through a quasi-religious experience.",
  "I didn't know that weed could free your mind this way, and enable your brain to work completely. I've been in deep thought since this trip - next time, I will take a piece of paper and write all the things I feel and see. Drugs that affect consciousness are very appealing to me. They make me realize how much more there is out there, how many ways there are to see the world and use your mind.",
  "Sorry for rambling, I just had to share this experience. It was very pleasant, although at times quite breathtaking. I will try to reach this state again, but I'm not sure that weed alone is responsible for this. Another thing I learned is that the setting and your state of mind just before the trip are *very* important. Overall, this trip was very enlightening to me, and made me reconsider several things I took for granted about reality.</p>"
 ],
 "year": "",
 "id": "1788",
 "gender": "Male",
 "views": "67680",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2000-06-14T07:00:00.000Z"
}
