{
 "id": 17894,
 "title": "Crash and Burn",
 "date": {
  "submission": "2011-03-24T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "lovemylife",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "This is my experience with amphetamines and methylphenidate during the last summer. So shit happened with girl I liked so much who was also my best friend. And already suffering from depression I discovered amphetamines. I started railing 15mg of adderall and dexedrine feeling great, it felt so good to be out of that hellhole of depression I was stuck deep inside in. Then I started doing it almost everyday before work. It made my life so much more tolerable, great I thought the perfect drug.",
  "Then came the crashes at first they were bad yeah but usually I would crash late in the day so I just went to sleep. Then the crashes started to get worst and worst every time. I didnt know what to do anymore if I didnt have the drug I felt like shit but once I did have it I would feel like god for a few hours and then feel like even more shit.",
  "Finally I experienced the worst crash from it. Ironically it was on my birthday. I did some amps in the morning went to work and came home. I started crashing almost immediately. I just couldn't take it anymore the pain was too much. Nothing but negative thoughts were running through my mind. I decided to commit suicide. So I looked on ways to end my life quickly and painlessly. The only ways I found that would do that was overdosing on heroin or a firearm. Fortunately I didnt have either.",
  "While looking I read something that said if you ever decide to end your life get any drug you can and fuck yourself up so you wont be able to. So I drank the night away. I met this girl on myspace a few days ago and I talked to her on aim. I told her what was going on because I just needed to tell someone. So I told her everything, turns out she was also suffering from severe depression and she really helped me out in no way I can describe that night.",
  "After that horrible night I decided to stop using amps and the like. I started smoking more weed and actually meditating while on it instead of using it as just something to get 'fucked up' on. I realized alot of things about myself in those sessions and was a life changing event for me. I also started taking 5-HTP a natural anti-depressant.",
  "A few months later I am out of depression and I love my life. I now use amphetamines again, in fact as I am writing this I'm pretty tweaked from some 30mg xr adderall. I wrote this to show people the ugly side of this drug. Never use drugs as an escape to your reality. It will never end up good and just make everything 10x worst than what it really is."
 ],
 "erowid": {
  "id": "67043",
  "citation": " lovemylife. \"Crash and Burn: experience with Amphetamines (ID 67043)\". Erowid.org. Mar 24, 2011. erowid.org/exp/67043",
  "substance": "Amphetamines",
  "views": "4949"
 }
}
