{
 "title": "Fast and Hard",
 "author": "Vlan",
 "citation": " Vlan. \"Fast and Hard: experience with Yohimbe (ID 17904)\". Erowid.org. Nov 17, 2004. erowid.org/exp/17904",
 "substance": "Yohimbe",
 "bodyweight": "330 lb",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "Yohimbe",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2002",
   "17904",
   "Male",
   "",
   "Not Given",
   "Nov 17, 2004",
   "17557",
   " "
  ]
 ],
 "report": "<p>I used 2 pinches, about 2 tablespoon of Yohimbe, boil it in some water until it was almost black.  Drink it down, it doesnt taste so bad, my friend compared it to Chi Tea (Never heard of it myself).  I began to feel it inside of 10 minutes, pleasant shivers, heart racing, euphoria.  Within an hour, I had an erection, I was happy, everyone I talked to I seemed to like.  Each time I take it, I seem to get a personality boost, and it makes my inhibitions weaken, I feel romantic, and I talk in a way that females like.  Maybe thats just in my head though.  It usually lasts, with alot of nervous energy, and me chewing my nails, until I have an orgasm.  Whether I have someone helping me or not, I have a hard time getting to it.  As soon as I start to come close my heart seems to be trying to jump out of my chest (think Alien) Once I have the orgasm, which seems to last longer, you know, the actual after you have lost control part.  Its only a few seconds, but its definately noticable.  </p><p>Once, I took too much, something like a handful, and let it boil too long, and I couldnt even walk down th stairs, without gasping and holding my chest, and I ended up staying up till noon the next day.   I am big boy.  Start out with 1 tablespoon, boiled till the water has color, and base your usage on what you feel.  People with heart problems should definately not try this.  </p><p>Another type of Yohimbe I have tried was powdered, I took two regular kitchen spoons, and I got the shivers up my spine within 10 minutes again, lots of energy, and of course the sexual side effects.   It seemed to be without the anxiety and nervousness that I feel with the cut and sifted made into tea though.</p>"
}
