{
 "id": 17905,
 "title": "Put On The Godmind, Megalomaniac",
 "date": {
  "submission": "2013-06-02T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "XV710",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "1:40",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "3:16",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "'To worship me take wine and strange drugs whereof I will tell my prophet, and they shall not harm ye at all.'  Liber Al Vel Legis, or The Book Of The Law",
  "Do what thou wilt shall be the whole of the law.",
  "I was turned onto recreational use of psychedelic substances about a year ago, when a friend introduced me to marijuana. I'd actually been using Ritalin for 12 years, taking it daily as prescribed for ADD. This influenced all my drug experiences and skewed all the data I'd collected about their effects on my consciousness, so at the beginning of this year, I went cold turkey off the stuff to both become totally independent of substances and to give me a stable and unadulterated baseline from which to judge what effects these things were actually having on me independent of their interaction with the Ritalin.",
  "All this to say that historically, my initial physical reactions to drugs have been generally abnormal to the point of being unlike any others I've heard of, as per my skewed physiology. For example, my first time smoking pot I went totally blind for about a minute and a half, my brain had so much trouble dealing with what was happening (something I haven't heard of happening to any other pot smokers).",
  "So, by the afternoon of Friday, March 2nd, 2007, I'd tried pot, Salvia divinorum, Amanita muscaria (that resulting in nothing but annoying physical affects, and skewed results based on the fact that I'd smoked pot beforehand and was already high by other means), but never LSD.",
  "The night before, I studies some websites to have some handle on what I was getting myself into as well as to be able to prove that the pieces of paper I'd eaten (ostensibly containing some sort of colorless, odorless, and basically undetectable psychedelic) had had some real effect. I've been screwed over before by simple pieces of paper sold to me by people who'd said it was acid. I memorized almost all of the effects by means of the Qabalistic Tree Of Life, utilizing Aleister Crowley's attributions as places to 'hang' the effects mentally. This will be important later, as I hung the effect of 'megalomania' on the path of the Magus, but you'll see when we get there. At this point it would also be probably useful to mention that I'm a Thelemite, which colors the rest of the experience in many and varied ways.",
  "I, afraid for my sanity and my life, had asked a trusted friend (well call him Gemini, as per his astrological sign) to babysit, to both stop me from doing anything self-destructive as well as to bring me to the hospital if things got really bad; I gave him my pocketknife, afraid that I might accidentally hurt myself with it or worse.",
  "1.33pm I eat one hit of Acid.",
  "3.10 Having left the slip of blotter paper in my mouth for about an hour, but still feeling nothing, I began to get suspicious that I'd been screwed over again. A friend of Gemini's (hereinafter 'G'), we'll call him Sagittarius (as per his own sign, hereinafter 'S'), suggested I eat the other two hits left on the sheet of blotter paper, because 'they obviously didn't work.' I did so, not thinking that they would do anything. G gives me back my pocket knife.",
  "I, dejected, decided that I wanted to get high instead and that we should all go to buy some pot. Luckily, I took my journal with me. We walked over to a friend's house to buy some pot and I was with S and G in S's room, where G was rolling a joint when I called the guy who'd sold it to me, a friend of mine, to tell him that his source had probably fucked us both over.",
  "We left his room, got in S's car, and began the drive to a park where we'd smoke the joint G rolled.",
  "4.31 I write in my journal, 'I feel...lethargic.' It was at this point when I started to feel that things had gone distinctly awry. I felt positively drunk, and in a way I'd never precisely felt before. This was before I had taken any sort of hit from the joint. I kept trying to work out the gematria for the word 'pot,' but kept getting distracted, so one might argue that 'difficulty focusing' was an effect present in full force. Note: Gematria is the mystico-magical practice of equating letters with numbers and adding those numbers up to get a value which is compared with similar word-sums in an attempt to generate correlations between the words.",
  "At some point before 4.49, the joint began to be passed around; hence comes what could be interpreted as evidence for the hypothesis that pot potentiates LSD, as the effects were about to kick into high gear.",
  "4.49 '+++,' I write in my journal (using Shulgin scale notation), adding, 'Everything is so pleasurable...I'm no longer 'in control.' I had never experienced this kind of pleasure before. I was doing awkward arm motions across the windshield of S's car, as if I were autistic or retarded, because I was so pleasured and didn't wish to exert effort over my arm.",
  "5.00 (Journal) 'Maybe a PLUS FOUR.'",
  "5.44 (Journal) '++++'",
  "(Journal) 'MOOD LIFT!' At this point, I decided that I was experiencing an amount of pleasure that I hadn't had before and might never have ever again. When we arrived at the park, I had to drag myself out of the car seat.",
  "'I'm seeing patterns too often,' I wrote. This appears to have been the first time 'open-eye visuals' made their presence known to me, as this was a summary of my recurring interpretation of what my brain was doing when I saw open-eye visuals throughout the rest of the night, that the part of my brain which sees patterns in nature was hyper-analyzing my environment to the point where I was seeing patterns and connections where there wouldn't normally be any.",
  "Somewhere in here, I decided to pull out my pocketknife and cut myself to prove that I would still feel pleasurable regardless. You must understand, that this was not quite so insane to me as it sounds to you. I cut semi-regularly as part of a program of psychological negative reinforcement called Liber Jugorum, but when I rolled up my left sleeve to cut, the place where I was going to cut happened to be near my left wrist. Bad place, I know. Which is why I'm glad S stopped me and took my knife from me. I tried to argue that, 'If I'm feeling this much pleasure, death shouldn't scare me,' or something like that, but I'm pretty sure I just wasn't entirely there at that point.",
  "Continuing this line of thought, I asked S to kick me in the shins several times, which he did. It just didn't seem to hurt.",
  "I consciously decided to test out this pleasure - it seemed that I could do anything and nothing would phase me - so, on a rocky trail in the park, I consciously decided to throw myself on the ground. S and G chided me, saying that we were in public and didn't want to attract attention.",
  "As we walked back to the car, I noticed patterns in the ground of the same sort which I've already explained and became very conscious of just the sound of the leaves crunching under our feet (perhaps 'increased awareness and appreciation of the senses'?).",
  "I wrote, 'Why do anything other than feel pleasurable?' in my journal, which would become important later on, as it's a theme I'd return to over and over.",
  "I also wrote, 'I feel almost as if I'd die ['could die,' I presume I meant] and I wouldn't care.'",
  "By this point, we had returned to S's room. I looked in the mirror at one point, taking note of the fact that my pupils were dilated as all Hell, recording the note, 'Pupil dilation' in my journal as well as I could while the room looked like it was flowing around me.",
  "I sat down and felt like I was a fish in a fishtank, with water surrounding me.",
  "My phone-alarm rang, reminding me that it was time to Resh. I told S and G that I had to go, so I left the room, G behind me (he's a fellow Thelemite). When I looked at the setting sun in the middle of the ritual, all I could see were elaborate patterns forming and deforming around the sun itself out of the surrounding clouds. This was at the time the most beautiful experience I believe I have ever had.",
  "I turned to G: 'This...is why Crowley wanted us to practice Resh: it's so beautiful,' and we so often miss how beautiful the world is. This is something that can easily be remedied if we only stop to look around us and recognize the beauty of the world we live in. That's the point of worshiping the sun 4 times a day (well, one of the points; there's far more to it then that): to not miss the beauty there.",
  "I watched a Tool music video that got the first 12 dozen notes or so of one of their songs stuck in my head for the rest of the night as a cognitive 'baseline' that I would return to over and over when I wasn't thinking of other things.",
  "I at this point was a mess, not fully coherent. I noted an experience of some 'nausea' down in my journal before saying as much, finally deciding that I had enough evidence to confirm that this was, in fact, an Acid trip: 'I'm probably Acid tripping. I know that I am incoherent.'",
  "Somewhere in here (I'm only sure that it happened before and not after the following), I got scared that my conscious volition would be lost in the sea that was all of the cognitive and perceptual forces making and unmaking themselves before my eyes.",
  "So, I left S's room, deciding that I needed to do the Star Ruby, a Thelemic banishing ritual, as an attempt to gain some sort of control over the trip.",
  "I did the ritual, in complete darkness (I guess it was a sign of my coherence-of-mind that I could remember and engage in the 5-or-so-minute-long ritual at all), finishing quickly when I started to see many and varied things with my eyes closed.",
  "I had the munchies at this point, and ate like a motherfucker upon returning to S's room. But I was ostensibly coherent enough to walk about two football stadium lengths across campus to where I had paid for the pizza.",
  "At some point, I decided (with the Thelemic solipsistic bent) that 'the universe only exists for my entertainment, and if my environment is not currently entertaining me, I should either leave it or change it to the end that is my pleasure.' I became a real dick to S and G before we went back out to smoke some more, though I was much more assertive than usually. I felt at another point that I really could do anything I wanted, and that all I needed to do was will to push myself towards some particular end, and I would attain it.",
  "Interesting to note is that - and I don't recommend this unless you have some way of practicing and testing yourself with under-the-influence-driving to prove you can efficiently function - G wanted to go get cigarettes from a local 24-hour store and had no one else to drive but me. So, still on acid, I drove my car down the street to this place with really no problem.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "For the rest of the night I was basically manic, running around campus and trying not to allow the visual oddities to take over by continually pacing everywhere and talking to myself. I was still rather pot-high, meaning that my mind was dreaming up all sorts of neat ideas, as tends to happen when I get high, for another few hours, until around 5.30 in the morning, when I slept.",
  "Woke a few hours later with my newfound pleasure-seeking and dickish personality intact. My mother and grandmother had arrived on campus. I reviewed the notes from the previous night, as is my custom, to refresh the memory of what had just happened.",
  "The depression I felt starting around that afternoon was one of the deepest and darkest I've ever experienced. It was a burnt-out, not-enough-sleep, nothing-in-the-world-can-make-me-happy feeling. So, I got rid of my mother as quickly as possible. She could tell that something was wrong and continued to ask if I was depressed; I lied each time, telling her, 'Not at all.'",
  "Took some sleeping pills around 5pm and woke up a good deal more than 12 hours later, refreshed and basically O.K.",
  "All in all, a great experience.",
  "Love is the Law, Love Under Will."
 ],
 "erowid": {
  "id": "67089",
  "citation": " XV710. \"Put On The Godmind, Megalomaniac: experience with LSD & Cannabis (ID 67089)\". Erowid.org. Jun 2, 2013. erowid.org/exp/67089",
  "substance": "LSD & Cannabis",
  "views": "766"
 }
}
