{
 "id": 17907,
 "title": "Combinations",
 "date": {
  "submission": "2008-05-23T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SerdaL",
  "gender": "Male",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "12.5",
    "grams": 0.0125
   },
   "administration": "oral",
   "substance": "Sertraline",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "repeated",
   "substance": "Various"
  }
 ],
 "report": [
  "I have been prescribed to 12.5mg of zoloft daily to treat anxiety. After a month of the medication I stopped taking it because the 'kicking in' part made me depressed and I overall hated zoloft.",
  "Looking at some reports, I found that interactions with Zoloft could be bad. I was scared at first because I did not want to stop my smoking habits. While taking 12.5mg of Zoloft daily (in the morning) I found no bad interactions or effects while ingesting Cannabis, Salvia divinorum, Caffeine, or Oxazepam (Serax - A type of benzo).",
  "I have taken the caffeine occasionally in the morning to wake me up so I'm not sleep deprivated in school, I took one pill every other day (200mg). I don't recall smoking cannabis in the morning close to my dose of Zoloft, but I probably did. The majority of my smokings took place at night. 10 hours or more after I took my daily zoloft. Same goes with Salvia divinorum (I experienced strong effects). Oxazepam I took randomly throughout some days, can't recall how many times or at what time during the day.",
  "A while ago I bought 2 grams of mushrooms to take. This was 2 weeks AFTER I stopped taking Zoloft. The trip was very minimal, no more than a buzz and small amount of OEVs and CEVs. It is possible that I got ripped off as or sold 'old' or 'less potent' shrooms. I do not trust the dealer I bought them from. However, Zoloft could have been the reason why I did not trip effectively.",
  "I would like to address that I was on the smallest dose of Zoloft, this may play a role."
 ],
 "erowid": {
  "id": "67091",
  "citation": " SerdaL. \"Combinations: experience with Zoloft & Various (ID 67091)\". Erowid.org. May 23, 2008. erowid.org/exp/67091",
  "substance": "Zoloft & Various",
  "views": "15140"
 }
}
