{
 "title": "A Very Intense Cannabis Trip",
 "author": "Chronic Smoker",
 "citation": " Chronic Smoker. \"A Very Intense Cannabis Trip: experience with Cannabis (ID 1790)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1790",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>A year ago my bro and i were lucky enough to get 6-7 grams of some chronic shit, and i don't just throw that term around. This shit was the bomb. I'm talkin one hit shit. I'm talkin if you sqeezed a bud of this shit in your fingers, marijuana oil literally dripped off. Like i said, This was the chronic shit. So there was only one justifiable course of action, and that was to roll a phatty. I took a moment to notice my surroundings as he carefully filled the paper with green. The room was lit much like a doctor's office, cold white light. Not at all your typical smoking lighting, but i suppose that was the point. I noticed a previously rolled joint in a test tube on the smoking table which brought a smile to my face, and as he finished his bomber masterpiece, the joint in the test tube cought his attention as well. He asked me what i thought we should do with it, to which i replied: LET'S LIGHT EM BOTH UP!! Which would have been a bold enough statement as it is considering the bud we normally get around here, but the fact that this stuff was dripping with T.H.C. oil made us both wonder if we really should smoke both of them at the same time. But the concern of getting 'too stoned' quickly faded as the excitement of getting started took over, and the last thing i really remember clearly is my bro saying, 'See you on the flipside.' And with that we lit up. Instantly we were blasted, but we wern't stoppin till both j's were roaches. As soon as one of us would take a hit we would switch and take a puff off the other joint, not once taking a breather. When both j's were halfway burnt i could barely take another hit. My heart rate was already goin a mile a minute and all my bro could say was 'oh shit..' And on it went..</p><p>By the time the smaller joint was roached the b-52 was still goin strong and we were trippin HARD! Tar was bubbling out the end as we finished it off, and we sat back and tried to get some real oxygen flowing in our systems again. I was blasted into the stratosphere. I started seeing spots and my heart was now beating so hard my chest hurt, and what started as a dull ache in my chest was amplified by the extremely high thc level and felt as if i had been shot or stabbed. I'm dead serious! My bro was reporting 'cardio' as well. They don't call marijuana psycho-active for nothing, And with this bomb shit and the amount we smoked, it was actually quite hullucinogenic.</p><p>The neighbors had been playing basketball and since we had all the windows and doors closed you could barely even make out the sound of the dribbling ball. And this i find VERY interesting: My mind actually intensified the distant sound as though it was in my head! I began to feel as though i WAS the basketball. My mind's eye had completely taken over to the point that my conciousness seemed either to BE the basketball, or perhaps my subjective take on what it would be like to be the basketball converted to reality by means of personal expirience. At any rate, Evertime the ball hit the ground it was a painfull experience. I found this quite amusing.</p><p>I began to have fairly strong audio hullucinations and subtle open eye visuals, and definate closed eye visuals. And beyond that point i don't remember much of the trip.</p><p>This marijuana was definatly NOT laced. All effects were purely tetrohydrocannabinol effects. Fun, exciting, interesting, even a little painful, which if you ask me was one of the best parts. Overall, a very intense cannabis trip. </p>",
 "year": "2000",
 "id": "1790",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-14T07:00:00.000Z",
 "views": "8898"
}
