{
 "title": "Adverse Reaction to Marijuana",
 "author": "Anonymous",
 "citation": " Anonymous. \"Adverse Reaction to Marijuana: experience with Cannabis (ID 1791)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1791",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "</p></p><p>Ones condition on marijuana is always existential. One can feel the importance of each moment and how it is changing one. One feels ones being, one becomes aware of the enormous apparatus of nothingnessthe hum of a hi-fi set, the emptiness of a pointless interruption, one becomes aware of the war between each of us, how the nothingness in each of us seeks to attack the being of others, how our being in turn is attacked by the nothingness in others.</p><p>- - Norman Mailer - in Writers at Work</p><p>\r</p><p>I've had an *overwhelming* reaction to marijuana. I consider myself a fairly heavy user of the herb. But for some reason instead of being high and in the groove, I was having a very bad trip and nausea, no psychedelics involved.</p><p>I was at 2 aquaintances' apt with my best friend and his old high school friend. We had smoked some hash I brought from Am'dam, a couple fatties and christened a new glass bong. More than I usually smoke, but nothing I didn't think I could handle.</p><p>But then my high became adverse. My body was disassociating. Music was coming out of the ambient white noise. I asked my friends, 'do you hear that beautiful music?' Negative. I was alone. Then the waves of evil started lapping at my feet. The 2 aquaintances took on a new persona. I took on a strange delirium. I believed that the man was satan, and his female roomate was his succubi. Caught in this thought loop, my body would revolt each time I thought about the satan connection. In a sick way, I was really enjoying these stream of evil thoughts, however my body was revolting.</p><p>I snuck away to the bathroom because I felt I had to vomit. Dry heaves. I couldn't commit my body to release the evil. I kept thinking of what someone said to me about vomiting as a means of cleansing. More feeble attempts. My friend came in to check on me, and we decided to leave. I made it home and was finally able to release and give in to the vomiting and all was better. Lesson learned, don't fight the urge to spew. Purged and cleansed, I lied on the floor in the darkness, finally able to enjoy the space in my mind. No more bad thoughts. I continued hearing music from white noise and tried my best to remember the melodies so that I could tune in later.</p><p>All in all, a new and exciting experience from pot. Never thought it would be possible. Why do I think it happened? I had a large amount of Indian food for lunch, and I think there was a synergy from the spices. Yea, it could be food poisoning, but my girlfriend wasn't sick at all. This experience reinforced my belief that MJ is definitely a visionary plant. I'll probably try to repeat the indian food + copious mj combo just to satisfy my curiosity. However, the taste of curried bile is a poignant reminder that lingers on my tongue.</p>",
 "year": "",
 "id": "1791",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-14T07:00:00.000Z",
 "views": "94734"
}
