{
 "id": 1792,
 "title": "A Portal to Dreams",
 "date": {
  "submission": "2005-05-04T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Stahrgazer",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "Tbsp",
    "quantity": "2.5"
   },
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "My boyfriend and I decided to try nutmeg after reading about its interesting effects.  We paid $1.19 for 1 small package of whole nutmeg purchased at our local health food market, which when grated equaled about 5 tablespoons.  We then we filled 80 size O gel caps with the now powdered nutmeg using my cap-M-quik capsule filler.   At approximately 4:30 in the afternoon on the 3rd of July, we proceeded to swallow 40 capsules a piece of freshly ground nutmeg, which was about 2 1/2 tablespoons each.",
  "It was an unusually warm 3rd of July for this Coos Bay, OR, so we decided to go play at the Bastendorf Beach awhile before going to the fireworks eve show later on at the Mill Casino.  We splashed in the cold ocean and ran up and down the beach while the kids climbed rocks and built sand cities. It was getting close to dinnertime so we decided to head home...the time was about 6:15 and as my boyfriend started the car he looked at me and said Im starting to feel altered.   All I could do was grin, as I was starting to feel very calm and floaty, kind of like weed yet...not quite.",
  "While preparing dinner, eating, (which by the way didnt seem to diminish the effects), and getting the kids ready to go out the door, I noticed an increasing peaceful-tingly kind of feeling, nothing too dramatic but definitely altered and definitely becoming more pronounced. I noticed my heart beat more and my eyes were getting red and sensitive. My talkative move-around-type of boyfriend was kicking back all smiley in the recliner. ",
  "What I liked about this trip was the gentle way it came on.  By the time we made it to the fireworks, through the traffic and the crowds at the boardwalk by the casino, we were pleasantly frying.  As we were weaving our way through the crowds, holding tightly to the kids hands and each other, all we could do was grin at everybody. The fireworks show started right at 10:00, and it seemed the nutmeg kicked in at exactly the right time, because when combined with the fireworks I personally was taken to another world.  Of course fireworks are beautiful anyway, but combined with such a pleasant tingly feeling and beautifully altered perception, they became a portal to dreams. I cant speak for what my boyfriend was feeling at that time, but he just stared and stared at the fireworks, in awe, as he held onto my hand...and he kept that grin on his face. ",
  "After coming home and tucking the kids in, we stayed up for several more hours in our bedroom...I am not sure exactly how late because we lost track of time all together. The conversation and laughter flowed well into the night I assure you. We listened to Pink Floyd.  We had taken no other consciousness altering substances that day or that evening.  I dont know if this next comment is appropriate for this forum or not, but since we are talking about the effects of nutmeg I have to mention how good it felt to make love under its effects.  Not only was the sensitivity in our minds heightened, but also the sensitivity of all of our senses.  Nutmeg also produced such a general open, good, loving feeling...like that of a gentle fry...well you can see how the combination would lead to really good sex.  :-)",
  "The next day was actually the 4th of July, and let me tell you when we woke up we realized that the trip wasnt over.  First of all, waking up in itself was a Herculean effort...plus my eyes were all heavy from being so red the night before, they were now very swollen and puffy.  However other than having NO energy at all, the feeling was still pleasant.  We had planned to spend the entire day at the beach into the evening, but it took us 4 hours to pack the car...so we left about 4 that afternoon.  So basically 24 hours after taking the stuff, we were STILL high from it!  The beach was cool.  (We were still so peaceful and happy that I imagine just about anything would have been cool.) We smoked a little weed and shared a bottle of wine with a friend, but still the nutmeg was 'the main buzz' so to speak.  We cooked steaks over an open fire, played in the ocean and sand, and lit our fireworks at dusk.  We left the beach around 11 that night then came home and fell asleep nearly as soon as our heads hit the pillow.",
  "Well that was last night, and here on the morning of the 3rd day, we are still coming down.  I cant say I feel unpleasant, but I can tell you I have laid around all day.  I did manage to clean our birds cages and water the yard, that is it. My poor boyfriend had to go to work today, he just came in for his lunch break and I asked him about his day, he said he didnt know, as he seemed to be sleeping through it. :-)",
  "If one decides to try nutmeg, one might plan on having at least 3 days blocked out of the schedule for it. I needed at least the next day to be free from having to do anything that required hard work or following a schedule. It puts me on a void-of-course feeling. I feel it is on the same level as mushrooms...harmless if used correctly, but not something Id want to do on a constant basis. Although most people Ive read about took 3 tablespoons, I was happy with 2 1/2. It is definitely a consciousness altering high; one I feel would be conducive to meditation or prayer. I wouldnt want to do it alone simply because it gave me a feeling of wanting to share, not isolate.  And I really recommend capsuling it...how people have ever managed just to swallow it is beyond me!"
 ],
 "erowid": {
  "id": "15836",
  "citation": " Stahrgazer. \"A Portal to Dreams: experience with Nutmeg (ID 15836)\". Erowid.org. May 4, 2005. erowid.org/exp/15836",
  "substance": "Nutmeg",
  "views": "50166"
 }
}
