{
 "id": 1793,
 "title": "Confusion/Delusion/Floating",
 "date": {
  "submission": "2003-12-07T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Charlie",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "3 tsp",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "This reaction was one that I had to try and figure out after it had happened.  The reason for the panic attack was some sort of interaction between my Wellbutrin (which had been prescribed to me a few months prior) and both the Robitussin and Motrin.  I highly suggest if you are using Wellbutrin to ask your doctor about interactions. ",
  "It was one of those dreary feverish sicknesses that one comes across during the summer which can be warded off by the usual medicine for temporary relief.  I had taken my Wellbutrin as I do every day to a total of 300 mg then popped my dose of pain relief and drank the dose of Robitussin.  Tonight I was to go see a movie... A Beautiful Mind to be exact, but tonight I would not enjoy the movie as much.  Recently, I had been experiencing strange panic attacks where I felt very dizzy and seemed to have a hard time taking in enough oxygen, but of course I didn't think twice about interactions.  Certain times throughout the movie I experienced these incredible waves of heat and dizziness, feeling as though 'what's next why did I take all that medicine!'  Triggered by a startling scene in the movie I was soon off the seat and floating high above the chairs spinning around with the lights dancing mystically around me. ",
  "I was frightened for I had few psychadelic experiences before and especially because it was triggered by an acute panic.  Finally as I became more conscious I was so relieved that I made it back.  Proud of my calmness during the experience because my girlfriend right beside me had no idea.  It was obvious that something went wrong during the experience, but the feeling behind the visuals was truly terrifying.  After this experience I begin to question what I can take with Wellbutrin SR and I'd really like to know if anyone else has had strange reactions with illegal and/or legal drugs while on Wellbutrin."
 ],
 "erowid": {
  "id": "15840",
  "citation": " Charlie. \"Confusion/Delusion/Floating: experience with Bupropion & DXM (ID 15840)\". Erowid.org. Dec 7, 2003. erowid.org/exp/15840",
  "substance": "Bupropion & DXM",
  "views": "15611"
 }
}
