{
 "title": "Clusterheadache Suffering Relieved",
 "author": "Bob",
 "citation": " Bob. \"Clusterheadache Suffering Relieved: experience with Mushrooms (Thai) (ID 17931)\". Erowid.org. Jul 19, 2005. erowid.org/exp/17931",
 "substance": "Mushrooms (Thai)",
 "bodyweight": "65 kg",
 "report": "<p>Ok heres my story.  I didnt do the mushrooms for recreation this time, still I had lots of laughs :):):)</p><p>I have suffered from cluster headaches for 9 years now (9 years that I know of, the years before I did lsd or mushies at least once a year).  I used to do a lot of drugs in the past, quit that way of life 10 years ago. </p><p>Then the headaches came, at first I was told they were dental problems, then jaw-problems, then neurological probs, migraine was also on the list, still no name for what I suffer from. Three years ago my doc told me that he suspected I was suffering from cluster headaches, all the symptoms matched.  Since then I am looking for medication that gives me my life back.  My cluster periods take up 9 months out of a year :(.  I tried oxegen, used isoptine till last friday, had prednisolone (that helped for a while, but the side-effects are a problem for me), painkillers are no use for me.</p><p>What I found out for myself is that MDMA gives me 2 painfree days, I still enjoy going to the nice festivals they have here in Europe, 1 pill is good for a total painfree day (even alcohol doesnt cause an attack, but I dont do alcohol anymore, it is not worth the pain).</p><p>A while ago I read the flash posting on the internet, I got really curious about that, knowing MDMA gives me painfree time, the effect from the large doses of prednisolone......anybody who knows prednisolone knows.  So I thought it was worth looking into the mushroom story. </p><p>I did mushrooms 6 years ago (recreationally), very strange, a long clusterfree-period after that (I checked all my doc appointments to be sure). Never realized that could be of the mushrooms, I just thought the wisdom teethvpain was gone.</p><p>Last week I could feel another CH-period was coming, so I went out to get mushrooms (very easy in the Netherlands).  Stopped taking my isoptine on friday (just to be sure, my doc told me to) drank the tea on saturday, since than 1 attack on wed. Thats it.  I havent used use medication for a week now, normally I would suffer big time by now.</p><p>It doesnt happen.  I know when an attack occurs, but it is painfree!!!  So now I am really looking for people who tried all of this......I have some questions, things only a clusterhead can understand. </p><p>I am going to be part of a dutch investigation regarding CH at the university of Leiden, I hope theyll take this serious, don't really know of dutch CH's who tried mushroom tea.</p><p>I have been off medication for a week now, enjoying every day of the week so the psilocybin (actually psilocin is the miracle) must do something!!!  year without cluster.....I would give a finger for that!  The shroom is better :):):)</p>",
 "year": "2002",
 "id": "17931",
 "gender": "Male",
 "timestamp": "2005-07-19T07:00:00.000Z",
 "views": "9190",
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  }
 ]
}
