{
 "title": "Green Ambrosia",
 "author": "Chernobyl's Symphony",
 "citation": " Chernobyl's Symphony. \"Green Ambrosia: experience with Absinthe (ID 17945)\". Erowid.org. Oct 7, 2002. erowid.org/exp/17945",
 "substance": "Absinthe",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 oz",
   "oral",
   "Absinthe"
  ]
 ],
 "report": "<p>I've read and researched a great deal on the experiences obtained with the use of Absinthe.  Most, it appears, seem to have originated from the feeble mindset of the Prohibitionist who declared the substance to be illegal a century ago.  The exaggerations of lunacy and homicidal tendencies are trademarks of these stories.  Nonetheless, I developed an interest in the production and certain consumption of the liquid as I continued my research.  One night I stumbled upon several recipes for Absinthe and decided to give it a shot.  I was wanting to experience what the poets of old had experienced and to verify the mad ramblings of the prohibitionist were incorrect.</p><p>After adding the wormwood and other ingredients, allowing it to set for a week, I mixed roughly four ounces of the liquid into a couple ounces of Sour mix and floated it with OJ in order to offset the bitter (yet tollerable) taste of the Absinthe.  I had drunk nothing previously that day and had little on my stomach so that I could better differentiate the effects of the wormwood from that of the vodka into which it diffused it's essence.</p><p>20 minutes after ingesting the mixed drink, I began to experience a sense of euphoria beginning in the back of my head and 'washing' down my body to my feet.  It was warm and although the effects were blissful, there was no compromising of my equilibrium.  My body felt light (or a 'body buzz', somewhat like the effects of hallucinogens before the 'trip') and the sensation of inspiration noted by the poets was experienced.  My body was warm and comfortable and the overall effects were obviously not from the alcohol percentage of the vodka.</p><p>Although the effects were relatively shortlived, I look forward to more experiences with this green ambrosia throughout my life.  A danger?  A life-threatening concoction brewing insanity?  Both accusations are best labeled to those who speak them.</p>",
 "year": "2002",
 "id": "17945",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-10-07T07:00:00.000Z",
 "views": "12745",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4 oz",
   "administration": "oral",
   "substance": "Absinthe"
  }
 ]
}
