{
 "title": "Something to Try",
 "author": "Timmy the Tooth",
 "citation": " Timmy the Tooth. \"Something to Try: experience with 5-MeO-DMT (ID 17941)\". Erowid.org. Oct 5, 2002. erowid.org/exp/17941",
 "substance": "5-MeO-DMT",
 "bodyweight": "140 lb",
 "report": "<p>I really had nothing to do one night, and my friend had been raving about this drug he had tried. He gave a little background on it and I said 'What the hell'. We continued to crush what we believed to be approximately 25mg. into two lines. This was my first time insufflating anything, but I knew that I was to expect a burning in my nostrils and the ever so dreaded nasal drip. I blew the lines, one in each nostril, and sat back in a chair, listening to 'Blinded By the Light' by Manfred Mann.</p><p>I began to feel a sensation in my mouth, and by 'clanking' or 'chattering' my teeth, I would experience a very pleasing wave of sensation throughout my mouth and head. All of a sudden, it hit me with a rush. My enter body felt as if waves of energy were hitting me and my hands began to shake. I felt confined and uneasy, because of the small room I was in, and went to the bathroom thinking that I should vomit. One point I should add is that I do not suggest eating any time prior to trying 5-MEo-DMT, as feelings of nausea are common. I forced myself to throw up, thinking that I would feel better and enjoy the trip/experience more. As I tryed to vomit, I could not concentrate. The trash can looked and felt as if it was vibrating around the floor, shaking non-stop.</p><p>My friend calmed me down as I asked him if I was going to need to go to the hospital(thinking that since we didnt REALLY know how much I had ingested, and at my body weight, maybe I was overdosing...keep in mind that I hadnt done my research on the drug). After I calmed down, the experience was extremely enjoyable. I felt as if waves of energy were hitting me, and my touch/feel was very sensitive. I held a cold coke in my hands trying to open it for a few minutes, but couldnt for some reason. I think I just really liked the cold feeling. After the plateau, the coming down was pleasant and the effects eventually ended. I didnt have an 'out of body experience' but I did learn a valuable lesson. Do your research, and know what to expect. My experience would have been much better if I had not just rushed into the occasion to get fucked up.</p>",
 "year": "2002",
 "id": "17941",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-10-05T07:00:00.000Z",
 "views": "7690",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
