{
 "title": "An Inner Door",
 "author": "GoldenDawn",
 "citation": " GoldenDawn. \"An Inner Door: experience with Salvia divinorum (5x extract) (ID 17949)\". Erowid.org. Oct 7, 2002. erowid.org/exp/17949",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "report": "<p>\nI have had many experiences with Salvia, and I wanted to add my two cents.  First I think it is important, when figuring out what to think about a particular drug to factor out all the experience reports where people are using multiple drugs.  While this is fascinating to duplicate the combo, it does not exactly give a clear picture (and frankly I question the wisdom/sanity of people who do GHB/acid/X/speed/coke/weed/AMT/DMT/nitrous/and salvia all in one night.  What does this tell you, but that they are freaks?  It is important to know what a person has handled in the past. </p><p>I have done LSD bout 300 times mostly in my 20s, MDMA bout 20-30 times, ketamine IM 10-12 times, DMT 5 times, marijuana countless times, at times daily for years, but now 1/week, alcohol many times (of course), shroom 20 times.  My faves are marijuana (1) and LSD (2) with X a close 3rd depending on my mood.  DMT is a little tense and chemical.  And with shrooms someone around me always seems to flip out and I waste my high babysitting :(  Anyway, I have smoked salvia from a bong -- always the 5x -- about 10 times.  In short, it is remarkable, eye opening, mystical, visionary.  But I haven't done it in a year, as it is NOT a party drug or terrible addictive/quickly desired to be reproduced experience.  Very interesting and fulfilling, but always a tad scary and a slice of psychotic.  I find a ritual (mantras helpful for me -- my wife prefers native american rituals with it) important.  It probably doesn't matter what ritual, just something to frame this shit with.  Basically, I found it possible to sense the presence of odd cheering creatures (elves, ancestors, whatever . . . all depends on your background what you call them or see them as). </p><p>While frightening a bit, it's tended to result in 1-3 days euphoria.  I get 5-10 min of full on vision (not visuals -- visions -- like shamanism this is KEY) then like 10-20 min of old-fashion trippy visuals.  But at that point, after the first rush (a litte like DMT but so organic I think of shamanistic or magickal elements like ancestors or spirits rather than elves/aliens/insects like with DMT) the whole trippy part really seems like sobriety, and I mostly use it to talk or write the experience with enthusiasm.  To say more is pointless, try it, have a sitter (i'd say 1/10 go f'in mad, but short, over, and no side effects -- most won't come back so that's fine).  In general, I tend to feel like I'm learning from some plant intelligence. </p><p>It's not that interesting though despite my description, and eventually seems as hollow as any non-scheduled drug experience (i.e. the AMT, 5-meoDIPT, salvia crowd which I neglected to mention earlier ive tried once a piece but salvia).  Frankly, there is a reason why schedule one is schedule one (i.e. ganja, acid, X) they ROCK.  salvia very different in effect, but similar in spirit to my IM ketamine experiments, that is great interest, glad I did, learned something, but ultimately like sniffing glue or something, a chemical alteration of a deliberate nature, not of the depth and beauty of a schedule one substance that weaves its way into my life with all its fingers.  I can write great poems, see the nature of reality, realize that's bullshit too, and chalk it up to one of the experiences of life.  But ultimately, I think there's a reason why one can get this in a magazine, but you can't get a real schedule one substance, its just not the real deal.</p>",
 "year": "2002",
 "id": "17949",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-10-07T07:00:00.000Z",
 "views": "6431"
}
