{
 "id": 17957,
 "title": "Confronting the Shadow",
 "date": {
  "submission": "2001-05-09T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "MSaso",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "sublingual",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Set: relaxed but somewhat dysphoric mental set. I decided to explore a psychedelicized state in an effort at gaining some insight into the blahs that had been hanging over my soul the previous months.",
  "Setting: Home, comfort, candles and incense, safe space.",
  "Experience:",
  "9pm: 12mg 2c-t-2 aqueous solution was held under the tongue for 20minutes, then swallowed.",
  "9:45pm first alert. Like on MDMA, deep breathing became extremely enjoyable.",
  "10:30pm I was definitively altered, at a ++, still going up, teasing the edges of a +++. Mild visual trailers. General feeling of anxiety. I felt like I didn't know what to do with myself. I didn't want to read, distract myself in any way, yet I was also curiously avoiding the psychological issues that I had told myself that I wanted to explore.",
  "12:00 (ish) felt the sudden urge to burn some incense again, center myself, and take out some spiritually meaningful and grounding objects (such as an old bundle of sage, some ceremonial objects etc...)",
  "Shortly thereafter, I realized that the crux of my generalized dissatisfaction with life stems, at the most basic level, from not being satisfied with myself, which in turn, results from not completely accepting myself. I started focusing on all the things that I reject in my self... all the doubts, anger, even hatred at certain parts of me. All these strong emotions that I realized I had repressed for years, had been locked away and allowed to slowly grow, in a gradually overflowing emotional closet, until the very hinges of this closet tired under the pressure from the inside, threatening to crack and allow its contents to explode to the outside. I was connecting to my Shadow.",
  "Suddenly the combined energy of all this repressed stuff, coalesced, springing to life, in the form of a hideously scary and wicked being. The more I focused, the more evil it got, until I became convinced that I was staring into the red eyes of the devil itself. The visuals were absolutely terrifying. Horns, serpents, menacing teeth, pure evil.",
  "My immediate reaction was to try to banish this dark entity. Incense, prayer, focus... make it go away. But that just made it get worst, more predatorial, more fixated. Wait a minute! I screamed to myself... It is this very energy of rejection that created this being in the first place, whether I was dealing with some external force, or as I suspected, my own inner dark side. How could I be so cruel to myself as to banish a large part of my being to an energetic purgatory such as this? I found myself feeling affection and sorrow for this poor malformed being, and extended my love out to it, as if welcoming a lost and angry child back home. Immediately the visuals seemed to take on a liquid quality. What was fixated and increasingly menacing, gradually melted before my very eyes, transforming into a mass of beautiful blue energy, which then  incorporated itself back into my body. The blue energy coursed through my veins and nerves,  seemingly ferreting out the dark places in my soul and body that had been spiritually or physically (oh... my liver!) damaged from my lack of self acceptance. I received a strong impression that this was just a first step in a process of self healing that would extend way beyond this psychedelic experience.",
  "I was then given a priceless gift: a view into another world, one free of strife and rushing, conflict and disrespect, one I choose not to fully describe out of respect for it's beauty and integrity, other to say that it is a place, either in the spirit world at large, or within a place in my heart, that is perfectly in balance. What I felt then was the futility of rejecting what is bad, in an attempt to make the self better. Clearly, things somewhere are already perfect, I just needed to remember that place, and to live within it, in my every day life.",
  "3am: Needless to say, this was major psychological work. I looked at the clock, as if awaking from a healing dream, rejuvenated, but also physically tired. I promised myself to keep clear of the entheogens until this lesson has fully taken root in my psyche.",
  "4am: deep sound sleep.",
  "9am: woke up feeling physically tired, but no trace of the blues.",
  "A month later, the insights of this trip persist, the depression has not returned."
 ],
 "erowid": {
  "id": "6733",
  "citation": " MSaso. \"Confronting the Shadow: experience with 2C-T-2 (ID 6733)\". Erowid.org. May 9, 2001. erowid.org/exp/6733",
  "substance": "2C-T-2",
  "views": "28319"
 }
}
