{
 "title": "It's Not About Fun",
 "author": "G. love",
 "citation": " G. love. \"It's Not About Fun: experience with AMT & Cannabis (ID 17961)\". Erowid.org. Oct 7, 2002. erowid.org/exp/17961",
 "substance": "AMT & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>Well, this was interesting...</p><p>A friend and I, R, decided to eat approx 80mg apiece of AMT.  Now this is a stupid thing to do, eating approximate doses of research chemicals, but we felt a bit like Leary and Hoffman, etc etc.</p><p>Background: R and I had both had a two experiences with AMT before.  R has taken acid many times, I unfortuately have never been able to get any after numerous tries.  I have Dexed (DXM) several times before, and always had good trips.  I consider my self to be very open to all tripping, and have never had a bad trip on anything.  R feels the same way, so we both figured we were in for a night of fun. </p><p>T+0.00 R ate her dose.  I had done a small ammount the night before, and had some nice rolling effects, but nothing special.  We decide to go for a walk.</p><p>T+0.25 We stop in the store on campus to use the restrooms and get some gummy worms.  At this point she was beginning to feel the slightest comeon, so we decided to get some chewy things.</p><p>T+0.30  Back at the dorm room, R decides she would like someone to trip with, so she coaxes me into eating ~80 mg.  I do so with no problem, and we decide to go for another walk.</p><p>T+1.00  R is starting to have fun, I am feeling a little bit of nausea because I ate quite a bit of AMT with no cannabis.  However, i hold it down and things start to get a little more interesting.</p><p>T+1.15  Back at the dorm, I am beginning to feel much better.  We decide to walk to the store for ciggs and gum.</p><p>T+1.45  Sitting on the back porch of the dorm, R happens to ask a dude for a black and mild.  He says he can get one, and asks if we smoke.  We said sure, and I bought a 3g sack off him.  We proceeded to go back to the dorm to roll a joint, then realizing that the dude had sold us some really fresh, clean, good cannabis.</p><p>T+2.00  We are sitting on campus, smoking a joint, without a care in the world.  People pass us by and we keep smoking without a second glance.  After the joint, AMT started to kick in kinda hard.  We proceeded back to the dorm, where some bullshit with some other people went down and R had to go home.  Her parents had to come get her, and we had a good time chilling and talking in the grass while they were on the way over.  I met her parents and talked to them for a while, they thought i was a really nice guy.</p><p>This is where time began to lose all meaning, so I wont concentrate on that anymore.  I went back up to my room, and having no one to trip with, decided to wander around campus, smoke, and look at things.  When I'm tripping, everything happens to my advantage, it is all at my disposal, so i just walked around and had a good time.</p><p>After a while, i sat down on a bench to stare at a building.  There is no doubt in my mind that at that exact moment, i was the most fucked up person on the entire campus.  That is a proud display in itself.  I was having the most amazingly beautiful visuals, but that was not the best part.  The insane clear headed internal dialogue that kept telling me the secrets of the world was the best part.  The sheer magnitude of the psychedelic experience i had at that moment was the most intense feeling that i have ever had. </p><p>I should also note that i am a premed major with a pharmacology minor, so i do know my chemicals and exactly what they do to the body.  On top of that, i can also know how to treat someone based on their reaction to the drug, as i have worked on an ambulance and know all the proper procedure.  Should you ever get into trouble with any drug, immediately call 911.  I think that is always the best thing to do.  That aside, the setting that R and I were in was particularly safe, and with two experienced trippers we had a blast.  I wouldnt suggest AMT to anyone looking for a roll, or something fun, because thats now what it is all about. </p><p>So please dont mess around.</p>",
 "year": "2002",
 "id": "17961",
 "gender": "Male",
 "timestamp": "2002-10-07T07:00:00.000Z",
 "views": "7972",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
