{
 "id": 17963,
 "title": "Quit Smoking... Works!",
 "date": {
  "submission": "2008-02-11T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Jake",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I had been a cigarette smoker for 4 years and the thought of quitting did not even cross my mind.  One night in late March of this year I was prescribed vicodin for an orbital fracture.  I always dosed two tablets of 5mg/500mg vicodin.  I did this dose two or three times a day for about seven straight days. ",
  "From the first time I dosed, I completely lost the urge to smoke.  In fact since I stayed on the vicodin all the time for a week, I didn't smoke once.  After a week of not smoking I basically lost all urge to smoke, and just an urge to find more vicodin or any opiate for that matter.  Its now 8 months later, and I'm still tobacco free but needless to say I have a few vicodin kicking around.  I decided to write this report because I had always wondered about how easy it was for me to quit and I'm easily addicted to pretty much anything. I saw a report on here where a guy quit smoking when he had a similar experience with vicodin.  Excellent report and you should read that one as well. ",
  "Thanks for reading, this is the first submission on Erowid from myself.  I've enjoyed its information and experiences from everyone for over five years now, and without the help of this site, well I wouldn't want to know where I'd be...."
 ],
 "erowid": {
  "id": "67361",
  "citation": " Jake. \"Quit Smoking... Works!: experience with Hydrocodone  (with Acetaminophen) & Tobacco - Cigarettes (ID 67361)\". Erowid.org. Feb 11, 2008. erowid.org/exp/67361",
  "substance": "Hydrocodone  (with Acetaminophen) & Tobacco - Cigarettes",
  "views": "15093"
 }
}
