{
 "id": 1796,
 "title": "A Dangerous Mix",
 "date": {
  "submission": "2005-08-01T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "RyanG",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "80 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Last night, I had a bad reaction to pot and beer. I have always considered mixing pot and beer to be disorienting, nauseating, and usually pretty sedating, depending on dose. I have had experience with pot for about 4 years, varying from a once-in-a-while smoker to an almost everyday smoker. I am less experienced with alcohol because I never really desired to drink much, only socially on occasion.",
  "The night was the fourth of July, and I was at my friends house. I had purchased four 6-packs of some pounders of beer. It was my friend, W, and my friend's brother M. I was in a happy state of mind, it was Independence Day and we had all experienced some very good fireworks. I was talkative and relaxed. I had just finished five beers (80 ounces) in two hours. I was feeling really good, just slightly sick to my stomach. My friend W goes inside while I stay on the porch talking with his brother. Then, my friend brings out a packed bowl, of what looked like mid-grade pot. I had not smoked in about a week, so I was quite excited to get high again. I knew from past experience that drinking and smoking pot didn't go together too well, but I figured I would just quit drinking if I felt too sick.",
  "We passed the bowl around. We got about 3 hits each. I was staring to feel the effects of the pot coming on, unusually intense. I felt like I wasn't getting enough oxygen to my brain. I felt a heavy feeling all over. I was still feeling good though. Soon after we smoked the bowl we decided to go inside. When I got up, I felt a huge head rush, then my memory skips to me being on the floor with my vision slowly piecing back together, right inside the doorway. I had fallen into some chairs and hit the floor pretty hard. I came to and felt the head rush feeling subsiding. M and W were kinda laughing at me. I did not really feel that messed up to be falling down. I was very surprised to have awakened on the floor. I was only laying there a few seconds I was later told.",
  "So, I got up and said, wow, I don't feel good. As soon as I stood up I got that intense head rush feeling again. I staggered toward the bathroom, which was about 10 feet away from where I had gotten up. My memory once again skips to me being halfway in the bathtub. I had fallen out cold, again. The head rush feeling subsiding slowly. M and W were once again there, and they tried to help me up. I didn't really feel nauseated anymore, just a toxic feeling was flowing through me. I still felt the effects of both the alcohol and pot strongly.",
  "I once again got up and started walking again. I was headed for the living room which was down the hall about 20 feet. I said I could make it there without help. I didn't feel too messed up, I could think normal, but did feel a little unbalanced. The head rush hit me once again. I then wake up again on the floor. M and W ask if I am ok, and I nod, being kind of embarrassed and also surprised that I was fainting. I have never fainted or passed out like that before. They pick me up by my arms and help me into the living room. I sit down, realizing I cannot stand up without getting that terrible head rush. I do not know if this head rush was caused by too much or too little blood going to my brain, but I can guess that my blood pressure was low and my pulse rate was high. I could feel my heart beating very fast. I was feeling much better sitting down. M and W kind of thought it was funny. They told me that when I had collapsed those three times, I 'woke up' seconds later. I assume since I was laying down, from falling down, the blood to my brain returned to normal, and I would regain consciousness.",
  "I started to come down off of the peak of the pot about twenty minutes later, and then I attempted walking again and I was fine. I started to feel some sharp pain on my chin, nose and elbows a little later. I started to get more sober, and I didn't feel the desire to sleep, so I stayed up a while longer. We smoked some more a little later, but I didn't touch any more beer that night.",
  "I am very surprised with what happened. I don't believe I drank too much, or smoked too much, it was the combination of the two that did this. I would like to note that I was on the third story of an apartment building, and if I had passed out on the porch I could have fallen. I think it is very scary that I had collapsed three times from standing up. I didn't just fall down, I lost consciousness, causing me to fall down, obviously. I use extreme caution with combining these two drugs. I think they together negatively affect my vital signs, like blood pressure and heart rate. I am very experienced with altered mind states and would have never thought that I could pass out from two low-medium doses of pot and alcohol."
 ],
 "erowid": {
  "id": "15848",
  "citation": " RyanG. \"A Dangerous Mix: experience with Alcohol & Cannabis (ID 15848)\". Erowid.org. Aug 1, 2005. erowid.org/exp/15848",
  "substance": "Alcohol & Cannabis",
  "views": "12572"
 }
}
