{
 "id": 17978,
 "title": "To Awake A New Person",
 "date": {
  "submission": "2003-08-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Hydro",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": " T+ 0:45",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  }
 ],
 "report": [
  "For approximately two years, I had been studying the use of psychedelics. Surfing the Internet and reading various literatures on the subject. It was something that really intrigued me. Prior to this experience, I had been smoking loads of herb for about five years. I had also dabbled with a few other chemicals such as PCP, alcohol, and Nitrous Oxide. Eventually, psychedelics became a kind of obsession with me.",
  "My best friend, at the time, got his hands on some red gel-tabs and had a small trippin party. It was everyones first time. Later on, he gave me the low down on his experience that night. Apparently he didnt have the best of times, but to me it sounded rather interesting. A few weeks passed, and then one day when I dropped by for a sack of herb he showed me the goods. It seemed he had gotten his hands on a half sheet of dark purple gel-tabs. I didnt have much money at the time, so I only bought two hits. He knew how much I wanted to do this, so he gave me a warning to at least save them until I had somewhere to do them, other then my parents house. He even went as far as to tell me not to take them before I got back to my car either. Boy, did he know me all too well or what? The group of buddies I wanted to trip with were on vacation in Florida for the weekend. I decided I would hold off until they came back.",
  "Later on that night I was smoking the last of my herb when I sat down to admire my acid. Something I still do to this day, btw. I decided it wouldnt hurt to take a small snip off of the corner of a gel-tab and eat it. What could happen? I wasnt sure how I would react to a full gel-tab, so I figured Id simply experiment with a small amount. From what I had read, I estimated a twenty-minute wait before the initial effects of the drug would kick in. An hour went buy and I felt nothing at all. I was a bit disappointed so I took the rest of the gel-tab. Waited 45 more minutes and still felt nothing at all! I was really bumming by this time. Could it be that I was burned on this deal? Some strange urge came over me, and I downed the other gel tab in hopes to feel some kind of a buzz. I sat back and began to listen to some music. Another hour went by, and I still did not feel a thing. Though, I noticed I was still buzzing pretty hard from the herb I smoked hours previous. Thats when it suddenly hit me. This whole time I had been gradually working my way up on the acid. This was no weed buzz!",
  "I began getting mild tracers and feeling rather jumpy and excited. Around this time, my girlfriend was getting home from work as well. I was waving my hands in front of me with a big hysterical grin plastered across my face. First thing my girlfriend asked was if I was trippin or something. I just looked at her with my grin and looked away. She began laughing and we talked for a short while before she finally went to bed. I was starting to get some wild visuals. I was sitting Indian style on my floor, near my wall, watching stand up comedy. All of the lights were off in the room. The walls looked as though millions of tiny creatures were swarming around them. An endless pit that was directly in front of my feet, leading under my TV stand, distracted me. This was so exciting! As I looked back to the wall, it was a new vision. The wall was now made up of some form of white liquid, slowly melting down to the floor. As I ran my fingers through the liquid, and endless array of ripples formed covering the wall, and then fading away. As hard as it was to pull myself away from this splendor, I slowly made my way to the bathroom.",
  "The tiles appeared as translucent covers for the body of water beneath my feet. Small fish, octopuses, and other sea life were swimming beneath the tiles. There were two throw rugs dancing about the floor. As I gazed into the mirror at my reflection, I saw a huge Kool-Aid smile on my face. Eventually, I made my way back to my room and resumed admiring the visuals from my desk chair. My carpeted floor was now a solid concrete covered in horrible insects trying to get me in my chair. Around this time my son woke up and my girlfriend asked me to get him a bottle from downstairs. I walked through the infested flooring and made my way down my steps, to my living room. The only light that was turned on was a small flame light in the bottom of a lamp. The house was pitch black, with an evil looking design illuminating across the ceiling from the lamp. As I made my way thought the room, I felt as though there was something following me. I could sense it was there and visualize it in my head, though I didnt turn around to look.",
  "I went on about my business and made my way to the kitchen. After preparing a bottle, I stopped off in the dark living room. My eyes were more adjusted to the darkness now, so I explored for a bit, stopping off at an old mirror hanging on the wall. I made goofy faces in the mirror and played around a bit before turning around to head back upstairs. When I turned and walked away, my reflection did not. It simply stayed staring back at me. This really freaked me out, so I ran upstairs and gave the bottle to my kid. I was still having a blast. I lay in bed for a while and admired the visuals all around me. Eventually I fell asleep to awake a new person.",
  "This was one of the greatest experiences of my life, and I am grateful to have been able to experience it the way I have. What I learned from this experience was that trippin was nothing like how I imagined it would be, but it was so much then I had ever hoped for!"
 ],
 "erowid": {
  "id": "7821",
  "citation": " Hydro. \"To Awake A New Person: experience with LSD (ID 7821)\". Erowid.org. Aug 12, 2003. erowid.org/exp/7821",
  "substance": "LSD",
  "views": "8318"
 }
}
