{
 "id": 17975,
 "title": "Buzz in Afghanistan",
 "date": {
  "submission": "2010-01-23T08:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Nortyy",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Kratom",
   "form": "(extract)"
  }
 ],
 "report": [
  "Well here I am in a combat zone fighting the war on terror. A little background of my situation is as follows. I'm a private in the U.S. Army reserve currently deployed to a FOB (forward operating base) in northeast Afghanistan. Before I was sent overseas I was on a Suboxone program that was going pretty good. While being deployed here I really wanted to get that ole opiate feeling in me but had absolutely no way of doing that unless I was shot or blown up neither of which would be fun.",
  "Then I remembered as a teenager me and my buddies ordered some Kratom online but I believe that it was fake or very poor quality as it didn't have any effects at all except the placebo. This time while I was here I ordered 20X extract from a vendor I read online I could trust. It also works out nicely that this substance is 100% legal in the USA the US Army and Afghanistan. So even if I was caught with it all I'd have to say is that I don't consume it and they can't do anything about it.",
  "Now for the buzz, the buzz is perfect IMO for the kind of work I do and the situation I'm in. I typically use 1-3 tsp. per dose and I find it's very helpful for the repetitive work I do day in and day out, but the buzz doesn't fuck me up so much that if need be I can be combat ready jonny on the spot.  It's a great way to relax when the days mission is complete or to use to get a days work done while being in a good mood the whole time. I'd say it has motivating qualities of amphetamines and at the same time relaxes me like a good dose of morphine or hydrocodone. No itchyness though. I have shared it with other fellow soldiers and have all good reviews from them. I really can't believe this stuff is legal in the states still. I also have no problem shipping it here and on the customs declaration it just says 'incense'.",
  "All in all this is a great LEGAL substance to have in a situation like this as there's not much else here to look forward to at the end of the day or at any part of the day for that matter."
 ],
 "erowid": {
  "id": "78173",
  "citation": " Nortyy. \"Buzz in Afghanistan: experience with Kratom (20x extract) (ID 78173)\". Erowid.org. Jan 23, 2010. erowid.org/exp/78173",
  "substance": "Kratom (20x extract)",
  "views": "8537"
 }
}
