{
 "id": 17995,
 "title": "Sexy Synergy",
 "date": {
  "submission": "2009-07-17T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "hyperbolic",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "3:00",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "3:15",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "Methylone"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 ],
 "report": [
  "0:00 - 20 mg 2C-I",
  "3:00 - Cannibis (few hits)",
  "3:15 - 180 mg Methylone",
  "I felt compelled to post a trip report of this, not only because it was such a beautiful experience, but because there is relatively little reporting of people taking Methylone after a psychedelic and my experience was so positive.",
  "Me and 3 friends began the afternoon with two of us ingesting 2C-I and the other two ingesting 2C-E. The come up for the 2c-e folks was a mix of Euphoria and what one of them described as feeling 'really weird.' I later found out that the 2c-e produced extraordinary body buzz in this fellow and that he described it as being almost too pleasurable. My 2c-I come up was marked with the usual 'too much caffeine' type jitters and some euphoria.",
  "At about T+1:20 during a nice Radiohead song, the trip came on fast and strong. I was lying down on the carpet staring at a pillar in my buddy's living room that would morph into a swaying jellyfish like object as thousands of gorgeous patterns, rich in color, danced across the ceiling. It is worth mentioning that none of my friends seem to get the INTENSE visuals that both 2c-I and 2c-e cause for me. Yet, I am far more resistant to LSD and Mushrooms than them, go figure.",
  "Once some Massive Attack was put on, the trip reached a whole new level, and during the song 'Angel' I was surrounded by very detailed, holographic images of beautiful, sexy, adorned African women dancing quite seductively. At other points of the trip, I would have hallucinations that included many faces of little African children, sometimes smiling, sometimes crying, sometimes their faces morphing into some twisted caricature you might expect from a Salvador Dali painting. I can't quite say why I have this recurring theme (3 trips now) where my peak is totally dominated by images of African tribes people. I have little to no knowledge of the culture or customs, but it has had quite a profound effect on me. I have rarely seen 2c-I described as 'sexy' or 'seductive' but that is by FAR the most striking feature of my experiences.",
  "At T+3 some Cannabis was passed around and about 15 minutes later I ingested 180 mg of Methylone. Roughly 20-30 minutes later I was lying on the ground and suddenly my body felt very strange. My first thought was that I felt very tingly. That was replaced with the sensation of realizing that I didn't really feel my body at all. Then it suddenly occurred to me to attempt to move my arm, which was not possible. So here I am, floating above my body, listening to more massive attack, having my first out of body experience of my life and I must say; it was everything post-modern writers have ascribed to the word sublime. I was light, peaceful, euphoric, terrified and floored by the awesomeness of the moment. About 30 seconds later, I returned to my body and we walked outside and smoked a cigarette, which caused extreme, and I mean extreme, waves of Euphoria. This was at LEAST as powerful, in terms of euphoria rush, as any of my previous 5 experiences with MDMA, but was not accompanied by the standard desire to dance endlessly or hug everybody.",
  "The rest of the trip was spent with an occasional smoke, periods of lying on the ground in total bliss, which for the rest of the night almost immediately induced an out of body state, and then periods of rather friendly and peaceful conversations with friends about all the silly stuff people fucked up on drugs find quite intriguing and marvelous.",
  "Interestingly, by 11, we were all coming down together, even though I had eaten Methylone and none of the others had taken anything else other than the pot. It seems that the synergy was so intensely strong between the Methylone and the 2c-I; the experience was not 2c-I followed by Methylone. It was 2c-I followed by the most intense 1.5 hours of Euphoria, deep introspection countered with moments of great extroversion all coupled with a stunningly powerful psychedelic state. The view of the outdoors looked as if it was being painted in real time in watercolors. Everything was bright, shimmery and smeared. The air had the consistency of a warm marshmellow (can't tell if I like this analogy but I said it during the trip, so I'm keeping it).",
  "The night ended with some advil, everyone had developed a reasonably bad headache (which I attribute to lack of eating, too many cigarettes, jaw tension and the pot) although certainly people often report headaches with 2c-I. Otherwise, everyone seemed fine. Today I feel quite well and am having a hard time not day dreaming about how beautiful my night was. I have a strong feeling that I learned more about what it is to let go of ones body last night than I have in my previous 24 years of life.",
  "So, sorry the for the long read, but what can I say. This is a combo that I am certainly saving for special occasions. I know many people find one, or both, of these drugs to not be very powerful, introspective, or even fun. But, as I've heard so many times: set and setting, good music, good friends and a willingness to really let go sent me to the most intense, beautiful place I have ever been on a psychedelic. If this wasn't a +4, it was certainly a +++3 . In finality, what a blast!",
  "Take care all."
 ],
 "erowid": {
  "id": "78300",
  "citation": " hyperbolic. \"Sexy Synergy: experience with 2C-I, Cannabis & Methylone (ID 78300)\". Erowid.org. Jul 17, 2009. erowid.org/exp/78300",
  "substance": "2C-I, Cannabis & Methylone",
  "views": "8132"
 }
}
