{
 "id": 180,
 "title": "Depression Destruction",
 "date": {
  "submission": "2005-07-14T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "One38",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I was clinically diagnosed with Bipolar disorder about 2 months before I had tried acid the first time, and was fearful since I was taking MAOI's, but curiosity got the best of me. My first acid trip was off of one blotter square, and I didn't really think that I was tripping. This was average acid [my experienced friends who took the same stuff said so], but I didn't get any large scale hallucinations, just saw a wave or two on the floor. I noticed that my thought process was a little different. It let me observe my actions and the actions/reactions of others from many different perspectives. This mild trip led me to trying it again.",
  "The second time we got the same stuff again and I decided to take two hits. What a difference it made, but my friends told me that the second time you trip is always more intense than the first [unless you get weak acid]. I had great hallucinations and in great numbers. I would sometimes see skulls and weird faces when I would look at things, which might be perceived as scary, but I have a strong mind and realized it was just a drug. I then began to have extremely deep thoughts about the beginning of time, the creator of this world ['The unmoved mover'], and the many discrepancies pertaining to the real world. These mystical/religious thoughts made me think about my depression and the reasons for it. I realized that my depression had come from my mind thinking downly upon myself, and then it became so strong that it actually became a physical problem. With this in mind I figured that if my mind could create a physical problem, that it respectively can take it away. I took each insignificant bad thought that had built up to my depression and analyzed it, until I realized that life is just one big journey/experiment, or trip as you may call it, and told myself why each painful memory wasn't bad enough to cause myself this mental pain.",
  "After a long meditative cleansing of my mind and soul I felt rejuvenated, as if I had been reborn. I then received one of the greatest feelings in my life I had mentally destroyed my physical depression! The rest of the trip became extremely wonderful, I saw 'happy colors' everywhere, and I even started to geek out for about 15 minutes or so [not exactly sure how long, my concept of time was severely altered]. This made acid become my favorite drug of choice, not including marijuana. My friends told me about the dangers of bad trips and I believe that bad trips can be easily prevented if you have a strong mind/will."
 ],
 "erowid": {
  "id": "10165",
  "citation": " One38. \"Depression Destruction: experience with LSD (ID 10165)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10165",
  "substance": "LSD",
  "views": "4234"
 }
}
