{
 "id": 1800,
 "title": "Hip or Hype?",
 "date": {
  "submission": "2002-07-07T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "bluestemz",
  "gender": "Male",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 mg",
   "administration": "sublingual",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:20",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  }
 ],
 "report": [
  "07:10pm - 4mg 2C-I straight / sublingual",
  "07:30pm - 4mg 2C-I Gelcap",
  "07:45pm - initial waviness",
  "08:10pm - 1st 'yeah, I'm there' color enhancement. Cowgirl in front of me shaking her hips, her bikini top became bright red & her tan skin looks sooo good",
  "09:00pm - puffed brought it out. no real headspace...a plastic 3D effect to all things colorful...buzzing subdermal energy",
  "09:50pm - strong shroom-like breathing, anesthetic numbness in extremeties...good immediate antidepressant effect - no desire...just want to experience clean, pure trip...i turn down nugget cause all i want is this, untainted...i feel as if i could go the rest of my life without desire...no alcohol, no cigarettes, no weed, i don't even care about sex, i feel 'fixed' somehow, as if all my bad habits just whisked away & replaced with an alertness & awareness I haven't felt for awhile. I've noticed the phenethylamines tend to pull me out of the drug haze of other recreationals & kind of 'put you IN life.'",
  "This is what it feels like to be ALIVE, experiencing the moment yet completely aware of your environment. The tryptamines can put me in the moment, but I also tend to lose myself in the psychedelic mindspace created by the breakthough. At this level it is like having one foot in the tryptamine reality & the other in linear reality.",
  "10:20pm - Stretching a lot in between dancing. Working the muscles, healing, twisting the energy throughout my arms and legs. Wringing out stress. Some jaw fluttering every now & then, drinking lots of water, staying hydrated. Not too much visual activity up close, but peripheral breathing when zooming out to a panorama.",
  "There seems to be some effect on innerocular pressure, it feels kind of weird. Falling in love a lot, lots of passion. Just passion though, still no desire/lust. I want to wrap my arms around this girl and just hold her, it's not like I'm running around with a raging boner. In fact, right now I don't even think I COULD have sex if I did desire but I could definetely be very very passionate.",
  "Every once in a while I'll feel a twinge in the lower back, nothing major but I'm aware of it so I wouldn't mix any known hepatoxins with it during the duration or put any excess stress on the kidneys, just to be safe. I had a moment when walking to the bathroom after dancing really hard where I experienced a jolt around the heart that made me pause to catch my breath. It's happened before without drugs & I attribute this instance to overexertion. It's hot, I'm high, and I just danced my ass off.",
  "12:15am - Back @ home base: Early curfew means we get back here in time for LT. Hungry, getting some grub, channel surfing...Lots of stuff is really funny now. Giggling & laughing so hard it hurts sometimes. Contemplating just chilling in the AC & skipping the show since it'll soon be over. Nah, fuck it, gotta be social.",
  "01:30am - I'm pretty much down now, almost no visual activity, the body rush has faded considerably. I have a cider at the bar even though i really don't want alcohol still. Run into a lot of kids I haven't seen since my club days, like 9 years ago. They all look exactly the same & are still dressing exactly the same & I am this completely reborn spiritual entity...I definetely have evolved since those days, I'm not the man they once knew although I am still 'me.' LT is fucking ROCKiN', I'm having an easier time getting my groove on now.",
  "The energy is working synergistically with the residual chemical, but still I think 2C-T-2 is better for that kind of work, this is primarily recreational: a buzz. I was having a really difficult time during some parts of the previous show working with energy, it wasn't flowing to the surface as easily as I was expecting it to, I was used to T2 where by the third hour I am a bright luminous being shooting threads of energy from every pore. This isn't it. It's light, easy. My grandmother could handle an afternoon on this chem at this level & have a great time. Although it feels like a sanitised psychedelic experience, I still don't really trust the phenethylamines too much until neurotoxicity studies are done.",
  "02:00am - last call, so the party must move...be back in a few hours for some final thoughts",
  "06:00am - I have since post-loaded with 5-HTP, which did bring the 2C-I back slightly once it started working. I've also been puffing to try to hold onto the experience as long as possible. I turned on the TV & Alice Through The Looking Glass is on. *teehee* 8) Kate Beckinsale is so fucking adorable, I could spend an eternity lost in her eyes. The movie this time around is a lot more funny whereas watching it with Daisy on foxy was just insane.",
  "I definetely prefer it on a tryptamine over a phenethylamine, it should be a mind fuck. Nevertheless, I find myself crying at the end during the final quote zoom out/fade out. Absolutely beautiful. But I digress, back to chemical observations. It's probably a good thing this chem is primarily isolated right now to a very small core of people in this society.",
  "If it leaked into the recreational drug masses like ecstasy did, I could see a definite abuse potential simply because it's so easy & light compared to what we've been raised on. People would be tempted to bump up or eat more. If I didn't know as much about the known pharmacology of the phenethylamines (primarily the roles of serotonin & dopamine) as I do I would be tempted to take more to try to go back up. All-in-all it's a fun & interesting chemical and I feel blessed to be able to feel it & ponder it's methods & implications, but I don't think I'll miss it when it's gone."
 ],
 "erowid": {
  "id": "15865",
  "citation": " bluestemz. \"Hip or Hype?: experience with 2C-I (ID 15865)\". Erowid.org. Jul 7, 2002. erowid.org/exp/15865",
  "substance": "2C-I",
  "views": "9314"
 }
}
