{
 "title": "Walking Home",
 "author": "PieTaster",
 "citation": " PieTaster. \"Walking Home: experience with Cannabis (ID 18010)\". Erowid.org. Aug 20, 2007. erowid.org/exp/18010",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "2 joints/cigs",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Before I begin this, I want to tell you that I'm affected very strongly by weed, I half-hallucinate almost every time I smoke weed, and I've been having auditory hallucinations more and more frequently, which I love. So, my friend and I went to a beach party, which rapidly descended into a huge sausage fest. As we were leaving, someone else, who was also leaving, asked if anyone had any drugs or alcohol, well we had weed!</p><p>We started smoking, the 3 of us, but were soon joined by 2 others. My friend and I aren't tight-assed about sharing weed, as I've grown some, and it's extremely common where I live. In fact you can get lots of high potency stuff for fairly cheap. As we smoked the weed, we started joking around having fun; we were laughing A LOT at this point, and the folks by the fire, who wouldn't touch drugs with a 40 ft pole, probably started laughing at us too.</p><p>After smoking both joints, and the roaches we joined them at the fire. I sat by the fire, and I remember being totally boggled by the concept of different temperatures; sitting by the fire, 1 side of my body was hotter then the other, and this amazed me. I started looking at my hands, because they were the most affected by the temperature change, and I became amazed that not only could I control them, but that I had not 1, but 2!</p><p>Whenever I'm high, I should tell you now, my vision becomes very affected; I see things on roughly 4 planes, which are fairly hard to explain. The best way, I imagine, is to picture a pop-up picture book. Everything is flat and 2-d, but the things are 'layered' if you will. I am the 1st plane, anything that I'm in (vehicle-wise) immediately becomes the second plane, along with anything near by me. The 3rd plane is for things farther away, trees slightly behind bushes for example, and the 4th is for things quite far away, across water for example. Water by the way, more specifically the ocean, is incredible.</p><p>As the other people around the fire became increasingly amused by the way we were acting, I started to get increasingly frustrated, it sucks being around people like this when you're stoned. So, my friend and I started to leave. We planned to walk back to his house. As I stood up, the hallucinations started, half ones like I usually have. If I look at the leaves of a tree, instead of seeing individual leaves, I see 1 shape, which tend to be dragons, or some other cartoony monster, not evil, just amusing and fun; they can dance, speak, even interact with me; but they can't leave the spot where they're seen. But this time they were almost full-on hallucinations.</p><p>I watched as we walked up the street gnomes appear and dance around, singing songs that would later become the ambiance for life. The strange things about these gnomes is that they were never directly visible; I could only see them in my peripheral vision, which seemed to extend to almost the dead center of the back of my head. As we continued walking, I was amazed watching the trees and bushes near by as they had the same dragons etc. that always populate them; and I enjoyed getting into conversations with them in my head.</p><p>Then came the car. When I'm stoned, I'm terrified of cars. I can't stand them at all. In fact I can barely keep walking straight and keep my cool; if there's a spot to run to where I can hide, I will, and I'll stay there until the car passes. This time it was only the car of a few people from the party, and I was thankful for that. The gnomes had warned me in advance that it would be coming, and so I didn't freak out this time. However, a party had been busted a few nights ago, and there were a few cop cars cruising the area, my friend warned me.</p><p>As we walked along, the gnomes and creatures in the trees all the while keeping me company, I glanced over at my friend. All the colours on his body seemed to merge into one big puddle of colour; I can't really describe it. Everything was properly coloured, but it was also the same colours as everything else. The street, the trees, the light etc. I started to space out watching him, and then I heard the sound of a car.</p><p>This time, it was a cop car; and life immediately turned into a game. In fact, life was the most fun 'game' I've ever played. It was awesome. I was the hero, and I had to avoid the cars, while interacting with everything. It was at that point that I realized that pretty much the whole walk home, I'd been seeing myself from behind, as if I was an invisible camera, following myself.</p><p>We continued along, more cars passed, but I could generally control myself because life was like a game, and I was in control. I didn't have to suffer for my actions, so I didn't care; which in turn totally let me relax. Still moving towards my friends house, I talked to him the entire time, at least I thought. I asked him something aloud, something along the lines of 'That's true eh? (I'm Canadian) and he said 'What? What's true?' I realized that the entire time I had been 'talking' to him in my head.</p><p>Finally, we arrived at his house. It's awesome to go to his house, because he lives in a general store, so we did the usual routine for when we're stoned; Upstairs, grab a movie, some chips, some ice-cream, some candy, and a drink. I think the movie we grabbed was Lord of the Rings.</p><p>Downstairs, in the living section of his house, I asked him if he was burning out, and he said that he had been for about an hour. I was amazed at this, though when I'm sober I'm not, I've gotten used to being stoned way longer, and way more then most of my friends. I asked him to change the song that was playing. He asked me what I was talking about, and all of a sudden I realized that there had been a song playing over and over and over in my mind the entire walk home. More so then that, it was a single section of the song 'Don't Push' by Sublime. We watched the movie, though it was way too long with both of us burning out, so we fell asleep mid-way through it, though the parts of it I saw were incredible.</p><p>As for this trip, it wasn't particularly abnormal for me, I trip out like this all the time off of weed, it was just the most recent, and it was certainly fun. The game aspect was new, and I sure hope I can re-live that.</p>",
 "year": "2002",
 "id": "18010",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-20T07:00:00.000Z",
 "views": "3184",
 "dose": {}
}
