{
 "id": 1801,
 "title": "Higher doses of Cocaine",
 "date": {
  "submission": "2001-06-22T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Coca God",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Helpful hints on setting and atmosphere: a few close friends around (of the oposite sex is usually helpful, physical touch can be very pleasing, although sometimes you might not want anyone around at all, it depends on your preference and state of mind), and a safe situation where you're not likely to get in trouble (paranoia can squash the experience a little),",
  "Coming Up: strange numbness spreading throughout the body, anxiety and eagerness, Nasal Drip Starts, euphoria begins to creep up on you (very pleasant)",
  "Peak-",
  "Physical: Extremely fast heart rate, TOTAL lose of appetite (the very thought of food is repulsive and seems quite Unnecessary), an eagerness about the body (except you'd rather just sit tight and enjoy, it almost debilitates you), it feels like every cell and bone in your body is jumping with delight (although this is more mental, it feels more physical), body tremors and something like shaking throughout the body, deep breathing, Lots of Nasal Drip",
  "Mental: EXTREME EUPHORIA (the best part), Hallucinations(probably the strangest part, they're mostly audio hallucinations, i've had things like dogs running around my house, people yelling at me (very scary) and lots of voices saying things in my ears, stuff blowing up, etc.  Although very rarely i've had visuals (or more like perceived visuals, once i thought I saw a smurf hiding behind my toilet plotting to kill me, scared the shit out of me), EXTREME EUPHORIA (can't say that enough), occasional aggression, sometimes you just can't stand other people, sometimes ya can, aggitation.",
  "Coming Down: very very painful cravings, very irratible, not too social, i suggest some weed, sleeping pills, or heroin would be best, getting up and moving can really help."
 ],
 "erowid": {
  "id": "1587",
  "citation": " Coca God. \"Higher doses of Cocaine: experience with Cocaine (ID 1587)\". Erowid.org. Jun 22, 2001. erowid.org/exp/1587",
  "substance": "Cocaine",
  "views": "16539"
 }
}
