{
 "id": 18027,
 "title": "Effects of a Non-fatal Overdose",
 "date": {
  "submission": "2010-07-28T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Former Opiate Fan",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "2600",
    "grams": 2.6
   },
   "administration": "IV",
   "substance": "Meperidine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "Meperidine",
   "form": "liquid"
  }
 ],
 "report": [
  "After an extremely significant (bad) experience (non-fatal overdose) with Demerol (Meperidine), Im compelled to tell my story to those who may be in a position to take a very high dose of it, at least in its injectable form, which is all I can really comment on.  This isnt meant to be sensationalist but be aware that this particular drug has the potential to cause a great deal of damage and discomfort that can last for weeks afterward. In my case it was administered intravenously, over a 36-hour period. ",
  "Ive been living overseas and I had been using prescribed morphine previously, and Id expected similar results from the Demerol, an expectation that was in part responsible for the complications that I still live with, over two months later.  I found that it wasnt really possible to attain the same intensity of euphoria or other effects of morphine with Demerol, although I did try, too hard evidently.  Further, the effects dont last as long, which is also why I was compelled to take so much of it over a short period.  Id been prescribed 26 ampules of 100mg ea.  I took them all (2600mg) over a 36-hour period, sleeping at some point in the middle and at the end.  Ill note here, and again later, that Meperidine should not be used for longer than 48 hours or at doses greater than 600 mg/24 hours in patients with normal renal function.",
  "When I awoke the second time, my tongue had become swollen to the point that it had actually puckered around the sides, and I had evidently bitten down on the swollen sides whilst passed out sleeping.  I cant be sure but I think I may have had a seizure?  Further, the tip of my tongue was numb and tingling.  The combination of the two effects made speaking a tragically comedic exercise that lasted the entire day. ",
  "My body was sore along my spine, shoulders and rib cage, and painfully so.  When my spine was bent in any position, (i.e.) reclining on my side, getting out of that position was acutely painful, to the point of crying out. ",
  "This was accompanied by random pangs of acute pain (spasms?) that also made me cry out or at least wince and/or reverse exhale when just going through my normal day for about 2 weeks after the incident.  It was so bad that during the first week of recovery I had to slide out of bed into a squat and slowly rise from that position, which was also painful.  I was in a permanently hunched position b/c standing or sitting up straight was too painful.  Further, my right shoulder would give out in a certain part of its radius (i.e.) when trying to remove t-shirts by crossing my arms across my belly and grabbing the bottom of my shirt, and (trying to) uncross them while lifting it over my head.   It would lose the nerve signal or something and my entire right arm would drop, accompanied by an uncomfortable pain.  Then as now, I find this development to be particularly disturbing.",
  "The numbness of my tongue and the swelling subsided very slowly, over a two week period; all the while speaking without a slight lisp was either unavoidable or only overcome with a concerted effort.  The acute spasms of pain in my back subsided over pretty much the same period to the point that it is today, yes, I still have back pain, and Ive been trying all sorts of physical therapy i.e. swimming, yoga, weight lifting et. al. to try and overcome it completely.  My shoulder seems to be healing, or getting stronger but it still doesnt want to rotate through a certain right, over and up movement without wanting to drop down.  When I sneeze or take a deep breath, I can still feel the pain in my ribcage. ",
  "As if that wasnt enough, a bald spot, (alopecia) was discovered on the back of my head when getting my hair cut.  My stylist asked me if I had been doing a lot of drugs, mentioning that her friend who owned a night club had the same problem, as a result of his drug use.  Suffice to say; it was the worst haircut experience to date.",
  "I did some research, and discovered a few things about Demerol that may explain the severe damage to my health Ive sustained since having abused it. ",
  "Unlike morphine, Demerol breaks down into a toxic metabolite (normeperidine) that tends to accumulate in the body as a result of its extended half life. It is classified as a potent central nervous system irritant, rather disturbingly;  hence the maximum safe dosage and duration of administration guidelines (Meperidine should not be used for longer than 48 hours or at doses greater than 600 mg/24 hours in patients with normal renal function) that health care professionals no doubt adhere to.",
  "Obviously, I grossly exceeded these recommendations and basically poisoned myself as a result.  I have ceased the use of all opiates since the incident, which is ironic because now I really do suffer from the back pain that I had been lying about having when originally securing the prescriptions.  I suppose I got what I had coming.  To summarize, taking high doses of Meperidine/Demerol over a short period of time can be a truly MASSIVE mistake with enduring reminders and it is not recommended by this contributor."
 ],
 "erowid": {
  "id": "78578",
  "citation": " Former Opiate Fan. \"Effects of a Non-fatal Overdose: experience with Meperidine (Demerol) (ID 78578)\". Erowid.org. Jul 28, 2010. erowid.org/exp/78578",
  "substance": "Meperidine (Demerol)",
  "views": "10543"
 }
}
