{
 "id": 1802,
 "title": "I Will Never Know",
 "date": {
  "submission": "2007-08-09T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TrIPPY",
  "gender": "Female",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "caps",
    "quantity": "3"
   },
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "unit": "shot",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  }
 ],
 "report": [
  "My sister's boyfriend at the time had bought a whole bottle of G. I had taken it several times before the incident, and the only thing bad that had happened was a stomach ache, so I didn't think anything bad COULD happen, despite what my friends told me.",
  "So one friday night me and my friends went to his apartment to see him and my sister, and we broke out the G. I took 3 caps before my sister got there, and her boyfriend did 2, so did his friend. My sister came home and did 2, and I had to be home in about 45 min. So her boyfriend picks up the bottle and says, 'Fuck this cap shit' and takes a huge swig off the bottle. All 3 of us who were taking it followed suit. About 10 min later I got up to use the bathroom, and I ran into my sister in the hall. We talked for a minute, and she went back into the living room.",
  "I remeber sitting down on the toilet, and leaning my head on the wall when things started turning black. I told myself to get up, I refused to pass out on the can.  I got up, pulled up my undies, and got my pants almost to my knees before I fell over, barely missing hitting my head on the sink as I collapsed.",
  "My sister made it to the living room, and passed out while I was in the bathroom. Everyone was worried, and carried her upstairs. They noticed that I had not come out of the bathroom, and found me completely unconsious on the floor. My body was stiff, but they managed to get me upstairs in the room across the hall from my sister. My friends were worried, they could not wake me up, and I had to be home at that time. I was hardly breathing, and completely pale. I started making gurggling noises, and my friend held my head over a pan in case I threw up. She let go, and I fell face first into the pan from the bed, and still didn't move.",
  "My friends left me there to get one of their cars so they could go home. When they returned 20 minutes later, they found my sister's boyfriend passed out at the top of the stairs, and his friend was gone. They went into the room where they left me to find me in the same state, only sprawled out naked on the bed. They put my clothes back on me and called some friends to come check on me since they had to leave.",
  "I woke up 4 hours later to my sister leaning over me asking me if I knew where I was. I had no idea what was going on or what was happening. My mom called my cell phone, and she had been for the 4 hours that I was out. I drove myself home, and to this day, I don't know how I got home without dying. I was swerving all over the road, unable to control myself or stay awake.\r[Erowid Note: Driving while intoxicated is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I was in so much trouble, I couldn't talk to my friends. I didn't find out what happened to me from the time I passed out in the bathroom till I woke up on the bed until 2 days later, when one of the girls who found me told me.",
  "To this day, I don't know who did it, or what they did, and I never will. No one will admit to it obviously, and my sister refuses to believe that one of her friends would do that to me. She thinks I did it. I doubt it."
 ],
 "erowid": {
  "id": "15872",
  "citation": " TrIPPY. \"I Will Never Know: experience with GHB (ID 15872)\". Erowid.org. Aug 9, 2007. erowid.org/exp/15872",
  "substance": "GHB",
  "views": "4835"
 }
}
