{
 "id": 18035,
 "title": "There Is No 'I' In 'All'",
 "date": {
  "submission": "2010-03-09T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SHADOWMESH",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 tablets",
   "administration": "oral",
   "substance": "Pharms - Meclizine",
   "form": "pill/tablet"
  },
  {
   "time": "2:00",
   "amount": "10.5 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "For the most part, all of my firsthand experiences with Morning Glory seed ingestion seemed to consist of more open-ended exploration and curiosity than of any sort of conclusive arrivals at any profound or useful insight. That is, until yesterday, a passage in time and space through which I became more critically enlightened than I have ever been in my life. I'll do my best to summarize the immensity of my thoughts and feelings linguistically:",
  "Having read the first small portion of Aldous Huxley's 'Doors of Perception' the night before my Morning Glory experience, I knew there would be some potent glimmers of philosophical insight looming in my mind throughout the day. With that as a mental backdrop, I took my dose of 4 Dramamine 'Less-Drowsy', waited 2 hours, crushed up 10.5 grams of seeds (about 350) into some applesauce, ingested, and waited a little while longer until the effects of the seeds began to peak. I then made my way to the state forest and found a nature trail to hike by myself. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I sat in the car at the beginning of the trail and rolled up my windows. The moment I switched off the car I could hear every little bug and pine needle pinging against the car so gently, as well as the distant waves of the river and the sound of the wind. I was surprised at how much I could hear and sense as I just sat perfectly still in my car. Sure, I was hallucinating quite profoundly, but with such vivid and heightened sensitivity. These bugs, I thought, are such odd entities. They're made up of stuff and chemicals, just like me. They're all little 'selves' trying to get to my big, warm, tasty 'self' so that they can survive and do their thing. I realized that I was to them what morning glory is to me. In other words, a skilled organism can extract good 'stuff' from another. But beware! Just like I can prove deadly to a fly by swatting it, this chemical I was experiencing could swat me dead or injure me if I wasn't skilled enough to carefully extract its healthy purpose in me.",
  "My cognition (that is, my thought life) was looping thoughts together in the form of broad-yet-contiguous tangents. This trip began to take on some very fluid cerebral undertones. As I remained in the car for a moment, packing a pipe full of cannabis, my internal monologue remained very clear and highly articulate. I kept thinking of how living organisms are so much like sponges. All living things serve as filters that accumulate and disperse different kinds of chemicals around us, in us, and through us.",
  "I began to perspire, so I left the closed car with my pipe in hand and started the buggy hike. Per-spire, I thought: 'per' + 'spiration' = 'of' + 'spiraling'. Whether this is proper etymology or not, it made so much sense. When I perspire, my sweat evaporates into the air in spiral fashion, just like steam from a coffee cup. 'Spiration.' I then realized the connection between this thought and the concept of living organisms as sponge-like creatures. 'I am a spiral sponge,' I proclaimed aloud. I soak up and filter all kinds of spiraling chemicals and information in time and space with my brain and body. I also give off spirals of chemicals and information for other 'selves' to soak up and filter around. I watched as some flies struggled their way through many spiraling breezes to get to the spiraling chemical 'stuff' they could sense in my perspiration and heat across the breeze. So many spiraling sponges...",
  "I considered that all living things are really just a bunch of converging chemicals given concentrated form. Even my brain and all my parts had another chemical form before I ever existed and metabolized into 'who' I am now. The thing we now call 'self' is really just a small collection of the greater 'stuff' of the universe. I, like the flies, am a single self amidst other 'selves', but we're all just temporary embodiments of the same kinds of elements in one form or another.",
  "That's when I exclaimed aloud, 'I'VE GONE COMPLETELY SANE!' My ego was now quite removed from my mind. I realized my true self for the first time in my life: I have no true self. The thing 'I' thought of as 'self' never really existed. Any 'self' in the universe is really just a complex collection of borrowed, converging forces that temporarily react with each other and make up who I am. Because we all borrow from the 'stuff' of the universe, we are all just strange embodiments of many chemicals that have spiraled together for a time to form our 'selves'. Throughout each and every moment I felt like I was constantly arriving at new destinations of self without ever truly departing.",
  "Suddenly, I swatted a fly, thereby killing it. Odd, I thought, how there is such violent struggle and contention between my 'self' and the way that other 'selves' behave. We're all sponges of spirals, made up of the same universe's chemicals, and yet my self is profoundly competitive on a subconscious level to ward off the spiral sponges I call 'pests' or 'disease', because that's what my 'self' is programmed to do. Why the contention, I wondered? I could conceive of how all things are in a sort of tug-of-war in the universe, bumping up against each other, acting and reacting, repelling or attracting, etc. This collection of thoughts was streaming through my mind as I smoked my pipe and walked on.",
  "That was the bulk of the more meaningful thought loops I had throughout the day. Sure, I experienced the kinds of abstract weirdness that usually takes place during a psychedelic episode. But there was also something so sane about the experience, so completely wondrous and sensitive about it, that I kept thinking about Huxley's words, 'This is how one ought to see.' Not that people should always remain in this state of enlightenment, but that we should always retain the wonder of things gained through such enlightenment, and that such knowledge should be made manifest and integrated into our ways of life as time goes on."
 ],
 "erowid": {
  "id": "78642",
  "citation": " SHADOWMESH. \"There Is No 'I' In 'All': experience with Morning Glory (Heavenly Blue) (ID 78642)\". Erowid.org. Mar 9, 2010. erowid.org/exp/78642",
  "substance": "Morning Glory (Heavenly Blue)",
  "views": "3923"
 }
}
