{
 "id": 18043,
 "title": "Dreaming, with Tremors",
 "date": {
  "submission": "2010-04-30T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Jay Dee Eh",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Pharms - Pregabalin",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1400 mg",
   "administration": "oral",
   "substance": "Pharms - Pregabalin",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Ok well this is my report about my experience with Lyrica (pregabalin).  My first time using Lyrica me and my friend both took 8 100 mg pills (dose=800mg) The effects were slow to come on which I assume was the result of my eating not to long before I popped the pills.   The effects lasted a LONG time with 800 mg, about 12 hours.  I would like this drug if it didn't have a terrible side effect...I'll get into that in a bit.  Ok so let's talk about the effects.",
  "Effects (for me personally) of 800 mg of Lyrica.",
  "-Nice body buzz (similar to weed) that lasted for 12 hours.",
  "-Drunk slight feelings of being",
  "-Walking becomes difficult because of the loss of coordination",
  "-Short term memory is weak.",
  "-CEVs.  Me and my friend turned up the volume all the way up in my car and we just laid back and closed our eyes (this is important).  The song would keep us calm, and we just let our minds wander.  The best way to describe this time would be that our imaginations were on overdrive.  When my eyes were closed I would be taken to different places, and would basically put me in a full fledged dream.  I would actually start to become so involved with the dream I would forget that I was in a car, or even that I had taken I drug. An example of one of the 'dreams' I had while closing my eyes was I was actually in a race (I was actually in a Mario Kart race...I was playing it earlier in the day haha)  When the race began I actually moved my foot in real life as if I was pushing a pedal (my friend told me this and I realized it because I opened my eyes right after I did it) This was the most amazing aspect of the drug, and was why I would up the dosage the next time I tried it to try to get even more amazing CEVs.",
  "-Tremors...Tremors...Tremors -> I can't stress this enough!!! Some people may or may not get them, but I must warn you that it is possible.  With 800 mg the tremors were few and far between, but when they did happen it was unexpected and made me hit the ground multiple times.",
  "Excited about this drug, the very next day we decided to up the dose to 1400 mg of Lyrica.",
  "Effects of 1400 mg of Lyrica...",
  "-Refer to effects of 800 mg",
  "Everything was the same EXCEPT the tremors on 1400 mg had total control of me.  Shortly after taking the pills (about an 1hr 30min) I fell asleep and then woke up about 3 hours later.  So this is 4 hr 30 min after ingesting the pills.  I get up out of bed (the effects are still in full force) and have a tremor that violently slams me to the ground.  I just laughed it off and continued on to the kitchen to get some food, where I would violently (I can't stress this enough...I hit the ground HARD!) fall, due to the random and unpredictable tremors, about 4 times.  The tremors lasted for about 5 hours on and off. ",
  "Now my friend on the other hand had to leave right after taking his dose of 1400 mg which would prove to be a BIG mistake.  He also got the tremors, but unfortunately for him his parents saw him violently hit the ground multiple times and called 911.  He had to go the hospital, but I don't have the details of what happened when he was there."
 ],
 "erowid": {
  "id": "78697",
  "citation": " Jay Dee Eh. \"Dreaming, with Tremors: experience with Pregabalin (Lyrica) (ID 78697)\". Erowid.org. Apr 30, 2010. erowid.org/exp/78697",
  "substance": "Pregabalin (Lyrica)",
  "views": "14964"
 }
}
