{
 "id": 18070,
 "title": "Overview of the Last 8 Months",
 "date": {
  "submission": "2010-05-19T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Pofacedhoe",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "various ",
   "administration": "",
   "substance": "4-Methylmethcathinone"
  }
 ],
 "report": [
  "<p>An overview",
  "Mephedrone is the stuff of dreams for those wishing to make a quick buck on the RC market today. It is cheap to make (in china - maybe their way of getting the uk back for the opium wars... watch this space), has a short duration of action, is very addictive like cocaine, and has little comedown to put sensible users off (like amphetamine does).",
  "I have used this drug extensively for about 8 months going from occasional to far too regular use. The trick is though that like cocaine all you need to stop is to say no to yourself which can prove a very daunting task. although just say no.",
  "I have consumed it orally (300mg), nasally (50mg, repeatedly), and vaporised it like methamphetamine (this was one experiment but 20mg caused an unbelievably good headrush that puts crack way behind it-tastes like tukish delight).",
  "When snorted there was an intense pain and nasty tasting drip followed after around one minute by the pain turning into pleasure then a slowly building rush, all over my body,  that is so relaxing and fast that it literally takes my breath away.",
  "I can stay up for days on it though it makes me feel quite ill to do so towards the end. I find that it is one of the easiest stimulants to eat on and I drink milk constantly when I am doing it to negate the taste of the drip and give me energy in a non glucose (slow release) form.",
  "Orgasms on this drug are delayed and sexual drive increased so that a 24hour sex marathon is quite the norm if I go there. When I orgasm it feels like my whole body is shuddering and when I do cum it rips through me with such pressure that it is hard to believe what has happened. This is coming from an ex amphetamine addict and we all know how good speed makes sex-this knocks it out of the water.",
  "All in all a very major drug of future abuse but a beautiful one at that.</p>"
 ],
 "erowid": {
  "id": "78817",
  "citation": " Pofacedhoe. \"Overview of the Last 8 Months: experience with 4-Methylmethcathinone (Mephedrone) (ID 78817)\". Erowid.org. May 19, 2010. erowid.org/exp/78817",
  "substance": "4-Methylmethcathinone (Mephedrone)",
  "views": "9060"
 }
}
