{
 "id": 18095,
 "title": "Bizarre and Convincing Visual Hallucinations",
 "date": {
  "submission": "2010-12-19T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "In Town",
  "gender": "Female",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>I have smoked salvia a handful of times, but it only affected me noticeably twice. The prior times produced no effects, probably because I did not smoke it properly (I believe that I may not have heated it enough. Also, I may not have inhaled it deeply enough.)",
  "However, when it did work, I experienced the most bizarre, vivid, and convincing visual hallucinations of my life. I have hallucinated visually while under the influence of marijuana, mushrooms, MDMA, MDA, and DXM, (and tactilely while under the influence of most drugs) but these hallucinations were less intense, because I could differentiate between reality and my experiences.",
  "I was sitting in my college dorm room in the evening with my boyfriend. He had brought me a bag of x20 salvia, which we decided to smoke out of a pipe while sitting on my bed. I was nervous beforehand, because I had spent time with tripping people and heard stories from friends about the severe nature of salvia trips. I had also smoked it once earlier, with moderate effects, but that was in conjunction with alcohol and marijuana. I had felt as though I were a 2-Dimensional character sinking into my surroundings, but I had felt comfortable and conscious of the fact that I was fucked up.",
  "In my bedroom, I smoked two hits to no avail. I smoked a third hit, inhaling very sharply and holding it in my throat for at least ten seconds. I looked out my window and noticed three girls walking on a path underneath me. I thought, This isnt working again. But as I turned to look at my door, my mouth dried up and the room segmented into parts in sync with my head turns. Three segments/head turns later, I was looking out the window again  the girls were gone, but I could still hear their voices. A birthday card with three Disney princesses sat to my left, and when I glanced at it, the girls voices suddenly belonged to the paper princesses. Looking back at the door, I imagined their voices just outside and waited for several seconds for them to walk into my room.",
  "I turned forward to look at my boyfriend. His head was patterned with many small, square, repeating diagrams of his face as if they were painted on a descending ladder. I focused on each diagram, seeing relatively tiny boxes of his face, approaching me with each descending step. This was very real and scary to me, so I closed my eyes, and laid down. I repeatedly mumbled that he needed to stop, and that everything needed to just stop. About thirty seconds later, I looked up and the ladder patterns were gone. However, I could only see portions of his head (one ear, half the face, his nose and half an eye, his chin) at a time. Once my vision returned to normal, I laid down again.",
  "I dont remember what I thought about with my eyes closed, or for how much time I laid down. Likely several minutes later, I looked up and the first thing I saw was a cupcake. I grabbed it, and hoarded it behind my head. My boyfriend was very hungry, so he tried to wrestle with me for it, but I was so desperate to eat it, that I shrieked, Let go of my little baby! Dont come near my damn baby! I was convinced that I had produced the cupcake and that he should not be allowed to share in the treat. I ate it really quickly.",
  "Unfortunately, I have little recollection of what I did or thought next. We probably smoked a bowl of weed, and then invited my friend over. She came, smoked a few hits of the salvia, freaked out that the room was a book closing on her, and shuddered in the corner.",
  "Once the effects had almost entirely faded about two hours later (?), the three of us stumbled around the school with our sober friends and devoured a pie of pizza.",
  "Although salvia was certainly not the most enjoyable or powerful recreational drug I have used, it produced the most vivid and convincing images I have ever seen. I would not like to use it very often, but as it may be illegalized soon, I plan to buy a fair amount for potential future use.</p>"
 ],
 "erowid": {
  "id": "78998",
  "citation": " In Town. \"Bizarre and Convincing Visual Hallucinations: experience with Salvia divinorum (20x extract) (ID 78998)\". Erowid.org. Dec 19, 2010. erowid.org/exp/78998",
  "substance": "Salvia divinorum (20x extract)",
  "views": "3704"
 }
}
