{
 "id": 18108,
 "title": "Physical High",
 "date": {
  "submission": "2010-01-02T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Justin",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Argemone spp. ",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Argemone spp. ",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I didn't see any information on Prickly Poppy so I decided to test it out. So I bought an ounce of Prickly Poppy foliage off of an online smoke shop. I gained interest in Prickly Poppy after hearing about it from a friend. We went camping in the desert, and found some growing wildly on the side of the road. Prickly Poppy supposedly grows all over the deserts of the south and southwest. Whenever I find myself driving around Borego Springs, in California, I keep my eyes open for a white flowering plant growing on the roadsides.",
  "The high of the Prickly Poppy is surprisingly similar to Cannabis. It gives a warm, buzzing sensation in the chest area, similar to a body high from Cannabis. Some sites online said that it produces euphoria, but I have to disagree. There was very little euphoria, the high was not mental at all, and more physical. It is short lasting, only about an hour long.",
  "The seeds are believed to give a psychedelic effect when smoked, but I found this not to be true, seeds are more potent than the leaf material however. They tend to explode when heated. Some sites also say that Prickly Poppy can only be smoked once a day, due to some sort of rapid tolerance. Personally I have smoked prickly poppy numerous times a day and felt the effects, but they were much less pronounced.",
  "Overall Prickly Poppy is a good legal high. Very relaxing, would mix very well with cannabis."
 ],
 "erowid": {
  "id": "79100",
  "citation": " Justin. \"Physical High: experience with Argemone spp. (Prickly Poppy) (ID 79100)\". Erowid.org. Jan 2, 2010. erowid.org/exp/79100",
  "substance": "Argemone spp. (Prickly Poppy)",
  "views": "12539"
 }
}
