{
 "id": 1811,
 "title": "My Mind Is Blank",
 "date": {
  "submission": "2007-06-16T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jeny",
  "gender": "Female",
  "weight": 48
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "Flunitrazepam"
  }
 ],
 "report": [
  "The first time I took Flunitrazepam was funny. They were brought by a friend who came and picked me up at school. We left to a rather smallish town afterwards and I took a pill. Never in my life I felt really sleepy, I could sleep anywhere! So it was in the laps of my friend at a bar. I woke up and was semi-conscious. My friend liked me so therefore he had paid for our trip out of town. But I liked his friend and we started kissing. The guy left us and we came to realize that we had no money. We had to do something in order to get back into town, so we started stealing, we would go into stores and get perfumes, what ever we could.",
  "I remember liking this particular teddy bear and I put it inside my bag, the owner of the store saw me and took the teddy away and started shouting at me. I didnt care about anything in that moment, the world was mine and nothing else bothered me. Flunitrazepam sort of blocks the consciousness I have towards people, certain rules I just have to follow are blocked, the world is mine to do as I wish.",
  "So we just left, we kept on stealing things, my bag was full of useless things, all robbed. I didnt feel any fear or shame in doing it, it was very natural, no nervousness. That is why almost no body saw us. Eventually we got into town after selling some dishes to some people walking. I took a couple afterwards, once I took 3 and had a beer, I couldnt walk or talk, my legs felt weak and I fell to the ground. Thankfully there were friends there to help me, anything could have happened, I could have gotten raped, what ever.",
  "My last experience was when I bought 10 with a false prescription. I had taken 3 at first and was dancing, ordering my room. The next thing I remember was my mom sitting next to me besides my bed. I had been doing lots of stupid things the night before. My mom had taken pictures and she said I was crazy. I played the piano like a madwoman, I put on some very strong make up and wanted to go out, my parents didnt let me out, so I grabbed a ladder to escape! These are the things my mom tells me, I am pretty sure it was a hard night for them, they didnt let me out, who knows what would have happened.",
  "I dont remember anything about that night. She said I later crashed. I remember asking for my pills when I woke up. I told my mom the pills were to kill my menstruation pills and she gave them back to me. When I look into the strap, there were only 3 left. I had taken 7! I convinced my mom I was OK to go to school, I took the last three, I was still on the high. I dont remember what happened at school, but I know I had to meet some friends but didnt. People realized I was on some kind of drug and told me the next day. I dont remember anything."
 ],
 "erowid": {
  "id": "15923",
  "citation": " Jeny. \"My Mind Is Blank: experience with Flunitrazepam (ID 15923)\". Erowid.org. Jun 16, 2007. erowid.org/exp/15923",
  "substance": "Flunitrazepam",
  "views": "12418"
 }
}
