{
 "id": 18127,
 "title": "The Three D's",
 "date": {
  "submission": "2009-11-20T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "NDE",
  "gender": "Male",
  "weight": 72
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "DOB",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "DOx, Diabetes, and Death (Luckily, the latter never occurred)",
  "This is a report about the scariest experience I have had, whilst tripping on 2 blotter hits of suspected DOB, sold as acid. Marquis reagent seemed to confirm DOB and neither 2C-B nor LSD. I will be writing from my point-of-view, as the female subject would be uninterested in writing a report.",
  "Subject Info:",
  "Alias: Lane",
  "Age: 15",
  "Weight: 98 lbs",
  "Height: 5'2'",
  "Prior Exp.: MDMA, ecstacy adulterants, marijuana, heroin, mushrooms, and Coricidin",
  "Diagnosis: Type II Diabetes",
  "Dosage: 2 hits of blotter",
  "My friend Lane and I, along with 2 other friends, decide to procure and proceed to drop 2 hits each of blotter-paper. Before the drug kicks in, I decide to drive up to my local metro area to visit a few common hang-outs and relax. Unsatisfied with anything, I decide to sit in my parked car. Lane begins to freak out as she doesn't believe she has anywhere to sleep tonight, and I dismiss it simply as anxiety during come-up. I cannot drive with her freaking out and when she eventually calms down I drive back to the city in which we live. On the drive home I note that she appears suddenly very lethargic. I'm wholly unfamiliar with symptoms of high or low blood-sugar, but feel as if something is definitely wrong.",
  "By the time we arrive to the house, Lane is going in and out of consciousness, and when she is conscious, I note tremor and/pr ataxia. My friends and I are by now coming up quite hard, and I can tell our decision making is quite poor. One of my friends suggests that perhaps she just needs to sleep, and I try, despite my altered-state, to explain that while unconsciousness is common with alcohol, a psychedelic causing such symptoms probably indicates a serious medical problem; I believe this explanation saved her life.",
  "I attempt to check her blood sugar, but receive an error on the glucometer. Lane is having trouble drinking and swallowing a sugar-water solution so I decide that if she is to get any sugar, it may have to come from an injection at a hospital. She does not like the idea at all, and stays conscious enough to be very combative. I threaten to call an ambulance if she does not get into the car.",
  "Finally we get her into the car [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]. We bring the sugar-water and she seems to be doing a bit better with swallowing. When I pass by Kroger, I decide she's well enough to simply take a glucose-tablet. A friend and I go in and ask for glucose-tablets. It being late, and us having dinner plates for pupils, the lady assumes we're looking to get high and tells us the pharmacy is closed for the night; she wont believe us that they aren't behind the counter. The exact story included bringing Lane back in with us to try to find them, and failing miserably; I'm surprised the cops weren't called on us. Whatever, they don't have them, next option. We go to a 24-hour restaurant and Lane downs some sugar-packets and a bit of a milk-shake. I could tell she was improving, as she was now consistently alert.",
  "Eventually, we end up back at the house and decide to check her blood sugar again for good measure. It reads: '83'",
  "If you know anything about diabetes or blood-sugar, you know that blood sugar level is supposed to be between 80 and 180 at all times. Low blood sugar will kill you within 3 hours and high blood sugar will take days if unmanaged. After 1 sugar water, a few sugar packets, and a bit of a milk-shake, it was only up to 83. This reading is what leads me to believe that, if we had just let her 'sleep it off' so to speak, her condition would have continue to degrade.",
  "She had taken an X pill the morning of this experience, but I don't know if this had anything to do with her condition. I really am not sure to what I should attribute her very low blood sugar, but would be interested to see if any other diabetics report similar symptoms.",
  "In conclusion, a warning: Be cautious about taking any substance alone, or with people you don't trust, or with a preexisting condition if you do not know how the two will interact. I have a feeling this situation would have been much, much worse had I not recognized the lethargy as something both uncommon and possibly life-threatening."
 ],
 "erowid": {
  "id": "79215",
  "citation": " NDE. \"The Three D's: experience with DOB (sold as LSD) (ID 79215)\". Erowid.org. Nov 20, 2009. erowid.org/exp/79215",
  "substance": "DOB (sold as LSD)",
  "views": "10642"
 }
}
