{
 "id": 1812,
 "title": "The Fear In Amsterdam",
 "date": {
  "submission": "2005-07-27T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Kannabizz",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "It was my second excursion to the city of sin, Amsterdam. Three of my friends and I decided last minute to go for a nice long weekend in Holland as they had heard all too much from my last experiences and wanted to see for themselves. We arrived at Schipol airport at approx 11.00 am. My friend and I were staying in Amsterdam centraal, the other two were at the airport hotel. So we went our separate ways and agreed to meet in 1hr at a well-known Coffee shop. So we sorted our lives out and went for a few smokes at the rendezvous point.",
  "Two hours later no sign of em, so me and my newcomer friend went to see the sights. We came across a smart shop run by an old Dutch couple. They were very helpful and so came to the decision of eating some Columbian shrooms (3.00 pm). So away we went for a small wonder. After about 15 minutes we were so anxious to get em scoffed that we decided to go to the hotel and get the trip underway. I had previously done shrooms on the last visit but in a milder dose plus the previous time I was too stoned. This dose was for two people, so we whacked half each on a Big Mac and struggled to stomach it but did. Off we went out on about.",
  "We came yet another smart shop, this one rum by one Dutch guy. We werent really feeling the first shrooms so decided to dabble with some different ones. I have done LSD, E, before so I though nothing of it. We ended up buying two baggies of 'extra strong mushroom powder'. That was it - no name, no dosage just a standard baggie with 'Extra Strong' written in marker pen. Usually in the dam, shrooms are well categorised and boxed with guidelines from the assistants. But we thought what the hay.",
  "We wondered ever more about the streets of Amsterdam until we spotted a nice coffee shop/bar. In we went, skinned up, got a strong coffee, poured in one and half of the baggie of powdered shrooms and down the cake hole (04.45 pm). Within twenty minutes, usually takes longer, we were feeling incredibly light hearted, very giggly. The noise and commotion of shop was too much for us so we decided to head back to the hotel. Along the way, it began. The giggling was bearable at first, everything we saw seemed hilarious, cheeky and surreal.",
  "As the trip grew stronger, so did the laughter. Anything that came out of my mouth my friend would burst into laughter. It wasnt so bad for me but my friend just couldnt contain himself. He started to feel like everyone was laughing at him at a zebra crossing, sure enough one person was but not everyone. So I reassured him, he was getting quite uncontrollable with laughter, and this started to worry me. After what seemed like hours of walking we eventually found the hotel, giggled our way past the lovely ladies at reception, up 200 flights of stairs (four) and into the room. It was a basic room, two single beds, a bathroom, a TV and slightly angles print of a Van Gogh.",
  "We both flopped on the beds and tried to compose ourselves. Everything was still and quiet, sanity for a split second. We lay on our beds still exploring our new found perspective. My friend decided to go to the toilet  he came out looking slightly worried but still with his cheeky grin. His eyes had swelled up like 2 pennies, black and dilated. Dont go in there, he said!",
  "So sure enough I got up to go to the toilet also. I turned the light on and opened the door. As I entered, a roaring fan started, I stood looking in the mirror, my eyes huge, glary and jet black. My skin was pale and clammy, I didnt look well and with the confusion of the new surrounding, the chaos and mayhem in my mind increased by a notch. I finished urinating and looked down at the floor. Chequered black and white tiles. WOOOOOOWWWW!!! I stood staring, the walls began to twist as they got higher, the floor uneven. The white tiles began to sink and the black started to raise, vivid as day. There was no pattern, all of the black tiles were different heights and the white sinking forever. I had never thought mushrooms would create hallucinations as intense as this.",
  "I left the bathroom and went and sat on my bed, my friend was still laughing, anything I said and did triggered him off. Through his laughter, he sounded worried, unable to stop laughing, crying, but with laughter or pain? Is he OK? This was his first time, did he have too much? Questions began poring into my brain  one after the other.",
  "We both lay on our beds, sheltering our senses from stimulation. I wasnt laughing at all, my friend still was occasionally, annoyingly. We turned on the TV and gazed. I sat tight, got comfy, and tried to let go a bit. My eyes were unable to focus properly gazing at the TV, strange noises emanated from the corner  the room stretching forever. We decided to skin up to chill wee bit, as I was smoking and my hand crossed my vision to take a toke, traces of my hand would follow, one after the other for a number of times.",
  "As the night went on the visions continued, everything stretching and swelling. When ever I would close my eyes, I would completely forget were I was and be transported to were ever my mind took me. At home, in bed, insane in high school, in fictional landscapes. I actually thought I was there  the anxiety continued. Confused and not being able to tame, control or conjure up my thoughts, my mind was possessed. This continued through the duration of the evening  the night was lasting forever, my friend was not laughing anymore. His eyes fixed on me. What was he looking at? Fear and loathing filled the air. Chaos.",
  "IM LOSING MY MIND, what felt like days after ingestion of the poison and still no sign of coming down. My friend was fixed into a trance with the TV. At about the peak of trip my senses were totally intertwined. I could not place were sounds were coming from, behind me? I was leaning against a wall. Seeing sounds and hearing sights. This, I concluded was the pinnacle in my trip history, a real journey. I had done a lot of research into hallucinogens, LSD, mescaline, the inner space, etc. But this information seem to make my trip more intense.",
  "At this height of my trip my friend decided to do the rest of the baggie. I began to not only worry about my own sanity but my friends also. I began to get very worried. Thoughts were shooting through my brain at a rapid rate. I sat tight, took a hold of my glasses, everything became so distorted, I could not pick out anything. I felt, when in a certain position, kinda relaxed. I began to feel a bit more sober, but the trips kept coming back in waves, gradually getting weaker. When in the smart shop, the first people told us that sugar brings you down. My friend, now feeling the wrath of his latest dose, proceeding to open up four packs of chewits and a big bag of starburst, before devouring the lot.",
  "I was now coming down, drifting in and out of semi sleep mode. Feeling tired I began to drift slightly but my friend would stop eating sweets. I could tell he was wasted. Worried expression on his face, paranoia, he thought he was going crazy too. Franticly eating sweets in threes and fours to bring himself down. Feeling a bit better, I decided to get a drink from reception, I ran down four flights of stairs, stood at reception, the hotel staff knew, I knew it. Staring at me worryingly, they gave me a drink and of I ran back up to our room. As soon as I stopped, sat on my bed. My head literally went up my arse. What was perhaps the last wave of the trip was too much, too intense. I needed to vomit, so I did for 45 minutes, putting my fingers down my throat to make my self bork. Making sure my stomach was empty and rid of psychedelics. I lay on my bed and felt surprisingly refreshed, the purging had made me feel ten times better, physically and mentally.",
  "After a bit of a hazy doze, I felt well, not crazy but still very induced. My friend also now had come down a lot. All I wanted to do was sleep my friend somehow still had a lot of energy. It was now 11.00 pm, Is that it? It had felt like days. A seven hour intense trip. My friend eventually convinced me to face the outside world so out we went. We visited the red light district for some window-shopping went for a coffee and another joint. We ventured back, got some pizza, somehow we were starving, and went back to hotel for a spliff. There we stayed, eating pizza, stoned hazy but perfectly happy. That night I slept like a baby. Through all of the craziness and chaos that had occurred in the evening I felt like I had learned something somehow. It had been beneficial. Never underestimate the power of psychoactive substances. Be wary and comfortable with your surroundings and company. What ever may happen, remember you are on a drug and you will come down, eventually."
 ],
 "erowid": {
  "id": "15925",
  "citation": " Kannabizz. \"The Fear In Amsterdam: experience with Mushrooms (Magic Mushrooms) (ID 15925)\". Erowid.org. Jul 27, 2005. erowid.org/exp/15925",
  "substance": "Mushrooms (Magic Mushrooms)",
  "views": "4287"
 }
}
