{
 "title": "Trapped in the Library?",
 "author": "Gyre",
 "citation": " Gyre. \"Trapped in the Library?: experience with Dreaming (ID 18124)\". Erowid.org. Nov 5, 2003. erowid.org/exp/18124",
 "substance": "Dreaming",
 "bodyweight": "130 lb",
 "report": "<p>Here is a dream come true in my life...It happened today when I rode my bike to the library. The ride was about 1 1/2 miles, not too long but long enough to where I would want to sit down before I went in. After catching up with my breath I got this wierd feeling I was being watched so I looked towards the window behind me, did not see anyone and wondered at my paranoia. I usually have these feelings was it something I should worry about? Hmm, I thought. I looked behind me again at the bookshelves through the window, there was a sign telling what kind of books were on that isle. Fiction. All of a sudden I got this strange vision, it was me trapped in the library staring out the window at a girl sitting on a bench outside, desperately hoping she would not come in. I remembered staring at this Fiction plaque in the dream hoping I would remember it so I could know in real life that this was important. I thought, wow could this have been me? The person inside and outside at the same time?</p><p>Well I was certainly a little freaked out by this and thought it best not to go inside. I knew that by the time I decided to leave to go back home the dream vanished and the girl (me) inside would not know if I left or not. My rational mind kept telling me to not worry, but why would something like this happen, why would I get this vision if it was not to tell me something? I guess that proves my worry wrong that with all the drugs I've done I still have a rational mind left. I know these things can happen, it is not uncommon for a dream to come true but damn it sure is worth sharing and I hope it helps someone besides me.</p><p>Thankyou for reading</p>",
 "year": "2002",
 "id": "18124",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-11-05T08:00:00.000Z",
 "views": "9073",
 "dose": {}
}
