{
 "id": 18136,
 "title": "Long, But Worth It",
 "date": {
  "submission": "2001-07-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Adenosine",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:45",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "After talking to other people about this substance, I decided to take for my first time 50mg AMT at about 6:30 on a thursday night. After I dosed, my friends and I went to the store, to get some books.",
  "About 1/2 hour later, we were back at my friend's house, and I was begining to feel the effects. I was getting kinda jittery, and a bit nauseous. At the prompting of some people on the internet, I took another 50mg AMT.",
  "I was getting very very hot and sweating, so I decided to go to the store and get something to drink. I started walking there, but about halfway there I had to run, I just couldn't keep still. When I paid for my drinks, the person behind the counter asked if I was ok.",
  "I managed to keep from running on the way back to my friends house. When I got back, I looked in the mirror and noticed my pupils were totally dialated. My friends were playing twisted metal black, and it was very loud. Too loud, and it was too bright, and too hot. I went into my friend's bedroom, which was dark, and layed down. My body was hot, but where air was evaporating my sweat, my skin was too cold. This was the first 'uncomfortable' cycle I had. It seemed as if nothing I could do was compfortable.",
  "After a while, I was feeling better, and I went back out. Something inside me really wanted to talk. A friend gave me a trip toy he had got at a rave: a stuffed toy. It was so fuzzy. So perfect. I sat down and watched some of my friends play Magic: The Gathering. About here started the very top of my trip.",
  "I was impulsive. Senses were hightened. I wanted to feel, taste, smell everything. Time was non-exident. Reality and fantasy seemed to have no distiction. I would close my eyes, and be somewhere totally different, doing something, a second later, I would open them, and be like 'that wasn't real'.",
  "Things seemed to have extra emotion attached to them. There would be a comfy, or a fuzzy place, and it would be *perfect*. and there would be a place almost the same, but it wouldn't be right. When I was thinking to myself, other people would enter in, and talk.",
  "After my friends went to sleep, about 3 am, I was still awake and had no thought of sleep. I went on irc to chat. I was getting lonely. I wanted so badly to talk to people, to connect.",
  "At about, 6 or 7, I came down. It was hard to notice because I was laying on a pad, just moving, because somebody was sleeping on the two 'perfect' spots. At about 11:30, I was still getting occational shakes, but I was good enough to drive home. I went to work at 4:00pm, and I still hadn't any sleep. Work was hell! At 4:00, I could almost sleep, but at 5, it was all I could think about.",
  "In retrospect, I shouldn't have done it they day before I had to work. Also, you should definatly do this around others, not alone. You will want to talk quite badly. And, buy some gum, or something to chew on, you will love the extreme mint, and I needed something to chew on bad."
 ],
 "erowid": {
  "id": "7924",
  "citation": " Adenosine. \"Long, But Worth It: experience with AMT (ID 7924)\". Erowid.org. Jul 12, 2001. erowid.org/exp/7924",
  "substance": "AMT",
  "views": "10776"
 }
}
