{
 "title": "Something Quite Stupid",
 "author": "Debaser",
 "citation": " Debaser. \"Something Quite Stupid: experience with MDMA & P. harmala (Syrian Rue) (ID 1814)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1814",
 "substance": "MDMA & P. harmala (Syrian Rue)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  "",
  "3.0 g",
  "oral",
  "Syrian Rue",
  "(powder / crystals)"
 ],
 "report": "<p>Well, 3 days later I'm finally feeling close to normal once again.  Did something quite stupid a couple of days ago.</p><p>Night started off allright. Decided to take it early (around 8 evening) so I would get a proper night of sleep. Took half a tab with 3 grams of syrian rue. Came on in about 15 minutes with a full stomach!! Not normal, but hey, I wasn't complaining. After about 45 minutes it seemed things couldn't get better, beauty everywhere, empathy with my friends, magical music. About 3 hours after dropping it started becoming obvious that the syrian rue had indeed potentiated the experience. I was STILL getting higher, and my mind was more in a state of psychedelic stonedness than entheogenic empathy.</p><p>   It was at this time that I suddenly remembered to take my blood pressure, being quite sure that it was normal. Looking at my arms I soon realised that 'normal' was definetly not the word. My veins felt like they were about to blow up, my nose started bleeding and the fear of death was quite real. I tried to get the blood pressure kit on my arm, started pumping air into it, and didn't even get up to 20 mmHG, my arm swelling up like a water mellon.</p><p>I tried not to panic realising that I really didn't care if death was around the corner. New experience, I thought. About 7 hours after dropping my body was shaking quite frantically, the blood pumping at what seemed like the speed of light. Somehow I managed to take my blood pressure and found it to be at 145+.</p><p>The thoughts were characteristic of 'the dark side of E' and there was absolutely NOTHING that was going to make me feel better. 18 hours after dropping, still no sleep, my pupils were still huge, my face was red as a tomato and the veins were quite obviously portruding from my forehead. I guessed that if I hadn't died yet, I'd probably make it through. Another attempt at trying to get my blood pressure failed, my veins effectively feeling like they'd blow up if I pumped even the tiniest amount of air into the bp kit. I spent the following day, still unable to sleep watching TV to get my thoughts to calm. 2 days later my blood pressure was back to normal (115.)</p><p>Anyway, this was with  1/2 a tab (probably 70-80 mg.) I've never had these kind of effects with any other drugs I've taken with harmala, including 2CB, mescaline, or even cocaine, but MDMA sure did it. I don't think I'm going to try this combo again. Another thing is that there was a very definete negative edge to this combination that I've never felt with MDMA by itself, even in huge doses (300 mg).</p><p>Potentiation was very real and obvious, but not in a good way. Of course, this might be because of the amount I took. Still, experimenting with MDMA and harmala has DEFINITE dangers, be careful out there.</p>",
 "year": "1996",
 "id": "1814",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-14T07:00:00.000Z",
 "views": "18774",
 "dose": {}
}
