{
 "id": 18146,
 "title": "The World Between My Hands",
 "date": {
  "submission": "2003-03-31T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Amy",
  "gender": "Female",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 2:30",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 3:00",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "<p>I've been smoking weed & hash for the past 3-5 years & i've tried almost everything but ACID. I made a deal with my bro 3 years ago that I'd only do it if he was around cuz he has done acid alot, just in case I freak out. I was visiting my bro (E) in US & on 4th Jan 2001. (E) got some Acid we took the first hit around 10:30 pm, E went to spin & I just sat & waited for something to happen after all I've been researching on Acid for almost a year.",
  "12 am, nothing I only had a headache cuz I haven't slept well. So me bro called his friend (K) & he came around 12:45 with some more Acid, GHB & Ketamine ",
  "1 am we took 2 hits each.",
  "2 am, still nothing & I was getting so bored & sleepy the only thing I felt different were colors they were more alive. (K) walked up to me & asked if I wanted more, I Said yes & this time I took 4 hits (crazy I know) but I was starting to feel that this shit doesnt work with me. I was wrong.",
  "3:30 am I started Trippin funny, I was on the sofa & I was a bit cold so I covered myself with a red blanket, 15 mins after that I was laughing & yelling & jumpin my ass on the sofa & when the guys asked me whats Wrong with me I Simply said : there's a fuckin Star Trek episode down here of course I was the hero.",
  "The guys didn't wana leave me long on the couch & they convinced me that I have'nt seen anything yet, So K pulls me & takes me close to the black light in the corner & shows me his Tattoo. Wooooooooooow I couldnt open my mouth I was all eyes looking at the best 3-d tattoo i've ever seen. After a bit of GHB, dancing & beer I was starting to feel funny so I went to WC to wash my face, I locked myself in looked at the mirror & I was shocked, It was'nt me I kept looking at myself 4 a while not knowing that my vision was fucked up not me. It started getting quiet & I thought that the guys left (I was so focused on the mirror that I lost contact with everything but my vision & my reflection on the mirror). I started talking to myself within me & sometime there I just got hot so I decided to sit. 2 mins after that everything was going black, I felt like trapped in a coffin & I choked. 4 a min there I thought I was dying & I calmed down like I never did & then I heard a voice saying hey wake up & snap out of it, you're ok it's only what u took, concentrating on that voice, it was mine!! I donno how that happend then.",
  "I'm sure I forgot a part, I was in there for 5 mins, felt like a year, anyway I dragged myself out & I went out of the house, took the dog 4 a walk etc... When I came back everyone was looking for me they thought I jumped in the lake near by or something I dont remember well but the one thing I wont forget was that look on my bro's face. He asked if I was ok & I smiled back & said, yeah I'm chillin. I had 2 more tabs a while after that.. I've done Acid 13 other times & I still will. You may be asking yourself WHY ?? Simply read below :",
  "ACID is a never ending story, the key to a good trip is inside of me, it takes alot of courage & faith & dont ever let anyone talk you into anything if you're not ready. Personally I dont believe in ADDICTION i think it's all in our head I had second thoughts about myself when my trip went down but instead of passing out overdosed in the tub, I partied for 3 days nonstop.",
  "P.s : I wrote this after having 2 hits & I think i've been writing all that for the past 4 hours, I'm too tired to go over it again, anyway I'M SORRRRYYYY IF I SOUNDED STUPID take care all & dont forget THE WORLD IS BETWEEN YOUR HANDS, WE MAKE OUR OWN FATE & OUR OWN TRIP</p>"
 ],
 "erowid": {
  "id": "7936",
  "citation": " Amy. \"The World Between My Hands: experience with LSD (ID 7936)\". Erowid.org. Mar 31, 2003. erowid.org/exp/7936",
  "substance": "LSD",
  "views": "7773"
 }
}
