{
 "title": "The Honeymoon is Over",
 "author": "PeteSaville",
 "citation": " PeteSaville. \"The Honeymoon is Over: experience with Ecstasy, Amphetamine & Cannabis (ID 18149)\". Erowid.org. Aug 1, 2005. erowid.org/exp/18149",
 "substance": "Ecstasy, Amphetamine & Cannabis",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "insufflated",
   "Amphetamines",
   "(powder / crystals)",
   "",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "",
   "0.125 oz",
   "smoked",
   "Cannabis - Hash",
   ""
  ]
 ],
 "report": "<p>It was Saturday 10.30 pm that I dropped one ecstasy pill. Not really unusual anymore, since Ive been taking either base-amphetamine and/or ecstasy every weekend for over 2 monthsbut the experience that followed has still shaken me, even now as I type this, 9.00 pm Sunday evening.</p><p>Let me tell you about the mindset first. Flashback to Friday night. I scored some base-amphetamine, and got one pill. I saved the pill, did some of the base, drank a lot of beer, had some hash.</p><p>Saturday afternoon, I woke up, felt quite ill, and a little spaced out. But not too bad. Was worth it. However, as the evening drew closer I began to feel a little exhausted, and a little paranoid (probably the a comedown from the base). I was round my best mate, Matts house. My other mates went home, and the night looked dead already. I was annoyed because I still had my pill and a decent amount of base left.</p><p>But eventually me and Matt decided with nothing better to do, wed go to a this guy called Bens house. The plan was to just go there, get stoned in his room, and just chill and have a quiet night. When we got to Bens I was still in a bit of a bad mood because I wouldnt be taking my pill and my base, not too mention pretty tired, groggy, and a bit spaced-out. But I just shrugged it off, it wasnt terribly bad or anything.</p><p>So, we got there about 9-ish, met Ben his mate, Nipper, and also Greg. We started smoking some bongs, etc.</p><p>Then another guy called Ed turns up, we continue smoking hash for a bit, then Ben and Nipper announce they have some pills, and intend on dropping them this night. I had my base and my one pill on me, so I thought what the hell, might as well drop with them later. Ed was also up for it, so Ben sold him one. Matt doesnt approve of ecstasy, so he wasnt interested, and announced he was going home at about 11.00 pm. Now this, for some reason really, really got to me. I was really pissed off deep down because Matt hadnt really stayed out past 11.00pm for well over a month. I began to think how boring he was, and how all he ever did was stay in all the time smoking weed. By this time, I was pretty stoned, and my thoughts became more and more like this. But I contained it.</p><p>At about 10.00pm we all go out and Ed, Nipper , Ben and myself drop the pills at about 10.30pm. I follow this with a small line of base. This is where it started to turn sour.</p><p>Physically I felt fine, I wasnt tired anymore, I was quite alert, quite awake. But when Matt asked is he could gum some of my base , something just sort of snapped in my head. I told him gumming was a shit way to do base, and did fuck all with the pathetically small doses (like 2mg!) that he took. I said it in a subtle way however, masking my real thoughts. I offered him a line, and told him he could stay out if he did a line, because it would keep him awake. He refused, and just went back to smoking hash. I figured, fuck it, Ill be up soon anyway on the pill.</p><p>At about 11.15 pm we all went into town to get some food. Now, pay attention, this is where it gets bad. On the way, I felt the rush from the pill. The buzzing in the back of the head, the increased sense etc. But the euphoria was virtually non-existent. I only felt slightly more happier. Walking through town was terrible. I felt extremely paranoid, anxious, nervous, and very, very sketchy. We went to a fast-food place, I was so paranoid I couldnt buy anything. I just sat at the table feeling really paranoid , people were getting very aggressive outside, it was noisy, lots of drunk people looking for fights. By this time its about 11.45 pm.</p><p>Matt and Greg go home, but I was just too paranoid to go home, so I decide to stay out and hope the pill will get better, and snort some base. But it got worseIt was freezing now, and I felt so paranoid, I thought Ben, Ed and Nipper hated me, so I spoke very little, which gradually got me even more paranoid.</p><p>Eventually we decided to go back to Bens at about 12.45 am. When we got there I felt slightly calmer, but still felt very anxious and nervous.</p><p>I shared the rest of my base, and started to talk a little bit more. But after about 15 minutes I began getting paranoid again. From about 1.30 am onwards, we got through a hell of a lot of hash. I spoke very little, my thoughts were paranoid, bizarre, and my mind raced. I remember thinking all night about each of my friends in my home-town. I remember thinking that all of them hated me, and I thought up reasons why each one hated me.</p><p>But the worst feeling I had was the feeling that I just didnt belong anywhere in this world, even the universe, and I was a mistake in society (I know this may sound weird but how I felt is so difficult to put into words). When I finally got the guts to leave Bens house (about 3.30a.m), I ran all the way home. I dont remember much more, apart from feeling sick when I got home.</p><p>This morning (Sunday), I woke up, and felt very depressed. More so than my usual comedown. I still do feel very depressed now, I also (still) feel quite paranoid too. Im starting to think some of the things I thought last night made sense. I keep asking myself, what if my friends really dont like me?</p><p>This is my first bad experience with any amphetamine, but it really has made me think seriously about my amphetamine use. Something went seriously wrong with my head yesterday, and Im still not sure what exactly caused it, which scares me. Im not sure if its the fact Ive been doing base and ecstasy for every weekend for the past couple of months, but Im sure that is not helping matters. My friend Joe (whos much more experienced than myself) said to me today I probably need a break, and sounded a bit concerned. So, Im going to give it a rest for a couple of weeks, see how I feel.</p><p>I just want to finish by saying a couple of things:</p><p>Firstly, ecstasy and other amphetamines (e.g.base) are hyped-up to be these crazy drugs (mainly by the media) that bring on effects whatever the mood, mindset, whereabouts etc. This is not the case.</p><p>Dont get me wrong , ecstasy is a strong drug, as is base, but it very much depends on your mindset, and overall mental health etc. They arent as crazy as youd think, they can be more subtle, which leads to people over-doing it because they expect more due to the hype. I have to be really careful, the effects arent always that obvious. I think Ive fallen into that trap, gradually Ive become completely different; I listen to completely different music, I see things from a different perspective, and now I think its getting to me. Ive finally stopped to consider this (and my weight, Im looking increasingly thin), and now Im not too sure about ecstasy or base anymore.</p><p>Ive had some great times on amphetamines, but I think now maybe the honeymoon is over</p>",
 "year": "2002",
 "id": "18149",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-01T07:00:00.000Z",
 "views": "15249"
}
