{
 "id": 18151,
 "title": "Testing It Out",
 "date": {
  "submission": "2009-11-18T08:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "CW",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:20",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:20",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I bought 1g of this to test out, as I'd heard good things. I tend to have a low tolerance so I was careful.",
  "Setting: At home, in front of the computer.",
  "First did a small bomb at like 6.30 probably only 50mg, then did a 50g line (harsh on the nose) about twenty minutes later. About an hour after that I walked the 2 minute walk to the shop and bought an energy drink (I was craving sugar) and then got home and did another small line, no more than 50g. Can't remember specific times so I'll just list a few things:",
  "Physical effects: Felt light, energetic, free, relaxed.",
  "Psychological effects: Lack of concentration, increased ability to talk and converse, short term memory loss, time went fast, feelings of empathy, happiness, contentness.",
  "I suppose it peaked after the second line, and then I felt great for ages, until like, half ten. All the time I was on it I wanted to do more, and even now, the next day, want to, and as such it feels like it has some addictive potential.",
  "After half ten I became even more relaxed, and stayed talking on the computer till midnight. Went to bed, but despite how relaxed I was couldn't sleep. Got a few hours.",
  "The next day, have a few blotches on my body, red ones, on my chest, but apart from that I feel great. Also feel more relaxed and content today.",
  "I would recommend it, but be careful as it's so new and hasn't been tested much. I'll be buying some more though."
 ],
 "erowid": {
  "id": "79404",
  "citation": " CW. \"Testing It Out: experience with 4-Methylmethcathinone (ID 79404)\". Erowid.org. Nov 18, 2009. erowid.org/exp/79404",
  "substance": "4-Methylmethcathinone",
  "views": "6517"
 }
}
