{
 "id": 18168,
 "title": "What Am I?",
 "date": {
  "submission": "2003-12-02T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Keil",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "I ordered this extract online after trying just the leaves with no effects to speak of, with the recommendation of my friend R.  When it finally came, I decided to trip with him first since he knew what to expect.  We went out to a park at about 11pm, sat on a bench and loaded the first bowl into the bong, a small water pipe in the form of the grim reaper.  R said that a bowl was about one hit (small bowl, fast burning stuff) and that would be sufficient for an intense experience.  I went first, and held it in for what felt like a very long time, but was probably only about 20-30 seconds, and I felt it before I exhaled.  When I did exhale though, it hit me like a thousand pound weight and everything seemed to collapse into two dimensions.  I laid down on my side, completely inebriated, and then suddenly everything gained depth again - the sky seemed to arch up like a big bridge, with fireflies for lights.  I kept having the sensation that I was being told what to do, or what to think, and I had lost touch with R completely (who was, as he told me afterwards, trying to load his own bowl while observing my trip). ",
  "I felt so alone, not even human - more like the only self-aware being in an empty place.  I was also sweating profusely - I told R that I was melting, and when I 'came back to reality' I noticed that my shirt and pants were completely soaked through.  It might have been hot that night, but not that hot. ",
  "R finally took his hit, and when I was beginning to feel calmer and less confused about myself, and he was a little past the most intense part, we started just running around and going crazy.  I was sort of wanting it to end by then.  This was the bad part:  take my word for it - if you think that there is any chance that people will see you, DON'T DO IT - we did it again later at his house with his brother and friends and his mom came out and got really pissed.  We are lucky that no one came out to the park while we were tripping - we could have had a really stressful night - I simply can't interact with other people while on this stuff. ",
  "I thought it was a worthwhile experience because it made me think a hell of a lot about myself and what these sensations say about my inner self.  Tripping salvia is a lot like dreaming - I think it releases stuff in your subconcious.  This makes for both a very interesting time and a chance to understand your perspective on the world a little better."
 ],
 "erowid": {
  "id": "7950",
  "citation": " Keil. \"What Am I?: experience with Salvia divinorum (10x extract) (ID 7950)\". Erowid.org. Dec 2, 2003. erowid.org/exp/7950",
  "substance": "Salvia divinorum (10x extract)",
  "views": "3534"
 }
}
