{
 "id": 18167,
 "title": "Not What I Expected",
 "date": {
  "submission": "2009-07-07T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Resolute",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Sertraline"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "It's been 30 years since I have smoked pot or tried any illegal drug, and from what I read Spice is in a bit of a legal gray area in the US at this time.  I point that out to say I have no interest in taking any drug as a 'Recreational' one, nor do I take breaking serious laws lightly.  I have had one driving ticket in the last 20 years (5mph over the speed limit). ",
  "Let's start at the beginning...  When I was a teenager over 30 years ago I was in severe emotional pain due to a dysfunctional family situation, verbal abuse, etc...  I also had some severe emotional problems I tried very hard to hide.  Looking back, I was not looking to escape per se, I was attempting to self-medicate severe emotional pain.",
  "I know that some would say I should have sought psychiatric help, but in my circumstances, in an intensely religious family, if I were to say anything I would have been pounced upon as if I was demon possessed and intense and bizarre religious ceremony would await me.  I'm not justifying illegal drug use, it just makes sense to see the human side of this.  I was in pain and I did not know what else to do.",
  "As an adult I have been treated for moderately severe depression and borderline OCD with Zoloft and other legal meds for over 20 years now.  It is common knowledge that many people being treated for depression still battle depression symptoms.  So my doctors have tried adding other antidepressants to my daily 200mg dose of Zoloft.  Effexor helped quite a bit at 150mg per day. ",
  "But with this much SSRI's I was teetering on the brink of Serotonin Syndrome, in which too much Serotonin creates its own set of problems.  I have never been of a criminal mindset, but I do believe in compassion for those suffering needlessly.  I don't drink or smoke, and have no desire to 'Party'.  I have a life, I just struggle to enjoy it with ongoing depression haunting me.  It's not fair to my family for me to be in a depressed mood.",
  "All that to say I recently heard about the Spice products from news reports on the Internet.  I was fascinated with the notion that from reports Spice products gave users the positive effects of pot without many of the negative ones.",
  "Here is a brief description of my first experience with 'Synergy'...",
  "Since I don't smoke I decided I would just take a pinch of the herbal mixture orally and see how it went.  I would guess about 150-300mg of a 3.5gram sample.  Within 20  minutes I was feeling less stressed and noticed I had an absence of depression.  I did not feel any euphoria, no hallucinations, but it did seem as if the world around me kinda tuned-out, like when I put headphones on to listen to music, a bit distracted from what is going on around me.  However, I did notice an immediate interest in reading previously rather boring and mundane texts.  I could actually think more clearly without the depressive thoughts distracting me constantly.  Some music I was listening to seemed to keep playing softly after it had ended, but other than that, no hallucinations.",
  "Physically it felt like the sensation of a sinus headache coming on, slight pressure in the head, but without any pain.  I got a bit of a dry mouth, but no munchies.  And it did seem to make me less aware of typical aches and pains.  But this was certain not ANYTHING like I remember pot to be!  I was very sensitive to pot and good strong stuff was like inhaling a rainbow, if you get my analogy.  Now I don't know if the small dosage is to blame, but I suspect the years of SSRI's (Legal antidepressants) has desensitized my receptors in my brain...",
  "So this lasted about a hour then started coming back to normal.  By 2 hours after the time I noticed the first effect I was back to baseline.",
  "So how would I rate this Spice stuff?  Well for me it was an extremely mild antidepressant, definitely not what I expected.  For those with depression I would strongly encourage legal meds first, along with counseling, but for me at least, I found some relief from depression in my first attempt."
 ],
 "erowid": {
  "id": "79497",
  "citation": " Resolute. \"Not What I Expected: experience with Spice Product ('Synergy') (ID 79497)\". Erowid.org. Jul 7, 2009. erowid.org/exp/79497",
  "substance": "Spice Product ('Synergy')",
  "views": "18444"
 }
}
