{
 "title": "Long Ago Trip to Hell",
 "author": "stilldontknow",
 "citation": " stilldontknow. \"Long Ago Trip to Hell: experience with LSD (ID 18164)\". Erowid.org. Oct 14, 2002. erowid.org/exp/18164",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "report": "<p>Still hoping to come to grips with a bad trip back in the stone age.</p><p>I was in the Navy living with other guys off our ship. I was alone in the apartment. I took one micro dot and waited for the effects. Nothing seemed to be happening so I said what the hell and took one more. In a short time I started coming on to the acid. I was listening to Bob Dylans It's all over Baby Blue song and decided the words were getting too weird for me. I turned off the album and turned on the radio. the DJ said ' things are different now that this is all real aren't they ?' An implosion took place like everthing was being sucked into me along with a feeling of panic. THE GUY WAS TALKING TO ME ! I changed stations and the same effect was happening, they were talking to me too. ( Boy talk about a big ego ,eh). Then they would play music and the words all had new meaning. It's like the songs were allegorical of Humans being trapped in eternity with even death as no escape. Words had special meanings as in poetry or a code. I thought I had died and was in Hell.</p><p>This lasted for month. I could dismiss the whole thing if other weird stuff wasn't happening to me as well. Strangers on the street would come up to me and quote verbatim things I had said to others, but in a mocking way making fun of me. All this and I was in the Navy too. Couldn't really talk about it for fear of being locked up, plus I was too paranoid to trust anyone. Man this place seemed like it was filled with demons. To this day I can't quite beleive it was all my imagination, though I sure hope so. I will say one thing it did for me, I think there is more to life then meets the eye. I found this site looking for others who may have had similiar experiences. I recommend not doing two hits of anything ;)</p>",
 "year": "1971",
 "id": "18164",
 "gender": "Male",
 "timestamp": "2002-10-14T07:00:00.000Z",
 "views": "6766",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(pill / tablet)"
  }
 ]
}
