{
 "title": "Fear In Minnesota",
 "author": "The Gzeus",
 "citation": " The Gzeus. \"Fear In Minnesota: experience with Nutmeg (ID 18165)\". Erowid.org. May 10, 2006. erowid.org/exp/18165",
 "substance": "Nutmeg",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "14 g",
  "oral",
  "Nutmeg",
  "(ground / crushed)",
  "",
  "400 mg",
  "oral",
  "Caffeine",
  "(pill / tablet)",
  "",
  "50 mg",
  "oral",
  "Pharms - Sertraline",
  "(daily)",
  "",
  "600 mg",
  "oral",
  "Pharms - Gabapentin",
  "(daily)"
 ],
 "report": "<p>Well, I'd tried nutmeg a few times before, with varied results, the first time taking far too much, resulting in black-outs, distorted time, space and bizzare visual apparitions.</p><p>This story was far better planned out, though not well planned enough. I had researched enough to know to do it with another person, and to take the proper dosage.</p><p>I did not, however, remember to not leave or DRIVE.</p><p>I had crushed about 9 nuts and added about 1tbsp of pre-ground(bad idea, the taste is far worse) days before, and had found that mixing it in with pudding, filling my mouth with milk and then swallowing the pudding in one gulp avoided most to all of the taste, which I HATE.</p><p>I had taken most of my share about 2 hours before my friend, and was fairly weird when he arrived. We then consumed the rest, and he had a beer. We watched some TV, or a movie, I'm not sure, my memory of thish night's a bit fragmented at times, largly due to my prescription medications(which I have included, so as to explain any possible crossing of effects). It was fairly late, even for us, who get up in the afternoon. We took some caffiene to counter the time(bad idea in retrospect, 2 diuretics at once is a TERRIBLE idea).\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>After about half of whatever was on TV was over, we left. I drove, because at the time we were somehow more concerned with the beer on my friend's breath in case of being pulled over, rather than worry about actual safety. I was stoned enough to agree with this, I may have suggested it.</p><p>We were dressed as Raule Duke and Dr. Gonzo from Fear and Loathing in Las Vegas, and I had just read the book, and watched the movie religiously. We were driving down the highway in my beat-up, rather unsafe van blaring some music on my CD player, when someon started to pass us. I decided to act out the scene where they race people down the street, screaming at them to buy heroin. I was shouting at them, when my friend apparently got his forst real wave of nutmeg, and started SCREAMING and insulting them, which I was shocked at, and found very odd, and a little unwise, but joined in anyhow. We began talking about how they'd won officially, but we'd won for real. 'Fuck the racing officials!!!!!' 'What the FUCK is going on over there!!??!?!?! YOU ASSHOLES!!!!!!' I looked to see what he was screaming at, and saw nothing...</p><p>We drove about 30 minutes away, and stopped at a gas station, as I had to urinate VERY BADLY. People there started talking to me, recognizing my outfit and manner. I had to escape, so we sped off towards a 10 minite away grocery store, where I spent 10 minutes looking for the bathroom. I forgot to buy water.</p><p>We parked in a deserted, elevated parking lot, and listened to Depech Mode. When the album finished, I decided that parking lot was the most terrible place I'd been in a month, and we drove 20 minutes to Denny's.</p><p>People there(large, weighty men,) tried to freak me out, didn't work. We got burgers and a big pitcher of water, which I managed to piss into the toilet while there. The patterns on the wallpaper were kind of interesting, but closing my eyes revealed various monsters with teeth and gums growing and re-forming and splitting into other creatures and then re-forming. This might sound frightening, but I was simply amazed, I'd always been fond of odd-looking creatures. I tried to persuade my friend to close his eyes, but he was too freaked out by it. The fries were freaking BOTH of us out, so we pushed them away, I kept lying down, and falling over.</p><p>We SOMEHOW made it back to my house, where I did, nothing from what I can tell, except leave my nutmeg out in the open. We then made it to his apartment, and listened to a John Zorn jazz album, instrumental, about alchemy, white and black magic. When that ended, I ran out in the wet grass in my sox to get my CDs, halfway through the next, I ahd to go ,a dn he was peaking, spinning and tumbling.</p><p>I slpet for a few hours, and spent about 5 more getting water, and pissing in 45min intervals, it took days to recover, but it was fun.</p>",
 "year": "2002",
 "id": "18165",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-10T07:00:00.000Z",
 "views": "4718",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": "",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": "",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  },
  "3": {
   "time": "",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(daily)"
  }
 }
}
