{
 "id": 18177,
 "title": "A Good Night's Sleep",
 "date": {
  "submission": "2012-04-03T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Oxymoron",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pregabalin",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I recently got a new psychiatrist who, seeing as how pretty much all the SSRIs, SNRIs, NDRIs, NARIs and NaSSAs on the market had little to no effect on my condition, concluded that my core issue was with generalized anxiety rather than depression. The occasional Xanax (.25 to 1.5 mg) did help, but being wary of the dangers of benzo addiction (not that I've had any addiction issues myself, but my country of Austria is probably one of the world leaders in Flunitrazepam abuse), he instead suggested Lyrica.",
  "Problem is, Lyrica is 'approved' for GAD over here, but our national health insurance will only cover it for neuropathic pain.",
  "Still, I thought it was worth a try, so my therapist got me a package of 25 mg pills for me to try out.",
  "Experimenting with doses of up to 200 mg/day, I found out that while the anti-anxiety effect was definitely there (albeit limited), its painkilling effect also helped quench the burning sensation in the soles of my feet.",
  "Okay, getting slightly off-track here: I also suffer from a burning sensation in my soles when lieing in bed at night, resulting in insomnia for which I was prescribed Mirtazapine and later Mianserin. At first these worked pretty well, but after 2 years I had become so tolerant that I needed 3 or 4 pills (ie 240 mgs of Mianserin) to achieve the desired effect, leaving me with a hangover and daytime sleepiness even after 9 hours of sleep.",
  "Thanks to Pregabalin, I could drop the Mianserin, and once again get out of bed refreshed after less than 7 hours of sleep (well, atleast awake enough to do more than just turn off the alarm clock and stagger back to bed).",
  "And since my burning feet qualified as 'neuropathic pain', I now get my Lyrica courtesy of the Austrian healthcare system.",
  "As for the anxiolytic effect - it is there, and it has decreased my general worrying and irritability, but it is no match for the adrenalin rush of an actual panic attack.",
  "On the plus side, there are remarkably few side effects - it actually causes less sleepiness than Xanax."
 ],
 "erowid": {
  "id": "79570",
  "citation": " Oxymoron. \"A Good Night's Sleep: experience with Pregabalin (Lyrica) (ID 79570)\". Erowid.org. Apr 3, 2012. erowid.org/exp/79570",
  "substance": "Pregabalin (Lyrica)",
  "views": "6532"
 }
}
