{
 "title": "Learned to Experience and Enjoy Life",
 "author": ":paws]",
 "citation": " :paws]. \"Learned to Experience and Enjoy Life: experience with Mushrooms - P. cubensis (ID 18172)\". Erowid.org. Aug 4, 2005. erowid.org/exp/18172",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "150 lb",
 "report": "<p>A friend came over with a whole bunch of shrooms he was giving out to everyone at the party for free, so I took some at around 6. I'd been in a good mood all day & hadn't eaten much. I wasn't feeling much for about an hour except adrenaline and slight lack of balance, but I thought that could just be the excitement of shrooming. A couple friends had already had their shrooms hit, so I knew that they weren't poisonous, which calmed me some. It was funny watching friends gag their dose down barely avoiding puking & I was able to just munch em down like bean sprouts.</p><p>As the sun started to set the shrooms started to set in. A slight feeling of euphoria consumed me, to be interrupted by some dumb kids chucking apples at us. We decided to go inside (the kids were also hitting houses with apples). They threw apples at the house, but we decided it would probably be best to ignore them (wasn't my house). We had to leave the house at that point, so we went behind the house & chilled on some chairs listening to music via headphones. These headphones were great, they flashed different colors while playing which was fun to trip on. The negative vibe from the kids was wearing off, and the shrooms started to kick in more. This was nearing the peak as my ride came to pick me up. I didn't want to leave, but I had to. The drive was crazy, I was glad to get home as things were getting hectic at the other house.</p><p>I rushed to my room where the room was breathing, sliding around. I tried reading things on the computer, the letters in words were jumping out at me, kind of bubbling up, and the text was sliding back and forth, changing size. I quickly decided to check out Alex Grey paintings, which were intense. I understood all of the energy lines, and flame in the painting was raising and burning, which I knew shouldn't be happening because it was a still picture. I thought I heard something outside, so I went to check it out (auditory hallucination), but happened to find my cat. Time for some extreme connecting. Petting her was intense, I really felt a lot like her, and realized that I looked a lot like her with my outfit I had on. She was unusually affectionate, I think she could feel my trip some. I just observed the way she reacted to everything, it was exactly the same I felt. I put on mellow Bob Dylan (blonde on blonde) & we super-chilled. I smoked two bowls while watching wave twisters, seemed like the best thing to do at the time. At one point in the movie a spaceship was taking off as I was inhaling-exhaling a hit, extremely intense feelings of taking off in a space shuttle overwhelmed me.</p><p>Everything was 'amazing'. Some things I wrote:</p><p>'Billions of years of evolution &hairless apes opening their minds in amazing ways'</p><p>COMPLEX            AMAZING            confuzing</p><p>I found a good quote that explained how I felt much the time I was frying.</p><p>'You know when you're sitting on a chair and you lean back so you're just on two legs then you lean too far and you almost fall over but at the last second you catch yourself? I feel like that all the time'</p><p>---Steven Wright</p><p>I stayed up until 4 in the morning when the effects had worn off, just me & paws. I learned to experience & enjoy life from this, that life is far more complex than it appears. The mental power to contemplate existence is a gift that humans take for granted. Things I wish I'd done while frying:</p><p>Listen to more Tool</p><p>Meditate</p><p>Go outside</p>",
 "year": "2002",
 "id": "18172",
 "gender": "Male",
 "timestamp": "2005-08-04T07:00:00.000Z",
 "views": "3355",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ]
}
