{
 "id": 18179,
 "title": "Ground Control, We're Unprepared for Lift-off",
 "date": {
  "submission": "2003-12-02T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "V",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 6x"
  },
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Now picture this: You're walking cheerfully down a sunny road completely content and worry free, deep in thought about various errands and your relationship and calling your mother and....WHAMMO! you are hit by a bus going 90 head on. You have no idea what just happened. You look around and you have no idea where you are. And come to think about it..you have no idea WHO you are. A wild wind is screaming and spinning and somehow you've been tossed like a ragdoll into a stormy forbidden zone on the edge of the earth...a place where you should not be. A place that feels like a big mistake, yet a place you curiously remember. You try to reach out and grab a hold of something, but you're caught in some bizzare magnetic field twisting in the eye of a hurricane and your muscles are no match to pull you out. You think for a second...this must be a bad dream...I'll try to wake up...I must be sleeping..I must have forgotten that I went to sleep!!??",
  "But you realize that this is far too real to be a dream. Things seem to have real texture and dimension and the fear is absolutely gripping. Any nightmare would have been stopped minutes ago, no....this is real...this is really happening to you. And then, in a second, you realize that you had better brace yourself...this is not all that is going to happen. The background begins to open up like the cheap set of a B-movie and you begin to see them coming out of the corner of your eye. You know who they are. They're what you once were. It looks like there's been an accident and they've come to untangle you from a restricted dimension and take you back to the other world. You try to scream out that you're not ready to go and this is a mistake but your body is paralyzed and you're totally helpless to what they decide for you. You relize that the dimension called life you normally reside in is an illusion that they have set up for you and your friends and other human people as sort of a 'day care' facility for you...so you can grow into maturity.",
  "They are your real parents and their alien faces scare the living hell out of you. You realize that that is who you are as well and it makes perfect sense and you begin to remember it all, totally awestruck yet in complete terror ....But wait! they're not taking you?..why are they waiting so long?...why does it seem that now they are retreating?  The plastic-like background is opening up and they are stepping back over into the other side -they'll be back for you later. Your confusion turns into flashes of your ceiling and the underneath of your coffee table and this is perplexing as well... What is this now? And then with insane excitement you finally realize and remember that you still have a hold in this world and that your body is actually in your apartment and what had seemed like eons ago -you took some weird drug....... and it was called Salvia divinorum.",
  "This is my actual salvia trip. My first attempt was unsuccesful, besides mild intoxication. My second attempt a day later, was the kicker.",
  "The night began with the lights down low, threw on some Edith Piaf and began to pack a huge salvia bowl (sprinkled with some very aromatic, mint-green and super-sticky ghani-lights mj) into my way-too-expensive glass blown bong. The bowl was a cherryin' and I proceeded to take the absolute largest lung-destroying power hits I could, one-after-the other, and held them 'till my face turned red.",
  "I was thinking about walking to the beach tomorrow...and about my errands and my girlfriend and oh yeah, got to call ma.....",
  "My last thought right after inhaling my third hit was- I really need to get my bong down on the table safely, because I realized I was headed straight for the floor. I never saw nor felt my exhale.",
  "There was no way to imagine what was ahead of me. Salvia is the most powerful drug I have ever taken. It disintegrated the walls of reality, made 5-grams of shrooms look like a tootsie-roll and left my jaw dropped open in utter amazement for the following 7 hours afterwards.",
  "-C"
 ],
 "erowid": {
  "id": "7958",
  "citation": " V. \"Ground Control, We're Unprepared for Lift-off: experience with Salvia divinorum & Cannabis (ID 7958)\". Erowid.org. Dec 2, 2003. erowid.org/exp/7958",
  "substance": "Salvia divinorum & Cannabis",
  "views": "12333"
 }
}
