{
 "id": 18187,
 "title": "Death and Rebirth",
 "date": {
  "submission": "2010-04-23T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Spunisfun",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "DMT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "So I never knew anything about DMT until my friends started talking about a really strong visual hallucinogen that transports a person to a different planet for about 5 minutes.  Hearing that, I was at first nervous.  Then, after some thought, I decided I would give it a try. I enjoy my hallucinogens and love transcending reality, so I convinced myself it would be a great, eye opening experience.  As youll read, boy was I right!",
  "The first night we were at a party when the pipe was passed to me with the remnants of some DMT and some cannabis.  I took a couple pulls and realized that everything around me got very vivid.  There was some graffiti on the wall and I felt like it was the most beautiful, significant thing I ever saw in my life.  It all made sense.  I looked down and noticed that the crack in the floor was moving into a figure of some sort.  It created a large indent in the ground and spread across the ground slightly before snapping back to normal.  Everything around me was slow. ",
  "I told my friend of how great I thought the visuals were.  He told me that I had only very little and that one day he would really make sure I blast off (if done properly he said, I could blast off to a different planet).",
  "Sure enough, about a week later some more came around so I obtained it.  I took a small amount of cannabis and packed it into a pipe.  On top of the pipe I put about 200 mg of DMT and then covered the DMT with more cannabis.  I felt that by layering it, I would prolong it.",
  "I sat down alone and fired it up.  I instantly tasted something that resembled mothballs.  It wasnt a good taste at all, but it didnt make me sick or uncomfortable.  My friend smelled it so he came in the room and told me to hold it in as long as I could.  As I blew out, I felt rocked into a crazy place.  My friend kept coaxing me to keep hitting it.  I got through the second hit, held it in again, and blew out.  As this point I knew my world was going upside down.  He said, Come on, hit it, hit it, hit it. so I absolutely torched the rest of the product.  Well, what Im about to tell you is what blasting off means to me",
  "I am staring straight ahead and there is nothing to be seen.  The world is black.  My cellphone begins ringing inside my brain.  I start wondering where my phone is and I realize I am not there on the couch.  I feel as if I were a small orb where my brain was located.  There was no phone ringing.  I suddenly feel like Im 125 degrees so I feel the impulse to get up and run into the shower on full cold.  I realize this is not a possibility.  I stare straight ahead and begin to see. ",
  "Im convinced that I fully died, and with that, I watch my arms fully disintegrate, skin, bones and all, and vanish.  I look down at the carpet full of square patterns.  The carpet under my feet turns into the helicopter view of a rural farm neighborhood, complete with plots of cultivated land fit so neatly on the 8 by 10 carpet.  I am so amazed by it, but suddenly I start noticing my hands are alive.  I spend the next few minutes admiring my beautiful alive hands and arms. ",
  "Another friend comes through the door and I notice that he peaks in to see how Im doing.  I never looked at him and Im glad I didnt, because in my peripherals, his entire head and face turned into a dozen wispy black hands that were weaving in and out of each other, trying to grab my attention.  I lean back into the couch and begin standing up, telling my friends that I had the craziest experience of my entire life.  I look down at a wooden sculpture of a couple hugging and the man turns into one of my friends.  I begin laughing like crazy.  From then on, everything started to come back.  But one things for sure- it changed my perception in a great way. ",
  "To die and to be reborn is an experience, to say the least.  And thats blasting off."
 ],
 "erowid": {
  "id": "79622",
  "citation": " Spunisfun. \"Death and Rebirth: experience with DMT (ID 79622)\". Erowid.org. Apr 23, 2010. erowid.org/exp/79622",
  "substance": "DMT",
  "views": "5149"
 }
}
