{
 "id": 18192,
 "title": "No Advantage in Mixing These",
 "date": {
  "submission": "2009-07-23T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "julien",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "85"
   },
   "administration": "oral",
   "substance": "Piperazines",
   "specific": "BZP"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "mg",
    "quantity": "12"
   },
   "administration": "oral",
   "substance": "Piperazines",
   "specific": "TFMPP"
  },
  {
   "time": "1:30",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone"
  },
  {
   "time": "1:45",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone"
  }
 ],
 "report": [
  "I happened to have on my possession in preparation for an upcoming party some mephedrone and some BZP. I am a little bit worried because still very little is known about mephedrone and a simple google search find no result for the combination of these two substances. I took on myself to test it with moderate dosage. I took orally 85mg bzp and 12mg tfmpp.",
  "An our and a half later I was definately under the effect of the bzp. At this point I decide to make a test, I snorted a very very small amount of mephedrone. And what happened at this moment stupefactied me, in a matter of seconds of snorting the small bump I felt the bzp high desapeared, left only with a slight stoned feeling. After 15 minutes on this disappointing state, I did more mephedrone and felt the expected mephedrone high, I did not use anymore BZP that night. I did not notice an increase in heart rate of the mixing of the 2 substances.",
  "In conclusion, it appears to be no advantage in mixing these two substances, as the mephedrone appears to cancel the euphoric type of high that is felt with bzp.",
  "[Reported Dose: '85mg bzp, 12mg TFMPP, 500mg mephedron']"
 ],
 "erowid": {
  "id": "79652",
  "citation": " julien. \"No Advantage in Mixing These: experience with Mephedrone, TFMPP & BZP (ID 79652)\". Erowid.org. Jul 23, 2009. erowid.org/exp/79652",
  "substance": "Mephedrone, TFMPP & BZP",
  "views": "8423"
 }
}
