{
 "id": 18213,
 "title": "Curiously Present",
 "date": {
  "submission": "2012-03-20T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Look1",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "(dried)"
  }
 ],
 "report": [
  "I planted a Chinese Poppy 2 years ago that produced 3 blooms this year. Now that its just turned August, the pods have become dry and hard. Wondering if they were enough to afford an altered state, I did some online research yesterday afternoon and found out the active ingredients are in the pods, not so much the seeds, and that 3-5 ground pods can make for a single serving of opium tea. But I didnt have a suitable grinder, so decided to cut the pods open, tap out most of the seeds (sprinkling them around the existing plant to encourage new growth), and chew the pods instead of bothering with tea. I wasnt sure if boiling was important, but guessed maybe not, and figured whatever modifiers were in the pods would be released through chewing and digestion.",
  "The taste chewed wasnt as awful as reports of the tea - rather like eating magic mushrooms, musty and earthy and a little bitter but not terrible. It helped that I washed down each bit of chewing with water mixed with lemon and stevia, which made things very palatable while refreshing my mouth for the next chew. (Another reason for the lemon is that Id read something about lemon having an acidic quality that may help release the drugs locked in the brittle pods.) The chewing began around 7 pm. I chewed with intention to grind the pods up into tiny bits and found that the brittleness did give way more easily to softening from saliva than the resistance I anticipated. I turned my head right then left, stretching to feel how my often tight neck muscles felt, and found them somewhat more relaxed and less painful than last I checked.",
  "The next thing I noticed while sitting in my dark green recliner, was a tune going on in my head, and it gaining a more distinct attention to each note, and repeating as though my mind was making efforts to be more conscious and concise with the tune. Gradually I realized it was Isnt It a Pity by George Harrison, but the version in my head was more of a solo piano sound than the recording and modified with a jazzier variation on the tune. I went to the piano - for the first time in months and months - and sat down to see how playing it would go. And I did find myself able to trace together the tune with simple chords, and the patience to keep at it to get it basically right and improvise a little over the top of it. It made me think of reports Id heard of musicians finding heroin to be helpful in keeping to music and the practicing thereof, and more sustainably interestingly so. I thought of Eric Clapton and especially Jerry Garcia, their use of H in creating their music.",
  "Wife and daughter were away, so I walked out to feed the horses in their absence. There was a truck there that Id not seen before on the other side of the garage and then a man I didnt recognize. He introduced himself as having just delivered hay. Now I cant say for sure that the pods had activated anything in me, but I did find myself open in a way that facilitated a long conversation with this man, well beyond the time I was supposed to be feeding the horses. We wound through many subjects, much having to do with his having lived through the sixties, being drafted, going to Vietnam, the politics, the drugs, the confusion of motivations among leaders and sides, then coming home and settling into a career in forestry, now retired and doing this hay business just to keep busy. I found him remarkably sane after all hed been through. Hadnt fought on the front lines, having been smart enough to get into the construction end of things. But he was involved in the war enough to see the drug abuse, the black markets, the corruption, the innocent Vietnamese using babies as decoys and then blowing up bombs the next minute. He said there was a much greater drug abuse problem among the blacks, though he didnt mean to be prejudiced. He said the marijuana over there was very strong and he noticed users under the influence being compromised in good decision making. Hed chosen to stay away from the drugs because of his concern for what effects his actions might have on others. I thought that was a very intelligent approach to be so concerned for others. Drug use can be very self absorbing and unconcerned with others, inadvertently putting others at risk or disadvantage.",
  "We must have talked for over an hour, in one of those time out of time modes where everything else passes away while the one on one conversation expands within its own all consuming spaces. Finally he said his good byes. I sensed he was a little surprised upon immediate reflection at how much was shared in our confessional bubble. But I thought it went well, was a kind of healing conversation. I appreciated and was impressed with his overall sense of sanity and balance having gone through such intense and challenging times.",
  "Id barely begun feeding the horses when my wife drove up from her dinner out with friends. Again, I found myself curiously present, not in any rush, not predisposed to having an agenda to accomplishments which can often bully me away from being in the moment. Again, I wasnt sure the consumption of the pods was having a definite effect. I have heard recently that small dosages of almost any mind altering substance can have the similar effects of mild increases in clarity and presence and openness. So maybe the slight amount of drugs from the pods were contributing to that. Or maybe it was just my interest in being modified that had me open in ways I might not have been. But conversations with my wife turned out to be quite open, similarly to that with the hay deliverer. I found myself continually present and open and easily engaged in a kind of satisfied calm. My wife had brought home a desert made up of thick layer of chocolate on top with a creamy sugary center and crust, which I preferred eating most of over the canned chili Id gotten out earlier to heat up. So I dont know if the chocolate contributed to my experience from then on. But we talked on mostly about work relations and stuff that happened yesterday, the odd twists and turns of each individuals playing into the accruing story lines, however jumbled, self serving, subtly underhanded, insecure, presumptive, goofy, impulsive, disconnected, and strangely working into whatever synergy. I found it all rather amusing, even a little intriguing.",
  "I had a cup of decaf coffee and gradually wound down to bed. Sleep came easily and the night rolled through what felt like a generally light sleep, or coming in and out of sleep, and at least one lucid dream having to do with a fellow whod wondered into a health food store and asking me for advice and my referring him to a friend of mine who works there and othe varios interactions with people there and at other stores and out in the parking lot. My presence in the dreams was similar to my presence with the hay deliverer and my wife. Open, communicative, curious, reciprocal. I had the repeating feeling upon numerous times of waking through the night, that the pods were having a narcotic effect, making me feel a little woozy, extra relaxed, mildly restless, a little itchy here and there, comfortably appreciative of the drug - if any were actually active. I got up at a usual time of rising. Didnt feel abused or under the weather or anything noticeably negative or irritable. I could sense wanting to have more experience like that, recalling the large crop of Chinese Poppies Ive seen along one of the major roads on the way to taking my daughter to school last year, and wondering if the pods are still there, free for the picking.",
  "From what Ive studied of the history of poppies and the drugs humans have produced from them over the ages, there are very mixed reviews of their benefits v their risks and debilitations. But in this first experiment of chewing the whole pod sans most of the seeds, I felt the experience was purely beneficial, not harmful, clarifying, not clouding, opening, not overly self absorbing, attractive not addictive. Clearly many cultures and peoples have found the effects extremely valuable over the ages, so valuable that much trade and manipulation, bullying, corruption and propaganda have been done in the name of these substances which all seems to serve to distort their actual value. Expectation can influence a lot ones actual experience, so I suggest people be careful what they anticipate, especially what they fear, for bringing that on when it doesnt necessarily have to come to that. Also, keep safe and healthy as possible and take care in dosage amounts."
 ],
 "erowid": {
  "id": "80353",
  "citation": " Look1. \"Curiously Present: experience with Poppies - Opium (ID 80353)\". Erowid.org. Mar 20, 2012. erowid.org/exp/80353",
  "substance": "Poppies - Opium",
  "views": "6898"
 }
}
