{
 "id": 18229,
 "title": "The World Is In An Envelope",
 "date": {
  "submission": "2010-11-13T08:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Golden Teacher",
  "gender": "Female",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "2 lines",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>The use of psychedelics for me is a spiritual undertaking done mostly in the outdoors while camping. My friends and I often camp on an island upriver from where we live. This experience follows a recent camping trip there.",
  "A few hours before sunset, a friend of mine and I took about a gram of mushrooms. We went swimming with the others. It was an absolutely beautiful summer evening and we were all in good spirits. By the time we were back on shore, my friend and I were beginning to feel the mushrooms. We felt pleasantly lifted in mind. We both agreed that colours were particularly sharper. We had not felt any anxiety of coming-up, however we are both experienced mushroom users. We decided to eat about 0.5 grams more each.",
  "Around dusk we were playing with hula-hoops and poi. Some one had set up a tightrope, which my friend was avidly trying to master. I ate about another 0.5 grams. I had a huge amount of energy. I was bouncing between hula-hooping, spinning poi, and chatting with others. Any time I looked at the sky it turned into a huge watercolour painting, something like Monet would have done. I felt intensely connected to the campsite ground and the island itself as a sacred place. This is where we come to be Real, I concluded.",
  "Later, I was hanging out around the fire, sitting on an inflatable mattress with a few others who were drinking. I ended up having a very intense discussion about life, the universe, and everything with an acquaintance of mine. I felt as if it was the first time we had really met. I always felt shy around him for some reason, although Im not a shy person. We talked for about two hours straight (me eating another gram of mushrooms in between). At one point, he blew my mind as one might call it. I had an intense realization about my family life and how to overcome some problems I have with my sister, which I intend on applying in the future. We discussed the ills of society, particularly the fakeness we saw as being an endemic problem with all people. We concluded that only once we shed this disguise could we truly be free.",
  "At this point, another friend called me over to where he and a few others were sitting. They were doing lines of ketamine. I have never tried ketamine before, but most of the people present camping were experienced users and suggested that if I felt up to it, I should give it a try. Since I felt in an excellent and (relatively) clear state of mind, I decided that I would be able to handle something new. I specified that I didnt want too much, but I wanted enough to feel the effects, after which I would decide if I wanted more. I was served a line and after snorting it, I sat back down on the air mattress.",
  "Within a few minutes I began to feel like I was rocking on a ship. It became more difficult to express myself in a way that made any sense. I giggled almost non-stop as I was coming up. The air mattress felt like it was hovering above the grass. I felt a little overwhelmed, so I remained lying down. Shadows became particularly pronounced. The difference between things that were light in colour and dark in colour was readily apparent as black against white. At one point, I could see only in black and white. This wasnt scary as it was very disorienting.",
  "After a while, I had come down and felt the mushrooms again. I took a bit of a break to process what had just happened. I concluded that it was interesting and I would like to try it again, perhaps while standing or doing something other than lying down. I was served a line slightly larger than before. Some others were hula-hooping and spinning poi in a little clearing close to the campfire so I decided to join them. At first I just watched. The poi was glow-in-the-dark and was creating fantastic tracers of circular light. I dont usually get tracers with mushrooms (unless Ive taken over 4 grams at once) so I attributed it to the ketamine. I attempted to hula-hoop (I can do some tricks), but quickly found out that almost all coordination had been lost. After putting down the hula-hoop, I felt very dizzy and had to stand still for a few minutes.",
  "I tried to venture back to the fire, but found that I couldnt even sit by it. It was far too bright to even be close to. I had a vague idea that an angel had landed there, which was the reason I couldnt look at the fire. I travelled back to the clearing where people were still spinning poi, but I ended up getting stuck in an envelope. The ground felt as if was very slanted downward and then very slanted upward (although it was actually completely flat), creating a V-shaped valley in the middle of the clearing and ultimately divided the entire island in this way. The further in either direction I went the more I climbed, so it felt like I was stuck in the bottom of an envelope. I attempted to explain this to a friend in the clearing. She didnt understand, and I felt very frustrated because I wasnt able to communicate.",
  "I climbed up the side of this envelope back to the fire, which didnt appear as bright as before. Everything was still slanting one-way or the other. I felt very disoriented and aggravated because I couldnt get comfortable. I sat cross-legged by the fireside spouting nonsense words and throwing fistfuls of grass at the fire. I felt a bit better sitting down, but felt so full of energy I didnt know what to do with myself. My best friend was sitting beside me. I cant wait to be not high on ketamine, I told her, because I cant do anything. If I do Ill get stuck in an envelope forever. She laughed and asked if I was feeling okay. I said that I was feeling great, but I couldnt get rid of any of the energy I had because I was too immobile. We relaxed by the fire while poking it with sticks. Faces and shapes were coming out of the embers and logs. We made up stories about the faces and tried to make them smile or change expression by poking them with our sticks. This was probably the most intense of the open-eyed hallucination I had that night.",
  "About half an hour later, I had come down from the ketamine and was once again in the familiar embrace of mushrooms. I believe that the mixture of mushrooms and ketamine lead to the frustration that I experienced. I felt that the energy that mushrooms gives me was competing with the disorientation that ketamine apparently has, creating a type of insanity or level of frustration (not necessarily bad) similar to being disoriented on LSD, with which I am also experienced. Sitting down and focusing on something that I could play with in my hands (poking the fire with a stick) solved this problem.</p>"
 ],
 "erowid": {
  "id": "80661",
  "citation": " Golden Teacher. \"The World Is In An Envelope: experience with Mushrooms & Ketamine (ID 80661)\". Erowid.org. Nov 13, 2010. erowid.org/exp/80661",
  "substance": "Mushrooms & Ketamine",
  "views": "4811"
 }
}
