{
 "id": 18231,
 "title": "Something",
 "date": {
  "submission": "2009-09-26T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "J1982",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0:00",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(capsule)"
  },
  {
   "time": "1:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  },
  {
   "time": "1:15",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(capsule)"
  },
  {
   "time": "2:20",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I've never tried any research chemicals to date, but have a long history of use of MDMA(about 7 years), cocaine(4 years), LSD(3 years) and speed(only a few times).  I recently ordered some methylone off an online vendor (UK), and the package arrived today.  I'd been waiting for it for about a week and by the time it came I could hardly wait to try it.  I had a few drinks with my girlfriend, who has to work in the morning.  She has decided to go to bed early and to just stay up with me until I come up and feel ok.  By the start of my 'experiment' I've had just over a bottle of red wine.",
  "T+0:  Ingest approx 125mg methylone inside a gel cap.",
  "T+25:  Definitely starting to feel 'something.'  The clearness in your eyes when taking good MDMA.",
  "T+40:  Feeling a good come up.  Wanting to tense legs then relax them, feels good.  Starting to feel a bit bored.",
  "T+60:  Go outside for a smoke.  Smoking does not feel as good as it does on MDMA, but good none the less.  Going back inside now.",
  "T+75:  Ingest another 125mg(approx) in gel cap.  Turn on Wii.",
  "T+90:  Starting to get a bit of jaw clenching.  Not too serious and can stop it if I like.  Feels like a medium dose of MDMA.  Heart rate about 140BPM.  Probably a bit more than what it would be on MDMA.",
  "T+110:  I don't know if any of you have Wii Play, but I'm able to score over 200 on the table tennis, something I can rarely do sober!  Seems to improve my concentration.",
  "T+120:  Starting to get bored again.  Wii is not entertaining me anymore, going to look for something else to do.",
  "T+125:  Very moreish, getting tempted to go get some more but promised girlfriend I wouldnt.  Peak from each dose only seems to last about an hour then quickly subsides to feeling of really wanting more!  After feelings of extreme(!) euphoria just left with jaw clenching and boredom!",
  "T+130:  Starting to question myself, do I need more or not.  The effects are sometimes weak, sometimes strong.  Seems to be very controllable and thought dependant.  I can imagine that with a group of friends this would be very much different, however alone it is very introspective.  I am starting to ask why I feel the need to take drugs in the first place, and am beginning to analyse myself.",
  "T+140:  Ingest another 180mg(approx) dissolved in water.  Hopefully the effects will come on more quickly.  Going outside for a smoke, feeling the need to cool down, a little bit of perspiration coming on.",
  "T+150:  Feeling a bit of a come up, not as pronounced as the first 2 doses, maybe this drug does not like to be repeated.  Going to enjoy the rest of my trip now, will report back in a while...",
  "T+180:  Feeling generally good, wish I had someone to talk to.  Tried to call a few of my friends but its 2am, no one answers.  Decide to start typing again to share my feelings.  Not much on TV and Im starting to wish I could sleep, though I dont think this will be possible for quite some time.  Decide to go on facebook to catch up with some friends, I feel the need to talk to someone familiar.",
  "T+190:  Typing getting a bit difficult.  Feeling REALLY good, but messy at the same time.  Like the good old days of MDMA!",
  "T+210:  Hitting a plateau, I feel like taking any more at this stage would be a waste of time(and methylone!).  Going to drink some more wine then go to bed.  I have a feeling I wont sleep though.",
  "T+230:  Got a phone call from a friend, felt good to talk to someone.  Bored trying to sleep.  Going to play the Wii again.  Think I could beat my all time record on table tennis!",
  "T+280:  Effects seem to have subsided enough to facilitate sleep.  All in all a very enjoyable experience.  Will be repeating again soon, possibly in combination with mephedrone."
 ],
 "erowid": {
  "id": "80737",
  "citation": " J1982. \"Something: experience with Methylone & Alcohol (Wine) (ID 80737)\". Erowid.org. Sep 26, 2009. erowid.org/exp/80737",
  "substance": "Methylone & Alcohol (Wine)",
  "views": "12864"
 }
}
