{
 "id": 18242,
 "title": "Nature, Music, and Perception",
 "date": {
  "submission": "2009-12-26T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Leogang",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "in"
   },
   "administration": "oral",
   "substance": "Cacti",
   "form": "liquid",
   "specific": "T. pachanoi"
  }
 ],
 "report": [
  "The first thought of ingesting this sacred cacti once again first popped into my head shortly after learning that the Flaming Lips were playing a free show where I live. FREE.  Now there were plenty of other costs associated with going, but Wayne and the gang themselves did not impose any charge to me.  Anyway, I had recently come upon quite a lot of cuttings and prepared about a yard of cacti via the M.J. Shroomer guide the previous day.  I have experience with the more common psychedelics, some less common ones (including San Pedro), and a good amount of non related drugs as well.  I also tend to be more sensitive to psychedelics than most other people I know.  However, I have never consumed more than one foots worth of juice and my previous experience with San Pedro has never been more than a plus one + on the shulgin scale.  That being said, my expectations for the trip were a bit different than what was to follow.",
  "A group of five friends and myself had planned to head down to the beach for some surfing and whatnot before the show and we arrived fairly early to make sure we got up nice and close to the stage.  I had very little to no anxiety that day, and overall was very pleased with how everything was flowing along to plan.  My friend C and I were the only two to partake in the cacti, which we did so shortly after getting to the shore.  I should mention we smoked a small amount of cannabis that morning, but it had worn off at least an hour before the cacti was had.  C couldnt quite finish his dose, so I humbly obliged in drinking the rest.  This made me a tad nautious, but it quickly passed as I got back in the water and let the waves crash down on me.",
  "That familiar feeling and visual perception that everything isnt quite normal began to emerge, which made me joyful and hopeful for the rest  of the day.  Everything that reflected light well stood out to me.  Being barefoot in the sand, the gentle wind at my back, and the tide coming in and being swept out all became even more peaceful than when sober, or perhaps I was just more focused on it.  I cant recall exact times, but ingestion took place around 2:15, was finished about 2:40 and we decided to leave the beach at 4:15. ",
  "Walking inland towards the car was accompanied by a soft increase in effect.  I picked a bright yellow flower to stare at while I walked, admiring its features and being slightly jealous of artists who can see things this way nearly all of the time.  We crossed over a small bridge that rested on top of a train tunnel.  Before we had reached the bridge, I could hear the trains approach.  As soon as I first stepped on it I could tell that it would pass directly underneath me when I reached the middle.  The rumbling and force of motion was almost overwhelming.  No one else seemed to really take too much notice, which seemed strange to me because even sober Im sure one of us would have or should have mentioned something, made some comment.",
  "As we continued to walk I turned my attention back towards plants and other living things.  An old nature of the universe thing kept coming back to me and was much easier to comprehend, that everything there is to see, the physical world is everything, yet nothing, behind nothing, residing in nothing.  And that this moment, the one I am currently residing in, is the only time there is.  Humans seem to be very concerned with the past and future, even more so than the present in my opinion.  However clich it may sound, being one with the moment you are in is something more desirable and rewarding than recycling through the past or guessing at the future.",
  "For the most part, I was reserved about my perception and shared very little of any of this with my friends, even C and I didnt really acknowledge anything related to the trip except that it was active.  We made it to the car, put our boards away, grabbed anything we might need, rolled a joint and a blunt, and were on our way.  Considering how we had brought very little to eat, and also how expensive and fancy all the eateries around us were (and how we all had sand all over us), we chose Dennys simply because we knew what to expect and it was the most affordable around.  I do not particularly care for Dennys or IHOP.  The only time I frequent a Dennys is late at night when nothing else is open.",
  "Walking inside was when I realized I was a ++ (I dont think of the shulgin scale while intoxicated, I was just more aware of the drugs action, the scale is a result of analyzing the experience).  This may have been brought on by the change in mood or increased amount of strange people that seemed to be staring at me or ignoring me, yet aware that I were not myself.  Details were heightened.  I could look at a face and take in every single feature there was to see, from each pore and the hair follicles that protruded to the expression that they wore, which was more pronounced.  It was then that I realized that this was not the best setting for this drug.  Lots of people made me slightly anxious, but what caused more anxiety was trying to discern everyones conversations at once and just hearing a vast sea of alien voices communicating alien messages to each other.  There was no choice to ignore the voices either, the only way was when my mind drifted to something else. ",
  "Choosing what I wanted to eat was difficult.  All I knew was that I needed food.  I wasnt sure if I was hungry or not, but I could feel that weakness from not eating.  Yet nothing look especially appetizing.   Now I know to never again order the cheese/bacon/fry sampler.  It was the greasiest most disgusting pile of food I have ever had, not in reality of course, but I will not forget what it felt like.  Thankfully it did its job of filling my stomach with carbs.  Before we left I went to the restroom to pee.  If you are male and have ever peed on mescaline or lsd, its probably likely you are aware of how strange that organ is.  I won't go into detail, but it was then that it occurred to me just how similar this was to lsd.  Never before at any lower doses did I make that connection for myself.  I spent some time fumbling around with my bag before I left the bathroom.  Exchanging money was how it always is with psychedelics, and then we were on our way. ",
  "I dont think I need to mention how I felt about people again, but there were a lot more of them.  We eventually made it near the font of the stage and sat down in a little pow wow with about two hundred other early birds.  Different anxieties began to pop up at this point.  They mostly revolved around the other people that I knew that were attending.  I diffused most of them and focused instead on a girls calf of which was planted at eye level beside me.  At this point I believe I had reached +++, about four hours after complete ingestion (perhaps it was the food?).  The tiny stubs of hair on her leg were very dark and stood out to me more than anything else at the moment.  I looked closer and each of them began to move, suddenly rearranging themselves as if they were bacteria on a microscopic level, yet more quickly than bacteria move.  This was distinct from the pulsing, melting, breathing, or any other way of describing hallucinations that I have experienced on psylocibin or lsd.  This was much more interesting to observe and I would have looked on longer if two friends of mine hadnt showed up and caught my attention.",
  "The whole concert experience is a bit difficult to recall what I experienced at what points in time.  However I can say this.  The Flaming Lips took a very long time to start playing.  The opening act (Stardeath and the White Dwarves who I think is made up of one of their offspring) wasnt that great, but they opened with Sweet Leaf which was awesome.  The Flaming Lips were born out of a glowing vagina onto the stage.  I touched the giant clear plastic ball that Wayne got into and rolled around on the crowd on. The music entered me, and I, the music, yet it wasnt as clear or accurate as it is on lsd.  I smoked a lot of weed.  The entire stage began breathing at one point.  They put on a really cool show, it was short, but the visuals were fantastic and the setlist was phenomenal.  There was one point where Wayne talked about politics, and I was excited when he started, because I thought he was going to basically say fuck politics or something like that.  Unfortunately he actually said that Obama is awesome.  Whatever, its about the music anyway. ",
  "There was one more distinct sort of revelation I had thats worth mentioning.  I became very scared when I began thinking that no other person has the same experience or has shared any of the exact same memories with any other person before him and inevitably after him.  It was almost like I was drowning in this thought that Ive had before, but it hasnt been so involved and clear.  It was frightening because I began to wonder how we can accuarately communicate at all, and how simple and straightforward our everyday sobriety is.  Which led me to think that perhaps no one feels the same way I do when Im sober.  And then it all kind of folded back on itself with perceptions, and states of mind.  It made me a bit frustrated because Ive dwelled on all of this before and come to my own conclusions, but its like its playing with me by making me revisit it and not letting me visit something else like the duality of the universe or something as abstract yet more useful to me.  But perhaps I am not done with it, I dont know, maybe its just something we need to be consistently reminded of.",
  "There was a cop at the In N Out we stopped at on the way home.  I didnt like that even though I was sure nothing would come of it.  Since I wasnt  confident in myself to drive home I slept in my friends guest house which couldnt have worked out better.  It was nearly two am the next day the last time I checked the clock before drifting off into a strange sleep.  Im sure if I had chose to stay awake it would have come full circle and lasted twelve full hours, much more than the six or so I was expecting.  Im assuming it was from the increased dose and slower absorbtion from eating.  I know I desribed a lot of unpleasant things I experienced, but it really is a humbling and enlightening journey (the psychedelic trip).  And considering how the cacti is free for me, lacks any noticeable hangover or longterm effects that I unfortunately get from lsd, I plan on consuming it again in the future, in moderation of course."
 ],
 "erowid": {
  "id": "80841",
  "citation": " Leogang. \"Nature, Music, and Perception: experience with Cacti - T. pachanoi (San Pedro) & Cannabis (ID 80841)\". Erowid.org. Dec 26, 2009. erowid.org/exp/80841",
  "substance": "Cacti - T. pachanoi (San Pedro) & Cannabis",
  "views": "10150"
 }
}
