{
 "id": 18257,
 "title": "Intersecting Realities",
 "date": {
  "submission": "2013-12-02T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Shamanz",
  "gender": "Male",
  "weight": "80 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "Having read many reports on the use of Salvia divinorum I noticed there are very few descriptions of experiences based on chewing the dry leaf. Most reports seem to involve smoking massively concentrated extracts from which the user has a short but indescribably bizarre and intense experience, and ends with advice to the reader  about showing this plant respect. How about a report for a change which shows respect from the start.",
  "As a veteran of many entheogenic experiences ,including Ayahuasca (over 100), chewing Salvia dry leaf (20), and several sessions with Psilocybin mushrooms, LSA (Morning Glory seeds), MDMA and Cannabis, I want to approach the Salvia topic from the Entheogenic Shamanic viewpoint rather than the usual thrillseeking recreational viewpoint.",
  "I went through the ritual preparation I employ before any entheogenic session. Everyone's ritual preparation is different but I believe it is essential in order to focus intent and brings an aura of respect to the experience. So I showered, shaved, and prepared my space by lighting some incense and candles. On this occasion I did not have a sitter present but since I had chewed dry Salvia leaf on 10 occasions before I felt I knew what to expect, although if I was ever to smoke Salvia I would only ever do so with a sitter present. It was approx 10pm, I had eaten as normal in the evening but had not taken any alcohol or other drugs.",
  "I weighed out 10g of dry Salvia leaf I had obtained online. I had used leaf from this batch before starting with small doses of 2g and working upwards 2g at a time over several weeks, so I felt I was prepared for the dose. Much as I respect the opinions of the late Terrence McKenna, I don't agree that the 'if in doubt then double the dose' approach should be used with Salvia. The dry leaf was placed in a bowl of water to soak while I brushed my teeth and rinsed with mouthwash which is said to improve oral absorption of the Salvia active ingredients.",
  "Taking the soaked leaves I squeezed out the excess water in my fist and put them all in my mouth. I had a personal CD player on playing 'Spirit of the Ancestors', a CD of North American chanting set to music. I has a small bowl beside me in my ritual space and I began to chew the Salvia leaves in a deliberate manner but trying not to swallow any of the juices from my mouth. The aim is to chew until its all pulp and keep everything in one's mouth. I had determined to try not to spit anything out until the effects were quite strong.",
  "For the first 10 minutes of chewing I felt no effect. The taste was not unpleasant (compared to Ayahuasca!), mildly minty. I was in a squatting position when suddenly the effects came on. I felt a need to improve my posture, sit upright, and gradually turn my neck and attention to the left, as though being guided. In line with my body movements came the familiar yet extraordinary Salvia effect of opening up/unpeeling reality along the axis created by my head and body positions. With experience I have come to expect it and just get on with the business of opening up the Salvia Reality by using slow steady body movements, but the first time I thought it was very strange. It was as though there was another reality behind our normal reality, and that Salvia was a means of becoming aware of its presence. Added to that was a sense of familiarity with the Salvia Reality, as though I has know it before and that all my life I had known it was there but was just letting myself forget it.",
  "So, turning this way and that, with slow and steady body movements in time with the drumbeat on the CD, the Salvia reality was fully unfolded and the final piece locked into place as I bent forward and with spot on timing spat out the chewed leaves into the bowl. None of the movements or timing felt as if they were under my control as such, more like the (shamanic) me who had always secretly been aware of the Salvia realm was guiding the whole process.",
  "This time, the Salvia reality consisted of intensely coloured plant-like structures that seemed to go on infinitely in all directions. While I was aware that I was squatting in my ritual space at home I was also equally aware of the Salvia Reality all about me and through me, extending forwards and backwards through time as well as space. Quick thoughts of 'this is amazing, this is so familiar, don't panic you've been here before, why am I doing this, this is the real reality, how is it I always forget this real me' flashed accross my mind. I didn't feel fear but tension was present, as though emotions were subdued generally. I felt that my body had warmed up and a general sense of coldness in the Salvia reality, despite a halogen heater being on a few feet away. I felt awe and amazement despite its familiarity, but certainly no fun or euphoria.",
  "Again as though being guided, in a kneeling position I stretched out my arms to each side and lowered my head. Fully in the Salvia Reality now, this had the effect of opening a doorway in the ground of the Salvia Garden. Keeping my body position fixed and head down, I became aware of a procession of beings moving upward from this doorway into the garden, all in time with the drumbeat on the CD. After a few moments, still keeping the same body position, I looked up at the being in the front. It could only be described like a 3 foot caterpillar, mainly green and yellow, standing upright. It turned its head to me and gave a nod of recognition, as though saying thank you for opening the doorway. I really felt as though I was keeping this doorway open, and so maintained my body position until all the beings had disappeared off into the garden and were now out of view.",
  "Then I squatted down to get my bearings. I switched off the CD. The doorway from the floor of the Salvia Garden had raised itself up and become a 3-D object in the middle of the room. It was gradually expanding and moving forwards. I was completely puzzled. The Salvia effects should be wearing off now, I thought, yet I was completely aware of being in my front room, with a 3 foot diameter 'wormhole' as clear as day. I looked closer at the edge of this wormhole. I could see my carpet and the wormhole both clearly, as though both realities could be clearly perceived together at the same time. My emotions were of bewilderment and amusement. 'Stop right there' I said, and amazingly the wormwhole stopped expanding! While there was no sense of malevolence, and the beings which were now gone, to I don't know where or why, had been respectful, I did feel that somehow I shouldn't really have opened up a wormhole between realities in my front room. This sort of thing demands a proper temple!",
  "I sat patiently and the wormhole faded away, or was it just my perception of it which faded? As usual after chewing Salvia leaves I had mixtures of amazement and puzzlement. I felt relieved that all seemed to go well and that I had both been respectful and had been treated with respect.",
  "After this and approx 20 other sessions of chewing dried Salvia leaves, I feel that from a shamanic viewpoint, Salvia is a Deity which can encounter and interact with human lives for various reasons, and most of those reasons are far beyond the ability of the humans involved to comprehend. She can be benevolent and give insight and healing in a very round about way. I don't think she is malevolent but can be clumsy and intolerant with those who approach without respect. I feel that smoking something like 100X Salvia extract for a thrill or to put on YouTube is seriously disrespectful to this entheogen and I'm not surprised when  I hear of nightmarish 'bad trips'. Some people say they have tried chewing leaves with no effects and so they had to resort to smoking extracts. Again I don't agree. There is no need to be offended if a particular entheogen does not 'work' for you. Not all entheogens agree with all people. From a shamanic viewpoint I would say that if the Mazatec Indians only chew the Salvia leaf and consider burning it to be disrespectful then that should be good enough advice for anyone. If you get no effect from chewing the leaf, I suggest trying a different batch from a different vendor. If still no effects, then Salvia may not be for you. I wouldn't choose to push it and complain when Salvia showed me her wrath.",
  "I hope this report conveys some of the bizarreness and power of Salvia, and that chewing the leaf should be more than enough of an adventure for most psychonauts. I feel that smoking powerful extracts of Salvia will eventually lead to its demonization and scheduling. It would be a reflection of humanity's immaturity and unreadiness to deal with this unique and powerful entheogen."
 ],
 "erowid": {
  "id": "81042",
  "citation": " Shamanz. \"Intersecting Realities: experience with Salvia divinorum  (ID 81042)\". Erowid.org. Dec 2, 2013. erowid.org/exp/81042",
  "substance": "Salvia divinorum ",
  "views": "555"
 }
}
