{
 "id": 18269,
 "title": "Calm Productivity",
 "date": {
  "submission": "2012-02-22T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ZenPuppy",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25",
    "grams": 0.025
   },
   "administration": "oral",
   "substance": "Ephedrine"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Smarts",
   "specific": "Phenibut"
  }
 ],
 "report": [
  "Have to take Bronkaid for allergies and used Phenibut to stay calm and focus. Gave up alcohol and needed something to calm my nerves. Took Phenibut first in morning followed by 1 Bronkaid Tab (ephedrine & guaifenesin) Ephedrine 25mg being a stimulant and guaifenesin being just an expectorant in the pill.",
  "Within 15-20 mins I was totally euphoric but very productive. I was totally relaxed, no muscle aches like have plagued me. There's a buzz, a warmth but I am still able to focus completely and it seems like I'm in a very good mood and nothing bothers me. Usually I'm really easily aggravated and explode at things. Right now I'm just getting things done without a care in the world.",
  "I have also used Phenibut with alcohol and it made 1 beer feel like 3.  I can drink less and still have that nice friendly social feeling.",
  "Most people report a hangover next morning from Phenibut use alone. I imagine if used with alcohol I'd have a worse hangover. When I've used Phenibut by itself, I experienced no hangover with low doses. Higher use, all it felt like was a band around the head, like a regular headache. Excedrin or Ibuprofen took care of it next morning. Excedrin was better in the morning since it contains caffeine.",
  "All in all to sum it up, I'll be a regular user of Phenibut since it replaces that need for alcohol I used to have.",
  "I'll eventually wean off the Phenibut but it gave me the GABA I needed to survive withdrawals. It was a Godsend. When people go thru medical detox and are given drugs to come off a substance, they're often given sedatives. Phenibut in low doses appears to be safe with very little side effects and interacts well with my allergy meds. ",
  "Phenibut taken with a stimulant like Ephedrine provides a calm productive buzz that lasts a long time and makes life very pleasant. At least for me anyway.",
  "I'm 4 days off drinking, had a dangerous binge period while going thru some life issues. I should have been in medical detox because I quit cold turkey after hard liquor for 11 days straight. Bad period in life but I turned it around and will use Phenibut over alcohol from now on to deal with stress.",
  "I hope I've given good and helpful info here :)"
 ],
 "erowid": {
  "id": "81170",
  "citation": " ZenPuppy. \"Calm Productivity: experience with Phenibut & Ephedrine (with guaifenesin) (ID 81170)\". Erowid.org. Feb 22, 2012. erowid.org/exp/81170",
  "substance": "Phenibut & Ephedrine (with guaifenesin)",
  "views": "6570"
 }
}
