{
 "id": 1827,
 "title": "The Day That Changed My Life",
 "date": {
  "submission": "2002-07-14T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Igloo",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "MDMA"
  }
 ],
 "report": [
  "Four years ago i was in a tragic car accident resulting in the loss of my friend and severe injuries to several more of my friends and I. I was diognosed with Post Tramatic Stress Syndrome shortly after the accident. I was suffering from severe depression. I totally blamed myself for the loss of my friend and for the permanent injuries of my friends and I. I suffered from severe flashbacks which enabled me to drive a car. I had Post Tramatic Stress Syndrome so horrible that on numerous occasions I would collapse and basically relive the car accident, revisiting every word i said before, during, and after the accident in a dream like state. I was put on numerous medications with little to no results. One day I decided to try MDMA with several of my closest loved ones and several of the people involved in the car accident were present at the time of my experience. As the dose began to kick in flashbacks came with it. But this time the flashbacks were different -- way different. I talked with my friends who were involved in the accident and it totally changed my life. I begun to realize everything happens for a reason, even such tragic events as what we were all exposed to. I started to realize you cant think of all the 'what if' situations.(what if I wouldnt have driven, what if i would have left earlier, what if i would have left later, etc.)  Things happen for a reason and for the first time in my life since the accident occured i didnt blame myself, I didnt blame anyone, and I finally accepted it. Since that day I have had little to no flashbacks. I dont hate myself anymore, I dont want to die, and now more then ever I want to live. That day changed my life; actually I truly believe that day saved my life."
 ],
 "erowid": {
  "id": "15974",
  "citation": " Igloo. \"The Day That Changed My Life: experience with MDMA (ID 15974)\". Erowid.org. Jul 14, 2002. erowid.org/exp/15974",
  "substance": "MDMA",
  "views": "65380"
 }
}
