{
 "id": 18279,
 "title": "An Interesting, Yet Very Scary Experience",
 "date": {
  "submission": "2003-12-19T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Liquid Messiah",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>One day while riding a roller coaster at the local theme park, I was struck in the face by a piece of paper while going down the first hill. Today Id like to share what was written on it with you all...",
  "It was just a regular night of my teenage life, I had been smoking tons of marijuana in the past year, and considered myself a veteran to Mary Jane. But on this fateful night something went very, very wrong. I was used to smoking an ounce in the coarse of a few hours with my other 2 friends, will call them Bill and Bob. I had smoked with Bill and Bob previously that morning, same old high, same stupid stoner conversations about nothing in general, and same old cottonmouth.",
  "Bill had just gotten a 1/2-ounce from his mom of homegrown kind buds, the kind of erb Im used to smoking, 2 hitter-quitter, very potent. Bill had given me a 15sac for later when I go home. Now I was used to strong mind-altering substances like LSD and MDMA, and others. I knew how to handle situations while high, and was always responsible while high, even while tripping balls. But back to that night, I have a lot of energy in general and often use marijuana to relax and sleep good at night, so after watching the movie Groove, I decided to put an ambient trance cd on, smoke a bowl and just let the music take my away, my usual midnight routine. I consider myself to be healthy in mental and psychical states so being high alone never bothered me. I went into my little smoke den [Trippy paintings and posters, lava lamps, black lights the whole trippy 9 yards] that I turned my walk-in closet into. I then proceeded to pack a bowl, light my incense and grab the lighter. First hit was normal, started to feel light and calm. I had eventually smoked the whole bowl. What happened after the bowl was finished ill never understand.",
  "After staring at the carpet in amazement for about [or what seemed like 10 min] I noticed that I was higher than Ive ever been from marijuana. I said out loud [never have I talked out loud to myself while high] Wow! Im really, really fucked up!!. This kind of freaked me out, I then started to think out loud, whatever I though, I involuntary said out loud. I was starting to get paranoid as to why I was doing this, I then thought it was because of no distractions to focus on [i.e.: cds, TV, ect...] and stood up to go into my room. When I stood up though I got an incredible head rush like from sitting down for a long time, this I thought was hysterical for some reason and laughed for about 2 min straight. The whole time talking out loud to myself. When I went to put my cd in, I couldnt focus on the buttons good enough to work the cd player [this was very freaky because I can function fairly normal while high] I settled on watching TV.",
  "While trying to watch TV I felt this very strange, warm, tingling sensation in my chest. I though it felt cool but I instinctively felt my heart. It was beating at an insane rate! I started to panic [while still talking out loud]. I then realized that I shouldnt panic but instead try to calm down. I then lade down on my bed taking deep breaths and holding them in the exhaling slowly. This worked extremely well and my heart slowed to a relaxed pace [around 65-75bpm]. Then it became a little too relaxed. While feeling my heart, it was still beating slow but would stop for 1-2 sec then start beating again, then stop again. This scared the shit out of me. At this time I realized I wasnt just high, it was like I was tripping balls. I thought my heartbeat might be my imagination, so I felt my pulse in my right wrist. To my relief, it felt normalfor a minute. My pulse seemed more screwed up then my heartbeat was, it would pulse every 3-4 sec while my heart was going nuts because of me being scared.",
  "I soon gave up on trying to calm down. The more I tried to relax and calm down, the more I would get scared. I started to pray to God, to help me calm down, but I couldnt get out 2 words before forgetting what I just said. I was tripping HARD! I tried to read the bible the church people on TV sent me but could only get to 'On the first day' and then I would go illiterate. I tiered up thinking I was going to die. My heart was still out of control, my pulse wasnt even noticeable, I couldnt read, my memory was gone and my vision was full of slight pattering. I then considered going and waking my parents to take me to the hospital, but didnt want to get arrested or something. My dog came up and scared me shitless after jumping on me. I hugged my dog and started to talk to her. When I realized I was doing this I started to cry. I thought I wasnt ever going to see tomorrow. I laid down next to her and hugged her with one hand on my heart and cried softly. Then I woke up...",
  "The next day with my TV and lights still on, it was about 1:00pm I felt normal except for a fear burned into my mind, the fear of what went on that night before. I talked to my friends who smoked the same erb by themselves that night too, but nothing out-of-the-ordinary happened to them.",
  "Now, 1yr later, I have gotten over my fear of Mind-altering substances. I've done MDMA a couple times and tripped a few times. But havent smoked again. I'm going to try just a little erb with Bill and Bob this weekend and see what happens. I really want to smoke again but am too afraid. Sorry this is so long but I needed to tell my story and accept what happened if I want to smoke again.",
  "Well, wish me luck!</p>"
 ],
 "erowid": {
  "id": "8130",
  "citation": " Liquid Messiah. \"An Interesting, Yet Very Scary Experience: experience with Cannabis (ID 8130)\". Erowid.org. Dec 19, 2003. erowid.org/exp/8130",
  "substance": "Cannabis",
  "views": "6210"
 }
}
