{
 "title": "In Defense of the 60 Milligram Dose",
 "author": "Samanthe",
 "citation": " Samanthe. \"In Defense of the 60 Milligram Dose: experience with MDMA (ID 18280)\". Erowid.org. Jul 11, 2003. erowid.org/exp/18280",
 "substance": "MDMA",
 "bodyweight": "124 lb",
 "report": [
  "<p>Last year, I had quit taking MDMA for a while for two reasons. One, because I didn't think it was worth it. The magic was gone, I wasn't getting the same impact from it as I had before, the same degree of closeness and joy with friends. The MDMA space had become predictable and banal, almost like a stereotype. Two, I had taken it in mid-summer 2000 with a recent acquaintance at the time, whom I become involved with in a relationship that lasted two months. At the peak of the trip, after a few cartridges of nitrous oxide, I was convinced on a gut and soul level, that this was the person that I was destined to be with, as in 'marry.' It was like an epiphany. And I had just really met him only six hours prior to this. This concept of 'my destiny' being this man was so utterly preposterous in retrospect, that it really made me wonder about the information that I was getting while on MDMA. I had had the rule, 'never kiss a potential romantic partner on MDMA that you haven't kissed before.'",
  "I broke it, I ended up in that relationship, that's OK, but all in all, there was a very good reason I made the rule to begin with. Maybe I was getting into such a profound sense of acceptance, on top of a foundation of loneliness and wanting a partner, that my mind was going, 'Yes, this person is it.' It was yet another reminder of how intimate an experience it can be to take drugs with someone.",
  "Before my year-long fast, I was taking 120-150 about 4 times a year. After breaking the fast with this relationship, I did MDMA a few times where I took 100-120 mg, with 2C-B on the tail end of the MDMA. This lead to major body load, fuzziness of memory, and overall fucked-up-ness. The next day, I didn't remember much content, just that I was having wacky fun the night before. But it's no longer that interesting to me, if I can't recall what transpired. So I went back to being really cautious, and not seeking out MDMA.",
  "Halfway through this year, a friend who had quite intense physical responses to MDMA [her lips would swell where she would chew them, and the next few days she was really tired] suggested that I try a lower dose. She has a friend who has thoroughly explored lower doses, particularly to write books on. I had had the experience -- when I first started taking MDMA -- of the icky 50mg threshold dose feeling of 'not quite being there.' But that was a different time in my life, and I had much more experience with MDMA under my belt. So I decided to try it.",
  "That is how I discovered the 60 mg dose. I have tried 60 mg three times now, and though it is light, I retain most of the experience and the conversations the next day, I don't have negative aftereffects, and I don't get the fucked-up feeling. I get a pleasant centered MDMA sensation that I can 'work with' and use to enhance existing thoughts and feelings. This helps fit the experience into the fabric of my life. I have taken it at a small gathering [13 people] to dance and talk and bond, then another time to go on a long walk with friends and talk, and then a third time to stay at home and hostess a party.",
  "Each time I've also taken 5-HTP before and after the experience. The second day, I feel soft and happy, with no driving sense of having to do anything but enjoy the day. I don't get depressed or tired. I like the 60 mg dose because I tend to be a very serious person, and hard on myself, and the MDMA helps get me back in touch with compassion.</p>"
 ],
 "year": "2002",
 "id": "18280",
 "gender": "Female",
 "views": "10865",
 "dose": [
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2003-07-11T07:00:00.000Z"
}
