{
 "id": 18296,
 "title": "Rapid and Powerful",
 "date": {
  "submission": "2009-10-02T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Hoot10",
  "gender": "Male",
  "weight": "86 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "IV",
   "substance": "DXM",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>We had conversation about intravenous adminstration of DXM and my friend who has been studying the subject almost as much as I have, warned me strictly against intravenous use of DXM, based on studies by Robert F. Golazewski. I did brief search and found few accounts about IV use, but not on humans if I remember correctly. As I am familiar with metabolism of the drug and mechanisms from which DXM derives its effects and I had small supply of 99,8% pure DXM Hbr. powder, along with injection equipment. So for the sake science I decided to try intravenous adminstration of the substance.",
  "I prapared 2,5ml syringe, with 0,4 tip and roughly eyeballed ~100mg of DXM powder. The Dex was small crystals and very poorly water soluble, I prepared the solution with 2ml tap water, there was white crystals floating in the syringe as I was preparing for injection. I shaked the syringe to evenly dispense the substance in the solution and performed a sterile injection in a very small vein, there was no burn or uncomfortable sensations.",
  "t+2 minutes. There is no rush or comeup.",
  "t+5 minutes. Warmth is spreading all over my body and I feel familiar dxm sensations powerfull enough to identify as solid plateau 2 experience.",
  "t+15 minutes. I went to lie on a sofa and lost my conciousness, I was woken up 5 hours later and I was still on Plateau 2 level, with all the typical effects. I did not not pass out from the effects of the drug, more from sleep deprivation.",
  "This method was definately powerfull.",
  "Notes: powder was poorly soluble in water, maybe only 10% dissolved on warm water. But it was easily diluted in blood.",
  "I was amazed that I could achieve this level of experience with so small amount of substance, as I have read main effects are produced by metabolite DXO and requires processing in the liver, but this happened very rapidly. With oral route I have to wait usually 90-120 for full experience to take hold.",
  "I was slightly tired, not under any other substances than nicotine, mindset was generally happy and setting was my friends place with overall wellness.</p>"
 ],
 "erowid": {
  "id": "81413",
  "citation": " Hoot10. \"Rapid and Powerful: experience with DXM (ID 81413)\". Erowid.org. Oct 2, 2009. erowid.org/exp/81413",
  "substance": "DXM",
  "views": "14253"
 }
}
