{
 "id": 18305,
 "title": "Two Attempted Trips",
 "date": {
  "submission": "2004-05-25T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "NoMeaning",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "10",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "ground/crushed"
  },
  {
   "time": "48:00",
   "amount": {
    "number": "6.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Well, I read about these seeds, so I thought Id give it a try. If I did trip off of these it would have been my first trip. I have not done any drugs besides pot, beer, and pills.\r",
  "Well, I went to the store and bought six 1.8 gram packages of Heavenly Blue seeds (336 seeds) and a ten dollar electric coffee grinder. Got home, chopped 'em down to powder with the coffee grinder. I didn't put the powder in water that day, I waited like 2 days until nobody was home. Well on that day, I did my daily shit, got up and took a shower and then ate some cereal.",
  "I put the powder in about a cup of water and shook it around, let it sit for like 10 minutes, and drank it. I didnt leave them in the coffee grinder long enough because there were still a few half-seed pieces. So I just ate them. About an hour later I had a very strong euphoric feeling. My body was all numb and I was really happy (probably just because I thought I was going to trip. I went outside and sat on my step because the breeze felt really good and it was nice being outside watching the trees sway. Hours passed but my euphoria didnt increase or anything. I did not even have dilated pupils. All I found on this day was that these seeds only made me feel good, and then be really tired after that.",
  "I didnt think (and still dont think) what little amount of food I had effected the seeds effect. Just one small bowl of cereal the whole day. Plus 10 grams of the seeds, thats a pretty hefty dose. I did not have a trace of stomach pains or anything. I did have this uncomfortable feeling in my throat that I was about to barf though. Not a pain, and surely nothing bad enough to keep me from trying them again.",
  "Two days later my mom decided to go to the store, so I went along and bought 4 more packages of seeds (Heavenly Blue again). I got six grams of seeds, the packages were each 1.5 grams. I made sure I did not have a thing to eat before I did the seeds this time. Got home, ground the seeds; did a better job this time. I put it in some water and let it sit for a few minutes. The water was really brown this time as opposed to last time. I drank the water, along with a little bit of Coca-Cola.",
  "Hour and a half later, very slight euphoria and that was all, no stomach pains at all, again. I was sad, I just decided to eat my sandwiches and drink the rest of my coke. Before I got done with my 2nd sandwich I started to feel sick, no pains. I went and got a kitchen pan in case I barfed. I was lying on the couch. Nothing . . .",
  "I had to pee really bad so I went to the bathroom. While I was taking a wiz I looked at a light on the mirror. It was changing colors. Bad-ass I thought. I looked in the mirror and saw a big purple spot on my face from the light. I closed my eyes and I noticed some very light visuals. No open eye visuals whatsoever though, not even tracers. I made my open visuals with my flashlight. This wasnt too fun.",
  "Music was a little better than usual but it seemed a little quieter too. Took another piss - pupils were dilated. bright lights were still changing colors (when I stared at them long enough). and I was really dizzy. things move kind of weird like when drunk, but not delayed as much. I noticed that things seemed further away, which I read a story on here which suggested that. well thats basically it, no trip, even with a somewhat high dose again. But it was better than the 10 grams two days earlier. when I woke up this morning I had some very slight CEVs again, wave-like patterns I guess. I could barely see them and they went away after I looked at them for like 5 seconds. Its been 5 hours since I woke up and I still feel slightly dizzy.",
  "I wish I was one of those people who ate 100 seeds and had a nice trip. but I guess I'm not. Maybe Ill try an even lower dosage next time since it seemed to work better. I will probably do it again. Not soon though; I have other things to spend my money on. I didnt feel much of the puking and stomach pains at all, but of course, that's just me."
 ],
 "erowid": {
  "id": "8149",
  "citation": " NoMeaning. \"Two Attempted Trips: experience with Morning Glory (ID 8149)\". Erowid.org. May 25, 2004. erowid.org/exp/8149",
  "substance": "Morning Glory",
  "views": "8477"
 }
}
