{
 "title": "Peaceful and Beautiful",
 "author": "Monk",
 "citation": " Monk. \"Peaceful and Beautiful: experience with Morning Glory (Heavenly Blue) (ID 18306)\". Erowid.org. Jul 28, 2007. erowid.org/exp/18306",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "7.2 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "report": "<p>I have researched for some time now seeking a mind-altering substance that is legal.  I would really like to try angels trumpets and datura, but unfortunately, they are out of season.  So instead, I've decided to try Morning Glories.  I acquired a whole bunch of seed packets from a friend of mine who's an horticulturist.  She gave me ten packages of seeds, two are the flying saucers and the rest are heavenly blues.  Here is the timeline of my experience:</p><p>5:35 PM - Washed the seeds with a few drops of Dawn for dishes in a tupperware container.  I agitated them for two minutes and then rinsed several times in cold running water. </p><p>5:45 PM - Laid seeds out on paper towel to allow them to dry, preparing dinner for myself and my husband.</p><p>6:50 PM - Finished dinner, and I am now beginning to chew the seeds to a pulp as I do not have a coffee grinder.  The taste is quite odd, kind of like sunflower seeds with the husk on, nothing great, but not too bad either, I expected much worse.  I am washing it down with cran raspberry juice.  I'm cursing my cheap ways and wishing for a coffee grinder, it would have made it a lot more simple if I could have ground the seeds up and then put them in a yogurt or something. </p><p>7:05 PM - I take a break and smoke a cigarette, these seeds are a pain in the ass to chew and the taste is starting to bother and disgust me. </p><p>7:28 PM - I am now beginning to trip.  I have a heaviness of limbs, my vision is blurring slightly, i'm sweating, and my pupils are dilating.  This may be a fun time!  I am starting to experience a slight nausea so I took two tums about five minutes ago.  I'm tired and would like to take a nap.  Hopefully that feeling will wear off.</p><p>7:53 PM - I may not be able to document this the way I wanted to.  I'm now having difficulty typing.  Everything is blurry, I'm hot, crampy, uncomfortable.  Everything is distanced and far away.  I'm looking at the screen, but it's shrinking away.  Maybe I'll type more later.</p><p>8:20 PM - Ewww.  I just threw up.  Ugh.  I'm feeling much better now though, I'm still achy, but the nausea is completely gone.  Instead I have a wonderful floaty, shaky, and euphoric feeling.  I think I'll go have a cigarette and enjoy the great, albeit cold, outdoors. </p><p>8:42 PM - Slight visuals right now.  I was busy staring at the pine tree in the back yard forever, but really I guess it was only five or ten minutes.  I'm very clumsy, I dropped a cigarette in the yard and tried to find it, but I almost caught my hair on fire with my lighter.  I guess I'll find it in the morning.</p><p>Everything is so beautiful right now.  I'm looking at my cat and she's got these white spots that keep moving around, she's appointed herself as my guardian for this evening because she's following me around the house and meowing when I go outside.  She's usually such a quiet and reserved cat.  She's content right now on my lap and I'm deriving a quiet peace and joy from her contended purrings.  I feel very beautiful right now.  I'm a beautiful part of a beautiful world.  Everything is soft.  I love the feeling of my soft hair falling over my body and down my back.  I never let my hair down and it is very odd for me to do this, but I enjoy this sensation.  The visuals aren't really much, just a blur to everything, but I am seeing the patterns come out and it is just so beautiful.  It is difficult to analyze this experience.  It is not something to be viewed, it is something to become a part of and enjoy.  I think I'll become one now.</p><p>9:28 PM - Time is passing very slowly.  I am enjoying myself.  It is a very chilled out and relaxed trip.  The only problem is a slightly stiff neck and an irritation of my mucous membranes.  It's nothing compared to an acid trip and this is thoroughly enjoyable.  I'm listening to music and dancing. Dancing is such an important part of my life, it's a way to connect and vent frustrations. I can feel myself becoming one with the music.  It's wonderful. </p><p>10:33 PM - I am probably at the peak by now and I mostly feel like I'm coming down off of acid.  Perhaps a stronger dose would have given me a stronger trip, but more side effects.  I may try an LSA extraction next time.  Overall, I had a good time, sleep will be eluding me for a while this evening, but I feel as if it's already the end.  I just wish there was a way to escape the side effects.  I still have a lot of the seeds left over.  Since I like to garden and the flowers are pretty, maybe I'll plant some next spring and harvest the seeds for my recreational purposes. It is something I've been glad to have experienced.  I know that I will have to try a different method of ingesting next time because just the sight of the seeds want to make me retch, perhaps ground up and mixed with tea or coffee or maybe in yogurt like I said earlier.</p>",
 "year": "",
 "id": "18306",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-07-28T07:00:00.000Z",
 "views": "4108",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7.2 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ]
}
