{
 "title": "'Wow' Doesn't Do it Justice",
 "author": "J. Doe",
 "citation": " J. Doe. \"'Wow' Doesn't Do it Justice: experience with Salvia divinorum, Brugmansia & Cannabis (ID 1830)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1830",
 "substance": "Salvia divinorum, Brugmansia & Cannabis",
 "bodyweight": "",
 "report": "<p>the word 'wow' doesnt exactly do this trip justice.</p><p>the somewhat frank account of the trip:</p><p>a friend provided me with what he referred to as 'madman weed.' It was very high-grade hydroponically grown marijuana. it had crystals all over it and a very very spicey smell.</p><p>this was smoked in a 3' pipe. the pipe has a somewhat-resinated 'stash' in the middle. about 1/16oz of this marijuana was smoked.</p><p>this was followed by about 1/8th oz dried homegrown salvia.</p><p>this was in turn followed by 1/8th marijuana.</p><p>the following bowl was purely inspirational. it seems to me that 'mary' thought it would be a good idea to invite 'sally' over. So i combined equal proportions dried salvia leaves and dried, cooked (in other words, very finely chopped, very dry -- almost like a kitchen spice), marijuana leaves. The resulting smoke was filtered via an activated charcoal filter. it was incredible. two hits of the smoke were taken in quick sucession. before i could inhale another hit, a wave blew over me. it was incredible. a feeling like i had stepped through a threshold. i found the lighter, which had been in my hand, and further burnt the contents of the bowl, and further inhaling. visions sort of took over, with blips and dots flying across my eyes and pixelating my vision. my depth perception was about as unclear as on high-dose DXM (yeah, wow, me too... i didnt expect this!)</p><p>I sat down on the bed and waited a minute or two. those were two pretty intense minute. the salvia began to 'peak' in waves. this persisted until i picked up the pipe again.</p><p>for the last few weeks, the tree datura (brugmansia) i have dried has been staring at me. i feel like it wants me to take it again. i certainly love the plant. it is a small (about 8' tall) clone of a giant tree that made gorgeous flowers. its growing hydroponically, and has produced more leaves that I thought it ever would. the ones that it doesnt want get added to the 'datura pile.'</p><p>anyhow, I decided that tonight was a good night to try. I thought since I had nothing to do tomorrow, except have a meeting with Lester Sylvester Dexter, I should try it... if only for the dreams. I figured that if the plant stayed with me for a day or two, i could tough it out.</p><p>I placed a small leaf into the bowl, with no salvia or anything this time. just me and the datura.</p><p>She and I embraced for a few minutes.</p><p>Her touch carried me out of the hallway mj and sd had brought me to. It was an entirely different place. It seemed as though all three were definitely 'there,' but not in any sort of physical, visual, or other manifestation. I started music (just your average goa mixtape) after opening my eyes to find myself staring at the radio.</p><p>the room began to spin. i began to spiral downward, with swirling red and purplish blue dots flying around my eyes. vision turned to a darkish greengrey color, and the room simply disappeared. i dont know if my eyes were open or closed, it really didnt matter. after tiring of colored dots, i tried to sit up.</p><p>something inside me realized that navigation was necessary, and i began to start making things out. i crawled (literally) to the lightswitch and shut the lights out, and climbed back to bed. one of the three was persuading me to sleep, and dreams came not long thereafter.</p><p>i remember a dream about my back. voices were coming from nowhere, complaining about my back and all the drugs im on. (that is, that ive been prescribed)</p><p>i had some odd dream about myself being a martial artist, with waist-length black hair. this is particularly interesting to me, as ive been growing my hair longer over the last month or two. im hoping to have hair about that length.</p><p>siiiiiiigh. it was a wonderful trip. i felt rejuvenated the next day, and things regaring lawsuits and insurance companies are actually getting better since that very day. im getting paid, my back is getting fixed (or so they say), and I am learning more about the spirits.</p><p>i would definitely call the three an a+ combo, but take the brugmansia slowly. doses are cumulative over as much as three or four days!</p>",
 "year": "",
 "id": "1830",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-14T07:00:00.000Z",
 "views": "41249",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.6 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "3.2 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  "2": {
   "time": "",
   "amount": "3.2 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Datura",
   "form": "(leaves)"
  }
 }
}
