{
 "id": 18309,
 "title": "Stupid Mistake",
 "date": {
  "submission": "2010-10-20T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Absolute Beginner",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  },
  {
   "time": "1:00",
   "amount": {
    "number": "100",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  },
  {
   "time": "1:15",
   "amount": {
    "number": "100",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  },
  {
   "time": "1:45",
   "amount": {
    "number": "2",
    "unit": "shots"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "3:30",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "0:00",
   "amount": {
    "number": "100",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  },
  {
   "time": "4:15",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  },
  {
   "time": "4:45",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "4:45",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "What Im about to tell is a bit embarrassing, considering the fact that Im a grown woman and should have known better. Anyway, heres my story:",
  "I had found out about tripping on motion sickness pills by pure chance while browsing the web, and I was rather intrigued. I have never done any drugs besides alcohol, but I was fascinated by some of the experiences I read. So I went and bought some motion sickness pills that run under the brand name Vomex here in Germany, each pill containing 50 mg Dimenhydrinate. Mind you, I wasnt after a full blown trip, I just wanted to test the waters, so to speak. Recently I have had trouble sleeping, and I figured at worst the pills would help me with that.",
  "So last Friday evening I changed into my PJs and settled comfortably on my bed with my netbook. I had decided that I would keep a log describing my experience. Being the careful person that I am (youll understand the irony of this later), I took one pill at 20:15pm to observe the way Id react. Nothing happened. So an hour later I took two more pills. I thought I felt something then, but it was very weak and didnt make me tired at all. In the opposite, I just got all shaky and my pulse went up.",
  "I waited until 21.30pm to take another two pills. Half an hour later, I still hadnt noticed any effect. It was then that I made a rather stupid decision. I remembered that in the past I had once or twice taken Vomex against nausea after drinking too much, and I had always been out like a light half an hour later. So, in order to boost the effect of the pills, I poured myself a rather generous amount of gin and downed it in one go.",
  "By now it was about 23:00pm and I started to feel somewhat lightheaded, which I attributed mainly to the alcohol. The trembling from before had subsided and gradually I became more relaxed. But still no drowsiness.",
  "At 23:45pm I resolved to have another drink. About fifteen minutes later I was beginning to feel really drunk. I was seeing double by now and typing was becoming difficult. I was watching anime on my computer and noticed that following the story was getting rather tough. In retrospect, I guess I had reached the point at which the pills finally started to kick in, but at that time I blamed all of it merely on the alcohol.",
  "So of course at 12:30am I decided I would have another two pills. Now imagine my surprise when I noticed that not five but seven pills were already missing from the pack! I had apparently taken two more and forgotten about it. That should have been a warning sign, but at that point I was too far gone to care. So I told myself Id simply take one more, bringing me up to a dose of 400 mg. I figured that should be safe enough, since it was the recommended maximum dose per day.",
  "By now my motor skills were deteriorating rapidly. When I had to go to the bathroom, my balance was severely off and I would have to hold onto walls and doors. Even sitting down on my bed, I couldnt help swaying back and forth. I started to make a lot of typos in my entries, but at the same time I was enjoying myself immensely. That was when things started to get hazy.",
  "My log states that at about 1:00am I had my third drink, washing down the ninth pill, thus bringing me up to 450 mg. Unfortunately I have no recollection of doing this or of the hours that followed.",
  "I woke up in my bed at 10:20am. The computer was still running. It seems I stopped watching anime at some point, probably because I had no idea what was going on. I checked the browsers history and found that I apparently had been browsing the web, though I cant think why I would have been interested in some of those sites. For example I went to a website constructing anagrams, where I typed in some random letters. I was rather worried I might have engaged in Drunk Mailing, so I checked my email, too, but luckily there was nothing in the Sent folder. I guess I was too far gone to manage typing in the password, anyway.",
  "Another weird thing is that I apparently got up to get a sweater out of my wardrobe. I woke up having it wrapped around my shoulders, though I have absolutely no memory doing this. Also, I think I might have had another drink. The bottle of gin was half empty.",
  "Judging by my log I started to get seriously confused after 1.00am, as in the next entries I was already unable to give the correct time. The entries I made also become virtually unreadable pretty soon. Heres an example:",
  "Just went to the bathroom. Well, staggg34 2ould b3 the corrxt te3rm. it#s rather cruytrating b oops, again Ive forgotten wasw NBPOUT TO SEE:",
  "The last entries are nothing but complete gibberish, random letters strung together. I made the last entry at 3.30am. (For some reasons I saved it in a separate file, so I was able to check the time.)",
  "When I now read my log, its really funny how Im complaining about not feeling a thing for three hours, and then, WHAM, it hit me full force. Obviously I underestimated the stuff. I checked the facts online again and only then became aware that a trip with Dimenhydrinate will need some time to built up. In retrospect, the alcohol has been a mistake since it kept me from noticing the onset of the trip while also enhancing the effects of the drug. Since I took 450 mg, I might even have been hallucinating, but I have no idea if I actually did. Im a bit annoyed that I cant remember being so messed up, but at the same time Im impressed.",
  "The next day the effects of the drug were still pretty noticeable. My head and legs felt heavy and my balance was still slightly off. Now and then I would have small muscle spasms like the ones you get shortly before falling asleep. Also my hands were rather shaky. I was rather glad that I had at least had the foresight to choose a Friday evening for my little adventure, so I was able to spent most of the next day in bed.",
  "Now, what did I learn from this?",
  "1. Mixing alcohol and Dimenhydrinate is not a good idea.",
  "2. Be patient and dont redose, especially when already far from sober.",
  "3. Make sure I have nothing on my hands for the next day.",
  "Im quite aware that things could have gotten nasty. Im glad I didnt do something stupid during my black-out, like falling asleep with a burning cigarette or taking any more pills. Overall I wouldnt call it an unpleasant experience, though. I was feeling rather good the whole time (at least during the span of time I can actually remember), and found the hangover symptoms easy to deal with. I will definitely give the Dimenhydrinate another try sometime."
 ],
 "erowid": {
  "id": "81515",
  "citation": " Absolute Beginner. \"Stupid Mistake: experience with Dimenhydrinate (Dramamine) & Alcohol - Hard (ID 81515)\". Erowid.org. Oct 20, 2010. erowid.org/exp/81515",
  "substance": "Dimenhydrinate (Dramamine) & Alcohol - Hard",
  "views": "11590"
 }
}
