{
 "id": 18310,
 "title": "Painful, Feel Like I Am Going to Die",
 "date": {
  "submission": "2009-10-08T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bios ApexX",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Unknown"
  },
  {
   "time": "1:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Unknown"
  },
  {
   "time": "2:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Unknown"
  }
 ],
 "report": [
  "One day I was very bored getting some fish and chips at the local Chinese shop. I went across the road to a dairy to get a red bull (I had already drunk three that day). While inside the shop I saw a rack of legal highs (Common in New Zealand but the shop has since removed them). I asked their effects and picked one out called 'hypnotic' It said on the packet that it was a relaxing yet high energy buzz. I pick my fish and chips up and went home.",
  "8:00pm - I take 2 pills and play battle field for about an hour. No effects.",
  "9:00pm - I take 1 more pills. No effects.",
  "10pm - Feeling like I had been scammed out of $20 I take another pill. Then after about an hour I feel very relaxed like everything is so soft and content.",
  "10:30pm - I feel I can do everything better! I start doing the house work. Then I feel I cannot breath I feel like I am going to die. I talk to my friend on MSN he tells me to take a walk. I try breath fresh air. It comes in waves I feel fine then like I am going to meet my death.",
  "11:00pm - I get help from my mum tells me the same thing to relax and wont drive me to the emergency room.",
  "2:00am - She drives me to the emergency room because I cannot walk and am crying out in pain and screaming that I am dying. I legitimately feel like I am going to die. I begin to relax in the car then I start having muscle spasms. At this point I cannot breath (We are about 5mins away from the E.R)",
  "I am placed in a wheel car in the E.R and left in the waiting room. I feel relaxed now and safe. I begin to sober up. I am checked out and sent home at this point everything seems slow and time seems freezed. I stumble to my room and try sleep everything is spinning around slowly. I wake up about 12 times during the night feeling like I am dying. I power vomit 4 times.",
  "For about 3 days after the experience I felt very depressed and 'odd' sort of out of place not myself. I just wanted to be with my girlfriend and loved ones I had a new outlook on life felt that I would never use drugs again ( A week later I used san pedro)",
  "It would have had to been the worst experience of my life and left me with anxiety issues for months later."
 ],
 "erowid": {
  "id": "81522",
  "citation": " Bios ApexX. \"Painful, Feel Like I Am Going to Die: experience with Unknown (Product - 'Hypnotic') (ID 81522)\". Erowid.org. Oct 8, 2009. erowid.org/exp/81522",
  "substance": "Unknown (Product - 'Hypnotic')",
  "views": "3677"
 }
}
