{
 "id": 18312,
 "title": "Slowed Down Spin",
 "date": {
  "submission": "2010-08-02T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "CannibusCannibal",
  "gender": "Male",
  "weight": "137 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "70 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cloves",
   "form": ""
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cloves",
   "form": ""
  }
 ],
 "report": [
  "Each morning I take a 70mg Vyvanse pill because I am diagnosed with ADHD, Vyvanse lasts for approximately 13 hours and gives you a non-stop high of being in a good mood.  Unlike Adderall XR, which I previously took and gives more of an energy high in the same way.  Vyvanse also increases your high after smoking cannabis as well, at least, it does for me.",
  "Well anyways, the day started by a casual smoke of a cigarette and then we got down to business.  We had been looking forward to smoking salvia for a long time and today we had just purchased two 25x bags of it.  We loaded the water bong with a bowl and each hit dubs on the pipe.  The first hit immediately made me feel like I had just smoked three blunts, but didn't make any of us completely high, we had four people and just kept loading and smoking the salvia.  After the fifth bowl, I called it quits.  Unlike what people had told me, I did not hallucinate and go into another world. ",
  "Then, I smoked a Kretek: Djarum Splash clove cigarette while waiting for the others to finish, and the last person finished on the seventh bowl.  When everyone was done, we loaded up the bong with some upper mids (weed) and smoked about four bowls of that and we were then extremely baked and decided to then smoke another cigarette.  Before smoking the clove I just felt really high, but after I had smoked it, I felt light-headed and nauseous, almost like I was going to throw up.  So then I just laid down to kind of wait it out, this is when I basically went to sleep/passed out, but I was still there physically, but in my mind I was spinning in a non-stop motion into a blue circle and I didnt know what it was, eventually I came out of the trance and my friends said I had been gone for about 30 minutes and had still been talking to them off and on. ",
  "I am still unsure of what exactly happened, but it was an experience unlike any I have ever had.  After smoking salvia a few more times during the next few days, we decided that we are probably done with it, as it is nothing compared to smoking marijuana and that it just makes you tired and sometimes dizzy.  Even though I probably will not smoke salvia again, I will never forget my trip I had while I was on it.  But to all people looking to trip off it I have learned that you need a higher grade to make it happen.  So I will probably just stick to the marijuana."
 ],
 "erowid": {
  "id": "81544",
  "citation": " CannibusCannibal. \"Slowed Down Spin: experience with Salvia, Cannabis & Cloves (ID 81544)\". Erowid.org. Aug 2, 2010. erowid.org/exp/81544",
  "substance": "Salvia, Cannabis & Cloves",
  "views": "9441"
 }
}
