{
 "id": 18318,
 "title": "Glimpsing the Void",
 "date": {
  "submission": "2010-04-14T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Faintofheart",
  "gender": "Female",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "My experience with 5-MeO-DIPT left such an indelible impression on me that I can still recall many details to this day (7 years later). I nave 17 year old, I was given this drug by a friend without doing the proper research. I had never heard of the drug, let alone researched it adequately. Had I done my research, I would have probably avoided it. However, after numerous LSD and mushroom trips as a teenager, I considered myself a seasoned veteran of psychedelics. Well, the 5-MeO-DIPT humbled me!",
  "I, my boyfriend, and our friend (Ill call him Jim) each ingested one capsule around 6 p.m. The capsules appeared full, and I assume this was due to some type of filler, however I do not know the dose of 5-MeO-DIPT I consumed. This, I later learned, was very foolish, as such chemicals are extremely dose-sensitive. As fairly small female, I got markedly higher than my larger male counterparts.",
  "The effects started within 45 minutes, feeling like a harsh acid come-up, however, devoid of pleasure. At this point, time became more difficult to gauge, and I quickly realized that the sun was setting. We walked to a park across town, a familiar park of my childhood. However, this park at night seemed menacing. I could feel the waves of paranoia creeping in. The feeling of being watched was distinct. I felt as though our voices were extremely loud, as though everyone in the neighborhood knew what we were up to.",
  "I felt very withdrawn at this point and my stomach was churning. Just as my stomach began to feel unsettled, my boyfriend forcefully vomited in front of me, intensifying my own discomfort. This disgusted me so much that I could barely speak afterward.",
  "This experience diverged greatly from those I had on LSD or mushrooms, in which group cohesion was high, and I genuinely enjoyed conversation and company. I felt like I was in my own little world, and my companions were irritating me.",
  "Eventually the three of us journeyed back to Jims house. I was still feeling quite sick, so I asked Jim if I could take a shower, hoping it would make me feel better. In fact, the shower did make my stomach feel somewhat better.",
  "When I was done, Jim announced that he was going to take a shower as well. When he emerged, he declared that he threw up about a hundred times in the shower and now felt great. This made me somewhat nervous, as I was the only one who had not physically gotten sick. At this point, Jim started behaving strangely. He said to my boyfriend and me, You two should kiss in front of me, act like Im not here. His voyeuristic comments freaked me out, so I insisted that my boyfriend walk me back to my mothers house.",
  "I am very grateful that I eventually made it home, because the next six hours were pure torture for me. During the 30 minute walk home, I could feel myself becoming more detached and disoriented.  We arrived at my mothers house around eleven p.m. Once I reached my own bedroom, I really let go and allowed myself to become completely de-personalized. I was unaware of who I was, and did not recognize my boyfriend. He calmly said, Well, in that case, Im your spirit guide. My (now unrecognizable) boyfriend appeared elf-like, with pointy ears and nose, and long dripping fingers. His appearance and movements mildly amused me.  I looked at myself in the mirror, and I also had this elf-like appearance. ",
  "However, I began to forget that this was a trip that I had desired, and that I had ingested anything. I gradually vacillated between moments of pure clarity and complete confusion. I expressed some profound statements, and yet I was being pulled into another world.",
  "I traveled to another dimension and was communicating with light beings. I was gazing into a vast dark tunnel, and I was not alone. I was conversing with several other-dimensional beings (verbally or telepathically, Im not sure).",
  " At a certain point, I was pulled back into reality by my boyfriend telling me urgently Breathe! Dont forget to breathe! Apparently, my breathing had become quite irregular. I found myself having to consciously will my lungs to breathe. I began to be aware of my heart beating irregularly. I am certain this was a very real physiological phenomenon, with my heart skipping beats and then beating rapidly to make up the missed  beats.",
  "Obviously, this was quite distressing. I faced the very real possibility that my body could be shutting down. In fact, I am quite certain I nearly died. This was one of the most profound experiences of my life, standing on the precipice of death while having an intense psychedelic experience.",
  "I nearly plunged into the void, but a light being told me, No, its not your time yet. You have so much left to do! Then I was given the privilege of witnessing future events from my life that had yet to unfold.  Upon the realization that my life was not over, I started to come back into normal consciousness. I was ravenously thirsty, and started drinking massive amounts of water from the bathroom faucet. I realized I had been hiking around all summer evening without any water. Plus, I had practically been to the other side and back!",
  "I gradually came down as the sun was rising, with real life encroaching harshly. At noon I was still experiencing some residual effects. This was the longest, scariest trip of my life. I am grateful that I lived to tell the tale, and I will never again take a mysterious white pill just because Im bored! However,  this trip was responsible for much personal spiritual growth, and I now have a new appreciation for life."
 ],
 "erowid": {
  "id": "81573",
  "citation": " Faintofheart. \"Glimpsing the Void: experience with 5-MeO-DIPT (ID 81573)\". Erowid.org. Apr 14, 2010. erowid.org/exp/81573",
  "substance": "5-MeO-DIPT",
  "views": "6972"
 }
}
