{
 "id": 18327,
 "title": "Organic Brain Syndrome",
 "date": {
  "submission": "2000-07-16T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Brigid",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Dose: 150-300 mg/ day",
  "I realized that I had a problem, for I had always questioned my sanity. Yet through it all, I secured my BA in English,and had been a valued employee of the Chemistry Department of a local hospital where I worked for nearly fifteen years. In the back of my mind however--the self-sanity quiz took place. To the question of whats wrong with me, I finally have my answer: Not a thing. Not anymore.",
  "I had experienced 17 years worth of symptoms, including panic attacks, anger and depletion of energy. My liver was beginning to deteriorate, I had disturbed vision, facial rashes, stomach aches. I sought help. I was diagnosed with Muscular Dystrophy, rosacea, gastritis, and a host of other medical problems, not to mention mental insufficiency-- I was admitted into a psyche ward because my family was concerned.",
  "I was poisoned by caffeine; an ongoing dance with the devil, and I wasn't aware of it because I had built up a toxicity. I drank 2-4 cups of coffee a day, and maybe a candy bar at night. I never touched teas, or sodas.",
  "Through the years I suffered several miscarriages, and TMJD.Allergies and sinusitis had been diagnosed. Antibiotics and antihistamines had been swallowed. I drank coffee-- and Benadryl.",
  "Like other drugs, caffeine also has the ability to depersonalize. When I stopped drinking coffee I felt as though someone else stepped from the back of my mind and my old self stepped forward to eliminate the alien in my mind.  I had always prided myself on being reserved, polished, cultured and educated. That is who I am--it is not who I became while my mind raced out of control. Once quiet and compassionate, rashness and irrationality overcame me. Personal relationships had been jeopardized.",
  "To those who may suffer some of the above symptoms, please reassess your caffeine intake. Indeed, it is a psychoactive drug; one easily obtained. But it can destroy the body and mind. Gratefully I have a medical background because I actually confronted the physician with my suspected caffeine allergy. He agreed, and said 'Not only are you allergic, but you are toxic.'",
  "I had organic brain syndrome, caused by a substance introduced into my body that interfered with my natural mental capacities. And I wonder how many others are suffering needlessly with the knowledge that something is wrong with them. And I wonder how many people are needlessly consuming psychiatric drugs? Luckily, I am not.",
  "My rational has returned, and every medical problem has ceased. I have organized my home, and I have applied to graduate school.",
  "For me, caffeine is the devil's advocate and I will never touch it again. I am enjoying life once again...caffeine-free."
 ],
 "erowid": {
  "id": "816",
  "citation": " Brigid. \"Organic Brain Syndrome: experience with Caffeine (ID 816)\". Erowid.org. Jul 16, 2000. erowid.org/exp/816",
  "substance": "Caffeine",
  "views": "23394"
 }
}
