{
 "id": 18321,
 "title": "Doves: Bliss to Pain",
 "date": {
  "submission": "2009-10-08T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sophia A.",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Unknown",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Background Information: I am an 18 year old female. I do not take any medications, or vitamen supplements.",
  "When visiting Scotland, I purchased one pack of legal highs called Doves from a head shop. Doves are made by a company called London Underground, and they are said to be safe alternatives to Ecstasy. They do not list the ingredients on the packaging. ",
  "7:00 PM - My boyfriend and I aren't really doing much tonight, so I decide to take the doves I've purchased. I decide this after I have eaten a full meal, so I know it'll probably take awhile to kick in. He decides to stay sober.",
  "I'm in a very good mood when I take the two pills. I feel excited and happy to be trying something new. My boyfriend and I at the time had our own room to stay in at a friend's house. The friend was out of town, so we were by ourselves. ",
  "8:00 PM - Not feeling anything. I'm guessing it's due to the full stomach.",
  "9:00 PM - Still not feeling anything. I'm starting think these are a scam.",
  "10:00 PM - Nothing. Convinced this must be a scam.",
  "11:00 PM - To my surprise, I start to feel more alert....Physical touch feels very similar to how MDMA feels, but other than that nothing.",
  "12:00 AM - My boyfriend and I decide to go to sleep. I still feel alert, but not enough so that I don't think I could fall asleep. As soon as I close the laptop I'm on, I feel as if I'm slammed with a strong chemical force, very similar to when MDMA hits me all at once. I tell my boyfriend that I am suddenly VERY high. ",
  "The high is similar to MDMA in many ways. I feel very happy, open, and empathetic. Physical sensation feels great, although I'm getting much worse dry mouth than I get with MDMA. The main difference I can find is that this high isn't very speedy. Though I do have a lot of energy, I definitely don't feel the need to get up and dance. I can also say that I feel very much so in control of myself, unlike sometimes on large doses of MDMA where I become an 'e-tard.' Another interesting side effect is that it's pretty hard for me to motivate myself to do anything like go up and get a glass of water. I did drink water while I was high, but not nearly as much as I should have.",
  "12:05 AM - Boyfriend and I have sex. After having sex (which, I will admit, was some of the best sex I've ever had, although I couldn't reach orgasm.) he passes out.",
  "1:00 AM - With nothing else to do, I go online and see that a good amount of my friends are online. I talk with them for most of the night and have good conversations with many of them.",
  "2:00 AM - Still very high.",
  "3:00 AM - Still feeling just as high as when it hits me.",
  "4:00 AM - This high lasts A LOT longer for me than with MDMA. I decide I like this more than actual MDMA due to it feeling more controllable but feeling just as good.",
  "5:00 AM - Starting to come down. The come down feels very natural, very light. I feel a little bit disappointed upon coming down, but not nearly as disappointed as with regular MDMA. I feel less motivated to tell people how much I love them or talk to them and start looking at things online.",
  "5:30 AM - Back to baseline, though feeling very awake. A little bit tired too. I decide to try and go to sleep, and go get into bed with my boyfriend.",
  "5:45 AM - My stomach is starting to hurt...Feels like a slight burning sensation. My breathing is becoming more noticeable.",
  "6:00 AM - Stomach is in IMMENSE amount of pain now. It feels like my entire chest is burning up. My breathing is now considerably more noticeable, to the point where I feel like I'm hyperventilating. I wake my boyfriend up. He holds me to try and calm me down, and I begin crying from the physical pain. I have a pretty high tolerance for pain, so this is surprising even to me. Part of the crying could have also been due to fear because I didn't know what I had actually ingested.",
  "7:00 AM - The pain is still very intense, and I'm still crying. My boyfriend has to keep reminding me to drink water. I feel very light headed and am still having trouble breathing.",
  "7:45 AM - I can feel the pain starting to pass now.",
  "8:00 AM - Pain is mostly gone. Boyfriend and I decide to try and sleep. He passes out, and I remain awake.",
  "9:00 AM - Can't fall asleep. Boyfriend is out cold.",
  "10:00 AM - 12:00 PM Still awake. Boyfriend wakes up and leaves to make money street performing so we can buy food. I obviously chose to stay home.",
  "12:00 PM - 2:00 PM Go on the computer for awhile. Decide to try to sleep at about 2:00 PM.",
  "2:00 PM - 5:00 PM - Sleep. I am woken up by my boyfriend coming back.",
  "5:00 PM - 11:00 PM - Still feel decently tired, but am awake enough to go grocery shopping. We make food and spend time together till we go to sleep. I have no trouble falling asleep at this point.",
  "I feel back to normal the next day. However, three days after I have taken the drug, I experienced a horrible depression. I had to head back to Dublin that day to catch my returning flight so I was alone. I can barely pull myself out of my bed at the hostel I'm staying at. I can't remember a time where I felt this upset.  I have read about 'Tuesday blues', where MDMA users report that three days after they use MDMA they feel horrible. I acknowledge the possibility that I could have taken an MDMA analog when I took the doves, so it could cause a similar effect that MDMA would. I also took two hits of MDMA three weeks earlier, so that also could have contributed due to the fact my serotonin could still be in recovery mode. I return back to normal the next day.",
  "In summary, I will not be doing these ever again."
 ],
 "erowid": {
  "id": "81585",
  "citation": " Sophia A.. \"Doves: Bliss to Pain: experience with bk-MBDB (Speculative) (ID 81585)\". Erowid.org. Oct 8, 2009. erowid.org/exp/81585",
  "substance": "bk-MBDB (Speculative)",
  "views": "23573"
 }
}
