{
 "id": 18325,
 "title": "Somewhat Like MDMA",
 "date": {
  "submission": "2010-07-29T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Canna",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(capsule)"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "15:30",
   "amount": "2 capsls",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  },
  {
   "time": "15:30",
   "administration": "oral",
   "substance": "Pharms - Doxylamine",
   "form": "(capsule)"
  }
 ],
 "report": [
  "This particular experience took place about a month after I quit using MDMA due to an obvious psychological addiction I could see forming. I had access to a bottle of 30mg Vyvanse, and I read that it is a lot like Adderall but without the 'rush.'",
  "A bit of background: I'm an 18 years old, I smoke cannabis heavily, just about every day, and I've experimented with LSD, psilocybin mushrooms, MDMA, Salvia and painkillers. I used to smoke cigarettes but I quit them on the same night I quit MDMA. I drink occasionally, but the novelty of being drunk has sort of worn off for me.",
  "5 30mg capsules went down the hatch at around 11 am, totalling the dosage at 150mg. I had considered staggering the doses, but I remembered reading about how the come-up is very gradual and there's no rush at all, and I decided the best way to experience the full force of it 'hitting me' was to swallow all 5 at once. Some friends came over and we started smoking some good cannabis in my living room. By 11:45 I had a building feeling of...something, I didn't know what yet, but I knew I wasn't just stoned.",
  "By around 12:30 it was getting difficult for me to sit still. My eyes were WIIIIIIDE open and I felt almost exactly like I was on a moderately strong ecstasy roll. I kept running my fingers through my hair, everything was extremely funny, and I was VERY talkative. Only one of my friends knew I had taken these pills, the rest had no idea, so it may have appeared strange to them, watching me tweak out in my seat. However, shortly after this time, all my friends except the one who knew what was going on decided to leave. THIS was when things got interesting.",
  "As soon as my friends left, I sprang up from my couch and started walking in circles around my living room, blasting electronic music, feeling my hair and talking about 1000 words per minute about life, death, and many other topics that sprang to my head without warning.",
  "I thought about how fear of death is completely illogical. Fear is an emotion which living things feel, and once something is dead there is no fear of death, because fear is not possible. I thought a lot about Christianity and other poly- and monotheistic religions and how blatantly they can contradict common scientific fact and, in some cases, common sense.",
  "I felt like the friends who I see and smoke with on a day-to-day basis were the greatest people in mankind's history; and I had an overwhelming desire to know more about them and, for some reason, to give them food. I always have an absolute shitload of food in my house, so it's like muchies-central for my stoner buddies. Usually I tend to monitor how much my friends will eat so as to not let them go overboard, but today I didn't give a shit.",
  "I felt like I was on MDMA from this time until around 4 or 5 in the afternoon. By then, the experience had died down a bit and I found myself playing video games, drinking lots of water, smoking more weed and seemingly asking my friend a new question every 10 seconds.",
  "Cannabis goes very, very well in combination with this particular substance. The speedy, wide-awake effect of the amphetamines is not diminished by the stoned feeling of good chronic at all. Of course, cannabis has personally been like 'the icing on the cake' for every substance I've taken. However, when on Vyvanse, I felt like I could control how stoned I was just by thinking about it. I continued smoking high-quality cannabis throughout the day and early night. A few times, I remembered the appetite-decreasing qualities of amphetamines. I have never liked the idea of a substance that makes you not want to eat, so throughout the day I managed to force down a granola bar and a few blueberry yogurts.",
  "I went back home that night at around 11:30 pm. Stoned and still 100% awake and wired, I hopped on my computer and started talking to all my AIM buddies. I will point out that my typing was the fastest and most accurate I have ever managed. I made maybe 5-10 spelling/punctuation mistakes in the course of a half hour, and every time an AIM buddy would respond there would already be a new paragraph for them to read. 6 or 7 of them noticed how fast I was typing and commented on it. I decided to take a WPM (Words Per Minute) online typing test just for kicks, and I found that my average typing speed at the time was 190 with 1 or 2 errors. This was amazing to me because while I am usually quite a fast typer anyway, my words per minute is usually around 100-130.",
  "Time went by and before I knew it it was 2:30 in the morning and I was still 100% wide awake. I downed 2 nyquils hoping they would put me to sleep, but they had absolutely no effect. I ended up watching the TV show 'Weeds' from 2:30 am until about 9:00 am. At this time two of my friends called me to smoke some more weed, and I gladly obliged.",
  "I didn't go to sleep or feel remotely tired until about 11:00 pm that next night. So in total, this experience had me wide awake for about 36 hours, even though the main effects had died down after the initial 14 or 15. Once my head hit that pillow, however, it was lights out until 4 in the afternoon the next day.",
  "In summation, it was a fun experience, but not one I'm looking to repeat ever again. Not because it was terrifying or anything, but because I can see how addictive it could become, and I didn't quit MDMA just to use some ADHD medication.",
  "Note: There was one weird side effect I experienced: At two points during the experience, my hearing in both ears suddenly decreased, and for the next minute or two it felt like I was hearing everything from underwater. Both times it happened unexpectedly and passed after about a minute, but it was very weird.",
  "Since that day, I haven't touched amphetamines or MDMA, and I don't plan to. This Vyvanse experiment was a one-time thing. I've satisfied my curiosity about it."
 ],
 "erowid": {
  "id": "81594",
  "citation": " Canna. \"Somewhat Like MDMA: experience with Amphetamines (Vyvanse) & Cannabis (ID 81594)\". Erowid.org. Jul 29, 2010. erowid.org/exp/81594",
  "substance": "Amphetamines (Vyvanse) & Cannabis",
  "views": "54356"
 }
}
