{
 "id": 18335,
 "title": "Death Blooms",
 "date": {
  "submission": "2003-04-17T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "gODHEAD",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "Well, once I tried 700mg of caffeine and it had produced no effects whatsoever. So yesterday I felt like taking a little more. I bought some Wake Ups. I took 8 tablets which was not exceeding the recommended dose, though I took them all in about 30 seconds. For the next hour nothing happened, like the 700 mg experience.",
  "Then it hit me like a bullet to the head. Out of nowhere I got motion sickness in my mom's van which I have never felt in 2 years since I was in Vancouver passing walls and endless fucking walls of rock. That made me sick. Me and my mom where on the way to a bike store to drop off my BMX to fix this minor problem. The guy was explaining what was wrong with my bike. All I heard was this weird voice and I couldn't concentrate at all. When I bent over to touch the pedal my hand shook like a leaf. I had to hide it before my mom suspected something. On the way home I was felling stomach sick and it hurt to move. This was at about 1:30pm.",
  "I got home and luckily my mom took off. I when strait to the bathroom and force myself to vomit. All that came out was this pink shit which was the colour of the pills and stuff that tasted like this chicked wrap I had eaten before I left for the bike store. I felt better.",
  "So I just passed time doing nothing. At around 4:00pm I started to feel sick again. I drank some carbonated water mixed with cranberry juice to settle my stomach. It didn't work so I made myself puke again.",
  "I made a phone call to a friend that I couldn't make this ocasion and then I started shaking. I went strait to my bed and passed out. I woke up about and 1hr and 20 mins later still feeling bad. I ate a salad and a little hunk of chicken.",
  "I made myself puke again. I had immense pain and this wierd feeling for the next 2 1/2 hours. At about 8:30 pm I tried to sleep. I felt mildly better and then my symtoms incresed. I was cold and hot and I got up and felt so fucking dizzy. I headed strait  to the bathroom where I puked my fucking guts out. It was a greenish black liquid with a little brown. I felt so much better: relief. I did have a stomach cramp though. It took me and hour to fall asleep.",
  "I sleptwalked which I had done two nights before when I had tripped on Gravol. Well its morning and feel better. That was a horrible experience which I never want to repeat."
 ],
 "erowid": {
  "id": "8166",
  "citation": " gODHEAD. \"Death Blooms: experience with Caffeine (ID 8166)\". Erowid.org. Apr 17, 2003. erowid.org/exp/8166",
  "substance": "Caffeine",
  "views": "20205"
 }
}
