{
 "id": 18334,
 "title": "Clarity and Confidence",
 "date": {
  "submission": "2012-03-21T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "stuffedpenguin",
  "gender": "Male",
  "weight": "185 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "310 mg",
   "administration": "oral",
   "substance": "Vitamins - Choline",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "310 mg",
   "administration": "oral",
   "substance": "Vitamins - Choline",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>For years I have been searching for something that would flip that switch in my brain which allowed me to think clearly, read quietly, think before I act, and enjoy life without taking unnecessary risks.",
  "I have adult ADD. I have been prescribed a few ADD drugs including Strattera and Wellbutrin. Both had negative side effects for me. I found Piracetam mentioned on an article comment on the web. I decided to try it after some research. After my first dose I went directly to the bookstore, the logic was that if I was going to have a rare bad reaction to a new drug, I was going down in public. After it took effect, I realized that when I read a book, the rest of the world went completely silent. This effect was amazing to me. The focus effects were not so pronounced after the first day, but came back slowly within 3 weeks. I am in college so I need to write papers often, which I normally hate. I now can study diligently and write papers without much struggle. I used to get stressed about forgetting things, but I am remembering much more on a regular basis, and I am more organized.",
  "ADD is nasty, and makes me feel very incompetent at times. Piracetam has helped me to stay focused and less stressed. I feel like I can make rational decisions without feeling overwhelmed. I feel much more confident in my abilities and interactions with other people.",
  "Dosage:",
  "800mg Piracetam + 310mg Choline twice daily</p>"
 ],
 "erowid": {
  "id": "81646",
  "citation": " stuffedpenguin. \"Clarity and Confidence: experience with Piracetam & Choline (ID 81646)\". Erowid.org. Mar 21, 2012. erowid.org/exp/81646",
  "substance": "Piracetam & Choline",
  "views": "2551"
 }
}
