{
 "id": 18336,
 "title": "No Matter Which Direction, I Was Stuck",
 "date": {
  "submission": "2009-10-11T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Lindsey",
  "gender": "Female",
  "weight": "105 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 mg",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "[Erowid Note: This report relates to the Oct 3, 2009 incident described in Information on Reported Deaths Related to 2C-B-Fly.]",
  "Course of events:",
  "Ordered on Tuesday September 29th,",
  "sent on Wednesday September 30th,",
  "received on Saturday October 3rd, consumed on Saturday October 3rd around 3pm",
  "John was very close to Brian and has been very depressed ever since... until he saw an online forum. John had thought that it was all his fault, but he certainly feels less guilty now that he knows it was a bad batch. I trust John, completely. He is extremely intelligent and always does his research.",
  "I knew something was wrong, when I started to feel the intensity. John would have never given me a starting dose that was that strong. I was expecting it to recede but it kept getting more intense and that is when reality went completely away. I was in my room, walking back and fourth from the bed to the bathroom. John would check on me, but I could not handle human contact and he said Brian was having a rough time, so I sent him away. Light was way too intense for me and so was closing my eyes.",
  "My cats scared the hell out of me. I just wanted it to be over. I almost asked to be taken to the hospital, but I figured that it was just going to pass, but it didn't. I soon went over the edge and found myself at the point where I was crawling on the floor in every direction, only to find that I was alone in a psychedelic universe. I was the center of this universe and no matter which direction, to whom or what I crawled, I was stuck. This universe was strange. I was the queen; I was everything, but I was not allowed knowledge. The voices of the universe told me that I was the center and I was not allowed to know everything. It seemed to follow a circular pattern.",
  "Eventually, I landed on my back. I had given up. I saw visions of my boyfriend's father standing over me trying to help, but the universe made him disappear, only to be replaced by an EMT injecting me with an IV drip. I felt that the universe was pleased by this and all I could tell it back in repetition was, 'Obnoxious,' yet, something about it felt good and right, so the words seemed to come out of me seductively.",
  "Next thing I know, I wake up in a hospital. Completely wired up to health monitoring machines and a catheter. I was still having some visuals, but very minor. I could tell they had given me some sort of sedative because I felt foggy. I kept falling asleep and waking up. In one of my waking moments, a nurse had told me that John was being difficult, but she did not mention Brian. Then I overheard the nurses and a police officer talking. It was about three people. One of them had died. I was hoping it was not about me, John, and Brian. It was only hours later that I found out that they were.",
  "John and I were discharged from the hospital Sunday around 11am. We went home and the house felt too cold for me. We have this courtyard thing near the front door, so all afternoon Sunday, I took naps in the courtyard. I was hungry, but I found it hard to go in the house; it felt bitterly cold and trust me, I know what cold is. I grew up in New Hampshire. Eventually the sun went down and I could not bear the hunger pains no more, so I went inside.",
  "I loved Brian. The relationship that he had with John made me jealous. I wish I was closer to my sister, who is the same age as Brian. I had the easier childhood than John and Brian, but Brian and John's lousy childhood made John's bond to Brian stronger, I think. Even though, Brian was only John's half-brother (same mother), their relationship was very strong. Since Brian was at a young age, he was transferred back and fourth from his mother to his father. It was a bad situation. While Brian was at their mother's house, John played the role of male role model. John taught him how to read, how to fight and how to be a man.",
  "John felt that he had lost a son and before he had said that, I had felt it too. This whole thing has been hard on John, until he realized that it was not his fault, thanks to the online forum, giving us the information that it was not pure 2CB fly.",
  "Brian's death will not be in vain. He will live on in the people that see the posts about him and decide to test their stuff and realize it's not what it appears to be.",
  "Sorry for the rambling, I haven't slept well.",
  "Thank you again, many, many times over!!!",
  "Love",
  "P.S. John spoke with their mother this morning and she said that the toxicologist said that it was a tainted batch."
 ],
 "erowid": {
  "id": "81660",
  "citation": " Lindsey. \"No Matter Which Direction, I Was Stuck: experience with Bromo-Dragonfly (sold as 2C-B-Fly) (ID 81660)\". Erowid.org. Oct 11, 2009. erowid.org/exp/81660",
  "substance": "Bromo-Dragonfly (sold as 2C-B-Fly)",
  "views": "23750"
 }
}
