{
 "title": "Very Aware of Things Around Me",
 "author": "Chumbler",
 "citation": " Chumbler. \"Very Aware of Things Around Me: experience with Mushrooms (ID 18332)\". Erowid.org. Aug 3, 2005. erowid.org/exp/18332",
 "substance": "Mushrooms",
 "bodyweight": "145 lb",
 "report": "<p>Well, this is my first experience write-up, so if it's bad I can't be held responsible. The details might also be a little foggy.</p><p>Anyway, this was my first experience with mushrooms. My friend, T, spent the night at my place one weekend and brought 5.5 grams with him. He had scored them off of one of his buddies and decided to share the wealth. T is always looking for ways to corrupt me. At this point, I had only done marijuana (instigated by T) once or twice but I was thrilled with my drug experiences and was open to anything.</p><p>On Friday night we hung out and played some video games. My mom was working the next day and we decided we'd dose in the morning. At 8:30 we got up and I made some eggs and toast. We eyeballed out roughly 2.5 grams for T and 2 for me. T is larger than I am by 20-30 pounds and had done mush before.</p><p>The mushrooms didn't taste bad, just a little rubbery. We washed breakfast down with some orange juice and awaited the effects.</p><p>After a half hour of watching cartoons I still hadn't felt anything. Inwardly, I was very disappointed. I was worried that we had been ripped off or that I didn't get enough mush. T said he wasn't feeling anything either, and not to worry. I decided to have a shower and left T sitting on the couch.</p><p>After the shower I was still feeling very normal, and T said that he was as well. We put in the movie 'Swordfish' and got some more juice.</p><p>The mush came on very slowly during Swordfish. I became very interested in the movie, and my television seemed very crisp and clear. It wasn't until I started to truly understand the movie that I realized I was tripping. What I mean by truly understand is that I suddenly became aware of -everything- in the movie. The character's clothes and the way their hair was done and the rooms they were in all started to make perfect sense to me. My brain was going like this: 'How did he get those henchmen?' - 'He put an ad in the newspaper for bouncers and found some ones that would work for him!'. 'Where did he get all this cool theatre stuff?' - 'He hired a audio/visual company and they made it all for him'. These thoughts seem very silly now, but at the time they were amazing.</p><p>After the movie ended (about 2.5 hours after dosing) we were both feeling pretty good and started to wander around my house looking at things. I became very interested in the pillows on my couch and the curtains in the living room. Patterns and colors were fascinating. There was mild visual distortion in my peripheral vision, but whenever I looked around things were normal again. We walked around for a half hour or so, then decided to go downstairs and check out the computer.</p><p>Winamp visualizations were amazing. I felt so happy to just be sitting there watching crazy patterns and lights. T started to talk to some people on MSN, so I sat grabbed a sleeping bag and lied down on my futon (next to the computer). I suddenly started to cry because I didn't know the man/woman who made the zipper for my sleeping bag. I mean, think about it. No one ever notices, but if there wasn't a zipper the sleeping bag would be open, and very cold. Or all one piece, and hard to get into. I was very, very sad because I had never taken the time and think about the person that made my zipper. At the time, I knew crying over the zipper was stupid but I couldn't help myself. T and I laughed over my feelings for the zipper.</p><p>The rest of the trip was a lot of the same. I realized that my town was a very beautiful place, and that I took a lot of things for granted. I also tried to explain to T how we think things are 'official' and safe when really they aren't. I tried to explain how a package of ham wasn't perfect or anything - someone just decided to sell ham one day, and they just got some pigs and killed them and wrapped it up nice and sold it to us. I cried again because I realized that T and I would never amount to anything and that life was hopeless. Then T and I laughed at my crazy thoughts (I knew they were crazy at the time, but I felt so strongly about them that I had to tell T).</p><p>Summary:</p><p>- Mushrooms made me very aware of things around me and the world in general. I understood how a lot of things worked and why people do things. I thought a lot during my trip, but in higher doses I think I would be more distracted by visuals (T tried numerous times to explain to me how the wall was breathing at him).</p><p>- In the end, the mush trip lasted a good three to four hours after it came on. We dosed at about 9 am and I was feeling pretty normal at 1 - 2 pm.</p><p>- T said that eating breakfast with the mush hindered their effects a bit, and he wouldn't do it again. I haven't tried mush since, despite continued efforts to that end.</p><p>- Drugs in the morning! I was a little hesitant at first, but the experience turned out really well. The light was very nice, and the world seemed very open and safe. I felt a little odd for the rest of the day, but nothing that would really hinder a person. Just a little floaty and day dreamy.</p><p>I really enjoyed my first mush trip, even if the dose was low.</p>",
 "year": "2001",
 "id": "18332",
 "gender": "Male",
 "timestamp": "2005-08-03T07:00:00.000Z",
 "views": "2999",
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
