{
 "id": 18330,
 "title": "Fml",
 "date": {
  "submission": "2009-10-13T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Ftw",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "DXM"
  }
 ],
 "report": [
  "[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] ",
  "I started using around the end of my eight grade year. My friend is a complete druggie now. She had been begging my to try any drug with her and I agreed to skittles because I didn't think cough medicine would be too serious. The first time I took 5 pills of Corocidin and woke up fine. I kept using it because at first I was fine. I kept taking that dose too, 150 mg.",
  "After about my fifth time using them I woke up and was still a little buzzed. I thought I'm never touching them again, but when I asked my 'friend' (the same one who got me into them) if I would be ok, she told me it was all in my head and that it was from lack of sleep, so after about a week or 2 I tried them again and woke up the same, still buzzed. Soon, school started and used them about 2 more times, after each time I stayed a little higher and higher.",
  "Since the first time, it has been about 2 and a half months since the first time I stayed buzzed, yesterday I smoked weed with my boyfriend for the first time, and I felt a tiny bit higher then my normal and I still feel it....we smoked over 24 hours ago. Im terrified because I think I should say something to my parents because the only thing Ive found anywhere near CLOSE to my case is wet brain or brain damage, but Im scared my parents will FLIP. Im only a freshman in high school and Im in all honors classes."
 ],
 "erowid": {
  "id": "81608",
  "citation": " Ftw. \"Fml: experience with DXM with CPM (ID 81608)\". Erowid.org. Oct 13, 2009. erowid.org/exp/81608",
  "substance": "DXM with CPM",
  "views": "3451"
 }
}
