{
 "id": 18352,
 "title": "Jumped in a Pool",
 "date": {
  "submission": "2004-06-21T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Joe",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 ],
 "report": [
  "<p>I am 19 years old, 6 feet tall, and about 160 lbs.  The only drug I had done was weed and I had only been smoking for a few months.  I had gotten ready for the trip by reading everything I could find about LSD on the internet.  I had been waiting to try it for about two months. ",
  "The day of the trip finally came and I was very excited.  4 of us were doing it that day.  We decided the park would be a good place to do it.  It was a very big park with a lake and lots of trees.  I had my first cube (Each cube contained 2 hits) as soon as we got into the car.  I felt excitment and wonder as I slowly sucked away at the sugar cube.  It took us about 30 minutes just to get to the park.  when we arrived the excitment and wonder had died down to a slight antcipation.  We were at the park for about 15 or 20 minutes but plans had changed.  It was getting cloudy and dark so we were going to stay the night at mike's house. I purchased 2 sugar cubes and used 1 so far.  I had been playing around with the other one on the way to the car and after a few minutes decided to eat that too.",
  "I had now taken 4 hits of LSD on my first trip.",
  "I had been slowly coming up for the past hour when we arived at Mike's house.  Mike was mean and very annoying but we had nowhere else to stay.  His parents were gone and it seemed like a good idea at the time.  We all hung out in Mikes living room and smoked weed.  We had also smoked a little weed at the park.  Everyone was in a pritty good mood except Mike.  Mike was constantly complaining about things or making rude comments.  Mikes house was not all that big but it was nice.  There was allot of expensive looking stuff in his house like glass tabels and leather couches. A bunch of us went to the back of his house where there was a large swiming pool with a wooden deck around it.  I was high from the weed and still coming up on LSD.",
  "I thought it might be a good idea to jump in the pool.  I put my wallet and a few other things on a lawn chair first.  I did a cannon ball into the pool and it was amazying.  His pool was heated and the water felt wonderfull against my skin. I floated for a couple minutes but my friends wanted me to get out.  They were a little suprised I had jumped in and Mike was upset and did not want me to come in the house because I was all wet.  Everyone else went inside and because it was getting cold.  I really did not care about the cold and just like on the deck looking up at the sky.  At this point (~1:30 min form the first cube) I began to see strange things in the sky.  It looked like a transparent layer in front of the clouds.  like when I look at a light and then close my eyes I can see a faint purple/blue image of the light for a short time.  It slowly became clearer and clearer until it was almost as real as the cloud.  I was on back looking up and I saw transparent people standing around me in a circle.  I could see  more people behind and above them also in a circle.  They formed a pattern of infinate complexity. ",
  "They werent still images though.  They looked as if they were breathing, moving, and had real expressions.  It seemed as if one of them even walked away and someone else took his place.  I could feel a sort of energy building within me and I had to look away now and then because it was too intense.  I got up for a little while and then lie down again.  This time I tried to conentrate more on what I saw and the people turned into a pattern which consumed everything I saw.  My eyes were wide open and I was looking at the clouds but this time It was not transparent!  I could not even see the clouds even though my eyes were open.  I saw a bright pattern that slowly moved and I felt as if I could go into it.  I did not want to go any deeper then I was so I stopped looking and got up. ",
  "Now I was confused.  I did not totally understand who my friends were or who I was.  I got insine and Mike had me sit on a towel.  I had been outside for maybe half an hour, but I was still a little damp.  I half understood the situation.  I knew I was at a friend's house and I knew that my friends were with me and I had jumped in a pool.  What I did not understand was what was happening.  It seemed like something was going on but I could not figure out what.  I was shaken but I was able to make sense of what was going on after a couple hours. ",
  "It got real late and people begain to leave.  3 of us were still tripping so we stayed. It was now just me, Mike, Joe, Jim, and John (not real names :).  At this point it seemd like reality had been ripped apart.  It was like I was seeing everything at a really low film speed.  Everything was flickering.  Everything left trails or afterimages.  I was begining to miss normal reality, but at the same time it was kinda neat.  I found that if I looked at something It would bend.  We did a lot more that night but it was mostly more of the same.  The effects started going away at about 6 am the next day.",
  "I have never taken any kind of medication and the only other drug I was on at the time was weed.  Looking back I think it changed me for the better.  I realized I was ignoring some things that were really important to me in life.  The most important thing I learned is that life is fake.  I used to think that god, aliens, or other dimensions might exist.   I never really got into that stuff though.  I just watched sci-fi movies from time to time and played computer games.  Now I know for a fact that it's real.  People always joke about how good money is, or sex, or cars.  It all seems so worthless now.  What really matters to me is love.  Most of my life I did not realize that.</p>"
 ],
 "erowid": {
  "id": "8176",
  "citation": " Joe. \"Jumped in a Pool: experience with LSD & Cannabis (ID 8176)\". Erowid.org. Jun 21, 2004. erowid.org/exp/8176",
  "substance": "LSD & Cannabis",
  "views": "6962"
 }
}
