{
 "title": "One In the Morning and One At Night",
 "author": "dreamer",
 "citation": " dreamer. \"One In the Morning and One At Night: experience with Bupropion (ID 18359)\". Erowid.org. Oct 22, 2002. erowid.org/exp/18359",
 "substance": "Bupropion",
 "bodyweight": "175 lb",
 "report": "<p>A friend of mine recently had some success using wellbutrin to kick the nicotine and had suggested that i give it a shot. I was toying with the idea of quitting so I figured I would give it a shot. Normally, before I try a new psychoactive I do some investigating on erowid for safety sake. I was thoroughly disappointed that there was such a small number of experiences and decided that if I went through with it I would write a report. And thus, here it is.</p><p>I started out with a dose of 100 mg in the morning when I woke up.  And much to my surprise, had an extreme cut in my need for nicotine.  Not entirely sure what it is that helped calm the urges, but I must say it not only took the edge off the cravings but it helped remove some of the crankiness normally asociated with kickin the butts. I had heard that insomnia may be a side effect, being that I am quite fond of my sleep, I was quite curious to see what would happen.</p><p>That night I had no trouble falling asleep, as soon as I decided to go to bed I was fully able to slip into my dream world. However, I was not expecting my dreams to be so vivid and realistic.  That night was host to some of the most intense dreams I have ever known.  Quite similar to those found the night after a good roll. When I finally awoke after 13 hours of sleep, I had full dream recall and despite some slight grogginess, I was in very good spirits. </p><p>This pattern of dosage (one in the morning) went on for about three days. At that point I decided that I could quit smoking on my own and started taking the 100 mg dose about 30 minutes before bed. The dreams intensified, but so did the grogginess.  I continued this method of dosing for about three days.  While I was still having no problem with the cravings I noticed that I was still quite cranky throughout the day. This problem led to one obvious solution: my new method would be to take 100 mg in the morning, and 100 mg 30 minutes before bed. I must say that this method of dosing has been the most pleasing to me. I have continued it for about two weeks and feel no need to up my dose. I enjoy a slight mood elevation and cut in cravings during the day, and enjoy the most intense dreams i have ever known at night.</p><p>I would like to say in closing that chemicals effect everyone differently. This is just my personal account and do not believe that everyone will enjoy the medication as much as I do.</p>",
 "year": "2002",
 "id": "18359",
 "timestamp": "2002-10-22T07:00:00.000Z",
 "views": "62496",
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  },
  {
   "time": " T+ 12:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  }
 ]
}
