{
 "id": 18374,
 "title": "Triple Cs Where Did My Life Go?",
 "date": {
  "submission": "2011-02-12T08:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Charles",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] ",
  "This is the true story, of how this substance can not only ruin your life, but your health, and the health of those who you care most about.",
  "Well, while I was on vacation with some friends, I noticed some of them were acting kind of funny, not like the usual funny when someone is high, or trippin on shrooms either, they were walking almost like robots, tripping over each other, laughing at everything and sometimes just laying in a blanket almost scared... well I asked what they were doing and they told me just some triple cs maaan having never heard the term before naturally I wanted to know what it was, so I hopped in my car with one of the tripsters, and headed out to the local store, we picked up about 3 boxes and headed back to the house. When I got back they told me to take all 16 of them, but I was a little nervous being the first time and all. I took one sheet of 8, the taste was horrible, and almost vomiting I choked them down with some cranberry juice.",
  "After about an hour of feeling like I was going to vomit, I felt a strange feeling I had never felt before, it was as if my head was detached from my shoulders, I was horrified. This continued most of the night and into the morning the next day. When I woke up I felt light headed dizzy and nauseated not remembering anything that I had done the night before I had to ask my friends what happened. They told me I spent the night curled up in my bed shaking.",
  "About the next week, I figured I would give it another chance, which was without a doubt, the worst decision of my life. The second trip was great, I felt fantastic, was hallucinating not scared of the feeling that had swept over me. This became my weekend routine, after work I would go to the store, pick up a box, get some cranberry juice, choke them down, and trip my ass off.",
  "For almost 3 years my life was nothing. Nothing but a triple c trip fest. I lost about 60lbs because I was never hungry after I tripped for about 2 days. My performance at work was falling, people were just assuming I had abnormally large pupils because of how large they were during the week because I took so much over the weekends. I figured enough was enough, and decided to quit the Cs but just like they said in Fear and Loathing in Las Vegas You can turn your back on a man, but you can never turn your back on a drug  as far as I am concerned I was hooked. At work, it was all I could think about. During the week, I wished the weekends would come faster. I HOPED that the weekend coming up I would have Monday off, so I could trip 3 times instead of 2. Things felt hopeless.",
  "I moved out of my old place and into a new state, hoping that the move would get rid of the memories, but it only made things worse. I moved in with a new roommate, and about the second weekend I asked hey man, wanna try some of these? he thought he was a drug expert and that cough medicine couldnt do anything to him, I was determined... or at least I thought I was, to prove him wrong. We went out to the store, picked up the Cs went back to the room, downed all 16 and waited. He told me I was wrong, and that he didnt feel anything, then he stood up. Almost falling down, laughing and rolling around he started talking to me in some kind of robot voice he said Charles, do you like my robot voice?  I am robot jones! I laughed at him because it was pretty funny, telling him Sal man I told you so! I Fn told you so! well. We went down this road for another year and a half tripping, waiting for the weekend tripping more! We started taking 16 cs and 20 robitussin caps on Fridays and Saturdays. We thought everything was going well! We even introduced MORE people to the hell we had inflicted on ourselves.",
  "Now we had a posse of three Sal, his girlfriend, and myself. I even tried to push it on to my girlfriend at the time, she ran off with some other fool... I dont blame her. My life was going nowhere. We started mixing the Cs with Robitussin, and salvia, hoping for a more intense trip... well we got what we were looking for, and much much more than we had bargained for. In no time the Sal, and his girl were both addicted, always want to quit, never being able to. Over 6 months, their relationship was going sour; they would break up, then trip, and get back together. None of us ever tripped alone. They must have broken up and gotten back about 4+ times. well I think I speak for all of us when I say, we had enough. We were tired of trying to get away unable to do so. We all wanted out, but couldnt find the exit.",
  "Thankfully I met a new girlfriend, who frowned upon doing drugs, but even that didnt stop me, because I would sneak off with Sal and get fucked up, she caught me a few times, threatening to break up with me, and I would straighten up for a week.. but as soon as she had forgotten, I would  tell her I was going out to the bars with some friends, and would be back to my place the day after. Well, we all know I never went to the bars, I went to the store, got the drug, and got trippin. For another 5 months this is how my life played out.",
  "All together I have wasted about 3.5 years of my life. From the time I was 19, until 22. The only reason I have stopped is because I dont want to lose my girlfriend. She is the best thing to happen to me. Even now, after 6 months of being sober, when she says she is going out of town, I always look at the calendar to see if it is a weekend, just hoping that I could get one trip in while she is away. Luckily I have been able to resist the urges that I feel. Sal and his girl are clean now too, but I know they feel just like me, always wondering one more couldnt hurt... could it? well I know, one more will put me right back where I started. My efforts to get clean would be wasted, and I would spend the next 6 months to a year trying to find a way out. Sure, it was fun while it lasted, but with all the problems it has caused me, it is not worth it.",
  "Here are just some of the problems that Triple C has caused me",
  "\tMemory loss",
  "\tA strange form of IBS",
  "\tUrinary retention",
  "\tShaking",
  "\tAddiction",
  "\tLiver problems",
  "\tSleep problems",
  "\tLoss of IQ%",
  "Im sure the list is longer than what I have put. And I dont ever want to look into all the possibilities. If you are thinking about doing Triple Cs, and I am assuming that you are, based on the fact that you are reading this article. Do yourself a favor. Dont Do It. You might think, It wont happen to me well, I thought the same thing 3 years ago. And look where I am now. Clinging to sobriety by a thread, a thread that could be cut or break at any moment in time, sending me back to the dark addiction that I have battled for the last 6 months. I never want to go back.",
  "**names changed for identification purposes**"
 ],
 "erowid": {
  "id": "81857",
  "citation": " Charles. \"Triple Cs Where Did My Life Go?: experience with DXM (with CPM) (ID 81857)\". Erowid.org. Feb 12, 2011. erowid.org/exp/81857",
  "substance": "DXM (with CPM)",
  "views": "14275"
 }
}
