{
 "id": 18376,
 "title": "Blue Candle is Active",
 "date": {
  "submission": "2010-04-15T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Anonymous",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Cacti - M. geometrizans"
  }
 ],
 "report": [
  "<p>I first read about mescaline containing cacti other than Peyote in Plants of the Gods, a book by Richard Schultes, Albert Hoffman, and Christian Rtsch.  I had been afraid to try mescaline for years due to horror stories of its effects.  While LSD and shrooms seemed safe, for some reason mescaline had been described to me as totally unreasonable, a sure ticket to the loony bin!  Years later I became interested and started learning about cactus from books and the internet.  Though I spent a lot of time reading about cacti and looking at pictures, when I finally went to the garden center to find San Pedro, I accidently misidentified Blue Candle (Myrtillocactus Geometrizans) as San Pedro (Trichocereus Pachanoi).",
  "I brought my new cactus home, a cute 4in high baby Blue Candle cactus.  I was delighted when, before heading over to a friends house to hang out, I tasted some of the cactus juice (I just cut the side of it to taste) and felt an immediate rush of euphoria (it felt like e, or something similar).  That night I hung out with a few friends, was very talkative, and felt good.  I felt like I was rolling a little but I didn't mention that I had taken anything and I later told my friend and she said she hadn't noticed any difference.  This was years ago, and I would not be in a situation like that now.. reading this, it sounds strange, that I would hang out with friends and not tell them what I was up to, but like I said, I was younger.  The reason that I mention this is that this is a theme with my mescaline (cactus) use, feeling like I'm totally rolling, but being 'cool' (as in, I was rolling so hard I lost my 'cool') enough to appear sober (not always, but frequently) or whatever.  After that night I went on to find this cactus at the local garden centers, including a hardware store (many times), and once from the grocery store.",
  "Like I said before, the cactus I was actually finding was Blue Candle, but the whole time I thought I was getting San Pedro.  So, by some fluke of nature, I was getting a cactus that was not San Pedro, but did contain mescaline.  After a while I figured out that I did not have San Pedro, and assumed that the chemical I was tripping off of was some unknown alkaloid.  I shared the cactus with many people, all of which found the cactus to be mild and pleasant.  One of the weird things about this cactus is the contradictions that seem to arise from describing its effects.  For example, the cactus feels totally mild, and totally intense at the same time... or... feeling totally sober, but also tripping hard at the same time.",
  "I eventually found out that the cactus I had was Blue Candle (for sure), and was surprised that there was not much on the internet about it.  It shows up in the Visionary Cactus Guide and in Tihkal, which has a guide to chemicals and the cacti that contain them in the back. From my experience, Blue Candle cactus is indeed active!</p>"
 ],
 "erowid": {
  "id": "81881",
  "citation": " Anonymous. \"Blue Candle is Active: experience with Cacti - M. geometrizans (ID 81881)\". Erowid.org. Apr 15, 2010. erowid.org/exp/81881",
  "substance": "Cacti - M. geometrizans",
  "views": "5027"
 }
}
