{
 "id": 18388,
 "title": "For Treatment of PTSD After Combat Tours",
 "date": {
  "submission": "2009-10-28T07:00:00.000Z",
  "experience": "1974"
 },
 "author": {
  "name": "Brian",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Carbogen",
   "form": "(gas)"
  }
 ],
 "report": [
  "I was a subject of brief carbogen therapy in 74, for treatment of PTSD after two combat tours in Vietnam.",
  "I experienced anxiety at the beginning of each session, due to the increase in my respiration rate and volume; but I was able to counter that by reminding myself that I was receiving more than sufficient oxygen. At the same time, various muscles went into spasm; there was no pain and I felt that I could control the muscles if I chose to do so. My breathing slowed and muscles stopped spasming within seconds after discontinuing the gas, and hallucinations gradually diminished within minutes.",
  "For days following each weekly session I was free of anxiety and clinical depression, and I felt that my head was in the clouds. After smoking a bit of cannabis, I felt that my head was still in the clouds, but my feet were on the ground, and I could concern myself with issues of the day (literally smoking cannabis to come down'). After only five sessions I believe that the benefits of that experience have continued to this day.",
  "I am a counselor, specializing in drug-crisis intervention among special (i.e., difficult) populations. I believe in the utility of psychedelic therapy for a select group of clients. The quick action, short duration, and low cost of carbogen makes it an ideal therapeutic agent, and for a much larger group of clients than other psychedelics.",
  "Given the opportunity, I would gladly subject myself to more carbogen therapy."
 ],
 "erowid": {
  "id": "81957",
  "citation": " Brian. \"For Treatment of PTSD After Combat Tours: experience with Carbogen (ID 81957)\". Erowid.org. Oct 28, 2009. erowid.org/exp/81957",
  "substance": "Carbogen",
  "views": "6427"
 }
}
