{
 "id": 18393,
 "title": "Feeling that I Couldn't Stop Thinking",
 "date": {
  "submission": "2004-06-08T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Luke",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.0",
    "quantity": "2.0"
   },
   "substance": "Mushrooms"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "g",
    "grams": "1.5",
    "quantity": "1.5"
   },
   "substance": "Mushrooms"
  },
  {
   "time": "1:30",
   "amount": {
    "unit": "cig.",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  },
  {
   "time": "2:15",
   "amount": {
    "unit": "cig.",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Before I took mushrooms for the first time I was always against using any harder drugs.  My friends and I had been smoking pot for about a year and I always told myself that weed would be the extent of my drug use.  Then one summer night mushrooms became available.  Still, I declined to use them, and my friend experimented first.  The very next day my curiousity got the best of me and I decided to trip too.",
  "At first I took 2 grams of the mushrooms, consisting of pieces of stems and a couple caps.  It was still daylight and I first noticed the colors on this girl's shirt seemed to glow.  All bright colors like blues, purples, greens and red had a beautiful warm fuzz about them.  All the while I had a warm body buzz type feel.  About an hour after the initial dose my friend gave me about 1.5 grams as a gift.  He said 'here take these I want you to REALLY feel them.'  I agreed and as he had more experience then me, I knew I was in good hands.",
  "About 30 minutes later, I really felt the mushrooms kick in when we were on our way to a little get together at my friends sister's house.  We had to stop at a pay phone at the side of the road to make a quick call, and I felt as though I really needed a cigarette. I searched for my lighter and couldn't find it anywhere.  I began to panic a bit, thinkin 'Oh my god I need to smoke sooo bad'.  It was really frustrating so I asked my friend for a lighter and soon felt a great feeling of relief as I took my first few hits.  Suddenly I was cool and calm, without a care in the world.  Me and my friend had a good laugh about me starting to freak out a bit.  But, that was just the beginning of a most unusual night.",
  "When we arrived at the party I had difficulty speaking with the people there that weren't tripping.  We convinced another friend to take the remaining shrooms we had left in the bag.  This made me felt very happy and connected with my bud, cuz I knew that he would be feeling as good as I was. ",
  "After about 45 minutes of chattin it up we decided to smoke our first joint.  The weed tasted extra good, and I wanted somethin to kick up my buzz a bit.  Soon after the weed was smoked I began to trip very hard.  It was totally different than anything I felt before.  At times I got freaked out cuz, I couldn't talk.  I would think to myself, 'please say something, you're scaring me!'  Then I would finally say a few words and feel relief that I could actually speak.  I really got to know myself while on mushrooms.  My mind went from one subject to the next very quickly.  I thought about god and how he actually existed and why people are violent and many issues that I felt I didn't understand before.",
  "But soon it was all too much for me.  Some people have lower tolerances to psychodelics and I feel I am one of those people.  You learn about just how much you can take before you think you are actually going crazy!  At one point I got these overwhelming feelings that I couldn't stop thinking.  Rushes of intense feelings of paranoia kept coming over me and I felt like it wouldn't never stop.  I told my friends that if I didn't stop thinking soon that I would throw up.  I was totally right.  I walked casually into the bathroom and spent what seemed like a half hour just puking and dry heaving in the bowl.  I would look at myself in the mirror and say 'get a hold of yourself, its just mushrooms and you'll be okay.'  I went back out to my buds and found that throwing up was just what I needed.  It totally brought my mind back and I was soon laughing it up again.  I guess it was all too intense for a moment or two and I had to let it all out.  THe vommiting didn't affect my buzz at all which was great. ",
  "The rest of the night went smoothly and we learned that we had to be there for eachother.  I can tell when someone is starting to freak out and just have to tell them 'calm down and everything will be okay.'  Since my experience I have tripped on shrooms and have had much more pleasurable experiences only because my friends and I have learned how to control it a bit more.  A trip is like a huge world in a dream.  Some parts are a bit scary and some parts are like heaven.  Learning about how to stay in the heaven can make tripping almost like rolling on extacy.  I feel like everyone has there own place.  I felt like when I talked to someone it was more than just two humans making conversations.  It was more like our souls were bonding in a very spiritual way.  Its like even though you are just 1 person out of 6 billion in the world, you know that you have godly power inside you.  I came to realize that I could do anything I wanted with my life all I had to do was go out and do it! ",
  "In conclusion,  if you are thinking about expirementing with new drugs, then mushrooms would be a great choice.  Make sure to be in a secure environment your first time, somewhere where you'll feel 'safe'.  Smoking marijuana to enhance your trip is definetely worth the extra money.  Taking mushrooms didn't just last the 7 hours like my friends said it would.  It seemed to affect me for a good month or so afterwards.  It actually gave me a slightly different outlook on life and I felt like I was a little bit wiser than before the trip. I found out things about myself that I never knew before.  Unfortunately I found out a few of my weaknesses, but I also found many strengths."
 ],
 "erowid": {
  "id": "8201",
  "citation": " Luke. \"Feeling that I Couldn't Stop Thinking: experience with Mushrooms & Cannabis (ID 8201)\". Erowid.org. Jun 8, 2004. erowid.org/exp/8201",
  "substance": "Mushrooms & Cannabis",
  "views": "10468"
 }
}
