{
 "title": "Amanita Gravy",
 "author": "Windy",
 "citation": " Windy. \"Amanita Gravy: experience with Amanita muscaria (ID 18409)\". Erowid.org. Oct 24, 2002. erowid.org/exp/18409",
 "substance": "Amanita muscaria",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 caps",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)"
  ]
 ],
 "report": "<p>I had tried dried amanitas the week before, equivilant to about 2 small dried caps, crushed and then stuffed into OO gel caps, and the effect was mildly euphoric and happy.  Amanitas grow everywhere in this misty Oregon coast, so a few days later when we found some more, we promptly took them home, cleaned them, removed the stalk and gills and proceeded to dry them in a warm oven with the oven door cracked. This time I decided to do something different, as I like to cook, and I love mushrooms anyway...I decided to make gravy with the amanitas.</p><p>We had 8 medium to large mushrooms. First of all, I took the pan the amanitas had dried in and added about 1 1/2 cups of water, and brought that to a slow simmer. To this broth I added garlic, salt, and pepper, the usual homemade gravy stuff. In a separate pan I browned some onions in a little oil, and then added about 2TBS of flour to brown. I then added my mushroom broth to the flour mixture and stirred it constantly while it simmered to make a nice brown gravy. We fixed some sourdough toast to dip in the gravy. The gravy was very tasty, just like Mom used to make...(except Mom's gravy never caused me to hallucinate.) Now my boyfriend ate his gravy without eating the mushroom bits, as he really doens't like a mushroom flavor.  I on the other hand ate the gravy with the mushrooms bits. Although we both had very nice trips, complete with enhanced sounds, beautiful colors, visuals, and a vibrating euphoria, I also became very queasy and I threw up.  Later I became uncomfortably cold and clammy, and my mouth was very, very wet. In fact my whole body felt wet to me. It was as if i could feel every pore opening up and sweating. Yuck. I kept thinking I was hot, yet I was ice cold.</p><p>I believe it was eating the pieces of mushrooms that did this to me. Other than that, it was a very nice trip indeed!  I have some more amanitas drying in the oven as we speak, and I plan on doing the gravy thing again. However this time I will only take the broth, and not the mushroom pieces. I wonder how much more interesting Thanksgiving dinner would be if we had Amanita gravy with the turkey?  :-)</p>",
 "year": "2002",
 "id": "18409",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-10-24T07:00:00.000Z",
 "views": "25297"
}
