{
 "id": 18407,
 "title": "I Become a Thousand People",
 "date": {
  "submission": "2010-02-24T08:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "TrippinDeadFred",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>I had ingested adderall a few hours prior to smokin jwh. I doubt this had any effect on my experience, but figured I should put it out there. My friend had ordered some jwh online. He told me he put it into a shot of alcohol and heated it up for a few minutes; and was high as hell. I was about to do the same, but I changed my mind and just put it on top of some ash and took a big rip. I'm not sure how much he gave me, but it was a pretty decent amount of powder. I found out later it was about 30-50mg. He gave me about 1/5th of his whole bag, which was 250mg so 250/5=50)",
  "So anyway, I took a massive hit; which tasted pretty synthetic btw. In a matter of about 5 seconds, I was getting high as shit! cottonmouth, heavy eyes, raving thoughts, etc. I immediately shut off my main light and just sat on the edge of my bed (just left my small lamp on). Now this is when it gets fucked up and hard to explain:",
  "I'm not sure how long this went on for, but I remember just sitting there and staring at my door and my lamp. I just kept thinking about how I really wanted to shut off the lamp, but I could not get up! And I kept thinking about the people on the other side of the door, and what they might be doing (my friends were in the living room, hangin out). Eventually I thought about doing some hw. I was hoping the adderal had some effect still so I could study, and usually I study after smoking MJ no problem.",
  "So I grabbed my laptop and shut off the lamp. I turn on my laptop and boot up linux.. I type in my password..INVALID. I try again..INVALID. I look at the keys and try to type..I CANT SEE THE FUCKING KEYS! No matter how close my face gets to the keyboard, it appears as though I have no contacts on! WTF! and I have forgotten where all the keys are, and what my password is! At this point, I just get really embarassed. 'If someone would walk in right now and see me trying to type my password, but can't seem to..I would look retarded'",
  "So I was like 'Ok, maybe its jus tbecause my linux password is hard...' So I try booting up windows...Go to type in the password..INVALID.. I try again. Same thing. I still can't see the goddamn keyboard! So I then resort to just typing random keys on the keyboard. At this point I am getting pretty worried and frustrated. After probably 10 minutes of trying, I unplug my laptop and lay on the bed. And then I just start TRIPPING BALLS.",
  "I wish I could explain it exactly as it happened, but some of the shit that occurred just cannot be put into words. Idk how long this went on for either, I just ended up waking up a few hours later (I think a few hours?) Anyway... So I am laying in the fetal position on my bed, half covered in a blanket. I roll onto my back and stair at the wall. A monkey then jumps from my closet onto my door! I just keep staring at it, strangely unafraid. Two white triangles are spinning around the monkey, and then they both snap back to their original positions.",
  "Now this was the most fucked up part: As I looked to my far right wall and started looking back to the left.. Time slowed down to a crawl, literally. Each 'frame' lasted about 30 minutes in my world, and 1 ms in the real world. Don't ask how I know the specific values, I just 'knew'. Each frame was a story. Each story was someone's life. It would start from birth and go all the way to death. I would get so caught up in each story, I would assume that I WAS that person.. I would feel as the person was feeling. When it was their birthday, I would feel as though it were my birthday (think of presents I want, who I want to come to my party, etc.). I basically became that person!",
  "And then the frame started to 'snap-back' to my reality, and I realized that I was actually myself; not the person in the frame. But only a split second had passed in my world (my vision went to the left only a little bit), and I would start tripping about another person's life again. So this went on for some time.. and then I realized that I could pull the blanket over me, so I did and rolled over to the fetal position again.",
  "This just gets like way hard-core tripping right here. The best I can describe it is:",
  "Flashing multi-color explosions around my face, zooming in and out; while spinning. I could hear my inner-voice talking about some crazy ass shit.. and it felt as though a group of people were with me, experiencing the same thing!",
  "After some time of talking about life and the universe.. I apologize to everyone (in my head) and keep saying 'Sorry guys, this is embarassing.. I am tripping balls I'm pretty sure,' and then I feel as though I am going to vomit! I spend about 15 minutes or so just trying to keep my dinner down..everything is spinning and confusing as shit!",
  "I can't remember what else happened..but I just woke up a few minutes ago, and...WTF! I hate this shit!</p>"
 ],
 "erowid": {
  "id": "82095",
  "citation": " TrippinDeadFred. \"I Become a Thousand People: experience with JWH-018 & Amphetamines (Adderall) (ID 82095)\". Erowid.org. Feb 24, 2010. erowid.org/exp/82095",
  "substance": "JWH-018 & Amphetamines (Adderall)",
  "views": "13683"
 }
}
