{
 "title": "Happiness and Despair",
 "author": "Cutlutch",
 "citation": " Cutlutch. \"Happiness and Despair: experience with Bupropion (ID 18418)\". Erowid.org. Sep 22, 2005. erowid.org/exp/18418",
 "substance": "Bupropion",
 "bodyweight": "262 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Pharms - Fluvoxamine",
   "(daily)",
   "",
   " ",
   "",
   "Pharms - Methylphenidate",
   "(daily)",
   "",
   "225 mg",
   "insufflated",
   "Pharms - Bupropion",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>I have been doing Bupropion for a long time now, and I must say that this experience outdid them all. I have always been more comfortable snorting pills than taking them, because snorting them seems to bring on the effects of many pills (ie Wellbutrin, Paxil, Seroquel) much faster for me than if I just took it orally.</p><p>On this occasion I had scored 2 pills of Wellbutrin 150 SR for $2 bucks a piece from one of my friends that takes them. I am on a couple of medications (Luvox and Concerta). So I go over to my friends and we both cut our two pills up into powder by washing the purple coating off. I started breaking it into lines. All together we had about 40 'lines' of bupropion. I had read that it was an anti-depressant (Wellbutrin) and was very intrested in experiencing the effects of it. We each started doing one line at a time, taking turns. After 10 my friend had about had it because it burns the shit out of their noses. Then it numbs the throat and they start what me and my friends now refer to as a happy trip. I finished all 20 'lines' of mine and proceeded to work on my boy's lines. I did about 30 'lines' that day. I was extremly contented with myself and the world around me. I was more surprised about the effects of this Wellbutrin. I hypothesize that since we only used to do zybans, that this is a stronger version of bupropion. I consider myself pretty familiar with the substance since I have been doing zybans in powder form for almost a year. These effects were much stronger than that of Zyban.</p><p>And they also lasted much longer too. I went home about an hour after I did the Wellbutrin powder still feeling some pretty strong feelings of happiness and also very unconcerned with the environment around me. I was somewhat in a daze. I felt slow and incompetent. I found out that one of my best friends had cancer and it did not even seem to sink in nor did it for the rest of the day, I pretty honestly didn't care because I was able to assure myself everything would be alright.</p><p>I think that this is the blessing and the curse of bupropion, I have experienced an effect like this but much milder doing zybans. I get really happy off zybans but generally I still care about myself and others while on that. I think that since it is used as an anti-depressant when in wellbutrin it is a stronger potency than zyban so I care much less about everything and can just daydream myself right into la-la land. This is good when I are doing something very boring and tedious, it makes it more fun. However when I need to be aware or alert, like when I drive my car, I cannot focus long enough to be alert. So in my experience I should allow time for the effects to wear off before doing anything that is dangerous, or very important. When using bupropion I can become extremly slow. Overall I would say that this was a great form of both being high and sedated. And there seems to be a great potential for it to become one of the slacker drugs of choice, tons of people at my school do it just to get through school, but I would say it is better used to just relax.</p>",
 "year": "2002",
 "id": "18418",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-09-22T07:00:00.000Z",
 "views": "36377"
}
