{
 "title": "Relaxing",
 "author": "(e) tard",
 "citation": " (e) tard. \"Relaxing: experience with Codeine (ID 18414)\". Erowid.org. Jul 27, 2007. erowid.org/exp/18414",
 "substance": "Codeine",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "120 mg",
  "oral",
  "Codeine",
  "(pill / tablet)"
 ],
 "report": "<p>Thursday - 10/24/02 ~2:00pm</p><p>About 4 days ago I broke my Fibula in the last soccer game of the season and have been having pain since then. I was taking anti-inflammatories and excedrin (aspirin/acetamenophen) to deal with the pain, but I finally got my doctor to prescribe me Tylenol III (30mg Codeine/300mg Acetimenophen). I have experience with Cannabis, Alcohol, ecstasy, opium, lots of pharms (codeine, vicodin, tramadol, demerol, xanax, amphetamines, lorazepam), shrooms, dxm, nitrous, ghb, salvia (yeck!), and coke. I'll use some comparisons to other drugs to help explain the results.</p><p>I'm going to keep a little log of how it goes while I listen to some Jurassic 5 hip hop. Hopefully my mom doesn't walk in and see this while I'm taking down notes hehe.</p><p>T: Swallowed 120mg Codeine in form of 4xTylenol 3 Pills.</p><p>T+30: Effects beginning to be noticed. Relaxation and warmth felt.</p><p>T+1:00: I'm feeling the effects more heavily. I am not as coordinated while typing and my head is feeling somewhat unclear; dazed-feeling. A slight feeling of nausea. Body feels even warmer and I feel no pain where the fracture exists in my leg. It has the feeling of well-being similar to, yet much milder than, ecstasy with the head-pressure of cannabis. I wouldn't call it 'euphoric'. The only drug I've ever used where I would describe it as euphoric is ecstasy.</p><p>T+1:30: No real changes from half an hour ago. I'm feeling somewhat tired. I'm reluctant to take anything with caffeine in it as I've had upper/downer bad experiences. I'll check in again in an hour.</p><p>T+2:30: Coordination is worse. I was having a little trouble with my crutches (gotta be careful! :) up and down the stairs. My body is very relaxed right now. The nausea has completely disappeared. All little aches and pains have disappeared as well. Everything feels very good right now. It is relaxing similar to smoking black tar opium, but with less edge than I sometimes feel while taking vicodin. It is tiring me a little. I'm going to lie down for a bit.</p><p>T+3:00: The effects are seemingly wearing off now. I still feel warm and a bit hazy in the head, but otherwise I'm back to normal.</p><p>Overall I'd say codeine is an alright recreational drug. It wasn't mindblowing in any sense, just a mild, relaxing drug. If I were to do this again I would up the dosage by 60mg (2 pills) but no more. The pain I had in my leg prior to taking the pills is starting to return as a significant indication the drug is wearing off.</p><p>I'd give codeine the thumbs up for a relaxing, chilled high.</p>",
 "year": "2002",
 "id": "18414",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-27T07:00:00.000Z",
 "views": "10948",
 "dose": {}
}
