{
 "id": 18429,
 "title": "Nothingness",
 "date": {
  "submission": "2011-01-31T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tom P.",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I was prescribed Seroquel as an anti- psychotic for symptoms of mild psychoses ie. voices, mild hallucinations, ocassionaly extreme visions in sober state (one example: thinking I am communicating with angels, apparent prophesying). I have a long history of massive drug abuse but recently for a year and a half I have been absolutely sober. I ingested everything from cough syrup, to heroin, acid, to crack. I will not go into details. The matter of concern is Seroquel.",
  "I went home after recieving the medication not fully informed to the possiblity of such a reaction as it is something like .001%. I waited a few days then I decided after a rather anxious time concerning myself with my on and off relationship with my 'wife' to take it. I had been told that taking seroquel would be comparable to advil calming me down putting me to sleep taking away pain so on.",
  "I popped the tab with a ginger ale, turned on 'the wrath of Kahn' (Star Trek) and after some short time rewinding the wrath of Kahn I began to notice the infinite speed of the vhs player. It scared me. Thus I sat down and my mind became this weird vortex of different ideas flowing star trek and psychiatrist voices with their words through my mind. I began to write a very insane book. Thus it came to the point after awhile finally realizing that something was wrong. I got out of bed the box like shape of my room had exchanged itself with walls warped into an orb like shape, bleeding black yellow blood red neon green around me. The hideous trip began to horrify me to the most extreme extent, I called the ambulance worrying this would kill me. After communicating very vaguely and having insane hallucinations with the police tracers on my head followed me like everything was a photograph of a photograph of a photograph and so on. The ambulance pulled up and thus exploded my mind insanity I in all my Life have never been that high it was as I said in my book 'I felt like I was on another planet, only I was the planet, even beyond that I became anti- matter, nothingness.'.",
  "I was the ambulance I could read everyones minds. I was higher then I have ever been. I could do all of the drugs in the universe, I could shoot up heroin so much that I would die and I would never ever feel that high. It was horrible though because in the process it was as though my brain was fighting to sustain emotion and the seroquel was cutting it apart like savage wolves rip into the carcass of a dead caribou. The sinew of my emotion was ripped apart gobbled down and then I became absolute nothingness. This is where I felt like a God. I have never felt that way on any street drug in my Life, this was way more insanely amazing and beautiful then I could ever describe in words, but it was also so absolutely hopeless and evil. I was like a God that at the same time thought it was dead. I was like a dead God without feeling. I reach waves of insanity it breaks me apart I am utterly distorted of who I used to be. It has ruined me. It is what street drugs want to be. I am fighting myself not to take it again. The valium helps alot. I feel so insane it is like all the healing of a year and a half of sobreity has been totally corrupted and I am worse then I've ever been.",
  "I felt Seroquel both bring me to the most beautiful brilliant high of my Life and at the same time corrupt all the joy and natural feeling of emotion into nothingness affecting so poorly my relationship with my wife that I have become horrified of her. It was the worst experience of my adult life and the most addictive. AHHHHHHH!!!!! I am insane because of this."
 ],
 "erowid": {
  "id": "82257",
  "citation": " Tom P.. \"Nothingness: experience with Quetiapine (Seroquel XR) (ID 82257)\". Erowid.org. Jan 31, 2011. erowid.org/exp/82257",
  "substance": "Quetiapine (Seroquel XR)",
  "views": "11037"
 }
}
