{
 "title": "Tripping under the Oak",
 "author": "DxS",
 "citation": " DxS. \"Tripping under the Oak: experience with Mushrooms  (ID 18425)\". Erowid.org. Jun 14, 2007. erowid.org/exp/18425",
 "substance": "Mushrooms ",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Mushrooms",
  "(tea)"
 ],
 "report": "<p>Living in the mid South, mushrooms are plenty for the picking.  They grow in our favorite pastures all year except for the colder months; Oct-Feb.  From my experience two hours after sunset is the best time to go shrooming.  At this time, I can find mostly Red Devils, (cap is just starting to separate form the stem, the crest of the mushroom is a little more red then brown/tan). Red Devils are to my point of view, stronger than the mature ones.</p><p>I brew it up. It takes a shorter amount of time for the full effects to kick in, and are more intense.  Thresh Hold-15-20 min, Peek-4-6 hrs, Trails off-2-3 hrs.  My friends and I have decided that cool-aid rather then tea is easier to choke down.</p><p>Prepping my juice</p><p>1-2 pkt\tCool-Aid (grape is the best, cuts down on the bitter taste)</p><p>2-3 cups Sugar (the more the merrier)</p><p>water \t(enough to cover shrooms)</p><p>8-10 Fresh mushrooms/dried</p><p>I cut just the tip of the stems off, and do not rinse, as this seems to lessen the effect and place in a pot with enough water to cover the shrooms, and boil the shit out of them for about and hour.  I strain them, (I find that a fine mesh metal strainer works best).  Pour the liquid into a pitcher and add in the sugar and cool-aid while its still warm. Stir and Serve!</p><p>NOTE: For a single dose, I just drop 8 to 10 shrooms in a microwave safe bowl and heat for 3 min or until it boils.  Then mix it as shone above.</p><p>Here is a short account of one of my more intense trips.</p><p>Pickle, Fiendish and my self picked about 4-5 ounces of shrooms, and headed home to boil them down.  Around 12pm we each drank two 20oz Mardi Grass cups full of our shroom juice. (all the mushrooms were used)</p><p>12:15 We have made it to the back yard and are sitting under a massive oak, starting to get the giggles.</p><p>12:20 The peek grabs me up and dont let go for another 8 hours.</p><p>Some time next day I go to sleep, probably around 10am.</p><p>During the peek of the trip, there are only a few things I can put to words.  When it first hit me I can remember strong colors and shapes filling my entire field of view.  Smokes felt kinda rubbery in my hand, and walking was more like floating.  The best way to put describe my emotions at the time, would be none at all or that is so many at once, I did not have a chance to truly feel each one.</p><p>Im sorry that I can not better describe the trip, but there is just too much to it. I have no way to express them.</p>",
 "year": "1998",
 "id": "18425",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-14T07:00:00.000Z",
 "views": "4232",
 "dose": {}
}
