{
 "title": "Hallucinagenic Fungi Cultivation Experiment",
 "author": "Twinky666",
 "citation": " Twinky666. \"Hallucinagenic Fungi Cultivation Experiment: experience with Mushrooms (P. cubensis) (ID 18429)\". Erowid.org. Oct 26, 2002. erowid.org/exp/18429",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "",
 "report": "<p>I recently finished my first magic mushroom cultivation experiment.  I kept a journal In Microsoft Word, so I'll just copy and paste it from there.</p><p>First hallucinogenic fungus experiment journal</p><p>Sept. 18    Inoculated 11 -  pint jars with two strains of psilocybe cubensis, Puerto Rican and Treasure coast.  ___ jars were Psilocybe Cubensis var. Puerto Rican and ___ were Psilocybe Cubensis var. Treasure Coast.  Originally I planned to have twelve jars but at the time of inoculation I realized one jar was very water logged and I assumed very fucked up.  I didnt use the jar, but I prepared fresh substrate.  I seem to have misjudged the size of the needle I would be using because the holes in the lids were to small and I had to force the needle into the lids, bad idea I know but I am confident enough in how sterile my surroundings are and with my work.  Also, in one jar while I was inoculating it, the needle became clogged, rather than pull it out and re penetrate the cake, I forced the plunger to go down and it slipped a little and injected 2.5cc of Puerto Rican spores into the cake.  Another cake, while injecting into the second inoculation site caused water to come out of the other hole.  I assume this cake is water logged and will not work but ill give it 10 days to show growth, if it doesnt, ill clean the jar make fresh substrate and inject it with the 4ccs of treasure coast I have left</p><p>Sept. 20   Injected the twelfth jar with Treasure Coast spores.  This inoculation went off without a problem.  This jar will grow Im sure of it.  Then I put it in the closet box with the rest.</p><p>Sept. 22   So far I have kept the temp measured inside the box at a max of 93.0 and a min. of 75.6.  Both are a little extreme but it happened through experimentation and will not happen again.  The 93 was especially dangerous I know but it only happened in the box for maybe 5 min. before it dropped.  I am working on the assumption that the air temperature in the box is slightly higher than the temperature inside the jars.  Therefore it maybe at the most got to 91 in the jars, worst case scenario.  The recommended temperature for these spores by the spore supply company during mycelia growth is 84-86 and 74-76 during fruiting.  I am going to keep the growing chambers at room temperature inside the closet which appears through a weeks observation inside the terrarium appears to be between 76-81.    I have determined how I am going to control the temperature in the growing box.  I will use a heating pad under like 3 or 4 towels with the box the jars originally came in containing the jars.  With this setup I can maintain a constant temp no high than 88 no lower than 83.  With this I should be able to get a perfect temperature drop on their birthday.  Also today I took the jars out of the box for the first time to check growth.  Only one jar showed any growth, a Puerto Rican jar.  It only showed growth at one inoculation site but the growth there was massive but then, reaching from the top to the bottom of the jar.  Something worries me about this jar, the mold appears to be a slight grey color and seems to be showing up unusually fast.</p><p>Sept  23  Checked for signs of growth again today.  The jar that showed signs of growth the yesterday doesnt worry me anymore.  The mycelium is that trade mark brilliant bright white of the cubensis and is now becoming rather thick.  I think the reason it looked so grey yesterday was because of how thin the stuff was.  I now assume this was the jar the syringe plunger slipped on because of the incredibly fast growth.  I wish I had ordered more spore syringes so I could do that to all the jars.  After the first batch when I make my own syringes I will do this to all the jars.  This fast colonization has to be an all around plus.  This fast strong growth has to eliminate the potential for infection of the cake and it gets you shrooms faster.  The next batch I plan to do this to at least a majority of the jars.  Not to be overshadowed by this amazing discovery 6 more jars shows sign of growth but nothing that incredible just the usual spots of growth you see with just 5 days.  I now have 7   pint jars beginning colonization.  All is as planned with bonuses.</p><p>Sept. 28  Checked for growth today.  I now have a total of ten jars with at least a little growth.  Only two Treasure Coast jars have yet to show signs of growth.  These two jars arent showing signs of contamination so Ill wait until day 15 to throw them out.  One jar however appears to be rather water logged, a leak during pressure cooking caused this I believe.  I am giving it more time because another jar that seemed water logged is showing growth.  The best jar could have its birthday maybe in 10 days and the best few all within 15.  All jars showing growth will be ready within 23 I would guess.  The cakes with a lot of growth have obviously shrunk in size on the sides where theres growth.  Temp has been constant between 81 and 88 since the last entry five days ago.  As far as I can tell, no jars are showing signs of contamination, it appears I could possibly have a successful first attempt at growing shrooms.</p><p>Oct. 1  I still have ten jars with growth.  There is still no sign of contamination in any of the jars.  By my inexperienced guess work, I would say that there are 4 jars that could be ready for the terrarium within 5-10 days.  All but one of the jars with growth has shrunk dramatically.   Ive decided in the last couple of days that it would be easy for me to expand this experiment from 12 jars to 48.  Ive made all necessary calculations and it will cost me an additional $149.88 to expand my operation by four fold.  Ive begun gathering the additional supplies and sent the order in for 10 syringes and to more spore prints so I dont have to wait for the first flush to start the new jars.  Two new strains will be added to the mix, Tasmanian and PES Hawaiian.  Both of these strains are supposed to be very fast colonizers as well as abundant fruiters.  The stated colonization time for the Tasmanian for  pint jars is 13 days.  I dont think Ill be able to get the jars colonized that fast, but it will be a little faster I hope.  Ive come to the conclusion that the strains I have now colonize better at higher air temps inside there box so I have begun trying to keep the temp between 84-88.  Everyday I become more and more proud of this experiment.  This is going to be a BIG success. </p><p>Oct. 2  MUSHY PICTURE DAY!!!!</p><p>Oct. 6  Five jars are just a couple of square inches from complete colonization.  My previous assumption that the cakes colonize at higher temperatures are wrong, they do much, much better in the 81-84 range.  They have been in this range for 3 days now.  Im positive Ill have a few jars in the fruiting chamber by Friday, the 11th.  Once I bought more jars in preparation for expansion, I replaced the two jars with new ones.  Apparently, something bad happened to the spores in the treasure coast syringe.  The two jars that didnt grow were treasure coast and the two new jars I made were also treasure coast, and they showed NO growth.  The two original jars, when I cleaned them, had no growth at all.  This leads me to believe that if the spores had not been fucked up, I would have had 100% success on my first attempt.  Not bad.  Still, no signs of contamination in any of the jars.  This is going to be a very successful experiment in Mycology.</p><p>Oct 8  The new spores and syringes came today.  I made ten syringes from two spore prints.  I had 5 Tasmanian and 5 PES Hawaiian.  I inoculated twelve jars this evening as well, 6 Tasmanian and 6 PES Hawaiian.  These are both fast colonizers and should be ready for the terrarium in 14 days. </p><p>Oct. 9  Due to the threat of apartment inspections by the maintenance crew, I was forced to find a way to conceal the shroom boxes.  I found a way of insulating them in blankets making them appear to be a pile of folded blankets in my closet.  Today, I got fed up with the slowed growth of the growing jars.  I know the slowed growth is caused by high CO2 levels in the jars.  I took a risk, I sterilized everything around the jars and the box itself and decided to open air holes in the jars.  I know Im risking contamination but Ive had 100% success, I have confidence.</p><p>Oct. 10  The risk of opening air holes paid off.  The best jars has  a square inch left and will be ready by morning, most definitely.  Also, the way I hid the boxes turned out to be the perfect amount of insulation.  To maintain a constant 83, I only need to heat the boxes once or twice a day.  Im drunk, celebrating my success, excuse my typing.</p><p>I waited until about 6 pm this evening to remove any cakes from their jars.  I decided that two were strong enough to make it on their own in the world.   Looking to dose on the 18, if Im lucky and I think I might be</p><p>Oct. 11  It was three cakes birthday today.  One of the cakes from yesterday, which was not fully colonized, now is.  They both have fuzzy white mycelium growing on the surface, in some places up to a half inch think.  I started the light on a timer today, two hours of indirect natural light from 6AM to 8AM everyday.  Then another hour of light in the evening, around 10 or 11.  The temp stays between 75 and 77, up to 81 when the light is on.  Im planning on birthing the majority of the remaining cakes tomorrow, three or four.  One of the cakes, I think Ill just throw it out, its only half colonized, I could start a new jar and finish before this one will.  I was surprised this one grew at all anyway, the substrate was fucked from the beginning.  Ill just extract whatever psilocybin may be in it and try to trip balls. </p><p>Oct 12  I have my first contaminated jar.  One of the new Tasmanian jars had a green mold growing near the bottom.  I dont know what the fuck it is but it resembles the green mold you typically find on bread, but I have no real idea what it is.  I threw the jar out.  OF the other 11 second batch jars, 3 more Tasmanian are showing mycelial growth.  Excellent.  The Hawaiian I chose for its extremely fast growth, but t takes longer than average for growth to show.  Once it does, they take off, consuming  pints in under 13 days.  We shall see.  Im planning on birthing two more cakes today.  However, one of them, Im still debating on, I may wait until tomorrow, but Im definitely birthing one.  These fuckers, they need to stop growing so fast, I cant keep up celebrating birthdays.  Ive had three in three days, give me a break, my body cant process that much alcohol and weed.  Hehe.</p><p>Oct 14  I forgot to write yesterday that I birthed the final cake of the original batch.   Theres not much else happening with the cake in the fruiting chambers, they are growing fuzz all over them, but thats about it.  Of the second batch, I have 10 more jars with growth, only one jar has yet to show growth, but Im sure its going to start soon.  Im starting a third batch of twelve jars today.</p><p>Oct. 15  The first six cakes to enter the terrariums all have little white beginnings of pin head all over them.  The first three cakes even have a few pin heads with dark red tip, some standing a  off the top of the cake.  I touched one to turn it, with just two fingers as lightly as possibly, within minutes, there were dark blue finger prints on the cakes.  I will be dosing this weekend, either Saturday or Sunday night.  All of the remaining cakes from the second batch (11) are showing signs of growth with no contamination.  Things are going as planned and better.</p><p>Oct. 17  There are pin heads on all 7 cakes in terrariums.   The best two cakes have shrooms a  inch in diameter and 1  inches tall.  None of the pin heads have aborted yet, at least not that I can tell.  It seems that more and more pin heads are being produced along with the older pinheads.  They also appear to grow in clumps.  One of the cakes, on the top, its completely covered in primordia.  Fantastic.</p><p>Oct.  22  Picked the first open caps, 1 oz.  I ate those this morning.  My normal dose is one fresh ounce, and these had to be the strongest mushrooms I have ever had.  My recommendation to anyone just planning on growing one strain of Cubensis for personal use, I would get the Puerto Rican strain.  They are amazing. </p><p>Oct. 23  Picked all of the first flush today.  I got 3  ounces of mature mushrooms and 20 grams of pin heads/aborts off of the seven cake, plus the three times I dosed, coming out to a fresh weight of 5 1/3 oz on seven cakes.</p><p>Oct. 24  The remaining three ounces have fully dried using the damp rid method to a nice 9.9 grams.  My roommate ate a dry half eighth this evening and they are kicking his ass nicely.  Like I said, get the Puerto Ricans.  Also, of the second batch of jars, 5 are now in terrariums, for a total of twelve fruiting cakes right now.  Im going to let this be the end of documentation, Im tired of writing and theres not much more that can be learned, Ill just be repeating the same things over.  I consider myself very successful and would recommend that anyone who like magic mushrooms to grow them.</p>",
 "year": "2002",
 "id": "18429",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-10-26T07:00:00.000Z",
 "views": "26033",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Mushrooms - P. cubensis"
  }
 }
}
