{
 "id": 18421,
 "title": "An Accidental All-Nighter",
 "date": {
  "submission": "2009-12-28T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alex",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "250",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Methylone"
  },
  {
   "time": "0",
   "administration": "repeated",
   "substance": "insufflated"
  }
 ],
 "report": [
  "I had discovered this substance just over a month ago and had tried it several times, first time I had got myself 1g of very pure clean white powder. It was very good and the 1g lasted me 4 days. Quite liking it I had gotten it a couple more times. And that's when I started to realise that this stuff is bad news indeed.",
  "Previously I had experienced a brief black out from using just over 1/2 a gram in the course of a night, and after asking on forums I was told it was probably because of the amount of coffee and cigerettes I had during the course of the night, as all restrict blood vesells.",
  "The night started with trying out 250g oral of methylone I had to see what that was like. It was very nice, felt great very euphoric no speedyness and I was very happy just sitting at my computer doing not really anything. In my happy go lucky state and once I was coming down, I thought I wonder what combining with mephedrone would be like, and that was the start of a very bad night.",
  "In my state I felt like I really had no desire to have anything else but was curious and because of that I thought that I could take mephedrone and just leave it at that. So a fair sized line of mephedrone was taking at about 9pm. I dont have scales so I just rack out an eyeballed out.",
  "The night continued, and the viscious cycle of mephedrone started. Just one more line, which just keeps going and going. I was very high and feeling great, I started coming down slightly and thats when I have urge to take more. At some point in the morning, I decided in my altered state to see what a large dose would be like, so poured out a large amount of powder and racked 3 lines. I took all 3 in the space of about 10 minutes.",
  "By this point my nose was fighting back and had completely blocked up. After that I was left in an incredibly high state, so high that, that it was obviously not safe. My state was pretty altered, almost spaced out. Reading peoples posts in chat rooms didnt make much sense, I could read the text fine, but it was almost as if there was nothing in my head. It would go in and disappear. Reply would take great effort and I would be constantly asking people what had just been said.",
  "This state resulted in me doing it again once I was coming down, and then taking smaller lines 15 minutes later as it subsided. Come 9am and its all gone. It could have been more than a gram, Im not too sure as I had 2g in 1 bag which I had some of on a previous night a few days ago.[Erowid Note: 1 gram of 4-Methylmethcathinone is considered an extremely high dose, see 4-Methylmethcathinone Dose Chart]  I was working that day, so I was a little concerned, but as time went on I was feeling actually fine apart from not having any sleep, had been drinking water, and also had a few coffee. It came time to get washed and ready for work. And thats when everything went south.",
  "I got up to make a coffee, and all of a sudden without warning I got a huge horrible rush all over my body and had to sit back down. It went away and I was a bit shaky. So got back up and again, the rush came back. It was like my whole body was violently vibrating.",
  "I then got really sick feeling, stumbled to the kitchen sick and was sick twice. It wasnt much, as I there was nothing in my stomach but liquid. I was shaking badly, and in literally seconds went from being dry to soaking wet from sweating. Then I got really cold. The huge body buzz made it very difficult to move, grabbed my phone and phoned in sick. Lay down on the couch and got covers to keep me warm. This lasted about an hour, of me not moving under the covers just wanting it too stop feeling like complete shit.",
  "This stuff is a big problem, mainly due to that fact that the urge to redose is so hard to resist."
 ],
 "erowid": {
  "id": "82189",
  "citation": " Alex. \"An Accidental All-Nighter: experience with 4-Methylmethcathinone (Mephedrone) & Methylone (ID 82189)\". Erowid.org. Dec 28, 2009. erowid.org/exp/82189",
  "substance": "4-Methylmethcathinone (Mephedrone) & Methylone",
  "views": "15539"
 }
}
