{
 "id": 1843,
 "title": "Good News & Warnings",
 "date": {
  "submission": "2002-07-14T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Echo",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "  Over the last six months I have done 2CT-7 six times, and have witnessed 25 others experiences. I have always done it orally with a dose between 20 and 27 mg (I weighed each dose accurate to within 1mg).",
  "  This drug has caused me to vomit a few times.  I have only vomited two other times in my memory.  While extricating the partially digested slurry on 2CT-7, I have always been extremely disoriented and hallucinating in very unique and poignant ways.  The vomiting appears to be independent of my food consumption and also unfazed by pepto or emetrol.",
  " After ingesting a capsule with a weighed dose, it has always taken myself and those around me a little over an hour before the initial effects.  Roughly an hour after this digestive cramping leads to nausea.  The digestive cramping can remain for up to five hours after ingestion (in my experience).  If the dose is insufflated, you will vomit, and quickly.",
  "  Unlike LSD, Salvia, Amphetamines and Cannabis products 2CT-7 has caused little to no anxiety in anyone around me.  I am particularly prone to being anxious (I have some anxiety disorder or another), so this is a great joy for me.  Actually, I feel rather relaxed and loose on 2CT-7, like I have had 3 shots of liqueur or some GHB.  I have made a couple of rather embarrassing foux-pas in social situations while on 2CT-7.  I have become a little embarrassed, not that I was dancing naked on any tables or anything.",
  "GOOD NEWS: I and another friend found that taking an anticonvulsant shortly after taking 2CT-7 almost completely eliminates the negative physical side effects of this substance.  It is possible this is because most of the nausea caused by 2CT-7 is related to muscle convulsions upsetting the digestive track.  That is only a guess, but it seems to fit my body's reaction fairly well.  Using the anticonvulsant has allowed us a full view of the psychedelic joy that is 2CT-7 without clouding the high.",
  "WARNING:  In myself (and two others) mixing 2CT-7 with GHB has caused extreme discomfort for up to 9 hours.  Even with both substances carefully weighed; digestive discomfort, stomach cramping, nausea, dizziness and uncomfortable disorientation are felt in tandem.  Please proceed with caution here because both substances have claimed lives."
 ],
 "erowid": {
  "id": "16013",
  "citation": " Echo. \"Good News & Warnings: experience with 2CT-7 (ID 16013)\". Erowid.org. Jul 14, 2002. erowid.org/exp/16013",
  "substance": "2CT-7",
  "views": "14948"
 }
}
