{
 "title": "Reality Became Stripes of Color",
 "author": "picasso",
 "citation": " picasso. \"Reality Became Stripes of Color: experience with Salvia divinorum (6x extract) (ID 18433)\". Erowid.org. Sep 8, 2005. erowid.org/exp/18433",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "200 mg",
  "smoked",
  "Salvia divinorum",
  "(extract - 6x)"
 ],
 "report": "<p>For many months I've been interested in salvia divinorum. I've researched it extensively over the internet and finally ordered some dried leaf, and then some enhanced leaf. As my experience with drugs had been limited to cannabis and alcohol, I was a bit apprehensive about using salvia. I truly had no idea what to expect. I would like to describe my experience which I had early this morning.</p><p>Mindset: A bit apprehensive but anxious. This was my 4th time using salvia, and other than the first time which I experienced some noticeable effects, I had not had a truly psychedelic experience.</p><p>Setting: The darkened living room of my apartment. On my previous attempts, I used a sitter but this time I felt that perhaps the presence of another person was interfering with having a more powerful experience. I had been reading about the potentially enhancing benefits of incorporating music into the salvia experience so I decided to play a Raymond Scott CD 'Soothing Sounds for Baby'. This is electronic music and very 'trippy' sounding. One of the most powerful aspects of my experience was tied to a song on this album but more on that later.</p><p>I spent about 15 minutes in quiet thought (my attempt at meditation) and then loaded my small metal pipe with .1g of 6x enhanced salvia leaf. I believe I inhaled the whole amount in one hit. I held it as long as possible and then immediately loaded the bowl again and inhaled the second hit. At this point slight changes were noted -- I recall 'hearing' or sensing some voices in my head, conversing with each other about how I need to hold the smoke in longer. I 'sensed' that they were telling me this because this would be the only way to 'meet' them. The tone of the voices seemed playful and friendly.</p><p>After the second hit, things began moving fast. I noticed that reality was being warped into my stereo. Let me explain. The wall in front of me and the wall on the opposite side of me seemed to be being drawn into the stereo, almost like how water empties through a drain in a sink. Using this analogy, the stereo was the drain and reality was the water. Interestingly, I didn't think anything odd about this until hours after the experience. Simultaneously, reality became 2-D, which seems to be a common aspect of the salvia experience.</p><p>This is one of the wierder aspects of the experience (one which seems to be fairly common): I had the feeling of deja vu. I had the feeling that either I have had this experience before, or that I was in some place or 'space' which I was familiar with. I wish I could describe this better. Basically, it felt like how I would imagine a person would feel upon returning to their family after years apart. A homecoming.</p><p>The following is the peak of my experience: Up until this time, I basically was fully aware of the nature of the situation. I knew that I had smoked salvia, I knew who I 'was', where I was, etc. All of a sudden, reality began melting into thin stripes of muted color. And these stripes of color formed a river, and this river flowed in rhythm to 'Lullaby' from the raymond scott CD. By reality, I don't mean only physical reality, but thoughts, feelings, worries, situations, people, ideas. EVERYTHING, including ME (most of the time). The only thing unaffected was a slight shred of my conscious mind. Now and then I faintly realized what was going on, and instead of fighting the river, I went with the flow. And when I went with the flow, 'I' disappeared, and that was truly a beautiful experience. Perhaps the sensation can be compared to a leaf being blown along by the wind. 'I' experienced total liberation and freedom, from the ego, the body, the environment, everything. Interestingly, I wonder where this river was flowing to? I ask this because I definitely got the impression that this river of color was flowing SOMEWHERE.</p><p>Eventually, reality re-formed but the experience was not over. When I closed my eyes, these patterns began forming, one after the other, each identical, until the last. It seemed like I was being shown that when one 'thing' is out of place, everything is affected. I believe this could apply to the self, a family, a country, the world, the universe, and so on.</p><p>What did I learn? I am not sure if I 'learned' it, but in the later parts of my experience, it seemed like I was being shown the nature of that river of colored stripes. However, at this time, I do not feel ready or even able to attempt to describe this 'message', but I will say that the message centers on the ancient topic of life and death.</p><p>Maybe in future uses of salvia the message will became clearer and easier to relate.</p>",
 "year": "2002",
 "id": "18433",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-09-08T07:00:00.000Z",
 "views": "12497",
 "dose": {}
}
