{
 "id": 18448,
 "title": "Third Capful Put Me Over the Edge",
 "date": {
  "submission": "2004-05-26T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "suedehead",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "cap"
   },
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  },
  {
   "time": "0:20",
   "amount": {
    "number": "1",
    "unit": "cap"
   },
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  },
  {
   "time": "0:20",
   "amount": {
    "number": "1",
    "unit": "line"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  },
  {
   "time": "0:45",
   "amount": {
    "number": "1",
    "unit": "cap"
   },
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  }
 ],
 "report": [
  "I am allergic to alcohol so I was always curious about GHB because I read that it gives similar effects (losing motor skills, and feeling belligerent).  A guy I knew had a couple ounces of it in a clear liquid and he didn't want to try it so he gave it to me.",
  "I went home and read up on it and started out with a capful.  It tasted salty and terrible.  It felt like it absorbed into my body before it even reached my stomach and it felt like what I imagine drinking bleach would feel like.  In 15 or 20 minutes, a warm feeling of euphoria washed over me.  I just wanted to smile and I felt kind of woozy and my body felt all loose and lost a bit of motor skills.  I took a second capful about 25 minutes later and the effects were intensified.  I felt great.  I felt a bit belligerent in a good way and definitely it lowered my inhibitions.",
  "After the second cap, I did one line of cocaine after reading reports that it was quite enjoyable.  I decided to only do one line because I didn't want to over-do it. The synergy was amazing.  It was definitely one of the better drug combinations I've ever felt.  I felt on top of the world.  The feeling I had from the mix of cocaine and GHB is what I would imagine heroin feels like but I wouldn't know because I've never done heroin.",
  "Twenty-five minutes later I did a third capful.  This is the capful that put me over the edge.  I shouldn't have done it.  My advice to people trying GHB is: If you feel good, then leave it alone and let yourself feel good.  I felt great, and I thought a little more would make me feel even greater.  Not so.  With GHB, one capful can intensify it exponentially.  I didn't get really sick or go into convulsions or anything like that, but the third capful made me feel nauseous and it basically knocked my ass out.  It brought on a powerful fatigue, and while I wanted to stay up and have fun, it was so intense that all I wanted to do was lie down and fall asleep.  This is NOT the kind of sleepiness I can fight off.  I'm lucky I was at home and not at a party, because if I was at a party, I would have fallen asleep right then and there.",
  "Overall, I had a lot of fun until the third capful.  I like GHB, however I can't stress enough that you be careful and don't overdo it.  Also, I mixed coke with it but I don't recomend it.  Mixing uppers and downers is hard on your body."
 ],
 "erowid": {
  "id": "8239",
  "citation": " suedehead. \"Third Capful Put Me Over the Edge: experience with GHB &  Cocaine (ID 8239)\". Erowid.org. May 26, 2004. erowid.org/exp/8239",
  "substance": "GHB &  Cocaine",
  "views": "40650"
 }
}
