{
 "id": 18447,
 "title": "Can't Escape Being a Pothead",
 "date": {
  "submission": "2004-06-03T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "suedehead",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I've done my fair share of drugs but only one of them really has a hold on me and I can't quit. I used to do lsd all the time to dosages up to 10 hits at a time. I've done lots of shrooms and dxm. I've done 2cb, ghb, salvia divinorum, cocaine, methamphetamine, (lots of) ecstasy, hydrocodone, ect. Most of those drugs I went through phases with the first year of college, but the one drug that I cannot quit is marijuana.",
  "All other drugs mess up my head if I do them too much, so it was easy to quit them but weed I am totally addicted to. Why? Maybe because it seems to be the perfect drug to me. It makes me feel euphoric and helps me forget about my problems. The problem is that after smoking for a long time straight, it takes weed for me to feel normal. I was a daily smoker for a few years. I don't consider weed that bad of a drug, and I certainly think alcohol is worse than weed, but weed has its drawbacks. If it was legal, I would have no problem with it but since it isn't I suffer. For one thing, for good quality buds, it's very expensive. Normal cost in my area is usually $50 for 3.5 grams of weed. To a pothead, that's normal, but to people who don't smoke, they don't usually go blow $50 in one or two nights. That's enough money for like 3 cds. That's enough money to treat a couple people out for dinner. That's enough money to see 5 movies in the theater. It blows my money. Not to mention, it kills my motivation.",
  "I am down to smoking about 50% of the time. Usually I'll smoke for a few days straight, and then take a few days off. It has taken a lot of will power on my part to not just smoke every day. I've definitely cut down but the thought of quitting completely is disturbing and horrible to me. I am a depressed guy in general and some of the only times I feel pretty happy are usually when I'm high. My advice, use in moderation (it works much better if my tolerance is down anyway) and don't use it to run away from problems or to escape. I used it to escape and now I can't escape being a pothead."
 ],
 "erowid": {
  "id": "8237",
  "citation": " suedehead. \"Can't Escape Being a Pothead: experience with Cannabis (ID 8237)\". Erowid.org. Jun 3, 2004. erowid.org/exp/8237",
  "substance": "Cannabis",
  "views": "19241"
 }
}
