{
 "id": 18443,
 "title": "Legal Pseudo-Speedball?",
 "date": {
  "submission": "2009-12-28T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Giggling Scientist",
  "gender": "Male",
  "weight": 12
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  },
  {
   "time": "1:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "1:20",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "3:30",
   "amount": "4 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  }
 ],
 "report": [
  "Over the last year I have been extensively investigating a wide range of legal highs available in the UK. Of all the herbs and RCs one can buy here, two in particular have grabbed my attention - Kratom and Mephedrone. Now, I could easily deliver a report on the effects of both drugs when used separately but I have been combining the two in fairly low doses to create a legal pseudo-speedball, if you will. At this point I must remind everyone that the consequences of such actions are, at best, relatively unknown. The point of the information here is not to glorify such combinations but to provide advice for those who will inevitably try to mix these two legal highs. It was my experience that very little information could be found on using the two substances in tandem.",
  "Now, onto the experience. Although Kratom is much milder than Heroin it can still pack a punch and sedate me fairly well. At the same time, Mephedrone reminds me very much of cocaine when snorted and is similar to (though perhaps not as psychedelically intense) as MDMA when bombed in doses of 100-250mg. Thus, when deciding to combine the two I decided to start with fairly low doses as I wanted to minimise the potential of an adverse reaction. To start I dumped roughly 4g of Super Green Indo Kratom (finely milled) into roughly 100ml of boiling hot water. I let this mixture sit for roughly ten minutes in order to let it cool. Whilst this was happening, I pulled out my 1g bag of Mephedrone and measured out 2x50mg of the substance. Whilst waiting for the Kratom to cool further I sorted out my I-tunes play list (music is very important to mind set) and made myself comfortable.",
  "When the Kratom was cool enough I downed it in one gulp (including the powder) and chased the nasty taste away with some Pepsi. Whilst I waited for the effects of the Kratom to kick in (usually takes 30-45 mins) I sat and got myself comfortable on my bed, listening to my music. Within 30 mins I was feeling the familiar shift in mood that Kratom provides - generally positive, relaxed, slightly warm/heavy feeling. Usually Kratom plateaus at the hour mark for me and stays there for another two or so hours. Therefore, at just over an hour I decided to snort the first of the 50mg of Mephedrone. Within a minute, I could feel a difference in how I was feeling. The relaxed state of mind delivered by the Kratom was still there but there was an increase in the intensity of the euphoria, almost certainly attributable to the Mephedrone. I let this feeling wash over me for 20 mins until it subsided and then re-dosed with another 50mg of Mephedrone. Instantly, the euphoria came back but with very little of the tense, jittery feeling I experience with stimulants. The Kratom was obviously still relaxing me whilst the Mephedrone was amplifying the feelings of euphoria.",
  "At this stage I was energised from the Mephedrone but relaxed from the Kratom. I decided to gather up my essentials and go for a walk outside in the September sunshine. Over the course of the next two hours I would bump 50-75mg of Mephedrone every half-an-hour whilst really enjoying being outside and admiring the beautiful scenery of where I live. Usually I just take this for granted but the two drugs were combining well to improve my appreciation of everything around me. I truly felt very happy to be alive. As the kratom wore off effects typical of stimulant use became more apparent - jaw clenching, grinding teeth, tense muscles. At this stage I felt I had reached the conclusion of the experiment. However, out of interest I decided to round off the experince with another 4g of Kratom once I was back home. Within 30 mins the Kratom kicked in again, balanced out the effects of the Mephedrone and allowed me relax enough to get some sleep later on that night.",
  "To conlcude, no adverse effects were experienced during this trial. It was felt that the two drugs combined well for roughly two hours until the Kratom started to decrease in effect. At this point the Mephedrone started to dominate proceedings. However, a final dose of Kratom at the end helped to minimise the adverse effects of the Mephedrone and relaxed me enough to fall asleep a few hours later."
 ],
 "erowid": {
  "id": "82338",
  "citation": " Giggling Scientist. \"Legal Pseudo-Speedball?: experience with Kratom & 4-Methylmethcathinone (Mephedrone) (ID 82338)\". Erowid.org. Dec 28, 2009. erowid.org/exp/82338",
  "substance": "Kratom & 4-Methylmethcathinone (Mephedrone)",
  "views": "16614"
 }
}
