{
 "id": 18451,
 "title": "Ambien & hallucinating",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Diabolique",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I was in the hospital for an extended period and often was givin Ambien to sleep. After I was discharged they prescribed it to me, but I didn't use it much because I didn't feel like it did anything to me in the hospital.",
  "About a month after being discharged, one night after drinking 3 wine coolers I couldn't fall asleep, even though I was very tired.  It was around 4am. So I took 2 Ambiens.",
  "90 minutes later, I thought I saw glitter falling everywhere, and my computer screen looked like glowing, rippling gelantous fluid. I wasn't 'out of control' which is what acid does to me.. it wasn't nearly as chaotic or intense, but it was quite pleasant! I could easily visualize into a hallucination anything I imagined, for instance, I wondered what it would look like for a stream to be running through my apartment, and whoosh, there I could glowingly see it.",
  "I called my doctor the next day to ask him about it, and he said that hallucinating on Ambien was rare but documented, especially if you wake up after falling asleep from Ambien. He said one time a patient of his took it in the hospital, fell asleep, then woke up 3 hours later and buzzed the nurse, thinking that a stranger was in her room (but no one was!) Weird eh??",
  "Well doc told me not to take Ambien anymore and gave me Sonata instead. But I had 4 Ambiens left.. I tried taking 2 at a time twice more, and sadly neither time were my hallucinations replicated. (And nor did I ever hallucinate in the hospital). So I don't know whether it was the addition of 3 simple wine coolers to the mix, or being so exhausted when I took them that time, but it was really really colorful, giddy and fun.",
  "(Please note that technically mix Ambien and alcohol is not recommended.)"
 ],
 "erowid": {
  "id": "8240",
  "citation": " Diabolique. \"Ambien & hallucinating: experience with Zolpidem (Ambien) (ID 8240)\". Erowid.org. Feb 10, 2004. erowid.org/exp/8240",
  "substance": "Zolpidem (Ambien)",
  "views": "44411"
 }
}
