{
 "title": "Welcome to Elfland",
 "author": "SFos",
 "citation": " SFos. \"Welcome to Elfland: experience with DMT & LSD (ID 1846)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1846",
 "substance": "DMT & LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "",
   "",
   " ",
   "smoked",
   "DMT",
   "(freebase)"
  ]
 ],
 "report": "</p>\nA week ago during spring break i hiked up into the Smokeys with three good friends for a week of relation, nature and tripping. We camped in the heart of a Cherokee reservation, literally on top of a waterfall. the first day my friend ben and i ate two and a half hits of very clean rainbow family acid one morning before hiking up deeper into the river valley. we were headed where we'd heard drumming and chanting coming down from the night before, or was it just ancient memories whispered to life by a stream in spring? anyway, we had probably made our way no more than a half mile further up into this rugged and luscious land when the acid began to truly announce its presence and we decided it was time to plunk down and smoke something. the living presence of nature all around us was absolutely overpowering. has anyone ever spent time in the Great Smokeys in Springtime? picture the clearest, most crystalline blue creek cracking cold down out of the mountains, spilling a landslide of beautiful multicolored stones in all directions, and surrounded by an oak and beech and rhododendron tree forest with mosses and lichens and liverworts and fungi covering everything. it is more than amazing. so it was here that ben and i did sit and smoke a bowl of cannabis, but dusted with DMT, and it was only moments later that we came out in ELFLAND. when i say ELFLAND i do not intend at all to mislead the reader into thinking this was some sort of simple story book fantasy. it was not. rather it was full-blown nymphs and pixies and drilde running every which way, faces poking out from behind every leaf and tuft of moss, the forest unveiled as the arboreal kingdom of the merry little small people.</p><p>it was like this for what must have been like half an hour - a more than real zany, elf-infested forest. my friend and i walked around extensively during this time and encountered every sort of diminutive spirit of nature mother Gaia has in her zoocoepia. it was, well, something else. i had never imagined that the elves could become quite this real, or that they would. (: all of them were nice enough, though a few were pretty playful and mischievious, little bit too big of a dose of Pan. some of the little flying sprites were unbelievably flirty and erotic. throughout this time we could feel these huge ripples of earth energy pouring down the valley, what we were at the time calling 'supernovae' and which we could both reliably sense coming on. behind my eyelids i was having visions of huge interstellar architectures and the conquest of space with hyper-light drive ships of the most phenomenal spherical dimensions. the whole feeling of the trip was very galactic, which i said at that time and again later, and about which my friend strongly agreed. it was to me as though these elven denizens as we know them on earth are very connected with aliens, and that there are whole tribes of elven like creatures that are busy colonizing interstellar space. i felt as though i either was myself an elf, was made of a sacred ecology of them, or would soon evolve into one. i could see the faeries, and later the insects, flying along energetic lines that i could see moving through space. as far as my friend and i could determine, we saw the same shifting pattern of energetic lines and agreed that both insects and faeries flew along them. he was overcome by an experience of the LIGHT for a good portion of this time, while i was too fascinated by the sudden appearance of ELFLAND to have any further such excursions, not including the aforementioned 'supernovae'. eventually the free moving spirits and elves dissipated and disappeared, and i was left looking at the forms imprinted in the very fabric of the total world as the impressions made by spirits in this world-weaving of souls. to this day i am far more able to look at tree bark for instance and see all the hidden faces and figures than i used to be, and my appreciation for the possibility that the probability waves of quantum mechanics are woven into a world by what one might call elves has grown immeasurably. i can only hope that others will, with my recipe or another, discover the same in their neighborhood forest, crossing over into ELFLAND like Darbio Gill himself.</p>",
 "year": "",
 "id": "1846",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-14T07:00:00.000Z",
 "views": "8388"
}
