{
 "title": "Tar Tar Char Char",
 "author": "Gnostika for Noddy",
 "citation": " Gnostika for Noddy. \"Tar Tar Char Char: experience with Heroin (black tar) (ID 18473)\". Erowid.org. Feb 9, 2005. erowid.org/exp/18473",
 "substance": "Heroin (black tar)",
 "bodyweight": "145 lb",
 "report": "<p>Backround:  I've used heroin quite a few times in my life, mainly the last few years.  Opioids have always been my DOC.  I keep my usage down to 2 grams a month.  This usually lasts me about 3 nights.  I've never had any significant withdrawals this way, nor have I had too hard an urge to habitually use the substance.\rSet:  My room.  1:30 AM.  Can't sleep.  Smoked some pot earlier in a vain attempt to get drowsy and lazy.  Must not have smoked enough, as my heart began to race as I tried to sleep.  This has always driven me crazy, my heart beating so hard when I'm trying to get to bed.  Heroin is called 'Chiva' around this area (Northern California) and is mainly imported from Mexico as a black sticky substance, or sometimes if i'm lucky, a brown powder that turns into tar when it's exposed to heat and moisture.</p><p>Pre-description rant:  If you have a needle exchange in your area, and you inject your drugs, I highly recommend you take advantage of the exchange.  They can be great for information and of course as many needles as your heart desires.  They provide sterile saline, sterilized cooking utensils, rubber ties, alcohol swabs, dental cottons, bleach, and many harm reduction pamphlets that can mean the difference between life and death to the unwitting.</p><p>Description:  1:30 am roughly.  My girlfriend lays in bed, asleep, and I lay next to her.  My mind is zooming a million thoughts a minute, and my heart beats to the point that it keeps me awake.  After about 30 minutes of keeping my eyes shut, here I am, a little annoyed at myself for not being able to control my bedtime thoughts.  I prepare a shot of heroin, which I know will not put me to sleep, but it may ease my heart and at least put me in a dreamy state where I could eventually drift off into sleep. </p><p>Preparation involves cleaning myself first with antibacterial soap, washing my hands and arms well.  I then wrap a rubber tie around my upper arm.  I now break off half a street quarter and dump it in a empty bottle cap.  The cap was never used on any bottle, and was sterilized before the drug was dumped in it.  I opened a small 3 ml tube of 'USP 0.9% Sodium Chloride Inhalation Solution.'  I squirt in a little more then half a mL of the solution.  I don't have a lighter handy, so i just swish the water around in the cap for about 2 minutes in which time it dissolves into a dark brown solution.  I then drop in a dental cotton which soaks up everything like a sponge.  I uncap a 29 guage 1 mL disposable insulin syringe, and stick the needle in the cotton.  I suck up the solution until only a dry brown ball of cotton remains.  Now I wipe my arm with a cotton swab and search for a suitable vein.  I abandoned the tie now because it's obvious I won't need it. </p><p>The needle goes it, I miss.  I then go for the vein right next to it.  This hurts a bit more because I already dulled the syringe.  This time however, i'm greeted with a plume of dark red and I pull back the plunger a bit to check if i'm in.  Now I slowly work the drug solution into my veins.  I pull out, and reach for the cap next to me.  I cap the syringe, put it down, and let out a comfortable sigh as everything in the world warps to perfect peace. </p><p>I look at my girlfriend, she's very lovely, laying there in bed.  I start thinking of all the wonderful times.   About 15 minutes later my mood starts to stabilize.  I quickly get bored with doing nothing and hop on my computer.  I check my email.  I go to Erowid because I've got drugs on my mind (no pun intended).  I check the news.  I read the new reports.  I write this, and I think it is time to go to sleep.</p>",
 "year": "2002",
 "id": "18473",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-02-09T08:00:00.000Z",
 "views": "126708",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "125 mg",
   "administration": "IV",
   "substance": "Heroin"
  }
 }
}
