{
 "id": 18473,
 "title": "A Nasty Tasting but Powerful Shot",
 "date": {
  "submission": "2010-04-19T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Cait",
  "gender": "Female",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 drops",
   "administration": "oral",
   "substance": "Salvia officinalis",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>Warning: THIS TASTES HORRIBLE. Be prepared to brush your teeth directly afterward, and still deal with a crappy after taste.",
  "A little background: Alcohol is involved. I, admittedly, do not have a very good tolerance to alcohol.  Only one shot was consumed, and I am very certain I can handle one shot.",
  "I had purchased a small bottle of common sage essential oil because I love the smell and hoped to possibly create a candle out of it.  I never found the time, and a while later I stumbled upon an online listing of the herb as a potential psychoactive.  I never realized that this common culinary herb was such a close cousin of 'Salvia,' or Salvia Divinorum which is supposed to produce a short trip.",
  "I have never smoked Salvia Divinorum, so I have no way to compare the two, but this is what happened.",
  "I became curious, and decided to try the Sage oil.  It packed a very powerful scent, so I figured whiskey (namely Jack Daniels 80 proof, to be exact) would be a great way to cover the taste.  Boy, was I wrong.  The Sage was way more powerful tasting than the whiskey.  After brushing my teeth, I still had to deal with the after taste for a few hours.  Cigarettes helped numb my taste buds, but not by much.",
  "I put ten drops (from the dropper included with the essential oil) into one 1 oz shot glass already full with the whiskey.  Cheers, and down the hatch.  Fifteen minutes later, I began feeling a little 'warm and fuzzy.'  The best way to describe it is that it felt like I had four glasses of wine.  It was notably  more of a 'wine-drunk' than a 'whiskey-drunk,' although I could not consider myself being drunk.",
  "So, if I ever find myself with only a shot or two of alcohol left and still want to feel a real buzz, I might do this if I were desperate.  It definitely helped screw me up, but it tasted so nasty I might never want to do it again.",
  "I never made those candles, by the way. I can no longer stand the taste or smell of sage.</p>"
 ],
 "erowid": {
  "id": "82533",
  "citation": " Cait. \"A Nasty Tasting but Powerful Shot: experience with Alcohol & Salvia officinalis (ID 82533)\". Erowid.org. Apr 19, 2010. erowid.org/exp/82533",
  "substance": "Alcohol & Salvia officinalis",
  "views": "6423"
 }
}
