{
 "id": 18477,
 "title": "Sharing the Pain",
 "date": {
  "submission": "2004-08-03T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Red Penguin",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "My twin brother and I were visiting the house of my friend Nat and her roommate Jess.  We had been hanging out, talking and watching movies, singing, and generally having a good time.  When 1AM rolled around and everyone admitted that the party better wind down -- we all had work in the morning.  On a whim, Nat and Jess suggested that we smoke a little, since we hadn't earlier.  My twin and I agreed enthusiastically, and we went up to Nat's room while Jess got her weed.",
  "We smoked what little was left in the bowl in one round, and Jess repacked tightly.  After a few passes I started to feel the effects, and as a seasoned smoker I could tell it was going to be a very physical high.  Nat and Jess didn't smoke all that often, but they continued to keep up with me and my twin, who can smoke all day long.  I started to get the giggles like crazy and everything was hilarious to me.  I was having trouble keeping up with a story that Jess was telling us, and enjoyed the nonsense that I shot back at her when she tried to explain.",
  "Around this time we stopped smoking, and I was really coming up fast.  Nat asked if Jess was high, because she felt self-conscious that she was the only one.  Nat takes insulin for diabetes, and also is on medication for her thyroid.  As I said, the weed was very physical and I felt increased sensation in my arms and chest, and knew my heart was pounding.  My twin and I were accustomed to weed of this kind and we weren't bothered by it, and knew it would pass; we were still having fun.  Jess seemed to be fairly into her high, but she seemed to be having fun also.",
  "Nat, however, was visibly shaken and looked up.  I could see her heart racing in the hollow of her neck and could tell that she was worried by it.  When asked what was wrong, she said that she felt sick to her stomach.  I turned to talk to my brother and I felt a jab in my ribs.  Nat had fallen onto the bed and her elbow was poking me pretty hard.  'That kinda hurts,' I said, and she mumbled an apology and stared off with a glazed look in her eye.  She made a face as though she would vomit, so I sat her up and she protested mildly that she didn't want to hurt me.  I was worried that she was going to have a bad time so I tried to rub her shoulders and give her a kiss, but she turned away and declined.",
  "Jess and my twin had left, and Nat started to shift and sway while sitting against the wall.  After a few moments, she leaned against me and said that she was sorry for not kissing me earlier.  We then started making out passionately, and it felt wonderful.  The effects of the weed were at its peak, and every touch felt electric.  I felt like I was soft and floating over the bed, and her kisses were delecious.  I totally forgot that she had been feeling bad.  We started to get into heavy petting and neck biting, and we both ended up with our shirts off.  I stopped to take a breath and asked how she was feeling, and she admitted that she was starting to feel sick to her stomach again.",
  "Uh oh, I thought, and she told me that the only other time she had made out with somebody when she was high ended badly, and she said that it made her have bad flashbacks.  'Flashbacks to what?'  Bad stuff, she said.  I felt like a total jackass, and I put my shirt back on and she did the same.  I started crying, overwhelmed with emotion.  I apologized for anything anyone ever did to hurt her, that she didn't deserve it.  She said that nothing I did was wrong, but I felt terrible.",
  "She was still way out of it until 3AM, and we were both upset.  I think that if she had a higher tolerance for weed, the whole night would have been more fun and nothing would have gone wrong.  I also contribute part of the experience to the medication she is on.  I would have had more fun myself if I hadn't felt so bad for her and empathized so deeply with her pain.  I genuinely felt like everything was wrong.",
  "We ended up sleeping over, with me holding her through the night and rubbing her back.  I don't know how much she remembered the next morning, because she still seemed a little out of it."
 ],
 "erowid": {
  "id": "8255",
  "citation": " Red Penguin. \"Sharing the Pain: experience with Cannabis (ID 8255)\". Erowid.org. Aug 3, 2004. erowid.org/exp/8255",
  "substance": "Cannabis",
  "views": "4612"
 }
}
