{
 "title": "Seeing Energy and Hearing Voices",
 "author": "C.G.",
 "citation": " C.G.. \"Seeing Energy and Hearing Voices: experience with DMT (ID 1847)\". Erowid.org. Jun 15, 2000. erowid.org/exp/1847",
 "substance": "DMT",
 "bodyweight": "",
 "report": "<p>I also have taken DMT. 7 times in fact, and only two of the times did I find it enjoyable.</p><p>On my third time trying it, two friends and I gathered around an uncut chunk of rose quartz about 10 inches tall, and 6 inches in diameter, with the purpose of developing the ability to visually see raw energy.</p><p>The three of us meditated on this thought for at least 20 minutes, then it was time to partake. I went first. Sitting prone in a meditative gesture, I took my hit. (I had help, don't get me wrong!)</p><p>Instantly the entire physical third dimension disappeared, and what was left was a state of consciousness unlike any other experience. Oils of reddish and brownish hues moved in every direction at the same time in my entire field of vision. Then after an orientaton period, (no more than a few seconds, I'm sure,) a hole the diameter of a basketball opened up in the middle of this untitled hallucinatory picture. In the center of this hole, was the chunk of rose quartz suspended right in front of my head (or at least where my head should have been, physically speaking of course!) I then saw something that looked like the consistency of honey, maybe a little runnier, being poured in through the top of the crystal. This substance had a bright orange-yellow glow to it. When the crystal was full, the fluid began to pulse, not like a heartbeat, but more like a throb. With every beat, I could see millions upon millions of microscopic strands of light pulse from the liquid, and find their way to the outer edge of the rock, whereupon they would refract in an infinite number of directions from the uncut sone. I actually felt them cascading over my face and body as they erupted from within.</p><p>Within only about 10 minutes, the entire scene had disappeared, not unlike my reality before, except that I could still see the energy eminating from the crystal which had clearly moved back down to the floor (from my head.)</p><p>I truly believe that this experience has led me to be able to see energies much more fluently. Knowing what it looks like from this experience has made it easier to find.</p><p>Anyway, almost every other time I tried DMT, it lead to a horribly inexlpainable experience that can only be thought of as schizophrenic, or at least partially!</p><p>Also, for literally a year, I would have auditory hallucinations that were totally uncontrollable. Even coming, in stereo, from behind my pilow at night, saying some ungodly thing that I wouldn't want to hear again! I literally thought I was loosing my mind during that year, and I convinced myself that I would actually and literally commit myself, but only if I hurt myself or someone else because of my uncontrollable schizoid attacks.</p><p>It's been at least three years since dong DMT, and can say that 'I'm all better now!' I know that I will probably never think the same as I did before the DMT experences, but at least the voices are gone...</p>",
 "year": "",
 "id": "1847",
 "timestamp": "2000-06-15T07:00:00.000Z",
 "views": "6859",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(powder / crystals)"
  }
 }
}
