{
 "id": 1848,
 "title": "Life is Good",
 "date": {
  "submission": "2005-07-26T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "EightMilesHigh",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "number": "50",
    "unit": "caps"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "The week before my experience I was in the pub talking a friend who had supplied me with Salvia before. He said he might be able to get hold of some mushrooms from the season previous, and asked me if I was interested. I hadnt taken mushrooms before and had only had a mild LSD trip a few months previous. I really wanted to trip again though so I told him I would be back next week with the money.",
  "I got the pub around 7 and started drinking. My alcohol tolerance is pretty low, so it wasnt long before I was drunk. Salvia guy turned up with my mushrooms not long after and sold me fifty liberty caps which were ground up. They were in a plastic zip bag and I slowly started to eat them. Around twenty minutes later I started to feel like I was rising into a new world. This world didnt exist in the present the past or the future but existed somewhere. I carried on drinking while I rose up to meet this new world.",
  "Someone walked over and sat between me and Salvia guy which made me angry, I couldnt understand how they could do such a thing. I told them to sit away from me and my co-pilot. I was starting to come up nicely and felt like I had joined the world now so I decided to leave. On the way out I told the bouncer I loved him. He said, Oh, drunk again are we? which made me laugh. As I began walking home I felt really good, I could feel a warm buzz inside. It wasnt as intense as MDMA, but somehow nicer.",
  "As I walked some more I began feeling content with everything, I wanted to find friends and chat to them about what I felt. Everything was ok. I took a piss in the middle of the street, It didnt bother me, and I couldnt understand how anyone else could be bothered by it either. I walked up to a friends flat and knocked the door, no answer, so I started making my way home.",
  "On my way home I was just loving the feeling of warmth and understanding. I decided to take a detour through some woods, the darkness didnt bother me as I was in love. In the woods I began thinking about my life, how things werent so bad and how the future was going to be so bright. I decided to change a lot of things about me and the way I thought about others. I felt like some sort of guru who knew the secrets of the universe. When I was coming out of the woods questions came into my head, which I had the answer or solution to straight away. I kept firing questions at myself and answering them with total ease. I must have asked myself dozens of complex questions in the time it took me to walk twenty-five meters.",
  "Once out of the darkness of the wood and back onto the street I was filled with a sense of nothing. I couldnt be bothered to think, just relax in the feeling of love. I managed to get home and to my room where I lay out on my bed and listened to Sgt. Peppers. I lay staring at nothing listening to the music. The songs spoke of the place I was in which felt good. After the album ended I tried to sleep. I don't know how long it was before I slept, ten minutes or three hours.",
  "I woke up the next morning quite hazy and not remembering much.",
  "The experience taught me how to improve myself and how to treat others. This lasted for many months, but has worn off. I feel like I need another mushrooms trip to bring back the things Ive now lost."
 ],
 "erowid": {
  "id": "16036",
  "citation": " EightMilesHigh. \"Life is Good: experience with Mushrooms & Alcohol (ID 16036)\". Erowid.org. Jul 26, 2005. erowid.org/exp/16036",
  "substance": "Mushrooms & Alcohol",
  "views": "13981"
 }
}
