{
 "id": 18518,
 "title": "No Reason to Do It",
 "date": {
  "submission": "2004-07-19T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Brian B",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "360 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "The beginning of my Sophmore year I pretty much tried almost every drug I could get my hands on.  I was always wanting to try something new and then I heard about tripping on Dramamine and Benedryl Allergy.  My friends told me about their trips so the moment I got home I swiped a packet of some Albertson's brand motion sickness pills from the medicine cabinet.  It was recommended I take at least 8, but I wanted the full experience and took 12.  Had some Dr. Pepper to wash them down and waited for the effects.  At about 4:00 PM I took the pills and at about 4:30 I began to feel the effects. ",
  "I suddenly felt really light and floaty.  Pictures looked different, sounds seemed different, it was all it cracked up to be.  Then things started to go downhill really fast.  At about 4:50 I began to feel EXTREMELY tired and fatigued.  I would try and focus on something and get sort of a head rush everytime something caught my attention or someone talked to me.  Suddenly I began to feel dehydrated and drank a ton of water.  I couldn't hold it in, I ended up pissing every 5-10 minutes.  The same thing kept happening, I drank water, pissed, drank water, etc.  5:30 rolled around and I reached a point where I couldn't stay awake any longer.  I sat up and stumbled over to my bed.  My balance was quite poor and vision was sort of blurred.  I was delerious, sort of like that feeling you get when you wake up after staying up late.  Except it wouldn't go away.  I felt like I was going to jump out of my skin.  Every few seconds I would turn and squirm around in my bed.  It was like a nightmare, I felt terrible and couldn't sleep it off.  Every so often I would get up and have to relieve myself for the 40th time that afternoon. ",
  "Hallucinations started taking place around 5:40.  They consisted mostly of colored blotches, flashing vision, changing colors.  Eventually I managed to doze off and didn't wake until about 2:00pm the next day.  Few after effects, I didn't feel tired but I did have some difficulty breathing.  All effects seemed to dissapear within an hour of waking.  Overall this experience was miserable, I wouldn't recommend this drug to anyone.  The first few minutes were enjoyable but they are not worth what you have to go through afterwards."
 ],
 "erowid": {
  "id": "8282",
  "citation": " Brian B. \"No Reason to Do It: experience with Dimenhydrinate (ID 8282)\". Erowid.org. Jul 19, 2004. erowid.org/exp/8282",
  "substance": "Dimenhydrinate",
  "views": "14079"
 }
}
