{
 "id": 18526,
 "title": "Night of The Living Dead",
 "date": {
  "submission": "2004-08-10T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "SpeedVera",
  "gender": "Female",
  "weight": "110 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>It was sometime around midnight and I was talking to some friends on the computer. I had been particularly upset because I just broke up with my boyfriend, so I wanted something to take my mind off it. A friend of mine who sells his dexedrine perscription had given me a free sample of three pills, ten milligrams each. I was fed up with talking online but I didn't want to just go to sleep. So I went into my trusty secret drawer and pulled out my baggie. The pills were in capsule form so I opened them up and put them into one long, fat line on my desk. I used a rolled up business card and snorted the whole line.",
  "It burned so horribly, since I had never snorted anything before. The worst part was it had a particularly nasty drip, I wanted to throw up from the taste. I had to keep drinking water to flush out the taste. I laid back on my bed, waiting for it to kick in.",
  "I never really knew when it kicked in because, according to my dealer, I overdosed. He gave me enough to fuck me up, if I swallowed the pills. Snorting them was asking for disaster because of my weight. This is why throughout the whole of what I remember, I wanted to throw up, my bdy was rejecting the speed. I also felt tired which I knew was a bad thing if you are on speed. I becamehorribly depressed and wrote an eight page suicide note in about half an hour. It quickly turned from depressing to creative though, I planned out the best funeral in the world that I would want to go to if I were not dead. Soon, I was just hyper, but being in my room with no where to go, I was anxious. At about 6 o'clock I got up to take a shower. I looked in the mirror and did a stunned double-take, my eyes were the size of dinner plates!",
  "For the rest of the day I was very awake and alert, but overall I had come down from where I was when I couldn't remember anything. One would think I would have stopped after ODing once, oh well...</p>"
 ],
 "erowid": {
  "id": "8288",
  "citation": " SpeedVera. \"Night of The Living Dead: experience with Dexedrine (ID 8288)\". Erowid.org. Aug 10, 2004. erowid.org/exp/8288",
  "substance": "Dexedrine",
  "views": "18791"
 }
}
