{
 "id": 18522,
 "title": "Don't Believe I'll Do That Again",
 "date": {
  "submission": "2004-07-12T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A Kat",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30",
    "grams": 0.03
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "3:00",
   "amount": {
    "unit": "mg",
    "quantity": "30",
    "grams": 0.03
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "3:30",
   "amount": {
    "unit": "mg",
    "quantity": "5.0",
    "grams": 0.005
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "4:30",
   "amount": {
    "unit": "mg",
    "quantity": "15",
    "grams": 0.015
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "5:00",
   "amount": {
    "unit": "bowls",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I first experimented with Dexedrine awhile ago. I took the 'sprinkles' out of the capsule, and crushed them up. Insufflation of 15 milligrams brought a feeling of energy, shortly after I tasted the drip.",
  "Never using stimulants before (aside from caffeine, nicotine, and the like), I didn't know what to expect. I didn't think I felt anything, so I did another little bump. I started to feel it, and when I thought the drugs were at the maximum effects (fairly weak, I'd say), I did the rest of the second pill, bringing me up to 30 milligrams.",
  "I must say, it does give me a lot of energy. I didn't, and still don't, particularly care for amphetamines and methamphetamine, but I must credit the energy level. I had not slept in about 14 hours, and was still not tired (the lack of sleep came from excessive caffeine consumption and prior responsibilities throughout the day.), and rode bike all around town all day, having fun.",
  "I remember stopping at my favorite park a lot with B (my companion for the day), and smoked about two packs of cigarettes. By 3:00, I had snorted four of them (since noon), and went over to another friend's house to do another with him. I didn't realize how overboard I was going.  We got to 'J's' house, crushed up the dex, and I gave him a good majority of it. He wanted to do it quite badly, and I was already feeling rather good. I did about 5 milligrams, he did about 10. B and I took off on our bikes, to try and find a bag of herb. I remember pedalling so hard and so fast for so long that I could feel torn muscles in my leg. I soon became very weak, but it was out of my control. Walking was easy, but I was very unstable and likely to fall down at any moment. I simply had a hard time supporting myself (from over-working my body).",
  "The herb wasn't ready yet, but we had another place to go. We went to B's house again, and we relaxed and listened to music. We were going to go to J's house in a bit, to talk to him, but I was a bit tired. B brought me two more pills. I wasn't particularly delighted at the idea of taking more, but nor was I of being completely out of energy.",
  "I crushed one up, snorted it, and we were on our way.",
  "We arrived at J's house, and seeing it was 5:00, we went to another place to get some definite herb. Sure enough, after we snorted the dex and left to our definite source, we were presented with a rather large bag. We smoked a few bowls of some dank buds, and then B left while he matched us with some KB. As I smoked, I could feel myself get more and more energetic. Soon I felt jaw-clenching, jerky movement, and even mild euphoria. The sleep deprivation, THC, and amp was all combining into one feeling. THC also strongly enhanced the amphetamine, by the way. Later that night, I did no more amphetamine. We stayed up, and smoked a bit of grass. We later went outside and watched some lightning, but no real storm came over us until later.  I remember going to bed at J's house at about 2:00 or 3:00 A.M. Moksha is great for putting me to sleep.",
  "All in all, I'd say the experience was negative. The energy didn't feel natural, and neither did the drug. Sleep deprivation made me an insane, rambling fool. I remember ranting for extended periods of time, J listening intently, then me forgetting what I was saying. Very little of it made sense, or had anything to do with what we were trying to talk about.  Any possible withdrawal was eased in 1 week, with about 5-7 mgs every two days (I don't believe that to be enough to make to many changes in my system). No withdrawal was noted after the weaning process.",
  "I don't believe I'll do it again. I'm also very, very glad that I didn't jump in and satisfy my curiosity with 'home-made' methamphetamine. I had to have something made by a pharmaceutical company, as they are about the only manufacturers I trust for stimulant drugs. I'm also glad I didn't get 'crank' cut with 30 different drain cleaners.",
  "I still haven't figured out how America can still fight the war on drugs, then turn around and hand out this to children who aren't doing too well in school. Perhaps room for creativity would suffice better than stimulants. B never took it, and now has a whole lot of it and Ritalin just lying around. Sick that the government hands out amphetamine and methamphetamine like that, then will jump at the chance to 'bust' people smoking a joint."
 ],
 "erowid": {
  "id": "8284",
  "citation": " A Kat. \"Don't Believe I'll Do That Again: experience with Dexedrine & Cannabis (ID 8284)\". Erowid.org. Jul 12, 2004. erowid.org/exp/8284",
  "substance": "Dexedrine & Cannabis",
  "views": "20108"
 }
}
