{
 "id": 18536,
 "title": "Unlocking the Mysteries of the Universe",
 "date": {
  "submission": "2010-04-26T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jimbo",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "18 g",
   "administration": "oral",
   "substance": "Tabernanthe iboga",
   "form": "(rootbark)"
  }
 ],
 "report": [
  "This is not a recreational experience. I wouldn't wish my worst enemy to go through what Ive been through. It also carries a high danger of death. I was supervised throughout by an ex heroin/methadone addict with an ego full of esoteric fantasies. He kindly mentioned that the trip wasn't over until it'd torn a hole in my head.",
  "When it kicked in I began to feel stoned and psychotic, like my thoughts were creating events. Nausea and vomiting followed, and then something like 3 days of pure torture, it was like a waking dream, hallucinations of things which seemed evil, but also something like a rebirth experience. I cannot be sure if what followed was due to my thoughts or the painful conversation with my sitter, who seemed to be ramming theories of the universe down my throat and blagging my head. I saw the ocean as if I was transcending to a new world, then the trip got deep and I was on my arse for a long time.",
  "Iboga brought introspection and analysis. I recognised the problems of humanity, caused, by lies, greed, and lack of faith in a higher power dispensing the throes of karma so that our souls can learn to live the way they are intended. For all the self analysis that came out of the process, and a guy sat next to me telling me there is no God, I realised we can have it all, anything we want, but it means nothing, I believe nobody, except God, can really know, and all we can have is faith, faith is magic. Im not a religious person because I believe even the bible is subject to the possibility of corruption by fallible humans, nor am I a particularly spiritual person as such.",
  "Since the trip Ive been taking anti-psychotic medication because its really screwed with my head and Im having a hard time getting back to my old self. Ive also become a tree hugger! I realise we need nothing in this life except faith in God. Technology and materialism is taking away from the purity of life, exhaust fumes are spoiling the fresh air. Heaven on earth is what we should strive for. Never tell lies and think of others before ourselves. I believe we need to teach future generations the right things.",
  "Its Christmas day today. As Christ said, love our God with all our hearts, all our souls, all our strength and all of our minds, and love our neighbour as ourself and well have eternal life.",
  "Peace and Love."
 ],
 "erowid": {
  "id": "82952",
  "citation": " Jimbo. \"Unlocking the Mysteries of the Universe: experience with Tabernanthe iboga (ID 82952)\". Erowid.org. Apr 26, 2010. erowid.org/exp/82952",
  "substance": "Tabernanthe iboga",
  "views": "7677"
 }
}
