{
 "title": "A Beautiful Sadness...",
 "author": "Ono-Sendai",
 "citation": " Ono-Sendai. \"A Beautiful Sadness...: experience with Mushrooms & Cannabis (ID 18548)\". Erowid.org. Oct 30, 2002. erowid.org/exp/18548",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(daily)"
  ]
 ],
 "report": "<p>It was about midnight when I finished chewing the 'shrooms. I was in an artificially good mood, the first joint of the evening was consumed half an hour prior to the mastication of the main course.</p><p>The weather was gorgeous, a perfect summer evening for tripping. It was my first experience with 'shrooms and there was a mild nervous electricity in the air. The joint pushed the harsh realities of life to the side and I was thinking only of my current high, and the brand new intoxication I would soon experience.</p><p>The 'shrooms took longer than I expected to affect my consciousness. About 75 minutes after I finished chewing, the first effects of the toxic seed I planted in my mind began to blossom. The periphery was the first to change, internal and external boundaries began to alter.</p><p>Illuminated by a nearby torch, the leaves of a bush formed crude human faces. Internally, the borders that contain various modes of my personality were beginning to crumble. For the first time in a while, I felt unconditionally happy, almost giddy.</p><p>Something rare occurred - a genuine smile illuminated my face. A crescent moon lighting up the night sky.</p><p>I remained in 'happy mode' for another hour or so, smoking joints with impunity, chatting with friends, exploring a sparkling, rare side of myself. Externally, the visual and auditory senses were in top form. Music was decadent and my eyes perceived things that were previously hidden. Patterns of motion left streaks in the windshield of reality, lights multiplied and captured new colors, cigarettes were subtly curving and morphing like liquid cylinder volcanoes.</p><p>The unpleasant mental effects of the mushrooms began at the peak of my trip, when we decided to leave my friend's house and go for a walk through a quiet, affluent neighborhood. I stepped out the door first, eager to sample the outside world through this remarkable filter, when I saw my shadow on the ground. Out of the blue, it had quickly fractured into five outlines and coalesced into its original form. I thought nothing of it until, less than a minute later, the high changed.</p><p>Suddenly, the world became raw and unwelcoming. My hallucinations changed and my happy mode turned to something sinister. A thin membrane prevented hostile feelings, based on various personal problems, from escaping into everyone's trip. I communicated through gritted teeth, barely tolerating any faults or stupidity, and reacting to everything with extreme cynicism. Even hallucinations were hostile, either concealing themselves quickly after discovery or invading my perceptions by sticking longer than welcomed.</p><p>A few minutes later, an old friend I recently started hanging out with again walked up to me and asked how I was feeling. The trip changed once again and I was severely depressed. I felt like an asshole for harboring such malicious feelings about my friends and felt like I was invading their trip. For some reason the class difference between my friend and I also felt more pronounced. (I've lived in a low-income area for twenty years, they all live in nice houses in friendly areas)</p><p>However, unlike my hostile mode, where everything was frustrating and adversarial, my depressed mode was a beautiful place to exist. Hallucinations gently supported me, and it felt like my friends were accepting my tortured soul. Lights became softer and produced gentle colors, trees would appear to form protective canopies above me and time felt more relaxed, as if it were giving me the space I need to heal my psychological wounds.</p><p>For the rest of the evening, this pattern repeated. Every fifteen to thirty minutes, the trip would change from happy, to hostile, to depressed and according to my internal state of being my external surroundings would change appropriately. Every significant shift would produce a new peak. Several times I thought the trip was over before a new wave crashed into the scene.</p><p>The final phase of my mushroom trip left me in depressed mode, where I remained for the rest of the morning. We returned to my friend's basement, mellowed out, listened to music, chatted and smoked a seemingly endless string of joints. The next day we discovered that we burned through at least a quarter of weed.</p><p>During this period I came to an important conclusion about my psychological existence. By experiencing my various personalities in rapid succession, I was able to compare them and better understand how they are linked. I fully understood that, despite the fact that therapy has made me more stable, I still have problems enjoying happiness. Now I try to appreciate whatever good vibes I can find and feel less guilty about them.</p><p>About the drug, I learned that it hit in waves and that it is a far more 'internal' drug than I previously believed. Also, the mental state you are in greatly influences the trip you will have.</p><p>Although it was nice to have my happy side set free for brief periods of time, I cherished the truths brought out by my depressed mode of existence. It was a beautiful sadness. I look forward to the next trip.</p>",
 "year": "2002",
 "id": "18548",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-10-30T08:00:00.000Z",
 "views": "10001",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
