{
 "id": 18546,
 "title": "12 Hours of Sexual Bliss",
 "date": {
  "submission": "2009-12-31T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Wayne",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Nutmeg"
  }
 ],
 "report": [
  "I have been taking nutmeg trips 3 or 4 times a year since my late 20's. I do this for the huge erections I get when I take this amount. I find 20 to 25 grams to be a dose that gets the results I want without too many bad effects. I am gay and I start masturbating off and on about 3 or 4 hours after ingestion. The sexual feelings and huge erection I get just blows me away. I pick a day when there is no one to bug me and I have not orgasmed for a few days. I eat a good breadfast at 8:00 and ingest the nutmeg with orange juice at noonhour. I start getting really horny after about 4 hrs and just increases from there.",
  "Note; it is really important to eat supper and sip water occasionally. From suppertime to midnight, it is masturbation city, my penis swelling to much bigger than normal. I eat some cereal at midnight, and continue sipping water. This helps to smooth out the trip and keeps my stomach feeling good. After midnight, I almost feel 'out of body' as I stroke my swollen cock to an unbelievable size! I usually cum around 4am and it feels like molten lava erupting! Basically I enjoy about 12 hours of sexual bliss.",
  "It can get intense with rapid heartbeat and anxiety but sipping water helps. I start to come down about 4 or 5 in the morning and I sleep a few hours before getting up to a shower and big bowl of cereal. Again, eating lots of food and drink over the next couple of days helps to reduce the 'washed out' feeling. I find taking the nutmeg dose on an empty stomach is most effective and then eat a meal about 3 hrs later. I find the sexual experience on nutmeg to be unbelievable, but some masturbation and exploration initiates it.",
  "For strong sexual effects, a dose of 20-25 grams is needed but unwanted side effects are greatly reduced with food and drink every 4 or 5 hours during the trip. I would not take a dose greater than 30 grams because I think I would be stoned for 2 days. For me, it is a treat worth looking forward to. For me, it is pure sexual ectascy. It is the only substance I have found in my life that truly makes me very horny, again it depends on the dose. Viagra will give me a huge erection but not the horny feelings!"
 ],
 "erowid": {
  "id": "83012",
  "citation": " Wayne. \"12 Hours of Sexual Bliss: experience with Nutmeg (ID 83012)\". Erowid.org. Dec 31, 2009. erowid.org/exp/83012",
  "substance": "Nutmeg",
  "views": "15062"
 }
}
