{
 "id": 18566,
 "title": "Pregabalin vs Gabapentin",
 "date": {
  "submission": "2010-04-30T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TheMacGrizzy",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Gabapentin"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Pregabalin"
  }
 ],
 "report": [
  "I have been dealing with idiopathic neuropathy in my toe for just over two years. Tons of MRI's, tests, and the lot revealed nothing that would be causing this pain (trust me, its a very strange referred pain in the toe). The Doc's finally decided to give up and call it Idiopathic Neuropathy, basically nerve pain with no known cause.",
  "First treatment was Gabapentin with 100mg PO 3 times per day. I read some reports about gabapentin and tried doses anywhere from 1000mg to 4000mg at a time. The feeling was comparable to cannabis with more of a heavy feeling in the body. The most troubling thing about gapabentin was the tolerance level was very high. Each successive dosing required more and more to achieve the same level. Doing gabapentin two days in a row was impossible. I eventually began to only use it for recreation once per month.",
  "The gabapentin did not end up helping with the neuropathy and so I had a different provider recommend pregabalin. Pregabalin was not on the hospitals pharmacy med list and had to be special ordered lots of forms later I was given a prescription for 75mg twice a day. After 14 days it was not effecting the neuropathy so I decided to give it a whirl as I did with the gabapentin. After taking 375mg (5 75mg pills) an hour later the same gabapentin high came on, and has been going strong for three hours. Mild euphoria, cotton mouth, and a strong heavy feeling in the body, especially centered on the chest. No auditory or vision disruptions. However I have experienced some blurred vision and strong drowsiness near the latter stages of the experience.",
  "In my opinion, pregabalin out shines gabapentin. Far less dosage to achieve the same recreational high. Also not as strong of a half life allowing one to use the drug more frequently (ie. every weekend). This is my first submission, I am an army medic and half a decent grasp of drugs, there contra-indications."
 ],
 "erowid": {
  "id": "83121",
  "citation": " TheMacGrizzy. \"Pregabalin vs Gabapentin: experience with Pregablin (Lyrica) & Gabapentin (Neurotin) (ID 83121)\". Erowid.org. Apr 30, 2010. erowid.org/exp/83121",
  "substance": "Pregablin (Lyrica) & Gabapentin (Neurotin)",
  "views": "23381"
 }
}
