{
 "id": 18569,
 "title": "The Tunnel to an Alien Landscape",
 "date": {
  "submission": "2004-07-27T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jared",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "Salvia Divinorum has propelled me into atmospheres that are incomprehensible.  After I experience such amazing landscapes, I realize that there is a hidden realm of the human psyche.",
  "One such experience shot me through hyperspace and I landed in a vast alien landscape.  While listening to Incubus, I smoked two hits of 5X and layed down on my floor.  Within seconds I felt that my body became the floor, and I felt my spirit lifting out of my body.  To the upper left of my vision I noticed a small hole that seemed to be twisting and spinning in the air.  I decided to jump into the hole, and as I did this I realized that the hole was a tunnel that looked to me like a rollercoaster ride.  I could still see everything in my room, but I felt I was riding the tunnel.  The music became a sort of background for the tunnel experience, and it calmed me down when I started to feel scared.  After what seemed like an eternity I shot out of the tunnel and floated around in a vast horizontal plane out in space. I felt the presence of two aliens that were laughing and pointing at me.  These aliens were very real, but they had a cartoon-like quality to them.  I looked to my left and saw another alien with a glowing head that was talking to me, telling me that I should not be scared. ",
  "I felt an extreme love towards this alien, but when I moved my vision away from it I fell back through the tunnel and took another ride until I landed back in reality.  When I was back on earth I asked myself why this happened to me.  I got mad at myself for moving my vision away from the glowing alien, because if I would have focused on it, it might have told me something important. ",
  "Salvia Divinorum is nothing of this world.  After this experience, I realized that it must be some sort of a communication device between aliens and humans.  Terence McKenna says the same thing about mushrooms, so I believe that Salvia is also a symbiote with a very powerful history.  The Divine Mint changed my life forevor and I hope that in the near future the government wont make it illegal."
 ],
 "erowid": {
  "id": "8313",
  "citation": " Jared. \"The Tunnel to an Alien Landscape: experience with Salvia divinorum (5x extract) (ID 8313)\". Erowid.org. Jul 27, 2004. erowid.org/exp/8313",
  "substance": "Salvia divinorum (5x extract)",
  "views": "5486"
 }
}
