{
 "title": "A Relationship Saved",
 "author": "Parader",
 "citation": " Parader. \"A Relationship Saved: experience with MDMA (ID 18564)\". Erowid.org. Nov 21, 2002. erowid.org/exp/18564",
 "substance": "MDMA",
 "bodyweight": "145 lb",
 "report": "<p>My girlfriend and I broke up during my Junior year of college after a wonderful 2 year relationship.  We both were getting scared that the next step was probably marriage, and that freaked us out.  So we ended it. </p><p>The problem was, we had already saved money and bought tickets to travel together in Europe for 3 months the following summer.  I decided that I wasn't going to give up the trip, and she decided the same.  We spoke only once or twice in the 4 months leading up to our trip.</p><p>Once we got to Europe, the chemistry was back, but since we were both dating other people back home, there was definitely some jealousy. Plus, I had been somewhat unfaithful during our 2 years together, and I think she suspected that.  I was suspicious of some things she had done as well.  All of these things made for an uncomfortable situation, and made a future romatic relationship all but impossible.</p><p>We decided to go to the Love Parade in Berlin, Germany.  The Love Parade is the world's largest techno festival.  Once a year, sometime in July, the world's best DJs and 1 million techno fans take over the city and party non-stop for 3 days.  The city hosts roughly 15 raves each night.  It was AMAZING!!!</p><p>We picked up some E in Amsterdam on our way to Berlin (2 pills each), and went to one of the raves for a night of partying.  We each took half a pill and took a whole pill around 1 hour later. </p><p>We began pouring our hearts out to each other.  I told her I was still in love with her, but that I had done some things that were wrong and wanted to come clean.  She admitted the same and that she had cheated too.  We talked about it for hours and tried to come to terms with why things had gone sour.  We made no plans for the future  regarding getting back together, but we made a pact that from then on, we would always be honest with each other.</p><p>We finished our trip and got engaged 4 months later.  We have now been married for 2 1/2 years.  We take E once a year or even less just for fun. </p><p>I'm not saying that E helps you find the one who's right for you, I'm just saying that we never would have worked things out if we hadn't been able to be completely honest with each other.  In some ways I'm ashamed that I couldn't have been more honest on my own, but I was younger then.  I'm a happier person because I practice honesty all the time now.  I can't exactly praise E for making me honest, it just openned the door.  Since then, it has been my job to live an honest and loyal life.  It's a great way to live.</p>",
 "year": "1999",
 "id": "18564",
 "gender": "Male",
 "timestamp": "2002-11-21T08:00:00.000Z",
 "views": "34051",
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
