{
 "title": "Rendered Inactive",
 "author": "G Love",
 "citation": " G Love. \"Rendered Inactive: experience with Caffeine (coffee) (ID 18565)\". Erowid.org. Aug 4, 2005. erowid.org/exp/18565",
 "substance": "Caffeine (coffee)",
 "bodyweight": "185 lb",
 "report": [
  "<p>Let me start off by saying I am no stranger to altered states of body and/or mind.  Not only this, but I've drank my fair share of coffee in my 22 years, many times a day for a while in college. ",
  "Now we're to the experience in question.  Now in grad school, I had a midterm to prepare for.  So, I spent much of the days leading up to it studying like any good student would do.  Feeling positive about how I would do, I decided the night before the test to go out with some friends and have a few drinks.  I didn't drink much, but I did stay out late enough that my sleep would be severely diminished.  I got 4 hours of sleep before my midterm.  No good, but things happen.  So, I awoke and ground some healthy arabica beans and set them to their job: soaking in boiling water and leaving a wonderful concoction when the liquid is filtered.  I took down the two cups of darker than dark coffee along with about four cups of water just to keep my system from overloading.  After all, coffee is a dyuretic, and I can't have that while still trying to stay somewhat healthy.  I hopped on my bike, rode to class, took a restroom break and then sat at my desk.  Midterms were handed out and everyone had at it.  About ten minutes into it I started having to urinate again.  It only got worse by the minute until I thought I was going to explode.  I would have taken a break, but I needed all the time allotted.  I finished five minutes early, turned my midterm in, grabbed my stuff and headed for the bathroom. ",
  "Here's the fun: about ten feet from the door my now completely jittering body had a severe moment of dysfunction and the catching of my toe on my other leg sent me sprawling, a virtual yard sale in the hallway.  As soon as I hit the floor the shock of pressure on my bladder was enough that it just went, and I pissed all over myself.  This only took a few seconds, and from the puddle I shot up, grabbed my stuff and made a mad dash for the bathroom.",
  "I tell this story because people assume things like 'coffee is ok but LSD isn't.'  I only drank two cups of the stuff and these were the results, while I have taken moderate doses of LSD many a time and never once had such a horrible physical result.  Be aware, the body is just as important as the mind.",
  "peace</p>"
 ],
 "year": "2002",
 "id": "18565",
 "gender": "Male",
 "views": "12607",
 "dose": [
  {
   "time": "0",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2005-08-04T07:00:00.000Z"
}
