{
 "title": "Everything is Spotted in Black",
 "author": "duster addict",
 "citation": " duster addict. \"Everything is Spotted in Black: experience with Inhalants (Computer Duster) & DXM (ID 18561)\". Erowid.org. Jun 27, 2007. erowid.org/exp/18561",
 "substance": "Inhalants (Computer Duster) & DXM",
 "bodyweight": "120 lb",
 "report": "<p>Duster has always been fun.  But the last time I did it, I actually regreted it the next day.  I did something that I didnt really want to do, and I was also in danger, but I couldn't realize this since we were f*cked up.</p><p>It's like this, we go to the store, buy the duster, buy some Tussin so we can do some 'Robo-Trippin,' and then we go do it before we go somewhere like the mall or the movies.</p><p>It was as it always was.  G took his hits first, then B then A then me.  Usually there are more people, but they couldn't make it.  J didn't want to do any, he justs smokes weed.  B always falls and hits his head on trees or something, G always lands on his face, and A always lands on her face, and somehow, her long is always showing when she does.  I don't know what I do.</p><p>G and me were actually able to have an intelligent conversation, even with the drugs.  B and A were making out lying down, and G and me were laying on each other.  We talked about some important stuff.  G and me even were talking to trees.</p><p>Duster is just awesome.  It's like this: I take my hits, and hold them in.  I'm careful not to get any on my lips or tongue because it will freeze them for days! The first time I did it, it was awesome.  My chest gets very heavy, and so do my eyes.  Everything is spotted in black, and I  can never much of anything.  Sometimes my eyes get so heavy that they have to close, and tat's when I black out.  And hardly anybody  can remember blacking out.  They just think that they fell, until someone tells them that they blacked out.  And I see things too.  I saw a tree talking to me, and G turned into a giant.  He's really tall so that must be what started that little hallucination. hehe.  And I think I saw a little man in the woods, looking at me from behind the trees.  I can't remember much, but I know I saw a little gnome or something.</p><p>Duster is great....however, we were really f*cked up since we all drank a whole bottle of Tussin....each.  So we went up to the mall.  Don't remember much except that when you walk, if you look down, then it looks like your going 500 miles per hour.</p><p>There was this guy there, R, and he took advantage of me while I was trashed.  I kissed him, but I told him flat out no for everything else and he did it anyways, so yeah I learned a lot from that experience.  I learned to only get messed up with people that I know (I didn't know R, I knew everyone else) and to not get so messed up that I can't take care of myself if I need to.</p><p>I love my memories from Duster.  I love how it makes me think.  Everything is great for the few minutes it lasted (before I take more hits) sometimes, I feel the words 'I loe you!!!!' pop into my mouth because I get o happy and giggly.  But I bite my tongue when that happens.</p><p>Oh yeah, and one time A, she passed out and it was so funny because whe she came to, she screamed this blood curdling scream at the top of her lungs, and we said 'what's wrong?'  It turned out that when she passed out, she was having hallucinations of PacMan, and when she passed out, she heard the music that they play when PacMan dies.  So she thought she was dead.  It was sooooo funny.....</p>",
 "year": "2002",
 "id": "18561",
 "timestamp": "2007-06-27T07:00:00.000Z",
 "views": "9323",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6 hits",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
