{
 "title": "No Thanks",
 "author": "Plu$h",
 "citation": " Plu$h. \"No Thanks: experience with Cocaine (ID 18577)\". Erowid.org. Jul 27, 2007. erowid.org/exp/18577",
 "substance": "Cocaine",
 "bodyweight": "125 lb",
 "report": "<p>I have used meth on various occasions over the past six months.  For me, it sharpens the mind and sustains the body when nothing else will do.  I rarely use it in a recreational sense, reserving it for paper deadlines and chronic exhaustion.  I had long wondered if positive cognitive effects could also be gleaned from cocaine. </p><p>Recently, I received an offer I couldnt refuse.  Days went by before I had the opportunity to actually try the cocaine I longed to sample.  I prefer to err on the side of caution, fulfilling all necessary tasks and obligations before dabbling with any substance.  Currently, I take no medications or supplements outside of oral birth control.   </p><p>By the time I reached my friend's apartment, spirits were high.  It was 10:45 when she broke out the mirror and razor blade.  After producing a few lines, she did a gummer and invited me to do the same.  Within 10 seconds, my lower jaw was numb and my tongue felt clumsy inside my mouth.   </p><p>At 11:00, I insufflated a line of coke measuring approximately 1.25 inches in length.  I was struck by its odor, so different from that of meth or even pharmaceutical amphetamines.  My nasal passages felt as though they were crammed with cotton, a most unwelcome sensation. </p><p>By 11:10, I felt an odd, disjointed energy creep through me.  It lacked the positive push and directed ambition that I typically experience with meth.  I became more talkative and memories rose into consciousness.  I felt stronger, sharper and more alert than before. </p><p>When the feeling subsided at midnight, I thanked my friend and bid her goodnight.  I walked briskly to my car and headed back to my apartment.  En route, I felt more edgy and impatient than usual.  I am normally a mellow, patient individual and found this frightening.  The rising hostility toward drunken pedestrians was more 'primal' than anything I experienced with meth.     </p><p>At 12:20, I retreated to my room.  I had no desire to speak with my roommate, as much as I enjoy her company.  I normally chat for a bit, grab a beer and play with the pets before retiring, yet found myself too irritated to do any of this.  It was a nonspecific, infantile aggravation that disturbed me.</p><p>I entertained myself with Instant Messenger for a bit before heading to bed.  My body was exhausted, but my mind was still reeling.  At the same time, my body felt 'tight', as though I were in attack mode.  At around 1:30, I finally fell asleep.   </p><p>At 8:00 the next morning, I was loath to wake up for class.  My head felt heavy, as though I had a cold.  My jaw was still tense and sore, as were most of my muscles.  My head continued to pound with a raging tension headache throughout the day. </p><p>At 2:00, I was still a nasty little ball of tension.  Little annoyances and inconsiderate strangers were greatly magnified in significance.  I entertained aggressive notions in my head, and imagined myself perpetrating them against the offenders.  </p><p>I felt psychologically shell-shocked and physically exhausted.  Yet I learned several things from this experience:  1.  For me, coke is not a cognitive enhancer.  2.  Cocaine 'hangovers' are unpleasant.</p><p>In simple terms, cocaine is averse to my station in life.  I find that it is prohibitively expensive and inefficient in comparison to meth.  I have no desire to experiment with it further.</p>",
 "year": "2002",
 "id": "18577",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-07-27T07:00:00.000Z",
 "views": "4797",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
