{
 "id": 18574,
 "title": "Urine a Heap of Trouble Now, Pal",
 "date": {
  "submission": "2010-01-13T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Druu",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "400"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "capsule"
  }
 ],
 "report": [
  "I'm a semi-regular user of DXM.  I've never hallucinated, I just enjoy the long-lasting head buzz.  I'm also an occasional user of Tramadol.  Again, not for the analgesic effects, but the very mild euphoria and subtle mood lift.  The use of these two together provided me with a very frightening experience.",
  "I took four Tramadol tablets, 50mg each, at three different times during the day.  As I took the last dose of four pills, I swallowed 400mg worth of DXM capsules.  Within about 60 to 90 minutes, I felt the gentle buzz and was feeling pretty good.  Although unremarkable, there were no unpleasant mental effects from this combo.",
  "Four hours later, it happened.  Or more accurately, it didn't happen.  I went into the bathroom to urinate, and nothing would come out.  I wasn't even able move those muscles down there.  I tried again and again over the next hour, with no results.  I was beginning to grow concerned now, as my bladder had gotten very full and uncomfortable.  It was off to the emergency room for me.",
  "To summarize, I had a catheter inserted, which was extremely painful.  I had to wear it for three days, and when it was removed I was back to normal once again.  It was an absolutely miserable experience.  I for one will never try that combo again.  Getting a catheter inserted into where things should only come out is no fun at all."
 ],
 "erowid": {
  "id": "83146",
  "citation": " Druu. \"Urine a Heap of Trouble Now, Pal: experience with DXM & Tramadol (Ultram) (ID 83146)\". Erowid.org. Jan 13, 2010. erowid.org/exp/83146",
  "substance": "DXM & Tramadol (Ultram)",
  "views": "14366"
 }
}
