{
 "id": 18586,
 "title": "Nirvana or Bliss",
 "date": {
  "submission": "2000-07-13T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Third Eyes",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>I put the crystals on top of some buddha ashes, inhaled all in one toke and held it for 1 minute. After i exhaled an initual rush of all positive thoughts came to mind,similar to 40-50 differant time travel experiances and thoughts, per second for about fifteen minutes. These are primarily of the first half of my life. All this while i just stare and i cant physically move (literally). I feel like a computer processing new information. This was mentally to much, to mentally interact with. After about 15-20 minutes I gradually was able to mentally and physically interact with the blissful state of consciousness. Also at the point of exhallation i had closed eye, three dimensional objects, in which i could physically touch. I could change the background at will, just by staring at the image of choice, colors and movements of objects could also be changed. It was like the initial the best of meth, lsd, heroin, dxm, heimia; basically the best atributes of stimulants, narcotics, dissociatives, opiates, benzos, pot and tropanes. 5-MeO-DMT is a very good tool me to learn in. Memories are recalled, and new data remembered better. The brain seams to work more efficiently than otherwise. For 5-MeO-DMT is superior to all other substances, except for marijuana.  I could choose my trip and intensity with this substance. The next substance i want to add is harmine, for a more intense and longer trip. Ultimately 5-MeO-DMT, harmine, and datura!</p>"
 ],
 "erowid": {
  "id": "832",
  "citation": " Third Eyes. \"Nirvana or Bliss: experience with 5-MeO-DMT (ID 832)\". Erowid.org. Jul 13, 2000. erowid.org/exp/832",
  "substance": "5-MeO-DMT",
  "views": "7929"
 }
}
