{
 "id": 18589,
 "title": "Auditory and Visual Hallucinations",
 "date": {
  "submission": "2011-09-20T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "r.zimp",
  "gender": "Male",
  "weight": 125
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "I smoke weed pretty much every day, but today's trip was unlike anything I have ever experienced.",
  "I don't know where to begin really.  I smoked it out of my bowl.  I was initially going to smoke a bowl of just weed but then I realized there was a pile of resin powder at the bottom of the baggy that my weed was in.  I bought the weed pre-ground from a dealer because it was all he had left.",
  "I pinched some of the powder, it was sticky resin that rolled into a ball in between my fingers.  I sprinkled a layer of the powder on top of the bowl and went outside to smoke.",
  "I smoked in the woodshed beside my house.  I took one hit and knew how intense the experience was going to be.  I was already high and I had only hit the bowl a few seconds earlier.  I smoked the whole bowl and began to really feel it.  I walked up to the house smiling and laughing, thinking that this was going to be a great high.",
  "I was doing fine, feeling good, watching tv, and eating.  I started to reach new levels of high, places I had never been.  Sounds from the TV were echoing and I was becoming increasingly psychologically introverted.  I turned the TV off because it was becoming too frantic for me to watch.  I began to think about myself and my personality.  I was feeling emotions, defining where the emotions were coming from and analyzing them.  I went through all of my worries, confusions, pleasures, guilts, and took them all to their roots in my mind.  It was like I was watching a movie about myself in my brain. ",
  "As I continually became more and more introverted and pensive on my minds workings I found a place in my brain that I have never been before.  I literally was convinced I had found my personality's core, a pure representation of myself, and surrounding it were all of the external personas, facades, and superficialities that I had accumulated throughout my life.  I visually hallucinated, while standing in my kitchen breaking through the layers of my external superficialities and facades until I reached some sort of true center.  ",
  "I was physically shaking while breaking through hallucinated layers.  I was floating through a fractal-like world, in a complete visual hallucination.  I was in a different dimension, as cliche as that sounds.  It was the most intense emotional experience I have ever had. Every once in a while, as I traveled through this world, I would come-to a little bit, and I became scared and worried about how out of it I was.  But eventually I would be back in my brain thinking about things I hadn't thought about for years, and at a speed of processing that I have never experienced.",
  "I began to feel physically drained and like I was probably going to be sick.  I went upstairs to my room and laid in my bed.  I was higher than I have ever been in my entire life.  I laid down and pulled the covers over myself and closed my eyes.  The things I saw in my mind are completely indescribable.  I was looking at my psyche, and I was seeing the portions and compartments that constituted it. ",
  "As soon as I thought that I had compiled all of my mental processes into one big picture image, I zoomed out from what I previously had believed to be my psyche in it's entirety and realized that there was still more.  I did this process of consolidation and realization until I had a large ball visualized in my brain.  This ball was everything that is me: every thought, memory, emotion, every action, all contained in this ball.  I think I then began to fall asleep.  The ball moved farther and farther away in my visual field until there was nothing.  It was a mental silence like I have never felt.  I sat bolt upright and honestly became convinced that the silence I had just experienced was death.  I thought that I had almost died.",
  "I got up and went back downstairs. Sat down in front of the TV and never in my life have I wanted to be sober more than the next two hours.  I was high, coming down, and thankful for the fact that I wasn't still freaking out.",
  "The experience was way too intense for me.  I'm glad it happened, because it was eye opening, but I would definitely not like to be that high every time I smoke weed."
 ],
 "erowid": {
  "id": "83216",
  "citation": " r.zimp. \"Auditory and Visual Hallucinations: experience with Cannabis & Cannabis Resin (ID 83216)\". Erowid.org. Sep 20, 2011. erowid.org/exp/83216",
  "substance": "Cannabis & Cannabis Resin",
  "views": "6877"
 }
}
