{
 "title": "It Felt Like the Flu",
 "author": "deptstoremook",
 "citation": " deptstoremook. \"It Felt Like the Flu: experience with AMT (ID 18627)\". Erowid.org. Aug 5, 2005. erowid.org/exp/18627",
 "substance": "AMT",
 "bodyweight": "240 lb",
 "report": "<p>OK, so my friend got some AMT ( a gram).  I only took ~15 milligrams, even though he insisted that wasn't enough.  I figured better safe than sorry, but I will take more next time.  Just a note, I had to go home around 7:00 PM.  I was in a hectic environment until then, because like 4 other people were around.  Back at my house, I was pretty much the only person there all night.</p><p>*This was written -while- I was under the influence, although the influence was slim to none.</p><p>3:30: I go up to my friends room. He measures it off with a calculator (start @ 930 mg, divide 4 or 5 times, down to ~15). I take it.</p><p>3:30 Nothing</p><p>5:00 - 6:00 I feel sick, even though it's probably psychosomatic. Some candy helps me not feel nauseous, so it was probably not real.</p><p>7:00 - 8:00 Still a bit nauseous, but I feel detached. Not in a good way, but like in the way when I'm really tired or sick and everything runs past me. Also my head feels like someone jammed some screws into it. But it doesn't -hurt-. Just tight. I look at the mirror, and my pupils are about half-dilated, like I read</p><p>8:25 PM tickly feeling in the pit of my stomach, like when Im anxious.  Not all that interesting.  I want to talk to someone, but my friends are out, and Im in.</p><p>8:28 PM Ive come to the conclusion that Im feeling speedy right now.  This is primarily based on the fact that I feel like this sometimes.  I want to jump around and do stuff, but theres nothing to do.  No streamlined though processes or any sort of inspiration that Ive read comes with amphetamine use, so it must be psychosomatic as well. </p><p>9:34 PM Just got my first hallucinationjust like my friend said:  'You know how sometimes you wake up and you hear voices, and you answer them?'  I just got that.  I heard my mom on the answering machine (my parents are out of town)  but my sister verified it was in my mind.  It was exactly like that waking thing, if youve ever experienced it, its very strange.  I was hearing answering machine quality gibberish for a few moments, but nothing too interesting.</p><p>\tI must say that although this seems like a waking dream, I think a dose of ~25 MG would make for a very interesting-, not recreational trip.</p><p>\tI am in the opinion that I am in full possession of all of my facilities, and that I would not be detected by anyone, even those who knew me well, like my parents do.</p><p>\tAside from the aforementioned speedy effect, and the audio hallucination (which I think was an indirect effect of my friends communicated experience), I am feeling nothing out of the normal scope of human senses.</p><p>10:02 PM just realized I cant keep a firm track of mind, I cant concentrate.  Again the tired/sick feeling.  Interestingly enough, everything Ive experienced is within the scope of normal human activity.  Odd.</p><p>10:16 PM Jittery, and Im talking to some guy online about a computer problem.  Im happy.</p><p>10:38 PM I can handle myself extremely well in presence of people.  Feel sociable, I can talk better-, I think, and I point things out that my tired parents seem to miss, although I was overfriendly-</p><p>10:48 PM going to my room, my parents are home.  Finish this up tomorrow.  Ill keep writing</p><p>11:06 PM just kiddingspontaneity seems to be inherent.  Playing chess.</p><p>11:46 PM  1:43 AM  Attempted to get some sleep.  I closed my eyes, and noticed the normal visuals I get when my eyes were closed were different.  Opening my eyes and observing the dark room, things that werent there seemed to be swaying.</p><p>My thoughts were unorganized and went in circles.  I could only immediately remember about 3/5 of them.  I could barely force myself out of bed to get a MD player and this notebook. For some reason, I got up, got completely dressed, and went into our computer room.  I turned the computer on for 2 secs to see who was on AIM, and got a pen.  Then I shut down.  Why?  I dont know. I am experiencing strobe vision in my peripheral eyesights.  In otherwords, I see flickering. I am experiencing nausea, headache, malaise, passive state and I now have clammy hands.  This is most likely due to the low dose that I took, along with my sugar intake and tiredness.</p><p>9:56 AM After the aforementioned horrible night, I got up and ate a sandwich.  Nothing but the vague persistent nausea and headache.  Any visuals I had last night are gone.</p><p>In conclusion, it seemed more like a combination of being sick and just waking up, for ~18 hours.</p><p>I didn't have any insightful thoughts or appreciation for things.  Despite what has been said, I don't think I would enjoy doing this drug with many other people.</p>",
 "year": "2002",
 "id": "18627",
 "gender": "Male",
 "timestamp": "2005-08-05T07:00:00.000Z",
 "views": "7891",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(capsule)"
  }
 ]
}
