{
 "id": 18620,
 "title": "Methamphetamine and Benzodiazepines",
 "date": {
  "submission": "2005-07-05T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Overclocker",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Trazodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I think that a lot of meth users don't realize that they don't have to succumb to the urge to binge all the way till they exhaust themselves every time. An experienced stimulant users will tell you that the answer is to use it together with Benzodiazepines like Diazepam (Valium) or Alprazolam (Xanax) which are the most common ones, but I have found that Nimetazepam (Erimin) and Triazolam (Halcion) works the best even though are harder to get. One should always set a limit to how long a binge should last (e.g. 2 nights max) and when it's time to end, pop a benzo and enjoy the relaxing come-down and then go to sleep. You can even pop one in the middle of the binge if you start to feel overtly anxious or paranoid. It's the perfect antidote for meth jitteriness. And when you do go to sleep, it won't be for like 2 or 3 days, believe me. I usually sleep for 8 to 10 hrs after a binge. 12 to 13 hrs max. I have also found that taking lots of vitamin C and E before and after helps a lot with the recovery.",
  "I strongly advice against snorting meth. From my experience, the most enjoyable way to do meth is to smoke crystal. And make sure you use a bong or a device with a water chamber to filter all the junk if you wanna save your lungs. Snorting it screws up your nose and makes the crash a lot more unbearable cuz it seems to linger in your blood stream a lot longer. It seems that a lot of meth users aren't getting good clean stuff. I've been smoking crystal recreationally for a while now and haven't had any problems but I'm fortunate that the stuff I get is good quality. With good clean stuff, not only is the high awesome, it also lasts for a long time and the crash is barely noticeable.",
  "But still, I'd try not to touch the stuff unless I have some benzos cuz without them, it'd be hard to stop myself from smoking it till my body shuts off. That's the nature of meth. You just wanna keep going. You have to control yourself, and benzodiazepines are perfect to help limit one's usage. A human body simply cannot go on for 4 or 5 days without serious damage being done.",
  "Here's something cool that I experienced. I have found that when I take nimetezepam during or after using meth, I get a very pleasant high, kind of like an opiate high, whereas with the other tranquilizers, you just wind down and go to sleep.",
  "Anyway, meth is a drug that should only be enjoyed recreationally once in a while. And every so often, one needs to take a long break from it. If you find yourself needing it just to get through day to day activities, you're screwed. I admit that even though I do it once in a while, the mental craving is always there. After all, it IS one of the most addictive drugs. So if you ain't got the willpower or have other things in life that you enjoy more, stay away from it."
 ],
 "erowid": {
  "id": "9402",
  "citation": " Overclocker. \"Methamphetamine and Benzodiazepines: experience with Methamphetamine & Benzodiazepines (ID 9402)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9402",
  "substance": "Methamphetamine & Benzodiazepines",
  "views": "41925"
 }
}
