{
 "id": 18628,
 "title": "Scary",
 "date": {
  "submission": "2012-02-08T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "wackojacko",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "seeds"
   },
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 ],
 "report": [
  "We bought these after my friend tried them, we bought 50 as about 10 of us tried them all at once at my friends flat (big mistake). Firstly we made the flat really comfy, and calm and started to watch a film after ingesting the seeds. The effects started with me wanting to touch things, my pupils then became dilated and I needed to get up and walk around. After pacing up and down the corridor I came back into the room where everyone was. I don't remember the next half an hour, but I remember listening to music in a friends room. By this time everyone had come up. I found that I needed the be in a quiet place, which was dark and calm, firstly I tried the living room, where a friend was laid in silence. This was really pleasant for around 15mins until a lot of people entered the room.",
  "I then started to feel bad, I knew what I wanted (peace and quiet) but I couldn't have it. I ended up pacing the corridor again when a friend started having a panic attack, this made the trip get worse and worse, I felt like I was descending. I scrambled into my sober friends room and tried to calm myself down. I succeeded at first but then my friend who was having a panic attack entered the room, my friend was in tears and claimed to be finding it hard to breathe. I ran out the room and was sick several times, this helped my negative feelings and I entered back into the bed where I was laid after my friend who was panicking had left. I laid in the bed for what must have been two hours, after this I ventured back out and found that everything had calmed down and there were less people about.",
  "I ended up back at my room and began to chill out, I found it hard to sleep. I woke up in the night tripping sometimes. For the past two days I have found that my pupils dilate, and I loose my sense of balance, this scares me senseless. In the end I wish I had never taken these seeds, I will not be taking any drugs for a while now. Please heed this warning. I hope in a few days I feel the same as I did before the trip.",
  "Thanks, and stay safe."
 ],
 "erowid": {
  "id": "94060",
  "citation": " wackojacko. \"Scary: experience with H.B. Woodrose  (ID 94060)\". Erowid.org. Feb 8, 2012. erowid.org/exp/94060",
  "substance": "H.B. Woodrose ",
  "views": "1824"
 }
}
