{
 "id": 18636,
 "title": "Wonderful Accident",
 "date": {
  "submission": "2012-02-14T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "RedHeadTripper",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "70 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:15",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "3:00",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "4:30",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "[Erowid Note: 70 mgs of 2C-I is considered an extremely high dose, see 2C-I Dose Chart]",
  "I had once, before finding the hidden beauty of cannabis, been in love with psychedelics. I decided to buy 2c-i only 2 years before my first trip, but ended up losing it all to a thief. This time I kept it for myself, and bought 500mg to try out. I had spent many hours learning about other people experiences on the internet, and spent the whole summer getting used to cannabis, and finally understanding that there was a side of my mind I had never seen before.",
  "I measured out 20mg into a capsule, and planned to take it that night. This later turned out to be a waste of time, due to going out for breakfast, and a pizza buffet for lunch. By the time it was night time, I was full, and already moderately overweight (although 6'2'). I decided to make some Grape Kool-Aid, and mix in the 20mg from the capsule, and another 20mg from the little bag it came in. Anxiety built as I lifted the glass; my last psychedelic trip was with salvia, and I was fearing something similar. I bit the bullet and drank the Kool-Aid. All anxiety melted away. I felt like I had just accomplished something great. I then started to think, 'I've been eating all day, this won't be enough to work.' So i measure 10mg and put it in some more Kool-Aid, and drank it. Then I thought, that still was not enough. I measure out another 10mg and rubbed it into my gums, swished it around, and swallowed. Then, I did the same with another 10mg. I was feeling great, and it had only been 2-5 minutes since I drank the cocktail.",
  "T-0:30 All I had to keep myself occupied was my cannabis, laptop, and drawing on my wall from my art class. At this time (9:30pm), my parents were so drunk, they were not going to wake up from their sleep. I was on Facebook talking to about 5 friends that I knew who had tried MDMA, and a lot of cannabis, hoping for some sort of counseling on when I would feel the effects.",
  "T-1:15 I have been expecting the chemical to kick in throughout the whole hour, and am starting to get disappointed. I IM a few friends about this problem. One of my friends experienced with psychedelics tells me that I should start to notice simple patterns moving, or even the walls warping as if breathing, but I see nothing. She advises me to smoke some cannabis to coax the chemical along a bit. So I went outside, and had 3 bowls of some nice kush.",
  "T-2:00 The walls have been breathing for around 15 minutes by now, and the patterns have been moving along with them. I am excited due to my already creative mind. I am ready to see what this chemical has to offer. I feel the speedy mind set coming on strong, the endless smiles, and random giggling. I tell all my friends in my Facebook chat about my experiences and they join in on the conversation.",
  "T-3:00 I start to listen to Dubstep, as I am still coming up with a lot of momentum. The floor feels as if it is at level with my bed, the wood is moving in the same fashion as my walls with a liquid sort of pattern. The thick threads of my rug shape out individual paper figures rocking back and forth. Because I have nothing else to do, and nowhere else to go, I get very familiar with my room and the ways this chemical effects it. I decide to go out and smoke a few bowls in attempt to calm myself down a bit, just out of a passive fear of burning myself out.",
  "I grab a cold water bottle out of my fridge and begin to toke up outside in the warm summer night of California. The smoke makes me ponder what happens to particles as they float off into the sky. Then I notice my neighbor turning their lights on, and instantly I am filled with paranoia. Then all bad feeling disappear as I relax and take not of my wood fence bouncing up and down like Disney cartoons. Then all of a sudden, the knots in the wood spin around and create a realistic looking eye ball. I look at the texture of my house and it also has millions of eye balls staring right at me. Instead of any emotion taking over, I stop and think, 'Am I scared?' I verbally respond, 'They are some chill ass eyeballs' and I laugh at my comments as I go back inside. Now, as I lay on my bed, the walls are changing colors, but not through the whole spectrum. My red walls turn brown and orange, my slightly yellow/white door turns green and cyan.",
  "T-4:00 Now, I start to notice that my mind isnt all there. I am in a sort of 'observation only' mode, where emotional reaction is gone, and my eyes are just cameras, transmitting warped images of reality. I lay on my bed as my multi colored desk drawers bounce to the beat of my laptops half volume dubstep.",
  "T-4:30 I regain my conscious consciousness and continue to wander around my room, and look at all the art in my room. The outlines of the faces look like areas I had cut out, and the shading and texture felt like it was on another piece of paper about a foot behind. I get so interested in this, and want to think a little more about art as I smoke on another 3 bowls of kush outside. At this point, everything is moving, music is the only thing keeping me sane, and I can't care less. I feel like the only person in the world.",
  "T-5:00 I start to draw in a sketchpad with my array of pastels from school. I draw bizarre faces with just about every color possible. I feel like a professional. The art was not what we see as sober people as I was drawing though, it was 3D, and almost mentally interactive. Lighter colors felt as if they were on top, and coming out and off of the paper, and the darker colors felt further back to add depth. It was such an interesting concept as I looked at the pictures.",
  "T-6:00 As I start to run out of things to do, music to listen to, and people to talk to, I start to play around on youtube. The music videos were entertaining, but the computer screen felt like it could not be touched by my new powers in a sense. The screen was so man made, that this natural of a mindset could not adapt to the pictures displayed. I could only absorb what was happening. It was sort of a let down at that point.",
  "T-7:00 I am starting to have to go to the bathroom due to all the water I drank in order to keep my brain cells from burning out, and the new setting was terrific. The tiles spun into eyes again, and the mirror gave me a whole new look at living things. As I looked at my skin, my eye would pick one shade of color, and I could only pay attention to parts of my face with that shade. It was as if my mind could slowly piece together the segments of my being.",
  "T-7:30 I decide to try to go to sleep. I turn off my light, turn the fan on, and close my eyes, and BOOM. All I see with this new dark, closed eye visual pattern is the most realistic scene of a burnt face, staring right at me. In the background, more eyes, but at this point, I can no longer just accept the eyes as a hallucination. I try again to sleep, and THERE HE IS AGAIN. I decide to just stay awake in bed for the rest of the night. This really killed the fun I had from earlier on in the nigh.",
  "T-9:00 My family is waking up, the walls are still, very very slowly moving, and I am beyond tired. I make sure to eat breakfast, shower and drink water, because I have to work (lifeguarding in the BRIGHT sun) for 5 hours later.",
  "All together, I feel like this chemical was a perfect fit for my personality, yet, the timing could have been better, the dosage should have been determined more responsibly, and I really should have waited to have more activities to do. It was still the greatest thing I had ever done before, and now that I have an Xbox, and friends, I think its time for round two.",
  "PEACE :)"
 ],
 "erowid": {
  "id": "94090",
  "citation": " RedHeadTripper. \"Wonderful Accident: experience with 2C-I (ID 94090)\". Erowid.org. Feb 14, 2012. erowid.org/exp/94090",
  "substance": "2C-I",
  "views": "1530"
 }
}
