{
 "id": 18630,
 "title": "Vaped Antidepressant Magic",
 "date": {
  "submission": "2012-03-21T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "IpsoFacto",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "0:10",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0:15",
   "administration": "smoked",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "0:15",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "0:45",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "0:45",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I have tried methoxetamine before both insufflated and sublingual.  Recently I read on a forum people discussing smoking or vaporizing methoxetamine and thought Id give that a try.",
  "0:00:  I put a small dose, probably around 10-12 mg into an oil burner, and gently heated it until it began to smoke, then deeply inhaled.  The smoke is not unpleasant tasting and I was able to keep each fairly large hit in for around 20 seconds.  Almost right away I felt something, a sort of stoning feeling combined with body warmth and a mild euphoria.  In a strange way it was slightly like DMT or MET in terms of the rapidity of onset and the transition from normalcy to strangeness, though not nearly as intense and with none of the potential fear or urgency.",
  "0:10 I smoked some cannabis  I tend to do that whenever I use almost any substance and I know from experience that cannabis and methoxetamine synergize well. I relaxed and experienced some closed eye visuals, though nothing as profound or interesting as I had experienced from sublingual or insufflated doses. ",
  "0:15 So I put in another 10 mg or so and vaped that as well, and put another 10 mg up my nose for good measure.  After a while I lay down in a dark room and experienced insightful introspective dissociation with some mild visuals.  I have difficulty remembering my exact experiences on methoxetamine as it seems to induce amnesia.  I just remember getting dissociation as my mind separate from my body and I as I perceived interesting visual textual effects with my eyes closed.",
  "0:45: I was supposed to hang out and watch TV with my partner.  So I did another 10 mg vaped dose (2 more hits) and then smoked some cannabis with her.  My motor coordination was pretty bad by this point and I was staggering around like I had drunk a sixpack of beer. My mental state was positive and relaxed, though I was a bit overwhelmed by the profound amount of disorientation I was experiencing.",
  "1:00-1:30: I lay on the couch and we watched Colbert.  I would estimate I was able to follow along with about 60% of the show, while the rest of the time my mind was drifting freely. The most noticeable effect during this period was double vision.  There were unmistakably two Colberts on the screen the entire time.  And two of his guests as well.  The double vision only occurred when I stared at the TV screen, as the rest of the room look fairly normal.",
  "1:45: With a concerted amount of effort I was able to brush my teeth and get ready for sleep. I was quite careful not to stumble on my way to the bedroom and felt relieved to make it safely to the bed. I lay down, put the blankets over my face and fell into a profound state of introspection and dissociation. I cannot tell how long it lasted as this stage transitioned at some point directly into sleep. ",
  "I woke up the next day with a sore throat (though this may be a cold, my family all have one) but other than that I felt like A MILLION BUCKS.  My inner confidence and optimism felt as high as I can remember in months.  I have been suffering from some kind of mood disorder in the last year or so and have been self-medicating with lots of different illegal, legal, and grey market substances.  Waking up this morning I felt completely undrugged and as positive, happy, confident, and secure in my mental health as I ever do.  I have absolutely no desire to take any psychoactive substances besides my normal morning cup of coffee.",
  "For me, methoxetamines anti-depressant effects are nothing short of astounding.  I dont know how long this residual effect will last, but it is powerful!  And the vaped/smoking option is an excellent ROA for this compound: good euphoria, zero fear, and the ability to sleep without much difficulty soon after."
 ],
 "erowid": {
  "id": "94063",
  "citation": " IpsoFacto. \"Vaped Antidepressant Magic: experience with Methoxetamine & Cannabis (ID 94063)\". Erowid.org. Mar 21, 2012. erowid.org/exp/94063",
  "substance": "Methoxetamine & Cannabis",
  "views": "4684"
 }
}
