{
 "id": 18648,
 "title": "Nitrous as Eternity",
 "date": {
  "submission": "2012-04-11T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SkiBum",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:05",
   "administration": "inhaled",
   "substance": "Nitrous Oxide"
  }
 ],
 "report": [
  "After a fairly long hiatus (almost 10 years since my last experience) I had the urge to experiment with nitrous again as I remember having some incredibly profound experiences during my previous encounters. First, I feel the need to refer you to another experience as described here:",
  "http://www.erowid.org/experiences/exp.php?ID=36803",
  "This is the post I found the day after experiencing perhaps the most intense connection with what some could call god. I started with a small amount of cannabis, possibly as small as amount as a tenth of a gram or perhaps less. I find it a good catalyst for the experience.",
  "I then proceeded with some breathing exercises I had learned through my brief experience with Yoga. Just some deep breathing and then the breath of fire (more or less similar to hyperventilation). When I felt ready I took a dose of nitrous using a Soda Siphon loaded with a cream charger.",
  "Previously this has always precluded a type of struggle with my mind. My mind would sense an idea and run with it, or run circles around it. This time however after holding my breath for a few seconds I exhaled to the point where my diaphragm was completely relaxed, the point between inhaling and exhaling; a Lagrangian respiration point if you can pardon the analogy. As I settled into this space I slowly realized that I had nothing to fear, I let ideation just pass over me like water over a rock lying in a stream bed and slowly started to experience the most amazing sense of connectedness and 'I' ceased to exist. I do not know how long I maintained this breathlessness; I simply cannot say, but it was an eternity.",
  "I had made contact with another intelligence, of this I have no doubt. I made contact with the Other. Whether this being is simply a part of myself more in touch with a cosmic flow I had not had the chance to experience or something entirely alien I cannot say and it is really not important. What is important is that it was completely benign and positive and it was trying to tell me something very clearly. Due to my own lack of intelligence or this beings supreme intelligence I was only able to take back the general feeling of the conversation. I also feel that this powerful benign intelligence somehow rubbed off on me in some way that I cannot readily describe. One sentence made it through clear as the finest crystal, almost like a mantra: Nitrous is Eternity. Hence my link to the post above. I suppose Nitrous can be described as a type of death.",
  "I came out of the trance or experience repeating the semtence, 'Oh my God', over and over. My sense of time was so warped that the sentence initially seemed to stretch over a period of minutes if not hours. My voice was absolutely deep sounding and distorted. I continued my breathing exercises basking in the glow of an experience so profoundly religious... and I am, or perhaps was, an avowed atheist.  ",
  "This drug is incredibly powerful, almost a sacrament, but should not be abused. We are simply not meant to exist in that space, unless I suppose you have earned it in some way. Nitrous is too easy a short cut and after experiencing what I did I can see why someone would want to lock themselves in a room and chase that feeling of being present in the light of god. Enlightenment is simply not that easy and doing so can only lead to disaster.",
  "In the end though I come back to an idea that Terrence McKenna has written about extensively... that some of these substances are portals to other worlds and are a means of communicating with intelligences other than our own. I simply wish there was a way to share that experience of absolute connection with everyone. As I am an ordained Pastafarian minister I may have perhaps found the perfect 'sacrament'. Makes me wonder."
 ],
 "erowid": {
  "id": "94167",
  "citation": " SkiBum. \"Nitrous as Eternity: experience with Nitrous and Cannabis (ID 94167)\". Erowid.org. Apr 11, 2012. erowid.org/exp/94167",
  "substance": "Nitrous and Cannabis",
  "views": "1921"
 }
}
