{
 "id": 18649,
 "title": "Quite Synergistic Subcutaneous Experiment",
 "date": {
  "submission": "2001-09-13T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mr. Hazlitt",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.2 mg",
   "administration": "IM",
   "substance": "2C-I"
  },
  {
   "time": "0",
   "administration": "2.5 ml",
   "substance": "oral"
  },
  {
   "time": "1,4-Butanediol",
   "amount": "(liquid)"
  }
 ],
 "report": [
  "Saturday night my collective was having a really large party in which each room serves a different mixed drink in sync. with their theme.  However, as I don't drink alcohol my room was left wondering what to serve.  My roommate was into redbull and vodka, and I psychedelic trance music, so we cleared the room and made it a psy-trance room.",
  "That night I considered sobriety, however, two hip females I agreed to do 2C-I with were holding me to my end of the bargain.  So at the beginning of the night 10:00 pm ish, 25.3 mg of 2C-I hydrochloride was dissolved in 2.10 mL deionized water and divided equally between three insulin syringes.  Wary of giving them too much I said we should all do half of our amount and take more if nessasary, a move I would relish later.  So we each injected half of our portion of 2-CI, 4.2 mgs, and waited.  I injected mine under the skin on my hip.  2C-I stings a bit, but it hurts much less than nasal administration of any 2C compound.",
  "  After five minutes it was clear we were soon tripping.  After 20 we'd reached a stable peak that felt like a mixture of 2C-B and LSD.  Given my hardheadedness towards the 2C's I was tripping, and my lady friends were REALLY tripping.  Although that worked out for the best because I intended to be social and not introspective that night.  So as the party got hopping I mainly walked around and socialized with friends getting drunk.  The combination of my tripping with their drunkness might have caused friction so I decided to take a light dose of 1,4-Butanediol.",
  "So I retired to my room for a moment and drank 1/4 of a red bull with 2.5 mL 1,4BDO dissolved in it.  Soon i was cool and smooth and ready to really party.  An hour of nice socialization flowed and soon it would be my room's chance to host some drunk people.  My roommate setup the room for dancing, spun psy-trance (infected mushroom rocks), and served red-bull vodka.  Soon after, it was time for the party to move on but I put on Kox Box, the Great Unknown (obsure psy-trance), and the sexy funny trance kept a good 15 people in my room.  So we danced and danced making new friends all night.  Then X-dream radio (more obsure psy-trance), getting down and funky.  I danced harder that night than in months of other parties so I chalked up 2C-I as a 'good entheogen'. ",
  "The only possible caution brought up was that at about T + 7 hours some sober person looked at my arms and asked what the matter was.  I looked at them and I swear to god they were absolutely Ashen.  And my veins were really dark.  So I wondered if I got some kind of fast moving bacterial infection or poison, I checked the injection site near my hip, it was fine, I felt fine.  I chalked it up to a unfit white male dancing all night, and sure enough, the next day I was fine.  So idiosyncratic reaction?  I guess so.",
  "Thanks for reading,",
  "alpha"
 ],
 "erowid": {
  "id": "9417",
  "citation": " Mr. Hazlitt. \"Quite Synergistic Subcutaneous Experiment: experience with 2C-I (SC) & 1,4 Butanediol (ID 9417)\". Erowid.org. Sep 13, 2001. erowid.org/exp/9417",
  "substance": "2C-I (SC) & 1,4 Butanediol",
  "views": "15180"
 }
}
