{
 "id": 18644,
 "title": "The Best of Both Worlds",
 "date": {
  "submission": "2013-02-22T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "psilocybophile",
  "gender": "Female",
  "weight": "51 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "6-APB"
  },
  {
   "time": " T+ 2:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "6-APB"
  },
  {
   "time": " T+ 3:38",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine "
  },
  {
   "time": " T+ 3:42",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 3:42",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 3:42",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Methoxetamine "
  },
  {
   "time": " T+ 11:00",
   "administration": "",
   "substance": "Etizolam"
  }
 ],
 "report": [
  "<p>Setting and mindset: at home, having prepared throughout the morning for the experience (had a small lie-in, gently psyched myself up for it). Living room equipped with new laser theatre, many cushions and soft things, music, selection of cartoons and Bob Ross shows, and xmas tree. I was unsure exactly what kind of effects to expect (i.e. how trippy or how buzzy) so I attempted to prepare for each eventuality. Boyfriend (28, 62kg) dosed same amount. He has a bit less experience than me.",
  "13.00: Took 2 Stugeron (anti-travel sickness) pills and ate some chicken and vegetable curry with potato and coleslaw (not a massive meal), boyfriend had tuna, bread and a big pile of broccoli and peas. Both also had white tea to kick start metabolism.",
  "14.55: Dosed 100mg each.",
  "16.55: Coming up noticeably, like an MDMA comeup but much smoother and longer. Warm, a bit of dry mouth, body load. No nausea as described in other reports, probably due to the anti-travel sickness pills. Boyfriend not coming up so much but has lower metabolism. Both dosed another 50mg each.",
  "17.43: We both feel like we have come up as much as we will, though smoking cigarettes improves the high. Music appreciation heightened, talkative and empathetic, fairly lucid.",
  "18.33: Have each had three keys of MXE (approximately 5mg each key), very talkative. Note that this would probably work very well with 5-apb as that gives the drive and energy while this gives more empathy and euphoria. Decide to try smoking some weed.",
  "18.47: Tripping much more due to the weed. Pretty intense visuals, now feels more like LSD than MDMA, although those effects still apparent.",
  "From this point onwards we dose in cycles  a key of MXE and then some weed (approximately 5 tokes of a moderate joint for me, 1 or 2 for boyfriend) brings us up to peak level of both MDMA and LSD like effects for approximately 45 minutes to an hour. This cycle interrupted at approximately 8.30 by visitors for around 2 hours. Stopped at approximately 4am, having calmed down with a few more joints and an Etizolam.",
  "6-apb was far trippier than expected, although much of this effect was probably down to the MXE/weed combination. Boyfriend experienced more mental/emotional than visual hallucinations, got himself stuck in logic loops frequently. Personally I found it to have many of the best qualities of MDMA and LSD without some of the qualities I dont enjoy, such as anxiety while coming up. Jaw clenching was however almost as bad as with MDMA. I found it a little difficult to get comfortable at times, even with all the cushions. Tripping was not so organic as with LSD, and once each dose of MXE/weed was wearing off it was a little too easy to lapse back into reality. Higher doses of MXE and vaporised weed might be a solution. The timings of the doses for 6-apb appeared to be spot on, and we may take more next time. We intend to combine it with some 5-apb in a club setting, along with some MXE, and expect this to produce an experience a little less trippy and more MDMA like.",
  "After first sleep, we both very drained and were still tripping slightly. I am experiencing a slight pleasant afterglow and my boyfriend is little anxious because of the mental/emotional tripping and where it has left him. After second, proper, sleep (around 11 hours) I am feeling absolutely fine, if a little slower than usual mentally, boyfriend still anxious but possibly more because of his thoughts than any chemical after effects. In sum, no MDMA like comedown to speak of.</p>"
 ],
 "erowid": {
  "id": "94135",
  "citation": " psilocybophile. \"The Best of Both Worlds: experience with 6-APB, Methoxetamine & Cannabis (ID 94135)\". Erowid.org. Feb 22, 2013. erowid.org/exp/94135",
  "substance": "6-APB, Methoxetamine & Cannabis",
  "views": "1369"
 }
}
