{
 "title": "That Little E Pill",
 "author": "Josh",
 "citation": " Josh. \"That Little E Pill: experience with Ecstasy, Cannabis & Fluoxetine (ID 18649)\". Erowid.org. Nov 5, 2002. erowid.org/exp/18649",
 "substance": "Ecstasy, Cannabis & Fluoxetine",
 "bodyweight": "155 lb",
 "header": [
  "DOSE: T+ 0:00",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 0:45",
  "9 hits",
  "smoked",
  "Cannabis",
  "(flowers)",
  " T+ 3:00",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 12:00",
  "40 mg",
  "oral",
  "Pharms - Fluoxetine",
  "(pill / tablet)"
 ],
 "report": "<p>Just last week I decided to try ecstasy.  It wasn't a hard decision, but it still took me a couple of minutes to overcome the butterflies before swallowing that little E pill.  I of course, have done other 'drugs' prior...(marijuana, cocaine, various perscription pills)...and I was just looking for that 'better' high.  I started to feel the effects in 30 minutes, after I finished a glass of orange juice. (A friend had told me that Vitimin C helps with your trip.) My head felt wierd, but at the same time I just relaxed and let the drug overcome me.  The peak hit quickly and in no time I was rolling. I loved the feeling. About 10 minutes in to the peak, my friends and I decided to smoke some pot.  I took about 8 to 10 hits total off my bong, and I was really feeling high. We just sat there talking with each other, self-obsorbed and interested in everthing that was said.  I</p><p> noticed that as the E was wearing off (3 hours later), I slowly grew pissed off, wanting to feel the full peak again.  So, I chewed up half of another ecstasy pill. (It was all that was left, I would have taken a whole one if I could've.) My high got better, but I didn't peak again. I drove just fine that night (with the music really high - ditto on the bass), and when I got back home, my girlfriend and I decided to have sex. It was okay, I've always heard sex on E is the best, but I could not really tell. My orgasm wasn't better either, in fact the feeling was delayed by a couple of seconds.  Then, after all was said and done, I took her home and returned back.  When I climbed into bed I felt the effects barely, and only while laying down. I tossed and turned the whole night, not able to get any peaceful sleep. In the morning, I took two 20mg pills of prozac and went to school. I felt fine the whole day and to this day I don't regret taking it.  The crash wasn't all that bad since I was high on pot and the restless sleep wasn't nothing compared to the really great high that little E pill gave me...and there was no hangover thanks to the prozac!</p>",
 "year": "2002",
 "id": "18649",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-11-05T08:00:00.000Z",
 "views": "29662",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:45",
   "amount": "9 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(flowers)"
  },
  "2": {
   "time": " T+ 3:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 12:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(pill / tablet)"
  }
 }
}
