{
 "id": 18647,
 "title": "Unity of Conciousness (Dissolution?)",
 "date": {
  "submission": "2004-09-09T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hagbard",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "carts.",
    "quantity": "4"
   },
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  }
 ],
 "report": [
  "Usually I only did 3 whippets, with standard results:  Lots of auditory distortion, kind of a metallic whooshing crackling sound, visual blurs, tingling in nose, etc.  We decided to try 4 whippets this time (we crack them into a garbage bag and inhale from there).  Also, I tried something new.  Instead of just huffing the contents, I cupped the bag around my nose and mouth and just started talking to the group as if nothing was different.  The ascent was much slower and I could watch what was going on.  I started to get the tingling and the ringing, but I noticed that I was also losing more and more of my self. ",
  "It gradually progressed until my thoughts stopped altogether on the word I was last thinking, and that word expanded in what it means to me (i.e. the word green means a color, of a certain wavelenght of light), to mean everything.  Then there wasn't even that word.  I wasn't me, I wasn't anyone.  The Universe made sense because I was IT.  But I (or IT) wasn't really conscious, it just WAS.  Slowly, I started to return.  It felt like my consciousness was contracting from encompassing the entire universe, gradually into just me.  As I started to become human and linguistic again, the word that I left on came back, and it slowly lost its status as meaning everything and it was left with just it's original meaning, and I gradually started thinking again.  It ruled, but I never had quite that good an experience again, even with 5 whippets."
 ],
 "erowid": {
  "id": "9416",
  "citation": " Hagbard. \"Unity of Conciousness (Dissolution?): experience with Nitrous Oxide (ID 9416)\". Erowid.org. Sep 9, 2004. erowid.org/exp/9416",
  "substance": "Nitrous Oxide",
  "views": "12410"
 }
}
