{
 "title": "A Rip Snortin' Rough Ride",
 "author": "Trey",
 "citation": " Trey. \"A Rip Snortin' Rough Ride: experience with DPT (ID 1865)\". Erowid.org. Jun 15, 2000. erowid.org/exp/1865",
 "substance": "DPT",
 "bodyweight": "",
 "report": "<p>After an extremely powerful experience smoking DPT freebase, I recently decided to experiment with an alternative route of ingesting this novel material. My patron had also provided me with some of the hydrochloride salt, and I chose to try insufflation this time. I had inadvertently taken considerably too much of the material when I had experimented with smoking it, so I decided to be more cautious this time, laying out only 100 milligrams of the fine white powder in two short lines even though I had been encouraged to try 150.</p><p>After grounding and centering myself by meditating for a while, I rolled up a crisp new twenty dollar bill and inhaled 50 milligrams up each nostril. Thankfully there was no burn to speak of, although as the material hit the back of my throat I experienced some extremely medicine-y tasting postnasal drip. I cleared my palate with a sip of a beverage I had standing at the ready for this purpose and lay down upon my bed to await the onset of effects.</p><p>There was a latency period of about five minutes or so, after which I felt a warm, glowing ball of energy begin to form around my genital area, which became highly sensitized. This felt extremely pleasant and very erotic. Over the next several minutes, I felt the energy travel up my spine like an electrical current. Eventually it seemed to terminate at a center in my head, and when it did so, I started to experience the full visionary effects of DPT. High resolution, brilliantly-colored images were seemingly downloaded at a frantic pace into my sensorium. The content of the visions was hard to keep up with, as the transmission seemed somewhat choppy, but there was an overall futuristic, science-fiction like theme to them. I saw outlandish images of non-human, bizarre creatures and strange, apparently alien landscapes projected onto the insides of my eyelids. Unlike my DMT experiences, there was no urgent sense of presence attached to these visions; I was definitely an observer rather than a participant in what I was seeing.</p><p>I found it rather hard to stay focused on the visionary content of the experience, however, because of some rather distressing physical effects that began to manifest at about the same time. As soon as the energy traveling up my spinal cord reached my head I began experiencing bodily shivering, which soon gave way to very forceful shakes and began to approach the level of full-out convulsions. My limbs were flailing about and my body was jerking around uncontrollably all over my bed. I tried as hard as I could to breathe through it and relax into whatever was going on, but I was pretty scared by this, and couldn't escape the feeling that I may have put myself in danger of serious physical harm. My breathing became rapid and shallow, my head was whipping back and forth from side to side, and I held on for dear life, hoping that it would pass quickly.</p><p>At about the forty-minute point, the convulsions gratefully subsided, and the visual effects also began to diminish in intensity. By the hour point things had tapered down into a very euphoric afterglow, with no real visions to speak of, just a nice, warm, opened-up empathogenic buzz. This was nearly identical to the after phase I had experienced when smoking the freebase, and lasted for the next three hours or so.</p><p>While I feel grateful to have had the opportunity to work with this rare and novel compound, I would be very hesitant to explore it further due to the extremely distressing nature of the physical side effects that I encountered during this experiment. The convulsions that I experienced were sufficiently strong to make it nearly impossible to make constructive use of the visionary state that DPT made available to me, not to mention pretty terrifying as well. I would advise a high degree of caution when working with DPT, and strongly recommend having a sitter present should these physical effects happen to manifest. In my own final analysis, however, there are plenty of other materials out there that open up similar enough spaces without these distracting somatic symptoms to leave me relatively uninterested in pursuing this avenue of exploration any further.</p>",
 "year": "1999",
 "id": "1865",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-15T07:00:00.000Z",
 "views": "33997",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(freebase)"
  }
 }
}
