{
 "id": 18652,
 "title": "Spinning Wild",
 "date": {
  "submission": "2012-03-01T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Neveragain",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I am a 19 year old male, with experience in mdma, mushrooms, cocaine, amphetamines, 2c-e, 2c-b, dmt, lsd, ketamine, spice products, marijuana, and various pills.",
  "Onto the story. I picked up a 500 milligram vial of 'bath salts'. Brand name 'Eight Ballz'.",
  "I had to visit my mom, so i decided i would test out this new substance while in her town. I got to her house, settled down, and decided to go with a walk. Went to a park and settled down behind some trees, making sure nobody would see. I dumped out a very large line, as i later found out in later experiences. Not sure how much mdpv was actually in this particular blend, but I cut it out and insufflated it. \r[Erowid Note: For substances active at such a small dose, eyeballing is particularly unwise. See related article]",
  "Very little burn, and within 30 seconds, felt a rushing, 1.5-3 minutes into my adventure, felt as if I had insufflated the largest dose of cocaine in my entire life. I walked around, experiencing one of the greatest euphorias of my life. Easily cutting out oxycodone. Possibly a tiny bit more euphoric than MDMA, but far too speedy, (in my opinion). I progressively felt as if I had poisoned myself.",
  "This soon progressed to extreme nausea, leading to me dry heaving in the middle of the street. Shortly after drinking a small amount of water (drinking or eating anything is extremely unpleasant on MDPV, I have found.) Soon after this episode, I calmed down enough for the euphoria to shine brightly again. I was singing in the streets to my music playing, talked to a friend on the phone about how amazing I felt, and visited an old girlfriend. Attempted sexual relations, but heart was racing far too fast, and I knew it would be extrememly dangerous, so I decided on returning home.",
  "Fortunately my mother was asleep, so I slipped into my room quietly and attempted sleep. T+3.5 hours.",
  "As time went on, the euphoria dissipated and left me feeling empty and depressed. Eyes unable to close for more than 3 seconds top. So I laid in my bed, hating my life, unable to sleep until approximately T+10.5 hours. A horrific price to pay for astounding euphoria and joy. Would need alprazolam or diazepam to attempt again in an effort to sleep if I were to try again. I do not believe it is a good idea.",
  "I'm going to stay away from this substance, as future adventures left me fiending for days, giving in multiple times and staying up for 2 days, combining this with marijuana, cigarettes, MDMA, and alcohol. Should have researched more, but I had an invincibility complex at the time. I research on just about everything else online. Safety first people! Do not attempt to experience anything like this as I believe I should have been in the hospital or taking anxiolitics.",
  "Anyways, just thought I would share with and warn people of my experience. Safe tripping! "
 ],
 "erowid": {
  "id": "94176",
  "citation": " Neveragain. \"Spinning Wild: experience with MDPV (Bath Salts) (ID 94176)\". Erowid.org. Mar 1, 2012. erowid.org/exp/94176",
  "substance": "MDPV (Bath Salts)",
  "views": "22855"
 }
}
