{
 "title": "Enhances Concentration, Yet an Inconvenience",
 "author": "Dilantin",
 "citation": " Dilantin. \"Enhances Concentration, Yet an Inconvenience: experience with Phenytoin (ID 18668)\". Erowid.org. Nov 6, 2002. erowid.org/exp/18668",
 "substance": "Phenytoin",
 "bodyweight": "",
 "report": "<p>After having a seizure, I was prescribed this very popular seizure/epilepsy suppressant. Although it was probably not completely necessary since an EEG showed that I was not an epileptic, I was instructed to continue to use the drug for about 6 months.</p><p>I'm a college student and noticed an immediate effect the drug had while I studied.  I noticed a much greater ability to concentrate on even the most mundane subjects as I found myself being able to study and do homework for 6+ hour stretches at a time without a break or day dreaming. I did great that semester, and I can't deny that Dilantin didn't play a role in that.</p><p>But there's plenty of side effects to this drug that made me glad to be off of it. These included:</p><p>Sensitive gums; An abnormal amount of bleeding from the gums while brushing my teeth</p><p>Increased sensitivity to sunlight; I live in the US midwest and had to wear sunscreen during December.</p><p>Doesn't mix well with alcohol; This was probably the worst side effect for me.  If I wanted to drink, I had to stop taking the drug several days in advance if I wanted to avoid the nausea.</p><p>At least these are the side effects that I experienced that my doctor said were very likely linked to the drug. I also feel I should add that another side effect that _I_ feel is connected to taking the drug is having experienced an overall 'blah' feeling.  It's kind of hard to describe, but life in general just seemed to be duller while I was on Dilantin. Additionally, I write and perform music and it seemed that my creativity took a noticeable hit during this time. I can't, however, necessarily say for sure that this is all connected to the drug.. there were a lot of other things going on around that time as well.</p><p>In short, if you're a college student and want to take this.. I'd recommend just taking it during finals week.  In my opinion, this drugs' side effects are too inconvenient to use as a 'smart drug' on anything more than a very temporary basis.</p>",
 "year": "2001",
 "id": "18668",
 "gender": "Male",
 "timestamp": "2002-11-06T08:00:00.000Z",
 "views": "10957",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Phenytoin"
  }
 ]
}
