{
 "title": "DPT and Dream Trip",
 "author": "Brahman",
 "citation": " Brahman. \"DPT and Dream Trip: experience with DPT (ID 1866)\". Erowid.org. Jun 15, 2000. erowid.org/exp/1866",
 "substance": "DPT",
 "bodyweight": "",
 "report": "<p>DURATION: 9 pm - 12:30 am\rSet: Seized w/ the sudden urge to zoom. about ten minutes between decision and implementation. Had been mulling around the idea vaguely earlier, as spring had officially arrived, I had obtained some of the necessary material, and I had not taken a tryptamine since burning man (actually, this is a lie. I have sampled DPT twice, in barely-threshold doses, and smoked 5-MeO-DMT on one occasion. still, no 'full-on' tryptamine use since burning man. as tryptamines, specifically psilocybin, are my favorite compound class and compounds, I was eager to rectify this)\rSetting: Our warehouse apartment.</p><p>I took a mirror and 'ice scraper' and prepared the powder for inhalation, taking it in two lines to the left nostril. I sat in front of the computer for a moment, feeling the sting as the powder settled into place. I set myself to idle on IRC and beat a quick retreat to my room, where I lit candles on my altar and performed a quick centering exercise. I decided then to do the Lesser Banishing Ritual of the Pentagram, to clear the space for the experience to come. I realized as I began it that I should probably have done it *before* plugging a nostril w/ powder, as the vibrations of the names were coming out w/ less force and conviction than I would have wished and the drip beginning was rather unpleasent. nonetheless, I completed the ritual and sat in meditation, marking down my starting time and some opening notes.</p><p>Well, I sat in meditation for about 5 minutes, if that, sniffling and twitching as the DPT began to take effect. I became increasingly restless, and left my circle to go wander in my apartment, settling in one place, then another, putting on music, turning it off, typing the occasional message to people on IRC, and pacing a bit more. The DPT was definately taking effect, but the coming up process was a wee bit rough...I was extremely cold, I was trembling for other reasons than just the cold, and my nostril was numb and irritated at the same time. Drinking water had a strange, numb feeling to it. I endured for awhile, and became increasingly confused as I started to ramp up. at some point I went from the front of the space where the glass brick window are back to the computer and discovered that I was having great difficulty typing. I took that as my cue to retreat back into my room.</p><p>I lay down under the blankets and put on music (an album called Sunyata, by Vas. excellent stuff for the occasion). I began breathing and reminding myself to flow w/ the experience. I had *not* been having a good time up to this point, or rather the enjoyable effects were being outweighed by the nasal drip, the confusion and the heavy bodyload. As I warmed up and entered a trance state, I became much more comfortable. I became acutely aware of the pentagrams I had drawn earlier, and their presence comforted me...I was rapidly peaking.</p><p>This material is a strong ego-destroyer...I felt my mundane self slip away in shreds and tatters, as I accelerated into a trance-state in which I was only aware of my body as a mass of prickling and flowing energy, w/ the spiky, baroque character that is a hallmark of the tryptamines for me. As 'I' regained some sort of equilibrium, I found a 'thread'. I don't know quite how else to decribe this, but it is something that is not uncommon for me, even in deep meditation...it's like something is pulling me, from a specific direction outside of me. this one began below and to the left, in relationship to my prone form. I began reeling in this thread, following it to where it led. it spiralled and twisted back on itself, and eventually it seemed that I had lost it..but I was wrong. It lead me to a space full of the most fantasic Beasts I had ever seen, like gigantic faberge slugs w/ tentacles riding the crest of a dyed-agate sea w/ gorgeous non-euclidean cliffs of sparkling jewels.</p><p>I saw a vision of myself in a circle, around a campfire, with several other warriors with angular faces and paint of green and black on their faces. We were trippin' *hard* and playing drums and rattles, w/ huge grins on our faces. I had a sense that one face of the tryptamine entity which had existed since the dawn of time is the face of the Warrior, who is a guide to right living and an inexhaustible source of strength. That this face was as ancient and as wise as the Living Mother of Earth face which I was familiar w/ from mushroom excursions...merely to have survived this experience was a source of a great upwelling of joy in me.</p><p>I took a shower, reveling in the sensation of cleanliness and rebirth. I was still flying high when I got out and returned to the computer to take some notes and tell some people that I was doin okay. Eventually, I returned to a more reasonable semblance of 'baseline', around 11:00 pm. I was down to baseline proper by 12:30.</p><p>All in all, a joyous and life-affirming zoom, one that put me triumphantly back in touch w/ an important root of my spiritual practice. *But*, by itself, it isn't the kind of thing that I would post...what is still amazing me is what happened the next day.\rThe Dream: I was in a wonderful mood, having landed a job that looks like it will be just what I need to move into the next phase of my life. I spent several hours upon returning from the interview chatting w/ IRC folks (a popular pastime for me...I'm an unrepentent IRC addict) and eventually settled down to read a real, paper book on my couch. I had woken up for business hours on a monday morning, unusual for me, and found myself drifting off to sleep...</p><p>I dreamed that I was living in our warehouse apartment, maybe three years from now. It was substantially different than it is now (I should note that many of my dreams are of the 'it's like the warehouse, except different' variety, these days), w/ many more people living in it and decorations I can only describe as blade-runneresque. Most of the early dream involved a large party we were hosting...but after the guests left, I climbed up on my top bunk (I actually sleep on a futon on the floor, but like I said, this was different) and, filling a syringe w/ DPT, injected it into my thigh and lay down.</p><p>Immediately the drug hit me, sending a carrier wave through my entire body and bringing a tremendous blast of flanging, spiky-baroque, distinctly tryptamine energy. I felt rocketed out of my form, down a tunnel, and peaked out in an ego-shattering burst of rainbow light. I was in a vast, formless space, and the flanging sounds resolved themselves into a voice that sounded like someone whispering through a vocoder. The voice asked me a couple of questions and told me a thing or two (I get the impression I'm not supposed to go around saying what, so I won't) and began to fade as I came back into my body...and discovered, much to my suprise, that I was napping on my couch. now, this was one of the most intense psychedelic/tryptamine experiences of my life. Brought on by a dream.</p><p>The mind is an incredibly powerful thing, ladies and gentlemen.</p>",
 "year": "1998",
 "id": "1866",
 "gender": "Male",
 "timestamp": "2000-06-15T07:00:00.000Z",
 "views": "25034",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 }
}
