{
 "id": 18676,
 "title": "Therapeutic Potential",
 "date": {
  "submission": "2012-01-29T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nadja",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 mg",
   "administration": "insufflated",
   "substance": "2C-T-2",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "4 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I took a dose of roughly 12 mg of 2C-T-2 just after 1 in the morning (2/3 insufflated, 1/3 orally). I had not previously intended on taking it at this time; however, as I had just started taking my adderall 20/XR again the previous morning, I realized that sleep was not going to occur that night anyway and decided that the time was right. It was definitely the most painful thing I have ever snorted, I would not do it again, and I would not recommend insulation to anyone else interested in trying this substance. The pain became more and more excruciating over a period of around 10 minutes, around which time, it began to dissipate.",
  "Because the dose that I administered was low, it took me around two hours to start feeling the full effects, though things did seem strange, as they often do with psychedelics, shortly after I had taken the dose. Furthermore, the pain from the insufflation likely put me off on a negative start, giving me doubts about the substance. These did diminish however, and I would call my experience a good one overall. While colors may have appeared slightly brighter to me, I did not have all that many sensory experiences on the drug. Here and there something would flicker in an odd way, or I would slightly glimpse a tracer. But overall, my experience was more of a psychological one, which is typical for me, even though it was likely also because the dose I had taken was so small. The friend who gave it to me said to call her if anything came up or to at least write her about how it went.",
  "Since it was so late, I felt it best not to bother her with a call but I did write her an email telling her that I was enjoying it. I edited the message, however, as I had gone off on some philosophical tangent mixed with interpersonal issues. I reduced all of this to simply stating how much I appreciated our friendship because I realized that a lot of what I had initially written was probably too much to just lay down on someone. I came to some realizations about my family and how I am depressed/scared about my mothers situation, who is single, living in poverty, and relies on me for what I have come to realize might be more than I can handle if I am to preserve my own peace of mind. All of this came out of writing the email to my friend, and I began to cry heavily once the observation became conscious. The crying was cathartic, as I felt much better afterwards. Nothing really eventful happened after that point and, though my system was too over-stimulated to actually sleep, I came down and basically crashed a few hours later.",
  "I kind of wish I had done the drug with someone else though. This might have made dealing with the psychological effects easier. But, I typically like to test out substances for the first time in isolation to avoid any undesired social outcomes. I bring this part of the experience up because I would like to emphasize that, at least for me, and at a relatively small dose, I believe that the drug has a therapeutic potential, similar to that of MDMA, though somewhat less overpowering. As my experience shows, doing an exercise like trying to write out ones thoughts assists one in using the drug to bring out repressed complexes. I would assume that this is also the case with verbal communication on the drug, meaning that it has both therapeutic potential and the potential to strengthen bonds between users who are sharing the experience."
 ],
 "erowid": {
  "id": "94350",
  "citation": " Nadja. \"Therapeutic Potential: experience with 2C-T-2 & Amphetamine  (ID 94350)\". Erowid.org. Jan 29, 2012. erowid.org/exp/94350",
  "substance": "2C-T-2 & Amphetamine ",
  "views": "5533"
 }
}
