{
 "id": 18671,
 "title": "Patterning and Color Distortions Abound",
 "date": {
  "submission": "2012-01-25T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "iwtao",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "125"
   },
   "administration": "oral",
   "substance": "6-APB",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Before I begin, I have seen that many newer reports begin with trip pedigrees. So, here is mine. Ive experimented with 5-Meo-DMT, aMT, 5-Meo-aMT, 5-Meo-DiPT, 4-HO-DiPT, 4-AcO-DMT, 5-Meo-MiPT, 4-AcO-MiPT, 2C-B, 2C-E, 2C-I, Ketamine, DXM, MDMA, bk-MDMA (Methylone), LSD and mushrooms. I consider myself to be a very experienced psychonaut; as do my friends.",
  "On New Years Eve, 2011-2012, my wife and I decided to ring in the year trying out a new substance 6-APB. I have not taken MDMA since 2004, but my understanding was that the effects of 6-APB were very similar to MDMA and/or MDA. I did a lot of research online about sources, doses, chemical structure, etc, and found contradicting reports.  But, trusting my gut, I had procured 6-APB from a reputable source and prepared for the night. I have also not been Hippy Flipping in almost 10 years and figured that, if the effects of 6-APB were as reported, a comdination with 4-AcO-DMT would be a very close emulation the experience.",
  "What follows is a timeline of the events from my notes and as best as I can recall.",
  "~6:30PM - My wife and I have a light dinner together and simply enjoy each others company.",
  "~7:00PM - We each take 125mg of 6-APB and 30mg of 4-AcO-DMT and then take a shower together.",
  "~8:30PM - We are watching Blue Planet: Seas of Life on Blu-ray when she begins to complain of feeling sick and too trippy. Usually when this happens, we are able to help one another through the initial come-up. Im sky-rocketing, waves of euphoria washing across me make it hard for me to pull myself together to help my wife.  But, Im able to help her to the bathroom, and she sits there for a few minutes.  She is having difficulty and feeling overwhelmed. I get her to drink a little water and help her back to the sofa to watch some more Blue Planet.",
  "~8:45PM - The narrator of Blue Planet mentions Snow Geese. I am not paying attention so much as I am fixated on my wife, making sure that she is doing better. She looks at me and says snoogys, and begins to giggle uncontrollably. I start to laugh, too. I realize that everything is going to be a-ok.",
  "At this point the visuals from the 4-AcO-DMT are powerful. interesting patterning and color distortions abound.  But, has the waves of euphoria wash in faster and faster, like high tide, they overpower the effects of the 4-AcO-DMT completely. At about the 9:30PM mark, it is almost as if we didnt take anything but 6-APB.",
  "For the next 8 hours, we proceed to have one of the most mind blowing, euphoric experiences weve ever had. Is 6-APB like MDMA? For me, it was better than any MDMA experience Id had before. ",
  "Nothing super insightful came of the trip. My wife and I talked for hours about all kinds of topics. We opened up about topics we havent discussed in years and forgave one another for minor things we hadnt talked about in a while.  All in all, the experience was very pleasurable. ",
  "We both fell asleep shortly after 5:00AM. I woke up around 12noon, I typically wake up far earlier than my wife. I had a fair amount of energy and the handover wasnt very bad at all.  My wife ended up sleeping almost all day, but the fatigue was all she really complained about. ",
  "In the future, I will likely not combine 6-APB with anything else."
 ],
 "erowid": {
  "id": "94315",
  "citation": " iwtao. \"Patterning and Color Distortions Abound: experience with 6-APB & 4-AcO-DMT (ID 94315)\". Erowid.org. Jan 25, 2012. erowid.org/exp/94315",
  "substance": "6-APB & 4-AcO-DMT",
  "views": "5853"
 }
}
