{
 "id": 18690,
 "title": "Diphenhydramine Potentiated",
 "date": {
  "submission": "2013-02-23T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Dreamwalker",
  "gender": "Male",
  "weight": "173 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 g",
   "administration": "",
   "substance": "Vitamin C"
  },
  {
   "time": "0",
   "amount": " T+ 0:00",
   "administration": "1.6 g",
   "substance": ""
  },
  {
   "time": "Piracetam",
   "amount": "",
   "administration": " T+ 0:00",
   "substance": "0.4 g"
  },
  {
   "time": "0",
   "amount": "Valerian",
   "administration": "(roots)",
   "substance": " T+ 0:00"
  },
  {
   "time": "100 mg",
   "amount": "",
   "administration": "Tryptophan - 5-HTP",
   "substance": ""
  },
  {
   "time": "0:00",
   "amount": "351 mg",
   "administration": "",
   "substance": "DMAE"
  },
  {
   "time": "0",
   "amount": " T+ 0:15",
   "administration": "125 mg",
   "substance": "oral"
  },
  {
   "time": "Diphenhydramine",
   "amount": "(pill / tablet)",
   "administration": " T+ 0:15",
   "substance": "1 cup"
  }
 ],
 "report": [
  "This is my account with diphenhydramine and my dose of smart chemicals with the added plus of some mild sedatives.",
  "Past: 40+ substances legal & non-legal consumed. I am sometimes bipolar depending on diet, sleep, and substances consumed.",
  "Present: clean other than nootropics and mild sedatives such as Valerian root that I use for stress and sleep.",
  "T-0: Took 1000mg of Vitamin C, 1600mg Piracetam, 400mg Valerian Root with Passion flower and Hops, 100mg 5-htp, 351mg dmae.",
  "T-0:15: downed 5x 25mg diphenhydramine with glass of Arizona green tea with honey and ginseng totaling 125mg.",
  "T-0:30: My heart is beating faster and I feel tactile sensation increased slightly. Just turned on some psychedelic trance music, sound seems to penetrate more like its driving deep into my brain lobbying for room oddly energizing me. I feel sensations go down my spine as the musical intensity increases. Could be that the diphenhydramine hasn't kicked in and I'm feeling the onset of the T-0 dose. Honestly makes me wanna dance =D...btw I don't dance...",
  "T-0:45: A little less stimulated my mind feels very open and I am completely content writing this report still listening to music. Just got up to use the bathroom and I noticed everything that I looked at was either inflating or rearranging itself subtly like a common low dose LSD hallucination.",
  "T-1:00: I definitely think the diphenhydramine has kicked in because I have the distinct feeling that my voice box has been removed or never existed. It is very hard to say anything at all and when I do it feels like im doing a partially uncomfortable stretching exercise. I am starting to feel sleepy like a comfortable cloud has wrapped around parts of my body. Ooo spinal chill but the chill feels very good almost like a chain of light pressing euphoria buttons as it travels to its destination. Decided to attempt to meditate.",
  "T-1:15: My internal voice is so powerful right now. Waves of relaxation come over me and my cats fur feels sooo soft. The music im listening to gives me the feeling of dancing on rose petals as they fall to the ground. A movie of my life and fictional events play across my mind like a slide-show. Nothing seems important all is well in the world even though euphoria is very subtle.",
  "T-1:30: I feel very lite and floaty. Creativity is peaking & music burns within me. I also feel like my hearing quality has been increased...possibly just hallucinating. ;) Breathing is pretty shallow. I feel strong physical floating sensations.",
  "T-1:45: Distinct mouth sensations appear common of my past diphenhydramine experiences. The spaciness aspect is not so pronounced with this cocktail. I think all the smart drugs counteract some of the bad retard effects of the drug. I started thinking of Jesus and I saw his outline in my room not full blown but there its as if I can control my hallucinations.",
  "T-2:+: Effects are more pronounced yet less enjoyable. Feels stronger than just 125mg of diphenhydramine. The mix must have potentiated the effects. I struggled getting to sleep. Could be from the green tea. I awoke pretty itchy and tired. Still high 6hrs later. Headed to work feeling slightly itchy and floaty. Not positive at the moment. I just want to sleep. Feeling broke 5hrs into the day after I ingested a Emergen-C packet.",
  "Overview:",
  "Positive - Coming up floaty feeling, trippy, increased awareness, slight euphoria on come up. Oneness.",
  "Neutral - Mid Floaty feeling, spacey.",
  "Negative - Too spacey, tired, floaty not fun anymore ;(, itchy, grumpy.",
  "All in all I think combining these drugs was a bad idea because it lasted much longer than just the diphenhydramine alone and interfered with my day life. Cost-benefit of the experience I would rate good 4, bad 7.",
  "To all the people who are bored and just wanna get high... Find an awesome hobby, love your neighbors, and learn learn learn. Don't do what I did letting myself be controlled by an impulsive nature causing me and my family much avoidable pain.",
  "'The more you take the more you need break the cycle stop the pain'"
 ],
 "erowid": {
  "id": "94430",
  "citation": " Dreamwalker. \"Diphenhydramine Potentiated: experience with Diphenhydramine, Piracetam, Valerian, DMAE & 5-HTP (ID 94430)\". Erowid.org. Feb 23, 2013. erowid.org/exp/94430",
  "substance": "Diphenhydramine, Piracetam, Valerian, DMAE & 5-HTP",
  "views": "3312"
 }
}
