{
 "id": 18694,
 "title": "A Question of Risk",
 "date": {
  "submission": "2012-01-24T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Notspam",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "buccal",
   "substance": "2C-C-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 1:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 2:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 3:15",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 5:00",
   "amount": "3 ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  {
   "time": " T+ 15:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 15:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 15:20",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 15:20",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 16:00",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 16:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 18:07",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "<p>T=0:00",
  "I dropped the two tabs (buccal administration ), both of them told to me to hold about 250g of 2c-c-nbome at around 8:00 PM with a bunch of friends. Most people were just drinking but it would a friend of mine R who would honor me by choosing me as his trip partner for his first acid experience. He had taken his 3 tabs  about two hours before and was already tripping so I would have some catching up to do.",
  "T=0:10",
  "I feel a slight loosening in my head, Im not tripping yet but Im definitely getting foggy headed.",
  "T=0:30",
  "Im starting to trip, depth looks weird and my hands feel weird in space. I can feel a slight chill coming to rest over my arms like a coat.",
  "T=1:00",
  "I feel like Im about to hit the break so I decide the moment is right to go smoke a bowl. Three friends and I crowd onto my back porch and pass around two fairly fat bowls. I can feel myself spacing out a lot, its a lot less cerebral then acid is and Im finding it difficult to concentrate on conversations going around me with the bowl. We step back inside and I am definitely tripping but its very weak visually.",
  "T=1:10",
  "I am tripping balls now having come up on the weed and the light chill that had overtaken me earlier settles into a heavier mantle of electricity. While I have yet to candy flip (Acid and ecstasy together), this is what I imagine it would be like on about 2 tabs and .1 of some good molly.  I cannot say that Im not enjoying myself but I could definitely see caring more for something a little stronger",
  "T=2:00",
  "We smoke another three bowls and I find myself continuing to trip harder. Still not a lot of visual activity other then halos and some questionable colors but my kinesthetic sense is fucked and Im finding myself unable to move well and repeating senseless tasks like flipping a pillow end over end. It feels like theres a cloud in my head that makes its very difficult to thinklike theres pressure between my ears. I also have a fever as far as I can tell but it seems within manageable range. We watch some Monty pythons flying circus for R, the dead parrot sketch being a favorite of mine while tripping.",
  "T=3:15",
  "In the past a fever has been the first sign of the onset of serotonin syndrome though the symptoms appear very light. My fever is going down and my palms have stopped sweating. I decide its time to smoke one last bowl; after all one of my friends had gotten screwed out of the last rotation and I was starting to come down. We smoke the bowl and then R asks if Ill indulge him with a walk and I of course oblige himit isnt right to keep a man cooped up inside through his first acid experience.",
  "T=3:45",
  "Walking is difficult and I find myself having difficulty socializing with dear R as we trod through the snow. My head feels empty and fuzzy, it seems Ive disappointed R for he was hoping for some better conversation. I redouble my efforts as we walk back from the gas station to remain active.",
  "T=4:20",
  "My friends leave and Im alone watching American Gangster on television. I find this within my ability as my head is beginning to clear up. I still have a slight fever but Im not worried about it since I dont have a headache and Im not nauseas, two sure fire signs of serotonin syndrome for me.",
  "T=5:00",
  "Im getting tired and so drain about 3 beers and decide to go to sleep. I play some music through my headphones for quite a while and the notes still feel electric. I fall asleep after about 45 minutes listening to music but please note that this may not be normal. I have little difficulty falling asleep on just about any substance and its very possible this substance could keep me up at night.",
  "T=15:00 I wake with an idea that had been inevitably coming. Noting the MAOI-A effect of the substance I decide I might as well do my Adderall too. The serotonin agonist effect has probably all but evaporated as Ive run dry on serotonin but the MAOI-A effect should still be there a few half-life later.",
  "T=0:00 again",
  "I snort the first one and then eat another three 10 mg Adderall XR.",
  "T=0:05 The waves of euphoria start almost immediately and I feel a light reinvigoration of last nights cool-coat feeling.",
  "T=0:20",
  "I eat two more and snort one more.  Im delaying my doses significantly more then usual in case I encounter any problems with blood pressure or my heart as a consequence of last nights trip in combination with the amphetamine.",
  "T=1:00",
  "I eat one more and snort two more, it feels almost like Im rolling and my body buzz is almost mind numbing. I lie down to listen to music for an hour or two and accidentally fall asleep.",
  "T=3:07",
  "I wake up and smoke a small jay. I feel fantastic but I control myself and so begin to look through and rewrite my trip report.",
  "T=4:16 You're caught up to me now on my timeline. Compared to normal amphetamine use I feel a little lighter; almost like a feather and less clear headed. The effect is obvious enough even the day after that for me to confidently say Im higher then I would be on amphetamine and weed alone.",
  "Overall I thought the benefits of 2-c-c-nbome are not worth the risks they impart. This is an incredibly new chemical with little history of human use that is active in g. The effects were enjoyable and felt like a sort of acid ecstasy mix but did not seem to be either inducing a clear headed trip in which I can think and react to the stimuli of the world or one that is so mind numbingly awesome I dont care. I got few instances of giddiness further adding to the physical preference it holds to.</p>"
 ],
 "erowid": {
  "id": "94463",
  "citation": " Notspam. \"A Question of Risk: experience with 25C-NBOMe (ID 94463)\". Erowid.org. Jan 24, 2012. erowid.org/exp/94463",
  "substance": "25C-NBOMe",
  "views": "7543"
 }
}
