{
 "id": 18699,
 "title": "Digitalia",
 "date": {
  "submission": "2000-11-13T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ganja Breath",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.2",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms"
  },
  {
   "time": "0",
   "substance": "smoked"
  }
 ],
 "report": [
  "My friends were visiting me on spring break because I couldn't afford to get home and we all decided to try mushrooms together.  Of my two friends and I, two of us had tried them before.  One friend had tried them once with acid, I had tried them many times before that and the other hadn't even ever smoked pot.  We split an eighth between the three of us at the beach and we got in the tent.  I got a mellow I'm-this-person-right-now kind of trip and my friend that had tried them before was having one of those I'm-loving-this beauty trips, and the one who was a virgin not ten minutes earlier was having a 'wow, these are cool designs on the backs of my eyelids and they are doing cool shit' kind of trips.  All of us together in a tent tripping balls and I thought (yes, I thought) that I was coming down.  I wasn't.  None of us was.  The one who was the first-timer felt similar to me, but the other was wild and didn't want to smoke a bowl because he was in that 'perfect state.'",
  "We smoked one and I know that everyone out there is thinking that everyone smokes a bowl with shrooms and that stories like this are worthless, but if it can happen to some of us then it can happen to anyone and everyone.  Well, anyway, on with the story.  After we all hit it pretty hard on the pipe, I took a look at my friend's face and, bam, he was a tile mosaic.  No, seriously, a mosaic of digital images, and so was the world, all hashed out like that.  What happpened with the auditory hallucinations was quite intense, too.  The recently inaugurated mind in the group said a quick comment about sirens and that spun the whole night.  We all heard the sirens, and the people and the dogs and the ocean and the sirens, yes, the sirens were there, too.  They were loud and sometimes I could think that they were real and a tsunami was coming or something and we were going to all die because we didn't realize something was happening because we were on drugs.",
  "So, we were all freaking and my newbie friend realized (ingenious man that he is) that he had to pretend to be sober to anchor my other friend or he would lose his mind while I had to be honest and tell him that I heard sirens because I did.  So, that brought our friend down and I started to sleep.  In my sleep I found out that I could play the music and noise myself in my head, I could control it.  I was bouncing my thoughts and head off of all kinds of noises and ending up with a personal boom box that plays what I tell it to, almost as if it were melting through its music.  The one overwhelming mental state that I was in was being in touch with my femininity.  I really found that piece of me in the whole trip.",
  "I have done shrooms many times and I will continue using them alongside pot and even LSD.  My friend could not mentally handle them both together when he tried it and that is because of who he is.  Some people really are meant for certain trips and also certain drugs and drug feelings.  We all feel different parts of a drug, this one may not be for you.  I however do like this combination along with just about any other combination and will continue happily to do them all.  I recommend doing them, but only if you know what you are doing first.  Look your shit up, kids, because this one can and will hurt."
 ],
 "erowid": {
  "id": "945",
  "citation": " Ganja Breath. \"Digitalia: experience with Mushrooms & Cannabis (ID 945)\". Erowid.org. Nov 13, 2000. erowid.org/exp/945",
  "substance": "Mushrooms & Cannabis",
  "views": "6232"
 }
}
