{
 "id": 18704,
 "title": "Combined with an SSRI",
 "date": {
  "submission": "2012-02-09T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "iofthehurricane",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "4-Fluoroamphetamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "This chemical has great potential, and is a new favorite of mine. Very experienced with psychedelics/ empathogens/ stimulants, and decided I would give this a try.",
  "50mg Zoloft is taken daily, but I will touch more on this because I feel the SSRI may have negated some of the euphoric effects. It was still a very beneficial experience.",
  "Total time (come up to comedown): roughly 5-6 hours, simply body/ slight mind stimulation for the last couple of hours.",
  "0:00 - Stuck my finger into the bag of the 4FA and took about 3 licks (roughly 80mg), first reaction. WOW, what an awful taste! Reminds me of eating an acidic/ sour powder of some sorts, I recommend NOT insufflating this substance.",
  "0:25 - Stimulation and slight euphoria start to kick in, wow this is shaping up to be a great evening!",
  "0:45 - Full effects have set in, very euphoric (lasting about 2-4 hours). Body feels weightless, endless energy, lights/ colors and music are GREATLY enhanced. Mind is flying with  various thoughts, ended up sitting down and simply writing in a journal for a couple of hours. My ideas seemed to piece themselves together, and create conclusions to different issues I have been encountering.",
  "1:30 - Still feeling great, very sociable and talkative. ALOT of energy.",
  "3:00 - Euphoria seems to be weening off a little bit, but definitely still apparent.",
  "4:00 - Very little euphoria if any at all at this point, but still just loving life.",
  "5:00 - Pure body stimulation at this point, the energy that I had hours prior are starting to come to a close.",
  "6:00 - Very tired at this point, still feeling body stimulation. But was able to fall asleep shortly after this point.",
  "Overall reaction to this chemical:",
  "Really can't beat it.",
  "It's fairly easy to obtain from various online vendors, and has great effects [for an empathogen lover]."
 ],
 "erowid": {
  "id": "94526",
  "citation": " iofthehurricane. \"Combined with an SSRI: experience with 4-Fluoroamphetamine & Zoloft (ID 94526)\". Erowid.org. Feb 9, 2012. erowid.org/exp/94526",
  "substance": "4-Fluoroamphetamine & Zoloft",
  "views": "4288"
 }
}
