{
 "title": "Twisted Stuff",
 "author": "Fenriz",
 "citation": " Fenriz. \"Twisted Stuff: experience with BZP (ID 18702)\". Erowid.org. Nov 10, 2002. erowid.org/exp/18702",
 "substance": "BZP",
 "bodyweight": "130 lb",
 "report": [
  "<p>Well i hadn't really heard of BZP before a guy i know told me that he had 100 g. of the stuff, freebase crystallized to HCl. I thought that i might as well try it and bought 200 mg from him. I'm pretty skinny and sensitive to some drugs so i asked him to split it in 2 capsules of 100 mg.",
  "We had planned to go to a club in the evening and we sat at my place drinking and snorting amyles ;) I took the first capsule about 8pm and at about 10pm it peaked, but the buzz was a little weak so i popped the other capsule. When the effects started to kick in i went REALLY hyper and my mouth became all dry so i drank alcohol and water. This resulted in that i should piss all the time wich was very annoying. Well, we didn't get into the club, we decided to go home to my place were we sat talking until about 5:00 in the morning... i wanted to sleep but i just couldn't fall asleep, it felt like my brain just kept on thinking all kinds of crazy shit that i couldn't control.",
  "When i fell asleep after in fact only 15 minutes, i woke up at about 9:00 am with a fucking aweful headache and my jaw hurt pretty badly. I took 5 mg diazepam and fell asleep again untill 2:00 pm were i woke up and took 200 mg caffeine.... i hadn't any trouble eating at that time and the headache disappeared 15 minutes after i woke up. The rest of the day i was pretty tired, but not really depressed as i tend to be on amphetamines... a good movie and and some marihuana is what I'd want after a night using BZP.",
  "Except for the negative physical after effects, this was a good experience, but, i wouldn't go above 300 mg in one evening (not all at once)... definitely a drug i'd like to try again some time.</p>"
 ],
 "year": "2002",
 "id": "18702",
 "gender": "Male",
 "views": "20213",
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2002-11-10T08:00:00.000Z"
}
