{
 "id": 18700,
 "title": "Into Insanity I Went",
 "date": {
  "submission": "2002-03-26T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Dogg / Maxw00t",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "What I did on my 18th birthday, I'll never forget.  It was about 4:00pm and I had just gotten home from school.  My mom gave me a letter I had gotten in the mail from a guy I had met on IRC.  He sent me somewherez between 50-100mg 5-Meo-DMT.   I went upstairs to my room and kinda looked at it thinkin how stupid I am... I'm going to smoke something that some stranger sent me.",
  "'fuck it' I said.  Now, I didn't want to get totally wasted on this shit right then and there because my parents were expecing me to come downstairs soon, because we had to leave and meet my grandparents at a resturant.  What I did was this:  I tapped a little bit of it onto a peice of tinfoil and about 2 feet from my room theres a door that leads to a storage room where nobody ever goes.  I lit under the tinfoil and a few moments later it just started lettin off smoke like you wouldnt believe.  It was way more than I wanted, but it stunk rotten so I didnt want anybody to smell it and I inhaled most of it.  I held it in as long as I could while thinking of where I was going to exhale it.  I went back to the storage room and blew it out. ",
  "What I felt right then and there-  that instant was more then anything I could have possibly immagined.  When somebody says this drug rocked their world... they are not shittin' you one bit. ",
  "I don't even remember the oncomming effects, but I do remember the one thing that scared me more than anything else in my entire life ever had.  I couldn't walk, talk, or see straight.  I couldnt think of what to do.  I started panicing because I just knew my parents would run upstairs and smell the smoke.  I was running back and forth crying to myself; 'What have I done?  I'm going INSANE?'",
  "I coulnt concentrate on the same thought for more than one damn second.  'SHOULD I JUMP OUT THE WINDOW?  SHOULD I RUN DOWNSTAIRS PAST MY PARENTS AND HIDE OUTSIDE? SHOULD I HIDE IN HERE, THERE?  WHAT THE HELL DID I DO TO MYSELF?!?!?! I PROMISE GOD I'LL NEVER DO ANOTHER DRUG AS LONG AS I LIVE!!!  JUST PLEASE GET ME OUT OF THIS!'",
  "It wouldnt go away.  all I could think about was that places on-line had mentioned numerous times that the trip was short.  I curled up on my bed in the fetal position with my muscles trembling.  I thought I was going to die.  I new i was going insane.  What I felt I could never put into words... what I saw, sounds I heard, how everything felt.     after about 10 minutes,  I could tell I was comming down.   I came down pretty fast and went downstairs to wash my hands, and brush my teeth so I wouldn't smell like burnt plastic. ",
  "I heard people saying its either a fantastic dream, or a deathly nightmare... for me, a nightmare indead.  I've tried it numerous times since and its been better and more introspective everytime.  The thing that got to me though was the paranoia.  IF you happen to try this, MAKE SURE YOU ARE IN A COMFORTABLE PLACE, and have somebody there to catch your pipe when you go into 'the void,' and to let you know you really aren't going to die or already dead.   ",
  "Be careful.  its more than a drug.  its more than a chemicle.  its a whole new world you wont forget."
 ],
 "erowid": {
  "id": "9450",
  "citation": " Dogg / Maxw00t. \"Into Insanity I Went: experience with 5-MeO-DMT (ID 9450)\". Erowid.org. Mar 26, 2002. erowid.org/exp/9450",
  "substance": "5-MeO-DMT",
  "views": "9874"
 }
}
