{
 "id": 18714,
 "title": "Can Hold Its Own",
 "date": {
  "submission": "2012-01-28T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Pink Avvy",
  "gender": "Male",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "44 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "My friend Swip found a note that he asked me to type and post on here, all below writing is word for word what the note said...",
  "This experience report is written at 12:10am, approximately 4 hours after taking.",
  "240lb male 5'11",
  "44mg MXE snorted at 8:15pm",
  "Within a couple minutes this substance was noticed. A little antsy and anxious while waiting... there were four of us total who consumed the same amount. Two do u.a.'s regularly so did not combine with weed, and I was one of those two. The other two smoked a bowl after about 10 minutes.",
  "Slight nausea for the first half hour.",
  "9pm complete disassociation. some people describe it as 'diet pcp' but it's more like .... ketamine but with the control-ability of DXM and the legs of DXM. really can not keep a straight thought at this point. Discussion is fun and upbeat, sharing of times past with good friends, and new friends.",
  "10pm on the down side, which is great... was way intense gone there for a bit. drinking pomegranate juice and water is great. Stories being told, very disconnected with body, hand gestures are very exaggerated, mind is very creative. Laughing at one self is easy, honesty and confidence is there.",
  "11pm certainly has the creepy crawly comforting legs of the DXM 'spider' lol It is really a great joy ride. No additional bumps, going to let it die off, but still a great time. Euphoria, waves of distortion, colors are 'vibrant', CEV is neat. Conversation is less 'story time' with creative flare and more meaningful. A great time with old school psychonauts ranting at one another and their new school lovers seem to be enjoying the ride too.",
  "12am not yet baseline, but much clearer. When I press the 'd' character on my keyboard while holding down the right shift key it does not work, but does work with the left shift key. Why is this so annoying and noticeable to me right now? Hyper-focus as part of the tail of a disassociation, or just because I keep typing DXM alot. lol Sat down to write this note.",
  "Overall conclusion...",
  "MXE is a great and true dissociative that is simply in a class by itself. It is not fare to explain it as being like DXM or Ketamine or PCP, as it is in a class on it's own. It does have all the greatness of K and 'chasing' can certainly be foreseen with this substance if one was so wanting to do, but just riding and enjoying like dex is great too. Does it have that spaz flare of pcp? Not sure. Diet pcp? Not in my world.",
  "MXE gets two thumbs up form this old school psychonaut.",
  "UA/piss test ... Standard five panel cup test the next morning passed just fine, of course."
 ],
 "erowid": {
  "id": "94580",
  "citation": " Pink Avvy. \"Can Hold Its Own: experience with Methoxetamine (ID 94580)\". Erowid.org. Jan 28, 2012. erowid.org/exp/94580",
  "substance": "Methoxetamine",
  "views": "9081"
 }
}
