{
 "title": "Frog People Spitting Fluorescent Green Goo",
 "author": "ficusyou",
 "citation": " ficusyou. \"Frog People Spitting Fluorescent Green Goo: experience with Ayahuasca (Mimosa/Syrian Rue) (ID 18711)\". Erowid.org. Nov 7, 2002. erowid.org/exp/18711",
 "substance": "Ayahuasca (Mimosa/Syrian Rue)",
 "bodyweight": "160 lb",
 "report": [
  "<p>I'm writing about this dream, and posting it here because it seems different (more simplistic from what I gather) from most of the experiences I've read or heard about. As one might imagine, I've forgotten many of the details of my dream. However, for some strange reason, I was talking to my friend/sitter/brewmeister (who I like to call the shaman in a semi-jestful but respectful way) during parts of the experience. As a result, I have written notes, some that bring back interesting memories, others that have apparently vanished and taken some brain cells with them.",
  "I began sipping the Syrian Rue slurry (3 grams) at 10:05pm on the night in question. The mixture wasn't yummy, but seemed reasonable enough and I finished it about 20 minutes later. I can't say that I felt too much from the Rue other than a slight warmth. I relaxed for a while, eating some olive bread with olive oil, and mentally preparing for the Mimosa hostilis root bark tea. At 11:13pm I began sipping the tea. I actually didn't mind the taste initally and thought I wouldn't have a problem. However, after drinking about 2/3 of the tea, I was feeling pretty uneasy about finishing it. By 11:38pm, I had pretty much given up and was ready to go with about 5-6 grams of MHRB. I felt a distinct warmth and slight nausea that seemed to be growing steadily.",
  "Between 11:45pm and midnight, I took a couple of fruitless trips to the bathroom in an attempt to vomit. I had begun to see some CEVs, colorful from what I remember, but not really clear in my mind due to the bad feeling in my stomach. At 12:07am, I staggered into the bathroom, and saw several black children waiting for me. I felt as though they were friends, and were encouraging me to just throw up. I did. I must admit that it was quite comforting to have them there.",
  "At 12:20am, I told my sitter that I saw a bunch of cattle walking down a country road, being led by a hispanic looking man wearing a white hat. It was a serene setting and I remember feeling very happy to be there. Apparently I also mentioned something about elephants, sheep, and some sort of digitization, but I don't remember this. I saw an amazing claymation scene, where two children (one boy, one blonde girl with pigtails) were riding bicycles on a path made of little colorful clay dots. I had the impression that there were levels of reality. For example, I remember thinking that the cattle and herder were obviously part of the ayahuasca experience, but I really believed that I was actually standing on a country road (I found this to be very dream-like).",
  "I felt like I was constantly ending up in different places. There was a farm woman handing me things, then I was in a field of grass with the sun shining, then in a desert with large spiky plants. Then I saw a tiger in some asian-looking place with a stream, an unmoving samurai, and snakes. I started hugging the tiger and it seemed very comforting.",
  "My sitter noted that it was 12:50am at this point. I saw temples everywhere, but everything seemed very enclosing and small. I distinctly remember the strange scene where there were long bamboo skewers (about 6 feet long), with the remains of fish on them. Next to the skewers, there was an old woman opening a wicker coffin/phone booth. I was in some sort of Southeast Asian villiage with water everywhere, and houses on stilts.",
  "Then, I ended up in India (or at least that's what I thought), inside a tall spire, with intricate carvings. I had incredible control of my movement inside this spire, like I could get closer, farther, turn, all in an instant. My sitter mentioned 'rings of trees', but that information is gone. At this point, she went to the bathroom, and I saw what I considered to be the most fascinating vision of them all. I was lying under what seemed to be a greenhouse of some sort, and creatures with the head of a frog and the body of a human were flying down at me from above, spitting a greenish-yellowish goo on the top of the greenhouse. It was oozing between the cracks and down the sides of the greenhouse...amazing.",
  "I told my friend that I felt I had been different races during the trip, Asian, Hispanic, Black. The last visual memory I have is seeing a childhood friend wearing a hard orange baseball hat (sort of like a construction worker hat), playing baseball with a stick.",
  "As I started to return to 'this' world, wherever that is, I continued to have a lot of interesting thoughts that were never written down, and that I don't remember. In fact, I didn't fall asleep for quite a while, and had a very enjoyable night just 'dreaming'.",
  "While I found the entire experience enjoyable, I also was concerned that it was mostly visual for me. I have the feeling that I've 'dumbed down' something that should be a intense, mystical, and enlightening experience. I wonder if I need to analyze my dream more, or if there is additional preparation that I should do. Whatever the case, I hope to partake in this wonderful (not tasting) brew once again.</p>"
 ],
 "year": "2002",
 "id": "18711",
 "gender": "Male",
 "views": "12067",
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  },
  {
   "time": " T+ 1:00",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(tea)"
  }
 ],
 "submissionDate": "2002-11-07T08:00:00.000Z"
}
