{
 "id": 18728,
 "title": "A Very Psychedelic Surprise",
 "date": {
  "submission": "2012-03-01T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FractalStructure",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "6:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "Im a 24 year old male, and for a long time I was interested in the chemical MDAI. I saw it once or twice, and it looked like chocolate mix. So I never took that stuff, and it ended up being less than 50% MDAI anyway, so Im glad I abstained. However, a year later or so after seeing that it was about to be banned federally, I decided to try some. This batch looked very different from the first, it was a tan shade, and quickly turned red using the marquis reagent (MDMA style, very fast reaction, the color was even similar but red not purple), and brown with mecke.",
  "One thing I noticed is a serious lack of information about this substance on the internet, and the information that does exist can be very contradictory (because it has to do with subjective reports, and MDAI is known to sometimes be very impure, leading many people to consume other substances, sold as MDAI on reputable sources the correct Marquis reagent color is not even empirically known, and varies from red to no reaction for supposedly pure MDAI). Regardless, from what I gathered I thought itd be a relaxing night with the missus. I thought it would have the empathogenic effects of MDMA and all the serotonin activity but no speediness, and I expected it to be mild (its worth noting that a non-neurotoxic version of MDMA/MDA was the reason I was interested in the first place). Especially at the planned dose of 120mg, said to be on the small end. On top of that, about 20mg of my dose fell off the paper, so I ended up taking 100mg. My partner, L, took the full 120mg of the same batch.",
  "30 mins",
  "Laying in bed, talking for the past half hour, I wonder if Im ever really even going to the come up I have heard of that happening. Or whether the dose I took was too mild. Oh well, I figure. After getting up to go to the bathroom, I noticed that movement was a little different, and it was nice to feel my own skin. Even nicer to feel L in bed. My hands felt like they sensed more. But it wasnt anything intense.",
  "Within about 10 mins, at some point, I felt a sharp, unexpected MDxx-like comeup, with startling intensity. Like MDMA, it went from 0-60 in 1 second. One second, nothing; the next second: EVERYTHING! This is feeling a little bit like mescaline, which surprises me. And then I realize",
  "1hr",
  "This actually feels nothing like MDMA! But it feels SO MUCH like MDA! In fact, it feels much trippier than MDA, and the MDA body feeling is very noticeable. L, who really likes tryptamines, was also very surprised by how psychedelic the experience was at this point. She remarked on how to her it kind of felt like a tryptamine (she is unfamiliar with MDA). Things were getting very dreamy, and it was very difficult to think of sentences to say. What was supposed to be a romantic night together was becoming a somewhat dissociated, silent night. Not that we didnt connect.",
  "2.5-3hr",
  "L and I had some cannabis, and both of us found the trip even more psychedelic (like with most psychedelics and cannabis). It was definitely more of a trip than a roll. There was some empathy, but it was limited, but the psychedelic effects were very strong. There were strong tracers everywhere. We laid down again, and at some point, maybe around 3hr, a strong relaxation hit both of us. We held each other and drifted into an interesting sleep. On the way, there were many CEVs, like shapes turning into other things. Objects spinning around. The whole trip was filled with CEVs but this was the first time I actually closed my eyes for a decent amount of time. It almost felt like a psychedelic opiate at this point, it was so relaxing that we both fell asleep",
  "6hr",
  "We woke up at the 6 hour mark or so, definitely still feeling it, although it was waning. We smoked again to kick it back up, and it felt like a nice glow over the cannabis high. A very interesting end to an unexpected evening. There was very little in the way of stimulation, and there was no crash, though we did feel a bit scatter-brained the next day.",
  "NOTE: I would like to add that I happen to be very susceptible to MDMA and amphetamine. This didnt cause much of a problem, whereas something like that even bk-mdma gives me a pretty noticeable crash.",
  "I would like to make it clear, also, that this is a substance where you should know your source, and *have a testing kit*, even though many other RCs are consumed without these measures, MDAI tests differently with different batches and the lack of information doesnt help."
 ],
 "erowid": {
  "id": "94689",
  "citation": " FractalStructure. \"A Very Psychedelic Surprise: experience with MDAI (ID 94689)\". Erowid.org. Mar 1, 2012. erowid.org/exp/94689",
  "substance": "MDAI",
  "views": "8815"
 }
}
