{
 "id": 18721,
 "title": "Methylone Is a Hallucinogen",
 "date": {
  "submission": "2012-06-22T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Pacmon Plur",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "T+ 0:00",
   "administration": "250 mg",
   "substance": "oral"
  },
  {
   "time": "Methylone",
   "amount": "(capsule)",
   "administration": "T+ 0:30",
   "substance": "250 mg"
  },
  {
   "time": "oral",
   "amount": "Methylone",
   "administration": "(capsule)",
   "substance": "T+ 2:30"
  },
  {
   "time": "50 mg",
   "amount": "insufflated",
   "administration": "Methylone",
   "substance": "(powder / crystals)"
  },
  {
   "time": "3:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Methylone"
  },
  {
   "time": "(powder / crystals)",
   "amount": "T+ 3:30",
   "administration": "50 mg",
   "substance": "insufflated"
  },
  {
   "time": "Methylone",
   "amount": "(powder / crystals)",
   "administration": "T+ 4:00",
   "substance": "250 mg"
  }
 ],
 "report": [
  "[Erowid Note: 900 mgs of methylone is considered an extremely high dose, see methylone Dose Chart]",
  "To start I'll give a little background info about myself Ive been doing various drugs since the age of 15 and by the time I was 19 I had done almost every drug I could get my hands on Im also quite experienced with hallucinogens acid, shrooms, dmt ,k, never  peyote,  never very high doses just shit would move,melt, spin, and look really cool aside from dmt and k obviously those are trips. but I really only smoke weed regularly, weed was always a favorite and it still is.",
  "I do not have a addictive personality what so ever I feel very gifted.  I literally have tested my brain by doing very addictive drugs just to how they felt and I knew  I could stop and I was able to stop each time with no troubles or ever even caring to do them again. And well save the best for last! haha I dont even smoke cigarettes!  although iv smoked a total of 10 in my life when I was really messed up but anyways now on to the the story....",
  "Mdma was always hard to find I my area so I recently got a shipment of BK-MDMA (Methylone) and its great stuff very close to mdma in my view and Id do it at clubs or a rave a few times a month or at just chillen at home bonding with friends. it really will bring two people very close and make great friends.",
  "T 0.00 I ingested 250mg in a capsule as my friends c and d also did and we relaxed and began smoking high grade marijuana (as we do 10+ times a day every day)",
  "T 0.30 Im starting to feel small waves and tingling through my body and it was very pleasant. I redose as so did my friends with another 250mg capsule",
  "T 1.00 Now Im definitely feeling it! Its that feeling you get when a little kid on Christmas day walking down the stairs, or going on a vacation to paradise or even a roller-coaster. My body feels amazing with all these beautiful sensations running through it!  Haha I and my friends couldnt stop talking. We were talking very fast and having deep deep conversations, everyone was loving it! (This made us now very close friends)",
  "T 1.30 - 2.00 The second pill kicked in and we were all in complete euphoria. We slowed our talking and enjoyed the amazing euphoria and we also continued smoking haha",
  "T 2.30 my friends had had enough and wanted to just keep smoking enjoying the euphoria, (the comedown of Methylone after 2-3  redoses  becomes very sedative and I  dont want to move much then around 6-8 hours I generally fall asleep.  I never went much further then 500mg. I began taking small 50mg (not scaled but quite close) bumps up my nose every 15-30minutes",
  "I actually started losing track of time so the next times may be off.",
  "T 4.00 I felt the first pill starting to come down and I had a mixed effect of sedation plus stimulation  and euphoria from the bumps that I just did. when the sedation started I said fuck it and ate another capsule.",
  "T 4.30- ? Through the rest of the roll,  I was no longer rolling I went on a full out TRIP :) and it was lovelyyy Im just very fortunate I had close sober friends by:)",
  "THIS IS WHEN WILDNESS STARTED!!!!!",
  "My wall consist of long wood planks going horizontally maybe 8 inchs tall and  6 feet wide and theres prolly 8 planks going across the wall kinda like a board walk I guess you could say. All the wood had grain with swirls and stuff all over it regularly and above them towards the ceiling hung a dream catcher and 2 picture frames one on each side.",
  "Then I looked at the wood grain very close to see millions and millions of tiny tiny termites crawling through the grain! I had to ask if I really had termites??  it freaked me out, my friends came over to check I out and said no and they gave it a close look and said I was tripping! from then on it was purely awesome:)",
  "This trip keeps getting crazier, like really crazy, just with zero mind fuck at all!  You guys are probably thinking methylone trip? This guys nuts ahaa!!! No such thing, methylone is a stimulant. NO this all is possible and I did it. METHYLONE CAN BE A HALLUCIGEN!",
  "Now every wood plank was its own world I saw countless 'all seeing eyes' blinking and watching me. There was a plank with nothing but wild life and a desert, monkeys swinging from trees and many preastoric animals. One board was an ocean with various fish Ive never seen they looked really old, one I remember clearly was a crocodile like fish swimming across my wall IT WAS TRUELY AMAZING!",
  "Those were all 2d hallucinations now the 3d starts :) As Im watching a stampede of lions, elephants, buffalo, every fucking animal in the jungle running across the plank, I see a REAL spider about the size of a half dollar. he crawled up into the dream catcher.",
  "I once again freaked out not knowing if it was real. I said Chris, a spider just crawled in the  dream catcher. he checked it out, nothing. Now the fun started. I look at the planks again, it was just wildness and I keep seeing more and more real spiders. then I looked at at the dream catcher to realize it was a nest. I knew it wasnt real but it was a real as it gets. And in this nest there were big spiders, tarantula sized caring millions of babys all over there back. I could see eggs and all it was a nest and middle sized ones would just crawl around the web. They were scary but I loved it.",
  "I watched momma spider wiggle her massive fangs and venom dripped down on my bed. At this point I could control it and I knew everything that looked real wasnt according to my sober friends.  I watched a middle sized spider making a very silky web and slowly drop down on my chest. I asked if there was a spider on my chest they checked and said no so I touched it and it melted into me.",
  "Coolest hallucinogen Ive ever taken. If I didnt have sober friends it would have been a train wreck, so be safe people.",
  "T8.00-9.00 Hallucinations slowed. nothing but things in the corner of me eyes and little shit like when Im coming off of lsd",
  "T 11.00 I fell asleep. Best trip of my life this was my first report so sorry for mistakes but I hope you all enjoyed and further research should be put into methylone unless that was consider a true overdose? I had fun. BK-MDMA is a hallucinogen!"
 ],
 "erowid": {
  "id": "94638",
  "citation": " Pacmon Plur. \"Methylone Is a Hallucinogen: experience with Methylone (ID 94638)\". Erowid.org. Jun 22, 2012. erowid.org/exp/94638",
  "substance": "Methylone",
  "views": "3914"
 }
}
