{
 "id": 18738,
 "title": "Reality or Illusion?",
 "date": {
  "submission": "2004-11-20T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "TotalChaos",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Inhalants"
  }
 ],
 "report": [
  "This was one of the stupidest things I've ever done. I was totally unprepared for the effects of huffing glue. I wasn't even sure if it would do anything. Well, it certainly did do something. I wouldn't do it again if you paid me.",
  "I had huffed glue before this time I will be describing, but never enough to anything to me other than make me feel a bit drunk for about 5 minutes. This is VERY hard to describe, or even remember. But, I'll tell you what I can.",
  "I got home from school, and was bored, so I grabbed the Cement Glue and went up to my bedroom. I sat at the edge of my bed, and started inhaling the crap. I didn't breathe any fresh air in for a few minutes, just breathed in the glue. The TV was on downstairs, and I sort of felt like I saw the person from the commercial come out of it, and start smacking there lips, though I couldn't see the TV, and maybe couldn't even hear it, but that's where I thought it came from. This was just the beginning. Then everything started to spin, faster and faster. By now, I had totally forgotten that I had huffed the glue, and thought what was happening to me was real.",
  "Throughtout the whole trip, there was this weird buzzing sound. The only way I can think to describe it is... when you have those mini cars where you wind the tires up, then let go, and it drives by itself, but after you wind it up, you just release it in your hand, and let it spin through the air. It sounded a BIT like that.",
  "I'm not sure if my eyes were closed or open, and I'm not sure how long the trip was, but I wasn't able to move, maybe because I was so shocked at what I was seeing, that I didn't think to try and move, because I thought it was real.",
  "Anyway, after the room stopped spinng, I sort of became part of a group of packmen. I myself was a packman (I think). Anyway, they had little tails that were hitting their bodies, and this motion seemed to be making the buzzing noise. That stung like a bitch, that little tail hitting me. I could actually feel it. These little packmen were part of a picture, and then that picture was part of a bigger picture, and that one was part of an even bigger picture, and so on and so on. I thought I was caught in this. At that point, I thought that my whole life was a big joke. Everything I've ever done so far, had no point. I thought that the phone company had planned this all out and my life was a pointless farce. I don't know where I got the idea that it was the phone company, but that's what I thought. So, I was in the middle of the big, dark, nowhere, as a packman, getting smacked by my own tail, with an annoying buzzing in my ear, stuck in a repeating void. Again, I thought this was REAL.",
  "Then, after being stuck in these pictures making up pictures I thought to myself (this was my first sense-making thought), what if I just pull my head back, what if I try and move. Because I was looking through the eyes of a packman, I just jumped to the conclusion that I couldn't move. So I tried to pull my head back, and as I did so, all the pictures that the packmen were making started to spell something out. I thought to myself 'This is the answer to the universe!' but I didn't really care because I was soooooooo fucking scared. Then I pulled my head back some more, and tried to move, and I slowly started to come out of the awful trip. I looked to see if I could still see the answer to the universe in front of me, and discovered that I had been looking at the back of my film case in the trip, that looked a little like a phone book. Maybe that's where I got the idea that it was the phone company's fault. Anyway, I sat there, and I could still feel the little buzzing tail smacking me, and I could still sort of see it. And for some reason, I thought that because of this buzzing thing, all the people in the world were gone. I was all alone. I know it doesn;t make any sense, but that's what I thought. And like I said, I wasn't tripping anymore, I was back to myself, except for this buzzing thing. So I run dowstairs, the thing still smacking me, saying 'Oh my God oh my God oh my God' and shaking so uncontrollably, crying, I was SO freaked out. I was looking for people, anyone, to see if I really was alone. By now, the buzzing had almost stopped, and the little tail had disappeared (I wasn't really a tail... it was hitting my shoulder... that's the only way I can think to describe it) So I saw my mother, all the while I couldn't stop saying 'Oh my God' and I was just freaked. After a few minutes, I was okay, but for days after that, I would burst into tears just thinking about the trip.",
  "It was SO real, I was actually seeing it... I will NEVER do that again. I regret it so much, and I felt so detached from my body, that I didn't think my body even existed anymore. Some people might think this as some kind of spiritual something or other, but for me, it was just HELL, and it's turned me right the fuck off of psychoactives. I'm scared to do mushrooms, LSD, ect. Terrified. I don;t suggest huffing glue to anyone. My story is %100 true, and it was even worse than it sounds in my description."
 ],
 "erowid": {
  "id": "9475",
  "citation": " TotalChaos. \"Reality or Illusion?: experience with Inhalants (ID 9475)\". Erowid.org. Nov 20, 2004. erowid.org/exp/9475",
  "substance": "Inhalants",
  "views": "17457"
 }
}
