{
 "id": 18742,
 "title": "A Euphoric Entactogen",
 "date": {
  "submission": "2012-02-18T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JBig30000",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:30",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:30",
   "amount": "75 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "A few nights ago, me and some good friends decided to try a RC that was new to us: ethylphenidate.",
  "I looked up its pharmacokinetics binding data, and saw that compared to its pharmaceutical relative (methylphenidate), it has a very high ratio of dopamine reuptake inhibition compared to its amount of norepinepherine reuptake inhibition. I believe it should be the most 'pure' DRI I've ever tasted, so I was looking forward to getting a taste of what increased synaptic dopamine feels like.",
  "We started off with bumps of 35 mg. It stings pretty badly, but not as bad per mg as some of the 2C's. We were enjoying a social experience, taking turns putting on music, and very much enjoying the presence of our friends. I felt talkative and relaxed. The experience was definitely more relaxed and enjoyable than my experiences with dexmethylphenidate.",
  "At T+1:30, we decided to try an additional 50 mg via insufflation. The effects were stronger, which was good because earlier I had been mildly disappointed that it wasn't stronger. More music and talking ensued during the next hour. Some long group hugs occurred, matching the empathogenic feelings we experienced. Holding friends close felt great, and massaging their backs as part of the hug felt great as well. It's worth noting I've never tried MDMA or methylone because of toxicity concerns, so 2C-B was my only other entactogenic experience. Another friend, experienced with both, described it as somewhat similar to coke and methylone, in that it was entactogenic and pro-social.",
  "At T+2:30, we railed 75mg more each. This time, the effects were even better! Strong stimulation, but not in a stressful sort of way. Very talkative. Music sounded great. Felt very appreciative to be in the presence of friends. All 4 of us have a great time, and agree that ethylphenidate is a drug that we'd definitely like to do again in the future.",
  "The fact that it's primarily a DRI and not a releaser makes me feel safe about having it in my brain. Ethylphenidate is a great find."
 ],
 "erowid": {
  "id": "94764",
  "citation": " JBig30000. \"A Euphoric Entactogen: experience with Ethylphenidate (ID 94764)\". Erowid.org. Feb 18, 2012. erowid.org/exp/94764",
  "substance": "Ethylphenidate",
  "views": "16015"
 }
}
