{
 "id": 18779,
 "title": "Trapped in a Thought Loop",
 "date": {
  "submission": "2001-09-17T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Daniel",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I took 1 pill in a friend's house with 3 more friends, 2 of them also took 1 pill. They were happy and talking to each other a lot. I felt very uncomfortable from the inside but I had no logical explanasion for it, so I simply waited for it to pass. Suddenly the bad feeling passed and immediately everything looked beautiful and I had very nice thoughts. My brain was thinking all the time about the experience I'm going through. Then, I thought to my self : Wait a second, the experience that I'm going through now, will it change the way I think and my reason, after it will be over ? Will my character be changed by something artificial ? I gave myself 3 answers: 1. Of course, but it's OK. there's nothing bad about thinking different for 5 hours.  2. Of course, because feeling different makes you think different, feelings can not be sperated from thought. and it's terrible. Thinking different will bring you to wrong conclusions and they will stay in your mind after the experience is over. Your personality is being changed by a drug.  3. Maybe yes and maybe not. Don't think about it because it makes you feel bad. think about something else please.",
  "It was very hard for me to think and I kept forgetting what I thought about a second ago, and as you realise such thoughts are hard enough even for a completely sane person. So I decided to put away the thought and think about it when the experience is over, and meanwhile enjoy.",
  "Then I thought : Wait, I can not just stop thinking about it, because if it CAN change my personality I must not let it control me, I must stay in control over it and not let it mess with my brain !!! I realised that I can not decide so I got to a conclusion that I was stupid under the influence. It made me feel trapped : If I am stupid right now, I can't decide if to stop thinking about it or not !! And what if something happens now that will make me have to think ? How will I decide what to do when I'm stupid ? Then I tried to seperate my brain into 2 : 1 for emotions and one for logic. Thinking about it got me to a conclusion that maybe I'm schizophrenic. And because I got to this conclusion I immediately got to a conclusion that MDMA makes you come to wrong conclusions. That was yet another prove that it makes you stupid and that I can't think or decide anything. I felt like the MDMA tries to let my feelings get over my brain so it tries to make me shut down my thought that bother my feelings, in a very tricky way of using my THOUGHT to make me stop using my thought, because it can't make me do it by raising my feelings themselves.",
  "At this stage I felt like I have to fight the drug and not let it control my thoughts. On the other hand I felt the MDMA telling me : Hey, stop being so hard, let go, all you need to enjoy is stop thinking. Look how bad those thoughts make you feel. Let go, let go. You will be so happy. Let your feelings control.",
  "I tried to let go, but my thoughts were also hard fighters and did not let me do it.",
  "I asked my friends to drive me home and tried falling asleep, feeling terrible.",
  "The day after I realised MDMA DOES change your prespective on things and can easily bring you to wrong conclusions so what I was afraid of was actually right.",
  "On the other hand, if you do it just once in a while how much can it actually change you?",
  "Probably a bit. Probably it worth the good experience. But thinking about it under the influence of it was so terrible and so hard, that I seriously doubt I will ever do it again. Especially realising that what happend in my concious, can happen in my sub-concious, and damage my brain when I'm not even aware of it."
 ],
 "erowid": {
  "id": "9493",
  "citation": " Daniel. \"Trapped in a Thought Loop: experience with MDMA (ID 9493)\". Erowid.org. Sep 17, 2001. erowid.org/exp/9493",
  "substance": "MDMA",
  "views": "19977"
 }
}
