{
 "id": 18775,
 "title": "Attentitive, Focused, Willing to Work",
 "date": {
  "submission": "2012-03-01T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Ritual Pants Dance",
  "gender": "Male",
  "weight": "73 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methiopropamine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:05",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methiopropamine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:20",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Methiopropamine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:50",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methiopropamine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:10",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methiopropamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I've been researching chems to ingest for the purpose of study over the last year. I've tried a few of the racetams, (pir, ani and oxi) finding that oxi gave me near photographic memory while piracetam seems completely inactive.",
  "I've been pricing ritalin & adderall but due to their unaffordability and unavailability in my location, i have turned to RC's. There is already a report online for MPA, but as I have read mixed and conflicting reports, I though I may as well try it myself.",
  "As a little background info, I'm well familiar with all types of drugs but I am not a stimulant kind of guy. I have bouts of mildish depression throughout my life and anytime I have taken any kind of stim in the past has usually been a bad time.",
  "With my particual brain chemistry, don't ask me what it is as I don't know even enough to speculate, whatever it is I never seem to become euphoric or love buzzy with any typical stims (coke, e, drone etc) but rather just become anxious and tired, in turn stopped taking them around 2 years ago. I am more of a hallucinogenic kind of guy and substances I have had great experiences with are LSD, nn-dmt and it's various derivitives, 25c-nbomes and my main love Ketamine. These are substances I never become paranoid or aggressive on, and oddly enough make me quite sociable. I am also a long time ganga smoker but have cut down dramatically in the last 5 months.",
  "Ok, so I had a little smoke last night and am little late to rise this morning. Theres lots to be done today and so after the shower it's go time. I had a good breakfast of porridge and an egg afterward. Washing down omega oil supplements (3, 6, 9, flaxseed & sesame) multivitamins and about 3g's of piracetam with green tea. I have weighed out 30mgs of MPA as a starter and will redose when deemed necessary.",
  "00:00 The 30mgs is spilled out. It's a fine powder and slightly clumpy. 30mgs looks like a big line so I split it. There is a mild burning sensation.",
  "+00:05 Could feel it within a minute. Slight increase in heartrate & that slight uneasy feeling I associate with stims has made itself present. Effects of the 15mg aren't very pronounced so I am now insufflating the rest of the line.",
  "+00:20 I'm slightly dazed. No euphoria or noticed increase in motivation or focus. Nose is running slightly. I can feel slight pressure on the sides of my head around the temple area. Am going to try and do some theory based lectures for the moment. Also from what I read on other reports, 30mg insufflated should be a sufficient dose for study without redosing for the next hour at least.",
  "+00:55 Have been fluctuating between cold and warm, trade mark sign of an RC? Nothing unpleasant though. Read 5 lectures. No noticed increase in retention though it could be argued, to early to say. I am definitely more focused and alert. Also noted a sudden increase in libido, and being a young lad, masturbation of course ensued. I noticed an increase in penis sensitivity, orgasm was good, not as good as sex though.",
  "+01:20 Feeling like I've possibly reached a platau. Redosing orally with 30mg.",
  "+01:30 Just dosed 30mg in a skin. Haven't eaten in 2 and a half hours. Also am drinking plenty of fluids. Worthy of noting also is that there is no perceivable pupil dialation.",
  "+01:50 Felt the brief fluctuation between hot and cold again telling me I'm up on the last dose. I'm seeing the same results as the last time, increased focus and alertness. I feel as though I'm on the edge of a kind of tunnel focus, so I have insufflated another 15mgs just to see the effects.",
  "+02:10 Marked increase in alertness, still no 'tunnel focus' per se. Am looking to rap this up so will have one final bump of 15mg.",
  "+02:10 Insufflated final dose of ~15mg. I'm still slightly cold, but i don't have those cold sweaty palms that could be associated with 'dirty' RCs or just RC's in general.",
  "+02:20 Even after dosing in relatively quick succession, I am still in the initial peppy, focused and alert state.",
  "To sum up. I think it's a useful substance. It's affordable, as I said I feel peppy, alert and focused and as the worlds greatest procrastinator with a goldfish attention span i'm studying no problem without distractions. When i say peppy, I don't mean speedy. It is not speedy at all, heartrate is steady, no pupil dialation and no 'wired' feeling.",
  "Also, I usually become very anxious when taking stims and must say I've experienced zero anxiety on MPA, just a slight coldness when coming up and very slight shake of the hand/muscle tension.",
  "No urge to redose at all.",
  "I'd use it for studying, subtle but effective."
 ],
 "erowid": {
  "id": "94912",
  "citation": " Ritual Pants Dance. \"Attentitive, Focused, Willing to Work: experience with Methiopropamine (ID 94912)\". Erowid.org. Mar 1, 2012. erowid.org/exp/94912",
  "substance": "Methiopropamine",
  "views": "12467"
 }
}
