{
 "title": "Surprisingly Potent",
 "author": "Likwid",
 "citation": " Likwid. \"Surprisingly Potent: experience with 5-MeO-DiPT & Cannabis (ID 18791)\". Erowid.org. Nov 11, 2002. erowid.org/exp/18791",
 "substance": "5-MeO-DiPT & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "11 mg",
   "oral",
   "5-MeO-DiPT",
   "",
   "",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "",
   " T+ 2:30",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I've done 5-MeO-DiPT twice before at decent doses. One at 5mg and another at 7mg. Both times were enjoyable, but nothing outstanding, and I got quite sick on the come-up and got diarrea to boot. I just assumed that nausea was part of taking 5-MeO-DiPT. Last night I planned to do it again, this time I expected to get sick and didnt care as it was never unbearable.</p><p>I had a light dinner and at around 9 pm I dropped 11mg of the 5-meo-dipt into a beer and downed it... Holy crap, its impossible to mask that taste!</p><p>An hour later I had a garbage can nearby to puke in just in case, but surprisingly I didnt get sick! No nausea, no noticable body load and I was getting comfortably high. From now on I'll take foxy an a half full stomach with a beer.</p><p>About 2 to 2.5 hours in I was really starting to enter that euphoric place and I took a big hit from the bong. It really helped smooth the ascent. Everythig, and I mean EVERYTHING was amazing! I've done MDMA tons of times and I am quite an experienced pshychonaut with Salvia and a handful of other substances, but this high was somehow more pleasant. It was intense and I started to trip to music (which sounded absolutely amazing) while watching the background on my desktop. The colors faded in an out and patterns were bulging and distorting. My clothing felt so good on me every time it brushed up against my skin. At some point in the euphoria I decided to try eating something, so I got some cake... It tasted better than it would have after a blunt. I had some slight jitters and every now and then the jaw clenching would show up, but nothing bad. I wished I could share this amazing experience with others so next time, I'll do it with some friends. I was blown away by the ecstatic intenity of the trip! My cologne smelled fantastic and I remember just sitting there staring at my morphing desktop with this huge grin on my face. This high lasted for a very long time. I didnt sleep until about 5:30 am.</p><p>i should also mention that sometimes sounds were muffled or seemed flat, and towards then end of the trip I had some slight tension in my neck, but that went away after laying on a pillow. At about 4 am I did have to go to the bathroom, and as expected I had the runs.</p><p>Overall I found my 3rd encounter with this substance to be exceedingly euphoric. I will definitely try this again sometime at the same dose.</p>",
 "year": "2002",
 "id": "18791",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-11-11T08:00:00.000Z",
 "views": "8244",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "11 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": ""
  }
 ]
}
