{
 "title": "When Its There, But Not Completely",
 "author": "SSY",
 "citation": " SSY. \"When Its There, But Not Completely: experience with Ecstasy (ID 188)\". Erowid.org. Feb 15, 2001. erowid.org/exp/188",
 "substance": "Ecstasy",
 "bodyweight": "138 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>We left to the rave around 1-1:30AM and didn't arrive till 2:15AM or so. Completely and utterly sober, we entered the venue, ready to breakout with whatever the night held for us. Immediately two friends were put on 'Roll Patrol' and went off searching for our dose of the commercially named 'ravers drug', Ecstacy. In the mean time, a few friends and myself proceeded to mingle through the dance floor, sliding through the crowd with slick motion, as to not disturb anyone already in a trance, till we found 'our' spot for the night. Then the focus on the music came and most other things became irrlevent once again and I let the music take me. Every so often I was broke out of this trance, but at this time it was my friend back with my roll. Unaware of what kind the pill was, I put it into my mouth, swallowed and continued my movement.</p><p>We left the venue early that night, we had come across quite a few other party goers that we had known from a few instances before and invited them back to my friends house to chill the night away with us and the gladly accepted the invitation. Once I got back into the van that we had driven there, it started. I started feeling weird, not like my heart was going to explode, or that there was something physically wrong with me, but I got the bad vibe. The vibe that you get when you are in a situation that you know is wrong, everything around you is wrong, you shouldn't be here, you should be somewhere else. I couldn't understand why I got this vibe, because I was around all my friends, everyone was smiling, no one felt this way but me, so I kept it to myself for the ride back to his house.</p><p>As I got out of the van in the driveway at home, my girlfriend, who was rolling for her first time, ran up to me and gave me a big hug and looked at me and asked what was wrong. All I replied was that something was wrong and I was going to lay down and she should go downstairs with the others. I didn't want my bad roll to affect hers, I have had many many enlightening experiences while on Ecstacy and I didn't want my bad one to make hers a bad one, becuase I thought she was enjoying herself quite a bit.</p><p>We walked inside and I made my way past the people standing in the entrance way to my friends bedroom where I figured I'd lay awake for a lil' while chillin and slowly drift off to sleep as the roll wore off. But instead she came with me.</p><p>At that point I was so afraid that I was freaking her out about me and that I was causing her to have a bad roll that I almost didn't want her in the room with me. I'm glad she stayed. I didn't move, but for a brief ride, out of that bed for the rest of the night. It was so amazing. Being there with her at that moment just blew the bad feelings away. We laid there in each others arms, me loving every second of her touch of the aura that she put off.</p><p>We never did more than kiss that night and I don't regret it. It wasn't about physical pleasure, it was about the connection that was felt, how one person made the other one feel. That feeling was so powerful and moving, I'd never felt anything like it. To this day, five of the seven nights of a week, I go to bed thinking about that night and recapturing just a bit of that feeling.</p><p>But there's an underlying secret in all of this. I love that drug, I love that girl, and in the end I know I can get that feeling by just being with her. The part the drug played that night was not to multiply my feelings for her, but to share in a world that just the two of us were in. It was a new experience for both of us (even though I had done Ecstacy before), I love the experience but even more important, I love knowing sober I can still get my 'fix' by being with her.</p>",
 "year": "2000",
 "id": "188",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-02-15T08:00:00.000Z",
 "views": "7461"
}
