{
 "id": 18802,
 "title": "Strong Visuals and Philosophy",
 "date": {
  "submission": "2012-03-08T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Vane",
  "gender": "Male",
  "weight": 76
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "15"
   },
   "substance": "2C-P"
  },
  {
   "time": "23:30",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "substance": "Methoxetamine "
  }
 ],
 "report": [
  "note:  Uncertain measurement of substance due to scale whose values are not as accurate as advertised.",
  "12.00 AM",
  "What I assume to be between 10-20 milligrams of 2c-p ingested.",
  "13.23 AM",
  "Very subtle hallucinations begin to manifest. Barely noticeable auditory distortions. Body load indiscernible. General mood is pleasurable.",
  "14.51 AM",
  "Trip comes on S T R O N G. Hallucinations are great and are getter profounder with the moment. Music is slowly becoming more meaningful and the tunes are adopting higher beauty. Other senses (taste, smell and the tactile) feel great.",
  "I believe this trip will be the strongest I have ever had.",
  "15.18",
  "Trip is frightfully overwhelming.",
  "15.22",
  "To tranquil, mystic music, the mind is put to ease. The trip is finally plateau-ing. After an incredibly intense and overwhelming come-up, the trip now promises HIGHLY insightful, philosophical ponderings in profoundly desirable environments.",
  "Deep sense of well-being presently occupying thoughts.",
  "16.24",
  "All through life, our senses conduct an eternal dance of synchronicity; smell coincides with taste, touch acts in concordance with sight. The complexity of this sensory superstructure is so enormous that it can not be fathomed; ever since the very beginning of a person it has been going on in harmonious synchronicity. This superstructure we know as reality.",
  "When an Entheogen is imbibed, it momentarily disturbs the concordance of our senses. Where the finger says there should be one thing, the eye sees another; touch no longer acts coincidentally with sight. The superstructure is no longer as complete as it may have seemed.",
  "And as the dance of the senses slowly yields, a glimpse at what lays beyond is granted. Sanity is only a structured mind, where the senses still conduct their symphony of synchronicity in perfect unison. No vocabulary can sufficiently describe what is glimpsed beyond when the senses no longer upholds reality. When the void of whatever lies beyond reality momentarily seeps through, the superstructure of life loses its balance.",
  "But the structure soon recovers; balance is restored; reality is complete again. Yet now the senses are aware of their own charade. Taste suddenly knows it masks something else; touch realizes it is merely an illusion; vision understands it is just constructing upon and adding to the foundations of the structure of reality.",
  "It could thereby be conceived why it is considered to be insanity when things do not appear as they should.",
  "Those who have never dared venture forth and disrupt the balance of their sensory synchronicities, are forever condemned to continue their lies in ignorance. They will also continue to advocate their self-fooling propaganda that drugs are evil.",
  "18.28",
  "Plateau is still the same, and I am getting just slightly bored with things. In a few hours I will dose around 30 milligrams MXE to rejuvenate the trip.",
  "Philosophical thoughts are maybe not quite as extreme as a few hours earlier, but thinking is still highly entertaining. I also note that, dissimilar from my experiences with MXE, where writing in general happens almost automatically and decently constructed sentences simply pour out of me, on 2c-p a higher sense of meticulousness forces me to construct each sentence thoroughly. Time-consuming, but at the time of course very interesting.",
  "These thoughts, I understand, are rather individual; they greatly stem from my fascination of writing in general.",
  "23.50",
  "The addition of 40 milligrams of MXE laid grounds for further insightful philosophy. The trip has gained even deeper meaning, and is now very smooth and pleasurable. I expect the decline to start in an hour or so, but that estimation may as easily be completely inaccurate. These are some of my thoughts during these hours:",
  "A mans intellect is not measured by his vocabulary; but his vocabulary is the only proper instrument he may use to communicate his intelligence to others.",
  "Vocabulary is to speech, as intelligence is to mind.",
  "(my native language is not English) I prefer thinking in English, because my vaster vocabulary in the language lends considerably more color to my thoughts.",
  "Entheogens help a man exhume and resolve insecurities, problems and fears so deeply buried within the subconscious it could be conceived he would otherwise never have been aware of their existence, yet paradoxically having suffered from them.",
  "Fear is the fear of fear.",
  "Fear is a wily circle; from wherever fear stems, it circulates once only to come back and notice itself being afraid of something, thus adding more fear to the initial fear  like a dog chasing its own tail.",
  "Imbibing drugs is tantamount to scaling mountains; the drug experience is equal to ascending a mountain, reaching its plateau and then descending on the other side. This is the analogue from which the drug-associated terms come-up, plateau, peak and come-down derive.",
  "If there is such a thing as a repressed memory, and if that memory can be brought to light using various techniques such as hypnosis, would it not be plausible to assume that every single thought and notion to ever have passed through the mind is accessible in some incomprehensibly large internal library, if one were to disregard every individuals ability to access repressed memories?",
  "Every man has at least one ulterior motif, whether subconscious or intentional.",
  "12.00",
  "At some point I fell asleep with hallucinations still dancing vividly, but I was rather exhausted both physically and psychically. I woke up at 12.00, +24, and I consider myself to be at baseline soon."
 ],
 "erowid": {
  "id": "95047",
  "citation": " Vane. \"Strong Visuals and Philosophy: experience with 2C-P & MXE (ID 95047)\". Erowid.org. Mar 8, 2012. erowid.org/exp/95047",
  "substance": "2C-P & MXE",
  "views": "4459"
 }
}
