{
 "title": "A Psychic Brain Freeze",
 "author": "Barabbas",
 "citation": " Barabbas. \"A Psychic Brain Freeze: experience with 5-MeO-DMT (ID 18809)\". Erowid.org. Nov 11, 2002. erowid.org/exp/18809",
 "substance": "5-MeO-DMT",
 "bodyweight": "255 lb",
 "report": "<p>My experience with psychedelic compunds has been so far very careful and controlled...I went into my experiments with an open mind and a purpose. I have tested several combinations and varying doses of several 'legal' substances and some substances I have either cultivated myself or synthesised with friends.</p><p>No experience short of my first low dose DMT trip could prepare me for my experience with this high a dose of 5-meo-dmt.</p><p>My first thoughts on this drug were that it would be similar to DMT because of the similar chemical makeups...I did not take into account the differing doses and took what could be compared to 'way too much'. At 17 mg's I thought I would get a common dose, much to my surprise the normal dose for smoking is about 5 mg's. Big mistake.</p><p>I loaded up a contraption I devised using tin foil as a melting surface and a funnel for smoke delivery. I covered the bottom of this funnel with the foil and heated the chemical with a lighter underneath. I slowly inhaled the smoke, it could be described as slightly chemical with the odor of synthetic grapes. I took two large lungfuls and held the second for about 10 seconds.</p><p>2 seconds after exhaling I began to feel an intense rush...as if my brain had just boarded a rocket, but had left my body behind. My entire body went numb and my mouth felt as if were on fire.</p><p>Another 2 seconds...oh my god...I feel as if the entire world is gone...I'm cold...it feels like a brain freeze such as when you drink a slushey to fast, except without the pain.</p><p>I lost total track of time, seconds seemed to go as slow as minutes...no real hallucinations except for an altered sense of depth...I can't control my body...it's as if I want to move slowly but when I move my hand it shoots up into the air wildly. Everything is strange and alien to me...I can't seem to understand why I have a mouth...or a tounge...my cat appears to be the wisest entity I have ever known.</p><p>About 5-10 minutes in....jesus I think I've driven myself over the edge...god is gone...people are only in my head. I do not exist in this world...I am dynamic...we live in millions of dimensions at once...countless ways of existing. Other beings are here...they are taking me somewhere...I feel as if they know what to do.</p><p>The creatures are grey and cold looking...if I open my eyes they disappear and I am in my room on the floor...I close my eyes...I need their help...I need them to help me get back.</p><p>20 minutes or so...I just left the aliens...they pushed me back into the coldness...I am alone again but I can feel my hands again...I can feel my heart and my breathing again..I think I'll be ok.</p><p>30 minutes...I found my way back...I am almost totally back and feeling more like I have smoked a mild dose of grass.</p><p>1 hour+...I am totally baseline again. This was 'way too much' for anyone. I felt almost a strange comfort in the void of coldness...sort of like being in a womb but without the feeling of connection...infact more like total disconnection from the world. I can see how this drug could be used to treat true psychotics to help them 'find the way home'. The dosage of this drug should be more around 10 mg's for a very strong dose...but no more than that. I found the experience to be less insightful than I had planned infact it felt a little more theraputic in a sense. If low doses of this drug were used ofver an extended period of time it could help more dissasosiative people find a connection to the world.</p>",
 "year": "2002",
 "id": "18809",
 "gender": "Male",
 "timestamp": "2002-11-11T08:00:00.000Z",
 "views": "12007",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "17 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT"
  }
 ]
}
