{
 "title": "The Ribbon of Life",
 "author": "Anonymous",
 "citation": " Anonymous. \"The Ribbon of Life: experience with DXM (ID 1881)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1881",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "1200 mg",
  "oral",
  "DXM",
  "(capsule)"
 ],
 "report": "<p>1200 mg of DXM were ingested on an empty stomach in the form of 40 Drixoral gelcaps.</p><p>Waiting for the effects to take hold, I worked on some noise compositions with my 4-track recorder. After about 45 minutes, I felt nauseated and as though I had a fever. I no longer had the ability or desire to concentrate on my compositions, so I set the recorder aside and lay back on the bed.</p><p>The naseau and feelings of vague but potent physical discomfort increased. I wondered if the dosage would be too much for me to handle. Some ten minutes later, I stumbled drunkenly to the bathroom and vomitted. The discomfort vanished almost immediately; I returned to bed, no longer afraid of being unable to handle the experience.</p><p>I do not remember how long it took me to become almost fully dissociated from my body, nor do I remember what happened during the process. Soon, however, I found myself beholding fully three-dimensional crystalline formations, the components of which rotated slowly in synch with one another. Behind the formations there seemed to be a void of infinite space, which flashed strobe-like in brilliant colors.</p><p>As the formations rotated, they changed and evolved, always producing beauty and symmetry with mathematical precision, determinacy, and clarity. Only vaguely aware of my body, I felt as though I was soaring through the patterns at unimaginable speeds. Gradually, I moved through the crystalline formations: they seemed to each contain the enormity of the universe itself.</p><p>My speed increased, as did the gradual loss of a sense of identity. The patterns gave way to more abstract but no less colorful patterns: wave upon wave of interference patterns, cyclones of flashing colors and spirals that swallowed me. After some time, the boundary between myself and the patterns dissolved almost completely.</p><p>Now my being -- which was really a universal 'we' as opposed to an individual identity -- seemed to contract into a single point then explode outward countless times, the infinity of space and time and perception and being contained within each explosion. 'We' were the whole of the multidimensional universe collapsing upon itself and exploding outward over eons of unimaginable time, terrified, relentless, ecstatic. Once in awhile the explosions resulted in vortexes, through which something utterly 'alien' seemed to emerge.</p><p>I recall approaching and merging with these 'alien beings' several times, though I do not recall what happened during the merge itself. One such being I recall only in association with a sense of vastness and strange angularity, like a huge mountain tapering to a perfect point.</p><p>Sometime later (I do not remember how long), a sense of identity as well as an awareness of my body returned -- at first in brief moments, then for longer episodes. During these moments, I asked 'who am I?' I received a flood of intuitive information, very little of which I was able to comprehend rationally. The gist of the matter, however, was that I was both an individual and the whole of creation; both the creator and the created, and that this is true for all beings.</p><p>Remembering that viewing my self and life from my first DXM experience had been one of the most emotionally profound experiences of my life, I attempted to do so again. Now I had a vision of myself as a ribbon or cord wrapped around itself and around other cords. The cords traced the history of my life, and once again I felt an all-encompassing compassion and love for that life, self, and everything within it. Again, I was aware of the possibility of abandoning it and not returning to it, and it struck me as the most precious of all things; I was even more horrified at the thought of leaving it than I had been on the first time.</p><p>To see if I could identify the 'cord' of another -- for the universe had become a network of these cords -- I 'called' to my friend Betty. I witnessed her cord and mine separating from a common cord, then rejoining each other in a dance or braiding, yet still retaining their separate identities.</p><p>This aspect of the experience was emotionally overwhelming in a way that I really cannot convey; when I chose to end the experience, I did so because I could no longer bear its sheer intensity.</p><p>I managed to open my eyes; the sunlight made the room appear maddeningly bright. I could recognize few features: the room was a patchwork collage of textures, shapes, and colors that were sparkling, glittering, and pulsating.</p><p>When I closed my eyes, it seemed I still had them open and was looking at the ceiling. I guarentee that I was not and to block out the light, I placed my elbow over my eyes.</p><p>Now what looked as though it were the ceiling gently fell apart into chunks of abstract shapes. The shapes 'morphed' into other ceilings of other rooms similar to my own. Just as each one attained such a level of coherency and clarity that I felt I would be able to stand up and walk around, the room would fall apart then reform into another. One such room attained coherency for longer than the rest; it was dimly lit, as though by candle light, and it seemed to be some sort of basement. There were three others in the room, watching me -- I wondered if I was experiencing some sort of alternate self, who was also experimenting with dissociative states, but in the presence of others. In this room, I was able to sit up for a moment -- how odd it was to sit up and look about me while still feeling the weight of my elbow over my eyes.</p><p>Two times, perhaps more, the rooms transformed into seemingly 'alien universes'. Once, I found myself beneath a tree of huge orange flowers. Each blossom had a face; three of them were watching me, remarking without speaking about what a ridiculous sight I was. Another time, I was running through a labyrinth of stones that were somehow plant-like and alive. I understood that I was searching for God within the labyrinth; the labyrinth seemed to reply that God could never be found within it, though the path I took through the labyrinth in my search _was_ God.</p><p>I still wondered, nonetheless, whether I could 'call' some representation of Divinity to my presence. The shapes formed an angular and somewhat abstract illustration of a female, crone-like face. The face, like the rooms, cycled relentlessly from one form to another. I tried to speak to the face, but the visions seemed too incoherent to produce a response -- though I got the impression the incoherency itself was an aspect of my own being.</p><p>After some time of this, I regained enough awareness of my body to stay in the here-and-now for as long as I chose. I managed to pick up and dial a phone to call my friend Libby to come by or pick me up -- I felt somewhat shellshocked from this experience and no longer wished to be alone.</p><p>Shortly after calling Libby, I couldn't remember whether I had actually called her, or, if she had, whether she agreed to pick me up. She arrived about forty minutes later; I staggered down the stairs of my apartment in what seemed like a dream from which I could not awaken.</p><p>The next few hours were spent drifting in and out of my body and of the crystalline formations with which the trip had begun. Each time I closed my eyes, I felt as though I shot through space terrifyingly fast. When I was able to speak, I attempted to relate to Libby the nature of my experience. I found it difficult to keep track of what I had just said.</p><p>After the DXM had worn off the point that I could move around on my own and interact with others in a somewhat coherent way, I smoked some marijuana. The THC had the effect of ending my grogginess almost immediately. I became extremely hyper -- it was not at all unlike a dissociated version of a cocaine rush. I felt as though the whole world had turned into a video game and I had tremendous fun rushing from room to room as though an animated character in some comptuer-game scenario.</p><p>After I'd settled down a bit, I tried again to relate my experiences to Libby. This time, a received a flood of rational knowledge about the nature of the manifestation of duality from unity, the emergence and nature of consciousness and of language. Still simultaneously hyper and detached, I spoke endlessly to Libby about these subjects, as though it was vital that she know them. She was blessedly patient, and, after I had come down more solidly, drove me home.</p>",
 "year": "",
 "id": "1881",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-16T07:00:00.000Z",
 "views": "7758",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1200 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  }
 }
}
