{
 "id": 18817,
 "title": "A Promising New Psychedelic",
 "date": {
  "submission": "2012-03-13T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Conductor",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "1000 ug",
   "administration": "buccal",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "First, some background. Ive only recently been getting into psychedelics, having previously only smoked weed, which I do several times a week. I have done shrooms twice now--both times were glowing experiences. Im very spiritually/mystically oriented, love to read, a nature lover, a contemplative. I spend most of my time alone or with my girlfriend. My interest in the psychedelics has stemmed from my interests in religious, psychological, and philosophical exploration.",
  "I was not taking any prescription medications at the time.",
  "I ordered several 500ug tabs of 25i. I decided to trip at the museum, so in the morning I stuck two 500ug tabs between my upper lip and my upper gum, around 9:30 a.m. I had smoked some weed the night before. The morning was gray and I wasnt in that great of a mood, but I was prepared to accept anything that the trip would bring, keeping in mind that I was taking a fairly low dose. I feel well-grounded psychologically, with an attitude of acceptance of any thoughts, emotions, desires that pass through me. This is been the main preparation for my forays into the psychedelics.",
  "About forty-five minutes later I reached the museum, and the 25i had started to kick in. I have never done acid before but had heard that 25i is similar to acid, and has some MDMA-like effects later on during the trip, so I kept referring back to what I had heard and read about acid, especially during the beginning of the trip. When I put the two tabs on my upper gum, a little bit had gotten on my lips (I had licked them and tasted a bitterness)--this probably contributed to the feelings of slight nausea for the first hour or so. Nothing unbearable, and I know next time to keep my saliva away from the tabs as much as I can.",
  "The classic breathing walls began to happen, all surfaces appeared to be moving, slowly turning. People's faces too. This was my first time experiencing something like this, so it was a little unnerving at first, but I soon got the hang of it. I had to sit down several times throughout the museum, mainly from the nausea. But I really enjoyed being surrounded by all of the people and paintings and sculptures--the whole world felt electric. I felt like I was swimming through an ocean of pulse and vibration. The modern art had a particularly strong impact on me. I usually dont feel much in the presence of modern abstract and non-objective paintings, but I felt a deeper understanding of these works. Eventually I decided to leave and go home, as I was feeling a little tired and felt like lying down and relaxing.",
  "On the way home, the train was filled with a ghostly light, emanating from the people. When I got home, I was so happy to be there, and I put on some dance music and danced around for a while. Then I did some reading, and watched some TV. I was very happy, still relishing the electric feeling surrounding me.",
  "I closed my eyes for about ten minutes, lying on my bed. The closed eye visuals were calming, expansive, and beautiful. Many of the images reminded me of some drawings of animals by Native Americans.",
  "An interesting part of the trip was reading David Lenson's excellent book On Drugs. I had begun reading it the night before, and had been really enjoying it. While reading Lenson's revealing descriptions of what it is like to be on different drugs, particularly the stimulants and the opiates, I felt, while on this drug, a deeper understanding of what these drugs feel like.",
  "I became frightened for a little while, a more potent fear than I usually feel when imagining myself on cocaine or heroin. When reading about heroin, I felt like I could stimulate the feeling slightly, and I turned on some Charlie Parker and heard his music in a richer way, while contemplating his heroin use. This fear tinged my trip periodically, but I had prepared myself to accept any emotions that flowed through me.",
  "A little later in the trip I turned on a sunny song that I have been listening to a lot lately, and I was struck to write my mom a little e-mail. As I sent it, memories of my childhood with her flashed through my mind, and I felt an enormous sadness thinking about how sad I imagine she felt when I left home for college. I cried for a good minute or two, and it felt wonderful. I then went to take a shower.",
  "Afterwards, it was about time for my girlfriend to come home from work, so I was excited to see her. As I went to see her, the visual distortions were pretty much gone, and I was moving in a quiet afterglow.",
  "All in all, the trip lasted about 8 hours.",
  "Conclusion: I would love to do 25i again, perhaps at a slightly higher dose. It felt very pliable to me, like anything I felt like doing I could do, enjoyably. I definitely sensed the importance of a congenial set and setting, as with other psychedelics, as there were several moments where I saw a dark path in my mind which I had enough control not to travel down."
 ],
 "erowid": {
  "id": "95147",
  "citation": " Conductor. \"A Promising New Psychedelic: experience with 25I-NBOMe  (ID 95147)\". Erowid.org. Mar 13, 2012. erowid.org/exp/95147",
  "substance": "25I-NBOMe ",
  "views": "14823"
 }
}
