{
 "id": 18810,
 "title": "Useful but at a Price",
 "date": {
  "submission": "2012-03-01T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lung Passage",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Ethylphenidate",
   "form": "powder / crystals"
  },
  {
   "time": "1:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Ethylphenidate",
   "form": "powder / crystals"
  },
  {
   "time": "2:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Ethylphenidate",
   "form": "powder / crystals"
  },
  {
   "time": "3:30",
   "amount": "12 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "powder / crystals"
  },
  {
   "time": "4:45",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "pill / tablet"
  },
  {
   "time": "8:30",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "8:30",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ],
 "report": [
  "I acquired this substance from an online source. Prior to taking any significant amount of it, I undertook to ingest a series of incrementally sized doses, starting with only 0.5 mg and slowly moving up to 20 mg over a period of days to ensure there weren't going to be any unusual reactions.",
  "The substance was a white powder, but under a microscope the crystals were clear and stick-like, like quartz but not as perfectly shaped, and they varied in size ... more like selenite crystals. Since the material was quite dense, it bulked up considerably when crushed. Insufflation of this small quantity caused little discomfort.",
  "2:00 PM - I dosed 20 mg ethylphenidate orally and sat down to do office work.",
  "2:30 - Not much is happening yet  maybe some first alerts, but they are very subtle.",
  "3:00 - Still not much happening so I decide to take another 20 mg.",
  "4:00 - Still not much happening beyond some minor stimulation so I decided to take another 20 mg.",
  "4:26 - Finally beginning to feel stimulated and a bit euphoric, but the euphoria is subtle.",
  "4:42 - I feel quite focused and I can multitask, getting my office work done and also some chores which provide a break from the daily grind.  However Im also feeling a bit of ickyness creeping in around the edges at this point, in that way stimulants are prone to cause, but this feeling is hard to describe. It's a sort of general malaise, nervous stomach  a feeling like I have to poo but I dont  a sort of hollowness in my gut  cracked out.  My pulse is higher than normal but nothing noteworthy, say about 100 bpm, where normal is about 65. My mouth is getting to be quite dry and I keep catching myself sucking on the room of my mouth.",
  "5:30 - The effects had continued to get stronger but have leveled out now and havent amounted to much beyond stimulation and mental focus, which are however, considerable at this point. With the exception of the initial part of the experience, dysphoria seems to be the other significant effect. Indeed the dysphoria is now beginning to increase, so I try snorting 12 mg as an attempt to stem the tide of the cracked out feeling and possibly reinstate some euphoria.  Im well aware that the long term prospects of this plan are hopeless. It's strictly a means to better understand the drug.",
  "5:45 - A mild euphoric feeling begins to overlay the cracked out feeling, however the delight of the euphoria is not quite as strong as the dismay of the crack-out, so although this is a better place to be, I still feel pretty much mediocre at best. In the least, Im continuing to get shit done. I can think and write quite clearly.",
  "6:45 - The euphoria gained from the snorted dose wore off rather quickly, so I retire from work and eat dinner without any significant interference with my appetite.  Since I was continuing to feel moderately crappy and still quite stimulated, I took 800 mg of gabapentin. ",
  "At this point, Im feeling pretty neutral about the experience. The stimulation allowed me to get stuff done, and there were some pleasant, mild effects such as chills and the very slight euphoria, but generally I found it to be inferior to methylphenidate, as the come-down is significantly worse and the duration seems to be shorter. I settle down to watch a movie.",
  "7:30 - The gabapentin is beginning to come on and I am feeling better. Although all the unpleasant traits of a come down are still present: hollow-gut, jitters, dry mouth, mouth sucking etc.",
  "9:30 The gabapentin hit me really hard and I feel pretty wobbly on my feet. However, I just had a very deep and therapeutic conversation with my girlfriend and talking came quite easily, so it seems with this combination at least, ethylphenidate might have some therapeutic benefits beyond just performance enhancement.  Gabapentin feels a bit like alcohol without all the stupidity and moronic behaviors, so it blended nicely with the stimulation. Clarity combined with relaxation is a good combo for conversation and the thought processes.",
  "10:30 I dose 50 mg of diphenhydramine with a stiff drink and I am able to sleep and wake up in the morning feeling fine.",
  "To summarize, this substance is useful as a performance enhancer, study aid etc. but it came with quite a price to pay. The vague sense of malaise during the peak of the experience and the rocky come-down afterwards really took away from the experience, and I would have disliked facing the come-down without any pharmaceutical or alcoholic mediation. Ill definitely have alcohol on hand in the very least if I decide to use it again.",
  "In terms of oral dosage, Id say this experience would compare to about 30-35 mg of methylphenidate, or in other words, it seems to be about half as strong, but in many ways it is not all that comparable of an experience.  Methylphenidate has been superior for me in the past in providing more euphoria and far fewer side-effects.  Ethylphenidate is not a substance I would have any interest in using regularly, but it might be a good backup if no other stimulant were available and I really needed to get a paper written for an important deadline."
 ],
 "erowid": {
  "id": "95093",
  "citation": " Lung Passage. \"Useful but at a Price: experience with Ethylphenidate (ID 95093)\". Erowid.org. Mar 1, 2012. erowid.org/exp/95093",
  "substance": "Ethylphenidate",
  "views": "13778"
 }
}
