{
 "id": 18832,
 "title": "An Enchanting Experience",
 "date": {
  "submission": "2012-03-13T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "astr1kx",
  "gender": "Female",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:45",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Note: Both people mentioned are small, average weight women, mid-late 20s. Neither of us had eaten in at least 6 hours. The author has a disrupted sleep pattern, having gotten >16 hours sleep in past 36 hours. The author also has moderate HPPD.",
  "Previous drug experience for author: 2c-e, 2c-p, 2c-c, 2c-i, 5-MeO-MiPT, 5-MeO-DiPT, DMT, psilocybin, MDMA, amphetamine, methamphetamine.",
  "Previous drug experience for author's friend: 2c-e, AMT, LSD, psilocybin, cocaine, amphetamine, methamphetamine, MDA, MDMA, ketamine.",
  "0:00 Friend and I each consume ~20 mg (first measured with a cheap scale, eyed-out after that) of 6-APB powder in capsules. Starting low to determine threshold.",
  "0:15 Perception is slighty different. Friend feels slightly euphoric, while I do not.",
  "0:45 We both consume another ~25 mg. Notice a very strong chemical smell/taste, despite it being in capsules.",
  "0:50 Friend has alcoholic drink, I have Red Bull and water.",
  "1:00 Music does not seem to be enhanced by substance, nor mood. It seems to just be a 'little extra something,' very mild. No tactile sensations. Things are sparkling in a way that reminds me of 2c-x substances, most distinctly 2c-c.",
  "2:00 I make the decision to drive us home, because friend has to be awake early the next day. I've consumed no alcohol. Friend has consumed ~3 drinks. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "Friend consumes another ~50 mg. Music seems to be slightly enhanced. No tactile sensations.",
  "2:15 Friend describes what she is feeling as 'the strongest roll I've ever had in my life, if I didn't know for sure this wasn't MDMA, that's what I would think it is.' She mentions mild nausea, which could possibly be attributed to being in the car.",
  "3:00 We return home. I consume ~30 mg.",
  "4:00 Out of nowhere, I go from feeling almost nothing to the most incredibly loved-up sensation I can imagine. Tactile sensations are moderately euphoric. Eye-wiggles present. My heart is beating at a high rate, but not uncomfortably so. Exactly as my friend had described, I feel as if I have taken MDMA, plus the mild-to-moderate visuals. Only slight disturbance in thought patterns, which may be attributed to being extremely overtired.",
  "6:30 Feel myself starting to come down. No crash. Very slight headache, slight gastrointestinal discomfort. No nausea.",
  "7:30 Euphoria is completely gone. Slight visuals (less noticeable than before) remain; seems to be an enhancement of my pre-existing HPPD.",
  "Friend feels very achy and nauseous, is unable to sleep.",
  "8:00 Able to fall asleep quickly and comfortably.",
  "12:00 Wake up. Very tired, visuals still lingering. No 'crash' feeling, no depression, no afterglow.",
  "All in all, I am incredibly impressed by this substance. After reading other reports, I had not expected nearly such a pleasant experience.  Very enjoyable entactogen, less stimulating than MDMA."
 ],
 "erowid": {
  "id": "95221",
  "citation": " astr1kx. \"An Enchanting Experience: experience with 6-APB (ID 95221)\". Erowid.org. Mar 13, 2012. erowid.org/exp/95221",
  "substance": "6-APB",
  "views": "5154"
 }
}
