{
 "id": 18838,
 "title": "My House Was Surrounded With Police Cars",
 "date": {
  "submission": "2005-07-06T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sparkie",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "450 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I was grounded, and I thought that if I tripped at least I wouldn't be bored. There were no trips around, but a friend suggested cough syrup or Dramamine. I never heard of the drugs, but I went to the store to supposedly buy tampons, and I got a box of Dramamine. I went home and popped 9 of the 12 pills, I was scared to overdose. They tasted worse than ecstasy, and after drinking about 5 glasses of water, I felt really sick. This feeling stayed for about 30 minutes, and I decided to go outside and check out the clouds to see if I was tripping yet (because the clouds are always the first thing I go to look at.) I lit up a cigarette, and all of a sudden I got this intense feeling of paranoia and I started thinking that the police were going to come and get me for underage smoking. Not long after I started thinking about this, I saw a car turning the corner, then like 50 more. Before I knew it, my house was surrounded with police cars. I freaked, ran inside, and told my grandma to go outside and see who was out there. She came in, looked at me really funny, and told me no one was out there.",
  "I went into the kitchen and peered out of the blinds, and all the squad cars were there with their lights on. I was incredibly scared, so I walked into my room, put on some techno, my blacklight and strobe light, and tried to forget about the police cars. But I kept looking out my blinds, and they were still there. I wasn't at my peak yet...what was to come was far weirder and scarier than anything I have ever done...but in a way I liked it also. I went into the living room (I like being around my parents when I am fucked up and they don't know itits like a game.) but when I walked out into the light, everything was 'BOOM' and 'BANG' like in the old Spiderman commercials or in cartoons when a character falls off a cliff and hits the ground. The outline of my parents was in green but their entire bodies were bubbles of BOOM. Each object was a different color, the couches had BANG on them with blue or something (I don't exactly remember) so I ran back into my room, the only place that I felt safe and normal. I think overall it was a very visual experience, and except for the nausea and paranoia, it was a pretty good experience. How I felt the next daylike absolute SHIT."
 ],
 "erowid": {
  "id": "9527",
  "citation": " Sparkie. \"My House Was Surrounded With Police Cars: experience with Dimenhydrinate (ID 9527)\". Erowid.org. Jul 6, 2005. erowid.org/exp/9527",
  "substance": "Dimenhydrinate",
  "views": "6398"
 }
}
