{
 "title": "Bad Trip!!!",
 "author": "Father of Secrets",
 "citation": " Father of Secrets. \"Bad Trip!!!: experience with 2C-B (ID 18841)\". Erowid.org. Nov 12, 2002. erowid.org/exp/18841",
 "substance": "2C-B",
 "bodyweight": "90 kg",
 "header": [
  "DOSE:",
  "50 mg",
  "insufflated",
  "2C-B",
  "(powder / crystals)"
 ],
 "report": "<p>I have tried a lot of drugs, always looking for the one drug that could make me feel like a GOD. And one day i found that drug, it was 2C-B. First time i took it was orally in a capsule and after about half an hour i start to feel numb in my fingers and toes.</p><p>Then suddenly like an explosion inside of me, it happened i felt so great so there are no words for it....I FELT LIKE GOD !!. I could see the music!!, I was one with the whole earth, nothing was a secret for me anymore.</p><p>I really loved this drug, and started to use it constantly. And never had any bad experiences (just coughing and the feeling to almost puke during the upset), this was the best days in my life. Then one day me and my friends decided to snort it up the nose, and then it all went wrong. First i felt a terrible pain like snorting up tabasco, then the time to reach the top only took about five minutes.</p><p>But this time something wasn't like before, i have always seen beautiful colours but this time it all went black. I couldn't longer decide what was real or unreal, i lost the connection to the real world. I could see the enemies i had in my life and i felt such a rage that it was frigtening.</p><p>Then my fear started to take over, and i had the need to run away....it was like in a war movie i ran in the woods dodging and running...then suddenly i felt my darkest secrets started to be revealed and all my friends stood around me and started to hate me and said they would kill me.</p><p>I remembered that i felt how one of them was killing me with a stone, and it felt so good so incredibly good... Remembered that i shouted out 'AT LAST!!!!!...'</p><p>Then i woke up and find myself lying in the woods, a bit bruised and frozen my brain started to come back to reality and i understood that it all happened in my brain and not in reality....</p><p>After this trip something had changed in my brain, i can't be with people that are depressed or having problems because in some strange way could i feel their pain. And my heart almost feels like someone took it and squeezed it in their hands...dont know why. Hope that it will end some day!!</p>",
 "year": "2000",
 "id": "18841",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-11-12T08:00:00.000Z",
 "views": "21312",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  }
 }
}
