{
 "id": 18849,
 "title": "How Can a Plant Seed Do Such a Thing?!",
 "date": {
  "submission": "2002-08-25T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Frank-E-D",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "seeds",
    "quantity": "8"
   },
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 ],
 "report": [
  "I have experimented with hallucinogens and other such substances many times in my life, this experience with HBW seeds was by far the most mentally intense experience of my life. A 13 hour voyage into the deepest and most unimaginable thoughts in my mind.",
  "I ordered the seeds off of an internet site and they were said to be 'potent'. After reading about suggested doses and what to expect from these HBW seeds, I decided to take 8 seeds ground up and soaked in water. I took more that was suggested, but I wanted to experience the full effect of LSA without any side effects. I was careless and got what I deserved.",
  "An hour into the trip I got that acid onset feeling in my stomach, that soon turned into nausea, but I was sitting most of the time in the beginning so it wasn't unbearable. I was experiencing very rapid eye movements, lights and colors were more defined, some 'breathing' was seen on flat surfaces. As I approached the third hour of my trip, the intensity was still increasing at a steady pace, I knew I was in for a night of pure insanity, and that wasn't far off.",
  "Somewhere between the 4th and 5th hour, I got locked into an ever expanding loop of unrealistic thoughts, aspirations, inspirations, etc. Paranoia to its fullest extent. I didnt know what to expect and because the trip kept getting more and more intense I didnt think it would end, and if it did, I knew I'd be changed. Time slowed down so much, half hour cartoons fealt like an eternity, to this day I still cannot figure out how or when one show ended and the other began. At one point I looked at the alarm clock and it was five minutes earlier than when I had last looked at it.",
  "The thought of that night, to this day, gives me the chills and sends me into a dazed state of confused thoughts. Would I do it again? Yes, but a lot less, the initial effects were desirable."
 ],
 "erowid": {
  "id": "9534",
  "citation": " Frank-E-D. \"How Can a Plant Seed Do Such a Thing?!: experience with H.B. Woodrose (ID 9534)\". Erowid.org. Aug 25, 2002. erowid.org/exp/9534",
  "substance": "H.B. Woodrose",
  "views": "15812"
 }
}
