{
 "id": 18850,
 "title": "Mother's Little Helper",
 "date": {
  "submission": "2005-07-06T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sassy",
  "gender": "Female",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "7.5 mg",
   "administration": "insufflated",
   "substance": "Hydrocodone",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "On a normal day I take 300 mgs. of Wellbutrin SR, 30 mgs. of Paxil, at least four 7.5 Lortab and one Vioxx. All of these are prescribed and recommended doses.  Despite the claims that Wellbutrin can cease cravings I still sometimes yearn for my past life as a meth (snorting) addict.",
  "There are many reasons why I choose to try and stay away from meth these days. Price, availability, afraid of being arrested, and after leaving my ex and 'the scene' I married a man who thinks taking three aspirin is living on the edge - and along with him came stepchildren. Notice I said 'try' because recently I hooked up with the ex and the meth.  Two small lines led to deathly illness the following day extreme dizziness, diarrhea, and intensely crabby feelings.  I had my stomach stapled six months ago and have dropped 90 pounds, so drug actions and interactions have changed dramatically for me. Due to this accelerated weight loss I spend most of my time feeling light-headed and can experience split second mood swings.  Not only do I want a little high now and then, I also need the energy and the positive mood to be Mary step mom Poppins.",
  "When my surgeon gave me Lortab I immediately crushed it and started snorting itbut I didn't feel any of the mythical euphoria, just a runny milky nose.  I scraped the lavender coating off my Wellbutrin SR one day but the overwhelming, nauseating smell of sulphur convinced me I couldn't put it up my nose. Yes, I tried to chew it but immediately threw up.  I cried to the surgeon that my stomach was too small to handle the Lortab and he handed me Oxycontin.  I chewed and snorted my way through a month's worth in less than two weeks. About five minutes after chewing a 20 mg tablet I would feel itchy and impatient in about thirty minutes, turning into a desire to sleep.  My eyes would NOT stay open in class, I couldn't speak clearly, and I was sure my husband could tell by my pinpoint pupils that I was not normal.",
  "I've been out of Paxil for two days, and last time that happened I broke down in anxious, inconsolable tears for about four hours.  I knew I couldn't make it through the day and be supermom without some help.  I found an unused bottle of Adderall, looked it up online and after getting really frustrated with seeing how Ritalin is used, rather than Adderall, I gave up and crushed the pills.  I took my 150 mgs. of Wellbutrin orally, crushed 3 ten mg tablets of Adderall and snorted away.  First, let me warn you that this is difficult to conceal as you will end up with a blue nose.  Have lotion and or makeup, and Kleenex on hand. I was pleased with the slightly sugary taste of the pills, and waited 15 minutes. Not much of anything, so I crushed a fourth Adderall and a 7.5 Lortab and snorted it all.  After being very meticulous about cleaning the blue tint from my nose, I jumped in the car to go to class.",
  "The day seemed very beautiful, I was a little warm in my clothes - and normally I am cold.  Driving was smooth, no anxiety over red lights or impolite drivers.  I parked in the garage and was distracted by finishing an assignment.  Time flew by as I sat and wrote on the paper, my handwriting slightly crooked and sloppier than usual. I realized I was all ready late for class and instead went to the library.  I felt a little of the old meth high, but it wasn't as powerful or happy.  Almost fell off the sidewalk once, and felt REALLY hot out in the sunshine.  I have peed three times since I snorted the pile of light blue dust, which is very unusual for me.  I feel really anxious, and highly annoyed with the crowd of noisy people, the clunking copierit's a good thing I'm not home with the kids.  Two hours after doing it, when I read from my notebook as I focus on the lines they become brighter, and whiter than the written lines around them.  I continually chew my lips (just like meth) and feel thirsty.  I don't feel satisfied and want to hide somewhere and try more of the combo. I hope I don't like it too much, Adderall isn't readily available to me.",
  "I'll never forget meth and I'll never stop loving itand probably, sadly enough never stop trying to find a legal and sneaky way to duplicate the euphoric high."
 ],
 "erowid": {
  "id": "9535",
  "citation": " Sassy. \"Mother's Little Helper: experience with Wellbutrin SR, Lortab & Adderall (ID 9535)\". Erowid.org. Jul 6, 2005. erowid.org/exp/9535",
  "substance": "Wellbutrin SR, Lortab & Adderall",
  "views": "53262"
 }
}
