{
 "id": 18852,
 "title": "Using Kava to Counter Marijuana Anxiety",
 "date": {
  "submission": "2005-07-06T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Chill",
  "gender": "Male",
  "weight": 97
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 drops",
   "administration": "oral",
   "substance": "Kava",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Just thought I'd share a nice experiment. As many do, I occasionally enjoy smoking Marijuana.  However, as I've gotten older I've found that I experience more paranoia or other types of mental discomfort when smoking, which is sometimes OK, but not as the rule. ",
  "At to counter those negative effects, I tried to drink some alcohol before smoking. This usually decreased the paranoia, but often left me too wasted and often I'd have a hell of a hangover the next day (I generally don't like alcohol...it hurts too much).",
  "So I started to look around for a better way to remove the anxiety related effects of Marijuana and leave the pleasant effects. I started to read about Kava Kava and figured since it is often used as an anti-anxiety medicine and is freely available it might work well.",
  "It does the trick. About 3-4 droppers of the standardized Kava does the job nicely.  Available at most any vitamin type place for about $10 for a bottle, the standardized version apparently adheres to a European law that requires standard strengh. Thus I suggest that one to insure consistency of effect.",
  "The normal dose is one dropper 3 times a day. I even though I use 3-4 droppers at once before smoking, I wouldn't advise using more in a day. I've read that over-use can cause skin irritations.",
  "I take the Kava about 30-45 minutes before smoking in a little juice, then fire up.  It gives you such a nice buzz and you feel really just totally relaxed and pleasant.  One subtle side effect is that you may really want to sleep about 3 hours after this, but you'll wake up refreshed and rested for sure!  This is a great approach for folks like me who are occasional weekend type users and just like to relax with a smoke now and again.",
  "The Kava is handy for general anxiety too...feel stressed...no problem have some Kava alone and it'll help to calm your nerves.",
  "Enjoy!"
 ],
 "erowid": {
  "id": "9536",
  "citation": " Chill. \"Using Kava to Counter Marijuana Anxiety: experience with Cannabis & Kava (ID 9536)\". Erowid.org. Jul 6, 2005. erowid.org/exp/9536",
  "substance": "Cannabis & Kava",
  "views": "18958"
 }
}
