{
 "title": "An Angel Fallen From Grace",
 "author": "Tabris",
 "citation": " Tabris. \"An Angel Fallen From Grace: experience with Methamphetamine (ID 18874)\". Erowid.org. Aug 29, 2007. erowid.org/exp/18874",
 "substance": "Methamphetamine",
 "bodyweight": "140 lb",
 "report": "<p>I'm 19. I'm male. Therefore, in my mind I'm invincible, right? That is how we tend to think. I've experimented with a variety of chemicals in my life; mushrooms, pot, DXM, amphetamines and coca leaves. On top of that, I'm a Liberitarian, and I used to believe that there wasn't any substance on earth that was evil, but it was the intent of the user that caused bad things to happen. That all changed once I tried crystal meth.</p><p>A friend of mine manufactures pure smokable meth crystals. I'd done it a few times before innocently, thinking it probably won't do me any permanent harm like the previous amphetamines I'd used. This time, my friend brought me a 80-sack of reddish crystals. I had already spent a lot of time reading about it, and I knew that just meant it was made with Pseudoephedrine and they just didn't wash it properly or something like that, but that it was safe.</p><p>I crushed the crystals into a small line (it only takes a VERY small amout to get me going on that stuff) snorted it, and began my high. That night I spent over at a friend's house cleaning up, going shopping and watching movies with him. Of course I stayed up into the next day (a workday mind you) and every 4 hours or so, I'd go out to my car and snort another line. All I could think about was that little baggie in my car, waiting for me.</p><p>This time was different though. Once I hit the 36th hour, I started to hallucinate. I was sitting at my cubicle and my arms looked 10 feet long. The world was spinning, everything was distorted. My heart was racing and I have a heart condition...I was worried that my heart would explode. I was wondering how I was going to get home hallucinating. Fortunately since I work in a call center, I didn't have to take any calls because no one called that last hour. I spent that whole time in my notebook writing one of the most chilling installments to that thing I've ever written.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Against my better judgement, I drove home because I didn't want my parents knowing I was on ice. I went to that friends' house after again, and I ran in the door and destroyed that extra $30 worth of ice as quickly as I could, before I lost the guts to do it. That was a saturday.</p><p>The following Tuesday I finally began to come down. I woke up, didn't eat breakfast like usual, (I've been dealing with anorexia for the past 2 years, probably made things worse), and I went off to get cigarettes and locked my keys in the van, and I just fell to my knees and cried. After a few minutes I realized that the back door was open still and I got in that way. I cried the whole way home and for the next several hours uncontrollably. The only thing I could think about was how much I wanted to die, and I didn't know why. My dad came home and talked to me for several hours, and I told him everything that was going on.</p><p>Today is Wednesday, and now I believe that methamphetamine is evil in of itself. PURE evil. It's taken me through the worst of hells the past days, and I thank whatever god there may be that I saw that before I got in any more. As it is, I'm still waiting for my cognative functons to return to normal. I find myself horribly frustrated because I can't construct a sentace without thinking about it first. I have all these ideas and I get horribly frustrated trying to comunicate them. It's getting better right now, but I've only done meth 3 times.</p><p>I never believed in evil before I came across this, but I just can't put it any other way. Meth nearly swallowed my soul. I looked the devil in the eye and spat in his face. I'm just glad I didn't have to pay a higher price like some of the people I've known before now.</p>",
 "year": "2002",
 "id": "18874",
 "gender": "Male",
 "timestamp": "2007-08-29T07:00:00.000Z",
 "views": "10111",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ]
}
