{
 "id": 18873,
 "title": "Trying to Figure Out Who's in the Mirror",
 "date": {
  "submission": "2005-07-06T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alex",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "48:00",
   "amount": "6 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "On a summer afternoon, a day or 2 after a toil with ecstasy which had me using about 20 or so pills ( yes 20 or so pills )I decided to smoke some weed to make the stomach cramps go away because I get extreme cramps after doing a lot of ecstasy.  I was also experiencing a lot of body cramps from over exertion.  So anyway, I smoked the buds on my kitchen counter with a keychain mini bowl my friend got from a convenience store.  it was perfect.  I started feeling pretty high within the first 20 minutes but all of a sudden things got really odd and creepy.  I concluded that the reason everything was getting so damn visually weird was because when you do a high dose of ecstasy, its like the minimal after effects of acid, like things are still moving around a little but its not considered tripping.",
  "Well, once the weed started to really kick in, it was as if I took about 4 hits of good acid.  I couldn't believe what was happening, I was just looking at everything melt off my field of vision.  Everything was all wavy and it was like I was looking at heat wave distortion.  A friend had called and asked if I wanted to go to the mall with her so I said yeah of course cuz I thought it would be cool to go to the mall tripping the balls I was definitely tripping.  I went into the bathroom to mess with my hair and I looked in the mirror. wow was that the biggest mistake I ever made.  I think it took me about 5 minutes to figure out who it was in the mirror.  I knew it was me, but I looked so much different than usual.  It was as if I never seen myself before and I was looking for the first time.  I started blurting out things to myself in the mirror like wow you're fuckin ugly, do you act Italian, and wondering how anyone would ever want to look at me.  I started to get really scared just looking at myself seeing every little thing that makes up my personality.  I was getting visions of my true self and seeing exactly what I really was.  IT SCARED ME!! I don't look at myself the same anymore!! I never went out with my friend that day because I ended up standing in my bathroom for a few hours. Unless you wanna see what you really are, don't look at yourself in the mirror!"
 ],
 "erowid": {
  "id": "9548",
  "citation": " Alex. \"Trying to Figure Out Who's in the Mirror: experience with Cannabis (ID 9548)\". Erowid.org. Jul 6, 2005. erowid.org/exp/9548",
  "substance": "Cannabis",
  "views": "3519"
 }
}
