{
 "id": 18887,
 "title": "Asperigantz",
 "date": {
  "submission": "2012-04-12T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Koolumb",
  "gender": "Male",
  "weight": 87
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1500",
    "unit": "ug"
   },
   "administration": "oral",
   "substance": "2C-I-NBOMe"
  },
  {
   "time": "4:00",
   "amount": {
    "number": "1",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "As of this trip, I am 19 years old, 192 lbs and have experimented with this substance (nbome) over 10 times in the past and have had largely positive experiences with it. My last experience was six days prior to this one.",
  "This time, in the beginning like my previous experiences was very deep and entertaining. However, roughly 4 hours into the trip I proceeded to smoke around a gram of weed with no tolerance and soon my trip became very confusing and unlike any other I've had before.",
  "I have used cannabis and nbome together in the past, and they usually don't conflict too badly, although I typically begin to smoke towards the end at the 7 hour mark.",
  "I would have documented the the experience prior to the cannabis, however the time dilation as well as shock of the event has made me largely forget it as well as a huge portion of the trip which I am still in the process of remembering.",
  "What I do have, however is a log I managed to type up while lost in that unforgiving state of mind which to me appears to be a log of my thoughts during my time. It's presented here in it's raw unedited form.",
  "Nothing makes sense anymore...",
  "Is this hell?",
  "Asperigantz?",
  "When logic is no more...",
  "Horror, fear, lots of it...",
  "A world of Nostalgia and childhood worlds...",
  "Nothing makes sense... none of it. I've snapped.",
  "There is no such concept as the ego.",
  "It is a fabrication.",
  "Reality does not make sense, therefore it does not exist.",
  "Asperigantz? What is that?",
  "This place. It's so familiar, like i've seen this place before.",
  "This alien world where nothing simply happens to make sense.",
  "Haven't I been here before? What, a thought loop.",
  "Oh, so this is a thought loop.",
  "Fuck, I haven't broken out of it like I normally do.",
  "Wait a minute, what is a thought loop?",
  "I feel that's asperigentz... what ... is asperigentz?",
  "It strikes fear in me.. and remembrance... nostalgia as well...",
  "as if this fear is the same as when I was born when nothing made sense... as a baby.",
  "So, does that mean reality is hell?",
  "I don't think so. Although I don't feel as if I am.",
  "How long have I seen hell? This is terrible. It's all encompassing...",
  "This other being... my other self is tormenting me.",
  "Why does all that does exist that makes sense, not make sense?",
  "It all feels so fake...",
  "But it all feels so real...",
  "As if the reality I used to know was just an illusion from the very beginning.",
  "My other ego is tormenting me, insanity is my world now.",
  "I feel as though we are coming together now.",
  "Communion maybe?",
  "Reality is coming, Nostalgia still present.",
  "Why is it that words are no longer sufficient to express my situation,",
  "Have I seen the devil?",
  "Nothing seems good.",
  "Pleasant even.",
  "My sense of reality is gone. Apparently this world of insanity is asperigentz.",
  "Everything looks weirder and weirder.",
  "Why do I know this place?",
  "I've been here before... forever...",
  "This state of mind... i've left it... and thought it forgotten.",
  "This is the same state of mind as when my dad died.",
  "Nothing simply made sense anymore.",
  "Wow, how raw... this feeling... of bitterness...",
  "I thought i've left behind this beast a long time ago...",
  "This forgotten child... a former me... who no longer wished to be",
  "Every moment I am replaced... every moment i am gone...",
  "I do not exist...",
  "At least for not more than a moment.",
  "Asperigentz.",
  "This is a fear that resides in me. A world that I remember.",
  "I feel as though I could cry, but bear no tears to weep from.",
  "When someone close to you dies, and a huge reality hole opens up.",
  "How do you fix that? But before that, what is this reality I remember?",
  "I've seen it time and time again and I cannot figure out why?",
  "Sexual excitement brings union, what, love, marriage?",
  "It brings order.",
  "I cannot believe I have lost my sanity,",
  "What is this place? What can I... where I used to be...?",
  "I've lived this reality for a long time... it's the reality you enter...",
  "when you sleep...",
  "That horrible reality.",
  "Time has become my greatest executioner...",
  "Aeons of Insanity... seconds of Reality...",
  "I want it to end.",
  "But I don't.",
  "When will the sun rise?",
  "When it rises, everything will be alright again?",
  "Why is that?",
  "With the sun comes sleep.",
  "The children must stop laughing.",
  "They're always laughing.",
  "But they're not real.",
  "The laugh isn't real.",
  "It's not real isn't it?",
  "The walls of Reality, where are you?",
  "I have died and been born upon it to witness it a thousand times.",
  "Asperigantz why do you torment me...?",
  "Sanity no longer ceases to be, allow me to cease to be.",
  "I can do everything except die.",
  "I know how to do everything except die.",
  "But if I die, i'll come back to this place again.",
  "They're stairs... a sense of space?",
  "I'm not the one in charge.",
  "Everyone else is?",
  "It feels like an old house...",
  "Lost and exploring in a place I never knew, forever, endless...",
  "Music founds all my logic...",
  "Maybe... music...",
  "Why is that beings with no groundings in reality make the most sense...",
  "I understand it...",
  "I just don't care...'",
  "I miss her.",
  "Asperigentz, please leave me."
 ],
 "erowid": {
  "id": "95603",
  "citation": " Koolumb. \"Asperigantz: experience with 25I-NBOMe & Cannabis (ID 95603)\". Erowid.org. Apr 12, 2012. erowid.org/exp/95603",
  "substance": "25I-NBOMe & Cannabis",
  "views": "5517"
 }
}
