{
 "id": 18881,
 "title": "Extended Bliss",
 "date": {
  "submission": "2012-04-08T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "mindspelunker",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  },
  {
   "time": "4:30",
   "administration": "insufflated",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  },
  {
   "time": "6:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": ""
  },
  {
   "time": "7:30",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  {
   "time": "11:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": ""
  }
 ],
 "report": [
  "Im writing to share a recent encounter with the aloof, shape shifting 6-apb.  It seems as though there is an unfortunately small quantity of reliable experience reports out there on this relatively new substance.  Im fully aware that the RC grey market makes it extremely difficult for all but the most highly equipped chemists to know for sure what one receives in the mail.  However, the effects and duration of the substance I write about here is only consistent with those reports I consider most credible.  I have one prior experience with 6-apb at a similar dose and effects about one year ago.  I have extensive experience with the whole alphabet soup of RC entactogens including MDMA, methylone, mephedrone, flephedrone, MDPV, BZP, TFMPP, and MDE. ",
  "This experience took place with four good friends on one of the private islands in the San Juans of Washington State.  Everyone took psilocybe mushrooms that afternoon except for my self.  I was in good health and good spirits at this time.   ",
  "T+0:00:  At around 12:30pm I dissolve around 200mg 6-apb, weighed with a precise mg scale, into a glass of cranberry juice, which I consume over the next 20mins while waiting for my friends to consume their shrooms.",
  "T+0:30:  I start to feel a light crispness settling over me, similar to a high dose of pure MDMA.  I also begin to feel some mild sensory distortion, mostly enhancement of colors and slight fluctuance of patterns.  I have a congenital retinal defect, so patterning is very common for me even with substances not typically associated with such effects.  We leave our cabin and walk down to the shore below.  It had been raining earlier, but the clouds were thinning and the sun was starting to radiate down on us with the sort of perfect timing that often seems to happen while catalyzing consciousness in the outdoors.  We then wander through the woods up a hill and find a flock of the many sheep that freely roam this island.  Its a beautiful spring day and the new lambs seem to be delighting in the warm rays as well.",
  "T+0:45:  While watching the flock the full effects really start to hit hard.  Essentially, Im feeling blissed out of my mind.  With each crisp ocean breeze comes another wave of immense joy and sensual decadence.  I remember all the great rolls Ive had in the past.  Im so grateful to be here at this moment, with these wonderful friends, on this beautiful island in the lush Pacific Northwest.  I am also able to reflect upon current challenges in my life, while still feeling love and compassion for myself; something I typically struggle with in day to day life. ",
  "T+1:00:  By this point Im peaking and it becomes difficult to measure time for the next few hours.  Time dilation is considerable.  We wander further through the forest to a hidden lake, then down to a sunny beach.  We lay on the warm pebbles looking out across the water to the other numerous islands.  Im enjoying conversation with my friends, whom I keep reminding of how amazing I feel right now.  I try to keep in mind that they are on a different substance; one that personally makes me introverted, so I try to be sensitive to this.  I trust that the enhanced empathy I perceive will keep me cued in to their needs.  Everything looks beautiful and I take many photos.    We eventually wander further down the beach, stopping often to climb trees or catch little crabs living under the rocks.  We are especially entranced by the majestic madrona trees that hang from the sandy cliffs.",
  "Eventually we clamber up one of the bluffs, at the top of which we find ourselves in front of a house in which a family is cooking dinner.  They notice us and we quickly move on.  One of the members of our group has spent many summers on this island and he leads us across a dirt path and through a gate into a series of extraordinary gardens.  There are Japanese tea gardens and carefully pruned English style gardens.  We can hardly believe that weve come across this sanctuary.  After giving some time to soaking in this Eden we return to the dirt road and back to the cabin. ",
  "T+4:30:  At this point I am past the peak, but still rolling hard.  I only have around 80mg of 6-apb left, not enough for a full future dose, so I decide to insufflate the rest of it.  I put some music on the house sound system, lay back in a comfortable chair, and drift away.  Some of the artist I listened to that evening include Four Tet, Pantha Du Prince, Shigeto, and John Talabot.  One feature of this substance that stands out among the other entactogens is its ability to induce a sort of meditative trance or lucid dreaming type of state in me.  Of course when Im dancing for hours on MDMA I can drift in to trance-like states, but typically not while just lying down.  It is also not the same as the inner realms I visit while on psychedelics or ketamine.  I go in and out of imaginative worlds, riding on a soft cloud of ecstatic bliss.  Im acutely aware of my breathing and how it can carry me to new heights of euphoria.  ",
  "T+6:00:  I take 20mg citalopram.  Since it is known for reducing MDMA related neurotoxicity I hope this effect will apply to 6-apb as well.  I also drink some Naked berry juice to help replenish antioxidants and calories after six hours of intense serotinergic exercise.  Im still going strong at this point, although I can feel myself drifting back towards earth.  This happens in waves, with gentle falls and then rises again.  Controlling my breath helps with ensuring a smooth landing.",
  "T+7:30:  Im still feeling quite stimulated and music is enhanced, but the experience is definitely wrapping up.  I start drinking red wine to help cushion the fall and again for antioxidants. ",
  "T+9:00:  I make the mistake of trying to each a steak burrito with the rest of my friends.  I think there was still significant gastroparesis at this time since neither the wine nor burrito seemed to be moving along.  I became nauseous and attempted vomiting without success.  I was beginning to feel pretty drained at this point.  I wouldnt go as far as depressed, but just mentally exhausted.  I had to lie down for a little while and wait for my stomach to take its course.  I eventually feel better and end my evening drinking a beer with friends down on the beach with a roaring fire.",
  "T+11:00:  I take 10mg zolpidem and go to bed.  I lay awake for about an hour, tired but with images constantly flashing across my mind. ",
  "T+12:00: I take 10mg more of zolpidem.  I have a light restless sleep with those sorts of repetitive dreams that I get whenever I have a fever or am coming down off psychedelics/entactogens.  I get up seven hours later and start preparing for our departure home.",
  "For the next two days I felt drained in the same way I do after rolling on any of the entactogens.  It wasnt really any better or worse.  That sort of unmotivated low energy that happens after a major serotonin depletion.  By three days out I was good as new.",
  "Overall, I have really enjoyed both of my experiences with this substance, and hold it among the best MDMA experiences Ive had.  Its the duration of this substance that makes it stand out and really convinces me of its authenticity.  Both times the effects have drifted into the 7 or 8 hour range; far longer than any of the other entactogens I am familiar with and a characteristic consistent with the most credible experience reports out there.  It also has a mild psychedelic tinge without being all out psychedelic; another distinction.  Its unfortunate that this substance has gained a reputation for mislabeled or inconsistent products, since I believe it holds a lot of potential.  Perhaps in the future more reliable or transparent means of acquiring this novel compound will become available."
 ],
 "erowid": {
  "id": "95568",
  "citation": " mindspelunker. \"Extended Bliss: experience with 6-APB (ID 95568)\". Erowid.org. Apr 8, 2012. erowid.org/exp/95568",
  "substance": "6-APB",
  "views": "11539"
 }
}
