{
 "id": 18889,
 "title": "Flipping 2C the Truth",
 "date": {
  "submission": "2012-10-14T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "whirlwind",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Amphetamines",
   "form": "daily"
  },
  {
   "time": "0:00",
   "administration": "",
   "substance": "Tryptophan - 5-HTP",
   "form": "daily"
  },
  {
   "time": "0:00",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "powder/crystals"
  },
  {
   "time": "0:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "0:45",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "3:15",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "powder/crystals"
  },
  {
   "time": "6:00",
   "amount": "2 mg",
   "administration": "oral",
   "substance": "Lorazepam",
   "form": ""
  }
 ],
 "report": [
  "Background stuff: I have a prescription for Dexedrine and average ~20mg daily and smoke maybe a half gram of weed a week. I take 5-HTP daily which I believe is important for any phenethylamine user, especially for users of entactogens of the MDxx class. I am in good physical and mental health.",
  "Ive taken a good number of prescription stimulants, painkillers and benzos (all usually in moderation), plenty of psychedelic phethylelamines and a few of the more common tryptamines (but not DMT yet!).",
  "On a Friday evening friends T, C and M trickle in to join my ex girlfriend H, my roommate J, and myself in our living room. T and C brought beer which always makes me a bit weary. Whatever floats your boat!",
  "Im feeling optimistic and hope to lose myself in what I believe will be a larger dose tryptamines tonight.",
  "T+0:00  At 7pm semi-drunk C and M munch 3.5g P. cubensis each while T and I down 18mg and 22mg Psilacetin respectively. I was hoping to get the effect of ~4-5g dried cubes. H and J stay sober/smoke some weed, play magic and witness the events of the night unfold.",
  "T+ 0:20 First alert. Im getting excited as it has been quite some time since Ive had a tryptamine experience. Listening to some Wavves on the sound system and its feelin upbeat and groovy.",
  "T+0:30  The other 3 trippers go outside for a smoke and to lay in the grass. I smoke some weed inside with H.  This seems to catalyze the onset of the psychedelic.",
  "T+0:45 The others come inside and Im sitting in the recliner. I take my MDMA and it takes a bit of courage as my brain is all over the place at this point. Shit is getting intense for me and the vibrations from everybody, constantly walking around are distracting so I announce Im off to my room to watch some brain movies.",
  "T+1:05  Im my room checking out some of Shulmans work (music). M peeks in to ask if Im alright to which I respond in a fraction of a second I am excellent! No more distractions. I roll around my bed a bit trying to get comfortable but back pain I have from a herniated disk is becoming my primary focus, which totally sucks. When I close my eyes my pain will take a shape depending on my bodys position. Im still not quite able to be as immersed in visuals as I was hoping. The overall effects of this dose feel like maybe 2.5g of dried cubes to me.",
  "H walks in and I tell her she can/should hang out with me. She lays in my bed with me for a bit and it feels really nice. I can tell shes watching my face as my eyes are closed. Reluctantly I tell her it bothers me a little bit. Shes impressed by how dilated my pupils are. She asks if I have a thermometer and takes her temperature (its normal) and I try to take mine but I probably messed it up because its below normal when Im probably starting to cook. I hug her for awhile. I can feel myself sinking into her, just a little.",
  "T+1:25  H leaves my room and I lay around for awhile longer, thinking about how great she is. We are in limbo in our relationship. It has caused both of us much pain in the past, but we both love each other. Its difficult.",
  "Im pushing a strong ++ by now but my back pain is still messing with my trip.",
  "T+1:50  The MDMA has started to kick in really good, blasting away my back pain, among other things, while not increasing overall impairment all that much. Now I start to feel bad about not being with my friends, cant really get much introspective thinking done. This is an easy fix.",
  "T+2:15  I go back out to the living room to socialize. T, C and M are outside again. J tells me M is a sight to see; he is having some type of sensory/emotional overload. I take a hit of grass. They come inside M is totally interconnected with his surroundings. Tears are streaming from his eyes, and he is on the living room floor exclaiming his deep love for all of us. He wishes he could hug everyone at once. Its truly a magical and heartwarming sight. His emotions are hemorrhaging out of him all at once and he is existing in a state of complete, utter bliss and satisfaction. I believe I am witnessing a ++++ experience. This sight drives me up to a +++.",
  "M mentions a friend of mine, K, that he thought was a great person and asks a few things about him. Because I can see that M is eating up raw emotion at this point, I tell him about Ks best friend who recently died unexpectedly one morning due to unforeseeable circumstances. M sobs deeply and feels Ks pain. I grab Ms forearm arm firmly, handshake style; he reciprocates. It feels great and powerful and our flowing mutual love and friendship can be felt. I put my hand on Cs knee, whos sitting by me, but hes not so into it.",
  "I apologize to J for having a temper with him when I picked him up from the bars the night before. I look H in the eyes and tell her that I dont mind her looking at me anymore, not one bit. Since M is really making a scene with his silent emotional hemorrhaging on the floor, I ask if it bothers him that Im watching him. He thinks about it and says I guess not because it means that you care about me, and I can tell he begins to think of me. He says that we should be thankful for making eye contact because in that, we are acknowledging each other as a person.",
  "T+2:40  C is starting to concern everyone. He is always standing around awkwardly (hes a big dude) with a cig in his mouth and it always seems to be looking for something (usually his lighter) with a totally lost expression on his face. Several times we ask him if there is anything we can do to make him comfortable. I feel bad for him. But he knows I have benzos and all he needs to do is ask. I wish he would tell us what he was feeling.",
  "The trippers go outside again, myself included and I love the feeling of my bare feet in the grass and the bark on the tees and the cool night air. M is pressed up flat against the house tuning into something that I cannot detect. We sit in some chairs and I hand C a lighter and he lights a cigarette looking satisfied then  hands it to M who is reluctant to put nicotine into his body. We each take a drag anyway, for the experience. I dont notice much. I think C is a little more comfortable outside, but my feet are getting cold.",
  "T+3:15  Inside T is playing chess with J. I wonder how psilocin alters ones chess tactics. I suggest M, C and I go into our loft and roll around on the carpet. M thinks this is an excellent idea. I throw on some tunes and M and we meander around the floor like babies. M asks C and me about our heritages, truly interested. We decide C was build for survival in some seriously adverse conditions. His forearms are easily thicker than my calves. M decides that his tall, lanky Scandinavian frame was best suited for shooing enemies away with some type of pointed long stick.",
  "M and I lay on each other on the floor, I guess kinda spooning, because embrace feels so perfect. We express love and appreciation for each other once again. Im glad to notice that M seems healthy and has put on some muscle mass he had lost in years past. We talk about how being in a fraternity in the past has caused homophobic feelings for many, something we clearly managed to get past. C looks uncomfortable and suggests we go downstairs.",
  "I decide to take 45mg of 2C-B, double that of my previous largest dose. Before going downstairs offer it to the others. C accepts but I dont really trust his state of mind. I give him 15mg anyway. I dont like making decisions about what drugs others take but my friends put a lot of trust in me as I am the most knowledgeable of us in that field. I should have seen that there was no turning his trip around at that point.",
  "T+4:00  Not surprisingly C finally admits this night has been really tough for him and asks for some benzos so I give him 2.5mg Lorazepam and send him up to the loft to try to sleep.",
  "T+4:40  Eventually T and H leave. M and J start playing Civilization V on the big screen and its visually breathtaking with the 2C-B, particularly when detail is loaded into the scenery as the player zooms in and out. The new lines that come with the detail instigate some nice visual effects. ",
  "C comes downstairs and says it was scary by himself and some other random things, the Lorazepam should be kicking in harder in a bit. I give him potato chips for some reason and he downs them all. I go into my room to try to read pages form Tom Wolfes The Electric Kool Aid Acid Test. The writing style is really something else but I cant read very well at this point. I think of what it would be like to be in the Haight-Ashbury movement of the 60s. I naturally think it would be awesome. C goes back up to the loft. Yay Ativan.",
  "I spend the next couple hours doing this and that; smoking weed, checking out what familiar music sounds like, sometimes checking on the Civilization game. The 2C-B seems to have the largest effect on my vision. I must be getting some serious eye wiggles. M does this interesting thing where he pops Ritalin after shroom trips to feel alive and mobilize his wonderful experience. He has also been drinking his own urine to bring back the trip through the re-ingestion of unmetabolized psychedelic material. He is really chatty regarding the game, having a great time making analogies of real societies and being weary that J will wage war on him etc. Its funny. I can tell pretty quickly after he drinks his urine that it does have an effect on him; his eyes begin tearing up again and conversation is directed back towards loving things and how much he values his friends, but nothing like his initial outburst. After J goes to bed I eat some food and have a nice talk with M. He apologizes for many miniscule things that he believes he did to me in the past, most of which I dont remember or consider insignificant. He compares me to Jesus among our friends and its really an ego trip at this point.",
  "T+6:00  I really wish I could read this book but my eyes just wont focus. Im getting a little bored. After browsing the internet and then enjoying some mild CEVs I pop 2mg Lorazepam and let myself drift away into a peaceful semi-psychedelic rest. Probably fell asleep around 4:30am. Id be lying if I said I didnt know my night would end like this after taking the 2-CB so late in the evening.",
  "In retrospect the two worst things were my back pain and Cs negative experience. I feel he could have helped things if he would have communicated his feelings with the rest of us.",
  "Im not sure how well opiates work with tryptamines, but without pain relief, I would be reluctant to take a large dose of psychedelic tryptamines alone in the future because of my back pain. Not sure if this is a combination I would want to explore.",
  "The MDMA was great and I especially enjoyed the anesthetic and entactogenic properties it had to offer. I couldnt imagine a much better ratio; the Psilacetin/Psilocin and MDMA did not overpower one another which Ive read can be a problem. The 2C-B was definitely fun and added more significance to my night but its duration was a bit too much for me.",
  "I wake up around 3pm the next day and feel great, started writing this trip report. Got that lazy feeling that comes the day after MDMA use and I enjoy it.",
  "I love my friends."
 ],
 "erowid": {
  "id": "95623",
  "citation": " whirlwind. \"Flipping 2C the Truth: experience with 4-AcO-DMT, Cannabis, MDMA & 2C-B (ID 95623)\". Erowid.org. Oct 14, 2012. erowid.org/exp/95623",
  "substance": "4-AcO-DMT, Cannabis, MDMA & 2C-B",
  "views": "1646"
 }
}
