{
 "id": 18883,
 "title": "Overdose (High Stress, Anxiety for Weeks)",
 "date": {
  "submission": "2012-04-04T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "movetheshadow",
  "gender": "Male",
  "weight": 76
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "substance": "Methoxetamine "
  },
  {
   "time": "2:00",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "substance": "Methoxetamine "
  }
 ],
 "report": [
  "A brief report due to having to write on my phone.",
  "Having tested the substance with a friend at low doses 50mg and then 100 approx and experiencing only threshold effects, mild stimulation and very slight ketamine style cev's.",
  "Decided the following night after a few beers to take 2 150mg doses a couple of hours apart.",
  "The result was a journey that literally blew my mind.",
  "Ketamine-like in nature, but very different all the same.",
  "I lost all sense of self, stretched and pulled across time and space, experiencing ever more absurd things, becoming everything and nothing. Alot of amnesia follows the experience.",
  "One situation that stood out was a period of extreme vibration, I was a highly electrified being, dragged up into a place that was inhabited by 2 being, it was a large and open space, they were smooth faceless and this was the only part of the trip in which I felt I had a form, I communicated with them through a form of energy conversion language, pushing and pulling.",
  "The majority of the trip was k-hole style travel. Seemed darker and more absurd, worm holes, becoming the suggestion of things that could happen.",
  "The entire journey was 5 hours in the 'm hole' the ever effects were pleasant closed eye visuals.",
  "On a serious note, the dose was too high, the substance is very hard on the central nervous system and left me with a permanent high stress and anxiety feeling which persisted relentlessly for weeks.",
  "Use with caution, the dose I took caused extreme pressure on mind and body. I won't be researching this chemical again.",
  "Much better alternatives are available.",
  "Methoxetamine took me deeper and darker than ketamine, felt like a 20 journey and I suggest extreme caution.",
  "Stay safe",
  "Peace frogs"
 ],
 "erowid": {
  "id": "95579",
  "citation": " movetheshadow. \"Overdose (High Stress, Anxiety for Weeks): experience with Methoxetamine (ID 95579)\". Erowid.org. Apr 4, 2012. erowid.org/exp/95579",
  "substance": "Methoxetamine",
  "views": "6012"
 }
}
