{
 "title": "I Was an Ethereal Spirit",
 "author": "Anonymous",
 "citation": " Anonymous. \"I Was an Ethereal Spirit: experience with DXM (ID 1889)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1889",
 "substance": "DXM",
 "bodyweight": "",
 "report": "<p>After a good day of work and vigorous excercise, I decided that this particular weekend would be a good time to have another DXM journey. I had been preparing the week before, somewhat (set and setting... I had robo'd once before) and had nothing important the next day and a relaxing day planned for Sunday.</p><p>So at about 7:30 pm, Friday, I (wince) struggled down an 8oz bottle of genuine Robo - with copius amounts of water. Took a short walk and came back, slightly buzzed. Powertoked 5 bowls and got ready for the journey ahead. Whoops, almost forgot to set up the CD changer... okay, Jimi Hendrix: Are You Experienced, Axis: Bold as Love, Electric Ladyland, and some mild techno afterwards. I also got some more techno ready for a mid-trip changeover.</p><p>8:45, headphones on, lights off. Let's start the ride. Ya see, Jimi is a new experience for me, and I got the three discs during the week before. With my eyes closed, the music started to fill my consciousness and the colorful, albeit dark visuals started. What I really like about DXM is that for the trip, you're always in control. _I_ decided to start moving (flying) over the landscape, where to move, what to see. What I also noticed is that when I returned to the couch after physically geting up and going to the bathroom, I was in an ante-room of sorts, just waiting until I decided that it was time to journey forth again.</p><p>So during this trip, I decided to enter people's houses. I saw some very interesting things. One particularly striking visual was that of people fucking. I was able to zoom in directly to the point of penetration and watch - better than pornos, to be sure. I didn't try to interrupt them or to reach out and touch - in fact, I don't think I've every thought about touching things while journeying. Maybe I'll make a concerted effort to try, next time.</p><p>All during this trip, I was an ethereal spirit, being able to move about and through objects as I saw fit. I was also able to see myself lying on the couch, before I returned to my body to change music, etc. About the music... ahhhh WOW!!! Jimi is incredible. The variety of music, the production of the music (definitely meant for tripping), and Jimi's guitar virtuosity.</p><p>I also spoke to people. Or copies of people, I'm not sure which. At the time I was talking to these people (on my journey) there was a thought in the back of my head - 'Am I making up what these people are responding to me, or are they wandering spirits themselves who are talking to me on their own?' I was never able to figure that one out - maybe next time.</p><p>In bed asleep (somewhat) around 3am. Woke up (if you can call it that) at 11. All day was somewhat of a blur, what with double vision not clearing up until about noon on Sunday. I slept on and off on Saturday, mixed with watching cheesy movies on cable. Put on the headphones with the same music that night (powertoked some more) and had some more mild visuals.</p><p>Sunday I went to an afternoon rave. Driving was a challenge but certainly doable with concentration. The rave was excellent (as this particular one always is.) I wasn't able to dance as vigorously as usual, but I was particularly animated and alive. I had a particularly wild look in my eyes (so said some) and an infectuously good mood. I was also much more sociable than normal.</p><p>Monday dragged on. Tried to work out, but the muscles just complained. Couldn't concentrate too well at work, and a bit of the DXM haze remained. Tuesday that cleared up, but my body was still taxed. By Wednesday, all seemed back to what could be considered normal.</p><p>One thing that I enjoy about DXM tripping vs. LSD is that you actually _go_ places while tripping on DXM. LSD for me is a contemplative, mental examination with lots of cool looking visuals. But, while acid tripping, I always am cognizant of the real place that I'm at, and all of the things that surround me. DXM, on the other hand, is a journey to a different place - sometimes a different time. A real trip - one that leaves me exhausted, but really worked up.</p><p>Enjoy responsible behaviour...</p>",
 "year": "",
 "id": "1889",
 "timestamp": "2000-06-16T07:00:00.000Z",
 "views": "4366",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
