{
 "id": 18895,
 "title": "Life Giver",
 "date": {
  "submission": "2012-11-29T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Treatsman",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "DOI",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "This was my first time useing a true psychedelic besides DXM which is a dissocative and isn't a grand as DOI. I have used other drugs before of which include marijuana, dextromethorphan, codeine, hydrocodone, and clonazepam, all of which have been used within the last four months prior to taking DOI.",
  "Anyways, I managed to get five blotters containing 1.5mg of DOI each and popped two tabs for a total of 3mg. Next, all I had to do was wait...",
  "The timed part of my trip was written down on a piece of paper which I will transfer below.",
  "~4:00PM\tTook tabs, before which were frequent hits of cannbis.",
  "T+0:15\t\tFeeling what could be the DOI, but could also be the cannabis. Still feeling high and my last toke was about 30 minutes before taking the blotters.",
  "T+0:20\t\tI have this unusual tingling feeling in my abdomen, which is triggering interesting spasiums.",
  "T+0:30\t\tI now have this wonderful head tingle that reminds me of a codeine high.",
  "T+0:35\t\tThe wonderful head tingle has now changed into a some-what confusing feeling.",
  "T+0:40\t\tI went outside and took a few hits of weed to help calm me down.",
  "T+1:00\t\tIt's hard to tell where the DOI is coming from, and now I'm starting to wonder if the blotters were enough, or were just fakes.",
  "T+1:25\t\tThe confusing feeling has now reverted back to a good tingle, which has now spread to the rest of my body.",
  "T+2:05\t\tI just got back from a walk on which I noticed the DOI begging to take hold. Now I'm witnising the most spectacular visuals ever. I also had about half a bowl of weed while relaxing outside.",
  "T+2:30\t\tThis stuff is definitely effecting me. I have these annoying shakes, but I am seeing wonderful visuals. Time is being shuttered.",
  "That's all I wrote down, but I do remember other things that happened after that.",
  "I went out to my brother's jeep with him to hotbox it and while doing so, told him how it was going so far. He showed a little interest in the DOI, but not enough to ask for some. After we left the jeep, I went back up stairs to my room where I played my xbox for a little while, then watched a movie until the effects of the DOI were too overwelming to be able to preform simple tasks. I then went and layed down in my bed with minumal lighting on, eased into the experiance and watched the amazing visuals. I had this uncomfortable need to shift position while layed there and watched the grains in the wood flooring bend and move like it was alive. At some point during the experiance, I fell a sleep.",
  "I would say that this chemical was one of my favorite drugs and would gladly try DOI again in the future. I also do have to say that marijuana helped out big time during my trip."
 ],
 "erowid": {
  "id": "95647",
  "citation": " Treatsman. \"Life Giver: experience with DOI (ID 95647)\". Erowid.org. Nov 29, 2012. erowid.org/exp/95647",
  "substance": "DOI",
  "views": "975"
 }
}
