{
 "id": 18903,
 "title": "Psychedelic Candyland",
 "date": {
  "submission": "2013-01-02T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Xochipilli",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 mg",
   "administration": "insufflated",
   "substance": "2C-P",
   "form": "powder / crystals"
  },
  {
   "time": "0:30",
   "amount": "2 mg",
   "administration": "oral",
   "substance": "2C-P",
   "form": "powder / crystals"
  },
  {
   "time": "0:30",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "powder / crystals"
  },
  {
   "time": "2:30",
   "amount": "2 mg",
   "administration": "insufflated",
   "substance": "2C-P",
   "form": "powder / crystals"
  },
  {
   "time": "2:30",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "powder / crystals"
  },
  {
   "time": "4:20",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "T+0: Initial dose, instant change of consciousness. Very excited for this.",
  "T+1: walls beginning to breathe gently, feeling great! Looking forward to a heavy, colorful experience.",
  "T+2: beginning to come up harder. Visual distortion is more pronounced. Auditory hallucinations beginning to manifest. General shift in consciousness has taken hold; this is a sarcastic-feeling drug so far; very in-your-face psychedelia. Beautiful so far, very smooth come-up, in waves only partially obscured by the brazen euphoria of mdma. I can tell this is going to be a very introspective, enlightening experience.",
  "T+2:30 approx 2mg 2cp insufflated, approx 40mg mdma insufflated. Very pronounced rolling effects with steadily increasing psychedelia..",
  "T+3: more and more of an edge to this trip; I'm starting to go nuts. The headspace created by this unique combo is nothing other than perfect. I feel very at peace with the universe, as well as the current situation I am in. Getting increasingly obvious OEVs and CEVs; distortion is becoming prominent. Heavier light trails The bodyload is hypnotic from 2cp and yet slightly hurried by the mdma. I can imagine this is what mescaline feels like; Ive heard the two compared, but its interesting to feel as though I could compare the two, even having not tried mescaline yet.. Facitious introspection is easy; this seems like a circuit junkies psychedelic wonderland. Im gonna have some fun tonight =p",
  "T+4: more and more frequent waves of euphoria and relaxed stimulation. My stomach is a little off. I attribute this to the fact I ingested a phenethylamine, lol. Gonna get lost in the next two hours, cant wait!",
  "T+4:20: 60mg mdma insufflated. Crazy high.",
  "[at this point we go on a very fulfilling journey to the woods. I was lost in the world the entire time, beautiful experience..]",
  "T+8: visuals are sparse, underwhelmed by the lack of intensity. Everyones pretty absorbed by their phones. Im thinking about T+12 and T+13",
  "T+9: smoking most definitely obscures of the high. Right now life looks unrealthe morning sky through the window is a painting. Love this.",
  "T+12:30: I slept through about 3 hours of my plateau, woke up feeling refreshed and still tripping, although I would venture to guess this is the start of the come-down. Time for some rocket fuellll ;)",
  "T+15: Auditory distortion still pronounced, Some visual inaccuracies. Very beautifuld day out, I feel as though the pleateau hasnt worn off yet..about to insufflate 200mg MDMA and see how it goes"
 ],
 "erowid": {
  "id": "95695",
  "citation": " Xochipilli. \"Psychedelic Candyland: experience with 2C-P & MDMA (ID 95695)\". Erowid.org. Jan 2, 2013. erowid.org/exp/95695",
  "substance": "2C-P & MDMA",
  "views": "1541"
 }
}
