{
 "id": 18910,
 "title": "Salvium",
 "date": {
  "submission": "2004-07-27T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "M",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:05",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 2:00",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:15",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 3:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>T 0:00 - Ingested 5 mg diazepam, tablet form.",
  "T+0:05 - smoked 1 bowl cannabis",
  "T+0:30 - begin to notice full effect from diazepam",
  "T+2:00 - ingested 2.5 mg diazepam",
  "T+2:15 - smoked 2 bowls cannabis",
  "T+3:30 - smoked 1 bowl Oaxacan salvia divinorum leaf.",
  "Between the cannabis and the Valium, J and I were very relaxed and happy, and felt quite good.  For some time we had joked of 'salvium', the combination of these two medicines, but had never done so before this night.  Once we decided to smoke salvia, we closed up the apartment, dimmed the lights in the living room, and put on a Garcia / Grisman show from '91....very serene.",
  "We took a few cleansing breaths and began the salvia regimen - keeping the flame on the leaf, taking HUGE lungfuls, and holding them as long as possible.  The salvia set on as it has many times in the past, but this time was quite different, obviously colored by the Valium.",
  "I felt myself being pulled toward the left; my visual field became only that which was immediately in my line of sight, and in a short time, I closed my eyes and entered salvia space.  For those experienced with the plant, you may know the space as well, and the various qualities of it - the feeling of being yourself but somehow detached, yet all the while the very earthy, comforting feeling.  The diazepam produced an extra layer of space between my salvia-drenched thoughts and my perceptive mind; however, the diazepam is what I feel is directly responsible for the most interesting portion of the trip - the visuals were amazing.",
  "Generally, I find salvia visuals to be blurred and somewhat indistinguishable, often somewhat dark, and colored mainly by earth tones.  However, the visual patterns / entities were very focused - a happy, morphing web of purple tentacle-like structures moving around me, enveloping me, explaining the music to me.....",
  "It was like a beautiful dream. The valium definitely removed most of the 'thought' portion of the trip, but so much beauty and joy and laughter was present.... we came down and felt an extreme sense of mental clarity - remembering things long forgotten, engaging in witty, warm conversations with no difficulties - it was as if the salvia sought out to show us pure unadulterated fun with no strings attached... if only for a little while.",
  "At times, salvia can be harsh, uncomfortable, and unsettling; the diazepam seems to remove this component nicely, although in the future, I may stop at the 5 mg mark.  I have also noted that cannabis seems to have little effect on salvia visuals though it does seem to increase the intensity of the experience and prolong the coming down period.</p>"
 ],
 "erowid": {
  "id": "9572",
  "citation": " M. \"Salvium: experience with Salvia divinorum, Diazepam & Cannabis (ID 9572)\". Erowid.org. Jul 27, 2004. erowid.org/exp/9572",
  "substance": "Salvia divinorum, Diazepam & Cannabis",
  "views": "8712"
 }
}
