{
 "title": "Thanks a Lot, Thanks a Lot",
 "author": "Hmm",
 "citation": " Hmm. \"Thanks a Lot, Thanks a Lot: experience with MDMA & Cannabis (Hashish) (ID 18919)\". Erowid.org. Aug 11, 2005. erowid.org/exp/18919",
 "substance": "MDMA & Cannabis (Hashish)",
 "bodyweight": "76 kg",
 "report": "<p>It was a Friday night, my friends and I decided to get some pills and some weed for a session at my house. I went out to get my shit, came back about ten minutes later and dropped two pills. I wont go into detail about what the other people with me had I will just keep to the point. I am a fairly tall (6'-3'), pretty slim 16 year old male so I thought a double drop was wise, as I normally double drop when Im rolling (even though I dont test my pills and could be taking PMA  which when I look back on it  is fucking stupid.). We were all sat there waiting to come up, bonging some weed and about 6.30 pm I started to feel the effects. I felt good, we had music on and I was definitely coming up</p><p>A couple of hours went on, I started to feel more stoned than I did diddled up, so I popped my third. Now these pills were Bentleys. Small, fat bluish pills with a B stamped on the front, and I had heard they were strong. Yeah they definitely seemed all right, but I came down pretty quick off the first two. So, I had my third, and decided I was gonna go out for a walk or something, I dont really remember too well as I was in a euphoric daze. I remember the Happy effects of the X were clouded over by the Jaw Clenching, Open Eye, freaky feeling when you have a higher dose of E.</p><p>Anyhow, I came back and decided to come and play the computer. I had just bought a new webcam and decided to record a video clip of me and my friend on pills. Anyway, we were sat there with it recording us, and I was looking at the preview window, and I was like What the fuck? - That aint me! We smoked some more weed until about 5am Saturday morning and then finally went to sleep.</p><p>In the morning, my friend woke me up quite early and told me he was going home to get a shower and some food and told me he would be back down later on in the evening. As soon as he went out of the house I watched the video clip from the night before and looking at it REALLY freaked me out. I looked like a zombie and I didn't even remember recording it. I sat at my desk and started to roll a joint. Half way through putting the weed in the joint I realised I still had another 5 pills Me, having no willpower whatsoever, decided to double drop again, this is like 10.30 am on Saturday.</p><p>Around 11.00 I started coming up again, I put some music on, I started to bop my head to the beat. I was enjoying it Time went by, I was on my own, I decided to ring another one of my friends and get him to come down to mine. He came round about 3 pm, and I was approaching my comedown. He knew I had taken pills because my pupils were dilated, I looked really pale and my jaw was clenched like fuck. He asked if I had any more, I told him I had three left, he asked if I could get him some more, so I said, Yeah, why not?</p><p>I went and bought another two pills for him and came back to the house. We both double dropped around 4 pm, and by 5 pm I was wanting more I double dropped again, leaving one pill for myself for later on and I still had quite a bit of hash left. We smoked some hash, but it wasnt affecting me, so I kept smoking it until it was all gone. My friend came up with the idea that we should go to the woods and chill out, so we went up and it was getting dark. I was sat on the ground looking at my friends face, he was tripping on something, his eyes were fucked up, everything was silent, I thought nothing of it</p><p>My friends head suddenly jerked backwards then forwards sharply, then he vomited violently (it was his second time doing X). I stood up and freaked out. I told him we should go home, so we went back to mine and put some music on. I was really thirsty at this point, so I got some water and sat on my bed, drinking it. There came a knock on the door, It was my girlfriend. She came in my bedroom and she knew what we were on. I was really; really stoned and the pills made me feel like a zombie. I was getting paranoid and anxious as she spoke to me. I slurred some words at her and then realised what I had just said and felt like a child. I curled up in a ball and started shouting, Where the fuck am I doing what am I from doing on about? which makes no sense at all. I couldnt help it, I started to panic. I couldn't talk. I stood up, my legs started to hurt, my head was pounding, I was sweating, my chest felt like it was going to explode</p><p>I NEED TO GO OUTSIDE, I said to my girlfriend and my friend. We went outside and they were both looking at me really strangely. I felt like they were plotting something against me. My friend's eyes looked really strange under the dim, yellow light of the streetlamp and when they spoke to me, they sounded like they were not there, as if they were on TV. All I could think about in my mind was Im going to die. I sat behind a building and it was dark outside and getting pretty cold. I was seeing patterns on the walls of the building and I didn't know what was happening to me. Eventually, after about three hours of mental and physical torture I decided I wanted to go home and sleep.</p><p>The day after I, was so depressed. I kept having flashbacks of the night before: what I could see, my friends eyes, magnified for my mind, the patterns on the buildings, sitting in the woods It was scaring me. I thought to myself What the fuck happened to me last night? I vowed never to take ecstasy again As I said, I have no willpower, therefore I got another two pills the Friday after and that was an alright session.</p><p>All I have to say about taking ecstasy is to keep to a low dosage, and dont keep topping it back up. Constant use over a two-thirds of a day period definitely had a dangerous effect on me. I am not sure whether it was the weed that induced the psychotic paranoid anxiety shit along with all the MDMA I had taken over the past 24 hours, or whether it was dehydration and general tiredness, but one rule about drugs: dont get carried away</p><p>- c a I n</p><p>An update  one year later.</p><p>I have been taking ecstasy around a year since I wrote what I have written above. Ecstasy for me, has shown me the light, and also the dark. I believe this drug plays tricks on your mind. Since the experience I have written about, I have probably taken E about 100 times. Some dosages have been higher than others, and my highest has been twelve. I have sorted myself out now and have vowed never to take another pill again, unless its a special occasion like a big rave or something.</p><p>Whilst pilling, I tend to stay away from smoking cannabis resin (which is what we mainly get around here). I have found that as soon as I smoke it, whilst Im on pills, my mind starts playing tricks on me, I see things in a totally different perception, not a good perception either. I have had a LOT of GOOD times with E, without a doubt, but at the same time, I have had a LOT of BAD times. Quite recently I have noticed my perception whilst on E goes like this:</p><p>- Normal, life seems shit. Bored. Want pills.</p><p>- Get pills, Happy, Excited.</p><p>- Drop Pills, feel anxious, waiting for the effects to kick in.</p><p>- Come up  Everything is brilliant.</p><p>- Take more pills  Side effects occur more/No change in mood. More energy  Head in the clouds a bit more.</p><p>- Smoke Resin  Feel insecure, paranoid, heart beats very fast, get panicky and anxious, Mind starts tripping, see things in a totally different way, everything seems negative, dont even trust my best friends.</p><p>- Smoke Proper Weed (Skunk)  Gives me rushes for a while, then, starts sending me paranoid.</p><p>- Comedown without any weed during night  Fine, feel a little bit tired and spaced out, nothing too harsh.</p><p>- Comedown with weed during night  Very panicky, paranoid, depressed, upset.</p><p>Personally, I think ecstasy has given me a deep profound respect for people, a feeling of belonging, it has made me a lot more mature. I care about people now. But  my head feels like mush. I get depressed very easily, I find it hard talking to people, not because Im anxious but because I can not get my words out properly, and if I fuck up whilst talking to someone, then the paranoid anxiety attacks start and I start schitzing out. Sometimes I can not even translate what someone is saying to me, they will speaking the same language, making perfect sense, but I cant understand it. I have bad shakes, hot and cold flushes, and mood swings. I find it hard to read long sentences, I cant remember my times tables. I really wish I had never touched an E in the first place, because I fell in love with it, and did not realise what would eventually happen to me. I do not condone taking drugs nor do I say not to take them, all I am saying is be careful. Because eventually you may end up like me.</p>",
 "year": "2002",
 "id": "18919",
 "gender": "Male",
 "timestamp": "2005-08-11T07:00:00.000Z",
 "views": "15727",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 16:30",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 22:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "4": {
   "time": " T+ 23:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "5": {
   "time": " T+ 0:00",
   "amount": " drops",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  }
 }
}
