{
 "id": 18918,
 "title": "Alt 420",
 "date": {
  "submission": "2012-04-22T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "TTTT",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Periwinkle",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>The day is 420, the stoner's Christmas. There is only one problem, I dont have any 'herb' and I dont have the money to buy some. In order to join in on the festivities, I decided to venture out into my front yard and gather some periwinkle that I noticed not too long ago. Picked about 10 decent sized leaves and put them into the microwave to dry. I know this isnt the most proper way to dry herbs but I wanted to have them pretty quickly and this is the fastest way i know how. I crushed them up and put them in my little glass chillum smoking bowl after bowl with little time in between. The taste at first was not good but after a few more hits I could taste a sweet, fruity flavor that almost reminded me of kids cereals like trix or fruity pebbles. After about 5 minutes I am having some good vibe feelings, and my head feels like its been relieved of pressure. The best comparison would be shwag weed. All in all, the effects were very miniscule and not in concurrence with the other reports I have read about hallucinations. Then again, I had a cannabis cookie this morning and I threw a lip of chewing tobacco a little while before I smoked, probably diminishing the effects a bit. Next time I smoke this I am going to do so without traces of THC in my system, hopefully it will make for a better experience.",
  "I guess I will recommend it seeing as how other people have had positive effects. I will also try making tea and seeing if that elevates the high.</p>"
 ],
 "erowid": {
  "id": "95774",
  "citation": " TTTT. \"Alt 420: experience with Periwinkle (ID 95774)\". Erowid.org. Apr 22, 2012. erowid.org/exp/95774",
  "substance": "Periwinkle",
  "views": "3175"
 }
}
