{
 "id": 18924,
 "title": "Once a Solvent Always a Solvent",
 "date": {
  "submission": "2005-07-07T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Mao",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "inhaled",
   "substance": "Chloroform",
   "form": "(gas)"
  }
 ],
 "report": [
  "<p>It had been about 3.5 months since I had used drugs of any kind, and since I had ready access to it, I figured I'd try some chloroform. Having watched movies and TV shows in which people are rendered unconscious instantly with a chloroform soaked rag, I was intrigued and figured I'd try some. I did a quick search on the internet, and about the only thing I pulled up was that it is very hepatotoxic and nephrotoxic. Well i figured that since I was only doing it once I would probably be alright and brought some home.",
  "I laid on my bed and took out the container containing the clear liquid. I opened it and took a little sniff. I was pleasantly surprised by it's sweet minty smell, very unsolvent-like. I brought the vile to my mouth, exhaled deeply and then inhaled very slowly. The first thing that hit me was the very sweet taste it left on my tongue, again very pleasant and unsolvent-like. I did this three times, put the vile away and sat back. For the first 5 seconds I felt nothing. I then felt pressure and a pleasant, mind-numbing warm-glow in my brain as my thoughts collapsed on themselves. This numbness grew in intensity over the next 15 seconds until I hit a peak where I began to see fuzzy fractals in the center of my vision. I can only liken the visuals to tryptamine-type fractals being received with bad reception on a TV antenna. After the peak the numbing glow gradually subsided and left me at near baseline. The rise, peak and release aspect of the experience were not unlike an orgasm.  I then had a pounding headache for the next half hour and general mental fuzziness that left me unable to accurately perform higher mental tasks.",
  "Chloroform is almost identical in effect to nitrous or some alkane solvents, except that this substance gave me a pounding headache. Except for the pleasant aroma and  sweet taste, I can't imagine using this substance in doses large enough to be an anaesthetic, it would seem that gasoline could be used with the same effect. It certainly doesn't live up to the reputation it's been given on TV. A solvent's a solvent.</p>"
 ],
 "erowid": {
  "id": "9582",
  "citation": " Mao. \"Once a Solvent Always a Solvent: experience with Chloroform (ID 9582)\". Erowid.org. Jul 7, 2005. erowid.org/exp/9582",
  "substance": "Chloroform",
  "views": "38665"
 }
}
