{
 "id": 18934,
 "title": "Flying Through the Everlasting Space of Ska Maria Pastora",
 "date": {
  "submission": "2001-01-22T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "C.M.",
  "weight": "115 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "I had recently acquired some salvia but I had been hesitant to try it.  I had experimented with it 10 to 15 times before, but I just felt through with it.  Nevertheless, it was late at night, I was up for a psychedelic experience and the time was right.",
  "I packed a bowl of about 1-1/2 leaves in a normal pipe.  I lit and inhaled most of the bowl in one hit.  As I went to light up the rest the first effects worked their way through my body (a feeling of a hand or force working its way up my chest, then pulling down, usually very suddenly).  As I was inhaling the second hit I heard a voice speak, 'You have had enough.'  This sounds stupid, but I thought the pipe said it, so I stood up and dropped the pipe.  It had a very bizarre face and it was very jarring.  I usually couldn't stand up on salvia and the open eye visuals were very intense.  The pipe was at my feet and my room had completely changed.  There were now stairs leading down (I live in a 1 story house), lots of gears were turning everywhere, my feet and shins sunk through the floor and I was unable to walk, and there were several extraterrestrial beings now with me.  A couple said things like, 'You have now entered reality' and 'You see as we see.'  I was listening to Autechre's 'Amber' album and it sounded very much like everything I was seeing.  I heard my name in the music, some messages, and some white noise and distortion.  I remember finding a way to move down the stairs and just looking around at everything.  As I looked at the ever changing scene I thought I heard a crash and then a door opening.  I gazed up at my mom.  She said nothing.  Her face started changing.  Her mouth grew into a shape sort of like an alligator's mouth and her skin color was a very sickly yellow.  Her mouth grew bigger and bigger.  I became very frightened and sort of jumped out of the picture.  This is hard to explain but I reappeared in my normal room, but things were far from normal.  I picked up my pipe and disposed of it and jumped in my bed.  I listened to the crazy music and had even more hallucinations and delusions for about an hour and a half more, though not like the original peak. ",
  "This salvia experience was way different from my others.  I had broken through with much success before, but never as intensely as during this trip.  Earlier trips were only about 20 minutes long and didn't have half the strength of the oev's of this trip.  I also could never really move.  My mom never walked in and I have not smoked salvia to this day.  The experience wasn't really negative (I often enjoy the extremely bizarre trips) but I felt through with the plant at the time.  This happened about 10 months ago and I kind of want to experiment again."
 ],
 "erowid": {
  "id": "959",
  "citation": " C.M.. \"Flying Through the Everlasting Space of Ska Maria Pastora: experience with Salvia divinorum (ID 959)\". Erowid.org. Jan 22, 2001. erowid.org/exp/959",
  "substance": "Salvia divinorum",
  "views": "4253"
 }
}
