{
 "id": 18980,
 "title": "Hands Down My Favorite Drug",
 "date": {
  "submission": "2012-06-14T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andydoopz",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 ",
   "administration": "buccal",
   "substance": "2C-I-NBOMe",
   "form": "blotter / tab"
  }
 ],
 "report": [
  "Alright So for the past month or so me and my group of friends have been experiencing the wonders of 25I. We have taken doses ranging from 1-3 tabs each in various settings. This experience I'm writing this report about was the more wonderful and intense tripping experience Ive ever ever had. I don't remember many times but I'll dot he best I can.",
  "ME and 5 friends took it around 2-230 pm for our first time doing 25i in the day time. A few of us put the tabs in our nose the rest put them in between our lip and teeth. Those of us who put the tabs in out mouth were greeted by the usual strong bitter taste and numbness that we've all come so know so well. After about  30-45 minutes or so we start feeling some effects. 3 people in our group ( the ones with the tabs in their nose) have thrown up, one has gotten a pretty bad nose bleed which concerned us but it went away pretty quick and no other ill effects came up.",
  "At about an hour we were all tripping full force. We experience EXTREME trails, almost everything that moved was trailed. When somebody got up on one side of the room it had effects on everything in the room like they caused a rippled which caused the table in front of me and the people around me to move accordingly. At this point I decided to get up and go inspect my friends bathroom, which has been a place I have started tripping/rolling in the past and where many of us have found ourselves with many visuals.",
  "Upon entering I felt like I was in a whole new place. The walls (which slant inward as they go up) were twisting and turning with various patterns and colors ( at this point most things especially white things had  blue, green, and a pinkish glow to them). The pattern on his floor twisted and looked like tan clouds under our feet after about 2 hours of just sitting around and taking in the visuals I noticed they were dieing out a bit so I took a third tab in the mouth. It never really brought me higher then i was but it did bring me back up a bit.",
  "We then realized we wanted drinks and my friend had none so we trecked out to the near by corner store. colors outside were bright and vivid but I didn't notice as many visuals as inside. until I looked at the asphalt. I noticed that the whole road was made up of hexagons about a foot in diameter and inside the hexagons were smaller hexagons and inside each of the smaller hexagons each contained a number or letter. I didn't noticed any words being formed.",
  "We eventually got side tracked and walked around for a few hours with our gallons of blue and red drink and we decided to head home. When we got home our visuals were all but gone but the physical feeling was still around so we turned the light off, plugged in some strobe lights and a red flourescent bulb, some rope light and various other colored lights and put on some music. Now being in our normal tripping setting which we have done lsd, DOx, 25i, and Ecstasy in we became very relaxed. Most of our group smoked some weed and said they started tripping again.",
  "I closed my eyes and noticed I still had some closed eye visuals but they too were dieing out. At about 12am we all decided we were able to safely drive again and headed back to our own houses. Me and my girlfriend both fell asleep with no problems and felt totally fine the next day. All in all this was about our fifth or sixth time doing 25i and was by far the strongest of the trips. The last time we did it was a week ago when we also did 2 tabs and it wasn't this strong. My dealer is running low and I'm hoping that I can find more because 25I is hands down my favorite drugs I've ever done."
 ],
 "erowid": {
  "id": "96238",
  "citation": " Andydoopz. \"Hands Down My Favorite Drug: experience with 25I-NBOMe  (ID 96238)\". Erowid.org. Jun 14, 2012. erowid.org/exp/96238",
  "substance": "25I-NBOMe ",
  "views": "5734"
 }
}
