{
 "title": "Rest in Peace",
 "author": "Zhaquai",
 "citation": " Zhaquai. \"Rest in Peace: experience with Salvia divinorum (ID 18993)\". Erowid.org. Sep 7, 2005. erowid.org/exp/18993",
 "substance": "Salvia divinorum",
 "bodyweight": "137 lb",
 "report": "<p>This is a detailed experience with a profound ending written by an experienced traveler, it may seem long but it is worth your time.</p><p>This was my  6th and most recent encounter with  salvia. I am experienced with several other psycoactive substances including LSD  mushrooms, and san pedro cactus. I also seem to be extremely sensitive to psycoactives, this may be due to my hyperactive metabolism, the fact that I am on a strict Vegan diet and have very little body fat. As most other people report, Salvia is different yet has a similar feel to these other catalysts. As with other substances I've taken, I was well researched and always start off with small controlled amounts in a controlled setting - usually in my bedroom or alone out in nature. Up till this point my other Salvia experiences have been fairly light and pleasant, twice even being taken at small concerts with wonderful audio enhancement, understanding of music and overall enjoyment. Another time I was given the ability  to discern deeper meanings and visual representations in several of Vincent Van Goghs' paintings  which I have shown to a limited number of people.  </p><p>Being that I no longer beleive in smoking or taking chemically derived catalysts, I have always taken salvia orally, chewed through sublingual absorbtion. I beleive that the creator made these substances, like our food, in doses that we can handle and that by greedily extracting and refining we warp these natural organisms into something that is harmful (i.e. sugar).</p><p>In preparation for the journey, like other times I began by brushing the lining of my mouth followed by a rinse with an alcohol-based mouthwash to enhance absorbtion. I have always liked to have music and art around me when I journey, for I believe that when one creates he enters into a similar state that the catalysts take you to. So you could say that the serious artist is really painting pictures  or composing sounds from this other place. This is why I believe that I could connect with the Van gogh paintings  - in effect Salvia took me to the same realm that he was in while creating them and I beleive he placed hidden messages within them to backing up my theory.</p><p>Anyway, that's a whole other journey. This time I was going in eyes closed in a dark room with music that could take me to untold realms. My 'Yamaha' stereo system in my room is set up in a manner which produces a multi-dimensional effect when lying or sitting up in my bed. Even when in normal states I will notice sounds coming from all around me engulfing me even though there are only two speakers. I've had friends comment on this wonderful effect as well. I chose 3 albums that evening, all of them from the Hearts of Space label, and put the player on random so that I would not consciously know where I was going to go. The particular song that began to play was from artist Robert Richs' album 'Seven Veils' which is described as 'rhythm-charged compositions with the exotic, sensual amience of the middle east.'</p><p>As the song started I began chewing about 6gr of raw leaf, turned out the light and snuggled into a comfortable position lying flat on my back in my bed. I took one final look around and noticed that the song was 15 min in duration. The only light in my room came from a small black light in the corner and that of  the display on my stereo.</p><p>The song is really what moved the experience along since it was the only sensory input that was coming into my mind with eyes closed. I began to imagine I was in some kind of ancient forest almost prehistoric with the steady, slow beating of a drum and ambience of the jungle in my ears. I began to feel the familiar increase of gravity that salvia produces pulling me back and down. At this point I felt like I was  in a vertical position but strapped to the side of something that was slowly moving forward as I  could also feel gravity pulling down at my feet which were in contact with the bed frame. I began to notice familiar geometric patterns emerging on my mindscreen. These warped into faintly dicernible objects that looked like aztec or mayan masks.</p><p>At this point I had lost touch with time and space and realizing this seemed to warp me into another place altogether. I could still hear the music which continued to drive the experience and the bits of leaves in my mouth seemed to flow from a pocket in my cheek to my teeth and tounge and back again in a rhythmic circular flow. Here is where things got really deep and frightening. The drums began to die off and fade to almost undiscernible and all I could see and hear was this great big, hollow, pitch black space in what I call the 4th dimension. I could no longer sense my body only my mind. Thoughts began to race at my mind as I panicked trying to discern where I was. Then it hit me... I was in a place that I had been to many times before but my mind had been too disturbed to remember it, like a repressed memory. I vowed to remember this time, if I could make it back to the 3rd dimension that is. The place I was at was a place of eternal rest. Like a 'rest in peace' kind of place. I realized that there were thousands of other beings here in this darkness but they were all asleep if you will. I knew that I could not wake them if I tried. This place was a kind of holding tank.</p><p>I was given the message that if I don't do something to change, that I would be here asleep as well and that there is only one force that is powerful enough to wake anyone from this place - it is the same force that created all things, a being with feelings just like me. Someone who has been hurt and betrayed.</p><p>I began to wonder if I could ever make it back and panic overtook me. I could not allow myself to drift any deeper, I had to spit it out, I didn't want to be in that place forever yet I knew I was still conscious unlike the rest of them. I cracked open my eyes and this is when the music simultaneously began to respond to my actions... (I SHIT YOU NOT, this really happened, tears are rolling down my cheeks as I write this a week later). As I looked through the windows of my eyes at my room it seemed to be a far off  place. As I  quickly used all my strength to pull myself out of the 4th dimension and sat up in my bed the music responded this action with a sound like a reversed symbol. As I reached for a cup to spit in the music responded and as I spit into the cup the music responded simultaneously with every action I took.</p><p>By this point I was totally freaked out and dead sure that this was real. I had to turn the music off. As I reached for the remote the music responded and just before I could get the volume all the way down the song ended and the player rotated to a new CD. I was terrified and in a state of shock. I had to verify that I was OK and tell someone before my mind began to calm down and pass off what had just happened as a hallucination. I was afraid to go to sleep fearing that I would never wake up. As I walked into the kitchen to use the phone I could almost see through objects. I called my cousin who is open minded enough to help me sort this all out, talking to him for about an hour I shared the whole event. He told me that only seconds after he had plugged in his phone it rang.</p><p>Something really freakin' weird happened that night and I'll never forget it. My cousin proposed that I had reached the very core of my being which makes great sense. I don't think I want or need to go back to that place but I was given a message and the reality of it was backed up in the transition between the two dimensions by the synchronistic effects of the music. Even though my mind was calmed down the next day my body felt like it was still in a state of shock. I was shaking inside and the experience kept running through my brain as I sought to sort it out and piece it all together. I'm glad I had someone to bounce it off of and writing this helps a great deal as well. I told my cousin that I would never trip again but as I sort things out in my life, I may reconsider as I have told myself the same thing in the past. But never again in that setting and never that deep. I now know why the shamans respect these plants and I would tell anyone who would use them to do the same. If anyone else has had a similar experience especially with the place of rest and/or music syncronicity I  would love to hear about it. Thanx for listening to my story  and may peace be with you.</p>",
 "year": "2002",
 "id": "18993",
 "gender": "Male",
 "timestamp": "2005-09-07T07:00:00.000Z",
 "views": "12749",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6.0 g",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(fresh)"
  }
 }
}
