{
 "title": "Continued Spatial And Mental Distortions",
 "author": "Scott Taylor",
 "citation": " Scott Taylor. \"Continued Spatial And Mental Distortions: experience with DXM (ID 1899)\". Erowid.org. Jun 18, 2000. erowid.org/exp/1899",
 "substance": "DXM",
 "bodyweight": "240 lb",
 "header": [
  "DOSE:",
  "14 oz",
  "oral",
  "DXM",
  "(liquid)"
 ],
 "report": "<p>The Place:Philadelphia, Pa. USA 3/13/93. Alone in my apartment.\rThe Person:28 years old. 240 pounds. Nothing better to do.\rThe Conditions:MAJOR east coast winter storm. 1 foot plus of snow. howling winds(75mph+). sleet. thunder and lightning! PA state of emergency. ALL area interstates and airports closed.\rThe Dosage:Total of 14oz. 4oz Robo Max Cough and 2oz Generic DM at 3pm. 8oz Robo DM over next 3-4 hours.\rThe Synergists:Pot Only. NO Alcohol. NO Caffiene. Food before, during, and after ingestion. Heavily Stoned at start of ingestion.\rEffects:Starts real mellow. A body warming. Slightly drunk and dizzy. In a very good way. A 'boozey' drunken feeling it is not, maybe like Seconal. A definite 'in the body' thing. Started cutting corners close, bumping into walls. Destortions in my spatial perception. Sight slighly blurry, Impossible for me to read small print. Underlying calmness.</p><p>Music is much more enjoyable. A kind of craving for louder and harder beats. Enjoying the textures of the tape hiss between tracks.</p><p>Strange disjointed thought process. Underlying calmness.</p><p>Full warping of subspace. Pin Head with expansize arms/legs. Incredible head size. Warping and folding of body. Incredible spatial distortions.</p><p>Had to lie down on bed with no light. Wind was howling but i was calm. Continued spatial and mental distortions, but with a calmness telling me the trip was going to be okay. Never 'totally' lost it like with LSD.</p><p>Underlying calmness throughout entire trip which is unlike LSD for me. LSD tends to be a 'speedy', tense kind of trip for me. Hard for me to ride an LSD trip because of the tenseness.\rPrecautions:I got the stuff down real easy. A little iced tea chaser and i'm fine. YOU may find Robo SICKENING getting and keeping down. If you can get yourself in the mindset needed to guzzle and keep down several oz of hard liquor, you'll do fine with Robo.</p><p>PLEASE DO NOT EXPECT TO DRIVE DURING THIS TYPE OF BUZZ.\rThe Verdict:WOW. This involves some further research. Will do Robo Max Cough (seems to be the strongest/purest form i can get) with some friends next week. Will check my results without the initial POT buzz.</p>",
 "year": "1999",
 "id": "1899",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-18T07:00:00.000Z",
 "views": "4331",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "14 oz",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
