{
 "id": 19015,
 "title": "25i-NBOMe Induced Dystonia",
 "date": {
  "submission": "2012-06-11T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Jaduar",
  "gender": "Male",
  "weight": "90 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 mg",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "(powder / crystals)"
  },
  {
   "time": "4:00",
   "amount": "20 mg",
   "administration": "sublingual",
   "substance": "Pharms - Olanzapine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "(daily)"
  }
 ],
 "report": [
  "I'm a recreational user of psychedelics. I primarily stick with LSD and Psilocybin but occasionally use LSA (morning glory seeds & Hawaiian baby woodrose), mescaline, DMT, psilocybin + moclobemide/Syrian rue",
  "The medications I'm on are ostarine 6mg daily (a SARM), and GHRP-6 100mcg & GRH 100mcg nocte. These are for recovery and aiding sports performance.",
  "At home in a relaxed setting with just my partner, happy and not tired with no plans or tasks for the following day. I took 1000mcg of 25i-NBOMe sublingually beneath top lip at 1900hrs. Effects started within 15minutes. Visuals were very reminiscent of approximately 200mcg of LSD. Shortly after a wave of euphoria with a slight speedy feel ensued. This phase lasted for a few hours, it was extremely enjoyable. The visuals definitely were greater than the mind warping and introspective effects in comparison to LSD or Psilocybin, so an extremely easy psychedelic for socializing.",
  "Round 2300hrs the visual effects started to fade and that's when things started to become unpleasant. Contracting and distorting of my jaw, neck, face and arms ensued. The contractions were quite painful at times, and continued to get worse, migrating to other muscle groups, involving my trunk, quads, hamstrings, calves.... essentially over a number of hours covering my whole body. During most of this I had quite severe bruxism as well. Carrying quite a bit of muscle definitely made the whole experience worse.",
  "I unfortunately had no benztropine on hand. I had no diazepam either. I had some olanzapine wafers (useful for terminating trips). So I took 20mg sublingually, hoping the central anticholinergic effect might help end the generalized/opisthotonic acute dystonic reaction component. The mild anti-dopaminergic and moderate anti-serotenergic effects might also help antagonize the effects of the 25i-NBOMe. I feel there was also a component of serotonin syndrome as well.",
  "Over the years I have seen a number of cases of both serotonin syndrome (mild & severe) and dystonic reactions. This did not neatly fit into either of these. So it is probably easiest to just call it a drug induced movement disorder.",
  "In summary it was an educational albeit slightly frightening experience. I will definitely not use 25i-NBOMe again. I have not used 2cx drugs before so I may just be extremely susceptible to this class of drugs. I hope people are careful with this drug as I imagine it would will turn out to potentially quite dangerous in larger doses and in combination with other serotenergic drugs. This drug is becoming increasingly common as well. Although dystonic  reactions are unpredictable, serotonin syndrome can happen in anyone if doses of the right drugs/combinations are high enough.",
  "After waiting out the effects and giving time for the olanzapine to kick in I finally went to sleep."
 ],
 "erowid": {
  "id": "96420",
  "citation": " Jaduar. \"25i-NBOMe Induced Dystonia: experience with 25I-NBOMe & Olanzapine (ID 96420)\". Erowid.org. Jun 11, 2012. erowid.org/exp/96420",
  "substance": "25I-NBOMe & Olanzapine",
  "views": "11626"
 }
}
