{
 "title": "Warning about Street Ecstasy",
 "author": "Jenn",
 "citation": " Jenn. \"Warning about Street Ecstasy: experience with DXM (sold as Ecstasy) (ID 1901)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1901",
 "substance": "DXM (sold as Ecstasy)",
 "bodyweight": "",
 "report": "<p>[Note: Though the author did not know at the time what the pills were, testing of street ecstasy tablets has recently shown that many of the four-leaf clover shaped pills going around contain DXM rather than MDMA (12/99)]</p><p>It was a normal Saturday night November 6, 1999, like any. My fried 'R' and I had fallen into a large sum of money. We decided to get pills like we usually do on the weekends. We got them from our normal source at out normal stop and headed to my boyfriends apartment. When we got there, the boys were drinking, and everything seemed normal. They were very surprised to see us pull out 11 pills. We were all amazed at the shape of the pills.... they were in the shape of 4 leaf clovers. We thought we were going to have the best night ever....</p><p>We each took one. That left us with 7. When we started to peak after about a half hour we each took one more. About 10 minutes after that 'R' and I each took one and the boys split the last one. I ploped myself down in the bed and closed my eyes expecting to start really feeling good. My boyfriend was talking about god knows what and I just kind of fell into a hole. I remember 'R' going downstairs to her boys apartment and leaving me alone with my man. I don't even know how long I was laying there, but I tried to open my eyes and saw nothing. I remember asking over and over again where 'R' was. My boyfriend was getting mad and finally called downstairs to talk to 'R.' She was as messed up as I was. I asked her to come upstairs because I thought I was going blind and she said she couldnt walk. I don't remember getting off the phone but suddenly I was just laying there with my boyfriend talking about nothing again.</p><p>I decided that I had to use the bathroom and tried to get up only to find that I fell right back into the bed. I made it to the bathroom after what seemed like hours. The light in the bathroom was blinding but I did what I had to do and got back to the bedroom. Brian then left the room for what seemed like hours and when her returned he told me that he puked. I had been getting that feeling all night, but had forced myself not to. I think I slept that night unless I was just in a hole. I guess I will never know.</p><p>The next morning 'R' and her boy came upstairs. We all felt horrible. We were still all messed up. 'R's' boy had also puked the night before. It was a night I will never forget.</p><p>I want to warn everyone to be careful. Always take E with people you trust and always trust the people you get it from. If you are offered WHITE pills in the shape of FOUR LEAF CLOVERS I beg you, DO NOT TAKE THEM. Maybe the ones I got were just a bad batch, maybe not. Just be careful.</p>",
 "year": "1999",
 "id": "1901",
 "gender": "Female",
 "timestamp": "2000-06-19T07:00:00.000Z",
 "views": "49645",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ]
}
