{
 "id": 19026,
 "title": "Brain Soup Heart Soup",
 "date": {
  "submission": "2012-06-22T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alacado Dolzinnig",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-P",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:00",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "This report details the night I used myself as a lab rat with frightening results.",
  "Prior experience with psychoactives includes 2C-I, 2C-E, 2C-P Amphetamines(Adderall),Dextromethorphan(DXM), Alcohol, Marijuana, Diphenhydramine(high doses), and synthetic cannabinoids.",
  "My set and setting were positive. I was at a friend's house relaxing and eager to test my newest batch of 2C-P(using tediously careful liquid measurement), the chemical I fell in love with as an artistic and insight gaining tool. I was giddy to have more.",
  "T+ 0:00 - I took my 10mg dose at 1:21 AM. I took a 5mg dose of Melatonin about an hour later(I had read Melatonin may intensify a 2C trip, studied the chemical briefly, and had taken a total of 15mg over the past few days to help potentiate the effects). This was a very large mistake.",
  "T+ 1:30 - I notice it seems to be hitting me pretty suddenly. Normally I don't even feel a slight buzz until 2-2 1/2 hours in, but I am having very pronounced visuals and a strange, dissociating mental cloud somewhat similar to(but more intense than) 2C-E's brain soup, which lasts most of the trip and makes even simple decisions(that I have to think about) a chore. I am making random noises, making stereotyped movements, giggling, and talking gibberish to my friend.",
  "T+ 3:00 - My friend is tired, and decides to sleep. I take his place at the computer to listen to music. The music is absolutely fantastic, but the brain soup makes choosing the song I want to listen to a chore. Once I finally selected a song that pleased my ears, I closed my eyes and let the universe in my head blast out of my skull. The visuals were on par with previous 13-14mg doses, if not more intense.",
  "It was glorious. Too glorious it seems, as I was suddenly startled when my heart jumped, and I realized my breath was shallow and infrequent. This quickly spiraled downward, as I felt more and more constriction in my chest, along with very uncomfortable to painful heart palpitations. I woke my friend up in a panic, telling him to tell me things I want to hear. I was hyperventilating and cringing at the pain in my chest, while thoughts of 'Am I going to die?'  'Should I call an ambulance?'  'What will death be like?' and other such things raced through my mind. Talking to my friend distracted me enough to stabilize my condition, but being alone at any time quickly brought about the fear and constriction back. This lasted about 2-2 1/2 hours.",
  "T+ 6:00 - My friend has gone back to sleep, and I find that I'm now able to keep myself calm. I decide to sit on the stairs going out to the back yard. The entirety of the outside world was alive. Everything flowed into everything else. Clouds formed complex shapes and otherworldly beings. I could feel the life in all the plants. Birds and insects flying around would disappear and reappear (teleport basically) in different locations with multiple copies, all having tracers as well, and  so I couldn't tell where they actually were. I saw ghostly projections of people I know appearing in places doing random things and disappearing before I actually can focus on it. I could also hear my internal monologue(which had a mind of its own and said weird things). CEVs were UNREAL. The most intense I've had yet. So intense and interactive that I had moments where I forgot our world exists, and was surprised when I opened my eyes to an existence I had forgotten.",
  "The Universe spoke very clearly to me telepathically, telling me once again that I am a god and I can do whatever I wish if I pass the test of life. 'The power is inside you!' was repeated over and over and over in the background noise/energy vibrations, as it has in several past trips. It told me that I can do all things. It then told me to bend reality to my will. With the right focus, and hand movements for good measure, I was then able to control everything I saw. I parted/shaped clouds, made the plants grow or wither, bent space time so that things were completely distorted(like if there was a black hole in the yard), and eventually changed the entirety of my field of vision into another dimension with vastly different coloring(including colors I'm pretty sure I've never seen before), and very hard to describe creatures to populate it.",
  "T+ 7:30 - I go back inside, dead tired but knowing sleep is far away. I try to lay down and rest my body, but it's very hard to find a comfortable position. Staying in one position for too long makes my heart feel constricted. For the rest of the trip(lasted until about 1 PM) I drink water, lay down, have to piss within 5 minutes, feel slightly dehydrated after, drink more, lay down, piss 5 minutes later, feel dehydrated again, drink, etc. All the while I have a massive head ache and moderate vasoconstriction.",
  "I don't regret the experience, however this is most certainly an experiment I will not be repeating.  Many weaker 2Cs may or may not be harmful in combination with Melatonin. I've read positive feedback about it with other 2Cs, however this mixture with 2C-P in particular may be extremely dangerous, as I feel I narrowly escaped a heart attack. Something that I've never encountered in over 20 experiences with the substance, many at higher doses. Whether or not it was caused by 'pre-loading' Melatonin or taking some with the 2C-P(maybe both) I don't know, but I won't be the one to find out."
 ],
 "erowid": {
  "id": "96477",
  "citation": " Alacado Dolzinnig. \"Brain Soup Heart Soup: experience with 2C-P & Melatonin (ID 96477)\". Erowid.org. Jun 22, 2012. erowid.org/exp/96477",
  "substance": "2C-P & Melatonin",
  "views": "4129"
 }
}
