{
 "id": 19028,
 "title": "In the Land of Sand",
 "date": {
  "submission": "2000-12-01T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Jobe",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>What a trip. It was my first experience. I was back in Saudi Arabia visiting my father. Back there, there isn't a damn thing to do. It costs about $1 a minute to be online. So, my brothers had been there awhile and made some friends. They would always talk about this 'DXM.' Whatever this was, it was obviously a strange drug of some kind. So, we went to the rec center on the compound for the night (we would just say something like, 'I'm gonna be over at his house' and my dad wouldn't care). I remember taking a whole box of Tuslar and just sitting for about an hour waiting for this stuff to work its magic. My brothers were experienced with it and told me it would take a while.",
  "Time released crap. So, I can't remember when it first hit.",
  "I just know I was getting really conversational and talking about stupid stuff like girlfriends with my brother, which I would never do normally. Then I recall being in the front hallway and watching my brother try to break down one of the locked doors by jumping into it. He came to me and my brother and his friend, who were talking about god knows what, and said, 'If we just work together we could break it down.' I knew we were messed up on the stuff. But dammit, we had to break that door down. So, I went with my brother to jump into the door, but he soon lost interest. The next thing I remember was being upstairs and running around the workout equipment they had there, then settling in the front room on the couch as my brain began to feel as though it was on fire. (My brother's friend had taken twice as many pills as I had and was in a trance on the 4th plateau, which was the biggest stoner jibberish I had ever heard at the time). And so my brain was on fire, as well as my throat.",
  "I sat down on the couch and thought I was dying, the worst part of the trip. My brother heard my distress and told me just to fall on the floor and you'll calm down. I did so. I began to scream, 'I'm dying!' repeatedly. Then time passed. My eyes were shut and I did calm down. I felt as though I was traveling through some kind of tunnel with odd colors on the walls. It was fun, but then nausea set in. We were beginning to leave. I grabbed my hat then went downstairs. I started to feel my stomach and ran straight to the bathroom where I dry heaved into the toilet. Not fun.",
  "I believe I blacked out during that time because I just remember talking jibberish and my brother's friend's brother trying to calm me down as I laid over the toilet seat.",
  "Then we left the rec center for my brother's friend's house, where another great adventure took place. We came in the house and sat on the couch, where I tried to fall asleep. I was successful in falling asleep but not successful in staying asleep, I would come in and out of sleep it seemed every hour of the night. My brother's friend's other brother got up and announced to us exceptionally loudly that he had to puke. So, he ran to the bathroom. About an hour later, we were asking where he was, then a voice (where it came from was a mystery) told us he was in the bathroom asleep on the toilet. He had fallen asleep while trying to puke in the toilet. So we woke him up and he came out and sat on the adjacent couch where his brother was playing a Playstation game. I had to go to the bathroom, bad. So, I got up to go to the bathroom, having a great adventure trying to walk ten feet without any motor skills in my legs. I felt like jello. When I came out of the bathroom, I again jello walked to the couch and plopped down. That's all I remember except waking up in a bed upstairs the next morning with a helluva headache.</p>"
 ],
 "erowid": {
  "id": "965",
  "citation": " Jobe. \"In the Land of Sand: experience with DXM (ID 965)\". Erowid.org. Dec 1, 2000. erowid.org/exp/965",
  "substance": "DXM",
  "views": "8999"
 }
}
