{
 "id": 19036,
 "title": "Trying it Out",
 "date": {
  "submission": "2012-08-16T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Ed",
  "gender": "Male",
  "weight": "72 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam"
  },
  {
   "time": "0",
   "amount": "351 mg",
   "administration": "oral",
   "substance": "DMAE"
  },
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Vitamins - Choline"
  }
 ],
 "report": [
  "I am currently studying a lot to pass some exams and wanted to try Piracetam out. I have used Ritalin in the past and have been using several supplements for general health (vitamines and minerals), depression (st Johns herb, 5htp), but it all gives me not so much effect. I can say this because I've been taking them for 6 months, so today was definitely different with piracetam.",
  "I took 800mg at about 16h and now it's 19:24, the onset is soft, even hard to notice. I would have not noticed if someone had given it to me without me knowing.",
  "I did however notice that my body temperature is definitely higher! my face skin and chest feel unusually warm, I even checked my balls - all warm. Like a fever. But no bad symptoms... I wonder if this elevation in body temperature could be dangerous for my health.",
  "I have to say: I feel unusually focused, able to write in English very fast and even in German (I am Brazilian so these are foreign language that I have studied), they are just 'flowing' more easily as if I had to make less breaks between each sentence, they just go and go and go and I do not feel tired or that my mind is full of thoughts that do not relate to what I am doing at the moment. In other words: concentration. I am concentrated.",
  "This is a TREMENDOUS finding for a person that has good intelligence and needs to pass some seriously hard tests, but lacks concentration and also willpower to devour books.",
  "I am very satisfied, though this temperature thing leaves me slightly worried.",
  "Overall I would recommend this substance to anyone who like me has difficulty in focusing on a long text."
 ],
 "erowid": {
  "id": "96540",
  "citation": " Ed. \"Trying it Out: experience with Piracetam (ID 96540)\". Erowid.org. Aug 16, 2012. erowid.org/exp/96540",
  "substance": "Piracetam",
  "views": "4271"
 }
}
