{
 "title": "Duds and Disappointments",
 "author": "Various",
 "citation": " Various. \"Duds and Disappointments: experience with DXM (ID 1903)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1903",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "DXM"
  ]
 ],
 "report": "<p>From: Steve Braden</p><p>Newsgroups: alt.drugs</p><p>Subject: Robo dosage?</p><p>Date: May 1994</p><p>I tried DXM for the first time about two weeks ago. I took 300 mg (10 Drixoral Cough Caps @ 30mg each). Result: no effect. I took the 10 pills over the course of about 20 minutes chased with plenty of water. I did take them on a relatively full stomach, though, so maybe that was part of the problem. I'm 6'3', 280 lbs and in relatively good health.</p><p>========================================================================</p><p>From: Petri Wallenius</p><p>Newsgroups: alt.drugs</p><p>Subject: About DXM HBr (Robo) ??????</p><p>Date: Dec 1993</p><p>I have heard people having great time with DXM, but it didn't work for me. Does anyone know what's the problem. I took 375 mg of Dextrometorphan hydrobromide. Is that right compound ? If it is did I take enuff ? Or am I some kind of tolerated to that stuff ? Should I try again with greater dose ? Any help is greatly valued.</p><p>=========================================================================</p><p>From: PC</p><p>Newsgroups: alt.drugs,alt.psychoactives</p><p>Subject: ~*~ DXM SUCKS!!! ~*~</p><p>Date: May 1995</p><p>After reading the DXM FAQ and psyching myself up, I decided to take 300 mg of DXM with two other friends. To make a long story short -- IT SUCKS! All it does is that it makes you dizzy, itchy, and irritable. Not exactly my idea of recreation, and much less mind opening drug. Here's a little piece of advice to all of you out there, don't bother with DXM -- IT'S CRAP! I'd much rather sniff glue or swallow gasoline or even smell Heliumm than ever try that shit again. YUCK!!!</p><p>=========================================================================</p><p>From: bunbury</p><p>Newsgroups: alt.drugs </p><p>Subject: Re: Robitussin DM?</p><p>Date: Jan 1994</p><p>I just thought I would relate *my* experience with robo. I drank a 4 oz bottle of d-methorphan syrup (no guifenisen). While the high was not exactly unpleasant it was definitely fucked up wierd. sort of a dreamy stupor, didn't care what was going on around me, etc. the two side effects, were: one It was very difficult to urinate (this effect lasted for a couple of days), and two, the dopiness lasted (gradually wearing off) for three days. If you try robo, don't plan on going to work or doing anything significant for a couple of days, perahps you will be able to, but I couldn't, and you might not either.</p><p>In conclusion, I would have to say that one has to be feeling VERY dysphoric, and/or desperate for a high to take robo. it definitely will get you fucked up, but pleasure? not much if any.</p><p>==========================================================================</p><p>From: Todd Barnash</p><p>Newsgroups: alt.drugs</p><p>Subject: Robo'ed for the first time last nite</p><p>Date: Mar 1994</p><p>After reading, and printing out pages and pages of info on tripping from Robitussin, I decided to try it last night. I bought two 4-ounce bottles of the Robo Maximum Strength Cough (only active ingred= dextro hydrobromide) for about seven dollars at a supermarket. I downed one bottle of the nasty stuff at about 6pm, afterwhich I smoked a good size bowl. Since I was quite stoned (and on new weed) I didn't know when the effects started kicking in, I downed another two ounces from the second bottle, and by 7 pm I was starting to feel quite weird.</p><p>Lemme just say, first, that I am fairly well experienced with other assorted psychoactives- I tried this out of curiousity since Robo is, of course, cheap and plentiful.</p><p>By 7:15 or so my eyes felt very heavy and, as for the rest of the night, wouldn't focus in once place for very long... So, as any good tripper will do, I turned off the lights :-) I wasn't getting much in the way of hallucinations at that time anyway. Music sounded 'thin and boring' compared to LSD or Psilocybin, and I started becoming too disoriented and unbalanced to walk anywhere. I closed my eyes for a while and enjoyed the show- this stuff gave a big coloful boost to my imagination, and had somewhat the same 'mind-tripping' effects other psychoacts. give.</p><p>I felt a bit of stomach discomfort, which is understandable looking back on how much of it I drank. I ended up just smoking some more green and trying to sleep it off. All in all, it was a pretty heavy buzz, but not very entertaining and I doubt I would do it again.</p><p>=========================================================================</p><p>From: The Alpha and the Omega</p><p>Newsgroups: alt.drugs </p><p>Subject: Re: Robo</p><p>Date: Sep 1994</p><p>I tried it for the first time myself. I took 240mg. After about 1 hour I started to get nasueas and a little dizzy. After throwing up twice (I have a sensitive stomache) I felt better but the feeling never became more than a buzz. I didn;t particularly care for the feeling either. I was nothing like tripping as far as I'm concerned. This may be due to the dosage but I would rather not try it again because of the nasuea. Overall it was an interesting experiment but I do not see what all the rave is about. The buzz felt kind of synthetic. More related to the previous message I can say that I did experience some starnge visual problems. Especially with light and depth perception. But this is hardly tripping.</p><p>=========================================================================</p><p>From: Anonymous</p><p>Newsgroups: alt.drugs </p><p>Subject: DXM fails.... :(</p><p>Date: Apr 1994</p><p>So what's the deal?</p><p>Subject 1 ingested 3 30mg caplets, followed in two hours, by 2 more, followed in two more hours with 2 more... no perceptible results, or results so mild they might well have been placebo.</p><p>Subject 2 ingested 5 30mg caps, followed four hours later with 2 more, same effect as S1.</p><p>The next day, S2, a determined experimentor, broke 6 caps into a swallow of juice (tastes awful :) and still got nothing.</p><p>Caps were from two seperate boxes of Drixoral cough caps, no other ingredients besides DXM-hbr.....no other drugs of any kind were present in the system....</p><p>Is there some magic 'open-sesame' thing you gotta do with this stuff? What are the odds that two people, non-blood relations, would both have this Citochrome - 450 enzyme or whatever?</p><p>Perhaps if the dose were doubled to more like 300mg instead of the 120-150 that seemed such a prudent figure given the DXM FAQ info...? (it was deemed desirable to avoid the second stage of the experience as it sounded from the descriptions far less pleasurable than the lo-dose effects...)</p><p>Does the syrup work better than the caps?</p><p>Or is this all a great big hoax put on by the DEA to lure us all out of the woodwork and down to the drugstore?</p><p>Help please....it sounds real fun, if only it got you high :)</p>",
 "year": "",
 "id": "1903",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-19T07:00:00.000Z",
 "views": "83327",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "DXM"
  }
 ]
}
