{
 "id": 19042,
 "title": "Psychic Channel Spirit Entities",
 "date": {
  "submission": "2012-08-15T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shaman MetisFx",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Lotus/Lily",
   "form": "daily",
   "specific": "Nymphaea nouchali var caerulea"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ],
 "report": [
  "I have been using nymphaea caerulea regularly on a daily basis for 6 years and I am able to psychic channel spirit entities that look like humanoid and amphibian extraterrestrials. I first started using nymphaea caerulea back in 2006. I wanted something I could mix with my marijuana to increase the buzz and make the session last longer.",
  "I ordered 100 grams of nymphaea caerulea to start off with. Once the nymphaea caerulea arrived I mixed it 50/50 with marijuana and smoked it out of a bong. It definitely increased the buzz but nothing out of the ordinary happened that night. After about a couple weeks of smoking this combination daily I noticed little red & white lights that would glow and flicker in the dark. Thats when I knew the nymphaea caerulea was much more than a regular plant. I kept smoking this combination until one night I noticed this spirit entity that looked like a humanoid extraterrestrial staring at me and my right ankle started paining. After seeing this spirit entity and my right ankle paining I knew this must be a holy crutch warning that smoking marijuana is a sin so I flushed the rest of the marijuana down the toilet.",
  "The next day I wanted more marijuana so I went to my dealer and picked up some and ordered more nymphaea caerulea so I wouldn't run out. This time when I smoked the nymphaea caerulea mixed 50/50 with marijuana I noticed spiritual energy that was red and dark with little red lights that would glow and flicker in the dark and my right ankle started paining again. So I decided when I run out of marijuana I was going to try smoking the nymphaea caerulea by itself with nymphaea caerulea tea. I noticed when I smoked nymphaea caerulea and drank nymphaea caerulea tea without marijuana the spiritual energy was white with little white lights that would glow and flicker in the dark. At this point more spirit entities that look like humanoid extraterrestrials started coming around.",
  "Then I decided to try drinking 12 beers while smoking nymphaea caerulea to religiously test alcohol to see if the spiritual energy would get red and dark with little red lights that glow and flicker in the dark and see if my right ankle would start paining. After drinking the case of beer I noticed the spiritual energy turned red and dark with little red lights that would glow and flicker in the dark but my right ankle was not paining.",
  "After years went by I kept switching from drinking alcohol to smoking marijuana in combination with nymphaea caerulea and started noticing spirit entities that look like amphibian extraterrestrials were joining the spirit entities that look like humanoid extraterrestrials. I also noticed when I used marijuana or alcohol in combination with nymphaea caerulea the spirit entities would talk more aggressively and start banging on walls, closet doors, floors and my bath tub. But I didn't think much of it at first until one night I got attacked by the spirit entities. Some would come up to me and do pain threshold attacks by stabbing my heart and other ones would shoot various strentghs of spiritual energy at me from various distances away. When they were attacking me they said I was being reprimanded for sinning and going to eternal damnation.",
  "Thats when I decided to quit using nymphaea caerulea, alcohol and marijuana cause I was scared these spirit entities were going to kill me and I would end up in eternal damnation. I quit nymphaea caerulea for 3 months and could still psychic channel the spirit entities but I could tell the effects were getting weaker cause they couldn't physically assault me. During those 3 months I also remained sober.",
  "I was not able to stay off the nymphaea caerulea cause I was curious about the spirit entities I was psychic channeling. But after being attacked and almost getting killed by the spirit entities and them saying they were taking me to eternal damnation for sinning several times over the past 6 years when drinking alcohol or smoking marijuana while using nymphaea caerulea. I decided to continue using nymphaea caerulea without using substances like marijuana and alcohol in combination to play it safe. I figured the spirit entities are sending me a strong warning that smoking marijuana and drinking alcohol are sins that lead to eternal damnation. The one experiment I wanted to complete was to quit nymphaea caerulea for long enough to see how long it takes to get out of the spiritual world after long term use. But I am not able to quit nymphaea caerulea for long enough cause my curiosity. I have never been on something that would allow me to psychic channel spirit entities that look like humanoid and amphibian extraterrestrials.",
  "Now I just drink nymphaea caerulea tea and notice the spirit entities talk more friendly and they make casual physical contact by coming up and touching me or by shooting spiritual energy that makes casual physical contact with my body. I also noticed the spiritual energy stays white with little white lights that glow and flicker in the dark. I believe nymphaea caerulea is a holy psychic channeling plant and the spirit entities are guides. Cause they changed my life."
 ],
 "erowid": {
  "id": "96592",
  "citation": " Shaman MetisFx. \"Psychic Channel Spirit Entities: experience with Nymphaea nouchali var caerulea (with Alcohol & Cannabis) (ID 96592)\". Erowid.org. Aug 15, 2012. erowid.org/exp/96592",
  "substance": "Nymphaea nouchali var caerulea (with Alcohol & Cannabis)",
  "views": "1884"
 }
}
