{
 "title": "Not What I Expected",
 "author": "words0fw1sd0m",
 "citation": " words0fw1sd0m. \"Not What I Expected: experience with Fentanyl (ID 19055)\". Erowid.org. Mar 1, 2004. erowid.org/exp/19055",
 "substance": "Fentanyl",
 "bodyweight": "130 lb",
 "report": "<p>My dad was diagnosed with cancer in his lymph nodes and had to have lots of chemotherapy and surgery. He was prescribed a number of drugs including Hydrocodone, concentrated Morphine Sulfate, and Fentanyl. I had already used his morphine and loads of his hydrocodone and was looking for a new experience. So I decided to take one of his Fentanyl patches. After reading the directions on the back of the box, it stated 'Apply patch to skin every 72 hours as needed for acute pain'. '72 hours!!' I thought, 'Holy shit thats gotta be pretty crazy'. So, I decided to take one out, and applied it to my right shoulderblade since that was where my dad had applied all of his. I sat and I waited and waited and waited, for almost 2 hours. Nothing. So I got up and decided to carry on with my day just like it was any other normal day.</p><p>It wasnt until 10 hours later that I noticed anything, when I accidentally sliced my finger open with a razor, and felt nothing. It was weird though because I had no euphoric opiate/painkiller feeling, or any feeling whatsoever. I was just completely immune to pain. It reminded me a little of morphine, although that is still a very unaccurate comparison, but the closest thing that I know of. The next day I woke up and it felt like my legs and arms had fallen asleep. This feeling lasted all damn day and was accompanied by the jitters. This is basically all that happened while I had the patch on for 3 days, though I was still very jittery a couple of days after I had removed it. And also, after the first day of wearing it, I wasnt able to sleep if my life had depended on it for the next 3 days; it kept me up like I had been drinking case after case of soda. The experience wasnt a good one, but it wasnt really a bad one either, it just 'was'. I can definitely see why this drug would come in handy if you have recently had surgery ;)</p><p>  ~Peace~</p>",
 "year": "2002",
 "id": "19055",
 "gender": "Male",
 "timestamp": "2004-03-01T08:00:00.000Z",
 "views": "51570",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.5 mg",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl",
   "form": "(patch)"
  }
 }
}
