{
 "title": "Negative Experiences",
 "author": "Various",
 "citation": " Various. \"Negative Experiences: experience with DXM (ID 1905)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1905",
 "substance": "DXM",
 "bodyweight": "",
 "report": "<p>From: kris kennedy</p><p>Newsgroups: alt.drugs</p><p>Subject: re:robein'</p><p>Date: Sep 1993</p><p>I've taken Robitussin a few times (well, at least generic eqivalents with the same quantity of active ingredients) and frankly, I don't get it. The first time all I did was catch a few trails from a cigarette after drinking about 4 oz. I heard some interesting noises, and procede to get really ill. I mean, I thought I was going to have to go to the hospital because I felt like my stomach and intestines were on fire. My friends thought that was strange and we figured I probably had the flu or something. So I tried it again, this time drinking eight ounces and I felt even worse. The trip was definitely not worth the intense physical pain I felt for 36 hours afterwards. I'm not sure if this is a common thing or not, or if I'm just some freak with a sensitive stomach. Thanks, but I'll stick to illicit drugs that make me feel good, not one's that make me feel like I'm in hell!</p><p>=========================================================================</p><p>From: DB</p><p>Newsgroups: alt.drugs</p><p>Subject: dxm disaster... help</p><p>Date: Dec 1994</p><p>ok, the first time I tried DXM (300mg of Drixoral cough caps) It was cool, but I felt like I wanted more of an effect. So the next time after consulting with some fellow trippers I upped it to 450mg. Let me just tell you what happened next was like the scariest thing ever, at first I was really feeling great. But it kept getting progressively worse, and it got to the point where I could not walk, I was having a lot of trouble breathing and I was feeling like I was having a heart attack. I also was vomiting a lot. I was itchy like mad. and I slept on the bathroom floor because I couldn't get to my bed. Thank god my friend was there to hold me and help me. My question is... has anyone ever heard of/experienced a similar reaction? I weigh 120 lbs so that 450mg should not be too much, should it? Could it have been an allergic reaction or something.</p><p>=========================================================================</p><p>From: Jason</p><p>Well, after all the messages about this stuff I decided to try it myself. Because I didn't want to get carried away I decided to try 2 oz and see what that did first. Well my first, and only, time trying that stuff was horrible. I ended up throwing up about 3 times on Saturday night. I also became very hyper and several times had problems breathing. Guess my system just doesn't like the stuff ay guys? Other symptoms included getting a fever and dizziness. This experience really scared the hell out of me. I think I'll just stick with the old methods from now on. I'm just glad I didn't take the whole damned bottle. I'm sure that would've been REALLY fun.......</p><p>=========================================================================</p><p>From: Ben Despres</p><p>Newsgroups: alt.drugs</p><p>Subject: flushing on DXM?</p><p>Date: May 1994</p><p>a few nights ago i tried my highest dose of dextrometorphan yet, about 500 mg (i had only had up to about 350 previously, with absolutely no side effects other than that horrible itching, and even that was only light and for a few minutes).</p><p>anyway, i seem to have had quite an odd reaction this time... at first i started getting higher and higher like normal, but then after about an hour and a half things started to get a wee bit worse... i was feeling a bit itchy, but not too bad... when i started scratching insanely, it got the attention of a few of my freinds who hadn't done anything. they said that i was bright red and had a fever of like 103... this bothers me rather a bit, since such things are not a good sign... anyway, then i proceeded to scratch like crazy, luckily my face didn't get itchy, since i discovered the next day that too much scratching makes you look like a survivor of the plague from poe's 'masque of the read death', if there were survivors...</p><p>next i began to get nauseous, so i went into the bathroom to puke. while in there, i got incredible cold sweating, to the point that i was dripping with sweat but had goosebumps ( i might still have had a fever , but as far as i could tell i was freezing). so i managed to live, apparently...</p>",
 "year": "",
 "id": "1905",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-19T07:00:00.000Z",
 "views": "40140",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "DXM"
  }
 }
}
