{
 "title": "Frightening and Confusing",
 "author": "Words0fw1sd0m",
 "citation": " Words0fw1sd0m. \"Frightening and Confusing: experience with Meperidine (Demerol) & Promethazine (Phenergan) (ID 19052)\". Erowid.org. May 1, 2010. erowid.org/exp/19052",
 "substance": "Meperidine (Demerol) & Promethazine (Phenergan)",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  " ",
  "IV",
  "Pharms - Meperidine",
  "",
  " ",
  "IV",
  "Pharms - Promethazine"
 ],
 "report": "<p>Experience date: September 15, 2002</p><p>First off let me say that I am pretty well experienced with opiates, Dilaudid being the only one to this day that I know of that I haven't yet used. I have used demerol and phenergan before orally on a few occasions with pretty crappy results, but was definitely not expecting what had happened with this experience. Oh yeah, at the time I was taking Claritin D once a day for my allergies and 5mg Ambien for my sleep disorder. So, lets get started...</p><p>The night before the experience, my girlfriend and I had gotten into a pretty bad fight so I was pretty upset. The next morning I woke up, still very upset and had the worst stomach pains I have ever had in my life. They were literally cripling; couldn't stand up, straighten my body out, or walk. My dad took me to the hospital to see exactly what was wrong (he thought I had taken something). When I got there, the nurse stuck my with an IV and left while the doctor took a look at me, thinking it was apendicitis. The doctor left and the nurse returned with a syringe filled 3/4 the way with demerol and phenergan. It took her a little while to shoot the whole syringe into my IV tube, but I was feeling the effects before she was even half way done with it. It reminded me of the previous times that I had used demerol but was quickly getting MUCH more intense. Within about 5 minutes, I was not feeling *ANY* pain whatsoever, and was enjoying my opiate rush to the fullest (though the hospital isn't the best place to do so).</p><p>All the good feelings soon turned bad and I started going in and out of conciousness, awaking to hallucinations of strange bird/bat-like creatures flying by my face at god speed. This happened probably 7 or 8 times. I could also see multicolored spots and speckles floating everywhere, sorta like in old loony toons cartoons when one of the characters is sick and they have a bunch of colored spots floating around in front of their face. Strange machine-like noises where starting to be heard as I would 'nod out', and everything soon became very frightening and confusing.</p><p>Then I started feeling the nausea. Right away I knew I was going to puke so I told my dad to run and get a trash can or bucket. He had to ask the nurse for one so she gave me a towel until she found one for me. I puked 3 times and dry heaved for about another 20 minutes before the nurse came in asking me if I wanted any more phenergan for my nausea, because I was expected to drink 8 cups full of some liquid for my catscan that I needed to have on my stomach/intestines. Putting anything in my stomach was the LAST thing I wanted at that point, and feeling no pain, I was able to convince the nurse that I was fine and didn't need a catscan. She checked my blood pressure to see if I was ok and it read 52/65, or something right around those numbers in the 50's/60's. She told me that it was too low to safely, and legally release me but I was feeling fine besides the nausea, and decided to stand up, blacking out and fainting in the process. So I layed back down for a while until my BP slowly went up.....</p><p>But to make a long story short, I was released from the hospital, never finding out what was wrong with me that day, and vowing to never have anything to do with opiates again. And to this day, I haven't touched them since.</p>",
 "year": "2002",
 "id": "19052",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-05-01T07:00:00.000Z",
 "views": "12403",
 "dose": {}
}
