{
 "id": 19060,
 "title": "To Be Taken Very Carefully",
 "date": {
  "submission": "2012-07-24T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Ellabella",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I didnt even know about this product. I had ordered two other products which came quickly in discreet packaging, and was given this as a free sample. It has mixed reviews, some saying its the next best thing and others saying its dangerous stay away. So I decided to make my own mind up and just start small to see how I would react.",
  "I did this at home in a peaceful setting after work. No one was around as I wanted to be able to concentrate on the effects. I initially did a dip test which confirmed It tasted vile and chemically  unlike anything Ive tried before.  It came in a clear baggy, they were fine crystals but I wouldnt have put them in my nose unless I crushed it a bit. Had a small bump about half a finger nails worth, all seemed fine. Did Make by eye react by watering. 5 mins later Thought well that didnt kill me I feel ok,  so then did a couple of bigger bumps.",
  "Its not pleasant and no way as nice and gentle as coke. I started working after about 25-30 mins. Started to get the serious chats and had to have a looong conversation with my brother by text. It seemed to make me feel very alert and interested. I then later on in the evening did a very small line probably 3cm but very thin. Thats when things started to get a bit more interesting, my eyes had slightly decided to see black and white patterns in the corner and was feeling quite buzzy and got slight juddervision which was ok.",
  "It does last a long time. I have done it a few days now to see how I react to it. I found that I started to get very dehydrated although I have been drinking and making a point to replenish the electrolytes. I also got a really sore tongue to the point it started to crack at the sides, this has never happen to me on anything, and I got mega cramps in my toes which did pass. I think more research needs to be done, if it didnt affect me so bad with the deyhration and having to keep body salts up.",
  "I think this could be dangerous if used at a rave / festival where youre going to be drinking a lot of dehydrating alcohol. And noticed my palms were getting really sweaty and if I touched water it looked like Id been in the bath for an hour. It did absolutely kill my appetite, and didnt have any sort of comedown.  I think its a little and often drug, and to be taken very carefully."
 ],
 "erowid": {
  "id": "96707",
  "citation": " Ellabella. \"To Be Taken Very Carefully: experience with Ethylphenidate (ID 96707)\". Erowid.org. Jul 24, 2012. erowid.org/exp/96707",
  "substance": "Ethylphenidate",
  "views": "7325"
 }
}
