{
 "id": 19063,
 "title": "The Dance of Psychedelic Hedonism",
 "date": {
  "submission": "2012-10-25T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Splash",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "pill / tablet"
  },
  {
   "time": "9:00",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "tea"
  },
  {
   "time": "21:00",
   "amount": "800 ug",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "blotter / tab"
  },
  {
   "time": "28:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "30:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "pill / tablet"
  },
  {
   "time": "45:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Set: A nice quiet Friday evening at home",
  "T: 0.00  I decided to get some paperwork done so gradually insufflated  approximately 35mg of methylphenidate.HCl.  Needless to say productivity skyrocketed and music was thoroughly appreciated. The stimulant was metabolized a few hours later and the dopamine depletion made me somewhat aggressive and anxious.",
  "T: +9:00  A couple of medium sized poppy pods were crushed and brewed for 30 minutes subsequently consumed with a wee bit of super silver haze. It knocked me out pretty quickly and essentially I turned nocturnal from this point onwards.",
  "T: + 21:00  I placed a single blotter hit containing 800ug uncomplexed 25I-NBOMe between my upper lip and gum. I didnt feel any immediate taste but I kept my saliva anyway. In about 40 minutes I finally placed the blotter under my tongue and felt the already fading chemical taste. It wasnt unpleasant, though as a chemist I enjoy chemicals so that may have something to do with it.",
  "T: +22:00  It was already getting dark again and I noticed my vision was a bit blurred. I was calm knowing that I have properly prepared the hits (I have a d=0.1mg scale at my disposal plus Gilson pipettes that go down to >0.5l volume so were safe with regard to proper dosage). Eventually I noticed a familiar pattern of visual distortion, these fractal vines slowly started creeping in and I felt quite good. The opiates were still active at this point.",
  "T: +24:00  My god music was better than sex. Every tone and frequency were propagating an electrochemical vibe through pre-defined neural circuits eventually escaping my brain to slide down my spine and send every cell of my body into heaven. At some point a particular track started playing and this was the point where my senses literally exploded. It is not easy to describe but I experienced severe auditory-tactile synesthesia. Every beat was like an orgasm with a specific sensual buzz. I then switched on the lights and was simply overwhelmed by the visuals. My wall is pretty dull yellow-ish colour but in this context it appeared like Jupiters surface with an organic undertone. The hallucinations were less geometric that the OEVs I have experienced on LSD yet theyre still utterly amazing. However, I perceived them more as a bonus to the music appreciation aspect. I could very clearly differentiate between mp3 quality and FLAC quality tracks. Definitely music appreciation was out of this world. I was going through cycles, Id feel this wave of anxiety which explodes in a splash of utter joy and then the negative feeling begins to accumulate again and thus cycling for a while. Ego death was noted.",
  "T: +26:00  I was in heaven. Extreme eyecandy wrapped in a warming nod coupled to auditory sex. The only thing that frightened me is how amazingly beautiful and pleasant this combo was. I was tripping hard as either time perception was quite distorted or it just took me forever to get simple tasks done. I felt very artistic at this point, started playing with lights and prisms to make some psychedelic photographs. So far it was an amazing hedonistic psychedelic experience.",
  "T: +28:00  I found it very hard to roll a joint. My first attempt at rolling a spliff failed miserably, so I spent a good 30 minutes trying to get stoned. And I did. Thats when things started to go a bit downhill. I started to get anxious, progressively worsening.",
  "T: +30:00  I am still tripping hard. I want to take a break so I took a walk outside. I felt waves of paranoia creeping in so quickly went back home. I wanted to lie down but as soon as I did I wanted to get up again. I started dancing with my headphones on because I felt very speedy. My heart was racing and I experienced stomach pain. At this point I started thinking Im having a heart attack and got slightly panicked but still managed to keep my shit together. Eventually a valium was consumed.",
  "T: +34:00  I decided to take another walk outside. Once the anxiety was annihilated by the diazepam I could appreciate the psychedelic mindset again. I was observing the plants and it occurred to me how their interrelatedness stems from the fact that they all share common nucleotide sequences and their taxonomy is a function of the said sequence similarities. That sort of thoughts transpired to everything that surrounds me. I finally felt serene and in peace with myself. Music was still incredible, visuals not as intense.",
  "T: +36:00  I finally got back home and tried to re-evaluate what happened but felt mentally drained after all the drugs I had done. I passed out soon after.",
  "T: +45:00  Woke up at around 9PM and I usually get anxious when I switch to being nocturnal. Smoked a joint and spotted a baggie of poppy seeds. I had no intention on consuming those but being stoned and hungry like never before I quickly munched on them (they are very tasty). I passed out around 2AM that evening and reverted my nocturnal cycle.",
  "Conclusion: 25I-NBOMe is my favourite research chemical. It felt unhealthy yet amazing. Next time I would take it a rave because with 25B-NBOMe I noticed that the body load disappears as I move actively. I found it very useful to have some valium on hand during the experience."
 ],
 "erowid": {
  "id": "96729",
  "citation": " Splash. \"The Dance of Psychedelic Hedonism: experience with 25I-NBOMe, Cannabis & Methylphenidate (ID 96729)\". Erowid.org. Oct 25, 2012. erowid.org/exp/96729",
  "substance": "25I-NBOMe, Cannabis & Methylphenidate",
  "views": "9196"
 }
}
