{
 "id": 19097,
 "title": "Diabetes and Ecstasy - A User's Report",
 "date": {
  "submission": "2012-07-20T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Respondent 85",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": ".5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "<p>I am currently 29 years old. I am also a well controlled and healthy type 1 (insulin dependent, shot-taking) diabetic since age thirteen. When I was about 23-24 I was heavily into the local club scene and at the time at least, Ecstasy happened to be popular, high quality and plentiful. Dealers where seemingly everywhere as well as the people on it and it wasn't hard to tell they where all enjoying themselves a lot.",
  "I had never taken a 'hard drug' in my life, not cocaine, speed, LSD or anything other than alcohol or pot, mainly out of fear of addiction as well as my paranoia of seeing things that just aren't there. But I started to consider taking E after hearing about its fascinating effects. I spent a good week or two talking to those who were experienced in the matter and discussed in great detail the onset, apogee and come-down times as well as the after effects, possible side effects and psychological and physical ramifications in all their possibilities. After all of that I deemed that as long as I was careful about my diabetes when tripping everything would be fine. I started making careful preparations for the big night.",
  "My first concern would be that when on any drug such as E, which can alter one's perception of one's own bodily state, that I might not be able to feel a hypoglycemic (low blood sugar) episode coming on. That was possibly dangerous since these usually require the drinking of a 12 ounce soda about 8 minutes after you first notice it. Let it go any further and passing out is a real risk. Usually the feeling of nervousness or disorientation particular to hypoglycemia is enough to let me know I need that soda, but on E, I thought, that feeling may have been masked. So my first and virtually only concern was the avoidance of hypoglycemia. Once again, I prepared for this eventuality in advance.",
  "When 'zero night' came, everything was set to my satisfaction. My car was parked not too far from the club where I was to take it. In the car was a stock of 3 12 oz. soda cans, my portable glucose meter and plenty of strips to use with it. I intended testing every half hour during the hardest part of the trip and then every 45 minutes as I came down. I knew most of the people at the club by name and any of them would help me if I should have requested. I also made it well known to them that I was a first timer with E. I had a few closer friends there to help with the diabetic details. I told them about all of my concerns and preparation plans, I made sure they were staying straight that night so they'd be able to assist if I needed it and most importantly I showed them how to use my blood meter and even where to find its miniature instruction card. The meter was basically foolproof anyway, but just to make sure, I had them do everything from pricking my finger to assessing the results so there was no doubt whatsoever. That also put my mind to rest. I wanted to enjoy this trip and not be paranoid while on the journey.",
  "My friends were instructed, in the event of my impaired judgment, to get me a soda and make me drink it immediately if my blood sugar fell to 70 or less. They where also instructed to escort me to the car for a test and soda every half hour or whenever I felt like it. Their support made this possible.",
  "Even earlier that night I took less than the usual amount of insulin after dinner so my blood sugar would be more stable and even a bit higher afterwards, but nowhere near dangerous levels. I bought a hit from a known dealer on Friday night and waited until Saturday when I went out to get everyone's reaction about the batch he'd been selling and its safety. No one had a bad trip so it was a go. I took only half a tab which is all I strongly recommend for first time users. After taking it I set my watch to count down to the 45 minute onset time. After much anticipation and even fear, it kicked in and was a great trip.... hard rolling, muscle tension, ecstasy, openness and an energy coursing through my body that was pure zen. It was better than I could possibly have imagined.",
  "I walked a lot which I knew was going to lower my blood sugar so the testing came in handy all right. Naturally the sugar did go down to about 70 but I was at all times coherent enough to test my own blood (I was supervised anyway) and to judge when I needed that soda. Eating some food afterwards would have been ideal but since E killed my appetite so badly I only consumed the soda. I lusted for water and I didn't have an appetite for the soda since it wasn't going to quench my thirst but it wasn't too hard to force it down in a minute or two. I recovered just fine in the usual 3 post consuming minutes, no difference there. As the testing and the trip progressed I noticed no wild fluctuations in blood sugar and nothing that wasn't commensurate with my activity level and other factors normally influencing blood sugar in a diabetic.",
  "At the end of the trip, or at least when I felt okay about stopping the half hourly testing, my blood sugar was an ideal 150. I took a small shot of insulin and went to get something to eat since I'd been left ravenous by the experience. I believe that tripping for those who have diabetes isn't inherently dangerous. But all trips, for those with diabetes, have to include the usual common sense measures (moderation, plenty of water, etc.) as well as fail-safe measures for getting your blood sugar tested and responded to. With experience I learned that I could test by myself but I always let people who knew I was diabetic and who would be around know that I was X'ing when I did it.</p>"
 ],
 "erowid": {
  "id": "96944",
  "citation": " Respondent 85. \"Diabetes and Ecstasy - A User's Report: experience with MDMA (Ecstasy) (ID 96944)\". Erowid.org. Jul 20, 2012. erowid.org/exp/96944",
  "substance": "MDMA (Ecstasy)",
  "views": "1956"
 }
}
