{
 "id": 1909,
 "title": "38 hours",
 "date": {
  "submission": "2000-09-07T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Elliot",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "7:00 thursday ",
  "My doctor started giving me Adderall for a.d.d. so i took the 20 mg pill just how i was supposed to and i felt great around 2nd period about 1 1/2 hours after consumption. I was tired at first when i woke up as always but when it hit i was fast, powerful, and happy...nothing could be better. All the sudden i couldnt stop talking and my eyes were so wide open many of my fellow student knew some thing wasn't normal. I didnt care about what other people thought of me and my teachers got mad cause i wouldn't stop talking. Soon it was lunch time and i had absolutly no appetite i didnt eat a thing but a drank some water because my mouth was extremly dry. The day seemed to fly by before i knew it eight period had arrived and thus the end of my day at school 3pm.",
  "I went to my friends house on his bus and when i got there i had bad cotton mouth again and the only thing he had was MOUNTAIN DEW! This was not good for me to drink because of the high amount of caffeine wich had a multiplying effect with the amphetamines causing me to get another boost of energy.  I also felt like throwing up when i drank it. I ran up and down the block a few time and my heart was racing.  I felt so alive i couldn't stop thinking of things to do and i would get lost in my thoughts because they would be racing too quickly. It was around 8pm so i called my dad to go home and he came and picked me up.",
  "When i got home i went and lifted weights and i noticed that i could do a lot more reps and more weight too and i worked out for about an hour took my shower and tried to sleep around 10:30pm but my mind was racing with thoughs and sleep was impossible. So i didnt fight it any more and just watched t.v. wich seemed to keep me busy for the next 8 hours when i would normally be a sleep. My dad woke up for work around 5:30am and got mad that i hadnt slept he left at 6:30am i got ready for school and lifted some more weights cause the energy had still not gone probably because i took my pill once agian another 20mg Adderall pill.",
  "I left for school and everything was going good until fourth period about 11:30. My body felt very tired but my mind was racing away i started to get nervous and paraniod. The breeze from the open windows freaked me out cause one second i felt hot then the other i felt ice cold i was really scared. My mind fely like it was completly unatched to my body. It was so weird it was like the day before had never ended and my memory was severely impaired. i didnt remeber what i had done the day before. At lunch all the noise was very unnerving and i though every one was trying to play tricks on me. I started to see thing that wernt there and got freaked out i left school early to go home.",
  "I called the pharmacy and asked them what i had done wrong they said the caffenine was the problem so i didn't drink any more. i tried to sleep but still no dice my mind was racing still i couldnt fall asleep until around 9pm that night then i slept for about 15 hours straight.",
  "The initial high is great but the come down sucks.  You feel like throwing up, you're tired and depressed so make sure you dont have school or work the next few days after taking it.",
  "Be careful not only is it physically addictive you'll think about doing it every time you're sad afterwards, i do and havent taken it for about a month."
 ],
 "erowid": {
  "id": "1623",
  "citation": " Elliot. \"38 hours: experience with Amphetamine (Adderall) (ID 1623)\". Erowid.org. Sep 7, 2000. erowid.org/exp/1623",
  "substance": "Amphetamine (Adderall)",
  "views": "72543"
 }
}
