{
 "id": 19100,
 "title": "The Best Worst Feeling in the World",
 "date": {
  "submission": "2012-08-08T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Twitch",
  "gender": "Female",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-P"
  }
 ],
 "report": [
  "I started my experience around 6pm, knowing that it would take about 4 hours for the effects to hit me. At around 10pm, I didn't think I was really feeling anything so I sat on my couch to watch some TV. Above my tv I have a decal of a tree. Before I could get the tv on, I noticed the tree was swirling. I called for my boyfriend to see if it was affecting him in the same way. It was. We sat and watched the tree for awhile before we decided to take a walk.",
  "Everything just seemed enhanced. Woods border one side of my property and we considered walking through them. Once we got closer, however, they seemed very ominous and slight anxiety hit me. We walked away from the woods and toward the lake. I felt great, just somewhat weird. Once we got back inside, I wanted to talk to people so I hopped on Omegle. Then decided to play some call of duty. I was awesome. (I am usually pretty bad) I talked a bunch of shit on Xbox live. I painted for awhile, but that mostly broke down into me swirling the paints together on the plate rather than on the canvas. Smoking was not an option. Both cigarettes and marijuana made my stomach hurt. I kept wanting to shower, probably took 6 or 7 showers in that time. I wasn't tired at all. By 3am, I was pretty sick of it. I just wanted it to go away so I could sleep. It wasn't horrible, just annoying. Time was crawling by. I couldn't eat or drink anything, or at least I felt like if I did, I might get sick. I finally came down around 10am. I was able to sleep for a few hours and woke up feeling normal.",
  "All in all it was a pretty great experience. I may do it again, but I certainly couldnt do it regularly.",
  "Pros: Vision enhanced, pretty swirling colors, fantastic at call of duty, very happy feeling, when it was over I felt as though I had accomplished something with my boyfriend...like we had gone to the edge of the universe and came back together. It made our relationship stronger.",
  "Cons: No smoking, Lasts a really long time to the point that I got sick of it and just wanted it to stop, I called my boyfriend by my ex's name a few times."
 ],
 "erowid": {
  "id": "96958",
  "citation": " Twitch. \"The Best Worst Feeling in the World: experience with 2C-P (ID 96958)\". Erowid.org. Aug 8, 2012. erowid.org/exp/96958",
  "substance": "2C-P",
  "views": "2958"
 }
}
