{
 "title": "No Psychoactive Effects",
 "author": "Tommy the Tourist",
 "citation": " Tommy the Tourist. \"No Psychoactive Effects: experience with Galangal (ID 1910)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1910",
 "substance": "Galangal",
 "bodyweight": "",
 "report": [
  "<p>After reading the galanga information on www.hyperreal.com [Now archived at http://www.erowid.org/herbs/galangal/], I decided to try galanga. After all, it's cheap, legal, readily available and susposedly a nice mild high. I went to one of the local asian grocery stores. After a fruitless search, I decided to ask the clerk. He immediately took me to several different types of galanga, powdered, dried root and pickled root. I opted for the dried root in a 2oz bag labeled 'made in Thailand', which I saw as a good sign. I also picked up a big can of V8 to mix it with.",
  "While the V8 chilled I ground the root up in a small electric coffee grinder which quickly reduced it to a fine, very aromatic powder. The odor strongly resembled cedar and ginger. According to the articles on hyperreal, two heaping tablespoons were the normal dose. I went for closer to three since I'm a bit larger than average (225) and mixed it with about 12oz V8. I gulped it down as quickly as possible. The aftertaste was foul, like Vicks vapor rub, but went away quickly. I wanted to wash it down with a beer, but was afraid it would alter the effect. With this accomplished, I sat down to read and wait.",
  "The only effect over the next 1.5 hours was some really odd, almost exotic, belches. My stomach rumbled a few times, but no real nausea. After the 1.5 hours, figuring the dose had been too low, I decided to try again. I repeated the entire process. The taste was worse the second time. Probably because I was expecting it. I waited for another hour with no effect, then gave up and drank beer. The only side effect was a terribly foul dump the next morning and some hideous gas all day. Occasionally when I breathed out through my nose, I thought I could still smell galanga, but it was probably my imagination.",
  "I was disappointed (and disgusted), but willing to admit that the galanga I bought may have been the wrong type/brand/whatever. A couple days later I went to another grocer and bought a couple 1oz bags of a different brand of galanga, in powder form this time. The clerk said that they normally carry the fresh root, but were out. Another can of V8 from Kroger and I was set. The effects were exactly the same as before. No pyschoactive effect at all. I'm pretty much ready to give it up. The mere though of the taste sickens me. Not to mention the after effects. My co-workers were even slightly amused. I may still try the fresh root or the pickled, though that sounds pretty hideous.</p>"
 ],
 "year": "",
 "id": "1910",
 "gender": "Male",
 "views": "24158",
 "dose": [
  {
   "time": "0",
   "amount": "3 Tbsp",
   "administration": "oral",
   "substance": "Galangal",
   "form": "(roots)"
  }
 ],
 "submissionDate": "2000-06-19T07:00:00.000Z"
}
