{
 "title": "Distinct Lightheadedness",
 "author": "Morgoth",
 "citation": " Morgoth. \"Distinct Lightheadedness: experience with Galangal (ID 1911)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1911",
 "substance": "Galangal",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "1 Tbsp",
  "oral",
  "Galangal",
  "(roots)"
 ],
 "report": "<p>Yes well after reading the usenet thread on Friday, I went straight to my local asian shop and asked for 'Tom Yum' curry, the little asian chappy said 'Orrr Yaaaa, we have, we have' and promptly lead me to a shelf with various Tom Yum products. After peering at them for a while, I could not find any curry. So I set about reading through the ingrediants on the packets. Sure enough all of them contained 'Galanga', so I began to ponder which of them had it in the highest concentration, when all of a sudden I noticed that the little asian chappy had been watching me reading all the contents on the packets.</p><p>He came over to me and said. 'You wan Galanga, righh?'</p><p>'Yaaas Yaaas', I said, and followed his scurrying pace down to the back of the shop where he revealed a shelf full of the stuff.</p><p>There was at least seven different brands, all of them offering either powdered or chopped roots. Some of them where only sliced into 5mil thick round slices. (Obviously designed for major consumption I thought!)</p><p>Anyway, I grabbed a big bag of powder (for 67 cents) and took it up to the cash register. The asian chappy chuckled and said: 'Have a goo Evenin - heh heh heh'</p><p>When I got Home I promptly made up some rice and put a heaped tablespoon of the stuff into it. It is highly aromatic, but its taste is quite mild even at the 'heaped tablespoon' level.</p><p>I started to feel light headed almost straight away! At first I thought It was a sort of stonedness, but there seems to be a suttle difference. The best way I can describe it is that it gives your eyes a sort of 'Trippa-Vision' similar to the effects of LSD a day after you have taken it. But the effects on the mind are harder to define. 'Liteheaded' is about the closest word for describing it. It seems to shut down distractive thought, as does MJ, but there is a lack of the mellow feeling which is associated with MJ. There is more of a harshness to it, and of course, it is nowhere near the intensity!</p><p>A few days later, I doubled, then trippled the dosage. But The circumstances underwhich It was taken made close analysis difficult. Suffice to say that there seemed to be a distinct tolerence built up when taken on successive days.</p><p>Anyway by the look of how much is left in the packet, there will definitly be more experimentation on my part.</p>",
 "year": "",
 "id": "1911",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-19T07:00:00.000Z",
 "views": "19469",
 "dose": {}
}
