{
 "id": 19114,
 "title": "Disastrous 'Ecstasy' Wedding Night",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z"
 },
 "author": {
  "name": "Respondent 46",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": ".25",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Bad/Suspect Ecstasy"
  },
  {
   "time": "0:15",
   "amount": {
    "number": ".25",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Bad/Suspect Ecstasy"
  },
  {
   "time": "0:00",
   "amount": {
    "number": "1.5",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Bad/Suspect Ecstasy"
  }
 ],
 "report": [
  "On the night of our marriage, two & a half years ago, my wife and I took some Shamrocks.",
  "We had previously taken Ecstasy about 6 times and on each occasion it was a love filled experience for us both. So, what better time to take some more than on our wedding night.......?",
  "As we had never taken Shamrocks before, we took a quarter at first and another quarter 15 mins later. Nothing... We took in total 2 tabs in 2 hours. Bound to work, we thought....",
  "During this time we phoned our friend from whom we bought them to complain that this E wasn't working. 'Don't worry, everything will be fine!' he assured us.",
  "Suddenly, like it does, the 'E' kicked in. Really kicked in!",
  "My wife and I were then subjected to 6 hours of vile feelings and hallucinations. I remember at one point standing in our living room looking at the open patio door, trying hard not to be dragged outside by the evil forces waiting for me out there. On our wedding night!!!!",
  "We just continued to go up and up, peaking after 3 hours after the final tab.",
  "We went to bed. Prayed, cuddled, cried. The damn stuff just wouldn't stop!",
  "About 3 a.m. it started to subside, and we made love; a strange, wacky but nice experience.",
  "Next day we had to drive 100 miles to see our in - laws. 'nuff said!",
  "Later, I finally discovered that they had Ketamine in them.",
  "Comment from a reader",
  "If you know anything about the action of Ketamine, that isn't anything like its action. 3 hours is the longest experience I've ever heard anyone have, and that means baseline->up->baseline in three hours.. and that was eaten, on a full stomach."
 ],
 "erowid": {
  "id": "96985",
  "citation": " Respondent 46. \"Disastrous 'Ecstasy' Wedding Night: experience with Bad/Suspect Ecstasy (ID 96985)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96985",
  "substance": "Bad/Suspect Ecstasy",
  "views": "4648"
 }
}
