{
 "id": 19113,
 "title": "Body and Soul: An Out-of-body Experience",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z"
 },
 "author": {
  "name": "Respondent 97"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "I had been doing X for about six months and found that I wanted to get an even better high. Stupid, I know but I wanted to be the one who had an experience that no-one has had before.",
  "One night I had the chance to put my self at the high I wanted. I had fifteen pills of Mitsubishi's. So I started to give them to my friends. We all were at my friends house and decided it would be a good idea to have a rolling party. So I gave all of my friends that were there a pill. I had four left and decided to take two of the four remaining.",
  "I began to feel the affects about thirty minutes later, my body had touched by a cloud, a real thick moist cloud and it was warm. It was like nothing I had felt before but I told myself that someone else has felt what I felt. Well, I finally talked myself into taking the last two pills.",
  "As I was sitting there getting a massage I was suddenly struck by the urge to dance. I got up, told the girl that was massaging me to put on a techno disc, and then realised that I wasn't in reality any more. As my body moved like water, my veins moved throughout my body like worms in the ground on a rainy day. The felt like they were crawling out of me. My body felt like someone had placed me in a giant bowl of warm Jell-O and it was hugging me like it loved me passionately.",
  "As I began to become more and more into my own world I began to pop a little, as the pop became harder and harder and the liquid felt like it was leaving every finger tip and toe. I then gave one really hard pop and shook my soul from my body! As I was floating about two feet above the ground, I looked at my hands and they were see through. I then tried to speak but no sound came out.",
  "I looked at my friends that were sitting on the couch and realised they were looking at a kid who was dancing like they have never seen before. I then proceeded to float over to this strange-looking dance-style and wanted to see who was doing such a beautiful thing. I tried to touch him but my hand went right through his shoulder. At the same time my shoulder felt like an orgasmic massage. I bent over to see who this person was and, to my surprise, it was me. Now this is when people would start to freak out but I couldn't, I was more in awe than anything. I was looking at my own body. It was weird, I never have seen my self like this before.",
  "Then I wanted to touch me - I wanted to feel the orgasmic massage all over my whole back. I began to rub my own back, or pass through it. I could feel every ghostly swipe of my hands on my own back. Then I wanted to massage deeper, and deeper. Until I placed my face in my back. It was the most amazing thing in the world. The inside of body was luminated by my glowing heart. It was so beautiful, I felt like crying. I reached out and grabbed it and started to rub it, it felt weird. Soft like feathers but thick like pudding. I thought it would be cool if I jumped all the way into my body, and gave my whole body that orgasmic feeling. So I jumped into my body. It was like a suit at first then everything went black for about five seconds. I thought that I was dead. But the weird part about it was if I really had died I would have been happy. As a bright light started to appear I opened my eyes and saw everyone huddled on the couch looking at me.",
  "It was the best night of my life. It was special to me, but I don't think that I will do that again. People who are out there, X is great, just be very careful with it.",
  "Anonymous, 19-years old"
 ],
 "erowid": {
  "id": "96984",
  "citation": " Respondent 97. \"Body and Soul: An Out-of-body Experience: experience with MDMA (Ecstasy) (ID 96984)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96984",
  "substance": "MDMA (Ecstasy)",
  "views": "1357"
 }
}
