{
 "id": 19127,
 "title": "A Dissociative Rush",
 "date": {
  "submission": "2002-07-14T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Blizzeman",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "175 mg",
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "1:00",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "1:10",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Ketamine"
  }
 ],
 "report": [
  "I had previously used DXM several times over the past few years, and have had several good as well as a few bad experiences with it. One of the most unbelievable experiences I have had involved a small dose of DXM (by the way, I have always used pot about 1 hr after ingestion of the DXM, as it seems to immediately send me to a higher state of euphoria), with an unspecified amount of Ketamine.",
  "I drank a half of a 4 oz bottle of Robitussin Maximum strength cough, went and jumped into the shower to wait for the onset and to pass a little time (I like showers because no matter how fucked up I am, it seems to be unnoticeable in the shower). I got out about 30 minutes later and could feel a slight buzz coming on. I went ahead and rolled up a blunt for the 1-hr mark and just sat until that time.",
  "At the 1-hr mark, I lit up the blunt, smoked about 1/3 of it and as usual, it immediately sent me to the 2nd plateau. About 10 minutes after that, I decided to snort the huge line of K that I had, so I did, and was sitting at my computer, already feeling pleasant. I was looking on the web to see if anyone else had done this combination, when all of a sudden all of the words on the screen shot off to the right and went up the side of the screen and started making circles around the screen, kind of like a hypnosis spiral. Soon after this I began feeling very, Very sick and made my way to the bathroom in a stagger similar to a high dose of DXM.  I vomited until there was nothing left to vomit, which was also very unpleasant.",
  "At this point I felt the out of body experience coming on. I laid my head on the toilet in awe for about 10 minutes, and then was able to get up and go lay on my bed. I had planned on smoking the rest of the blunt, but I was way too out of it to even mess with a fire. I laid down, still feeling very sick, and I assume that I passed out, as I remember nothing after that.",
  "Overall, I would say that this was a memorable experience, but not very pleasant at all. I just got sent to the highest plateau way too quickly and it overcame my body and my mind."
 ],
 "erowid": {
  "id": "9700",
  "citation": " Blizzeman. \"A Dissociative Rush: experience with DXM & Ketamine (ID 9700)\". Erowid.org. Jul 14, 2002. erowid.org/exp/9700",
  "substance": "DXM & Ketamine",
  "views": "16056"
 }
}
