{
 "id": 19136,
 "title": "E As a Tool for Survivors",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Respondent 87",
  "gender": "Female",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "Just wanted to share a bit about my new-found tool.",
  "I am a 26 year old mother of two, divorced, incest survivor. To put it in short, my life has been a complete mess for as long as I can remember. I have always been a very sensitive, loving, kind, sexual human being but only on the inside. As a child I learned to mask and hide all of these things, a necessary thing when you are abused. With time this became the only way to behave - cold and cut off from all emotion I kept all of those good feelings that people naturally have away from the outside world. Needless to say I have lacked much joy in my life.",
  "Two years ago I became involved with a new partner. He is very emotionally available and a very healthy man. At first I felt reborn and able to experience a freedom I had never felt before. But through no fault of his or mine I lost that feeling after a few short months and fear, flashbacks from my childhood, and a wall flew up again.",
  "Around three months ago I tried E for the first time. That night, for the first time in my life, I held, loved, and was able to tell the man I am in love with how much I adored him with no fear. And after that beautiful experience I sat in bed and was able to tell him why I could not do that before without feeling any pain or fear!",
  "I could go on and on about how this drug works for me in a million ways and how each time I do it I keep with me just a little more freedom and new tools to use in my 'everyday life ' but I am sure you get the picture.",
  "So, to survivors or anyone in pain, I say godspeed in your healing - its a great tool."
 ],
 "erowid": {
  "id": "97011",
  "citation": " Respondent 87. \"E As a Tool for Survivors: experience with MDMA (Ecstasy) (ID 97011)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97011",
  "substance": "MDMA (Ecstasy)",
  "views": "1071"
 }
}
