{
 "id": 19143,
 "title": "Stuck Loving Someone Who Can't Love Herself",
 "date": {
  "submission": "2012-07-24T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Respondent 54",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "<p>In the past few months, I've become very close to a woman that has come to mean alot to me. She has lived a pretty painful life, and she saw me as someone who was not so weighed down by pain. She approached me and dropped the guard that she maintains to protect herself from others. We started a friendship that was basically based on me 'teaching' her how to enjoy life.",
  "I was happy to help someone else lose their depression, and she was happy to have me there as such. We both came to realize that there was an incredible connection between the two of us, a crazy cosmic connection that neither of us had ever experienced with anyone else. It's the feeling that you are with someone who really understands your soul.",
  "A couple weeks ago, I had a dream that we were together, tripping on a couple drops of liquid apiece, on the day before she was to start her first job, and we decided to take ecstasy. We walked across the street to a little park, sat on a rock, and watched a beautiful sunset across the river.",
  "It was awesome. As the MDMA came on, she started crying, as has happened a few times when we are together. Past emotional wounds were bleeding inside of her. I hugged her, wiped away the tears, gave her a message... made some crazy eye contact, and ... !!! Suddenly we were kissing, in what had been an intense but basically platonic relationship for months. The evening continued on that note, and it came out that we had some really strong emotions for each other, there was alot of love, we were together, nothing else mattered. It was one of the best nights of my life with the most beautiful woman I've ever met, someone I feel is definitely a 'soul mate'.",
  "I wish this story could have a happy ending. Since that dream, reality has returned. She has got an insane job that she doesn't like, and has to work ridiculous hours-- basically she has no free time. When I do see her, she is quite depressed 90% of the time, because her whole personality is built around dealing with pain. I know that there is a happy, beautiful person in there somewhere, because I've seen it. But where? I almost feel like the MDMA experience showed me how great things could be, how perfect, how beautiful... and then when it is all over, I'm left with reality, which is nothing like that. The worst part about all of this is that there is nothing I can do about it. These issues are not mine, they are hers. Or are they? I feel like I'm stuck loving a person that doesn't know how to love herself- and there is no way that can work out in a relationship.",
  "I guess the bottom line with ecstasy is that it shows you a little bit of heaven. Re-entry can be damaging. Integrating my early experiences with MDMA were easy, I was in control of my life and I had the power to live the way I felt on E without being on it. This is a different story because there is another person involved. Within a relationship, ecstasy can open lines of communication and show how great things can be between people.",
  "But afterwards, if the same old issues fall back into place, just be prepared for the pains of reality. Because ultimately E can show you the potential in a relationship, but it's your job (or even worse, someone else's) to actually make it happen.",
  "This has been a painful story to tell, and I'm still living it.",
  "P.S.",
  "As time goes on, I hear more and more stories of 'unfruitful' ecstasy experiences. It seems to mostly happen when ecstasy uncovers a lot of pain or otherwise uncomfortable issues. Instead of learning from this revelation or integrating the lessons they could have learned, some people react the opposite way, repressing their pain even more than ever, trying their best to pretend that the E never showed them the tough truth about themselves. In the end the result is worse than if they had never taken the E in the first place, sadly enough. I think it goes to show that while MDMA is medicine for the soul and works wonders for most people, it must also be accompanied by expert therapy or guidance in the worst cases. Some people just aren't ready for MDMA on their own...</p>"
 ],
 "erowid": {
  "id": "97020",
  "citation": " Respondent 54. \"Stuck Loving Someone Who Can't Love Herself: experience with MDMA (Ecstasy) & LSD (ID 97020)\". Erowid.org. Jul 24, 2012. erowid.org/exp/97020",
  "substance": "MDMA (Ecstasy) & LSD",
  "views": "4906"
 }
}
