{
 "id": 19147,
 "title": "Mature Love, Spiritual Relationship",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z"
 },
 "author": {
  "name": "Respondent 4",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "I consciously made a decision to try E after having read about it for nearly two years. My ex-husband dated a psychologist from Irvine Medical Center who was working with the drug. He told me about his experiences with it. I was intrigued and very open to the experience. I never took it with him, because it was difficult to find. When I was able to locate it, I was lucky enough to get the real article.",
  "My lover and I took it together and we experienced such a total one-ness that our relationship grew incredibly. We had known one another as friends for over ten years and we had only become lovers four months prior. We are still together three years later and our relationship is the best we've ever experienced.",
  "I really believe that the experience of E is a large part of the reason we have such a close relationship. Believe me, I understand it can cause one to believe in fairy tales, but as two mature adults, we found that the experience allowed us to put our egos aside and really look at one another as spirits. We have a profound love and desire to protect and cherish each other's souls. We understand who we really are and we both know that we will never do anything to hurt one another. The E really allowed us to connect with that small part of us that is God.",
  "I think my relationship is based on a spiritual connection. We have both been married twice before and while we loved each of our spouses, we know that we never had the connection with them that we have with each other. The E was important in bringing that connection to mind. We both knew, once it hit, that we were in a relationship which would be different from anything we experienced before. We were actually able to finish each other's thoughts. We almost didn't speak for about a half of an hour, or at least we only began sentences and the other finished them. . . it was truly amazing.",
  "38 year old American woman"
 ],
 "erowid": {
  "id": "97025",
  "citation": " Respondent 4. \"Mature Love, Spiritual Relationship: experience with MDMA (Ecstasy) (ID 97025)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97025",
  "substance": "MDMA (Ecstasy)",
  "views": "1237"
 }
}
