{
 "title": "Away, Away, Away",
 "author": "RoyBoy",
 "citation": " RoyBoy. \"Away, Away, Away: experience with Salvia divinorum (ID 19144)\". Erowid.org. Nov 25, 2002. erowid.org/exp/19144",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "report": "<p>Here's a letter I wrote to my brother--after trying Salvia twice:--one hit, in a dry pipe, each time---used a butane lighter. Was alone in my room both times.--Both times I closed my eyes and turned out the lights, with a shade drawn over the only window. First time, I had mellow classical music playing on the radio.--Second time, I had the room in silence. I had no fear trying it each time--just an inquisitive expectation of something new, and probably good. Figured, (correctly) that one single hit would not take me into level five.</p><p>*     *     *     *     *     *     *</p><p>Hey---got the Salvia the other day!</p><p>Not sure (yet) that I'm recommending this stuff. O.K.--first let me say that this is THE STRONGEST DRUG IN THE WORLD! (and I should know!) From everything I've read, people vary greatly in their sensitivity to it--and the individual batches (of leaves) vary greatly in potency.----This is supposedly why you see all these 5x, 10x, and 15x concentrates for sale on the websites---because some people can't get any effect from just smoking the leaves---and the smoke is very hot (though not all that harsh or bad tasting)---and this makes it hard to take a lot, unless you use a waterpipe. But I (obviously) got a very strong batch--and I am VERY sensitive to it.--The reason why I personally might want to make some concentrate, is because, by the time I exhale the first hit, I barely have the wherewithal to set the pipe down!---and just one hit will not quite shoot me all the way through. If I REALLY tried, I might be able to get two hits down--but that would be it.</p><p>I have (so far) taken two hits---(at two seperate times) and reached the boundary of the 'totally GONE' each time, without completely breaking through--and I don't know if I have the guts to go farther. Each time, I took one small leaf and packed it into the pipe. This ends up being exactly one complete lungfull, by the time it's all burned, but I can't draw it all in real fast, because the smoke is so hot, but eventually I get it all down--and then I find myself able to hold my breath for, what seems like, a VERY long time (obviously the effects are already happening)---so finally I exhale, set the pipe down, lean back,(having bolted my bedroom door, to keep from escaping while dreamwalking), and turn the light out, and close my eyes.</p><p>On my next breath I feel the nexus of my consciousness (my personal perspective on the totality of all existance, which is generally located somewhere in the proximity of my percieved body) fall away---or expand out, so that as my lungs expand, they seem to reach out and contain the whole universe, (I'm not just musing about this---it's actually happening to me)---and, at first, it's not really an unpleasant thing. I feel (or sense) the lightyears of space behind me, whereas, just a moment before, I had been leaning back on a pillow.---Now the pillow is gone. The room is gone. The house is gone. The Earth is gone. It seems like your conscious ego is now the entire universe. It's like I have just hit the 'maximize' button at the top of a computer screen---and instead of being a little window, my reference has now gone 'FULL SCREEN'!!! Still not so bad---(kinda cool, and peaceful feeling, actually), but then these multi-colored geometrical patterns come up--(remember: I am not 'seeing' them---you AM them--and they ARE the entire universe---more than that--they are the very structure of all reality (or so it seems!)</p><p>And this weblike mosaic of patterns fill the screen and then start twisting into a mobius strip of churning fabric until I see my screen sworling into a vast network of spiraling tunnels--and I start to go down the tunnel in front of me (I'm sure this is sorta like what you see when you die)---but I start to feel afraid of not being able to come back---so I draw back a little---and then I see that if I do THAT--all the tunnels of the fabric of all reality will knot up horribly and wreck the friggin' universe for EVERYBODY--and the responsibility is really just too hard to take. One of the trip descriptions, on the net, describes a guy feeling exactly this same thing--and he had to go on a convoluted journey for eons of time just to save the universe for everybody!</p><p>But then I (for some reason) started humming part of a Moody Blues tune (the second time--the first time I hummed along to some classical music I had on the radio)--and this makes the energy flow out from my heart--and new tunnels form (from my heart) and flow out into the universe---so I realize everything isn't really so dire--and I sit up and turn on the light---and the twisted tubes turn out to NOT be everyone else's reality---and the whole thing is COMPLETELY over---no mental haze, or drugged feeling, or hangover whatsoever---just a kind of mellow peaceful feeling---mixed in with the very recent (lingering)  feeling of distress (bordering on terror---not so much for myself---but for almost snarling up the fucking universe!) Both 'trips' were almost identical.</p><p>I thought of a way to explain it like this: Say a REALLY proficient witch had turned you into a cat. REALLY REALLY turned you into a cat. Now it sounds really amusing to read all these descriptions of visions and patterns (in those stories on the net)--just like it sounds kinda amusing to read about someone being turned into a cat---but BAM---you really ARE a fucking goddamned cat---and your consciousness it totally clear and unfuzzied--and you are standing there, in the parking lot, on your four fuzzy paws--trying to deal with the absolute undeniable FACT of being a cat! Just how do you really go about dealing with something like that---when, a moment before, (and as far back as you can remember), you were always a human?</p><p>This is just an illustration---but it gives you an idea of what it's like. On acid I SEE these patterns superimposed over everything I am viewing---with this stuff I are experiencing it! I'm pretty sure, in both cases, I am seeing the synapses (or pixels, if you will) of the neural pathways in my brain, that supply the illusion of reality to my 'screen'---but I don't think of that when this salvia trip is happening---I am really flowing down the bloodstream of the entire cosmic universe. I'm sure that if I just break through HARD--I go off into the part of the brain that triggers, and creates, dream worlds---or maybe I go into some actual real astral plane--or faeryland---or netherrealm---but I don't know if I'm ready--or WANT to! Will continue this journal!   But I have a feeling an ounce of this stuff is going to last a VERY long time!</p><p>___Royboy</p><p>My brother wrote me back a letter saying something about how maybe I was just tantalus, trying to get a high from this stuff, (as a warning that it might not really be fun)--I told him-'No! It's definitely NOT fun!' And I asked him what tantalus was---and he said it was a guy, in Greek mythology, chained to a wall in a dungeon, with grapes dangling before his face---so this was my answer:</p><p>The 'grapes', in this case, is seeing my hand, (which was the last thing I saw before closing your eyes) splitting off---flaking off--in cartoon stages --away away away: and thinking: 'this is the hand of roy--who lit a pipe---long ago---(three seconds)--and isn't it too bad---he was an ok guy---but now there are just these cartoon shingles ---flapping off into the distance-- to remember him by.' </p><p>Probably just gonna throw this stuff away!</p><p>*     *     *     *     *     *     *</p><p>Well--that's what I thought as I wrote to him---but I still wonder what was at the end of that tube!</p>",
 "year": "2002",
 "id": "19144",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-11-25T08:00:00.000Z",
 "views": "9776",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
