{
 "id": 19155,
 "title": "Walking Through the Fire",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Respondent 91",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "My wife and I were introduced to Ecstasy by a friend. We are both 40 years old. We had been going through some difficulties in our relationship, so the friend thought it 'wouldn't hurt' to give E a try.",
  "We were at home and relaxed. We took our tablets and waited. Within half an hour we both experienced a warm wave wash over us. The CD's our friend had lent us for the experience became the most beautiful and perfect thing we had heard and completely matched our emotional soaring. We experienced a curious but very pleasant trembling visual sensation - we have come to call this 'champagne for the eyes'.",
  "We began to talk to each other, in fact we just couldn't stop talking. We talked about our relationship and how much we loved each other. We realised that the hard times we were going through were as nothing compared to the deep love we had. It was the most emotional experience we had ever had and we both cried because of how we had hurt each other.",
  "But the tears weren't just negative outpourings. It was as if we were finally able to express ourselves to each other for the first time. We also knew, beyond doubt, that our feelings were not artificially induced by the drug, but that it acted as a kind of truth serum, unlocking deep emotions.",
  "Soon enough, the tears changed to smiles and a very strong desire to just touch the other person. The tactile qualities of E are incredible.",
  "It suddenly dawned on me that I had been living under a self-imposed burden of negativity for about ten years. As soon as I realised this, it was as if that burden dropped away. I felt as if I had walked through a fire that had burned away all the crap in my life, and I could start afresh.",
  "We kept saying out loud how beautiful the experience was and how it should be available to everyone. How ludicrous and arbitrary to make such a positive thing illegal! In fact, for weeks afterwards I became an Ecstasy Evangelist! urging all my friends to experience it.",
  "When that first experience came to an end we felt sad that we could not go on in that state for longer, but even perfect states have to come to an end.",
  "Ecstasy has changed my life in so many positive ways, impossible to list them all here. My wife and I are closer than we have ever been. I am so very grateful to the drug and our friend whose insight and sensitivity enabled us to emerge from a spiral of negativity."
 ],
 "erowid": {
  "id": "97040",
  "citation": " Respondent 91. \"Walking Through the Fire: experience with MDMA (Ecstasy) (ID 97040)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97040",
  "substance": "MDMA (Ecstasy)",
  "views": "851"
 }
}
