{
 "title": "Our Legs Are Covered In Foam",
 "author": "Dan.",
 "citation": " Dan.. \"Our Legs Are Covered In Foam: experience with PCP (Angel Dust) (ID 19157)\". Erowid.org. Oct 22, 2008. erowid.org/exp/19157",
 "substance": "PCP (Angel Dust)",
 "bodyweight": "165 lb",
 "report": [
  "<p>My experience occured about a year and a half ago, when I was 14 and heavily into drinking and smoking marijuana. . .I was in the middle of a football camp week, and that night I had a few friends over. We were basically bored, until one of my other friends called my up and asked if I wanted to go smoke some weed, and threw out there that he had some dust, so I happily agreed. We walked our asses about a mile to some bridge in the woods next to a lake.",
  "Well anyway, he busts out this shitty ass wooden bowl and we throw all that stuff in there and smoke it. We then stand up and about 5-10 minutes later we're really feeling it, my friend sayss, 'dude, just pretend we're sitting in some big ass reclining chairs watching TV' so I did it. . .it was soooo comfy and real feeling. My other friends(who were sober) said we sat in the most uncomfertable looking positions for about 20 minutes.",
  "After that we journied off the bridge into a trail in the woods, my friend starts doing to siccest impression of the Corcodile Hunter, he was like, 'look over there! it's a three-toed sloth with Goneria' and I get down on all fours and start doing all the habbits he is saying it does. . .including sexing my friends mother and walking extremely slowly(later my friends told me i was crawling through glass not even phasing me).",
  "We continued down the trail until we looked out onto the lake and saw some floating lily pads. . .or so we thought. We kept focusing on these things until we got closer, and they started moving! This was all in the dark so me and my friend start bugging out thinking it was a submarine coming up from the depths. . .THEN! we instantly found ourselves in the middle of the Vietnam War for some reason, shooting 'charlies'.",
  "Later down the trail we hit some LONG grass which was really bugging us because it felt like bugs on our legs, but my friend says, 'man, we cant feel this, our legs are covered in foam'. . .and that instant the irritation dispeared, it was great. A few feet more and we found ourselves in one of those old Mario games for nintendo, picturing it seemed so real, like I was really in it. . .",
  "Well, the last funny thing to happen was I closed my eyes while we were walking and I could still picture the suroundings as if my eyes were open, but it was changing colors like crazy. . .until, SLAM! I walked right into the raised bridge. . .5 minutes later I noticed I had a huge gash on my arm, and continued to go off on my friend for about 5 more minutes about how they should have told me the bridge was there.",
  "Man that was great. . .I haven't done it since, but I probably soon will.</p>"
 ],
 "year": "2001",
 "id": "19157",
 "gender": "Male",
 "views": "6166",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "PCP"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "submissionDate": "2008-10-22T07:00:00.000Z"
}
