{
 "id": 19154,
 "title": "Love on E for Real?",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z"
 },
 "author": {
  "name": "Respondent 88",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I just wanted to write to thank you for such a good site and to share my experiences with you in the hope that it may help others in the way the site helped me.",
  "I am a woman in my late 20's and up until six months ago had never taken E before. As a teenager I had taken a lot of acid, and stopped when I was 20, deciding that I had learnt a lot about myself, and didn't 'need' to take any more.",
  "My first experience with E was amazing: the people, the music, the freeing up of my emotions, and the fact that I was soooo happy. I continue to take E about once or twice a month now. The experience I wanted to share with you is with regards to a relationship.",
  "I met this guy a couple of months ago when we were both on E. I saw him across a club (corny I know) and he looked so familiar. We spent that whole night together, just talking, and really clicked. The next night just the same, except we also had the most amazing sex. I was beginning to feel very close to him, even though I was on holiday and knew it couldn't last.",
  "He flew out to see me the day after where I went next on my trip, and we spent two amazing days together. The last night we both took a pill, and just talked all night about how we felt about each other. I spent my last day with him, and we discussed about me moving from England to live with him in the US. Now I know that sounds crazy, but we both seemed to feel the same way about each other, and it seemed so right.",
  "When I came back to England, he sent me email after email telling me how much he loved and missed me, and wanted me to be there. We had 5 hour telephone conversations, and I was really falling in love. All this time I knew he was going out at weekends and taking E's and GHB. However, as I was taking pills too, and knew how I felt for real, I assumed that he felt the same way too.",
  "This carried on for three weeks, and we decided to meet in New York for the weekend. It was the most amazing weekend of my life, we had so much fun, and yeah we took a pill each on the Saturday night. After the weekend I was even more sure about how I felt, and we planned for me to move over in a couple of months.",
  "We both came back to our homes and it started to go downhill a bit. We had an argument and he went out on a BIG bender, taking 10 pills, mushrooms, and god knows what else over three days in a row. Despite this, he was still telling me that he loved me.",
  "He then said that he was coming down with something, and it transpired that he was just 'coming down' big style. He wouldn't speak to me or answer my emails for days. He then started to doubt what he felt, and wasn't sure if it had been due to love or to E. He decided to stop taking E and try to sort his head out.",
  "Because of this, he said that it wasn't fair to make me give up everything I have in England, as we didn't really know each other, having only known each other for 6 weeks, 5 of which we'd spent apart. He said that he couldn't deal with the responsibility of me giving it all up for him if it didn't work out. I was devastated by this, as I'd let myself fall in love with him (and I don't fall in love that easily).",
  "We've been talking a bit over the past couple of weeks since he told me, but it's not the same. He comes over here in a week's time, and we've planned to spend some time together. He initially said he was off the pills, but has since changed his mind and admits that with his circle of friends he has it would be difficult to stop. I know that when he comes over we'll have a great time, great sex, and take E's. But it won't be for real.",
  "I'm finding that ecstasy blurs the edges between fantasy and reality, and maybe what we would like to feel and experience overshadows what we really feel. I'm finding that ecstasy blurs the edges between fantasy and reality, and maybe what we would like to feel and experience overshadows what we really feel. Despite all this, I can't just disregard what we had together. It was the most fantastic 6 weeks of my life, and I experienced the entire range of emotions in that time. From complete euphoria and love, to absolute devastation and pain.",
  "I wanted to share this with you, because it was so intense and inspiring, and now that I know that it's possible to feel that way about someone so quickly, and make potentially life-changing decisions because of it, I had to put it all in writing. Who knows, perhaps it will work out, and what we thought we felt due to the pills is really what we feel for real. If so, watch this space..."
 ],
 "erowid": {
  "id": "97039",
  "citation": " Respondent 88. \"Love on E for Real?: experience with MDMA (Ecstasy) (ID 97039)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97039",
  "substance": "MDMA (Ecstasy)",
  "views": "1034"
 }
}
