{
 "id": 19162,
 "title": "E-Induced ESP",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Respondent 81",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "I am a 21 year old sales engineer and part time webmaster working in Miami. I have been enjoying E for about a year now and very recently I had an amazing experience while on it. Now 'amazing' experiences are not uncommon while rolling on ecstasy, but this one might be.",
  "I was at a party with a good sized group of close friends who also liked to roll and a few of us were relaxing in a room with dim lights while watching another of our ranks show off his talents with a pair of glowsticks. Then it hit me! At a certain moment my friend who was dancing with the glowsticks changed. His face became more tanned; his facial hair grew thicker; he sprouted three piercings (an eyebrow ring, a nose ring, and a lip ring) and directly behind him appeared a leopard skin background out of nowhere! He had become some strange rave-dancing jungle-pirate! Now keep in mind that my friend normally has no piercings, only light facial hair, and slightly tanned skin. The sight lasted just long enough for me to say, 'What the..?'. The sound echoed in my ears, or so I thought. At that moment my good friend sitting right next to me turned, as did I to meet his astonished gaze, and said, 'Did you see that shit too?!'. At that moment my good friend sitting right next to me turned, as did I to meet his astonished gaze, and said, 'Did you see that shit too?!'. My jaw dropped and we began recounting details of what had become 'our' experience one detail at a time.",
  "As we spoke of our close encounter of the X kind, our friends standing nearby overheard and were laughing with amazement. And our shape-shifting friend who was dancing stopped and looked a little nervous. My friend and I who shared the vision gathered our wits and proceeded to party until the sun rose over our crazy group.",
  "Is ecstasy induced hallucinatory ESP possible? Absolutely. Next week I'm going to try levitating my glowsticks..."
 ],
 "erowid": {
  "id": "97047",
  "citation": " Respondent 81. \"E-Induced ESP: experience with MDMA (Ecstasy) (ID 97047)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97047",
  "substance": "MDMA (Ecstasy)",
  "views": "971"
 }
}
