{
 "id": 19160,
 "title": "Age Is Just a Number!",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z"
 },
 "author": {
  "name": "Respondent 86",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "I'm a graphic designer in Vancouver and have many 'corporate clients' that I deal with on a daily basis. But recently I ran into a friend of a friend who knew a DJ who needed some hi-end design work for flyers advertising a rave. I've always been one to try something different, and this sounded like it would be fun. I met the DJ, we talked about what he wanted and, after about an hour of discussing ideas, I was totally pumped and very interested in this 'Rave Scene' he talked about.",
  "A week later everything was done and ready to send out, the finished product, as my new friend the DJ would say, was 'totally sweet!' He asked if I would like to go to his rave, or as he called it, 'the event.' I replied that of course I would love to go and check it out. That was it, I was on the guest list! I could have invited another person but I felt that it would be better if I went on my own. Being 36, I thought that hanging out with a much younger crowd would be too uncomfortable for my friends to experience...",
  "The following week came up fast, it was finally Saturday night and I was feeling a little bit strange knowing I would not know a soul, and I would most likely be the oldest person at the rave... but I was ready! I called the rave 'info line' around 11pm to get the location, then I was off! I arrived at an out of the way location and was amazed at how many people were lined up to get in.",
  "'Oh my god, what have I gotten myself into now?'.",
  "I looked around and saw a sea of people from 17 to 20something, all looking just wild: face paint, glow sticks, fat pants, dancing in a style I've never seen before... it was very ritualistic. Then I saw my DJ buddy, waving me over towards him and his friends.",
  "I said to him, 'Wow, is it always this loud and crazy?' He looked at me, laughed and said 'relax, it's just a gathering of love and togetherness'. He then asked if I'd ever done ecstasy, I said no, and he grabbed my hand, placed a green pill in it and said, 'drop this, you'll love it, it will make tonight an experience you're sure to remember'.",
  "I wasn't too sure about taking chemicals, especially when I didn't know a thing about them, but for some reason I felt compelled to give it a shot. I went to the can, cupped a handful of water and swallowed the pill, thinking 'here I am, a redneck, at a rave in the middle of the night, doing drugs for the first time in 14 years...what am I doing!'",
  "Thirty minutes later I felt an incredible feeling wash over my entire body - it was like having warm water pour all over me, and it was excellent! All of a sudden I felt no fear in meeting people and talking to people, it was totally a mind-opening experience. The music was enveloping me and I found myself on the dance floor dancing like I had never danced before. People were smiling at me and I smiled back, it felt good! A girl walked up to me and gave me a bottle of water telling me that I was to drink one every hour. 'No problem'. I was feeling just fantastic, I was in total euphoria. As I continued dancing, I began to sweat... a lot, I then noticed that a few guys had taken their shirts off, so I followed, phew! Another girl came up and offered to rub ice on my back, which was followed by a back rub. I took heed of my DJ buddy telling me to take a break for 20 minutes and cool off for a while, which I did off and on throughout the night.",
  "After hours of dancing, tons of hugs, back rubs, and that all round lovin' feeling, I started to come down... it was 6am. Time to go home.",
  "I met so many nice people that night and made a ton of new friends who looked at me not as some old guy, but as an equal having fun, not worrying about anything negative... only the positive. That night truly changed my life. So much happened but the most important thing to come out of it was that I was in a setting of a thousand people who all felt the same way I felt... euphoric! I have since been to a rave about once a month, I've change my style of clothes, changed my hair and it's all good. I'll keep doing the scene for as long as I can because age is just a number...not state of mind!"
 ],
 "erowid": {
  "id": "97045",
  "citation": " Respondent 86. \"Age Is Just a Number!: experience with MDMA (Ecstasy) (ID 97045)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97045",
  "substance": "MDMA (Ecstasy)",
  "views": "1107"
 }
}
