{
 "id": 19168,
 "title": "2CB Revitalised My Ecstasy Experience",
 "date": {
  "submission": "2012-07-23T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Respondent 62",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "10 mg",
   "substance": "oral"
  }
 ],
 "report": [
  "<p>I have been using ecstasy for about 4 years now, and like so many others, I have never had that wonderful fresh experience for the last three years. I used to blame it on the quality of the pills, but then I talked to new people on the scene who did manage to have the most wonderful experiences, and they had taken exactly the same as I had. So I had to admit that it was something to do with me, and told myself that I had damaged myself and would never be able to feel that true ecstasy bliss again.",
  "Then I made a chance discovery. I had only one E left which I knew it was too weak to do much on its own. But I also had some 2CB tablets, those very small white ones (sold as a treatment for male impotence!) which are 5mg each. So I decided to boost the low dose E with 10mg 2CB.",
  "The result was incredible! It really was just like I remember from the good old days. As good as my very first E trip!",
  "I spread the news among my friends, since 2CB is not hard to get here, and they all reported the same.",
  "South African man",
  "[Note. 2CB used to be sold as Erox in very small red/purple domed round plain pills, but is now often found in even smaller white pills. Both types have the same content of 5mg 2CB. See under Other Drugs]",
  "PS",
  "Other people have told me that 'white grapefruit juice' is effective in enhancing most psychedelics including MDMA: '100 mg with the MDMA, just before the peak, or on the way down, seems to greatly enhance the entacogenic/empathogenic qualities without causing an increase in muscle tension, gitters, etc.'</p>"
 ],
 "erowid": {
  "id": "97053",
  "citation": " Respondent 62. \"2CB Revitalised My Ecstasy Experience: experience with MDMA (Ecstasy) & 2C-B (ID 97053)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97053",
  "substance": "MDMA (Ecstasy) & 2C-B",
  "views": "1643"
 }
}
