{
 "id": 19188,
 "title": "Good Thinking Space",
 "date": {
  "submission": "2013-01-02T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Steve",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "38 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Setting: My room, with a laptop just chillin with some tunes",
  "Mindset: curious after reading other reports",
  "21:25 5-MeO-DALT 38mg oral in tissue, eaten fairly well loads of ham sandwiches so not an empty stomach",
  "22:09 nothing?",
  "22:16 reading trip reports online, look away and the light colour of the letters on the dark background seem to have put a liney overprint on whatever I look at",
  "22:59 was gonna say a bit ago its a good mental place for thinking about stuff, which it is, but now Ive got myself onto a pretty negative train of thought, Im not tripping but I think Im having a bad trip, weird",
  "writing that down it put me on a another train of thought, a positive one, now Ive got a massive grin on my face. Will remember the writing stuff down thing for the future maybe? Works a treat!",
  "visually things are different, but hard to say how, Im sure you know what I mean by that, think maybe a bit brighter, and things seem now quite right size wise but its all very very subtle, visual fields got that fuzziness to it like when visuals are about to develop but I know in this case theyre not gonna. Wanting to stare at things more, and feel I could stare at things for ages. But I know staring at things  is generally considered strange by most people and I dont wanna be that guy sat on his bed staring intently at his wall paper. That would be ok if what your looking at is a never ending beautiful complex fractal pattern, thats getting more complex and more beautiful the more you look into it and you understand the whole of everything, ever. but in this case its just not, so we cant go down that path tonight unfortunately",
  "also, slight jaw tension",
  "read what I wrote the last time I did this",
  "distracted from film abit, maybe a very very subtle hint of visual stuff but really nothing, bit of body load, and hard to sleep. nothing great to report, bit shit really",
  "that was 50mg insufflated, so definitely think the oral dose is doing way more for me,  the different routes of ingestion seem to have different effects, which would suggest the active chemical in my CNS right now is not 5-MeO-DALT but a metabolite. note to self: learn about metabolism and stuff and what enzymes are about, what things they can change and what do they change them into.",
  "note to self: I now want to learn about metabolism. Learning/education= good. Interesting",
  "would I want to learn about metabolism if it wasnt for my interest in drugs, probably not.",
  "would I be as interested in drugs if the psychedelic experience  wasnt  as interesting/all of the many things it is, probably not.",
  "So it would then be true to say the psychedelic experience has led to me wanting to learn more. The value of learning/education is well known so this will clearly be a big positive thing for me in my life. Maybe not only my life, my thirst for knowledge could lead anywhere, it could make me into a better employee or may result in my becoming an actual employer. Use your imagination, I think you can see what Im getting at, if you cant see what Im getting at, maybe try some psychedelics",
  "01:11 effects pretty much over, maybe still some mental stimulation, should sleep ok I kinda tired"
 ],
 "erowid": {
  "id": "97150",
  "citation": " Steve. \"Good Thinking Space: experience with 5-MeO-DALT (ID 97150)\". Erowid.org. Jan 2, 2013. erowid.org/exp/97150",
  "substance": "5-MeO-DALT",
  "views": "2049"
 }
}
