{
 "title": "Riders On The Storm",
 "author": "Anon",
 "citation": " Anon. \"Riders On The Storm: experience with H.B. Woodrose (ID 19180)\". Erowid.org. Dec 4, 2002. erowid.org/exp/19180",
 "substance": "H.B. Woodrose",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "oral",
   "H.B. Woodrose",
   "(extract)"
  ]
 ],
 "report": "<p>\nFirst LSA  (Riders On The Storm)</p><p>Substance:  Hawaiian Baby Woodrose Seeds  (argyreia nervosa)</p><p>Subject:  Male/40yrs, 160 LB</p><p>Health Status: Fair</p><p>Medications: None</p><p>Nutritional Status: Excellent</p><p>History:  LSD---quite familiar.  Mushrooms---only a few small trips.  Cannabis---extensive.</p><p>--------------------------------------------------------------------</p><p>After a 5-yr. vacation from psychedelics, subject decided to try an LSA intoxication.  The first attempt was disastrous for reasons unnecessary to discuss, but successful enough to know I had the real deal (HBWS) here.  Three days later I visited a friend who had not tripped in yrs and wanted too.  My friend and his g/f did a clear water extraction of 12 seeds.  Time: approx. 9:00 PM.  The seeds were first thoroughly scrapped with a sharp knife and then crushed with pliers, then ground into semi-powder form.  Seed powder was emptied and shaken in clear water (about 4oz) plastic bottle for aprox 20 minutes.  The contents was filtered and  4 more oz water added and filtered again.  Friend began to trip about 30 minutes following ingestion.  G/f crashed out in bed.   My g/f and I repeated the extraction process w/ 6 seeds.  She never felt any effects except some nausea, while I began feeling the effects immediately. </p><p>It was an unseasonably warm November night with severe thunderstorm warnings on TV and the beginnings of lightning in the air.  After about 30 minutes, I experienced no nausea and decided to crush and chew one seed.  With my g/f needing to go to her home in the country, we split leaving my friend zoned out on computer games but tripping indeed.  By the time we got to her house (proly 1 hr after ingestion) I began experiencing all the conscious expanding qualities typical of LSD intoxication with the exception of visual hallucination.  It was a rather rustic setting in rural mid-south U.S.A.  I took a peculiar notice of several pieces of engraved artifacts.  Hand or factory made clay, ceramic or synthetic, painted clowns, jesters, Native American Indians, among others.  Not having much exposure to primary art forms, I simply let my LSA mind absorb these motionless artifacts, feeling the intent of their existence. </p><p>With the need to return to my place (approx. 40 miles), we hit the road.  Shit, now Im peaking and this storm is getting closer.  I simply took my time and relished the experience.  Beautiful colored bright autumn leaves in and from trees swirling in the lightning charged night sky and shinning brilliant in the car headlights.  Not many miles to destination, we hit a severe storm w/ intense rain and wind.  I didnt seem prone to panic and willed my mind into a survival mode.  Riders On The Storm.  The remaining trip was simply focused on getting some sleep.  6 mg melatonin and some herbal sleep aid closed the curtain quite well.  I woke about 5 hrs latter quite refreshed and energetic and experienced a good afterglow all day.  HBWS have a distinguishable and authentic ergot signature.   </p><p>It is now almost 6 days latter and I still feel the remnants of this plants power.  I had planned on dosing again yesterday but could not.  After a 24 hr extraction of 4 seeds, I tried a rectal administration only hrs ago w/ no noticeable effects except runny stool from enema.  From now on I will extract w/ clear water for about 15 minutes; any longer extraction period would presumably only allow more undesirable plant material and its bad side effects.  If my plant matter were in a more pulverized form (powder), the recommended 6 minuets would probably be ideal.</p><p>Philosophical Implications:  The overriding thought during this trip was the mysterious nature of reality.  This psychedelic experience did reveal the fact that reality isnt what ones rational mind always supposed it to be, but what indeed is reality?  What philosophy, religion, art, science, will objectify my subjective experience?  As my mind spanned across numerous paths both far and near, I could only know that Mind must be directed by Will in whichever path possible in my world. </p><p>My mind is large and path is small</p><p>A morning glory becomes an evening fall</p>",
 "year": "2002",
 "id": "19180",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-12-04T08:00:00.000Z",
 "views": "21477"
}
