{
 "id": 19187,
 "title": "Tweaking Hell",
 "date": {
  "submission": "2012-08-15T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Helgi",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Let me start this report by saying I'm fairly experienced with uppers and the chemist I got the 6-APB from said I was sensitive to them. I've done plenty of powder, banged loads of dope, and popped assorted research chemical stimulants. I have also been diagnosed with Paranoid Schizophrenia and Psychosis N.O.S.",
  "It was around 8pm when I popped the pill, and prior to taking it I read several experience reports so I would know what I was getting into and about an hour later it kicked in.",
  "T+1:00  I feel a climb: becoming more awake, having more energy than I would normally at this time of night, but still feel 90% sober.",
  "T+~2:00  Me and my friends smoke a dime, almost peaking and it feels like a less edgy shot of dope. The bud slows my mind down and eases the tweaking shakes, but the biggest rush of euphoria I ever felt hits me as we pass around the last blunt (rolled with shake).",
  "And from here (somewhere around 10-11pm) til 2am the next day it was game on... For those of you reading this that have experience with ice or shake & bake: remember what your first shot/hit of it felt like? It was exactly that for 27hrs. For those of you who never sped before and are taking this: My mind was rushing at a billion miles an hour. I was having genius ideas for inventions every other thought, discovering things about myself and my past, grinding my teeth to dust, sweating like I was running in the desert, and my body was floating on rolling clouds of cotton.",
  "T+7:00  It's around 5am and the euphoria created by the drug ended, but I wasn't worried about still being up because when I went on dope binges I couldn't eat or sleep the following night (and it's a common experience as well).",
  "T+9:00  STILL TWEAKING!!! no euphoria at all, just... up. At this point I begin to wonder if I did any serious damage to myself mentally and physically. The speeding starts to mess with me and it agitates my MI. At this point I didn't have a way to check the time so I'm going to safely assume that this part of the report happened over the course of several hours. After being up for so long I begin to crash, but moments later I come right back up to peaking point. This happened several times over yet each time I came down the crash was a little harder and lasted a few moments longer than the last, and oddly enough I came back up to the same peak each time.",
  "The roller coasting really drained me, and being outside in 100 degree F weather didn't help, and soon my MI got super agitated. When it happened, it was like I was on a bad mescaline trip; I wasn't connected to reality at all, basic logic completely left me, I was really delusional, hearing people and music and traffic that wasn't there, and I cried for absolutely NO DAMN REASON. The grass was freaking me out because it hasn't been cut, houses started swaying like boats on water, flora started breathing, my friend told me he was going inside to grab a drink and I was so insane at that point that two minutes felt like 30 and I thought the whole time he went in to take a nap.",
  "T+20:00  STILL JUST AS UP. I retired to my home, where I could at least try to eat and sleep, also so I could be in a safer environment while my psychotic episode continued.",
  "T+27:00  Woke up from troubled sleep. Hungry as hell, tired as hell, and traumatized. I looked everywhere online at every stimulant experience and realized that my account was so uncommon that I might as well have been the first. It completely killed my enjoyment of speeding and it made me want to slow down and stop drug use. It also made me realize I should restart my anti-psychosis medication because it did permanent damage.",
  "I would like to restate that I was told I'm sensitive to 6-APB and my pre-existing MI probably didn't help anything."
 ],
 "erowid": {
  "id": "97134",
  "citation": " Helgi. \"Tweaking Hell: experience with 6-APB (ID 97134)\". Erowid.org. Aug 15, 2012. erowid.org/exp/97134",
  "substance": "6-APB",
  "views": "4830"
 }
}
