{
 "title": "Inconsistent Potency",
 "author": "Drake",
 "citation": " Drake. \"Inconsistent Potency: experience with GHB (ID 1919)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1919",
 "substance": "GHB",
 "bodyweight": "",
 "report": [
  "<p>Couple of fraternity brothers of mine, had done GHB several times recent to this incident, and were quite experienced with other hallucinogens, and had received it from the same person and in the same type of bottle. This was a small plastic bottle with a spring water bottle-type top. They had been told to do 2 'shots' of one capful per shot, to equal one dose. On this particular occasion, the batch was supposedly strengthened by 3 to 4X. This means that one dose is instead a half capful. Since they had previously figured out their tolerance of one dose to be adequately tolerable, one of the two of them decided he could handle a double dose. However, he had not been informed by his roommate whom had been the one buying it, that this batch was more potent than the last 3 or 4 batches that they had bought. So, he took 4 capfuls. Aforementioned, this equals out to about 12-16 doses, depending on actual potency (who can tell).",
  "Needless to say, this was entirely too much. When I heard the toilet repeatedly flushing, I knew someone was getting sick. He described the experience later to me (was in NO condition to do so then) when he was puking his brains out as a full-on hallucinatory experience. His stomach hurt from the clenching, but otherwise it was not an inherently bad experience. To start. This was about 45 mins after he ingested the dose. Slowly and slowly, he began to lose more and more function. By T+1:30, he was acting the same as people coming home from the bar on their 21st birthday ---- barely audible speech due to slurring, poor motor coordination, and nodding head. He was also back in the bathroom dry-heaving. At T+2, his breathing began to become extremely heavy, and erratic. He told me later that he was still hallucinating at this point, but it was more of an internal type of 'dream' hallucination as is common with the closed eye visuals of ecstacy or mushrooms when mixed with nitrous oxide.",
  "He didn't notice, but when he would not off his breathing would go from short to heavy, to short to long, etc. Also, I noticed his muscles going into involuntary spasms usually directed along the side he was not currently rolled onto. I will tell you, I have witnessed many different 'bad' reactions to drugs, including bad trips, alcohol poisoning, withdrawal from morphine (me personally on that one, while in the hospital), and heroin. And I can EASILY say that this was the scariest thing I have ever seen happen to a human in front of me, let alone someone I know and care about.",
  "GHB, while it may have it's 'benefits' as far as the drug community is concerned, is too much of a designer drug to even consider fucking with. Blah blah blah it's fun when you do the right amount, fine. What about when you don't? How are you to tell? Until a standard system for both synthesis and testing is availible, I think that anyone who would try something that they cannot even distinguish from water by looking is out of their mind [Erowid reminder...Always color your GHB with blue food coloring]. You weigh your pot when you buy it, you count your pills when you take them, why wouldn't you want to test your GHB before you drink it? It's just that simple. All you have to ask yourself is, do you trust the person you're buying this from, that they could make it in their bathtub and DEFINITELY know exactly what they're doing? GHB as it is TODAY, is too dangerous to be trifled with. It's not worth the risk if their's no way to know what your getting.</p>"
 ],
 "year": "1998",
 "id": "1919",
 "gender": "Male",
 "views": "11941",
 "dose": [
  {
   "time": "0",
   "amount": "2.5 ",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2000-06-19T07:00:00.000Z"
}
