{
 "id": 19191,
 "title": "4th of July",
 "date": {
  "submission": "2013-01-16T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "leslie",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "37.5 mg",
   "administration": "oral",
   "substance": "4-HO-MET",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I have had experiences with RC's but my experience with 4-HO-MET was the most memorable and psychoactive. It was Independence day and my friends had taken their dose earlier in the day.",
  "When they had arrived at my house they were well still tripping. They told me they had taken it and it was time for me. We walked out into the woods  and found a comfy bench on a remote gravel trail. It was hot outside and the sun was shining. I had been excited about this event all day and wanted to get straight to it.",
  "My friend suggested to open the 3 capsules of 12.5mg of 4-HO-MET and pour it into the water I had brought. Knowing this was a ridiculous amount, I did so, and began to drink the water. The taste was horribly bitter, almost to the point of gagging. I finished with a twisted face similar of one biting into a lemon.",
  "(T 0-25min)",
  "Nothing, waiting for the effects to kick in. Casually engaging in conversation with my two friends who were coming down from their experience.",
  "(T 25-30min)",
  "It finally hits me. Ground and plants start to move like the waves in an ocean, up and down, up and down. At this time I was in a perpetual state if grinning.",
  "(T 30-1.30) Everything looks as if I have kaleidoscopes as eyeballs. Everything was begging to twist into a swirl and patterns formed on my body. I remember upside down triangles forming in my skin on my arm. I couldn't stand to look at it.",
  "Also at this point a flood of emotions began to come unto me. I could not form cohesive sentences and I began to tear up. I'm not sure why but I did. I just stared into the never ending twist and turns of the tree branches and long grass.",
  "(T 1.30-2.00) My emotions had subsided and I could finally speak again. I could walk, and function but the visual effects were still strong. Also, my flannel began to feel uncomfortable at the time, as if the tactile sense in my body was increased. I also felt like everything was damp. I kept asking my two friends who were watching me if everything felt damp to them. They responded with no, so it was just me.",
  "(T 2.00- sleep.)",
  "The visuals had subdued to small bubble like waves and I could talk function and control myself as if I were normal. It seemed to me as if my body has adjusted to the effects of 4-HO-MET it was at least around midnight when I decided when it was time to go home. It was just after the display of fire works which did not seem to spectacular and did not impress me even under the influence. Sleep came hard, I lay in bed with eyes wide open not being able to sleep. When it did come it came without notice.",
  "This experience had put me off of 4-HO-MET for a while but it was none the less fun."
 ],
 "erowid": {
  "id": "97179",
  "citation": " leslie. \"4th of July: experience with 4-HO-MET (ID 97179)\". Erowid.org. Jan 16, 2013. erowid.org/exp/97179",
  "substance": "4-HO-MET",
  "views": "1276"
 }
}
