{
 "id": 19194,
 "title": "Compulsive Re-dosing Throughout The Night",
 "date": {
  "submission": "2012-08-13T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Applehead",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I started on a friday afternoon, sober and doing some work. Snorted small amount, at 14:00  and initial burning discomfort in the nose wore off to positive feelings, and started wandering around for a while, and did some cleaning. I notice raise heart beat and elevated breathing. Was able to continue to go back to work without fear at this dose, although I kept feeling a slight 'fall' leading to desire to do more.",
  "That evening drank several beers and snorted some more, about .3g in total over 4 hours. Very elevated feeling, couldn't keep face or tongue still and still very positive. Noticable muscle tension, heart elevation (130bpm when sitting down) and desire to fill my lungs with air. Interestingly appetite was not affected at the lower doses, and was able to cook and enjoy a light dinner at 20:00. This really helped and supported more doses into the evening. I can actually eat on this stuff, if I need to.",
  "By 12am I didn't care about what had been consumed, and was feeling very sociable, and interested in what was available on TV or internet. Vast quantities of alcohol had been consumed with little effect. Whatever was an idea felt extremely positive, until the negative feeling appeared, and the desire to do more met me again. The problem is that I got a negative emotion after about 30 mins, which lead to more. This drive is more noticable / powerful than other stimulants.",
  "In total consumed 0.8g and remained awake until 1pm the next day. Felt generally ok the next day, but by 3pm couldn't keep eyes open, and had lost interest in all TV or any ideas i had to do. Other people become annoying. The uncomfortable feelings remain until 10pm the next day when finally go to sleep, naturally without any sedatives.",
  "Experienced nose damage for about 14 days after trying this, with constant runnyness, esp after meals. No other psycological effects such as fear, depression or paranioa after I rested.",
  "Final note: This was a one off. I consumed less than a gram and it took 48 hours to wear off. If this is consumed on a regular basis I am sure it would screw me up. People on a night out should be aware that the effects keep building after 30 mins and to treat this with respect & be careful."
 ],
 "erowid": {
  "id": "97190",
  "citation": " Applehead. \"Compulsive Re-dosing Throughout The Night: experience with Ethylphenidate (ID 97190)\". Erowid.org. Aug 13, 2012. erowid.org/exp/97190",
  "substance": "Ethylphenidate",
  "views": "6211"
 }
}
