{
 "id": 192,
 "title": "Lightly Floating",
 "date": {
  "submission": "2013-11-19T08:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "my3rdi",
  "gender": "Male",
  "weight": "245 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 ug",
   "administration": "oral",
   "substance": "AL-LAD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Kratom",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Background: 29 year old male.  6'2' 250lbs.  Very experienced with psychedelic drugs. ",
  "Going into this experience, I had been quite stressed from personal financial matters and work related complications.  I have the house to myself for the night.  Girlfriend is gone for the night, and the roommate is out of town.  My dog will be keeping me company.  I had a few beers in the afternoon(between 2:30 and 3:30).  Followed by hydrating, and relaxing.  I ate an early dinner.  Around 5:30.  2 slices of pizza.",
  "7:52pm I opened a beer to relax my nerves.  I plan to consume about half of it before dosing the AL-LAD.  I will wash down the 4-aco-DMT with a few sips of beer.",
  "8:08pm dose placed on tongue",
  "8:16pm AL-LAD onset is always super quick.  Warmth, slight alertness, light headed buzz, and euphoria.  Tab still is in my mouth.",
  "8:20pm tab swallowed",
  "8:23pm 4-aco-DMT consumed orally",
  "8:25pm Very alert.  At a ++",
  "Still nursing my beer.  About to put on some music.",
  "8:31pm I let the dog out to pee, plus took a few rips off my kratom vape pen.  Feeling really good.  I am sweating.  Which is normal for these psychedelics.",
  "8:42pm very smooth come up.  I feel the speedy component of the tryptamine as well as the dream state of the ergoline.  The dream state will over take it, I know this",
  "8:55pm Tracers present.  Very tactile feel.  Loss of ego present.  I feel very connected.  Thinking a lot about my relationship with my wonderful girlfriend.  Rooms and my phone are breathing.  Huge connection with my fellow man.",
  "Little to no body load for me.",
  "9:01pm minor closed eyed and open eyed visuals",
  "9:18pm still at ++",
  "Enjoying the introspection and the CEV's",
  "Thought a lot about the tendencies and actions of an old addict friend I haven't spoken with in years.  I miss him despite all his short comings.",
  "I reflected on my own short comings.  How I can be wasteful or irresponsible.  How I have slowly been making changes.",
  "9:31pm shooting up to +++",
  "Visuals intensifying.  Thoughts quite profound.  Pondering my death.  My life.  Connections.  What is and isn't worth doing?",
  "Some mild stomach discomfort",
  "9:49pm still some stomach discomfort.  Trip is intense.  Shower curtain is vibrating.  Like a water fountain tumbling down.",
  "10:04pm stomach discomfort dissipating.  Still at +++",
  "10:31pm",
  "Stomach discomfort completely gone.  Really high.  Just took several rips of kratom.  It really potentates the trip.  Cracked beer #2",
  "10:44pm cracked beer #3. Def past the peak.  At a ++ right now.",
  "11:00pm I just ate some Indian garlic fried rice, leftovers.  Taste is incredible.  Very spicy.  I am sweating profusely from it.",
  "Post Trip notes:",
  "Between 11pm and 3am, I watched Fear and Loathing in Las Vegas and then the Big Lebowski.  I administered St. John's Wort, Valerian Root, and Melatonin to myself around 3am.  I feel asleep right before 4am.  I woke up around 7am. ",
  "I had a hangover from drinking 8 high gravity beers, plus the usual feel from synthetic psychedelics.  By the afternoon, I felt fine.  I rested, and exercised (as sweating out the toxins is the best means to recovery). ",
  "Overall it was a great trip.  I never really got too out there.  It also never really reached the level of intensity I desired, but that was also expected given the dosage of each substance.  As a side note, I find kratom to be an excellent substitute for marijuana when it is absent or not available.  I had purchased an e-cig from a local head shop which had a kratom cartridge in it.  It def helped in the trip and intensified the trips at times."
 ],
 "erowid": {
  "id": "101836",
  "citation": " my3rdi. \"Lightly Floating: experience with AL-LAD, 4-AcO-DMT, Alcohol & Kratom (ID 101836)\". Erowid.org. Nov 19, 2013. erowid.org/exp/101836",
  "substance": "AL-LAD, 4-AcO-DMT, Alcohol & Kratom",
  "views": "741"
 }
}
