{
 "id": 19204,
 "title": "Hula Hooping",
 "date": {
  "submission": "2013-02-06T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "wolf girl",
  "gender": "Female",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Products",
   "specific": "Smoking Blends"
  }
 ],
 "report": [
  "Background: I've been using herbal insence for majority of this summer. If not smoked several times a day, it's several times every other day or so. so I've been using a lot. This particular strain was 'Evilded's mario madness' from Jonny Clearwater. Normally I feel that incense is better than marijuana but after last night I'm scared to try this again. It was the first time I've ever had a bad reaction to this stuff.",
  "Last night right before bed, it was about quarter to 4 am. I finished my game of mah jong and was heading to bed. I had packed a bowl of the insence in my pipe shortly before this. I took one hit 10 minutes before getting up to sleep. I took either two or three hits right before I crawled into bed. I was laying there with my eyes closed, and the first thing I noticed was wrong was that, laying in bed, I had thought 2 of my friends, K and E, were with me. It didn't occur to me until a few moments later that I was alone. I didn't know where I was until I opened my eyes, and even then it took me a minute to remember.",
  "I felt like I was going to puke so I tried walking to the bathroom but had to lean against a wall just to walk. I only made it to the sink, but I didn't puke, I just had to spit. I was standing in the bathroom when things get *really* weird. So anyway, I was standing at the sink staring at myself in the mirror. As I was standing, my knees started getting weak and my body was shaking. Not trembling, but it was almost as if my body was trying to 'hula hoop'. It wasn't huge dramatic moves as if you were actually hula hooping, but I couldn't control my body. No matter how hard I tried to stand still my midsection would just keep hula hooping.",
  "Then my head felt like it was on fire. I crawled to the living room and tried calling my best friend K. No answer twice in a row. It was 4 am but I had forgotten that part, since I had just left K's house about an hour earlier. I tried calling my friend E (who was also at K's house but left after I did) and he picked up. I told him my heart was racing (I couldn't measure it at the time, but I would guess at least 150-160). I was shaking and crying and to be honest I really felt like I was having a mild seizure. E told me to lay down and to text him in 15 minutes after the incense should wear off. I passed out. I woke up this morning in my bed shortly after noon. My head still feels weird and like Im just swimming in my own thoughts.",
  "Overall smoking these products hasn't been a bad experience. I'm blaming this on the certain strain I had since I'm pretty sure I've never smoked it before. I smoked quite a bit of it earlier (different kind) and wasnt feeling any of the effects (I had a headache later, but that's normal). Although I think I'm going to lay off smoking this for a while, because this experience was scary enough."
 ],
 "erowid": {
  "id": "97246",
  "citation": " wolf girl. \"Hula Hooping: experience with Products - Smoking Blends (Mario Madness) (ID 97246)\". Erowid.org. Feb 6, 2013. erowid.org/exp/97246",
  "substance": "Products - Smoking Blends (Mario Madness)",
  "views": "1012"
 }
}
