{
 "id": 19200,
 "title": "Ups and Downs",
 "date": {
  "submission": "2005-07-08T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "fro",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "daily"
  }
 ],
 "report": [
  "It all started when I heard rumors about reverse effects of pharms. So hearing about how Ritalin makes kids with ADD tired, I figured it could be something to wake me up in the mornings at school. My friend has 10 mg pills, he gave me 2. I chopped up, and snorted both (snorting makes it kick in quicker). 5 minutes later I was so hyper, it was the equivalent of 20 cups of coffee, I was incredibly outgoing. I felt great, and wanted everyone around me to feel great as well, I couldn't stop talking, moving, joking around. 2 hours later I came down with no side effects, I felt as if I had never taken them before, no depression at all. I went the next 2 weeks sober and had no depression or any side effects.",
  "Several weeks after my first experience, I came across 80 mg. Not knowing much about the drug, I decided not to risk an overdose, but instead take 20 mg each day at lunch for 4 days. The 5th day, I felt fineuntil lunch, for some reason my body must have gotten used to getting that dose at a regular time. So when I missed that dose, I fell into a completely opposite state of mind. I was depressed (not euphoric), I had absolutely NO ambition (I didn't have the feeling I could accomplish anything), and I totally withdrew from society (I wasn't talking with complete strangers).",
  "This started at lunch on the 5th day and went on for 2 more days, until around lunch time on the 7th day. For those 2 days, I had the worst mood swings of my life (I have a totally new respect for PMS) every 5 to 10 minutes I would go from normal state of mind, to PISSED, then 5 to 10 minutes later, depressed and lethargic, and back to normal again. However I never had the ambition to use Ritalin to make me hyper, I just felt like laying there and waiting for it to go away.",
  "After that experience, I learned how to use Ritalin efficiently, the effects, without the side effects. I heard Adderall was stronger, and lasted longer. I moved on to bigger and better things.",
  "Adderall was great to say the least. I would get this wonderful tingly sensation whenever my sense of touch was stimulated. Whether it be a slow light tickle over my stomach, or a change in temperature. I was euphoric (even more than Ritalin) I was totally alert and awake, but not hyper like on Ritalin, so I could act sober much, much easier. Plus it lasted longer.",
  "I spent too much money one week, and had to make it up somehow, so I used lunch money to buy Adderall for a week strait. That week was excellent. I aced every test/homework assignment, I ate a bowl of cereal, and a small plate of dinner (just so parents wouldn't get suspicious, I could have gone without) every day for 7 days strait, every morning I woke up ready to go, I was never tired for 7 days strait.",
  "Now the bad effects. The only bad effect that whole week was very little light sleep. I would sleep very lightly for an hour, then spend 30 minutes going to sleep, and that cycle would go on until I had to go to school. But, the next week was hell. Headaches all the time, and even though I didn't take any, I had insomnia, I was VERY easily irritated (just ask my teachers) I picked several fights that week (I've had one fight my whole 16 years of life) And I slept a total of 14 hours every day. 3 of those hours during school. And every morning I woke up more tired than the next, plus I ached horribly from turning so much the night before.",
  "So in retrospect, if you use Adderall and Ritalin with care (once a week to be safe) you will keep the same great wonderful, and intoxicating feeling every time, without the come down. Although I have never really been addicted, I definitely go through some kind of weird withdrawal where I don't want the drug (possibly due to the incredible lack of ambition) As for combinations, I've never combined it with anything except bud once. I took 40 mg of Adderall, and 3 hits of some pretty good mersh, I had a little paranoia at first, but once I got used to the feeling, I had an immense love for anyone I could see. After the weed wore off I had the euphoria from Adderall, after the Adderall wore off, I fell asleep with no problem, and woke up feeling totally normal.",
  "So there ya go, effects, side effects, and combos with Adderall/Ritalin."
 ],
 "erowid": {
  "id": "9722",
  "citation": " fro. \"Ups and Downs: experience with Adderall & Ritalin (ID 9722)\". Erowid.org. Jul 8, 2005. erowid.org/exp/9722",
  "substance": "Adderall & Ritalin",
  "views": "34955"
 }
}
