{
 "title": "Made for Each Other",
 "author": "303808909",
 "citation": " 303808909. \"Made for Each Other: experience with Blue Lotus & Alcohol (Wine) (ID 19217)\". Erowid.org. Sep 19, 2005. erowid.org/exp/19217",
 "substance": "Blue Lotus & Alcohol (Wine)",
 "bodyweight": "",
 "report": "<p>After some research My wife & I decided to try blue lotus with the idea of having a pleasant saturday night in.  We decided on the lotus & wine method as shown in a UK channel 4 documentary. This coverage claimed this was the traditional way that the ancient egyptians would have taken Blue lotus. Neither of us want to smoke anyway and I have long since given up a tobacco addiction via cold turkey. I consider myself a little experienced in some of the cerebral tour guides (MDMA, cannabis, salvia and most legal highs). My wife is much more cautious, having swallowed a large dose of the modern and highly adulterated drug... 'facts' from a succession of 'war-on-drugs' pushers at early ages. However having seen the documentary with 'normal people on it' and me having sourced a supply (dried flowers & stems) in the UK she became excited though cautious by the prospects. I prepared the wine in the morning and that night we ensured that our young children were safely asleep for the night. The setting was our front room with subdued lighting and unusually no TV or music.</p><p>+1 minute</p><p>We are both wishing that we had bought a bottle of sweeter wine (we used 1 bottle of White Chardonnay) because even though our tastes are dry the flowers having being dried themselves made the wine taste bitter (though not enough to stop drinking). We agreed fresh flowers were probably better.</p><p>+ 15 minutes</p><p>The first feeling of 'something is happening' by her (she is much smaller in body mass). I was 'Is is it just the alcohol or more?'</p><p>+ 20 minutes</p><p>I get an unusual 'emotional opening up' feeling. I just wanted to talk with her 'not at her' as is my unfortunate habit.</p><p>+ 30 minutes </p><p>Something is definitely happening.. Yes it is a bit like MDMA but also not at all like it. It is much more relaxing but the social/empathic bit is more gentle, wanting to connect & talk & laugh.</p><p>+ 40 minutes</p><p>We realise we have begun eating the soaked flowers and enjoying it for how long? it seems really funny we laugh a lot.</p><p>This must be the peak I just want to stroke & touch her & talk & hear what she has to say. She feels much more sexual now unusually ahead of me. She talks about the way it makes her clitoris feel unsually stimulated it is very very swollen to the touch. It takes me aback; 'This is great for women' she says.....no wonder cleopatra looked happy! This bad joke is really funny to us.</p><p>+50 minutes</p><p>Long drawn out foreplay touching and stroking and talking and connecting more than we have for a long long time. Why have I been too busy to do this before? A little introspection.</p><p>+90 minutes</p><p>Still rising experience starting to get very aroused (it slowed me and sped her up - how good is this for couples!) Introspection gone.</p><p>+120 minutes</p><p>Slow deep horny + adventurous lovemaking. It feels like lovemaking is sex and sex is lovemaking if you know what I mean. She says it is lowering inhibitions (it is). She is talking about sex more than ever, communicating with me. This is helping me be a much more patient & ultimately rewarded lover.</p><p>+180 minutes wonderful extended post (multi) orgasmic bliss</p><p>We talk about it a lot. We talk about closing the distance that had grown between us since the birth of our children. We plan to do it again, 'oh god yes'. We wonder what it would be like as just a social thing not between a couple we agreed it would be a great for parties, a really social thing. We agree to introduce friends to it via a party punch and watch. We have fun imagining responses.</p><p>Blissful sleep.</p><p>Kids wake us up I feel fantasically relaxed she does too she runs 4 miles and says she feels great I cycle alongside with the kids feeling great. They can do nothing to bug me. Calm extends into mid week no real come down if it is it is very very gentle - like salvia, I feel I have been taught something. We agreed to experiment further with higher doses, longer soaks, etc. Have no plans to combine or adulterate it seems just fine with wine as if made for each other.</p><p>Hoping for a day when signing this will not seem as scary as it does.</p>",
 "year": "2002",
 "id": "19217",
 "timestamp": "2005-09-19T07:00:00.000Z",
 "views": "70815",
 "dose": [
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ]
}
