{
 "title": "Rocky Mountain Way",
 "author": "SunDance et al.",
 "citation": " SunDance et al.. \"Rocky Mountain Way: experience with DMT & Nitrous Oxide (ID 19216)\". Erowid.org. Feb 6, 2003. erowid.org/exp/19216",
 "substance": "DMT & Nitrous Oxide",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "60 mg",
  "smoked",
  "DMT",
  "",
  "",
  " ",
  "inhaled",
  "Nitrous Oxide",
  "(gas)"
 ],
 "report": "<p>We had backpacked into the Flat Tops Wilderness area for a week of camping and fishing.. I had brought along some DMT that we extracted using the Quantum Tantra Technique. We tried some each night and here is how we did it, and what we each saw.</p><p>After it had gotten dark we put small amounts of the yellowish waxy substance into a glass pipe that was hooked to a water pipe. When the pipe started smoking we bubbled the smoke through the water and took in what we could.  Three quick inhalations seemed to work best. Once one of us had taken in enough smoke we handed them a balloon of nitrous oxide and let them sit back and enjoy the show.</p><p>Butchs report:</p><p>My first attempt:</p><p>I took in the smoke and held it awhile and then let it out and took some more. I thought I had enough so I sat up from the pipe and closed my eyes.  The darkness was forming patterns of orange and red with a black background.  The patterns were getting more complex so I knew that this was going to be a good one. I took in some of the nitrous oxide and held it for a few seconds.  The patterns that I was seeing took on more complexity and began to ungulate and twirl. I was flowing around in a sea of patterned lights that flowed into each other and formed walls and columns.  I saw glimpses of landscapes and vistas.  The weaving patterned light was multiplying in complexity and colors. In the center of the sky was a Mayan looking head that had a stoic look. From the Mayan head ran strands of patterned colored light that swept down to the ground where I was.  I looked upon this sight and marveled at the colors. The DMT started to fade and I fell out of the vision into seeing the dark black background with orange patterns.</p><p>My last attempt:</p><p>I took in 3 or 4 real good hits from the pipe and sat back. The dark background almost immediately exploded into gold and red patterned light of growing complexity.  I knew I had gotten a really good hit so I held back for a few seconds before I took in some of the nitrous oxide.  The nitrous sent the patterned light into wildly streaming panes of patterned light that flowed by, flowed over me, flowed through me. The patterns were changing so fast that I had a hard time keeping up. Thats when I had a visitor. I began to feel that I was be observed by multiple beings off to the side. I had felt this before and dismissed it and tried to follow the show. But then out of the patterned light was an elephant headed creature that seemed to want to know what I was doing there.  Before I could say anything he seemed to realize I was human and quickly lost interest.  Before he left to go after more interesting things, he seemed to scan me with his trunk which appeared as morphing colored light.</p><p>I did not feel that any information was exchanged and he soon left. Right after he left I fell out of the vision and was back to streaming patterned lights, and then back to orange patterns on the black background. </p><p>SunDances report:</p><p>In a flash I was surrounded in a dark red and black geometric squared world that had been stretched in all corners.  In the midst of all the squares were the very familiar eyes of the DMT world.  The sense of the Logos was there but not at the same strength as with mushrooms.   As I flew through this ever changing fluid like existence the world goes black and an oval image of  Aztecs codes arises up.  This oval was dark amber orange in color with images of ancient shaman.  Was this a connection to that past?  As the image slowly faded away I was left with an emotion of emporia that I had again touched base with my true self-origin.  What would tomorrow bring?</p><p>In an attempt to have a memorable visit I took in as much as I could and then even one more toke.  I coughed as I had way too much smoke inside.  I grabbed the nitro balloon as I sipped the first of it I was slammed into the geometric dark red and black existence and then flung into a world of all white and then these large tan and brown segmented worm figures arrived.  They seemed as natives and I was in their space. As their numbers seem to grow quickly and my mental intentions were to move on I was acknowledged and I realized that I was really hallucinating now.  (A funny feeling for one who has through a many trips).  As I returned I wondered just where was it that I had been.  Post flash experience brought me a vision of a large see-thru Ganesh-octopus figure colored in bright red and gold dots rising from the earth and traveling into space.  A magnificent sight and I was enthralled.  I tried to communicate but was met with a feeling that the image was the only communication of this time. I felt protected and hoped to see this figure again.</p><p>I dropped the nitro balloon as I was looking at a series of pictograph type images that felt very Northwest Indian in design. The images kept flipping through like a slow motion type cartoon.  The images were of animals and the feeling was that there energy was somehow part of the energy I was experiencing.  The main focal image was of a salmon.  Over and over the salmon appeared, as it was important to remember and take back.  This visit gave me motivation to start my artwork again.</p><p>The next day:</p><p>The hike to the hidden lake was stopped due to the starting rain.  A view to the west showed even more black clouds coming.  Time to head back to camp.  Sundance Kid pulled some DMT product for us to snort.  I tried just one line in my right side and felt the super burst of pain, running eyes.  My vision (once I could open my eyes) was increased at least by 20%; all the colors of the scene were vibrating and glowing.  My body felt a little flushed but content, I felt happy and glad to be in the mountains.</p><p>Final night, my body was tried from all the hiking during the week.  I tried to take in a large amount.  The flash was quick and very very fluid.  I was traveling through a long swerve dark red and black geometric tunnel slide.  The eyes were watching me.  A very strange roller coaster type feel.  The experience was not as strong (the product or the amount of my intake) but very different.  Overall I again felt energized and ready for the world again.  Tomorrow back to the normal existence, what would I bring back, feeling of excitement and happiness that I had traveled again to places quite uncharted and wondrous and had visited again to the other side.</p><p>Ciscos report:</p><p> So I took the hit off the pipe and was immediately in a chamber of endless patterned walls of mostly yellow light.  The feeling I got from the chamber was that I was at some type of carnival.  The intensity of the colors couldnt have been brighter. I tried to look closely at the yellow patterned light walls and saw depth and morphing as the effects slipped away.</p><p>The second hit I saw the same bright yellow patterns but they were framed by a bamboo triangle that fell away like the pages of a book.  I had the feeling that I was being watched by a group or family waiting for my reaction.</p><p>The third hit was scary.  I took a drag off the pipe and coughed, I was able to take two more hits and then in an instant my soul was ripped from my body and I did not know who I was or where I was.  I was scared, but I remembered to breath and with each breath  the patterned light changed and I was glad to be alive.  I started to look closely at the patterns and saw bright red designs that seemed to be part of a much larger object. The intensity was great, I opened my eyes to reassure myself that I was ok, but after awhile I said to myself to look closer and try to remember what was happening as the colors were fading and the experience floated away.</p>",
 "year": "2002",
 "id": "19216",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-06T08:00:00.000Z",
 "views": "12552",
 "dose": {}
}
