{
 "title": "Seizures On My Bathroom Floor",
 "author": "LuLu",
 "citation": " LuLu. \"Seizures On My Bathroom Floor: experience with Ephedrine, Caffeine (Xenadrine) & Alcohol (ID 19210)\". Erowid.org. Nov 27, 2002. erowid.org/exp/19210",
 "substance": "Ephedrine, Caffeine (Xenadrine) & Alcohol",
 "bodyweight": "135 lb",
 "report": "<p>I had recently started taking the diet pill, Xenadrine, to keep my energy up and make my metabolism faster. I had two pills in the morning, around 5am before going to work.</p><p>Later that night a few of my friends and I went to a club where I consumed 4 drinks in a matter of two hours. I was feeling quite drunk off of those 4 drinks, and I can hold my liquor quite well. As the night wore on I began to feel sick so we all left. As soon as I got in the car and it began moving I felt like I was going to puke and that's where it all started. I began throwing up violently in my friends car and all over them. I had never felt so horrible in my entire life. I threw up the entire way home (50 min) and continued to vomit when I got home. My boyfriend had to carry me inside because I couldn't stand. I eventually fell asleep for about 5 hours and awoke the next morning to more vomiting. I was puking up stomach acid/clear liquid because there was nothing left in my stomach. In the bathroom I blacked out and fell on the ground and started having a seizure. I could feel myself shaking violently, but my vision was completely black. The seizure stopped seconds later and I was scared as hell.</p><p>I went to GNC where I had bought the pills and told the salesguy the situation. 'Oh NO! You should NEVER drink when you take those pills!' Good story. No where on the bottle OR on Xenadrine's website did it say anything about not drinking.</p><p>I attempted to have a shot of vodka in my slurpee (yay!) when I had taken a pill in the morning and ended up in a supermarket bathroom curled up in a ball. I was sweating, blacking out and sick to my stomach. I ended up feeling better in about a half hour but was sketched out. The seizure was the scariest part of all of this for me. So....just be careful if you're on Xenadrine and your planning on drinking.</p>",
 "year": "2002",
 "id": "19210",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-11-27T08:00:00.000Z",
 "views": "32297",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 12:00",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 }
}
