{
 "id": 19234,
 "title": "Controlled Doses",
 "date": {
  "submission": "2012-10-01T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "lacrimae mundi",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Methoxetamine ",
   "form": "(capsule)"
  }
 ],
 "report": [
  "I recently decided to experiment with this drug on the recommendation of a trusted friend and I was not disappointed!  Since this was the first time using it I did not feel comfortable giving it to anyone else.  I set up a safe secure environment along with a solid amount of time.  I told my room mates in case I had a bad reaction and then I was off!  I took it in a powder form that was encapsulated in gel caps by weight.  I took it on an empty stomach, followed by 12 oz. of water.  I set up my room with soft lighting and a variety of music and then I set a clock and a journal to record anything I might find interesting. ",
  "I started out by reading short stories, and after 30 -45 minutes I began noticing something with my eyes.  I put the book down and got into a comfortable position , then closed my eyes.  I was almost instantly disassociated from my body, and it was a warm comfortable sensation.  I noticed that it was easy to return by opening my eyes, my language remained.  After several hours of warm happy disassociation, my friend came over and encouraged me to go outside.  Temperature seemed notable but not uncomfortable, I was mildly euphoric and felt a need to describe everything to him. ",
  "When I opened my eyes I was in the room with him and when I closed them I could fly away within seconds.  I began to come down after 4.5 hours and the next day I felt great with no hangover type side effects.  For the next week I found that I was more sensitive to music which seemed profound during my experience.  I would become very emotional depending on the intent of the song.  I will do this again and recommend it to my community."
 ],
 "erowid": {
  "id": "97550",
  "citation": " lacrimae mundi. \"Controlled Doses: experience with Methoxetamine (ID 97550)\". Erowid.org. Oct 1, 2012. erowid.org/exp/97550",
  "substance": "Methoxetamine",
  "views": "2462"
 }
}
