{
 "id": 19250,
 "title": "Dream  of  Liberation",
 "date": {
  "submission": "2003-11-05T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "SpiritOfTheStone",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Melatonin"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "1 tablet",
   "substance": "oral"
  },
  {
   "time": "Vitamins / Supplements",
   "amount": "(pill / tablet)",
   "administration": "",
   "substance": "500 mg"
  }
 ],
 "report": [
  "Two days ago, I took six pills of melatonin, one hour before going to sleep. I had a lot of vivid dreams. The morning after I had a slight headache and pain in my joints - perhaps because my sleep was very deep, and I slept almost all night in the same position.",
  "Yesterday, also approximately one hour before going to bed, I took two pills of melatonin, one pill of vitamin E + selenium, and 500mg of vitamin C. I had a lot of very vivid and amazing dreams.",
  "I dreamt that I was going to visit a psychiatrist in a hospital, many times over a longer period of days. I can't remember why I started visiting the doctor in the first place, but I have a feeling that it was by advice of my parents.",
  "After a couple of sessions with the psychiatrist, he started being more and more serious and concerned about my mental health - and in my eyes, he was becoming more and more frightening, evil, and noxious. He was administering drugs to me, sedating and washing my brains. I was helpless, lying in a bed in his lab with some three to five - one of them was my brother - other patients.",
  "I was trying to escape from the mad scientist, but without success. Once I succeeded to get away somehow - it was a long and exhausting runaway. I was walking on wet streets, with torn clothes and shoes. But 'they' somehow caught me back to the madman. I was lying again in a bed that was rotating on some weird device, sedated by drugs and closely inspected by the ugly psycho.",
  "But then, I somehow got enough will and energy. I got up and seize him by his throat. It was like the final liberation, like 'I will take my freedom and kill you'. A strange energy filled my soul, I was capable of doing and taking what belonged to me - my freedom, my sanity, my soul. I jammed hard his neck down and torn him, broke him - killed him.",
  "Finally I found the freedom of my psyche - a clear sky - and now my soul can fly, free from any constraints.",
  "When I woke up, I cried. Many times.",
  "Because life is wonderful, mysterious.",
  "We can really fly. The spirit is our sky and our eye.",
  "You Are Freedom. Fly! You Are Freedom. Fly!"
 ],
 "erowid": {
  "id": "9765",
  "citation": " SpiritOfTheStone. \"Dream  of  Liberation: experience with Melatonin (ID 9765)\". Erowid.org. Nov 5, 2003. erowid.org/exp/9765",
  "substance": "Melatonin",
  "views": "16724"
 }
}
