{
 "id": 19261,
 "title": "Terrible Side-effects",
 "date": {
  "submission": "2012-09-26T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Buzz-killington",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "On vacation in Florida things weren't as vacation-like as I'd hoped. My girl of a year had just left me and unloaded a ton of upsetting information. I.e. She cheated with my best friend of 12 years.",
  "A little upset I decided to down 250 mgs of tramadol. And the following two days 200 mgs were taken each day. On all three occasions the same effects were noted.",
  "Experience with drugs within same class (opiates): I have previously kicked a heroin addiction. Have used vicodin percs and dalaudid.",
  "Setting: (same all three days) very depressed and angered. Day time indoors laying in bed watching tv.",
  "All three days the pills were swallowed in original form. First day 250 mg. Second and third day 200 mgs",
  "Effects ( same all three days) Each day I noted incredible itching especially In my nose. I was relieved of my depression due to what was perviously explained. Without the tramadol there would have been sever depression. I felt mentally stimulated with many racing thoughts. Contrary to my mental simulation my body was quite relaxed and border line lethargic. Sleep even failed to escape me as I am an insomniac. I had great sleep each night. These were the effects I found enjoyable. Total effects lasted about 15-16 hours from first alerts to last noted effects.",
  "Negative effects ( same all three days) I had lost all ability to eat entirely. Around the Half hour mark after the pills were ingested my stomach was extremely discomforted. Urination was nearly impossible. And when achieved was nothing more than a slight trickle. With each bite of food I took my discomfort increased tremendously.",
  "Althought there were slightly pleasant effects, the negative effects well surpassed the negative. That was when my mind was made up to never ingest tramadol again.",
  "Although I was able to handle opiates of a much stronger level this very weak opiate was much too uncomfortable on my stomach.",
  "I hope nobody has to endure the same pain I did within my stomach. Three days of not eating was hell. Appetite regained next day."
 ],
 "erowid": {
  "id": "97720",
  "citation": " Buzz-killington. \"Terrible Side-effects: experience with Tramadol (ID 97720)\". Erowid.org. Sep 26, 2012. erowid.org/exp/97720",
  "substance": "Tramadol",
  "views": "5160"
 }
}
