{
 "id": 19266,
 "title": "Mission Control Kitchen",
 "date": {
  "submission": "2001-10-03T07:00:00.000Z",
  "experience": "1996-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Samanthe",
  "gender": "Female",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Dose: Someone had given me 50mg or so of 2C-B, and I was trying to dispense it to my boyfriend and myself, so that we could explore 2C-B. But since I didn't have scales, this was a chore. I imagine we each took about 8mg.",
  "Setting: My apartment, empty stomach, no explicit intention.",
  "Because the dose was so low, and we were unfamiliar with the material, we were trying to figure out if we were high or not for about 2 hours. I got the idea in my head that I wanted to cook. I began assembling things in the kitchen. I felt enormously fulfilled and competent, things I didn't normally associate with cooking. I felt like a well-oiled cooking machine, handling multiple pots and pans at once, perfectly timed in the execution of cooking motions. I was focused and in the Zone, and it felt really good.",
  "Once the meal was prepared, I fed it to Gaichi, who was hungry (I had no appetite). It felt highly pleasurable to be administering food to him. We both tripped out on the pattern of the food juice mixing with oil in his plate -- not in an LSD-like way, the 2C-B has a crispness to the visual effects that I like better than LSD. We spent some more time astonished at how amazing my favorite painting on the wall looked. Then we went to bed and fooled around, as I was eager to explore the reported sensual qualities of 2C-B. I wasn't disappointed. But I was far more pleased several weeks later when we tried a little bit more, which was much more erotic.",
  "So this first 2C-B experience was not especially memorable among first experiences, but the intense physical pleasure I took in *cooking* really had an impact on me, because it caused me to connect deeply with my self-nurturing instinct that I was ignoring so much at that time in my life."
 ],
 "erowid": {
  "id": "9776",
  "citation": " Samanthe. \"Mission Control Kitchen: experience with 2C-B (ID 9776)\". Erowid.org. Oct 3, 2001. erowid.org/exp/9776",
  "substance": "2C-B",
  "views": "17441"
 }
}
