{
 "id": 19263,
 "title": "Meh!",
 "date": {
  "submission": "2012-10-03T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "DreamManTom",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "90 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>Over the past month I have experimented with MXE multiple times with oral doses ranging from 10mg to 20mg, sublingual doses from 20mg to 40mg and intranasally from 20mg to 90mg.",
  "First off the oral bioavailability was significantly higher than intranasally. A 20mg oral dose was similar to a 55mg intranasal dose in my experience.  Sublingual doses were slightly less potent than oral, but not to a huge degree. 25mg sublingual was similar to 20mg oral. I have not tried any other routes of administration.",
  "Three states can describe my low/common experience(+ or ++).",
  "The come up is first characterized by a slight pressure on the eyes.  Depending on the amount taken this pressure will either increase rapidly as I feel more removed from the environment, or it will gradually increase and slight perceptual changes will be noticed for the next hour.  The sound dome effect is noticeable at this stage, where music and sounds seem to come from everywhere, and are not acute or distinct to a specific location.  The skin becomes slightly numb, in particular the face.  This state is characteristic of a feeling of less uncomfort and pain, but not necessarily an increase in comfort.",
  "In the peak it is difficult to physically focus on objects.  I do not experience any visuals, but everything appears sharper when I concentrate and focus.  Social inhibitions are lowered and there is a slight carefree feeling, which makes socializing and public speaking easy and comfortable.  At this stage the numb skin feeling begins to become more of a buzzing sensation.  It is still numbing and not uncomfortable.  Visually everything seems slightly removed, as if I'm behind a glass window.  I have not experienced many profound thoughts, although I tend to get slightly self critical.  On low doses walking is not difficult, but as doses are increased the feeling of walking goes from gliding to a strange sensation that my body and the world is moving around my head, which is staying in the same location in space.  This in conjunction with the numb sensation makes it very strange to move from room to room because it is as if moving just happens without effort or momentum.",
  "The third stage is the come down, in which these effects slowly dissolve over the next few hours (longer if oral dose).  In this state I'm used to the change in perception and the numb or buzzing body high, as well as walking, so it is not difficult to interact or perform activities as if sober.  The come down is very gradual with little to no lingering effects.",
  "I have one experience with a higher dose (90mg intranasal):",
  "This experience started out similar to the low/common dose experiences.  Pressure on my eyes, feeling as if I am becoming more and more removed from my environment.  But within the next 30 minutes I was at a +++.  I had no open eye halucinations, however everything looked strange as if it was a movie.  With my eyes closed I got the sensation that my body was moving and spinning while I was lying still. The buzzing sensation increased dramatically, as well as the loss of focus.  I could not focus on a particular object, instead my eyes moved from place to place and could not fix on a location.  At this point chronology becomes difficult to remember, and events that occurred earlier that day felt as if they had occurred weeks ago.  Laying down felt as if I was floating, and I was not confident of my ability to walk until I came down.  When I had my eyes closed there were dream like experiences, and I had full dreamlike hallucinations.  There was also a strange head space full of strange thoughts that I cannot remember now, but I wrote down that I was thinking about strange things.",
  "Overall I do not enjoy Methoxetamine very much because there is less profound thoughts than psychedelics, and no body high like opiates or THC.",
  "The only way to describe my MXE trips is 'weird'.</p>"
 ],
 "erowid": {
  "id": "97746",
  "citation": " DreamManTom. \"Meh!: experience with Methoxetamine (ID 97746)\". Erowid.org. Oct 3, 2012. erowid.org/exp/97746",
  "substance": "Methoxetamine",
  "views": "2819"
 }
}
