{
 "id": 19288,
 "title": "Herbs for Relaxation and Sleep",
 "date": {
  "submission": "2013-01-30T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Eye",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Chamomile",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Passion Flower",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Lemon Balm",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Licorice Root",
   "form": "plant material"
  }
 ],
 "report": [
  "I recently began smoking and drinking a tea product known as Gaia Sleep & Relax. It contains Chamomile, Passionflower, Lemon Balm, and Licorice Root.",
  "I first made teas from the product. One bag per cup, in regular-sized coffee mugs. I brewed the tea as the instructions told me (pour boiling water over bag, steep covered for 10 minutes).",
  "One cup seems to relax me as I sip it and prepare my body for bedtime. Its effects seem to be not very pronounced, although I have never taken it during the day (exclusively) and remained awake to feel its effects.",
  "I recently began smoking the mixture as I was curious to its effects. I assumed that smoking it would prolong the bags.",
  "Effects of smoking the herbs are similar, but more pronounced and last a shorter amount of time.",
  "After hitting the pipe, I feel immediately more relaxed. It's a definite non-placebo effect. More smoke equals more relaxation. However, the primary effects seem to go away very quickly (a few minutes). An afterglow of relaxation may exist, or it may be placebo.",
  "I once smoked the herbs (two bowls) and didn't drink the tea and then lied down for sleep to find out if it would help me sleep if I only smoked the stuff. It didn't help me sleep at that dose.",
  "I find that drinking a tea and then smoking a bowl before bedtime helps my mild insomnia. The bowl is not necessary for the sleepy effects but I like smoking the stuff for some reason.",
  "It may be because it gives me the mildest buzz. I feel good after smoking this mixture. That effect is also very short-lived (hard to say how long, a few seconds to a few minutes).",
  "Once I smoked a few bowls at once and then lied down for bed (also after consuming the tea). I felt an effect that I feel sometimes during meditation, and that I feel often while high on cannabis. It's a feeling that I'm spinning, with my head being pulled so that I'm spinning into my bed. It's subtle and short-lasting but enjoyable.",
  "After I began using this herbal mixture, I noticed a mood lift at certain points throughout my day. I read that two of the herbs contain MAOIs. That may be the reason for the mood lift, however I also read that the quantity of the MAOIs is negligible at best.",
  "I like this mixture and it has me thinking and researching other herbs I could smoke or make into a tea."
 ],
 "erowid": {
  "id": "97907",
  "citation": " Eye. \"Herbs for Relaxation and Sleep: experience with Chamomile, Passionflower, Lemon Balm, Licorice Root (ID 97907)\". Erowid.org. Jan 30, 2013. erowid.org/exp/97907",
  "substance": "Chamomile, Passionflower, Lemon Balm, Licorice Root",
  "views": "6697"
 }
}
