{
 "id": 19291,
 "title": "Each Time A Different Experience",
 "date": {
  "submission": "2012-12-16T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chemical Tony",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "12",
    "grams": 0.012
   },
   "administration": "oral",
   "substance": "2C-E"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "4",
    "grams": 0.004
   },
   "administration": "oral",
   "substance": "2C-E"
  }
 ],
 "report": [
  "Some background, Im an experienced psychedelic drug user. I have had full-on experiences with mushrooms, LSD and a wide array of research chemicals. I was privileged to have access to high quality (e.g. commercially synthesized 99% pure) AMT before they banned that substance.",
  "Of all these drugs 2C-E has always struck me as one of the most intense and unpredictable psychoactive substances around. My first experience I took the day off work when the chemical arrived. I had done extensive research and decided to start with a 12 mg dose. With more experience I have found the onset to be at least 1.5 to 3 hours before approaching peek (pretty long). Being unfamiliar with this substance, I made the mistake of dosing another 4 mg at about the T+1 hour mark.",
  "Shortly after this I went out for a walk around the local college campus. While approaching the campus began to notice geometric patterns forming in the cumulus cloud field present. Going down the sidewalk I started seeing pink triangles spinning in the clouds. This struck me as pretty cool, its starting to kick in! A couple minutes later I found myself staring intensity at a tar spot on the sidewalk. It suddenly began to divide into hundreds then thousands of copies flowing out in a fractal pattern, occupying my entire view. Truly mesmerizing.",
  "As the profoundness of this visual started setting in I was struck with fear. Here I was standing on the sidewalk at a major college campus in the middle of the day starring at the ground like some type of guy obviously tripping on drugs. Normal people were all around me going about their daily business. I quickly forced myself to move on with the idea of moving to a more secluded setting. I was also concerned because I had re-dosed only a few minutes ago.",
  "While trying to navigate back to my apartment through the campus the visuals started to become overwhelming. I remember the trailers from the trees and building as I looked around being so intense it was difficult to see where I was (though I was familiar with the area). Crossing the main street back to my place was difficult. It was hard to tell how close and far cars were from me and what speed they were traveling at.",
  "After getting back I started to experience sensory overload in my place with nothing going on. I tried to watch some tv but I was getting these crazy egocentric hallucinations were all the dialog was somehow tied to my thoughts and what was happing. I just tried lying down for a little bit, but even my fan was creating a repetitive noise that was turning into and combining with massive hallucinations. I remember looking up at the stucco ceiling and seeing these magnificent patterns forming on a dome like structure flowing all over the place. Time had pretty much stopped. I would look to my digital clock to see how long I had been tripping for but the LEDs were dancing around so much I could not make out the time.",
  "This is where I think experience with psychedelics comes in handy. I could see newbie totally freaking out. I pretty much was but just tried to stayed calm and ride it out. It was definitely a worthwhile experience but difficult at the same time.",
  "A few hours later I started coming down some and was able to relax more and enjoy the mind space. I have taken 2C-E on several other subsequent occasions (10-14 mg any more is too much for me). Each time I have a different experience and always enjoy it. I feel this substance is not much of a recreational compound (e.g. go to a party with lots of people) and more of a deep introspective tool, though this is really just a subjective opinion. In any case I do feel like it has a lot to offer the user when you dont overdo it.",
  "Just noticed 2C-E has been banned with the 2012 Food and Drug Administration Safety and Innovation Act, a true shame for those who wont be able to experience this chemical now."
 ],
 "erowid": {
  "id": "97917",
  "citation": " Chemical Tony. \"Each Time A Different Experience: experience with 2C-E (ID 97917)\". Erowid.org. Dec 16, 2012. erowid.org/exp/97917",
  "substance": "2C-E",
  "views": "728"
 }
}
