{
 "id": 19296,
 "title": "Rough Start Bangin Trip",
 "date": {
  "submission": "2012-12-13T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Platypus",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 mg",
   "administration": "insufflated",
   "substance": "2C-I-NBOMe",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Here is how the story goes. I received a text from one of my good friends saying that he had some 25i-nbome that he could sell me. I have dabbled in a few research chemicals before (2c-i, jwh-018, am-2201, ur-144) along with other psychedelics (LSD, LSA, DMT, and psilocybin).",
  "I ended up meeting my friend at a rave two days later where he exchanged a pill capsule filled with 1.5mg of 25I-NBOMe. He told me to insufflate the powdered substance so I did. He told me that I might vomit and experience nausea in the first hour or so.",
  "T:+0:00",
  "25I-NBOMe insufflated.",
  "T:+0:15",
  "Started to feel the come-up. I felt nausea, and a small detachment from the world.",
  "T:+0:35",
  "I threw up once in the smoking alleyway behind the theater that the rave was being held at, and instantly felt better after that. (I usually get nauseous from psychedelics, but vomiting isn't common. I believe a cigarette that I smoked caused the vomiting as it instantly made my stomach much more upset than it originally was.)",
  "T:+1:00",
  "Tracers started to become very noticeable. Colors were more enhanced, and the wall that was in front of where I was sitting started to morph and swirl.",
  "T:+1:15",
  "Visuals are very obvious. A lot of color was bursting throughout my world. Shadows became three-dimensional and everything that moved left rainbow tracers. I felt heavy in my body, though my mind was clear. I did find that I had trouble speaking. For the next 30 minutes after this, I spent time thinking about deep subjects, such as the meaning of my life in specific and what I was meant to do with it. I was mostly drawn into my mind, as it took my friend about two or three minutes to grab my attention.",
  "T:+1:45",
  "By this time, my nausea had completely gone away, yet the visuals and mind fuck were stronger than ever. It felt like I had a lot of pent up energy in my body so I decided to go inside and dance. The high quality sound system blew me away right as I walked inside. The bass shook my insides and it almost felt as if I was having a constant orgasm. Strange body sensations were being felt, though they were all enjoyable.",
  "T:+3:30",
  "I had been inside that whole time and was getting exhausted so I went outside to chat with some of my friends. I was still having visuals, but they weren't as noticeable as before. I stayed outside for a little longer before heading home.",
  "T:+4:00",
  "The car ride home (I was not driving, a sober friend of mine was) was very enjoyable for me. Chill, relaxing music was played and since it was night out with barely any cars, it felt and looked as if I was in a spaceship flying down a space road if that makes any sense.",
  "T:+4:30",
  "Most of the visuals had completely faded by the time I got home, yet I still felt like I had a lot of pent up energy. I finished up my night with a nice hot shower and some vitamins.",
  "T:+6:30",
  "Around this time was when I was finally able to fall asleep, after having some tea and reflection time over my trip and what I experienced.",
  "In my conclusion, I will definitely try 25I-NBOMe again, though I'd prefer to go to a park with a friend and trip. The two reasons why I put this as my favorite psychedelic so far, other than DMT and psilocybin, is because the colors were some of the most vibrant colors I have ever experienced during a trip and for the fact that liquids and foods tasted normal and they did not contain a metallic taste to them.",
  "The only reason why I took mine, was because it was from somebody who had a scale and he told me he had scaled it out, as I had done some research on my own before hand about 25I-NBOMe since I don't like taking drugs without knowing information about them."
 ],
 "erowid": {
  "id": "97976",
  "citation": " Platypus. \"Rough Start Bangin Trip: experience with 25I-NBOMe (ID 97976)\". Erowid.org. Dec 13, 2012. erowid.org/exp/97976",
  "substance": "25I-NBOMe",
  "views": "2500"
 }
}
