{
 "id": 19290,
 "title": "Soooo Much Fun",
 "date": {
  "submission": "2012-10-23T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "diredocjr",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "sublingual",
   "substance": "2C-C-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I chose to try this chemical out only having smoked cannabis and taking the occasional opiate. The most messed up I've ever been before this experience had to be a toss-up between the first time I got REALLY messed up with a blunt by myself or when I smoked Fentanyl....both pretty cool experiences. But NOTHING could compare to what 25CINBOMe did to me. I had the house all to myself for the day (besides the dog), and it was a beautiful sunny and windy fall morning.",
  "8:00am - woke up and had a light breakfast of Golden Crisp cereal.",
  "9:30am - open up my postal package containing the mentioned substance and marveled at the design of the blotter paper, quite fascinating",
  "10:00am - I get a nice glass of hawaiian punch to wash away the nasty chemical taste later. I went into the living room, sat down in my favorite recliner and proceded to put some under my tongue. I held it there for approximately one half hour without swallowing. The taste was getting very bad.",
  "10:35am - Kept the blotter paper under my tongue while swallowing all my saliva and then rinsed it down with a big gulp of hawaiian punch.(paper still kept under tongue)",
  "10:40am - Not feeling anything yet, except maybe getting a little light-headed and my stomach kind of upset, but that passed in a few minutes. I went to retrieve some DVD's to watch for my upcoming journey. I chose Pink Floyd: Pulse; Silent Hill, and Gothic.",
  "10:55am - Put in Pink Floyd DVD and started it up. I'm starting to see the walls and floors begin to breathe so I just sat back in my chair and closed my eyes for a few minutes. Starting to get some cool CEV's.",
  "11:05am - Open my eyes and this is where it gets REALLY good.....all the plants and flowers in my living room are starting to grow outward and up into the ceiling. And to top it off, the Pink Floyd DVD is now 3D....without glasses! I look out my window and all the trees with sunlight gleaming down on them look absolutely BEAUTIFUL!",
  "12:00pm - Attempt to fumble with the remote; all the writing on it looks like gibrish, so I just walk to the dvd player and take out the pink floyd dvd.",
  "12:05pm - Put on Silent Hill from the Roku and manage to get to the Johnny Cash song part and I'm just too freaked out. Didn't want a bad trip so I stopped it.",
  "12:10pm - Switch to the movie Gothic. Now I'm starting to trip balls for sure. I can understand the dialogue, but all the imagery in the movie looks so alien and foreign. All the music is captivating, so I just close my eyes and enjoy.",
  "1:10 - Go to the bathroom to look into the mirror; WOW, my face just keeps morphing into something silly!",
  "1:30pm - Turn off the TV and take the dog outside to potty. My legs seem like they're MILES long and the grass looks REALLY WEIRD! The cars passing by my street start to freak me out, so I went back inside.",
  "2:30pm - Start to come down and then the phone rings. My mom says that they'll be home around 4. After I hung up the phone, my vision was almost back to normal, except for a few remaining trails on my computer and when looking into the mirror.",
  "In conclusion, if done in the right setting, I can see great potential for this substance. It was the first time in a while that I felt true joy."
 ],
 "erowid": {
  "id": "97910",
  "citation": " diredocjr. \"Soooo Much Fun: experience with 25C-NBOMe  (ID 97910)\". Erowid.org. Oct 23, 2012. erowid.org/exp/97910",
  "substance": "25C-NBOMe ",
  "views": "3163"
 }
}
