{
 "id": 19305,
 "title": "Not What I Was Expecting.",
 "date": {
  "submission": "2012-10-27T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lekaytee",
  "gender": "Female",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "25",
    "unit": "seeds"
   },
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "seeds"
  }
 ],
 "report": [
  "I've been reading alot about Brugmansia. I was DYING to try it. I had been looking everywhere, but I couldn't find any growing in my town. So, I went online and ordered 25 White angel trumpet(Brugmansia) seeds.",
  "The day I got the seeds:",
  "6:00 pm",
  "Got 15 seeds out of the bag of seeds. Chewed up seeds and ate them.",
  "7:10 pm",
  "I started getting really dizzy, and had slight confusion. I was pretty shaky, and felt really numb.",
  "8:00pm",
  "Not much has happened. Feeling like this isn't going to work.",
  "A few minutes later, I got the WORST cotton mouth I have ever had.I already had some bottles of water in my room, and downed 3 of them in just a couple of minutes.",
  "8:30 pm",
  "I'm starting to see flashes of light. I saw tons of sparkles in my vision. Not having any real hallucinations.",
  "11:00 pm",
  "So, it's been 5 hours and I haven't hallucinated at all. Going to bed.",
  "12:30 am",
  "Woke up feeling really dizzy, and I couldn't feel my hands.",
  "Went and got the last 10 seeds, and ate them.",
  "2:00 am",
  "Can't focus on anything. Spacing out pretty bad. Everything's kind of turning to what looks like jello? The colors of everything fascinated me. Anything I touched, the feel of it seemed so new to me.",
  "3:00 am",
  "I've been seeing this giant spider run around in circles in my livingroom. Everytime I get near it, it hisses at me. It's started to freak me out.",
  "4:00 am",
  "Decided to go to bed, since in other reports that I have read say that it can last for days.",
  "8:00 am",
  "Woke up, hands are still pretty numb. Not feeling anything weird, though. Nothing abnormal with my vision. Walking was the easiest thing in the world. It was clear that it didn't last as long as I thought.",
  "I'm pretty sure next time, i'm either going to buy a larger amount of seeds, or keep searching for them around my town.",
  "But this trip was really not what I was expecting. I was looking forward to something amazing.... not just boring bullshit."
 ],
 "erowid": {
  "id": "98073",
  "citation": " Lekaytee. \"Not What I Was Expecting.: experience with Brugmansia (ID 98073)\". Erowid.org. Oct 27, 2012. erowid.org/exp/98073",
  "substance": "Brugmansia",
  "views": "1877"
 }
}
