{
 "id": 19314,
 "title": "Felt So Good That I Cried",
 "date": {
  "submission": "2002-02-25T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Kodez",
  "gender": "Male",
  "weight": "75 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "sublingual",
   "substance": "Salvia splendens",
   "form": "(plant material)"
  },
  {
   "time": "0:30",
   "amount": "0.3 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0:30",
   "administration": "smoked",
   "substance": "Salvia splendens",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I recently found out that other salvias than the famous divinorum are psychoactive too. Salvia splendens seems to have extremely pleasant mental effects when ingested sublingually or by smoking.",
  "I tried S. splendens my first time at 1 grams dose. The leaves were dried and crunched when I put them under my tongue.",
  "The first effects appeared about 15 minutes after that. First came the feeling 'there's something strange in the reality, but I'm not quite sure what it is'. If you have tried LSD or other hallucinogens, you might know what I mean. Next came the slowing of thinking. It was quite hard to think 'aloud' and rationally. I felt also very safe and firm all the time. No dizziness or tiredness appeared. I was even more awake than normally. The colours seemed very bright.",
  "Next I got the leaves out from my mouth since they began to taste too bitter to me. (this was after 30 minutes of holding them under my tongue) I dried the remaining pile of green goo in a microwave oven and mixed it with cannabis sativa flowerbuds and dried leaves. I then courageously smoked the mixture through a waterpipe.",
  "The experience seemed to shoot up in the level of intensity. I lay down on a bed and began to visualize things. I sensed two different alien presences around and inside me. I understood that these entities were Salvia splendens and Cannabis sativa. They seemed visually green bushes full of leaves, but still full of movement. They were aware and we 'changed thoughts' rather than talked. At the time of the experience I had a bad flu since the autumn is coming and the weather is quite cold. I asked for their help in fighting the illness and they began to fight with me against the flu. I must remind that this all was quite real to me and I saw myself with the plants as clearly as in a normal daily life.",
  "The mental hallucinations appeared only when I closed my eyes. When I had my eyes open everything seemed just right. The salvia splendens doesn't seem to have any LSD25-like visual effects. The most pleasurable thing in my experience was the following: when I concentrated on myself, I began to feel _extremely_ good. I could then concentrate on the well-being and the feeling amplified itself! Finally I felt so good that I cried for a moment. There's absolutely some abuse potential for this plant.",
  "After about two hours I began to come down from the hights of the experience. The trip lasted 4-5 hours. The total experience was quite mild but extremely pleasurable. I plan to increase the dosage when my S. splendens plants grow bushier.",
  "Remember: Little is known of the effects of this plant, so be careful when experimenting further! In my opinion, one should start with small dosages and not mix this plant with other hallucinogens, alcohol and/or pharmaceuticals. The combined effects of different chemicals are completely unknown. (It seems that the good old cannabis was not harmful to me when I mixed it with this plant, so you can give it a try! :)"
 ],
 "erowid": {
  "id": "9820",
  "citation": " Kodez. \"Felt So Good That I Cried: experience with Salvia splendens & Cannabis (ID 9820)\". Erowid.org. Feb 25, 2002. erowid.org/exp/9820",
  "substance": "Salvia splendens & Cannabis",
  "views": "18764"
 }
}
