{
 "title": "Pleasant & Physically, Stimulating",
 "author": "Zam",
 "citation": " Zam. \"Pleasant & Physically, Stimulating: experience with 4-Methylaminorex & Alcohol (ID 19315)\". Erowid.org. Dec 1, 2002. erowid.org/exp/19315",
 "substance": "4-Methylaminorex & Alcohol",
 "bodyweight": "",
 "report": "<p>Zam: 15-16mg 4-methylaminorex</p><p>Zara: 8-10mg 4-methylaminorex</p><p>Material: very nice, 1-4mm long crystals</p><p>About 2 hours before the 4-methylaminorex, zara takes 8mg diazepam.</p><p>T+30: Zara somewhat uncomfortable, wasn't sure she wanted to take the stimulant and experiences some discomfort on the way up. Zam notices coming up effects.</p><p>T+1:35: Zam : Physical stimulation very noticeable, but not unpleasant.  Lips and extremities slightly buzzy.  Zara feeling pretty good, earlier discomfort gone.  Zam spends time doing some house wiring he had started before ingesting the stimulant.</p><p>Zara: 'I feel good but have that 'I fell good but also feel like I'm going to come down and not feel as good in an hour' feeling.'</p><p>T+1-4 hours: Zam + Zara share a bottle of a riesling (sweetish white wine).</p><p>T+2 hours: Zam has very noticeable jaw tension which continues to worsen for the duration of the evening.  Snacking reduced.  Have a cracker and some anti-oxidants.</p><p>Watched a movie, did some work, worked with photos and photo-printing to good effect.  Able to spend a couple of hours working on a project without the normal sense of doldrums and short-attention span that characterizes much of waking consciousness.</p><p>T+4 hours: Zam 151/81 76pulse, very high for Zam.  Zara slightly raised at 94/66 72pulse.  Zam has much more noticeable increase in cardio stress than Zara.</p><p>T+5-7 hours:  Better-than-average erotic push, seemed to weaken the effects of the alcohol. </p><p>T+8 hours: Both Zam and Zara fall asleep fairly quickly. </p><p>Next morning, about 5 hours after going to sleep, wake up and don't feel like sleeping anymore.  The next day Zam has residual jaw tension.  Next day, snacking inclination noticeably reduced, an abnormal feeling in the head, but not tired all day.  Stay up til past normal bedtime night after.</p><p>Generally felt really good all the next day and no noticeable hangover or </p><p>negative after-effects.</p><p>Overall, for a third trial of this material, very impressed.  Too bad its so uncommon.  The main thing that impresses me is how the next day feels so good and there seems to be the lack of crash.  Very smooth, slow down ride and able to sleep easily for me at T+8 hours.  At the 15mg dose range for me, this material is a light mood lift and increased ability to do some types of work.  Haven't tried doing much programming on it, it could be too euphoric for the logical concentration necessary, but for many other types of work its great.</p><p>I'd say it synergized well with alcohol, if it reduced its effects somewhat.  Hard to say about the diazepam, definitely changed its effects a lot.</p>",
 "year": "2002",
 "id": "19315",
 "gender": "Male",
 "timestamp": "2002-12-01T08:00:00.000Z",
 "views": "20281",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "4-Methylaminorex",
   "form": "(powder / crystals)"
  }
 }
}
