{
 "id": 19315,
 "title": "Vivid Past-Life Regression",
 "date": {
  "submission": "2012-12-10T08:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Rabbit",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 ug",
   "administration": "insufflated",
   "substance": "2C-C-NBOMe",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I snorted the vial of NBOMe not knowing at all what to expect. I began to feel very strange, uncomfortable body sensations 5 minutes after insufflating. Those sensations continued to grow stronger and more uncomfortable until I felt like, and I quote, 'my senses are being raped by a strobe light.' I was hot and cold at the same time, every pixel of my vision was strobing and I couldn't figure out what this drug was for. That was the most frustrating part -- nothing seemed to be better than before.",
  "BUT THEN...",
  "I locked eyes with my trip partner and started seeing him grow old and younger, getting wrinkly and grey and then reverting to his current self. He said he was seeing some strange things happen to my face as well, so we decided to sit closer and stare directly into each others eyes.",
  "Then it got crazy. Everything outside of the pupil, including the room started shifting. We could see another person in VIVID detail for about a minute until they would randomly shift into another individual. Some were human (male & female) and some were alien or otherwise indescribable. The really weird part is that I could sense other information besides what was happening before my eyes, such as if I knew him in that life, or what kind of emotions he was going through. Sometimes I would know what specific event had just occurred in the life.",
  "This weirdness climaxed when I saw one individual who was very distraught, it was obvious that his whole family has just been killed. As I'm seeing this, my friend literally tears up in real life and explains that he doesn't know why he's crying. Then I tell him what I'm seeing and it all makes sense.",
  "So please, please, if you do this drug, try eye-gazing with someone or with yourself in a mirror."
 ],
 "erowid": {
  "id": "98214",
  "citation": " Rabbit. \"Vivid Past-Life Regression: experience with 25C-NBOMe (ID 98214)\". Erowid.org. Dec 10, 2012. erowid.org/exp/98214",
  "substance": "25C-NBOMe",
  "views": "1935"
 }
}
