{
 "id": 19328,
 "title": "A Tale of Immediate Regret",
 "date": {
  "submission": "2013-04-29T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ceived",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.5 mg",
   "administration": "IV",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "We pull into the vast parking lot of the strip mall, pick a parking spot just like any civilian would but were here for higher purpose. We divide the 30mg 2-ci capsule into 2 similar lines, we take the smaller one, and I say to Joe you cant be too careful with this stuff.",
  "We reminisce on our past adventures with it, sniffing it was akin to blowing a cap full of gasoline, sniffing water only made it worse as the trip rapidly advanced on our brains. Rough night. We had no idea this was going to be far worse. We had read trip reports about IV 2-ci several places on the Internet and figured it would be all good, plus we were doing such a low dose.",
  "Mix mix mix cotton in, draw back, repeat. We now have 2 syringes full of 2ci and water; 7.5 mg give or take in each. Now for the fun part, a parking spot opens up next to us. We attempt to find a vain and want to administer at the same time, but its not going well. A car rolls up next to us I turn towards Joe to hide the syringe currently in the crook of my elbow. I ask did she see anything, he says well she turned away like she just saw something horrible. I chuckle, and watch the crimson plume of blood enter Joes syringe.",
  "Its go time we plunge down and unlike Roxys or dope immediately feel a burn going thru our veins, less like hot coffee more like gasoline. Ouch, we both cap our needles and sit back, within seconds our vision is wonked out, both thrust into full blown opiate withdrawals, things getting bigger and smaller. Heart racing a mile per minute. This sucks; I turn to him and say I regret this he adamantly agrees.",
  "I feel Im going to puke, I exit the car needle in hand, orange cap waving around as I franticly try to spare Joe from my puking. I hear his words ' get away from me I dont want to barf' get less and less I make it 3 cars away and puke, then another few steps and again, finally I make it to a swear drain I cast my pin into it.",
  "Feeling like I want to skin myself to alleviate this feeling. We reconvene in the car for a moment then go into the panera bread. Immediately I bug out, a group of younger girls is going to the garbage with their empty trays I think they're following us. We go to the counter, he orders water I order a pb&j we sit down in a booth, moaning, holding ourselves to quell the inner pain we are both feeling. The phrase 'I wish I was dead right now' is used several times.",
  "After about 30 minutes we go to the movies, feeling not as ill but still withdrawing and amped. We see haywire, its an awesome movie btw, smoke a cig afterwards and call it a night. After the first hour of pain the trip was decent, giggly excited full of energy but lacking all visual effects due to the low low dose we administered."
 ],
 "erowid": {
  "id": "98485",
  "citation": " ceived. \"A Tale of Immediate Regret: experience with 2C-I (ID 98485)\". Erowid.org. Apr 29, 2013. erowid.org/exp/98485",
  "substance": "2C-I",
  "views": "1230"
 }
}
