{
 "title": "Interdimensional Plasma Beam",
 "author": "Doktor Morningglory",
 "citation": " Doktor Morningglory. \"Interdimensional Plasma Beam: experience with AMT, 5-MeO-DiPT & 5-MeO-DMT (ID 19325)\". Erowid.org. Aug 25, 2006. erowid.org/exp/19325",
 "substance": "AMT, 5-MeO-DiPT & 5-MeO-DMT",
 "bodyweight": "125 lb",
 "report": "<p>(Notes: I had smoked 25mg of AMT freebase 1 week prior with no results, so I went 'all the way'.  Also, I am prescribed 300mg of Neurontin BID.) </p><p>T+0:00</p><p>I ingested 100mg of AMT with some water.  Decided to play video games to pass the time. </p><p>T+1:10</p><p>I wondered why it was taking so long for the AMT to 'kick in' because the screen on the hand held video game looked quite normal.  I look up.  The room is 'melting' and morphing all around me.  I look back down at the screen, still normal.  I played around with the different perceptions for a while like a little child then realized what I was doing, I started to laugh. </p><p>T+1:30</p><p>I start to feel sick to my stomach and decide to purge.  It came up gently at first then the bitterness of the AMT made my stomach tighten.  A buzzing sound/feeling entered my body and I continued purging for 30 minutes.</p><p>T+2:00</p><p>I lay down for a bit in the dark.  The intensity was overwhelming.  The room seemed to breathe with me and I felt like the house was alive, I started laughing.  I noticed my Gecko was running all around the tank, 'He must be on to me!'  I decided to attempt a conversation with the Gecko, it seems that he was trying to get my attention so I could fill the water dish, 'silly me Mr. Gecko'.  My breathing got more and more difficult over time and I felt 'trapped' I had to leave my basement room.  I went outside, it was 9 PM.  I called my friends for a ride, tonight is 'jam night' with the band.  The sky was morphing all around me, bringing me into the Universe, and the Universe into me.  'I can't believe the arrogance of the human race, like we own this place, well I guess they're scared, I'd be scared too if I never took LSD and discovered the truth....who am I talking to?'</p><p>T+3:10</p><p>My friends arrive, I tell them how much I love them. </p><p>T+3:30</p><p>I arrive at the 'jam space' and start tuning my guitar.  I realize I'm staring at everyone and they ask what's wrong with my jaw.  Trismus.  I suddenly start feeling cold and my muscles tighten up.  My arms and legs are contorted and my jaw is shut tight.  I compose myself and plug the guitar in.  We start jamming in the key of D minor, it feels right.  The band starts off slow but steady.  I immediately start playing on the back beats and provide tension.  My tension playing adds a cynical yet trippy atmosphere.  The bass is going through me, I am the bass, no wait, I'm Doktor Morningglory.  I begin to find my role not as 'guitar player' or 'composer', but as an extension of what is our band, we are all extensions of the band, it is us, and we are it.  I start using non-conventional methods of playing a guitar.  I'm playing it like a piano, is it a piano, no it's a guitar.  We play off this key for an hour, continually intensifying and speeding up in waves.  We end the jam due to the time.  It is now 11:30 PM.</p><p>I am starting to lose the intensity of the 'speedy feeling' and want it back, to soothe this I decide to sniff some 5-MeO-DiPT.  I started with 15mg.  It felt good, my trails intensified, but I felt more relaxed than I did before.  'Oh no, we're being kicked out now!'  What the hell am I gonna do for the next 7 hours?  I am saved, we're gonna chill at my friend Hi-Watts place.  We get there at 12AM.  I freak out his nephew, he is told I escaped from the Institution and was going to hide out here for the night.  He did not even come near me.  We went up into his other Nephew's room and popped in a movie.  I sniff another 10mg of 5meo DiPT.  I'm still experiencing body convulsions.  But they are no longer 'straining'.  We watch 'Anti Trust', a terrible soundtrack, a government conspiracy me thinks.  Wht a bad movie, made me look for camera's throughout the house for a half an hour though.   </p><p>T+6:30</p><p>My friend tells me he's got some smack, I figure it'll help me sleep later on, so I do it up.  I sniff 20mg of it.  I start feeling sick to my stomache, but extra groovey.  I'm slurring my words and there is this weight on my shoulders.  The room looks very 1950's now, I don't know what that means now and I don't think I could put it to words then.</p><p>T+7:00</p><p>I find 10mg of 5meo DMT and contemplate my life and if it's worth trading for the experience.  Definitely.  We show Hi Watts nephew websites and explain 5meo DMT to him.  He thought we were nuts, which I mean, we probably are.  I have my friend light the foil and I suck my way into the next dimension.  I am traveling via plasma and crossing through the known and unknown universe. ' Wha...where am I...who are these little bug people....Hi Watt!'  They can't hear me!  I'm crossing through the void again, the plasma is subsiding.  The room is coming back into focus now.</p><p>T+7:35</p><p>I'm still stupified, my friends are talking but all I can hear is 'blah blah blah', did I really come back...I mean ALL the way back?!!!  I light up a cigarette and tell my friends about the 'bug people', they laugh, I tell them I wont laugh until I find out what they were up to, then they shut up. </p><p>T+8:30</p><p>I'm exhausted, mentally.  My friends are bringing me home, I have to work at 8 AM. </p><p>T+9:00</p><p>I'm feeling snug in my bed, but I keep getting chills and then heat up.  My trisma is almost gone but my legs are still shaking.  I start to read a book.  It feels very real, like I'm in the book or watching a movie. </p><p>T+11:30</p><p>I'm getting sick of reading, I take 600mg of Neurontin (prescribed)in hopes of sleeping a bit before work.  The next thing I remember is waking up at 11AM, 3 hours late.  I feel calm.  I get to work.  I do what I need to do and take a little nap (don't you wish this was your job). </p><p>I wake up at 4 PM, I notice I cannot see out of my left eye, it stays hard to see for an hour, this has never happened before.  My eyesight is 20/20.</p>",
 "year": "2002",
 "id": "19325",
 "gender": "Male",
 "timestamp": "2006-08-25T07:00:00.000Z",
 "views": "4184",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(daily)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 5:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 5:30",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "4": {
   "time": " T+ 5:30",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  },
  "5": {
   "time": " T+ 6:30",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  },
  "6": {
   "time": " T+ 11:30",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  }
 }
}
