{
 "id": 19329,
 "title": "Cranked Nosebleeds",
 "date": {
  "submission": "2004-08-04T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The K-hole Kid",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "250",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Sertraline",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I am a 15 year old male currently living in Arizona. I was put on Zoloft in April 2001 for OCD. One day before school I took about 5 50 mg tablets before leaving my house. By the time I had arrived at school about forty five minutes later I felt a rush of energy go through me. I felt a gain of self confidence enter my mind as I walked to my locker and began talking to some of the kids around. I remember myself feeling like I was doing everything at a million miles per hour and the rest of the world was standing still. Before class even started it felt like the whole day had gone by. Right before classes this energy was replaced by nausea, but it was calmed down by walking around and I felt my heart beating rapidly. I was in a sense of panic and the nausea got worse so I made it to the bathroom and vomited in the toilet. Once I had thrown up, the nausea was relieved, but my heart was still beating rapidly as if I had taken amphetamines.",
  "In the middle of my first class a sense of euphoria came over me and it was like I didnt care anymore. It made me feel like my life was worth something and the gain of self confidence began to get stronger again. I went through just about all of my classes like this and I hardly remember anything about them because I began to think about what was going on in my life and the problems didnt seem important anymore.",
  "After school, I went home on the bus and I noticed that I had a headache so I went home and tried to rest, but I couldnt because I still felt like I was tweaking. The next day when I woke up from what little sleep I had from waking up multiple times in the middle of the night and not being able to fall back asleep for an hour, the headache had gotten worse. At about noon I finally crashed from the speedy feeling I had and rested for about an hour. My heart was still beating quickly however and my headache was almost a migraine and when I woke up my nose began to bleed and I realized that the zoloft increased my blood pressure. This slowly wore down and I was feeling normal by the next day.",
  "I felt that my overall experience on Zoloft was very unique. It almost combined the effects of amphetamines and alcohol. However, I do not recommend that anyone take more than 150 mg. I had a friend who got the same effects as I did without the nausea and high blood pressure at 100 mg and he weighs in at 244 pounds. I do think tolerance has an effect though because before that I had taken 100 mg without any unsual effect before since I was on the medication."
 ],
 "erowid": {
  "id": "9850",
  "citation": " The K-hole Kid. \"Cranked Nosebleeds: experience with Sertraline (ID 9850)\". Erowid.org. Aug 4, 2004. erowid.org/exp/9850",
  "substance": "Sertraline",
  "views": "58891"
 }
}
