{
 "id": 19341,
 "title": "Confusion Meets Crazy",
 "date": {
  "submission": "2013-09-14T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "PinkOfFloyds",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "repeated",
   "substance": ""
  },
  {
   "time": "Alcohol",
   "amount": "",
   "administration": "",
   "substance": "6 drops"
  },
  {
   "time": "oral",
   "amount": "25I-NBOMe",
   "administration": "(liquid)",
   "substance": ""
  },
  {
   "time": "repeated",
   "amount": "oral",
   "administration": "Mushrooms",
   "substance": ""
  }
 ],
 "report": [
  "One nice rainy fucking day I was on my way to a graduation party with every single person I had ever known since forever. I rode with my buds Andrew, Jordan & Kingsley. All I wanted to do was get wigged out and didn't feel like doing any meth or just get drunk; I purchased 2 drops of a vial containing 25i-NBOME. To my surprise he dropped 6-7 drops on my tongue. It went down my throat and almost made me want to cough. It tasted like the drip of Meth to me honestly to my recollection, but stronger and dopey-er.",
  "I didn't complain nor worry about having a bad trip, my state of mind was still very concentrated and stoned. I had been through worse I thought. Going to a graduation party of a high school I never went to...can't be as shitty as that Acid trip down at Fitzgerald's being stuck in a whirlpool of cascading staircases and screaming sadistic gutter punks. So we get to this party and it hasn't even started, they are still setting shit up. Hanging up Christmas lights and shit anywhere I would stand or sit. I wound up sitting under a gazebo with Andrew who would also DJ and hand out 25b to everybody that night I figure. This is were we would stay for the most of the party.",
  "The trip's headspace can be described in one word, Confusing. It was the most Fucked up, retarded, goofy ass fucking substance I've ever put in my mouth. I have no idea how much I had taken but it was purely visual and controllable as far as chilling goes I guess, but my mind would go numb and I would just fall right off the edge of sanity, I know I did. I couldn't speak a normal sentence for too long because I would see something off in the distance and lose all memory of what I was doing before. It wouldn't have been so bad if it wasn't so confusing, seriously the imagery was so beautiful I couldn't concentrate on anything but the visuals and how I felt. This shit took literally 20 minutes to kick in and time was spiraling out of control. I felt I was seeing everything from the perspective I should always be seeing through, I felt like I was going to be the life of the party that night or something and that I was just an amorphous blob sitting in the chair rotting away with no words left to speak, only going on this confusion I rode this out.  The visuals were intensely bright and beautiful to say the least. My vision was so sharp I had to blink as fast as possible to wipe my eyes off.",
  "I looked over and saw Andrew breaking down some Ice, he took his knife and snorted several small lines and asked if I would like to snort ice with him right now. I rejected his offer, first time I had ever said no to Meth since I went could turkey a few months back. By now I haven't realized there is a crazy party going on here, there are now 10,000 people in the orcish fortress I thought we refuged in. I was getting delirious and realized people had been passing me blunts, bottles, and beers.",
  "I was laying in a mud puddle now, I could hear loud rap music blistering my eardrums. I recalled lyrics saying 'its a motherfucking assquake?' All I could see were butts everywhere so I rolled over in my mud puddle writhing in defeat and my own self hatred. I looked up and saw a line of women dancing and they were very sexual. A bandito was at the end of them shooting his double barrel shotgun into the air looking at me. This to me, was him going 'yeah motherfucker I'm fucking your women maaaan'. I was now completely coherent as I thought of butchering this guy, my eyes were rolling all around and I was forcefully making different faces the whole time. My friend Kingsley now interrupted my thought process as all attention came to the DJ booth.",
  "Kingsley jumped up on the table, the music went off, people are laughing at me in my puddle. Kingsley armed with a empty bottle of jack and microphone on hand screaming 'YOU GUYS PRETTY FUCKED UP!' *insert drunk adolescents laughing here* The irony was baffling. Now he says and does, with a strange motion 'ANDREW IF YOU GOT MY PIPE I'M GONNA KICK YOUR ASS' as he pointed at Andrew's face knocking over all the speakers and bottles on the table. Andrew just gave it back to him with no trouble it wasn't worth fucking everything up. By now the party went to shit, Some black kids were starting fights across the backyard, cops were hitting the scene as usual so I walked back to the car with Andrew and Robert.",
  "Jordan came to but he was tripping, he told us he was going to have to run home, break into his own house and steal the other key to his mom's car because he decided to hide his keys somewhere in the backyard aside just conveniently wearing them on a chain or putting it in your fucking pocket just so he can get Andrew's supplies out of the trunk. I now found out Robert had to play babysitter with his dumbass friend Chase who was laying in the back on his truck, He had apparently puked on some young girls boobies and shit himself. This was visually accurate as I could clearly see a drunk teen that was unconscious in the grass of a neighbors yard.",
  "I went and pissed in their yard then smoked a blunt with Robert as I watched him talk to Chase as if he was a pissed off step-mother. He exclaimed 'Chase, Hey Chase? Do you know where you are?'. Chase goes 'Urrrghghrrh'. Now it switches back and forth to Robert. 'DO YOU KNOW WHERE YOU ARE?' I pace back and forth trying to keep the spiders and brown recluses from crawling on Andrew's face as he sleeps on the sidewalk of somebody else's house. Chase eventually says 'We are at your house', I have long sense forgotten what Robert had said to him after.",
  "Overall the night was long and I can't go on much longer, I've been eating mushrooms all night so sorry about the bad literature or whatever term being. But neigh in a nutshell I find 25i to be fun and stimulating at low-high doses and very psychedelic but as far as heroic doses go I was on a ++++++whatever. This stuff was assured to be 25i as well it was purchased just not by me. I had previously tried the same drops a few days prior and I tripped pretty damn hard off 1 & 2 hits. But 6? Was a waste, too much confusion to gain anything from it IMO but the trip wasn't bad. If you're looking for a deeper more LSD-like experience from the NBOME series (if this is all you can gain access too) I suggest 25B, not 25I as it's deeper spiritually and carries more hallucinatory aspects instead of the casual phenethylamine feeling of being wired or goofed up. 25I has also caused death, sorry again about my poor grammar.",
  "Stay cool guys."
 ],
 "erowid": {
  "id": "98941",
  "citation": " PinkOfFloyds. \"Confusion Meets Crazy: experience with 25I-NBOMe, Cannabis & Alcohol (ID 98941)\". Erowid.org. Sep 14, 2013. erowid.org/exp/98941",
  "substance": "25I-NBOMe, Cannabis & Alcohol",
  "views": "463"
 }
}
