{
 "id": 1935,
 "title": "Back Again... After All These Years!",
 "date": {
  "submission": "2001-07-17T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Gusagain",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>I am an artist, currently stocking my gallery with paintings and rock art dealing with shamanism and other forms of esoterica. During the early sixties, I lived in Greenwich Village, NYC, and did a lot of NN DMT...trying to paint or illustrate the experience of cosmic connectedness.",
  "But, 'Life' is what happens while we are making other plans. I wound up married... kids... a family... and turned to commercial art to cover expenses. Now... forty years later, I'm back on the old path!",
  "Three days ago, I received a half ounce of salvia divinorum in the mail. I smoked a 'pot pipe' full of marijuana to prepare a quiet setting and then, a tobacco pipe full of the sage. Whoosh! My living room spun off into a new axis. It changed dramatically! In a way, it was still the same... I could walk around in it and not bang into furniture or the walls... but, in another way, it was very different. Much brighter. Much cleaner looking. Space between objects seemed more distinct. More in 3D.",
  "Then, the walls, the furniture, and even the space between became a network of interlocking geometric patterns and I felt an urgency to lay down in a dark room. When I got up off the couch, I found it difficult to walk properly. Motor control was way off. The overall network of interlocking geometric patterns in colors, mostly, of browns, light pastel greens, mustard yellow and pale blue became very dominant. Powerful and totally in command.",
  "And there was something else. It KNEW me! And I thought, 'Oh, my God! I'm back on the other side!' And, for a moment, it seemed that the danger of getting stuck there was very real. But there was no fear, actually. It was as if either 'place' was equally acceptable. And equally familiar. But, years ago, I usually had the profound feeling that I was in touch with Divinity on DMT trips. I didn't get that this time. Maybe the dose was too light. I plan to try doubling the dosage in the near future... but, not without a qualified sitter.</p>"
 ],
 "erowid": {
  "id": "1636",
  "citation": " Gusagain. \"Back Again... After All These Years!: experience with Salvia divinorum & Cannabis (ID 1636)\". Erowid.org. Jul 17, 2001. erowid.org/exp/1636",
  "substance": "Salvia divinorum & Cannabis",
  "views": "6472"
 }
}
