{
 "id": 1936,
 "title": "Reality in the Vat of Hardening Tar",
 "date": {
  "submission": "2005-10-15T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "JP",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "<p>It was Saturday. I do believe its been 1 week since the experience. I went to my friend Adam's apartment. He told me he had the mj and asked me to bring my 3 grams of 10X salvia along. At around 9:00 PM or so we went over to his friend Luke's house. We sat around and talked for a while then we smoked a few bowls of pot. Afterwards we shot off fireworks and such. We came back in at around 9:30. This is where my time recollection fades. We got inside and his roommates decided that they wanted to try the salvia. I, intending on leaving with none, gladly gave them both a bowl of the 10X extract. The first one took the bowl in about 2 hits. She just stared at us blankly and started laughing. Then her boyfriend took the whole bowl in 1 hit. He looked up and immediately started to babble about something. He stared at his gf and they went into the bedroom. By then this really had me scared of the stuff. Adam, Luke and I were wondering if this guy would really be OK.",
  "After that I decided 'enough, I'm going to try it'. So I loaded up a bowl and lit it. The smoke was the worst tasting, harshest thing I had ever put into my lungs. I might as well just had breathed in a handful of sand or oatmeal. I held the hit for about 20 seconds....I think. Then it's hard to explain or even recall from that point on. I remember sitting there staring at my hands (which were shaking uncontrollably, or so I thought) And I said 'it....it feels...like honey...' Now that I think about it, it can only be described as sitting in a vat full of hardening tar. I had these intense vibrations. Comparable to the vibrations experienced before an out of body experience. I remember Adam saying 'Hey, get me that' or something of the sort. I replied 'Adam, I would if I knew my legs existed'. After this I let my head fall backwards.",
  "I was then staring at the ceiling. When while looking at it my mind decided that the ceiling was the floor. I thought the universe had been turned upside down. The flashing in my vision from the salvia was still going strong. Luke suggested we go into his room to avoid disturbing his room mates. We went in and I noticed Adam was playing with some seeds he had taken out his bag of weed. This for some reason entranced me. From here my memory basically stops. I remember bits and pieces of things, like laying on a bean bag, playing with a psychotic cat and watching fear and loathing in Las Vegas. Although this was a unique experience, I don't care too much for how intense it was.</p>"
 ],
 "erowid": {
  "id": "16363",
  "citation": " JP. \"Reality in the Vat of Hardening Tar: experience with Salvia divinorum (10x extract) & Cannabis (ID 16363)\". Erowid.org. Oct 15, 2005. erowid.org/exp/16363",
  "substance": "Salvia divinorum (10x extract) & Cannabis",
  "views": "3529"
 }
}
