{
 "id": 19375,
 "title": "Oh Synergy Oh Synergy",
 "date": {
  "submission": "2007-05-22T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MikePatton",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "0.3333 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "I've smoked salvia several times before.  I've seen some pretty intense stuff.  I once thought I was a chicken wing.  I once believed that the world did not exist outside of my field of vision.  This experience goes far beyond any of that.",
  "It was the 4th of July.  A friend of mine from high school who I don't see often came to visit.  The evening started off with hamburgers and beer.  By the time the fireworks were over I'd had about 15 beers.  I was fairly intoxicated.  I went to my room with friends and we smoked a hookah for a while.  At some point I smoked a little marijuana.  Then I decided that it would be a good idea to smoke some salvia.",
  "I grabbed the bong that I had made a few days earlier.  I packed a giant bowl with about 1/3 gram of 10x salvia.  I smoked the whole bowl in 2 rather large lungfuls.  According to my friend, at this point I dropped the bong and fell out of my chair onto the floor.  Apparently I also crawled across the room a little bit.",
  "What happened inside my head is something I can barely explain.  I went to some far off distant world.  I had no concept of the reality I've known for most of my life.  All of my senses were overwhelmed with new and different things that I had never experienced before.  My vision zoomed rapidly from one intense sight to another.  Unfortunately I don't think any description can do justice to what I experienced.",
  "Slowly I returned to reality.  It was very difficult.  I had totally forgotten about my previous life.  As it returned to me I had to exert quite a bit of effort to grab a hold of it.  It almost seemed as though the distant world I had been to was reality and everything else in my life had just been a dream. ",
  "Peak effects probably lasted about 10 minutes.  Fairly strong after-effects persisted until I went to bed about an hour later.",
  "I'm pretty sure that the intensity of this experience was related to all of the alcohol I had consumed."
 ],
 "erowid": {
  "id": "25182",
  "citation": " MikePatton. \"Oh Synergy Oh Synergy: experience with Salvia divinorium (10x Extract), Cannabis & Alcohol (ID 25182)\". Erowid.org. May 22, 2007. erowid.org/exp/25182",
  "substance": "Salvia divinorium (10x Extract), Cannabis & Alcohol",
  "views": "2822"
 }
}
