{
 "id": 19371,
 "title": "Thank You USA TODAY",
 "date": {
  "submission": "2003-07-11T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Va ridge runner",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "I just smoked a couple of bowls of salvia 5x  for the first time and WOW!! What an experience.  Thank you usatoday for enlightening me about this substance.  A couple of weeks ago I read an article about Salvia Divinorum in the usatoday newspaper.  I found myself intrigued about this substance so as I usually do when I need information I get on the internet and do my research.  After reading about Salvia from several notable websites I decided I must try this.  I am always looking for a way to connect with who I am and where I fit at in this world.  Anyway I find a web site that looks legit and order 3 grams of Salvia 5x for $20. For the next 9 days I eagerly wait for my stash to arrive and when it does I immediately prepare a spot to try it.  I don't have a sitter (Mental note: should have had one) and I'm a little Leary about doing this in the house due to all of the potential hazards so I go outside and find that the only place I feel comfortable to smoke it is in the walled turn around area of my driveway (only flat spot on my property).  ",
  "I pull my car and blazer across the front of the turn around area to keep me from walking around and possibly over the hill if this stuff works and proceed to pack my bowl with the Salvia. I have a bowl that'll hold about six hits of weed so I pack it about a third of the way full.",
  "As I light and inhale the first hit (geez? 30 seconds is a long time when you're pumped up).  At first nothing seems to happen, but I'm sitting there never doubting that something will, then I get a sensation that the trees I'm looking over at is moving, or rather that the space (air) is rippling.  It starts to flee so I hurriedly pack another bowl only with a little more this time.  What happened next is one of the most pleasurable experiences I've had in a long time.  For some reason or other my eyes are transfixed on the trees a little ways away and the sensation of space ripple ling is strong now. I can actually see ripples in the space from where. It's similar to water when something is dropped into it.  At the same time beads of sweat pop out (almost immediately it seems) on my forehead. Then almost at the same time I feel like I'm being gripped by a force. Similar to the way two magnets feel when trying to place like-polarities together.",
  "Almost at the same time I get the most serene peaceful feeling (words can't do justice to the way I felt) that comes over me and I feel like something or better yet, someone wants me to come into the disrupted space, but I hold back. Then I start laughing. Don't know what I'm laughing at or why, but I just laugh.  I then happen to look down at my arm and it's wiggling.  No kidding.  I sit there and flap my arm up and down and it looks like it's made of rubber, just going up and down, up and down.  This makes me laugh harder, and at the same time I'm thinking the neighbors can surely hear me and must think I'm nuts.",
  "The effects are starting to ebb now so I try to get up, but hell, it's like an invisible force field is holding me down.  I try harder and manage to stand.  Now I'm becoming aware that I have control over my body again and start to head back towards the house (climbing over the SUV was a monumental task).  This wasn't the smartest thing I could have done as I was obviously still under the influence of the Salvia. Getting to the house I have to walk up the steps of my deck and as I was doing this I get this crazy notion that I would have absolutely no control if I decided to leap from the deck.  Fortunately I didn't (I wouldn't advise doing Salvia for the first time without a sitter).  The effects lasted about 15 minutes more and gradually evaporated.  I do experience a feeling of increased awareness and clearheadedness as some have written.",
  "I started to write that all in all this is about what I expected from the Salvia, but I'd be lying.  My first experience with it was nothing like I expected. I can recall the overwhelming comfort I experienced, but not the feeling of it. I will try this again,  but not until I can get a sitter, because I would like to try smoking a little more than I did on this occasion. It's like some of the experiences I've read about being on the verge of breaking through, but not quite making it."
 ],
 "erowid": {
  "id": "25166",
  "citation": " Va ridge runner. \"Thank You USA TODAY: experience with Salvia divinorum (5x extract) (ID 25166)\". Erowid.org. Jul 11, 2003. erowid.org/exp/25166",
  "substance": "Salvia divinorum (5x extract)",
  "views": "37324"
 }
}
