{
 "title": "Ingestion Tips",
 "author": "Anonymous",
 "citation": " Anonymous. \"Ingestion Tips: experience with H.B. Woodrose Seeds (ID 1938)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1938",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "H.B. Woodrose",
  "(seeds)"
 ],
 "report": "<p>I have been following the thread on HBWR and felt it about time to share my own experiences in the area. By no means am I refuting anything already said, I am only offering my own experience for consideration to those willing to listen. I like the seeds. I have had rather nice experiences with them and will continue to use them from time to time. The worst physical side effect I have had from them was stomach cramping and that was without dramamine. The method I have used with the seeds is fairly simple. I grind up the number I am going to ingest and then soak them in water for an hour or two. Then I drain the water so as to seperate the seed matter from it. I toss the seed matter away (I don't remember where, perhaps Jonathon Ott, I'll check, but anyways, I remember reading that the alkaloids responsible for much of the toxic symptoms are not water soluble and therefore will remain in the seed matter). Anyways, the resulting drink I am left with I ingest over 30-45 minutes. This also seems to reduce the bad effects. The only part I find annoying is the lethargy, but that seems to be overcome by setting as I have had many enjoyable walks while under the effects although the first few steps took one hell of a lot of will power. I would suggest though that anyone interested in exploring these start out with a small amount and work their way up. A previous poster mentioned 20-30 seeds. I personally would never take that many seeds, at least not at this point in time. my max currently is about 13 or so. My first time was with 8 or 9. Well, hopefully someone found this to be of some value.</p>",
 "year": "",
 "id": "1938",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-19T07:00:00.000Z",
 "views": "18381",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 }
}
