{
 "id": 19382,
 "title": "Smoking an Eyeball and Falling in a Loop.",
 "date": {
  "submission": "2007-04-11T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mon",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "dried"
  },
  {
   "time": "4:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I am 18 years old and am relatively new to psychedelics. The only hallucinogens Ive done are mushrooms. Other drugs I have experimented with are dxm, coke (once), and I recreationally use pot and alcohol. My last mushroom trip was probably the most intense one I have had because most of it was enjoyable yet very strange but towards the end I experienced a quick bad trip to put me out. I am an avid researcher of Erowid and I'm real cautious when taking drugs, so before any of my trips I always did some extra research and views on trip reports.",
  "Anyways, the plan started when I found out my parents and brothers were going on a vacation to New Hampshire. I was by myself for a week and 2 of my friends and I had saved 3 bags of shrooms for a while and now we were finally ready to do them. They were skimp eighths, when we weighed them out they were around 3 grams a bag which is still a good dose for shrooms, and so far is the largest dose Ive taken. I wouldnt recommend going over that if youre new. The setting was good, we had everything planned out.  We created a great trip CD which had goa/pyschedelic trance songs and Beatles. We also had chairs set up in a patio where we could listen to the music, talk, and smoke a lot of cigarettes.",
  "We were all in fairly good spirits before taking the shrooms so there were no worries or signs of anything bad happening. The trip started fast because the shrooms were very shaky so some of it absorbed through our tongues while we had it in our mouths. We took the shrooms straight because thats just what we always do. It was about a half an hour and the walls began to take that slow moving effect. We then went into the patio and had a great time talking about really bizarre things. Many times we have philosophical conversations that go on and on and just feel so good to talk about. But this time our conversations were eerie and yet entertaining and many times very funny.",
  "From what I remember we got on topics like smoking an eyeball just for the insanity and rawness of it. We then continued this thought by saying we should trip hard on shrooms in a graveyard, dig up a corpse and smoke one of their eye balls in a bowl, just to see how far we can push the limits of our sanity. Of course we would never actually do any of this because right after we stopped and looked at each other and laughed because we just realized what we were saying. Another bizarre thought came and I honestly cant remember it, but I remember my friend D saying afterwards Oh my god, hahaha, we just had an entire plot to murder the neighbors and eat their brains This was so ridiculous that we all started to laugh hysterically for a minute or two. By the way, we are not fucked up people at all which is why all of this was so weird and made us laugh.",
  "Now it had been around 4 hours and we decided to go over to Ds house with his parents home to play some pool. By this time we could control ourselves in front of parents, even though we most likely wouldnt come into contact with them. When we started playing we had the last interesting time of the night before smoking. We played what we dubbed The pool game of life, where we analyzed and related every single shot into a real life situation with possible alternatives and ultimately a result of the path we chose with each shot. It was by far the most interesting game of pool Ive ever played.",
  "After that we returned to my house to finally smoke. We had some good kb which I strongly suggest for shrooms, and we smoked 2 and a half bowls between the 3 of us. Immediately after, visuals started to commence. Vivid swirly patterns and color shapes filled the room. After about 10 min I looked over to my other friend B, too see him staring at his cigarette with a mischievous, almost demonic grin on his face. I looked at D and we both felt we were connected and we shared thoughts. Our conversation at this point was so strange, yet we could understand what we were TRYING to get across. We both believe we had been caught in a loop where we were stuck on one thought and could not move on in the trip. I truly wish we could remember what exactly we were saying because I remember it being so fucked up and strange as we repeated different but similar questions and always came up with the same weird answer that would make us laugh.",
  "I felt like the Mad Hatter. We sounded like we were completely insane but on another plane, one only we could connect on, we made sense. I couldnt see D that well, but I remember his face looking very weird (not scary, just weird). By 30 minutes I started to feel very strange. I hallucinated so much I couldnt believe this was all happening from shrooms.  As I looked at the light everything in the room went dark and all that I saw was that light. My hearing went loud to soft over and over and I couldnt control my motions or my moans as the room was spinning, however I did not feel nauseous.",
  "Visually, it was like being really drunk without the sickness. Then every time I picked up my head I was in a completely different place. The lighting was still dim, which probably helped me hallucinate better seeing how I wasnt wearing contacts and things were not clear to begin with, but everything was completely different than what was actually there.  I then got the will to get up and stumble into my house not saying a word to B or D. As I walked to the couch my body felt disproportionate and heavy. I flopped down and relaxed, lucky for me when you smoke later on in the trip it doesnt last any longer than 2 hours. I got to just lie there with my eyes shut and experience the best closed eye visuals of my life. That is basically the last thing I remember before waking up the next morning.",
  "Now what I experienced, I wouldnt label a bad trip, for the most part it was great, however a little different than my normal trips. But I have to say, I usually handle my shit without freaking out and once my visuals went out of control and I couldnt control my thoughts it was one of the hardest things Ive ever had to struggle with. It was almost an hour of a constant struggle to overcome the unstableness going on in my mind. The other thing I noticed is, the physical setting and mindset was just fine. I have had sketchier settings before and I had a blast tripping on shrooms even while smoking which can make it so great. I believe a mushroom trip can go bad at any time."
 ],
 "erowid": {
  "id": "25211",
  "citation": " Mon. \"Smoking an Eyeball and Falling in a Loop.: experience with Mushrooms - P. cubensis & Cannabis (ID 25211)\". Erowid.org. Apr 11, 2007. erowid.org/exp/25211",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "3554"
 }
}
