{
 "id": 19389,
 "title": "Instant winner!",
 "date": {
  "submission": "2003-07-14T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "psydkik",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25",
    "grams": 0.025
   },
   "administration": "oral",
   "substance": "2C-C",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "After many years of listening to SHAMELESS (Boy Genius) and his many verbal promotions of Shulgin's finest works, I recently got the experience of trying a number of phenethylamines (all wonderful). The trip du jour for today's report is 2,5 dimethoxy,  4-chloro phenethylamine, or 2C-C.",
  "Shameless recommended a trial dose of 25mg based on Shulgin's suggested levels.",
  "And so @ 10:20 pm, down the hatch with the compound. Awful awful taste. Nothing for a short spell, and then around an hour and ten minutes, the first effects are felt. Mostly a mild body buzz at this point but gently builds over the next hour and a half. By 1:00 am, I feel a refreshing chill, very comfortable. The stream of consciousness effect is intense with constant tangents. No digestive problems noted at all. I am impressed by the olfactory (smell) hallucinations. I can think of a smell and there it is! As for visual, with eyes closed there are vague, formless colors (very colorful). With eyes open, there is mild movement seen in objects. TV has a lifelike quality, a realism. I feel involved with character activities and can lose myself in the event. Details of all kinds highly apparent. Extremely relaxed.",
  "Around 1:35, reading becomes difficult. I have a mild shiver, but not cold. relaxed and comfy. Waves. Pulsate. Irradiate! Peak maybe? I cannot stress how relaxing this is. I could go to sleep if I wanted to.",
  "I continuted to enjoy the unique effects of the material until around 4:15 am, at which time the effects quickly and smoothly dropped right off. There then came easy sleep lasting a couple of hours longer than usual, yet I woke very refreshed with no hangover or residues.",
  "This is certainly a unique compound. A trip that goes down and not up. This could be very useful in psychotherapeutic applications, due to the comfort, relaxation, open mind, relative ease of functioning, and fairly brief duration. A truly remarkable compound. I'm looking forward to tomorrow's 35mg experiment!"
 ],
 "erowid": {
  "id": "25244",
  "citation": " psydkik. \"Instant winner!: experience with 2C-C (ID 25244)\". Erowid.org. Jul 14, 2003. erowid.org/exp/25244",
  "substance": "2C-C",
  "views": "13454"
 }
}
