{
 "id": 19390,
 "title": "With Writing & Yoga",
 "date": {
  "submission": "2004-12-06T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CarCrashScar",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "6",
    "unit": "glasses"
   },
   "administration": "oral",
   "substance": "Absinthe",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": ""
   },
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  },
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "glasses"
   },
   "administration": "oral",
   "substance": "Absinthe",
   "form": "liquid"
  }
 ],
 "report": [
  "After about a year of research and curiousity, I set out to find a bottle of the elusive and infamous green drink called Absinthe. A friend of mine had recently taken a holiday in Spain and told me about his experiences with the drink. I learned as much about the legalities of the substance as I could, and found a website based in Barcelona that would ship to the states. I ordered a bottle of Deva Absente 70%. This was the bottle my friend had sampled from.",
  "When it arrived, I planned out a quiet evening with my other friend, Matt. I had tried absinthe once before in New Orleans, but it was French and did not contain any thujone. So Matt arrives and we begin the process by turning the lights down and putting on some downtempo music. (I believe the first CD was A Perfect Circle.) We prepared the glasses the traditional way (sugar cube on spoon, fire, ice water, etc.) The louching was beautiful, magical almost, the transparent emerald green began to cloud into swirls of milky white. The act of simply making the elixir is perhaps one of the most intriguing parts of drinking absinthe. Upon first sip, I was a bit overwhelmed by the taste. Similar to sambuca but with a much stronger licorice/ black jelly bean taste. To get accustomed to the taste, I would take a little sip and swish it around my mouth like wine. From the second glass onward, I started using two sugar cubes as well.",
  "I began feeling the effects after about fifteen minutes (I had eaten dinner about 2 hours prior to drinking my first glass.) The beginning effects were simlar to a wine buzz. We got a little giggly and my skin was slightly more sensitive than usual. Two glasses later, the music (which at this point was the deftones album White Pony) seemed richer and more balanced. Like the difference between listening to an old mono recording on vinyl versus a recently recorded digital cd. I wasn't hallucinating or 'tripping' per se, but after the sixth glass and a cigarette, everything took on an aura of opulence. The physical effects were very pleasant, like taking half a pill of ecstasy or smoking a little bit of weed. The best way I can describe it is as an 'intelligent' drunk. I took immediatley to my composition notebook and began writing down what was going on in my head. (Alot of which I'm repeating now.) It was not unlike being drunk off four or five glasses of wine. But instead of getting giddy and childish like I do off normal liquor, I felt very comfortable, relaxed, and inspired. I was more articulate than normal and all my senses were slightly hightened.",
  "I did feel sort of dizzy as I would off just alcohol, but it was much easier to control. After glass number nine, I felt the need to be more physical (perhaps inspired by the tool album we were now listening to.) So I began doing some yoga. I had much more energy than I normally would have being intoxicated, and I found I was able to do a couple of poses I had been having trouble with. All the while, Matt was drawing tattoo art, playing my guitar, and watching me do drunken yoga. After meditating in the tree pose for 10 minutes, I decided nine glasses was definitely enough for the night. The effects began to lessen about an hour and a half after my last glass. By this time it was a little after five a.m. and we were both getting tired. We fell asleep still drunk, and I dreamt I was an abstract artist living in turn of the century New Orleans.",
  "As an artist, I find it to be quite a nice alternative to pretty much everything else out there. I've tried almost every mind altering substance, some I enjoyed, many I did not. All of which I no longer do. Absinthe is definitely my preferred drink and I have even learned to appreciate the complex taste. But it is not for everyone, and it is best enjoyed with a small group of friends, especially creative thinkers."
 ],
 "erowid": {
  "id": "25246",
  "citation": " CarCrashScar. \"With Writing & Yoga: experience with Absinthe (ID 25246)\". Erowid.org. Dec 6, 2004. erowid.org/exp/25246",
  "substance": "Absinthe",
  "views": "16710"
 }
}
