{
 "id": 19409,
 "title": "Shakes, Sweat, Cold, and Anxiety",
 "date": {
  "submission": "2000-09-08T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "KC",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1600",
    "grams": 1.6
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I was going out one night with my friends to a club in New York City. This dance club is one of those places that plays great techno music and has a lot of people doing Extasy and other drugs. However, because I had a long trip ocming up the next day, I had to make sure not too get too messed up. I was not drinking that night or using any other drugs, nor have I done anything in the week beforehand that could otherwise explain my experience. So I went out and brought with me a package of Vivarin. Each pill contains about 200mg of caffeine, equivalent fo two cups of coffee.",
  "We got to the club around 1AM. So I started my night by taking 2 pills and dancing, and then taking a pill or two every time I started getting tired.",
  "By 5AM the whole set of 8 Vivarins was gone and I ate them all. I was a bit tired cause I have not slept the whole day before and danced all night. But my mind was going 200 miles per hour.",
  "When I left the club around 6:30AM I had the regular ringing in my ears from loud music and slight disorientation that I feel every other time as well when leaving a club early in the morning. I also have to mention that I was drenched in sweat and probably dehydrated.",
  "So I got home at about 7:15AM. I had to get some sleep because I had to drive for 6 hours at around noon to go back to school.  I did not have too much trouble falling asleep, but as soon as I did I woke up. At 7:30 I was lying in bed, my hands shaking. I would get random jerks in my extremities. My bed was drenched with sweat and I was cold. I was having one of the worst anxiety attacks I ever had (I do get them very rarely so i know what they feel like).",
  "My mind was racing. My body shivering/shaking. I was under a blanket and I knew it was hot in the house, but I was cold anyway. I could not fall asleep, I was worried about dumb shit. I was having thoughts of horrible things going through my head totally not rooted in anything real. Everything I would think about would produce very negative and worrying thoughts. I felt my heart beating strongly through my chest. I though someone might have slipped me some LSD and I was having a bad trip. I could not clear my head. I did think I might die. However, just like during a trip, I was able to convince myself that all will be good soon.  So I got up, went to the bathroom, drank a bunch of water to replace all the one I lost during dancing and sweating in bed.",
  "I managed to lull myself to sleep by thinking concentrating on something that could not possibly turn negative in my head, which usually works when having an anxiety attack.  I woke up  an hour later with a similar, but not so serious, anxiety attack, once again sweating. I finally woke up at 11AM, feeling all good. My body was tired and aching from dancing and my ears were still a little numb from the loud music, but all else was fine.",
  "I drove back to school and nothing else happened. Now I do realize that caffeine might have something to do with this, but I also had a similar experience about a year later, but with NO caffeine or other drugs. It might have been an effect of not sleeping for a really long time and/or being dehydrated."
 ],
 "erowid": {
  "id": "2531",
  "citation": " KC. \"Shakes, Sweat, Cold, and Anxiety: experience with Caffeine (ID 2531)\". Erowid.org. Sep 8, 2000. erowid.org/exp/2531",
  "substance": "Caffeine",
  "views": "22822"
 }
}
