{
 "id": 19402,
 "title": "An Almost Dangerous Amount of Caffeine",
 "date": {
  "submission": "2001-08-19T07:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Amber_Method",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I have been a coffee drinker for a long time, since I was twelve, and while I have never considered it an addiction, I will drink coffee continually if it is available. This came into play one night when I was hosting a movie at a local cinema. The movie was at midnight, and it was only 9PM and I was already feeling drowsy. I was with friends, and caffeine seemed like a good way to avoid falling asleep before the event.",
  "I am not an entirely logical person, but what I did next still seems a bit strange. We didn't have anything other than a large tin of terrible nabob coffee, and we also didn't have any cones or filters. So I decided we would make coffee the old-fashioned way, that is, brew it with the water, then pour it through a strainer. My method for accomplishing this was fairly novel, as I simply took a fairly large pot, filled it with water, then dumped in 2-3 cups of coffee grounds. Then we let it cook for 20 minutes on a slow boil. It was terrible in taste, but I knew it had caffeine, so I drank 2 cups. Half an hour later I had lost control of my facial muscles, and it kept me up for the next 12 hours. It was interesting when I was there; I had a sort of elated feeling, like I was removed from the world, because I was operating on a different plane of reality. The next few days were terrible though. I don't know if it is just the amount of caffeine, or if we had some how cooked out some other chemicals, but for the next few days I was completely burnt out. It felt like I was hungry, but eating was hard, and my brain did not want to function at all. I still drink coffee, but not like this."
 ],
 "erowid": {
  "id": "2530",
  "citation": " Amber_Method. \"An Almost Dangerous Amount of Caffeine: experience with Caffeine (ID 2530)\". Erowid.org. Aug 19, 2001. erowid.org/exp/2530",
  "substance": "Caffeine",
  "views": "20231"
 }
}
