{
 "id": 19404,
 "title": "Puffing Destiny",
 "date": {
  "submission": "2006-04-14T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Demarksman",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Smoking shisha in a hookah is a pleasant and relaxing traditional Middle Eastern activity that's becoming more popular in the US these days. But the tobacco used is almost always somewhat weak.  I wondered what it would be like to mix in some Nicotiana Rustica (a.k.a. 'Mapacho', 'Aztec' tobacco), the much more potent Tobacco species, to the mild shisha.  ",
  "After weeks of resisting the temptation, I ordered a Rustica bundle from an online vendor.  The 'bundle' is a seven-inch long, one-inch thick solid cylinder (about 70 g) of whole dried Rustica leaves held together by twine. The tobacco is easily crumbled for pipe or cigarette use.",
  "I mixed about one square inch of powdered Rustica with half a bowl of Romman strawberry shisha, and let the mixture sit overnight. The idea is to let the moisture and aromatic essences from the shisha permeate and rehydrate the dry Rustica, thereby making it taste less 'raw'.",
  "This was a small dose. But after only about five minutes of smoking the mixture--we weren't even 1/4 done--my wife and I had a huge buzz. At this point, the buzz is stronger than what I feel after smoking a whole bowl of pure Zaghloul (strong Egyptian molasses tobacco). Towards the end of the hookah session, I could feel that my perception of space was mildly altered. The shadows thrown by the various lights on the walls seemed alive... (This is tobacco???) One thing about Rustica, though, the peak of the experience is short, while the pleasant and mild residual feeling lasts for 2-3 hours.",
  "Upon cleaning the hookah bowl, I found that about 1/2 of the tobacco was still unburnt.",
  "The aroma of the Rustica-shisha mixture seemed to be much better than the Zaghloul-shisha mixture that I've tried several times before. The Romman aroma undeniably covered the smell of the Rustica. (After all, they're both tobacco based.) As for the taste, I could clearly tell that I wasn't smoking pure shisha. The mixture had a distinctly 'herbal' taste along with the strawberry flavor from the Romman, but not unpleasant at all. Definitely palatable--if not as excellent as pure Romman.",
  "Upon waking up the next day, we had a pronounced hangover--tiredness and nervousness for me, as well as some nicotine 'pull', and stomach ache and mild diarrhea for my wife."
 ],
 "erowid": {
  "id": "25304",
  "citation": " Demarksman. \"Puffing Destiny: experience with Tobacco (ID 25304)\". Erowid.org. Apr 14, 2006. erowid.org/exp/25304",
  "substance": "Tobacco",
  "views": "15502"
 }
}
