{
 "id": 19403,
 "title": "I Felt Fantastic",
 "date": {
  "submission": "2004-12-08T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "JackFairy",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Sceletium tortuosum",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "buccal",
   "substance": "Sceletium tortuosum",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:20",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:25",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>I wasn't expecting much from kanna, considering the negative prior experiences I have had with legal herbs.  I bought 3 grams from an online supplier.  When the package arrived, they kanna was a greenish powder.  I sniffed about 50 mg, and put another 50 into a piece of gum I was chewing.  It didn't taste as horrid as others have described.",
  "About 10 minutes later I had a lovely feeling in my stomach.  I felt really good.  I felt stimulated yet calm at the same time.  I definately couldn't compare it to any other drug I have done (which is quite of few).  I found to be the littlest things amusing and interesting.  I felt fantastic.",
  "About 20 minutes later, I smoked a cigarette which intensified the experience.  I felt like I was mildly high on marijuana, yet highly stimulated on caffeine. ",
  "About 5 minutes after that, I smoked about a half gram of marijuana.  Now, I felt very loose and relaxed.  I felt pretty happy, more so than usual. ",
  "This happy high all faded away for about 3.5 hours before I was back to baseline.  The comedown was very calm and comfortable. ",
  "From this experience, I have learned that kanna is a powerfull mood enhancer, and can really lighten a person up.  It would be a nice way to unwind after a long hard way.  I also learned not to under estimate the power of a substance, legal, or not.</p>"
 ],
 "erowid": {
  "id": "25303",
  "citation": " JackFairy. \"I Felt Fantastic: experience with Sceletium tortuosum, Tobacco & Cannabis (ID 25303)\". Erowid.org. Dec 8, 2004. erowid.org/exp/25303",
  "substance": "Sceletium tortuosum, Tobacco & Cannabis",
  "views": "23545"
 }
}
