{
 "id": 1940,
 "title": "1st effective Salvia Expierence",
 "date": {
  "submission": "2001-06-26T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Redeye",
  "weight": 168
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "0.0833 oz",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "This was the second time I tried Salvia, the first being two days earlier. I am a member of the now defunct Church of the Tree of Life, and had obtained a live specimen back in 1979, and it must have been good stuff, as my two cats scaled several bookshelves in order to attack & devoured it (they were fond of fresh cannabis also). I had also experimented with coleus several times with no noticeable results.",
  "Any ways, I got together with a tripping buddy at about 1:00PM, I had read a lot of trip reports and had a pretty serious attitude about our endeavor, his approach was a bit more cavalier. At 1:00 we each did a hit of mj. At 1:05 we both took 3 droppers of the Sage Essence, while I held mine in my mouth for a full ten minutes, he swallowed his at 4 or 5 min. and then took an additional two droppers. Even before I reached the 10 minute mark I was feeling effects that seemed to start in my mouth & throat.",
  "One thing I have not read in other trip reports is a mention of euphoria,",
  "which I definitely did feel, I also felt myself move into a semi-familiar state of tripping. That is to say, I was definitely tripping, but with a different flavor than acid or shrooms. My friend was a bit restless, and I later found out that he wasn't any where near where I was, he said that he felt a few minutes of a gelatinous feeling, and a rather narcotic feeling after that, but nothing else.",
  "On the other hand I was able to close my eyes and see colorful swirls. After a few more minutes I was feeling as though I was in between worlds, or realities, that I was existing in the barrier between these realities. Behind me was myself and the physical existence, and in front of me was an expansive,(infinite?), reality filled with all sorts of images, stars, planets, beams of energy, expanding in all directions. All these things were sort of half-seen and half-felt. I then became aware of a bluish/purple form in front of me. It was undulating and morphing, but never took on a definite shape. The unique thing at this point was that the form and the space in front of me took on a fuller 3-d appearance. There was a lot of other stuff going on at this time as well, I remember a feeling of leaves at one point as well.",
  "Right about here my friend got up and walked past me, and I was brought back to this side of the barrier. I got up to go to the bathroom, and it was as if I was a foot shorter than I really am. I should also mention that I am diabetic, and I got very dehydrated during this experience, I mean I peed like crazy. When I sat back down, I tried explaining what had happened to me to my friend. And as I did, I could close my eyes and see/feel things still going on, the 3-d richness had passed, but my hands seemed to move in the other reality, I could feel it. I remember telling him something about open eye reality, closed eye reality, and how this experience moved beyond closed eye reality. Well it all made sense at the time.",
  "I also felt very high/stoned/euphoric during this time. On a second trip to the bathroom, it felt as though I was walking on blocks, but a foot below the level of the floor. I then lay down on the floor and watched the ceiling, there were silhouettes of fractal leave patterns moving around there. They almost seemed like spotlights, but the edges of the beams were not well defined. I lay there for 30 min. watching these beams as they changed color. At some point there seemed to appear a hole/ or tube, but it never really developed, it couldn't 'break through'.  At this time, we had both pretty much returned to normal open eye reality, but a narcotic type of feeling continued for another 30 to 45 min.",
  "I have about a third of this magic bottle left for one more try, and probably will feel compelled to relay that experience as well."
 ],
 "erowid": {
  "id": "1638",
  "citation": " Redeye. \"1st effective Salvia Expierence: experience with Salvia divinorum (extract) (ID 1638)\". Erowid.org. Jun 26, 2001. erowid.org/exp/1638",
  "substance": "Salvia divinorum (extract)",
  "views": "10148"
 }
}
