{
 "title": "A Last Resort",
 "author": "Chrissy",
 "citation": " Chrissy. \"A Last Resort: experience with Metaxalone (Skelaxin) (ID 19406)\". Erowid.org. Feb 13, 2004. erowid.org/exp/19406",
 "substance": "Metaxalone (Skelaxin)",
 "bodyweight": "132 lb",
 "report": [
  "<p>I recently had a muscle strain in my lower back from working.  I got  a script for the muscle relaxer Skelaxin.  I thought, you know--a pill is a pill, so at first I snorted one tab.  I didn't expirence any kind of a high or buzz, but I was slightly relaxed.  I was disappinted with the result, for it burned the inside of my nose pretty bad.",
  "So I decided I would just eat a couple and see what happened. I waited 5 hours after my last meal, it was about 11:00 PM On a Friday night.  I took 5 tabs, of 400mg Skelaxin at that time and waited.  I felt very calm, but not as good as a buzz off a Z, or Soma or anything.  I sat and watched T.V. for a bit, and got very very upset.   I didn't really have any kind of a buzz, and it was about 12:00AM [midnight].  As I wached TV, I felt my noze itch, so I reaced across to scratch it.  As my hand reached my nose, my arm slid across my face and into the air without my control.  I also felt wetness on my hand, and when I looked for the source, I saw that I had been drooling and was unaware.  For about the next half hour, I felt extremly relaxed and happy.  I laid back on my couch and let my mind wander. ",
  "None of my senses were impared, except for my sense of touch.  My fingers, nose, and my ass all 'fell asleep' and became numb at different times for about 5 minutes each. I also noticed that my gums were numb.  Also, my hearing was slightly muffled.",
  "I didn't crash off the Skelaxin, but I did get very sleepy and VERY dizzy when I walked around at about 12:15am.  The buzz was okay, but that was my first expirence with Skelaxin.  I would say that 2 tabs of Zs would be a better buzz than 5 tabs of Skelaxin.</p>"
 ],
 "year": "2002",
 "id": "19406",
 "gender": "Female",
 "views": "49448",
 "dose": [
  {
   "time": "0",
   "amount": "2500 mg",
   "administration": "oral",
   "substance": "Pharms - Metaxalone",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2004-02-13T08:00:00.000Z"
}
