{
 "id": 19413,
 "title": "So This Is Death?",
 "date": {
  "submission": "2004-09-17T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "DOD",
  "gender": "Female",
  "weight": "95 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "18 capsls",
   "administration": "oral",
   "substance": "Diphenhydramine"
  }
 ],
 "report": [
  "(This experience happened a month ago - two nights after my boyfriend and I had broken up.  I was severely depressed, and in no shape to be tripping.  But that all didn't matter to me then, I knew it was a bad idea but I did it anyway.  I don't condone experimenting with ANY drug while you're depressed or upset - I don't recommend it at all. The results could be fatal..)",
  "Around 11PM last night I decided that I needed to escape this world. Since I was lacking DXM and acid, I went to my alternative choice - my medicine cabinet. I knew exactly what I was looking for - my Benadryl capsules. So I grabbed them and went back to the PC. I ended up dosing around 12ish. I swallowed the first half and downed them with some Pepsi. Then I tossed the other remaining pills in my mouth and did likewise. I didn't even pay attention to how many I took - around 18 I believe. So then I went online and messed around while I waited for them to kick in.",
  "While I was typing on the keyboard I knew something was beginning to happen. My fingers got real unstable, and typing became harder. [as I type this my hands are still shaking a little] I also began to get lightheaded, and a little disoriented. As I looked at the PC screen the monitor seemed to kind of jerk around. As for the mental effects so far, my thoughts were having a hard time linking together. They also became more spontaneous and jumped from subject to subject. Time didn't exist anymore to me, because it simply didn't matter what time it was. What was time anyway? An abstract idea. Why put so much emphasis on this idea - so meaningless. I began to feel like I had succeeded in breaking myself away from this world.",
  "I had forgotten I was online and stumbled to my beanbag on the floor. Walking was really difficult, because I was really off balance. The Doors' DVD was playing on my TV, so I tried watching that - thinking the Lizard King could teach me some things. Keeping my focus on the TV was hard, because I kept falling asleep. I fell asleep one time for a good while (maybe for 30 minutes). When I woke up everything was different yet the same. I was in my room still, but the room looked plastic. It was all a copy. I thought I had died. I was happy that I had died. I wanted to die and get away. I thought I'd really experienced that act of dying. I deduced it down to this: falling asleep and waking up in an environment that is most familiar to you. But the environment wasn't real, but just a thought in your head. Dying was just simply going inward into your brain and your thoughts. I was dead. I was content. I lay there for a while/long time staring up at the ceiling and the walls. A thin, clear substance covered them. It moved around like a flag did in the wind. It almost looked like the way gas does as it evaporated from its container. I reached out and tried to grab some of it, but it only slipped through my fingers.",
  "I looked at my TV and then realized I was reliving the minutes before I died. Because before I went to sleep, the same thing was playing as it was now. So that was death. Death was dying and going inward into your mind. But it could only recreate the few minutes it remembered before the person died. So I was to be stuck in this repeating loop of occurances. I began to panic around this point. I didn't want that, not at all. I stood up really fast trying to excape this place. But I stood too fast, got too dizzy, and fell to the floor hitting my arm on my CD player. Pain. You can't feel pain in your death.",
  "This made me snap back to reality. I remembered that I had taken some benadryl, and that I was merely tripping. I then slowly rose to my feet and stumbled into the bathroom to look at myself in the mirror. I saw the clear substance in the mirror too, and figured it was just a hallucination. I turned off the bathroom light and made my way back to my room. But on my way back I saw a man. A dark shadowy figure. When I saw him I fell to my knees in fear. I looked back up again to see there was nobody there. Another hallucination. So I crawled back into my room and went to my beanbag again. I looked down at my thigh and saw it was dotted with all these pink blotches that were moving around. I looked at my arms and saw they too had these pink patches on them. I started scratching like mad thinking that would help. [I scratched myself up pretty bad, I have scratches all over my arms and legs] I looked at my legs again to see nothing was there. I told myself that I should go to bed before I seriously hurt myself.",
  "I thought I heard something rustling in my papers on the floor, and I looked down and saw three huge millipedes. I seriously almost lost it. I went to scream for help thinking they were after me, until I remember that it was just the delusional effects of Benadryl. I closed my eyes and opened them again and they were gone. The Doors' movie was still playing, so I went to turn it off - until it started speaking to me. Jim Morrison was singing on the movie when I was getting ready to turn it off. As soon as I went for the button he said, 'Yes Vonda, go to sleep, sleep until you wake.' I paused for a second and stared at the TV. Oh my god...he spoke to me, he called out my name. I jumped for the button and turned the damn thing off. I stumbled to my bed and covered my head with the covers. Then sleep came.",
  "Now, the day after, I'm, still seeing those clear pattern things. I'm off balanced a little, and my thoughts are still weird. Do I consider this a good trip? No. Do I consider this a bad trip? No. What DO I consider it then? A temporary relief of reality."
 ],
 "erowid": {
  "id": "25323",
  "citation": " DOD. \"So This Is Death?: experience with Diphenhydramine (ID 25323)\". Erowid.org. Sep 17, 2004. erowid.org/exp/25323",
  "substance": "Diphenhydramine",
  "views": "35969"
 }
}
