{
 "id": 19411,
 "title": "Foamy, Reddish-Orange Stomach Contents",
 "date": {
  "submission": "2003-07-16T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "tathra",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "75",
    "unit": "mg"
   },
   "administration": "IM",
   "substance": "DPT",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "IM",
   "substance": "Ketamine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Diazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "last night, for some strange reason, i decided to do some DPT.",
  "since i didnt want my nose to suffer (dpt is pretty harsh on the nose), i figured i'd IM it, as i havent done that way but one time. i put about 75mg in my spoon and scrape a tiny amount of ketamine in there as well (maybe 20mg at the most, i was scraping a sandwich baggy that used to be full of the stuff), squirted 1/2cc of saline solution into the spoon, and cooked and stirred the shot, making sure it all disolved. then i dropped in a tightly rolled ball of cotton, as a filter, and pulled the solution up into my rig, then stuck it into my tricep and slowly injected the solution, still hot, taking about 20 seconds to empty the rig into my arm. this was at about 4:30 am CST.",
  "4:35 i begin to feel the dipropyl comming on, quite strongly. during quite a few of my recent trips, i've seen a female entity in my peripheral vision, always looking over my right shoulder. i notice her staring over me, with a sad look on her face, and the chemical begins to hit me stronger.",
  "very soon after this, it starts to get scary. i am chatting on irc with a couple friends. here is the exact transcript:",
  "[04:36]  wee",
  "[04:36]  hate you",
  "[04:36]  you suck not fair",
  "[04:36]  yay, Kitty got the correct answer: 'you suck'",
  "[04:36] [04:36]  wha",
  "[04:37]  did i just type tha?",
  "[04:37]  ok, i know i didnt",
  "[04:37]  thats creepy as fuck",
  "[04:37] * Kitty looks @ tathra",
  "[04:37]  you must have",
  "[04:38]  i dotn remember typing it",
  "[04:38]  :x",
  "[04:38]  yes but you're high",
  "[04:38] * tathra shrugs",
  "[04:38]  but thats still creepy",
  "[04:39] * Kitty hugs",
  "the next day, i look over the lines i typed out by scrolling up in the chat window (the area where you type stuff in)... the lines before and after that strange line are there, however i am unable to find anything suggesting i typed,  yay, Kitty got the correct answer: 'you suck' i DO remember hearing keys clicking before i looked up and saw that, but i do NOT remember typing it, and that is definately not my writing style, i wouldnt say something in that way.",
  "the trip continues to intensify, and i start to think that maybe i've become demon possessed or something, and at some point soon after, i feel all sorts of spasms and twitches running through my body, and i feel my stomach start to get upset. i walk through my house, into my bedroom, and a strange spasm runs through my body, a funny energy in my head. i go back to my computer chair and feel another kink in my stomach, so i run to the bathroom and crouch in front of the porcelon god. i projectile vomit some weird orangish-red foamy stuff into the toilet, very forcefully; my first thought was that i was puking blood. i begin to freak out, thinking i'm going to die, that i've done too much and my body is going to just up and quit.",
  "i lay on the floor, grasping at my hoodie tightly praying that i make it through this alive. i clutch at my hoodie, biting and twisting it as i lie on the floor, moving around in mental agony. occasionally i get up to see if anyone is around on irc. finally one of my close friends is there for me to talk to, and i call up another friend. they help talk me through the situation as i go through hell. i eat some more diazapam around this time too, putting total amount of it in my system to about 30mg i figure (normally, ~5mg of diazapam is enough to knock me out). i consider walking over to my friends house (about 6-7 blocks) but there is NO WAY i would want to be out wandering the streets in my condition, as i'm sure i'd end up goign to jail or something equally horrible.",
  "~6am or so, after suffering for ~1.5 hours, thinking i was going to die, the chemical wears off to a somewhat managable level. i thank my friends for talking me through it. i dont really remember leaving my computer, but i do remember waking up about 20 hours later, feeling fine. however i cant walk a straight line, due to all the diazapam in my system...",
  "i've never had a problem handling my drugs. NEVER have i had an experience where i was scared for my life. also, i've never puked on a psychedelic, much less some reddish-orange foamy shit that looked kinda like blood. dpt is ok stuff, its amazing if you've got enough ketamine onhand to put yourself into a hole, but doing too much is pure hell. i dont think i'm ever going to touch that shit agian. i am very thankful i made it through the experience ok, not phased a bit now that its all out of my system.",
  "those who choose to use dpt, be EXTREMELY careful, and make sure you are prepared for what may happen, and make absolutely sure you start low and work your dosage up very slowly and cautiously."
 ],
 "erowid": {
  "id": "25318",
  "citation": " tathra. \"Foamy, Reddish-Orange Stomach Contents: experience with DPT, Ketamine, Diazepam (ID 25318)\". Erowid.org. Jul 16, 2003. erowid.org/exp/25318",
  "substance": "DPT, Ketamine, Diazepam",
  "views": "24729"
 }
}
