{
 "id": 19429,
 "title": "A New Mistress",
 "date": {
  "submission": "2007-10-14T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Oxy Freak",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "[[Erowid Note: IV injection of crushed pills/tablets can be very dangerous due to unknown binders and fillers present in the tablets.]",
  "I started out with that most devilish of mistresses, Diacetyl Morphine; or, more commonly referred to as: Heroin. After a couple years of rather horrendous abuse and addiction I managed to 'kick the habit' as They like to say for a series of rather worry-free, fantastic months. But, of course, once a junkie always a junkie, and it seems to take just the right amount of stress to enter my life in order for me to go back to the needle.",
  "I was not a complete stranger to OxyContin during my heroin addiction. I had a friend who was prescribed 80 mg, 40mg, and 20mg OxyContins every month, and she would give them to me or charge me some ridiculously nominal fee, in the ballpark of $5, while I was at work. Originally, per her request, I would break the 80 mgs in half and chew them up, and in about thirty minutes I would start to feel pretty euphoric. After my brief lapse of cleanliness, I fell face first, and still continue to linger, in a horrible world of OxyContin addiction.",
  "A report of a nasal dose:",
  "After crushing up two 80 mg OxyContins, I proceeded to make about 35-40 little 'toothpick' lines in order to snort the drug. I am thrououghly convinced that snorting a series of small 'toothpick' style lines over a ten minute period gets me a lot higher than snorting 4-5 regular or massive lines within a 1-2 minute period.",
  "About 15-30 minutes after the nasal inhalation of 160 mg of pure OxyCodone, I felt pretty high. But, of course, I can never get quite as high as I used to so I proceeded to crush up the other 80 mg OxyContin about two hours after my 160 mg dosage. After the nasal inhalation of this final dose, I could barely feel my legs or control my consciousness (nodding-out).",
  "A Report of an IV dose:",
  "After sucking of the coating of an 80 mg oxycontin, I proceed to crush it up just as I would if I were going to snort it. I then place the powder in a spoon and add 50-60 cc of water and heat it up with a spoon until it just begins to bubble. I stop cooking it up and set it down and use the plunger of my needle to stir up the solution and scrape the OxyContin residue that has collected on the sides of the spoon into the main mixture, after this I cook it up for another couple seconds, drop a cotton in the spoon and draw up the solution.",
  "It is a very intense rush and the high lasts, in my case, about 1-2 hours afterwards. The only advantage of shooting is the rush. Snorting seems to give me a much more even balanced high for a much longer period of time (3-5 hours)."
 ],
 "erowid": {
  "id": "25375",
  "citation": " Oxy Freak. \"A New Mistress: experience with Oxycodone (Oxycontin) (ID 25375)\". Erowid.org. Oct 14, 2007. erowid.org/exp/25375",
  "substance": "Oxycodone (Oxycontin)",
  "views": "21192"
 }
}
