{
 "title": "Good Stuff For The Soul",
 "author": "Swifty",
 "citation": " Swifty. \"Good Stuff For The Soul: experience with Gabapentin (Neurontin) (ID 19435)\". Erowid.org. Dec 9, 2002. erowid.org/exp/19435",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "220 lb",
 "report": "<p>I was put on Gabapentin about 4 years ago for treatment of bipolar condition. For those unfamiliar with the term, bipolar means you have uncontrollable moodswings. We're talking extreme ups and downs. After years of misdiagnosis as chronically depressed, I was diagnosed as bipolar. Seems I was depressed about these moodswings I had no control over. Go figure.</p><p>To me, Gabapentin is nearly invisible. The effect it has on me is that it stops me from making such a big deal about everything. I started with 400mg/day but it didn't really do anything until I started with 2400mg/day. Sure it makes me feel pretty good but it's not something I need to abuse.</p><p>However, I have tried a few things with it. I tried smoking 400mg of it once but didn't feel very much. The most I've taken is 8000mg at one time and I got a little tired, took a nap, and woke up with a hangover. It seems that I get a hangover when I take anything over 2400mg/day.</p><p>One thing Gabapentin does is help me sleep through the night. I get a good 6-8 hours sleep per night with no interruption. I still have dreams and am able to wake up easily when I need to. It sometimes helps me to fall asleep too, but that's not what I take it for.</p><p>Overall, Gabapentin has helped me (and those around me) tremendously. They say bipolar behavior has something to do with uncontrollable seizures within the cortex. That would explain why an anti-seizure medication would work to control moodswings. Basically, it's good stuff for the soul. Nothing creepy about it.</p>",
 "year": "2002",
 "id": "19435",
 "gender": "Male",
 "timestamp": "2002-12-09T08:00:00.000Z",
 "views": "41758",
 "dose": [
  {
   "time": "0",
   "amount": "2400 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(daily)"
  }
 ]
}
