{
 "id": 19430,
 "title": "Datura",
 "date": {
  "submission": "2000-10-10T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "From the Front Yard",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "insufflated",
   "substance": "Methylphenidate",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "2.5"
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "leaves",
    "quantity": "0.5"
   },
   "administration": "oral",
   "substance": "Datura",
   "form": "leaves"
  }
 ],
 "report": [
  "Before hand: Bumped 20mg ritalin, 2.5mg dexedrine, 200mg caffeine (dont know why)",
  "9:05",
  "Ate 1/2 leaf (7'X5')",
  "10:05",
  "actually in a good mood, no real noticeable effects considering I was jittery when I ingested the leaf. ",
  "its 4:01",
  "I didnt really start intent on keeping a accurate description throughout, I didnt truly feel anything until about 11:45 or so, and I cannot remember if I started hallucinating before I smoked marijuana, smoking did make it kick in as it does so well for acid.  I also smoked about a quarter leaf maybe a sixth of a leaf, over a course of time (cant really tell if that did anything, but I suppose it did something. ",
  "The hallucinations were mild, the first ones you get on acid, for a light trip, carpet swimming, motionlike surfaces, very small, but I did only take a half leaf, and I am glad I did, cause I did and am tripping, not too hard but I am also not sick or dead, next time I will try a whole leaf, or maybe just smoking, no ingestion, provided I dont feel too bad tomorrow. ",
  "Its morning, I feel fine, had a nice little trip last night, no overwhelming languor, or nausea as others have reported, half leaf seemed to be well below the limit, but enough to make an impact of some sort.  Next time its a whole leaf for me.  I had an enjoyable little time, and suggest a small amount of jimson weed and some marijuana for a first try, definitely no unpleasantness in my experience."
 ],
 "erowid": {
  "id": "2538",
  "citation": " From the Front Yard. \"Datura: experience with Datura (ID 2538)\". Erowid.org. Oct 10, 2000. erowid.org/exp/2538",
  "substance": "Datura",
  "views": "30858"
 }
}
