{
 "title": "Story and Advice",
 "author": "Jake",
 "citation": " Jake. \"Story and Advice: experience with H.B. Woodrose Seeds (ID 1944)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1944",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "report": "<p>Well, yesterday a FOAF and his friends had their first experience with Hawiian Baby Wood Rose seeds, which my FOAF later dubbed 'The wacky russian rulette of acid'. Four people ate the seeds, three of them tripped, each with varying degrees of intensity. They had some wisdom that they thought I should pass on to the net.</p><p>One thing to keep in mind is that these seeds are naturally growing botanicals and due to each plants idiosyncracies one cannot reliably estimate how much LSA one is ingesting by the number of seeds you eat. One of my FOAF's friends ate three seeds and had a typical mild acid trip (intense colors, trails, and mild synthenesia). Another one had nine seeds and got absolutely no effect. Two others ate nine and had moderate trips, one good and one not so good (more later). My FOAF had twenty seeds and had the most intense trip of his life, including phantom music, very intense and dramatic synthenesia, and occasional withdrawls from reality, where his normal vision was completely obscured by intense patterns and colors... kinda scary sometimes. As you can see, your milage may vary.</p><p>No one got physically ill as a result of taking the seeds, although one of my FOAF's friends admitted, after eating the seeds, that he thought he might be coming down with the flu. STUPID! Twice during the evening he began to feel nausiated and dizzy, and when he did, he correspondingly reported having 'uncool' experiences and went off by himself for a while. This morning he is down but suffering from the flu.</p><p>Although the seeds have a reputation as being 'weak' acid, my FOAF would not recommend that they are eaten by the unexperienced user, since they had such a wide range of effectiveness. Getting acid with a reliable mic count would be a better way to go at first, to add a bit more control to the already unpredictable activity of dropping.</p><p>That's all for now. I hope this is of use to someone. I've learned much from alt.drugs, and it's good to return the favor!</p><p>Happy tripping!</p>",
 "year": "1993",
 "id": "1944",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-19T07:00:00.000Z",
 "views": "9169"
}
