{
 "id": 19456,
 "title": "Opening the Floodgates",
 "date": {
  "submission": "2007-10-14T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Aph0tixou1",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "[Introduction]",
  "It all started back in April 2002. 19 at the time and sick of home life, I moved out with a friend into an apartment. I had only a few experiences with drugs, and thought that they were bad for my mental health because of an intense first experience with pot two years back. My mind set was immature, young, inexperienced and not very receptive to many ideas outside of my own. Needless to say, I wasn't prepared for change.",
  "[The Start of Drug Use]",
  "My friend and I started to date and things were looking up until her ex, of 3 years, moved in with us! He threw an emotional monkey wrench into my life, but we all settled into a nice friendship.",
  "Later on (being the potheads that they were), they convinced me to give up my vow of straight edge and try drugs again. I gave in. We got high every day and I was getting a real feel for the high life. 5-6 months later, there was news of mushrooms.",
  "[The Mushrooms]",
  "Now here's where things fell apart. My girlfriend broke up with me and had been cheating on me with her ex, so I was under a lot of stress (as well as work and daily living stress). I had been fighting with her for a week straight and was getting really down and depressed, but we were all still doing the mushrooms, rain or shine it seemed. So we all loaded our pizza slices with our individual dosage, watched a movie and waited. I tried to feel like I was prepared, but I wasn't at all. I didn't know much about mushrooms and didn't know anyone who could give me a good indication of what to expect and how to face bad trips.",
  "[0 hour]",
  "It was about 7:30pm in November. Dark. Dreary. Windy. Cold. We sat around and watched the latter half of Fear and Loathing in Las Vegas (a bad choice for a first trip, IMO) and then some unexpected acquaintances showed up, high on LSD and wanting to chill out. About these three guys: One was a narcissistic weirdo, one was an annoying pill popper who only had two things to bring up in conversation; pharmaceuticals & TV mind control. The last was a loud, obnoxious guy who talked mock-philosophical nonsense. These idiots pressured me into smoking pot to 'enhance the experience'.",
  "As you can see so far, things weren't getting any better.",
  "[35 miniutes]",
  "I sat around, keeping to myself, and waited as the mushrooms kicked in. I watched the carpet swirl and shift, and the stucco ceiling made shapes and rippled like water. It was great until some bright person suggested that we watch Requiem for a Dream. I knew the movie well, so I thought I could handle it, but the stress got to me and I freaked out. I ran into my bedroom and dry heaved over a garbage can. I huddled on the floor in the darkness and saw shapes in the clothes on the floor. They looked like monsters. Every time I closed my eyes I saw a face in 3D, similar to the one in Lawnmower Man, and it looked angry. I also couldn't stop visualizing an infinite fractal of color wheels.",
  "[2/3 hours+]",
  "Half an hour passed with me in the room, I was peaking, and no one came to check up on me even after hearing my haunted cries. I felt so alone and unloved. I then realized that since I couldn't fight it, I had to go with it and learn to adapt to this change. It worked! I slowly started feeling better and, despite all the negativity around me, I started to enjoy myself by self-focusing and enjoying my personal experience. I adapted this metaphor of a bad trip to life and it has helped me in my journey. I seemed to think clearer and my problems, so insignificant, disappeared by logically deducing them. I continued to see and feel strange things in the remaining hours; I felt a snake on my shoulder, saw a fly that was just a black mark on the wall and my visual point of view was sort of like looking through a fisheye lens. I also saw what I believe was energy fields around the people in the room. They seemed dark, almost black, but I can't remember for sure.",
  "[Conclusion]",
  "The days, weeks and months after were spent with me lost in thought and my mind seemed to have opened vastly. Things became more clear, I learned faster, metaphorical artistic messages were understandable, I became more creative, I was faced with the cosmic question of life and death in depth, I wanted to know more, I'd gotten better at everything I did x10 (like guitar, art, writing, reading and music composition). I'm not sure if it was drugs alone that gave me this heightened awareness, I believe it was a combination of many things. I owe my sanity and well being to my mind, which saw me through the opening of the floodgates."
 ],
 "erowid": {
  "id": "25483",
  "citation": " Aph0tixou1. \"Opening the Floodgates: experience with Mushrooms & Cannabis (ID 25483)\". Erowid.org. Oct 14, 2007. erowid.org/exp/25483",
  "substance": "Mushrooms & Cannabis",
  "views": "2424"
 }
}
