{
 "id": 19463,
 "title": "I Believed My Cat Wanted to Humiliate Me",
 "date": {
  "submission": "2007-06-27T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "addict",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Ill spare you a long introduction.",
  "I like meth.",
  "I recently got sum meth.",
  "so, I smoked the meth.",
  "I had a good high, although I wanted more.",
  "nothing special happened until the last 2 hours of my 50 hour experience.",
  "by hour #48,(thats how long it had been since I started smoking my meth) I smoked some weed and decided I was able to sleep again.",
  "I had my usual 'slight paranoia/eccentric thoughts' that I get whenever I continuously smoke crank(meth) for days.that was nothing unexpected.",
  "I layed in bed with my cat...then my thoughts raced out of control.",
  "I could not keep up with them.",
  "elaborate delusions went through my mind, non stop.",
  "these delusions became impossibly complex and went through my mind too fast for me to remember.",
  "I tried to get out of bed at least 7 times, because I believed that my cat wanted me to open my bedroom door to let him leave.each time I started to get out uv bed I would stop myself...but the paranoid thoughts continued to race.",
  "(the door was six feet away and my cat was laying on my bed ,with me.it was acting perfectly normal the whole time)",
  "I believed my cat was angry at me for not letting him out.",
  "I believed my cat wanted to hummiliate me.",
  "I believed that my cat thought I was teasing him.",
  "I believed that my cat was trying to intimmidate me.",
  "I believed my cat wasnt thinking the way he normaly did.",
  "(these thoughts prevoked me to begin getting up so I could let my cat leave ,every few minutes,it seemed)",
  "I believed that I wasnt thinking the way I normaly did.",
  "upon realizing how fucking crazy I was acting , my ideas and thoughts slowed down to a near normal speed and I felt like I was in control again...",
  "two hours had gone by since I got in bed.all this happened in wut felt like 15 minutes.",
  "I started getting up to let my cat leave ,again.",
  "I stopped myself one last time.",
  "id been awake for only 50 hours by this time.",
  "then I slept for 13 hours.",
  "I woke up to find I was back in my normal state uv mind(both emotionaly and cognativly)... and I wieghed 15 pounds less than I did when i first got my meth.",
  "Iv been on much longer meth binges than this ,but Iv never behaved so strangely, or thought in such distorted ways during any of my (many)previouse meth experiences.",
  "It was quite scary and extreemly bizar...but I know Ill continue to use these drugs, anyway.",
  "I should note that I use amphetamines regularly.(at least once a week,but usualy more)",
  "however ,I had not used any amphetamines/methamphetamines for 20 days,prior to this experience.and I had a much lower tollerence than I usually do.",
  "I became psychotic that night,but Im not gunna waste my time making guesses about why it happened.I have had enough personal experience to say that anything is possible when it comes to doing drugs.and normal folks have been known to have pschotic reactions to speed.",
  "-end transmission.over."
 ],
 "erowid": {
  "id": "25504",
  "citation": " addict. \"I Believed My Cat Wanted to Humiliate Me: experience with Methamphetamine & Cannabis (ID 25504)\". Erowid.org. Jun 27, 2007. erowid.org/exp/25504",
  "substance": "Methamphetamine & Cannabis",
  "views": "4774"
 }
}
