{
 "id": 19460,
 "title": "Making Things Weirder Than They Had to Be",
 "date": {
  "submission": "2007-05-21T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nitrojunkie",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "1:15",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "3:30",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "leaves"
  },
  {
   "time": "4:00",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  }
 ],
 "report": [
  "To begin, I would consider myself at about the intermediate level when it comes to experiences with psychedelic drugs.  I've tripped on mushrooms quite frequently though rarely have ingested excessive amounts.  I also have tried LSD on several different occasions.  All of my experiences with mushrooms had been excellent and involved interesting visuals and even more interesting conversations.  It was just when I was feeling very comfortable with the drug that things took a new turn.",
  "It was spring break 2003, my first year of college, when myself, a close friend, we'll call him A, and his girlfriend, we'll call her B, obtained about an eighth of mushrooms each.  We decided the best time to do them would be that Friday at a large party we'd been informed of.  I was extremely excited about the trip and did my best to mentally prepare myself throughout the week.  This mainly consisted of working to keep myself in a good mood, avoiding stress, as if that's hard on spring break, and smoking considerable amounts of weed.  Friday finally came around and the three of us met over at A's house around 7:30 in the evening.  We then proceeded with our usual way of taking mushrooms in which we spread peanut butter on a graham cracker then stick the caps and stems to the cracker.  I don't know why but for some reason this method seems to cancel out taste.",
  "After eating the mushrooms, we began our roughly half hour walk to the house the party was at.  Within about 10 minutes I could already feel the trip coming on.  My stomach was filled with butterflies and the world around me seemed brighter than usual.  The three of us were regularly having outbursts of laughter and saying strange things to the amusement of everyone.  As we walked we passed a church with an enormous flourescent cross on the side.  We were attracted to the light and managed to stumble into the parking lot just as a large church function was ending.  We walked straight through the crowd trying desperately not to laugh.  Everyone seemed to be glaring at us with pious hatred of all drug users.  All the faces around me appeared to stare with a grim disapproval that I found hilarious.  The rest of the walk passed without incident.  I remember noticing that I wasn't having the visuals I normally associate with my mushroom experiences, but I was still happy with the mind trip.",
  "After wandering around a neighborhood for awhile the three of us arrived at the party and started to drink, it was maybe 8:45 by now.  That's when things started to go bad.  Immediately, something about the orange, dim light in the house unsettled me.  Once word got out that A, B, and myself were tripping, things got even weirder.  I tried to have conversations with the other people I knew at the party but I felt as though it was impossible to communicate with them because, oddly enough, they were not tripping.  I began to feel harsh waves of alienation and paranoia.  I watched people I didn't get along with in high school begin to arrive and get obnoxiously drunk.  Everytime someone talked to me I had the innate feeling that I was being mocked.  All the faces I saw betrayed an expression of confusion and dislike as if I was despised.  All around me the house was getting more and more packed with people who were becoming drunker and from my point of view angrier.  It's hard to describe exactly what this was like, the best I can really say is that the situation was filling me with fear and I was recieving very hostile vibes from everyone around me. ",
  "I decided it would be a good idea to go into the backyard and smoke a cigarette.  This calmed me down very slightly, though I do recall being disturbed by a feeling that there was a large hole in the roof of my mouth that led to my brain.  I sat outside chain smoking and eventually A and B joined me.  They both seemed to be having an alright time.  I remember having very deep thoughts at this point about my friends and what their physical appearances implied about their personalities.  This gave me a feeling of depressing nostalgia as I began to remember times in high school with everyone I had been close with and realizing that my time with all of them was over.",
  "These thoughts were interrupted when large groups of people from the party began spilling out into the backyard.  Once again my mind felt invaded by the hostile vibes of this drunken gathering except by this point I was tripping much harder than I had been in the house and just could not handle it.  I tried to avoid people but continued to get sucked into conversations but no one seemed to understand what I was talking about.  After 15 minutes of this I was convinced that a sizeable portion of people at the party wanted to kill me.  I knew not to express this specific concern to A and B but I did tell them I was freaking out a little bit.  B tried to calm me down by pointing out pictures and other decorations in the house that looked interesting while tripping and though this calmed me briefly the bad vibes continued to boil.  Finally my paranoia was getting uncontrollable and thankfully the three of us decided to leave to the woods to smoke a bowl.",
  "As we walked down the bike paths my paranoia and fear began to peak.  I saw myself surrounded in dark grey fog and something told me I was supposed to disappear into it.  I hated myself and I was convinced that everyone hated me.  Everything felt futile and all I wanted to do was wander off into the fog and trees and never be seen again.  I regretted every decision I've ever made and decided I was worthless.  The urge to run off picked at me and picked at me and the anxiety bubbled in my stomach.  Despite all this I was still having conversations with A and B who were urging me to concentrate on looking at the trees and the patterns on the ground but the conversation I myself was involved in seemed a billion miles away.",
  "I know I expressed my discomfort and bad vibes to them but as usual it is often impossible to explain to another person what I'm feeling while I'm tripping.  I forced myself not to freak out and though I couldn't fully acknowledge it, I remember suddenly understanding that what was going on was all in my head and that comforted me.  Then I said the magic words.",
  "'Sorry guys, I made that so much weirder than it had to be.'",
  "Both A and B understood and told me not to worry about it and immediately the fear and anxiety began to slip away.  It was as if all of a sudden all the pressure was off.  We found a small wooden bridge to smoke on and as we smoked I felt better and better.  The three of us talked about quite a few things and I remember getting a new respect for B as I had never seen her engaged in a deep conversation while tripping.  I was still a bit weirded out but I was nowhere near where I had been before.  It was probably around 11:00 or a bit later by now and we were all clearly starting to come down a bit. ",
  "Then my cell phone rang.  It was a friend of mine offering me mushrooms.  I began ranting about my 'dinging box' and how much I wanted to throw it into the river.  It was at this point that the dying trip began to swerve back to the way my usual mushrooms trips are in which I see everything as hysterically absurd and senseless.  Suddenly I was happy again.  After awhile of moping around and ranting and having a surprise run in with a very odd person from the area I felt great.  I even went back to the party later that night after I had totally come down and had some beers and looked at everything with a new understanding.",
  "This trip was the hardest I've had in my life.  I did not overdose nor did I have any run ins with the law nor did anything all that horrible happen.  However, I was engaged in a hard struggle in my head and I came out on top.  Despite a constant urge to let myself totally freak out I managed to stay in control.  It taught me that I am strong enough to handle being totally overcome psychologically and still come out ok.  The truth is this trip could've gone very bad but I didn't let it.  I also realized the value of my close friends like A and B who, even though I doubt they realize it, did an excellent job to keep me grounded.  To this day, despite talking to people about it, no one I interracted with that night understands the true state I was in.  This just goes to show potential trippers and veterans alike to always remember the true force of the drug isn't what you see or what you do, it's what goes on in your head.  Also, a Bad Trip is not something that randomly manifests, it happens if you let it happen.  Even a relatively small dose like this took me down a difficult road.",
  "The nature of this trip changed the general nature of my trips that came after.  They no longer feel as innocent as they did a couple years ago.  They have become much more introspective and subjective.  They're becoming less about what I see and feel and more about what I see and feel imply.  For example tripping a few weeks after this incident I actually saw my soul, which led to a whole new series of questions, but that's another story.  Good luck everyone and remember, when things start to go bad, you're probably making things weider than they have to be."
 ],
 "erowid": {
  "id": "25496",
  "citation": " Nitrojunkie. \"Making Things Weirder Than They Had to Be: experience with Mushrooms, Alcohol & Cannabis (ID 25496)\". Erowid.org. May 21, 2007. erowid.org/exp/25496",
  "substance": "Mushrooms, Alcohol & Cannabis",
  "views": "2548"
 }
}
