{
 "id": 19468,
 "title": "A Word of Caution",
 "date": {
  "submission": "2003-07-24T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "AP&RP",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "smoked",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>A brief background is in order:",
  "Two adult males, weighing 150 and 195, with extensive experience in personal research of psychoactive materials.  The intent of this experiment was to determine the availability of smoked 2-C-T-2, if any.  Pleasant results were found with 25-30mg orally, and this data was used to estimate the necessary quantity to be smoked, as well as information provided by a few well known researchers and websites.  The hypothesis was that 10mg smoked would either have no effect or minimal effect.  This was not the case.",
  "10mg was weighed out and placed into clean metal pipes.  To ensure vaporization, a torch lighter was used.  The events that followed were neither expected nor desirable, though it was an education, to say the least.",
  "Effects were felt immediately.  The substance tasted much like old popcorn, disproving our idea that nothing could possibly taste worse than 5-MeO-DMT.  The onset of visuals, which, again, occurred within 10 seconds of exhaling, was accompanied by motion sickness induced nausea, disorientation, and surprise.  While a hallucinogenic state was apparent, its sudden nature allowed for no amount of integration.  The prevalent notion was one of toxicity, with some degree of panic.  Personally, I was kept calm by making mental reference to my experience with an excessive amount of harmaline, which was amazingly familiar.  This intensity lasted 15 minutes, depleting only slowly over the next 45 minutes.  We sat motionless, considering our error and our luck- how many people get to make this type of mistake without consequence? At the end of the hour, the nausea persisted, visuals remained, but all was generally well.  Better, for sure.  We never reached a state of mind indicative of phenethylamine ingestion, rather the effects were wholly physiological, tapering quickly after the first hour.",
  "Acid reflux was apparent for the remainder of the evening, as well as loss of appetite, and occasional allergy symptoms.  Readers of this report should take into account the fact that it is a compilation of data reported by two experimenters with very different physical makeup.  We feel it safe to say that we both had a very similar experience, that this method will not be repeated, and that this method will be recommended to no one.</p>"
 ],
 "erowid": {
  "id": "25527",
  "citation": " AP&RP. \"A Word of Caution: experience with 2-C-T-2 (ID 25527)\". Erowid.org. Jul 24, 2003. erowid.org/exp/25527",
  "substance": "2-C-T-2",
  "views": "18152"
 }
}
