{
 "title": "My Mind Wandered All Over the Place",
 "author": "Misty",
 "citation": " Misty. \"My Mind Wandered All Over the Place: experience with H.B. Woodrose (ID 19461)\". Erowid.org. Dec 8, 2002. erowid.org/exp/19461",
 "substance": "H.B. Woodrose",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "15 seeds",
  "oral",
  "H.B. Woodrose",
  "(tea)"
 ],
 "report": "<p>I just woke up from a horrible night.</p><p>I had bought 300 HBWR seeds direct from hawaii. First time I took 10, and it was great. What I did not know is that there seems to be a long period of tolerance. A friend of mine tried 2 days after, and nothing happened, except getting sick. I tried 2 weeks later thinking that would be long enough.</p><p>I decided to try a different method, and instead of eating the seeds straight, I ground them in the coffee grinder and put it in applesauce and swallowed the gunk. I peeled/scraped the seeds very,very throroughly, not only the bark but the white film that covers the whole seed. I peeled 15 of these.</p><p>Very soon after ingestion, a few minutes, I felt the dull uncomfortableness in my stomache. When I ate the seeds straight it took much longer for this part, as opposed to grinding them.</p><p>I became more aware of my environment. After quite a few hours I saw visual patterns that were barely there, but they were there. I had a body trip and some slight mind wandering but in overall I didnt trip good. I have never been more sick and I vomited 3 or so times. I could not get comfortable in bed and kept squirming and finally passed out.</p><p>For anyone who is interested on what the trip is like, the first time when I took 10, was very visual, lots of patterning. I was very creative and my mind wandered all over the place. There is a body trip which is soemwhat uncomfortable. I was very giddy and something would excited me very easily, and excitment created this wave of chills all over my body. Its a nice trip. =)</p><p>HBWR is a nice trip if you dont mind vomiting. But there is tolerance. Remember that HBWR is NOT a cheap alternative to psychedelic drugs, it IS a psychedelic. Treat it with respect.</p>",
 "year": "2002",
 "id": "19461",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-12-08T08:00:00.000Z",
 "views": "14957",
 "dose": {}
}
