{
 "id": 19464,
 "title": "A Midnight Travelogue",
 "date": {
  "submission": "2006-04-10T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jo LP",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "12",
    "unit": "leaves"
   },
   "administration": "buccal",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "12:50 AM",
  "Not in a great mood now, but Ill try it (Salvia Divinorum) anyway. Somehow, the time feels right.",
  "I sit on the computer room floor, set the light on dim and let the music (Peace of Mind, Windham Hill) play softly. My mood soon improves. I watch the clock on the computer screen.",
  "I chew an eight-leaf quid sweetened with honey. Garrgh,--its still unpleasantly bitter, but bearable. I chew, keep the quid and spittle under my tongue, and chew again.",
  "1:05",
  "Somethings clearly not 'normal', though cant say exactly what. Now I know Im not a Salvia hardhead. I fight the bitterness and bulk in my mouth that's bulging from the spittle and leaf pieces.",
  "1:10",
  "Too soon to spit the quid out, so I struggle to keep it in. Eyes feel heavy. They close and in my minds eye, a dove-this ones light gray or silver, not white. I flow into the dove's body which in turn flows into a jet plane's body and begins to takes off. Musics now Prelude in C with Ave Maria from the Well-Tempered Clavier.  An angelic voice tells me to forget about the quid in my mouth and catch this plane. I remember to spit the quid out on the plate. I take the second quid (four leaves), but now it's become hard to chew the right way. Shouldve used just one big quid.",
  "I think of the Salvia leaves in my mouth. Eyes closed, I see a wall of green foliage. A crack in the wall assumes the shape of a pair of scissors. The 'Salvia leaf scissors' cuts across, and the wall opens up like a zipper. (Sally cutting through the veil of illusion?)",
  "1:20?",
  "Time to expel the second quid. But my body turns into wood  first feet, then legs, chest, face. Like Ive become some kind of human-shaped cabinet. Not a finished cabinet, though-branches and leaves sprout from the feet.",
  "Quid wont come out! Face feels like its been fused into a wooden wall. Couldve been start of real bad trip, but effect seems more interesting than terrifying.  (I guess since Im chewing instead of smoking, I never completely lose sense of time and self.)",
  "My life as a piece of furnitures soon over. 'Back to normal again,' I sigh. Thankfully, Im able to spit the quid out. Part of the gross stuff spills on my shirt, but at least the carpet's been spared.",
  "Somehow manage to remove shirt. Tell myself this trip's over.",
  "Try to stand but can't. Some kind of super-gravitys pinning me to the floor. Im lying sideways, unable to move.",
  "Then I lose my body. Fully conscious, I fuse into a verdant countryside of rolling hills and tall pines. I see a cross section of the landscape-blue sky, leaves and massive trunks, the topsoil and humus, and I'm lying underneath, face down, while the roots of great trees sprout from my back. The metamorphosis and immobility aren't frightening at all, but appear as the most natural things. Douglas Spotted Eagles Dieshu is playing-a beautiful plaintive piece with the Native American flute. It sounds like a dirge filled with joy. Ive died and merged with the Earth. Its such a wonderful release....",
  "And a vision of eternal life. Ive become pure soul, but its not my soul, since the me has completely vanished. Some kind of Universal Soul. Its a vision I see and actually feel: theres only one life being lived in the universe, and everything-inanimate objects, plants, animals-are inseparably joined to the Great Organism. Its so peaceful and final. I'm not happy or sad, and just accept it all.",
  "1:40",
  "Peak of the experience is over. Id like to 'declare' the trip over, but one thing still doesn't look right. A strange silvery glow on my computers exterior. There's a miniature night sky inside my humble machine-a hole or portal into another universe. I gaze for a few minutes at this apparition, shake my head, and then tell myself I've returned. But the night sky persists for a while.",
  "1:50",
  "I crawl back into the armchair and start writing up this report while details are still fresh. So much has happened in just a few minutes. The most beautiful visions Ive seen, and some of the strangest.",
  "Visions Id like to remember on the day that I die. But right now I'm more stunned than awed.",
  "Then slowly, it all comes back: the full weight of it. An overwhelming awe. There'll be much to sort out till the next encounter with Ska Pastora."
 ],
 "erowid": {
  "id": "25506",
  "citation": " Jo LP. \"A Midnight Travelogue: experience with Salvia divinorum (ID 25506)\". Erowid.org. Apr 10, 2006. erowid.org/exp/25506",
  "substance": "Salvia divinorum",
  "views": "13479"
 }
}
