{
 "id": 19475,
 "title": "The Blissful Vampire",
 "date": {
  "submission": "2003-12-22T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Camel",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "33 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "My friend A. had returned for the summer from school in portland, bearing with her 100 mg of AMT dissolved in water, for easier dosing without a digital scale.  Well, the AMT sat around most of the summer waiting for us, and finally an opportunity arose in the hot middle of August.  Three of us, A., myself, and K. held our noses and ingested it with cranberry juice mid-afternoon, around three o'clock, and settled in for an afternoon of gravity bong hits of low-grade bush weed compliments of a dry season. ",
  "Right now, I would like to warn anyone considering taking AMT orally in either loose-powder form or dissolved in liquid that AMT is quite possibly the most foul thing I have ever tasted in my life.  Shit-grown cubes taste like chocolate bonbons compared to this stuff. ",
  "None of us even began to feel anything until well over the one-hour mark, and I didn't feel anything at all until about two hours had passed.  An hour and a half after ingestion, K. (who was feeling nothing but nausea) returned from the bathroom, face flushed, and said that as soon as she vomited, it started to hit her. In the evening, as the sunlight began to fade, the three of us were all in the thrall of this strange drug, and as darkness truly fell, we kept the light levels in the room we occupied very low.  The sober (stoned) person who we had been with the whole time, and the other sober (stoned) friends who visited at night remarked that we were like vampires, shrinking from bright light and wearing dark grins on our faces.  Well, sure, and after they said it I began to feel it. ",
  "In the beginning of the summer, when A. was telling us about this substance she had brought with her, she told us a little about its history.  Apparently it was used in the 60s by as an anti-depressant in the soviet union.  She nicknamed it the 'happy communist drug.'",
  "As the stuff kicked in, her words returned to me, and the sensations I was experiencing made me think about its origins.  I felt mildly euphoric, mildly speedy, had pretty good clarity of mind and I lacked any of the mild to moderate paranoia I have come to associate with other psychadelics.  And everything developed a mildly pink tint.  (Drugs have colors, I think- p. cubensis makes me see yellow)  I also developed jaw clench, but for the most part, it was pretty manageable.",
  "Quite an interesting trip, and extremely long at that.  Most of it was very pleasant, but during the second half of the trip I developed a whopper of a headache that ruined the last third of the trip.  What the headache came from I can't be sure, but I can see five possibilities: the AMT itself, the jaw clench, the really shitty pot we were smoking (I suspect this is the culprit), my dilated pupils, or dehydration.",
  "In the wee hours of the morning, twelve-fifteen hours after our initial ingestion, we all tried to get some sleep (at which I was unsuccessful until eight or nine o'clock that morning).  After I'd slept it off, I awoke with relatively few side effects; it felt like a mild acid hangover.  And that was my night with AMT."
 ],
 "erowid": {
  "id": "25548",
  "citation": " Camel. \"The Blissful Vampire: experience with AMT & Cannabis (ID 25548)\". Erowid.org. Dec 22, 2003. erowid.org/exp/25548",
  "substance": "AMT & Cannabis",
  "views": "10910"
 }
}
