{
 "title": "Adracadabrafinil",
 "author": "Guy From Weggies",
 "citation": " Guy From Weggies. \"Adracadabrafinil: experience with Adrafinil (ID 19470)\". Erowid.org. Jun 30, 2003. erowid.org/exp/19470",
 "substance": "Adrafinil",
 "bodyweight": "190 lb",
 "report": "<p>I Live in a place up north, our winters are fun. Almost every drugs effects are intensified in the winter. Adrafinil, is one of them. Sometimes in the summer with the heat here it has little effect. This trip report comes from a time before xmas 2001. Its not one specific trip, like paintings, all are different. Also like paintings there is a science of getting paint on canvas. Its done a certain way no matter what the picture will be. Drug trips are the same. They have a base pattern its up to us or us letting the drug decide where we go.</p><p>I discovered nootropics in an effort to regain mental capacity after overdosing on some nasty nerve pills. Needless to say, you never lose mental capacity only the awareness of it. (hehe)</p><p>Ok, so I have alot of these pills left, I know what they do. Depending on my mood they enhance the state of mind I CHOOSE to be in.  If I wanna have lots of energy it will help mentally charge me so my emotional energy will determine my physical. (the next day I can feel really drained or bogged down. at times sketchy it dependant on my diet. Like pot, booze etc.. if youre dumb  you eat dumb have dumb trips do dumb things....)  Same goes for if I want to be depressed.....</p><p>It is the only drug that makes my pupils change diameter like crazy (each eye pupil can be a different size) It fluctuates intensely (my mind is way more active...) Ive noticed the shape can change (mine at least) pupils are circular Ive seen mine change to odd shapes depending on what Im thinking. No major cat eyes :) a little, even squarish. the muscles are being trained (so I tell myself. ) Like in Neuro linguistic programing. where your eyes point do indicate what part of your mind your going to. The size of your pupils and shape do indicate something about what or how your thinking.</p><p>These eye movements (I believe) allow my vision to improve of course its eye exersice... At the time when the drug is in my system these movements can indicate the layers in my thoughts. Like mushrooms when I make connections between different ideas or thoughts or events the layers of thought are similar. To me its like if I can physically see with more depth I can think with more depth because my imagination will also have more depth. (everyones different this is me, my life experience makes me think about things differently than yours)</p><p>I am able to learn quicker. because my powers of association are stronger so I can make sense out of information I may not be use to.  Visual, kinesthetic, auditory  I transcend the one I am used to using the most and the others come alive in a new way. It is a good time to remember past life events and reframe the way I look at them and myself in them so I may understand the events more thoroughly. Reprogram myself. Whatching an educational video or tv program is awesome!!! the material because associable to my life so what I learn sticks like it belongs. My powers of perception allow me to filter out what unimportance and the core material becomes more noticible.. more interesting.. more alive.</p><p>Programing yourself. Since you can psyche yourself up masively (me I can) it is to be noted that its very COincidental it may be used by military, Because ive brainwashed myself using adrafinil. Its not pretty if used improperly. Sure brainwashing soldiers to believ what theyre doing is right is ok, right? under the guise of a stimulant,, when im tired I reason with myself, I ask that one question ...why?? adrafinil *pop in mouth* it doesnt matter why it right!!!   haha  well If you think positively or neg.. enuff about a subject or an idea it can overpower your sense or reasoning proportional to wich way you want to take the idea or subject.   beliefs become truths. Its difficult to describe if you do it to yourself when you 'come down' youll be ok.. whoa  that was wierd I was getting a little too pumped, I was psyching myself out. ok, im fine.   YET if its someone else is leading your mind in a certain direction of thought you may willing give in and im note sure how youre reasoning will help when you come down.</p><p>Ive given this stuff out to friends, some reported great benefits. others bad things proportional to thier state of mind. (dont give an unhappy self destrustive person Exstacy.. right? ) it can backfire on me. my one firend started thinking too much about problems the problems became bigger as the layers of thought got deeper. he was ok in the end but without a friend being there (he told me) he thinks we woulda hurt himself more than he almost did.</p><p>This report isnt complete. Itll give an idea of what Ive went though so you will have that knowledge prior to any of your own undertakings with adrafinil.  Ive done combinations and pot is the safest and can enhance my experience. (to smoke with a purpose is awesome and super beneficial, to smoke just to get high and not have the frame of mind to learn anything will only hurt you.)</p>",
 "year": "2001",
 "id": "19470",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-30T07:00:00.000Z",
 "views": "15686",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Adrafinil",
   "form": "(pill / tablet)"
  }
 }
}
