{
 "title": "I Saw the Little People",
 "author": "Space Cowboy",
 "citation": " Space Cowboy. \"I Saw the Little People: experience with Salvia divinorum (ID 19480)\". Erowid.org. Nov 29, 2005. erowid.org/exp/19480",
 "substance": "Salvia divinorum",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(dried)",
   "",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(dried)",
   "",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "report": "<p>I ordered one gram of the Enhanced Leaf from a reputable vendor, and shared it with 2 other people one night, and we all had positive experiences, so I decided to order more, this time 2 grams.</p><p>First off, I was in the back bedroom with my friend and his girlfriend who were smoking pot, but they wouldnt smoke Sally D. I cant smoke pot, because my work pee-tests me, so I decided to take one hit of Sally D while they were smoking. I put in one -very- small pinch of the stuff, and with the first hit immediately my skin got hot and clammy, but no mental effect. I finished the pinch off with the second maybe half-hit, and the full experience set in. The backlight of the room changed color, and I saw some barely perceptible, funny looking cell-like patterns on the wall, I had a sensation of vibration in my face and chin, even though I was still. It was kind of overwhelming, but I wasn't acting wierd, so my friends just kept on talking to me like nothing was happening. I could hear and understand them, but it just seemed like what they were saying was plastic, just total bullshit, you know. And these are people I trust implicitly. Here I was in the middle of this profound experience, listening to utter bullshit, and then I got scared inside, like they would know what I was feeling and somehow think that was wrong. I just wanted to be away from there, to be alone, because I knew they were not a part of this thing happening to me. And then it vanished, and everything was ok.</p><p>Later, I wanted to do it again by myself. So, I was by myself in the living room with the lights dimmed at the computer desk, and my friend and his girlfriend were in the back bedroom watching TV and falling to sleep. I packed a slightly bigger pinch than before, smoked one hit, and I got the same fiery, sweaty skin effect. Then I smoked my second -really stiff- hit, and the vibrations in my chin and face came back. The fractal desktop on my wallpaper began to wave and pulse slightly, like the screen was a membrane, and the pressure from my side was pushing in on it, stretching it or something.. As it stretched, the fractal patterns became what looked like (and I swear, this is no shit..) long strands of paper dolls like you can cut so they are attached at the hands. As I got drawn closer in, the dolls resolved into little mexican people, in colorful blanket-like ponchos with colorful patterns weaved into them, and some were wearing mexican hats. I could see them turning their heads and talking to each other, at once to the guy on the right, then to the guy on the left, and it was like the sound of the TV down the hall became their woices.</p><p>There were thousands of them, joining hands, and they made up what used to be the background of visual reality. It was like the sound of a coctail party. They were laughing and saying things like, 'look whose coming', and 'we've got him in here now', and 'here he comes'... shit like that. They kept getting bigger and bigger, and they wanted me with them, and it was unnerving, and seemed very real. Anyways, as the effect of the hit faded, the pressure of the membrane became less and less stretched, and it eventually the strings of little people fused together and formed the computer desktop once again.</p><p>At this point, I was unnerved, but I figured 'what the fuck, I only have one more hit to go', so I torched that last hit and held it as long as I could. As I did, I faded back into the same hallucination. The background dissolved into the paper dolls, which became the mexican people as I moved closer and closer, and I could hear the din of their voices, and they were saying things like.. 'HA! I can't believe he came back, of his own free will..', and stuff. Only this time they didnt stay far away and little, like before. This time the membrane was stretched so far that it felt like reality was going to break, and between the lines of the little people holding each others' hands, there was this blackness, this.. black rift in space, and it felt like it was sucking me into it, between the rows of mexican people. I was scared. I did not want to go in there. But I kept falling in. As I fell, they got bigger and bigger. Until all of a sudden, I stopped falling, and one of their faces grew HUGE, and I was immediately nose-to-nose with one of the little people. It was a mexican guy with a mustache and a sombrero, and colorful poncho, only he was mean. He frowned and said.. 'What are YOU doing here !?!' .</p><p>I did not respond, but was scared shitless. Then he said 'YOU don't BELONG here!', and he shrung back into the row of little people, who began receeding into the background, and eventually fused to form my familiar reality.</p><p>The next day I gave the rest of my Salvia away.</p><p>I have to say that of all the shit Ive done, Ive never been afraid. Ive always felt that I could control whatever I was taking. Salvia whips me around like a fucking wuss-baby, and the visions I've had using it are EXTREMELY REALISTIC. I'm a very rational person, and I know it was a hallucination, but emotionally, It felt real at the time, and my emotional memory of it was that the fear was real.</p><p>Good luck experimenting, and God Bless. Look out for yourself, and each other.</p>",
 "year": "2002",
 "id": "19480",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-29T08:00:00.000Z",
 "views": "6821",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ]
}
