{
 "id": 19490,
 "title": "Not Changed Forever?",
 "date": {
  "submission": "2006-02-23T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Opiates",
   "form": "(daily)"
  }
 ],
 "report": [
  "This is sort of a follow up... I'm writing back because I've learned a lot more since Am I Really Changed Forever?.  First of all, it has been over a year and a half since 'quitting' crack, and over a year since my last relapse.  I can easily talk, joke, or think about crack without wanting it... which is a good thing.  I also quit smoking cigarettes, which I find, no matter what anyone says, easier than quitting crack.  I've also completely avoided ecstacy.  I'm now going through the oxycontin/heroin thing (I just don't learn), and am up writing this because I can't sleep due to withdrawal.  Not only does it suck but I'm doing it for the umpteenth time.  It started as sniffing (just as my previous experience with heroin went) oxycontins weekly to bi-weekly to daily, and for two months now I have been shooting up daily.  Why would I do that (coke didn't get me but crack did, and shooting provides the opioid analogy to smoking crack)?  I couldn't resist the temptation to cure my curiosity.  I keep quitting and then doing it again which immediately results in daily use to delay the inevitable withdrawals of my inevitable need to quit.  Whereas coke is always a want seeming like a need, opioids are a want that turns into a need.",
  "What makes oxy and dope so addictive is the quality of the high and the lack of an immediate punishment.  Whereas crack is a five minute rush followed by a 'cracked out' feeling, opiates feel great for hours at a time.  I wanted to quit crack and for a while, couldn't, but only my dreams and aspirations for the future can convince me I need to quit oxycontin/heroin.  For the past four months I've been in a state of constant opiate withdrawal, and even when I get all the way through it, I set myself up to do it again.  Also, I'm learning that the nasty part of the withdrawal lasts longer with oxycodone than with heroin.",
  "One last thing I'd like to say (it's late and I need to try to sleep some again), is I try not to fill myself with fluids when using.  My bladder was once so full I was in PAIN but couldn't urinate DUE TO MORPHINE, which if you think about, is really not a good thing."
 ],
 "erowid": {
  "id": "25607",
  "citation": " Anonymous. \"Not Changed Forever?: experience with Oxycodone & Heroin (ID 25607)\". Erowid.org. Feb 23, 2006. erowid.org/exp/25607",
  "substance": "Oxycodone & Heroin",
  "views": "14933"
 }
}
