{
 "id": 19491,
 "title": "Extraction Process",
 "date": {
  "submission": "2007-01-12T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "ChemistK",
  "gender": "Male",
  "weight": ""
 },
 "dose": [],
 "report": [
  "<p>There are a lot of negative or 'nothing is happening' reports about kava-kava on this site, which I feel is doing the substance no justice.  Therefore I will share my positive experiences with you.  Most of you who say this have either tried that liquid extract they're at the herbal stores, which in my experience also only works weakly at best, or consuming the ground-up root in some way.  The second way has never failed to produce effects for me, but whatever way you look at it, the taste is just not very appealing. ",
  "You can however extract the kavalactones very easily using acetone.  Ground up 2 or three ounces of dried kava-root to the finest consistency you can achieve.  Put the kava powder in a TALL bottle, like an empty Vodka bottle or something.  Pour in about 2/3 Quarts of acetone, close the bottle and let stand for 15 minutes, shaking occasionally for better mixing.  Then let stand for 5 minutes.  Here is the trick:  All the kava powder will setlle on the bottom, thats why a tall bottle is best.  Pour off the clear acetone from the top and repeat twice more.",
  "You will now have collected half a gallon of acetone, about 1 Dollars worth, which contains the kavalacontes.  If you have lab-equipment boil off using your vacuum pump, if not, find a shallow dish with as much surface area as possible and let stand a few day till the acetone is evaporated.  Maybe point a fan at it.  In the dish there be will then be a thick syrup, maple to rust brown in color, with a very numbing effect if put in mouth.  This stuff is quite fun to smoke because of the numbness and has a very gentle/relaxing effect, well worth the effort.</p>"
 ],
 "erowid": {
  "id": "25609",
  "citation": " ChemistK. \"Extraction Process: experience with Kava (ID 25609)\". Erowid.org. Jan 12, 2007. erowid.org/exp/25609",
  "substance": "Kava",
  "views": "8635"
 }
}
