{
 "id": 19510,
 "title": "It's Powerful, But Not Necessarily Enjoyable",
 "date": {
  "submission": "2007-10-14T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Blackdove",
  "gender": "Female",
  "weight": "123 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  {
   "time": "4:00",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I have experimented with many drugs in my time, but have kind of calmed down a bit as I'm older and (sopposidly) wiser, and I'm married now to a wonderful man who isn't into the drug scene and never has been. But I must confess, that I have never compleatly lost the urge to expand my mind through chemicals, and still occasionally smoke pot, which my husband has no real problem with. I stumbled upon nutmeg by chance one day, looking for information on mushrooms. This is one drug I have never tried, just have never been in the right place at the right time. But I thought I might find some information on identifying them in the wild. After reading the information online, however, I decided against mushrooms, since it seems a difficult feat to identify the good ones from the toxic ones. I proceeded to browse and was surprised to see nutmeg listed as a hallucingenic drug. After reading the reports on it, I decided it might be worth trying. It was, after all legal.",
  "I have since done nutmeg probably half a dozen times. The first few times were with preground nutmeg I had had in the house for quite some time. The effects were stong, but also enjoyable.It was very similar to a pot buzz, but of course it takes about four hours to kick in and lasts for about 13. I found it extreamly enjoyable, however, and suffered no negative effects from it. I decide to then try fresh ground nutmeg, and it was then that my experiances begain to change. It wasn't that the fresh nutmeg was any more potent, but it was just all around negative. I just felt gross.I felt like I had the flu, and I was irritable and impatient. I then, decided to try preground nutmeg again, and this is where I will describe my experiance in more detail, as it was just a couple nights ago.",
  "I hadn't planned on doing nutmeg again, but I was bored and decided to give it one last whirl. I took it around 1:00 pm on a Saturday afternoon. I went about my normal business, as it always takes about 4 or 5 hours to kick in. My husband got home around four thirty or so, just as I was starting to feel a little buzzed. He had the idea to go have appetizers and drinks at a pub. I was a little hesitant, but not feeling too badly, so I agreed. I really wanted to spend time with him too, because we've been apart so much lately with work and all. And so he drove us to this bar, which is about half an hour a way (we live in the boonies). On the way there I began to really feel the effects, and I started to get anxious but I tried to focus on the scenery and not my growing feeling of unease.",
  "By the time we got to the pub I was tripping pretty hard. I never hallucinate on nutmeg, but everything gets very heavy, and things do get a little distorted visually. So, we sat down, and I ordered a stawberry/mango marguarita which was yummy, and gave me something to ease my dry mouth. My eyes were getting dry too, and my contacts kept sticking to them. It was an OK evening, but I was incredably screwed up and pyranoid, trying not to turn my head at all the bits and pieces of conversations I kept hearing. My hearing definitely improves with nutmeg, but not as much as acid. I ended up having 2 drinks, which screwed me up even more. But my husband didn't seem suspicious and he was busy alot of the time playing the trivia game they have on the tvs there. So we were able to just sit and relax, which made it semi-easier.",
  "I had told my husband earlier that I wanted to go into to Petco to look around. I love animals. So he took me there after we left the resteraunt. I had my sunglasses on now, so felt a little better. I went into Petco, while he ran an errand, and was compleatly overwhelmed by the sounds and lights inside, but managed to walk around and look at everything. I heard the sound of birds singing in the bird room, and decided to go in and see the birds.I love birds. It was late afternoon, so they were singing like crazy. They had some really beautiful ones. There was a beautiful red bird, with rainbow colours. There were yellow and orange canaries. There was a cockateil sitting on a perch, crouched down, and singing a very haunting tune that drowned out all the other birds and made the hair on my neck stand up. It sung this over and over, louder and louder, until it finally stopped. That was a very strange experiance, because I was in an enclosed room with all these birds. I enjoyed it, though, even the freaky cockateil song!",
  "I then went outside and my husband was back so we went home. I felt like I was lost in waves of seasickness the whole ride there. I went to bed after I got home, feeling extreamly lethargic, nausious and just plain crappy.",
  "Nutmeg is a very powerful drug, but not always positve. It may be that this is a drug meant only to be used very infrequently, because it was more enjoyable the first few times I did it. But I really doubt I will use it again, infrequent or not. My last few experiances have just been too unpleasent. Alcohol, by the way, does not improve the nutmeg experiance, at least in my case."
 ],
 "erowid": {
  "id": "25672",
  "citation": " Blackdove. \"It's Powerful, But Not Necessarily Enjoyable: experience with Nutmeg & Alcohol (ID 25672)\". Erowid.org. Oct 14, 2007. erowid.org/exp/25672",
  "substance": "Nutmeg & Alcohol",
  "views": "9378"
 }
}
