{
 "id": 19512,
 "title": "Amphetamine-Induced Psychosis",
 "date": {
  "submission": "2001-10-08T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Lenore",
  "gender": "Female",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "350 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": "32:00",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "39:00",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I was at a 3-day rave and had been taking mainly Adderral and Dexedrine to stay awake (Adderral = 75% dextroamphetamine, 25% amphetamine and Dexedrine = 100% dextroamphetamine), which probably contributed to this.  Over the course of Friday 9pm to Sunday 5am, I probably had about 350 mg combined.  By that time I had still not gone into sleep deprivation hallucinations, and my tolerance is such that it was not an unusually high amount.  Dextroamphetamine is also only 2/3 as powerful, due to metabolization, as methamphetamine.  Sunday at 5am I took one half of the quarter orally, and I took the other half at noon.  Because it was oral, my tolerance, and the amount taken in the weekend, it was not a particularly strong rush.  I began to experience sleep deprivation hallucinations around the time of my second dose, which are normal for staying awake for that duration of time.",
  "I got home and at around 9pm I suddenly started to get paranoid and experience severe hallucinations.  They were unlike any hallucinogenic substance I have ever taken.  Instead of morphing into existence or even having the objects distort or morph after I saw them, they appeared as if in real life.  I knew that they were not real, but was still extremely afraid.  I mostly saw people out of my window or down my hallway, and insects crawling out from underneath doors.  All of them were very frightening and were caming towards me.  Brightly lit, enclosed areas helped to alleviate the hallucinations, as well as familiar activities and objects.  I finally slept for a few hours, and the next day I saw a few hallucinations in the dark, and the hallucinations disappeared after the next night.",
  "I remained extremely paranoid, especially when riding in cars, for the next week.  The day after the experience, I had to ride in a car, and took an anti-anxiety medication to keep myself from practically having a heart attack.  My breathing rate was elevated and my heart rate remained elevated to 100-120 beats per minute, when it is usually 60-70 beats per minute for the next 4 days.  I also was very irritable and felt very shaky, from meth withdrawal, although the experience of the weekend left me not craving it for the following week.  I abstained from amphetamines for the 2 weeks following, and the 2nd week was very unpleasant due to strong amphetamine cravings."
 ],
 "erowid": {
  "id": "2569",
  "citation": " Lenore. \"Amphetamine-Induced Psychosis: experience with Methamphetamine & Amphetamine (ID 2569)\". Erowid.org. Oct 8, 2001. erowid.org/exp/2569",
  "substance": "Methamphetamine & Amphetamine",
  "views": "59080"
 }
}
