{
 "id": 19522,
 "title": "Negotiating Detox",
 "date": {
  "submission": "2003-08-01T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Marmaduke",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine"
  },
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Pseudoephedrine"
  }
 ],
 "report": [
  "Cocaine is high stakes.  Okay, we've all heard this before.  However, if one is able to apply a level of control, blow really is NOT the f**king devil.  If a person uses it to escape, they are taunting the WRONG bulldog.  Believe me, I've seen a lot of people fall to this pattern.  No joke.",
  "However, if one can understand their relationship to cocaine in an objective sense and maintain a level of moderation, it can be relatively safe and a LOT of fun.",
  "What goes up must come down.  The detox ('crash') of the experience can be REALLY awful.  The basic idea is that as the level of cocaine in your system fades, temperature rises, and sinuses become real congested and hurt like crazy.  Depending on the dosage and duration of the high, a person may feel like you have a terrible flu, an awful fever AND an excruciating sinus headache all at once for an hour or two before they can get any sleep. ",
  "Pseudophedrine Hydrochloride (Sudafed) is designed to combat three symptoms: Fever, sinus pain, and nasal congestion. This stuff is custom designed for these needs.  Most brands also include ibuprofen, which in conjunction is very effective.",
  "Bottom line:  When I run out of blow, I take 2-3 non-drowsy Sudafed immediately.  The pseudophedrine provides a bit of lift as the cocaine fades, and the reduction of fever keeps body temperature regulated.  The ibuprofen is quite effective at combating the sinus pain, and the result is a slow, painless decline.  I have found the generic brands to be just as effective, and cheaper too.  ***This is not a reccomendation to f**k with blow.***  Not everyone has the self control for it.  Don't bullshit yourself.  If you have addictive tendancies dont do it. But if you can manage it believe me, when you crash, a box of sudafed is worth FAR more than the $5 you paid for it at the grocery store."
 ],
 "erowid": {
  "id": "25722",
  "citation": " Marmaduke. \"Negotiating Detox: experience with Cocaine & Pseudoephedrine (ID 25722)\". Erowid.org. Aug 1, 2003. erowid.org/exp/25722",
  "substance": "Cocaine & Pseudoephedrine",
  "views": "54190"
 }
}
