{
 "id": 19527,
 "title": "The Rise and Fall of the Snapdragon",
 "date": {
  "submission": "2006-09-12T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ryan",
  "gender": "Male",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "seeds",
    "quantity": "317"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Ok it all started around 9 oclock, my dad was home, and after work I had rushed to the store and picked up 6 packs of morning glory, heavenly blue.  This was my last day of freedom before I was to be exiled into Rehab. ",
  "Since my dad was home, I took a bath and washed off the seeds, crushed them with my teeth and swallowed them...  An hour later nothing was really happening besides a blue haze which lingered all around me.  I was on the computer and there was a picture of Adam Sandler on the monitor,  I gazed at it long and Hard and all of a sudden his head appeared to melt off of his shoulders.  My trip thus had begun. ",
  "I decided to get off the computer and go lie down.  I went upstairs and laid on my air mattress.  It felt as if I was being sucked into the Mattress, it was quite a divine feeling.  I turned my sights and set them on the lava lamp that was dancing up and down.  I started questioning myself on how the hell that thing worked and came up with wild theories on how it works but none of them made too much sense.  I decided to take advantage of this feeling and write a story. It's a short story about a page long and it totally gets into my head and can show you what iw as thinking and seeing at the time, it goes like this :",
  "Rays of sun fill the morning spring air near the waterfall, to the right lie the SnapDragon, and about four acres of meadowland glisten in the blanket of morning dew left by the passing night.  The SnapDragon, a celestial being far too complex to be understood by the human mind.  With a link to the higher power it stands as a symbol of great power and integrity.",
  "Seven years, eleven months, twenty-one hours and thirty-six minutes after the passing of lil Johnny Bloom, the SnapDragon arises from the fresh soil laid upon him from the higher power.  After its evergoing journey through the earths outer layer, it smiles with its first taste of sunlight, and asks itself what am I capable of? ",
  "As day turns to night, the snapdragon evolves into a multi-celled being, with tissue and flesh to call its own. It embarks onto a conquest into town, The ritual breeding ground of all evil that lives among each and every persons heart. Its first sight is a woman kneeling beside her home, guilt stricken and sobbing.  Still shaken by her youngests passing.  For she was the one who allowed him to frolic in the meadows shimmering grasses.",
  "The SnapDragon guides its way over to the woman.  Why are you weeping? the SnapDragon asks.  With pearly white hands he grasps her hands, and they embrace.  The woman, sensing the presence of her child is comforted. Come with me the SnapDragon shrugs, and leads her to the meadow.",
  "A pile of sticks mark the spot of the fall of lil Johnny Bloom. Seven years, eleven months, twenty-one hours and thirty-six minutes after being planted, the being blooms into a heavenly glowing blue entity, and grasps the womans arms once again.  With the link of the higher power violently surging through each of the beings, the memory and sights seen by the SnapDragon project in the womans mind.  Lil Johnny Bloom playing in the field.  Ingesting the magical seeds, losing his sanity, for it is the first step toward the never-ending journey through space and time. ",
  "Lying in a puddle of his own blood, lil Johnny Bloom embarks upon his quest. Over time decomposition leaves the boys spirit with nothing to show for, beside the magical seed that hold within the SnapDragon, the seed planted, enter the SnapDragon The SnapDragon with eyes of glass, and hands of ivory behold the magical seed.  Three hundred and seventeen seeds later, the woman reunites with her son, in a compassionate reunion.  The work of the Snapdragon, done for now, drills itself back into the soil, where it will lie for eternity.  ",
  "Nothing could prepare me for the leg cramps however.  Every time I was to stand up I would immediately fall back down in pain, so I laid down incapacitated on my air mattress for hours staring at the lava lamp until I fell asleep. ",
  "All in all it was a wonderful experience but due to the cramps I will never embark upon that journey ever again."
 ],
 "erowid": {
  "id": "25747",
  "citation": " Ryan. \"The Rise and Fall of the Snapdragon: experience with Morning Glory (ID 25747)\". Erowid.org. Sep 12, 2006. erowid.org/exp/25747",
  "substance": "Morning Glory",
  "views": "4229"
 }
}
