{
 "title": "Almost Died",
 "author": "jbrown",
 "citation": " jbrown. \"Almost Died: experience with Methamphetamine (ID 19520)\". Erowid.org. Dec 9, 2002. erowid.org/exp/19520",
 "substance": "Methamphetamine",
 "bodyweight": "145 lb",
 "header": [
  "DOSE: T+ 0:00",
  "200 mg",
  "insufflated",
  "Methamphetamine",
  "(powder / crystals)",
  " T+ 0:45",
  "200 mg",
  "insufflated",
  "Methamphetamine",
  "(powder / crystals)"
 ],
 "report": "<p>Let me start by saying that if you've never done meth before.. I really advise that you don't start because it really does change your life forever, and not in a good way.  If you do... please please please watch your dose and go slooooow (this ain't coke!)</p><p>Before trying crystal meth for the first time six months ago, I really hadn't had much experience with drugs... just the occasional use of pot, mdma, and a few snorts of coke (which I didn't like).  Before taking E, I had read about it extensively, and made a reasonably well educated decision about it.  Why I didn't do that with meth, a much more dangerous substance, I don't really know.</p><p>My first, and unfortunately not last experience, almost ended with me dying right on my couch.  The evening started with a sexual encounter with an acquaintance... who suggested that it would be really fun if we snorted some crystal to liven it up a little bit.  Well, never being particularly adventurous, I decided to go out on a limb.  Big mistake.  After the insanely painful line (that I later found was way too big), I began noticing the effects pretty quickly.  Heightened sensations, tremendous ability to concentrate on whatever I wanted, which was sex at the time.  I started sweating profusely and my heart was beating like crazy, this was awesome!  I felt like some kind of sexual animal... so naturally I wanted some more.  </p><p>So in less than an hour I had snorted about 400 mg. which isn't a lot for a regular user but for someone who hasn't tried it and doesn't even drink coffee.. well, it wasn't pretty.  A few minutes after snorting the rest, I had this pain in my chest and I literally felt my heart start to skip beats.  I tried to concentrate on the sex, which was still really amazing (DAMN!), and not think about what my body was telling me.  Finally the pain started to get bad and I started to worry I was having a heart attack, so we stopped and I sat on the couch for a while. I started getting this tingling sensation in my limbs and my vision was getting spotty, then the really scary part.  I started realizing that I was having difficulty breathing. I tried to call out to the girl I was with but she couldn't hear me.. the words wouldn't come out.  I was pretty sure I was going to die right there on my couch.  The girl I was with had bolted and I sat there for about an hour... it started to get better... but the pain in my chest lasted for several days afterward.  I don't really know how close I came to dying, but I really did feel myself slipping away.. kind of like how the dentist puts me out.</p><p>The crazy part about this story is about a week after this incident, I wanted more!  I stopped thinking about how I almost died and remembered how good the sex was.  I've since tried it two other times and monitored my use a lot more, but after calling in sick to work to uh.. please myself for 18 hours with almost no breaks (ouch, I know)... I can see that it is definitely not good for me. Unlike with E, I haven't learned anything from my experiences with crystal.. in fact, I can barely remember them because it just flew by.  It was fun, don't get me wrong.. but not worth it.  The depression that I went through in the days after it were pretty awful, I entertained several thoughts of suicide, which really isn't like me.  Four months lafter, I still think about it about once a day.  I can definitely see how people get addicted and ruin their lives on this stuff. Be careful.</p>",
 "year": "2002",
 "id": "19520",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-12-09T08:00:00.000Z",
 "views": "32469",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:45",
   "amount": "200 mg",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 }
}
