{
 "id": 19539,
 "title": "I Ate the Cheese Bullet",
 "date": {
  "submission": "2008-05-08T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ellipsis",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I have to share the power of this substance with others so that they don't make the same mistake as me.  I was told when purchasing this that it was DMT.  that's something I've always wanted to try, but from talking to others who tried this batch of chemical, I had strong suspicions that it was actually 5-MeO-DMT.  no one described visuals, they just talked about this incredible rush.  I thought, fuck it, I'll give it a go because I hear 5-MeO-DMT is the ultimate tryptamine experience.  I'm a pretty experienced and happy cosmonaut, so I figured I could not master, but at least survive a potential ++++ if that were to happen. ",
  "One friend and I experimented with the right amounts yesterday afternoon.  we don't own a milligram scale, and the person I got it from told me he gave me about 3-4 hits worth.  our initial experiences were very subtle, yet I could sense the underlying power behind the powder.",
  "We waited until later last night, and I decided to put the rest of it (double my previous dosage) on some ash in between 2 screens, and then keep the lighter at a safe enough distance not to burn it off.  I had been drinking, and probably shouldn't have done it at that point.  I was more concerned that it wouldn't do that much, and I would waste this rare substance on a threshold experience.",
  "Thus, I can estimate it was around 30-40mg of freebase that I inhaled.  my pipe was perhaps a little resonated from the previous attempts.  thus, I'll probably never know the exact amount.  the environment was very comfortable with two close friends watching over me.  I do not remember anything after putting the flame to the pipe.  when I woke up, i saw a totally bewildering scene in front of me.  I was still seated on the couch, but I was covered in my own vomit.  my bead necklace was exploded all over the floor in front of me.  my friends looked exhausted and were happy to see me awake.  as I said, I remember nothing but the pieces are slowly slowly coming back to me as I write this.  nearly everything I know is from their observations:",
  "Instantly after taking the hit, I started talking in an inhuman language.  I stood up, but they sat me back down.  they were intrigued because they thought maybe I was enjoying it.  then, I started to nod off into a coma-like state and they became very concerned.  they helped me to breathe, and made sure my heart was beating.  they found no pulse, but before CPR was induced, my heartbeat came back on its own.  they slapped my face to try and get me to stay with them.  my eyes opened up wide and my pupils were like saucers.  I started wildly running my hands over my face and hair, and they said I looked terrified.  I gripped my necklace and tore it off in an explosion of beads.  while trying to anchor me, I threw up all over myself and my friends and never even lifted my hands to try and contain it.  after only about 10 minutes of this fucking madness, I came to.",
  "I cleaned up myself and the room, and then went to sit down and talk to my friends.  for the next hour or so, I was in a state similar to a high-level acid experience.  however, it was totally unremarkable compared to what I had just gone through.  it quickly faded away over that hour or so.  basically all I recollect is a feeling as I was waking up of having had the most insane dream imaginable.  there was simply no point of reference though in any aspect to describe it.  to say that I did too much is an understatement.  I went light years beyond insanity, and I probably wont ever remember what the experience was like because I overdosed. ",
  "Today, I don't feel like myself.  the world is the same one I've known, but I feel like I'm seeing it with new eyes.  it's going to be okay, but it's fucking bewildering (and great)to be alive again.  I'm just thankful that I didn't go out like that, because it would have been a nightmare for my friends and family.",
  "Because of my amnesia, it was nothing to me, but I have the feeling that I went past the edge of existence.  perhaps in some dream in the distant future, I'll remember some bits and pieces of that blinding moment of absolute nothingness.  I'll let you know if I do.",
  "Stay safe and keep reaching."
 ],
 "erowid": {
  "id": "25813",
  "citation": " Ellipsis. \"I Ate the Cheese Bullet: experience with 5-MeO-DMT (ID 25813)\". Erowid.org. May 8, 2008. erowid.org/exp/25813",
  "substance": "5-MeO-DMT",
  "views": "3612"
 }
}
