{
 "id": 1953,
 "title": "No Effect of Arousal",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Andrew T. Austin",
  "gender": "Male",
  "weight": "84 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 tsp",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "I had high hopes for yohimbe having read numerous favorable reports both on it's mild psychedelic properties and it's enhancement of libido and quality of erection.  I contacted my girlfriend and on account of not having personal experience of the effects, we picked a date whereby we could try it out without worrying about work the next day (we are both hypnotherapists/neurolinguists working in the mental health field).  I was familiar with reports of yohimbe inhibiting sleep, so we at the very least needed to take this into account.",
  "Gauging doses on reports of other users I prepared 12 teaspoons of ground yohimbe by simmering in a pan of water for 10 minutes and leaving to cool.  I then poured the water to give approximate doses of 7 teaspoons for me and 5 teaspoons for my girlfriend (who is of slight build).",
  "We consumed the liquid on empty stomach at approximately 5pm with an expectation of about 2 hours to activation period.  Despite the color and appearance of the liquid it wasn't entirely unpleasant to consume and at 6pm, one hour after consumption, we ate dinner.",
  "At 7pm whilst running a bath I glanced in the mirror and noticed that my eyes were heavily blood shot red and that I had significant facial and neck flushing.  I didn't feel any different and had I not looked into the mirror, I wouldn't have known.  No erection or sexual arousal.  Having heard reports of severe tachycardia, I took my pulse at this point and found no change to its normal baseline.",
  "At 720pm my girlfriend joined me and when I spoke, I noticed a slight giggling effect to my speech.  I quickly achieved erection but its quality was no different from usual.  At around this time I noticed only a very slight kind of 'speedy' effect.  We chatted about various trivia and by about 745pm, my girlfriend commented that my eyes were returning to normal and that the blotching on my face had gone.  She at this point had experienced no noticeable effect at all.",
  "By 8pm, all effects had disappeared and neither sexual arousal nor sexual sensations were affected.",
  "At 9pm we drank some wine and had a couple of beers and went to bed for more sex, but again without any noticeable enhancement.",
  "By 11pm neither of us felt tired and despite having both been up since 5am that day, sleep seemed like an impossibility, so we got up and drank another bottle of wine.  What we both noticed was that the alcohol had little effect and although I had drank equivalent of a bottle of red wine and 3 beers, I didnt feel intoxicated at all. ",
  "Finally at around 120am, over seven hours after consuming the yohimbe we both felt tired enough for sleep.",
  "The following day we both felt fine with no negative effects.",
  "I have since been drinking the yohimbe as a tea each morning, approximately one teaspoon in boiling water and allowed to cool and have noticed a definite increase in energy levels without any other noticeable psychotropic effect.  All in all, despite a definite physiological effect (vaso-dilation) to the blood vessels to the eyes and face, none of the proclaimed psycho-sexual effects were experienced.",
  "Author's Neurology and NLP Site"
 ],
 "erowid": {
  "id": "16438",
  "citation": " Andrew T. Austin. \"No Effect of Arousal: experience with Yohimbe Bark (ID 16438)\". Erowid.org. Feb 10, 2004. erowid.org/exp/16438",
  "substance": "Yohimbe Bark",
  "views": "19039"
 }
}
