{
 "id": 19546,
 "title": "Many Methods",
 "date": {
  "submission": "2003-08-04T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "AP&RP",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:30",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 5:00",
   "amount": "25 mg",
   "administration": "smoked",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>The initial intent of this experiment was to simply continue exploring this particular substance at doses only slightly higher than previous tests.  In the past, 25mg was insufflated at intervals of 15-30 minutes, with the number of times depending on the prevalence of effects. On this occasion we took body weight into account, also considering our past experiences.  I decided to try 25-30mg at a time, myself weighing 150lbs, and RP(at 190) was to insufflate 50mg at a time, repeating until desired effects were achieved.",
  "The set and setting were the same as any of our trips: warmly lit home, a variety of music, multiple areas of refuge, and plenty of liquids.  The drip of insufflated DPT is extraordinarily unpleasant, having the same plastic quality of other tryptamines, but in a much larger quantity.  Hard candy or cough drops successfully counter this discomfort, as well as soda.",
  "This dose would lack the effect of the past encounters, even those at higher amounts.  The DPT revealed itself in its usual manner, but fell before its peak.  30mg produced for me a state of mind very close to a +4, maybe +3.5, filled with intense concepts and the full out of body spectrum.  We hoped RP would reach a similar height as I had previously, as to share our ideas of the experience.  We agreed that there was a very real effect, but it was far from immersion.",
  "It is for this reason we stepped out of our role as researchers and sought to fulfill human curiosity.  We waited a couple of hours, to be certain that there would be no delayed peak, and then ingested 50mg a piece.  We aimed low, considering the fact that we both never attempted this method and, while neither of us were feeling any strong effect, we were not fully baseline.  Plus, in our adventures as psychonauts, neither of us have been particularly ballsy.",
  "Unfortunately, this was not enough.  Had we only taken the 50mg orally, I imagine it would have produced a comfortable +1, but nothing more.  It didn?t add to the effects of the insufflated quantity, nor did it take away.  It was simply okay.  I did note that I would not waste this amount again, and I am generally honest in my note taking.",
  "And so, some time later, after careful consideration, some quantity was to be smoked.  Reports listed anywhere from 25-250 mg, and, in order to error on the side of caution(again), we went with the lowest dosage.  We would smoke 25mg nearly five hours after the insufflation.",
  "Our persistence paid off.  Smoked DPT, in summary, contained the same elements as smoked 5-MeO-DMT without the rapidity of onset and without the brevity:  the entire peak experience lasted about 20 minutes, followed by 15 minutes of after effects similar to 5-MeO.  To verify this, we waited about an hour, and then went at it again, with the same amount.  While this experience was not as intense as the prior, it was essentially the same: uniform perceptual distortion coupled with increased conceptual power.  Part LSD, part psilocibin, part tryptamine, with only 25mg material.",
  "Though the 20 minutes was still short, it enabled easier collection of qualitative data and wore off quickly enough to discuss its effects while they were fresh, two characteristics we had been searching for in a chemical for some time.  We agreed that there were no noticeable side effects, and that this method was the least offensive of all three.</p>"
 ],
 "erowid": {
  "id": "25832",
  "citation": " AP&RP. \"Many Methods: experience with DPT (ID 25832)\". Erowid.org. Aug 4, 2003. erowid.org/exp/25832",
  "substance": "DPT",
  "views": "11697"
 }
}
