{
 "title": "I Beat the Bladder Cops!",
 "author": "Moriah",
 "citation": " Moriah. \"I Beat the Bladder Cops!: experience with Cannabis (ID 19542)\". Erowid.org. Dec 10, 2002. erowid.org/exp/19542",
 "substance": "Cannabis",
 "bodyweight": "175 lb",
 "report": [
  "<p>I passed my drug test!  Considering my weight and my body fat composition (I'm 5'0) I was terrified I would never be able to pass a piss test.  When the job I was interviewing for told me they were going to test, I almost walked out, but I needed the job really bad.  I had planned to use substitution, but when my donor backed out on me I had to think of something quick -- test had to be that day.",
  "Lady Luck was smiling on me -- I'd been dry for almost a week when the job interview came up, and the interview process took a week before I had to pee.  But I knew I'd still test positive unless I did something drastic.",
  "Three hours before the test, I drank 5 LARGE glasses of water, ate a piece of peanut butter toast (the fats supposedly help), and took two caplets of Horsetail (Shavegrass is another one that works, dunno if they are the same or not) that I had gotten from my local health food store.  Horsetail is a diuretic.  Another good one is Buchu.  I also took two b-complex vitamins to give it some color.",
  "Urinated several times before I left for the test (don't worry, with the Horsetail you'll come up with plenty of urine), then drove thru the snow to take the test.  I was observed and they wouldn't let me wash my hands (gross!).  Came up with midstream test sample -- which was NEON yellow.  Pale, but still neon.  Lo and behold, I passed.",
  "Side effects included a niacin flush reaction from so much b complex and pissing dark neon yellow for two days.",
  "Good luck and beat those bladder cops!</p>"
 ],
 "year": "2002",
 "id": "19542",
 "gender": "Female",
 "views": "20083",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "submissionDate": "2002-12-10T08:00:00.000Z"
}
