{
 "id": 1954,
 "title": "Blasted From the Matrix to the Deltaverse",
 "date": {
  "submission": "2002-07-31T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Timmy",
  "gender": "Male",
  "weight": 63
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "5-MeO-DMT"
  }
 ],
 "report": [
  "I rushed to my friends house from Wendy's immediatly from work.  Still in uniform,  I arrived at the door and knocked.  Jason let me in.  I asked Where Horhay was, and he pointed to the bed.  He asked me if I wanted the same thing to happen to me.  I gulped a bit and nodded.  I had thought I was going to consider doing it for a long time, make sure the room was quiet, get a playlist of cool music, etc.  Not at all.  I did modify my headtrip ahead of time to make sure that I didn't think 'I knew what was up', and made sure I did not try to integrate this into my already large, rigid headtrip. He had a glass pipe with a brillo pad to contain the 5-MEO-DMT.  We didn't have a digital scale, so we couldn't measure the dose.  He slowley heated it up, and I sucked it slowly at first, then quicker to compunsate the smoke getting thicker. ",
  "I first felt a powerful surge of energy.  Jason waved to me and said, 'bye bye'.  My vision changed in the same way it does when you black out, only it was blacking in not to blackness, but to a multitude of dimension infinitly simular to the one I started from.  'Holy cow.', I exclaimed.  I also exclaimed, 'holy fucking shit.'.  The terms in which I will use to describe aspects of the expieriance are entirely abstract, and yet, they are the only word-terms, (metaphors), that accuratly describe my mental state.  I exclaimed, 'My face is fuct.'  This actually means that my digital image, ego, everything I thought I was that was holding me back from everything I ever dreamed I could possibley become, had been instantly whisked away.  The bottom dropped out of my consciousness.  The feeling was very simular to falling, in that no one idea, thought, or illusion will suffice as somthing to hold on to, to keep you from tripping into oblivion.  I have never been so free.  I laughed hysterically and rolled around on the hard wood floor, rolling into tables and furniture laughing uncontrollabley.  I once again understood the cosmic hokey pokey, the infinite eternal joke that in the outter deltaverses and tripindicular dimensions, the hokey pokey,(fun and everything like it), is exactly what it's all about.  (What did you think that second clap was for anyway, we tried to tell you!) ",
  "I publicly announced this time that not only my face was fuct, but that I was fuct as well.  This means somthing very different than the meaning most folks will give to it.  Being fuct is either a positive or negative thing, and I believe it has implications that carry over into ordinary day-to-day, non tripping life.  I was fuct in an awesome-positive way.  Geometries of dimensions of objective reality corned me into fully integrated honesty so that all of my bad parts we forced to evacuate.  Tripping in this positive directions, I believed, and still believe, builds the momentum to make one's life multiply in degree of awesomeness.  This is what it means to be fuct, in a positive way, and I am that.",
  "Apparently, from other folks perspectives, I knocked over furniture, screamed, hooted and hollared uncontrollabley, and had to be restrained so that the police would not be called.  Setting is important with this substance.  This substance does does mix well with the anti-civilization or it's citizens, but it is the metaphorical matrixal red pill, and I beleive it's the way out of the anti-world of bullshit.",
  "I giggled, laughed, and smiled for some time until I returned to ordinary consciousness, still blissfully understanding the life in which my life was moving.  How unbelievabley fucking awesome.  Nothing can prepare a person for this expieriance."
 ],
 "erowid": {
  "id": "16441",
  "citation": " Timmy. \"Blasted From the Matrix to the Deltaverse: experience with 5-MeO-DMT (ID 16441)\". Erowid.org. Jul 31, 2002. erowid.org/exp/16441",
  "substance": "5-MeO-DMT",
  "views": "14207"
 }
}
