{
 "id": 1955,
 "title": "The First Time Glow",
 "date": {
  "submission": "2002-07-31T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "BBKF",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "AMT"
  }
 ],
 "report": [
  "Well, I finally got my AMT.  A gram of fun, but what to start out with?  It was a monday, and I decided due to time constraints and the fact that I would be around people not tripping (mainly my sister, who was also at home), that I would take a rather low dose of 30mg. ",
  "I'm working from home this summer, so I'd gotten a lot of sleep the night before and slept in till around 2pm after being up rather late the night before.  This being said, I had also not eaten after waking up, as I wanted to avoid the nausea. ",
  "4:30pm: I put the AMT in a gelcap, and downed it with some water at about.",
  "5:30: Stomach feeling a little funny, but nothing too bad.  I wonder if maybe I'm just getting hungry after not eating for 12+ hours, so I have a hot pocket (sounded good to me) and it helps somewhat with the discomfort.  Still not to much going on in my head, but I know its still early.",
  "6:30: I decided to take a shower, and coming out I feel happy for pretty much no reason.  This feeling would continue for the rest of the night.",
  "7:00: Pupils are dilated pretty far.  I hadn't really planned anything for the night, so I put on some music, got on irc and talked to a few friends.  Although I didnt feel very affected by the drug, one or two of them asked if I had been drinking, (I'm a VERY happy drunk) so I guess my state had been altered.",
  "7:45: Decide to take a walk to the store, it was still pretty nice out and I wanted to get something to drink.  The walk to the store went by pretty quickly, but when I got to the store, I had a really hard time choosing what I wanted.  I wandered around for about 30 minutes, and finally chose some Grape Soda, Jolly Ranchers, and Airheads.  Yeah, really healthy heh. ",
  "8:15: Leave the store, and realize that if I was going to get any visuals, they would probably be showing up by now.  Alas, it was not to be.  Had a pleasant enough walk back home, and ended up just lounging around for the rest of the night.",
  "4:00am:  Decided I was tired, and went to bed listening to music and feeling pretty good.",
  "Definitly a pleasant first experience, although I had hoped for some kind of mild visuals, and figured that it would be a little more intense.  Feel fine the next day, almost as if I hadn't taken anything at all.  I think this dosage would have been great to either dance with, or go to a party.  I felt sociable and talked online quite a bit, wish it had been a weekend so I could have hung out with some friends.  I'll be doing a 50mg dose next time, and I have high hopes for an even better experience."
 ],
 "erowid": {
  "id": "16445",
  "citation": " BBKF. \"The First Time Glow: experience with AMT (ID 16445)\". Erowid.org. Jul 31, 2002. erowid.org/exp/16445",
  "substance": "AMT",
  "views": "6643"
 }
}
