{
 "id": 19554,
 "title": "World of Elves and Cops",
 "date": {
  "submission": "2010-03-18T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JoJo",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "6:00",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "12:00",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "12:00",
   "amount": {
    "unit": "mg",
    "quantity": "1200"
   },
   "administration": "oral",
   "substance": "Ibuprofen",
   "form": "pill/tablet"
  },
  {
   "time": "12:00",
   "amount": {
    "unit": "shots",
    "quantity": "11"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "shots",
    "quantity": "8"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "shots",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "shots",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  }
 ],
 "report": [
  "[Erowid Note: 23 shots of hard liquor is considered an extremely high dose.",
  "A story about how my mind went on a vaction to Fairyland. Well me and some friends of mine decided out of nowhere to take a trip up to Vancouver from Boise Idaho (9 hour drive), we left Friday night and had to come back Sunday, it was a stupid Idea. I was recently put on Adderall for ADD, so I made the drive in one night. I was taking about 1 pill (20 mg) every 6 hours or so.",
  "After my friends all went to sleep, and I was still speeding, wandering around the neighborhood and watching tv, we decided to start drinking. It should have been real fun, since we were all 19, it would have been our first time legally drinking. I popped 2 of my Adderall, 2 ibuprophen because my knee was really hurt cuz of an accident I had a week ago, drank .5L of a 40 proof coconut flavored rum I bought, and .375L of southern Comforts 80 proof. [Erowid Note:  I'm no light weight so I figured this would be enough to get me pretty drunk but not too drunk.",
  "We were trying to figure out where we were gonna go, then suddenly we were in a cab going to see some fire works.  I didn't think much of the rapid change in locations at the time.  I was feeling pretty odd watching the fireworks but didn't notice anything unusual.  Then we went to a club, I ordered a couple mix drinks while we were there, a double 151 and coke, and a double long Island Ice tea in the course of like 20min.",
  "We left the club because it sucked, and then the scariest thing of my life, I came too in a holding cell. I didn't know where I was, and was sitting in my boxers with my pants on the floor.  It was about 9am, my friends eventually showed up and got me.",
  "After all that my friends filled in the details of the night.",
  "Before we went to the fireworks, we went to a very fine resaurant, I drove and was not acting drunk at all [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!], in the restaurant I flipped over my plate of food, with everything still on it and said somebody told me to do it. I was rambling on about elves being real and described a scenario of a world based on a book I just read a couple days before, insisting that it was all true and I was from there, but still not acting drunk besides my crazy talk. Then around the time of the fireworks I was acting normal.",
  "After the club we went back to the hotel room, and I was asking the cabby all sorts of crazy questions, about his religion and stuff.  Then at the hotel room I kept rambling on about this imaginary world of elves and magic as if it was real, and I was from there.  They also said I was acting kinda paranoid, hiding the liquer botles so sombody wouldn't find them and get us in trouble.  They gave me some more liquer hoping that I would get drunker and pass out.  One of my friends, decided to through water on me and all I did was stare him down and put my cigerette out on my shirt. ",
  "Then I wanted to leave and go somewhere, after trying to stop me with words and force, they finally let me leave.  I don't know what happened from there on, but a cop picked me up and brought me in for my own good.  They said I was puking and pissing everywhere and assing about the room, and acting like somebody slipped me something.",
  "Besides the crazy talk and the puking at the end of the night, I never acted drunk.  Never stumbled, my speech while crazy wasn't slurred or anything.  I may have taken more Adderall or ibuprophen, I don't remember.  As it is I can't find my bottle of Adderall so I'm gonna have to go another couple weeks w/ out any.",
  "I've never acted like that before, so I have to beleive that it was something of a combination between the drugs I took and the lack of sleep.  I've mixed Adderall and alcohol before and nothing like that happened, and I've stayed up for a week straight on Adderall before and while I got a little paranoid nothing like this happened.",
  "It actual seems kind of interesting, I might try to duplicate the experience under more controlled circumstances and get a video tape of myself.  It seems like the alcohol was a catalyst for something in the Ibuprof and addy mixture, the blank spots in my memory and the psychosis all come on at the same time about half an hour after I drank something.",
  "It wasn't fun, and I wouldn't suggest this to anyone."
 ],
 "erowid": {
  "id": "25859",
  "citation": " JoJo. \"World of Elves and Cops: experience with Amphetamines (Adderall) & Alcohol (ID 25859)\". Erowid.org. Mar 18, 2010. erowid.org/exp/25859",
  "substance": "Amphetamines (Adderall) & Alcohol",
  "views": "10243"
 }
}
