{
 "id": 19558,
 "title": "Maybe it's Me",
 "date": {
  "submission": "2003-08-06T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Seventoedmax",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "9.5 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "tea"
  }
 ],
 "report": [
  "I've been yearning to go on a vision quest for a while now, to reevaluate my life, and refresh my spirit.",
  "I purchased 1oz online, for about $45. When I recieved the shrooms, I took about 1/3 of the oz (about 9.5g) put them in a pan with 2 cups of water, I boiled that down to 1 cup of water. Strained the shroom pieces from the tea. Threw out the shroom pieces, and drank the tea in one shot, with a Fresca chaser.",
  "Now about 23 years ago, I've had the mushrooms that you had to pick out of cow shit, early in the morning before the dew dried up. You know kind that turned blue or purpleish, when you break them. And I could tell you some stories about those trips (Galvaston, TX on the strip during the Rainbow Festival, WOO HOO), anyway, those were the shit (no pun intended). They tasted bad, and the nausea was always something to deal with. But the effects happen with 15 minutes, and lasted for a while.",
  "However, the Amanita tea didn't taste bad at all, very mild. I drank the tea at about 6pm, it is now midnight and the only thing that I can say about my Amanita experience, was that my cigarettes tasted like shit whenever I tried to smoked one. But that was it, nothing, zilch. NO sleepiness, NO nausea, NO color patterns or visuals, NO internal visualizations, NO euphoria, NO aphrodisiac.",
  "Maybe it me? I tried Salvia divinorum a couple days ago. I tried smoking it, Nothing. Then I tried the 'quib' method of chewing on it for 30 minutes. All I got out of the that was a bad taste in my mouth, and green teeth.",
  "Maybe I should have eaten the mushroom pieces too."
 ],
 "erowid": {
  "id": "25868",
  "citation": " Seventoedmax. \"Maybe it's Me: experience with Amanitas - A. muscaria (ID 25868)\". Erowid.org. Aug 6, 2003. erowid.org/exp/25868",
  "substance": "Amanitas - A. muscaria",
  "views": "14158"
 }
}
