{
 "title": "The Tale of an Orgy Gone Awry",
 "author": "Gandalf",
 "citation": " Gandalf. \"The Tale of an Orgy Gone Awry: experience with 5-MeO-DiPT & Ketamine (ID 19572)\". Erowid.org. Dec 12, 2002. erowid.org/exp/19572",
 "substance": "5-MeO-DiPT & Ketamine",
 "bodyweight": "250 lb",
 "report": [
  "<p>'Twas a group of gay men, all corpulent and hairy, tiredly calling themselves 'bears', and gathered for a party. Food, a private hot tub, and open sexuality, such were the ingredients for this little monthly orgy.",
  "'A new drug! A new drug!' was the rallying cry heard that Saturday, the call of the wild which had the bears all gathered for play. As fate would have it, none had yet tried this newfound concoction... Not even the host himself had partaken of the hip designer invention. Yet all opted for hefty doses, large enough they felt- given their physical proportions, to allow full exploration of the substance's more wanton dimensions.",
  "Little did they know, for little had they learned: no visits to Erowid, Lycaeum or the land of common sense, to read the fine print, the full text, or any part at all, of this contract inadvertently signed with the devil himself.",
  "'Ev'ry Teddy Bear who's been good, is sure of a treat today. There's lots of marvelous things to eat, and wonderful games to play' lamely intoned the host, pleased to no ends with the gathering feast, keenly anticipating frivolities, fun, and many, many treats.",
  "What none had expected however, was the horror of having to egest, in gags, gasps and wretched heaves, the lunch so carefully prepared, the poolside pigfest. Those who were not puking, found their newfound libidinal urges embarrassingly punctuated by the more processed liquids and effluvia, that had once been their buffet, ejected out the other end, for all to see, and then to smell.",
  "Meanwhile, in a lonely corner, the most lost and panicked of this sad debauchery, had decided to medicate his bad trip with a few bumps of Ketamine- intra-nasally... only to end up in the unexpected arms of an arguing couple gone completely insane: the horrible scene of two incompatible chemicals at war in the same brain. Sweating, panting, eyes ablaze, something had to break, and in the end it was his sanity which seemed to take the hike, as he proceeded to destroy every piece of furniture with a swift booted strike: 'A house liberated from bad taste!'  he loudly proclaimed, while the petrified host looked on, not quite entertained.",
  "By nights end, the situation had rotted to the core...But what would be the point in describing it some more? For the message is implicit, the moral such a bore : obviously, those without a brain should not get through the door.</p>"
 ],
 "year": "2002",
 "id": "19572",
 "gender": "Male",
 "views": "41548",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2002-12-12T08:00:00.000Z"
}
