{
 "id": 19586,
 "title": "Roped by Rivers",
 "date": {
  "submission": "2007-05-22T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Suicide Again",
  "gender": "Male",
  "weight": "225 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  },
  {
   "time": "0:00",
   "amount": "8 oz",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "0:00",
   "amount": "0.25 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(tar / resin)"
  },
  {
   "time": "1:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "This trip was rather bizzare and pretty bad, but I make myself laugh reflecting on it.  This wasn't my first salvia experience, but it was my first without an actual 'in room' sitter.  This was also my first salvia experience not starting sober. I'm a fan of being drigh (drunk and high) so I did my usual 1/2 pint chug of Jim Beam (probably took 20 seconds) and waited about 10 minutes for that buzz to kick in. I smoked quarter bowl of weed resin, and totalled a very nice drigh.  There was no one in the house with me, but I thought a few instant message friends on my computer would substitute well enough. The room was dark, with the computer screen the only light.  I was listening to Sophia's songs 'Aus Der Welt' and 'Miserere' at a fairly loud volume.  For those of you not familiar with Sophia, those songs are very dark militant neoclassical.  Roughly instrumental with no singing.",
  "First Salvia hit, I felt a lot of pull all over my body.   I said 'Oh shit' to my sitter online as I took the 2nd hit.  I blew the 2nd hit out my window and then felt 'gathered' infront of my computer.  I looked down at the keyboard and the keys started seperating to what looked like small rivers flowing down and around me, as well as holding me infront of the computer.",
  "I felt like 'it' wanted me to type.  I don't know why.  I started typing, and the music I listened to started singing what I was typing at the same time I was typing it.  While I was tripping, I thought, 'Freaky.'  I could see the screen perfectly and proceeded to type on the keys being slowly washed away.  I hesitated on the 2nd to last word in the sentense, the singing hesitated too.  I spelled the word wrong, they sung the word wrong.  I felt like I was in trouble for messing up the last part of that sentense.   I don't know why I felt this way.",
  "The rivers from the keyboard wrapped around me like ropes.  It felt real.  The black desktop opened up behind the instant message window and two larger rivers snuck up to wrap me like ropes.  I threw my arms up in a panic shouting 'Get the hell off me!' and started running towards the door.  As I opened the door the larger river wrapped around me.   I ran halfway down the stairs, putting all my leg strength into pulling against the ropes.  I suddenly had a great idea to get the ropes off me.   I forced myself to spin like a top, and I screamed 'I'm going to break these fucking ropes!' as I ran in circles like a madman on the 10th step.  The ropes seemed to thin greatly, and then dissolve.   I tried to grab the dissolving ropes, there was nothing there.",
  "I felt normal and casually hopped back up the stairs.  I jumped onto my bed, keeping my distance from my computer until only a drigh and a body buzz remained.  I started laughing.  I felt completely silly for falling such a sucker to whatever the hell that was.  One hour later, I tried a 2nd bout with the Salvia with every surrounding the same as above except listening to my favorite song of all time - Cruelty Brought Thee Orchids by Cradle of Filth.",
  "After the last hit, I felt like I was being 'gathered' from my window to the computer again.   Rivers....    I tried to type to my sitter, the singing started again.  I stopped the song and everything freezeframed.  It hurt because the rivers were stuck and so was I.   I started playing a new song.   Everything was still frozen.   Eventually they started disolving and I shook it off.",
  "I don't regret there not being a in room sitter.  They would have just overreacted to what happened.  I think shadows played tricks on me in a dim lit room and loud dark music created a intense horror setting.  I also think that it was more intense because I was intoxicated 3 different ways at the same time.",
  "Still, there's one thing that confuses me.   Previous times I tripped on mint and was completely sober, I was practically incapasitated.   Couldn't even stand up.  While drunk and high and salvized, I stood up, opened doors, ran down stairs, and spun on a single stair step (with the help of handrail) without a second thought.",
  "How odd.",
  "Ok, lets try it exactly like before, but in a light room....",
  "sadistic for sadi"
 ],
 "erowid": {
  "id": "25990",
  "citation": " Suicide Again. \"Roped by Rivers: experience with Salvia divinorum (5x Extract), Alcohol - Hard & Cannabis (ID 25990)\". Erowid.org. May 22, 2007. erowid.org/exp/25990",
  "substance": "Salvia divinorum (5x Extract), Alcohol - Hard & Cannabis",
  "views": "2583"
 }
}
