{
 "id": 19581,
 "title": "A Surprisingly Ample Substitute",
 "date": {
  "submission": "2007-06-30T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jay A",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "225"
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1625"
   },
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "As a pretty avid opiate user, I'm always finding myself searching through somebody's medicine cabinet.  Friends, family, my girlfriend, anybody is fair game.  What can I say, I love prescription pills.  I've experimented with cocaine, lsd, marijuana,and everything else, but I always find myself gravitating toward narcotic analgesics. ",
  "So I was taking a piss in my girlfriends bathroom, and I come across a whole bunch of sample packs of Tramadol HCL(37.5/375) acetametaphen pills.  I rushed over to my compy and good ol' internet.  Now, with any other narcotic pill, I know what I want to read.  'False sense of well-being' is always good.  'Elation', 'Sedation', 'Extreme calm', and 'Euphoria' are classics.  But I got none of that info with Tramadol (Ultracet,Ultram).  The only thing it said was 'may be habit-forming'.  Well, I figured that means something, so I downed 225mg worth.",
  "Here's a somewhat sketchy breakdown:",
  "NOON: Ingested the 6 pills.  I ate a good lunch first to avoid stomach upset.  Nobody was home, so I just browsed the internet.",
  "1:30 PM: Still didnt feel any effects.  I usually start to feel my comfy warm feeling no longer than about 45 min, so I almost gave up.",
  "2:00 PM: Suddenly got the urge to smoke a cigarette, in the same fashion as when I use oxycodone or something similar.  At this point I knew something was up.",
  "2:30 PM: At this point it hit me pretty hard.  I had all the effects of a narcotic (warm, happy sense, talking a mile a minute with my girl), but didnt quite get that overwhelming, swimming with glee feeling associated with opiates.  Overall, however, it was very close.",
  "3:30 PM: Started tp peak at this point.  I was quite surprised how well these pills were working.  Every aspect of any narcotic pain-killer was there, if only on a slightly lower level.",
  "9:00 PM: Amazingly, the effects were still lingering, and decently strong too.  I was having such a nice, easygoing conversation with my girlfriend, something I can usually do when high on opiates.",
  "Overall, the experience was quite good.  As a matter of fact there were actually some better things about Tramadol than other analgesics.  First of all, it lasts longer.  While hydrocodone, for instance, has me peaking for about an hour, and then coming down and being a bitch to everybody in sight, Tramadol doesn't.  Speaking of which, I didnt get snippy at any time.  I basically fell asleep happy, and had one of the best nights sleep ever.  Also, I really felt no stomach upset, which amazes me, because I always do.",
  "Although not quite as intense as a true narcotic, Tramadol is quite a competitor as far as a substitute when needed."
 ],
 "erowid": {
  "id": "25973",
  "citation": " Jay A. \"A Surprisingly Ample Substitute: experience with Tramadol (Ultracet) (ID 25973)\". Erowid.org. Jun 30, 2007. erowid.org/exp/25973",
  "substance": "Tramadol (Ultracet)",
  "views": "49202"
 }
}
