{
 "title": "The Entire World is Our World",
 "author": "U.S. 9",
 "citation": " U.S. 9. \"The Entire World is Our World: experience with Ketamine (ID 1959)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1959",
 "substance": "Ketamine",
 "bodyweight": "",
 "report": "<p>So I've done this so many times I guess it is my civic duty to write about it.</p><p>BTW, most of the people writing in about Ket who haven't used it have no idea what they are talking about.</p><p>It can be injected IV, IM, drunk, or snorted. I recommend IM or drinking. Snorting is quite a different and more managable thing, but I think it is a waste of Ket. IM means needles, and....</p><p>well, so its 11:00pm on a Wednesday night- what better time to Ket, eh? I smoked and did a few whippits after two hours of yoga, and played some hand drums for a while. Then B suggested Ketting. We mixed up a somewhat unknown quantity, but when all is said and done I think I did 350-400 mg and she about 25 less.</p><p>We stretched out the futon couch in front of my floor standing Philips and lit some glow candles and a couple of colored tea lights. We were a little frantic because we were making preparations after drinking the ket. We had some nice apple bong hits and then things starting getting tough, because I was still running around but stuff was beginning to get real weird. I managed to get Peter Gabriels Passion (the quintessential ketting disc) in and then collapsed on the futon.</p><p>B held my hand and we started our roller coaster out. There were two tye dye tapestries and these were real cool. One of them had a spiral and I found myself getting sucked into the vortex. B said the spiral became translucent and behind it were bunches and bunches of bubbles and she was a baby bouncing around in it with no gravity.</p><p>Bubbles, bouncing babies and bubbles, she kept saying.</p><p>I can't feel my body anymore except this overriding general fuzziness. The lines on the cieling become a tunnel and I am flying down it faster than sound approaching the speed of light.....</p><p>Oh no, the tunnel takes a big dive downwards! I am facing straight down this big tunnel and I am falling. B squeezes my hand. WOW! Then the room does a somersault and I with it. (It mimicked this fair ride where the cars flip over and are also rotating on an oval chain device with other cars). And this ride is really moving. I'm scared like hell because this is a thrill ride and the car is the dimensions of existence now.</p><p>I ask B for help. She says she loves me and squeezes my hand and I can see the tapestry again and I settle down. That was fucking great I tell her. We are omming alot or something like it. The music changes and our bodies morph with it. Pete is nuts.</p><p>Now there are rules. I can see them all. I am outside my room looking down at us and I know all the rules. There is so much going on outside of us. Other people, other rules, other things, that we are not allowed to see in the day to day. More knowledge. Who is next to me. What is next to me. I know it is something important. I say who is there.</p><p>B says it is her. I say who is you. She says me as in B and U. I smile because I know that means something but I don't know what but I know the rules. I change a few things about my day to day thoughts and cement them for later. My hand feels strange. What is this hand and what has it got in it. Another hand, but neither is hand. I am a universal consciousness. This hand is part of the wood here and the music and the... fuck</p><p>My astral body 3D gets sucked into a 2D plane. This always happens and it hurts and feels so good at the same time. A candle in the room brightens and the whole Ket room changes. Its redder now. I see the tapestry way in the distance. The entire world is our world.</p><p>I look down into a church. We are lofted in the church and there is a wedding. Someone is getting married.</p><p>What is a wedding?</p><p>B answers but I can't understand her words.</p><p>Who is getting married. It is a nice church so I go down to the ceremony and meet a couple of people and eat some cake. B is saying something. I tuck away the church.</p><p>She is asking who is this?</p><p>I say You mean the music?</p><p>She says is it music? And I said yes, its crazy Peter Gabriel.</p><p>And she says ah, its Peter Gabriel, is that what it is.</p><p>I don't know what Peter Gabriel is but I know that is what is around us. We are sitting in a Ket room just hanging out. Its really realxed here, there are some other people here, and everyone is calm and relaxed. The walls glow purple and the walls are blue lush carpet or red. We are hanging. I am gone.</p><p>Holy shit! B repeats after me. Its an hour later. I can see the tapestry again, its about a mile down the tunnel. I know if I can't get to the tapestry I will know where I am again.</p><p>B says some things and I can tell she is still farther out than I am because she took a relatively larger dose.</p><p>I have to pee. Bad news. Because if you think about it it will burn. I tell B. Then I make myself liquid and ooze out of the futon and onto the stairway. Wow I am standing at the bottom of the stairs. How did I get here. There is a light in the bathroom. I stagger and fall against the wall and piss for an eternity. Then I go on all fours back up the stairs. Change the music- MC 900 Foot Jesus. Not the right choice really, a little to uppity. So we change it to Philip Glass' Mishima which is real neat.</p><p>B and I keep trying to hug but we collapse and giggle. We try to hold hands but our hands just open up and we fall back. She keeps delivering exasperated expressions.</p><p>Now I am conscious enough to master my hallucinations. I can make anything out of anything around me the way I want it. Mishima plays on and I transport myself to Japan and live there in his world. Glass is very descriptive in his music. I find myself describing Mishima's Thirst for Love and Confessions of a Mask to B and talking alot. By talking about it I am living in it.</p><p>But also by talking I was failing to adequately slot my earlier experiences into memory. Thus, I have forgotten much. We keep leaving this world. But I know I need to blow out the glow candles or they will burn through their sides. So eventually we get up and move to the waterbed and blow out two candles. Our dog is waiting for us and is nice to pet him. We feel really contented. We will sleep well, me and B and our dog. And we do.</p><p>Except we both have to get up today. I feel groggy but okay. I'm still light and airy but I have no headache or stomachache which is good.</p><p>We check in with each other. It was a good trip.</p><p>We ask our dog. He says it was cool.</p>",
 "year": "",
 "id": "1959",
 "gender": "Male",
 "timestamp": "2000-06-19T07:00:00.000Z",
 "views": "65399",
 "dose": [
  {
   "time": "0",
   "amount": "375 mg",
   "administration": "oral",
   "substance": "Ketamine",
   "form": "(liquid)"
  }
 ]
}
