{
 "id": 19599,
 "title": "Hellish Side-Effects",
 "date": {
  "submission": "2004-01-22T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bluey",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "Pharms - Propranolol",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Risperidone",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I would like to start by advising anyone who takes beta-blockers and SSRI's not to take Risperidone. However, this is my first time with an anti-psychotic drug, and so the hellish side-effects may subside with repeated use and tolerance.",
  "I obtained 60 1 mg pills, and had already read through the side effects but thought nothing of them.",
  "9:00am - After taking my daily dose of Propranolol and Lustral, I decided to put a 1mg pill down the hatch. Little did I know of what this tiny fragment of chalk had in store for me. Feeling nothing whatsoever for the first hour.",
  "10:00am - I am now noticing a sedate but not sleepy feeling ensuing. Late for college and a session in the recording studio, I hurry down as quick as possible. By the time I get there the effects are coming on heavy. It is a silently peaceful spasticated feeling. At this time I am still skeptical and put it down to lack of sleep.",
  "10:30am - Sitting in the recording studio with my fellow collaborator, I am having extreme difficulty concentrating on what he's saying. To me it's just 'bla blallab bla bal. balba balbb bla', and Im staring at him with this fixed expression completely aware of my ridiculous state. I am now aware that that my eyes are physically out of sync: I have trouble looking at anything and I am physically cross-eyed.",
  "10:45am - Trying desperately to make head or tail of this song we are producing, we call in another producer. I tell them what I've taken and they just laugh in my face. By this stage I cannot think straight at all and I have real bad cotton-mouth. I desperately need a drink, and I am getting hot and cold flushes all over. I stumble out of the studio into the hallway to get some air.",
  "11:00am - I am still monging in the hall. The producer comes out and starts talking technical bollox to me, but it's as if my universal translator has just switched itself off. I notice everything goes quiet and I realize I'm going to faint, before falling to the floor. I open my eyes and I'm on my knees. The producer is sting babbling technical shite, obviously completely oblivious to my fainting. Im laying there at his feet pondering the situation; I figure it must be the combination of the beta-blockers' anti-hypertensive effect and the intitial blood pressure lowering effect of the Risperdal combined. Maybe that explains looking boss-eyed. Miss-co-ordination when walking.",
  "11:10am - Sod the recording session. I feel so fucked up now I just want to go home.",
  "The effects are at max, 'and they give this shit to mental patients' I think to myself. I will just go lay down and ride it out. Lost my appetite completely.",
  "Stupid fuck that I am, I decide to give it one more go the next day, just to check it wasn't an anomaly. A few seconds after ingestion I realize what a cunt I am, and try to regurgitate to no effect. Once in the blood, a panic attack ensues, followed by another, followed by another. All I can think is how shit a day I'm going to have. Then I realize I'm scheduled for work this evening. What a stupid prick. However, it made the work pass without bore, so could be a good drug to go to work on? I doubt it!",
  "The moral here is, think twice before taking anti-psychotics whilst taking beta-blockers and anti-depressants."
 ],
 "erowid": {
  "id": "26024",
  "citation": " Bluey. \"Hellish Side-Effects: experience with Pharms - Risperidone (ID 26024)\". Erowid.org. Jan 22, 2004. erowid.org/exp/26024",
  "substance": "Pharms - Risperidone",
  "views": "58681"
 }
}
