{
 "id": 19593,
 "title": "Extremely Confused, Irritable, and Scared",
 "date": {
  "submission": "2003-12-12T08:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "Gnostikoi",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Methamphetamine"
  }
 ],
 "report": [
  "My Experience with Amphetamine Psychosis",
  "Just thought I would share an experience I had once with meth.  It might help people avoid getting into the same situation.  As it turned out, it was one of the last times that I used speed, because it made me realize some things about that particular substance.",
  "I'd been using speed pretty regularly for about a year.  I was using it all the time or anything, mostly because I couldn't afford that, but I was binging pretty hard every few weeks.  This particular binge started at a party - it wasn't really my type of party, and I was bored and ready to leave when I saw someone I knew who sold speed there.  We discreetly took a trip out to his car and I bought three eightballs from him.  We each did a few lines in his car, then went back to the party, which was MUCH more enjoyable then. ",
  "To make a long story short, I went on a particularly long binge - when I was done with the three eightballs I just kept buying more.  All in all, I was up for eight days.  On the evening of the eighth day I snorted the last of my speed and went with some friends (who didn't do speed, but were OK with me doing it) to the local street fair.  I was really out of it by then, nothing was really making sense, so I just kind of kept quiet and listened to my friends talk out on the street.  Gradually I started feeling weirder and weirder, and I started seeing weird visual effects.  The pavement on the street was shifting around, people's faces would become distorted if I looked at them for more than a few seconds, and (this was the most unnerving) I saw huge bubbles everywhere that made me feel like I was underwater.  It reminded me visually of LSD, but the mental effects were not similar - I was just extremely confused, irritable, and scared. ",
  "My friends eventually noticed that I was sort of freaking out, and they kindly took me back to the car, then drove me somewhere safe where I could relax and try to get a grip.  I really, really wanted to sleep, but I'd been doing speed long enough to know that I wasn't going to able to do that for quite a while, so when we got to one of the friends' home I just sort of huddled on the floor in misery.  My friends later said that I just sort of sat there and glared at them, and snapped at them angrily when anyone said anything to me.  Eventually the hallucinations stopped, and I must have looked better because at some point someone took me home.  I was up all that night, slept all the next day, and woke up feeling...not much better.  I wasn't hallucinating anymore, true, but I was still extremely irritable and aggressive, which is completely out of character for me.  This mood lasted for almost a week afterwards, and a few times the hallucinations came back briefly, although they were never as intense.",
  "This episode really made me think about my use of speed, and as I said it was one of the last times that I used it.  I felt absolutely horrible that I was so rude towards my friends, especially when they were being so kind and caring towards me.  It was like I had no control over what I said, because the buzzing in my head made it impossible to filter myself.  I was very lucky to have such good friends, and even luckier that they forgave me so easily for how I'd acted towards them.  I feel that there are many drugs that are beneficial to the user overall, but I think that speed does nothing but harm to mind, soul, and body.  I stay away from it now, even though I sometimes still crave it, five years later."
 ],
 "erowid": {
  "id": "26004",
  "citation": " Gnostikoi. \"Extremely Confused, Irritable, and Scared: experience with Methamphetamine (ID 26004)\". Erowid.org. Dec 12, 2003. erowid.org/exp/26004",
  "substance": "Methamphetamine",
  "views": "19619"
 }
}
