{
 "id": 196,
 "title": "Boring Things Can Be Funny",
 "date": {
  "submission": "2005-07-14T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "H___Flo_am",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "4000 mg",
   "administration": "oral",
   "substance": "Guarana",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I'm not all that clued up on the origins of Guarana, only that it is derived from a South American fruit. Here in Australia you can buy it everywhere in the ephervescent tab form, usually 1000mg each and come in packs of 12-15 for A$8.00.",
  "The first time I sampled some was during a break at University where I found myself very tired from the previous nights study. I realised that I had 5 hours of lectures to go and I needed more than a cup of coffee... So I hopped down to the local pharmacy and looked around for natural, legal uppers. I figured taking large amounts of any legal 'pick-me-up' was bound to do something. I chose the Guarana tabs.",
  "I put four tablets in a 500ml bottle of water and drank it all in about 10 minutes. For about an hour I perhaps felt a little more awake but I may have been fooling myself. Then during the lecture (about 1.5 hours after taking) a rather strange and bizarre effect began to happen. I found humour in everything. I was happy, laughing, cracking jokes (in turn distracting some other members) and just generally not caring about what was going on. But it wasnt a simple case of the giggles - I was really beggining to hyperventilate as if I was being tickled for too long. That 'peak' only lasted about 30 seconds, however, but still I was convinced that the tabs were having more effect than the packet claimed. If you want a really good hit of laughter, then this isn't for you. See nitrous oxide.",
  "Guarana is a cheap, legal pick me up that is perfect for short term depression or just bored for the afternoon. It by no means compares to a 'hard' drug and you'll only notice anything if you take it in large doses. The constant need to urinate however is almost disturbing - and the color of your urine is even more disturbing. Ever taken about 6000mg of vitamin C?"
 ],
 "erowid": {
  "id": "10188",
  "citation": " H___Flo_am. \"Boring Things Can Be Funny: experience with Guarana (ID 10188)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10188",
  "substance": "Guarana",
  "views": "18446"
 }
}
