{
 "id": 19608,
 "title": "Crashing Badly",
 "date": {
  "submission": "2000-09-13T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "E=(XT)c",
  "gender": "Female",
  "weight": 74
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "It was a typical Friday night - we only take Ecastasy about once every two months.  Find that 'e' really makes you forgetful when you are taking too often.  I was feeling very good.  Did not eat before we went out.  These day's I always have some meat before hand.  Find that it lines the stomach better and I don't feel as unstable.",
  "The evening started out fine.  Usually I get a bit nauseous during the evening but it never lasts very long and if I go outside I seem to be fine (last time I got bronchitis after a nausea attack).  It started with a slight headache, I later thought it must have been a migraine.  I was looking for aspirin but could not find anything except Sinutab.  The next moment I was sick right next to the couch.  I got the shivers and eventually convulsions, at this stage I was struggling to stay calm and breathe.  It was so bad that I thought it was my last night alive in this world.  I did not want to leave as the evening was very pleasurable but they eventually took me home.  The ride home was awful with every turn feeling like 360 degree turns.  Never forgot that night and now have a lot of sympathy for people with this problem. ",
  "This never happened again, I try to stay away from things that make me nauseous like red bull energy drink and tiger balm.  I must say to get away from these goodies in South African clubs are almost impossible.  Still enjoy the lekkers as I refer to them but am taking much less and enjoying the trip more!"
 ],
 "erowid": {
  "id": "2606",
  "citation": " E=(XT)c. \"Crashing Badly: experience with Ecstasy (ID 2606)\". Erowid.org. Sep 13, 2000. erowid.org/exp/2606",
  "substance": "Ecstasy",
  "views": "7919"
 }
}
