{
 "id": 19604,
 "title": "The Phenethylamine Ninja",
 "date": {
  "submission": "2003-08-12T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Garuda",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "powder/crystals"
  },
  {
   "time": "2:10",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I spread the odorless, feathery crystals onto some soft bread and down the hatch it went.  I decided to have a nice lunch about 2 hours previously, which may affect absorption.  This is my first experience with 2C-E, so I have opted to start really small - even though I usually tend to dose strongly on any psychedelics.",
  "T+15 min - already feeling a bit of something.  Undefined, but my body feels different - more fluid.  My heartrate seems to have slowed a tiny bit as well.  So far, a complete lack of feelings that may indicate toxicity.  I hope this continues.  The rainforest-like steamyness of my apartment seems stranger than it did.  I've been boiling off water for the past 6 hours, and its positively sticky in here.",
  "T+30 min - the initial nervousness and fluttery stomach is gone, leaving the promise of something unknown in its wake.  Absolutely no nausea or body load so far.",
  "T+1hr - ahhh... the (for me) dreaded 'threshold dose' phenomena is looming ahead.  I have decided to take a bit more of the compound now that I have learned a little about how it affects my body.  Its now or never.... especially since I have to work tommorow.  I turned on the TV to pass some time, and flipped by that new pepsi show 'Smash'.  My total disgust in almost all 'HOT!' 'NEW!' 'FRESH!' popular music seems even more justified.. all of the vapid, superficial aspects are clearer than normal.",
  "T+1hr30min - effects of an undeniable magnitude have finally begun, though they are still subtle.  There is a small amount of restless energy that makes me want to move around or fidget.  For absolutely no reason, I was suddenly reminded of the first time I took mescaline, during the peak of which I spit a loogie - and observed it as a green laser beam of 'star wars' intensity.  I do not currently see any visuals, but things are moving ever so slightly, and colors seem brighter.  I think time dilation has begun.",
  "T+2hr -  all my senses seem enhanced - but without bias to pleasure or pain.  The extreme neutrality of this drug intrigues me.  Like others have noted, its potential seems vast.  Soon I will partake of the gravity bong - which I expect to kick my ass somewhat at this point.  Still no body load.",
  "10 min later - whoa(!).... somewhere in there the bias shifted towards positive.. Im feelin really good, and slowly climbing that cosmic stairway.  At this point Im gonna let the journal rest for a while.  Time to load mr. bong.",
  "T+ 4hr30min? - thought I would drop a line here seeing as I am in the midst... I might have stepped it up a bit much for a worknight, but its not a worry.  I am awash in the wonder of the phenethylamine world, reveling in feelings and thoughts of great antiquity and archaism, with fleeting visions of perfect geometries wafting through my scape.  poetry seems to flow like a natural language here... above torrents of objectivity and subjectivity the warring forces of addition and subtraction are leaving a gaping eye open .... I dont feel I could write or say much without getting 'artsy' or 'philosophical'.  There is an impression of distant light and space... It is not quite that everything is sparkling - but more the perfection and order in which it is all arranged.... like illuminating only the relationships between things... time to end this entry",
  "....",
  "I just had some EXTREME insights relating to my minor TMJ condition and the like... I am amidst the elders, the bone spirits - and as they are helping me and healing me... I feel the bridge....",
  "....",
  "for the past few hours I have been flooded with insights about myself, in such depth and clarity as to have resolved some issues withstanding for many years - and this is no mean feat... I am struck by the transcendental push of this compound - it is definately no slouch in that department, just somewhat quiet in execution... I can see why some people would not want to denigrate this experience in any way and therefore shun connotating it as 'fun'... but that somehow seems counterproductive in my book... Im having quite a bit of fun, even though I feel like Im dancing on the knifes edge over death",
  "-----------------------------------",
  "the next day: well I made it to work ok, and was able to get many things done - some of which have been on my plate for a while.  Nearing the end of the trip last night, the body load finally made an appearance - in the form of some latent speediness w/ headache.  A couple aspririn and ibuprofen took care of that really quick, and allowed me to make a snappy exit to dreamtime.   ",
  "Before I went to bed, I was up and about going through my landing ritual and enjoying the afterglow.  It seemed as if the drug had allowed me to access higher functions within, as if my body's intake and use of oxygen was altered - producing an intensified hunger and a strange but pleasantly elevated sensation in my spine... but as I was coming down from the trip, the ethereal machinery lost its artificial support and I experienced a choas of strange emotions and thoughts which I soon realized was my conscious minds attempt to enhance my natural instinctual functioning.   This was of course doomed from the start since the body can handle those internal functions much more smoothly without the interference of the conscious mind, especially at the level I was experiencing.  Once I realized this, I was again thrust into the purity of silence...  Reflecting on the entire night, I was in awe of the raw efficiency of this compound.  It came at me like a ninja - quiet, stealthy, and 100% business.  Once the mission was complete, it faded into the scenery with ease.",
  "I should have more to report on this drug in the future."
 ],
 "erowid": {
  "id": "26042",
  "citation": " Garuda. \"The Phenethylamine Ninja: experience with 2C-E & Cannabis (ID 26042)\". Erowid.org. Aug 12, 2003. erowid.org/exp/26042",
  "substance": "2C-E & Cannabis",
  "views": "22506"
 }
}
