{
 "id": 1960,
 "title": "Plastic Enlightenment",
 "date": {
  "submission": "2007-01-14T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Drala",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "substance": "Various"
  }
 ],
 "report": [
  "I have to get this off my chest.",
  "After reading these beautiful reports about the profound effect of various hallucinogens, I realized it was time to take one step up from my usual Cannabis habit.",
  "I won't go into much detail, but for the past 7 months I have been using various substances such as shrooms, opium, LSD, LSA (extract using morning glory seeds), and my good friend Cannabis.  I have also been practicing Buddhism for 2.5 years, although the drugs obviously contradict one of the precepts.",
  "After all this experimenting and controlling and meditating in both sober and just plain tripping out states, I have come to the conclusion that I had been sure of before I started.",
  "Mind-altering drugs offer no religious or spiritual value.",
  "I am not saying drugs are bad in anyway, in fact they are nice.  But the truth is, a beautiful experience is not the same as enlightenment.",
  "Enlightenment is getting as close to reality as possible.  It is rolling in the proverbial dirt and knowing everything.  Drugs do not bring me this.  They throw my mind into outer space and then allow me to believe I have achieved peace and understanding.",
  "Yet this feeling didn't stay with me throughout life. When I see the homeless man, get up for work, or make yourself a grilled cheese.  It leaves a bitter aftertaste in the roof of my mouth the morning after.  Then I believe that if I keep taking dose X I will experience it and it will transcend drugs and become one with everyday life.  But it never does. Drugs create a more complex ego when spirituality is involved.  It creates a deeper state of duality in my mind.",
  "Am I wrong? I know I sound anti-drugs but I am not.  I just hope people will explore themselves in a 'clean manner' and then choose the other path."
 ],
 "erowid": {
  "id": "16471",
  "citation": " Drala. \"Plastic Enlightenment: experience with Various & Meditation (ID 16471)\". Erowid.org. Jan 14, 2007. erowid.org/exp/16471",
  "substance": "Various & Meditation",
  "views": "12186"
 }
}
