{
 "title": "Synchronistic, Body-Wiggling Reality of My Current Nature",
 "author": "Timeleech",
 "citation": " Timeleech. \"Synchronistic, Body-Wiggling Reality of My Current Nature: experience with AMT (ID 19612)\". Erowid.org. Dec 12, 2002. erowid.org/exp/19612",
 "substance": "AMT",
 "bodyweight": "75 kg",
 "header": [
  "DOSE:",
  "25 mg",
  "oral",
  "AMT"
 ],
 "report": "<p>10:09</p><p>Ingested approx 25mg AMT (Orally, with OJ). Horrible taste, like fertilizer. Gives equally horrible breath. Brush my theeth.</p><p>I had put the miniscule amount of powder underneath my tongue, which wasn't that bad. For the first 5 seconds... Swallowed it with some OJ.</p><p>Some slight stinging under my tongue for several minutes after. Disappeared after brushing my teeth.</p><p>Now to wait a couple hours...</p><p>[The powder stung underneath my tongue, and the stinging sensation lingered for several minutes. I imagine it to be quite unpleasant if snorted.]</p><p>10:57</p><p>Slight pressure in head.</p><p>As I was walking to the post-office I noticed I was more energized. 'Placebo?' I thought, and left it at that.Not so: Once inside, I became slightly nauseaous, somewhat easily distraced, and had to smile a bit.</p><p>Phones started ringing all over the place, leaving me disoriented i the midst of a sea of beeping tones. Very unreal. [A postal worker commented on it, so it was no auditory hallucination, but it might very well have been one for all I knew]</p><p>Perhaps noticing that the changing perspecitve of things as I walk by is exaggerated a bit.</p><p>[My sense of 'perspective in change' was enhanced... That is, the relative rotation of objects seemed exaggerated compared to normal perception as I walked past them.]</p><p>11:02</p><p>Stomach is not very pleased with the current situation! (But nothing overwhelming, although I think purging might be inevitable within 1-2 hours).</p><p>I'm cold.</p><p>[I was quite convinced I would have to go through a nice puking, but luckily the nausea subsided after apporox 1 hour. It did come to a point where I felt like lying completely still on my side for a few minutes though. I felt relatively cold during the whole day.]</p><p>11:53</p><p>Mouth watering a lot lately.</p><p>[Salivation seemed to increase]</p><p>11:59</p><p>Pupillary dilation and fluctuating in both size and position. Left pupil not centered.</p><p>Still my somtach is not very pleased. Going to try and eath something.</p><p>Self-examination verged on the negative side untill I got my room warmed up and I got a message from a loved one.</p><p>[My pupils floated around within my iris, and their voyage on the small, blue sea was not coordinated at all. They appeared to move about and scale quite randomly, but the fluctuation was mild. Also I had a period of rather critical self-examination, where I was putting myself and my life down in an unneccecarily harsh manner. However, it never became overwhelming or out of control, as these things have a tendency to on other substances (namely LSD and Magic Mushrooms).]</p><p>12:06</p><p>Slight waving in f.o.v, and someomething as yet undefinable.</p><p>[The familiar and cherished waving of the peripheral vision which seems compulsory to any psychedelic experience. Not the multi-levelled acid or shroom melting-of-the-walls though, this was much milder. Although later on I noticed that sources of light got a halo around them. Not the vague rainbow-circle optical effect one might expect, but rather saturated tones of red, orange and blue.]</p><p>12:09</p><p>What to say? What to do?</p><p>Put on some psy-trance and throw my I Ching coins, that's what one does in these situations!</p><p>Nevermind the food... (although my stomach insists on reminding me of it's empty, uneasy presence).</p><p>MUSIC IS SOOO GOOD! I'm in a warm jungle.</p><p>Takes my mind off myself and tunes me into the synchronistic, body-wiggling reality of my current nature. If this is going to last for 12-18hrs+ I'm a very lucky man indeed!</p><p>Best course of action tonight?</p><p>'A time of drive and enegy has arrived' Indeed, I just noticed my clenched jaw and gritting teeth as I write this.</p><p>5th Line moving: 'You will survive, even though you are blocked, even though you may be ill, you will survive.' Now that is a rather positive, if somewhat ominous warning for tonight, courtesy of the I Ching Oracle...</p><p>[I threw the I Ching, and got hexagram 16: Enthusiasm. Which is quite a good description of my mental stat at that very moment. As I put on the music I couldn't help but feeling myself transferred to a jungle (due to numerous jugle-sounds in the track playing then). I had an equally hard time restraining myself from dancing a bit. Which invariably leads to an elevated mood and general good spirits.]</p><p>12:24</p><p>My german translation of the I Ching speaks of music bringing enthusiasm, which expresses itself in rythmic dancing, freeing one from dark thoughts. Which is exactly what happened as I put on music. I will provide the whole translation of hexagram 16 Later, so one can judge for oneself if synchronicity is imagined or real (if there vever was such a difference, when one is speaking of synchronicity...)</p><p>The hexagram mirrored my self exactly at the point of casting though...</p><p>[As already noted, I couldn't help but spontaneously burst into dance. Also, synchronicity seems to increase proportionally with any psychedelic high, making divinatory tools such as the I Ching quite interesting to experiment with.]</p><p>12:33</p><p>Beautifull, kaleidoscopic, colourless CEV's. Quite reminiscent of my OEV's on my last acid trip. But more mosaic in it's nature. Relatively intense tracers upon opening eyes, lasted only 2-3sec.</p><p>[The visuals displayed an uncanning similarity to those I had on my last acid-trip. Multi-levelled, geometrical kaleidoscopic, moving, rotating, sliding in and out. As the proper psychedelic procedure demands, the were quite indescribable. The nature of their colour, or lack thereof, was comparable to that of sober CEV's one gets (with or without putting pressure on the eyeballs). That is, not entirely colourless, but somewhat grey and fleshy in tone, much like one might imagine the inside of a human eye-lid.. :)]</p><p>12:38</p><p>Stomach settled down a few minutes ago. Quite 'writetative' mood I am in today... Makes me feel not as lonely, I guess. This is social stuff, wich I had someone to share it with. Next time...</p><p>[I felt a bit bored at times, and wrote to alleviate that bothersome condition. I felt very much like talking, and doing AMT alone seems quite a waste. Long, deep conversations are no doubt possible, enjoyable, and probable, if not inevitable. As others have commented before me, this is party stuff, at least at this rather moderate doseage.]</p><p>13:28</p><p>Had a long phone-conversation with a friend. I got very emotional very quick. Had a small observer warning me in the back of my head who told me when I might be going to far (personification only an analogy, not experienced as such).</p><p>My drawing is squirly and spirally. Has a tryptamine feel to it, although I don't know tryptamines all that well. My drawing has 'tryptamine' written all over it though.</p><p>Have to phone another friend before I get cramp in hand from writing. Not easy to let go. rather stay&write than go over to phone and dial. ENOUGH!</p><p>[I think the people I phoned were relieved to get me off the hook when they eventually were able to. I had none of the continous stream of bullshit that amphetamine launched in me the two times I tried it. Instead it was a fluent, empathic mode of conversation that predominated. Real conversation, not drug-fuelled, but drug-deepened, and drug-widened.]</p><p>14:47</p><p>Speedy feelings subside. More emotional. Sentimental. Sad, even.</p><p>[I went to the library, where I surfed the net, and read. Particularly a review of the book 'A new kind of science' by Stephen Wolfram fascinated me. I almost went and ordered the book from amazon, but thought I might want to wait untill I was sober again, so as not to engage some tryptamine-fuelled shopping spree. While tripping I seem to be prone to grossly underestimating the importance and value of money. My fascination was enhanced by the AMT, while my concentration stayed almost at a normal level, not being markedly decreased.]</p><p>18:44</p><p>Not as motivated for writing. Spent the last 4 hrs. at the library. Appreciating great artwork at deviantart.com, and reading.</p><p>Clenching of jaw persists. Salivation still at a very healthy level. Write a long, mildly coherent, mail to a friend.</p><p>[Comment from my friend after reading said mail: 'It was full of utterly useless information'. I just rambled on and on, with little plan behind it. Much like my on-trip log...]</p><p>19:29</p><p>Just off the phone. Starving for someone to talk with, so I resort to writing while cooling down my vocal chords, and turning down empathy for now.</p><p>There's warm floaty feeling similar to mushrooms. Clearer thinking thougj. Pleasantly creative offspring thoughts while reading, but not as distracting as they would have been on acid (for me).</p><p>Communication seems easy enough if the recipient is open, and engaged, but I'm having trouble trying to invite myself over to a friend right now.</p><p>The background noise of thoughts that is omni-present seems much less so, much more relevant. Centered, perhaps.</p><p>Apathy. Not capable of deciding wether to eat, phone-a-friend(tm), or stay put. Which seems like the one iv'e opted for right now.</p><p>[At last I gave up trying to come up with things to say, and just phoned. 10 minutes later I was on my way. Had a pleasant few hours there, then missed the last bus home. Had to walk a bit, but that was merely refreshing, and my body seemed to be able to go on and on quite automatically without bothering me about the low temperature nor exhaustion.]</p><p>10:52, Next day.</p><p>Tired, bordering on exhaustion. Something kept me awake for a while. Light, unfulfilling sleep. Am I at baseline? It's been 24 hours and I'm pretty much home again, but my left pipil is a bit off-center, and somewhat smaller than the right one.</p><p>Retrospect:</p><p>It was a very pleasant, very mild trip. I both reccomend, and don't reccomend such a mild doseage to newcomers for two reasons:</p><p>Pro: It was mild and pleasant. No adverse effects except for slight nausea at the beginning.</p><p>Con: It was mild and pleasant. Too mild to give you a hint of what this substance is capable of, I presume. Further research is needed on my part to be able to validate that statement though..</p><p>I don't remember if I thought I was thinking any faster, but there were lots of *relevant* thoughts springing up all the time in my mind. I emphasize 'relevant', because an LSD- or mushroom-trip usually leaves my mind racing, with me clinging on as best as I can, but this was different. I was able to explore the thoughts that entered my mind, and subsequently commit to memory the personal insights resulting of my enhanced introspection. In addition it is extremely easy for me (and everybody else Iv'e spoken to) to get sidetracked/distracted on acid/shrooms. Not so on AMT! I wasn't at the mercy of my thoughts, but their master. A very manageable experience. But what else would one suspect from such a mild doseage?</p>",
 "year": "2002",
 "id": "19612",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-12-12T08:00:00.000Z",
 "views": "18612",
 "dose": {}
}
