{
 "title": "Tweed",
 "author": "Zoe",
 "citation": " Zoe. \"Tweed: experience with DMT & Cannabis (ID 19626)\". Erowid.org. Dec 13, 2002. erowid.org/exp/19626",
 "substance": "DMT & Cannabis",
 "bodyweight": "155 lb",
 "report": "<p>  I have smoked Tweed (DMT + weed) a number of times in a number of places in a number of mindsets.  One of the first times I tried it we dissolved DMT in rubbing alcohol (higher percentage better) and soaked a bud in it, then let it dry and smoked it.  This method works better for me because DMT burns more easily than marijuana.  When I add DMT crystals to a bowl the DMT ends up burning off first, which can lead to a straight DMT experience rather than a mixture of the two.</p><p>  I sat on the ever-so-comfortable couch with three of my best friends.  We were hanging on to Burning Man, having just returned the day before.  We were sad that it was over, but happy for each other's company, happy that on this couch we could keep the warmth alive.</p><p>  We prepared a bowl and three of us smoked two or three hits each, the fourth person stayed sober and watched us melt into the couch with smiles on our faces.</p><p> The smell and taste of the smoke was non-chemical, weed with a sweetened edge.  I felt the same tingling, rushing flood of warmth I have felt from smoking DMT neat.  Then came the visuals, the pristine, inhuman, impossible to describe colors that make up the DMT world.  However, the weed kept me grounded and in this world.  I could open my eyes and still see the room, still see my friends on the couch, even though they were veiled in color and light and meaning.  Knowing that I was not going to be snatched away to other worlds made the tension flow out of my body.  The DMT came to visit me instead of me being kidnapped into its world.  A lot easier to handle!</p><p> Tweed can still be overwhelming.  There was a point (I'm afraid I don't remember exactly when) when the experience became threateningly strong and had an edge to it.  At this point I grabbed the arm of our sober friend who was sitting next to me.  The energy coming off of him grounded me and disappeared the menacing feeling.</p><p>  I saw a giant neon spider-like being from the inside out.  I was in its multi-bladdered heart, moving outwards through its body.  It communed with me, and taught me to surrender.  It showed me the part of my brain I needed to exercise to let the DMT come over me.  I was surprised at how much control I had over the experience (unlike my one plain DMT experience, which was all about me not really knowing how to surrender, despite my experiences with other psychedelics).</p><p> I let the DMT spider 'fuck' me.  It felt amazing.  I was sad when it left, I did not want to come down.  When we did come down, we all had forgotten that we smoked weed along with the DMT.  Something in the mixture of the two made us higher by far than we would have been just smoking the weed. </p><p> The physical and emotional sensation of tweed is orgasmic for me, every time.  The pleasure extends beyond the body into my soul, heart, and mind.  The experience is often sexual, perhaps because in my mind surrendering and letting something enter me conjures thoughts of sex.  I have described plain DMT as 'psychic or cosmic rape', and I would describe tweed as 'psychic or cosmic lovemaking'.  The marijuana both gives me more control and makes me more receptive to the experience.</p><p>  Tweed puts me into a phenomenal mood for about an hour afterwards, I am filled with energy and want to sing and dance.  I feel as though I have made a connection with a being or energy, the DMT is alive and hanging out with it is refreshing and energizing.</p><p>  The most important thing I have learned from tweed is surrender.  Not just because I have no choice, but to actually dive willingly into the situation.  Before tweed the act of surrendering in itself would keep me from surrendering.  The concentration on surrendering myself to the experience seemed to be, in DMT's eyes, an act of holding on to something.</p><p> Though I would say that marijuana renders DMT user-friendly, I would caution people who have not smoked DMT straight against trying it with cannabis.  The mixture is different every time, and it is possibly to accidently have a pure DMT trip, which, if you are purposefully mixing marijuana in to avoid, can be a little surprising.</p>",
 "year": "2002",
 "id": "19626",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-12-13T08:00:00.000Z",
 "views": "22980",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "DMT"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
