{
 "id": 19624,
 "title": "I Am Only What I Can Be",
 "date": {
  "submission": "2007-05-26T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Languid Hunter",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "9.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  {
   "time": "0:45",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "As of this writing, I am currently undergoing my second experience with morning glory seeds.  However, in an effort to communicate all that has been learned, I will relate knowledge gained from the first of my experiences. ",
  "First experience:",
  "9:00 P.M. Me and my friend have purchased 12 grams total of morning glory seeds from home depot.  I have not had extensive experience with any mind-altering chemicals, only perscription opiates procured illegally in order to play high school football after bruising my hip-bone.  My friend: only marijuana, alcohol and opium.  I am mostly upset because I was supposed to be meeting a girl that I had for some time been trying to establish something with, but my friend is driving and decides to head in the direction of a town about half an hour away towards some people that he knows well but I only know vaguely.",
  "We were going to wait til we got there to prepare the seeds, but its getting late so I just start taking them out of the bag and chewing and swallowing them.  I physically shudder now to remember it.  At first, they just taste bad, but the long oral contact required to chew the seeds exacerbates the sensation, and pretty soon, I am nauseated.  It takes me about 45 minutes to eat about 9 grams.  At this point, we arrive at this house where everyone is.  My friend proceeds to consume to remainder of the seeds in yogurt and I, to rid myself of the taste, take a shot of tequila and eat about half a bag of tortilla chips. ",
  "10:00  I puke a little in the front yard.  An hour of anguish is almost immediately alleviated.  I start feeling more outgoing, and, despite the fact that my friend, the only one there who I really knew, had left without explanation, rejoined the 'party' and felt myself more at ease with those who I had previously been somewhat uneasy.  An interesting fellow joins the party, who, ironically enough, also played football, and, in the course of conversation, reveals himself to be a fellow student of psychoactives.  My natural curiosity with psychoactives promotes revealing conversation of my current state.  What had previously been an oncoming head rush has graduated to a body high which is only to increase.",
  "11:00 My friend returns back, he has puked a lot more than I did, and still feels sick, but this could be attributed to dehydration which he had suffered previously in the day.  I call the girl that I had missed earlier.  Everything is all right and I am amazed at my sensitive wit, though the approaching state of ponderance must admit that this is potentially a result of my altered perception. ",
  "12:00 We leave the party, having another friend drive both me and my intoxicated friend home.  Several revelations regarding merely the experience: I am completely numb.  I cannot feel pain. this is disturbing. Thoughts are coming to me at a rate that I cannot cope with.  Though each thought is innovative and thought-provoking, I cannot concentrate on one thing long enough to develop it.  My paranoia is escalated as we approach a surprise police roadblock.  I think perhaps the police will interrogate me, and I am sure by the stupid grin on my face and the inability to speak coherently that they will know that I am high.  Fortuneately, we are allowed to pass and continue on to my friends house where I previously arranged to spend the night.  My friend, who I perceive to be less affected than I am, confronts his parents to their satisfaction, and we set up camp in the living room.",
  "1:00 We watch T.V. Among other things, some things not to watch while paranoid on lsa: Marilyn manson videos, vanilla sky, and porn where the story involves aliens.  I cannot concentrate very well because of all the connections my mind makes to current predicaments in my life.  I was previously skeptical of the possibility of my friend being on the same level as I, but we seem to make a connection in that we both cannot help but contemplate the meaning of life.  He asks what I am thinking.  I try to reply, but all the elements of words failing and the fact that I do not trust my senses to know how loud I am so I don't wake his parents conspire to make me smile stupidly into my pillow.  I am content simply to understand, as I hope he also does.  At this point, previously small close-eye visuals become intense, colorful geometric patterns even with eyes  open.  Many personal musings and conclusions lead to the inevitable understanding that we can never understand with our logic, as I might hope to, but must be content with a more visceral comprehension.",
  "2:00 to 3:00 hallucinations become aural. I hear the sound of rushing water, which for a time I had confused with the sound of pipes in my friends walls.  When I realized that his pipes could not possibly make these sounds, I became frightened because I didn't know that hallucinations could reach this level, and that I could no longer distinguish reality from my imagination except via careful consideration.  I did not trust myself to move, lest I suffer self-injury, and I eventually start having horrifying 3-D visions of people  with no faces that I could see right in front of me, and also strange, inexplicable happenings in the household.  The only thing holding me together is the fact that beneath the sensory distortions, my reasoning mind remains active and discerning.",
  "4:00  Hallucinations start to fade, but the body numbness, especially felt in my tongue, in addition to dull muscle pains and tightness, as well as an extreme emotional desperation compel me to wish the experience over. eventually, I sleep.",
  "7:00  The sleep is restless, but the high is almost gone, which I am glad for.  The numbness and physical discomfort remain, but the morning has its glory.  My outlook on life and the day is extremely optimistic, and my appreciation of sobriety and life in general prompt me to vow to make life changes that to this day I have kept.  My friend and I talk, both agreeing that the experience was profoundly beneficial, but not altogether fun.  We have no desire to do it again anytime soon, instead realizing how amazing everyday consciousness can be, but must both admit that sometime in the future (this is two months from the original date that I have repeated the experiment, this time alone, and have hence proceeded to record it) We will probably again seek the understanding the is to be had.  I go home and write amazing transcendental poetry that to this day I cherish as some of my best."
 ],
 "erowid": {
  "id": "26130",
  "citation": " The Languid Hunter. \"I Am Only What I Can Be: experience with Morning Glory & Alcohol (ID 26130)\". Erowid.org. May 26, 2007. erowid.org/exp/26130",
  "substance": "Morning Glory & Alcohol",
  "views": "3768"
 }
}
