{
 "id": 19622,
 "title": "Lucid Dreams",
 "date": {
  "submission": "2006-02-28T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Next",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "daily"
  }
 ],
 "report": [
  "First off let me just state that English is not my first language so you'll have to excuse my type-o's or grammer mistakes.",
  "I was diagnosed for depression in 2001 and was treated with the drug Seroxat (Paroxetine). After a few weeks of treatment the full effects of the drug were finally noticeable including its anti-depression action. I used the drug for about 6 months during which I was usually taking 40 mgs every day. I wanna talk mostly about some interesting side-effects that I was experiencing during those 6 months. Aside from the usual 'funny feeling' in the gut, vibrations in my teeth, drowsiness and increased appetite there was something amazing taking place during sleep. It began about a month after I started taking the pills. I was using 30 mgs at the time. My doctor did not say anything about this. Usuallly I'm not one of those who makes a big deal about dreams. Possibly because I rarely remember them in the morning... But the dreams I had on this drug were fucking UNBELIEVABLE!!!",
  "Long, complex, fantastic and very very real looking. Every night was a treat. The most amazing thing was that during most of those dreams I often knew I was dreaming. As a matter of fact I often woke up, and kept on dreaming with my eyes closed (I know this sounds weird). The dream would go on and on and I could feel my eyes moving like crazy behind my eyelids and my fingers twiching like I was having some kind of seizure... As freaky as it was I REALLY enjoyed it! It was like some sort of very strong R.E.M sleep combined with being awake at the same time.",
  "Another interesting point was the combinations with other drugs:",
  "+MDMA did nothing to me (as expected).",
  "+Weed was super strong on it. Long, heavy buzz. Very trippy.",
  "+Acid was the same.",
  "+as were Shrooms.",
  "That is all."
 ],
 "erowid": {
  "id": "26124",
  "citation": " Next. \"Lucid Dreams: experience with Paroxetine (Seroxat) (ID 26124)\". Erowid.org. Feb 28, 2006. erowid.org/exp/26124",
  "substance": "Paroxetine (Seroxat)",
  "views": "24752"
 }
}
