{
 "id": 19626,
 "title": "Like a Porn Star",
 "date": {
  "submission": "2003-08-18T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "DevilDoc",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Sildenafil"
  }
 ],
 "report": [
  "<p>So, you liked the title of the article? I bet about 90% of you are men looking to either become a desired stud or to please your significant other just a little better. The other 10% are women either curious or dissatisfied with your man.",
  "Here you go  how to become a porn star overnight",
  "Im sure youve all heard about Viagra (Sildenafil), and many of you have probably tried it. Yes, it makes my manhood sing like an opera star, but it doesnt do much for longevity in bed. It might be able to go again in a minute, but will shoot my load in a few minutes yet again.",
  "I have the solution  Zoloft (Sertraline). If I take 100mg of Zoloft 8-14 hrs before sex on an empty stomach or 5-8 hrs after a meal I'm lucky if I ever cum. Viagra + Zoloft = a woman that will beg for more time after time.",
  "Now, Viagra has a couple of side effects  flushing, stuffy nose and body aches. For the Flushing there is little I can offer as a remedy. For the stuffy nose  try a 12hr Sudafed works like a charm. And for the body aches, try 400mg advil (ibuprofen).",
  "I know what youre thinking  how can I get/afford the Viagra and Zoloft. And I have the answer  but from abroad. Ive been doing it for years, have never not a shipment arrive, and have never had it take longer than 2 weeks (usually in 1).",
  "P.S. If you are taking any nitrates/nitrites, you can not take Viagra! I have found that people respond well to Diphenhydramine (Benedryl) pretty well  it will give your member a lift. Be careful, though, since it makes most people very drowsy.</p>"
 ],
 "erowid": {
  "id": "26140",
  "citation": " DevilDoc. \"Like a Porn Star: experience with Sertraline (Zoloft) & Sildenafil (Viagra) (ID 26140)\". Erowid.org. Aug 18, 2003. erowid.org/exp/26140",
  "substance": "Sertraline (Zoloft) & Sildenafil (Viagra)",
  "views": "40850"
 }
}
