{
 "id": 19635,
 "title": "Nice Evening, Anxious Night",
 "date": {
  "submission": "2004-07-05T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Somnitron",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Heimia salicifolia",
   "form": "tea"
  }
 ],
 "report": [
  "My mind set was calm, the setting was as well. I was going to spend the evening relaxing and working on making music. I steeped 4 grams of dried Heimia in steaming water for an hour or so and sipped gradually while working.  I noticed a relaxed feeling begin to slip over me within 30 minutes of starting to drink.",
  "After reading about auditory enhancement, I began paying attention to subtleties in music and sound, I had on my headphones and was in a different realm.  This is not unusual, however: the only noticeable effects at this time were the aforementioned relaxed state. As I stood up after awhile I noticed my motor skills required a bit more effort.  I went to bed eventually.  My sleep was one of intensely vivid dreams in which I was being violently oppressed by a huge entity manifested as a blackness slowly filling my room.  I slipped in and out of consciousness frequently, and while briefly awake, could still vividly envision the blackness spreading across my bed, cornering me in.  Not frightening exactly, but very uncomfortable. Physically, I would wake up in uncontrollable fits of shivering, . . . no - quaking, almost convulsing.  I put a bunch of blankets on myself and would wake up drenched in sweat 5 or 6 times throughout the night, shaking like crazy.",
  "In the morning I was fine physically, but my mind was reeling over the mental events of the slumber just passed.  towards the evening of the next day, I felt some creepy little traces of this new hell present themselves in my mind . . they passed and I slept like a baby.",
  "in short: obviously very potential.  I would like to try again under different circumstances (not trapped in sleep necessarily).",
  "!!"
 ],
 "erowid": {
  "id": "26184",
  "citation": " Somnitron. \"Nice Evening, Anxious Night: experience with Heimia salicifolia (ID 26184)\". Erowid.org. Jul 5, 2004. erowid.org/exp/26184",
  "substance": "Heimia salicifolia",
  "views": "20710"
 }
}
