{
 "id": 19633,
 "title": "Doorway to the End of Reality",
 "date": {
  "submission": "2005-08-26T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cygnus-X1",
  "gender": "Male",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "capsule"
  },
  {
   "time": "0:15",
   "amount": "110 mg",
   "administration": "oral",
   "substance": "DPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "This was my first experience with DPT. Me and a good friend of mine,'M' had nothing to do one day so we decided to try this substance. We first swallowed six capsules (~2 grams) each of crushed Syrian rue hoping its MAOI effects would potentiate the DPT. Approximately 15 minutes later we measured and took 110mgs of DPT each.",
  "Now usually with tryptamines I tend to come on alot faster than most people, but this time something strange happened and I had little to no effects for about an hour. In the meantime M had come on somewhere around T+0:20. During this time M seemed to have a lot of trouble describing the experience but mentioned a feeling of 'insanity'. After awhile of waiting around thinking it wasnt going to do anything for me I turned on the television and was for some reason overcome with the most maniacal evil laughter I have ever experienced as I stared at M in his confused state. Now this is where things started to get really weird, it was as if the laughter triggered the drug because when the laughter subsided (about T+1:30) I started to come up... And FAST. Me and M moved to lie down and I put on a cd of traditional music of India. Now from this point on I Experienced EXTREME time dilation, this was unlike any time dilation I've edperienced on ANY drug it was so intense that minutes literally seemed like hours. I also remember having severe spacial distortions and my bedroom started to seem very very large.",
  "Now at about T+2:00 closed eye visuals are very intense and hard to describe with the Indian music in the background. I see something that would best be described as an animated mandala one with several rings made up of symmetrical shapes moving in opposed directions. This mandala was moving very slowly and very smoothly, it seemed to be extremely intricate and colorful. Meanwhile M reported to have hallucinated a vivid painting on my wall of two hindu gods, limbs intertwined, kissing. He reported the same geometries and intracacies as I did. He later told me that I, with my gaze frozen on the ceiling said 'This IS the doorway to the end of reality!'.",
  "Now at about 2:30 walked outside and nature seems very chaotic and alien. Me and M had a cup of tea because I was feeling very cold during this time my mind kept going on these bizare tangents and I knew alot better what M meant when he said he felt insane also the time dilation seemed to be worsening and I was yearning for the sweet feeling of sanity so me and M decided to watch some seinfeld (sitcoms usually take my mind off tripping). After about three episodes I felt quite sober and back in my usual state of mind.",
  "T+4:00 about back to baseline other than some visuals persisting",
  "In conclusion this seemed to be a somewhat low dose despite it being very intense at specific moments and I would like to try again with a slightly higher dose. The visuals seemed to be alot like DMT, same geometric/pattern effects and I found DPT to be no less visual than DMT. The major difference between the two was the addition of an extremely strange, alien feeling what M aptly named 'the insanity'. I think this drug may be a window into the mind of a schizophrenic."
 ],
 "erowid": {
  "id": "26178",
  "citation": " Cygnus-X1. \"Doorway to the End of Reality: experience with DPT & Syrian Rue (ID 26178)\". Erowid.org. Aug 26, 2005. erowid.org/exp/26178",
  "substance": "DPT & Syrian Rue",
  "views": "4322"
 }
}
