{
 "title": "I Try to Stay Away From It",
 "author": "Mr.K",
 "citation": " Mr.K. \"I Try to Stay Away From It: experience with Methamphetamine (ID 19639)\". Erowid.org. Jul 23, 2007. erowid.org/exp/19639",
 "substance": "Methamphetamine",
 "bodyweight": "165 lb",
 "report": "<p>T-10: A bit apprehensive about freebase meth. This stuff honestly scares me because it can mess me up so badly. I've done meth in crystal form before, but the freebase is apparently much stronger. I'll have to adjust my smoking approach. Before the experience I did not take my prescription Ritalin, as a potential drug interaction could result.</p><p>T-2: The meth is out and being poured into a spoon. I'm keeping calm, in fact, I'm a bit excited to try the meth.</p><p>T-0: Took 3 hits, which was prolly too much! It wasn't as harsh as expected, and the rush is coming on strong! I can't write anymore.</p><p>Now, this is my estimation of what went on at estimated times...not sure if my memory is 100% though. Only the most notable points are noted.</p><p>T+5: Wow! I felt really great! The meth was kinda like coke, but more 'in your face'. I realized how slow everthing is!</p><p>T+10: I wondered what time it was (repeatedly). Time seemed to barely crawl by. At this point I began to feel infallable. I really wanted to brawl.</p><p>T+20: The last 10 minutes were a blur. I learned a new way how to walk, because normal walking felt all wrong. It kinda reminded me of DXM inebriation, but more pleasant. Euphoria was definately present.</p><p>T+25: I began not to care about drugs and ethnogens anymore. This is totally out of character for me.</p><p>T+30: I just realized how messed up my vision became. Everything looked like a photo. It was such a welcome change from the bleak, boring shades of reality.</p><p>T+40: Convesation was so enlightening. I learned many things about my friends that I didn't know. I realized how great a bunch of people they are. I tried to talk to people to prevent myself from feeling as though I was going to get caught amped-up.</p><p>T+60: I think I peaked. It was like a blast of 'white lightning'. I have never enjoyed talking to people so much. I said nothing but the right things. Also, I realized that I was a smooth talker.</p><p>Basically, this is the just of what I consider to be a mild meth experience. I've had stronger experiences, but this one stands out, because the others were too intense (and unpleasant)! I respect meth so much, and I actually try to stay away from it as much as possible. Thankfully, this experience was pleasant, I would hate to go berserk. Meth demands total respect from its users! AI know how ungodly powerful it is.</p>",
 "year": "2002",
 "id": "19639",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-23T07:00:00.000Z",
 "views": "5550",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(freebase)"
  }
 }
}
