{
 "id": 19632,
 "title": "Split Open and Melt",
 "date": {
  "submission": "2007-03-04T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Izlsnizzt",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "shots",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "g",
    "grams": "3.0",
    "quantity": "3.0"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "3:00",
   "amount": {
    "unit": "mg",
    "quantity": "15"
   },
   "administration": "oral",
   "substance": "Oxycodone",
   "form": "pill/tablet"
  },
  {
   "time": "3:00",
   "amount": {
    "unit": "shot",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  }
 ],
 "report": [
  "I've decided to wait until I was back to baseline to right this report so I can be as accurate as possible in it's description.  First a little about me.  I'm 20 years old and I'm a regular weed smoker and I also enjoy other drugs as well, to an extent.  My father recently had surgery and was given a large prescription for Oxycodone, of which he gave me 3.  That is basically how this idea came about.",
  "I was sitting in my room one night with a friend and we were listening to music.  I am an avid audiophile with a very expensive stereo capable of all formats including SACD, DVD-Audio/Video and all the standards like vinyl and CD.  We decided that we should get stoned and listen to Pink Floyd's Dark side of the Moon on SACD (Which is in 5.1 Totally Amazing).  She had brought a bottle of Bacardi 151 along that night as well which we had been 'sipping'.",
  "I remembered then that I had those 3 pills that my dad had given to me.  I told my freind and she agreed that it would be a cool thing to try.  We proceeded to smoke and vaporize about 3 grams of some pretty good pot that I had procured.  Directly after we had finished that (about an hour later) I proceeded to take the 3 pills with a shot of 151 for a drink. All in all that was pretty nasty considering I bit one of the pils by accident and it was nasty.",
  "This is when the night started to get really good.  About 20 minutes after taking the pills I began to feel very relaxed.  I was quite stoned at this point having smoked a good amount in one sitting for 2 poeple.  To me the Oxycodone seemed to greatly intensify the high from the pot.  Overwhelming feelings of melting into the chair and comlete satisfaction were all around.",
  "I found myself not wanting to do any more drugs.  I was completely satisfied.  By this point, about 3 hours after the first shot and an hour after smoking, I was on cloud nine.  I sat in a darkenend room listening to all kinds of music and really enjoying it.  My friend was also feeling very good as well and we enjoyed the night for what seemed like 5 hours, but it was only about 3.",
  "My advice on this combo is get some good music and a damn good chair.  This is now one of my favorite combo's ever (Even more so than Acid and Ecstacy).  It is completely euphoric, relaxing, and satisfying.  I recomend only doing this about once a week if you can obtain the Oxycodone easily as it is addictive.  I, however have not noticed any physical addiction over a several month period of once a week usage, and about the same dose as listed above.  Go on and try it and tell me what you think.",
  "Izlsnizzt"
 ],
 "erowid": {
  "id": "26168",
  "citation": " Izlsnizzt. \"Split Open and Melt: experience with Cannabis, Oxycodone & Alcohol (ID 26168)\". Erowid.org. Mar 4, 2007. erowid.org/exp/26168",
  "substance": "Cannabis, Oxycodone & Alcohol",
  "views": "11640"
 }
}
