{
 "title": "Different Forms of Ketamine",
 "author": "J.L.",
 "citation": " J.L.. \"Different Forms of Ketamine: experience with Ketamine (ID 1966)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1966",
 "substance": "Ketamine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Ketamine"
  ]
 ],
 "footer": [
  [
   "",
   "1966",
   "Male",
   "",
   "Not Given",
   "Jun 19, 2000",
   "13249",
   " "
  ]
 ],
 "report": "</p>\nDosage/Application: Ketamine-HCl, 100mg s.c. (injected under the skin)</p><p>Description: Soft onset just after 2 minutes. Colors fade, light fades, no sound, no body-feeling. From the outside I now appear unconscious. After relaxation, a feeling of falling down, then a fast ride down a helical shaped passage with razor-sharp edges. A feeling of fear, tension, expectantcy. Then I entered a room without borders, filled with 'simulations'. I realized that my life and everybody elses was playing in these simulations, but now I was seeing this from outside. To 'see' here meant an unlimited, uncentered, holographic view. I couldn't grasp the details of the different entieties in these simulations because they were encapsulated. This Realm wasn't made of matter, but of information. I don't remember what I did there until I felt that I was returning to our Sphere, aproximatly 30 Minutes after the start. I realized then that I didn't travel between theses two worlds but only shifted my attention in a different direction. I always was and probably always will be in this world I found there, but living different lives I will enter different 'simulations'. I floated back with a peaceful and content feeling. I felt that I had experienced something good, something special. I was slowly entering my body, like putting on a garment: legs first, then arms, chest, head. At the same time, my sight and hearing returned as I was shifting my attention to these senses. Everything felt a bit unreal at first, but this went away after a while. Then I talked to a friend who was keeping an eye on me during this experience. I told him what I remembered, because I knew already that your memory of it fades quickly, just as with a dream. I was also telling him how time 'feels' different under the influence. My perception of time changed to a non-linear form, where events wheren't linked by cause and effect. Another 30 minutes later I felt sober, still relaxed and confident.</p><p>Comments: this experience felt to me as real as anything I know from this world. Now, 3 Months later this hasn't changed. I consider this level possibly dangerous for unexperienced users, because of the strong impact it has on your life. In my case, experiencing reality as 'just a game' could have easily driven me into suicide, if I wasn't happy with this life.</p><p>\nDosage/Application: Ketamine-HCl, 400mg caps. p.o. (in Gelcapsule, eaten)</p><p>Description: After 40 minutes I felt a very mild high, a distortion of my body-perception. It was accompanied by an unpleasant, noxious feeling. I felt poisoned, dizzy and very tired. This lasted 2 Hours, then it slowly passed.</p><p>Comments: Very unpleasant and wastefull.</p><p>\nDosage/Application: Ketamine-HCl, 100mg+DMSO ter. (Applied on the skin dissolved in DMSO)</p><p>Description: No effect.</p><p>Comments: Maybe at a higher dose.</p><p>\nDosage/Application: Ketamine-HCl, 200-300 mg i.n. (snorted up the nose)</p><p>Description: (Compiled from 5 experiments) Slow onset after 5 minutes, peaking after another 10 minutes. Stable plateau for 20-30 minutes. Distorted body-feeling, especially when moving around. Many aspects of the environment get a special kind of meaning, reminding of similar feelings when under LSD. The perception of time is changed in bizarre quality. Contact with other people is ok, especially when they too are under the influence. 30-60 minutes afterwards completly sober. </p><p>Slightly unpleasant, but not to the point of vomiting. A bit irritating on the nose</p><p>Comments: Good for a first evaluation, but still with side-effects. Never as intense as with an injection, but also not destabelizing the users personality.</p>"
}
