{
 "title": "Doing Psychedelics Again",
 "author": "toxiku",
 "citation": " toxiku. \"Doing Psychedelics Again: experience with LSD, Mushrooms & MDMA (ID 19664)\". Erowid.org. Aug 2, 2005. erowid.org/exp/19664",
 "substance": "LSD, Mushrooms & MDMA",
 "bodyweight": "61 kg",
 "header": [
  "DOSE:",
  "1 hit",
  "oral",
  "LSD",
  "(pill / tablet)",
  "",
  "4 glasses",
  "oral",
  "Mushrooms",
  "(dried)",
  "",
  "100 mg",
  "oral",
  "MDMA",
  "(capsule)",
  "",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>I was never a huge fan of trance parties. When I was young, I used to go with my friends and do some acid/shrooms/E, but when I got older, I lost all the interest I had in it. Because psytrance was never a music style which I loved, because I was seeing people believing in mystical bullshit just because they kept thinking about it when on psychedelics, because I was getting older and interested in serious issues and most people there were brainless kids, because I got deep into style and fashion and I found the decoration, the glowsticks and pacifiers and the clothes most kids used to wear at those parties were an offence to the 'good-taste', and since I have a good job, my idea of fun is going to a club, listen to house music, meeting some pretty people and snorting coke (or doing E for a change, sometimes).</p><p>But anyway, yesterday, two friends of mine (lets call them R and F), who still like psytrance parties convinced me to go with them, to remember the old times (it was an indoor party).</p><p>I am not taking any medication at the time. I had 300 mg of pure MDMA crystals, so I eye measured three 100 mg doses, crushed them into powder and put them into gelcaps. I left home to pick them up in my car. They were both at R's house. R gave me one microdot, F gave me four grams of Psilocybe cubensis and I gave each one of them one MDMA cap. I hadn't done LSD/shrooms in years, I lost most of interest on them, but this was the night to try them again, so I dropped the microdot and saved the shrooms for later. They also took their microdots and we drove to the party, which was a big event, 25 kilometres away from my house.</p><p>When we got there, it was about 23:30 and it was pretty much empty. The lights were still on and there was no DJ, only a psytrance CD playing, not very loud. We all decided to sit down in the tables upstairs, to chat and wait until the party started. We sat down, chatted for a while, and I began to feel the acid. Well, I must admit that when I started to feel it, I realised I missed it. It was nice to feel my mind being amplified, my ego being split up, etc. My friends were also coming up, and they were laughing and talking a lot, but I got more introspective, and began concentrating on the one thing that always interested me in psychedelic drugs: they reveal the complexity of the human mind. They show me that our mind is a lot more than our ego. I wouldn't say that LSD can make us reach our id, but it certainly makes our ego touch it.</p><p>I stayed there for nearly half an hour, smoking cigarettes and trying to understand all the mental processes that acid was making my mind go through, just thinking about what I was thinking :). Eventually, things started to warm up. People were getting there for the party, the lights turned off and the DJ started playing music. Psytrance sounded good to me because I was tripping, and we all dropped the MDMA capsule (this was my first candyflipping, believe it or not). We kept sitting, looking at the dance floor and listening to the music. Half an hour later, I started to feel the MDMA. Since I had parachuted the crystals, It hit me very strong, and I got those lovely waves of energy rushing through my body, those loved-up thoughts and the physical stimulation, so I had to go dance. I started dancing and smiling all the time, and the visuals began. Not those crazy visuals of things undulating, etc., but since I was candyflipping, the visuals were a lot more interesting and gentle, I was seeing huge and very detailed patterns of colours, moving in a perfect synaesthesia with the music and waves of purple lights embracing me. I never had these kind of visual, they were divinely beautiful.</p><p>Five minutes latter, R and F joined me. We all danced for one hour until I met a girl and we went upstairs to sit down and chat. I liked her a lot, we had some great conversations, but I started noticing some negative things, like the fact that I was one of the oldest people there, and most of them were raver kids, with these awful clothes, pacifiers and glowstickswell, it made me laugh a lot. :) Anyway, the girl handed me a pill, a blue omega, so I gave her two grams of shrooms. We thanked each other, she ate the mushrooms and so did I, chewing and the swallowing them, followed by the pill she gave me. We kept talking for another half-hour, when I was hit by an amazingly intense sensation I don't know if the E and the shrooms took effect at the same time, but they probably did. How can I describe it? Pure ecstasy.</p><p>These three drugs were making me reach a pleasure level completely unknown to me (not in intensity when I smoked coke I saw what intense feelings mean :) ). I began to not care about the party being overcrowded by kids, I had too much empathy to feel any superior to anyone. I said to the girl we had to go to the dance floor again and dance. The euphoria was now a lot more intense and so were the visuals. I was still seeing a mosaic of colours, but they were a lot more intense and glowing, and behind this, I could see the whole world morphing and dancing. A little later, F came told me he and R had bought a couple of pills each, and asked me if I wanted one (each of them would give me half a pill) but I said, 'No thanks, I'm high enough, take them and have fun.'</p><p>This great feeling lasted for some good three and a half hours, until I eventually started to come down. It was not a very harsh comedown, but me and my friends went upstairs again, and we talked about the night, about the high, about the music, the people we had met, etc.</p><p>Finally, we decided to go home. I went to say goodbye to the girl I had met, she gave me her cell number and I gave her mine, and I went home, still high (but not HIGH).</p><p>Like always happens to me after a night of doing E, I couldn't sleep, but I wasn't in a very bad mood. I just went home, watched TV and thought about the night. It was nice to go to a psytrance party again, and it was definitely nice to try acid and shrooms again.</p><p>I think I'm not going to another one for some time, it's not my kind of party, but I'll certainly try shrooms (and maybe acid too) with E again, but next time, it'll be in a calm place, with a beautiful landscape and my girlfriend.</p>",
 "year": "2002",
 "id": "19664",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-02T07:00:00.000Z",
 "views": "9222",
 "dose": {}
}
