{
 "id": 19669,
 "title": "Light but Interesting Enough",
 "date": {
  "submission": "2003-08-25T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "collapsedhole",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DET",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "The other day a friend of mine acquired some 4-Acetoxy-DET and 3 of my friends and I decided to give it a try one night. Our friend recommended that we each take 40mg for our first try with this chemical. This seemed a bit high for a first time according to the Erowid dosage chart but we were all up for it, and our supplier said that he did 120mg a few nights ago and felt great. We did not have a scale on hand so we emptied the contents of a bag which was said to contain 150mg onto a piece of paper , divided it into 4 lines which looked equal and put the powder into 4 gelcaps.",
  "About 30-40 mins after ingestion I began to feel the effects of the drug beginning. There was a medium body high present and mood was elevated. Music was very enjoyable - it sounded full and engulfing. Thoughts were very detailed and easy to explain. There were some visual effects but they were quite mild.. things moved around a bit but they didnt distort or morph or become very intense at all. These effects lasted the duration of the trip, which was about 3 hours.",
  "Smoking pot enhanced the effects of this drug.. everytime I took a hit off the bowl I felt my body lift and it made the body high fairly strong.",
  "If we decide to experiment with this chemical again it will be a dose of 80mg... we are all fairly experianced drug users and were hoping for an intense experience. However , a lower dose of this chemical may be ideal for a person seeking a fun new drug to experiment with.",
  "I'd also like to note that I experianced no negative effects from this chemical at all."
 ],
 "erowid": {
  "id": "26362",
  "citation": " collapsedhole. \"Light but Interesting Enough: experience with 4-Acetoxy-DET (ID 26362)\". Erowid.org. Aug 25, 2003. erowid.org/exp/26362",
  "substance": "4-Acetoxy-DET",
  "views": "10620"
 }
}
