{
 "title": "Just Let Go",
 "author": "If I were Kyle",
 "citation": " If I were Kyle. \"Just Let Go: experience with H.B. Woodrose, Hash, Alcohol & Cigarettes (ID 19679)\". Erowid.org. Oct 14, 2005. erowid.org/exp/19679",
 "substance": "H.B. Woodrose, Hash, Alcohol & Cigarettes",
 "bodyweight": "165 lb",
 "report": "<p>This was quite a surprising trip indeed, nothing like any other indoles (tryptamines & otherwise) that I've tried. I'd tried these little gems of wonder once beforehand (w/pot that time as well) with four other people and watched them transform into vapid trip-zombies at doses of 2-4 seeds. I'd found that quite enjoyable, so I did it again.</p><p>The evening was predicted to be dull: A Saturday night at home with no money and very few cigarettes, in the company of my arch-nemesis - British primetime TV. ooooooohh! If ever there was a need for someone to take drugs to escape biredom and futility, this'd be it. The entire night's supposed activities changed with a quick phone call from a friend - a Teetotaller at that. I sat and talked for a while, and guzzled down five or six of the tough little buggers (I got it confused with seven - one of them pulled out a filling and I swallowed it. c'est la vie.) I was scheduled to meet 'Mr. H' at a local snooker club in around 40 minutes - just enough time for it to kick, so I sat and watched the best of England's 'essential' selection at this juncture.</p><p>Teedly tee. Waiting's boring. The simpsons grew more interesting and I felt a heavy, subduing sensation onset around three minutes before I had to go. Excellent timing.</p><p>Just before I left, another little nugget of goodness in the form of our browny friend Mr. Hash (please distingush this from Mr.H who was supposed to be picking me up), so I quickly rolled a pathetic little doobie and left with him.</p><p>At the snooker club, things started to intensify, and rapidly: I could hardly walk (I pounded a couple of drinks whilst catching up with people) and I felt very disoriented, perhaps a little confused. It made me a lot more attentive in conversation, and probably turned me into a bit of an arse as well (nb: at the end of the evening I was told I'd started stealing ice cubes from people's drinks and throwing them at heads), but I was also feeling sick... If a lightbulb could've materialised above my head, it would have, and '!ping!' what's that little tubular papery thingy in my pocket? Ah yes! I forgot all about that. I sauntered towards the toilet, knocking a few people on the way, noting how a few of the more perceptive people noticed how dilated my pupils were. A guy turned round (I'd never met him before) and said 'ah - at least there's someone else in here on that stuff as well', so I made a sly gesture and walked to the toilet.</p><p>After the most heavenly piss I'd ever purged from my bladder, I sat in the cubicle and sparked up the J. just a little, I thought (another side note - it's not a good idea to do this generally, as you'll end up busted by the club's (or whatever's) management, but luckily enough the cubicle was enclosed with air conditioning and a window - talk about luxuries!).</p><p>Bob Marley came up on the jukebox outside. Good choice, sir! so I tugged down half the J quickly and staggered back to where my friends were sitting, and just laid back, enjoying the people's games, the music and the conversation. I talked to a few people in-depth and learned some new things. I discussed my love for physics & computers, and of course Radiohead ('The bends' was on the jukebox at present, and the song had never made as much sense).</p><p>Towards the end of the evening, I became progressively more lucid - probably due to the drinks. I lay in the back of Mr. H's car and enjoyed the tingling sensation in my limbs, the leftover taste from the drinks in my mouth, lots of cigarettes (I'd bet I could stash away twenty glasses from the club that night and the success earned me 20 Marlboro. I guess lucky pennies are everywhere if you look for them in the dirt). Visuals were muck more detailed and 'fractal than a regular acid trip - I'd say a mixture of the dxm 'play-doh' effect I sometimes get and the expansive, complex, oscillating visuals that mushrooms give me, with a spicy dash of that creative edge LSD gives me) I could construct weird creatures made of gelatin, steam and staplers in my head, I could add crab claws and tendrilled eyes. I found that by just letting go, dropping all my self-expectations and desires towards a single creative goal, that my mind was free to mould that abstract putty any which way it wanted. And man, did it ever want to splash out on that!</p><p>After apologising to Mr. H, a good friend of mine, by the way, for being a jerk all evening and just plain freaking a few people out (funny, that. some people who haven't experienced this kind of thing before didn't really know the depth to which these trips extend if you really focus on them. They didn't even humour my weird conversations or philosophical rhetoric. One lady even came close to slapping me when I suggested she re-orientated her diet so it would only contain tripe! ah, well. some people take longer than others to learn the diverse, flexible nature of perception & consciousness, or the imagination for that matter... anyways, i'm digressing from the story). When I finally lumbered up to my bedroom, I wrote a little poem that summarises what I learned. Drum-roll, please:</p><p>I moved along to CA where the beach will beckon me,</p><p>with ham and all the other things whose company brings glee.</p><p>We sat around the campfire, and ham had been the host,</p><p>when I replied with fervour that ham looked like she'd seen a ghost.</p><p>(chorus. oh yeah, it's a song)</p><p>She said..</p><p>You know daddy, when you gotta get straight</p><p>ham is the center to which we all relate</p><p>the glazing's diff'rent by all eyes</p><p>but it always comes out a pig just the same, just the same</p><p>I said it cometh out a pig, just the sa-ame.</p><p>I bit into a clove, or a peppercorn perhaps</p><p>the piggy little piece of flesh fell on out my gawking trap.</p><p>But ham told me not to worry, 'cause she said 'it's just the way</p><p>when the taste is just the same but the coating's really lame.'</p><p>(chorus)</p><p>When I said that ham was right</p><p>she'd just roll her eyes and bob.</p><p>her little pinkish boobies I coud rob I coud rob.</p><p>But that boundary's a crossin' where the lights are flashing red.</p><p>You'll find your new religion when you are supposed to see,</p><p>but just try to remember that your sight is really me.</p><p>That poem probably seems quite stupid, yes, but it's a good analogy of how I felt that evening. Before that little Rubicon of thought, those insights I'd ignored when I was less than rational, I thought, basically, that I was flawless compared to everyone else. I'd be the vessel through which divine arrogance flows. But I realised that if I was attentive to the people around me, not just my friends, I could feel their pain, their sensitivities, their nuances. They became so much more faceted and complex than the assumptions I'd made about them, and I was much less diminutive towards them as a result. I guess, you could say in a nutshell, that I learned humility and empathy, and I now regard them as two of the most essential tenets of anyone's philosophy on life.</p><p>Over and out...</p>",
 "year": "2002",
 "id": "19679",
 "gender": "Male",
 "timestamp": "2005-10-14T07:00:00.000Z",
 "views": "7917",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  },
  "1": {
   "time": "",
   "amount": "0.5 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis - Hash"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol"
  },
  "3": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 }
}
