{
 "title": "Ketamine and the Exploration of Consciousness",
 "author": "B.M.J.",
 "citation": " B.M.J.. \"Ketamine and the Exploration of Consciousness: experience with Ketamine (ID 1968)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1968",
 "substance": "Ketamine",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "100 mg",
  "insufflated",
  "Ketamine",
  "(powder / crystals)",
  "",
  "100 mg",
  "IM",
  "Ketamine",
  "(liquid)"
 ],
 "report": "<p>Part I</p><p>Recently I had the good fortune of experiencing ketamine for the first time. Coincidentally, prior to an acquaintance giving me three small doses of 100mg powder each, I had begun thinking about contacting a mental health professional to discuss what had been ongoing bouts of depression over the past two years. I've never sought professional medical help nor have I received any medication in this regard. My acquaintance suggested that I use ketamine nasally and preferably on an empty stomach. It was also suggested I find a comfortable place to lie down. So after dosing, I found a comfortable position, closed my eyes, and began focusing on breathing.</p><p>Within a few minutes, the 'high' came on. As my breath began to envelope space as I knew it, and as the physical self disappeared leaving only the mind (Buddha Consciousness), my entire being became saturated with a sense of well-being. Areas of conflict in my life appeared and resolutions were easily formed, and tensions, both physical and psychological, gave way as I examined my reaction to certain events. I felt that I was now part of an integrated whole. As external reality reappeared, I felt tranquil and elated. It seemed as if tons of mental baggage I had been carrying around had fallen free.</p><p>There were very tangible results from my three experiences. Several areas of conflict related to my business were now approached differently based on ketamine induced insights. I also began to consciously focus on the present and reduce anxiety related to unfounded worrying about the future, which has been a source for my depression. I immediately kicked a three year cigarette habit and what had become a steadily increasing drinking pattern was greatly moderated as alcohol no longer seemed particularly relevant to my life.</p><p>Over the course of many years I've have experimented with nearly every substance and though many of them have offered valuable insights and experience, as I've gotten older the downside has tended to exceed the upside, particularly in terms of the duration of the experience as well as physical side effects. Neither of these two elements seem to exist with ketamine. In fact I have found such overwhelming potential in ketamine that I have attempted to contact several psychiatrists in hopes of obtaining a prescription as I personally feel there is more work to be done. Needless to say, I have not received a single response. Perhaps the idea of an individual taking a couple of 'trips' and resolving a whole range of issues would undermine the careers of many so-called 'mental health practioners' who undoubtably benefit from the Pop-A-Daily-Pill Culture here in the U.S.</p><p>Part II</p><p>Recently I had my first experiences with 'K' by snorting 100mg. As I researched what little information is available about ketamine and various individual's experiences, naturally I became interested in its possibilities via intramuscular injection. Having never used a needle before, obviously I experienced some initial trepidation in preparing for this. It has been suggested that injecting ketamine can cause pain or soreness in the affected region for a period of days or weeks. Quite frankly, this wasn't my experience. I purchased 29 gauge syringes and prepared two 50mg doses, one for the left shoulder, one for the right shoulder. There was little if no sensation while injecting nor any soreness in the days that followed. In any case, within in a few seconds of the second injection, there was an enormous surge as the drug took effect. Although my previous sessions with ketamine gave me a sense of what was coming, the magnitude of the ketamine rush from injection went beyond anything I had ever experienced. A crescendo of sound and chaos ensued while my physical state seemed to take this precipitous fall into nothingness. Immediately my awareness of breathing dissappeared and for a moment I attempted to hold onto what little remained of myself. But as quickly as initial panic appeared as quickly it dissappeared (and this is one of the many positive characteristics of 'K' - negativity comes in slightly cool pale shades that quickly turn to positive warmth) and a soothing journey began.</p><p>There were many facets to the journey. I visited many different environments: at one moment I sat on a heavily forested beach in Costa Rica and was wrapped inside some very sweet song by the Grateful Dead (and I'm not even a Deadhead) that I had only heard one before called 'Jimmy Row' - it was very peaceful on that beach, I can assure you; I then saw a bright light open above me and an old, white bearded man appeared who I took to be the saint Nicholas (without all the Christmas baggage) and he laughed while telling me that he was the spirit of peace and love - I remember opening my arms in wide embrace and his spirit entered me; many smiling friends and family members visited me and again the two words 'peace' and 'love' kept their repetition; thoughts of death in terms of eternity were a constant theme and it struck me that finality as we often conceive it to be may in fact not be true. Perhaps the key aspect of the journey was the strong reminder of the need to be aware of the universal and not be overly obsessed with the particular. By the time it was over, which felt like a thousand years, I managed to make out the clock in the room and less than an hour had transpired. I spent perhaps the next hour in relaxation as I fell into a deep, rhythmic breathing.</p><p>Having come to an understanding with 'K', I would like to offer some caution. There is simply no way to physically react while undergoing the journey. You cannot speak, you cannot move. For this reason, some serious thought ought to be given to preparing one's environment to avoid any potential accidents. You'll be out for at least one hour. Moreover, it would be a very good idea to inform anyone who might encounter you while on the journey as to what's up because it's conceivable they might stumble on you and quickly dial 911. No joke. As is the case with any substance, proceed with great care and caution. </p>",
 "year": "",
 "id": "1968",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-20T07:00:00.000Z",
 "views": "29508",
 "dose": {}
}
