{
 "id": 19682,
 "title": "Totally Unexpected Intense Visuals",
 "date": {
  "submission": "2003-11-06T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Arctaeon",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Vitamin C"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam"
  },
  {
   "time": "2:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "4:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "The e tabs below were pink/red snoopies from Canada. We had taken them before with ZERO visuals. We even took the same batch once with small booster doses of 2-c-I and 2-c-t-7  :  3-5 mg apiece, and THIS had no visuals and was a 5 day comedown with hellish paranoia and very little e like effect. I hesitantly tried these pills again, thinking they might not be mdma. I had had them tested with GCMS and was told they WERE nothing but MDMA. I still doubted it after the last experience, which was also done w/o 5-h-tp loading.",
  "Something pushed me to take a piracetam with these. I took one tab, and went into an incredibly clean, pure e space, almost as good as my first time. And we only do e every 3-6 months... the comedown was gentle, no sharp drop as usual. And the e ride lasted almost 10 hours. It was not over!  This is what happened next, visuals the likes of which I have not seen on anything but DMT or high dose salvia. But with a totally clear head, as I was over the e by this time. In fact I would still be seeing gorgeous Arthur Rackham style line visuals in surfaces for the next few days. The paranoia was only a twinge this time, and the body pain was confined to a 2 day sharp headache.  I gobbled 5-h-tp in gram quantites before, during and after this experience, along with many grams of ester C.  The Piracetam was 800 mg along with the initial tab, 1 half tab was taken at the 2 and 4 hour mark.",
  "VISUALS:",
  "I noticed the new small crystal singing bowl was glowing in what looked like pink cuneiform script, but on close examination it was melting into also sanskrit, egyptian heiroglyphs and enochian/(atlantean).",
  "I played the bowl a bit and then picked up the large, double terminated crystal we got in china town last year, after dreaming it was there.",
  "I looked in the crystal and .... my god!",
  "A little blue parakeet, as sharp as high definition TV appeared! He seems to personify some kind of 'librarian'. HE LOOKS exactly like F., our little",
  "budgie!",
  "I could name a period of history, any period, and he would summon it. I could see every feather on his body.",
  "I went to the Pleistocene Epoch, saw huge armadillo? creatures with shaggy black fur and a white skunk stripe.",
  "I saw Heironymous Bosch in his stone studio, painting his great Tryptich!",
  "I saw many alien cities with throngs of strange inhabitants.",
  "I saw many millions more things, and all the bits of opaque stuff in the crystals was slowly circulating ...like blood and organs. Are crystals 'alive' at a time scale different from ours?",
  "This was all like a movie, THAT clear. MORE clear.",
  "Always the bird would fly in and clear away a scene and bring on a new one.",
  "At one point a graphical option came up with 'layers' of history I could choose from.",
  "I saw a pyramid open with blinding light, and a tall, glowing, utterly regal Egyptian Queen come out and greet a flying machine that resembled a beetle.",
  "I saw huge, boxy robots eating methane on a frozen moon....",
  "many views of the Arthropodic Band, great insect civilizations, many biomechanical ....",
  "I am going to practice all next week, I don't want to lose this ability again. I thought it was gone forever.",
  "need a larger crystal to enlarge the images, I know now why A.C. strapped the topaz to his head - larger field of vision. many things I saw in the crystal were on the surface of imperfections in the crystal matrix that were no more than 3 or 5 millimeters across...these had incredible detail too, but it took huge concentration to keep them in focus.",
  "the entire excercise lasted 45 mins, and was utterly exhausting...., tried to skry the great sphere as well, dimmer amber colored linear designs",
  "the animals of the old ice age - more amazing than I even pictured or imagined!",
  "I am going to try piracetam with all my serotogenics from now on.",
  "One thing I saw was very surprising, I forgot it until the next day. I seemed at one point to be in 2-way visuals with a lovely female humanoid sitting at a complex terminal setup or audio mixer computer? It had racks like a mixing setup. She seemed to see ME! and she was VERY startled!",
  "There were also a number of 3-d visuals in the room with us, which I have never had before. I never conceived them as possible. I suspect now my visual skills were probably atrophied by overindulgence in 2-d scrolling video games as a child?",
  "These were DMT quality visuals, even better and sharper and I was able to think, speak and deal with them in a very sane and logical manner.",
  "Now to get audio also? And more control over the 'channels'? Some of these visuals were obviously being morphed by or drawn from my unconcious, but most of it I believe is really from the 'Memory of Nature'.",
  "And this from what is certainly just plain MDMA!  Hail Piracetam? This was TOTALLY unexpected, at a time I am getting less and less from psychedelics, giving them up really....."
 ],
 "erowid": {
  "id": "26413",
  "citation": " Arctaeon. \"Totally Unexpected Intense Visuals: experience with MDMA & Piracetam (ID 26413)\". Erowid.org. Nov 6, 2003. erowid.org/exp/26413",
  "substance": "MDMA & Piracetam",
  "views": "18810"
 }
}
