{
 "id": 19691,
 "title": "My Ride on White Train",
 "date": {
  "submission": "2000-09-12T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Toasty",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "PCP",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": {
    "unit": "",
    "quantity": "1"
   },
   "administration": "insufflated",
   "substance": "PCP",
   "form": "capsule"
  }
 ],
 "report": [
  "I examined the pill in my hand. It was a small capsule filled with white powder. I had been told they were speed, but my source was very unreliable. He had found a bag of hundreds of these pills hid in the ceiling of his apartment. They had not been tested. I considered myself test subject number one. As I swallowed the pill, I wondered what was in store for me. I am a well-experimented drug user. I have eaten more than eight tabs of acid in one sitting and am not a lightweight. Yet throughout my numerous drug experiences, I have never stumbled upon a high like the one I received from PCP.",
  "After a half hour to forty minutes, I began to something. As I walked down the hall and the stairs, I felt as if I were in a K hole. The stairs were my tunnel and I was burrowing through like a mole. I stumbled out the door and went into my neighbors house. He too took some and we stayed in his basement for a long time. In that basement, I felt a number of different feelings. I lost control of my body, almost as if I were on DXM, a drunk trippy sort of feeling. Yet at the same time, I was feeling a longing for affection. I wanted to be touched but I didn't want anyone to touch me.  I went out to eat, yet found myself staring at a spot on the wall with my mouth hanging open. I was still there, but I didn't really have any control.",
  "The following day, I decided to experiment again. This time, I took one orally and snorted another one. The kick was almost immediate. I was walking down a road, yet had no idea where I was going. I would find something familiar, but forget about it the moment I looked away. My two friends who were with me, one also on the drug and the other one sober, walked along with me, yet I didn't even know they were there. We stopped in a small bar that we had never been in and sat down on a couch near a pool table. The television was on. As I tried to watch I noticed that I couldn't see things clearly. My eyes felt lopsided on my face; one on my forehead, the other near my mouth. A big bowl of popcorn was sitting on the table. As I put a handful in my mouth, I felt my teeth crumble away. I couldn't remember how to swallow. After a few attempts, I finally choked the popcorn down. I turned to the television and as I watched the Simpsons, I floated around the room. I looked at anyone who entered the bar or walked by, my mouth hanging open, my head dangling from my neck. I went into the bathroom and looked in the mirror for a long time. I couldn't quite make out my face. I remembered that I had to pee. I sat down and stayed there for god knows how long. I couldn't remember what to do. I kept looking at the toilet paper in confusion. Finally I left the bathroom, although to this day I can't remember if I ever figured out what I was in there for.",
  "I walked back to the couch, trying to find my way to comfort with my friends. I kept asking if we had been caught, if I was in trouble. I was so paranoid that we had been caught, that we were really in jail or that I was a teenager again getting caught by my parents. Every cigarette I smoked made me feel higher. I didn't dare take a bong hit. After we left the bar I went back to my house. I sat in my room alone, contemplating all the things I could do. I kept feeling that I was free, while at the same time I felt that I was caught. Outrageous thoughts would cross my mind. I kept talking myself in and out of them. Finally I think I fell asleep, although I may have been awake and unaware of reality. I woke up feeling like shit and wondering what the hell the mystery drug was. Even though I had hated every moment of it while on it, I had the urge to try it again. I had never been as high as I was on the mystery drug and I don't think I ever want to be again. We had nicknamed it 'white train' because it was white and it hit you like a train. Later, when my friend had been busted for dealing, we found out that it was PCP--- a drug I will never touch again."
 ],
 "erowid": {
  "id": "2643",
  "citation": " Toasty. \"My Ride on White Train: experience with PCP (ID 2643)\". Erowid.org. Sep 12, 2000. erowid.org/exp/2643",
  "substance": "PCP",
  "views": "90074"
 }
}
