{
 "id": 19715,
 "title": "Effective, Without Screwing Up My Head",
 "date": {
  "submission": "2006-05-24T07:00:00.000Z",
  "experience": "1993"
 },
 "author": {
  "name": "Sinnlos",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Clonidine",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>I am a smoker, and have been since I was 14..that was in 1987. I have tried nearly everything there is to quit. Clonidine worked for me...at least until I stopped taking it.",
  "I was prescribed Clonidine twice in my life. When I was 21 my doctor prescribed it as a smoking cessation aid. I didn't want any psychoactive substances because I was a student and needed to be clear headed in class. He suggested clonidine.",
  "I took it and experienced no nicotine withdrawl at all, no PHYSICAL withdrawl that is..I still had all the psychological factors to contend with, missing the taste, the actions, the instant gratification, but I could sleep. I wasn't irritable or binging on any food I could get my hands on. My urges to smoke while using clonidine were urges of habit, not urges of physical addiction.",
  "Clonidine fights only half the battle. It is rather EASY to get over physical nicotine withdrawl in a matter of 2 days even going cold turkey. Clonidine gets you over that small physical hump right away, but the matter of will power and taking the path of least resistance is still up to me.",
  "I was also prescribed clonidine when I was visiting friends in Ireland and contracted salmonella poisioning. I suffered severe nausea, vomitting, diarrhea and cramps. The doctor said the clonidine would act as an anti-emetic and supress the vomitting reflex. I had never heard of clonidine being used as an anti-emetic before...I did stop throwing up, but then again the poisioning may have just run it's course.</p>"
 ],
 "erowid": {
  "id": "26506",
  "citation": " Sinnlos. \"Effective, Without Screwing Up My Head: experience with Clonidine (ID 26506)\". Erowid.org. May 24, 2006. erowid.org/exp/26506",
  "substance": "Clonidine",
  "views": "15724"
 }
}
