{
 "id": 19717,
 "title": "Pure Wierdness",
 "date": {
  "submission": "2007-05-06T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "MindConquest",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "Reading about Salvia is what sparked my already blossoming curiosity about exploring my mind.  I ordered a gram of 5x exctact from online, and soon got a group of interested friends together to both try it with me and make sure I don't hurt myself or anything while on it.",
  "One of my friends was extremely interested in giving it a try, so we all decided to watch him do it first and then decide if we still wanted to do it or not.  In my mind, however, I was willing to give it a try even if the experience was going to startle me. We went to the woods by my house and went down a long trail to a darker part of the path.  After loading 1/20 of a gram on a nice glass piece with a screen, I instructed him to torch the Salvia as quickly as possible and hold it in his lungs for approximately 30 seconds.  After about 20 seconds from inhilation, he suddenly got very still and wide eyed...and said 'this is fucked up'.  He stumbled around a little bit, feelings as if he 'had little weights all over' and said that we all looked like cardboard cutouts.",
  "I then decided that I wanted to try it in the safety of my home.  We went up to my room and put on some trance music which I don't normally listen to, but I felt it would fit the situation.  I smoked the same way, and soon felt like I was being pulled to the ground by a force that was telling my mind that it's where I need to go.  My skin got somewhat sensitive, moist and cold and as if I had goosebumps.  My shirt felt irritating against my skin.  I also felt somewhat dizzy, but still clear vision.  Objects seemed more interesting...a pop can on my desk has a sort of mystery behind it and looked as if it were frozen in time.  Other than those experiences and a general feeling of being in a different aspect of reality and feeling somewhat alone despite the people in my presence, I didn't have a total perspective change or spiritual visions.",
  "My next experience proved to be incredibly strange to say the least.  It was a complete loss of my normal ways of thinking and going about life.  It gave me a new level of respect for the ways in which our vastly complex biochemistry and neurological pathways work, and how amazing it is that a plant is capable of producing a chemical that can interact with our body is such a way to make us feel so strange and different.  We all were bored one day and realized that we still had that little baggie of salvia extract left...and were wondering why we hadn't been completely thrown into another dimension.  We went back to the trail on a perfect summer day...with a slight rainbow in the sky, deer walking around in the lush green woods, the essence of life in the air.  My friends all smoked it again and experienced nothing that they hadn't last time.  My turn came last, and I was determined to get it right this time.  I packed a bit more than I had previously in the pipe, and held the flame on it the whole time I inhaled to ensure that it was all vaporized.  The smoke tasted somewhat more 'dry' than weed, a distinctly different flavor somewhat like paper, and also very easy on the throat and mouth.  I held it for about 30 seconds, and then is started...",
  "I felt the strange gravitational effect like my previous attempt, and decided to see what it was like to walk so I took a few steps away from the group.  I just turned my back from them while looking at the grass on the ground, and then when I turned back around, they were standing in the same place but seemed to be further away than they should be.  It seemed like a huge voyage to take a couple steps towards them, a task that in reality only took about a second and a half, but in Salvia time lasted about 10 seconds.  I distinctly remember trying to ask them what the fuck happened to me...completely forgetting that I had smoked anything at all.",
  "Then IT called out to me, the Salvia world started to come through, the planet was saying to me 'yep, I created the people you are talking to, isn't it strange?'  The only things I could see with my eyes were the trees around me and how I connect to them in a way, and how it is on a deeper level than socializing with my friends (which is also important, just different). The earth and its mystical creator had to teach me something, and at the same time it's something I'm always been slowly experiencing through my life but just never realize because of my daily life clouding it from my attention.  I remember thinking something along the lines of that, only it's harder to describe.",
  "The indescribable thought was something I thought of as funny, but then the funny thought was so out of this world and something that I felt I had known forever but was hidden under all the trillions of bits of information that my mind has blocked it with over the years, but then realized how I had been blinded from seeing this true reality for so long...a thought that scared me because when I return I know I'll forget it.  This entire vision lasted probably only 2 seconds, but seemed to last at least a good 20 seconds of contemplative thought (probably because it was so strange yet vastly amazing and 'always there', that in retrospect...I FELT like it must have taken 20 seconds to take all that information into my brain.  What I just said is hard for ME to even try to explain, so I don't expect anyone who hasn't experienced Salvia to try and understand it.  What happened after this immediate onset of the experience was quite frightening.",
  "The strange thing is that I THOUGHT I was asking my friends what happened, but I was really just saying strange random bits of words all clumped together.  I made no sense to them whatsoever, and I desperately seeked their understanding and comfort of knowing what the real world is like.  I forget what happened here, but the next thing I know everyone suddenly appeared very far down the path.  Apparently, they didn't know how fucked up I was at the time because they have no idea how powerful and scary the salvia world can be, so they took off back towards the car.  I take off on my voyage throught the never ending jungle path towards them, seeing them so close...only 50 feet away, yet just looking down at my running feet I'm astonished at how long it is taking to reach them.",
  "I then turned into a completely crazy madman running through what I thought was a jungle.   This is another hard to explain 'transition point' of my experience where I felt like I was living a nightmare, even though I was completely awake. I started running down the path after my friends, only suddenly I felt like I had to run AWAY from them.  Keep in mind there is really only ONE path in this forest preserve.  I felt like I was running down different winding paths throught he forest, laughing at the thought that I was trying to get away from them and they couldnt' catch me.  It's so wierd to look back on the thought that they were really ahead of me the whole time, and I had been running straight towards them the whole time!",
  "I just felt totally alone in the world of Salvia, with only unknown 'forces' or I guess you could call 'life' other than human somewhere close to me.  I could feel them and know they were near, but could never see them with my own eyes.  All I saw was forest and my friends 50 feet ahead.  But I knew they were there.  It was a combination of feeling drawn towards the corners of my vision but when I looked they weren't there, and KNOWING that they were somewhere in the forest behind all the leaves and trees in the distance...watching me.  I felt strangely drawn towards them with curiosity and almost as if I knew them already, but at the same time I was hesitant and frightened.  When I finally reached my friends, I am still only half making sense.  I wanted to return back to reality again, this was too wierd for me.  The effects gradually wore off like a weed high does, but I could still sense that there was wierdness to the world as it faded away.",
  "I know I know, it's a fucked up experience, but I thought I would share it with everyone.  I haven't experimented with it again, but my friends have.  They recently compared it to 'shrooms' which I haven't yet tried, and another friend said the patterns on a rug started moving, and when he looked away from the rug he saw the patterns on peoples faces and everywhere in his vision.  He flipped out and needed to go walk around outside, and felt that he had 'strange hallucinations' that night unlike he has ever had before.  All I have to say about Salvia is that it is TRULY powerful, so don't just think it's going to be a fun recreational high.  It's not what I would call a happy experience like you would want when going out and doing fun things with your friends.  Easy words to describe it would be insightful, frightening, strange, and certainly hallucinogenic and 'insane'.  If you want to see what it's like to have a nightmare while awake and experience a COMPLETELY diffent reality, then Salvia is your tool.  Don't underestimate the power of this mystical plant, and be careful.  Peace."
 ],
 "erowid": {
  "id": "26510",
  "citation": " MindConquest. \"Pure Wierdness: experience with Salvia divinorum (5X Extract) (ID 26510)\". Erowid.org. May 6, 2007. erowid.org/exp/26510",
  "substance": "Salvia divinorum (5X Extract)",
  "views": "2620"
 }
}
