{
 "id": 19722,
 "title": "The Nightmare of Coricidin",
 "date": {
  "submission": "2000-08-03T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Anonymous"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "[Warning: Coricidin Cough and Cold contains Chlorpheniramine Maleate which is dangerous in high doses.  See DXM Brand Warnings for more info.]",
  "At first I would take Robitussin and always tripped good.  But the taste eventually got to me so I had to switch to pill form. I managed to find Drixoral Cough Caps, which are no longer available for retail sale (despite what you may have heard or think) and took those. Eventually, however, I had to revert to plain old Coricidin Cough & Cold. At first I thought it was great, except for the nasty candy-coating taste of the pills. But I was obviously blindsided by the terrible antihistamine it contained:",
  "Chlorphenaramine Maleate (CPM), 4mg in each pill.",
  "Eventually, at large enough doses it really managed to fuck up my vision and disrupted my concentration. The worst was yet to come though... Some months went by without any serious incidents. However, it eventually got to the point that it hurt my eyes and my optical nerves during the trip. I would lay in bed awake for hours, hallucinating, and each CEV would put strain on my eyes and practically felt that a needle was ripping through my tender eyeball. Ouch!!",
  "I tried to get off it but I couldn't go back to the nasty taste of syrup. And furthermore I had so many wonder experiences on DXM that I couldn't just altogether forget about it. So I stopped DXM altogether, just forced myself to let go and found a decent job. Some time went by until I once again had the urge to get a good buzz going and I desperately wanted to do DXM again. So I tried Coricidin, but this time the bad effects weren't present. Great, I thought, as I tripped over and over again... gradually becoming addicted again like I once was. Then one night I made the mistake of redosing (the buzz wasn't lasting long enough and I wanted to prolong the trip...let me tell you, big mistake!). Anyway, from that night on whenever I did Coricidin I got excruciating pain in my eyes, pin-prick feelings and general pressure until it felt like my eyeballs were going to pop. I just couldn't take it anymore... the antihi-histamine was ripping me apart, and my health soon went downhill.",
  "I thought I could handle the sober scene for awhile, but I was quickly proved wrong when I started to have nightmares night after night and slight headaches, maybe these were withdrawal symptoms... or maybe after effects of Coricidin, I dunno... but it eventually went away after time. But I still wanted to trip. Finally I managed to find some Delsym cough syrup (which is not nearly so bad tasting as Robitussin) and Sucrets 4, which I'd recommend either of those ten times over Coricidin. Or even if you can, just use pure DXM from suppliers such as Wanman. I never realized how much Chlorphenaramine Maleate was hurting my trips and my health. Now I do, and I would caution anyone strongly against ever taking Coricidin Cough & Cold. It's just not worth it!"
 ],
 "erowid": {
  "id": "2653",
  "citation": " Anonymous. \"The Nightmare of Coricidin: experience with DXM (with CPM) (ID 2653)\". Erowid.org. Aug 3, 2000. erowid.org/exp/2653",
  "substance": "DXM (with CPM)",
  "views": "62869"
 }
}
