{
 "title": "Reliving My Life Over and Over...",
 "author": "gn",
 "citation": " gn. \"Reliving My Life Over and Over...: experience with Cannabis (ID 19732)\". Erowid.org. Sep 29, 2005. erowid.org/exp/19732",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "</p>\nMy terrible experience happened in my 1st year at university - 5 years ago. Believe me the effect of the bad trip still rears its head from time to time and needless to say I dont smoke anymore....</p><p>Up until this period I had smoked alot and taken much ecstacy, speed, cocaine etc. I was well into my house music from an early age and drugs went hand in hand with my scene. So when this happened it was not a bad first time experience or something! I had a smoke, albeit quite alot, with a friend and things seemed normal, a short time later I freaked out and remember a really bright light before my eyes opened. It was like a moment of realisation, I actually remember saying 'oh no.' I was literally petrified but dont really remember what I had seen....I was under the impression that everything I was doing I had done before, for some reason the number 4 was relevant, had I done everything 4 times before? I truly believed this and cried. The fucked up thing is that my friend had freaked out too and we managed to spook each other senseless....I walked out of the halls with a pal and we went on a big walk, I was absolutely petrified. I picked up rubbish as I went, truly bizarre behaviour. On my arrival back at the halls I washed all the dishes in the kitchen, very bizarre behaviour! I wanted to call an ambulance because I felt so bad but decided against it. Eventually other friends calmed me down but I refused to sleep alone, too scared, a friend of mine slept on the floor to keep me company.</p><p>I suffered deja va alot over the next couple of years and although I now put this down to happening when I am really tired / hungover I did convince myself that I was actually dead and reliving my life over and over again. I believed I was in a living hell and that perhaps the big moment of realisation that I had felt was that I was dead and was now being punished by facing an eternity in hell reliving my life over and over again.</p><p>People who think cannabis is no trouble dont realise that it seriously messes some peoples whole sense of reality and can effectively wreck their lives. The funny thing is the friend of mine who had been smoking with me is still a serious smoker but when I am around him when he is smoking, it sometimes does unsettle me and I feel uncomfortable. Many times I have thought about going to see a psychiatrist for specialist help but I think I am just about over it now and ready to put it behind me now. Truly the most defining and scary moment of my life.</p>",
 "year": "1998",
 "id": "19732",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2005-09-29T07:00:00.000Z",
 "views": "4877"
}
