{
 "id": 19741,
 "title": "Seeing Energy with the Help of Mushrooms",
 "date": {
  "submission": "2007-09-04T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TheSmokyTiger",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "Me and my buddies went out to a remote cabin in the whiteshell region of Canada between Manitoba and Ontario. It was the middle of winter, New Years actually.",
  "At around 3 or 4 pm we decided to take a long walk through the woods and across a frozen lake to the ruins of a burned out hotel. The whole trip took about 2 hours. It was pretty cold but not bad. We were all bundled up with big jackets and stuff. There was a good 3 feet of snow on the ground. We brought the bag of mushrooms with us and I decided to eat a lot of them when we got to the ruins. For some reason all my buddies chickened out there and so I took them alone. I'm not sure exactly how much I took but at least 4 grams.",
  "So we started walking back on this vast frozen lake and I decided to let the others go ahead. I often like to be away from people when I'm really high because I feel that others have away of bringing me down. I especially favor silence in order to come up. And I started to come up really quickly. Soon my freinds were just little dots ahead in a sea of white and I was starting to have elevated thoughts while simoultaneously losing my sense of where I was and what was going on. I can remember looking up and seeing a helicopter fly overhead and I felt like the helicopter was just a little bee and I was a huge giant. But this perception was just entertainment. Eventually I hit the edge of the lake where the path went into the forest.",
  "At this point a dog came out of the path and came towards me and then past me. Really odd since I was totally in the middle of nowhere. I thought later that had I been truly brave I would have followed the dog and it would have shown me things. Maybe next time!",
  "So I headed into the woods. I was coming up quickly and the screen was very prominant in my vision. When I close my eyes there's this weird screen of static in front of me. I find when I get high the screen gains more prominence. Patterns appear on it and swirl around or noises come out of it.  In really hightened states the images on the screen become so real that I can't differentiate between the screen and reality.",
  "This time I was really interested in experimenting with the screen and trying to figure out what it is and what I can do with it.  I started walking quickly swinging my arms and taking long strides and tried to focus the swirling screen on a fixed point in front of me. I don't really look at anything instead I just look everywhere at once. When I focused the swirling image this way and placed its epicentre where I was going, it felt like I was being pulled forwards.",
  "Finally I decided to just stop. I stopped and kept very still and looked around at the dead quiet forest. I noticed that the trees had a whole layer of color to them that I didnt usually see. Almost like a glowing ultraviolet blues and reds. Almost like they were a part of the screen. I found that this perception was increased the longer I was able to maintain a perfectly still body and mind. I've always tried to see the aura and at this point I beleive that I was seeing the aura of the trees. They were swaying towards me like huge brocolis. I was vividly aware that they were real living entitities who have consciousness but one that is different from ours. Slower. And the more I slowed my bodily system down the more I could tune in to them.",
  "So I decided to completely stop breathing and focused on one tree. With deep concentration the aura stage shifted to a deeper level of perception where I could see a glowing centre of the tree that was outside of the material tree itself. Like I could see this glowing orb about a couple feet apart from the tree that was the trees centre. At this point I pulled back and told myself. This is not an illusion. What you are seeing is an actual phenomenon. I made sure to pull myself back to a regular state to emphasize and remind myself of this vision.",
  "Other then being able to see different spectra of reality, when I was at this totally still, unbreathing state I was sure that I would not be visible to someone who walked by. I just knew it. Because my consciousness had slowed to a point that they just wouldnt notice me. It seems far fetched but I've read stories about sorcerors and yogi types who could do this. Nobody walked by so I couldn't test it. Next time!",
  "Anyways, long story short I started to come down and so did the sun and I was lost in the woods for awhile and all my friends were worried but then I finally found the cabin and proceeded to consume many more mushrooms and booze and chatted debauchery style the rest of the night."
 ],
 "erowid": {
  "id": "43279",
  "citation": " TheSmokyTiger. \"Seeing Energy with the Help of Mushrooms: experience with Mushrooms (ID 43279)\". Erowid.org. Sep 4, 2007. erowid.org/exp/43279",
  "substance": "Mushrooms",
  "views": "3496"
 }
}
