{
 "id": 19747,
 "title": "Into the Hallways of Perception",
 "date": {
  "submission": "2007-04-11T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cycle of destruction",
  "gender": "Male",
  "weight": 64
 },
 "dose": [],
 "report": [
  "When I was younger, I would smoke herb and drink daily. Eventually, both got boring. At 15 I tried ecstacy and fell in love with it. I sold most of my stuff to get a boat (100 pills) and sold half of them for 15 bucks a pill, a good price here in southern california. X was my love, but soon my brain felt the heat, and I knew it was time to quit.",
  "For five months I stayed off the hard stuff, but then my 16th birthday rolled around. I indulged in LSD, another favorite of the time, heroin, meth and morphine. I never liked meth much, and our relationship was short lived. Heroin took me over, and I will powered myself off of it. Then I found K.",
  "I heard about K while I was in mexico, a short drive from my home in southern california. I was curious about an over-the-counter drug that was so insignificant, yet people swore up and down it was very intense and mind opening. On my first K trip, I railed about a quarter gram, and I was in heaven. I've always loved to read, and hated TV. I like to learn, and K answered my questions. It didnt just make me see colors, it put me inside the universe of my own mind; and I wanted more.",
  "I stayed with a friend in mexico just for the K, and it became my life. I didnt work. I didnt play. I just chased my sobriety and ignorant mortal view on life off with ketamine.",
  "Finally, I decided that the world we are forced into by birth was the alternate dimension that K helped you escape, but at the right dose would free you from. I stayed off the stuff for about three weeks. During this chapter in my life I really had no concept of time, it was pointless to me. Once I prepared my lines, rolled up my 'lucky' two dollar bill, and drank a small glass of orange juice I stared at myself in the mirror. Just stared. I did every line staring into my own eyes, and then felt myself suck through to the otherside.",
  "I am pretty sure I died, or at least tampered with the thin drape that seperates life from death. I found God, and God is not in religion. God is everything. Positive and negative, right and wrong, exsistant and non exsistant. God is the nexus of the universe, while being the universe itself.",
  "We are parasites. We feed off of the earth to survive, killing it in the process. We are nothing more than matter bumping into itself and re generating. Death is another word for freedom, the ultimate goal for any rational thinker.",
  "To my dismay, my mortal sight came back, but this is the strange part. If you recall earlier, I noted I was sucked into the other side of the mirror. To this day, everything is backwards to the way it used to be. I live in the other side of the mirror, and this is the life long physical effect K has left me with.",
  "Sadly, I found that the meaning of life is only to find life has no meaning."
 ],
 "erowid": {
  "id": "43292",
  "citation": " Cycle of destruction. \"Into the Hallways of Perception: experience with Ketamine (ID 43292)\". Erowid.org. Apr 11, 2007. erowid.org/exp/43292",
  "substance": "Ketamine",
  "views": "9211"
 }
}
