{
 "id": 19745,
 "title": "Unexpected",
 "date": {
  "submission": "2005-08-24T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Neko",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Vitamin C"
  },
  {
   "time": "0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  },
  {
   "time": "12:00",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Vitamin C"
  },
  {
   "time": "12:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  }
 ],
 "report": [
  "Well my girlfriend and I (Koneko) had just been to a massive rave and so we decided to take a couple vitamin c's (1000mg) 2 5-htp's (100mg) and one multivitamin. We didn't expect much to happen other than to get rid of the radicals left over from our Ecstasy trip at the rave. We all crashed but I felt extremely giddy and everything was quite funny. I twitched quite a bit but I assumed that was from being sketchy the morning after the rave.",
  "The next day we decide to take another 2 5-htp's (100mg) and 2 vitamin c's (1000mg) to make sure we still had a good amount of antioxidants and serotonin to counter balance the after affects of E. So we head to the mall and did not expect what happened later on. We decided to grab a seat and both of us seemed to feel slightly numb, followed by a weird spacey feeling. The affect wasn't placebo because we did not anticipate the fact that we might feel weird or... if you could feel high on 5-htp. We decided to get up and move around but our bodies felt numb. People walking looked almost... not real and we both felt like we could walk right through them and think nothing of it. We felt like we were the only ones there and everything was continuing on around us. Any slight motion seemed to be singled out and moved very smoothly, especially escalators and people walking. We had mild euphoria and were really interested about what caused this feeling. I decided I should find something to eat and so we headed to Mc. Donalds, grabbed the special meal deal that day and.. the meal was the best Mc. Donalds I had ever had. Taste was projected 10 fold, I really enjoyed it. It was quite an experience and very unexpected... we still don't know exactly what it was but, completely suspect the 5-htp and the serotonin overload we had that day.",
  "I think it may have been the double recommended dose over two days. The total experience lasted a few hours,.. I'd say 2-4. I wouldn't recommend  experimenting with higher doses because of the risk of serotonin syndrome where your body can't handle the huge serotonin increase which can cause black-outs, and even coma. I should probably do a little more research on that but, just wanted to share this weird trip we had in the mall."
 ],
 "erowid": {
  "id": "43289",
  "citation": " Neko. \"Unexpected: experience with 5-HTP (ID 43289)\". Erowid.org. Aug 24, 2005. erowid.org/exp/43289",
  "substance": "5-HTP",
  "views": "36999"
 }
}
