{
 "id": 19750,
 "title": "More Loved than I have Ever Been",
 "date": {
  "submission": "2008-03-10T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Noman",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.0",
    "quantity": "1.0"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "7.0",
    "quantity": "7.0"
   },
   "administration": "oral",
   "substance": "Mimosa tenuiflora"
  }
 ],
 "report": [
  "At 9:17 PM I took 1 gram of Syrian Rue extract prepared as described by Jim DeKorne (Psychedelic Shamanism).  At 10:17 PM I took the Mimosa extract. I had used the methanol process as described by Deducer, but instead of drinking the liquid I reduced it to dry, powdered the result, and put it in gel-caps. At around 11:00 PM I got the 'here we go' feeling and the mosaic pattern that I've heard about appeared behind my eyelids.",
  "I understood this to be 'the Code', sort of Yage's version of a copyright warning or liability disclaimer (it reads top to bottom starting at the left by the way, if that's of use to anyone - I can't read it but they like to throw arbitrary information around like that). I started getting cold and was beginning to realize that this was going to be quite a bit heavier than anything I'd experienced to date. I was in the living room listening to Spacemen 3 and I needed to be in bed listening to my breathing.",
  "Moving wasn't as hard as I thought it would be - just required a lot of concentration and I had to move my field of vision very slowly or the tracery of images would all crumple up together and turn into meaninglessness and I'd have to wait for things to clear. I have used mescaline and psilocybin and taken so much acid that I feel that I have nothing left to gain from that substance and yet I have never been so high in my life and I was still going up and yet I felt no apprehension, no fear that things would go to far, I just needed to get to bed, get warm, and get rid of this damn body.",
  "There was no nausea or discomfort at all up to this point I was just a bit uncoordinated and heavy feeling. My whole body tingled and I was very aware that she was working on my whole being (this is the point at which Yage became a she to me and I lost the separation of mind body and self). I think my lack of gastronomic distress was a combination of the methanol preparation and my preparation diet. The big problem with using Mimosa orally seems to be all of the tannins in it and I don't think that they're extracted in the methanol like they would be if the root bark were boiled in water. As for diet, I just stick to brown rice, beans, and fresh veggies the day before and fresh fruit the day of and I'll be fine. The essential is to avoid anything fermented.",
  "I was congratulating myself on my non-nausea huasca process as I got under the covers and the nausea hit. I knew that a better time to haul my ass to the toilet wouldn't be appearing for another six hours or so, so I got up. Standing over the toilet, tying my hair back, I felt a wave of dread. 'I don't want this. Fine I'll puke it all out.' I think that was my ego realizing that it was about to be erased. Then another part of me woke up and I became very calm. The nausea wasn't the frantic, crampy, sick feeling I'd envisioned but a gentle pulling out. I felt her reach deep down, I gagged once, almost looking forward to 'the Purge', to sicking out all the poison - and she changed her mind. 'Go back to bed.' ",
  "Back under the covers it hit full force. Before I lost my body I felt Yage in every cell circulating through my Qi, healing. Some people say Yage is like using a technology rather than a drug and I agree. It felt very busy and purposeful in me like a nanotechnology fixing me. Then I was in and they were all there. I had gone with the intention to explore, to learn what Yage was like. They showed me. They were eager, like people are with new toys for a puppy, and that's kind of how they feel about us, we're like pets or children to them but there is no condescension in it because hierarchies don't exist there, without physical bodies they're unnecessary. Actually, they are fascinated by and sort of envy our bodies. They adore us and I felt no malevolence, if they hurt or scare us, it's only because they don't understand physical existence.",
  "During the show I was able to return to my physical awareness whenever I wanted and could function, but it felt so cumbersome compared to the effortlessness in there. Among the highlights of what I was shown were a house that I floated through endlessly that was made entirely of dried rose petals, and some sort of hyperspatial bulk foods department that had living alien heads with transparent skulls for dispensers filled with thoughts that other entities took and replenished. The thoughts came out of the neck holes rather than the mouths and the dispensers carried on a conversation the whole time I was there.",
  "There was a certain female entity that stayed close by the whole time. At first I understood her to be Yage but later she became more -  Gaia I guess, if she really needs a name. By this point things like names seemed pretty silly to me. Between the visions I could feel her holding me, and inside me sorting through old pains like a professional organizer sorting out a closet. She would hold something up and I'd feel the hurt all over again, as strong as when it happened, then she'd shake it out and put it away and there the memory would be - without the hurt. Through all of this I felt more loved than I have ever been in my life.",
  "By 4:00 AM I was definitely coming down although physical exertion was still quite difficult. By 6:00 back to functional. Asleep at 8:00."
 ],
 "erowid": {
  "id": "43297",
  "citation": " Noman. \"More Loved than I have Ever Been: experience with Mimosa hostilis & Syrian Rue (ID 43297)\". Erowid.org. Mar 10, 2008. erowid.org/exp/43297",
  "substance": "Mimosa hostilis & Syrian Rue",
  "views": "3116"
 }
}
