{
 "title": "Magical First Dance",
 "author": "Anonymous",
 "citation": " Anonymous. \"Magical First Dance: experience with Salvia divinorum (ID 19754)\". Erowid.org. Sep 29, 2005. erowid.org/exp/19754",
 "substance": "Salvia divinorum",
 "bodyweight": "70 kg",
 "report": "<p>I've been growing a salvia divinorum plant now for about six months, and unfortunately he hasn't adapted well to the local conditions, and I've had some problems with him.</p><p>But after all the wait, I finally discovered what all the fuss is about, and trust me, it was worth it.</p><p>I first just packed a small cone of cannabis and smoked it down, before chopping up 4 large dried leaves of salvia.  I used a party conepiece, which is about the size of 4 or 5 standard bowls, and packed myself some salvia.  I smoked it, packed another one and went again.  I've read up a bit about people having problems getting anything out of salvia, so I made sure I gave the leaves plenty of heat when smoking, and held the smoke in my lungs for as long as I could. After a couple of minutes, I started to notice odd colours and patterns, and said out loud to myself (I didn't have a sitter), 'I think I'm starting to feel it'.  but things were about to get a lot weirder than that.  As I started to feel the salvia taking control and my body letting go, I realized my water bottle was talking to me telepathically.  it was telling me that I had gotten myself into something I couldn't handle, and that things were way out of control.  I argued with it for a while, before it suddenly occurred to me what the hell I was doing. </p><p>I stood up (which was quite hard, my balance was quite off), and watched my incense smoke rise up into the room.  the smoke suddenly parted in the middle, and on the left formed a long cliff, and on the right became a series of waves, crashing onto the cliffs.  Realizing the salvia had completely taken over, I climbed into bed, where I lay with the lights off listening to music (plump djs urban underground).  I was getting very intense visuals, as well as hearing things in the music that I've never heard before. </p><p>Although I fell asleep before my trip was over, the most intense part of the journey was the first 15 minutes or so, with a smooth come down for about 30 minutes after that.  The whole time I felt incredibly relaxed, and without the wandering thoughts or scattered feelings that I've experienced before with other hallucinogens.  However, I would recommend that salvia be taken with a sober sitter present, because although I enjoyed myself completely, I discovered why some people find salvia to be too overwhelming, and the lack of coordination could lead some people to hurt themselves if they tried to wander off.</p><p>My conclusion?</p><p>Salvia was a very warm, glowing high, I suppose I could liken it to being quite stoned, but that's only the baseline.  The trip itself extends far beyond any other hallucinogenic experience I've ever had, and I didn't even take a particularly large dose.  Definitely worth a try for those who are interested, but keep in mind that it isn't just another 'herbal high' you buy off the internet, it's the real deal, so be sensible.  Be in the right state of mind, the right place, the right time with the right people.  And remember, it's all in your head.</p>",
 "year": "2002",
 "id": "19754",
 "gender": "Male",
 "timestamp": "2005-09-29T07:00:00.000Z",
 "views": "3398",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ]
}
