{
 "id": 19769,
 "title": "Happy Once More",
 "date": {
  "submission": "2008-03-29T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "I_Hate_Hate",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.3333 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "I had had salvia before this experience and have almost always had a very pleasant afterglow. It was finals week at school. I was way behind in most of my classes and very stressed out. I decided to have some salvia, mainly because I wanted to escape. I know that this is a very bad reason to take basically any drug, but I didn't care at the time. I also didn't use a sitter, very big no no, because you can't really know what to expect from yourself while on salvia.",
  "I loaded up a good sized bowl into my very inexpensive bong and took a hit. held for thirty seconds, exhaled and repeated. I was sitting on my couch and I could feel the come up, hot prickly skin, and pressure all around me. I don't know if I fell off the couch or not but I distinctly remember sort of crawling on the floor as I had a CEV that I felt I could almost see when I opened my eyes. The visual was of a phrase 'Jesse is eating me.' It was written out multiple times in a type of mandala. I didn't have any feelings at the time, so I was not afraid, happy, or sad, I just was. Gravity flowed and swirled but consistantly pushed me backwards. I started to feel myself come down, literally, and feel like I was no longer in a gravity vortex. The 'Jesse is eating me' CEV persisted throughout the whole experience for I kept opening and closing my eyes.",
  "After I had completely touched base, I walked outside. I sat in a chair on the second floor entrance and watched the sunset across a large valley behind my house. I felt great. I had no stress, was completely relaxed and my general well being was through the roof. After watching the sunset I did a bunch of school work with ease, not being too stressed to think. This after glow persisted strongly for the next week. The main experience lasted around 3 and a half minutes."
 ],
 "erowid": {
  "id": "43364",
  "citation": " I_Hate_Hate. \"Happy Once More: experience with Salvia divinorum (leaves) (ID 43364)\". Erowid.org. Mar 29, 2008. erowid.org/exp/43364",
  "substance": "Salvia divinorum (leaves)",
  "views": "7429"
 }
}
