{
 "id": 19762,
 "title": "Many Out of Body Experiences",
 "date": {
  "submission": "2007-07-03T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Craig Bailey",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "80"
   },
   "administration": "oral",
   "substance": "Sertraline",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "ml",
    "quantity": "900"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "[Erowid Note: 2700 mgs of DXM is considered an extremely high dose, see DXM Dose Chart] \r[Erowid Note: No contact information was provided with this report, so we are unable to confirm it or follow up with the author. It is our policy to try to verify any life-endangering adverse reactions which people report, where possible. If the author reads this, please contact admin@erowid.org.]",
  "It was a rainy day about 3 weeks ago in april when 2 friends and I decided to attempt a trip into the unknown. We planned the day it would go down, it was to be a staurday. We ate very little that morning so we could get the full extent of our trip. We took a cab to a near by pharmacy and each of us spent $20.00 bucks on the 'tussin. Friend #1 got 3 bottles of the 20 pills. Friend #2 got 3 bottles of the 20 pills and a 8oz bottle, and for myself I got 4 bottles of the 20 pills and a 4oz bottle of the liquid. We had about an 1/8 of cannibis on us and I found a bottle of prescription zolofts in my grandmas guest room. We decided to smoke first, things seem to taste better when your stoned so we figured the tussin would.",
  "After we smoked our nugs I felt very unusal. I kept hearing something, an unclear voice trying very hard to tell me something. I ignored it and we consumed 4 20mg zolofts each. The voice started to get a bit clearer and I distinctivley heard the word 'dont'. Now, down to the tussin. I was wrong the liquid didnt taste any better. We took 4 pills at once and washed them down with a swig of the tussin until it was all gone. Feeling very uneasy about what we had just done I started to feel as if I was falling into the bed. I again heard the voice, clearly this time it said 'dont do it' over and over.",
  "I sprung up from the bed and looked at my friends. One was on the floor, puking his guts out. The other was on the bed beside me, eyes rolled to the back of his head. I started to go downstairs to get my grandmother but as I tried to stand my legs seemed to dissolve. I yelled for help but all I heard was a weird gurgling robotic sound come from my throat. My face got really hot and very itchy as I began to lie down beside my friend, I noticed he was itching his face too and it was beat red also. I felt something jump up & and out of my throat and onto my hand. I said I was bleeding to my friend. I later found out I had only puked. I heard a voice from the side of the bed and looked over and saw a very distorted shape saying something like 'What are you on, what did you guys do?'",
  "I know now it was grandmother she had heard the noise of vomiting and came up to see. I blacked out and what I thought to be quickly awaken, but later found out was an hour or so long. I awoke or semi-awoke to be inside of an ambulence with one of my friends. All I could think about was where my other friend was. I looked at my arm and it was so distorted that it seemed as if I had no fingers. I saw a needle with a protruding tube coming out of my arm. When we arrived at the hospital I felt I was floating and that the kid in the wheel-chair was not myself but some teen I knew very well. I watched as the kid (who was myself) was wheeled into the emergency room and quickly thrown into a bed.",
  "I started to come back down into myself when I looked in one of the corners of my hospital room and saw a bird fly out. A nurse quickly came into my room and made me drink charcoal. I thought I was just tripping and making the whole thing up until I saw another face I then snapped back into the reality of what had happened, we had O.D.'d on robotussin. Then a flicker of a memory of my other missing friend flashed into my head. I asked about him and they said his dad had came and got him and put him in the emergency room to have his stomcah pumped.",
  "We had to spend 2 days in the hospital before we were allowed to go home and one of my friends lost the ability to see and now is blind but he tell me he can see, he says all the time he sees colors and old images like hes watching a movie. Still to this day I have flashbacks/nightmares of that day and I warn anyone daring enough to exceed 900ml of robotussin to think about it throughly and do not ever ever ix it with zoloft or any other anti-depressent medication."
 ],
 "erowid": {
  "id": "43340",
  "citation": " Craig Bailey. \"Many Out of Body Experiences: experience with DXM, Sertraline (Zoloft) & Cannabis (ID 43340)\". Erowid.org. Jul 3, 2007. erowid.org/exp/43340",
  "substance": "DXM, Sertraline (Zoloft) & Cannabis",
  "views": "14664"
 }
}
