{
 "title": "Better than Depression",
 "author": "Cipher",
 "citation": " Cipher. \"Better than Depression: experience with Venlafaxine (Effexor) (ID 19768)\". Erowid.org. Nov 17, 2004. erowid.org/exp/19768",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "260 lb",
 "header": [
  "DOSE:",
  "225 mg",
  "oral",
  "Pharms - Venlafaxine",
  "(daily)"
 ],
 "report": "<p>I began to become very, very depressed, to the point of seeing a therapist. The therapist helped a little, but I was still drinking and drugging to keep from thinking about how shitty my life felt. That went on for about two months, my therapist refused to prescribe any sort of anti-depressants for me, even though I knew what I was feeling was irrational and wrong, and there had to be some way to fix it.</p><p>I asked my regular doctor about being depressed. This is the same doctor I've been going to for about two years, so she knows me fairly well. We talked at length, I filled out an evaluation card (didn't realize I was quite as depressed as I was until I saw my answers to all those questions). She prescribed Effexor, starting with a 37.5mg dosage.</p><p>The first couple weeks were like being stoned all the time. Massive body high, spaciness, inability to form and complete complex thoughts. After the third week, with my dosage upped to 75mg I started to feel better. Less depressed, less negative, less angry. All of sudden, I just felt okay about my life. I felt really good about my life sometimes, too. It had been a long time since I felt that way, like about 8 years or so.</p><p>I started having some sexual dysfunction -- I could get it up, but couldn't have an orgasm, unless I worked at it for over 45 minutes. Sure, fun sometimes, but keeping up a constant pace for 45 minutes is... well, less fun than you might think. I told my doctor about this, and she upped my dose to 150mg. Didn't notice any difference in how I felt, but it took a bit of the edge off of the sexual dysfunction.</p><p>I'm now on the 2nd month of 225mg (about 9 months of taking it), again, without any strong side effects, and the sexual dysfunction kind of comes and goes. Hopefully that will change soon. The lack of anxiety has translated into some very vivid dreams, but nothing disturbing, and there have been a few nights where I have clenched my jaw hard enough while sleeping to make it ache.</p><p>Other drug interactions have been varied. Weed gets me incredibly stoned, and in a slightly more spacey way. I feel very disconnected while stoned (I smoke weed maybe once a week), but not unpleasant. In fact, I seem to enjoy music and movies even more now.</p><p>Alcohol has been a mixed bag. Sometimes I can drink all night, other times, a couple drinks will put me down. I tend not to do stupid 'drunk stuff' anymore though, thanks to the lack of anxiety or depression with the Effexor. One evening, while on 150mg, I had three drinks, and spent at least a half hour sitting at the bar, biting my thumbs to keep the room from spinning out of control. That was an uncomfortable experience. I didn't feel drunk, I felt dosed, like when I hit the first peak on E. I wouldn't want to repeat that.</p><p>I did Mushrooms with friends while on Effexor, the effects were minimal on me, while my friends were having very strong reactions. Given that I had not tried mushrooms prior to being on Effexor, I'm not sure if my experience was altered because of that.</p><p>So, all in all, Effexor has been positive for me. The couple of days (single days only) where I have skipped a dose left me feeling listless and tired. I don't think I'd enjoy the effects of skipping two or more days. I talked to my doctor about how to get off Effexor, and she said that it would be a gradual decrease in dosage, until I wasn't taking it anymore. It's not healthy to quit this one cold turkey.</p>",
 "year": "2002",
 "id": "19768",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-11-17T08:00:00.000Z",
 "views": "15924",
 "dose": {}
}
