{
 "id": 19765,
 "title": "A Phat Day Out",
 "date": {
  "submission": "2008-09-08T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Dharma",
  "gender": "Male",
  "weight": "11 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Mushrooms - P. tampanensis",
   "form": "(fresh)"
  }
 ],
 "report": [
  "It all began when a friend invited me and M for a day out to Alton Towers, A British Theme Park. I suggested that a dose of magic mushrooms may increase the enjoyment of the day out so the day before we went to our local head shop and purchased 15 grammes of philosophers stones each as the only mushrooms available were strains which we had either not tried or had unpleasant trips with. Being conscientious little trip heads we also bought some vitamins (B complex and C) and Paracetamol so that we could hasten a come down if we began to bad trip. We looked forward to an early night so we would be fully refreshed in the morning.",
  "We both awoke at around 7am and began to ready ourselves for the day out, showers, good breakfast, etc. By 8am our friend C and her boyfriend P arrived to pick us up for the journey to the park. We arrived at approximately 10am, parked up the car and took the monorail to the parks main entrance. By now we are both very excited about the trip ahead of us, the car ride had given us a chance to relax into the day and bond with C and P who would essentially be our sitters while we tripped. To get to know this new unfamiliar surrounding we let ourselves take a few rides to get a feeling for the day ahead. After riding the Oblivion (vertical drop rollercoaster) we both began to feel a little uneasy about what we were about to embark on. We took some time to make a final decision and then at about 12pm we mixed the stones in with a yogurt and spooned the unassuming truffles into our eagerly awaiting bodies.",
  "The next ride was Submission, a pirate ship type ride that takes you 360 degrees around. M was feeling very apprehensive about what we had just done but I felt very excited and let myself relax. After the ride M felt a lot more comfortable and we walked towards the next ride, Enterprise, a big wheel type ride. By the time that was over we had both begun to feel the stones work their magic. I felt slightly disorientated and giggly. M was in a heightened sense of well being. We crossed the park to the Corkscrew, a rollercoaster. M got a serious case of the giggles as we ascended to the first peak of the ride, the view was stunning, and we wanted to stay there forever. We laughed our asses off for the rest of the ride.",
  "Walking to the next ride I am feeling disorientated, I dont really know exactly where I am going, good thing C and P where there to guide us, although M does not feel like he is really coming up and has accepted that he may just have to settle for a light buzz and just try and enjoy the rides. We had to take a skyline over to the next section of rides and we just laughed and talked trippy bollocks. There were quite a few people in with us who seemed confused as to our state of being; M is acting it up because he enjoys the paranoia. I however feel apprehensive about the situation; sober people have never been my strong point when tripping the light fantastic.",
  "Despite our lack of time perception I believe it was about 1pm when we boarded the Nemesis, another rollercoaster and my favourite ride in the world. We went on this ride twice, once near the back and once up the front. During this I was tripping pretty hard, I could see swirling patterns on the floor and the ride before I got on it, M had a few visuals if he concentrated hard enough, I thought hed passed out when we got on for the first time because he was relaxing and trying for closed eye visuals. The ride itself did make me feel as though I was flying. The second time we went on it we had thoughts of ascending to heaven as the ride moved us up towards the sky.",
  "The next ride was Air, another rollercoaster that is designed to make you feel like you are flying. The queue was quite long, we had a good few giggles and the guy in front of us looked liked a woman, we think we may have been a bit obvious with our chuckles, but we didnt care. Just as we got to the front of the queue M seemed to be coming up a bit stronger, which delighted him beyond belief considering he thought he was as high as hed get. The ride was fantastic, the sky looked so beautiful, I screamed I can see God as we twisted through a corkscrew. We landed.",
  "We were both having difficulty walking now, much like a diphenhydramine trip, we felt quite heavy, the dizziness from rides was affecting us for longer than C and P. We both felt like we wanted a line of coke and M mentioned it would be good if we had some MDMA on us. We decided that it was time for the ghost train, a crazy idea, but we were both up for it. The ghost train there is like a game, the four of us got into a train and you get a gun each to shoot at targets. Its not a particularly scary ride, but M jumped a few times. On leaving he declared that Some bits had scared me, but I thought he said some bitched had scared me I could not see the bitch, but I believed what he had said. By now we were both on a peak of the high, talking complete trippy bollocks to one another and keeping C and P entertained.",
  "We decided to take a break and we sat down. M bought some chips and found he was staring into the worker's soul as she tried to get him to pay the 1.30; he just gave her a handful of change. She could sort through it all. As he came back to the table he looked incredibly pleased with himself for buying the chips. He didnt finish them. He got a major case of the giggles and some guy with an attitude thought he was laughing at him, luckily we diffused his complaints. Otherwise a fight would have occurred.",
  "By now I should say that Ive been pissing like a hose pipe all day, and once again I needed the toilet so we walked to find one. I had to ask at a stall as I approached the stall the people working there were all laughing very hard at something, I didnt quite understand what was going on so tried to laugh along with them and look sober, it didnt work too well and I got some very strange looks. They told me where the toilet was but I went in completely the opposite direction back to M, C and P. At this point Ms face had seemed to have collapsed which scared me a little, but I didnt say anything in case he freaked out. I then remembered about needing the toilet so I floated off.",
  "When I got back I found M staring at the floor, he had colourful visuals of the floors crazy paving moving around. We began walking to the next ride and even when we had begun to queue we didnt really know where we were going, walking and queuing were just as fun as the rides. As we got onto the next rollercoaster (the runaway train) M decided the guy announcing safety procedures was a DJ called Fenriz (a Norwegian black metal musician). Fenriz growled to us as the ride began. We had very little idea that we were actually on a ride, we spent the entire time conversing as if we were merely sitting in a pub for the afternoon. ",
  "After this the rides we went on seemed part of normality, it didnt really occur to us that we were at a theme park anymore or that we were on rides. The last ride we went on was called Rita, Queen of speed, an extremely fast rollercoaster, however whilst queuing for this ride we had both begun to come down. The kind of slow gentle come down which is fairly enjoyable, although by this point we wanted to go home and chill out. The ride itself was quite good although not as fun as previous rides due to the come down setting in. After this we started to make our way back to the car. On the monorail back to the car park there was a couple sat with us whom I didnt realise were real, then M preceded to talk loudly about what drugs we had taken during the day, in order to play with the couple. The couple seemed quite anxious to get off the monorail and to put as much distance between us and them as possible.",
  "The car ride home was extremely enjoyable, we realised that we werent coming down as fast as we thought and were still experiencing moderate effects. No-one really spoke for the first hour of the journey as we were both in our own little worlds. I was playing live on stage at a festival and M felt like he was in a film watching the world go by. We then arrived home, said goodbye to C and P and went to our local Pub for a few quiet beers. We both sat feeling extremely good about ourselves and chatted extensively about how Phat and Mint the day had been. By this point we were both pretty much completely down. All in all an extremely enjoyable day."
 ],
 "erowid": {
  "id": "43354",
  "citation": " Dharma. \"A Phat Day Out: experience with Mushrooms - P. tampanesis (ID 43354)\". Erowid.org. Sep 8, 2008. erowid.org/exp/43354",
  "substance": "Mushrooms - P. tampanesis",
  "views": "2854"
 }
}
