{
 "id": 19777,
 "title": "But I Don't Believe in Angels",
 "date": {
  "submission": "2007-09-14T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Newtboy",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "I had recently heard about Salvia through my best friend. Although after this experience he claimed he had never used it. Maybe it was fate? I have many mush, acid, coke, speed, freebasing experiences on my resume, and since mush is my favorite, and of course the hardest to consistantly buy (around here) I was looking for a new easily attainable high when I asked my employer (a dead head type) about it. He said he got it of Ebay and it was legal, so I was like 'Hell yeah!' and went home to 'Buy it now!'.",
  "The package finally came after 2 weeks of calling the company asking where it was and when I looked at it, not having any idea what it looked like, I was pissed! It looked like the old dried up Green tea leaves I had in the cupboard. I had vaguely heard that you could put it in tea which I tried first but again, that only reassured my suspicions of being had. I then later that night, around midnight, tried smoking a bowl out of my small toker pipe, but that left me more raspy voiced than anything else. I only smoked a couple of bowls that weren't very comfortable due to the dryness of salvia leaves and I quit before I woke up everybody with my hacking. You gotta understand I didn't want to O.D. or flip out either since I didn't know much about the plant, even through research. I always need to form my own opinions and tend to take it more slowly than just jumping right in and getting messed up permanantly.",
  "The next night I said 'fu@k it' and around midnight, just went hardcore and tightly packed & smoked bowl after bowl, 3 to be exact while holding in the smoke for as long as I could. I always have the T.V. on whenever I do any drugs even though I hate T.V., I just feel better with the background noise and music is too distracting since I'll try to listen to music too much and it distracts my high.",
  "Immediatly after my 3rd and final pipe clearing toke, I scraped the ashes off my tongue because there was no screen on my pipe, I went to sit down and I immediatly felt a 'cold tingle sensation' all over my body, very similar to the feeling I get when my foot falls asleep. Almost simultaniously, I felt my body hurtle about five feet back yet I was still standing by the T.V. The strange thing was I could actually see the different stages as I morphed across the room, like still shots of me as I was taken aback, literally. I immediatly said to myself 'Yes! I'm back!' as I hadn't tripped on psychadelics in a long time and it was like I always remembered, the feelings of elation and no link to this human race's idea of reality. As with mush, I got the same 'Why am I still here?' feelings that I get because I have already 'seen the truth' of what life really is and I have no purpose to be here on earth other than keeping my family happy, which is selfish of them.",
  "So as I sat on my couch tripping on how obnoxious T.V. is with it's in your face 'BUY ME!/LISTEN TO ME!'  bright flashing imagery, I relaxed and let the salvia guide me. As I relaxed my head on the back of the couch staring upwards, I could actually feel myself as well as the couch being levitated and slowly rotating forwards as the tingling sensation grew more intense the higher I got (no pun intended). I then realized that there were approximately 5-10 angels (I'm an Atheist) who were actually pulling me upwards as well as the couch although I could not feel them physically or could I see them, they were there because from what I and most trippers have learned is, it's not what you can see, but what you can feel.",
  "They were 'telling' me to come with them since I didn't let them take me the last time (while shrooming) and the first reason I didn't go last time was because of not wanting to hurt my family and give psychadelics another bad rap. The second reason is, what I believe to possibly be true is that it's not that the 'angels' are gonna take me away to leave this earth and go on to different dimensions blah blah blah, it's that when they do 'take me away' when I allow them to, THAT is when I have finally crossed the line and cannot function in this world anymore. Hence I am bound to wind up in a mental institution for good or on constant suicide watch.",
  "It is this reason alone I cannot let them 'take me' and I just smiled as wide as the Chesire Cat and 'said' I would not be 'going with them yet.' As I 'said' this the angels 'smiled' and I could feel the warmth overtake my body as the couch and I were casually let back down as I suddenly realized my back was almost parallel aginst the roof! As soon as I was back onto flat ground, the angels left and 'said' they will be seeing me in the future. The tingle feeling was gone as soon as the warmth of the angels 'smiles' took over and I went to sleep still embossed with that cat-like smile on my face.",
  "Total time of trip: Approximately 5-10 minutes yet it felt like hours."
 ],
 "erowid": {
  "id": "43398",
  "citation": " Newtboy. \"But I Don't Believe in Angels: experience with Salvia divinorum (leaves) (ID 43398)\". Erowid.org. Sep 14, 2007. erowid.org/exp/43398",
  "substance": "Salvia divinorum (leaves)",
  "views": "2951"
 }
}
