{
 "title": "Mindstorm",
 "author": "Keyser",
 "citation": " Keyser. \"Mindstorm: experience with Mushrooms (Hawaiian) (ID 19772)\". Erowid.org. Dec 19, 2002. erowid.org/exp/19772",
 "substance": "Mushrooms (Hawaiian)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "0.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2002",
   "19772",
   "Male",
   "",
   "Not Given",
   "Dec 19, 2002",
   "9548",
   " "
  ]
 ],
 "report": "<p>\nI've been taking mushrooms for about 1.5 years now and I fell in love with them since the first one I took one. In Holland where I live you can get I kinds of good quality dried mushrooms completely legal at the smart shops. [Erowid note: Dried mushrooms are no longer legal in Holland] I've always thought that I was pretty familiar with how the mushrooms change my perspective and the way I think, but what happened a few weeks ago was quite something else.</p><p>I dropped about 3/4 of the bag of hawaian mushrooms  I had bought on the way home at about 16.00, after completely starving myself for about five hours. I did this to ensure that the mushrooms would have their maximum potency since my earlier experiences had taught me that the power of the trip greatly depends on how much food I have in my stomach. One must always drink as much water as possible though. After about 20 minutes i started to feel the onset comming up and retreated to my room which I had fully prepared for some good tripping. The effects soon became very powerful and visual, and I tried to watch a movie on my computer. </p><p>Looking back on the experience, that wasn't the smartest thing to do. With mushrooms it is often better to just let things go and let the trip come over you, instead of trying to concentrate on some task or action. Soon  the trip got more and more powerful and i started to feel overwhelmd with irrational fears. My mind was going too fast, jumping from thought to thought. I kept trying to preform certain actions in a manic way, unable to finish anything because of the power of the trip. I soon stormed downstairs, mumbling words mixed with songs and looking for something that could end this strange maelstrom of thoughts. I soon lost every contact with reality. I couldn't remember what or who I and my enviroment was. All the information was stil in my head but scrambled, out of context. I could barely remember that my current state had something to do with schrooming. The only clear emotion was a primal fear that I would never get out of this. Thank God nobody else was present because I must have looked pretty scary.</p><p>After some time I accidentally turned on the tv and started watching without understanding any of it. Slowly the power of the trip lessened and I noticed that my mind was returning to earth. After about 35 minutes of coming down in front of the tube  I was thinking clearly again and started to walk around through the house. I then got caught up in a incredibly powerful sense of euphoria. I had had this before while schrooming but never this powerful. It was a bit like a cocaine experience but lasted much longer, about 2 to 3 hours and very gradually subsided. I kept looking and thinking about everything with a overwelming sence of joy and appriciation. Especially the music sounded great. This lasted almost until I went to bed yet when it was over I developed an utter son of a bitch of a headache which lasted till the next morning and was thankfully kept under control by the use of 5 paracetamols. The next day,when the headache subsided there were no more side effects and I felt fine.</p><p>When looking back at this rough experience it leaves me with mixed feelings. The onset and euphoria were great but the part in between really wasn't. Stil I think it was mainly positive since it taught me some usefull things about how my mind works and what it feels like when it isn't working quite like it should. The mushrooms probably worked so strong because my stomach was completely empty. Interesting experience but the next time, a bit less though.</p>"
}
