{
 "id": 19784,
 "title": "The Ego Wall",
 "date": {
  "submission": "2007-09-14T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Highmito Kslow",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>Through a series of very fortunate coincidences I found myself learning a great deal of Salvia Divinorum from multiple sources over the course of my young life, but I haven't felt that my intent was right, or that I was impeccable enough as a man to tackle such a plant. It takes a great deal of respect and power for Salvia to 'accept' you. I didn't choose Salvia; it chose me.",
  "I meditated for an hour or so beforehand, partly because I knew it was a good idea in itself, and partly because my last hallucinogenic experience was 2 years prior.  An extremely morbid death fantasy that was precluded by 4 other such death trips led me to quit for a time.",
  "My friend B packed a bowl (for a bong) and I sat in the middle of his backyard; no lights on, and no moon out. B and his older brother (also a good friend) stood by. As I exhaled, everything went blank and I found myself in an endless spiral of Mes! All lined up naked bodies rotating clockwise into nothingness, similiar to looking into two mirrors until the image dissapears. My mind would continually try to latch onto one of them, failing each time, while feeling surges of anxiety as each 'me' that was clung on to was lost in infinity. This happened for an indeterminable amount of time, until, luckily, I realized that it wasn't so bad just being part of it all, and singling myself out was a waste of time. Bam! The image scaled back to a piece of meat sitting on a table and a butcher whacked down on it with a huge knife.",
  "I stood up in the middle of a cornfield of unlimited expanse and there were several shadows around me. One came uncomfortably close to me and whispered something about raping time. 'I had raped time?' An overwhelming rush of guilt came over me for a moment, but I stuffed it into the past and moved on, because the shadows and the lighting were intriguing. The Yard was coming back into focus and as it did, I fancied a waterfall that looked very sinister, like the Fiji water bottle backround (yes, sinister), coming down from the southernmost wall of the yard. I wondered how long I could hold the waterfall there, and I rounded off the figure at about 3 minutes. The next 20 minutes my thoughts and actions were very helter skelter and absentminded. My body was weak and jellowy. I needed to recoop.",
  "The feeling of affecting time or stopping the flow of infinity seems to be a consistant theme amongst people I know.  I believe it to only be a barrier of the ego and self importance.",
  "PS. My guides reported that I had fallen back, and raised my arms in the air, shaking them around slowly and sporadically.  I mumbled inanities for a few moments and quickly stood up. All of my limbs were moving around sporadically as if they had a mind of their own, and my buddies thought I would fall over at any moment. At one point I almost did, and B grabbed my arm to steady me. His brother told me everything was alright, and B told me to 'Take My Time'. Heh. They helped me to a comfy chair and left be alone.</p>"
 ],
 "erowid": {
  "id": "43424",
  "citation": " Highmito Kslow. \"The Ego Wall: experience with Salvia divinorum (20x extract) & Cannabis (ID 43424)\". Erowid.org. Sep 14, 2007. erowid.org/exp/43424",
  "substance": "Salvia divinorum (20x extract) & Cannabis",
  "views": "2833"
 }
}
