{
 "id": 19796,
 "title": "The Chase that will Never End",
 "date": {
  "submission": "2000-12-22T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Keri",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "The first time I tried E was not the time that hooked me, that came several uses later. Sure, the first couple times were great but the E I did at the Nexxus Rave was, and still is, the high I will always chase.",
  "It was amazing, I'd never reached that level of ultimate comfort with others... 5,000 people and I loved every single one of them. Modern day Love Children, we were. You know, the whole 'E-sperience'. About an hour before I got there I took an over-the-counter anti-nauseant, I'd had trouble with my stomach and E before and figured that might help, it did. (still does, no bad side effects so far, DIMENHYDRINATE 50mg, keep it in mind)... So I picked up from some guy, he found me, his friend heard my friends and I were looking.",
  "Thats the greatest thing about the drug, once someone's on it, they want to share the feeling with the rest of the world, so it will come to you. Thing was, we couldn't find enough tabs of one kind to all do the same. I said I'd try the odd one out (2 tabs of 'lucky 7') and my two friends did the same, I didn't know what to expect, but it was wonderful.",
  "Short high though, 2 1/2 - 3 hours, I was used to longer, mellower highs, but this one hit me like a ton of bricks, I ended up in the Jungle room, dancing 'till I came down. The next day was the ultimate in sketchy sundays but it was to be the beginning of 3 months of trying to find that high again. Ive gotten up there, close anyways, a couple of times but Ive probably dropped abot 35-40 times since then at the after hours clubs and now the high lasts maybe an hour and a half, tops, and that feeling of euphoria is gone. Im hoping maybe if I stop for a while that feeling will return, my roomate is in the same boat, but so far the reading we've done suggests that there a lot of people out there like us and the damage is permanent.That makes me sad. Ive tried a lot of other drugs but nothing Ive found so far even comes close to that."
 ],
 "erowid": {
  "id": "4346",
  "citation": " Keri. \"The Chase that will Never End: experience with Ecstasy (ID 4346)\". Erowid.org. Dec 22, 2000. erowid.org/exp/4346",
  "substance": "Ecstasy",
  "views": "17509"
 }
}
