{
 "id": 19808,
 "title": "20 Hours of Amnesia",
 "date": {
  "submission": "2007-09-27T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ToxicAshes",
  "gender": "Female",
  "weight": 45
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "After a long day of smoking cannabis with my ex-boyfriend and two other people, my ex decided to suggest that I take a few hits of acid with him. I was extremely nervous, seeing as how I had only taken it once before and had mild effects. The first time I only took one blotter and since it didn't have much of an effect on me, my ex suggested that I increased the dose. We were sitting in a small bedroom watching t.v. with his friends. I told him I would take the acid, but as soon as it started effecting me I wanted just him and I to go into a separate room from everyone else in order to lessen the chances of wigging out.",
  "He gave me 3 hits and I took them all at once around 10 p.m. I sucked on the acid for about 20 minutes until I swallowed them. It wasn't until about 15 minutes later that I started to feel a little light with a nice mellow body high that sort of gave me an involuntary shit grin on my face. I turned to my ex and told him I was ready to go in the other room. He said he was going to get something to drink and that I could head in to the room and he would meet me there.",
  "As soon as I opened the door I got my first visual. He has a brown leather jacket lying on a lay-z boy chair. I watch the jacket float all the way up to the ceiling. I thought to myself that what I was seeing was not normal and that I must be beginning my first intense trip. When my ex walked in I explained to him what I saw and he merely laughed and told me to expect much more overwhelming feelings and sights. The whole time I kept getting intense rushes all over my body that caused me to sporatically inhale and exhale very deeply. I noticed that I had a constant fixation on the time and I keep asking myself what I would normally be doing at this exact time of night if I was not tripping on acid.",
  "My visuals and body high kept getting more and more intense as the time went by. I do not remember the next two hours at all. The next thing I knew, I was looking around and everything was moving too fast and changing shapes so much that I could not decipher what was what. For example I was lying on the floor and my ex said 'Baby why don't you try to stand up.' I didn't even know I was lying down. He told me that I replied by saying 'I don't know which is the ground and which is the floor.' He never once laughed at me nor did he think I was crazy. He would always allow me to express myself and then in the end always reminded me that I was just tripping on a drug and that none of this was real.",
  "Finally, he got me to sit up on the floor. We started talking, though I have no clue what the topic of our conversation was. I do remember him saying something about having physical proof that god does not exist and wanting a piece of paper for me to write this down. I started to write in between the lines of notebook paper but the lines started whirling so fast that I couldn't seem to get anything down. I zoned out in to the strange world that was all white with these beautiful blue lines surrounding me. The lines reminded me a little of the wind because they would swirl around me and cause me to get the cold chills and they would blow my hair back like the wind.",
  "All of the sudden I was back in the room. My boyfriend was still talking unaware of my current state of mind. I stop him in mid-conversation and I started laughing shyly and said 'You know what? I don't know who you are; as a matter of fact, I don't even know who I am.' To this day my ex said that the seriousness in my face and voice was probably one of the scariest things he has witnessed in his life. He would tell me our names, where we were at, who my family and friends were, what year it was, what state we were in, even as far as what planet we were on. Everything sounded very familar like I dreamt it but I could not put the face of my father with his name.",
  "This was a repetitive process for the next 10 hours. Despite of the situation, I stayed calm thanks to the help of a wonderful boyfriend and friend. I couldn't of made it without him. He guided me the rest of the way on my trip. He sat indian style and laid me in his lap and rubbed my temples while describing these beautiful sceneries and allowing me to picture them in my head. Even though I didn't know who he was at the time I felt very safe and comfortable with him and I even told him I liked him that night and that I wanted to be his friend, not knowing he was my boyfriend at the time. He became my security blanket until I finally came out of my trip.",
  "I threw up one time in the morning and had mild trails for the rest of the day but I was back to the proper state of mind. This was a life-altering situation for me and made me realize the importance of life and just how intense this could become."
 ],
 "erowid": {
  "id": "43492",
  "citation": " ToxicAshes. \"20 Hours of Amnesia: experience with LSD & Cannabis (ID 43492)\". Erowid.org. Sep 27, 2007. erowid.org/exp/43492",
  "substance": "LSD & Cannabis",
  "views": "4156"
 }
}
