{
 "id": 19812,
 "title": "Walking really close to the edge",
 "date": {
  "submission": "2000-06-29T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Anon from London",
  "weight": "14 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I am a reasonably well balanced thirty something who has a good job, a circle of friends and who enjoys life. I have never been in any trouble; just an 'ordinary Joe' who works, pays the bills and has holidays once a year.",
  "I visited some friends in another city about 600 hundred miles away for a long weekend.  We had a couple of joints and then they asked me if I like to do some 'charlie'.  Well I had always wanted to try the stuff so I said yes.",
  "After my first line I felt really good, warm, positive, confident and chatty.  The whole experience felt really good.  I returned home with 2 grams 'just to socialise with' but as soon as I got through the door I was snorting the stuff.  The following week I felt totally lost without coke.  So I drove 600 miles to get some more.  This time 4 grams.  Before I knew it I had my friend post it to me every week. I could not believe how much I was spending on the stuff.  This went on for about 4 months.",
  "Pretty soon it got to the point where I could not leave the house without 4 - 5 heavy lines.  I knew I was in trouble when one day I was on my hands and knees, with a straw up my nose, looking for traces of coke on the floor.",
  "I had a nervous breakdow/depression and was off work for nearly 4 months.  Perhaps the breakdown would have happened any way but the charlie certainly sped it up. ",
  "I have not touched the stuff in over three years and I certainly could not stop thinking about it for two years.  I even used to dream about it!  I'm ok now.  Back to being an ordinary Joe who is a little wiser and who doesn't need any drugs now."
 ],
 "erowid": {
  "id": "435",
  "citation": " Anon from London. \"Walking really close to the edge: experience with Cocaine (ID 435)\". Erowid.org. Jun 29, 2000. erowid.org/exp/435",
  "substance": "Cocaine",
  "views": "6238"
 }
}
