{
 "id": 19831,
 "title": "Liquifaction and Warfare",
 "date": {
  "submission": "2008-09-10T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Limpet Chicken",
  "gender": "Male",
  "weight": "9 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "120 g",
   "administration": "oral",
   "substance": "Mushrooms - P. tampanensis",
   "form": "(tea)"
  }
 ],
 "report": [
  "[Erowid Note: 120 grams of fresh mushrooms is considered an extremely high dose, see Mushroom Dose Chart]",
  "What follows was the most amazing trip in my life, I reached a ++++ and it changed the ways I view shrooms totally, having done them a few times before, but only on low doses.",
  "The shrooms I had had before this trip were of a low quality, so not knowing much better at the time, this was this year, but early on in the year, 120 grams of fresh 'philosophers stones' variety (tampanensis) that come as subterranean sclerotia, truffles type things, were ordered from an online company, and arrived within three days. I had no plans that day, and knew enough not to make any, even though I had never even reached OEV's with shrooms before, so the whole package of stones was pulverised with an ornamental dagger to a fine paste and infused four times with warm-hand hot water (so as not to significantly hydrolyse and destroy psilocin content) acidified with lemon juice to extract the tryptamine content better, then left to chill. The entire two resulting pints of infusion were then consumed on an empty stomach.",
  "I don't know for sure how far I was gone for, but I started preperations at around 12 AM, and when I came to, it was still light so a good few hours at least. I don't remember a great deal of the trip, but I experienced total ego-loss and disassociation, and became a liquid. I could feel myself (although I didn't recognise 'self' as a concept) dissolving and moving like a liquid, although I was, at the time, flat out on my bed. I remember trying to turn myself inside out, and seeing all my bone structure, blood vessels, and internal organs in a liquid fluid pool somewhere, just existing, at some strange dimension or point in space, so far from humanity that the ego, self, life itself were just inconceivable.",
  "After I had come round, it was time for purging of a most unpleasant nature. The shrooms evidently decided their work was done, and decided to exit stage left, or this time, top and bottom, that's right folks, a projectile digestive assault from both ends of mostly reddish liquid with small chunks of digested fungal matter, for a couple of hours on end for which, although blamed on some dodgy food was blamed by foolish parents on the datura stramonium growing in the garden, which, having only sampled once, was disappointingly dug up.",
  "I was fairly ill for the rest of the day due to the bodyload, and the fact that I was still tripping fairly hard, although not quite as intensely as when I was peaking, was still at the walls-breathing room-dissolving stage meant I felt like utter shit while having to hide the fact that I was fucked from my parents.",
  "This was definately worth the nastiness afterwards without question as I know I was lucky enough to have an undeserved ++++ experience.",
  "Edit: I forgot about this little bit when I typed the main report, but as I was coming down and feeling somewhat better, but still tripping, I really though I was a German nazi stormtrooper in the hell of the trenches of WWII, I found out the day after I came to, and read this txt file that I had typed out while I was tripping, of all my opinions, as this brownshirt trooper, in the form of a letter home to relatives (I am not of German ancestry or culture, nor have I been to Germany), all my/his feelings on the war, the trenches, shells pounding and killing, quite disturbing when I came back sane and read this."
 ],
 "erowid": {
  "id": "43578",
  "citation": " Limpet Chicken. \"Liquifaction and Warfare: experience with Mushrooms - P. Tampanensis (ID 43578)\". Erowid.org. Sep 10, 2008. erowid.org/exp/43578",
  "substance": "Mushrooms - P. Tampanensis",
  "views": "4055"
 }
}
