{
 "id": 19837,
 "title": "Supreme Combo",
 "date": {
  "submission": "2007-06-24T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Rio",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "Pharms - Carisoprodol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I have an extensive drug history, although it wasn't always recreational.  I have a long standing back problem, herniated discs AT L4-5, so getting opiates has never been a problem.  I've been on OC and other strong opiates, you name it.  I do develop a tolerance to true opiates very quickly. For example, after a month layoff or so, I can take 3-4 Vicodins and be trashed. ",
  "As I speak now, I can take 12 ( yes, twelve ) Percocets (5 mg) and get the same effect.  So, needless to say my tolerance is absolutely ridiculous.  Enter Ultram.  This is a miracle drug.  While it's true this is a non-opiate it does give a pseudo type opiate buzz which is not too intense, but very calming and relaxing.  It also takes away withdrawal symptoms if you come off the real opiates.  I'd say a tramadol buzz lasts about 4-6 hrs. for me.  The best part is, in two years I haven't had to up the dose at all. ",
  "I take it with Soma and let me tell you, this buzz does rival even the best opiates.  Quite suddenly, a tingling sensation comes over my extremities along with a sense of profound relaxation.  Then I feel very much like I've taken a strong narcotic pain reliever.  Soma can make having sex pretty much impossible! I don't mention one experience with this because I've had so many, but I've had many pleasant walks with my girlfriend, gone shopping, traveling, movies (especially movies), sex, etc.  My girl loves it too. ",
  "For me the best part is I can still think and these drugs don't cloud my judgment much at all. I've never experienced a true withdrawal from either.  In summary, Ultram is just a phenomenal product and when combined with Soma, my God is this a great combo."
 ],
 "erowid": {
  "id": "43594",
  "citation": " Rio. \"Supreme Combo: experience with Tramadol & Carisoprodol (Soma) (ID 43594)\". Erowid.org. Jun 24, 2007. erowid.org/exp/43594",
  "substance": "Tramadol & Carisoprodol (Soma)",
  "views": "55615"
 }
}
