{
 "title": "Can Be Mentally and Physically Addictive",
 "author": "vortX",
 "citation": " vortX. \"Can Be Mentally and Physically Addictive: experience with GBL & Cannabis (ID 19831)\". Erowid.org. Sep 28, 2005. erowid.org/exp/19831",
 "substance": "GBL & Cannabis",
 "bodyweight": "80 kg",
 "header": [
  "DOSE:",
  "12 ml",
  "oral",
  "GBL",
  "",
  " ",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>I have been a GBL user for many years, but the last two years it became an addiction for me (2 ml dose many times a day and night). I wish I could take it for sleeping only, but I need at least 12 ml to knock me out. That's because, the last year I started smoking and smoking pot. Because when used together,  GBL and smoking washes away most of each others effects, I really smoke a lot (because being on GBL, you dont think how bad so much smoking is anyway). And I still use GBL a lot (because when I smoke I definely need more GBL to feel anything).</p><p>When I dont take GBL for few hours, I get all kranky, nervous, shaky and sweating. Being unemployed the last few months dont help a single bit ofcourse :(</p><p>My bedtime ritual goes like this: At two at night I try to smoke and GBL myself asleep, till noon, or later... In this long night, I can not remember falling out now and then, cos I probably do, cos it's been going on for months...But I can not remember having a normal night sleep...</p><p>I could take the 12 ml to get me asleep, but that only works for 0ne or Two hours and then I would be even more awake...</p><p>And more scary, twice I had a stinging feeling in my head, that only went away after putting my head under icecold water... It feels like a sunstroke and like dying in an extremely painful way... Overdose on GBL also make me jump around the house making really loud noises and screams (bit like Michael Jackson) and makes me have really nasty accidents. Broken bones are not uncommon for me.</p><p>Anyway, I decided to cut down the smoking first and then the GBL, cos the later, when used alone, is easier to live with for the moment... By the way, I use all sorts of drugs, but aim at the downers, special K, etc, and stay away from the uppers, speed, cristal, coke, etc.</p>",
 "year": "2002",
 "id": "19831",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-09-28T07:00:00.000Z",
 "views": "7718",
 "dose": {}
}
