{
 "title": "Why the Nausea",
 "author": "Alisha",
 "citation": " Alisha. \"Why the Nausea: experience with Amphetamines (Adderall), Propoxyphene & Hydrocodone (ID 19830)\". Erowid.org. Jan 19, 2005. erowid.org/exp/19830",
 "substance": "Amphetamines (Adderall), Propoxyphene & Hydrocodone",
 "bodyweight": "194 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " T+ 1:00",
   "20 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " T+ 2:30",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " T+ 8:45",
   "1 tablet",
   "oral",
   "Pharms - Propoxyphene",
   "(pill / tablet)",
   " T+ 9:30",
   "1 tablet",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   " T+ 10:30",
   "1 tablet",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>**Background info:  I am a regular drug user.  I do speed often (ephedrine), but at this point had not done it for about 2 weeks.  I had taken vicodin the night before this.  I am not on any prescription meds.**</p><p>Today is Saturday.  On Thursday, I was bored and my friend gave me some adderall.  At about 12:30pm, I took 3 Adderall xr by mouth.  I waited a little while and took 2 more about an hour later.  Still feeling nothing, I chose to take the last 3 I had around 3pm-ish.  I knew they were xr (extended release), so I thought maybe it would take longer to kick in.  Around 5:30, I decided to go to the hospital for my teeth (they had been bothering me, and I had no more narcotics).  I finally started to feel slightly 'speedy'- my heart speeding up a little, a little anxious/restless while driving.  I was still very 'with it' and capable of driving. [Erowid Note: It is extremely dangerous and irresponsible to drive while under the influence of a psychoactive substance. Don't so it!]</p><p>I got to the hospital around 6:10pm, and they took my vitals.  BP was about 165/95 (the bottom number very high for me) and pulse was at 105.  Temp was 'normal', according to the nurse.  I still did not really feel 'high', just kind of restless.  I sat in the waiting room, got checked out by the doctor, and was out of there with a prescription for some percocets.  I fill the prescription, and get back to my friend's house around 9:15pm.  I did not really feel fucked up at all anymore, but I did notice that I had majorly rapid speech when telling my friend what happened.  I convinced her to give me a darvocet, which I took by mouth.</p><p>Around 10:00, some other friends came over and someone gave me a hydrocodone.  I proceeded to snort it, and this went STRAIGHT to my head.  I felt so dizzy and giggly and happy.  I pretty much just relaxed on the couch, as I started to feel a little nauseous shortly after.  Around 12:30am, I went for a walk with a friend, came back and popped in a movie around 1:30am.  I then took another hydrocodone.  By now I was feeling REALLY nauseous, but not very tired, as I should have been.  This was probably the adderall.  I watched the movie and could see what was going on, but nothing was computing.  I managed to dose off around 6am and woke up at 7am.  That was all the sleep I got.  I felt nauseous all day Friday, and I still feel nauseous today.  I slept damn good friday night- 13 hours straight.  I am not sure if this or the nausea is from the pills or not (I took 2- 5mg oxycodone last night as well).  I will make sure I only do uppers OR downers next time- i think maybe that is what caused the nausea, and most likely what made me unable to sleep.</p>",
 "year": "2002",
 "id": "19830",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-01-19T08:00:00.000Z",
 "views": "41443"
}
