{
 "title": "New Respect for the Pill",
 "author": "JunkieJohn",
 "citation": " JunkieJohn. \"New Respect for the Pill: experience with Amphetamines (Adderall) (ID 19839)\". Erowid.org. Aug 29, 2007. erowid.org/exp/19839",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "90 mg",
   "IV",
   "Amphetamines",
   "(ground / crushed)"
  ]
 ],
 "report": "</p>[[Erowid Note: IV injection of crushed pills/tablets can be very dangerous due to unknown binders and fillers present in the tablets.]</p><p>I have a couple of doctors writhing me scripts for Adderall. And up until tonight I had only considered it to be a weak, but nonetheless enjoyable, substitute for Methamphetamine. This experience that made me have new respect for Adderall.</p><p>Bored Saturday night, and I have a fresh bottle of Adderall XR. DextroStat and Adderall XR capsules are filled with tons of tiny little 'balls', which contain the Amphetamines. DextroStat's 'balls' can be poured into hot coffee, which will melt the time release off, thus allowing one to ingest the full dose at once, I call it truckers coffee. However Adderall XR's 'balls' are alot tougher, the only way to get around the time release is to chew it up good (nasty taste) or crush the 'balls' between two spoons.</p><p>So I decided to try shooting it. I crushed 3 30mg capsules, for a total of 90 mg Amphetamine, using two spoons. I took a lot of work, because you have to completely powerdize the 'balls' or they wont dissolve. After cooking up my shot, I noticed the water/amphetamine mixture was a strange milky white color, but still looked shootable. Upon injection the Adderall took effect very quickly, before I even got the needle out of my arm. The feeling of the onset is amazing. The Rush starts with a lightheaded feeling similar to inhalants, but with an incredibly strong euphoric. An orgasm is about the best comparison I can think of.</p><p>The high (after the rush) is not as 'speedy' as I expected, less speedy that snorting or swallowing, however with a euphoria 10x stronger. I felt as if I where floating, no body weight at.  Very similar feeling to smoking crack, but much longer lasting. The High only last for about an hour. Then comes back the bad part, the crash is much worse then snorting, and it took all my will power to stop my self form taking another shot. Shooting Speed is VERY addictive, all I wanted was another great rush. Overall an amazingly pleasurable, and then depressing experience.</p>",
 "year": "2002",
 "id": "19839",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-29T07:00:00.000Z",
 "views": "74026"
}
