{
 "id": 19846,
 "title": "A Great Conversation",
 "date": {
  "submission": "2008-09-10T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jack Tripper",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "seeds",
    "quantity": "300"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "extract"
  }
 ],
 "report": [
  "I last smoked weed about 7-8 years ago at which point I had done it about weekly, if not two/three times a week at times.  I had quit for quite a while and then recently became curious about other experiences.  The last thing I tried, a few weeks ago in fact, was nutmeg of all things, which I found interesting but a little too 'dumb' and long.  This time I went to a local store here in Vancouver and picked up some morning glory seeds.  I did a lot of research previously and felt this would be best to start with as I have never done anything but weed.",
  "nner.",
  "I did a basic water extraction.  300 seeds ground up in an electric pepper grinder.  I put it through the grinder twice to get the seeds a really fine powder as the first time through there seemed to be too many chunks.  I then soaked the powder in a large mug, about 2.53 cups worth of water I would think, and let it sit in the fridge, stirring every 10 minutes or so.  After an hour I strained out the pulp goop with a metal coffee filter and drank a small bowl of dark liquid.  It tasted fine, nice and earthy.  I then ate about a teaspoon of ginger right away.",
  "After about an hour I began to feel a bit sick and by 1.5 hours my stomach felt a bit achey.  I ate another teaspoon of ginger and within fifteen to twenty minutes felt much much better.  Not sure if it is related or not.  One thing I should say is that at the two hour mark I felt fantastic, very light and floaty, my stomach was like nothing had happened and I even felt hungry and wolfed down two big hamburgers with no problem at all.  I was surprised and elated which really added to the positive vibe that the next few hours had.",
  "It was incredible.  The most powerful thing was just how intimate my communication was with my wife.  By the way, she had no idea I had done anything, not sure if that was good or not but it is the way it was.  Anyway, we had some fantastic conversations, much like when I was on nutmeg (I know, sounds cheesy just typing it) but for some reason when she would say something I would instantly think in my head of a couple responses and then choose the one that fit best her feelings and my true thoughts and ideas.  Her and I had a fantastic time just hanging out cracking jokes, no tension at all, which I am sorry to say doesn't happen often enough.",
  "We do have a good relationship, don't get me wrong, but a lot of where the conversation went (paranormal, religion, afterlife etc.) we usually got into heated debates over.  In this case I felt I was picking up on so many subtleties in her voice and body language and could respond so naturally and favorably, like I said before, in ways that did not offend her and yet still stayed true to myself.  It was a great learning experience.  In fact later in the day I could sence that my wife was so enamoured with my attitude that she quite forceably 'instigated relations' ;) with me.  Not to say that she never has but it has been quite some time since she so freely and lovingly approached me in that manner.",
  "There were some minor visuals effects etc. but pretty run of the mill photoshop filter looking fractal thins in the ceiling, kind of neat but quite faint and to be honest not half as interesting as the mental/conversation dynamic insights.  One nice thing was that 12 hours later when I had gone to bed and the majority of the experience seemed to be over I layed down in bed and saw flashing lights and then began to compose complex music in my mind, layer many tracks of sound etc.  It was quite phenominal and almost actually audible.",
  "I will return to Morning Glory.  Next time I will probably try 400m grams and go for a walk in the park.  Nice stuff."
 ],
 "erowid": {
  "id": "43637",
  "citation": " Jack Tripper. \"A Great Conversation: experience with Morning Glory (ID 43637)\". Erowid.org. Sep 10, 2008. erowid.org/exp/43637",
  "substance": "Morning Glory",
  "views": "8235"
 }
}
