{
 "id": 19840,
 "title": "First Encounters of the Strangest Kynd",
 "date": {
  "submission": "2000-06-29T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Stuttering Poet",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "DISCLAIMER: This is just a story, the people and events in this story are purely fictitous and any resmblances made to any human beings are simply coincidental.",
  "Now with that out of the way let me tell you about my meeting with the Green Goddess. It was about two weeks ago that my first shipment of Salvia came in. I had heard wonderous reports about its effects and I just had to try it. Not because I'm some drug crazed freak, but because I felt destined to partake.",
  "I wasn't thrilled about using a new substance by my self. So once receiving the shipment I made like Aries, and went to my friend J's house. You see J was the perfect person to join in a ceremony with me. He is a spiritual psychonaught with peaceful Utopian tendancies.",
  "Once arriving at J's abode we decided to take a walk in the snow filled woods, to the harmonious womb of nature. There we would find the peaceful area in which we would wish to try to embrace the mysts of Salvia.",
  "It was about 9:00pm or so, if I recall correctly, that we took our first hit. J went first then me. As soon as he took his hit he started wobbling around as if he had drunk himself into a stupor. He started raving 'Am I all right! What's going on?!' I couldn't believe that he was actually having any effects off just one hit. I asked him if he was faking it and if he was seriously off his rocker. He just responded in a way that made no sense. Speaking half phrases and insane jibberish.",
  "I decided it was my turn so I took a hit and instantaneously I looked to my right and saw a huge vanilla ice cream with a cherry on top, sitting on the horizon. I just became completely over whelmed and fell over to my left in the snow. I tryed to get back up but was unable in succeding for what seemed a minute or two.",
  "Once I was able to get back on my feet I noticed that all the trees around me were giving off a blue glow. I felt that the force that had just been over me was rapidly leaving. J still was stupifid he didn't know wich way was up or down. Every utterance he made was repeated by a complete contradiction.",
  "After about 10 min or so, we were pretty much down except for the fact J still couldn't make sense of too much. We both thought we had just touched on something that was much bigger in scope than what we had just experienced. That's when we decided that we would venture a little further and take another hit each.",
  "So we found a nice spot, in between to pines, to sit down and take another go around. I took the first hit this time and I again saw the blue glow around the trees around me. I felt invigorated and got up and went off on a walk. I vaguely remember saying I was going to hunt some rabbits.",
  "J was left sitting on his own when he took his hit. I was coming back to where he was because I didn't want to leave him on his own while he was stupified. When I got back to where he was in the woods, I found him speaking in the most absurd ways. He would say, ' I need to go run now' followed by, 'I feel sick' then he started laughing. He fell over backwards into the snow and said,  'I need to sit down now'. He just kept on saying and doing these contradictory things for the next 5 to 7 min. until we were down into what we now call the Enlightened stage.",
  "After smoking that last time we left the woods and started on down the road back to J's house. On the way back we noticed we felt completly envigorated in the mind and our bodies felt completly relaxed. We felt as though we were truely enlightened. The level of our discusions were far beyond that of the 'marijuana universe pondering'. We thought of some truely abstract, yet realistic ideas of who and what we truely are. These enlightened effects lasted the rest of the evening, for the both of us.",
  "This was to be the first in a chain of of Salvia experiences. The first attempt at meeting the Green Godess only peeked through the key hole in the door to her house. We would later be invited right inside.",
  "But that is a story for another time........."
 ],
 "erowid": {
  "id": "436",
  "citation": " Stuttering Poet. \"First Encounters of the Strangest Kynd: experience with Salvia divinorum (5x extract) (ID 436)\". Erowid.org. Jun 29, 2000. erowid.org/exp/436",
  "substance": "Salvia divinorum (5x extract)",
  "views": "5387"
 }
}
