{
 "id": 19852,
 "title": "Playing with Them",
 "date": {
  "submission": "2007-06-26T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Halcpath",
  "gender": "Male",
  "weight": "260 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 g",
   "administration": "oral",
   "substance": "Cloves"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "7 joints/cigs",
   "substance": "smoked"
  },
  {
   "time": "Cloves",
   "amount": "",
   "administration": "",
   "substance": " "
  },
  {
   "time": "oral",
   "amount": "Cloves",
   "administration": "(extract)",
   "substance": ""
  },
  {
   "time": "0",
   "amount": "oral",
   "administration": "Alcohol - Hard",
   "substance": "(liquid)"
  }
 ],
 "report": [
  "I decided to test several delivery methods against each other and I will describe the effects of each. The methods I chose are A) smoked in clove cigarettes, B) clove infused alcohol, and C) cloves themselves.\rSetting:",
  "I had taken large amounts of dental grade eugenol before this and Im on the come down/after effects of it. I came into this feeling calm and detached, though at the same time slightly depressed. Its late at night, icy outside, one friend is present and trying testing out a different substance, and there are ambient soundscapes playing.",
  "Note: pardon any errors and the peculiarity of the structure of my sentences I believe this is part of the clove inebriation and Ive had quite a few before these tests I did for the sake of this report.\rCloves:",
  "Intended dose is a 5 grams taken at once to be followed by snacking on cloves over the 'trip' until I reach 35 grams. I intend to take the eugenol this way since I cant stand the burning of the eugenol in my mouth and also it hits me very fast and strong.",
  "T+0:00",
  "As soon as I start chewing the cloves there is an intense burning sensation in my mouth.",
  "T+0:05",
  "Ive consumed about eight grams. The burning is in my throat now as well, my tongue is numb, my lips burn and are numb at the same time, my gums burn and tingle. I feel a little dizzy.",
  "T+0:30",
  "Consumed fifteen grams now, everything is numb and chewing is getting difficult. I feel numbness and a sort of lazy feeling slowly covering my body staring in my mouth, throat, and stomach and moving out. My head is spinning, my vision is blurry, music feels like its now my blood, my heart feels like its in my head.",
  "T+0:50",
  "Thirty grams. I cant do this anymore, Im so lazy and numb I think im going to fall asleep. Its almost like heroin but its not at all at the same time. I feel like things move through me, I have a sensation that Im falling constantly into some abyss inside of my self, lights are distorted and my hand traces a bit, my eyes feel dry. I certainly dont feel any pain now, I cant feel anything and I thought my heart stopped but it didnt. I cant really walk because I feel so dizzy, numb, and tired. Everything smells like cloves to me. This all has a very airy or ethereal feel to it. Everything feels like its there but its not and its as if the lightest but warmest blanket in the world has been pulled over me. After I get some rest or start to come down I will begin with cigarettes.\rClove Cigarettes:",
  "Ok about four hours later Im on the tail end of the chewed cloves. I have a pack of djarum blacks Im about to break into.",
  "T+0:01",
  "Lit and took a large drag off of the clove cigarette directly into my lungs and instead of feeling the normal nicotine rush I immediately felt like everything was blurring. My knees are weak and Im shaking and shivering.",
  "T+0:05",
  "My vision is distorted but only slightly and I feel a little inebriated in the way alcohol would make me a little tipsy but it feels a little more, er airy. Music beginning to feel like its physically enveloping me.",
  "T+0:10",
  "Im half into my second cigarette and everything is blurring, I feel like Im falling and I cant feel the icy air outside on my skin. I feel pain but it feels as if it isnt there at the same time. If I pinch my self for instance I feel the pain but not on me or a part of me, its as if its floating out over my body and it doesnt really matter. My lungs also feel numb, like they dont exist. My mouth tastes like apple pie and burns a little. The sense that music is physically enveloping me has developed to a sense its both running through me and covering me like a blanket.",
  "T+0:30",
  "My legs are weak, my fingers are weak, everything is hard to move. Im not quite sure what people are talking about and I dont really care. Writing this is a chore.",
  "T+1:00",
  "Ive finished off maybe around 7 and after maybe my second and a half or third I became far too lazy to do anything but smoke. Even then knocking the ash off the tip of my cigarette was and is a chore. I feel like Im falling and going somewhere but Im quite sure Im not at the same time. My body is numb and I feel a light sort of euphoric feeling but I cant quite pinpoint where in me I feel it or if its in me at all. Lights are blurred, music can stop me from moving it has so much power over me, and I feel a sort of stiff sensation hovering outside of the physical location of my body and moving around. Again Im far too tired and numb to continue writing. Next is alcohol.\rClove Infused Alcohol:",
  "Ok, well that wore off in about an hour but I feel like hell, the alcohol should be just the thing for this. Ive used 35 grams to a single 750ml bottle of vodka and let it sit in a sunny spot for about 5 months. This is really what Ive been waiting for and exactly what I need after the cigarettes. Since we are talking about alcohol and cloves here Im going to be writing this part after I return to base line.",
  "T+0:15",
  "I finished off maybe 1/4 the bottle. This stuff is hard as hell to down because the vodka burns and the cloves burn separately and simultaneously. I already feel very tired, very numb, and outright depressed. I feel warm and it feels like its there and not simultaneously, sort of like how I feel when I remember a time I was out in the sun only stronger.",
  "T+0:40",
  "By this point I had consumed around 1/2 the bottle and became so tired and numb that I decided I didnt want to risk spilling the alcohol. I felt like I was wrapped up inside my self and like nothing mattered in the world. I promptly fell asleep and slept sound for the night.\rThe Day After:",
  "After having done all of this I woke up with my eyes feeling very dry and feeling a large part of something was missing inside of me. I feel a little nauseated but its nothing a meal wont fix. Im really disconnected from the world and it doesnt really annoy me. Nothing really annoys me but its so depressing feeling like I have this huge spiritual/emotional hole in me that I cant pinpoint nor can you fill up. I feel really alone even though my friend is there, er well he is here in spirit since he is still in his own little world. \rConclusions:",
  "Personally Ive come to the conclusion eugenol certainly works and an anesthetic but its not really something I want to get fucked up off. Maybe my feeling empty has to do with something that was always there that I just found through doing this. All in all I will stay away from everything but clove cigaretts since they seem to work wonders on chronic pain I have in my lungs.",
  "Note2: 35 grams was my choice for two attempts because this is the amount I get per jar from my local market and cloves arent exactly cheap you know."
 ],
 "erowid": {
  "id": "43660",
  "citation": " Halcpath. \"Playing with Them: experience with Cloves (ID 43660)\". Erowid.org. Jun 26, 2007. erowid.org/exp/43660",
  "substance": "Cloves",
  "views": "31953"
 }
}
