{
 "id": 19868,
 "title": "Finally A Breakthrough",
 "date": {
  "submission": "2001-12-24T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "flyer71",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "After hearing about salvia through a magazine article, I began to research the drug and its claims.  After some research I procured some online and received it via FedEx Letter later that week.  It was Jan 2000 and some friends and I took some hits after hitting the bars and while waiting for some mescaline/MDMA conglomeration (strongly discourage this mix) to hit us.  We were sans pot and were smoking the salvia in the wrong mindset. Though I had read several experiences, I was smoking a lot of pot back then and couldn't prepare my mind for a salvia trip.  Also, I didn't hold the smoke in for the recommended length.  After some mis-smoking of the plant, we chalked it up to being nothing more than a sales gimmick and I put the bag away.  Forgotten. ",
  "Move forward almost one year:  December 2000.  I am preparing for mushrooms; reading as much as I can about the effects.  As I came to the Erowid site I see the Salvia category and thought, 'Might this substance be true?'  I read up as much as I could and decided to trip without a sitter.  I had to be in the perfect mindset and figured I could handle it.",
  "I turned off all the lights and put my Geiss music screensaver on to some bagpipes.  I took 2 bong hits and held them for what seemed like a minute.  I lay down in my bed and began to feel a little unbalanced.  I started getting visuals, but not visions.  These visuals were more space and dimension oriented.  Everything in my room seemed to have a two-dimension quality but very much so floating in a three-dimensional room.  Intrigued, and not sure on the strength of my year-old salvia leaves, I decided to smoke one more hit.  After exhaling, I went to sit back against the wall behind me but couldn't find it.  My bedroom seemed to be completely tilted--as if I were standing on the corner of the floor.  If I moved forward I would surely fall into the abyss. I fell backwards and crashed into the wall.  I felt relieved that the wall was there. I got up to walk around and noticed that my whole apartment was the same, but two-dimensional and very distanced from me.  My mind knew that this was the effects of the plant, so I kept waiting for it to fade away (that was the one drawback--I guess I'm too grounded to get lost in enlightenment).",
  "After about ten minutes I lay down on the couch and closed my eyes.  I still had this two-dimensional feeling as if I had just been shown things how they could exist in other's eyes.  A little later, the feeling wore off and I was amazed that I finally was able to see the world differently then before. ",
  "For me it seemed to open up my mind to realize that there are other ways to view the world and other ways to be a part of it.  If we are truly from the earth, and to the earth we will return, it is a gift that we can experience that which MotherEarth has to offer us.  I went from sceptic to believer.  Just wish it wouldn't have taken a year to realize it."
 ],
 "erowid": {
  "id": "4373",
  "citation": " flyer71. \"Finally A Breakthrough: experience with Salvia divinorum (ID 4373)\". Erowid.org. Dec 24, 2001. erowid.org/exp/4373",
  "substance": "Salvia divinorum",
  "views": "6455"
 }
}
