{
 "title": "The Hurried Treadmill Stopped",
 "author": "Big J",
 "citation": " Big J. \"The Hurried Treadmill Stopped: experience with LSD (ID 1986)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1986",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>It was towards the end of my freshmen year of high school. (It had been a year of many changes for me.) I had gone to an all boys private school in 7th and 8th grade where I was miserable. They were rich,shallow and boring. I was middle class,laid back and energetic. When I finally returned to Hanover County public schools from my two year exile, I was enthralled. I made up for everything I had missed. I partied, I got drunk, smoked weed, hung out with girls every chance I got and felt good. My many experiences of being intensely stoned stimulated my already curious, creative and active imagination. I found the 'distortions' of senses thrilling. But I wanted a more intense experience.</p><p>So one night in drivers ed i happened to speak to a dealer. The next night i was presented with 10 tabs of what he reffered to as wizard of oz. A friend and I ate five each on night with a little campfire in a field next to his house at 12:00. We sat there talking for a while not knowing what to expect. At first I felt like a child finding everything novel and entertaining. Eventually, the giggling turned into occasional bouts of intense staring and engrossing visual images. 'My' old world was transmogrifying into Jung's archetype's and the Buddhist void. Little cognition was involved in my activities and events are difficult to recall. (Probably because it is state dependent) We went for a walk to the other end of the field. We suddenly stopped as the darkness felt like liquid enveloping us and reading our every thought. The usual field was now a horizontal cliff which frightened us even though we still can't recall why. Perhaps it was fear of the unknown or a projection of some fear embedded in our conciousness we were not ready to face. Anyways,we unanimously decided to make our way back to our campsite. Our pace became hurried. It felt as if the faster I walked, the faster the 'object' that was back there was coming faster and faster. Regardless,we strained to walk casually. I looked at the ground and my feet to keep focus on the task at hand. An old corn stalk on the ground suddenly turned into a corpse and grabbed my ankle. It finally let go and I hauled back to the warm shelter of the campfire which nestled us from the darkness of the unknown.</p><p>At this point my already racing treadmill of a mind was blazing. It was approx. 2:00 when we had returned to the campfire. We decided to lay down and relax. From there I was taken into depths of undescribable and unforseen places. Were they places of my mind or other demensions I don't know because 'I' was not concious or attentive during the period of 2:30-6:00. The eyes simply observed as my usually racing mind apparently stopped doing and started being. No deadlines, no worries, no emotions, just existnece in as far as I have yet experienced it's purest form.</p><p>When my ego had returned from vacation, my friend and I sat in awe and could only say wow. I felt as if the universe had been passed into the neurons of my brain and engraved in my gentics. Preconscious cellular processes were now understood to me. I could feel the platlets in my blood cells forming. The quick of my fingernails pushing and growing every so slowly. At 8:00 after taking a walk into the woods and playing catch with a water bottle, we went inside to have breakfast. We laughed our balls off at his dad telling old fighing stories and looking at his face still looking like a goblin. I went back home about 9:30 and fought off falling asleep until I gave in and slept for hours. My dreams were strange and acted like an exstension of the trip. When I woke up the next morning I felt refreshed and viewed life in a new aspcet.I also now knew that I could stop my ever nagging mind from bothering me when I needed to, just as wizard of oz had shown me. That experience sparked a burning passion for knowledge, spirituality and a zest for life I sometimes have forgotten in this fast paced and hurried life Americans lead nowadays.</p>",
 "year": "",
 "id": "1986",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-20T07:00:00.000Z",
 "views": "3102",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
