{
 "title": "Brain Wrapped Around the Universe",
 "author": "G 96",
 "citation": " G 96. \"Brain Wrapped Around the Universe: experience with LSD (ID 1987)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1987",
 "substance": "LSD",
 "bodyweight": "",
 "report": "<p>My intention was to return to that rather frightening but nonetheless undeniably intriguing place where I had been on my last trip... yes, that bizarre 'brain wrapped around the universe' mode. This time I was equipped with a greater degree of understanding of the place, due in part to conversations I had had, and in part to my own realizations in integrating the details of the last trip.</p><p>Only 2 hits of LSD this time... but it was quite enough. Again, the start time was late at night. I lie in bed. My brain and body thought that they were preparing for a night's sound sleep... heh heh, little did they know. Shortly, I began to stretch out in my bed, much as a dragon would awaken at the scent of battle. I felt the wind. Not the physical wind in the atmosphere, but the psychic wind that permeates all things (of which more later).....it swept through me, awakening with a tingle the dormant energy within me. I began to writhe in its glorious unearthly currents. The visuals emerged, separating out from their usual role as scaffolding in the structure of reality, and exposing themselves for my manipulation. They were part of ME. It wasn't long before I was again the conductor of an alien orchestra... the orchestra of my brain. I literally swept the LSD visuals into their structure as the representation of my brain... or else they assembled themselves.</p><p>My first reaction was a sense of horror -- because I had forgotten the hellish feeling of Metaphysical Emptiness I had associated with this before.. the feeling (which I tried to describe in another report) that All is an empty illusion, and the only truly existing thing was just a brain/thought process that happened to be in a particular configuration in the pre-determined cycle. Instead of seeing the world, I saw the underlying reality behind the world, namely, the amorphous tissue behind the retina -- a total deconstruction of reality into the ugly, raw input. I was a mere detail, a mere surface expression of this inevitable program. But this time it made some sense that it hadn't really made before-- I knew I didn't have to get locked into a one-dimensional thought process (in which you can only do two things... go toward the light or away from it).</p><p>Instead of 'me' being trapped inside heavy folds of brain tissue, my brain was laid out before me like the keys of a vast piano. My room was my brain. And my body was also my brain. Through the cells in my body I could feel the thoughts in my head and orchestrate the vision 'in my room', because the room was also in my head. I could also see my thoughts in the room, as if they were located in various places in my brain.</p><p>For the next few hours I explored my brain as if it were physical territory. I thought.... my God, it is so dirty in here. How could I even see correctly with all this gunk here? It occurred to me that cleaning it out would clear up my perception of reality.</p><p>There are places in the brain that correspond to the various emotions. Love and hope and joy are up above... I reached upward with my mind and instantly, I was a fountain of light, bursting with joy in all colors, existing as pure, light consciousness. Heaven! But it was very brief.</p><p>Pleasure, enthusiasm, aggression... are various places along the forward equator -- responses that propel us forward. To the side, humor, disgust. I did see some pretty disgusting things... in fact I had my first real taste hallucinations -- I tasted bitter rue! It was in a corner of the mind along with hair (sticky matted stuff like you find in drains and sinks), bubbly purplish snot, and some octopus tentacles. Yuck! But I laughed, because it was SO bad it was funny. I quickly got out of that one by swallowing it and 'recursing' up, up and away.</p><p>More places in the brain -- behind is fear, below is despair. I was overcome with fear when I 'went' to that spot, for a moment I was crouched in the corner in terror. But realizing that it was a place that I had gone, just like the love/joy place, made me realize that getting out of fear is simple -- just move up!</p><p>When we refer to thoughts and feelings, we like to use physical terms for them... 'sinking feeling', 'really reaching', 'deep thoughts', 'preying on the mind', 'a flash of insight', 'feeling tense'... I know why now... the unconscious mind knows full well what muscular tensions and motions correspond to various kinds of thoughts and emotions, and so 'figurative' language developed in a way that represents an accurate portrayal of these muscle motions. One particularly funny moment was the occurrence of dawn. Not just any dawn (in fact it was 3 am), but the Archetypal Dawning Moment, the dawn of a new age, I had finally 'awakened', something had 'dawned' on me. I felt that each awakening was a reconstruction of self-aware consciousness, a miniature echo of creation.</p><p>In the brain, there are various closets and broom cupboards and unswept corners and attics. One can get into quite a cleaning frenzy, opening up old trunks and so on. Typically what I found was cliches and habits and instinctual behavior. All the ingredients of personality. I found that 'reaching' physically and 'reaching' in the mind are the same. All the time on acid I find myself reaching with my right arm for things, especially my glasses, whenever I want to reassert my intellectual hold on the situation. Now I see why! That's my left brain 'reaching' into the right brain and rummaging around -- that's my way of visualizing the process of connecting unconscious symbols with conscious intellectual ideas. I started to realize what dreaming is... literally, housekeeping. All of that stuff there in the corners exists in symbolic form.</p><p>The archetypes are back there. Those symbols have not just been collecting dust all this time, either. I have been associating things to them constantly all my life, actually, probably eons beyond my present life. Snakes, for example. I saw them there, in a corner. The archetypal reptile. But this time, I made a connection to these snakes that brought them out of the closet of the unconscious mind and into consciousness. These snakes were kundalini energy, the Serpent Power. And what was the serpent power? It was the control of brain muscle. Here I had been storing all this occult symbolism for centuries, and just now I was making the connection between all that occult symbolism and an internally perceivable mind-state. These connections were thrilling to the mind... the mind which keeps everything around, knowing that one day, connections can be made between everything.</p><p>That is what I felt the last time, but didn't understand. I saw or felt, as I was turning my body, shoelaces (karmic threads) being vacuumed up and disappearing. A sense of recursive levels of a deeply nested function all finally collapsing and producing a result. These recursive levels went back for eons. I realized what karma is -- unconnected bits and pieces that need to be connected. The mind is on a continual quest for knowledge (spiritual growth), to make connections between ideas. That quest is necessarily repetitive, trial and error. A single experience of deep connection with the spirit might wrap up years and years of karma. Certainly the awakening of kundalini and the understanding of powers of the body hitherto unknown had this effect. Certainly the penetration of the light of consciousness, with its scientific training, into the depth of the unconscious, enabled the unconscious to make connections it couldn't make all by itself. And likewise, I the conscious mind made some connections that I couldn't make all by myself. These connections are visualizable as threads in the cosmic fabric... the ego and the id are relentless knitters, tying this fabric into a sensible reality. The mind is literally obsessed with reality and truth... obsessed with a need to know. So obsessed that it is willing to risk insanity or death to discover its true nature. Self-awareness is the process of connecting inner states to outer states, where those outer states are also a part of oneself.</p><p>I become strangely 'inverted'... outer and inner reality were somehow reversed. I could 'see' my brain 'out there' (even though it looks like ordinary reality for the most part, I 'knew better'), and it was kind of hard to make sense of ordinary tactal input. I think there was something weird about left/right being reversed that confused me. I was lost inside the brain and didn't know where the eyeholes were. I was locked into perceiving oneself as a brain and I couldn't figure out how to turn myself back 'outside-out'. I spent many minutes trying to figure out how my cat was able to exist inside my brain there with me. I thought it was because she was actually projecting herself into my thoughts. I also was a bit concerned that I would have cat hairs in my brain.</p><p>I could hear some slooshing sounds (brain gloop sloshing around) and felt nauseous when I stretched my brain a lot. Also, it was a sore afterwords for a day or so, so I really do think I was using those muscles.</p><p>If this sounds rather frightening, it is! At first I felt a great sense of power...... ah, I can direct everything from here! One quickly realizes that this is more of a responsibility than a power. I thought: I'm not qualified for this! Allowing the unconscious to become conscious might not be a good idea... this is like promoting someone with no experience (the ego) to a job they aren't qualified for... but which for the Id is old hat... routine, even dull.</p><p>The biggest danger is the panic reaction. Don't Panic! The unconscious is still operating, so just letting go of the ego is the answer here. I had the idea (the same fallacious idea I had the first time) that the only way to recover normal reality was to retrace my steps... this is wrong. Normal reality is a natural state of affairs... simply allowing normal reality to return, having 'faith' that everything is O.K., and not worrying about it, is necessary here. Going toward the light does work. Light is input from out there, and restores ones orientation to the world outside.</p><p>Again I went back to the deep loop in which my thought cycles through God, free will, time.... although this time I had some idea what I was after. I was testing the limits of my model of reality. This is where it hurts. This is where my model of reality is really strained. It has some gaps in it, and the gaps are connected with God, free will, , and time. I write in there, because there is something nameless in that list of four things that keeps recurring in my thoughts as a sub-linguistic concept. Because I haven't named it, I can't really even consciously understand what I am representing by it. It may have something to do with 'soul' or 'psyche'. I learned a quite a bit this time (I can talk about it in another message)... I discovered that a lot of what I associate with the word 'God' is part of me (a 'higher self' or the id, or something). I'll write up some of my other insights in another message.</p><p>After giving in and trusting the natural functioning of the body, I regained some sense of normality, and was able to appreciate the brain aspect of awareness as a dual form of awareness (although I am still a bit confused about some of the details as to how outer reality maps into inner reality). I spent some time getting more comfortable with this new way of experiencing part of my body (and mind). I realized how I don't really know how to operate my whole body, and I am just learning how, like an infant. I experienced myself as biomorphic protoplasm, an organized aggregate that has organs that extend into the world of 'mind' as well as the world of 'body.' Just as the skin protects the body from physical invaders, there is also a membrane that separates Self and Other in the realm of mind. It is the job of self-aware consciousness to stitch together these two membranes (the physical membrane includes the eyes and ears) -- this stitching is the re-creation of the perceived universe.</p><p>The descriptions of kundalini awakening seemed to describe what I had experienced, and I agree with Gopi Krishna's assessment of it... it is a force that pushes evolution forward. I wouldn't be surprised if 'the kundalini force' turns out to be a psychoactive chemical that can flow in the nerves.</p>",
 "year": "1996",
 "id": "1987",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-20T07:00:00.000Z",
 "views": "3544",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 }
}
