{
 "id": 19876,
 "title": "The English Paper",
 "date": {
  "submission": "2011-05-04T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Confused",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "600",
    "grams": 0.6
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "400",
    "grams": 0.4
   },
   "administration": "insufflated",
   "substance": "Caffeine",
   "form": "ground/crushed"
  },
  {
   "time": "0",
   "amount": {
    "unit": "glass",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  }
 ],
 "report": [
  "Well, just yesterday I had the goal of writing my 6-page research paper for my English class. But I knew I couldnt do this cuz Im usually tired and just wanna sleep. Soooo.... I thought of the brilliant idea of using the aid of caffeine pills to keep my mind focused on the task at hand.",
  "I went to my local pharmacy (CVS) and was searching where I could find some caffeine pills. After a while of searching I found the sleeping pills section and conveniently the caffeine pills were right there as well. I wondered which brand I should choose, I mean I could get 80 pills or I could settle for 40. I wasnt even considering by the packages that had less. I finally settled with the pack of 40 vivarins cuz they were only $2 less then the pack of 80 CVS brand pills so I figured that they must have been good or something.",
  "Alright, at that time the fun was on its way... I waited until I had privacy up in my room and I cut one pill in half and scraped all of the yellow outer part off the pill. I crushed the pill into powder and decided to suck up some lines. I gradually snorted almost the entire pill while I simply swallowed another pill. I waited for a lil and I figured that my concentration was better so I got started on putting together my paper. I started to feel somewhat stimulated so I had the sudden desire to masturbate so I knocked one or two out and got back to work.",
  "Anyways...when I started typing up this thing I downed another yellow pill and put on some music. I had some good energy by now and reciting the songs on the radio and I was spitting words as smooth as a piece of glass. I really was enjoyin myself by now. I was lovin the energy the pills gave me. Well I continued writin the paper and by now I almost had 2 pages which was real progress for me. Whenever I felt as though I needed more energy to help me finish the job I took another pill.",
  "By now I think I swallowed 2 pills and snorted the most of two other pills and just swallowed whatever was left of each pill. Also, throughout the entire time I must have crapped like 3 times. I also checked my pulse every minute to see if it got any faster, umm I guess it did speed up a lil bit. After I finished three pages I took a break and used the internet and just listened to music or whatever. Oh yeah, by the way, I had a can of diet coke with lime. I eventually had my 5th and final pill and after about 2 hours after I took it is when the damage occured...",
  "I felt so horrible. Something like a really bad hangover where u feel really nauseous and wanna throwup. it was weird cuz I felt nauseous but when I tried to throw up only a lil came out, I guess I didnt eat enough. Awww man this was the worst feelin ever. How could caffeine do this???? I was tellin myself that I would never do drugs again I just wanted this feelin to go away. I seriously thought I might die or something but I realized that my friend survived when he did a gram of coke, so I kinda knew that everything would be fine. Still I just couldnt believe how bad I felt. The nausea was horrible. All I wanted to do was sleep but with all that caffeine in my body there was no way. It was 3 am by now and I wasnt even considering finishing my paper, I felt so horrible...I failed to do the task and now I felt like shit.",
  "With some extreme luck I was finally able to sleep who knows when, but I woke up soon enough and was just glad it was over, even tho I felt like crap in the morning, but no where near as bad as the nite before...by the way, in the morning I weighed 114 and usually I weigh no less than 118. I guess my metabolism increased quite a bit, plus I lost some fluid weight too of course."
 ],
 "erowid": {
  "id": "43751",
  "citation": " Confused. \"The English Paper: experience with Caffeine (ID 43751)\". Erowid.org. May 4, 2011. erowid.org/exp/43751",
  "substance": "Caffeine",
  "views": "7788"
 }
}
