{
 "title": "A Plateau of Sparkling Clarity",
 "author": "Roc Shaman",
 "citation": " Roc Shaman. \"A Plateau of Sparkling Clarity: experience with LSD (ID 1988)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1988",
 "substance": "LSD",
 "bodyweight": "",
 "report": "<p>I was sitting in the living room listening to Pink Floyd's first album, The Piper At The Gates Of Dawn, when I first noticed a slight change in atmosphere. The walls in my small but high-tech hovel, seemed to start undulating as if they actually breathed with a life of their own. I was startled at first but quickly realized that this must be a direct result of the natural inspiration in which I had imbibed. I slowly floated into a kind of separate reality, construed of a nature totally unknown to me before, but yet, so real. Or at least so it seemed to me at the time. I recalled vague, complicated words written by Aldous Huxley in his treatise on mescaline.... The Doors Of Perception. Chairs and curtains, I KNEW what he meant. The lines, the shapes, the colour. These thoughts all came to me and meandered about and through my head like fleeting spirits from beyond reason. Thats when I realized that profound changes were taking place inside my very head. I was never to be the same again I thought, this is the end all of end alls. This is the key to that realm that has always just been out of reach, just outside of my limited perception. It was as Huxley had said, the flood gates had been opened. I searched in vain for a reason but all reason had floated away like the smoke from my cigarette. My ego had died. My SELF had dissolved into an effervescent cauldron of teeming geometrics. I was one with all. To me, that brought great peace, no fear, and no reason to reason. It was if a great burden had been lifted from my shoulders, I was free. And in that instant I realized, we all are free. It always has been and always will be a matter of perception. And we hold the key.\rTHE PEAK</p><p>I had reached a peak, a plateau of sparkling clarity and conciousness. The world was sound, a vibrating molecular dance from the infinitesimally small to the infinitesimally vast, deeper than anything I'd ever imagined. I looked out the window and saw machine clouds churning through an endless sky. I saw light and colour and vacillating patterns possessed of an indescribable essence. I realized that the room and world around me were alive and that all things spring from the Divine Ground. This must have been what the ancients felt when they spoke of the Great Spirit and in my minds eye, I could almost see an old shaman standing by his fire, arms outstretched to the heavens, with spirits dancing all around him, in the shadows...</p><p>There is ancient wisdom and knowledge here, something that prescinds the truths we've come to accept in this civilization we've built around us. Something that transcends dogma, religion, culture, all the established ways and mores of society. And for a time I'm ecstatic about being apart of and witness to this deeper truth. I found myself wishing everyone could glimpse this ...path, this window. Surely no one could go through this experience and not come out of it a little more fulfilled or centered, a little more whole...</p><p>There is also a certain amount of fear here. This I found on introspection, to be inevitable considering the complexities and fear that pervades the world around us. But it didn't last, ecstatic communion and hope won out as I realized that I held the key to keep, or let go of, the fears that I possessed. Like I said before, it's only a matter of perception... </p>",
 "year": "",
 "id": "1988",
 "gender": "Male",
 "timestamp": "2000-06-20T07:00:00.000Z",
 "views": "11306",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.5 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 }
}
