{
 "id": 19888,
 "title": "Lost All Muscle Control",
 "date": {
  "submission": "2008-03-25T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Addicted",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(daily)"
  },
  {
   "time": "0:00",
   "amount": "405 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  },
  {
   "time": "0:30",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:00",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "The day started normal. I rolled out of bed and popped my SSRI(10MG's of Lexapro). I took this medicine for one reason, that my drug of choice, DXM had nearly a reverse reaction while on it.",
  "But soon I found myself wanting to take it even with this in mind, I went up to the store and stole a 4oz Bottle of Maximum Strength Cough(CVS generic to robotussin which contains 360mg DXM). I also stole a 100 bottle of benadryl as well as a bottle of Robotussin Cough gels.",
  "My location: a strip mall located inside of a residential area. I downed the bottle of cough syrup as well as 3 cough gels(405mg's DXM). I waited about a half hour and took 300mg of benadryl. After about an hour I decided to smoke some weed. I went behind the parking structure and blazed a couple bowls. It is about 12:00pm on a sunny day. About half way through the second bowl I suddenly lost complete muscle control and dropped my beautiful glass bowl on the ground, and I too fell to the ground. I was not really feeling the DXM but the benadryl and weed were there.",
  "I started walking, scared as could be. Suddenly it happened, time and time again. In the middle of walking I would just feel totally weak and fall over; brief periods of complete loss of muscle control. Finally I just curled up in a ball and kept falling over. Then I completely lost control. I could not move. Let me state I was not very high. I was just sprawled out, motionless, helpless. A few minutes went by like this when my body suddenly began spazzming. About two hours went by like this, I could not move although I would have a siezure every few minutes.",
  "I have since tried many drugs while on my SSRI, and let me tell you bad things ALWAYS HAPPEN. I drank a fifth of vodka and had alcohol poisening for over 3 days. I took 4 barbituates and was totally uncordinated for 2 days, yet never felt high or relaxed."
 ],
 "erowid": {
  "id": "43784",
  "citation": " Addicted. \"Lost All Muscle Control: experience with DXM, Diphenhydramine, Escitalopram (Lexapro) & Cannabis (ID 43784)\". Erowid.org. Mar 25, 2008. erowid.org/exp/43784",
  "substance": "DXM, Diphenhydramine, Escitalopram (Lexapro) & Cannabis",
  "views": "14347"
 }
}
