{
 "id": 19893,
 "title": "Short and Comfy",
 "date": {
  "submission": "2005-11-08T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Z.",
  "gender": "Male",
  "weight": "130.2 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "0:00",
   "amount": "0.083 tsp",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": "0:00",
   "amount": "7.0 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:08",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:04",
   "amount": " tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:04",
   "amount": "0.125 tsp",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": "2:04",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "[Combining MAOIs with other psychoactive drugs carries serious medical risks and can result in extremely unpleasant side effects, overheating, nausea, confusion, heart problems, and even death. Please see Erowid's MAOI Vault]",
  "LAST SLEEP:",
  "Last sleep was 6:15am to 12:15pm.  Prior was 2:30am to 8:30am.  Less than normal, but I've been sleeping solid, so it works as well as my normal 8+ hours.",
  "LAST FOOD:",
  "6pm, 2 eggrolls, 1.5 cups shrimp and snow peas in garlic sauce, 1/2 cup rice.",
  "DRUGS:",
  "Sleep Deprivation, Crumbly yellow-star 75-100mg MDMA, plus Syrian Rue, plus Amaretto.",
  "I have another report pending regarding sleep deprivation filed under MDE/MDMA/MA.  Sleep deprivation is the #1 psychedelic.  Hallucinations, mood alterations, paranoia, etc.  Learn to tap into this if you're a night tripper but a day worker.",
  "REASONING:",
  "The Yellow Stars ended up being much weaker than we'd all planned on, but we paid as much as if they'd been 250mg tablets.  In order to attempt to extend their lifespan and increace their efficacy, I decided to test what is GENERALLY considered dangerous -- combine MDMA with a known MAOI.",
  "DANGERS:",
  "General precations here are possibility for acute hypertensive shock, or seratonin syndrome -- both of which are potentially fatal; however, most reports I've seen have been people doing full or crazy doses in addition to having MAOI.  Overall, there's a surprising lack of reports.",
  "Always test on the weak side before trying full dosage of anything, and research extensively for interactions.  Be prepared.  Be safe (contextually anyway).",
  "PROCEDURE:",
  "Based on my experience boosting with Syrian rue, but starting small for 'safety' I used",
  "   About 1 tsp coconut flavored 75% ethanol (rum/everclear run through coconut shreds)",
  "   1/12th TSP 4x harmala extract (~0.4g)",
  "   1/12th weak tablet MDMA (5-10mg NET)",
  "Amaretto sour covers the flavor of dissolved Syrian Rue fairly well.",
  "I mixed the above thoroughly, then added:",
  "  1.5 ounces Amaretto",
  "  ice",
  "  sweet and sour mix (to top off an 8 oz glass)",
  "3:36am, started drinking cocktail",
  "3:58am, finished drinking cocktail",
  "4:08am, first waves and synaesthesia with music",
  "4:44am, not enough going on.",
  "Eating another crumb, a little larger than last time.",
  "I'll call it 1/11th? (which brings it to 23/132).",
  "5:40am, I realized that much of the ho hum is caused by sitting motionless on computer.  I was on a mission.  It's the true, underlying mission of all geeks' struggles with technology.",
  "Tingles and general goodness are there.  It's about 10% stronger than if I'd eaten the whole 75-100mg tablet by itself (not intense by any means, but definitely there).",
  "Decided to take advantage of my geek induced creative google searches set on recursive slide show.  It ws quick and massively intense.  It would have been awesome with my mate had she been in town.",
  "Also, I can tell the peak has already come and gone, in more than one way.  I decided to try boosting, which usually doesn't work well for MDMA, but oh well.  It's a weekend.",
  "Created new cocktail with the rest of a third of the pill, plus 1/8th tsp 4x Syrian Rue extract.  No pre-mix with stronger ethanol, and I added ice FIRST, so some clumps of rue didn't dissolve.",
  "5:53am, done with new cocktail and a second rinse with water to get the rest of the sediment.",
  "6:18am, kinda sloshy in the stomach.",
  "Lots of sleep deprivation high.  Tracers, imagined hallucinations.",
  "(I don't have real hallucinations except on severe sleep deprivation).",
  "I'm very tired.",
  "6:28am, still kinda sloshy.  More waves washing over.  Smaller and more rapid than usual MDMA.",
  "6:36am, new peak.  Not great.  My laptop has an aura, and my visual field has density fluctuations, if that makes sense.  I'm sweating, but I check and it's 84 degrees, 62% humidity.",
  "Sirius Area 63 overly repetitive track selection becomes less of a problem.",
  "I'm battling over whether to go to sleep; see where I can take the tail end of this trip; take the rest of the crumbly yellow star; or try to boost the trip to binge/bender status with MDE/MA pill (and call in sick the next 3 days for sleep deprivation induced bronchitis).",
  "I've been neurotically rewriting this report for clarity and flow.",
  "I really want to get up and dance.",
  "This is where I omit an entire section on my mental exploration of personal defects.  Suffice it to say that serious introspection was accurate, effortless, and rapid.  MAOI + MDMA both attributed to this effect; however, I spend 20% of my waking time in self induced trance.  Your results may vary.",
  "7:03am It bosted up pretty well considering the situation.  I feel nice.  Very functional, especially for being tired.",
  "7:15a Note, food does not in any way sound appetizing.",
  "If looking for the trip, it seems very mild.  If I sink into the trip, it's very much there.  Very gentle, like a calm ocean.  There is much power there in the vast quantity of water, but it is at peace with me and I with it.",
  "Nothing spectacular anticipated for the duration of the trip.  Whether I boost again or not won't affect the overall result of this report.",
  "SUMMARY:",
  "So this is working -- something, obviously.  It's not normal, but it's not abnormal.  The AC feels good, and introspection works pretty well.",
  "Next time, to get a bigger peak, and a more pronounced effect, I will have:",
  "   1/6th to 1/3rd pill of weak X",
  "   plus 1/12th to 1/6th TSP 4x Rue Extract",
  "I think for MDMA, rue is a 4-6x multiplier, wheras for 5-MeO-MiPT it was about a 10x-12x multiplier.  I'm probably off on the MDMA part since I boosted.  It may still be 10x-12x if taken all at once.  I think 0.40g/kg MDMA would be MAX with Rue. I think anything more would be just WAY too much, and definitely toying with potentially dangerous consequences.",
  "The Rue seems to be 4h full cycle, so it's a shorter trip.  The rue boosts fine repeatedly though, so the same MDMA dose could be extended with more rue.  Rue is cheap and easy to acquire since it's used in red dyes and incense."
 ],
 "erowid": {
  "id": "43802",
  "citation": " Z.. \"Short and Comfy: experience with MDMA, Syrian Rue & Alcohol (ID 43802)\". Erowid.org. Nov 8, 2005. erowid.org/exp/43802",
  "substance": "MDMA, Syrian Rue & Alcohol",
  "views": "19706"
 }
}
