{
 "title": "A Sudden Respect for the Complexity of Things",
 "author": "Anonymous",
 "citation": " Anonymous. \"A Sudden Respect for the Complexity of Things: experience with LSD (ID 1990)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1990",
 "substance": "LSD",
 "bodyweight": "",
 "report": "<p>The first time I took acid was with friends, which is the best way to do it. We were in a bar, drinking, and the guy (whose name shall be J.) said he'd picked up the acid, and we should go do it now. I said sure, and him, his girlfriend 'L.', and I went down to the basement of the bar, which was empty. There were some tables there and we split up the goods: one hit each. I'd read up on acid and its effects beforehand, mostly through the USENET FAQ, but I remember thinking of another friend's words: that he hadn't known what to expect when he first took acid, for all he knew he was going to die. Of course, having thought this it occurred to me that I should think of this kind of thing, 'cause it might bring on a bad experience. Having thought this I wondered if knowing I should have good thoughts would be enough to get rid of bad thoughts and thus ward off a bad experience. Realizing I was floudering in a sea of ignorance, I proposed we go back upstairs and finish our drinks.</p><p>My friends agreed, and I felt better immediately. After we finished the pitcher we went walking around town a bit. It was a late autumn night, and the air was cool, but still comfortable. I was a bit tense, and paying attention to my every perception. I thought I felt something so I asked my friends and they said, no they didn't feel anything. We went to a party store to pick up some whisky and coke-bottles to mix it in, then we headed towards a park. We ran into a friend who had a very intense personality, and L. said she thought it was 'cause he'd done a lot of the drug that we were currently on. I thought about this a bit, but wasn't worried about it at all, for some reason. I felt a light buzz tingling my body, like something exciting was going to happen. We went to the park. The moon was out and everything was clear, and I realized that the night was clearer than I'd ever noticed. The tree-branches were more clearly defined than I'd ever seen. We sat on a hill and smoked some herb, and talked about stuff. We were no different than any other people who might be sitting there talking about life and the people we knew and our jobs and what we wanted to be doing a year from then, only we were buzzing and everything around us looked sharper and more alive.</p><p>After a bit, L. got up and said she'd be right back, and she took off running down the hill, and ran around in a large circle through the park, her arms open. Then she came back, and rolled down the hill, and came back. J. was watching and smiling, and I was looking up at the trees again. It occurred to me how much the trees did look like fractals, and suddenly the mathematical beauty of the trees was clearer to me. The complex mysterious equations that dictated how the trees were pushed up out of the ground towards the sky were suddenly more apparent; and I also realized how these equations dictated the growth of the grass, the rolling of the hills, even our very bodies. I had a sudden respect for the complexity of things, with an intensity that I hadn't had before, and this complexity seemed sharper in everything I turned my eyes towards. I made myself remember that moment, and wondered if I'd have any more insights, but we just kept talking and walking around, and everything was sharp and in focus, and eventually we ended up going to our separate homes and that was that. I didn't die, I didn't achieve enlightenment, but I did have a good time and eventually wrote a haiku about trees looking like fractals.</p>",
 "year": "",
 "id": "1990",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-20T07:00:00.000Z",
 "views": "6341",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
