{
 "id": 19917,
 "title": "Changed My Life",
 "date": {
  "submission": "2008-09-11T07:00:00.000Z"
 },
 "author": {
  "name": "RichSuburbanGirl",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "I never really tried any kind of amphetamine until last October when midterms came around. It was my freshman year of college and I was terrified of my midterms so my friend gave me some adderall. I took about 150mg orally, got a B+ on the test, and didn't touch the stuff again until December. I started blowing it with my boyfriend at the time, and eventually it was a bi-weekly activity. My parents sent me all this money and I would spend it all on drugs -- I could get 200 for about 30$, 100mgs for me and 100mgs for my boyfriend.",
  "I loved the stuff, the way it made everything speed up. I even enjoyed the side effects that were supposed to be bad; the jaw clenching and the dry mouth and needing to pee ALL THE TIME. Because everything was funny and euphoric when I blew it. Eventually I broke up with my boyfriend and used it to get myself out of my depressive rut. I did well in all of my classes and had so much fun with my friends -- it was the perfect drug. I had wanted to lose weight, and of course that was easy since food was totally revolting.",
  "And when I was sick it was hard to blow, but if I could manage it, I swear the stuff would clear up my sinuses! I think it might have made me weak, when I came down after blowing a couple hundred over the course of a night I could barely move. A good trick is to get some ephedra and take it when I come down. It gives me a nice little bump back up without bringing me up enough to make me come down again. Drinking orange juice also helped so much when I came down, probably because after no eating for a couple days my blood sugar would be seriously low. When I went on binges for like, 4 days at a time I would start to hallucinate, which was fun. And once I had sex while I was hallucinating and that was amazing.",
  "I wish I could say something like 'and then I realised it was wrong and I stopped forever' or something, but the truth is that I'm still looking for more and really want it all the time. It definitely changed my life, and made me go a little bit crazy, which my therapist says might be permanent. It's worth it, though, I think."
 ],
 "erowid": {
  "id": "44001",
  "citation": " RichSuburbanGirl. \"Changed My Life: experience with Amphetamines (Adderall) (ID 44001)\". Erowid.org. Sep 11, 2008. erowid.org/exp/44001",
  "substance": "Amphetamines (Adderall)",
  "views": "5266"
 }
}
