{
 "id": 19915,
 "title": "One Wild Ride",
 "date": {
  "submission": "2008-09-11T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Matty",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>The day started off just like every day.  I didnt have to go into work, so I had a couple of beers with some friends.  10pm rolls around and my friends duck out for sleep and I am left in a house all by my lonesome.  So I decide to munch on some psilocybins.  Good ones too, probably the best I have ever seen in my entire life.",
  "The trip started off just like every trip. Having laughed myself out by 2am I decide to hit the sack, thats when everything slid down hill.  The visuals I had were nothing short of spectacular and terrible all at the same time.  This is the first time I had ever experienced a trip like this before.  Something was way different.  It was more than visuals, it was feelings, emotions, sounds, it was everything.",
  "I stumbled to my room, made it to my bed.  Everything in the room was just as I had prepared it.  So I layed in my bed clutching a waterbottle for what seemed like eternity.  Visuals continued, auditory hallucinations also.  I begged for sleep, but my mind was on overdrive and sleeping was the very last thing on its list.",
  "2am-3am  Something that I cannot describe.  Near death.  Epiphany.  Something. Nothing.  Who knows.  Something hit me like a ton of bricks.",
  "3am-4am The ton of bricks feels more like a freight train now.  I make my way to the bathroom and vomit up some of the most amazing things ever.  Stuff I know I could not have ingested.  I find my waterbottle and slam down the rest of it.  I vomit again.   Being a medical student, looking in the mirror, I can tell my eyes are dilated, breathing has decreased.  Skin tone has become flushed.  By the time I think to myself wow you look like crap, BANG.  I went crashing to the floor.",
  "Unable to move, not unmotivated though, I wanted like hell to get off that floor.  I was perfectly conscious and alert.  I could tell I wasnt breathing too well, coughing up liquid every now and then, but I couldnt notice breathing patterns at all.  At this point, I embrace death.   In fact I had convinced myself that I had died, telling myself 'Man Im too young' and 'I cant believe this is happening'.  So I laid on the bathroom floor in a puddle of my own vomit for 2 straight hours.  Perfectly alert, but I couldnt move.  Finally, I gathered up enough strength to pull myself up to the toilet, expel any last vomit.  Chugged another waterbottle full of water.  I had done it.  I got off that floor.",
  "Now looking back, and writing this, I am listening to music, drinking some OJ loving every aspect of life.  Call it whatever you want to, but something happened on this ride.  Still dont know whether to classify it as a bad trip or a good trip yet, time will tell.</p>"
 ],
 "erowid": {
  "id": "43979",
  "citation": " Matty. \"One Wild Ride: experience with Mushrooms (ID 43979)\". Erowid.org. Sep 11, 2008. erowid.org/exp/43979",
  "substance": "Mushrooms",
  "views": "2156"
 }
}
