{
 "title": "Falling in Love (?)",
 "author": "Anonymous",
 "citation": " Anonymous. \"Falling in Love (?): experience with Alcohol & MDMA (Ecstasy) (ID 19934)\". Erowid.org. Oct 3, 2005. erowid.org/exp/19934",
 "substance": "Alcohol & MDMA (Ecstasy)",
 "bodyweight": "130 lb",
 "report": "<p>December 2001, it was the first day of winter break, friday night. Two friends and I had planned to drink a fifth of jack in my apartment. That was the plan anyway. One of them, 'S', showed up. we had just begun drinking when two male friends called wanting to stop in and say hi. I reluctantly agreed. They show up, and talk us into taking some E with them. We decided to start with just half a pill each. She had rolled several times before and I told them I had done it before as well. (The purpose in that was to avoid the irritation of people saying things like 'so how is it?', are you okay?' etc.)</p><p>We went into the bathroom and swallowed our pill with water. (I was relatively intoxicated at this point, and S was 'tipsy'.) Naturally, it took awhile, about 45min. for the E to kick in. During this time, I continued to drink my jack and coke, you know, to kill time. I remember S running her extremely long nails on my face, and arms, trying to get my 'roll' started. At first, it just felt like nails being ran lightly across my skin. And all of a sudden the sensation was intensified be a thousand times. I had this warm tingling all throughout my body, kind of like a chill, only warm, and very welcoming.</p><p>S and I decided to eat the rest of our first pill. Now we could feel it much more. Everything was so pleasant to look at, I was easygoing, much less uptight than I usually am. Unfortunately, I can't remember exactly what happened next, but eventually there were about 25 people in my apartment, some I had just met but only a few. About 10 of us here rolling, and others were drunk, or getting high on coke in my room. Being the host of this unplanned party I was offered many lines, but declined, not wanting to mix this with E. </p><p>People came and went periodically. A friend of mine returned with this guy, N, who I was very intrigued with the moment he walked in the door. He was rolling as well, but much more than I was. I am an outgoing person to begin with, and I was high on E, so I immediately went up to him to introduce myself. He offered me another pill, and I accepted. Back into the bathroom I went. I watched him crush and snort a pressy, then I swallowed the pill he had given me. We went into my room with C, who had brought him, and all sat on my bed to talk. We discussed past relationships, school, family, and everything else you can think of. I was having a blast! I was deep in discussion with two attractive guys, who I was very enticed by. One of them then suggested massages, which I had not yet experienced this evening. I sat on my bed between them, as they each took one of my hands. They gave me incredible hand massages. Now I was really rolling, I would close my eyes and let my head hang down. That was intense, just feeling the blood gently rush to my head. I was overwhelmed by excitement, this was breathtaking. I was sitting next to two extremely attractive men who were giving me mind orgasms just by touching my hands. I wanted to stop them because it felt almost too good.</p><p>My apartment had settled down by now. There were about 8 of us, all very high on E. I was sitting on my living room floor with N. We were talking, talking about our entire lives, good and bad. I was amazed by how open we both were. I talked about my father and his addiction, and N told me that his father was dead. This was incredible, you don't say things like this to people you have just met. But it felt so right. He understood everything I felt. And in return, I understood him completely as well. We talked for at least an hour, just us, connecting through each other. He ran his hand across my face, and gently touched my lips. We kissed. That was fucking mind blowing! Our mouths felt as though they melted together, a warm, sensual feeling. I felt like all I needed was him. Nothing else mattered at this point, because he was there.</p><p>After a total of about 6 hours we were all coming down. Several people left, and the rest of us layed around on my couches. I cuddled with N until he had to leave at 8am that morning. When he left he said he would call me sunday, when he returned from his road trip. And he did. We ended up dating for about 5 months. During this time we did E together probably 15 more times. I thought I was in love with this young man that I didn't even know. Things eventually became so fucked that I left him. We were in love, but only while we were high. Our entire relationship was based on ecstacy. That was by no means healthy.</p><p>Hopefully this will help someone avoid the mistake I have made. It's a really  good idea to have personal reflection time on your experience. If I had met him while I was sober things would have been much different, and I would not have thought I was in love after only one night.</p>",
 "year": "2001",
 "id": "19934",
 "gender": "Female",
 "timestamp": "2005-10-03T07:00:00.000Z",
 "views": "16031",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:45",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
