{
 "id": 1994,
 "title": "From Seed to Freebase",
 "date": {
  "submission": "2004-03-08T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Skin39",
  "gender": "Male",
  "weight": "115 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "smoked",
   "substance": "Syrian Rue",
   "form": "(freebase)"
  }
 ],
 "report": [
  "I've read a few instances where extract of Syrian Rue (Peganum Harmala) was smoked in combination with marijuana and used to potentiate various tryptamines, but nothing about just harm(al)ine by itself in the freebase form.  I saw that one supplier of research chemicals had Peganum Harmala freebase for sale, so I set out to make some in my own laboratory (kitchen).",
  "I started with 5 grams of Syrian Rue seeds, so that I could finish with a one-dose portion of freebase.  These were thoroughly ground in a $6 coffee grinder to a fine dust.  This was put in a heavy gauge sucepan and covered with a solution of 1 part 6% acetic acid white vinegar to 5 parts distilled water.  The pan was placed on medium heat and brought to a simmer for 15 seconds, then covered and left off to the side for 5 minutes.  The solution became a murky looking mess and I thought I had ruined it.  When it was strained through a coffee filter, though, the liquid was the characteristic yellow color I had read about.  This process was repeated with the strained seed powder twice more and the resultant 'boullion' was combined.",
  "While it was still warm ( approx. 2/3 cup together ) I added 1 1/2 ounce of fine table salt in degrees while stirring to dissolve.  The solution was now viscous and deeply colored, looking like it could take no more salt.  It was placed in the fridge for 12 hours, after which a fine dusting of reddish brown precipitate could be seen lining the bottom and edges of the container.  It had worked and I was half way home.",
  "I carefully decanted as much of the liquid as I could after first scraping the dusting off the edges of the beaker.  The rest was emptied into a coffee filter inside a small strainer.  I took a little of the strained liquid and washed out the beaker with it to get all the remaining extract.  I then gently collected the edges of the filter together on top and carefully twisted the liquid out.  After gingerly scraping the flattened filter with the back of a thin knife, I was left with about 300mg of what looked like red clay.",
  "I covered the harmala extract with just enough water to dissolve it and line the bottom of a spoon.  To this I stirred in about 150mg of ordinary baking soda and warmed gently over a stove element until it was dry.  This took a few minutes since too much heat at once caused it to splatter all over the place ( ust like crack!).",
  "What was left was broken up into a little more than 300mg of very fine reddish brown powder.  This was smoked in the classic 'gerbil feeder' base pipe (push the feeding tube from a $4 gerbil watering test tube, available in the pet section of any Wal Mart, down into the stopper.  Put the freebase in the bottom, warm to combustion, open the stopper slightly and draw from the feeding tube ).  The results were instant and undoubtedly NOT a placebo effect. ",
  "The experiment worked beautifully and the results were not only easier to ingest than tasting the seeds, the nausea was only hinted at.  The effects lasted for a pleasant hour, then trailed off for another.  Next time I'll try a much bigger batch, though.",
  "(Please don't forget to observe the usual rules of MAO inhibition when partaking of this substance, as the consequences of one case could draw enough attention to end its availability.)"
 ],
 "erowid": {
  "id": "16611",
  "citation": " Skin39. \"From Seed to Freebase: experience with Syrian Rue (extract) (ID 16611)\". Erowid.org. Mar 8, 2004. erowid.org/exp/16611",
  "substance": "Syrian Rue (extract)",
  "views": "11632"
 }
}
