{
 "id": 19946,
 "title": "Don't Know Why I Did -- Glad I Did",
 "date": {
  "submission": "2007-09-29T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Grubthrower",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "225 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0",
   "amount": "325 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "I had never even heard of S. divinorum until July of 06. One of my news services one day included a link to a media story about it. For some reason, I was immediately so intrigued that I spent two days researching and then found an internet supplier.",
  "In order for one to understand just how unlikely that was in the first place, consider: I am 43 years old and a veteran of almost all substances that were available up until about 1983 -- and I have always had a deep antipathy towards most hallucinogens. 10 acid trips and half a dozen shroomfests made it apparent that tripping just wasn't worthwhile for me, and the last acid trip resulted in panic attacks for a few months. I detest a third cup of coffee but love a fifth codeine pill. I smoked weed daily from junior high through college. Yet I simply walked away from everything except alcohol and tobacco many years ago. No biggie, just had a life to run.",
  "So why I decided I had to try salvia I'll never know. But we're talking several things that *seemed* ideal:",
  "1. Initial onset (waiting around for effects has always led to paranoia for me -- my mind races too much, creepy weed scares me at first)",
  "2. Short objective duration (12 hours canoeing exhausts me at age 43, but it was simply a day's paddle back when 12 hours of tripping totally wrung me out -- I don't think I could physically handle long trips nowadays)",
  "3. An entirely new brain interaction, chemically different from anything I had had before (can't just add salvia to existing bans -- gotta pass a new bill to outlaw it)",
  "4. Legality (important, as I have a mortage and somehow ended up a productive citizen).",
  "Of the above, short duration and initial onset were most important. I never liked the 'flavor' of any hallucinogen I tried.",
  "Man, is salvia different! First off, there is absolutely NO WAY my experiences can be attributed to placebo effects. If this account is of value to anyone thinking of trying salvia, it can be boiled down to one sentence: Salvia divinorum is unlike any substance on the planet, and its effects are intense. So intense, that I rejected advice I had read to try and 'go for' a full-blown experience the first time. That's not for me. I wanted to 'test the waters' first and was fully prepared to abandon the project at any stage.",
  "I purchased a sampler pack from a very well-known Internet provider: an ounce of dried leaf, a gram of 5X standardized, and a gram of 10X non-standardized. I ain't touching the X-factor for a long while, the leaf is plenty strong enough for me. Since I happen to reload ammunition for hunting rifles, I own an accurate scale. It measures in grains not grams, but conversion tables are everywhere. I had heard that 1/4 gram of this leaf was sufficient for intermediate effects, so I started with 3.5 grains, and didn't clear all of that from the homemade bong.",
  "Onset was immediate after exhale. There is a 'creaminess' to the rush that made my thoughts of will I have anxiety/paranoia just plumb ridiculous. I smoked in a darkened (not totally dark, that's not comfortable to me) and SILENT room, alone, lying down. Closed-eye visuals were near-instantaneous. I opened my eyes and they went away, as did most of the creaminess and the otherworld-like buzz.",
  "Now, generally speaking, with hallucinogens, finding I can open my eyes and lessen or abate the experience means I spend more time grounding myself than I do tripping. But this was different. 'Shut your eyes and get back there now!' I thought to myself. The CEVs followed a definite motion inside my head, rollercoaster loop-de-loops in crisscross patterns. They were NOT roller-coaster-like thrill rides, they were gentle though fast swoops and swirls sort of like speeded-up Northern lights that were extremely pleasant. There was an auditory element. Unlike any other auditory I have ever had. A voice, *just* beyond the realm of pure understanding, but it definitely had an 'invitation' quality to it. The voice was androgynous, but it wanted me to feel welcome.",
  "Then wham, back to reality. At this low of a dosage, peak was in probably 3 minutes. I never lost sight of having smoked salvia. I was in fact rational throughout. I would have been pissed had the phone rang, but I would have understood that it had. I had originally planned to do this dosage once only, having waited till set and setting were great, then increase by stages maybe a week later. Sorry. I had to go *back* and right-damned now, this was entirely too cool. I finished the first bowl, had a less-intense few minutes, then packed another at 5.0 grains. The 5.0 was measured after the end of the two previous, when I was quite normal.",
  "I hit the 5.0 hard but still didn't finish it, though I think I managed better than the 'full' 3.5, and laid back. I remember, as I exhaled, thinking 'where are we going now' as so far, I really had felt that salvia space, for lack of a better word, has its own agenda, but said agenda is undoubtedly benign. I waited a very short time to be taken somewhere new. No other hallucinogen has ever felt 'benign' to me, not even marijuana does.",
  "Anyway, on the third trip the CEVs were more vertical in nature. Off to my left, they were dark, almost foreboding, but of no more concern than a depiction of the bad guys on an afternoon cartoon aimed at six-year olds (that's the foreboding quality, the visuals themselves were of a wall-like thing that was a long rectangle stood on end). Off to my right, and I did turn my head to focus my closed eyes there, the vertical visuals were trellis-like, but didn't look like a trellis, and were busily engaged in pulsing with calm horizontal waves. The, well, essence of the place seemed vaguely disappointed, as in, have a good time son, but the night's about over, and we're not gonna accomplish anything important this time. Seemed like a logical conclusion, so I watched the visuals, then got up a few minutes later to put everything away. I opened a beer and read a book for a half-hour or so before falling asleep, which is normal for me.",
  "What I can't seem to get across is that there is simply no substance to compare this to. It's as different in flavor from mushrooms as Diet Coke is from Mtn. Dew, though both are sodas. Those descriptions of the visuals above? Forget 'em, they are NOT what I experienced. The best I can describe it is that I dropped into salvia space (again, that is just a TERM) and when I got there, I found visuals to be as commonplace as traffic signs are in reality. You don't define Virginia by its traffic signs, you don't define salvia space by its visuals. That certain 'creaminess' was always present, and more than once in these three short trips I arched my back just in appreciation thereof.",
  "I am going to explore this substance. I will weigh all doses. Funny: without even touching the grams of 5X and 10X included, the dried ounce of leaves from my sampler pack gives me more than 80 5.0 grain bowls, making salvia a fantastic value from a pure pocketbook standpoint (mortgage, remember). Less money than a can of beer for a full-blown trip. Some would say the short duration makes it less of a deal, I say it should be a selling point to folks who would like a mystical experience every now and then but don't have the better part of a day to devote to it. Put the kids to bed, turn out the lights, in less time than it takes to watch a sitcom, I can go away and come back. And go away I did.",
  "I'm not into any 'divine' or 'Goddess' stuff when it comes to psychoactive plants, and I attribute to them no personalities. I do, however, read TONS of science fiction, am a born-again Christian who cannot tolerate any organized religion, believe that if there ain't a creator, we've won the lottery every single day for tens of thousands of years and I'm not betting on that, consider the universe to *probably* be one huge life-producing machine, hunt and fish, vote conservative Republican, drink beer daily, read 200 pages daily, telecommute, and have always been fascinated with the nature of human consciousness and the alteration thereof.",
  "This is a potent drug, and I have done many potent drugs, but this one is the only one I have ever felt might be a bridge to another reality."
 ],
 "erowid": {
  "id": "55226",
  "citation": " Grubthrower. \"Don't Know Why I Did -- Glad I Did: experience with Salvia divinorum (leaves) (ID 55226)\". Erowid.org. Sep 29, 2007. erowid.org/exp/55226",
  "substance": "Salvia divinorum (leaves)",
  "views": "2801"
 }
}
