{
 "title": "Thujone Experiment",
 "author": "Catfish Rivers",
 "citation": " Catfish Rivers. \"Thujone Experiment: experience with Wormwood (ID 19944)\". Erowid.org. Dec 26, 2002. erowid.org/exp/19944",
 "substance": "Wormwood",
 "bodyweight": "255 lb",
 "report": "<p>Making the extract was very easy. I simply took 100 gr of dried, finely chopped wormwood and let it soak in ethanol (180 proof everclear) for 3 days, shaking it now and again for a few minutes. After 3 days, I filtered out the plant material through coffee filters, and collected the liquid in a saucepan. I then used a double boiler to evaporate the ethenol and was left with a dark green gloppy pile, which I let dry overnight.</p><p>Thus far I have only smoked it. It burns much like opium tar, or resin. Smoking it alone yields a cannabis like high, and when I say cannabis like, I actually mean it is very similar. Smoking it with cannabis yielded a high at least 3x as potent as smoking the cannabis alone for me. Thujone is said to have much similarty to THC and acts upon the same receptor sites in the brain I believe, so that all makes sense. </p><p>The overall character of the high was indeed different than of smoking cannabis alone. The thujone extract alone felt somewhat less lethargic than a cannabis high, and also more lucid minded. The same lifting of emotional weights was noticed as with cannabis, and even better was the lack of anxiety that cannabis seems to produce as an underlying effect in me. I also noticed an increased sense of pleasure attatched to listening to music as sounds seemed to leap out of the background and connect with me better. It could be that I was looking for this type of effect however, as I tend to look for increased appreciation of music in general of all my drug experiences.</p><p>I did not notice any toxic or negative side effects from the few times I have tried smoking the wormwood extract. Thujone is thought to be toxic on some level, often cited as the chemical compenent of absinthe that induced madness in its users. I felt nothing that would overwhelm my senses as far as hallucinations and such. At its most intense, the extract felt just like smoking good clear minded cannabis. The taste of smoking the extract was less than pleasant however, even when smoked through an ice bong. This is easily remedied with a glass of juice, swished around as a chaser of sorts.</p><p>As a final note, I'd like to mention that I smoked the extract while peaking on DXM recently and the two synergized quite interestingly. Much like how cannabis and dxm go together, but different somehow. I will need to experiment further on that combo in order to better describe it though. Until then...</p>",
 "year": "2002",
 "id": "19944",
 "gender": "Male",
 "timestamp": "2002-12-26T08:00:00.000Z",
 "views": "69230",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Wormwood",
   "form": "(extract)"
  }
 ]
}
