{
 "id": 19943,
 "title": "Mild Effects, Completely Aware",
 "date": {
  "submission": "2009-02-19T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Kid a",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "I had the lights off in half the room. I made up a bed of pillows to comfort myself on. I had a digital clock running on the computer so I could make sure I consumed the smoke in the right amount of time. I had given directions to my friends as far as what to do if something went wrong, to keep quiet, etc. I had cooled a glass bubbler in the freezer and was sitting down ready to pack it. I also had prepared 4 regular leafs that fell off my plant naturally and were oven-dried and crushed.",
  "The first bowl went down very smoothly, and it was really not a harsh hit at all. Just drew the flame down as long and slowly as I could and exhaled after about 15-20 seconds. I had planned to wait longer but I also wanted to close my eyes after each hit to see if any effects were taking place closed-eye, but I couldn't see the clock then to check the lengths of my hits.",
  "After the second hit I felt something more. My body began to be drawn to the ground and my heart rate increased greatly. I felt like I was being suctioned to and from the padding beneath me with every heartbeat inside me. With my eyes closed I saw nothing, but the pulsating feeling continued. I layed there for at least 20 seconds before I decided 'I can do this. I can sit up and go for another hit.' I didn't feel sick or anything, but my body was overwhelmed with some gravitational force, and I almost felt tired, yet wide awake mentally.",
  "I sat up again, opened my eyes, and emptied the bowl, but this time I wasn't thinking as straight and I dumped the water through the bowl, soaking the paper towel next to me as well as my fourth leaves. Nevertheless, I had one more dried leaf to pack and smoke. So I did so. I think I took two small hits off this one and I was having a hard time concentrating on holding them in for more than 10-15 seconds. At this point I had to put the bubbler aside and lay back down.",
  "It must have been about 3 minutes since I started at this point. So with my eyes closed and my pulsing body continuing, I started to see some images. They were very dream-like, but not like the dreams where I think they're real. I could see things but my mind was very clear. I could hear small things going on around me, and I knew I was in reality.  If I opened my eyes, the visions would go away.",
  "The images I could see with my eyes shut were not very vivid. They were blurry, and I truly understood that they were not real. At first I saw a community of large, purple dinosaur-like creatures flying through the sky. One of them went to another one running a store and told a joke. I don't know if I heard any joke, but I saw it being told, and them smiling. This was enough for me to laugh. I hear myself laugh.",
  "I'm then temporary back in the real world, with my body still being  pushed to the ground by some force, but I see nothing. Soon after I see a boy with two long tubes which he pulls colorful snakes out of. They turn into some sort of otter or seal and I see it swimming through a sparkling ocean. My friend puts a soda can down onto the cement. I hear the sound.",
  "I'm back in reality again. Feeling slightly less force on my body and seeing nothing with my eyes closed, I open my eyes and begin to talk with my friends. It has been about 10 minutes, and I only now feel very relaxed and barely stuck to the ground.",
  "After a few minutes of gradually gathering my thoughts and getting up and talking I am back to normal, just feeling very relaxed and with a clear mind. I could only concentrate on one thing at a time for the next hour, but I would say I was back to normal.",
  "The pulsing feeling I got I later discovered was common in many experiences, and the blurry, almost unclear, non-descript things along with that gravitational pull on me were enough to convince me of the potential of the plant. Next time I plan to use a butane torch lighter, lay on a couch with the lights just dimmed, and concentrate more on the length of the hits. I'll keep the technique of just packing and inhaling until I no longer have the coordination to do so, as I think if I continue to do about the same amount with the same method the effects will increase dramatically, as I get more familiar with the plant."
 ],
 "erowid": {
  "id": "55181",
  "citation": " Kid a. \"Mild Effects, Completely Aware: experience with Salvia Divinorum (leaves) (ID 55181)\". Erowid.org. Feb 19, 2009. erowid.org/exp/55181",
  "substance": "Salvia Divinorum (leaves)",
  "views": "3300"
 }
}
