{
 "id": 19955,
 "title": "The Dream Melted Away",
 "date": {
  "submission": "2007-10-07T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Day Tripper",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "250"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "This is a report of the first time I tried salvia.  My friend, CH, and I had ordered some 5x extract off the internet and we were looking for an opportunity to smoke it.  We had researched it and known it would be powerful.  We gained about half an hour of free time and we went back to a small fort that I had played in when I was a kid.  We took all of the Salvia we had ordered and packed up a full bong of it.  We decided that I would go first and that he would be my sitter.  I sat back and prepared myself for the trip.  The treehouse was dark and cool, and I was feeling calm and a little bit nervous and excited.  When I felt I was ready I lit up the Salvia and took one large hit.",
  "I am no stranger to mind-altering substances, shrooms and acid have both crossed my path, but this was something totally different.  I was expecting to smoke at least a bong or two before I became affected, but it felt like only a few seconds after I exhaled that I realized something was up.  I saw a figure, I think it was the head of a woman, in the upper-left corner of my field of vision and somehow got the idea that there were 2 planes of reality, and while I was looking at one plane there was another going on around me.  Then, my mind swiveled in my head and turned to face the other plane of reality I had been presented with.",
  "I suddenly felt like I was losing control of my thoughts, my body felt petrified and my voice sounded deep and strange, CH would later verify this claim.  I tried to speak and remain sane but I felt like everything was going crazy.  Then the walls of the tiny treehouse disappeared and I felt like I was in a dream, except the dream was running out of control.  Pastel colored boxes were spinning all around me, I felt like I was lost in my head and that I would never find my way out.  The experience was so mind-blowingly intense that I wouldn't even classify it as a trip, I just felt lost and crazy and scared.",
  "Slowly the boxes formed a seat underneath me and I was resting on them.  The dream melted away and I was sitting in my chair and staring at CH.  Immediately after I returned to Earth I became terrified that I had gone insane.  I sat quietly and centered myself.  I knew that this was all in my head and that it would go away in a few minutes.  After 5 minutes of this the anxiety eventually left and all I felt was a sense of calm and a slight uneasiness about what just happened.  CH told me that I had been laughing and flapping my arms wildly for about 5 minutes after I had exhaled, but it had seemed like only a few seconds.",
  "CH smoked his share of the Salvia and he didn't seem to be having as intense an experience as me, but the things he talked about and described to me later were very trippy.  After 30 minutes, I didn't feel any serious effects, but there was definitely a weird calm about me."
 ],
 "erowid": {
  "id": "55261",
  "citation": " Day Tripper. \"The Dream Melted Away: experience with Salvia divinorum (5x extract) (ID 55261)\". Erowid.org. Oct 7, 2007. erowid.org/exp/55261",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2368"
 }
}
