{
 "id": 19950,
 "title": "Emotionally Beautiful",
 "date": {
  "submission": "2007-10-07T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Zany the Loner",
  "gender": "Male",
  "weight": "82 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.25 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 0:50",
   "amount": "0.75 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "<p>Some experienced substance users may find this idiotic, but I have taken LSD alone on two occasions.  I have heard from numerous sources to always have a sitter while tripping.  Believe me, I would have loved to have someone keep an eye on me, but in my world that's not possible.  All my good friends are staunch Christians and sneer at me if I even mention Cannabis, never mind LSD. I had bought 3 hits a few months ago. Due to LSD's long duration I had difficulty finding a time to trip, as I was scared shitless of a night trip turning bad. Anyway, I dropped a blotter at around 2100 one night and had a rather disappointing 20 hour trip with none of the visuals I expected, although I enjoyed my music much like a Cannabis high. My other trip was rather different.",
  "I had planned it for months.  My parents were going away for the weekend with my sister. I was rather relaxed and in a positive mood. My final year exams lay ahead but it did not bother me.  I had recently read Graham Hancocks 'Supernatural'(a brilliant read indeed!!!) and Dr. Rick Strassmans 'DMT- The spirit molecule' that opened up my",
  "interest in psychedelics and entheogens. So I thought that taking psychedelics for the correct reasons(spirituality, enlightenment and consciousness exploration)could only yield positive results. I did not know how to prepare for the trip, but I knew preparation was crucial in the experience.  So I listened to some Terence McKenna lectures, starting a week before the trip, to create the needed mindset.",
  "I dropped 1.25 blotter at around 0800 am.  By 0850 I was in the garden but feeling nothing, and thought I could just as well take the rest, so I dropped the remaining 3/4 hit.  By 0900, back in the garden, I noticed birds were moving comically faster, as if in a 1920's movie, and soon began seeing tracers.  By 0930 I was sitting by our fishpond delving into my own thoughts.  Suddenly I heard a disturbing and unnerving",
  "wail!  I would describe it as a wail of a dying Banshee.  It was long, shrill and painful and sounded, I would imagine, like a witch being burned at the stake.  This startled but also fascinated me, and I was not at all scared but rather perplexed.  I always have auditory hallucinations on Cannabis, which I use alone to boost my creativity and philosophical thinking, so maybe I was just used to trippy noises.",
  "A number of minor events occurred, such as me hallucinating doors opening and closing, and patterns in the ceiling.  One major realisation was that my tubby ginger cat was with me throughout the trip, which was startling as he never even sits by me usually.  His ears were pointing towards all my auditory hallucinatios and it was as if he was protecting me in some way, and guiding me throughout the trip.  He could hear everything I heard and could even sense my emotions, as he always started comforting me as I started feeling the trip was too much.",
  "I went to my room and popped in some Infected Mushroom (Classical Mushroom), which is an amazing CD on Weed, but was dissapointing on Acid.  I also listened to some Spectrum (it's Hardstyle Techno from my country, South Africa) which was interesting indeed.  I danced like a bell-end alone in the dark to freaky robot sounds, while laughing my ass off about life and all its little shits.  I moved to the television to watch anything that would take my mind off my excruciating headache I developed.  I watched",
  "everything from whacky cartoons to Fashion TV, which was amazingly freaky to realise the true beauty of a woman.  The Simpsons proved to be sickly funny and so reflective of modern day society, so it provoked thought and amused!",
  "The moment that made the trip worthwhile was the movie 'Closer' with Jude Law and Natalie Portman.  I remember feeling sad and touched by the opening scene and the sad Damien Rice tune that lingered in the background.  I soon fell unconscious and awoke the next morning feeling relatively normal.  As I descended the stairs to make myself some coffee, I started crying.  I don't know why, but just thinking about that",
  "'Closer' opening scene made me cry like Keith Richards without his dealer.  I started thinking about my (currently vacant) love life, nature and the way that we humans are (using Terence's words) raping the planet. Although I was sad, my new emotional sensitivity was a welcome change to my normal masculine thought pattern.",
  "Overall this trip was interesting enough, but that one moment, the emotional impact, is what made all the difference.  It is not something I would try again soon because of the duration, but certainly in the future.</p>"
 ],
 "erowid": {
  "id": "55244",
  "citation": " Zany the Loner. \"Emotionally Beautiful: experience with LSD (ID 55244)\". Erowid.org. Oct 7, 2007. erowid.org/exp/55244",
  "substance": "LSD",
  "views": "2773"
 }
}
