{
 "id": 19965,
 "title": "The Dark Times",
 "date": {
  "submission": "2008-09-05T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Garfield is dead!",
  "gender": "Male",
  "weight": 122
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.75",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "A friend of mine, Rob, called and wanted to know if I had any interest in doing mushrooms that evening.  This was a complete surprise, and I jumped at the opportunity.  The last time I did mushrooms was about eight months prior to this experience, and I was excited and awash with anticipation.  I was told that I should swing by Robs place around 8:00.  Once I got there, I found Rob with a number of our mutual friends.  I was dismayed to learn that the dealer couldnt be contacted, and that we would just have to wait and see if the mushrooms materialized.  We all smoked quite a bit of weed in the interim, and were somewhat peeved and anxious about this delay.  Then, around 11:00, we got a hold of the dealer and purchased the mushrooms.  I split a cut with Rob, and then we sat and waited for the trip to begin. ",
  "The trip began like any other, with the slow onset of effects, building to the point where I suddenly realize that I am tripping.  Once I peaked, it was cool, although I was a bit disappointed in the intensity of the trip.  Though the basic effects were all there  the walls were breathing, colors were vibrant and intense, geometric patterns appeared where previously there was nothing, and objects began to move and gyrate on their own accord  but these effects were not nearly as intense, or at least did not seem to be as intense, as my last mushroom experience.  Its probably worth nothing that the day of the said previous experience, I had fasted and consumed only fruit juice prior to ingesting the mushrooms.",
  "At any rate, most of the assembled party wanted to visit the park (a city park, with woods and a lake, not a playground) and take in nature, or at least a manmade approximation of nature.  I wanted to join them, but Rob expressed doubts, saying that he felt kind of weak, and didnt really want to venture out.  I decided to stay with him, feeling it would be unfair to leave him alone while tripping.  Everyone had left, and I suggested to Rob that we smoke a bowl.  So we did just that.  On what would end up being my last hit, I took a super huge toke.  And when I say super, I mean SUPER.  This was the kind of hit that would make me feel dizzy and lightheaded afterwards, and provoke maximum coughing.  So as I said, I took the hit. . . .",
  "And then suddenly I awoke from what could have been eternal sleep.  What happened in the interim, I dont know, but I was aware that I had been separated from reality, and was unconscious, for some unspecified amount of time.  I looked around the room.  Everything was a swirling mass of dark green.  I looked to the left, and then to the right.  It was all the same, this swirling mass was everywhere I could see.  Then, from all sides, over the swirling mass, my field of vision was flooded by vibrant geometric figures.  Mostly diamond shaped, brilliant yellow and orange, they flowed in a wave, and then evaporated into a trickle.  Some stayed and danced in front of me, while others shot across and exited my field of vision.",
  "While this was happening, the swirling mass was swirling slower and slower.  In the mass I could notice little bits of my surroundings splash for a second  a bit of Rob here, a little bit of couch there, et cetera.  Suddenly the mass came to a complete halt, and I could see the room, although everything was some shade of neon green.  Over top of this, the diamonds that remained merged and reformed into a white grid pattern over my view of the room.  Rob was talking to me, but I couldnt hear anything.  There was dead silence.  Up to this point, I had been enjoying my little break from reality, but at this very moment, I thought to myself Jesus, what have I done, I hope the rest of the night wont be like this!",
  "And then like that, it was back to normal, or at least back to the trip as it was.  Rob later confirmed that this experience of mine lasted about 30 seconds.  During this, he was explaining some fine point about the music we were listening to, and upon seeing my face, he had assumed that I was taken aback by something he said.  Wanting some different scenery, I suggested we go outside for a cigarette.  Once outside, we enjoyed our butts, but I couldnt shake the negative vibes.  Suddenly, everything I saw, the breathing of surfaces, the geometric shapes, all had a sinister connotation to them.  The Dark Times had come.  I also knew that this was all in my head, that nothing was going to happen, and that I just had to tough it out.  But nonetheless, I had this deep sense that shit was about to get much, much worse.  Also, the house we were tripping in, had white walls and was poorly illuminated by green and red Christmas lights.  While I had enjoyed the effect before, now something about it utterly disturbed me, though exactly what, I cannot put my finger on.  As such, I insisted we take a walk.",
  "We walked to places that, while tripping previously, were magical.  Now they were just cold, and lifeless.  The geometric figures had turned into horrible faces.  Everything and everyone was out to get me.  I tried to deal with this paradox, that on one hand, this was all just the work of my mind, and that this all extended from my marijuana-induced separation from reality, and on the other hand the knowledge that I was just one moment away from slipping into the inescapable void, where I would be assailed by some unknown dark force.  This hadnt crossed the line into sheer psychic terror, but was certainly palpable mental anguish.  Rob wasnt having a good time either, and our mutual uneasiness seemed to feed the overwhelming dark vibes.",
  "At a loss for what to do, Rob suggested we put on a movie.  We finally decided on a lighthearted comedy.  This was perfect medicine.  Though initially I had a hard time laughing due to the dark thoughts in my mind, soon enough I was guffawing and the bad vibes seemed to melt away.  Thus, I got to enjoy the last half-hour or so of my trip before I started to come down.  As it would happen, our friends returned from the park, and we got to enjoy a nice bowl, and share with each other our respective experiences. ",
  "This trip was, overall, a learning experience.  Id hardly call it a bad trip, as it could have been far, far worse, but it made we think twice about mushrooms.  Id always known that tripping can be bad, but it took an uncomfortable experience such as this to drive that point home.  Furthermore, it really showed just how much set and setting does matter.  Firstly, as the purchase of the mushrooms was a surprise, I wasnt fully prepared for my experience.  Secondly, the unexpected wait for the mushrooms caused anxiety, which I feel, influenced the atmosphere of the evening.  Thirdly, and most importantly, it was a total mistake for the two of us to sit alone in the big, scary house.  Im also damn glad that it wasnt more intense than it was.  My previous disappointment in the intensity of the trip became moot.  Im glad I hadnt taken any more than I did.  If I was tripping face before the negative vibes came, Im certain that remainder of the trip would have been exponentially more terrible and horrifying. ",
  "This trip turned me off from psychedelics for a little while, and though I havent tripped since then, I feel Im ready to give it another go now.  However, if and when this happens, I will be certain to be more careful about just how I go about doing so."
 ],
 "erowid": {
  "id": "55312",
  "citation": " Garfield is dead!. \"The Dark Times: experience with Mushrooms & Cannabis (ID 55312)\". Erowid.org. Sep 5, 2008. erowid.org/exp/55312",
  "substance": "Mushrooms & Cannabis",
  "views": "2685"
 }
}
