{
 "id": 19979,
 "title": "I Feel Like Rubber",
 "date": {
  "submission": "2002-01-16T08:00:00.000Z",
  "experience": "1997"
 },
 "author": {
  "name": "Glue",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "After football practice in junior high, my friends and I (all active stoners) would go to a grocery store to steal bottles of rubber cement.  It was a free high, that would always send us into a very intense psychedelic trip.  In fact, if taken correctly the effects can be stronger than acid, a lot stronger.",
  "We would pour half to all of a bottle into a plastic bag, then make a small opening at the top to breathe out of (power hits).  Within the first four breaths everything would begin to echo.  After that a warm sensation would flow through my body, beginning in my upper body then progressing to my feet.  The first time that happened to me I thought I shit my pants (we dubbed it the 'warm ass feeling').  The longer we would breathe the stronger the effects would get.  Things would become paternized, background noises would become a fluctuating, monotonous hum, and my body would feel like rubber.  Strange rectangular patterns would enter my mind.  Things always looked square.  Everything was fucking funny.",
  "If we kept huffing, we would eventually pass out.  This would send us into a strange world.  Witnesses said that our bodies would still be standing and moving, but we would be nowhere near earth mentally.  I remember many trips in the cold, fall evenings when I truly believed I was standing on a dock at my lake being chased by bullies.",
  "If I huff it right, it is a totally crazy and psychedelic experience.  But I am careful, as it is also very dangerous.  And I always use the Ross brand rubber cement.  It doesn't make me feel all shitty and sick."
 ],
 "erowid": {
  "id": "5538",
  "citation": " Glue. \"I Feel Like Rubber: experience with Inhalants: Rubber Cement (ID 5538)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5538",
  "substance": "Inhalants: Rubber Cement",
  "views": "25779"
 }
}
