{
 "title": "Severe Dizziness, Nausea, Balance Issues",
 "author": "stu",
 "citation": " stu. \"Severe Dizziness, Nausea, Balance Issues: experience with MDMA (ID 19986)\". Erowid.org. Feb 6, 2003. erowid.org/exp/19986",
 "substance": "MDMA",
 "bodyweight": "90 kg",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "MDMA",
  "(pill / tablet)",
  "",
  " repeated",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>My largest dose. 40 pills between 5 of us (I took 10). We all took 5 days to recover. Day 6 for me I am still ill, I seem to be extremely dizzy in bursts and have waves of nausea. No vomiting but extended periods in bed for 4 days. Nausea seems associated with food consumption, similar to motion sickness.  My vision when moving my eye balls is blury and painful with slight halucinations still on day 6, although during the first 24hrs were severe. I feel I may have damaged my liver and the toxins in my body are not being purged. Alcohol consumption was also high, 12-15 stubbies /24hrs. also large doses of THC for 2 days. On day 3-4 when i smoked THC at bedtime, the mdma seemed to come on very strong again, i lay in bed with severe rushes and involantary movements.</p><p>My days of mdma are definantly over!!!!! my biggest dose before this in one session was 3 pills. I am 31 and have taken all drugs recreationally except heroin for 15yrs  maybe monthly but only small amounts. I hope my experience helps.</p><p>Stu , Sydney, Australia</p>",
 "year": "2003",
 "id": "19986",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-06T08:00:00.000Z",
 "views": "9363",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
