{
 "id": 19985,
 "title": "Zombie Drug: a Chemical Lobotomy",
 "date": {
  "submission": "2008-05-02T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Neuromanic",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "175 mg",
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "daily"
  }
 ],
 "report": [
  "I was diagnosed bipolar at 18. I went home from prep school to start treatment and my psychiatrist prescribed me Seroquel, 100 mg at night and 75 mg in the morning. Being the ignorant and complacent med-virgin I was, I began the medication. It sure helped me sleep the first night, and the next morning I took my 75 mg dose.",
  "I felt no effect, but about an hour later as I was getting my hair done I suddenly felt like a light blew out in my head. I was practically incognizant. I felt incredibly dizzy, could hardly think, move or even keep my eyes open. I felt like someone had given me a horse tranquilizer. I was hardly even able to process the fact that I was under the influence of a drug because my mind was so decapacitated. The worst part of this sedation is that the medication messes with my vestibular organs (which control my sense of balance) and I feel like I am constantly falling off the side of a cliff.",
  "But this was my first time using prescription meds, so like a good little girl, I trusted the psych who was feeding me anti-psychotics. I took Seroquel for four months in the dose she recommended. At first it rendered me completely devoid of personality, energy and interest in people/anything. I was a zombie. Luckily I began to develop a tolerance about a month in and it didnt have quite as stifling negative affects, but still made me lethargic and apathetic. I also continually had terrifying nightmares and became anorexic.",
  "To this day this drug disgusts me. It is used to sedate lunatics and shut people up just like they used to when the mentally ill were socially ostracized. The best way to describe this drug is a chemical lobotomy."
 ],
 "erowid": {
  "id": "55405",
  "citation": " Neuromanic. \"Zombie Drug: a Chemical Lobotomy: experience with Quetiapine (Seroquel) (ID 55405)\". Erowid.org. May 2, 2008. erowid.org/exp/55405",
  "substance": "Quetiapine (Seroquel)",
  "views": "18279"
 }
}
