{
 "id": 20004,
 "title": "Do You Want to do This?",
 "date": {
  "submission": "2009-03-05T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Shaken",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "<p>My first impression is that if you are comfortable in this reality, do NOT TRY SALVIA. If you cannot understand what I mean by this, that is exactly my point. I feel like I should not be even writing this for fear that somebody may misunderstand me and want to try salvia. If what I have just written makes you curious, please read the rest of this before you decide whether you want to try it. The experience was jarring, incredibly bizarre, and I feel that this could change my life if I let it, but I am only going to allow it to change my life a little. Understand that it has that power. That the experience I had with a strong dose of Salvia made me consider reality in an entirely different way and destroyed any certainy I thought I had about it.",
  "Could you live your life the same way you do now with that knowledge? I am entirely serious. Either there is truly a reality beyond the one that we are born into, or there is a plant that is able to fuck my mind up enough for me to think that there is. You should realize that it doesn't matter which is right, because either way you believe it, and unless that is something you want to deal with right now, I do not recommend salvia.",
  "It was like climbing out of Plato's cave and it freaked the fuck out of me, and I wanted to pretend that I never did it in the first place. Fuck truth. I've got a lot going on in this little cave of mine and it's not worth losing, not at this point. Right now I am back to my comfortable reality, and I am trying the best I can to forget what I just expereinced, just so I can live my life the way I used to. It seems that I'm able to ignore what I just saw because it fades quickly like a dream. But it is the most utterly real thing I have ever experienced and I'm not dealing with it particularly well. Thats my rant about thoughts on the experience.",
  "Now Here is what I experienced, as I was compelled to write down just as I was coming down so that I would not for get it, and added to later.",
  "I took 4 big puffs, trying to finish the small bowl. It cherried everytime extraordinarily well, unlike weed ever does, so I could see the bowl getting closer and closer to being entirely burned every puff. I was trying to finish the bowl. Then a terrifying thought hit me. Wait a minute I said to myself, this isn't weed. This is Salvia. This isn't a joke. And it wasn't. All of a sudden the reality that I had been in before I had smoked was removed from me. It was like salvia had responded, saying, thats right this isn't a joke you idiot, and pulled me away from everything I thought I knew was real.",
  "Reality itself began to bend in a spiral pattern, there was my computer screen that I had been facing and then another and another to infinity each representing an alternate reality, identical to the one I had been in but different in the fact that THAT THEY COULD NOT BE IDENTICAL TO MY REALITY BECAUSE THERE THERE WAS MORE THAN ONE OF THEM. I got up, not able to believe what was happening. I Heard a voice, and I use that term as in the sense I had an impulse that seemed to come from outside of myself. I didn't want to listen to the voice. I felt that it had utter authority over me, like a parent or teacher has over a small child. It said that I had to leave this reality and was shown this that it was just one of a million, billion, infinite number of realities.",
  "I had gotten up, walked halfway down the stairs, feeling the force and authority of this voice pulling me away from this reality.  I stood on the steps of the stairs, saying to whoever was watching mewhat?....wait? no no nolooking around more. realizing it was true. No. what? Like some one who understood exactly what they had been told and could not accept it. Because I was. I stood there on the steps, just waiting for the voice to enforce what it had just told me and remove me from this insignificant reality to another.",
  "At this point I saw my roommates pulling up in the driveway, and realizing they were also just part of this false reality that I had been living in. And that I would never see them again, because I was leaving the reality to which they belonged. I went back to my room not ready to leave but feeling that I had to, like dying, saying good bye to not only every single person I knew, but everything I knew. In fact, thinking about it, that is exactly what I think dying is like. But I never had to leave. That was it. That part on the stairs was the most intense part of the trip.",
  "When I came back to my bed I tried to grapple with what had just happened, I realized that it was over. Nothing was going to pull me away. But nothing could ever be the same. I had seen past something. Something no one is supposed to see past, at least not in our culture. My roommates came home and I pretended to be asleep so I would not be forced to try to explain to them what I had just seen. Where I go from here, Im not sure. I think Im safe here now, and Im not going back, not for now, this is quite real enough for me.",
  "I cannot call this a bad trip. It's like a nightmare, that I believed to be true and then I woke up and I realized that thank god, it wasn't true. Except that with this I KNOW that it was real. I can forget it, just like a bad dream, but somewhere in my head I know that it wasn't just that. That is deeper shit than I ever thought I could, or wanted to be able to find at my local head shop. This stuff is no joke. I cannot tell you to try it or not to try it because I beleive that I got a glimpse of a reality more real than the one we are in now, and that I do not feel personally ready to face. If you feel that you are, good luck, but realize that beyond a certain point, there is no going back.</p>"
 ],
 "erowid": {
  "id": "55466",
  "citation": " Shaken. \"Do You Want to do This?: experience with Salvia divinorum (5x Extract) (ID 55466)\". Erowid.org. Mar 5, 2009. erowid.org/exp/55466",
  "substance": "Salvia divinorum (5x Extract)",
  "views": "5560"
 }
}
