{
 "id": 20002,
 "title": "Frightening, Powerful, and Prophetic",
 "date": {
  "submission": "2006-10-10T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shaun",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Silene capensis",
   "form": "tea"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "leaf",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Coleus",
   "form": "dried"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "leaves",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Coleus",
   "form": "dried"
  },
  {
   "time": "4:45",
   "amount": {
    "unit": "tsp",
    "quantity": "0.0625"
   },
   "administration": "insufflated",
   "substance": "Silene capensis",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "I began taking Silene capensis in order to gain insight into my dreams, whom I havent heard from in months. Over a week I took an infusion of 1/2 teaspoon of powdered silene capensis 3 times. I mixed this with 1/2 cup warm water and agitated, drinking in early morning on an empty stomach, and waiting several hours to eat. During this time I would meditate on something or someone to allow me an experience, but I acquired no visionary dreams, or any dreams at all.",
  "I read a few reports of the oneiric aspects of coleus, so I decided to try it as well. I dried several leaves in the oven at 300F for about 20 minutes. Around 5:45 pm I smoked a medium size leaf, holding it in for about 15 seconds. I immediately experienced a mild buzzing, also in my eyes. I sat in my garden and for about 5 minutes I was utterly captivated by the play of light and shadow caused by the movement of the trees. I was unable to view my thoughts subjectively, and the darted around semi-uncontrollably. My hearing was also increased, and the sounds of the nearby street irritated me greatly. The effects disappeared in about a half-hour. I was disappointed at not being given more, and I foolishly proceeded to smoke three more leaves, to no effect.",
  "At about 10:30 pm, I snorted a line of approximately 1/8 of a 1/2 teaspoon of powdered silene capensis. Experienced very slight dizziness, and fell asleep at around 11 pm. I slept lightly and sporadically from then until about 3:30 am. Went back to sleep at 4:00 am, and recieved an extremely vidid, powerful experience. Woke up around 7:30 am, and proceeded to rapidly jot down the dream. Everything was still completely memorable, down to the most minute detail. Right now, at 10:43 am, I can still recall every segment of the narrative, every color, everything spoken, and every emotion it illicited from me. Everything was very strong.",
  "The dream itself was involving, intriguing, at times very frightening, and prophetic. I plan on extensively experimenting further with both substances, combined and seperate."
 ],
 "erowid": {
  "id": "55459",
  "citation": " Shaun. \"Frightening, Powerful, and Prophetic: experience with Coleus & Silene capensis (ID 55459)\". Erowid.org. Oct 10, 2006. erowid.org/exp/55459",
  "substance": "Coleus & Silene capensis",
  "views": "30548"
 }
}
