{
 "title": "Heavy Insufflation",
 "author": "Senorsalvia",
 "citation": " Senorsalvia. \"Heavy Insufflation: experience with 5-MEO-DIPT (ID 20012)\". Erowid.org. Jun 9, 2003. erowid.org/exp/20012",
 "substance": "5-MEO-DIPT",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "20 mg",
  "insufflated",
  "5-MeO-DiPT",
  "(powder / crystals)"
 ],
 "report": "<p>  I have recently been given a report from a fellow researcher that states that she has been dissemenating Foxy throughout her region in 20mg dosage units.  She assured me that she has been adamnant that all her respective 'clients' are given several printed sheets to understand the effects of the compound.  She also states that she has repeatedly stressed that this is a compound that she feels should only be utilized orally.  </p><p>Not long ago she came to me and told me a tale of woes!!  One of her girlfriend became so taken by the effects of 5-meo-dipt, that the young lady began snorting up 20mg lines every few hours.  This, she continued to do for some week and a half duration, until she had run herself into a state of mental exhaustion, and a generalized sense of feeling 'burnt out as hell'  The girl reports that her friend checked into a 30-day dry out facility and has sworn off the usage of any drug by way of insufflation.  (the abusive girl states that she's never had a problem before with any substance that is taken orally)  The girl further stated that she has 15yrs experience using everything frome cocaine to acid, meth to valium, as well as years of general pot usage. </p><p>Though this repot is certainly not conclusive of anything; it causes me to wonder if repeated daily doses of Fox might not be all that good an idea; at least by way of nasal mucosa.</p>",
 "year": "2002",
 "id": "20012",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-06-09T07:00:00.000Z",
 "views": "11639",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 }
}
