{
 "id": 2003,
 "title": "Moments at Mardi Gras",
 "date": {
  "submission": "2002-08-08T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Echo",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "24 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "  I have found very few reports on the effects of 2C-E, so here is my experience.  I received the 2C-E from a trust-worthy chemist, and weighed out the dose myself.",
  "  Last Mardi Gras I drove to New Orleans with friends.  We were going to the last Zoolu party to be thrown at the State Palace Theater.  A little out of character, I decided to run my experiment at the party/concert.  It seemed reasonable because I had been convinced that I would enjoy the music and surroundings.  We arrived at around 1AM and I took the capsule containing 2C-E shortly there after.  I spent most of my time with a close friend who was on MDMA.  It was in a highly enjoyable setting for me.",
  "  About an hour after I took the 2C-E I started to feel its effects.  There was another 30 minutes before I vomited.  Even though I had been eating all day long in the car, I only vomited a couple of tablespoons of water-like liquid.  Vomiting was unusually painful.",
  "  By the time the nausea had passed, I had entered the plateau of the experience.  It was definitely a true psychedelic with waves of intensity between +2 and +3.  I have never before or since had the sensation of oscillating levels of intensity on a psychotropic.  The waves lasted about one hour each.  In the middle of a wave I would have a strong physical-mental rush that was poignant and novel.  I do not usually have any visual hallucinations on psychedelics, but this time I was treated to a full sensory show along with my mental escapades.",
  "  During one wave, I felt a great appreciation for the friendship that I have with my friend who was on MDMA.  This is usually a hard thought for me to deal with, but I was able to.  It was not an empathetic surge that aided me, but a cognitive breach that I look back on fondly.  It seemed to be partially lost as the wave of intensity swept over me.  It was a simple event, but I am greatly encouraged by it and have made progress since.",
  "  We sat most of the time we were there.  Partially for my friend, and partially because the 2C-E seemed to make me physically lazy - unlike LSDs energizing effects.  At one point, we walked from the dark main room to the well-lit lobby.  The drastic change in lighting completely over-stimulated my vision.  The visual distortion looked very solid and 3D as the creature forms around me slowly became people again.  I suffered from some anxiety here because I could not see well enough to find my friend in the crowd.  The problem being that I do not like crowds.  I believe she said I was next to her the whole time.",
  "  At around 7:30 AM, we left the theater and I was coming down off the 2C-E.  I ended up with about a five-hour plateau and a three-hour aftermath.  The aftermath was pleasant and interesting.  The substance caused a little physical anxiety, as with LSD.  The qualitative nature of the psychedelic effects felt very malleable, also similar to LSD.  However, no quantity of LSD has ever produced the anomalous oscillating aspect of this experience.  I found 2C-E to have a prototypical psychedelic feel, with strong enough effects to be useful and interesting."
 ],
 "erowid": {
  "id": "16636",
  "citation": " Echo. \"Moments at Mardi Gras: experience with 2C-E (ID 16636)\". Erowid.org. Aug 8, 2002. erowid.org/exp/16636",
  "substance": "2C-E",
  "views": "9409"
 }
}
