{
 "title": "Extraction Using Hdrochloric Acid",
 "author": "psychopsilocyber",
 "citation": " psychopsilocyber. \"Extraction Using Hdrochloric Acid: experience with Syrian Rue (ID 20049)\". Erowid.org. Mar 8, 2004. erowid.org/exp/20049",
 "substance": "Syrian Rue",
 "bodyweight": "",
 "report": "<p>I find this method easier than all of the others that use lemon juice or acetic acid.</p><p>Here's how I extracted:</p><p>1. I blended up about 20 grams of seeds</p><p>2a. I got about 200ml water and lowered the ph to like 4 using about 10 or 15 drops of muriatic acid.</p><p>2b. The beta-carbolines are more soluble in warm water, but you dont want to boil water with the acid in it already as metal will leach into the water. so if your going to boil your water do it before you put the acid in. I didnt boil at all, but it would probably work better if I did.</p><p>3. I put the acidified water in a jar with the crushed up seeds.</p><p>4. I let it sit for a couple hours.</p><p>5. I got a glass funnel and put a piece of a cotton ball in the hole and strained the seed mush through to another jar.</p><p>6. I did steps 2 through 5 four times and put all the liquid together. If you look at the liquid under a black light you can see that it glows, thats the beta-carbolines (harmala/harmaline). I also looked at the seeds that were left over and I could still see some glowing, but probly 80% at least of the beta carbs were in the final liquid.</p><p>7. I kept using cotton balls in a funnel to sepperate more of the seed matter from the final liquid until. At this point the water is a orange redish color.</p><p>8. This is where I would normaly boil the liquid down to make it more consentrated, but with hydrochloric acid you dont want to use metal for anything as you will get metal in the final product, I dont have any glass pans. So I put it in a big pyrex dish and put it in the oven for 300 degrees. when the liquid was greatly reduced until almost dry I turned downt the temp. to 200 degrees just because I felt like it (and it's not so hot for the next step).</p><p>9. I took it out of the oven and scraped it all up, put it in a bag and weighd it with my digital scale (200 x .01) to find that I now have 5 grams of extract.</p>",
 "year": "2002",
 "id": "20049",
 "gender": "Male",
 "timestamp": "2004-03-08T08:00:00.000Z",
 "views": "8279",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 g",
   "administration": "",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  }
 }
}
