{
 "title": "Paranoia",
 "author": "Anonymous",
 "citation": " Anonymous. \"Paranoia: experience with LSD (ID 2004)\". Erowid.org. Jun 21, 2000. erowid.org/exp/2004",
 "substance": "LSD",
 "bodyweight": "",
 "report": "<p>Back in the spring of '90, I was attending Drexel University in Philadelphia , and my roommate and I decided to drop, along with a few buddies who lived up the hall from us. (This during a period of my life where I had just finished having a slew of, not bad, but rather unpleasant trips) This was my roommate's second trip, my 100th? (lost count) Anyway, we were engaged in wide and diverse activities, like staying in our dorm room and watching TV to the music of Floyd . Anyway, my roommate and I got antsy and left in his car. He felt fine to drive a short distance, he said, so we drove to Fairmont Park. Now, this was about 3 hours into the trip or so, and around 1:00 in the morning. Anyway, the two buddies had headed to Fairmont Park, and we looked for them. Feeling *really* paranoid, because of some shifty characters parked next to our car who kept staring at us. I'm not rascist, but perhaps they were, and they were black, I'm white.</p><p>Anyway, we left our cars, and climbed a rock formation which has a car underpass under it, and overlooks the river. The lights reflected off the water twinkling with the currents, providing some real good eye candy. Anyway, we sat up there and smoked a bowl or two, and were watching the night sky, wondering where our buddies were, (and I was paranoid about getting mugged, even though we had gone there a lot before) when we noticed what the clouds were doing. Even though it was dark out, we could see the clouds and they were forming right before our eyes. I have seen this once before straight, but it was nothing like this...on acid, they kept forming cartoony shapes, like the Escher dragons biti ng each other's tails, etc., etc. Extremely intense.</p><p>Anyway, my roommate asked me what I saw, and what I described to him (as it was happening) was exactly what he saw. That made it really cool. So he then described what he was seeing, as it occurred, and I was delighted to find that I *was* seeing what he saw, bu t it was not suggestion, because I knew what I saw before he described it. All in all a really weird experience, but I guess you had to be there. Anybody who' s tripped before should be able to relate to it.</p><p>Anyway, later on that night, back at the dorm, our buddies met up with us, and they related to us quite a story. They had gone to Fairmont Park, but further upriver. They had had beer with them, too. (Don't know why--alcohol is a waste of time on LSD) So they were feeling esp. paranoid when a cop car drove by once on the highway with its lights on, then circled back, because he had seen them, and parked and came over to them. They hid their pot and beer real quick and *tryed* to sober up. Anyway, the cop asked them if they had seen anyone suspicious because someone further along the river had been stabbed earlier by a black man. The real kicker on this story is that two black guys had been in the same area as my friends, but when the cop car pulled up, one hid under a car, and another ran into the woods. AND they had come from the same direction that the cop had said the incident occurred. The cop suggested rather strongly that my buddies should leave the park, and this was one incident where my friends felt that a cop's advice meant something.</p>",
 "year": "",
 "id": "2004",
 "gender": "Male",
 "timestamp": "2000-06-21T07:00:00.000Z",
 "views": "3747",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "LSD"
  }
 ]
}
