{
 "title": "Flooded with Memories",
 "author": "Prognaut",
 "citation": " Prognaut. \"Flooded with Memories: experience with Salvia divinorum (ID 20043)\". Erowid.org. Oct 3, 2005. erowid.org/exp/20043",
 "substance": "Salvia divinorum",
 "bodyweight": "195 lb",
 "report": "<p>In early September, I traveled to nearby New Hope, PA.  I love that town and it was a very nice afternoon.  I bought a bunch of CD's and some herbs and so on.  I had heard about Salvia and read about its effect, so when I saw some on sale, I had to give it a shot.</p><p>The gentleman who sold it was very informative and was interested in what I thought about the experience.  He recomended I try some standard leaves first and then maybe some 7X.  Well, over the next few months I kept reading and just could not find the ideal time/place and mindset to try it, until yesterday.  Twas the day after christmas and I was alone and at peace for the first time in a few months... I am kind of a work-a-holic so I do not take a lot of time out for meditation, etc.</p><p>I had a glass of wine and packed the salvia into a bowl (about 1/2 of a gram or so of stadard strength dried leaf).  I had heard it could make me dizzy so I made sure I was next to my couch out in my sun porch.   I took a large hit from my freshly cleaned proto-pipe and held it for about 15 seconds.  That was all it took and I started to feel very different.  I took the second hit, put down the pipe slowly sat down as my head started to spin a bit.  Sudenly but not too suddenly, I felt a very nice feeling come over me.  It felt somehow familiar but I could not remember when I had felt it before.  I think I was very young, maybe 3 or 4 because memories started to flood into my head of a warm mild day with lots of sun walking with my mother in Philadelphia.  I felt very relaxed and removed from reality.  It was almost like dreaming but still being awake.  A memory from my early childhood eased into my head as I could hear some neighbors and children playing in the yards nearby.  I remembered a playground and a park where my mother used to bring me sometimes.  We were almost always the only ones there and it was very peaceful, away from the busy part of the city. </p><p>I became very aware of the sounds and felt almost as if everyone was in this journey together.  Life seemed so 'right' as if I were viewing/feeling it from a spectator's viewpoint.  Things just seemed to smile at me.  Wow! I heard myself say which kinda pulled me back to reality a bit.  This stuff was truly wonderful I thought. I looked out of the large windows of my sunroom and felt bathed in the light of the sun and the fresh smells of a mild winter day floated past.  I stood up to open the windows a bit and felt as if I were floating kind of slanted toward the windows instead of walking.  After I opened them I quickly decided to sit again and enjoy the moment in life that was unfolding before me.  OK I know that sounds very cosmic and New Age and all, but believe me, I am as 'rooted' as the next guy. But I could not help but become enchanted by this plant. I hope to have antoher chance soon to journey a bit deeper into this familiar but very different feeling.</p>",
 "year": "2002",
 "id": "20043",
 "gender": "Male",
 "timestamp": "2005-10-03T07:00:00.000Z",
 "views": "4101",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 }
}
