{
 "title": "Increased Awareness",
 "author": "Batman",
 "citation": " Batman. \"Increased Awareness: experience with Bupropion (Wellbutrin) (ID 20042)\". Erowid.org. Sep 29, 2005. erowid.org/exp/20042",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "270 lb",
 "report": "<p>I had been prescribed to Wellbutrin for about two years when I had this experience. It was the beginning of the summer, and my friend had just turned me on to snorting Ritalin. I found myself looking for something around the house that I could snort, and then I wondered, 'I wonder if my medication would do anything...'</p><p>I was also prescribed to Zoloft (sertraline), which I tried as well. The Zoloft were much smaller, and so I figured they would be more potent (well, honestly, I don't know what I was thinking, but I ended up trying Zoloft first). I took a razorblade and carefully scraped the coating off of the 50mg tablet. Once I had removed all the coating, I used a quarter to grind the pill into a fine powder. Being unfamiliar with snorting, as I had just started, I didn't know that I should test a little before doing a lot. So I crushed the entire pill and promptly snorted it up my nose. It hurt a bit more than the Ritalin had, but I thought it went quite well. I soon changed my mind. About two minutes after snorting the Zoloft, I felt a steady burn in my nose and throat, and an extreme swelling pain in the back of my mouth. I don't really know what effects there were, because the pain was overwhelming and I couldn't focus on anything else. That was the first and only time I ever snorted Zoloft, and I do not recommend it to anyone. Chewing Dentyne Ice (gum that numbs your mouth) effectively dulled the pain until it went away.</p><p>I gave up for the night and went to bed. The next night, I almost abandoned the Wellbutrin, after the horrible experience with Zoloft. In the end, I decided to give it a whirl anyway. I scraped off the coating and crushed it up just like I had done with the Zoloft, but this time I only did half of the 150mg pill. The initial burn was quite irritating. It was not painful, but the taste of the Wellbutrin irritates the throat and can make it hard to get down. Once it was down, however, there was no more pain or irritation at all. Soon after, I began to feel as if everything were closer to my body, and everything became very interesting, even though I knew it wasn't. I did the other half of the pill about an hour later and enjoyed the same experience. One thing I find entertaining when on Wellbutrin is coloring things with Sharpie markers. Tedious, boring things are suddenly incredibly interesting when I am on Wellbutrin.</p><p>In the subsequent days, I tried Wellbutrin with my friend, and we both enjoyed the effects. When outside, I can simply sit and stare at things like trees and squirrels and become intensely involved with everything around me. When I am around other people, I can understand them better, and even when people are having a conversation far away, I can hear and pay attention to them like never before. The effect is nearly indescribable, as my mind doesn't really 'think' much during the effects, which lasts about an hour. I say this because I don't really ponder things at all during the high, I simply 'absorb' everything around me. Reading while under the influence of Wellbutrin is a great idea if I am studying. I take in much more than I normally can, and remember all the little details.</p><p>Overall, every experience I have had with Wellbutrin since (which probably numbers hundreds of times) has been great. The only complaint is the snorting itself, which can be difficult. Bupropion is an acquired taste, to say the least, and on the whole, snorting Wellbutrin is an extremely positive experience.</p>",
 "year": "2002",
 "id": "20042",
 "gender": "Male",
 "timestamp": "2005-09-29T07:00:00.000Z",
 "views": "68507",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Pharms - Sertraline",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 24:00",
   "amount": "75 mg",
   "administration": "insufflated",
   "substance": "Pharms - Bupropion",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 25:00",
   "amount": "75 mg",
   "administration": "insufflated",
   "substance": "Pharms - Bupropion",
   "form": "(ground / crushed)"
  }
 ]
}
