{
 "id": 20060,
 "title": "SSRIs and Mushrooms",
 "date": {
  "submission": "2007-06-13T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gfresh",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": {
    "number": "10",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Escitalopram",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Bupropion",
   "form": "daily"
  }
 ],
 "report": [
  "I noticed a request for information reguarding ssri's and mushrooms.  I've been taking lexapro (SSRI)10 mgs and wellbutrin (dopamine / norepenephrine reuptake inhibitors) 150 mgs for about 2 months now, and I took shrooms 2 nights ago.  I was very pleased with my effects, the last time I took shrooms was about a year ago, so I feel that I didn't have any tolerance to them the night I took them.  The effects were alittle diminished, no visuals, aside from walking and seeing the ground sway up and down.  Very relaxed happy feeling though, I have social anxiety disorder, and while on shrooms I went to a party and I was relaxed, had deep conversations with complete strangers, somthing I know I wouldnt be able to do had it not been for the shrooms.  Had a great time, the next day I didn't feel any hang over effects, still felt the happy feeling and I was still able to meet new people very easily.  my friend also took the same dose as I did and he was tripping balls, saw many images and was laughing hysterically for 4 hours straight so I know the shrooms were potent.  Though I didn't trip as hard as he did I'm very glad I did them, SSRI's and Shrooms +++++"
 ],
 "erowid": {
  "id": "63678",
  "citation": " Gfresh. \"SSRIs and Mushrooms: experience with Mushrooms, Escitalopram (Lexapro) & Bupropion (Wellbutrin) (ID 63678)\". Erowid.org. Jun 13, 2007. erowid.org/exp/63678",
  "substance": "Mushrooms, Escitalopram (Lexapro) & Bupropion (Wellbutrin)",
  "views": "13288"
 }
}
