{
 "id": 20061,
 "title": "Kava-flip",
 "date": {
  "submission": "2001-05-02T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tripper",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": "0",
   "administration": "glasses",
   "substance": "oral"
  }
 ],
 "report": [
  "Initial intent of this mixture was for Kava to provide a backer to the LSD experience, not dissimilar to the use of other anti-anxiety drugs such as Xanax. This chemical excursion turned out quite surprisingly different from expectations. It appears there is a quite strong synergy between kava lactones and lysergic acid diethylamide. Instead of an expected sedative action which kava is know for this mixture turned out to be quite euphoric - touted by the tripper as 'kavaflipping'.",
  "As soon as the shake was ingested - right before the peak action of LSD -  intense feelings of euphoria and well being manifested. It appears that LSD acted as a psychological magnifying glass, greatly enhancing the euphoric feeling of Kava. The drawback to this mixture is increased anxiety in the LSD comedown phase. Please be advised that LSD is a controlled and dangerous substance.",
  "Keep in mind that there are many contraindications for both LSD, as well as Kava ingestion. Also, the pharmacology of LSD/Kavalactone interaction is not known, so be aware of the fact that you are treading on an uncharted territory. As to possible causes for such a synergy between those",
  "substances research points to the fact that certain kavalactones exhibit some pharmacological action on the serotonin circuitry, besides the well known GABA receptor activity. This could very well explain the effect described in this report."
 ],
 "erowid": {
  "id": "6368",
  "citation": " Tripper. \"Kava-flip: experience with LSD & Kava Kava (ID 6368)\". Erowid.org. May 2, 2001. erowid.org/exp/6368",
  "substance": "LSD & Kava Kava",
  "views": "20217"
 }
}
