{
 "title": "Turbo Orgasm ^10",
 "author": "Anonymous",
 "citation": " Anonymous. \"Turbo Orgasm ^10: experience with Diphenhydramine (ID 20076)\". Erowid.org. Oct 3, 2005. erowid.org/exp/20076",
 "substance": "Diphenhydramine",
 "bodyweight": "180 lb",
 "report": [
  "<p>I have used these drugs off and on for the last few years and have discovered that they enhance an orgasm ten fold. ",
  "I buy the generic supermarket brand of sleeping pills, the extra strength 50mg Diphenhydramine type (Nytol, Sleepeze, Unisom, etc.).  About 30-40 minutes prior to intercourse myself and my mate consume anywhere from 3 to 5 of these pills (either solid or liquid filled) and wait for the effects to kick in.  I find if we have a small snack just prior to consuming these, it expedites the effects.  We wait for the effects to start occuring which include the usual drowsy, laid-back, sedated feeling that the drug is supposed to produce and in this case with the higher dose these are obviously more pronounced.  She usually gets the buzz a little sooner (120lbs) but the buzzes last for quite a while.  When we are both feeling the effects we engage in normal intercourse and as a result of our drug induced state, both our orgasms are amplified I can only guess ten-fold in both duration and feel. It is like having a sexual convulsion more than an orgasm.  I tell you one thing, I'll never look at a normal orgasm again the same way.",
  "These pills will give me dry mouth, which is somewhat amplified during physical work, so best bet is to always have a glass of water around the romping room.  I find the buzz will last 3-6 hours depending on what I've eaten and/or my physical activities.  The buzz usually comes on strong and without warning, one minute I feel perfectly normal and the next I'm in dopey mode. We find this to be a safe enhancement of our sex lives as the quantities taken are never in excess, though I've often wondered what a ten pill orgasm might be like..  I've mentioned our little secret to a few friends and every one of them has come back stating that this produced their 'ultimate orgasm'.  Myself, I would like any input from other people that have tried this, I find that words often can't express the experience and wonder if it is working well for others too.</p>"
 ],
 "year": "2002",
 "id": "20076",
 "gender": "Male",
 "views": "133545",
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2005-10-03T07:00:00.000Z"
}
