{
 "id": 20079,
 "title": "I Am Now Who I Was Then",
 "date": {
  "submission": "2009-07-07T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "veryabsurd",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "Buprenorphine"
  }
 ],
 "report": [
  "In the middle of June, 2009, while I was living in an apartment with my sister, I was ambushed by my parents. They explained to me that, while they were reserving judgment, they were aware that I was consuming ~60mg of morphine a day with any additional opiates I could find (often included grandmother's propoxyphene, other relatives' oxycodone, hydrocodone, etc. - I knew what to look for). In any case, they were incredibly understanding about my situation and had done their research: they wished for me to see an addiction specialist and begin a subutex maintenance program in addition to therapy sessions once a month.",
  "Although not ideal (I was plenty happy doing full-agonist opiates), it was time for me to get my act together. I didn't want to be bound to my room (as the particulars of my opiate consumption dictated that I couldn't be far from my stash for long) for the rest of my life, and the money I had been spending on my 'gorilla', could have shamed a daily heroin user.",
  "So I consented. I moved in with my parents (an unfortunate clause to their offer) and began immediately.",
  "To get started on subutex, I had a few brief sessions with a board certified addiction specialist, who prescribed me eight (8) milligrams a day for the initial detox and has now moved me up to twelve (12). Because of the strong affinity for the mu-opioid receptor - i.e. it'll knock even heroin off of one's receptors -  and its only partial-agonism, it is required that before starting the program one must endure the onset of mild withdrawal, else one will PRECIPITATE withdrawal and suffer without the possibility of easing it as the subutex will then block any other opiates. Careful planning is a must; I stopped too early and was in quite serious withdrawal at the first administration of the drug.",
  "I couldn't be happier. Although tremendously expensive (at $6 to $8.50 a pill), the value can not be overstated. An immediate cessation of my withdrawal was the first effect. Next came a beautiful, lush mood which I had long associated with full-agonist opiates, but which was unaccompanied by any constipation, general itchiness, CNS effects, and the POSSIBILITY of overdose! That's right: when taken as prescribed, the drug has a ceiling effect at thirty-two (32) milligrams which prevents respiratory depression, so often the malefactor which offs opiate users.",
  "Since my induction into the therapy I have experienced bursts of creativity, a stabilization of my sleeping pattern, and an overdrive to my libido.",
  "I feel now like I did the last time I was happy, and opiates don't make me happy - they make me FEEL good. One can be sincerely depressed on opiates, as was my and many others' case.",
  "I feel now like my old self, before any drugs, even though I am still deriving the mild and pleasant sensation that buprenorphine provides.",
  "I feel like a kid again, with a fresh slate. Although not for everyone - I would have been S.O.L. if my parents weren't footing the bill - if you are interested, find a board certified addiction specialist (they MUST have a certain certification in order to dispense buprenorphine) and get started. Maybe you don't have to be chained to your 'gorilla' anymore. It doesn't even have to be a sad goodbye.",
  "Reading this over I feel like I might be a little too laudatory of Subutex, but I think it's hard not to praise it. And I never thought I'd like a pharma company, but Reckitt Benckiser not only makes this drug to help people with dangerous addictions, but, they'll give it to people for FREE! [In some cases]"
 ],
 "erowid": {
  "id": "79716",
  "citation": " veryabsurd. \"I Am Now Who I Was Then: experience with Buprenorphine (ID 79716)\". Erowid.org. Jul 7, 2009. erowid.org/exp/79716",
  "substance": "Buprenorphine",
  "views": "7571"
 }
}
