{
 "title": "The Bad Candyflip",
 "author": "Scotto",
 "citation": " Scotto. \"The Bad Candyflip: experience with MDMA & LSD (ID 2008)\". Erowid.org. Jun 21, 2000. erowid.org/exp/2008",
 "substance": "MDMA & LSD",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "MDMA",
   "",
   " ",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "1992",
   "2008",
   "Male",
   "",
   "Not Given",
   "Jun 21, 2000",
   "107859",
   " "
  ]
 ],
 "report": "<p>\nMost people report the candyflip (LSD + MDMA) combination to be a very enjoyable experience. The most rewardingly 'cosmic' aspects of the LSD are combined with the empathogenic 'love' of the MDMA to create a unique and often powerful experience. This is usually the case with me as well, provided I take a low dose of LSD with a regular dose of MDMA (i.e. too much LSD can blow the MDMA out of the water, which is a damn waste of MDMA). </p><p>However, I feel obliged to report one very negative experience I had during a candyflip many years ago, when I was still living in Cedar Falls, Iowa. This report mainly serves to underscore the importance of set and setting, but also stands as a reminder that, as Alexander Shulgin says, there are no insignificant psychedelic experiences, meaning caution is always a great policy. </p><p>I was hoping to do a rather deep exploration that night, and had invited my good friend H over to sit for me. His instructions were to sit quietly in the same room as me and intercede only if I really encountered problems. I felt this was a reasonable precaution because this was only my second candyflip, and I was still at that time relatively inexperienced with both LSD and MDMA. I didn't expect trouble, as I was feeling good and confident about myself at the time, but I figured it wouldn't hurt to have H around - someone who knew me very well and could handle me if I got into a bad space. </p><p>At the time, I was writing a book called 'Melody's Blues', and felt pretty involved with some of the characters, to the extent that my psychedelic trips often featured interactions with versions of these characters. I laid down on the floor under a nice blanket, on top of some cushions, underneath a blindfold, and proceeded to go 'way way out there, man,' and suddenly found myself sharing a psychedelic bubble of spacetime with Melody, the main character in the book. This was not in itself cause for alarm, but before long, things got incredibly dark and incredibly weird inside my head. The sensation was of being suddenly and vigorously pursued by vast collections of entities that were very specifically bent on doing us grievous harm. We fled through psychedelic corridors and churning maelstroms of energy, and the terror in me gradually increased over the course of what I'm guessing was a half an hour, maybe more. The intensity continued to build, and it seemed extremely relentless; I could feel them shrieking as they chased us, these horrible 'alien' monsters. I had never encountered such mayhem before, and was frightened beyond belief. </p><p>At some point, it somehow finally occurred to me to rip the blindfold off and sit up. The room was just as I left it, if covered with a few more multi-colored swirls than usual. I immediately turned to H, who was staring intently at me. I said, 'What the hell is going on?' He replied, 'You ingested LSD and MDMA, and you've been candyflipping for an hour and a half or so.' And then, he fell silent, and suddenly I heard for the first time the sounds coming from the apartment next door. My neighbors had been having a horrendous, extremely loud fight, and the screams were clearly audible through the wall. These sounds had very obviously penetrated my trip, but I hadn't given any external signs that I was in trouble, so H had chosen not to intervene. The aggression from next door was as much a part of my set and setting as my preparation and intention, and had pretty much steered my trip. </p><p>We waited a long time, H and I, until the sounds finally died down. I was very shaken by my exposure to such violent energy, and wasn't sure how to proceed. Eventually I put on some incredibly soothing music, and laid back down, and within minutes was sucked back into a very peaceful and magical place, about which I have written elsewhere...</p>"
}
