{
 "id": 20088,
 "title": "Comfortably Comfortable Numbness",
 "date": {
  "submission": "2009-07-07T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Hatter",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "(extract)"
  }
 ],
 "report": [
  "The substance in question is an extract from Yellow Horned Poppy labeled Glaucine hbr. 99% isolate, Origin Denmark. I purchased this product from a reliable Canadian Entheogen supplier (I would be happy to share the companys name and website upon request) and I have had a variety of experiences with the drug, all of which have been positive.",
  "There is very little effect beyond mild relaxation when smoked, but orally it is active in doses over 100mg. After some experimentation my personal preferred dose is 180mg, but I have had positive results from doses ranging 100mg to 200mg. 180mg is approximately equivalent to 2-2.5 Percocet or a large dose of opium tea.",
  "The effects are extremely enjoyable and very similar to opium poppy or the sedative effects of Kratom. The effects become apparent at t+45 min, peak at t+1.5h, and returns to baseline at t+5-6hrs. It comes on in waves of relaxation, pleasant euphoria, a general melting sensation, and sparkly dizzying head rushes similar to those of Kratom. It is also accompanies by a sort of softness or glow to ones surroundings, and general contentment. Another bonus is that while the effects are clearly opiating, they are not accompanied a slowness or fuzziness of mind that I often get from other opiates. The trip is quite lucid, and I have even had very pleasurable experiences reading while on the drug. The only negative effects that I experienced were when I had taken 200mg: I became lethargic and easily distracted so I was unable to do anything but lie in my bed trying to decide what to do. It was a bit boring, but that was mainly due to the dosage. At lower doses I can function and enjoy activities, and at higher doses I would be content just lying there. Anyway, I recommend this substance to anyone who enjoys the effects of opiates. It is an enjoyable legal alternative, and at $30 CDN per gram the price just cant be beat."
 ],
 "erowid": {
  "id": "79784",
  "citation": " Hatter. \"Comfortably Comfortable Numbness: experience with Glaucine (ID 79784)\". Erowid.org. Jul 7, 2009. erowid.org/exp/79784",
  "substance": "Glaucine",
  "views": "11013"
 }
}
