{
 "id": 20089,
 "title": "The Terror",
 "date": {
  "submission": "2001-07-10T07:00:00.000Z",
  "experience": "1996"
 },
 "author": {
  "name": "John",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 leaves",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "2 flowers",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(tea)"
  }
 ],
 "report": [
  "I was going through a bad time, my wife had left me, I was stuck with the kids, no money, no food, no transportation.  I had used shamanic drumming before to discover certain things, and I decided to do it again, but with a 'little help'.  I had a large shrub of Brugsmansia sanguinea I had grown from a cutting.  I made a tea, and not knowing a proper dosage, guessed at 2 leaves and two reddish orange flowers.  I went to bed, and tried to do some drumming.  After a while, I felt the drug coming on, quite strong, but for some reason, I fought it.  I fell asleep.  I had terrifying dreams of being chased by a demon who kept smashing my face into the projectors in a movie-theatre projection booth where I worked.  I woke up at one point, from pain, as I ran into the kitchen counter at full speed, which smacked me down, and I crashed on my back on the hard floor, no hands to cushion me whatever.  I gasped from the shock and pain and 'passed out' again.  That's all I remember.",
  "When I awoke the next morning, I felt very strange.  There was blood on the sheets, my legs were cut up, some nasty cuts on my forehead.  My son stood at the foot of the bed, staring at me.  He looked at me strangely and said, 'Dad, I think you need to come into the living room.' I followed him and stared aghast at the carnage.  A large plate glass window, about 4 feet by 8 feet, had been smashed - it was not safety glass, there were ominous daggers of glass.  It seems I had gone through it, fortunately knees first, or I would have been decapitated.  I had torn the back door off its hinges, same thing with the clothes dryer.  'What happened?' I asked him.",
  "   He said I went crazy during the night, they didn't know why.  The three kids cowered in their room as I ran back and forth through the house, smashing full speed into walls (evidently at the same time as my dreams of being chased by the demon).  I was yelling and saying strange things.  I stood in the shower with my clothes on and wept.  I seemed intent on destroying myself, and did the aforementioned damage to the window and door.",
  "   I went to check myself in the mirror.  I looked like a Martian - my blue-green eyes were completely black, like those guys infected by the alien virus in the 'X-Files'.  And I was cut up very badly.",
  "DO NOT TRY THIS STUFF!!!  maybe under controlled circumstances with an experienced shaman it would be a different experience, but I could have been killed, and it was truly the most frightening experience of my life."
 ],
 "erowid": {
  "id": "7978",
  "citation": " John. \"The Terror: experience with Brugsmansia sanguinea (ID 7978)\". Erowid.org. Jul 10, 2001. erowid.org/exp/7978",
  "substance": "Brugsmansia sanguinea",
  "views": "41773"
 }
}
