{
 "title": "My Personality Had Changed",
 "author": "Drugwars",
 "citation": " Drugwars. \"My Personality Had Changed: experience with Pharms - Paroxetine (ID 20085)\". Erowid.org. Nov 10, 2003. erowid.org/exp/20085",
 "substance": "Pharms - Paroxetine",
 "bodyweight": "12 kg",
 "report": "<p>I was prescribed 20mg of paroxetine for my depression last year, and having studied the instructions stating they were non-addictive, I proceeded to take one tablet a day. After a period of 2-3 weeks I noticed that I was no longer having wild mood swings and my depression was improving, so I was feeling quite positive about the results.</p><p>After about a month of taking the pills, my prescription had run out and I had forgetten to obtain a repeat. It was a bank holiday, so I figured I'd put in the repeat after the long weekend.</p><p>This was where the problems started. After 2 days, I woke up feeling really strange. I was lightheaded, felt constantly dizzy and sick everytime I stood up. I was becoming easily frustrated and stressed, and did not know what the hell was happening to me. It felt like I was losing my mind. That night I tried to sleep it off, hoping that I'd picked up a bug of some sort. I found it really hard to get to sleep, and when I eventually did I had all sorts of crazy dreams and nightmares. My head was racing, and I was having panic attacks.</p><p>I woke up the following day feeling much the same. It felt like something had been taken away from me, and I was never going to be the same again. My personality had changed. I was quiet and did not want to leave the house, all the time my head was spinning and the constant feeling of panic and dread would not leave me.</p><p>Anyway, after what was the longest 4 hellish days of my life I managed to obtain my repeat pescription and almost immediately after taking the first tablet, I began to feel better.</p><p>I am currently still taking Paroxetine, and I'm dreading the time when I have to come off them. I have never experienced any problems with other drugs before, and sincerely wish I had never been pescribed this drug.</p><p>If your doctor tries to pescribe this drug for depression problems, I would seriously question it. There are other drugs available, and I'd rather take the depression than be in the situation I'm in now.</p>",
 "year": "2002",
 "id": "20085",
 "gender": "Male",
 "timestamp": "2003-11-10T08:00:00.000Z",
 "views": "14032",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  }
 }
}
