{
 "id": 20086,
 "title": "Total Ego Death",
 "date": {
  "submission": "2009-09-09T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shermin",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "70"
   },
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Chemical: DPT hcl",
  "Dose: ~70+ mg, Insufflated",
  "Subject: Me, 19 year old white male. About 61, 170 pounds.",
  "Mindset: A bit anxious and tired",
  "Setting:  A hill in a hiking park, in the summer on a sunny day.",
  "Dosage time 6:54 PM",
  "My mindset wasnt the greatest; I told myself that I couldnt let my anxious, sleep deprived state affect the psychedelic experience that I, my girlfriend [E], and two other friends [W and C] had planned for this evening.  I have had one other experience with DPT at a low dose of ~25-30 mg and had a somewhat mild, but very fun trip.  My dose was ~70mg on this day was absolutely bewildering; 70 mg of DPT hcl for lack of a better term blew my mind.  The open eye visuals were almost too intense to comprehend, and accurately describe, and the head trip was crushingly intense.",
  "I am a somewhat experienced Psychonaut, and I have taken more pleasure drugs than I care to mention, but as for anything remotely psychedelic my list is as follows: Mushrooms, LSD, Ketamine, DMT, DXM [if it counts], Marijuana [I dont smoke regularly at all], MDMA, 4MMC [mephedrone], Methylone...you get the ideaand my aforementioned experience with low dose DPT.",
  "T+0 [6:54pm]  I insufflate my measured dose of 50 mg, then take another good sized bump that I assumed was about 10 mg, that turned out to be closer to 20 mg.  I wasnt concerned with the inaccurate measurement because people have told me to start with doses of 100mg.  We all dosed except for W, who just wanted to trip-sit. So we begin to hike up the hill trail to find ourselves a spot to watch the sun set, and look at the beautiful trees and rolling hills.",
  "T+5 minutes  Im already at a solid +, beginning to see enhanced colors.  I can feel my heart start to pound, blood pressure rise, and my anxiety build slightly, so I utilize a breathing relaxation exercise as I walk up the steep trail.  I close my eyes and breathe deeply and slowly as I feel my mind begin to drift.  I could tell that this wasnt going to be an every day experience; I was really in for a ride.",
  "T+20-30 minutes  Im starting to trip hard. Im somewhere between a ++ and a +++ already, and we havent even hiked up to our desired location yet.  A man jogs by us and nods his head, and I had a lot of trouble formulating words.  I managed to mumble some distorted greeting just after he passed us.  The ground begins to crawl with distortions, the tall dried grass seems to be moving with the kind of animation that only tryptamines can give.  Im still feeling anxious, and at this point realize that in a matter of minutes this chemical will completely crush me, and there is nothing I can do about it.  I hug E, then begin to get lost in this emerging world of hallucinations.  The visual world begins to shake back and forth quickly, shapes distort, and my body feels very odd; my current state reminds me a lot of coming up on a smoked dose of DMT, but a lot slower.  I tell C that I am beginning to trip hard.  I feel kind of cold due to the wind and the fact that I didnt have a sweater [though C and W later insist that it was about 70 degrees] and I start to shiver. This had happened to me years ago on LSD, and lead to a somewhat unpleasant, jaw grinding experience.",
  "T+30-40 minutes  At this point, my memory gets kind of fuzzy.  We make it up to the top of a hill with a beautiful view, and a nice tree to sit under.  At this point, the trees and other vegetation seem fully animate, complete with swirling complex colors.  I realize that I am tripping harder than I ever have in my life [including my 6 gram potent mushroom trip, and yes, in a way I was tripping harder than a breakthrough dose of DMT].  I realize that I definitely was not ready for an experience like this, but I have to ride it out. Besides, I dont think anybody could really be ready for something like this, but this definitely wasnt the right day and mindset for an experience of this magnitude.",
  "T+35-75 minutes  This is where I start to plateau, for moments, I was at complete ego death, possibly a ++++.  I remember scattered events, and specific hallucinations, but not the order at which any occurred.  I recall being extremely confused, shivering on the hillside lying on Es lap transfixed upon the beautiful landscape.  I really wish I had a sweater.  The trees in the distance were swirling freely, as if they were puddles of paint being stirred in a fractal-esque pattern.  Just adjacent to the swirling trees, on a bare hill, I begin to see shapes emerge from the texture in the landscape.  I see small faces in everything, which is normal for me on any tryptamine, but this got a lot crazier.  In the texture, I saw a group of M. C. Escher like lizards (if youve seen the lithograph reptiles by Escher sometime in the 1940s, the lizards were of the exact shape).  The lizards were geometrically linked together, and moving around freely.  Throughout my entire plateau all the tall brown grass seemed to have thorns, and looked somewhat menacing, and I was seeing a lot of fractals in things.  It seems that every swirling color swirled in the same pattern.",
  "At some point a bit later [I think] I recall walking down a path, and seeing a colorful aura lifting above the dry grass on the sides of the trail.  This aura rose up, at least 10 feet and was smoke like in texture, though moved very slowly.  All of my visuals were absolutely astonishing. Honestly, they were kind of overwhelming at times, but very beautiful nevertheless.",
  "My head trip was what was truly overwhelming, and my negative mindset defiantly manifested itself.  I spent a lot of time thinking about my past opiate [primarily oxycodone] dependency, even though Ive been off of opiates for about a year.  I wasnt talked to by some mystical figure, I didnt feel touched by a divine voice, I was just in my headintensely introspective. It seems like there would be 5 minute cycles of total immersion in the experience, then a minute or two reality check.",
  "T+75 minutes and onward  So after we came down, we headed back into town, got some food then hung out.  I really was the only one of the three trippers that had such an intense experience.  E only took about 50 mg, and she said she didnt trip any harder than her previous 25 mg dose, and C took a little less than I did, and didnt trip hard at all [though he weighs about 60 pounds more than I do].  C said that next time hell want to do about 120 mg.",
  "This was definatly the most intense psychedelic experience of my entire life.  I was in the wrong mindset, and not prepared for the experience.  The intensity of it caught me off guard, since Ive heard it really doesnt get too crazy until 100 mg, but I really should have expected an intense experience.  I still have a bit of it left, but probably wont do it again until Ive prepared myselfI will go for either a higher or lower dose, because it seems like there really are 2 faces to the chemical.  My first trial [at the lower does ob 25-30mg] was a mushroom-like experience, and I think a higher dose would be a behind closed eyelids dmt like experience.  For most of my trip at this dosage, I could barely stand, but wanted to be outside, which implies that a higher dose in the proper setting would provide an experience similar to dmt, which isnt for outside.  I don't regret this trip, it was amazing, but it caught me off guard.",
  "oh, and by the way, it fucked up my noseso make sure you dont snort it with both nostrils, only one, because it could restrict breathing."
 ],
 "erowid": {
  "id": "79766",
  "citation": " Shermin. \"Total Ego Death: experience with DPT (ID 79766)\". Erowid.org. Sep 9, 2009. erowid.org/exp/79766",
  "substance": "DPT",
  "views": "5496"
 }
}
