{
 "title": "Buy a Digital Delay Unit Instead...",
 "author": "Mr Paul",
 "citation": " Mr Paul. \"Buy a Digital Delay Unit Instead...: experience with Heimia salicifolia (ID 20103)\". Erowid.org. Jan 3, 2003. erowid.org/exp/20103",
 "substance": "Heimia salicifolia",
 "bodyweight": "70 lb",
 "report": "<p>I recently tried this herb after reading various reports. I was most interested in the 'auditory' nature of hallucinations as I am a keen sound designer, synthesist and electronic musician; it would be fair to say that I was expecting a more sophisticated degree of audio warping and aural craziness than a psychonaut who can't program fat Pulse Width audio-frequency Modulations, or reverse reverb FX in real time.</p><p>I was lovely and relaxed when I tried to drink the tea I had prepared; I'd had a couple of small bongs of skunk in preparation for any ensuing nausea, and because, let's be honest, gear goes with and potentiates everything. My fiancee was elsewhere, the lava lamps gave the room a nice quixotic warm glow, and I settled down for some otherworldly synthesizer programming.</p><p>The tea was too foul to drink; moreover, after my ayahuasca experience, I know that something which tastes this bad really is not for consumption. I had more leaves and a crude extract someone had raved about on the internet, so I tried vapourizing and bonging another 15g of leaves. The smoke was hideous, stank out the room for days afterwards, and did as much as eating a turnip (except that I like raw turnip). I smoked and vapourized the extract as a last ditch attempt to get something from this useless plant; the extract would have been around 25-30g of leaves, and, as expected, it did nothing.</p><p>My conclusion? If you want far-out audio magic, alien soundscapes and atmospheres circling your head and disappearing at lightspeed into an angelic ether, followed by halos of simultaneously heavenly and devilish echoes...spend four grand on synths, effects units and processors, learn them inside out and you will come to love them as I love mine.</p><p>Obscure herbs are great, y'know, and gear is great too. Forget sinicuichi, and don't always take experience reports as Gospel Truth. Regards to you all.</p>",
 "year": "2002",
 "id": "20103",
 "gender": "Male",
 "timestamp": "2003-01-03T08:00:00.000Z",
 "views": "25192",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Heimia salicifolia",
   "form": "(tea)"
  },
  "2": {
   "time": "",
   "amount": "15 g",
   "administration": "smoked",
   "substance": "Heimia salicifolia",
   "form": "(leaves)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Heimia salicifolia",
   "form": "(extract)"
  }
 }
}
