{
 "id": 20102,
 "title": "Entheogenic Amanitas",
 "date": {
  "submission": "2009-07-10T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tengu, Japan"
 },
 "dose": [
  {
   "time": "DOSE:4:00",
   "amount": "8 g",
   "administration": "oral",
   "substance": "Amanitas",
   "form": "tea",
   "specific": "A. pantherina"
  }
 ],
 "report": [
  "Citation: Tengu, Japan. 'Entheogenic Amanitas'. The Entheogen Review. Summer Solstice 1998;7(2):33.",
  "I have found through countless bioassays that both Amanita muscaria and A. pantherina are entheogenic. I've collected A. muscaria in New Mexico's Rockies and in Japan. The New Mexican variety from near Santa Fe was quite nauseating and caused me to use a box of tissues as I drooled profusely. The Japanese variety caused little drooling, and was stronger, but also had a lot of nausea. I won't do either again. The star is the A. pantherina. It is stronger, cleaner, and causes little or no nausea--perhaps due to lower concentrations of muscarine, a toxin in A. muscaria with the above-mentioned side-effects.",
  "These mushrooms cause one to step into a world where the internal monologue is silenced. Vision appears as if one is scuba diving; the air appears thick, and size and distance is distorted. Usually, after about an hour, one falls asleep. It is best to set an alarm for one hour, and let it take you under. That dream-like sleep is interesting, though the right and left lobes of your brain seem to continually buzz loudly, pulsating from right to left as your heart beats. The buzzing increases until you wish to lay down. Don't fight it, just set the alarm. Upon waking the world is changed, like looking through a large aquarium. Mirrors are strange to gaze upon.",
  "I recommend no more than two dried grams initially. I once foolishly ate eight grams of Japanese A. pantherina (found under aspens in September), which I boiled into a tea. I drank the tea at 4:00 pm. After two hours the effects were frighteningly strong, so I took two capsules of milk thistle (Silybum marianum) to rid the ibotenic acid from my liver. Next the power of the drug surged--possibly due to the milk thistle. It may have sent all of the stored toxins back into my blood, rather than expelling them. I recommend caution if experimenting with milk thistle and A. pantherina. It turned into a nightmare, as my brain throbbed, right and left. Soon I spun as one would with too much alcohol, but it then doubled, then tripled, then a million-fold. Then astronomically I spun; the room I was in no longer appeared. I clutched the only thing I could feel--a speaker. I remember holding the speaker soaring round and round through space. Recalling past LSD trips, ayahuasca, and other combinations--nothing had come near this distance from reality. Time was gone. For many hours it continued. I was convinced that I was in hell. I thought, shit! Why hell? I am not a bad person? I was convinced that I had died.",
  "I remembered Pharmacotheon stated that A. pantherina weren't deadly (Ott 1993), though I feared the milk thistle may have rendered it so. I was terrified. My body was not with me. Just a spirit among a thousand streaks of [lightning] surging through some fantastically large black-hole like abyss. The spinning non-world continued for what seemed as long as my entire 37 years of life, until 3:00 am when I regained more normal consciousness. I awoke to a ransacked house, food and books strewn about. Things were scribbled on paper. I remember none of that. A twelve-hour plus visit to hell. The next day I ran out in the yard and grabbed plants, hugged trees, and smiled at everyone I saw--happy to be alive. So, if you want to try Amanitas, try A. pantherina in small doses. -- Tengu, Japan\rThere has been some success using Silybum marianum to treat amatoxin poisoning (Ott 1993 citing Der Marderosian & Liberti 1988; and Foster 1991). However this wouldn't seem to relate to possible muscarinic reactions or overdoses of ibotenic acid/muscimol. And while atropine is used as an antidote to muscarine poisoning, it is contraindicated in cases where ibotenic acid/muscimol are involved (Ott 1993). We have no idea if the S. marianum contributed in any way to the strength of A. pantherina's effects in this case. For more information on human bioassays of these mushrooms we recommend reading 'Psycho-Mycological Studies Of Amanita--From Ancient Sacrament To Modern Phobia' (Ott 1976)."
 ],
 "erowid": {
  "id": "79865",
  "citation": " Tengu, Japan. \"Entheogenic Amanitas: experience with Amanitas - A. pantherina (ID 79865)\". Erowid.org. Jul 10, 2009. erowid.org/exp/79865",
  "substance": "Amanitas - A. pantherina",
  "views": "20380"
 }
}
