{
 "title": "Extreme Disorientation",
 "author": "Anonymous",
 "citation": " Anonymous. \"Extreme Disorientation: experience with MDMA & LSD (ID 2010)\". Erowid.org. Jun 21, 2000. erowid.org/exp/2010",
 "substance": "MDMA & LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 ug",
   "oral",
   "LSD",
   " T+ 3:00",
   "100 mg",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>This is commonly known as 'candy-flipping'. I'm not sure why. I've only done it once, and I found that there was indeed a powerful, synergistic effect. The common procedure is to take the LSD about 3 or so hours before the MDMA, so you're just starting the peak of your trip when you begin to roll. Dosage wise, I tried ~150-160ug of LSD with ~100mg of MDMA.</p><p>The combination was extremely powerful. Although I had had a very bad day I was enjoying my trip. About 20-30 minutes after I took the Ex, I could feel the onset. Its difficult to explain, but as I was already tripping I felt in great detail the beginning of the MDMA effects on a very physical level... I could feel the speeding of my heart and breathing, and felt the MDMA-ness go from my center and spread gradually to my limbs. This all may of course be psychosomatic.</p><p>As the Ex took effect, the visual characteristics of the scene began to change, and I found that my emotional reaction to objects and people *strongly* cast their appearance. There was a definite combination of the MDMA 'everything is beautiful' look and the Acid's power to warp the actual appearance of things.</p><p>As the evening went on, I started to find the combined effect unmanageable. As I said before, I had had a bad day, and I was probably in a poor set for trying a new psychedelic experience. Gradually I became overwhelmed with sadness and despair about all the things I had done and said wrong over the last few days, and became extremely mentally and physically disoriented, and I needed a friend's help to get me through the rest of the evening.</p><p>All in all, I thought it was an extremely powerful and interesting experience, and parts of it I truely enjoyed. MDMA seemed to powerfully reinforce the reality bending aspects of LSD, and LSD opened a new door on the emotional projections of MDMA. I will definitely try it again, as soon as I feel comfortable with it (this was my first negative psychedelic experience in about a year of use).</p>",
 "year": "",
 "id": "2010",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-21T07:00:00.000Z",
 "views": "7030",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "150 ug",
   "administration": "oral",
   "substance": "LSD",
   "form": " T+ 3:00"
  }
 ]
}
