{
 "id": 20114,
 "title": "Stopped the Brain Zaps",
 "date": {
  "submission": "2010-08-17T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Jono",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "So this report is basically to inform people who are on an SSRI such as Prozac and are considering DXM use.",
  "I was on a 20mg daily dose of Prozac starting last summer for anxiety and depression. Looking back, and seeing all the side effects as I have stopped taking it, really makes me almost regret starting it in the first place. While it helped me grow a lot, I feel that there are other ways of dealing with depression that don't involve chemicals.",
  "Starting last month (June), I stopped taking my dose (as instructed by my physician). I felt that I no longer needed it, and just didn't like the idea of being on medicine indefinitely. Once stopping, I remembered reading about DXM online and decided that I would try it once I gave my body some time to cycle the Prozac. After a week, I started getting common withdrawal symptoms of the medicine. I had a symptom referred to as 'brain shocks' or 'brain zaps.' It is very hard to explain, and if you would like to know more I suggest searching online. This can be a very uncomfortable symptom, and at this point I was really regretting ever starting the medicine, as nobody had ever informed me that the withdrawal would be intense at all. The next week, I was still experiencing these brain zaps, albeit less frequently and less intensely. I can only imagine what a withdrawal from a larger dose or from something like Paxil would be like.",
  "I decided that the medicine was probably almost completely out of my system, so I had my first experience with DXM. It was a very good experience, and the next day I realized that my withdrawal symptoms were completely gone. I assumed the Prozac was out of my system, and finally felt free of it. I repeated the DXM maybe about 10 times in the next few weeks.",
  "It has been about 4 days since taking DXM, as my tolerance was ridiculous and I can't really go into stores and buy 3 bottles of cough syrup for very long before raising suspicions. This situation seemed fine, but yesterday I started experiencing the exact same Prozac withdrawal symptoms again (extremely vivid dreams, brain zaps). I have since concluded that DXM acts similar to an SSRI. It was replacing my daily Prozac dose for the few weeks that I was taking it. I stopped experiencing withdrawal symptoms because my body simply thought I had started my Prozac again. I was very upset when I learned this, as it felt like I was chained to a drug again. I took one of my pills yesterday (a common thing doctors will tell you to do to ease withdrawal symptoms), but I plan on never taking one again.",
  "I will not use DXM for a while, as this time I want to be absolutely sure that my body is not dependent on an SSRI and that dosing will not just result in loss of progress to free myself from the little pill.",
  "Thank you for reading and be safe!!"
 ],
 "erowid": {
  "id": "79951",
  "citation": " Jono. \"Stopped the Brain Zaps: experience with DXM & Fluoxetine (Prozac) (ID 79951)\". Erowid.org. Aug 17, 2010. erowid.org/exp/79951",
  "substance": "DXM & Fluoxetine (Prozac)",
  "views": "10057"
 }
}
