{
 "id": 20125,
 "title": "9,10, Never Sleep Again",
 "date": {
  "submission": "2009-08-01T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Calahan",
  "gender": "Male",
  "weight": "80 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Escitalopram"
  },
  {
   "time": "0",
   "amount": " T+ 0:00",
   "administration": "30 mg",
   "substance": "oral"
  },
  {
   "time": "MDPV",
   "amount": "(liquid)",
   "administration": " T+ 0:00",
   "substance": "30 mg"
  },
  {
   "time": "insufflated",
   "amount": "MDPV",
   "administration": "(powder / crystals)",
   "substance": " T+ 0:00"
  },
  {
   "time": "0",
   "amount": "insufflated",
   "administration": "Tobacco",
   "substance": ""
  },
  {
   "time": " T+ 19:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil"
  },
  {
   "time": "0",
   "amount": " T+ 20:00",
   "administration": "2 mg",
   "substance": "oral"
  },
  {
   "time": "Pharms - Alprazolam",
   "amount": "",
   "administration": " T+ 20:00",
   "substance": "20 mg"
  },
  {
   "time": "oral",
   "amount": "Pharms - Diazepam",
   "administration": "",
   "substance": " T+ 20:00"
  },
  {
   "time": "15 mg",
   "amount": "oral",
   "administration": "Pharms - Zolpidem",
   "substance": ""
  }
 ],
 "report": [
  "INTRODUCTION",
  "Description of subject, the writer.",
  "Subject: Male, age 30'ish, weight 80kg, height 1.78cm",
  "Health:  Good physical health, hayfever, asthma.",
  "Mental:  Diagnosed ADHD-PI",
  "Medication taken two days earlier: 100mg valium, 8mg xanax.",
  "Medication taken same day: 10mg Lexapro, bronchodilator, antihistamine.",
  "Harm-reduction disclaimer",
  "------------------------------------------------------------------------------",
  "I felt obliged to note the excessive intake of valium and xanax I took two days earlier since half-life of benzos can be quite long and I don't know if it affects MDPV.",
  "Now for the MDPV, this is really important to take note of. I have read lots of reports of inability to stop redosing MDPV, fiendish! Be warned that this seems to be the standard with MDPV and a harsh come-down.",
  "However I did not at any time feel any urge to redose at any time after initial dose. Neither did I experience any comedown or crash, instead just such a slow comedown to baseline I didn't notice it. Whether it was depending on the combination of Lexapro, my mood and mindset or setting, further trials will tell if any.",
  "==============================================================================",
  "Description of situation before intake of substance:",
  "Mindset: Just home from weekend at countryside house. Peaceful and curious.",
  "Setting: Home alone. I have had a full nights sleep and fully rested, and in a neutral mood and had a medium meal at 15 o clock.",
  "-------------------------------------------",
  "The text is written in real-time, and I tried to edit as little as possible to show the change of mind and whatever. However I had to edit away rather large stories as my mind wandered to other things in this same document as sleepyness and focus on the report was lost.",
  "Description of the substance",
  "----------------------------",
  "Container is ca 3x2 inch ziplock brand RIPPIE, with a white label. Label has black text MPDV 500mg left side, and to right black square marking with three smaller squares upper left, lower left, upper right.",
  "The contents are a white salt, a bit chunky. Smells faintly citrus. Taste is chemical but not nasty. It solves in water with some effort. Snorting it is painless.",
  "Description and timeline of the MDPV",
  "------------------------------------",
  "18.00  \t30mg of MDPV is taken nasal and 30mg MDPV orally solved in water.",
  "\tUnknown amount of snuff tobacco is consumed.",
  "18:05 \tNon-placebo obscure active substance in bloodstream.",
  "18:15 \tA weak stimulating body and head buzz.",
  "18:30 \tNegatives:",
  "\tMinor jaw-tension.",
  "\tInvoluntary movement of tounge and lips when not focusing.",
  "\tThis would be a chewing gum moment in social setting.",
  "\tIncreased pulse.",
  "\tHands tremble a bit, though barely noticable.",
  "\tTiny tactile and balance loss, which I suppose would go unnoticed.",
  "18:40\tBodyload a chilled out stoned stimulation.",
  "\tThoughts and memory becoming light, mindfulness and peace.",
  "18:50\tEyes are still like baseline, there is zero dilation of pupils.",
  "\tAbove mentioned side-effects remain.",
  "\tPositive effects have remained a plateau since 18:30.",
  "19:00   Breathing has grown a bit more shallow but no issue.",
  "\tTHe head sensations has spread, and is felt all over head,",
  "\tprimarily at frontal cortex and temples.",
  "19:20\tWhat is not:",
  "\tSpeed, activation, euphoria, cns-stimulation, sexual arrousal,",
  "\tsocial enhancement, ego-boost, and hyperactivity.",
  "\tWhat is:\t",
  "\tRelaxation, a calm mix of stony body/mind stimulation, mindfulness.",
  "\tThe content of being is a sanctuary from impressions.",
  "\tEverything just is but no name for any of that.",
  "\tRelease of naming, release of words and knowledge of anything.",
  "\tThe mind feels a bit like how I imagine being 2-3 years old.",
  "19:30\tTaking a pause for now in noting.",
  "\tI lie down in sofa and enjoy listening to the wind from the window. put on Beethoven's seventh, which I normally can't listen because the beauty overwhelms me.",
  "\tHow will it affect me now?",
  "20:00\tThe music is passing through me without many emotions.",
  "\tMusic appreciation is not heightened, but rather disturbing my bliss.",
  "\tbut it activates me for what to do next.",
  "21:00\tI am now having a discussion on the net with a friend.",
  "\tShe tell me I am writing a lot and inspired.",
  "\tI have no problem of changing subject and being apprehensive of her,",
  "\tbut only after she mentioned my intense writing.",
  "\tThis means I am entering a speedy phase of mind certainly although",
  "\tI didn't notice. Now the bodyload has lessened also.",
  "21:30\tActivation and speedy mind now. Communicating is important.",
  "\tKeeping focus on writing this report is decreased.",
  "\tInteresting note, I am feeling a betterment in my ADHD.",
  "\tI can focus better, switch focus between things without stress,",
  "\tand I do not feel the constant wornout mental feeling.",
  "22:20\tI am listening to Shakti. The speediness has lessened to a more",
  "\tnormal state. I feel normal actually.",
  "\tMentally I feel somewhat like when I were on Ritalin without",
  "\tthe nasty nausea I would get from it.",
  "\tI am not feeling any urge to redose which is odd, considering this",
  "\thas been reported.",
  "\tI have yet to experience any comedown and what it is like.",
  "\tI am very hesitant to say this is good for ADHD even though I",
  "\tpresently get this feeling - I know it is only a temporary high.",
  "\tThe problem is firstly the effect now is different from 2 hours ago.",
  "\tNow the bodyload has disappeared and feeling rather sleepy peripherally. Head is still stimulated but in a less speedy way. In a almost natural awakened way, if I may say so since I don't know \thow it is for normal people. I feel awake now, but thoughts are not racing.",
  "23:00\tI have got some rather good things done during the evening.",
  "\tI wrote a poster with reminders for making budget which is a constant",
  "\tproblem for me, and also a mental reminder how to handle medications",
  "\tand drugs in a way which works for me to not get addicted or abusing.",
  "\tPosted it on the wall for everyday reading in the morning.",
  "01:50   A very creative state of mind during the last three hours.",
  "\tLoosing attention for this writing and enjoying texting online with",
  "\tfriends. I got a very clear mind for expressing some important issues",
  "\twith a person who I found share some different experiences of reality",
  "\twhich is very lonely to have nobody share with. I appreciated it very",
  "\tmuch. Focus is lost for writing more on the report in realtime, I am",
  "\tenjoying texting with friends and my stoned attention is still",
  "\tspinning with many ideas. Bodyload is gone and just tiredness.",
  "05:00\tOh well, very sleepy.. The last six hours just passed like a breeze,",
  "\tcan't believe it. Still having a alert head, but sleepy body.",
  "\tThis is sure a long acting substance.",
  "06:00\tBack to baseline I think. What is now is the beyond sleepyness where I \tcan get a false wakeful alertness, and refuse to go to bed although I know I would fall asleep in minutes and really need it and instead doing obsessive compulsive things. I am wary of going into a trance-like state which happen to me when underslept underfed and when the dopamine floods.",
  "08:00\tI wrote a story of an life changing experience I had one year ago,",
  "\tthat I always wanted to get down on paper to a texting friend on the net.",
  "\tI am reminded by a person on the net to sleep now, and take the advice",
  "\tbefore I enter zombie-state. I have forgotten to eat properly.",
  "\tWater as needed. Sleepy time now.",
  "10:00\tNo sleepy time yet, getting up now and then turning rolling in bed.",
  "13:00\tI take a shower and do some business downtown. ADHD-confusion made worse by tiredness, noisy - crowded - ugly movement - aura of stress.",
  "14:00\tI take my adhd-medication Modiodal [modafinil] 100mg.",
  "15:00\tNow I am trying to sleep again, being pissed off so taking 2mg xanax, 20mg valium and 15mg zolpidem. but alas no sleep. I realized I should not have taken the Modiodal which actualy now is waking me up. \t",
  "20:00\tI spend the rest of the evening playing online game and beeing buzzed",
  "\ton valium coffee and xanax, and wondering if a lower dosage of MDPV",
  "\tyields lower duration than 18 hours.",
  "------------------------------------------------------------------------------",
  "SUMMARY OF MY PERSONAL TRIAL",
  "Positives: \tvery slow comedown",
  "\t\tno redosing-urge",
  "\t\tno euphoria",
  "\t\tmellow stimulation",
  "\t\tnone to minor pupil dilation depending on dosage.",
  "Negatives: \tjaw-tension",
  "\t\twiggling lizards tounge",
  "\t\tanorectic",
  "\t\tdouble vision on high dosage/going long time",
  "Neutral:   \tKept me awake for extremely long time.",
  "\t\tHad many different long plateaus of varying effects",
  "duration:  \t18 hours total including ultra slow comedown.",
  "Combination: \t10mg Lexapro (SSRI)",
  "Tolerance-build: To find out",
  "------------------------------------------------------------------------------",
  "POSSIBLE USES I THOUGHT OF AFTER FIRST TRIAL",
  "Medicational uses:",
  "* If taken in early morning in low dosage could potentialy be trialed for surrogate adhd-medication for emergency or very occasional energizer.",
  "* I strongly would disagree trying to take this DAILY as surrogate adhd-medication or energizer because finding a correct dosing that doesn't build tolerance I suspect would be very troublesome and also given the generally accepted FIENDISHNESS which I however did not experience. Not to mention reaching a steady state with eye-balling or even a scale with 1-2mg diff would be impossible.",
  "Best usages in my opinion:",
  "* I strongly would like try a whole day at a carnival, hanging out with friends talking philosophical or rubbish topics would be proper, festival, or just relaxing a sunny day in the park would be nice.",
  "* A creative tool for a fine day of painting or writing or whatever artform. The plateaus of different effects make it both a peculiar and entertaining unreliable source for varying unexpectedness in creative outbursts! AND DO NOT BRING A BAG TO AVOID REDOSING."
 ],
 "erowid": {
  "id": "80003",
  "citation": " Calahan. \"9,10, Never Sleep Again: experience with MDPV & Escitalopram (ID 80003)\". Erowid.org. Aug 1, 2009. erowid.org/exp/80003",
  "substance": "MDPV & Escitalopram",
  "views": "22031"
 }
}
