{
 "id": 20126,
 "title": "Empathy Booster",
 "date": {
  "submission": "2000-11-04T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Rhi",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "360 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  }
 ],
 "report": [
  "Well, I had always been interested in trying DXM, but the idea of drinking cough syrup or swallowing 10 Drixoral horse-pill liquicaps (which are no longer available in my city) repulsed me.  So when a friend of mine found a place online to order DXM-HBr in pure powder form, I decided to be one of the guinea pigs for him.  Since I'm the one in our clique who analyzes her trips so much she hardly feels them, I figured I'd share our experience.",
  "He packed 360 mg of DXM-HBr into a gelcap used for herbal preparations (garlic pills, etc) and poked two holes in the gelcap for faster absorption.  (The fewer holes, the greater amount of average DXO in blood compared to DXM, more of a stoned effect -- this worked pretty well.)  After I had a few tokes off my host's new pipe from Amsterdam, a 125 lb friend and I each swallowed one pill and sat down to watch a movie.",
  "I noticed a gradual sedative effect about an hour into the movie, but my friend started getting dizzy and uncommunicative, then headed off into the bathroom and hurled.  (I think this is because of the powder hitting the stomach and causing irritation, or perhaps motion-sickness type nausea.  Cold rags on back of neck and forehead helped immensely, and I kept mine the whole night.)  After she emptied her stomach, she felt much better, and my host came back from his various errands and decided to Tuss and join us.",
  "By this time I was heavily stoned, no nausea yet, but that could have been the pot helping things along.  Host started some techno on his awesome sound system, adjusted the lighting to a more rave-like atmosphere, and we sat around entertaining my friend by tracing ice cubes on her arms during hot flashes and spinning her around in a bowl-like chair after her nausea abated.  When she had enough of the motion stimulus and became more introspective (I'd say she hit third, or at least had a good transitional experience), we moved to the 'too many drugs' corner of our host's living room and continued to entertain ourselves playing with black-light toys.  When the giddiness settled down, I held my friend's hand and took her on a guided meditation, where she had heavy closed-eye visuals and had a truly neat experience. ",
  "By then, however, I finally started feeling the nausea (about when the marijuana would have been working its way out of my system) and spent about 30 minutes in the restroom.  When I came back, I was in a very heavily stoned state.  Movement sounded awful, and I felt practically glued to whatever soft object I was laying on.  My friend was coming out of the somatoseness a bit by now.  However, when I stood, I did feel the 'bouncy' effects of walking.  I wasn't brave enough to go for the bowl chair spinning, but my friend and I did spin our host around in it for awhile.  Right over left, right over left, we both kept repeating to make the repetitive motion doable.  My arms felt near numb, but when I felt more heaviness in them than usual I stopped, remembering the warning about too heavy of exercise.",
  "My friend and I migrated back to the soft corner, held hands, and began talking.  Now, I have not had experience with telepathy, so I can't really call it that... but we were definately in the same mindset.  At first we felt uncomfortable with using words, because they weren't always the right ones for what we meant... but once I detached myself from language and concentrated on expressing my thoughts, the words didn't matter because we both understood each other perfectly.  Also, if we didn't speak, it felt like we were, because when a 'visual' would pop up in my head, she would generally say what the visual was, and she described the same phenomenon with me.  We couldn't use words to describe the thought-images, but the few we could find mirrored each other.",
  "At about hour four, it finally dawned on me that there were other people in the apartment (or, at least, I had been aware but so engrossed in conversation with my friend it didn't matter) and I got up and greeted everyone, said 'When I'm sober I'll talk to you guys', and hugged everyone, then went back to bean bag chair.  Watching the people was interesting, trying to understand and analyze their behaviors. ",
  "At around hour 5, the host and everyone left the apartment for a walk to the convenience store up the street.  I still wasn't into movement, so I stayed home and watched the place.  While my host was gone, guests dropped by, and I felt unable to interact wtih them on a really meaningful level.  I opened the door a crack, said ''s taking a walk, hang on', called him on the cell phone, said 'You have guests', and handed them the cordless through the door to gain permission to come in, since I only recognized one of the people. ",
  "When hosts permission was secured, i invited them in, said I had taken 'medicine' and was 'asleep', and apolgized for not interacting, then laid down on the couch and people-watched.  Group dynamics when you don't know the people involved are interesting.  I heard them mention common names, and was sure that they were talking about friends of mine named that.  When they talked enough for me to know they were cool, told them what the medicine was and they understood perfectly my situation, and I felt more at ease. When host returned, my trip was pretty much over, but I hold on to effects for as long as I can :) ",
  "It was a good night.  I think I hit about 2nd plateau, and I think next time I might try 480 instead of 360 to reach third, since I weigh a bit more than the average.  Small-group dynamics were much more interesting than large-group ones to me -- this isn't something I'd do at a rave, but my host's apartment was perfect.  My verbal inhibitions were loosened, I probably could have told about anything and not hurt too much, but I was a bit self-consious about having this heart-to-heart with 5 people listening in later.  I was aware of them, but in a very perephrial way -- they did not matter, I was comminicating and enjoying it.  :)",
  "Trip toys I'd recommend:  cold washcloths, ice cubes, bean-bag chairs, large soft area for somersaults or gymnastics, and good friends.",
  "Things I'd avoid:  bad drug interactions (I'm starting Serzone treatment so I was being very careful), phones, pagers, contact with people who don't know you're tripping.  Pot seemed to work very well with it, I might have smoked more during the trip but didn't feel the need for it.",
  "Enjoy yourselves, and be safe!  Read the FAQ before dosing!  Don't do this unless you're prepared for a fairly heavy trip -- 2nd plateau was very intense for me, and it didn't sound like it would be from the descriptions. Don't get cheap shit from bad dealers, know your source or tolerate the syrup!  okay, nuff preaching, peace."
 ],
 "erowid": {
  "id": "800",
  "citation": " Rhi. \"Empathy Booster: experience with DXM & Cannabis (ID 800)\". Erowid.org. Nov 4, 2000. erowid.org/exp/800",
  "substance": "DXM & Cannabis",
  "views": "9052"
 }
}
