{
 "id": 20143,
 "title": "I'm Convinced It's a Dream Herb",
 "date": {
  "submission": "2009-08-01T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "CB",
  "gender": "Male",
  "weight": "45 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 leaf",
   "administration": "smoked",
   "substance": "Coleus",
   "form": "(fresh)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": " T+ 0:30",
   "amount": "2 leaves",
   "administration": "sublingual",
   "substance": "Coleus",
   "form": "(fresh)"
  },
  {
   "time": " T+ 1:00",
   "amount": " leaves",
   "administration": "oral",
   "substance": "Coleus",
   "form": ""
  },
  {
   "time": " T+ 1:30",
   "amount": "2 leaves",
   "administration": "oral",
   "substance": "Coleus",
   "form": ""
  }
 ],
 "report": [
  "I first heard about Coleus while searching for an alternative to Salvia divinorum as it is illegal in my country.",
  "I had recently downloaded some Coleus experiences to my PDA to read while I was watching TV. I had been waiting for a Calea zachatechi order I placed a few weeks ago so  when I read that some people had dream experiences after using Coleus I decided tonight I would give it a try. I had my Coleus blumei plant for approx 1yr growing inside near a window that receives the morning sun. My plant doesn't have huge leaves or much color due to it not receiving much light.",
  "T:0:00 - First I picked off a leaf approx 1 inch x 1/2 inch and wrapped it around a cigarette and smoked it wet this actually worked really well for smoking wet leaf and I experienced a small amount of euphoria and slightly brighter colors while watching TV.",
  "T:0:30 - I decided I would ingest some leaves to see if I could have a stronger experience so I picked off two leaves of the same size and rolled them up and held them under my tongue for approx 15mins and then placed them on my table.",
  "T:1:00 - Not much difference besides a small stomach ache, euphoria and brighter colors while watching TV so I decided to swallow the leaves I had placed on my table.",
  "T:1:30 - The effects were much the same so I got two bigger leaves this time approx 2inch x 1inch rolled them up and held them in my mouth for a while then chewed them up and swallowed them. I would describe the taste when I chewed the leaves as tasting like raw mushrooms the kind you buy at the supermarket only stronger in taste. Not bitter at all, I have no idea why people say it tastes bitter.",
  "T:2:00 - I felt like some of the leaf had stuck to my throat so I ate some chips to try and 'wash' it down. Almost immediately after eating the small stomach ache I had dissappeared. At this point I would describe the effects as euphoria, brighter, sharper/clearer vision and a sense of well-being very similar to codeine.",
  "T:2:30 - I decided I would go to bed and see if any dream experiences could be had. I went to the toilet and whilst there I found myself staring at the woodgrain on the door, it seemed interesting for some reason. I fell asleep very easy.",
  "T:?:?? - I had a dream that I was walking barefoot in the snow and I woke up and realised my feet were cold because they were not under my blanket. I covered my feet back up and fell back to sleep immediately.",
  "T:?:?? - I had another dream where I told a family member something I did not want them to know. I remember thinking why did I do that but then I realised this is just a dream it doesnt matter and I woke up. I was at the house where I grew up and no longer live. I remember thinking I can't be here then I realised I hadn't woken up I was still dreaming and at that moment I woke up for real.",
  "T:10:00 - No more dreams for the rest of the night (that I remember) and I awoke at my usual time feeling quite happy for the rest of the day.",
  "Conclusion: I never have/remember any dreams so I'm convinced Coleus blumei is a 'Dream Herb'. This was a small dose in my opinion as the leaves I used were small. I will definitely be trying this again with a higher dose/bigger leaves from my plant I have outdoors."
 ],
 "erowid": {
  "id": "80134",
  "citation": " CB. \"I'm Convinced It's a Dream Herb: experience with Coleus & Tobacco - Cigarettes (ID 80134)\". Erowid.org. Aug 1, 2009. erowid.org/exp/80134",
  "substance": "Coleus & Tobacco - Cigarettes",
  "views": "37513"
 }
}
