{
 "title": "Revelations of Family and Childhood",
 "author": "Volase",
 "citation": " Volase. \"Revelations of Family and Childhood: experience with DXM (polistirex) (ID 20155)\". Erowid.org. Jun 10, 2003. erowid.org/exp/20155",
 "substance": "DXM (polistirex)",
 "bodyweight": "120 lb",
 "report": "<p>I have tried DXM a couple of times before this and had enjoyed.  The worst part of my trip was the first two hours of nauseau.  Then I came apon a cheap bottle of cough syrup named Deslym.  I had planned the trip a month ahead of time to make sure I didn't have a bad trip.  I had music ready and the time was right.  I drank the first two ounces of the liquid that actually tasted pretty good. I drank another shot and left the rest for a supplement later if I felt I needed it.  I had a few books of art in hand(Degas and other impressionistic artists) because I find it invigorating to the senses when you are tripping.  I kept a log of the whole expierence.  I injested at ten pm and meditated while listening to Karesh. After twenty minutes of doing that I began to read.</p><p>11:00 Slight feeling of dizziness DXM produces. Steady climb up Bouncy.  Thoughts are flowing poeticly and an deep understanding of music. </p><p>11:30 Steady ride up.  I am attatching emotions to everything.  Music, color, wholism.  Definite chang in consious. Everything is moving slowly.  Body high pleasant, feeling unporportional.  Amazingly enough no nasea.</p><p>12:00 Dissasociation starting, fighting slee.  CEV's a running rampid.  General robo feel. </p><p>At this point I was still at the first plateau moving to the second I kept saying to msyelf what great transitions.  My brother had come in my room not ten minutes later.  He does this from time to time so it was no surprise.  I didn't want to tell hi I was on anything.  All his words were juumbled and I couldn't make sense of anything.  I started to sense a wall or barrier between us.  Not a physical wall but and emotional wall.  It had seemed as though it has always been there and this prevented us from having a true relationship.  Finally he left.  What is to learn about this wall?  How can I change it?</p><p>12:30 As humans we learn to expect things.  When we trip the unexpected happens and yet I feel as though there is structure and flow.  I can still wite for how long I wonder.  CEV's storng and open eye is still frame. 15-16 BPM</p><p>I was still thinking about my brother.  How can I beco e closer to him.  In order to answer this I had to pull childhood memories of that have gone forgotten for many years.  I see us in a mountian house (we used to live there) and we are all each other had. No friends to come out to play with us nothing except ourselves. He torchered my as all brothers do but we were always really close.  It wasn't till we moved when things began to change.  He got friends and kind of brushed me off for them. But there is something deeper than what I am seeing. what? WHAT?</p><p>1:30 making art with music and shadow only for me to enjoy.  Trips are egotistical and sselfish as well as peacefull and unifying.  Every brush stroke is a note in the choir. </p><p>The question is still there trying to remember what happend.  Suddenly a vision hit me. A 16 year old in our mountian home who used to come over once in a while. I see us playing hide and go seek.  Him and I are hiding behind a shed door. He kept telling me to pull down my pants but I didn't want to.  I ran inside to my mom and told her they were being mean to me.  I run back outside telling him what my mom said.  Yet he persists forcefully this time and my brother runs around the corner and sees what is happening.  He looks bewildered then runs away.  My mom comesout and sees what happening and sends him away.  I was always told he was trying to put a needle in me but now I know the truth.  How did this tie in with wall?  I began not to trust my brother unconsiously and this was strengthened by the betrayal I felt when we moved.  I put a barrier around myself emotionally to sheild any pain that ay come.  The only way I could solve the problem is to shatter this wall.</p><p>2:30 Chaos is a substantial part of my life.  Random thoughts flow through my head.  I feel relieved.  I have been questioning everything and have come to the conclusion that there isn't just seven basic questions as Leary thought but trillions of riddles to unravel.  INSANITY.  I could see music for a while but I am mentally exhuasted.  Self realisation process. </p><p>At this point I fell asleep.  I had broke the emotional barrier that one had taken place between me and my brother. I have strengthen my relationship with him 2 fold.  I felt as though it was an awakening.  I enjoy the polistirex formula far more than the normal because of it's smooth transitions and no nasea.</p>",
 "year": "2002",
 "id": "20155",
 "gender": "Male",
 "timestamp": "2003-06-10T07:00:00.000Z",
 "views": "25294",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "650 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
