{
 "id": 20151,
 "title": "Damage by Disociatives",
 "date": {
  "submission": "2000-08-04T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Moonfaerie3",
  "weight": "127 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Ketamine",
   "form": ""
  }
 ],
 "report": [
  "<p>After relatively frequent use of DXM mainly Coricidin HBP and prescription of unknown dosage (but suspected high) plus the use of Ketamine, I have experienced either hypochondria or the startings of hopefully short term brain damage.  I have not been using these drugs long, only this year, but I have experienced some minor diffrences, mainly visual and in my thought patterns.  I have generally decreased emotions, especially after tripping.",
  "For a long time after the expected down time, i will be completely void of emotion: no pain, no sorrow, no excitement.  It's not lethargic, but it's complete calmness, without any motivation to do anything that isn't absolutely necessary... it's somewhat like taking in the entire world without being overwhelmed, extreme mellowness without worry or paranoia. peaceful emptiness. Visually, I'm pretty messed up.  I see tracers on neon lights, exit signs, and especially digital numbers. I have real trouble placing things in chronological order (my own experiences) and so I've decided to quit.... again.",
  "The drug started to get weird on me, i 'burned out'  My last hard trip was in a hotel room with one of my best friends.  She passed out and I proceeded to wig out and become the most paranoid, scared and LONELY i have ever been.  I cannot even begin to describe how lonely i was, not to mention bawling my eyes out because of my mother (there was NOTHING wrong with her) and the inability to understand why my friend would not open her eyes... needless to say it was a horrible time.  Not to say others haven't been fun, and i've even used since then, but I've decided to quit. I'm frying my brain.</p>"
 ],
 "erowid": {
  "id": "802",
  "citation": " Moonfaerie3. \"Damage by Disociatives: experience with DXM & Ketamine (ID 802)\". Erowid.org. Aug 4, 2000. erowid.org/exp/802",
  "substance": "DXM & Ketamine",
  "views": "31076"
 }
}
