{
 "id": 20159,
 "title": "Turning The Wine Glass",
 "date": {
  "submission": "2003-12-19T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "undertowed",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "It was two nights ago, having been awake for over thirty hours, very depressed, kicked out of my parents home earlier that day and desperately needing something to keep me awake because I had no place to sleep, I decided to take two hits of LSD with Spider-Man on the blotter. For a long time now I've told myself I'd never trip again because of how depressed I've been and how badly my life was thrown off track by taking too much acid before, but the other night I threw everything down and said, Fuck it.",
  "11:55 (T + 00:00): I felt the body effects almost minutes after I let the blotters soak under my tongue and by 12:25 (T + 00:30) I was just inches off the ground. Watched Blade with two other guys, one also tripping and one falling asleep  had huge smile on face, feeling like a vampire; feeling like I was the night-life here to suck the blood out of the day. After a while me and my tripper companion P took off to two friends parent's house. In the car ride (with a sober driver) I was having the most intense closed-eye visuals ever, most likely from the lack of sleep on top of the drug. I was seeing a star-burst of five slithering, flowing, snakes, all having a spiral of flames circling around them in the most sharp, vivid colors of blue, green, yellow and red. They were pulling me up and giving me fuel and energy.",
  "Out of the car to the most beautiful house I've ever seen. It was in the country, in the back yard D, A and another were sitting next to a glowing fire-pit sipping drinks next to an in-ground pool with many lights on the side and a horse-house with two horses way out back. I gazed into the glowing coals of the fire and saw the most stunning and breathtaking hues of flame-blue. Drank a few margaritas and stared at the empty wine-glass. Nothing but a drop of the drink and a little bit of salt in the glass I began to turn the glass. I noticed how the water carried the salt and dropped it. I started to make random droppings of salt all along the inside of the glass in a slow spiraling pattern, realizing that I was creating stars . . . creating universes and that all we are just people, spinning around the salt that is residue from somebody who is just spinning the glass.",
  "In the bathroom I stared into the mirror . . . I saw somebody whom I didn't even know, I saw his flesh rot off and decompose and then he began to re-evolve right before my eyes. The weird noises that the toilet made was definitely setting the mood of the situation  kind of a Nine Inch Nails-type thing. I was shaking profusely from the fatigue and the drug and I finally closed my eyes and stepped away.",
  "After spending quite some time writing, staring at the stars and night clouds, thinking of my ex-girlfriend and how badly I was addicted to her, unable to pull myself away from her image, from the emotion she makes boil up inside of me. I slowly sank back into reality, realized I was in a place I haven't been before and didn't know where (in the city) it was. I asked for a ride to my parents house so I could go back home.",
  "4:30 am (T + 5:35): I arrived home, broke in and went up to my bedroom to write a letter to my ex-girlfriend of two months who I was involved with for four years, very depressed, still tripping very hard from my second peak, I wrote, feeling that she was the essence of my life, that I would either die or commit suicide without her and that she was the only thing that I could spend my life with.",
  "Staring at my ceiling fan with the light turned on I had the most astounding open eye visuals. I've never really had consistent full-frontal open eye visuals from LSD before and this was about my 17th time tripping. I saw that familiar 5 pointed burst but this time I was seeing patterns of words running down the points... I made out grace, hope, future, then I saw my name, changing into lightning bolts, veins, cartoon-faces and shapes, all in the most intense and clarifying colors I've ever witnessed with my eyes open; crying the whole time.",
  "I thought at the time I wasnt really on the drug because it was 6:00 am (T+7:05) and my trips are always relatively short. I thought it was something that I could see all the time, just never really noticed it  very weird. After I came down I had the note I wrote to my ex and I vowed not to rest till I read it to her on the phone. I went down stairs, talked to my mother about the being out of the house, talked about my ex, my loneliness, my hope-less future, my dead-end job and pretty much how I suck.",
  "Trip end.",
  "Im not going to get into the personal aspect of my day outside of the trip, but I still wonder if I had a bad trip. The first half of it I was loving it... and I was happier than I can explain, but the second half of it I was in anguish... but I still loved it because it was how I was supposed to feel under the circumstances of my life. Either way the entire experience was very productive, I got a lot of emotion out.",
  "The funny thing about depression with LSD is that my problems seem 1,000 times what they really are. They become the possible end of life unless I can find a solution to them, I guess this is a good thing though because it pushes me hard to find a solution. I know now though, I cant say Ill never take acid again, but I can say I wont take it till my life is together. Sorry for the length, it was a very long night.",
  "I am love, I am hate, I'm a mortal without fate. - Maynard James Keenan"
 ],
 "erowid": {
  "id": "8024",
  "citation": " undertowed. \"Turning The Wine Glass: experience with LSD (ID 8024)\". Erowid.org. Dec 19, 2003. erowid.org/exp/8024",
  "substance": "LSD",
  "views": "11059"
 }
}
