{
 "title": "My Discoveries with This Plant",
 "author": "Soup",
 "citation": " Soup. \"My Discoveries with This Plant: experience with Salvia officinalis (ID 20156)\". Erowid.org. Dec 22, 2008. erowid.org/exp/20156",
 "substance": "Salvia officinalis",
 "bodyweight": "135 lb",
 "header": [
  "DOSE: T+ 0:00",
  "2 bowls",
  "smoked",
  "Salvia officinalis",
  " T+ 0:10",
  "2 bowls",
  "smoked",
  "Salvia officinalis"
 ],
 "report": "<p>It was a bright, sunny day in October when I decided to go to my friend's house to hangout. He asked me if I had ever heard of smoking sage. I asked him what the shit was, because I had not the slightest idea. He said that earlier that day his Grandpa was over, and his mom was showing him their garden. When they were looking at it his Granpa pointed to a plant,(Common Sage), and said 'see that plant, the Indians used to smoke that in their peace pipes'. My friend said that instantly he thought we should smoke some today to try it. After hearing this story I too got very interested in the idea of smokeing some. So we picked about 4 nice sized leaves and went down to my 'spot' around 2:00pm.</p><p>We stuffed a bowl full of the stuff, and started smoking it around 2:05pm. After we finish a bowl I started feeling real relaxed, like the threshold of opium smokeing. After about 5 minutes, or at 2:10 we smoked another bowl of sage. It was about 2:10, and at this point I felt exceedingly relaxed, and sort of hi. So at 2:20 we smoked two more bowls. After that around 2:35 I felt like I had just smoked a bowl of opium with some weed. Thats how good i felt. We noted that our eyes were blood-shot, but not sagging like with weed. These feelings of well-being, and relaxation ended around 3:00pm. There were no real after effects.</p><p>In someways I like it more than cheap weed. I think I will have to smoke this again in the near future.</p>",
 "year": "2002",
 "id": "20156",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-12-22T08:00:00.000Z",
 "views": "20514",
 "dose": {}
}
