{
 "id": 20166,
 "title": "Seizure and Hospitalization",
 "date": {
  "submission": "2010-10-14T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Haythizzle",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "It was a Sunday night, the end to a rather uneventful weekend. I was staying over at a friends house and we were bored out of our minds. At one point, my friends (they were brothers) came up with the idea of stealing some Benadryl and taking a shit ton of it. Since at this time in my life I didnt give much of a shit about school, I decided, why the hell not? So we went to the store and made off with a bottle of Benadryl. We got back to my friends house and waited for their parents to go to bed. Once they had, each of my friends took around sixteen pills, which were 25 mgs apiece, adding up to 400 mg. I had never taken Benadryl to trip before, so I started out with only five. About ten minutes later, I decided to pop five taking me to a total of 250 mg.",
  "About twenty minutes later I decided that it wasnt worth it to try and stay awake anymore and so I bid ado to my slightly hallucinating friends and crawled into my bed on the living room floor. I was woken up by my one of my friends whispering about the bugs in his bed. I sat up to comfort him that he was merely hallucinating. This is when I got the feeling that something may be wrong. I was incredibly disoriented, my brain taking several seconds to register and put a name to my surroundings. I was hallucinating like no other. Extreme spacial and size distortions, objects shifting and turning into morphed blobs of color. Shadows of people and animals were darting around the room.  I had extreme tunnel vision and could hardly keep my eyes open. I rubbed my arms and legs, realizing with absolute terror that my skin was completely numb.",
  "I turned to my afro-endowed friend (his brother was asleep) to try and talk some sense into him because there was no way I could get back to sleep with him literally jumping every few seconds from thinking he was being bit by wasps and spiders and beetles. He asked me to help him inspect his blanket for bugs, a task I soon learned I was no good for. The folds and bumps of his blanket were a forest that was impossible to navigate and I myself could see the wingless wasps and spiders he was talking about. I knew that these were hallucinations so I kept this fact to myself to keep from scaring my friend. Once he was reassured, I lay back down and almost instantly drifted back into sleep.",
  "My memory stops at this point. I was told by my friend who saw the bugs what happened next. He had gone to the computer, too scared of insects to sleep. Apparently, I woke up and began reading a book that I had begun earlier that day. I then turned towards my friend and said, oh yeah, and then my arms locked straight out in front of me. I began to seize, falling into my other friend and waking him up. My seizure had all the typical symptoms of a tonic-clonic/grand mal seizure. My eyes rolled back, I was spitting up God knows what, and my limbs were completely locked beyond my own strength.  My friends ran to their parents bedroom (still tripping balls, mind you) and woke them screaming about me having a seizure. They called 911 and drove to my house to get my dad.",
  "My memory, although hazy, returns now. I remember being on a stretcher and being loaded into an ambulance. Paramedics were informing that I had a seizure and was being taken to the hospital. Even though I was at least half-conscious, I was still hitting paramedics and repeating the word no over and over. Once I arrived in the E.R., I came to. I was incredibly depressed and angry about the silly mistake I had made.  The doctor attending me was definitely frustrated about having to deal with me and I didnt blame him. I had a CAT scan taken to check for epilepsy, which came up negative. The doctor explained that I was hypersensitive to Benadryls sleep-aid, diphenhydramine. It had thickened my blood and that that was why I had an I.V. in the side of my wrist. The I.V. contained a blood thinner. After a few hours of observation, I was sent home."
 ],
 "erowid": {
  "id": "80293",
  "citation": " Haythizzle. \"Seizure and Hospitalization: experience with Diphenhydramine (Benadryl) (ID 80293)\". Erowid.org. Oct 14, 2010. erowid.org/exp/80293",
  "substance": "Diphenhydramine (Benadryl)",
  "views": "10742"
 }
}
