{
 "id": 20163,
 "title": "Om Om And Nothing",
 "date": {
  "submission": "2004-04-22T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nuclearbloom",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5.5",
    "unit": "g"
   },
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "Last night, this morning,  most beautiful cleansing roller-coaster of horrible existential confusion and then complete hilarious ecstasy........5.5 grams of mushrooms dosed at 11pm.......within half an hour I cant even see......within an eternity the patterns and tangles of the universe of skull (mine, All) writhe and dance, torturing me, exploding and spinning in floral insane connundrum.  Visionary voices and faces twist me from side to side as the struggle to crawl up the kundalinic frame is burned up and blown away in the wind of the dance party of Mind.",
  "Petrified naive visionary creeping up to finally allow himself to hear the scream of the suppose banshee with ears minus filters of hollow culture and locking mechanisms.  LISTEN is ALL, there is no message but the speaking,  the telling of a tale older and younger than any poem........listen to the howling of the wolf,  the expansion of the trees,  listen,  to the humming bliss that soaks itself, pure energy melting into itself, white night.",
  "but this clinging, this fire once more, this race towards stillness, screaming for silence, this non-existant sufferer, battered pissing horseboy filled of fear and desperation... says",
  "'The universe is a synchronicity is constant proof of itself...'",
  "(...insert hours of seeking despairing agony...)",
  "3:12 am.  Whats this?  No more bianary toxic shock?  No more need to continue pushing and pulling myself?  No more rocking back and forth, on and off into angry infinity?  No more fear,  simply GIVING UP. (YOU CANNOT DO ANYTHING",
  "Holy mary mother of the wondering lord of light beside my bed im laughing to the cosmic tune of infancy and mortification,  chortling with all the self-imposed demons ive spun webs through these minds and years with.........its all ok,  this is all me and nothing,  just kickin it, relaxin maxing my cool n shit.   This is the vibe.  This is virtue, wu-wei,  abscence of motive, smiling and drumming on my chest and howling with tears of joy and fruition.  I know ill rot once again, and cringe with the horrendous overwhelming joy of the viney beast of existance,  what a wonderful charade,  this game, I love it.  The meandering woes and heartfelt self-contradictions, all this backstabing furious fire-world......the cool breeze of the 5 am moon and the rising sun and I am standing in shimmering awe,  nothing held back,  nothing kept hidden.......the sky and the tree and my dwarven knobby hand.   This is the realm of fantasy come true, This is the New Day.",
  "So many insights, so much timeless wisdom.  First in pain over these serpents which make for turbulent tangles,  but then knowing its ok.  I blast at the world, its art really, and fade away, not caring for a single moment.  This is the passion of non-passion.  Its LEAPING GLEAMING  LOVE.",
  "OM-CHICKOW"
 ],
 "erowid": {
  "id": "8028",
  "citation": " Nuclearbloom. \"Om Om And Nothing: experience with Mushrooms (ID 8028)\". Erowid.org. Apr 22, 2004. erowid.org/exp/8028",
  "substance": "Mushrooms",
  "views": "5732"
 }
}
