{
 "title": "First Time MDA",
 "author": "Anonymous",
 "citation": " Anonymous. \"First Time MDA: experience with MDA (ID 2016)\". Erowid.org. Jun 21, 2000. erowid.org/exp/2016",
 "substance": "MDA",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2.5 tablets",
   "oral",
   "MDA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>This weekend, I tried MDA for the first time (that's what they were sold as, from a known supplier). Actually, it was a first-time experience with xtc-like drugs for most of us. There was one person who had taken xtc-like drugs before, but he had not tried this particular one yet, so for all of us it was completely new. The person who had some experience had bought the pills. They sold as MDA-[insert cool sounding name], and we didn't have any information on the doses, except 'that it would probably last long'.</p><p>I started with one pill of the stuff, a little scared and very curious of the effects it would have on me. I had heard and read many things on MDMA and derivatives, but still didn't really know what to expect (at least that's what I thought). After an hour we still didn't notice any effects, and we were a bit afraid that we were being srewed, and that we had trown away our money.</p><p>However, after about two hours, we started to notice the effects it was beginning to have on us. I immediately recognized them as the same I had read about (mostly in http://www.hyperreal.com/drugs/, great site :-). I had lots of energy, and since we had music on (hardcore...) we started to dance (hey, you have to do something, else it's a waste of the energy). While we kept dancing, we already had some very nice conversations. I actually didn't know one of the persons that were with us else then by name. The next day I considered him as a very good friend.</p><p>After a while (could be hours, I really don't know), we went for a walk outside. There the real talking started. When we got home again, and had all installed us comfortably, the talk started to get really personal. After having talked there for an hour, the word 'psychotherapy' really got a meaning for me.</p><p>I won't dwell on the rest of the night, except for that all of us had a fantastic experience, and learned a lot from each other and ourselfs. It was just wonderfull.</p><p>The next day (we didn't have any sleep, that was impossible), the psychic effects lasted till about 11 (12:30 hours since we had taken the pills, or, first pills). The physical effect of having lots of energy turned out to last till way into the next night, which wasn't really unpleasant, but it was annoying. Halfway the day we came to the conclusion that we had probably taken to much of the stuff. I really didn't mean to take more than one pill, but it was so easy to break that rule. In total I had 2 1/2 pills, spread out between 22:20 and 6:00. One other person had 2 pills, and the one who bought the stuff took 4. He talked to us about taking more, and we all said no, and he seemed to agree, but he did it anyway.</p><p>Now comes the 'funny' part. The next evening, we all started to have new physical and psychological effects. We came to the conclusion that the extra pills we took had staid in our stomachs, cos we knew that the digestion-process was stopped to save energy (or something like that). We never thought about the fact that that would also prevent the extra pills to be taken into our blood.</p><p>Now I slept for about 6 hours in 48 hours, and I feel great. I know it can't be healthy to my body, and I will certainly take more care next time I use (and I will use again, you can be sure of that). I don't think more than one pill of this stuff is nessecary to have a full night of feeling-good (also good for my savings), so I'll try to keep it at one next time.</p><p>Has anybody had similar effects as I had, wrt the 'storage' of pills in the stomach (or somewhere else there in the body), and start working more then 12 hours after taking them? Is this a normal property of xtc-like drugs (or MDA in particular)?</p>",
 "year": "1994",
 "id": "2016",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-21T07:00:00.000Z",
 "views": "50322"
}
