{
 "title": "Soberness is Bliss",
 "author": "Josh",
 "citation": " Josh. \"Soberness is Bliss: experience with AMT (ID 20178)\". Erowid.org. Dec 22, 2003. erowid.org/exp/20178",
 "substance": "AMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "45 mg",
   "oral",
   "AMT",
   "(capsule)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 1:30",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Today I write this, a changed person from 2 days ago, the day my mind was lost.  A usual gathering at my good friends house, me being on a empty stomach, and a slight stomach flu which I take into no consideration, we all sat watching the tube wondering what to do with the day, it being aproximately 3 p.m.  We think about getting shrooms, but that doesn't pull through.  Then an idea pops in my head of the drug AMT, which I had heard about recently and researched on the internet a bit, and everyone agrees.  My friend gets it, and it is about 5 p.m.  We get in a little circle, and each of us ingest a 40-50 mg capsule of AMT.  We then move on over to another friends house, where we arrive and smoke some bowls in her garage.  A smile on our faces, a good high we all feel, little did I know what I would turn into. </p><p>5:45- We arrive at my friend's house, which is the hangout for the night, after we were told to leave our last location.  A good place to be, we all expect to have an extreme night.  We sit, watch some television, eat some grub, not really feeling too weird yet, just a simple smile and good feeling. </p><p>6:30- We have another session, smoking a few bowls, wondering when I will start to feel this drug, I start to think it was a waste and was bunk.  90 minutes after taking it I felt nothing, but realized it can take extreme amounts to kick in, an average of 2 hours, I start to think about many things.</p><p>7:00-  Sitting in the circle, Floyd being played, we watch the laser screen saver on the computer, an amazing sight to be seen.  The music flows with the screen, each beat identical to the sound.  Amazed by the sight I stare for 5-10 minutes. I relocate to the upstairs where people are playing X-Box, while others gaze in amazement.</p><p>7:30-  'GET HIM! KILL HIM' Random shouts of my friends tripping, yelling at the person playing 007 Nightfire for Xbox.  A hilarious environment, everyone shouts and laughs having a good time. Little did I know this was the last bit of enjoyment I would basically feel for quite some time.</p><p>8:00-11:30-  This time range is set so large because at this moment is when I lost control.  Sitting, going from tripping to good, back to tripping and good again, I just don't know what to expect.  I start to feel a bit nauseated, and a headache/fever is noticable.  I drink tons of water for fear of overheating, and start to trip hard.  Everything is moving, nothing seems normal.  Colors are everywhere, I can't think straight.  Even when I have thoughts and have decision in my brain, 10 seconds later they are forgotten as if never there.  I am confused, unable to converse with anyone, as if I was braindead.  By this time my pupils were so huge you could see nothing but the black of the pupils.  My friends all tell me I didn't blink for hours, and honestly I believe them.  Im extremely tense, hands in fists I'm drenched in my own sweat, and people tell me to chill, calm down, whatever they could do to help.  I take everything the wrong way, a simple sentence is scattered in my brain, turning into a compltelely different meaning by the time I comprehend it. </p><p>'Why'd you call the police!' I yell at some people, after thinking I heard sirens out the door, thinking they were there for me.  Everyone else starts to fear for me, so I leave with 2 other friends for a short drive, the driver being sober, so we can cool off.  In all actuality, the moment I lost control of my mind I entered the point of no return, a horrible trip.  I think police are everywhere, that they are coming after me.  We arrive back at my friends, where everything is the same.</p><p>11:30-  'Take me home, I just want to go home' I scream, being in the state of mind where nothing could please me but this.  Everyone fears to take me home, I do look like I'm dying and 5 others are on the drug as well.  For 30 minutes I stand around in fear, confused on why nobody will take me home.  At this point I  honestly don't know where my brain was.  I can remember it all happening, but felt as if it weren't up to me, this was the worste feeling I've ever felt in my life.  I start blurting things out, 'I'm DONE! The drugs have won! I'm done, just take me home!'  Everyone scared, my good friend tries discussing with me what I shall explain to my parents.  This fails, for I have the mental capacity of a 4 year old at this point, and can't remember my own thoughts.  Finally after what it seems a night of hell, my good friend takes me home.</p><p>12:15-  I arrive in my house with my friend, and we come up to my brother and mom inside.  We all start talking, but I don't really have the ability to converse, so I sit and watch for awhile, still feeling helpless and somewhat drunk/numb.  My friend leaves, and i keep drinking tons of water the rest of the night.  Around 2:30 a.m. I attempt to enter my bed for some sleep, but don't realize that will be impossible untill about 10:00 a.m. when the sky is bright and I havn't slept a minute.  I did manage to grind my teeth bad enough that I wouldn't be able to chew anything hard the next couple days, as well exhaust my body and my pupils remaining huge.  Not untill about 5pm the next day would these pupils return to their normal size.</p><p>The long night of trying to sleep-  I lay, confused, still pretty fucked up.  I keep thinking: what have I done, will I ever go back to my normal state of mind,  how can I know I'm being crazy yet do nothing about it, I HAVE NO CONTROL OF MYSELF.  This fear of never being sober flows through me all night, even until the next day I feel fucked.  Now being 2 days later I finally feel soberness again, the bliss I never knew.</p><p>Outcome-  Many people like myself try drugs and do things to experiment with themselves, their lives, and their bodies.  I've always thought it was fun and recreational, that it enhances me spiritually and mentally.  I've been like this for awhile, wanting to test my body see what it was all like.  This AMT trip may sound horrible and yes, it was hell while it happened.  Now I know that the risk in drugs is a lot greater than I expected.  You see, I chose to take the pill, I chose to lose control of my mind and body, to not be able to make clear of a simple thought, I chose this.  Why would I choose to ever enter that again, even if it is a one in a Million chance.  Living is all I need now, maybe you should think about it again too.  Soberness is Bliss.</p>",
 "year": "2002",
 "id": "20178",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-22T08:00:00.000Z",
 "views": "13247"
}
