{
 "id": 2017,
 "title": "Withdrawal Symptoms",
 "date": {
  "submission": "2005-10-12T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Robin H.",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  }
 ],
 "report": [
  "I was given a 1-month prescription of Adderall XR upon taking a free sample/coupon for 21 capsules provided by my doctor.  When I started taking this medication for the first time, I noticed an *incredible* improvement in my ability to focus on my work, and attention to detail amplified significantly.  I typically drink cokes and/or coffee to help me get through the day.  However, for lack of a better expression, Adderall was like consuming turbo-charged coffee.  Adderall, a respiratory/cerebral stimulant agent (for the benefit to readers who do not know), is designed to target one or more areas of the brain responsible for cognitive thinking and reasoning 100%.  And to me, this is extremely important since I'm a programmer and technical writer by profession where every nuance to detail is essential in producing a quality product for our customer.",
  "Half-way through my 1-month supply, I began to notice that Adderall XR was seemingly losing it's 'magical' punch, thereby, prompting my stupidity in increasing my dose by 20 mg, or 3 capsules a day, without first consulting with my doctor (DO NOT DO THIS!!).  Being that this medication falls in the category/Schedule II list of controlled substances under DEA regulations in the US, I ran out of my medicine prematurely by 1.5 weeks.  Now, Let me talk to you about what happened between the time I ran out and before the refill:",
  "1. Adderall XR, which is an extended release formula of Adderall, ebbed out of my body over the course of 1.5 to 2 days.  During this time period, I still went to work, however I began to notice a decline in concentration, and my demeanor, or personality, became less than desirable.  Mood lability became an issue, yet I tried my best to remain upbeat and focused (or lack thereof).",
  "2. After Adderall XR completely metabolised and was out of my system, I experienced the worst case of depression of my life involving suicide ideation, an increased prevalence of uncontrolled crying, and I refused to get out of bed.  I missed a couple of days of work, and the symptoms prevailed through the weekend.  I'm fortunate to have an understanding and patient husband.",
  "3.  After 4 days of experiencing 'Hell' (I'm certain the real Hell is far worse), my psychological (and to some extent, biological), systems slowly returned to normal.  Nevertheless, I still felt a bit 'off'.  To compensate, I began taking Wellbutrin, 150mg. ",
  "Word to the wise.  Please, please PLEASE do NOT DOUBLE THE RECOMMENDED DOSE of your medication prescribed by your doctor, and this applies to ALL medications, not just controlled substances.  Doing so can lead to undesirable side-effects."
 ],
 "erowid": {
  "id": "16683",
  "citation": " Robin H.. \"Withdrawal Symptoms: experience with Amphetamines (Adderall XR) (ID 16683)\". Erowid.org. Oct 12, 2005. erowid.org/exp/16683",
  "substance": "Amphetamines (Adderall XR)",
  "views": "44846"
 }
}
