{
 "title": "Galangal (the Lost Mescaline)",
 "author": "Sir Shet",
 "citation": " Sir Shet. \"Galangal (the Lost Mescaline): experience with Galangal (extract) (ID 20213)\". Erowid.org. Jan 18, 2003. erowid.org/exp/20213",
 "substance": "Galangal (extract)",
 "bodyweight": "215 lb",
 "report": "<p>3oz. of galangal rhizoms were purchased for a local herb store. the dark red root bits were ground in a coffee grinder until powdered. the essential oils and other ethanol solluble products were removed via cold finger(tm) extraction device with ethanol as the solvant. the ethanol was evaporated from the resulting solution using a hot air based food dehydrator. the resulting residue had two distinct fractions (a clear dark red oilly liqued and a slightly cloudy more pitch-lik, light colored, sediment). with out discretion, this mixture was pilled up into ordinary gell caps for a total of 10.5 caps. (the .5 cap was mostly full of the dark liquid) 4.5 caps were then ingested orally in rapid succession with cold water as a chaser. </p><p>negative effects: grose, spicy burps (mild). slight intestinal iratation (mild-mod). dyharia the next 2 days (with very little apparent diggestion on the first day, i.e., GI flushing). residual effect after smoking pot as much as 24 hours later.</p><p>positive effects: Strong peak and slow build, clear head but clearly mind expandin (psychodelic), sense of humor and wit increased the next day (made every one i talked to laugh, not usual for me, i'm dark and quite mostly). not sleepy or amped</p><p>other effects: ringing in ears, mescaline like visuals, movement feels good.</p><p>I have not been able to find sh... on what is in this... the guy that made a smokable extract is one to something i thing, if his extraction went the way he said then this most be an alchiloid right? one sourse on pubmed (in chinese) said they found an MAOI in galangal root in '83. but there is no abstract. if anyone has more info on this fantastic plant and it's safety please post.</p>",
 "year": "2002",
 "id": "20213",
 "gender": "Male",
 "timestamp": "2003-01-18T08:00:00.000Z",
 "views": "37576",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Galangal",
   "form": "(extract)"
  }
 }
}
