{
 "title": "The Destroyer of Anxieties",
 "author": "Blazed",
 "citation": " Blazed. \"The Destroyer of Anxieties: experience with Clonazepam & Cannabis (ID 20227)\". Erowid.org. Feb 12, 2004. erowid.org/exp/20227",
 "substance": "Clonazepam & Cannabis",
 "bodyweight": "174 lb",
 "report": [
  "<p>I decided to take .25mg (half of a .5mg pill) of the clonazepam because Im not really sure what its going to do. The obvious effects shouldcome on in the form similar to that of Valium and Xanax (since theyre in the same family).  But Im almost positive that it wont feel the same since Xanax (alprazolam) feels different than Valium (diazepam).",
  "TOI: 9:36pm, didnt notice any taste",
  "9:40 My head is beginning to feel like its being squeezed ever so gently from the inside to the outside back to the inside.",
  "9:42 Fuck, this drug took on quick. Im not kidding. Maybe it just seems like its quicker and more powerful since Ive never taken it and dont have any tolerance for it.",
  "9:48 It feels like Im scared inside my chest. Its my heart. Its doing funny things. It feels like Im watching a horror movie, and my heart is jumping at the scary parts, which occur constantly.",
  "10:17 About 20min ago, I went outside to smoke a cig, and I noticed a few things: balance was more difficult to control (weak feeling in the knees not like walking was difficult, but more like I couldnt support the weight of my body), and I could still think like I usually do minus any feeling of anxiety.",
  "10:19 As of now, I feel great. A mind thats not infested with anxieties is a beautiful thing. This is how my mind should work on a normal basis; however, I had to be born and raised differently.",
  "10:25 Im listening to old songs that would under any other circumstances make me feel sad, rerunning past memories of loneliness through me. But this time its like Im clean from the mind maggots that eat away at me every fucking day.",
  "10:33 Im porcelain being, fragile to the touch. I dont want to communicate with others theyd just make me into themselves.",
  "I found that social psychology has a tremendous impact on me. The more Im outside, the more hurt I get (either my people not liking me, or by adapting myself to my social surroundings: ignoring some people and turning into others). The only time I feel safe is when Im alone. If I could help it, Id make it so that I was the only one in the universe. Its been proven that people need other people, but my explanation is that my dependency drive is the lowest on the hierarchy of all drives.",
  "10:37 I feel weak when I get up, but my mental functions are holding on strong. Its like Im more prepared for things. Its like I got what I need to take on the world (mentally). Physically, Id say Id need speed, but lets not be a total drug-head at this point.",
  "10:51 My current opinion of clonazepam is that its a good drug, and I will do it again starting now.",
  "TOI: as I swallowed, the clock struck 10:55",
  "Total peace of mind is something so incredibly special to me that I dont ever want to let it go. The problem is that I might learn helplessness. This would be a very serious problem. These types of drugs cause the breakdown of the psychological self.",
  "10:57 My mouth feels a little dry. Then again, I havent drunk water in a long time. Nevertheless, I know its the clonazepam.",
  "10:59 Hey, its almost 11. Where has time gone off to? What have I been doing? Damn.",
  "11:13 Lying down felt too good. I didnt want to get up for anything, but I have to go take a piss .",
  "The head feeling is still present, but it feels like I got used to it. Its as if the only thing happening was that all of my anxieties were squashed, I gained a new found power to deal with life (confidence in myself and my abilities), and I think Id melt away in the sheets if Id lie down again.",
  "12:38 This is a great drug.",
  "TOI: 12:44, .5mg this time",
  "12:48 The stronger head effects are coming back. This is good. This is what I enjoyed the last time.",
  "12:57 Although, it just seems to stop there what are these head effects? What is exactly happening inside of my brain? Clonazepam in larger doses should cause sleep so where is it? I wont complain. I feel good.",
  "1:17 Im feeling pretty good. And how about yourself? I wish I could go to sleep, but why would I want to wake up in hell?",
  "1:24 I think I pretty much said all I needed to say all thats going on right now is that Im experiencing heftier effects than before. As I look around, I seem to want to smoke a little weed to blast myself out of consciousness. This is what I do. This is me. Dont judge.",
  "TOS: 1:59, ahh",
  "2:13 The weed hit (I took 5 hits from my bowl). Im high fucking high, and its all without any paranoia, nor anxieties rattling my brain. I thought about a few things too it felt like this was a comparable high to that of Xanax w/ weed.",
  "2:18 Im getting dizzy too. Whoa, it fucking hit with power. Im falling backwards. Falling shit. Fuck. Fuck.",
  "I want this to end. I need to pass out.",
  "2:26 My head is ready to explode. I feel like I am done for good. Will I wake up half brain dead and half wasted?",
  "Shit, Im fucking wasted.",
  "2:49 I watched the Iceman and the Psychiatrist on HBO+W. That was a tremendous experience, and it made me think about how much psychology means to me. I need it to understand myself and to understand others (so that I could figure them out so I could live without any of my anxieties with them).",
  "3:12 Theres one thing I forgot to mention the weed sped my brain functions back up, allowing me to further stay conscious and report.",
  "3:25 I went out, smoked a cig and thought. I came to a hypothesis: Clonazepam is a different drug from Xanax, thats why these chemicals are prescribed to different people with different problems. However",
  "Xanax + weed (is just as enjoyable as) Klonopin + weed",
  "I thought about barbiturates and how theyre addictive. What they do is send you to a far off different world thats absent of anxieties, and some fears are generally reduced. After the addiction develops, the return off of the drugs is into hell (like I said when I thought about how Id feel later when I wake up). A person then doesnt know how to deal with all of whats going on inside themselves (their minds).",
  "This is a powerful high, and I could see how some people might fear it. Youre so fucked up and so far from reality, your head is spinning, dizziness kills, and the problems with the world leave your cranium.",
  "Its not like heroin where youre off in a dreamland of pleasure.",
  "Its not like weed where youre just high.",
  "Its not like cocaine where youre just numb and dumb to everything, while horny.",
  "And its not like speed where you figure out that youre capable of moving mountains.",
  "Its like youve stepped out of reality and entered a world of absolute tranquility.",
  "Nothing matters, and thats a huge problem.</p>"
 ],
 "year": "2003",
 "id": "20227",
 "gender": "Male",
 "views": "78544",
 "dose": [
  {
   "time": "0",
   "amount": "0.25 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:20",
   "amount": "0.25 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:10",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2004-02-12T08:00:00.000Z"
}
