{
 "id": 20228,
 "title": "Strong-scented But Next Time I'll Try Tea",
 "date": {
  "submission": "2009-08-21T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Samanthe",
  "gender": "Female",
  "weight": 55
 },
 "dose": [],
 "report": [
  "Intention: Experiment with mugwort to retrieve informative dream(s).",
  "Prepatory phase with the mugwort:",
  "I bought essential oil of mugwort and dried mugwort, either organic or wildcrafted, as is the standard for the local witch store where I get my herbs. I had decided to not take any tea internally tonight (recently had oral surgery and am on an antibiotic as well as antibiotic mouthwash and wasn't supposed to have anything in my mouth at bedtime, even water).",
  "In preparing an anointing oil, I got mugwort on the kitchen counter, and mopped it up with a paper towel and my hair. The kitchen and my hair reeked of the strong smell.",
  "I also made a small sachet but more for ceremonial purposes than 'dream pillow' practical purposes; I put in it mugwort, rose petals (for heart) and rosemary (for memory), with no oil. The oil in my hair was so strong I didn't want to augment it. The smell 'me montait  la tte': giving me a slightly spinny 'woo' feeling.",
  "I dotted on some anointing oil, turned out the light, and listened to the binaural beat CD Dreamcatcher (Metamusic) by Don Peyote and Naasko through earphones until I drifted off, rousing only to take off the earphones when the CD ended. I felt the CD made me relaxed and receptive to magic in dreamspace.",
  "Woke up naturally ~8.5 hrs later, refreshed.",
  "Dream recall very poor (which isn't unusual at this stage of my dreaming practice). The only snippet I could retrieve:",
  "I'm in a high-ceilinged glass-enclosed indoor pool area, where there are women swimming laps, split-lane style. I cross over the pool to a lane I might want to swim in. The person already in the lane is friendly, and yet perhaps suggests I check in with the other pool next door. I look through the glass wall and see a pool on the other side it that is larger and more free-form (no lap swimming).",
  "Conclusion: take mugwort internally for any future attempt."
 ],
 "erowid": {
  "id": "80750",
  "citation": " Samanthe. \"Strong-scented But Next Time I'll Try Tea: experience with Mugwort (ID 80750)\". Erowid.org. Aug 21, 2009. erowid.org/exp/80750",
  "substance": "Mugwort",
  "views": "13614"
 }
}
