{
 "id": 2023,
 "title": "The Circle of Thoughts Got More Profound",
 "date": {
  "submission": "2001-08-15T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Setebos",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.0",
    "quantity": "3.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "Yeah, I'm starting to think that wild shroom trip of late last year was the result of having an empty stomach.  A friend and I dosed in the car before going to a special goth night.  He ate ~3 grams, I eyeballed my dose so it could have been more.  Brown caps, blue and beige stems.",
  "About 20 minutes in I noticed some effects.  A gut-feeling, some excitement.  I joined my friend in the back -- he was feeling it too, but he wanted a cigarette.  I suggested we take a walk (read: he smoke it outside), but nothing doing.  The thought of tobacco smoke at that point was sickening me, so I walked to the front room.",
  "Basically, the peak lasted about 30 seconds -- I sat down in a less crowded/hot area of the club, I felt like I was reeling, and then my entire field of vision was overlaid with little lower-case S's -- a shuddering, intense hallucination.  I staggered to the bathroom, thinking I might (or might want to) vomit.",
  "I knelt down by the toilet, which, in a place like that, would normally make me puke anyway, but then my head cleared.  I stood up, realized that the peak was over, and went back to where I was sitting.  I no longer needed to take a walk outside or anything -- I couldn't talk much, but I could stare at people, which is half the point at this place anyway.  My point is, I usually don't notice a peak on shrooms.",
  "Later, the back room cleared out and fans ventilated it.  There was room to dance without contact, which was great considering how startling it was sometimes when someone touched me.  I danced and smiled like an idiot, realizing that everyone else was dancing goofier than me, and that, even if I cared, no one would pick me out as the one on drugs.  I had a nice friendly, not-even-that-disjointed conversation with the woman who sat down next to me.",
  "Mushrooms make me very excited about dancing if the music is right, without interfering with my sense of balance or rhythm (this from my purely subjective POV).  My sense of comfort increased to the point where I thought I was having the most fun ever -- I couldn't imagine not doing this all the damn time, both the gothing and the shrooms.",
  "My thoughts were very circular and repetitive -- which can be tedious to bad on LSD, but seemed fine in this context.  I thought about the sexual frustration that comes with only using alcohol at clubs.  I realized that without the futile expectation of nookie, I could have fun and still appreciate the people around me in terms of attractiveness, i.e., looking, not leering.",
  "The circle of thoughts got more profound -- I started thinking about happiness, and life in general, how the only way to be happy was to feel happy, and that this was completely under my control, how I felt.  I got a sense of satori, a feeling of enlightenment that comes from ending up in the same place you started.  Then I giggled at me thinking that I was being so deep.  Heh.",
  "I could preface this whole report with, 'Maybe it was just the drugs, but I had a great time!' but it could just as easily have been the case that, 'Maybe it was just the drugs, but that place was terrifying and sucked.'  The facts are, the drugs and the venue went well together.  The lights were turned down (they shut off the normally blinding light guns, that or made them a dim color), there was plenty of room to sit and dance, I was on the list and got in for free, and the staff and patrons I encountered were very friendly.  We stuck around 'til closing (I was also trying to get a cut on my finger to close -- don't fish chunks of glass out of a drain while you're tripping, kids)."
 ],
 "erowid": {
  "id": "167",
  "citation": " Setebos. \"The Circle of Thoughts Got More Profound: experience with Mushrooms (ID 167)\". Erowid.org. Aug 15, 2001. erowid.org/exp/167",
  "substance": "Mushrooms",
  "views": "5798"
 }
}
