{
 "id": 20245,
 "title": "Total Nirvana From One Lungfull of Pot",
 "date": {
  "submission": "2001-03-05T08:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Simon",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I have never tried acid or any other mind altering drugs apart from pot, alcohol, and 12 cold and flu tablets (not recommended), so this phenomenal experience was definitely not a flashback of an acid trip.",
  "Several weeks ago on a Thursday afternoon before sport at school, my good friend and I decided that we should alter our state of mind ever so slightly through a complex ritual we like to call ?getting shitfaced.? I was not particularly in the mood to get stoned, as I tend to become very uneasy when I am the only one stoned in a large group, and my friend and I both do different sports, so I decided to only have one lungfull of mildly potent grass, spun with some crushed rose petals (they do nothing to change the experience in any way, my friend is just a bit strange).",
  "We then proceeded to the yard where everyone was already lined up to go to sport.",
  "By this time the effects were minimal, only a slight light-headed feeling, and that?s all that I was expecting, not in the slightest way able to foresee the incomprehensible psychological events which were about to take place.",
  "Waiting outside the bus I was completely capable of participating in a ?normal? conversation with a friend who was not on any drugs. I didn?t even have any fragmented thoughts; apart from the occasional illogical thought, I was totally straight. I was later told that if I had not told them that I just smoked some pot, they would not have known.",
  "             (now this is the good bit)",
  "I suddenly felt the urge to kneel down. It wasn?t an overpowering compulsion to get closer to the ground, rather a feeling of, ? i'll be a bit more comfortable if I kneel.?  So I did.",
  "The way down seemed to be the turning point for the experience. The time dilation I experienced was incredible. What seemed to me an hour was only the time it took to get from a standing position to a kneel.",
  "I studied the warm sun?s rays, which splashed onto the semi-dried grass where I knelt. It seemed to remind me of a time in my childhood that I had long forgotten, when my parents would take me to the river where we used to live. And for an instant I was once again there, filled with the same uninhibited innocent bliss that only childhood (and apparently now drugs) could evoke.",
  "This total bliss, although indescribably pleasant, came as a shock. I had experienced an emotion similar to this before, yet on a much higher dose. I stood up, and just as mysteriously and unexpectedly as the emotion came it dissipated, leaving me pondering what had just taken place.",
  "I made my way onto the bus and sat by the window.",
  "I was joined by a friend, who upon sitting down next to me sparked up a meaningless conversation, in which I involved myself for awhile. However, in my current state of mind I knew I would benefit more if I just turned and looked out the window, so I told him in a very polite way that I am incredibly sorry but I must turn and look out the window now. (He thought I was joking, but after seeing that I did not turn back to him he found another victim to bore with pointless chatter.)",
  "As I was trying to figure out what had caused my bliss just a few minutes ago, I started to take greater notice of the lush green trees outside. Then just as suddenly a wondrous feeling came over me. This was many times more profound than before and it lasted for most of the 15-minute bus ride. During this time I lost my entire internal monologue, apart from the occasional ?wow? and ?what?s going on.? My mind was empty of verbal thought, instead filled with raw emotion, a type of bliss or ?nirvana,? if you will, so profusely mind-blowing that it brought tears to my eyes.",
  "An endless psychological orgasm is perhaps the closest verbal description I can put to it.",
  "Every stimulus from the outside world conveyed a type of wonder and pure undivided happiness that I have never seen the likes of before.",
  "This utopia stopped when we reached the pools, but then an hour later on the bus home I experienced the same phenomenon as before, on the same amazingly vivid scale.",
  "And to this day I occasionally have a glimpse into this state without any drugs and find that the world seems to have much more wonder and beauty than it once had."
 ],
 "erowid": {
  "id": "81",
  "citation": " Simon. \"Total Nirvana From One Lungfull of Pot: experience with Cannabis (ID 81)\". Erowid.org. Mar 5, 2001. erowid.org/exp/81",
  "substance": "Cannabis",
  "views": "6831"
 }
}
