{
 "id": 20259,
 "title": "This Stuff Can Be Crazy!",
 "date": {
  "submission": "2009-11-20T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FlusH",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  },
  {
   "time": "0:30",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  },
  {
   "time": "1:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  },
  {
   "time": "3:50",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  },
  {
   "time": "7:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "Dosage:",
  "150mg  @ 2:30pm",
  "50mg   @ 3:00pm",
  "50mg   @ 3:30pm",
  "50mg   @ 6:20pm",
  "1 joint of marijuana  @ 9:30pm",
  "I was a bit burnt out this afternoon.  One of those days where getting motivated to get shit done is hard to do.  I had a gram of mephedrone kicking around that I have always meant to try.",
  "A good buddy I had not seen for a while dropped by unannounced.  After reminicing for a short while we figured we would test out some mephedrone.",
  "We each cut out a 150mg line, and up the nose it went.   I avoid caffeinated drinks but for some reason I was craving one.  So we went uptown to get some.  We were having a blast, talking non stop making up stupid jokes.",
  "After getting our drinks and returning home we each took another line measured out at 50mg.   The rush was quite subtle but intense.  That may seem paradoxical but it was not overpowering like MDMA can be, but it was like an electric rush not far off from some good clean meth with more euphoria then meth while keeping a clear head.",
  "After another half hour of sitting around talking each others ears off we took another 50mg line and my friend had to go on his way.  With a couple of hours before I had to be responsible again I took the time to clean our house like mad.  I got every room in the house spotless in less than two hours! ",
  "I had cooked up some food starting at 6:00pm, knowing that I was hungry but not feeling like eating at all.  While cooking I started to come down.  I felt strung out, tired, and like one would expect to feel after coming down off meth, except a bit more pronounced.    So I took another 50mg line to see what would happen.  And not much to my suprize I felt great again.  This time the rush was more so then the earlier two lines.  I was having a great time at that point. But I had to force myself to eat.  Normally I have no problems eating on cocaine or mdma, but I really had to force myself to eat this time.  I felt good after eating, like I needed the food.",
  "I spent the next few hours doing some paper work I needed to catch up on.  Even now, five hours after I took my last line as I am writing this report I find myself extremely chatty.  I have been texting people, chatting online, and now writing this report.  The euphoria is gone but the speedy effects are still going strong.",
  "One interesting interaction that I am not too sure if it were from the caffeine or weed I smoked, but at 9:30 I smoked a joint.  I felt way more stoned than normal, and everything was going great until I started getting lightheaded and sweaty.  I know that mephedrone can cause the sweats in people but I felt that I did too little to be getting them, especially since my last dose was three hours before the joint.   I got a bit paranoid which probably made my symptoms feel worse than they really were. ",
  "The negative feelings that I got with the sweats are hard to describe.  I felt bad enough that I wanted the 'trip' to stop, and found it hard to not worry.  In most circumstances where my body is telling me I have done too much, or something is not right I can control my thoughts enough to not panic, and to re-assure myself that things will be fine.   Even though I was not scared, I had a hard time keeping my cool.  I felt like I was jumping out of my skin.  But like I said earlier I don't drink caffeine so the negative reactions could be the caffeine crash with the meph crash then amplified by the weed. After I started writing this report I started to feel better...",
  "That's about it!  I hope this report is useful to any potential users!"
 ],
 "erowid": {
  "id": "81222",
  "citation": " FlusH. \"This Stuff Can Be Crazy!: experience with 4-Methylmethcathinone, Caffeine & Cannabis (ID 81222)\". Erowid.org. Nov 20, 2009. erowid.org/exp/81222",
  "substance": "4-Methylmethcathinone, Caffeine & Cannabis",
  "views": "12476"
 }
}
