{
 "title": "Jawbreakers Really Do",
 "author": "Bonzia",
 "citation": " Bonzia. \"Jawbreakers Really Do: experience with Ecstasy (ID 2025)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2025",
 "substance": "Ecstasy",
 "bodyweight": "",
 "report": "<p>Well I've tried X several times before and they've all been pretty good. But last Friday I took a pill called a Jawbreaker. I swallowed it b/c I hate to chew them up, and it took hold at about T+1hr. We were driving around and I had to get gas so we stopped at a station. While we were there we saw a group of teen runaways, or homeless people, and I wanted to go talk to them. It was really cool to hear what they had to say for a while, and I felt good about actually listening to them instead of just turning the other way when homeless people try to talk to me.</p><p>So we drove to our final destination, a hot tub in a private dorm on our college campus. A note about driving: people say that it doesn't impair your ability to drive, but I don't think its a very good idea. It was an extremely short drive, and I felt like speeding all the way there. There were some people in the tub, but it was cool b/c we all got along fine. The water felt GREAT and so did rubbing up against my friend. Everyone thought we were lesbians, but we aren't. It's just that when you are on X, you want to, you have to, touch things. And when you are touching your friends, it's not sexual at all.</p><p>So the trip was great, but the after affects suck. The pill I took was called a Jawbreaker, and I guess I was gnashing my teeth a lot (but I don't remember doing so). The next morning my jaw hurt sooo much, and I had chewed up the insides of my cheeks. So my cheeks were all raw and aching, and so were my teeth and jaw. It still hurts, 5 days after I took it. Some other pills I have taken are Stardust, which isn't that great, and Tiny Tarts, which are really good. Jawbreakers have been the best roll, but like I said the pain is hard to handle.</p>",
 "year": "",
 "id": "2025",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2000-06-22T07:00:00.000Z",
 "views": "4344",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
