{
 "id": 2027,
 "title": "Strange Deja-Vu",
 "date": {
  "submission": "2005-07-20T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Crash",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>Mindset: Slightly apprehensive about my first time smoking salvia. Read about it for quite some time and have been desiring to try for a while. I'm a lucid dreamer-when I manage to not fully realize that I'm dreaming. I'm a fairly experienced psychonaut, having done LSD many times, 2CB, mushrooms, ecstasy, and various combinations of the above. Fully aware that Salvia will be NOTHING like any of the above, but I still don't know what to expect.",
  "Setting: Outdoors camping 'rave' style party. Night time (about 11:30 PM) and very dark. Two good friends and I, in a tent. No music, the generator has gone out for the time being. We're camped in a remote portion of the available land. No distractions.",
  "I took my first toke. Long, and slow, being sure to hold the butane jet-flame on the salvia as long as I was inhaling. I no longer smoke cigarettes or marijuana, so this hurt my throat-it's a relatively harsh, hot smoke. This could be alleviated with a waterpipe I'm sure.",
  "I'm holdingholding it in for about 20 seconds before I slowly and controlled exhale. Almost immediately I get a tingling sensation inside and towards the top of my nose, and what felt like behind my eyes, in my sinuses. As I said to my friends, but don't remember saying, 'The front of my sinuses feel funny.'",
  "I take my second toke, same as before, long and slow, and hold it in for a good amount of time. My movements start really slowing down-or they feel like they do. Now the tingling sensation has spread to the tips of my fingers and my feet. I feel gravity pulling me downhill towards the front of the tent. I know I'm not moving but I can't help feeling like I am. Almost like a trust fall, when you go below where you think the ground should be.",
  "I'm becoming extremely disoriented; somehow I manage to get the pipe up to my lips for the third toke and ignite. Same as before, except this time I see the sparks of a cashed bowl flying through the pipe, so I set it down. I almost dropped it, because at that point, I was rapidly being transported to a different reality. I mean, it hit me like a freaking sledgehammer, unexpected, hard and heavy, a complete mindjob.",
  "All of a sudden, it's extraordinarily hot in the tent and I'm sweating profusely, so I rush to get my hoodie off as fast as I can-as if it were life and death if I didn't.",
  "I don't ever remember closing my eyes, but I'm sure I did. Regardless if I did or didn't, I do know that I 'saw' myself, still looking out through my own eyes, watching my two friends that were there with me. Butthis was different. WTF? I've done this before! No! Not the salvia I mean! I didn't even think of the salvia, I had totally forgotten about it. THIS! RIGHT NOW! THIS MOMENT!",
  "I've been here, played out this exact moment before. Maybe once, maybe a thousand times. What's going on? I've had deja vu before--this exceeds any deja vu feeling I've ever had before. But this extends beyond the current moment, now I've lived this life a hundred times, a thousand timeswho knows? Certainly more than once.",
  "And thenI'm out. That's it. It's freezing! Why am I so cold? It's not cold out here! Afterglow is very introspective and thoughtful, but I find myself questioning what the hell just happened in that maybe three minutes that I was out there-what felt like half an hour.",
  "I've thought (since I studied atomic chemistry and quantum mechanics in High School [physics/AP physics/chemistry]) (I refuse to believe, I just have ideas) in multiple levels of existence. Everything around us is matter, slowed down, sped up, in various forms. A spirit, or a soul, would be nothing more than a collection of energy in a higher state (a higher valence shell, to make a poor analogy) than what we call reality right now.",
  "So now I think, 'Have I been here before? Was that really Deja Vu? Or' with the sheer number of people on this planet, there HAS to be some other set of friends, sitting in a tent, smoking salvia, somewhere 'was I temporarily in my counterpart's existence? Something like when I receive somebody else's conversation on my cordless phone, they can't hear me but I can hear them?'",
  "I'm not entirely sure what to make of this. I don't know whether to think if time is circular, running in loops (which brings me to entirely new tangents of metaphysical spirituality) or if we share a collective consciousness - an unconscious sharing of thought energy - and I was sharing somebody else's experience with them, or if I was sharing a spirit's former physical life's experiences, etc",
  "I will try Salvia again. She has not shown me all of her cards yet. I did not encounter the spirit of Salvia herself, but I would like to meet her. I know she has a lot to show me, I don't know if I'm ready for it, but I'm never ready for new knowledge. I learn to be adaptable with it the moment it makes itself apparent. I either learn it or dismiss it at that point, depending on how open-minded I am.",
  "I have never had such an intense and thorough bout of introspection and spiritual thought as I did during and immediately after the experience.",
  "I do have to admit, I am a little scared of what she may show me next time, but I am curious, and, as a philosophy several racers say, 'No fear is dangerous. Some fear is beneficial. Face it.'",
  "This is not a recreational drug. This is not tripping. This is more like lucid dreaming, while awake. Perhaps it is in fact a window to other dimensions. This is a tool to get myself one step closer to my own personal enlightenment. It is not to be taken lightly.</p>"
 ],
 "erowid": {
  "id": "16705",
  "citation": " Crash. \"Strange Deja-Vu: experience with Salvia divinorum (ID 16705)\". Erowid.org. Jul 20, 2005. erowid.org/exp/16705",
  "substance": "Salvia divinorum",
  "views": "4592"
 }
}
