{
 "id": 20276,
 "title": "Ecstasy-Like Followed by Calm Stimulation",
 "date": {
  "submission": "2012-11-19T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ecstastim",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabinoid Receptor Agonists"
  },
  {
   "time": "0",
   "amount": {
    "unit": "0:00",
    "quantity": "T+"
   },
   "administration": "20 mg",
   "substance": "insufflated"
  },
  {
   "time": "Ethylphenidate",
   "amount": "(powder / crystals)",
   "administration": "T+ 0:45",
   "substance": "20 mg"
  },
  {
   "time": "insufflated",
   "amount": "Ethylphenidate",
   "administration": "(powder / crystals)",
   "substance": "T+ 1:35"
  },
  {
   "time": "20 mg",
   "amount": "insufflated",
   "administration": "Ethylphenidate",
   "substance": "(powder / crystals)"
  },
  {
   "time": "5:00",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "Ethylphenidate"
  },
  {
   "time": "(powder / crystals)",
   "amount": {
    "unit": "5:00",
    "quantity": "T+"
   },
   "administration": "10 mg",
   "substance": "insufflated"
  }
 ],
 "report": [
  "Ethylphenidate",
  "Dosage: repeated",
  "Method of ingestion: oral/insufflated",
  "Experienced with a various array of drugs including: Adderall, Amphetamines, Cannabis/cannabinoids (JWH-018,122,UR-144), LSD, MDMA, Methylone (BK-MDMA), 4-MEC (4-methylethcathinone), Opiates (Oxy/Hydrocodone). Other things I cant remember.",
  "Im in good health and keep a good exercise routine. However, the night before Id only slept about 2 hrs and then woke up early to finish a paper  which ended up getting done!",
  "Setting was at a club, with a well known EDM DJ playing. Was feeling a little tired from not sleeping much the night before, but overall in a good mood. Smoked some UR-144 (a favorite synthetic cannabinoid, highly recommended :] ) on the way down. This is recalling from memory a few days ago, to the best of my ability.",
  "T 0:00  UR-144 smoked, just a little providing a relaxing effect",
  "T +1:00  after arriving, settled in, smoked a little more UR on some cigs, still a good time",
  "T +1:30  insufflated 20 mgs, I had heard it could take a little while to kick in, so I sat back and let it happen.",
  "T +1:45  WOW  ecstasy like euphoria, increasing. Very much like a light dose of MDMA, but lacking empathy  very euphoric. A def +,",
  "T +2:15  insufflated another 20 mgs, euphoria still very present, good feelings, VERY MDMA like in euphoria, very fun. ++! Massages are great. Getting awesome light shows  crazy good time!",
  "T +2:45  Feelin GREAT  wishing I could tell people how great I feel. A song comes on that reminds me of a good time at a past music festival, want to cry tears of pure joy :D. +++. UR cigs smoked throughout, a highly recommended blend.",
  "T +3:05  Last 20 mgs insufflated",
  "T +3:10  UR dipped cig smoked, helps kick it in better!!!!",
  "T +3:30  WAVES of euphoria, still kicking.",
  "T +4:00  Much more stimulated than euphoric now, still glowing though :D.",
  "T +4:30  Concert over  a GREAT show. A personal favorite artist of mine though, so naturally everything went well.",
  "T +5:30  still after-glowing, needed food. I have a rather fast metabolism, so I require food when on stimulant drugs. Feeling WAY way better after eating, stimulated, still operating at a +ish level. Still feelin good.",
  "T +6:30  Car ride home, still feelin good, desire to do more is present, so another 20 mgs is orally consumed, along with another 10-15mgs insufflated. At this point, two friends of mine, Friend A and B = who were rolling on molly decided to ingest some as well.",
  "Friend A had beautiful moon-rocks straight from the source, and after she ingested some Ethylphen intranasally - ~15mgs, started rerolling  feeling very good. Talking about how much she loves life.",
  "Friend B had some pretty decent molly, and after ingesting a 20mg cap, and 10mgs intranasally, stated he felt very good  and was surprised to the extent at which the EP was effecting him (He was feeling good at 160 mgs of Adderall in a past experience). Discuss how it can be used as replacement molly  and how I looked as if I was rolling harder than he was, and he was on real molly.",
  "T +8:00  Feeling way more stimulated than euphoric now, needed to study for a test. Oops, big mistake. Too cracked-out-silly feeling.",
  "T +9:00  Stimulation still very present, my eyes are blurring intensely! If I try to focus on anything  like my studying, eyes blur up real fast. Very annoying, Friend Bs face is blurred. Friend A does some special K, gets some crazy CEVs; she tries sleeping, and cant. Friend B is still very up +.",
  "T +10:00  Attempt at studying for my test fails miserably. Too hard to see computer screen to resume notes. Still feeling rather euphoric, but mostly stimulated. A calm stimulation is what I would call it. Yes. (Similar to how Im feeling now, recounting this several days later on a similar dosage of EP).",
  "T +14:00  Test likely failed miserably, smoked a UR-144 cig to calm down any anxieties present with the slight come down.",
  "T +18:00  Still stimmed up, cant really sleep, decide to go out to a party drinking. Break open another with Friend B around T +28:00. Bike riding around late at night, a fun time. Climbed a 30 foot tree.",
  "T +30:00 Get home, riding out the feelings for another few hours.",
  "T +40:00  Details of what happened here are fuzzy, just remember falling asleep sometime soon-after.",
  "Overall review:",
  "A fun drug. Definitely has party potential  especially the initial hits  very euphoric; almost just like rolling. Coulda been passed this off as bunk molly in the past actually; thinking about it. However, it had a very distinct appearance. White clumpy powder; very clumpy when grinding to snort as well, had to keep cutting it up a bunch of times.",
  "Dosing past 60 mgs for me was way more speedy/amphetamine-like. Also, after oral dosing, followed by intranasal dosing, the blurred vision got to be rather intense! Too intense at some points; I could barely look straight ahead without my vision fuzzing. But if I looked side to side or more rapidly, I could focus. Furthermore, I had zero libido on this stuff. No sex drive whatsoever.",
  "Overall, substance gets an 8/10 in my books. Definitely fun. Tiny hangover... nothing compared to other stimulants, easily cured by some cannabis or synthetic noids :)."
 ],
 "erowid": {
  "id": "98090",
  "citation": " Ecstastim. \"Ecstasy-Like Followed by Calm Stimulation: experience with Ethylphenidate (ID 98090)\". Erowid.org. Nov 19, 2012. erowid.org/exp/98090",
  "substance": "Ethylphenidate",
  "views": "4345"
 }
}
