{
 "title": "My Face Hurts from Smiling So Much",
 "author": "Texas Ranger",
 "citation": " Texas Ranger. \"My Face Hurts from Smiling So Much: experience with Ecstasy (ID 2028)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2028",
 "substance": "Ecstasy",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>I think I would be lying to myself if I told myself that I didn't like my first experience with E. One of my roommates has been really into E for some time. He loves it. He has told me everything about his experiences and how E is his favorite and he knows how much I enjoy trying different things (We once stayed up all night doing lines together when a friend came over so coked out he gave us $80 worth and crashed. All we did was talk). My roommate, we'll call him A-bomb, he and I both really like drugs. I just kind of like the natural ones better, like shrooms and peyote. I have tripped off shrooms, damn good one's from the Pacific Northwest, probably more than 50 times in my life at doses no normal person is prepared for. I like the natural state of things and chose to analyze life from that perspective, but I will try anything once.</p><p>The only draw back to doing E to me was the strage tactile kind of flamboyance associated, like touching shit and, I don't know, wierd shit. Like one time four of my roommates and their girls all E'd up and me and a girlfriend went onto my college campus and shroomed. We were all going to trip out together, but we felt like doing different things. It was like three in the morning and logic says if you're doing drugs you're probably safer inside. I like being outdoors on shrooms though and so did the girl with me. We must have walked twenty miles that night just talking and checking out all the cool visuals (there's so much fog on our campus it's fucking eeriecool to watch) and when we came back we found my housemates watching a movie and rubbing vicks all over their faces. Just wierd. We walked on until day broke.</p><p>At any rate, after finals last week I agreed to take a roomie out to a bar while one of my other friends bought him $40 of strong drinks because he'd owed him some money. We were all going to meet up with some other friends at a party later. My friend who bought drinks got so damn trashed that he ended up puking all over himself and I guess I ended up taking care of both my friends. Needless to say I still wanted to party and it was like one in the morning, I didn't know if the party was still going on. I caught a ride with another one of my roomies and went to a different party where there were a few naked people around after everyone there had decided to dance in the buff. We stayed long enough to watch some guy walk into and shatter a sliding glass door and then left to go to the other party.</p><p>When I got there my roommate and some of my other friends were right outside. I greeted them just as they all told me they had just taken E. I asked where did you get it, just for kicks I guess, and then they introduced me to this funny looking grinning guy named Walker. He seemed pretty cool. Well, I think I asked if he had anymore, not really expecting him to and before I knew it all of my friends had gathered enough for me to buy a dove. I was with A-bomb, another of my roomies MGD, this Walker guy, and M. M was the only girl with us and we were all on E. At any rate, we made it back to our house and started listening to music really loud. Nothing had really started to happen except that I noticed I was really talkative. It kicked ass and I wasn't questioning why I just payed twenty dollars to feel stoned. Then all of a sudden the music got louder and everything around me started to shudder like christmas lights if you have a stigmatism and aren't wearing your glasses. The funny thing was that I was feeling the same way. My perceptions, everyone of them were like on an infinite shutter speed and I was kindly taking everything in. But it was strange, especially when A-bomb started saying, 'you feel good, huh?' and 'this is what E is all about.' I know I took everyone with me on my ride because I wanted to touch everyone's faces. They all came close and locked eyes with me and saw the uncontrollable flickering of reality that I was experiencing. I made a call for hugs and that was when I would say I was ecstatic, as was everyone. I don't even know how long that peak lasted. I had control over nothing.</p><p>After it was over though, the body high I had was still affecting my mind. I wanted hugs. I made M uncomfortable somehow. I have a girlfriend, I know I didn't look at M in a way that would have made her sexually uncomfortable, but someway in which I looked at her made her call it a night at like five or six in the morning. It was totally strange, but I wanted to be near her. I can't explain it. There was nothing sexual involved, she was just the only girl in the whole place. I want to somehow talk about it, but I don't know what she'll think. She is the kind of girl who can't stand to be alone after a party though and maybe she knows no other deep gaze. If I had to pinpoint my own feelings towards her I would say I felt her nurturing femininity and I wanted to share, maybe to an extreme, but I'll deal. The night ended at two in the afternoon and I just passed out cold. I woke up around eight in the evening and lifted some weights right away, but I felt strange and had a headache from hell that didn't go away for two days. My body felt awful and my jaw was all sore, like it had been locked up. I swore I'd never do E again. The truth is that it was one of the most intense experiences with substances I've ever had and given the right situation; setting and friends, I'd do it again. </p>",
 "year": "",
 "id": "2028",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-22T07:00:00.000Z",
 "views": "4025",
 "dose": {}
}
