{
 "id": 20296,
 "title": "Too Stoned To Shave",
 "date": {
  "submission": "2013-02-19T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rockstar Ret.",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I thought I would add my experiences with JWH-018, and hopefully this will serve as a cautionary tale.",
  "I have been prescribed Oxycontin for chronic pain due to my joints being eaten up by six years of untreated Psoriatic Arthritis, and one of the conditions is No Marijuana.  Having heard about JWH, I was excited to try it, hoping it would have the same analgesic properties of MJ, without showing up on drug tests.",
  "After a brief search on the Internet Machine, I purchased a gram of JWH from a source that seemed trustworthy from various reviews.  My package arrived a week later, white powder in a small plastic Ziploc baggie.  JWH-018-99% pure.  Not for human cunsumption (sic), written in black sharpie ink on the baggie.  Not having a scale, I (stupidly) eyeballed what I thought was about 5mg on the tip of my pocketknife blade, heated it up on a square of aluminum foil, and sucked the smoke up through a straw.  \r[Erowid Note: Two samples of powder (even of the same chemical) with equivalent volumes won't necessarily weigh the same. For this reason, eyeballing is an inaccurate and potentially dangerous method of measuring, particularly for substances that are active in very small amounts. See related article]",
  "I held it in for a few seconds and exhaled the smoke, thinking this is what fertilizer must taste like. I walked from the kitchen to my master bathroom, and got ready to take a shower, the sensations of a pleasant stoned feeling starting to fill my senses.  After stepping into the shower, and lathering up to shave, I suddenly completely forgot what I was doing in the shower.  I looked at myself in the shower mirror, noticed the shaving cream on my face, realized I was there to shave, and picked up the razor.  Putting the razor to my face, I became conscious of the fact I was using both hands, trying to force the razor to my skin.  I was too stoned to shave.",
  "Panic came roaring in.  I thought I had finally broken my brain.  I though for sure that all of the LSD, mushrooms, and Marijuana I had used in the 90s during my rockstar days had finally caught up to me, and my sanity was shoved over the cliff by this powder I had bought over the Internet.  I got out of the shower, dried off, (somehow) and made it to my bed.  I stayed in bed with the lights off for about 45 minutes, waiting to come down and reminding myself that I was just a little too high, and it will end shortly.  I had about 2 hours before my wife got home from work, and she would know I was fucking spun out.  I wanted to call her at work to help talk me down, but using a phone didnt seem feasible.",
  "Finally, at the 2 1/2 hour mark, a workable high was reached.  Looking back, I have never been so stoned in my life, and if I had children I would tell them to stick to the real Marijuana, not this synthetic mind-melter.",
  "I did not dump the powder down the drain like I should have.  I had a few more trips on JWH that I will submit later.  Stay tuned."
 ],
 "erowid": {
  "id": "98284",
  "citation": " Rockstar Ret.. \"Too Stoned To Shave: experience with JWH-018 (ID 98284)\". Erowid.org. Feb 19, 2013. erowid.org/exp/98284",
  "substance": "JWH-018",
  "views": "1196"
 }
}
