{
 "title": "A Subtle, Wonderful Experience",
 "author": "Q",
 "citation": " Q. \"A Subtle, Wonderful Experience: experience with 4-Acetoxy-DET (ID 20294)\". Erowid.org. Jan 11, 2003. erowid.org/exp/20294",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "72 kg",
 "report": "<p>Level of experience: First time with this chemical. Otherwise not very experienced.</p><p>Chemical(s): 4-aco-DET (+Cannabis)</p><p>Method of administration: oral</p><p>Dosage: approx. 20mg</p><p>Set: A hour after I woke up, feeling fresh, happy because of FINE weather and my choice of day for the experience</p><p>Setting: Home, at start and most of the time; mostly alone; comfortable and familiar places.</p><p>My intention for this journey was to test out the new knowledge about consciousness and the mind that I have gathered lately. Trying to see/test out for myself the validity of John C. Lilly's work on metaprogramming the human biocomputer, as well as Leary's '8 circuit model of consciousness'.</p><p>There was also a drive to test out a research chemical and report on it, as well as enjoying a psychedelic after quite some time.</p><p>I would say that the results were quite nice, although they did not 'pattern-match' my expectations, I was very pleased with them!</p><p>14:20</p><p>20mg 4acoDET which would hardly dissolve in a small amount of vodka + distilled water. Taste was nothing special.</p><p>First alerts within 5 minutes</p><p>+15 min</p><p>Sorting up my room while waiting for it to kick in.</p><p>Concentration fragmented.</p><p>+18 min</p><p>Legs uneasy.</p><p>Minor stomach discomfort, nothing serious.</p><p>+25 min</p><p>Went out to a small green field nearby, to sit and enjoy the sun. Hit me fairly strong. Quite immersed into the landscape before me, analyzing it and being conscious how perceptions float through my conscious mind and strike off other memorized perceptions/abstractions.</p><p>The music had me totally blown away, totally driving the trip. I felt and tuned into the feminine influence in the music (Neotropic - La prochaine fois).</p><p>The visuals were fairly nice and obvious OEVs which were peaking around the +1h to +1h:30m mark.</p><p>Influencing my visuals was very interesting, as well as bouncing the reality tunnels from which I viewed at them. A different kind of assumption about their origin yielded visually different images.</p><p>At this period of time mostly, I felt my ego bouncing around and trying to get back in place - I watched the 'negative feedback' behaviors within myself and tried sorting them out.</p><p>+50 min</p><p>Walking home, I experience myself as a complex entity of a lot of basic natural forces, balanced in a mathematical fashion. I feel as a mathematical system bouncing up and down while walking and 'feel' attuned to the mathematical fashion forces such a gravity work upon me and the other systems around me (buildings, people,..). I felt with much clarity as if being one 'peak' of the whole Universe, the rest of it being 'my tail behind' and felt myself bouncing up and down in accord to the laws that govern the Universe. This was a very lucid experience at the time, which is hard for me to put into words. Is this activing the 8th, Neuro-atomic circuit??</p><p>My trip would rate a solid +3 on the Shulgin scale at around the peak, lowering into a nice high +2 with time.</p><p>+1h</p><p>Home again.</p><p>Dancing for a few minutes to some music felt wonderful, letting go of the stiffness of ordinary day (socially fabricated) reality.</p><p>This substance felt really good and nicely psychedelic, but lacked the orgasmic, really feel good, loved quality of, acid let's say.</p><p>For a short time in total darkness, explored a few ideas which seemed great - very romantic, very hip, but nothing that I particulary (would have) acted out later.</p><p>The subjective slowing down of time is mostly noted during the first two hours.</p><p>Had a long, frank and sincere conversation with a family member, felt very nice about it. It ended at the 2h mark.</p><p>+2h</p><p>I lay in a hot tub and smoked a joint. I experienced a synaesthetical perception of all sound (mostly mechanical noises of water flowing through pipes and outside traffic). The sound sparked off ideas and visual images that would somehow represent them.</p><p>Observed some of the behavior of my muscles and body in regards to the suspension in water with salt. It was obvious that my conditions were nothing like the true isolation tank ones; still, learnt a valuable lesson in regards to my behavior in isolated situations - I was acting against it, trying to fulfill my need for mental stimulation.</p><p>A trend in my psychedelic voyages was observed: trying to sort out some mental problems, come back with a definite answer from my self on some topic, something to ground up the experience and act upon it. However, although not without result, the answers derived were not for the primary questions I asked. They tended to be answers in regard to certain scientific/philosophic issues of mine.</p><p>A reassuring thought, having in mind that my voyages are few and scattered between long periods of time and still gaining very important clues besides the lack of practical experience of inner voyaging, persisted. It pointed out that with my next sessions I would get a better grip on my mind, not without more effort, though!</p><p>In a very high creative state: a lot of ideas for poems, short stories, discussions in public Net forums, music ideas, culture/art ideas... mostly written word type of ideas, though.</p><p>+3h</p><p>Very heightened appetite. Enjoyed food very much!</p><p>+4-5h</p><p>At around 4 to 5 hours, the major part of the experience slowly faded away into the background, leaving me with a bit of a numbing 'afterglow', which was definitely psychedelic in nature, but not too radical. Was still not baseline for at least 10h.</p><p>+7-8h</p><p>Blood pressure dropped a bit and felt heavy from the food and dope. Eventually, vitamin c + b were taken and some coffee drank - it helped the situation very much. The afterglow was now truly a pleasant one.</p><p>Amused myself with writings of John C. Lilly, fulfilling my growing interest for his work.</p><p>+9h</p><p>Went out to a bar and then to a club. I was only on caffeine drinks (cola, Red Bull). The night out was terrific!</p><p>+15h</p><p>Came back, felt very nice, and not even slightly exhausted after all the dancing.</p><p>I noticed some purple dots in my visual field still appearing from time to time.</p><p>Sleep was great and there was no hangover.</p><p>The next few days I feel a nice peace of mind, a calmness which stays with me, a different quality to my thoughts. Nothing major, but a difference in mental state which was fairly obvious.</p>",
 "year": "2003",
 "id": "20294",
 "gender": "Male",
 "timestamp": "2003-01-11T08:00:00.000Z",
 "views": "15198",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DET",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
