{
 "id": 20305,
 "title": "Something I Never Want to Go Through Again",
 "date": {
  "submission": "2013-02-21T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chronic Blunts",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "T+ 1:05",
   "administration": "1 hit",
   "substance": "oral"
  },
  {
   "time": "2C-I-NBOMe",
   "amount": "(blotter / tab)",
   "administration": "T+ 1:20",
   "substance": "250 mg"
  },
  {
   "time": "oral",
   "amount": "MDMA",
   "administration": "(capsule)",
   "substance": "T+ 3:20"
  },
  {
   "time": "50 mg",
   "amount": "oral",
   "administration": "Methoxetamine ",
   "substance": "(capsule)"
  }
 ],
 "report": [
  "12:00pm - Me and three friends, 'Peter' 'Ernie' and 'John' all meet up to smoke a little weed, and do some quote on quote 'crazy shit' according to Peter. I happend to pick up 9 grams of some high quality herb the night before and had exactly a Quarter left so me and John head over to Ernie's house where we are going to chief and chill at. When we get there Peter was already there, and he looks fucked up, I mean he's clearly on something. Pupils huge, eyes glossy as shit and the look of stupidness was all over his face. So we all decide to get high before we get into any of the other shit so I scaled out an 8th and we get ready to take it to the dome out of Ernie's 2 1/2 foot Roor bong.",
  "12:40pm - We all start to smoke.",
  "1:20ish - I'm pretty blazed when Peter asked us if we were ready to trip balls. Keep in mind Peter is a psychedelic freak. This man will do anything from Mescaline to straight crystallized LSD.",
  "1:45pm - All 4 of us take one tab each of the 25I 600ug (0.6mg) this is Peter's second tab and he was also on one capsule of the MXE at the time. So he's pretty fucked up when me and John decide its a good time to get some molly going.",
  "2:00pm - All 4 of us take one capsule of Molly. There was 0.25 in each cap.",
  "2:25pm - My body is slightly numb and I'm feeling more HD effects. Colors seem increasingly brighter and sounds seem much more clear. I am feeling really nice and am very high.",
  "2:50ish - Peter is complaining that he is too high, suprisingly he is never the one to complain of being too 'high'. I on the other hand am very giggly, I feel like at any second I am about to bust out laughing.",
  "3:20pm- Me, John and Ernie are all watching Peter crawl around on the floor stating that he thinks he is a spider. At this point I was laughing my ass off and I began to feel a very strong body high followed with a lot of confusion.",
  "3:45pm- I observe a small baggie of pills fall out of Peter's left pocket as he was still crawling on the floor. I casually (or what I think is casually I was really fucked up at the time) walk over to where the MXE capsules where dropped and picked them up. SCORE.",
  "4:00pm- Im hallucinating pretty hard. Geometric patterns are taking over and at one point when I looked down I remember seeing a chessboard, some how the ground morphed and took the place of a fucking chessboard. Lol. At this time me and Ernie decide to take a capsule of the MXE. John decided to skip on the MXE as he was tripping pretty hard of the 25I.",
  "4:30pm- This is when things start to get weird. I am suddenly hit in the face with a breeze of numbness. Everywhere my whole body starts to tingle. At first I like the numbing sensation.",
  "5:00pm- I am pretty high still the MXE is just now starting to take full effects and I am peaking on the 25I. At this point I remember seeing the walls breath and everything had a purple glow coming off it. Meanwhile Peter is just now regaining sobriety.",
  "5:45pm- I am too high. I am stuck in Ernie's red leathered chair just thinking to myself when will this end? I am loosing train of thought at this point. So many different thoughts are racing through my head at once. I was upset at one point and then began thinking even harder about what upset me. I couldn't even think straight.",
  "6:00pm- Peter wants to smoke more weed. I tell him I think that is going to make things more 'Trippy' and at the time I wanted everything to stop. I was not enjoying myself. Somehow he managed to talk me into rolling the rest of the ganja in a honey dutch master. Dont ask me how.",
  "6:25pm- We all start to smoke. Within the first hit I can feel me physically get higher. It was really weird. I cant describe it really. I closed my eyes and was watching myself in my own mind take hits from the blunt as it was being passed around.",
  "7:00ish- Were listening to music as my body is vibrating, no joke. I could feel my muscles shaking rapidly to the point were I was literally vibrating on the back patio chair. I looked down to see lights shoot out from under me as what appeared to be a rainbow vanish into the sky. At this time I was a bit entertained yet freaked out at the same time.",
  "7:10pm- This is my last memory of the night. The herb and MXE has me gone. At this point I felt like I was stuck in a dream and a I kept losing track of time thinking it was around 2am. I began to panic. I briefly remember thinking that my mom has called the police on me in a panic that she doesnt know where I am. I take off into a dead sprint out of Ernies house too mine.",
  "From there on I only have brief memorys of the night until the next morning when I woke up in Johns house.  Apparently I got home and called him in a panic and said that I was being followed by creatures of the dark and that I needed somebody to rescue me ASAP. When I woke up I was still a little confused as to what happend the night and day before but I was just happy it was all over. I deff realized that I over did it on the drugs.",
  "This is something I will never do again. I believe the MXE is what made me panic."
 ],
 "erowid": {
  "id": "98338",
  "citation": " Chronic Blunts. \"Something I Never Want to Go Through Again: experience with 25I-NBOMe, MDMA & Methoxetamine (ID 98338)\". Erowid.org. Feb 21, 2013. erowid.org/exp/98338",
  "substance": "25I-NBOMe, MDMA & Methoxetamine",
  "views": "3217"
 }
}
