{
 "id": 20302,
 "title": "Never Going Near It Again",
 "date": {
  "submission": "2012-11-19T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hunter",
  "gender": "Male",
  "weight": 12
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "",
    "quantity": "1"
   },
   "administration": "buccal",
   "substance": "2C-I-NBOMe",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "I purchased 1 x 500ug tab from a reputable online vendor. I did my research and decided that because I couldn't source acid, 25i would be as close as I could get.",
  "At midnight, I placed the complexed tab between my gum and cheek and waited for 30 minutes. I disposed of the tab and waited for effects.",
  "I quickly (within 10-15 minutes) began to notice a shift in saturation in the room. Colours began to appear slightly richer. This is when the nausea set in.",
  "Feeling rather sick and depressed, I decided to retreat to bed and relax. I got into bed and lay on my side. I hoped the nausea would pass but it only got worse. At about the 40 minute mark, I was lying on my side, in bed, feeling like I had a bad dose of the flu.",
  "60 minutes in and there were no CEVs and no OEVs. I felt sick, uncomfortable, depressed, irritable and wanted to go to sleep. This is how I remained for 7 hours.",
  "At approx 8am, I finally dropped off to sleep and woke up at approx 10am feeling heavily hungover and depressed. I went to the toilet, looked in the mirror, and noticed that my face was bright red. I spent the rest of the day lying on the couch feeling moderately ill as if I was hungover from heavy alcohol use.",
  "It took 48 hours to rid of the feeling of nausea. For a week after the experience, I felt quite calm and refreshed.",
  "As you can guess, I won't be repeating the journey."
 ],
 "erowid": {
  "id": "98312",
  "citation": " Hunter. \"Never Going Near It Again: experience with 25I-NBOMe  (ID 98312)\". Erowid.org. Nov 19, 2012. erowid.org/exp/98312",
  "substance": "25I-NBOMe ",
  "views": "5340"
 }
}
