{
 "id": 20321,
 "title": "Mild Relaxer that Helps Me Focus",
 "date": {
  "submission": "2004-08-04T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Lbow",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "0.33 oz",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Kava",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "After a six hour car trip, I made it home, feeling a bit tired, and just wanted to relax. I took a 1 mg. tablet of clonazapam and made myself a light dinner (a bagel with cream cheese and a soda). While making dinner I also prepared my Kava tea. I took about a third of an ounce of wildcrafted kava and soaked it in a couple cups of water over medium-high heat. After the mixture lightly boiled, I let it sit on low for about twenty minutes. After this, I drained the tea and poured the remaining liquid back in the pot. I then added a generous tablespoon of Kava powder. I stirred well and let the mixture sit on a medium low heat for about ten minutes. Then I drank it.",
  "Some people complain about the taste of KavaKava. I love it. It has an earthy taste and I love the numbing effect it gives my mouth. After I finished my cup I felt the effects. A definite head-change with mild euphoria is what I experienced. It made me feel sociable and at ease. I was able to concentrate on my drawing and was not easily distracted. The clonazapam added an even mellower effect to the Kava. I am a big fan of Kava. I stopped smoking pot a few months ago and have found that kava is a nice substitute. It is not at all as strong as marijuana, but it doesn't ever give me the sluggish, cloady, blah feeling that pot often does (it also doesn't produce panic-atacks and paranoid episodes, which were occuring after seven years of smoking pot.) Kava is a mild relaxer that helps me focus on tasks and takes away a lot of my anxiety. I highly recomend it to those who suffer from depression and anxiety. It works for me."
 ],
 "erowid": {
  "id": "9846",
  "citation": " Lbow. \"Mild Relaxer that Helps Me Focus: experience with Kava & Clonazepam (ID 9846)\". Erowid.org. Aug 4, 2004. erowid.org/exp/9846",
  "substance": "Kava & Clonazepam",
  "views": "16913"
 }
}
