{
 "id": 2032,
 "title": "Barely Made It Back",
 "date": {
  "submission": "2003-06-28T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Maria",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  },
  {
   "time": "8:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "flowers"
  }
 ],
 "report": [
  "Drug background:  I first took LSD in early '92, frequently for about 3/4 of a year.  Mushrooms, a similar timeframe (just a few mos. later).  [I had to stop psychedelics for the sake of my mental health and life in banal reality] Marijuana occasionally, before acid, and a after mushrooms.  MDMA mid '93 - '00.  Other drugs as well, but none that relate to this particular account.",
  "My boyfriend Adam, a heavy pot smoker himself, had somehow convinced me to give it another try.  I had pretty well avoided the stuff for the past 4 yrs. as it only made me feel like a pile of shit, or served to intensify trips (which I had also been avoiding).",
  "The setting was his mother's house while she was away, one particularly beautiful summer's day in '98.  We were enjoying a gentle come-down from the previous nights E and were feeling quite positive.  We sat out on the newly constructed mini-deck/porch.  I took my 1st inhale, and remarked that I felt absolutely nothing.  I soon took a 2nd lung full.",
  "I stated, 'It's happening.'",
  "Exactly what I had hoped I would NOT experience.  The terrifying, emotional/cerebral Hell.  It shocked my brain. I felt the all-too-familiar intense panic.  The same exact feeling I had last summer, at the beginning of an insane and damaging trip.  I hadn't known for sure what had caused that episode, now it was confirmed, MDMA + THC!  I had previously warned Adam about my peculiar, possible reaction, that's why I'd said  IT'S HAPPENING...",
  "Reality was fracturing.  To describe it ocularly, initially, it's like a transparent fractal mildly vortexing with staggered motion (like a camera aperture).  The initial feeling is that I am suddenly aware that I have just been 'gone'.   I am unaware of slipping away or being gone, only upon resurfacing does it hit me.  This increases in frequency and intensity, until there is no more surface time.",
  "I had made my way to his mom's king size bed, the best / most comfortable place to wait out / fight my impending ordeal.",
  "Speech grows labored.  I feel sooo far away.   Away  from 'reality'. ",
  "Nothing could comfort/distract/keep me, not even Adam's attempt by mentioning my dearly loved kitten.",
  "I feel the thousand+ veils of the thousand+ levels of reality/consciousness. ",
  "Soon, my brain is melting. It feels like what I imagine 100 hits of acid would do, maybe more.  ime - why does it have to move so painfully slowly?  A few minutes feel like an hour! I am now having to exert everything I can muster to prevent my mind from slipping away...permanently.  It feels like physical labor (I may have been clinging to the bed sheets).  For a second, I lessen my tenacity, my mind slips dangerously away. No! It would be devastating!  I worry that I won't 'come back'.  And expect that fate now.   I will have to be institutionalized.  My empty shell will sit there for the rest of its days, drooling, and having its butt wiped for it - a vegetable.  Adam is on the phone in another room - with the sanitarium?  Oh, how this will kill my mother.   My small, broken family will be shamed.  They'll never understand.",
  "This experience is proof.  Proof of other space-time dimensions.  OK, enough!  I believe already!  I had been convinced by my previous psychedelic travels with LSD / mushrooms.   They are 'keys'.  So is (percussive) music. ",
  "Although I find it difficult to discern if I do, in fact, need to go (I eventually just figure I should give it a try), surprisingly, I'm able to make it to the washroom.  I urinate frequently and in significant amounts.  How is this possible?  I haven't had a drink in many hours.  What is the correlation?",
  "After many (8?) hours of this mental meltdown, I finally felt some relief.   But feel psychologically/emotionally worse for wear, for some time afterwards.  Adam never understood what happened to me.",
  "My next such episode wouldn't be 'til NewYear's 2000..."
 ],
 "erowid": {
  "id": "16727",
  "citation": " Maria. \"Barely Made It Back: experience with Cannabis & MDMA (ID 16727)\". Erowid.org. Jun 28, 2003. erowid.org/exp/16727",
  "substance": "Cannabis & MDMA",
  "views": "21626"
 }
}
