{
 "title": "LSD vs MDMA",
 "author": "Cosmic Baby",
 "citation": " Cosmic Baby. \"LSD vs MDMA: experience with MDMA (ID 2032)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2032",
 "substance": "MDMA",
 "bodyweight": "",
 "report": "<p>Newsgroups: alt.drugs From: jamesm@cogs.susx.ac.uk (Part-Time Cosmic Baby) Subject: Re: entheogen-entactogen ? LSD vs MDMA Date: Wed, 12 Jan 1994 11:51:15 GMT</p><p>> S. Casey wrote:</p><p>> An entactogen makes one feel that 'everything is okay'. A general</p><p>> feeling of well-being.</p><p>> Note that MDMA does not always have this effect. Bad trips on MDMA do > happen. If there's a lot of negative stuff buried inside, it can get > suddenly connected with your conscious thought. One person I know took > some MDMA and couldn't stop crying for about 2 hours.</p><p>> Fortunately, it is pretty rare, and most people have very good > experiences on MDMA. Personally, I think it should be issued to</p><p>> people (on a voluntary basis).</p><p>Unfortunately, it seems that I am one of these rare cases, I can get the MDMA entactogenic effects only when I am in a very safe familiar place with people I like a lot already. If not, then I do feel very lonely, incomplete, and I usually get obsessed with finding my soul-mate. There is no way I can dance, and some times I have cried for quite some time. The only thing I seem to want to do is 'Quddle' with someone that I know will feel the same after they've come down, and not just because of the drug.</p><p>I have tried to avoid to get imprinted on people (intimate love-wise) because I don't think that drugs are there to create love, but to facilitate its expression, and I wouldn't start a relationship based on a pill. I have tried to feed this need for primal Quddling with having a teddy to Quddle, it has freaked people out, and it still does, but hey if a rave is a place where you can do what you feel like doing then if I feel like going with my teddy is my business.</p><p>It sound like regression and believe me it feels like one as well, about 2 years old I should think. It is obvious to me that Quddling is what I've missed (Wilson's Biosurvival circuit, oral, safety etc.) when I was young, It is something I will get over by partly supplementing this safety my self and partly by finding people that are willing to share their affection with me. This the main reason I take MDMA occasionally but very carefully, because I believe that this is a deep need that has to be faced/addressed/resolved instead of being suppressed/hidden and forgotten. Many times is hard and can be quite painful but I'm moving on and keep on moving.</p><p>Now the point I wanted to get to from the start is that under the circumstances it sound that it would be a very bad idea to try LSD, well, I have more times than MDMA and I have a brilliant time. All I want to do is dance and become one with the music, the more parts of the music (even emotions) I can express with my body, the better. Is like marring time (music) with space (volume) and when I get into it suddenly there is a peak experience that makes me feel great, complete, love for everyone especially for those I can sense around me (since I always dance with my eyes shut), and I feel Quddled by the whole universe (hence Cosmic Baby). My world view changes and by present time seems as a transition, I can see where I'm going and where I could go, and everything makes sense, there is no helplessness involved like in MDMA nor involuntary regression, just the aware choice of been who I am the way I want to be, as curious, sensitive, genuine, enthusiastic as child and as responsible as and adult and as caring and understanding as a parent.</p><p>Now the problem comes with LSD because is a loners drug, people don't give a shit if you feel genuine love for them, as long as you can't express it (with my eyes closed is a bit hard). Or maybe I do through my way of dancing but none seems to understand, I come across as a tripping eccentric loner who loses it on E and goes around with teddy, socially it can be a bit problematic.</p><p>Does anybody else gets bad times on E but brilliant times on A or is it just me.</p>",
 "year": "",
 "id": "2032",
 "timestamp": "2000-06-22T07:00:00.000Z",
 "views": "5165",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "MDMA"
  }
 ]
}
