{
 "id": 20325,
 "title": "Laugh Riot/Physical Space Warp/Chunky Trails",
 "date": {
  "submission": "2003-04-23T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "FirstTimer",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "Well, this was my first successful Salvia Divinorum trip, after one attempt at chewing (had way too little) and two attempts at smoking, which failed because my throat and lungs couldn't handle even the most minuscule amount of smoke, as I had never smoked anything before. This time me and 'John' had purchased a water pipe to use with the (regular unfortified) dried leaf, and it greatly helped. I still couldn't take a full lungful, but I took in leaps and bounds beyond what I could straight out of a pipe.",
  "It had just gotten dark, and 'John' and I set up the water pipe, the crumbled dried leaf, and the butane torch lighter beside a cushion on the ground in his back yard patio and decided I would go first. I sort of stood there a little hesitant and anxious, and then proceeded to fire up the first bowl. I took in as much as I could, and held it for a while, but not as long as I possibly could have. Meanwhile, my sitter was packing the second bowl. Exhale, repeat. By the time it came time to exhale the second hit, I was already a little clumsy and let loose a hefty amount of drool after managing to hold in the smoke for only a little bit. After that, things had already started to happen -- I don't remember putting the bong down, I just remember closing my eyes, losing the majority of my consciousness, and starting to see some very faint psychedelic patterns.",
  "Soon, the patterns developed into a physical-feeling warping of space, and my own movements had a lot of control over it.... Imagine that you were in a tank of water, and you and the water were perfectly still. If you made a body movement, that would set off currents in the water. These water currents were like the space warps, only that after I set them off, they grew much larger and stronger and my body felt like it was physically and visually being pulled and warped by these currents. Now, all this was happening in a dream-like state, where I was not aware of reality. When I opened my eyes, I was looking up at the part of the roof hanging over the patio, an umbrella, and the late evening sky. Everything made trails. These were very staggered trails... imagine a bunch of snapshots being taken of my view field that remained in place as my view shifted. Only that they remained there, and didn't fade away. So one head motion filled my whole vision with a repeating pattern of the roof and the umbrella. Everything was pastel-colored and textured.",
  "At that point, I actually 'came to' and consciously realized what had just happened, that I was actually tripping on Salvia and that these were the visuals. I also realized that I had started uncontrollably laughing. After several seconds of this, I quickly got a bit worried that the neighbors might hear all the commotion and take a look over the fence at what we were doing. Through all my laughter (which wasn't about to stop anytime soon) I managed to yell to my sitter to 'make me quiet,' or something along those lines. (At least from my perspective I was yelling, but I have no clue as to how it actually came out.) All the visuals had started throbbing wildly along with the previously described spacial warping. As I stood up to my knees to walk into the house, space and image in front of me was 'pumping' in-and-out, based at quite a distance away from myself. I told my sitter (I don't remember the exact words) that I was going to go inside and wanted him to close the door so we don't make noise and attract attention. What most likely came out were loose, barely-meaningful phrases, as I was hardly able to maintain my grapple onto the real world.",
  "The only clear vocal memory I have of that time is shouting the word 'couch!' as I was pointing to the couch and crawling through the patio door. Keep in mind that my hysterical laughter was continuing (and, as a matter of fact, increasing) throughout all this. At that point, I remember 'going for' the couch, but I never made it, as I lost consciousness and later found myself coming to again on the floor right in front of the couch. During this halfway loss of consciousness, I could still hear myself continuing to laugh wildly and my eyes were closed, still looking at visuals. I came in and out of this several times and one of the few visual memories I have is the sitter shutting off the lights and me (somehow) telling him to turn them back on. (He had turned them off because of our previous discussions about Salvia, in which I had established that the best way to trip on Salvia was with no sensory inputs... however, I had decided that I didn't want to do that yet, and just 'enjoy' for now [more on that in just a little bit]) The whole room was a trail that was so staggered it was no more than 3 or 4 broken up pieces in my whole field of vision.",
  "Anyway, I feel like that half-conscious state was the key to actually launching into a full blown mental trip to Salviaworld, but I couldn't even begin to do that because I was way too  amazed and excited. I predict that I will have several more trips like this, and after I get used to that wonderful besaged state, will then be able to be calm and serious enough to do that. Still, that first trip was nothing light. I was, by all means, 'gone.'",
  "As I slowly started to come down from the trip (the wild hysterical laughter was starting to break up now) I felt I gained a little bit of control over my state of consciousness... I held my eyes closed as I was trying to keep track of visuals, and I had relatively clear thoughts, but by physically talking and moving, I could bring myself to full (but still whacked out) consciousness, and then fall back to the halfway state when the actions ceased. However, I seemingly 'preferred' the halfway state. I was definitely 'out,' but at that exact same time I probably could have been in a condition to be able to walk, IF I had chosen to bring myself to do so. When the visuals and the physical space-warp subsided enough, (about 2-3 minutes after lift-off) I purposefully brought myself out of it back into the real world (with my newly-gained 'control') and started to make vague comments about the experience amidst the laughter.",
  "Later on, when I was more or less my normal self and was sharing every detail I could with my sitter, he told me that I did quite a bit of babbling, and at that point I gained very vague memories of saying, or trying to say, more things than I succeeded at. I also realized the importance of having a sitter -- without him, I definitely saw the potential of getting freaked out ('What if I knock something over or hurt myself?' 'What if anyone finds me?' and those worries developing). I know that in writing this, I have left out a lot of details because I have forgotten them by now. (It's about 7 hours after the experience.) I wish I'd brought a laptop so I could record my thoughts while they were still fresh.",
  "Better yet, I REALLY wish I'd have filmed myself with a camcorder. I wonder what I must have looked like crawling through the patio door (my memory of this is from a weird perspective and I don't remember any of the details of the motion -- just moving from outside to inside while barely holding on to reality.... and I have absolutely NO recollection of moving from the floor to the couch -- but I remember being at both locations) and I especially would like to know how my speech came out. (After my trip, I asked 'John' to confirm whether he heard many of the things I remember saying, and he said he couldn't understand most of it -- which I was mildly surprised at.)",
  "I learned about the importance of a sitter: not only the mental reassurance aspect of, but also the obvious physical danger protection. Again, I only remember moving from the patio to the floor in front of the couch, but I have NO recollection of HOW that happened. I'm glad he was out there watching over me.",
  "After our brief conversation about my trip, 'John' then proceeded to take his turn with myself acting as the sitter. When that was over, he slept for an hour while I watched 2 episodes of a sitcom and waited to be safe enough to drive home (I had already felt more than OK, but better safe than sorry). We then had a brief discussion about entheogens in general before I headed home, and stopped by  7/11 on the way to pick up some beef jerky that would wreak havoc on my breath ;)."
 ],
 "erowid": {
  "id": "9849",
  "citation": " FirstTimer. \"Laugh Riot/Physical Space Warp/Chunky Trails: experience with Salvia divinorum (ID 9849)\". Erowid.org. Apr 23, 2003. erowid.org/exp/9849",
  "substance": "Salvia divinorum",
  "views": "17801"
 }
}
