{
 "id": 2034,
 "title": "What Comes After 10?",
 "date": {
  "submission": "2008-01-12T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Baz",
  "gender": "Male",
  "weight": 182
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "25",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "capsule"
  }
 ],
 "report": [
  "I bought 30g of fresh ground nutmeg. I dropped some of the nutmeg, so weighed the remaining and had 25g left. I knew this stuff tasted horrible so I emptied out some old capsules and packed the nutmeg into them. I managed to fill 30 capsules, which I would then take the next day. I wanted to come up at around 1.00 pm while out at the mall where I was meeting my friends, so I set my alarm for 8.30 am. My experience is as follows.",
  "8:30 am, Saturday morning - took all 30 capsules containing 25g of nutmeg.",
  "12:00 pm - Started to feel very light headed and my body felt light, I felt as if I could easily jump over a car.",
  "1:30 pm - Really starting to come up, getting very very very strong waves. I was finding it extremely hard to stay conscious, I started to get quite anxious, kept thinking I was having a heart attack and considered phoning for an ambulance. I told a friend what I was feeling and he said that he had never done nutmeg but has tried xtc, shrooms and lsd and said what I was feeling was normal and that I was just coming up.",
  "5:00 pm - Still feeling the same, plus I was getting very confused and had virtually no memory. I went into a shop to buy a drink, when I had to pay for the drink at the counter I was finding it extremely hard to talk, or say small sentences. I went to another shop to get a lottery ticket but had to leave the shop because I was too confused to do it, at this point I thought I better go home before I get any worse. My house is a 25 minute walk away from where I was, but it took me about 1 hour 30 minutes to walk home.",
  "It took me so long to get home because I was so dazed and confused and still finding it hard to stay conscious. I would be walking down the street and then all of a sudden be at the end of the street, it was as if I kept losing consciousness, blacking out for like 2 minutes, but my body would just keep on going, as if I were sleep walking, I kept coming too and finding myself walking down the wrong street or walking back the way I had just come from, walking in the opposite direction from my home. To try and keep myself fully conscious I tried talking to myself (not out loud just in my head) I tried to spell my name (Matthew), I thought m, a, small pause then, t, t, long pause then, h, e, w. I then tried counting, it went like 1 2 3 pause 5 7 9 8 3 10. I couldn't remember what came after 10. By now I was getting really worried, I was thinking what if I forget my name and where I live.",
  "6:30 - Reached home, walked inside the house and immediately started to puke, puked 3 damned times. I tried cleaning up but was so out of it that I just had to go and lay down on my bed. On my bed I noticed that things looked different, as if everything was props off a stage play, it was as if things were flat.",
  "8:00 - By now I had a different perspective, everything looked taller and the room looked longer, I stretched my arm out in front of me and it looked like it reached out across my room, it looked about 5 ft long. Also I was feeling really horny and so started to masturbate. It was amazing, every stroke, pump, what ever you want to call it felt like an orgasm, not a great orgasm, I'd give it a 7 out of 10. Anyway I just kept pumping away at it getting multiple orgasms, but was not able to ejaculate. After about 30 minutes of jerking off I desided to go to sleep.",
  "2:30 pm, Sunday - Woke up feeling fine, got dressed and went to the lounge to watch t.v.",
  "3:00 pm - Fainted, came too wet through with sweat. 5 minutes latter and I fainted again.",
  "For the rest of the day/week felt fine.",
  "My conclusion is that nutmeg is very very strong stuff, I didn't like my trip and wouldn't really like to take nutmeg ever again, although the thought of having multiple orgasms lasting for 30 minutes again or even longer, does make me consider taking nutmeg again."
 ],
 "erowid": {
  "id": "16733",
  "citation": " Baz. \"What Comes After 10?: experience with Nutmeg (ID 16733)\". Erowid.org. Jan 12, 2008. erowid.org/exp/16733",
  "substance": "Nutmeg",
  "views": "11080"
 }
}
