{
 "id": 20342,
 "title": "A Plane Above Our  Three Dimensional Universe",
 "date": {
  "submission": "2004-08-06T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "mylo",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.75 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "0.75 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "plant material"
  }
 ],
 "report": [
  "I received a 10 gram package of Salvia Divinorum.  I had the package shipped to my office, so I had to hold onto it all day.  Then, I had to work late.  I didn't get home until about 10:00 pm.  I got home, helped my wife put our son to sleep, and then started getting ready for my first Salvia experience.",
  "I started by preparing some frankincense and myrrh, along with a pinch of salvia.  Then I made sure I had a glass of water nearby.  I also cleaned up the living room, because I hate tripping in a messy environment, but little benefit that had, since salvia made me forget i could see with my eyes.  During the time that I was getting everything set up, I was concentrating on calming myself.  I walked in measured steps, not overextending myself or walking too fast.  I turned off all the lights, lit a trio of candles in the middle of the table, and lit the charcoal holding my incense.  I then smoked a bowl of marijuana. ",
  "I them filled up my bowl with crushed Salvia, said a short prayer, something along the lines of 'Blessed be, powers that be' and lit up.  The smoke was surprisingly pleasant.  From some of the reports that I've read, people say that it's harsh and hard to hold in, but I didn't notice that.  I guess the gram or so of cannabis that I smoke everyday has prepared my lungs for it.  I toked deeply, holding in the smoke and counting the seconds.  I made it to about 10 before I had to exhale.  I immediately toked again.  I felt Salvia grab me.  My wife was next to me to grab the bong, and she told me that I didn't need the lighter anymore, as the bowl was tokin'.  I set the lighter down, and I sensed or heard this",
  "voice saying, 'oh, you don't think you're affected?' and giggling.  I don't think it was an auditory hallucination; I think I just was aware of the comments.  I took a third toke, handed my wife the bong, and laid back in my chair for the journey.",
  "I've read all of the trip reports about salvia that I could find, so I knew kind of what to expect.  I remember thinking after my last toke to just be calm, let it take me wherever it goes.  That was very reassuring, as it felt that I was being ripped out of our three dimensional universe and onto a plane that exists above it.  Kind of like a salvia space, I guess.  I remember feeling that Salvia was pleased with me for having taken the time to prepare for my voyage.  I felt something like a shuffling feeling throughout my whole body, like I was being shuffled into a deck of cards.  I also remember extending my arms, realizing that I had arms, and I could move them if I chose to.  I kept trying to comprehend what was going on, but it was impossible.  It seemed I could stay in Salvia-space if I was calm and focused on what was happening, not trying to comprehend it.",
  "I know that while on Salvia one is supposed to remain quiet and focused, but for some reason, I felt the urge to play the guitar that was sitting next to me.  I was half expecting to see some kind of visual representation of the music coming from the guitar.  I strummed a couple of chords, and they sounded horrible to me.  I quickly put it down, and closed my eyes again.  I found that the shuffling feeling lessened if I was calm, and breathing slowly.  I felt the urge to laugh during the entire experience, but didn't as to not to destroy my state of mind (like the guitar helped!).  I spent the remainder of my experience sitting with my eyes closed, kind of floating around in my thoughts.  About 5 minutes after I smoked the Salvia, I was ready to start sharing the experience with my wife.",
  "I went to sleep soon after and had very vivid dreams.",
  "I am writing this the day after, while at work.  Salvia has consumed my thoughts today, and I cannot wait to get home and experience her again."
 ],
 "erowid": {
  "id": "9865",
  "citation": " mylo. \"A Plane Above Our  Three Dimensional Universe: experience with Salvia divinorum & Cannabis (ID 9865)\". Erowid.org. Aug 6, 2004. erowid.org/exp/9865",
  "substance": "Salvia divinorum & Cannabis",
  "views": "5933"
 }
}
