{
 "title": "Healing and the Kingdom of Konfusion",
 "author": "chthonic231212",
 "citation": " chthonic231212. \"Healing and the Kingdom of Konfusion: experience with Mushrooms - P. cubensis (ID 20366)\". Erowid.org. Dec 20, 2004. erowid.org/exp/20366",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "5.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)"
 ],
 "report": "<p>He most often subscribes to the view that the inner world is as vast and complex as the outer world. In the moments when he loses that perception, inner and outer become separate. Think of one of M.C. Escher's works where worlds of paradoxical illusions present themselves so obviously.</p><p>Groundwork</p><p>1. On a walk a few nights earlier, it suddenly occurred to him that there is only the One and any other perception is an illusion. Giving it a name was too much though because that made it two instead of one, namer and named. Brief moments later the mind began its endless questioning and the insight was lost. It now thinks that its inquisitive nature is itself part of the One. This thought is a comfort for the self in the form of a compromise.</p><p>2. Fairly often lately a phrase had been popping into his mind: 'We are seeking the seeker.'</p><p>3. When the sacred fungi started appearing in his environment once again, he decided it was time to repeat the journey inward. The mind was reconditioned with a concentrated reading of 'The Secret Chief.' The basic technique (sans sitter) was followed. A prayer* was read aloud as a psychic energizer.</p><p>Process</p><p>Memory in terms of chronology was jumbled but the high points are intact. He was wafted along a cosmic highway for a while but then things got out of control. The character of the peak of the experience was very chaotic. Even an Olympic-level but unwise swimmer may find himself helplessly adrift in a surging tide. It seemed as if time itself was shattered into fragments that were discontinuously experienced and which even occasionally overlaid one another. He wondered if he'd poisoned himself and was about to die. He decided it was best to surrender as he'd promised*, committed to follow through to the end. Even so, his innate stubbornness did not allow going gently into that good night. But he knew he didn't have to remember all that would take place because transformation was the goal. There were many physical sensations including heat in various parts of his organism in contrast to the coldness his psilocybin trips often begin with.</p><p>Sequence: This trip shared with another powerful one over 6 months earlier auditory hallucinations in the form of voices speaking a language not understood. The speakers were getting frustrated and after strong efforts vowel pairs only were heard. Deeming their attempt unsuccessful, they abandoned communication in this manner.</p><p>Sequence: Remembering a technique suggested by an online psychedelic yogi, he focused on the very centre of his visual field. This was involuntary at first as there seemed to be the vague image of someone there attracting his gaze. At soon as he became aware of him, he got the telepathic message that the other was not there. After a while he got the idea that this stranger managed to convince him that he, the stranger, didn't exist. In order to believe this, our psychonaut had to suspend rationality and believe in the stranger's existence however. A strange paradox.</p><p>Sequence: Knights in not shining but dull, hammered armour. It seemed to him they were Teutonic, Crusader knights. They showed themselves during a series of arguments with God, complaints really, that later seemed very minor. Think also of Jacob wrestling with the angel in the 'Old Testament.'</p><p>Sequence: He felt old at times, aged and decrepit. There were manifestations of disease in his body, aches and sharp pains. Images of the crucifixion. He later remembered to look in a mirror where he noted the encrusted salt in white rings around his eyes. He taste-tested it.</p><p>Sequence: Inner light, at first white and splendid. Beautiful abstract forms in metallic textures, as old as God. Gratitude for what, he thought perhaps it was Terence McKenna, someone called 'vegetable television.' Now he was in appreciation mode and song softly and spontaneously poured forth along with the melody channelled through headphones.</p><p>Sequence: During the last half of the trip, he occasionally opened his eyes enough to watch the candle flame where he saw an angel of light, often with many others surrounding it. There was a friendly feeling. And once he opened his eyes wide to see in the white ceiling of the room a magnificent three-dimensional mandala.</p><p>Outcome</p><p>Higher levels of realization expressed as concepts are more accessible now. It has seemed to him lately that the human universe is an island in a vast sea of possibilities, perhaps as conceived by quantum physics. With the aid of some kind of medium such as crisis, sensory deprivation, deep meditation, or psychedelic agents, a psychonaut can swim to the horizon (here be dragons) and be voluntarily slain just as the old shamans did, his bones scattered to the deep. Yet his bodhisattva-like mission to return with something to benefit his fellows makes him stronger when completed.</p><p>He is always amazed at the resilience of the ego. Even when shattered almost completely, it regrows itself like a salamander's limb, albeit slightly altered. If we fall into extremities, the alteration could take the form of scars. If we courageously (fr. French: coeur [heart]) dive in, our greatheartedness is rewarded with a much-renewed form. Thus we are healed (fr. Germanic: hailaz [whole]) and radiate healing to others now, though the degree may be only a small step toward the One along the path through the infinity of being, each step already a paradoxical manifestation of the One.</p><p>Another paradox: this precious ego, which takes the form of objective images with more or less depth as circumstances invoke, seems to be identical with the timeless, dispassionate subject of awareness. He saw how Atman is Brahman and then let it go, trusting.</p><p>He was given simple and clear inspirations about various details of his everyday life. He hopes he can maintain the clear space in his heart to carry them out. His inner judge deems them to be minor given the seemingly hopeless challenges facing the human race, yet his faith in the power of little things is strengthened. Think of 'Lord of the Rings.'</p><p>He feels blessed to be one of the fortunate ones who travel this world in spite of his own and its imperfections. He suspects those very imperfections are paradoxically manifestations of its inherent perfection.</p><p>*Lord, I know not what to ask of thee;</p><p>Thou only knowest what I need;</p><p>Thou lovest me better than I know how to love myself.</p><p>O Father, give to Thy child that which</p><p>he himself knows not how to ask.</p><p>I dare not ask for crosses or consolations;</p><p>I simply present myself before Thee,</p><p>I open my heart to Thee.</p><p>Behold my needs which I know not myself;</p><p>see and do according to Thy tender mercy.</p><p>Smite, or heal; depress me or raise me up;</p><p>I adore all Thy purposes without knowing them;</p><p>I am silent; I offer myself in sacrifice;</p><p>I yield myself to Thee: I would have no</p><p>other desire than to accomplish Thy will.</p><p>Teach me to pray.</p><p>Pray thyself in me.</p><p>Amen.</p><p>--Franois de Salignac Fenelon, Archbishop of Cambray, 1651-1715 AD</p>",
 "year": "2003",
 "id": "20366",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-20T08:00:00.000Z",
 "views": "4802",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
