{
 "id": 20369,
 "title": "A Trip to Hell",
 "date": {
  "submission": "2013-02-25T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cece",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "This was crazy. Absolutely insane. And I will never, ever, ever, ever touch this stuff again.",
  "I was home from winter break from college when my friend invited me and all of my friends to a kick back at his house. There wasn't going to be any alcohol or drugs or anything like that. Just movies and rekindling with old friends. The guy I was seeing at the time, Connor, had a step brother named Toby, who was really into drugs.",
  "Toby asked me if I wanted to take a hit of this JWH-018 (aka hell drug). I agreed because well why not? We went outside and lit up for me and I took a massive hit for my small 5'5' 120 lb frame. Almost too much to handle. I felt fine for a little until about 10 minutes later when all hell broke loose.",
  "I started to feel my heart beat very fast and out of control. I got really scared because I've never tried anything like this before. Not even smoked pot. Anyway things were coming and going out of reality and I felt like it was just me looking at these two dimensional objects that were floating in space. Nothing felt real. I was trapped in this horrible dream.",
  "This is the point where I completely black out and start to panic, according to my friends. I kept telling them that I was going to die and that I had to call 911 or I was going to kill myself because I couldn't live like this forever. They kept telling me I was fine and to just relax and to enjoy it. I felt like I was a beam of light stuck in black empty vessel which was my body.",
  "I started to watch TV and be normal again but I just had the constant urge to move around so I got up and grabbed a handful of peppermints (not sure why) and began walking around telling myself that I needed to dance everything off and it would be okay.",
  "Eventually I settled down and relaxed and fell asleep on the couch but it was something I would never do again and definitely an experience I'll never forget."
 ],
 "erowid": {
  "id": "98906",
  "citation": " Cece. \"A Trip to Hell: experience with JWH-018 (ID 98906)\". Erowid.org. Feb 25, 2013. erowid.org/exp/98906",
  "substance": "JWH-018",
  "views": "978"
 }
}
