{
 "id": 20368,
 "title": "Rainbow Pavillion",
 "date": {
  "submission": "2013-07-23T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gbers",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "12",
    "grams": 0.012
   },
   "administration": "insufflated",
   "substance": "2C-B",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "This experience happened on a warm summer day with my friends B and A at a park near my house. We commonly visited this park to trip or smoke weed. We had about 5 capsules of 2-cb, each containing 15mg. I drove to the park and we dosed while parked on a back road adjacent to the park.",
  "We decided to snort the 2-cb which I had done 3 or 4 times before with moderate discomfort. I suggested we do two 6-ish mg lines. Immediately after the insufflation my nose is burning quite badly and nausea sets on. My partners report the same feelings and we exit the stifling hot car and cross into the park. Standing in a small open patch of grass near the waterfall and river I become extremely thirsty as do my friends. The three of us start vomiting simultaneously and becoming lightheaded as the psychedelic visuals come on very strong. I need a drink desperately and it my hysteria and desperation grab my car keys and decide to go to Wawa (a regional 7-11 type store) to get us all drinks. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "This was a major mistake of course, I left my cell phone with my friends for some reason and left alone. As soon as I pulled onto the two-lane highway I realized I had made a huge mistake. I had the type of visuals I had only seen before on 4-aco. Extreme scale changes, the other cars seemed silly looking and the road in front of me was coming at me in a way I had never seen before. Ive found it easy in the past to focus on serious endeavors when on substances and manage to get myself into autopilot. I make it to Wawa, only to pull into a parking spot to see a state trooper right next to me. I go directly to the bathroom where I begin hyperventilating and assessing the situation. The only option is to go forth with my plan and buy some drinks. I grab them, my hands shaking uncontrollably the entire time, and check out, all while a lady in line with me tries to make small talk.",
  "Calmly as possible I make it to the car and somehow drive back, while fighting tears at the stupid situation I had put myself in. I barely remember the drive back and I get there, distribute drinks and lay down on the grass, in disbelief that somehow I made it back. I thank God Ive made it back.",
  "Now we decide to take a little hike through the park to one of my favorite spots. We walk over a waterfall across big rocks and the flowing water is hyper-colorful and iridescent. Trees are greener than I have ever seen and walking through the tunnels created by them is so exciting and euphoric. We cross a big open field and up a hill to a pavilion overlooking the park. The concrete pavilion has a roof with rainbow columns holding it up and a picnic bench, leftover from the days when the park had summer camp for kids. We take a seat and smoke some weed together, and the visuals are so pleasant and beautiful. We look out at the open field and trees in the distance are subtly morphing and I feel really connected to my friends as we each explain what we are seeing, all of us having a great time. As we start to come down, we walk further up to some fields at the top end of the park where we find some other friends smoking and playing sports. As we come down and smoke, reintegrating into sober thoughts is very easy and comfortable.",
  "I always think back to this trip and remind myself of the danger of driving on substances, which should never be done. 2-cb is one of my favorite drugs and I hope to try it again."
 ],
 "erowid": {
  "id": "98901",
  "citation": " Gbers. \"Rainbow Pavillion: experience with 2C-B (ID 98901)\". Erowid.org. Jul 23, 2013. erowid.org/exp/98901",
  "substance": "2C-B",
  "views": "766"
 }
}
