{
 "id": 20371,
 "title": "The Bessemer Steel Process",
 "date": {
  "submission": "2004-09-21T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Will",
  "gender": "Male",
  "weight": 51
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "Let me start by saying that I was completely clean before this.  Never been high, never want to - never been drunk, never smoked, nor do I even wish to taste alcohol or nicotine.  But this, this is something different.  And it's the only thing I've done.  A few weeks prior a friend of mine had come up with putting me on acid, since, according to general belief, I rarely made sense anyway, and hyped-up I would surely be at least twice as interesting.  he put the idea forward to me, so I went and spent about a week thoroughly researching the chemical and its effects. ",
  "It was either a Friday or a Saturday night, and I had presented my friend with an enormous poster advertisment designed to coerce my fellow students into buying yearbooks - I had liberated it from the hall of our highschool earlier that week.  We and another friend of mine had been driving around shortly after nightfall, and had stopped in the parking lot of one of our local theatres.  we got out to take in a breath of fresh air, and my friend turned to me and held out an Altoid box lined with foil.  Inside there were these two little squares of paper, and as I looked at them I became just a little perplexed.  'I just take one?' I asked, and he replied, 'Yeah, take this one, though, I think something may've happened to the other one to make it a bit weak.  Just put it on your tongue, and hold it there, you can touch it to the roof of your mouth if you want.'  'Kay,' I said, and took it sitting down in the back seat.  we drove around for a while larger, while my friends constantly interrogated me, asking if things were breathing (I had no idea), if car lights were streaking, and things like that. ",
  "After we drove around a bit more, we decided to stop by a place where a few more of our friends work, and would just now be closing.  When we got out of the car, I was aware of feeling slightly jittery, and was making the occasional grin every now and then.  My other friend brought with him the poster, so he could show it off, and in we went.  I stood around and looked about, and I remember someone telling a joke that was barely funny in the least, but I found myself laughing hysterically, actually to the point of having tears in my eyes.  As I recovered, someone hit me in the back with the folded up plastic poster.  I felt like I had never been more terrified in my entire life.  The shock must have been readily apparent on my face as I stiffened, as several of my friends gave a light chuckle.  Minutes later, I was hit with the poster again, and found it just as terrifying.  Afterwards my friend took me to the bathroom so I could see my pupils in the mirror - I don't recall being particularly impressed, although this was most likely due to the fact I never pay attention to my pupils anyway. ",
  "Sometime, during this brief gathering, plans had formed to go to a friend of mine's, Jessica's, where apparently everyone I was good friends with were going to to watch everything all come down.  We got back in the car, and I made sure to lock the door; just in case I got some sort of stupid idea, which, of course, I didn't.  About five minutes later I felt slightly nauseous and puked.  I had the foresight to keep my mouth shut, but nobody knew no matter how many times I kicked on the seat.  Eventually, after another desperate 'Mmm!' the point got across and my friend sped up to about 85mph so he could pull into the parking lot of our old middle school so I could puke on the entrance road instead of his seat.  At this point, of course, I was coming up rather strongly and was having incredible difficulty with the door lock.  I finally managed to open it, gave up on the seat belt, and leaned over and puked.  I was duly impressed with myself - no mess, and I usually made one sober!  After my friends made sure I was OK, we got back in the car.",
  "I was, by now, grinning like a madman.  My friend stressed to me how important it was to act normal around the parents when we walked into the house; before we could get downstairs we would most likely have to deal with them.  I nodded firmly, feeling like I had just been charged with a very important mission.  We pulled up to the house, and as I got out I immediately threw myself into the ground and rolled around on the grass.  Presumably, this was to wipe off the vomit that wasn't actually on me, but whatever.  I felt like I was ready, said so, and we went up to the door.  'Don't say anything,' my friend warned, and I nodded again.  Mission Impossible music was playing in my head.  The door opened, and we were escorted in, and as we passed the parents, I felt brave.  'Hi!' I ventured, waving happily before I turned to follow everyone else downstairs.  I had succeeded in fooling them!  I felt like a total badass.  We went into the basement living room, complete with sink, couches, lights, and a 50-billion inch TV.  Everyone was there, just staring at me.  I grinned. ",
  "We spent some time just talking while I stared transfixed at the Ottoman.  It had a wavy pattern to its cloth, and it was flowing and moving back and forth.  'Jessica!  You have the coooooooooooolest Ottawa!' I exclaimed, and then abruptly stood up.  'I want some water,' I said, and headed over to the sink.  A few steps behind the couch, I lost my balance and fell.  I was helpfully informed that I needed to walk more like jello.  As I stood up, I gasped, suddenly aware of the fact that my centre of gravity had been moved.  I tried to explain this, but something got lost in the translation and I just blabbed, 'My crotch is falling!' This was met with widespread amusement and acceptance, and I turned to the sink, successfully filling up a glass with water.  It was a glass but had that fancy almost crystal look to it. I held it in my hand and swirled it a bit, as if it had wine in it.  I have never had wine, but, well, I had seen movies.  I sure felt debonair.  I was calm - cool, collected.  I sat back down, leisurely sipping from my drink and acting normal.  It lasted about, oh, thirty seconds, and after that we got into a conversation about magic tricks. ",
  "Something started to form in my mind, and I will try to reconstruct my thought process of about two seconds here for you: 'magic copperfield showgirls TV trick watre glass tiger zebra Oz dinosaur apples trick magic stuff.' This resulted in me feeling sorry for the poor, exploited showgirls, and to show my compassion, I offered up, 'If I were David Copperfield, I'd turn my boxers into a lady.'  This too was met with much approval, although I don't quite think anyone got my meaning.  I lay down on the floor, and somehow mentioned that I had guts of steel.  'Didn't you vomit on the way over here?' someone challeneged, but I was ready!  I was prepared.  We had just learned about it in history, so I felt like now, right here, on LSD, would be an EXCELLENT time to show how smart I was.  'Yeah, but back then, I had guts of copper.  They're steel now.  They underwent the Bessemer Steel Process.'  Another friend of mine, a grade level below me, blinked and looked up.  'What's the Bessemer Steel Process?' he asked, and I stood to tell him. ",
  "I was peaking at this point, and drooling a little so I must've looked like I was foaming at the mouth.  I wiped my mouth off, and nodded.  'Well, I'll tell you.'  And I did.  Kind of.  A bit.  I started on what was going to be an informative lecture, but somewhere I got sidetracked.  A lot.  Over and over.  In the same spot.  I had to keep being reminded, but since I kept losing steam, I had to start over.  My friend put his hand on my shoulder and gently suggested perhaps I ought to lay down.  In the hallway.  Away from everyone.  I wiped more spittle from my mouth, and agreed.  I lay down in the darkened hall, and closed my eyes.  I had some of the most incredible visuals I ever have.  They were in deep tones of VGA, the psychedelic reds and greens swirling into some kind of vortex I was falling through.  I was aware of demons clawing at me as I plummetted, and I raised and let my arms drop as I rolled from side to side, bumping into the walls and thumping my hands on the floor.  I suddenly felt very snake-ish, and was aware of just slithering through grasses, tasting the air with my tongue. ",
  "I lay there for about twenty minutes, relishing in the different realms of my consciousness before I got up and slowly walked back into the room.  Whatever convesation was going on, it stopped upon my arrival.  It was like one of those scenes when the kooky comic relief walks into a saloon in the old west.  Everyone completely stopped and stared at me.  I walked over, next to Jessica, and sat down quietly.  'So, what happened?' someone asked me.  I grinned and stretched out on the floor, closing my eyes and splaying my arms out in front of me on the floor.  'I was....a snake...' I said, and wriggled around as I kept my eyes shut and visualized sliding and slithering around.  I never divulged to any of them the rest of what I saw and experienced, as at some point I realized there was pizza.  I had been playing with the dog the whole night, and as I got up, this time was no exception.  I stood, and asked if I could have a slice.  'Sure, man, help yourself,' my friend responded. I stood, took a slice, and sat back down.  It was delicious, and as I finished up the last of the cheese topping and was left with just the saucy remainder of the crust. ",
  "I became acutely aware of the fact the dog wasn't around.  'Say, where's the dog?'  I asked, and then glanced to what appeared to be a bloody chunk of meat on a bone in my hand.  I was HORRIFIED!  What a faux pas!  Here I was, invited to her house, eating her food, and there!  I had just EATEN HER DAMN DOG!  'Wait...no.  That's stupid,' I said, and laughed.  As far as I know, only maybe 3 people realized what I was thinking.  Someone mentioned that someone else was coming over, and my friend conspiratorially suggested that nobody tell him I was on acid.  I stiffened, picking up my glass of water again and instantly feeling suave.  'Yeah, okay.  I can do that,' I said.  I managed to remember I was playing it cool for maybe almost a minute before my underclassman friend looked at me.  'So...what's the Bessemer Steel Process, Will?'  I gasped in astonishment.  The Bessemer Steel Process!  That had been YEARS ago!  'Wow, okay!' I said, and as he delightfully giggled and everyone else groaned, I launched into my lecture again. ",
  "The newcomer arrived, and periodically I would blurt, 'Shit!  I forgot where I was,' and after picking up my water and doing an awful job of acting normal for a while (30 seconds, tops), I would forget what I was doing and launch into the steel refining process again.  I went on for, I'm told, about TWO HOURS.  Two hours of the same four or five sentences rephrased constantly.  It would have been longer, but the girl whose house were at distracted me with the jellybeans. Eventually midnight came around. and we had to leave - no boys after 12!  We are apparently notoriously naughty and not to be trusted.  It was time to say goodbye.  I turned to everyone in kind, saying goodbye to them all.  I even caught a reflection of the glasses in the TV, and bid adieu to them as well. 'Bye, Crystal,' I said, and nobody really paid much heed.  We went back to the car, to my friend's house, and into the downstairs basement apartment.  I crashed on the bed while he put on some Tool or something, leaving me inside the dark bedroom all alone. ",
  "With the door shut, it was pitch black and the only thing I could make out was the phosphorescent glow of the plastic bat hanging from the ceiling.  I felt like there was an infinite expanse of vast space before me, and as I closed my eyes I could hear the dull throb of the base and guitar chords in the next room.  I saw the images of electric yellow oscillating and pulsing and cracking like light on my eyelids.  I don't know when I fell alseep, but it was a GREAT night.  There are several things that don't fit into any particular time frame - my friend trying to get me to tell him when a minute had passed, and me making feeble attempts every few seconds, or thirty minutes later, stabbing in the dark to guess.  I remember petting the dog and becoming aware of the fact that with my eyes closed I was playing the dog like a harp.  I saw bone and sinew stretched between as I plucked the cords, hearing the music that nobody else could.  It was beautiful to me, but I garnered only horrified stares from the two people who realized what was going on. ",
  "I remember a friend of mine walking in the room four times in a row, which completely bewildered me.  I remember him putting the jellybeans up high, daring me to get them, and I simply jumped over the couch.  Hot damn, I felt triumphant.  There is lots other, but this is just what sticks in my mind the most.  I've dropped acid almost twenty times since then, and love the experience every time, always new and different way."
 ],
 "erowid": {
  "id": "9891",
  "citation": " Will. \"The Bessemer Steel Process: experience with LSD (ID 9891)\". Erowid.org. Sep 21, 2004. erowid.org/exp/9891",
  "substance": "LSD",
  "views": "5765"
 }
}
