{
 "title": "Intense and Stormy Trip",
 "author": "Nemo",
 "citation": " Nemo. \"Intense and Stormy Trip: experience with Mushrooms (ID 20376)\". Erowid.org. Mar 30, 2007. erowid.org/exp/20376",
 "substance": "Mushrooms",
 "bodyweight": "169 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " T+ 2:00",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>I had planned this trip out for months; Shroom with my two closest friends, connect in a special way, freak out, write some music, just a good night.  Something was different from the start; the dealer was a friend of ours who picked the shrooms locally, we sat in his house smoking a bowl and talking about the trip we should expect for about 20 minutes before he showed us our bags.  These were different from varities I had used before; long and skinny with tiny caps vs fat caps with broken stubby stems, they were in perfect condition denoting that this dealer truly had the welfare of us and the drugs at heart, they weren't even bruised or broken in any way.  We were strongly advised to do a tea method with these; wanting to think we were hardcore we just crunched them instead, this was poor choice the first, the dealers last words were 'if you eat that whole bag you'll freak out'. </p><p>We got back to my house where the experience was to take place; at about 9:30 we started munching, I ate 3/4 of my bag compared to the 1/2 my friends ate, and we settled back to await the trip.  My friends were playing chess while I watched; we talked quite a bit about how green is a good color for trips, and the lights seemed to bright so we killed them, we were all feeling extremely giggly and happy at this point.  My visuals kicked in after about 30 minutes; I was beginning to see objects growing larger out of the corner of my eye, soon I noticed that a wall was very clearly breathing and announced that I was starting to go, my friends didn't have any visuals for about another 15 minutes so I just sat back and enjoyed the ride.</p><p>Things got really chaotic in a hurry for me however; the room began to spin around incredibly fast, and I was having very rapid visuals where single objects grew and breathed while walls began to disintigrate into nothingness very quickly.  My friends finished their game and we went down to watch a movie, poor choice the second; the movie was 'Bumfights' which was absolutely the worst thing we could have watched, the tripper is in very delicate and vulnerable mindset and a movie about fighting and drunks shed a totally different light on the experience.  My freinds sat back and laughed at it, I was having a fucking intense trip though; I began to feel extremely drunk and everything took on a sort of neon-pastel green and blue light, my vision was spinning and I was lost in a dreamy sort of trance, when I looked at something I could see different dimensions out of both eyes verging in on what we all knew as the world.  I was feeling like I was in a dream world; I had an incredible sense of deja vu that lasted the entire time, and I was remembering vacations I'd been on recently so clearly that the world around me resembled my thoughts.</p><p>My mind was storming; I heard doors opening and the contents of my head roared out for me to see I could hear thousands of whispering voices talking above what sounded like a wind storm rushing through my head, listening to my friends talk was driving me crazy on top of all the other chaos and confusion.  My brain must have been fried becuase I looked totally ripped, I was so confused by the simplest things that I began to just disconnect from the world and float off into another little reality I had discovered that was 'real', closing my eyes I could see this new world, I could smell colors and see emotions like pain or sadness, but I had lost my mind very literally.</p><p>I was overwhelmed by the strength of my own thoughts as they stormed me; I remained calm but constantly battled for sanity against voices that spoke in tongues but their words became clear through my own thoughts, I had to prove to myself over and over again that I liked what I was as a person.  The movie was in black and white because we couldn't figure out how to get it in color; We saw colors through it all of course, less than I'd experienced before with different kinds of shrooms, visuals had begun to lose focus as my vision had begun to spin around so fast that I could only concentrate on just remaining calm, I closed my eyes to make it easier. </p><p>We tried to go outside for a walk and smoke some, but I got too cold and had to go in; something about the cold and the outside world was so frightening, I was even talking to my friend and suddenly realized he was scaring the shit out of me, I panicked as I looked at his eyes (wide with surprise) and had to run away, I felt other entities zooming around taunting and laughing at me and asking why I was so scared.  Parts of this trip were really terrifying, I knew I was losing my mind when I could hear and feel very distinctive beings around me; it was like being a schizo really.</p><p>I finally recognized that these voices were really mayan gods; they sent me signs in the forms of visions of mayan cities and symbols that made me conclude this, there were thousands of them at a time that would tell me whatever.  These gods of the Mushroom decided to show me what I really was, they stripped me of the person I wanted to be and put me back as a baby, telling me to grow up again, I saw what I had been (living on the edge, drinking a lot, realizing I was comparatively lightweight now) and didn't like it too much, that's when I totally lost touch with myself. </p><p>The movie ended and we returned to my room to smoke a bowl and come down; I was lost as I loaded the pipe, confused about what the world was, I had begged for a sign to see what I would do in life and was shown the lies that surrounded the everyday life of a person and the ways of the world all suddenly seemed so clear.  The was a feeling I'd had before, but this time it was much more overwhelming and intense, at this point I ate the last bit of my bag; I did have an extended peak due to this, but not as confusing and chaotic as the first one had been.</p><p>My visuals had persisted though I couldn't pay much attention to them, my eyes were not important to me anymore over the new telepothy I had discovered; nevertheless I noticed that while I watched a wall I would see the movement of energy speed up and erode it away entirely in seconds, the energy my mind was sending forth was incredibly, it was everywhere and both my friends could feel it.  Throughout the night their attention shifted to me many times; I would suddenly hear voices calling my name and I could feel the psychic energy of my friends turn to my direction, at one point I was playing guitar and had intense musical energy that wouldn't let up, my friends had been talking and they suddenly noticed me, I heard them saying I was lost in my own world and that I was really playing from the heart.</p><p>As one friend began to say something about me becoming some sort of great person I heard all the voices very clearly proclaim that I was a visionary leader; I wanted to have a band that I played guitar and sang in, one of my friends was my fellow guitarist who I always thought of as a visionary in his own way, suddenly I was being told that I was in fact the leader and that the people would follow me when they realized what I was, it gave a very hopeful life altering message to me that was an incredibly emotional experience. </p><p>Gradually the trip faded after that, the storm began to settle down and the voices quited as I returned to the world; I had seen myself in the mirror, seen a hollow and souless expression in my eyes, I know my being was on some distant astral plane where I could hear the voices calling me, it was like inhabiting a differnt body of myself for a few hours.  we lay in my room listening to the genius of Pink Floyd and burning Nag Champa while we just vegged in bed and gradually faded into sleep; it was an exhausting but very empowering night, intense and harsh but always with a feeling that I was enjoying it and ultimately very happy, I became much more contented with myself and came to be very hopeful about my future.  Of course we all connected and felt like we were all together and on the same mindset and all, but I got hit hardest the next morning.</p><p>I had felt so drunk the night before but had no hangover or anything in the morning, I found however that my body had been literally drained of all it's energy; my legs wouldn't work for a while, they just didn't move the way they're supposed to, at one point they simply gave out and I crashed to the floor like a drunk, this same thing happened with my hands.</p><p>While walking my friends down to a bus stop I again lost control of my legs and just fell down unable to stand anymore; I was forced to crawl on hand and knee recalling being stripped down to a child again and trying to think what the fuck was happening to me, Eventually my arms crumpled as well and I fell on my face, this was at 1:00 in the afternoon on the sidewalk where thankfully a lot of people were not around to observe this very odd behavior, they would have just assumed I was drunk as hell anyway I'm sure.  Finally I was able to stand and walked very awkwardly back to my house, later trying to play guitar I lost control of my fingers too, this is a really sad thing for a musician; I had absolutely no strength to move them anymore, and had to give up most activity for the remaining day and the next. </p><p>I used to think I was a hardcore user who could handle anything, I took the experiences lightly just wanting to be fucked up in some way; this trip was so furious and intense that it humbled me significantly, I now am very devoted to spiritual use of natural hallucinogens like mushrooms or peyote.  I thought I was more powerful than the drug which was folly, and I got rather harshly punished by the shrooms for crap like that, The force of my own thoughts was overwhelming, but I proved to myself that I did have a strong being that was able to tolerate an experience like that and come away plussed, amazing and magical things mushrooms.</p>",
 "year": "2003",
 "id": "20376",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-30T07:00:00.000Z",
 "views": "2742",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
