{
 "id": 20382,
 "title": "Tense Nerves",
 "date": {
  "submission": "2013-05-28T07:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "bujmiv",
  "gender": "Male",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "4-MeO-PCP"
  },
  {
   "time": " T+ 2:00",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "4-MeO-PCP"
  }
 ],
 "report": [
  "I got a free sample of 4-MeO-PCP. My intention is to write a decent report on my experimentation with the substance.",
  "This morning I took 300 mg dextromethorphan (pure). This is fairly normal for me. I take this amount 3-4 times on an average week. It plays multiple roles in my life, the two main ones being: my DOC, and my mood stabilizer. I have a high tolerance to the DXM and function fairly normally even on 300 mg.",
  "At 23:40 I ingested about 100 mg 4-MeO-PCP. My scale tends to be off by 5-10 mg. It tasted like I would expect a burnt transistor to taste. Very bitter like most drugs.",
  "T+0:40 - I feel normal mentally but I think I'm starting to sense a change in my body. Blood pressure change maybe, don't know. Going to play a computer game or something for a bit.",
  "T+1:00 - Laid down for a few minutes and started noticing patterns in the dark. When I opened my eyes I realized I feel kind of light and I'm getting slight tracers.",
  "T+2:00 - Weak feeling like I'm coming up on DXM or nitrous maybe. Brain is starting to act a little odd. I am taking 125 mg more to make up for what I perceive to be a dissociative tolerance.",
  "T+2:30 - Stronger CEVs, feel weird. Sensation in body like I'm anxious maybe. Thought I needed to pee but nothing came out. Feel tired but it might just be because I got up early today. Starting to get those sensations where you temporarily feel lost/confused. Losing balance and vision starting to 'lag.'",
  "T+2:50 - Comeup has never stopped. I keep feeling more strange. I was washing my hands and something weird happened. I started hearing a female voice telling me 'I know you are there' accompanied by a rushing sound. At the same moment my vision dimmed heavily for a second and my neck twitched one time quite violently. I have not been doing much. I talked to my roommate for a bit then laid down longer. Played one game of Starcraft II and did terribly. While playing or talking I found that my train kept getting interrupted by nothing. Basically I'd talk and lose part of a sentence but still be able to recall what I meant to say. In Starcraft I could still control fine but I couldn't strategize easily.",
  "T+3:00 - It keeps feeling stronger. I am accidentally bumping into things around the house even though I'm not wobbly. Just depth perception and self awareness are disappearing so far",
  "T+4:00 - I am quite dissociated. When I sit completely still there is a growing uncomfortable sensation in my body, particularly my arms and legs. It is very unpleasant. Strange disconnected thoughts that don't make sense.",
  "T+5:00 - With my eyes closed I go to a vivid dream world and unlike DXM or NO2 I can remember what I experience after I come out of it.",
  "T+6:00 - My body feels like it's being pulled to the ground but I feel weightless. Odd.",
  "Retrospect: I might test this more in the future. A bit before I peaked I felt very uncomfortable. It might have been histamine release. Next time I will definitely try to be well rested, 100% sober and take a dose more like 150mg. Another factor was that I dosed on a full stomach. The experience was not euphoric at all, it was not dysphoric either though.",
  "Another report described something like neutral paranoia. This drug made me hear voices and see shadow people but it wasn't scary at all. I didn't feel like anyone was out to get me but I kept sensing nonexistent things trying to interact with me."
 ],
 "erowid": {
  "id": "99012",
  "citation": " bujmiv. \"Tense Nerves: experience with 4-MeO-PCP (ID 99012)\". Erowid.org. May 28, 2013. erowid.org/exp/99012",
  "substance": "4-MeO-PCP",
  "views": "1153"
 }
}
