{
 "id": 20385,
 "title": "Faces In The Walls",
 "date": {
  "submission": "2013-07-15T07:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "T",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "mg"
   },
   "administration": "buccal",
   "substance": "25C-NBOMe",
   "form": "blotter/tab"
  },
  {
   "time": "1:00",
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  },
  {
   "time": "2:30",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  },
  {
   "time": "5:00",
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "So at this time I was 19. It was in December (spice products became illegal in January) and I just got a new batch of NBOMe blotters. I've been experienced with these before, I had tripped approximately 12 times before this experience. I always took 2 mg (2 blotters) of 25i-NBOMe. Well, I told my buddy that these weren't doing it for me and it was getting kinda expensive and to kick it up a notch. Little did I know, that I was about to have the trip of my life with the new batch.",
  "Now, he said these were stronger and there was a larger dose to each blotter (2mg/blotter). What he didn't tell me is he changed the type of NBOMe. I am used to 25i; he gave me 25c. 25c is far more visual, and 25i is more of a high an euphoric feeling.",
  "+0:00. I put the blotters in to test around 6pm after work, careful to keep on the upper gums for max results. I only do 2 since I know I'll be taking about 4 mg. This is a high dose since they are active at 500 g.",
  "+0:30. I kept sucking on them through my upper gums to completely absorb the chemical, and was careful to not swallow my spit. At this point I can definitely feel the effects, and the come-up was a bit rapid for the next half an hour.",
  "+1:00. I am almost at the peak already, at least the peak of what I'm used to. I started to smoke some ultra strength spice product to better enjoy my high. The moment I hit my water pipe, my roommate (A) came home with a couple of her friends. She doesn't know I do acid, so I had to blame my pupil dilation on the spice.",
  "+2:00. After chatting for an hour with her friends that I just met, a couple of her other friends came over and brought alcohol. (A) asked me to plug in her wall fan cause (I) was over heating. I found it difficult to move since my heart rate was up, and I was over heating myself. I plugged the fan in, and looked like a complete moron, cause I couldn't figure out how to turn the damn thing on.",
  "+2:30. Around this time, we start playing beer pong. I've smoked a few bowls of spice now and I am tripping out of my mind. The alcohol wasn't helping much either. Somehow, even as the cups get father away, then close up again, I was able to make a few, and ended up winning 3/3 games.",
  "+3:00. After a few rounds of beer pong, which felt like forever, I decided to go to the bathroom. I looked at myself, and my eyes are black. Hardly any color is showing anymore and I have full blown visuals. The carpet was swirling and as I looked at the wall behind the toilet, I saw a face in the wall. It creeped me out a little, yet at the same time I was fascinated by this. I drink and talk for a few more hours.",
  "Time seems to drag on, only a few hours has gone by, and it feels like an entire day has gone by. I am in a slight bit of pain in my legs, it only happens when I move too much. I laugh way too much, everything seems to be funny to me. I am having the time of my life.",
  "+5:00. Things start to wind down a bit. I decide to smoke from my glass bowl. I hadn't smoked from it in a long time and forgot just how good it hits. I ended up smoking way too much and discover that spice products increase visuals. I was way too high, and had to sit with my face in my hands until I came down a little bit. Every time I looked up, I saw faces in the wall, or I saw people doing things they weren't really doing. I was a little panicky at this moment. My roommate (A) was beside me and I was sure she could tell I was a little out of it.",
  "After all of that, things started to wind down and a couple people had to leave. Everyone who stayed ended up going to bed. I couldn't sleep till about 3 in the morning because of the NBOMe. Overall, I had a blast. Even though it is a research chemical, it is one of my favorite substances to take. I would recommend anyone to try it. I felt fully rested the next morning, and filled with energy. But usually after that after effect, my body is completely exhausted."
 ],
 "erowid": {
  "id": "99059",
  "citation": " T. \"Faces In The Walls: experience with 25C-NBOMe, Spice & Alcohol (ID 99059)\". Erowid.org. Jul 15, 2013. erowid.org/exp/99059",
  "substance": "25C-NBOMe, Spice & Alcohol",
  "views": "677"
 }
}
