{
 "id": 20381,
 "title": "The Happiest Trip Ever",
 "date": {
  "submission": "2000-11-14T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shroom Girlie",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "About 2 weeks ago I decided to venture into the world of magical mushrooms.  I only started experimenting with drugs this year, and mushrooms would be my first hallucinogenic drug experience.  A friend and I ate them with apple juice as a chaser at about 8:45 AM. They tasted pretty gross but it was manageable. We were staying at a resort, so we decided to go and sit in this lounge area and wait for them to kick in.  About 20 minutes later we became giggly and were acting kinda weird. I'm not sure if it was in anticipation or what. My friend, who weighs only 100 pounds, starting feeling it about then and said my face was melting off.  I was surprised because I was expecting it to take a lot longer to kick in.  We went into this bathroom and I started feeling a body high and the walls were closing in on us. We ran out, sat outside and smoked a cigarette.  Plants were starting to look very weird and we got this weird urge to run and find a hidden meadow. So we did.",
  "Thank god we were in nature and we knew that there would be a meadow across the street. We made our way over there, but got distracted when we decided to lay down in the grass road divider.  We called some car over to us and asked them how to get 'downtown,' but I had a very hard time talking to them and understanding.  This was about 45 minutes to an hour after we ate the mushrooms.  We went through the barbed wire fence and walked around in some brushy forest-like area.  Everything was so weird, and we felt fearless. We met a couple of trees, one named Henry who had a very distinct personality to us and we took a picture with him.",
  "We noticed a clearing and upon arriving at it we realized it was the perfect meadow. Small grasses, wild flowers, beautiful bugs, everything we could ask for.  By this time we were feeling it so powerfully that we could barely stand. We sat down and talked to the bugs. I spent about 2 hours looking at the clouds, which were making pictures, swirling and rolling like an ocean. Colors were bright, and everything was extremely over-stimulating.  Ugly things were beautiful to me and the (real) bugs crawling all over my arm were not a threat, but my friends.  I remember talking to a bee, saying, 'Look at you over there bee.  Just doing your job so wonderfully and polinating like you should.  How great!'  Or something bizarre like that.  The small hairs on my friend's face were crawling all over and they made me laugh.",
  "I brought crayons and my journal to write in and I was glad I did. I had some intense thoughts about humanity and our existence. I felt a strong feeling of hate towards other humans besides my friends, for how they've fucked the world up.  I felt like shrooms were a tool for humans to use so we could see our wrongdoing and appreciate wildlife like we should.  I remember thinking many other things that I don't remember, but that I wanted to write down but I couldn't because my words were crawling off the page.",
  "After about 4 hours we decided to see somewhere new. We tried to walk downtown, but after about 10 minutes of being around some people and houses, we couldn't stand it and decided to get our hippy asses back to our meadow. We started sobering up and had a little picnic with apples and oranges (THE best apples and oranges I've ever eaten). We started to realize that there were nasty bugs and spiders crawling all over us and biting us.  We got a little freaked out and walked back to the resort.  Once in her house, the doors, cabinets, and everything seemed to have a life of their own and were breathing.  We felt like smoking some weed, but we didn't have any.  We took showers and walked around the resort a little more. The body high was gone and almost everything was normal; this was about 7 hours later.  At about 12:30 that night we noticed that things were still tripping us out and we couldn't understand it. ",
  "Now it is almost 2 weeks later and I am either still slightly tripping or having flashbacks.  I noticed yesterday when I was extremely tired and I was looking at this textured ceiling that it was swirling and moving a lot.  It is hard to concentrate on things without spacing out.  This doesn't happen too often, but it is kind of weird.  I loved my experience with mushrooms and it really changed me in a way. Before, I used to litter and disrespect the environment, but now I think twice about it and have some respect.  Mushrooms are great if you do the right amount, but just like many other drugs, I've heard of some scary trips by people who've taken too much (like my boyfriend).  It's definitely my drug of choice, and even though I also love Ecstasy, last time I did it all I could think about were the wonderful mushrooms :) So eat up, and enjoy!"
 ],
 "erowid": {
  "id": "990",
  "citation": " Shroom Girlie. \"The Happiest Trip Ever: experience with Mushrooms (ID 990)\". Erowid.org. Nov 14, 2000. erowid.org/exp/990",
  "substance": "Mushrooms",
  "views": "10580"
 }
}
