{
 "id": 20389,
 "title": "Mostly Heightened Colors and Sounds",
 "date": {
  "submission": "2013-02-21T08:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jonah",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "2C-B-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": "0:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "4:30",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "2C-B-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "At around 1pm I dropped 3 400 mcg blotters, at 30 minutes in I started to feel some euphoria and then proceeded to smoke some cannabis. After driving around for about an hour we arrived at our destination, a nature trail by the beach. After about 3 hours of walking around the forest and getting mild visuals I dropped one more blotter. Around the time the sun started to go down we left the nature trail and headed back to my friends house. We went out back and took a few big hits out of his bong and this is where things started to get unpleasant.",
  "Suddenly I was getting extreme tracers to everything and had a paranoid feeling hanging over my head, and a thought in the back of my head that maybe I had overdosed on a non researched compound. I was having a hard time getting words out and basically just asked for food after realizing I hadn't eaten in 8 hours. We drove over to Wendy's and I felt like I was shaking the whole drive over, I ordered exactly what my friend ordered because I was still having a hard time speaking. After we ate (which felt like it took forever) my paranoia started to dissipate and we went outside to check out a corvette show in the parking lot.",
  "After we returned to my friends house I still felt a need to be around other people and lights, so we drove to Miami to visit a friend. Sitting in the car I really started to calm down and by the time we got there I was ready to smoke some more cannabis and then I realized it was the indica strain we had that put me into the scary mindset early, when I smoked a bowl of that and went back into it, then hit the sativa and came back down to earth. I got home and went to bed around 4 and woke up feeling fine the next day.",
  "Overall mostly heightened colors and sounds with a light body load and a few instances of really intense tracers. Also I had dropped one the day before which might have contributed to the mildness of the overall experience."
 ],
 "erowid": {
  "id": "99096",
  "citation": " Jonah. \"Mostly Heightened Colors and Sounds: experience with 25B-NBOMe  (ID 99096)\". Erowid.org. Feb 21, 2013. erowid.org/exp/99096",
  "substance": "25B-NBOMe ",
  "views": "2012"
 }
}
