{
 "id": 20393,
 "title": "Gimmie More",
 "date": {
  "submission": "2007-04-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "I",
  "gender": "Male",
  "weight": "250 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": "0:45",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": "1:15",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": "0:00",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0:00",
   "amount": "2 carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "report": [
  "[Erowid Note: At an average street dose, 15 geltabs of LSD is considered an extremely high dose, see LSD Dose Chart]",
  "I must pretense this writing by communicating to you the fact that I was heavily engulfed in a bad sleep-deprived state, a string of no less than 93 days without proper sleep had left my mind and body so dilapidated that I was forced to cease all normal human-like existance and instead assume the function of some program-less, ever-wandering cyborg.  This is how I managed to use drugs to counter the effect of drugs:",
  "After about 3 mos. of heavy acid usage(supply was astonishing)I had found myself in the situation described in the pretense.  When a person becomes that sleep deprived things become, to say the least, out of whack.  I was VERY frustrated with the task of falling asleep (sleep onset apnea) because it had not been working for me at all.  This condition, to the best of my knowledge was an acid-derrived state due to the changes of the seratonin levels in my brain from taking LSD for approx. 3 years continuously previous to this experience. ",
  "On a night like any other, I had decided to do my usual dealings w/my friend/dealer 'B' and I purchased 20 geltabs of various colors from him.  This was a particularly 'feinding' night for me, my desire to trip became acutely intense after purchasing the geltabs (the reason for this escapes me at the moment).  I had planned on selling most of them, and mabey eating one or two just for 'shits and giggles'.  When I had arrived at my companions bordeaux, my closest tripping buddies had already found themselvs a connection and began the nights journey w/o me. ",
  "Standing in the kitchen I threw 5 in, thinking that it would be enough.  45 min. later I felt nothing.  I sat waiting for that first tingle in my spine that indicates the LSD's arrival to the brains neuron receptors.  The anticipation was great that night, 45 min seemed like an eternity.  I couldn't help but throw in another 5 out of sheer frustration, by this time I was on my 3rd beer. ",
  "I had then decided to smoke some of the Kind, my friend 'M' was harbouring a 4-foot dead bear bong in his closet which I proceeded to lovingly torch, took the whole bowlpiece down in one amzing rip.  After another 30 min or so, all I could feel was the lady jane.  Dissapionted was I.  So, naturally, I threw in the other 5.  The second I threw in the others, it hit me HARD.  I was startled, my anger had taken away my attention, and it crept up on me like never before.  Suddenly I was scared, thinking that I had embarked on a not-so-good trip. I was sitting in the dark w/my friend 'M', everyone else decided to go for an adventure to the corner store.  They were tripping heavily already.  The room decided that it didn't have realistic paramaters, and opened up to the heavens (there were those little glow-in-the dark stars on the celing).  Litterally an instant after that, it all went away, I was back to normal. ",
  "I haven't ever experienced anything like that before or since, it completely threw me off of my game.  I remember wondering if I was having some kind of aneurism, or if something had just snapped.  that thought didn't last long as I found myself travelling from the couch to a spot in the corner of the living room behind the chair next to the couch.  'This chair is my friend' I began saying to myself.  I needed one seeing as how 'M' was totally wasted and worthless talking some kind of gibberish.   As I was crouched up in a ball in the corner of the dark living room, our friends came back from the store speaking of tales of potato chips, and the police man to whom they engaged a pleasant conversation, all the while wide-pupiled and completely confused.",
  "To my surprise, the trip began setting in nicely, and luckily for me they decided to watch 'Monty Pythons the Quest for the Holy Grail'  I got through the intro with just a heavy body buzz, and about the time that the black knight was encountered, I totally lost it, I could see nothing but the t.v. screen which was a pure plaid pattern.  I saw the sound coming out of the t.v. like a wave on some wild oceanic storm.  It sounded like thunder in my head every time a wave would crash into me. I heard all of the sounds all at once.  The t.v. screen began to make its way towards me, it wanted to tell me something, but I had to ask it, so I did, I said 'what moveth for you screen of the T.V. kind you?!?!' (remember that I was watching the Holy Grail) it stopped for a second, and then (here's the best part) it ATE me, I was inside the t.v. looking out at my friends and myself hovering above them.-!?!-.  I had to work my way through the wire-like intestines of that horrible zenith to escape it's decevingly warm glow.  Once I had worked my way through it, I was back in myself.",
  "By this time, I was sprawled out on the floor.  It was probably about 2 hours since I had really started to trip, the movie was over and my friends were standing around me asking me questions, I couldn't make them out, and I reacall muttering something about ham sandwiches and the meaning of life.  I was soaked with sweat and decided to attemt to calm down (I was on the verge of hypertension).  I smoked another few out of the dead bear bong.  I calmed down, hit 2 whippets, drank some beers and passed the fuck out.  How weak is that on 15 geltabs?",
  "Anyways when I awoke 2 days later in my bed at home I was still tripping, and I had to talk to my mom (I lived at home at the time) to tell where I had been and whatnot.  I walked back upstairs, put ELO's 'time' on my cd player, and watched the grain on my door dance the day away.  There is ALOT I can't remember given that it is 2 years and many drugs later, but that is the gist of it, I still have a horrible sleeping problem (I can go weeks with no sleep at all) and I am now expirimenting with DXM in an attempt to find the true enlightenment experience that has so far evaded me in my attempt to capture it."
 ],
 "erowid": {
  "id": "24944",
  "citation": " I. \"Gimmie More: experience with LSD,  Alcohol - Beer, Cannabis & Nitrous Oxide (ID 24944)\". Erowid.org. Apr 12, 2007. erowid.org/exp/24944",
  "substance": "LSD,  Alcohol - Beer, Cannabis & Nitrous Oxide",
  "views": "3876"
 }
}
