{
 "id": 20398,
 "title": "Extremely High Dose of Kavalactones",
 "date": {
  "submission": "2007-01-12T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Am Duirmott",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(liquid)"
  },
  {
   "time": "0:30",
   "amount": "1200 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I take 6mg of clonazepam daily, so the 15mg dose I took this morning was kid's stuff.  I decided to purchase a bottle of kava extract (40% kavalactones, app. 2000mg kavalactones per bottle).  I tried 800mg kavalactones and, pleased with the mild anxiolytic, euphoric, and very strong muscle relaxant effects that were brought on after about 30 minutes, I decided to down the rest of the bottle.",
  "T=0:10",
  "Anxiolytic effects more pronounced; euphoria and muscle relaxation still moderately strong, but not changed since the 800mg kavalactone dose.",
  "T=0:20",
  "Feeling VERY sociable (a wonderful feeling for a social phobic such as myself); euphoria much stronger; muscle relaxation has practically turned my legs to jello.  No cognitive dulling of any sort.",
  "T=0:30",
  "Effects continuing from 10 minutes ago, though exponentially stronger.  I feel as if I could take on the world, if I could just make my muscles work properly, lol!",
  "T=0:45",
  "Just one thing to say--how can this stuff be legal???!!!!",
  "T=1:00",
  "Not much change from the 30 minute mark, aside from some pronounced OEV's, CEV's, and an almost LSD-like distortion in spacial perceptions.",
  "T=5:00",
  "The effects haven't subsided in the least in the past four hours, and I hope they never do!",
  "~Anxiety level (1-10) -- 0; very disinhibited, in fact.",
  "~Muscle relaxation (1-10) -- 10; and this is saying something, considering that not even Flexeril, Soma, Elavil, or Zanaflex have helped with my fibromyalgia.",
  "~Pain relief (1-10) -- 10; I had a moderate headache before taking this, as well as the constant muscle-aches I deal with day to day.  All eradicated.",
  "~Hypnotic effect (1-10) -- 1; I don't feel sleepy in the least. In fact, I feel mildly stimulated.",
  "~Aphrodisiac effect (1-10) -- 10!!!  Jerking off was quite an experience, lol.",
  "T=8:00",
  "Still feeling the effects strongly, though the hallucinations have subsided just recently. ",
  "T=12:00",
  "Most effects subsided, except for moderate muscle relaxation, anxiolysis, and pain relief.",
  "T=15:00",
  "Back to baseline."
 ],
 "erowid": {
  "id": "24960",
  "citation": " Am Duirmott. \"Extremely High Dose of Kavalactones: experience with Kava (extract) & Clonazepam (ID 24960)\". Erowid.org. Jan 12, 2007. erowid.org/exp/24960",
  "substance": "Kava (extract) & Clonazepam",
  "views": "42680"
 }
}
