{
 "id": 20396,
 "title": "If Dali Were a Drug, He Would Be This One",
 "date": {
  "submission": "2004-12-06T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "66 degrees b",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "This was my second experience with Salvia, the night after the first. S and I were at A's house. We were sitting on the screen porch behind his house, which is a crazy place. S hit the Salvia two times from a shitty plastic water piece I got in Daytona (holy-land of dumb drunk kids, very comic place, great if you enjoy irony). He didn't get much effect at all (he also only held the smoke for less than 15 seconds) and said that the pipe sucked, which it does. I was disappointed at having wasted two hits worth, but he's my friend so I put some more into a small glass piece for him.",
  "This time as he took in the third hit he looked up and started laughing. He continued laughing for about a minute after which he said he felt oddly nervous. He wouldn't really say much about what was going on except that it was very odd and that it felt like everything was spinning around. Next A hit it. He took 2 or 3 hits and then started smiling. All he would say was that he was extremely aware of corners. I was disappointed that nothing really amazing was happening to them, A) because I wanted them to experience something amazing and B) because the stuff is pretty expensive and I wanted it to go to good use!",
  "Finally I took the piece and began hitting it (dose about the size of a dime). I tried to hold the smoke in longer than they did, for about 25 seconds, though it's hard for me. After the second hit I began to feel like I was being pulled or pushed back into my chair, as if it were on a track and moving forward extremely quickly. I tried to get in one last hit but couldn't really understand what I was doing. I held the pipe out, thinking that it was just pot and that I was supposed to pass it to the next person. It flashed into my mind that I had actually just smoked Salvia and I laughed at my lapse as A smiled, took the piece and put it on the table. My head was pushed back as far as it went as I succumbed to the strong gravity. As I stared up at the plywood ceiling I realized that it was actually the old wooden fence on the side of the back porch of the house I lived in until I was 14. It was sideways, so I felt that my head was parallel to the ground. The whole thing seemed incredibly funny and I laughed harder than I think I ever have before. It escalated when I realized that my head was about where this old wrought iron table would be so that my head was in the center of the table and I WAS the table.",
  "After I stopped laughing the Salvia pretty much wore off (or I guess it was the other way around).  We went back to A's room, but I kept feeling like at some point I was going to wake up somewhere else. Everything seemed very humorous and surreal. I enjoyed the experience, but I also was hoping something more profound would happen. Next time I'm going to try 10x and hopefully have one of the 'breakthrough' experiences I've read about."
 ],
 "erowid": {
  "id": "24956",
  "citation": " 66 degrees b. \"If Dali Were a Drug, He Would Be This One: experience with Salvia divinorum (5x extract) (ID 24956)\". Erowid.org. Dec 6, 2004. erowid.org/exp/24956",
  "substance": "Salvia divinorum (5x extract)",
  "views": "4005"
 }
}
