{
 "title": "I Was Finally Home",
 "author": "BabyGirl1619",
 "citation": " BabyGirl1619. \"I Was Finally Home: experience with Ecstasy (ID 2039)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2039",
 "substance": "Ecstasy",
 "bodyweight": "",
 "report": "<p>After many attempt to get the hook up for ecstasy, I finally had the chance to get it up in riverside from a friend before going to a rave at the masterdome. When we sat down, i really just wanted to hurry up and drop it. So finally someone handed me water, and i dropped a red all-star. Maybe a half hour later, i see all my friends totally rubbing each other and holding each other hands. They continually are asking me, 'do you feel it?' Are you rolling?' Freaked out by their attitudes and sudden liberalness, I yell no! They go to 'speaker bumb', so i sit their kind of pissed off for another 30 min. They come back and my friend offers me her 1/2 of green nike. I take that w/o water. They lead me to the dance floor, and suddenly I start to feel it. Everything was wonderful! There's no other way to describe it but pure ecstasy! I could feel every beat pulse through my veins! After dancing for a short time, I feel a surge of independence and i leave my group to go outside. I'm outside rolling, just feeling the vibes. Everyone is so friendly! They have nothing but love for you! From a person who used to be into the night club scene, this is shocking that people can actually be so nice! I have never hugged that many people in my life! I even met a guy there that i still talk to. But, actually, despite popular beliefs, I didn't find it sexual at all. It wasn't even like that. I just felt extremely good. When i finally go inside, i don't want to dance with anyone else. I just want to groove by myself. I have never felt so calm in my life. I felt like it was only me in the whole world. I just kept rubbing my hands down my orange and purple ribboned corn rowed hair, with my eyes closed for whatever reason i don't know. In amidst all the chaos of the rave, and the green lasers bouncing around the room. I reached a eery clarity. I feel like i'm a totally more calm person in general, even if i'm not on anything. I encourage people to do this drug. It's heaven! You won't regret it! I promise!</p>",
 "year": "",
 "id": "2039",
 "gender": "Female",
 "timestamp": "2000-06-22T07:00:00.000Z",
 "views": "4318",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 4:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
