{
 "title": "Chewing in Papua New Guinea",
 "author": "Matt",
 "citation": " Matt. \"Chewing in Papua New Guinea: experience with Betel Nut (ID 20399)\". Erowid.org. Feb 13, 2004. erowid.org/exp/20399",
 "substance": "Betel Nut",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 nuts",
   "buccal",
   "Betel Nut"
  ]
 ],
 "report": "<p>I chewed betel nut many times when I was in Papua New Guinea on a research project.  Everybody (including kids of 3) chews it there in the areas that it grows naturally.  It has a kind of sour/bitter taste that I liked a lot.  I usually just chewed it green, but a few times I chewed it with lime and daka, or betel pepper.  A couple times stand out in my memory.  Once I asked for a really strong betel nut and the local buai (betel) fiend gave me one.  I chewed it up with a bunch of lime and daka.  It totally made my head spin and it was a lot like the first time you smoke a cigar and forget that you're not supposed to inhale.  I sweated a lot and I was kind of zoning out.  Somebody asked if I was OK and I said 'Oh, mi spak nau' (Tok Pisin for 'I'm buzzing')  Everybody laughed. </p><p>Most times when I chewed it with lime though I just got animated and chatty (not my usually speed, I'm normally a fairly quiet guy), sweated a lot, and generally felt up, like I'd just had a good strong unfiltered cigarette or cup of coffee.  Overall I really enjoyed it.  I think it's great stuff as long as you don't go nuts with it. </p><p>There were people with black teeth in PNG from chewing it constantly, and one guy I knew was clearly addicted.  I wish I could find some in the states.  It would be great every now and again.  Also, I would love to see people's reaction when I spit a big stream of orange red betel juice!</p>",
 "year": "1999",
 "id": "20399",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-13T08:00:00.000Z",
 "views": "16004",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 nuts",
   "administration": "buccal",
   "substance": "Betel Nut"
  }
 ]
}
