{
 "title": "Disturbed",
 "author": "Sympho",
 "citation": " Sympho. \"Disturbed: experience with Mushrooms (P. cubensis) (ID 20404)\". Erowid.org. Dec 9, 2005. erowid.org/exp/20404",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Mushrooms - P. cubensis"
 ],
 "report": "<p>I had been taking care of dogs at one of my parents' friends' house which was way out in the country on a small horse ranch. One night I invited my  friend over, who recently had been growing a huge supply of stopharia cubensis, and had him bring over about 30 of the psychedelics. He and I have tripped many times together in the past and always had a good time. Well, this night we consumed an insane amount. About 15 min after we ate them we decided to walk through the adjacent woods. When it hit us outside we had so much fun tripping out to our flashlights reflecting off ice crystals on the grass and trees; ebbing and flowing on multicolored layers of ground. At one point I was spinning my flashlight around in front of my friend when I swear I saw an animal about the size of a dog rush my friend from behind and suddenly disappear. Startled, I jumped, scaring the living crap out of him and decided to move on back to the house. On the way there, the few houses in the neigborhood appeared so ghostly, almost covered in sheets while a helicopter seemed nothing other than a UFO scanning the countryside.</p><p>At this point, the shrooms were in full force enhancing colors and distorting shapes. We walked in the house, which is actually quite large, ran around with the dogs I was taking care of and just enjoyed every aspect of our trip thus far. Every room was so magical and bright. We talked about life and shared just anything that best friends share. Time wasn't even an essence during this experience. It felt like I was living an edited movie reel because my friend seemed to jump from here and there in a matter of milliseconds. It was so cut and pasted. Everything was so fun, so genuine and full of goodness and truth. Suddenly, the two dogs started barking and I heard a female voice yell 'Hello?' Everything shifted to a state of alarm and high alert. 'Just try to remain calm and maintain as much sobriety as possible' I thought to myself. My friend heard nothing, but the dogs were barking at the side door that faced the deep woods. I thought maybe a neighbor came by for a visit. Perhaps we made too much noise. SHIT! Did the dog owners come home early? I slowly opened the door trying to keep the dogs from bolting outside, cautiously looked around and saw nobody. Just then, the smaller dog ran outside and chased something for a second. Curiously, the dog stopped, turned around and looked at me with suspicion.</p><p>After a few minutes I finally convinced it to come inside and made sure the dog was ok. Confused by the dog's behavior, I seriously thought something hurt the dog outside because I was seeing blood all over the dog. I asked my friend if he saw anything. Nothing...THANK GOD! Somewhat spooked, my friend and I walked thoughout the house, upstairs and downstairs making sure nothing or nobody was in the house. We saw or heard nothing. Still alarmed, we decided to sit down and rationalize that it must've been some kind of auditory hallucination. We talked for an hour or two after that as my friend began to get sleepy. I was still unnerved, confused and was not feeling good. Bad thoughts began to uncontrollably enter my mind. The TV was on and felt so intrusive. Voices... Strange images...Disturbing thoughts. I began to have an overwhelming awareness of my body parts and bodily functions whenever I focused on them. In waves I felt quite nauseated and hallucinations were beginning to get the better of me. My friend was asleep on the couch when I had to run to the bathroom and try to get sick. All I could do was lay on the ground and watch insects pour out from the walls and the toilet. I could see blood running through my veins as I looked at my hands. My mind was clouded with images of filth and horror.</p><p>Next thing I know I was in the hallway flat on my stomach crying and convinced that my spirit was being taken away. I can vividly recall the sensation of my physical body melting into the ground and cold, liquid drops falling on my back. I thought I knew the meaning of everything and it scared me to know this much. I imagined all our ancestors, our total human life force as being an organic lattice of metaphysical energy fighting for me to let go and join them. All truth as i knew it was totally skewed. Did I truly believe that Satan and cancer were synonymous? I felt my body beginning a sort of spiritual/organic decomposition, ridding itself of all impurities. I even sensed my birthmark fading and slowly checked the mirror to see if it was still there. I was drooling and slobbering as I yelled for somebody to save my spirit from leaving me. Images of people in my life, family and friends caused me to feel intense sympathy and heartache without reason. I then focused on a portrait painting of a woman on the wall making me cry out loud. I sat up on my knees, flailing my arms out as if reaching to God for help. At this point I didn't even know what I was saying. I sincerely believed that I was stuck in this state of terror and panic forever.</p><p>I woke on the floor a few hours later, extremely dehydrated with terrible anxiety. I woke my friend and asked him if he heard my hysteria. He didn't at all. I wanted to talk, but he fell back asleep.  Such frustration it was being alone like that without comfort. I couldn't get back to sleep for another few hours and was only able to pace the house and try to keep busy. Watching the news didn't help one bit- New Terrorist Attack, family killed, child murdered. I felt a new sense of dread and fear like I've never had before. Normally, I'm a reasonably balanced and controlled person and now I thought this was how I was supposed to live for the rest of my life. After the following days, the anxiety finally surpassed, but the images, ideas, and disturbance still stand out sharply in my mind.</p><p>Be careful when using psychedelics. The wrong state of mind could lead to a night of horror, but most importantly- maintain control and know that the experience will end. Stay amongst CONSCIOUS, trustworthy friends and don't overdo the dosage like I did.</p>",
 "year": "2002",
 "id": "20404",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-12-09T08:00:00.000Z",
 "views": "4084",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 }
}
