{
 "id": 20408,
 "title": "Some Optimism and Awe",
 "date": {
  "submission": "2000-05-31T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "skip",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "12"
   },
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "In Amsterdam, the law permits things that are unheard of in the states.  Like selling 2CT-7 over the counter. I brought 3, 8mg hits home, splitting them with a friend.",
  "In the beginning, there was a tryptamine like psychedelic felling that was strong.  I could get light visuals, and retiring to my bed with a blind fold I could only get simple , colorful, rotating patterns.  Usually when I am indoors on shrooms or LSD there is a hint of discomfort in my mind, but the 2CT-7 was very kind and gentle in is presentation.  It also had the pleasant stimulation of a Phenylethylamine, which gave us both a thirst for things to explore. ",
  "The whole thing is that we both thought it was just interesting and fun, only realizing later how much the experience opened our eyes.  Wandering to the beach (I live on the coast of CA), I felt as if everything happening around me was happening just for me. Dogs joyfully chasing sticks, putting on a fantastic show. Pelicans diving into the water at just the right moment. The oil rigs would release a flame of excess gas, lighting up just for me.  The truth is the that things were happening around me that I had never seen before, and they were happening at just the right time.  I was so happy, because for a period of about an hour at the beach I felt that every thing going on was perfectly timed, done just for me.  Back in civilization, my interaction with other people was being carried out in a Zen like fashion.  I was fully stimulated, but also in a very special head-space. This orientation was so relaxed, any question directed at me was instantly answered.  My feelings about other people were enhanced as on ecstasy, and I feel my confidence was related to my conviction that nothing in the world that was going on was wrong in any way. I had a tremendous sense of purpose.",
  "The entire experience lasted maybe 6-7 hours, and it would have been less if I didn't extend the experience through cannabis smoking. There was also a huge 'psychedelic afterglow' for both of us.  The optimism and awe which 2CT-7 inspired that day continued for the next day, dropping off by the third day.  2CT-7 was truly remarkable, and I feel very lucky to have been able to experience it."
 ],
 "erowid": {
  "id": "25",
  "citation": " skip. \"Some Optimism and Awe: experience with 2C-T-7 (ID 25)\". Erowid.org. May 31, 2000. erowid.org/exp/25",
  "substance": "2C-T-7",
  "views": "7545"
 }
}
