{
 "title": "Damn, I Can See Everything",
 "author": "MaryJane Silver",
 "citation": " MaryJane Silver. \"Damn, I Can See Everything: experience with Ecstasy (ID 2041)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2041",
 "substance": "Ecstasy",
 "bodyweight": "",
 "report": "<p>The night I first experimented with E, it was the night of the semi-formal at my high school. Three of my friends, with whom I was attending the dance, were going to 'roll' as well. They all took whole pills (80mg I think) around quarter to 8. Because it was my first time, I took only half of my pill. During the dance, my friends were rolling extremely hard and I wasn't at all, so I was not having a very enjoyable time. But when it was over at midnight, I took the other half of my pill, and about 25 minutes later the effects started to kick in. The first thing that hit me was this incredible feeling that I was 'all eyes'; that I could see everything...we were driving, and the streetlights and trees were amazing and so beautiful. I touched the fabric on the seat in front of me, and an amazing ripple of pleasure and sensation was the result. I made my friends sit with me and let me hold their hands, because even that simple act was wondrous for me. I felt like I was in heaven, and like a baby learning everything and seeing for the first time. Besides all of the positive feelings, there are the precautions and side-effects. I had to drink a lot of orange juice and water to keep hydrated. I was on antibiotics for a strepth-throat infection but there were no nasty effects because of that. The only really adverse effect was that the next day my jaw was clenched and it was definitely a strange sensation, but all in all, it was definitely a worthwhile experience... for me, it was better than marijuana, alcohol, or sex.</p>",
 "year": "",
 "id": "2041",
 "gender": "Female",
 "timestamp": "2000-06-22T07:00:00.000Z",
 "views": "4297",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 4:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
