{
 "id": 20410,
 "title": "A Twisted Night",
 "date": {
  "submission": "2006-04-06T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hobbes",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD"
  }
 ],
 "report": [
  "My previous experiences include marijuana (was once very aquainted with its effects, but grew out of a desire for it), OxyContin (had two very very pleasant experiences),  Psilosybin Mushrooms (had taken it three times, low doses) and one hit of LSD about 3 weeks before this night.  The most intense experience was with marijuana, I had felt and seen things that I had not on anything else.  I was disappointed with LSD and wanted to give it a better chance this night.",
  "I should not have taken it that night.  My mind was worried even before I took it and I was not in the mood to really just enjoy it like I would normally be in.  That alone I believe ruined my night.  I had two friends with me, one was taking one hit, and the other was taking none but acting as a supervisor for the night.  I wrote him a note that said some weird stuff on it that he was supposed to give to me if I had gone completely sideways. I ended up accidently leaving by my computer where anyone in my family could find it. (when i remembered that is when the night went downhill)  It started out great! we went hiking as it began to peak around 8, an hour before the sunset.  It was GORGEOUS! the orange/blue sky wish the leaves above us and a flowing stream below us, I loved it.  As the sun was setting we came across a field of waist high grass.  We stood on the edge of it and it was as if we were looking out onto an infinite field of this gorgeous grass that was shimmering as the sun set in from of us.  I had headphones on at the time listening to Brian Eno - An Ending, to me the most beautiful song I have ever heard, then we ran along side the field.  In those seemingly 45 minutes I was sooooo happy and at peace it was incredible. ",
  "Then I sat down in an opening in the trees, with woods all around, and stared into the sky as its evening blue was giving away to a darker night sky.  That was the most peaceful I had ever felt, I had forgotten about the LSD and I was in my own little world of peace.  The kind of feelings I can only imagine while sitting on the computer writing poems and such.  From here the night went completely backwards.  I remembered I had taken LSD, and I remembered I left the note by the computer and I went straight back to my worrying state of mind I was in before we arrived at the park. This feeling started when we left.  I did not like being in my own world then.  My friends did not understand me.  I deeply was feeling confused and scared but they did not understand that, they made more jokes.  When we were thinking of places to check out I mentioned the highschool football field so we could listen to music and look and the stars without any trees around us, but instead they went to Kmart to meet my sober friend's friend.  This was the worst part of all.  They parked in front of a blue light special sign, and went inside, leaving me in the car.  I told them I wanted to stay in the car but I meant I didn't want them to just leave me in there. ",
  "The LSD was at full blast and I was sitting in a Kmart parking lot. It felt like to me that car was shaking and the blue light special sign had blue and red lights flashing over it.  I saw mothers coming out pulling along their kids, yelling at them, generally being mean towards them... I hated it.  For some reason I kept seeing smoke coming from somewhere and lights coming from under my seat in the car.  I felt horribly scared and confused but to my surprise it actually went by quickly.  When they got back they still did not want to go to the football field.  This really confused me, the day before we had agreed to go there to watch the stars, but now they had no interest at all in doing that.  Instead they went to a cemetery, which actually helped calm me more than expected but not what I wanted to do at ALL.  Again it seemed as if they were ignoring my opinions. ",
  "Eventually what I wanted as we were leaving was the drug to be gone. I had grown out of it in a sense.  I had not had a completely enjoyable trip from anything in a long time because I had always wanted to come back to baseline, back to reality.  To my suprise my friends said they thought I was acting pretty normal except when we got into conversations and some things I was saying were making no sense at all.  They also said that when they came out of Kmart I looked the most scared and white that I have ever looked.  We headed back to my friends house and popped in the Wall.  I wouldn't say I enjoyed it because I really was still feeling empty and lost and I needed a caring friend more than an artistic movie.",
  "The rest of the night involved us sitting in his room talkin about so much stuff, like life and death and why would someone commit a horrible crime like rape, and generally things that I did not want to talk about.  I still felt as if no one was listening to me.  I was calm but still felt alone and empty since no one would listen or be friendly at all.  I was getting bad vibes all around from those two, except when we weren't talking about stuff or tryin to make decisions. ",
  "The highlights of the night were when we were driving down a road with the star wars theme playing, when we were outside, when we were staring into my friends mirror looking at slashes of water on the surface, and thats about it. ",
  "The only things I would want someone to know is that if anyone is having this intense of a problem the best thing you can do is listen and don't be critical.  Especially don't be critical because it confuses the person and makes them feel like you don't understand them.  Know the people you're doing it with.  Know them so well and trust them.  I messed up bad that night because my mind was already confused and lonely and I was stressed out, thinking that maybe this will help.  It was not the case at all, if I am not already at a peace and in a comfortable spot in my mind I should not think about taking any drugs. ",
  "A timeline of the night would include-",
  "7 PM - take the LSD in the car on the way to park",
  "8:15 PM - reached a definite plateau in effects",
  "9 PM - done hiking, still plateauing leave to drive around (tons of fun to sit in passanger seat and see everything go by while I listen to music)",
  "10 PM - Kmart experience",
  "10:30 PM - Leaving Kmart, more driving",
  "10:45 PM - Cemetery, driving around slowly while sitting on top of car and looking at stars, still plateauing",
  "11 PM - Back to friends house",
  "11:30 PM -In with the Wall, still plateauing",
  "1:00 AM till 7 AM  - Hanging around friend's room, talking, music, just tryin to relax still plateauing until about 6 when effects decrease immensly, but still linger. I would like to add that for the next 12 or so hours I felt sick to my stomach and I had a bitter taste in my mouth",
  "9 AM - Home took a shower, feeling very weird still with no sleep. ",
  "12 PM - Still out there.  The world felt different,if I was not feeling so empty and some what scared and lonely it might have been really enjoyable",
  "3 PM - went to a movie with mom and sister, I was feeling lonely and I needed someone to hang out with that I would not get bad vibes from.  I didnt get bad vibes but I just didn't connect, still feeling out of whack and messed up a lil",
  "7 PM - went to my cousins and watched terminator, my mind was still not completely straight, but I'm sure no one else noticed, at least very much",
  "12 PM - came home and went to sleep, my mind did not completely get straight until about 72 hours after ingestion. The bad taste and upset stomach left when I fell asleep.",
  "Thinking about that night still gives me a slight bitter taste and an upset stomach but I realized that it was very helpful to me. I had grown away from drugs and those friends.  LSD truly touched something deep, and forced me to see something that I would describe as deeply true to onesself, but also it showed me that it was something I didn't need drugs to find.  It's sort of ironic because I had always thought LSD would show me something no other drug could, and that's what lured me into wanting to try it sooo bad, but in the end it showed me that drugs are not needed.  I actually genuinely would be happy not doing psychedelics again, Ive never felt this way, but I feel soo free!!! hope I helped someone       ",
  "         peace  :)"
 ],
 "erowid": {
  "id": "25008",
  "citation": " Hobbes. \"A Twisted Night: experience with LSD (ID 25008)\". Erowid.org. Apr 6, 2006. erowid.org/exp/25008",
  "substance": "LSD",
  "views": "4361"
 }
}
