{
 "title": "We're All OK, and That's Just Fine",
 "author": "Sylph",
 "citation": " Sylph. \"We're All OK, and That's Just Fine: experience with MDMA (ID 2044)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2044",
 "substance": "MDMA",
 "bodyweight": "",
 "report": "<p>I had always wanted to try X, and had been bugging my friends to keep an eye out for it for a long time, and recently we just happened to luck into a big batch of them. This was a big deal for all of us and it was something special because none of us had tried it before, although we kept hearing great things from other people about it. We were planning to all dose for the millennium New Year's Eve and were talking big about universal love, peace, etc. You know how it goes. It seemed to be the ideal 'party favor'.</p><p>About a week before the big day a male friend of mine and I were kicking around in my apartment, both vaugely bored. We both agreed to sample it ahead of time to make sure it would be worth it (taking it for New Year's). So we parked the pills in front of us on the desk and read up on the effects and warnings about it here (Thanks so much for making this resource available! I firmly believe that my lack of serious problems with recreational drugs and my immense SAFE enjoyment of them is a direct result to my having access to unbiased information on the 'Net). Anyway, we decided we were both OK with this and dosed around 9:30 PM. They were gelcaps, very similar looking to the herbal vitamins I take, not tablets like I had read about on here and ecstacy.org. We had just eaten dinner about a half-hour before dosing, and had a few bong hits as well, and for the next hour or so we both zoned out on the TV. I started feeling vaguely speedy but dozy as well, and my male friend was to tally into a Nature special on glaciers. I closed my eyes because it seemed a good thing to do, and started wondering if the caps had been bunk, and thought, damn, I hope this wasn't a rip off, that was a lot of money for herbal speed, etc.</p><p>The Nature special finally ended and there wasn't anything else on the TV at the time (this was now T+1.30 after dosing) so I flipped the TV off. I was feeling cold and had covered up in a blanket on my bed. Then something happened. We both started talking. I warmed up and threw off my blanket, and sat down on the floor by my friend, and we started to really open up to each other. The empathy was amazing. I had heard that this was a 'hug drug' and I was worried that we'd both start pawing each other. I'm a lesbian and didn't feel any sexual attraction to my male friend, and I didn't want to get into a situation that I would be embarassed about later, but there wasn't any of that. We just related to each other as human beings, who both had problems and hang-ups and worries, and I began to feel the strongest form of platonic love I'd ever experienced for another person. We covered nearly every topic you can imagine; after analyzing each other we started in on all of our friends. We told each other hurts and wounds we'd suffered throughout our life. We told each other problems we had with each other in an atmosphere of complete openness and lack of worries and no 'I know this is going to sound mean, but...'. You know? No disclaimers. It was totally understood that we were speaking from the heart and had absolutely no malice, no manipulation.</p><p>Around 4:00 AM (T+7.30) we both started feeling drowsy and started losing the connection with each other. It was kind of depressing. I wanted to keep talking all night. I was fascinated with everything he had to say. I had 7 caps left and I was tempted to take another to keep the bliss going. But a few years back I almost developed a problem with dependence on meth and I recognized the crash when I felt it. We said goodbye to each other, he went home, and I kept telling myself to be happy with what I got. I tried to go to sleep and had the same kind of crunchy edginess that I remember from coming off an LSD trip. I tossed and turned and eventually fell asleep about an hour later. I slept long and hard and woke up the next day with a strange mixture of mild depression and gentle euphoria. It was like I could see other people, strangers, as just human beings. But I knew that I was just as fallable as the rest of them, and for a person who doesn't consider herself to have a big ego, this was kind of depressing.</p><p>If you are thinking about taking this, I would recommend it highly. It's much more subtle than LSD or even MJ, and you might think that it's not happening. Make sure that you trust the person/people you're around, because you're going to want to open up to them. Turn off the TV because whenever there's a TV around (or a computer) everyone seems to focus on it instead of each other, and you'll miss the fun of it. A TV doesn't feel back at you. I can see how it would be very useful for getting up the guts to talk to strangers in a bar, or if you have a beef with someone else in your life, if you both take it you probably have a good chance to work it out. I can totally see how counselors and therapists would find it useful to take to relate to thier patients. I didn't get a chance to dance or move around much, but I think it would be fun to go to a club or a rave the next time around.</p><p>So, I don't know if this was *real* X or 'that crunchy herbal raver shit', but I trust the judgement of the person I got it from, and it was a worthwhile experience for me. For New Year's I think I'm going to take a low dose of LSD along with it (it's called 'candyflipping'). I hope everyone who wants to try it gets the opportunity, and I still can't believe a drug that allows this kind of love and empathy to come out in people can ever be considered 'evil' or 'dangerous'. More people, I think, should take it. But then, that's just my opinion :-) </p>",
 "year": "",
 "id": "2044",
 "gender": "Female",
 "timestamp": "2000-06-22T07:00:00.000Z",
 "views": "4152",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 ",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  }
 ]
}
