{
 "id": 20458,
 "title": "Timed Stopped",
 "date": {
  "submission": "2000-07-20T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Chris",
  "weight": 93
 },
 "dose": [],
 "report": [
  "It was my 20th birthday. My friend invited me to one of his friends' house to smoke out. Anyway, about a 20 minutes after I got there we started to pass around the bong. After about 5 rounds we stopped and sat around for like 10 minutes. One of my friends asked me if I wanted to have a balloon and I did. He filled the balloon with two whippits cartridges. We then went into a dark room which had a bean bag in the corner. I sat on the bean bag and he closed the door. He began to give me a light show by holding a green LED flashlight in each hand. He began making circles and other such patterns by moving his hands and arms really fast. I then exhaled all the air that was in my lungs and brought the balloon to my mouth. I inhaled almost the whole balloon and held it for about 5 seconds. I then began to breath into and out of the balloon slowly and deliberatly. I soon heard the 'helicopter' noise. The noise came on fast but after awhile got slower until it was silent. I do not know if I was still breathing into or out of the balloon at all or even if I was still holding it. As the helicopter noise grew slower and softer my friend's movement got slower until he was completly stopped in time and the 'helicopter' noise had totally frozen. During this whole time my thoughts kept going while it seemed timed had frozen. I felt so comfortable were I was. I thought this was it. I thought I was dead. I was scared, but comfortable were I was. I kept thinking wait... not yet... not yet. Then there was another voice in my head besides my own. It was telling me, 'God knows were you are.' Over and over. I was getting more scared and more scared. Eventually the 'helicopter' noise started back up again, very slowly, and steadily. I then felt so relieved that I was coming back... my friends arms began to move again sychonized with the speed of the helicopter sound as it came back. When I was back I couldn't stop laughing cause I felt so relieved. I've tried several times to get time to freeze again using whippits, but have failed. =("
 ],
 "erowid": {
  "id": "440",
  "citation": " Chris. \"Timed Stopped: experience with Nitrous Oxide & Cannabis (ID 440)\". Erowid.org. Jul 20, 2000. erowid.org/exp/440",
  "substance": "Nitrous Oxide & Cannabis",
  "views": "11851"
 }
}
