{
 "id": 20452,
 "title": "Utter Confusion",
 "date": {
  "submission": "2007-10-09T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Delta9",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "glasses",
    "quantity": "7"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "mg",
    "quantity": "1.5",
    "grams": 0.0015
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0:45",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "I should start off by stating that I am very experienced with salvia, having used it over 50 times.  Im so used to the effects now that I am able to sort of remain grounded after using it, meaning that I know that Im laying there on my bed under the effects of salvia and I feel in complete control the entire time.  I usually use salvia alone without a sitter because I am confident that I can use it and remain perfectly motionless and not get up and move around.",
  "On to the report.  I was bored on a Thursday night so I decided to have a few beers.  After about 6 beers I was still bored out of my mind and decided I had no real reason to stay awake, so I took 1.5 mg of clonazepam, which I have a legitimate prescription for, to get to sleep.  After about 45 minutes the clonazepam kicks in and Im pretty damn wasted and feeling good, so I decide to stay up a little longer.  At this point for some reason I decide to smoke some salvia.  I usually respect salvia and dont use it just to get fucked up, but my sense of judgment was quite impaired at this point so I thought what the hell, why not.",
  "I put a small amount of 20x in a pipe and proceeded to smoke it.  After holding in the smoke for 30 seconds, I exhale, and instantly after the effects hit me.  This trip was unlike any I have had before.  In fact I wouldnt really call it a trip, it was more like just the most total and complete confusion I have ever felt in my life.  I didnt know what was up and what was down, I had no idea where or who or what I was.  It was like I was just this ball being thrown around between dimensions of pure craziness that completely defied explanation.",
  "During the overall confusion, I sort of remember having like a dozen of what Id call mini-trips, where I would have some sort of insanely bizarre and intense vision or sensation and then come back down to what I thought was reality, only to realize that the reality I was in was not in any way related to actual reality.  I would then go spinning off into another mini-trip completely different that the last one.  This went on for what seemed like hours but was actually probably more like 10 minutes.   Without going into in-depth explanations of these mini-trips (which are pretty much unexplainable anyway), they basically involved a slew of vortexes, alien landscapes, entities, etc. that usually happen on high doses of salvia.   To have these things happen over and over again was just way too much.",
  "Towards the end of this trip I finally remembered that I was on salvia, and I remember literally begging the salvia to make it stop, all I wanted to do was go have another beer and go to sleep, but the salvia decided to kick my ass around some more.  It was like it was punishing me for trying to use it just to get fucked up.  I consider salvia to be a friend, an ally, but at this point it was treating me like I had just slept with its girlfriend or whatever and wanted to beat the shit out of me.",
  "I found myself coming down from the salvia on the floor in the living room of my apartment.  I started out on my bed in my room.  I sort of recall being all over the apartment at various stages in the trip, which is strange for me because I never have had problems staying still while on salvia.  After the experience I was very shook up psychologically and my mind felt like it had been put in a blender.  All I wanted to do was go to bed to try and forget about the whole thing.  Luckily the clonazepam did its job and I was asleep in no time.",
  "What I learned from this is experience is that salvia will still kick my ass if I am stupid with it, no matter how experienced I think I am.  Also, I shouldn't use salvia while heavily sedated.  I think this is what caused my massive confusion, much more so that just the salvia.  I usually have a couple of beers before using salvia and find that this enhances the effects and lessens anxiety, but this time I was just too fucked up beforehand.",
  "Im not into the new-agey crap where people say that plant entheogens have spirits or whatever, but I almost feel that way with salvia.  The whole time I could feel it mocking me and laughing about how easily it can tear my entire world apart."
 ],
 "erowid": {
  "id": "43963",
  "citation": " Delta9. \"Utter Confusion: experience with Salvia divinorum (20x extract), Alcohol & Clonazepam (ID 43963)\". Erowid.org. Oct 9, 2007. erowid.org/exp/43963",
  "substance": "Salvia divinorum (20x extract), Alcohol & Clonazepam",
  "views": "12256"
 }
}
