{
 "title": "Two Nights Not to Be Remembered",
 "author": "Anonymous",
 "citation": " Anonymous. \"Two Nights Not to Be Remembered: experience with Tiletamine (Telazol) (ID 20460)\". Erowid.org. Jun 8, 2006. erowid.org/exp/20460",
 "substance": "Tiletamine (Telazol)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "Pharms - Tiletamine",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>1st experience:</p><p>I came across this stuff which was described to me as 'Doggy K'  The person selling it to us had gotten it from a friend who had worked in a animal hospital.</p><p>We figured why not try it? It was being offered at a cheaper price and there was no Ketamine to be found.</p><p>I remember it was in a bottle but there was no liquid inside just a large white (or could have been yellowish) rock inside the bottle..after breaking it up a little into a  chunky powder it seemed that the more I cut it up the more it turned sticky and began to clump more, so we left it at that and put some small lines out to test.</p><p>I remember snorting a little and when it first kicked in it felt good, almost like an onset of Ecstacy but nothing more, though it felt nice, my aim was to go into a K Hole so I put out another line and snorted it. After this I do not remeber ANYTHING...nothing at all</p><p>After it was all over, My friends who had stayed sober were telling me that I was being very noisy, I was jumping off the couch thinking I was a bird, I was also going up to my friend and telling him in a robotic voice that I was a robot, I also repeatedly approached him every 5 minutes saying 'hey whats up Bob I didnt know you were here, when did you get here.?....</p><p>Again, I Do Not Remember any of this.</p><p>2nd experience:</p><p>That fact that i had a Total Blackout of the night really bothered me. i was determined to remeber what the experience was like. so i got some more and a few nights later I tryed it in my room.</p><p>I woke up the next day With absolutley no recolection of the night..</p><p>I didnt think it was a drug worth persuing anymore so i got rid of it.</p><p>---------------------</p><p>Looking it up on the internet it seems people use this drug.</p><p>I wonder why?</p><p>Maybe i just did to much?</p><p>Maybe it is meant to be used in very small doses.?</p><p>From what my friends told me of the night..the experience seems to be more closely related to an Angel Dust high then it is to the Ketamine experience.</p><p>I dont think i will ever try Telazol again.</p><p>Be Safe people.Be Smart</p><p>Research your drugs before you do them....</p>",
 "year": "",
 "id": "20460",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-06-08T07:00:00.000Z",
 "views": "14076",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Pharms - Tiletamine",
   "form": "(ground / crushed)"
  }
 ]
}
