{
 "title": "Flowing through Ages of Blissful Beauty",
 "author": "Mitra",
 "citation": " Mitra. \"Flowing through Ages of Blissful Beauty: experience with Salvia divinorum & MDMA (ID 2048)\". Erowid.org. Jun 23, 2000. erowid.org/exp/2048",
 "substance": "Salvia divinorum & MDMA",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "MDMA",
  "",
  "",
  "1 hit",
  "smoked",
  "Salvia divinorum",
  "(plant material)"
 ],
 "report": "<p>So, I was on a mild dose of MDMA. My friends and I were disappointed and bored with the quality of the X. My friend suggested that we smoke some of my salvia since the X wasn't working very well. So, I loaded and I smoked a bowl of Salvia Divinorum. I felt like the X was kicked into high gear and I thought to myself that I had better not smoke any more. I lay down and closed my eyes and, as though a switch was thrown when I closed my eyes, instantly my body melted into the world around me and I saw (with my eyes closed) a most incredibly complex vision of brilliant, vibrant oranges and purples. I was flowing down a river of vibrant orange and purple jello. But the river was also the sky and also myself. The music (I think we were listening to Skinny Puppy at the time) formed structure to the universe with the textures of the sound. I was flowing through ages of blissful beauty. I could see my teeth which were the stars and I could feel the stars which were my teeth as my mind and body wrapped around the universe that was me and also the environment through which I was flowing. My breathing was a pillar of light and stability around which I was flowing and eddying. Out of this universe that I had become came a thought that was surprisingly lucid.</p><p>I thought, 'shit, I'm breathing. That means that the Nitrous will wear off soon.' Then I remembered that I was not on Acid and that I had not inhaled Nitrous. I was in fact on X and I had smoked Salvia. I thought, 'oh good, that means that I can breath and it will keep happening.' So I relaxed and exploded into multidimensional vortexes of gravity that pulled and pushed me through the river of sensation that I was flowing in. I felt like I could stay there all day but I wanted to tell my friends that it was totally cool so I sat up and opened my eyes and said 'wow, that was totally cool!' Everything looked normal and I felt normal again. Well, not quite normal. I felt like I was on a high dose of X. I felt great. After half an hour, I was back down to the low dose of X that I had been on before. My friends had all tried the Salvia too by now and from watching them I saw that the experience took about 5 minutes. I smoked it several more times that night and each time it was just as intense and just as cool. Now I can't wait to take a strong dose of X and see how amazing the Salvia will be then!!</p>",
 "year": "",
 "id": "2048",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-23T07:00:00.000Z",
 "views": "6414",
 "dose": {}
}
