{
 "id": 20487,
 "title": "Crashing Thru the Glass Coffee Table",
 "date": {
  "submission": "2009-04-09T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "The Avantgarde",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "I've always had the sneaking suspicious that nothing happens to us when we die.  We are just matter returning to the earth, and the concepts of afterlife, be it heaven or hell or reincarnation or purgatory, were simply ideas we as humans created so we don't feel depressed about our ultimate and inevitable demise. I no longer believe this to be true.",
  "In fact, I now believe in much much more.  I am certain there is other dimensions and other lives out there that we simply could never comprehend.  These places are beyond what we understand about science, and are not based on the element carbon.  Nothing in our world exists or even makes sense in these other places.  Wherever I went, I wasn't in this time or place.",
  "I didn't recognize my apartment anymore...nothing around me made any sense at all.  At the initial onset, I felt an immense deja vu based on the objects around me, as if these objects held an energy of history that sucked at my present sense of reality like portals.  Simultaneously, my mind completely disconnected from my body and I went elsewhere.  I felt as tho I had done this drug a long time ago, and it caused me to go crazy and never come back.  In my mind, I perceived that the first time I experienced the drug I ran forward flailing my arms and legs, and crashed thru my glass coffee table.  I knocked out my teeth and thrashed around in the glass cutting myself severely.  I was in the hospital, and then the mental institution where my family and I were interviewed about the experience.  I had the clearest sensation of a psychotic episode in which everything I was saying seemed bizarre and crazy to the people around me.",
  "When I saw them not understanding me, I further panicked and began flailing my arms and legs while my parents and family tried to calm me.  I again crashed into my glass coffee table.  I looked around and saw aspects of my entire past life.  It was like a giant frightening merry-go-round.  I completely forgot I was on a drug, and convinced that what was around me WAS reality.  I grew terrified of the items around me that represented another part of my life.  This time cycle, I was me, but I ran thru my entire life via these objects.  My tool bag from design class...college, not the present.  My Wallace & Gromit video...high school, not the present.  When I saw my nintendo, I was a child again, and my entire life to the present had been some long dream I'd been having the whole time, and I had just awakened with the dread of having to experience it all again.",
  "I struggled to find something from the present to prove I was here, August 2nd, 2006 in Glendale, CA.  I was completely unaware of my body or if I could even speak.  I could have been screaming and completely unaware of it.  The most intense memory is the sensation of time TEARING thru me and back again, like pieces of glass, as if crashing thru my coffee table was the portal to this alternate dimension.  It made nothing around me seem real, and the objects were frightening.  None if it looked as tho it belong to me.  I TRIED to see things, but everything I looked at was a portal sucking me away from my reality and further convincing me that I had gone crazy years and years ago.",
  "As I was coming down, this reality seemed to be pulling me back into place, but it seemed as tho everything I REALLY did was something I had already done in the steps to my going mad.  Once objects looked familiar they still did not seems time appropriate.  Even today, it reasonates.  I'm having a little bit of a difficult time being convinced that this is reality.  Perhaps it has to do with my only being here 7 months in a brand new place.  My boss is supposed to be off today, and as I was talking to an administrator about time cards, specifically HIS time card, suddenly my boss appears!  I look at him and wonder if he is really there or if my talking about him has somehow made him materialize out of thin air.  Much to my relief, he really was here, and I am convinced of it!  I can't explain what happened, much like the thoughts I had in my trip where normal things weren't working.  I'm having a hard time shaking the paranoia that I am going to start saying crazy things that will get me put away in a hospital",
  "Someone asked if I could create a piece of art based on my experience.  I answered yes, but there is no visual in our reality to illustrate my experience:  Basically, you have to take a piece of paper and write the word reality on it.  You tear it to pieces, burn it, shred it, shatter it, melt it, blow it up in a nuclear reactor and you still have no idea what I experienced. That's all I'm saying for now.  I have to get back to work and focus on this reality and dimension, so I can fully convince myself that I am all the way back here (I feel as tho I left a piece of me 'out there' and I'm trying to get it back to solve the puzzle).  BIZARRE!"
 ],
 "erowid": {
  "id": "55086",
  "citation": " The Avantgarde. \"Crashing Thru the Glass Coffee Table: experience with Salvia divinorum (extract) (ID 55086)\". Erowid.org. Apr 9, 2009. erowid.org/exp/55086",
  "substance": "Salvia divinorum (extract)",
  "views": "2776"
 }
}
