{
 "id": 20484,
 "title": "Enjoying the Legal Highs",
 "date": {
  "submission": "2007-07-19T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Chadaddy",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": "2400 mg",
   "administration": "oral",
   "substance": "Piracetam"
  },
  {
   "time": "0:00",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Kratom"
  },
  {
   "time": "0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Vitamins / Supplements"
  },
  {
   "time": "1:20",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Being out of work for 3 weeks, and extreme boredom led me to try mixing a few legally obtained drugs.  I had some Kratom premium plant extract still hanging around, about 9 grams, as well as a healthy amount of piracetam.  Having a limited amount of bud, I decided to try something new.",
  "T 0:00 I take 2400 milligrams of piracetam, 4 grams of kratom mixed with green tea, and a multivitamin shortly after lunch. I started doing my daily workout to get the blood pumping.",
  "T 0:15 I finish my workout, and my body starts feeling very relaxed. A lot more relaxed then normally.",
  "T 0:30 A slight euphoria slowly begins to envelope me.  I feel like I'm sinking into my bed.  This stuff is legal?!?!",
  "T 1:00 Extremely euphoric now, and I start thinking about smoking some bud.  I head over to a friends house to work on guitars, luckily he lives up the road a few hundred feet, cause driving felt awkward.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "T 1:20 Smoking seems to take the sedation part, and kick it in the ass with some intense stimulation.  Colors, lights, everything seems to vivid and intense, this usually occurs with piracetam.",
  "T 2:00 And I'm still buzzing, but not as intense now.  Eating food before seems to take the kratoms short acting life, and extends it.  No nasea came either, which usually happens on kratom alone.",
  "T 3:00 I'm comming down gently, feeling very tired.  Overall great experience.  A nap would be nice, but I'm not home, so thats not an option.",
  "Overall I enjoyed this combo, and will try again.  Vitamins seem to be key in dosing with any drug.  Keep your body and mind safe and healthy."
 ],
 "erowid": {
  "id": "55077",
  "citation": " Chadaddy. \"Enjoying the Legal Highs: experience with Kratom, Piracetam, Cannabis & Vitamins (ID 55077)\". Erowid.org. Jul 19, 2007. erowid.org/exp/55077",
  "substance": "Kratom, Piracetam, Cannabis & Vitamins",
  "views": "10685"
 }
}
