{
 "id": 20481,
 "title": "Weaving a Story, Drawing a Graph",
 "date": {
  "submission": "2010-03-11T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Z-Person",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "report": [
  "<p>I was a bit bored so I decided to try a charger of nitrous, it was the most amazing nitrous experience Ive ever had. I charged up my cream whipper and hyperventilated for a few seconds, then inhaled deeply. I hit me instantly. I could hear Startrek esque sounds as I was going deeper and deeper under, a sound like a ricochet, or a space ship. But with gears, on the way up it went up a gear, and as I came down it went down a gear. When I was completely sober the sound of cars going past the window was morphed in such a way it sounded exactly like that sound. Also I saw a green/yellow pixilate when I came out of the nitrous induced state.",
  "Due to that last experiment into solitary nitrous oxide use, I decided to try using 2 chargers at once. I mustve been completely knocked out, I had utterly amazing hallucinations. Unfortunately I cant remember the bulk of them now. But I woke with the same sound, and it began with the same sound. Also the whipper was left on my face with still some gas left, I really do think I was unconscious. The hallucinations had something about the desert, and when I was waking up I remember a family waving good-bye to me. Its like I was shot into oblivion and then pulled back again. Oh and of course this is all very comfortable, innocent and euphoric.",
  "I go on to repeat this a few more times, the hallucinations get even better. Im noticing the reverse tolerance. I have a pattern, which seems to correspond to all the trips. Every time its stronger. In the trip on the 8th charger the graph of the trip got so unbelievably beautiful. 9th even better! Im making sure that the 10th is my last however. Each time it gets exponentially more detailed. Its absolutely amazing, and I really want to do an 11th, but I mustnt. Or Ill soon finally find myself using a lot daily! Its the most psychologically addictive thing since the snooze alarm. It fills me with a complete sense of utter urgency requiring me to take more nitrous, just to hear the next part of the story.",
  "The nitrous tells a story in its trip. It shows me a pattern, a graph of infinitely intricate detail. Each and every detail in the graph corresponds and seems to pre-empt things that I hear or see or do. I.e. if the song Im listening to has a symbol crash, BEFORE I hear the crash the graph spikes.</p>"
 ],
 "erowid": {
  "id": "55061",
  "citation": " Z-Person. \"Weaving a Story, Drawing a Graph: experience with Nitrous Oxide (ID 55061)\". Erowid.org. Mar 11, 2010. erowid.org/exp/55061",
  "substance": "Nitrous Oxide",
  "views": "4985"
 }
}
