{
 "id": 20499,
 "title": "Mad Memory - But Fun!",
 "date": {
  "submission": "2002-01-18T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Rebecca",
  "gender": "Female",
  "weight": "60 kg"
 },
 "dose": [],
 "report": [
  "These are an anti-cholinergic drug so after around half an hour, I noticed that I was getting a dry throat (fortunately not a particularly bad one) and my eyesight had started to become blurry. I also felt slightly sick, but this only lasted for a couple of hours and never actually made me throw up.",
  "Around an couple of hours later, (especially as it was dark), I was able to see little squiggly lines on the wall and my fingers/hands appeared to be covered in thick sticky stuff  so much so, that I would feel the need to wash my hands (and even my face) every 20 minutes or so! Despite this, I now felt pretty good within myself and was having a great time.",
  "My memory then became fractured, leaving me beginning a conversation and then forgetting what I had intended to say, just seconds afterward. I would also find (mainly as a result of people telling me) that I was speaking gibberish. People would also have to repeat what they were saying to me, as I would often forget what even they had said!",
  "When in this state, I will occasionally look in a mirror, just to check out my pupils. By now, they were well dilated and the wiggly lines would make my face appear to pull different expressions (or even change into someone else altogether!)",
  "I still felt pretty good, and this feeling lasted for another two days (as did my problem with concentration/memory). During this period, I almost blew up the flat, after putting in an apple pie, turning on the gas, and promptly forgetting to light the oven! Fortunately, my boyfriend noticed after about half an hour or so and opened a few windows.",
  "Eventually I returned to normal. It took me an extra two days before my pupils returned to their normal size and another before I could read properly again.",
  "This experience was almost the same as my experiments with sertraline (just without the 4 days of constipation, or the trouble sleeping).",
  "I enjoyed it immensely (despite nearly blowing myself up) and intend to do it again some time just as soon as I have got some more tablets off the doctor. I would, however, advise anyone wishing to follow in my footsteps to make sure that they have someone around for the whole period of their intoxication."
 ],
 "erowid": {
  "id": "5515",
  "citation": " Rebecca. \"Mad Memory - But Fun!: experience with Procyclidine (ID 5515)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5515",
  "substance": "Procyclidine",
  "views": "9847"
 }
}
