{
 "id": 20524,
 "title": "Naked Golf Course Romping Cures Depression",
 "date": {
  "submission": "2006-06-16T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Gavrilo Princip",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "<p>Let me begin by saying that I have been put in a mental hospital three times in the past year for psychosis and depression. It is believed that my psychosis was triggered (not caused) by the use of LSD, the details of which I will not go into. After being prescribed with a myriad of medications with little help, and accompanying serious side effects (anti-psychotics will numb your life) I was becoming very fed up with the doctor's half-assed attempts to make me better.",
  "I had read some about LSD being used half a century ago to cure certain mental illnesses, one of them being depression. I had stopped taking my anti-psychotic secretly less than a week before and was beginning to taper off of my anti-depressant, also secretly. Since the depression was the principle enemy to my well being, I decided to give LSD a try, by myself, to defeat it, despite how it might affect my psychosis.",
  "It is usually quite difficult to procure acid where I live, but I unexpectedly made a new contact and obtained four hits by the end of the day. Looking back, this was Divine Providence. I was on my way home at about 1:00 a.m. and decided that, in order to time my trip so that I would not be tripping very far into the next day, I needed to do it then, so I took the four hits, roughly one half hour before I would be home. I had taken to doing pre-trip auto-hypnosis to ensure a good trip for my past few trips, [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] but since this is awfully difficult to do while driving, I decided to forego it. My mindset was rather typical of that time of my life and was permeated by a mild to moderate sadness, apathy and profound sense of being alone even when amongst close friends.",
  "On a side note, I live with my parents and was 17 at the time. My parents knew of my previous drug use because of my hospitalization, but I had convinced them that this was a thing of the past.",
  "As I approached my neighborhood, I became increasingly aware of the growing intensity; within five minutes of first feeling the effects of the drug, I was seriously beginning to trip. I pulled into my neighborhood (thankfully, as it was becoming very difficult to drive) and stopped to talk to my gate guard (I live on a heavily wooded golf course, which makes for some rather interesting trips). Thankfully it was T., the young gateguard who has no problem with drugs. I told him after a moment of chit-chat that I was tripping and that I needed to get home, but if he saw me on the course that night to not worry. So, I pulled into the driveway and walked in the door, coming face to face with my mother in a well-lit area. Fortunately, I act weird enough normally so that tripping around my parents is relatively easy if made short, but I knew that my eyes were very dilated and the look on my face was one of fear, so I came close to panicking. Fortunately, I was able to keep the conversation very short, with few questions and only a little bit of evident confusion on my part (which isn't all that out of the ordinary for me).",
  "As I walked up to my room, my thoughts were of how to make sure I don't have to interact with my parents anymore that night. I decided on taking a nice long bath, which had always been soothing while tripping in the past. I got into the tub and tried to relax, as I was becoming very anxious about the rapidly accelerating intensity. The most LSD I had consumed before was two hits at a time, and I was alone then also. Apparently this new acid was of remarkable strength because I was quickly having extremely intense visual hallucinations and lack of physical coordination--much more so than on two hits, even taking into account doubling the dose.",
  "My bathtub is feaux-marble, which has lots of swirling patterns and such, so the there was much visual fodder for the trip. After what seemed like half an hour of this (probably more like 5 minutes), I was on the verge of panicking, so I decided the best route was to go to my room and go to turn off the lights and just lay in bed and listen to music. So, I got out of the tub, and started to dress. Quickly realizing that this was going to take a great deal of effort and time, I stopped after getting my boxers on.",
  "Normally I plan my trips music-wise, as listening to music is my favorite thing to do while tripping. I had planned an extensive list starting with Bach's Well Tempered Clavier and peaking with Rachmaninoff and Prokofieff Piano Concertos. As I got into my room I quickly realized that to do all this, I would first have to find the list, then find the CD's, then find the cases to the cd's already in the changer, and then switch them out. Way too difficult, so I just turned on whatever was in there and turned off the lights to go to bed.",
  "I had had audio hallucinations before but they had always been familiar sounds: applause, laughter, talking, hearts beating, car horns, etc. These hallucinations were sounds which did not even faintly resemble any sound I had heard before. In addition to that I had closed eye visuals of creatures and scenes likely induced by reading too much H. P. Lovecraft, though they were not scary in any way other than their intensity. The thing that worried me most though, was the thought processes I was having. I was quickly losing the ability to think about anything in way that would possibly warrant the term 'thinking'. I did not know what to think about human relationships, especially that of parent-child, specifically my parents and I. I spent God-knows-how-long trying to figure out what I might say if my parents came into my room and 'woke me up'. It was so intense that I panicked and grabbed a double dose of anti-psychotic to help fight the trip.",
  "Looking back, I have no way of telling what this did to the trip. The madness proceeded on for awhile and I completely lost track of time.",
  "I sat up in bed after about three hours (judging by which CD was on) with a terrifying revelation. I realized that tripping was a trap that had been set for me and, once released, I was the only person left on earth and I would be tripping until I died. This was an incredibly terrible feeling and it was accompanied by an intense rush of what I think must have been adrenaline. On top of that, the rush seemed to be screaming at me in a human voice, though I could still clearly hear the music. Although I was the last person on earth, the other's bodies were still here but were merely hallucinations meant to fool me into thinking that the trap wasn't real.",
  "I wallowed for a few fleeting moments in utter despair, but quickly decided that although it was a terrible fate, the way to go was to make the best of it, and go outside and enjoy myself. So I precariously marched downstairs and straight out the back door.",
  "I walked out towards the golf course and on the way contemplated the necessity of clothes in my unprecedented situation. I determined that they were pointless, so I took them off. Of course by them, I actually just mean my boxers. As I reached the golf course I realized that my thoughts about making the best of the situation stopped at going outside; I was very confused about how one goes about enjoying oneself naked and tripping very hard on a golf course in the middle of night. So, I did the first thing that came to my mind--I did a slow somersault on the still-moist-from-rain grass. I then proceeded to jump in a way that seemed to be dancing. I had run out of ideas at that point and then I started to have thoughts of what I should do while tripping and it occurred to me that I could get away with anything, even rape if I wanted.",
  "I quickly dismissed this idea for several reasons.",
  "1) Even if the people werent real, I still knew it was wrong",
  "2) I know from experience that sexual activity while tripping hard is damn near impossible",
  "3) I don't know more than three or four people in my neighborhood, and two are female and neither of them are attractive or under 40 and lastly",
  "4) some corner of my brain that wasn't tripping was screaming at me that this would be a VERY BAD IDEA, seeing as how I'm not cool with prison and all... I then decided to go for a walk down my street (which is always very moving in a slightly spiritual, completely intangible sort of way).",
  "I am now walking, stark naked, down my street at somewhere around 4:00 am. The intensity and severity of the trip, perceived trap included, was still building, so I decided to take a short rest and lay down. Thats when a car pulls up. I look up, and its T., the gateguard! I know he's just a hallucination, but I decide not to let him know that I know, and just play along. So after the initial astonished remarks, 'I thought your were going to walk the trails...How many did you take again? Do you know you're laying in the middle of the street naked?' And some arguing, he got me to get into his car.",
  "We talked for a while as he drove to my house about how he never did the whole 'naked tripping' thing and how its a good thing that nobody looked out their window and saw me. At one point I said, rather off-handedly and non-chalantly that I should kill myself (with the thought in mind that it didn't matter since nobody else was around to mourn my death and I was gonna be tripping until I died). He assured me that I should not, that everything was going to be fine, and when I told him that I was going to die, he said with complete confidence that I would not, which was probably all I needed to hear right from the beginning, anyway. I was very reluctant to leave his car, but he eventually convinced me to just go to bed. I went upstairs, still butt-naked and crawled into bed and went to sleep, just like that.",
  "I woke up the next morning to my father telling me that I had to pick up a family friend from the hospital that day, which I totally hadn't factored in the previous day. After the initial conversation, I realized all that had transpired the night before, and had a profound thankfulness to be alive, and for every person I knew that loved me, and for music and for absolutely everything. I had been brought to the utter depths of complete despair and solitude and had been redeemed against all impossibility. I almost got in a wreck about ten times getting my friend from the hospital to home, and I ended up crashing and sleeping a good twelve hours at my cousins' house.",
  "Although it seemed like a perfect revelation, my depression returned in a couple of days, nearly unscathed. However, I had a talk with my best friend less than a week after, and though she knew about the trip, she knew no details. On the subject of drugs, and life and suicide, she gave me a beautiful, powerfully moving oration and said many of the same things I had thought after waking up *verbatum*. I was nearly moved to tears, and felt clearly that God was telling me something, something I could not ignore any longer. I decided right then to turn my life around and quit being such an ass and constantly feeling sorry for myself. It has been several months since then, and although I have occasionally felt shitty like everybody does sometimes, the yoke of depression and constant dwelling on the thought of suicide has been lifted completely, after many years of suffering under its ever-growing tyranny.",
  "As for my psychosis, it feel either that it has diminished somewhat, or it has simply ceased to be important, though it is still occasionally troublesome, but well within tolerable bounds. I realize that I still have a long spiritual journey ahead of me with many trials, but I know now that I can survive anything God puts me through... unless of course it kills me.</p>"
 ],
 "erowid": {
  "id": "44018",
  "citation": " Gavrilo Princip. \"Naked Golf Course Romping Cures Depression: experience with LSD (ID 44018)\". Erowid.org. Jun 16, 2006. erowid.org/exp/44018",
  "substance": "LSD",
  "views": "4380"
 }
}
