{
 "id": 20528,
 "title": "Collection of Drugs, Intense Synergy",
 "date": {
  "submission": "2007-07-08T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Speedballer",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "1:00",
   "amount": "6.0 mg",
   "administration": "insufflated",
   "substance": "Hydromorphone",
   "form": "(ground / crushed)"
  },
  {
   "time": "1:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:15",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:30",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:30",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "2:30",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "5:30",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "5:30",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "5:30",
   "amount": "2 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "6:30",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "9:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "9:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Meperidine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I acquired a variety of substances over the week leading up to a concert I was going to. I got to the concert at about 6pm. I was in a fairly anxious mood as I had been anticipating one of the best nights of drug taking I'd ever experienced. I drank two beers to take the edge off while the opening act played. I wanted to take the bulk of the painkillers while the act I was there to see played their set.",
  "An hour later, about 7 pm, the act I wanted to see came on. I railed 6mg of hydromorphone over a period of 15 minutes, and simultaneously took 2mg of ativan. 15 minutes later I snorted a line of cocaine. 15 minutes later I snorted another, smaller line of cocaine. At this point I was feeling pretty good, but I hadn't hit the other side yet. The music was amazingly good. The bass was shaking my whole body and it felt pretty orgasmic. I drank another beer.",
  "About 1.5 hours after taking the hydromorphone, I popped two 5mg oxycodones, and then smoked a few hits of week. This put me over the edge. When I was standing, I felt like exploding with energy and focus. When I closed my eyes I got psychadelic visuals from the music. When I lied down it felt like each limb weighed 500 lbs. I've only done cocaine once before, but I never came down after the first couple rails. Even 2 hours after doing it, I felt fine. The effects of the painkillers, benzos and weed must have provided enough euphoria to offset the comedown of the cocaine.",
  "Over the next couple hours, we went to a club after the concert. It was probably about 11:30 by the time we got to the club. When we arrived I took 3 more 5 mg oxycodone, and railed the last of my coke. Up to this point I had taken $40 of coke. Right after this I took a tequila shot and drank a rum and coke. My overall mindset was still totally euphoric. I had absolutely no inhibitions, and was way more sociable than usual. I have to say though that it was all moving pretty fast and I wasn't taking in much. I was chain smoking cigarettes as each drag felt great.",
  "At about 12:30 I went outside the club looking for more coke. By about 1:30 I had $30 more and I railed that. Throughout the night, during the times I wasn't feeling the coke I felt tired and lazy. I nevertheless felt completely contented walking around long distances from destination to destination. I actually preferred moving around despite the overwhelming heavy and tired feeling. I felt amazing the whole time, but the times right after I did the cocaine were defintely more complete. Basically a speedball combination.",
  "At about 3 am I popped 2 mg of clonazepem to help me sleep, and I also took 3 demerols (50mg I think) as well. Looking back it was a lot of painkillers to take in one night, especially in combination with alcohol and benzos, but I think I spaced all of them well. There was basically 3 doses spaced evenly over 8 hours.",
  "Overall, the drug that fucked me up the most was the weed. I'm pretty sensitive mentally so psychadelic drugs like weed usually mess me up the most. But the synergy of week with the coke and the painkillers is about ten times the normal effect of weed. And although I usually experience paranoia from weed, this time there was just pure euphoria. I fell asleep easily that night, even though I still wanted to stay up, do more coke, basically not let the experience end. All in all, the things I can remember were great, and I can remember most of the night, although I wish I would have slowed myself down and taken more of the experience in at the time.",
  "The next day I felt tired and depressed, but not as bad as I might have expected. The next two days after that however, the second of which is today, I have experienced crippling depression. It seems to be improving however, and it also be related to some other physical things going on.",
  "Anyways, all in the psuedo speedball combo of painkillers and coke is pretty awesome. The added effects of weed is good too. I'm sure the benzos helped to take any edge off from the cocaine. The times where I was sedentary I took in a lot more of the experience and I remember a lot more. I won't be repeating this experience anytime soon for a variety of reasons.",
  "1.) The comedown is too intense",
  "2.) It's expensive",
  "3.) I don't come across this quantity and this amount of painkillers very often.",
  "I'd probably still take the euphoria and simplicity of good mdma over this experience. Although this experience may have been heightened had those around me been on the same drugs, which is usually the case with mdma."
 ],
 "erowid": {
  "id": "54945",
  "citation": " Speedballer. \"Collection of Drugs, Intense Synergy: experience with Opiates, Benzodiazepines, Cocaine, Alcohol, Cannabis & Opiods (ID 54945)\". Erowid.org. Jul 8, 2007. erowid.org/exp/54945",
  "substance": "Opiates, Benzodiazepines, Cocaine, Alcohol, Cannabis & Opiods",
  "views": "21954"
 }
}
