{
 "title": "An A4B2 Nicotinic Acetylcholine Agonist??",
 "author": "Psi Locybe",
 "citation": " Psi Locybe. \"An A4B2 Nicotinic Acetylcholine Agonist??: experience with Nootka Lupine (Lupinus nootkatensis) (ID 20544)\". Erowid.org. Jan 19, 2003. erowid.org/exp/20544",
 "substance": "Nootka Lupine (Lupinus nootkatensis)",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "2 bowls",
  "smoked",
  "Nootka Lupine",
  "(leaves)"
 ],
 "report": "<p> The joy of adding to the collective knowledge of humanity; a high in its own right, unparalleled.  :)</p><p>[Erowid Note: We have little information currently about this herb and the author does not specify the exact part of the plant.  Also, if the author reads this report, we need additional information about another report they submitted :), please contact us.]</p><p>For a number of years, I have lived by my knowledge of herbs; when two bones of my wrist was dislocated and the thumb subjected to harline fracture in a sparring match, a bowl of lactuca provided the painkiller to reset, and mint reduced the swelling.  When the food buget gets low (or when I just want to eat higher-quality food), off to the woods I go - I spent about two years subsisting wholly on the local forest... and noticed the mushrooms I was passing up in the forest (there were much tastier ones) selling for $121/oz at the local supermarket.</p><p>Knowing this, a fondly-regarded family member has given me several books to enhance my knowledge.  One of these was 'Food plants of coastal first peoples,' by Nancy J. Turner.  Charming book.</p><p>  Citing an earlier tome, it notes that 'When the woman and her husband eat too much of the (unprepared) lupine roots, they become really drunk.  Their eyes are heavy, and they cannot keep them open, and their bodies are like dead, and they are really sleepy.'</p><p>  A few important notes are in order, here; first is that the tome cited was published in 1921, and the second is that, prior to about 1969, the terms used to describe intoxicants are utterly meaningless.  Prior to about 1950, everything from amanita muscaria to the here-noted lupine was said to cause 'drunkenness.'  Neither one is at all alcohol-like, IMO.  Starting at about 1950, the at-least-varying, but ludicrous, term 'psychotomimetic' comes into play.</p><p>  I have had psychotic friends.  Neither entheogenesis nor theraputic introspection were amongst the list of symptoms they described.</p><p>  Nonetheless, here was, apparently a reference on an entirely new psychoactive.  I did the logical thing for the science-loving individual; noting that fatality is a listed effect (the sole effect not prior listed herein, from the literature), I thought to myself 'better to die like Curie (Marie) than to live like the sheep which seem to comprise everyone over about 10 years of age in this society.'  (not entirely true - I once met a 13yo runaway who had an original, challenging, engrossing, and insightful thought)</p><p>...and thus it was that I became a first-time smoker of lupinus nootkaensis - which, btw, is slightly bland and yet rather extremely delicious, and whose seeds, when the toxic alkaloids are extracted, contain more protien than soy.  (they also contain said protien before extraction - they're just likely to kill you).    All parts of the nootka lupine are alkaloid-bearing, but what I smoked here was leaves with a small amount of flower matter.  I have also eaten the roots and seed, though in smaller quantity.</p><p>  It is an interesting sedative, whose effects can best be described by comparison to scotch broom - which contains many of the same alkaloids (lupanine et al), and whose primary noted alkaloids form the immediate precursor (I'm a bit pissed at the only molecular image I have been able to find - while it displays a readily-understandable cyclobutylcytisine nucleus for lupanine, which would make it (1R-5S)-1,2,3,4,5,6-hexahydro-</p><p>1,5-methano-3,4-cyclobutyl-8H-pyrido[1,2-a][1,5]diazocin-8-one, to borow tocris' naming and numbering for cytisine as a starting point, the image also has this completely-unconnected-to-the-damnable-molecule 1,1-dimethyl-2,5-ethyl-5-methylthiodioneol-4-one just floating in space (note about my poor naming skills, both ketonic oxygen molecules and the hydroxy are oxygen attached to the sulfur, which is attached to the methylene group, which is attached at the 5 position - rather than a 5-methyl group *somehow* supporting two double-bonded sulfur atoms and a thiol group.  Apparently, a hydroxy is knocked off of sulfuric acid to bond with the 5-methyl carbon... maybe I should have called it '-5-methylnorhydroxysulfate-,' or somesuch.  ::sigh::).</p><p>Anyways, I feel pretty safe proposing its pharmachology as an a4b2 nicotinic acetylcholine agonist, though I should probably confess that I have neither radiolabled lupanine nor cloned a4b2 nicotinic acetylcholine receptors lying around at this precise moment... but its logical direct precursor, cytisine, is a rather exclusive agonist, thus.  Qualitatively, the plants are a bit different - but it's still the closest comparison I have.</p><p>...which is to say, it's cannabis-like, without a single bit of anandamide response, toxic in large dosages - and probably (though this I have not confirmed with lupine itself) results in memory loss with short-term intense abuse: Never smoke with an 'alchohol-mentality'-type friend.  Know when to say when.</p><p>The plant's strength as a raw herb is medium; stronger than the average lactuca leaf, weaker bowl-for-bowl than, say, quality cannabis... about on the same level of strength as lobelia inflata (and similar pharmachology in parts, though the dopamine-uptake inhibition, and the fact that it will knock both cytisine and amphetamine out of the corresponding receptors (nACh/dopamine), give lobelia a different quality) - though not the strength of the cultivar.</p><p>Incidentally, the fact that I have found, in my experience, all nicotinic acetylcholine agonists to be very cannabis-like at high dosages is apparently irrational, considering that d9THC is apparently a hippocampal acetylcholine release antagonist (Nava, Carta, Columbo, Gessa, 2001).  ::shrug::  And yet, I find it so.</p><p>Nonetheless, there's my new herb to the vault - nothing mindblowing to report about it, but a pleasing mellowing which everyone who has tried it has enjoyed...</p>",
 "year": "2002",
 "id": "20544",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2003-01-19T08:00:00.000Z",
 "views": "22433",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Nootka Lupine",
   "form": "(leaves)"
  }
 }
}
