{
 "title": "More Research is Called For",
 "author": "Gumby",
 "citation": " Gumby. \"More Research is Called For: experience with DiPT (ID 20562)\". Erowid.org. Jan 20, 2003. erowid.org/exp/20562",
 "substance": "DiPT",
 "bodyweight": "165 lb",
 "report": "<p>I'm very interested in research chems, but don't experiment very often.  A while back I saw something on the web about DIPT freebase.  I was very excited about this, but also very skeptical. At the time, I didn't have the time or $$ to explore, and nobody here responded with a similar experience, so I got even more skeptical, especially after seeing that he confused some chemicals.</p><p>Finally I decide to explore DIPT. A few days back, I took 50 mg of DIPT-HCl orally on an empty stomach. I feel a slight pressure on my ears, but that could have easily been the power of suggestion. I don't notice any audio effects all day.</p><p>I weighed out another 100 mg and dissolved it in 100 mL of a solution of NaOH at pH of about 11. The pH could be off, because I've taken very bad care of my pH meter, but it gives me a ball park. Next I added about 100 mL of naptha and shake/stir. Even with rigorous shaking, I get extremely little emulsion. I drew off the naptha and evaporated it in a pyrex dish, resulting in a very light colored tan/orange crystals.</p><p>This morning, I decide to debunk this guy's report, figuring I'll get some auditory effects if anything. I put 27 mg of freebase DIPT crystals into a pipe and start melting it. Set and setting: I'm in my bedroom, alone with the lights on. It's morning. I'm in a 'scientific' mode, expecting little to no effects, thus not prepared for a trip spiritually. The torch lighter I bought yesterday failed after the crystals melted. I relight the lighter and get a bit of smoke, and the damn lighter dies again. Not to waste, I inhale the wisp of smoke and re-light. With the lighter acting up, it's hard to say exactly how much I smoked.</p><p>The effects start to come on slightly slower than DMT. I feel a little something, and have a chance to put the pipe down and notice something is happening. I slowly launch into a strong tryptamine buzz with moderately strong visual distortions, but no visions. Mind is crazy, too. It's like a mix of effects of DMT and 5meoDMT, but less intense and more gentle than either. Coming up probably takes 30 sec to a minute. Peak lasted about 10 minutes, back to baseline in about 30.</p><p>I feel like there is much more to this - like there could be breakthrough. As I said, I really don't know how much I ingested, but I'm guessing about 15-20 mg with poor smoking technique due to the lighter problems. Definitely more research is called for. Anyone else want to try?</p>",
 "year": "2003",
 "id": "20562",
 "gender": "Male",
 "timestamp": "2003-01-20T08:00:00.000Z",
 "views": "13267",
 "dose": [
  {
   "time": "0",
   "amount": "17.5 mg",
   "administration": "smoked",
   "substance": "DiPT",
   "form": "(freebase)"
  }
 ]
}
