{
 "id": 2057,
 "title": "Philosophical Nightmare",
 "date": {
  "submission": "2005-07-27T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "mama c.",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.125",
    "unit": "oz"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I would not recommend shrooms for an event which involves loud noises or crowds of people. Shrooms are better for quiet introspection: best to go with a few friends into a spot in nature and just relax. I did it the wrong way. I ate an eighth of shrooms the morning of my university's 'spring fling' music festival. Most students just get drunk for this event, but my friend and I thought trying shrooms would be fun.",
  "We ate the shrooms in my friend's dorm room and then smoked a bowl of weed to encourage the effects to kick in. I felt the shrooms almost immediately. Everything became surreal, beautiful, almost magical. My friend and I sat peacefully on her bed for about an hour, just staring at the shadows on the wall and listening to Pink Floyd. It was a wonderful experience.",
  "Then, we made the mistake of deciding to go outside and join the festivities. We walked out toward the amphitheater, where loud rock music was playing. Drunk kids were dancing and screaming everywhere. The scene was pure chaos. On shrooms, I could not handle the confusion. The drunk people seemed like animals to me. I started feeling sorry for them - here were cool, intelligent people who had reduced themselves to this ugly primal state. I saw one drunk girl crying and stumbling and felt immense empathy for her. I wanted to help her so badly. I started getting very philosophical, wondering why people did this to themselves - why people felt the need to alter themselves. I felt sick to my stomach. In fact, I vowed that, after the tripping ended, I would never do drugs again. I realized that drugs/alcohol are simply a false means of escapism for people who can't handle the reality of their lives.",
  "Also, I started to analyze my past year and my relationships. I saw, very clearly, the mistakes I had been making, the lies I'd been telling myself. I basically stripped myself of all the illusions I'd built up to protect myself. I then began to analyze the friend I was with, who was also shrooming. I had always admired this friend, I thought she was so cool. That day, however, I saw her in a new light. She had taken more shrooms than me and was ranting and raving, and frankly out of her mind. She scared me. She looked like a frightened little girl. A maternal instinct kicked in: all I wanted to do was protect her. She lost all of the mystery she once held for me, and became very real to me that day, a flawed, scared, vulnerable human.",
  "I also started thinking, with terror, about grand philosophical ideas: the flaws of society, the reality of death, etc. It was like I understood everything at last. I let go of my protective barriers and saw the truth in everything. It was a frightening, sobering experience. I still carry the lessons I learned on shrooms with me today. The world seems grimmer to me now.",
  "I think shrooms are a wonderful drug for, say, going to the beach and watching the sunset with a couple of close friends. It's a philosophical, intellectual drug and it's best to be around people who you can talk to, rather than just absorbing a chaotic scene like I did. Shrooms can be a wonderful experience when done in the right setting and with the right people."
 ],
 "erowid": {
  "id": "16801",
  "citation": " mama c.. \"Philosophical Nightmare: experience with Mushrooms (Magic Mushrooms) (ID 16801)\". Erowid.org. Jul 27, 2005. erowid.org/exp/16801",
  "substance": "Mushrooms (Magic Mushrooms)",
  "views": "4411"
 }
}
