{
 "title": "The Ultimate",
 "author": "Numb Aneurysm",
 "citation": " Numb Aneurysm. \"The Ultimate: experience with Mushrooms (ID 20609)\". Erowid.org. Sep 9, 2007. erowid.org/exp/20609",
 "substance": "Mushrooms",
 "bodyweight": "200 lb",
 "report": [
  "<p>I was walking to my house one afternoon at about 2:40 pm and I was unusually spunky, mostly because I had just bought $40 of shrooms for only $20, and I had never done them before.  I had smoked weed, done painkillers, and even tried coke, but I had never done a real psychadelic.  My friends had been chanting 'eat them, eat them' for 20 minutes by then and finally they convinced me. ",
  "I took out one cap at a time, put them in my mouth and chewed/swallowed, albeit with the help of Mountain Dew.  Two of the caps had stems on them and I decided that I wasn't going to eliminate any of the experience by being a wuss and taking off the stem.  I noted that the caps tasted like chewy, unsalted peanut shells.  I left a good number of caps (but mostly stems) for one of my friends who also wanted to try shrooms.  The whole half an hour walk from there home I complained about how 'This better not be a crock of shit.'",
  "As soon as my friends and I parted ways for the rest of the way to my house, I began to feel heavier.  My head felt like it had gained 5 pounds and my feet seemed to be a little less wary about where they liked to place themselves, but I still wasn't all that screwed up. When I arrived at my house I didn't feel much different.  I continued losing and gaining back the sensations that I experienced walking home.  I walked up the staircase towards my room.  I turned on Pink Floyd's 'The Dark Side of the Moon' and waited.  Within 5 minutes my world was a blur.",
  "I felt the music envelope me like a cloth.  I grooved with the beat without my mind's consent, and every time I tried to stop I'd laugh and continue on grooving.  Soon I had lost almost all of my motor skills except for my neck, so I rested my head up against the wall and grooved.  By the song 'Time' I had lost a grip on all of reality.  I had forgotton that I had a body below my neck.  My head became a fish swimming upstream from the ocean to breed.  I continued this until 'The Great Gig in the Sky' when I decided that it was time for a movie.",
  "I looked out the window and the sunshine was blinding.  I looked at my movie rack (somehow I had regained my ability to control my body) and I chose a movie well suited to my current state: Austin Powers.  I put it in the VCR and laid back again.  The commercials came on and I proceded to watch.  I had forgotten that one of the commercials for Austin Powers preceding the movie is for Spawn.  As soon as I saw this I freaked out.  The clown started coming out of the television and as I got up to turn off the television a monster's hand reached out for me.  I snatched the remote and turned off the T.V. like I was firing a gun at a super villian.  After that, I heard the garage door open and I knew my mom was home. I knew that if my mom saw me like this she'd disown me, so I stayed up in my room for another 20 minutes and turned on the T.V., but not really watching it.",
  "At 3:50 I decided to chance getting caught and go downstairs and head outside for a walk in the park.  I said 'Hey mom, I'm gonna hang out with some friends in the park, ok?'  She looked at me like I was the biggest moron in the world.  'It's raining outside.'  I turned around and saw that the outside was completely pitch black and was raining like a hurricane.  'Uhh, yeah... I know... but we only meeting in the park,' I said, dumbfounded.  'Ok, just don't be too long.'  I agreed and left with my cd player.",
  "I had all of my favorite CDs with me, but I didnt feel much like listening to Pink Floyd, so I decided to listen to something else, but it currently escapes me what it was.  I walked up the road and by then, it was dry and sunny again.  I turned into the park and to my wonder and amazement, everything was truly alive.  Not just alive, but living, breathing, and caring.  It looked as though all of the plants had mini lights inside of them and illuminated the path.  Even the needled plants looked friendly.  I followed the trails farther down, talking to myself the whole time, not caring if someone was listening.  I was experiencing a body high like nothing before and an indescribable intelligence boost.  I knew all of the answers to the universe and then some, and it all seemed so simple.  I knew that this drug tested my character, and I needed to face whatever demons it dealt me.",
  "I was turning the corner out of the park area to the main path when I turned my head to get one last peak at heavens grotto, and then the whole path I had just tread on melted and twisted into faces, arms, torsos of people moaning, crying, needing my help.  I really looked like Dantes Inferno.  I turned away because I didnt want to see so much horror, but then realized that I had to look, for the sake of myself, but when I looked again, it was gone.",
  "I continued down the trail thinking about what just happened, still not listening to my music.  I thought Who can I talk to right now?  I am so very lonely.  I used my cell phone to call friend #1, who was eating dinner, and then friend #2 who was also eating dinner.  I wanted to call this girl whom I had affection for, but I then realized that she doesnt like people who do drugs, so I just listened to one of her recordings she left on my cell phones answering machine for 15 minutes.  It was all I could do to keep from dying of lonliness.",
  "I decided that I was getting pretty sad and continued on where I had come from but instead of going toward my house form the park, I went the other way.  I stopped by friend #3s house.  He was a straight-edge sort of fellow, but I figured since Im not trying to get him to be my girlfriend its all right.  I rang his doorbell and he came running down the stairs.  He opened the door and looked at me kind of weird, mostly because I had never talked to him or come to his house without someone else before, but also partly because my face was completely red and I kept touching it.  Hey.  Whats up, he asked.  Oh not much.  Just tripping on some shrooms,  I replied.  That was when he gave me the most shocked/repulsed/scared look of my life, and I would pay $20 to see it again.  Do you need to sit down? he asked, not knowing what to do.  Yeah man, Id love to sit.",
  "So we sat on the bench facing his tree for a bit and I ranted on about how life is beautiful and trees are beautiful and that he was a beautiful person and that I was beautiful but after what seemed like a million years to him, he said Well I got to go now.  See ya round.  Dont kill yourself, now.  I left and put In Utero into my CD player.  As I walked down form his house the teenage angst and depressionism got to me.  I started to get lonely again and wandered back toward my house.  I said to myself Shit, I cant go home like this.  Im still a mess.  So I took a right onto a trail that leads to my house, but takes a while longer.",
  "As I walked down the trail I reached a spot where I could sit.  I was tired from all of the walking and I was still sad.  I could tell that I was coming down from the trip by then.  I sat there for 45 minutes thinking about my death and my lonliness and why it always rains on me when Im sad and cant feel my legs.  I then proceeded home to where I was confronted by my mom who accused me of being stoned, but I truthfully told her that I was not and that she was just being paranoid and that I was just tired from walking for 2 hours.",
  "In retrospect I believe shrooms are the best substance I have abused yet, and I have done them a few times more since this experience.  I also plan on continuing, since it is a great way to learn about myself, others, life, and a great way to pass the time.</p>"
 ],
 "year": "2001",
 "id": "20609",
 "gender": "Male",
 "views": "2748",
 "dose": [
  {
   "time": "0",
   "amount": "6 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2007-09-09T07:00:00.000Z"
}
