{
 "title": "On and Off the Grog",
 "author": "gomaos",
 "citation": " gomaos. \"On and Off the Grog: experience with Kratom (Mitragyna speciosa) (ID 20651)\". Erowid.org. Jan 22, 2003. erowid.org/exp/20651",
 "substance": "Kratom (Mitragyna speciosa)",
 "bodyweight": "",
 "report": "<p>[Originally posted to Shaman Australis Web Forums.  Thanks to SA and gomaos for this report.]</p><p>I had to give it a shot, especially after touching alcohol again after having been off it for 6 months completely.</p><p>At the beginning of December, say around the 10th , I had bought a bottle of scotch and drank it.  Nothing bad had happened, nothing depressing, life was being pretty gradual... i just was bored BECAUSE nothing ever happened.</p><p>For about 4 weeks, I drank almost every day.  Perhaps twice a week, I'd drink a bottle of whiskey/day, other times a sixpack of beer a day or equivalent.</p><p>On weekends with friends perhaps 2 bottles of whiskey or equivalent/day.</p><p>Then I traded some kratom leaves with a friend, 25 nice and big ones, and made an extract, using water, citric acid and vinegar.</p><p>I simmered until a black paste was left.</p><p>I took half of that paste.</p><p>Approx 4-6 hours later I felt no need to drink anymore and switched from homebrew to coffee.</p><p>The next day I had the other half of the extractand stayed of the alc.</p><p>I have to mention the the extract also gives you a slight tryptaminy tingle in the brain, quite pleasant and perhaps a little similar to mdma.</p><p>If the dose was upped say, four times, this would be quite spectacular.</p><p>I stayed off the booze four five days and probably would have stayed off it further, but we went to the Coast stayed in a motel, and since my mate was shouting there was all this free bourbon, just too good an oppurtunity to say no.</p><p>So I spent 2 and a half days on the grog again.</p><p>Quite heavily, but my, I paid for it dearly with horrible hangovers.  On monday morning I made a second extraction of the kratom leaves, as well as adding some shiva stalks and leaves, calea leaves, my last mexican poppy leaves and some brahmi.</p><p>It helped me again to stay off it for 3 days now and I think I'm gonna make until the next good oppurtunity comes along.</p><p>Being able to control your addiction is what you really want, since you want to be able to do IT at certain times but not ALL THE TIME because that destroys your life(style).</p><p>I'm now toally out of kratom, but will get some most likely in another 2 weeks...  In meanwhile I suppose me old mate san pedro and a few off his mates will have to help out.</p><p>I give kratom 10 out of 10 as an ethnobotanical miracle plant.</p>",
 "year": "2002",
 "id": "20651",
 "gender": "Male",
 "timestamp": "2003-01-22T08:00:00.000Z",
 "views": "28374",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(extract)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ]
}
