{
 "title": "Increased Bad Side Effects of Withdrawal",
 "author": "Stan",
 "citation": " Stan. \"Increased Bad Side Effects of Withdrawal: experience with Cannabis & Paroxetine (ID 20668)\". Erowid.org. Nov 23, 2005. erowid.org/exp/20668",
 "substance": "Cannabis & Paroxetine",
 "bodyweight": "200 lb",
 "report": "<p>I'm writing this report to warn some people about my experience with pot and SSRI antidepressant withdrawals. I was previously taken 40 milligrams of Paxil, which is a Selective Serotonin Reuptake Inhibitor (SSRI).</p><p>Anyway, I hadn't smoked pot for about 5 months leading up to this date, so my tolerance was MUCH lower to pot also, but quickly went back to where it was (which was a little disappointing). I have been trying, for the past 10 or 11 days, to slowly ween myself off of the Paxil, because I've heard about the withdrawals. Even then, I was *still* withdrawing physically to some extent which wasn't quite comfortable ('electric' type shocks going up neck and head, and feet/hands also, emotional instability, etc.) Today, I smoked a bowl of some pretty high grade pot.</p><p>Within ten minutes, I started to feel really uncomfortable when I seemed to be feeling fine earlier. The 'shocks' were much worse, and for the first time I felt actually bipolar. I was a mess, emotionally for no known reason but the interaction. It's been about 2 hours now, and as the cannabis wears down, the bad effects are also.</p><p>Anyway, so my conclusion on this is pretty simple. It's quite clear to me that the effects of THC increased my bad side effects from the Paxil withdrawal. The chemistry of the two together, normally (on a steady dose of Paxil), is actually a good synergy. However, it's just the complete opposite if I'm trying to ween myself off of Paxil. I wasn't even feeling anything bad today, until I smoked, then *bam* all the bad side effects hit me.</p>",
 "year": "2003",
 "id": "20668",
 "gender": "Male",
 "timestamp": "2005-11-23T08:00:00.000Z",
 "views": "8773",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Paroxetine"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
