{
 "title": "I tried a Morning Glory Extraction",
 "author": "Tom Biggs",
 "citation": " Tom Biggs. \"I tried a Morning Glory Extraction: experience with Morning Glory Seeds (ID 2068)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2068",
 "substance": "Morning Glory Seeds",
 "bodyweight": "",
 "report": [
  "<p>... and it worked.",
  "Remember the Morning Glory FAQ Part I? It's ftp'able from hyperreal.com if you want to go look at it right now, /drugs/faqs/FAQ-morning-glory or something like that, I don't remember. You'll figure it out. [Erowid note: the FAQ is now available at http://www.erowid.org/plants/morning_glory/']",
  "Well, I ran through the procedure listed there, and it works as advertised. Myself and a friend just today tried the extraction, a small test dose to see what it feels like: ~125 seeds. I had assumed from my reading that 250 seeds would the equivalent of a full hit, but that isn't so. In the FAQ, he mentions a dose range of 50-500 seeds. Big help. I think 500 seeds would be about a full trip. YMMV, start small like I did and see for yourself.",
  "I'll start at the beginning. Early this summer I had downloaded the MG FAQ, and then I noticed a patch of very blue MG flowers growing on the edge of a field of corn along my way to work. I went there two weeks ago and harvested a mess of seeds. In fact I have stopped there three times so far and have netted 5200 seeds, harvesting sloppily to ensure that plenty of seeds were spread on the ground for next year. Hint on harvesting seeds: seed pods should be crackly and dry, and crumble and collapse a bit as you squeeze them, until you feel the hard seeds inside. If the seed pod is green and/or feels rubbery, come back in a few weeks when the plant is dead and the seeds have dried. Hint on counting seeds: once you have cleaned them out of their seed pods and you just have seeds, count out 100 (by 10s), then see what size measuring spoon that many fits into, or the closest number. The seeds I have fit ~100 into 1/2 tablespoon. Remaining counting goes quickly.",
  "Last week I used the method described in the FAQ, powdering ~1600 seeds in a coffee grinder (tough little bastards), doing a 20 minute Naptha wash, strain and dry, then 4 day soak in grain alcohol. I used a ratio of 250 seeds to 1 oz. of grain alcohol. (*Don't* use my summarized method, get the FAQ and follow the directions exactly - they're easy.) I strained the (urine-colored) extract into a jar. I squeezed the coffee filter with my hands for about 60 seconds to get all the extract out, and later that night noticed a mild buzz just from the absorbtion (via the ethanol) through my skin!",
  "The FAQ mentions petroleum ether, but I used Naptha - the alt.drugs experts whom I trust said that any non-polar solvent that evaporated cleanly would work. Naptha was cheap, $4.79 for a half-gallon at the hardware store. You may have to look around some, as the need for high VOC solvents has diminished recently due to environmental concerns, so not as many stores carry them as they used to. I found mine in an old hardware store, and it had dust on top. The alcohol I used was grain alcohol from the liquor store, 95% alcohol is good enough.",
  "Earlier today, a friend and I each had 1/2 oz. of the elixir, mixed with orange juice. No real flavor except the alcohol. It was like this:",
  "Within 5 minutes, a mild buzz was already noticable. The full buzz came on within 45 or 60 minutes. No nausea what-so-ever, in fact I was quite hungry and easily able to eat. Certainly, it is not the same high as LSD. The high is quite 'organic' feeling, not like mushrooms either, but with that mellow quality. Mild doses are very much like being quite stoned on 'mental' herb (as opposed to 'foggy' herb, you know what I mean). Aware but mellow, somewhat sparkly visually but no real visual distortions like an 'equivalent' dose of LSD (yes I know one is micrograms and the other is milligrams). No clenched abdomen muscles, or rictus face muscles (maniacal grin) either. Another difference is that most of the trip was over sooner, I was mostly down within 4 hours. This may change with dosage levels, I don't know yet. Herb complemented the high quite nicely.",
  "Of course all I have done so far would appear to be about the equivalent of 1/4 to 1/3 hit, so the next obvious step is to try a 500 seed dose. Plans are being made, and a report on that experience may well appear within a few weeks. ;-) This will involve 2 oz. of extract - 2 oz. of grain alcohol is about the same as 5 shots of 80 proof liquor, so I may evaporate off some of the alcohol before drinking it, since I don't have a high tolerance for alcohol.",
  "It seems many of the most recent MG trip reports have been somewhat negative or indifferent. So were the MG stories in the drug archives at hyperreal.com. They report: 1. weak or no trip; 2. ugly trip; or 3. puking trip. But I noticed that none of them had tried the extraction method mentioned in the FAQ. The FAQ explains why the extraction method helps you avoid these problems.</p>"
 ],
 "year": "",
 "id": "2068",
 "views": "15497",
 "dose": [
  {
   "time": "0",
   "amount": "125 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "submissionDate": "2000-06-24T07:00:00.000Z"
}
