{
 "title": "Take Care of Your Body",
 "author": "Pied Piper",
 "citation": " Pied Piper. \"Take Care of Your Body: experience with Piperazines (ID 20690)\". Erowid.org. Nov 3, 2005. erowid.org/exp/20690",
 "substance": "Piperazines",
 "bodyweight": "265 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "Piperazines"
  ]
 ],
 "report": "<p>A trusted friend approached me with some 'ecstasy' to sell.  I later matched it to a photo on DanceSafe.org which reported it as not MDMA or MDA but one of the piperazines.</p><p>It was a beautiful summer day and my friend who lives near the ocean and I decided to each take a tab.  We both experienced VERY INTENSE ecstasy-like highs - but they weren't quite ecstasy either.  These highs had a harder edge and a harder physical load on the body.  They were still pleasant. I spent several hours in the ocean having waded up to my neck in the cold Northern Atlantic water.  It was great.</p><p>Coming down was rough and required copious amounts of opiates and alcohol to cushion the blow, so to speak.</p><p>Unfortunately I awoke the next morning with a lung infection.  I have been asthmatic since I was a child and had been involved with a 'camping trip gone bad' as a young adult that brought me to the brink of death from real pneumonia.  As a result I am prone to respitory infections. Well sure enough, IMO, the combination of this powerful drug and my spending several hours in cold water weakened my immune system and subsequently my lungs got fucked up.</p><p>I made an appointment to see the doctor and was told to immediately go to the emergency room at the hospital.  Not because of the pill (I didn't tell anyone about that) but because I had full-blown pneumonia again and the readings they were getting from the little clip they put on your finger were showing that I wasn't absorbing enough oxygen through my pus and crap addled lungs to live much longer.</p><p>Is there a moral here?  Perhaps there are several...</p><p>IMO MDMA is lighter and less dangerous than the piperazines.</p><p>When one takes a powerful stimulant their body may be overtaxed and possibly unable to monitor its own temperature.  Avoid extreme cases of exposure - whether it be the cold waters of the North Atlantic or too much sun on a beach in Rio.</p><p>Finally, I know that I hadn't eaten that day so I stepped into the drug with no nutrients rattling around my body.  One should have a hearty breakfast before taking the plunge.</p>",
 "year": "2001",
 "id": "20690",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-03T08:00:00.000Z",
 "views": "7938"
}
