{
 "title": "Had No Control of What I Was Saying",
 "author": "Marty",
 "citation": " Marty. \"Had No Control of What I Was Saying: experience with Mushrooms - P. cyanesens (ID 20782)\". Erowid.org. Nov 3, 2005. erowid.org/exp/20782",
 "substance": "Mushrooms - P. cyanesens",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "4.0 g",
  "oral",
  "Mushrooms - P. cyanescens",
  "",
  " ",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>A little history First. I have eaten magic mushrooms 7 times b4 this experience 6 of them being amazing and one being a little below par (I dont think I ate enough). I love the experience, the intense visuals and feelings of peaking, and the amazing conversations coming down. 5 times I have smoked marijuana when I started coming down which skyrocketed me to above my original peak. I have smoked a fair bit of marijuana and taken a lot of morphine (due to a badly broken leg) but nothing at all will compare to smoking a fat blunt after coming down from a shroom trip.</p><p>Now to the story</p><p>I did mushrooms 4 times in 2 months then decided to take a little break so the experience would remain as great as always. I grew a small batch of cubensis (which worked very well for me but thats a whole other story), and had 4 grams left over. A friend of mine and I had picked a fair pile of cyanesens earlier that month and there was 4 grams of them left also. I have a very good friend; well call her S, who I have done mushrooms with on 2 other occasions where we both had incredible times. My mother works night shift and I wanted a nice place to stay for our trip so we had to wait until 10:45 to ingest our mushrooms. We had rented a real person version of Alice in wonderland and a documentary about dreams called 'a waking life' which I would recommend to any psyconaut. I am about 50 lbs heavier then S so I though if she ate the cubensis and I ate the cyans we would be around the same level. After eating the magical fungi we both headed to the hot tub to speed things up a little. After about 10 mins and a bit of conversation we both went silent. S was staring at the smoke coming out of the chimney next door and was amazed by it. I looked over and it was kinda cool but nothing too special yet.</p><p>My body started feeling really weird in the warm water as I was being suspended by it. We looked at each other and noticed massive pupil dilation and I decided to get pictures of one another. It is a little weird because I distinctly remember S not wanting her picture taken but she finally let me only with her back turned away, her body partially submerged and her face towards the camera...yet when the pictures were developed she was standing straight towards me and out of the water?????. Anyway the flash of the camera was what let me know I was really getting going. That little blank spot you get right in front of you after a flash turned into a ball sort of shape and would not go away. Everywhere I looked it was right in front of me for about 3 or 4 mins. We stayed in the tub for a bit longer, S was experiencing multiple hallucinations already and the halo around the moon looked amazing to both of us. We decided to head inside and get one of the movies started. We watched Alice in wonderland first and all I can say is WOW. I have seen the Disney version of Alice in wonderland but this was well beyond that. I can see that the book was written under the influence of powerful drugs. I have never tried opium.</p><p>We had the camera sitting beside us and started taking pictures of anything that amazed us...which turned out to be quite a bit. Only 2 of the pictures that we took during that movie turned out from about 15. Part of the way during the movie we got a little side tracked and headed to the computer. I sat in the living room for a few mins b4 making my way to the computer and I'm glad I did. I looked into the dining room and the curtains there were all creased and folded. They were astonishing. They looked like waves on the ocean and they would not stop flowing. Watching S talk on msn was amazing. The words just kept popping up and for some reason S could type at around 100 words per minute. I could not have typed a single word at this time so it intrigued me even more. We watched an animated video made for mushrooms trips and is was beyond words. We didnt talk much during the 5 mins of wild music and amazing patterns we just looked at each other in awe afterward. After this we got back to the movie, which was still very interesting, but everything in the room caught our eyes now.</p><p>It was dec 20th so our tree was up and the house was covered in all sorts of lights and decorations. There were lights around a window and they were reflecting off the ceiling in the most amazing way. The reflections were about a foot long and sort of pointed but they started to curve and dance. They looked sort of like fire but not as violent, they just danced and amazed us. After this my trip turned very physical. Anything I touched felt absolutely amazing. I have these velvet pillows and they were heaven. I just rubbed my hand up and down it, and started squeezing a little...words cannot describe how well it felt on my hands, not sexual or anything just an incredibly good feeling. I then realized 'I have two hands!!!' this may sound kind of dumb right but I was so happy that I could have twice as much good feelings. I even told S not to forget she has two hands. S was looking around the room when I noticed her shirt. It was a white fleece sweater...but the folds in the fabric started to sort of liquify and dance like the lights had done earlier. I told her to not move and I grabbed the camera to get a shot of it, which also didnt turn out. After that we looked at the tree, which was right beside us, all of the decorations and presents looked so cool.</p><p>Then we both saw it at the same time, a present near the bottom of the pile had very reflective wrapping paper on it almost like aluminium foil. We both immediately tossed all the presents out of the way and stared at this one in awe. The shininess of it was just too much to pass up so we looked at it for a little while longer. By this time the movie had finished and we watched a little bit of TV. I like watching TV on mushrooms because every time I change the channel I am in a whole new world, and having satellite there was a lot of places I could go. I looked down at a vanilla coke can and I wanted to see it melt. I have done this with flowers on a previous mushroom trip so I was excited to try it again. I stared at the can, concentrated really hard, but the can would not melt. I thought about giving up but all of the sudden the word Cola started to flow down can. The can itself stayed intact but the whole logo looked as if it were molasses and was dripping down very slowly. After watching a bit of TV reality started to kick back in a little. I really like how mushrooms come in waves. I could feel perfectly normal for a few mins after my peak then something will catch my eye and I am hallucinating like a bad dog once again.</p><p>S and I started sharing our experiences in our more normal state and I described to her the scene that took place in the dining room. I pointed over to the dining room and low and behold I saw the same thing as I did before. We had a bit of a comedown conversation about philosophy and how amazing it is that we are here. We talked about how great mushrooms are and how astonishing it is that a fungus that came from the ground can bring such feelings of joy and happiness to us. Earlier I had rolled up a blunt, probably 1.5-2grams of some fine cheeba. After much debate we mutually decided it was time. This is were the trip took a downfall. I get bad vibes just thinking about the events that took place but I do not want others to experience this so I will share my experience in hopes that others can learn from what happened to me.</p><p>I have a 79 Cadillac Seville that sits in my driveway and I hotbox often. We both bundled up in blankets and headed out there. S lit up the blunt and from the rate it was burning I knew we were in for a long haul. I don't know if this is a normal effect of mushrooms but when I smoke weed on shrooms I cannot taste the smoke. It feels just like air to me so I can take massive hauls that have almost lead to me puking. We smoked the blunt, just passing it for what seemed like ever, and I started feeling very disoriented. I cannot really describe the feeling but its almost like I was detached form the world. I had a complete loss of reality. Nothing really made sense to me at all. I was well higher then my earlier peak, so high I almost did not enjoy it. I was so incredibly confused I was even a little bit scared. I heard what Im sure was the wind but it seemed to sort of have voices within it. I couldnt really hear what they were saying but just the fact that they were there was not cool. I would try to listen to what was being said but then it would go away. Then when I became relaxed again it came back.</p><p>We continued smoking this massive blunt until it got really sticky icky (we have good bud up in these parts) and it was unsmokable. S took out the insurance papers to tear up the big blunt roach on. I didnt bother putting it out I just unravelled the outer layer of tobacco and to our amazement it did not stop burning. The little pooey roach was letting off a stream of the most amazing looking smoke I have ever seen. We both stopped doing everything and stared at the smoke. It was twirling and making cool shapes, faces were even appearing and disappearing on occasion. To this day I will rate that smoke in the top 3 most amazing things I have ever seen. The smoke was awesome but it signified the end of my pleasant trip. I began to feel very confused somewhat like earlier but even more so than before. S and I had a bit of conversation and I suggested going inside. She wanted to stay out in the car and chill for a little while. I had no problem with this but it was a little bit cold out and I suggested going inside by enlightening her on the warmth and comfort of the house. At least thats what I thought I said. S looked at me with a rather sad, somewhat scared look on her face. I dont know exactly what I said but my ideas must have come out wrong because she was very distraught.</p><p>I consider myself a fairly nice and generous person. I will only do something bad or mean to another person if they provoke it. But here I was in the car making a very good friend of mine sad. And I did not even know what I was saying. I would think something, then I would try to say it and it would come out in a really nasty way. I did not like this whatsoever but I really wanted to get inside and Sarah decided that she would join me. She opened the door to the car and made a comment to the effect of we had better be quiet. This did not make any sense to me at all. I wasnt trying to be mean but I told her that its 3 in the morning and no one is around, we can make all the noise we want to. I apparently started acting as I did earlier and I think I must have been very harsh with what I was saying because S was very sad at this time. We got inside and I went toward the kitchen but she passed right by me. I asked where she was going and she said out to the hot tub??? I asked if she wanted to go in the hot tub again but she said no she going out there alone and leaving???? I was so confused. This didnt make any sense. I walked over to ask her what was going on and she was crying. I had apparently said something really nasty to her in the car and she thought that I wanted her to leave. This just crushed me.</p><p>It was all over right there. I dont remember saying anything mean??? This is a good friend of mine why would I ever do that???? And something bad enough for her to want to leave. It was all downhill from here. I reassured her that I dont want her to leave and I never meant to say anything that would insinuate that. I asked her what I had said that was so terrible but she would not tell me. For some reason I was absolutely stuck on what I said. That was all I wanted to know. I felt horrible inside I wanted to know why and what I had said but she would not reveal it. This was also the time that she started having stomach problems. The large dose of mushrooms was taking their toll on her tiny tummy. She went to the bathroom to throw up and this was terrible. While she was in there I was still feeling absolutely horrible for what I had done. I thought that I heard her crying again so I knocked on the bathroom door. She said she was not and she would be out in a minute. So I sat down in the living room. I waited what seemed like another 10-15 minutes and she was not out yet. I then though I heard crying again so I went to check on her. She just answered the same way and said she was fine. The same process went on for 3 or 4 more times and I was just feeling like shit.</p><p>I wanted to help but I though that she was hiding from. I thought she was scared that I would say something bad again. I went back one last time and knocked on the door and she told me, that she had only been in there for about 5 minutes. This just baffled me. I had been pacing around the living room for what seemed like at least half an hour. I looked at the clock and she was right. I went back to the living room to try and calm down but it again seemed like forever so I went to check on her again. Before I knocked I looked at the clock and to my surprise it had only been 30 seconds. I have experienced eternal moment before but they have never been unpleasant. I knew I was full swing into a very bad trip and I did not like it at all. Luckily S caught onto this and after she came out she reassured me that everything was ok. She forgave me for what I said because she knew I would never mean any harm to her, but she would not tell me what I had said. I dont know why but his was all that mattered to me. She put on A waking life to try and get my mind off it but it would not go away. I would concentrate on the movie for a few minutes then it would just pop into my head again.  Every time it came back the horrible feeling of what I had done came back too.</p><p>I thought that if I knew what I had said the hurt would go away, but she would not tell me. Maybe it was a good thing that she didnt, maybe it was bad but at the time all I wanted was to know. Her stomach started acting up again and she headed to the bathroom. This was not good. The same feelings and things started coming on. S and I are really good friends, not involved or anything, but every time she left the room it felt as if I had been dumped in the worst way possible but 10 times as bad as that. When she returned I would just ask what I had said again and the loop just went on for a while until I finally got control of my mind. I watched some of the movie and things were going much better than before but just remembering how bad I had felt earlier brought chills to my spine. S asked me why her stomach was hurting and I though in my head well I gave u a lot of mushrooms, more than u should have taken. Your stomach does not like to deal with all that poison so you are puking, but what came out was  well I though u could handle it but I guess u couldnt in a really nasty tone. I just froze. I knew what I wanted to say but it didnt come out that way. I realised that I was saying things that I did not want to. They just came out before I even had the chance to stop it. I was so not down.</p><p>I have been very drunk or high, and done stupid things on many other occasions. But I always knew what I was doing it just seemed like a good idea at the time. With the mushrooms I had no control of what I was saying. Because of this I considered never doing mushrooms again. The rest of the night was fairly mellow. We watched the movie for a while. A bit of TV, then off to bed around 6:45. This went from the best time of my life to the worst within a few minutes. Mushrooms are an amazingly powerful drug. I did not give them enough respect and they kicked my ass. I was kinda depressed for at least a week after that. I was so unsure of myself for the longest time, I kept remembering that I would say things that I didnt mean and I was so careful with what I would say.</p><p>Looking back on the experience I did have bad times but there was so much good times to counteract the bad times. I also did not have enough respect for the shrooms and I am glad that I do now. I'd say it was worth it because I was going to eventually have a bad trip and now its done and over with. I hope I will be able to deal with any other bad things that happen (hopefully they dont). I did 5.5 grams of cubensis just a few days ago and had the best time of my life. I love the shrooms. They are the best drug known to man. All natural too. I cant ask for anymore than that.</p>",
 "year": "2002",
 "id": "20782",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-03T08:00:00.000Z",
 "views": "3473",
 "dose": {}
}
