{
 "title": "Low Dose Endeavor",
 "author": "DevilDoc",
 "citation": " DevilDoc. \"Low Dose Endeavor: experience with 2C-T-2 & Alcohol (Wine) (ID 20810)\". Erowid.org. Jan 28, 2003. erowid.org/exp/20810",
 "substance": "2C-T-2 & Alcohol (Wine)",
 "bodyweight": "175 lb",
 "report": "<p>I have used 2C-T-2 a number of times, and each time in the 16-32mg range. I never had any of the intense visuals that many people claimed to have - but I think that probably has to do with other chemicals consumed during or around the experience. In general I have found the chemical to be a very relaxing one that induces a state of cloudiness, not unlike pot, but not like it either. I decided last night to give it a try in a social setting, but with a low dose so as not to be too foggy.</p><p>The night began with consuming a capsule containing 6mg of the material at about 6:00. I was going over to my girlfriend's around 8, and wanted to see what kind of empathogenic qualities, if any, I would observe. I got to her place at 8:50 (right about when I would peak, usually - around 3 hrs.) and by that time I was feeling a little of the 2c-t-2 fog, but nothing noteworthy. To my surprise when I saw her I felt an uncontrollable urge to hold her - not that this feeling was out of the ordinary, but it was below zero out and I just wanted to get out of the cold moments prior.</p><p>The rest of the night went much the same way - I felt elated by the prospect of doing even the most menial of tasks for her, and cooking dinner was great. A glass of wine was consumed along with dinner, but it didn't seem to augment or change anything. Also, just a side-note, sex on the substance was interesting. I can't say that it intensified, on the contrary it seemed to have an affect not unlike the combination of viagra and zoloft - enhanced erection and better staying power. I have experienced the opposite on high doses.</p><p>If anyone else ends up testing this out, see if you experience the same results. I think this stuff, in low doses, could be used as an anti-anxiety drug with VERY few side effects (undesirable ones, anyway).</p>",
 "year": "2002",
 "id": "20810",
 "gender": "Male",
 "timestamp": "2003-01-28T08:00:00.000Z",
 "views": "7495",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "2C-T-2"
  }
 }
}
