{
 "title": "The Combined Mind",
 "author": "Nick",
 "citation": " Nick. \"The Combined Mind: experience with Mushrooms (ID 2082)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2082",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Mushrooms - P. semilanceata"
  ]
 ],
 "report": "<p>The previous time I had taken mushrooms in a similar setting I had not dealt with the whole thing very well. It had been too overwhelming, too powerful and I had felt inclined to stop myself going mad. I was far too tense, but I had learnt from this. I needed, if I was going to cross the threshold, to let go, to forget my ego, let myself see what was on the other side instead of constantly trying to pull away from it. I find that the setting adds considerably to the content of your trip. I had been to the same place twice before, a 24 hour club that incorporated a play, some dance floors, a vast expanse of chill-out areas (many were shoe-free, alcohol-free and tobacco-free zones, which didn't bother me), a sort kind of street decorated with shop upon shop, which, as the evening progresses, becomes a central focal point to meet people or regroup. The whole thing is set in a mass of tunnels, usually used as car-parks, but which, for one night become another world. It is not so much a club, but more of a plain, a community which exists by the outside world but not with it. Once you are in, it does not feel like anywhere, and yet you are there. For me, it is heaven, a heaven with bad bits and good bits. The tunnels are virtually bear, and the only things that hide the crumbling brick and cement the place is made out of are the psychedelic stalls, painting, decorations, virtual D.J screens, and of course, the people. It all gets a bit complicated, but things will become clearer as the report progresses.</p><p>I took the shrooms at 9.30 p.m, leaving about a gram to half a gram, for later. 5 grams is a lot, and I trying to get them all down my gullet as quickly as possible was challenging, so I decided to savour them, to enjoy them more, eat them slowly, and swirl them round my mouth so that I could really taste them. I found this had a good effect later on, since the whole trip seemed a lot more relaxed, less strenuous or stressful (than my last one had been). I rolled up a joint with the pollen, partly to avoid nausea, which I occasionally get with shrooms, and partly too relax me, to prepare me for the ensuing trip. I find that if you go into a trip stressed or anxious, that is the way the trip is going to be. If you go into one relaxed and thoughtful, the trip becomes more enjoyable, and it is easier to take in the sights at a slow pace, ignoring some if you want. In this way, you can help stop everything becoming too much too quickly.</p><p>The pollen was really strong, but not sleep inducing. It made me much more alert, more sensitive to sights and sounds. A haze had appeared around me, and everyone was part of it, breathing it in and out. It was totally benevolent, and I embraced it, taking deep breaths and exhaling very slowly. I suppose it is a form of meditation, and once I had finished I was at peace - completely relaxed. The next joint took me up. It was as if it was working in harmony with the mushrooms, they had become one. I let the flow of energy rise up and envelope me. I did not want to speak, I wanted to look at everything, concentrate on each thing and see what it was, what it was doing. A friend asked me what was happening, impatiently waiting for his 'shrooms to work', but I told him nicely to be quiet. At the beginning of a trip, it is helpful to be silent, and to try and get silence from others. Loud noises directed at you can divert your attention away, and put an annoying barrier between you and you visions, you new thoughts. For the twenty minutes, or however long you deem necessary, try to do this and I promise you it will help. It settles you in gently, allows you to prepare for more intense things to come. In a way, it is your introduction to the being you are going to spend the next 5 - 9 hours with. Be considerate, and observe, and everything will be all right. Once I felt focused enough I left my friends. I lit a cigarette, inhaled, and moved into the next stage. The walls that had once been grubby, uneven surfaces were now a mass of swirling, coiling, snake-like things, which formed beautiful patters. It was as if the bricks had come together to form an intense blue, very viscous liquid. I was afraid to touch it, so I just looked, and was happy just observing. For me, touching things can ruin my focus, but this is not always the case. I would like to be able to feel things, perhaps become one with them for a certain amount of time. I certainly have the ability to do this with other people; through touch you can bond with people in ways that are inexplicable, but beautiful. You can even get close to becoming one entity with them. I walked around for hours, staring, and then I noticed something I hadn't really payed much attention to before. I could talk to people with my mind, I didn't need to speak to them with my voice. Some people did not pay any attention to me, but with those that looked at me right in the eyes I could discuss things. It wasn't in English but we knew what each other meant. Sometimes what was thought had no form or idea, but we knew what was meant by it. You could tell wether or not you would like a person, whether or not they wanted to talk to you. I found myself looking for people to do this with, and once we had introduced ourselves, we resorted to ordinary speech. I would like to develop this further, and it is something I will really concentrate on over the next few weeks. It only really appears with hallucinogens, but it's great. For me, it's proof of psychic existence, and the power of the mind. It needs cultivating, but it could be used to great effect. It was my experiment throughout the trip, and I found that I could communicate in that way much more effectively with friends.</p><p>Another thing I noticed was the unity of the whole place, it was as if people's minds were forming a great mass above their heads, filling the whole place. It was a 'combined mind', but like the real brain, it had many different parts. Each person was a separate part, but a section which work with others to produce the overall effect. This is the power of the place, and the reason why the whole experience is so different from anything else: your body is not important there, it's what you are thinking that's vital. The people who come in and don't let their minds and spirits go are the ones who don't enjoy it. If you don't let yourself become part of the experience you cannot enjoy what is happening. You have to let yourself go to understand what is going on.</p><p>On my travels through the 'caverns' I found many people - some were happy to be in my vision, others were not. That is the way things go. You won't connect with everyone, and not everyone will like you, want to bond with you. The best thing to do is not to let it bother you, and in that way you can avoid being upset or freaked-out in many situations. I just ignored, or left those who gave me bad vibes, even when it was difficult not to ask myself why they didn't want to be with me. With so many people in one place, it is impossible to find harmony in everyone. This can be used in the world as a whole. Bond with people you feel you have a connection with, have something to say with, and ignore or tolerate people with whom you don't. It's working for me. I think that each person can learn so much from a trip, if you go into it the right way, and travel through it in the right frame of mind. I have found that you must not take shrooms, or acid, or any psychedelics to escape, but to learn, to discover to explore. Forget how fucked you are, forget the pains and strains of reality, and glide through whatever it is that happens to you. What I found helpful was that whenever I got too worked up, or freaked-out, a joint really calmed me down. Rolling up gives you a focus, and smoking the joint allows you to sink back into yourself, to relax and find what you lost again. I always found a quiet place with some friends, and sat down for a joint. I'm sure many others do this, and would agree with me on this matter.</p><p>After a few hours of taking in the sights, patterns, sounds, smells and people around me, I decided to find somewhere to lie down and explore my own mind. I had to close my eyes for this - when you close your eyes you are officially in your own mind, and what you see is only relevant to you. It is very hard to describe what I saw, but I will try and remember exactly what was there, in my head. An important theme was 'the tunnels'. I was usually travelling forward, but often, I would be distracted by the colorful patterns warping and changing on the walls of the tunnels, and then I would start moving backwards, away from the light that I could see at the end of each one. It took and good deal of focus and determination, but I did get to the end, reached the light, and another vision was exposed to me. Sometimes they were horrible - screaming faces coming out of each other, eyes peering at me, then becoming figures dancing, which would expand out into walls made up of squares positioned in geometric patterns. After each set of visions, there was another tunnel and another struggle to reach the end. It slowly became easier, and eventually I was glided through, very fast, but enough to take in everything. Then everything came to an end, and I think I found my spirit. It was a head, very stiff, very upright, almost African looking. Sometimes it looked at me, other times it didn't, but it was there and it didn't change or shift like the others things I had seen had done. It was a statue, a goal I had reached. I opened my eyes, picked up my notebook, which already had stuff scrawled in it, and began to write again (this was REALLY HARD): here's a view things I wrote, there not very clear, but they might help you to understand how I felt during the trip:</p><p>The train, holding onto the rails like they are the only things that exist in this molten, swirling void. Where do I start? I can't even write can't, it's not here, I'm here, are you in or out? Slipping, hold on to it and them - there/there. 'what are you, some sort of ventriloquist?'</p><p>I think the train and its rails represents the entity that I grabbed hold of and got through all the tunnels really quickly. The tunnels are perhaps the molten, swirling void (I saw them in that way). I seem to be writing about things from the real world not existing where I was; 'Can't' is a good example. I just could not write it properly - it took numerous attempts to make it legible and to spell it correctly. I was there, but the words were not. I'm not to sure about the rest. The last thing I wrote was a quote from the play; I'm not quite sure what it means, but I'm working on it. After that i started scrawling geometric patterns onto the page. They were quite impressive, considering I'm awful at math. I could not stop, I kept swirling and spinning with the pen. There was a purpose, and after ten or so minutes it appeared: it was my guiding spirit. He appeared amongst the lines, and quickly I followed his outline and any others I could see before he disappeared. He is still there now, with some weird force, or what seems to me to be like life, spewing from his eyes and mouth. I'd like to show you, but I don't have a scanner.</p><p>It was there that my visions ended, and I came out of the trip. I carried on smoking the pollen until there was nothing left. I was so happy, so fulfilled. I felt I really had learnt something that evening, or day, or night. The next time will be even better. (N.B. Any concept of time is what I perceived it to be after the event. During my trip, I had no idea of any time passing or going. It is unimportant, irrelevant to the journey. Ten minutes could have been an hour, half an hour, anything. They are only guesses.)</p>",
 "year": "1999",
 "id": "2082",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-24T07:00:00.000Z",
 "views": "2908",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata"
  }
 ]
}
