{
 "title": "The Madness of Wonderful Insanity",
 "author": "Ashes",
 "citation": " Ashes. \"The Madness of Wonderful Insanity: experience with 5-MeO-DiPT (ID 20823)\". Erowid.org. Jul 8, 2006. erowid.org/exp/20823",
 "substance": "5-MeO-DiPT",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "insufflated",
   "5-MeO-DiPT",
   "(powder / crystals)",
   " T+ 0:00",
   "10 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)",
   " T+ 2:00",
   "3 joints/cigs",
   "smoked",
   "Tobacco - Cigarettes",
   ""
  ]
 ],
 "report": "<p>Where to start? My Gf and I, we'll call her S, had decided to have a great and trippy night. We have just heard about the fox and hadn't yet had the money or time to try it. Well, I finally landed a job and decided to feed her and a few buddies. We were set and ready to go, and decided to pass the time by smoking enormous amounts of cannabis.</p><p>My lightweight buddies decided to call it a night and headed home, and S's roommate went to sleep. So we picked up 40 mg of the foxiest foxy around (the only foxy around....) Having heard the fox was like a good old fashioned candy flip, I was hyped and ready, where I have many MDMA experiences, a few LSD exp. and 2 combination exp.</p><p>Well its now 12:00.</p><p>We're both feeling good, and we cleared S's room of clutter, chemicals, sharp objects, etc. and set out to take a ride.</p><p>We broke out the mirror and poured two of our caps (10 mg. each) out and broke them out into two righteous lines. SNIFF, a tickler in each nostril, and swallowed the empty caps, and took the other two caps orally. Well thats about the time S's roommate (R) decided to wake from his slumber and join the party. We didn't have any foxy left so we decided to keep our mouths shut about it. We talked to R for a few (T+0:45) and things started to feel a little crazy. I had the ol MDMA solar plexus feel and the LSD edge of sanity feel. 12:45 and everything's great so far!</p><p>At about 1:00 am a couple of our annoying beer drinking buddies showed up and got a little crazy. S decided she was overloaded and hid in her room, unbeknownst to me, and stayed there. I decided to try to ignore the effects of this crazy drug and attempt to maintain and talk for a few. Bad idea. One of our annoying friends has the gift of driving me mad. The room was made of melted plastic anyways, so I thought I'd enjoy a cigarette in the bathroom and then go check on S.</p><p>After smoking three cigarettes while watching my face melt, I went to see S, and found her shivering b/c of her enormous body buzz (circa T+2:00) and decided to give her a massage. Then the fox bit me right on the ass hard. The mental effects kicked in and sane conversation went to insane. After talking S in circles about methods of taking over the world, I had a great revelation. S does not exist. She is only a personality of mine. I have multiple personalities and she is just one of them.</p><p>So I begin to convince her of this (T+3:00). She asks me to prove it. I say 'Read my mind.' And she does (don't ask me how, I don't know if she really did or if I just imagined it). We have unspoken conversation, I swear on my life, for about 30 minutes. MY bladder decided to hi and I got up and went to the bathroom without realizing how long all this had went on. REALITY CHECK TIME: 4:12 am.</p><p>Everything was off, R had went to bed and we were still tripping hard. I voided the ol bladder and opened S's door to find her lying in the bed in her tighty whiteys. 4:29 am. I crawled up to her and we had possibly the most powerful and deeply connected sex we have probably ever had. I would suggest couples that are psychedelic fans try this as soon as possible for I have never been more in love with S that I was during and after this exp. I feel closer and connected to her now. 5:45 give or take 15 min. We start to wind down and get our underwear back on. This is the only bad part of the whole experience. We both feel very crowded at this time and need to get away from each other. I got to the living room to end the night.</p><p>I spend the rest of the night  tossing and turning during very lucid dreaming (I didn't think I slept until R told me he got up and attempted to talk to me, being denied). The body load didn't seem that heavy.</p>",
 "year": "2003",
 "id": "20823",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-08T07:00:00.000Z",
 "views": "4563"
}
