{
 "title": "Be Careful with Interactions",
 "author": "nom de plume",
 "citation": " nom de plume. \"Be Careful with Interactions: experience with DXM & Various (ID 20834)\". Erowid.org. Jun 15, 2009. erowid.org/exp/20834",
 "substance": "DXM & Various",
 "bodyweight": "150 lb",
 "report": "<p>Its been a while since I tossed back a bottle of tussin, but there was a time when nothing got me more excited than an early evening stop at CVS.  A bottle of cough syrup and 5-pack of orange tic-tacs were all I needed for my own private space odyssey.  And if I think of the taste of the stuff, I can still feel the pressure from the back of my eyes and the mild body itching that welcomed me to each experience. </p><p>I fell in love with DXM quickly, with its embrace of the infinite, with its beautiful sense of isolation.  See, no one else I knew would go near the stuff (even if I could convince them to try it once).  This had two effects.  The first was the reinforcement of my use of DXM purely for introspection (I usually liked the 400-600 mg range, though Id tried more on occasion).  The second was that I spent a lot of time with William Whites FAQ, a link to a world out there that understood my passion for the substance.  I didnt understand most of the neurochemical descriptions, but I pushed through them anyway.  One thing that rang clear, though, was that DXM works by doing lots of different things to the brain: there are a lot of different interactions going on.  Ive read some experiences that mention some interactions, and I dont know if people out there realize how fundamentally the slightest chemicals can change the DXM experience.  So I thought Id share.</p><p>For most of the time I was doing DXM, I never mixed it with anything.  Well, sometimes with cannabis, but that, quite surprisingly, didnt change the experience much (aside from the sensation that Hey, Im tripping on tussin and Im also stoned!).  Later on, though, when I was slowing down the frequency of my trips to once every several months (from once every couple of weeks), I had begun to smoke cigarettes.  Even later, when Id pretty much stopped DXM entirely (I felt like I had reached a point of marginal utility with it  I had gotten from it what I was going to get), I was regularly taking bupropion, and, not coincidentally, not smoking.</p><p>Nicotine:  I want everyone out there who smokes regularly or socially to know that cigarettes change the experience a LOT.  Theres suddenly a lot more physical interference going on.  My skin would feel uncomfortable as I took in each breath of smoke.  And my head would clear up in a very the partys over but Ive got a hangover kind of way.  Nicotine also made the comedown bumpy and uncomfortable.</p><p>Wellbutrin:  The literature on Wellbutrin is very vague on interactions, saying merely that there are probably lots of interactions and that it probably works on lots of different neurotransmitters (even though it specializes in dopamine and noradrenaline).  Fortunately, I only mixed this with DXM once.  For me, it was a terrible combination.  Believe it or not, the experience Im referring to is a time I was sick and took a regular (30 mg) dose of DXM in cough syrup.  I became dizzy and itchy in the way that high-dose trips used to make me (not in a way that head colds make me), and I could sense a slight change in my sense of time, the zooming-in to the present moment that usually came and went with the beginning of my trips.  I also had the sense that this was a sloppy DXM trip, that it forgot how it was supposed to work and was just tossing out side-effects at me.  Pretty soon it was over and I was left with a box full of tissues and a bottle of cough syrup that I wasnt going to use again.</p><p>I would strongly recommend against mixing DXM with other chemicals (though I'd hate to have to go through nicotine withdrawal on a DXM trip).  The bottom line is that DXM can be a very friendly drug if you are monogamous with her for the duration of her effects.  Otherwise, beware, because she doesnt play well with others.</p>",
 "year": "1999",
 "id": "20834",
 "timestamp": "2009-06-15T07:00:00.000Z",
 "views": "13484",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "DXM"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Bupropion"
  }
 }
}
