{
 "title": "What Depression Did to Me",
 "author": "Shenanegan",
 "citation": " Shenanegan. \"What Depression Did to Me: experience with Dimenhydrinate (ID 20846)\". Erowid.org. Jul 29, 2006. erowid.org/exp/20846",
 "substance": "Dimenhydrinate",
 "bodyweight": "90 lb",
 "header": [
  "DOSE:",
  "150 mg",
  "oral",
  "Pharms - Trazodone",
  "(daily)",
  "",
  "750 mg",
  "oral",
  "Dimenhydrinate",
  "(pill / tablet)"
 ],
 "report": "<p>I was going through a rough time where past experiences in my life were coming back to haunt me at an intolerable rate.  I was severely depressed and ready to cave at any given time.  I guess you could say that I was like a walking time bomb ready to detonate without warning.</p><p>One night after returning from the drugstore, I had decided to take the trip that would leave me wondering for the rest of my life WHY I ever did this.  I took my journal and printed in a very detailed manner of what I took, when, where, why I thought that I should take it and a note to myself: \rS: Remember that this is only a high and what you see, hear and probably do, is all a high.  It is not real Good luck and see you when you crash!  Well I can say that I still have that note and it is not a favorite past time to read that over and over.\r</p><p>At about 9:00 pm on Apr/11th/2001 I took all at one time 10 Gravol.  Two hours later I took 5 more.  These were 50 mg pills so that's 750 mg.  I may have taken more but that is so clouded in my memory that I will never know to this day. </p><p>Getting off took a long time and I can say that to this day the temptation is still there.  I have in the recent past taken a few and regretted it very much.</p><p>At the time of this experience I was taking Trazodone 150 mg dose at night for sleeping.  But I was not addicted.  I took the Gravol to get the high. </p><p>The night that I took all of these pills I had the hallucinations of a lifetime.  I was the judge of a beauty pageant and the girls I saw walk through my bedroom were probably the most beautiful in the world.  I talked to my father about building me a house and where I wanted to have it built.(he is a carpenter)  I was alone for a while because my boyfriend worked late nights. </p><p>He came home to a messed up girlfriend I can tell you that.  I managed to hide it all till the next day when I was making sense out of everything (so I thought) When I woke to the Simpsons on my bedroom ceiling!  I was seeing colors that were never in the rainbow and I had another conversation with an aunt who I thought had just got off and the airport.  I saw her come down the escalator.  I went through this all day when my boyfriend came home from school. (College) I was saying that I was loosing my mind and that I needed to go to the hospital. </p><p>He thought that I was acting strange and said that I should go and lay down for a while.  So I did.  I got up that evening after he went to work again and called one of my friends.  There was cats everywhere and I did not know what to do!  I was in the panic of a lifetime.  I did all I could do not to go all crazy.  I knew that I was alone in the house and no one could come to my rescue.  I got off the phone with my friend and called my boyfriend's mother.  She had his father there in a few minutes to come and get me.  We were just out in the driveway when my boyfriend was pulling up in the car.  I went with my boyfriend to the emergency room at the hospital.  They filled out a form that said that I needed psychiatric assessment. </p><p>We went back to his parent's house for the night to rest.  The next day I woke screaming 'Get me a bucket!'  I tried to get out of bed but I had no feeling in my legs.  With that I was rushed into the mental hospital by my boyfriend.  I stayed four days and I can tell you that I will never do this again!</p>",
 "year": "2001",
 "id": "20846",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-07-29T07:00:00.000Z",
 "views": "9123",
 "dose": {}
}
