{
 "title": "I Willed Myself to Death",
 "author": "Kiljenorius",
 "citation": " Kiljenorius. \"I Willed Myself to Death: experience with LSD & Cannabis (ID 20849)\". Erowid.org. Apr 22, 2003. erowid.org/exp/20849",
 "substance": "LSD & Cannabis",
 "bodyweight": "110 lb",
 "report": "<p>My friend had recently gotten half a tab of acid and one of my other friends had bought a couple when I wen to meet him and 3 of my other good friends. I was told it was intense from a friend G. He had tripped the night before and said he had a life changing experience. I was a little wary cuz of that. D did some Ecstasy, me and J each did only one tab. G was supposed to sit us so we didn't freak out. So 30 minutes later, we attempted to hotbox J's bathroom but after only one hit each  (which was freaking huge that bong is amazing) I definitely felt very fucked up. We wandered back into the living room and I was tripping. Now apparently, G left at 10, and we had started tripping at 9. (took the tab at 8:30) At some point L, J's ex girlfriend came over, and she was tripping on acid too. At that point, I was sitting on the couch, tripping sooooo intensely. Every sound was part of this insane rhythm and music I was hearing in my head. Everything I was seeing was also part of it. My vision was filled with insane patterns that evolved constantly and moved with the music.</p><p>Apparently I had sat their for an hour and a half straight without saying a word, and L comes over, she is soooo fucking cracked out. Tripping balls. D says she has her shirt off in a bra going, what am I doing here? How did I get here? Where are my clothes. I didnt even realise she had come until I heard her voice and I was like holy shit L is here? Wtf? Then they try to rouse me from apparently sitting with my eyes wide open, and not seeing them at all. They said they had waved their hands in front of my face and called my name a whole lot. I eventually heard G in a weird echoing kind of way. I thought he said, welcome back, but he swears he never said it. In my mind it suddenly made sense and I responded, ahh yes we all return here don't we? But they say I never said that either. Then after some gentle shakes, I came back to reality slightly still tripping balls, and looked up, G was their and for some reason I thought we were all part of the same person and that there were numerous people talking to me but most of them hadn't existed. I asked him 'how many of you exist?' It was the first words I had uttered since going into my trance.</p><p>Then I sunk back into it. I started to feel like I was filled with cold electricity. G left. (the sitter) Then I started to feel that I was covered in a blanket of death that was slowly consuming my life to give me this vision of life and music so beautiful that I became so engulfed in it. I slowly let myself die. At that point, I literally gave up on life and died. At least it felt like that, like I had willed myself to death, and yet it was so beautiful and yet so painful emotionally. I felt like I could have left them with a corpse and ceased to exist. At that point, 2 drops of tears rolled slowly down my eyes. My friends asked me if I was alright. I said, Im dead. The next words I had uttered since saying how many of you exist. Then it got real weird with D saying my name softly questioningly. Over and over, softly. Are u ok? Dude? They tried shaking me, but I just collapsed off the couch. After a bit I felt death was soo emotionally beautiful and yet painful, like losing your best friend, except letting go of life instead, that I returned.</p><p>I was much less fucked but still tripping balls. I roused from my trance to see D motioning for us to bong. I dont remember if I had. I think I accidentally was confusing L allot by saying, do u really exist? And I asked her how old she was and she said 16. I said ahhh 16 year olds, Im 17, But I dont know why I said that because Im 16. And later I was like what was I possibly thinking. We left, me and L tripping balls in the cold. We decided to ride the rails and rode into Brooklyn. There at pacific avenue, we somehow went in circles and took trains that led to nowhere. Once we were told to get off because it wasn't moving for the night once it left the station. We left, and returned to the same one. Then the conductor drove into the tunnels and stopped. For 5 minutes we did nothing but look at light and listen to the air vents. Then the conductor came back and said didnt I tell you not to go on this train? Now I'll have to drive back.</p><p>Eventually at 3:30 in the morning I buzzed home, got my parents pissed at me though they didn't even suspect due to the fact I said like 10 words to them and proceeded to not be able to sleep for another 2 and a half hours. I was still feeling it. After dying, my whole life was changed, all those petty things that piss me off I just ignore. I was sure that I had felt what willing yourself to death was like. This was on Sat. Today is Wed. Im planning on tripping again tomorrow but this time I think it will be different because much of my fustration and depression left me from last time.</p>",
 "year": "2002",
 "id": "20849",
 "gender": "Male",
 "timestamp": "2003-04-22T07:00:00.000Z",
 "views": "6905",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": "3.5 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
