{
 "title": "Very Intense",
 "author": "anonymous",
 "citation": " anonymous. \"Very Intense: experience with 5-MeO-DMT (ID 20868)\". Erowid.org. Mar 4, 2004. erowid.org/exp/20868",
 "substance": "5-MeO-DMT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I had the pleasure of trying 5-MeO DMT the other day. Having read several other reports, I went into this experience with much caution. A scale with the precision required to properly dose myself was not available, so the dose was just eyeballed. My guess is that it was 3-4 mg of powder. The powder was freebased on aluminum foil, and inhaled through a hollowed out pen. Yes, it was ghetto, but it did the trick.</p><p>I was a bit skeptical that this small amount of substance could do anything, especially after watching the tiny amount of smoke exhale from my lips. I had time to place the lighter down, but that was about it. Just as I thought nothing would happen, I glanced at the ceiling. The ceiling began to dissolve, and I was rocketed towards it. Strangely, it was exactly what I was expecting.</p><p>The intoxication felt very strange, and I could hear my heart beat very rapidly. I think this was a result of the intense peaking. While I could feel my heart beat, it felt as though it was a seperate entity from my body. I, in whatever form I existed at this point, was simply existing in this foreign universe. The visuals, the mental effects, are far greater than I could ever begin to explain. In what felt like seconds, I was shot back into reality.</p><p>The coming down had a very heavy body load associated with it. I was seeing quite a bit of trails and visual distortions. There was a slight nausea associated with it, but it was calming knowing that I was 'over the hump.' Glancing at the clock, about 10 minutes had passed in what only felt like one minute. The effects faded, and after about an hour I was back to baseline.</p><p>Looking back, 5-MeO DMT is an interesting drug. I've had wonderful experiences in the past with Mushrooms, LSD, and MDMA where I have really grown as an individual. While under the influence of those substances, I have had time to really explore and be introspective. I don't think that 5-MeO DMT is a drug of that class. Unfortunately, the experience is too breif and too intense to really gain anything.</p><p>Some people report traveling to foreign universes and experiencing bliss. Shulgin even reported one dose as a ++++ experience. I feel however that whatever can be gained from this is simply a temporary enjoyment, and will not really help the user much after the effects have faded.</p><p>The one thing that I have gained is a respect for this substance. Having not been prepared would have definitely been a terrifying situation. It will also help my future experiments with other drugs seem not as intense in comparison.</p><p>5-MeO-DMT is not for the weak, or the anxious. It isn't for the psychonaut who is looking to gain a lot about themselves either. Instead, look at it as a chemical rollercoaster. Pay your admission, hop on, and then get off when the ride has come to a complete stop.</p>",
 "year": "2002",
 "id": "20868",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-03-04T08:00:00.000Z",
 "views": "5566"
}
