{
 "title": "Total Calm and Bliss",
 "author": "Highwayman",
 "citation": " Highwayman. \"Total Calm and Bliss: experience with Syrian Rue, & 5-MeO-DMT (ID 20861)\". Erowid.org. Jan 29, 2003. erowid.org/exp/20861",
 "substance": "Syrian Rue, & 5-MeO-DMT",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "9.0 g",
  "oral",
  "Syrian Rue",
  "(ground / crushed)",
  "",
  "30 mg",
  "sublingual",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>Well, over the past year I have gone through about 600mg of 5-MeO-DMT by way of smoking.  I have come to really love this substance (quite contrary to most peoples feelings), and see it as probably the best (bar none) drug transaction I have ever made. </p><p>Now I haven't taken it orally w/o a MAOI, but I do believe I have some things to add here.  My favorite method of ingestion is to take 8 to 10 grams of crushed Syrian rue (certainly over shooting the target for maoi, more on this later), then 30mgs of 5-MeO-DMT sublingually about 15 minutes after.  It indeed does dissolve completely in less than 5 minutes (being careful to swallow a minimum), and I did feel effects within 5 minutes of that.  I did this all around 11:00pm. </p><p>The first 2 hours was totally uncharacteristic of 5-MeO-DMT.  I was tripping lightly, slight visual disturbances, and I believe I would say that on-line comments I have seen are correct in the raise of blood pressure (though conversely I wouldn't say I felt it was dangerously high).  At about the two-hour mark, the trip changed drastically.  Much more like 5-MeO-DMT smoked, and almost instantly. </p><p>My body had calmed, and I felt it start to wash over me in a familiar way.  I turned off my computer monitor and the lights in my room (as light of any type annoys me on 5-MeO-DMT) and sat back on my bed.  Over the course of the next 4 hours I saw the most amazing visuals I have ever experienced in my life.  Eyes opened or closed, colors were swirling everywhere.  For one brief instant, they even formed into what looked like a stained glass window depiction of the sun rising (or falling?) over a hill.  This went on until I'm guessing about 5:00am, when I began to vomit (much to my carpet's dismay, first time puking from anything other than alcohol btw), after which I curled up and passed out for I have no idea how long, but I'm guessing about another 3 hours as I was flooded by daylight the moment I opened my eyes. </p><p>So I'm coming down, right?  Heh, right.  I feel this perfect sense of calm, lots of big tracers, I look around and notice the vomit after playing with tracers crossed my ceiling for what was probably an hour.  I hop up to use the Internet to find how to remove vomit stains from carpet.  Only I in no way could operate a simple search engine, I end up convinced the Internet is not working and get up to take a bath.  While in the bath I turned on the radio and kicked back.  This is honestly where it got weird.  While in the bath whenever I ran the water I heard a inconsistent ringing that sounded exactly like our phone, when the water was off I hear whispering voices which I could faintly make out.</p><p>I had heard of these things before but had never experienced them myself.  My mind not wired strait, I didn't think for a moment that what I was hearing wasn't real.  I sat in there until my room mate knocks on the door asking if I'm ok, I tell him yes, fine just tripping.  I hop out and check the clock and I had been in there from 9:00am to 1:00pm.  I went out to discuss it with my roommate, I asked why nobody had gotten the phone the whole time.  'What phone'?  Thats when I realized what had been going on.  For those last few hours I felt what I could only describe as total calm and bliss (way better than any experience I've had rolling, only none of the neat touchy physical effects, and this was a more relaxed state).  This lasted until 3:00pm when it gradually tapered of through the day. </p><p>---------</p><p>Alright, I don't believe the 5-MeO-DMT primarily influenced this trip.  I think it was certainly the knock me on my ass power behind it, but the flavor was definitely the Syrian rue.  The visuals, though much more intense, were very similar to those I have on high Syrian rue dosages combined with mushrooms.  Second, due to a follow-up experiment (with a friend of mine that has also quite the taste for smoked 5-MeO-DMT), I believe the duration was also mainly influenced by the Syrian rue.  He ingested the exact dosages in the same manner, same size guy.  30 minutes into it, he began to throw up.  He spent an hour on the ground in the bathroom, puking occasionally, after which he spent about 3 hours tripping strong, but not in any way the intensity I had experienced.  He came quickly to baseline after that. </p><p>I guess what I'm getting at is, while I have no doubt at all that 5-MeO-DMT is orally/sublingually active w/o an MAOI, or more specifically the harmala alkaloids.  I feel that what it really has to offer comes from mixing the two.</p>",
 "year": "2002",
 "id": "20861",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-01-29T08:00:00.000Z",
 "views": "10148",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "9.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": "",
   "amount": "30 mg",
   "administration": "sublingual",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
