{
 "title": "Universal Reality",
 "author": "The Management",
 "citation": " The Management. \"Universal Reality: experience with Mushrooms (ID 2089)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2089",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "2.5 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(tea)"
 ],
 "report": "<p>Through out my history of psychedelic use, I have never been as privileged as I have been recently. A few days ago, me and a friend imbibed some mushroom tea. About 45 minutes after initially drinking the potion, I began to feel the familiar body high. A light, wavy feeling in the extremities and a hallow feeling in the torso and abdomen. Eventually, the movie we'd put in ended and the other people (not on psychedelics, just MJ) went to sleep. We remained up until 4 or 5 chatting about life. We figured out some things about what everybody wants and what really happens out in the world, away from my or your little world. It was then when my trip took an unfamiliar turn. Suddenly I felt as if we had accessed a universal reality. By this I mean, we had, in our altered states of awareness, transcended rational thought and witnessed a universal truth) The truth can't be described with language, but rather experienced directly or not at all. I urge everyone to find their psychedelic of choice and trip with this in mind. LSD, DMT (which I've yet to try), Mushrooms, or combinations of these or other drugs which have no reasonable overdose level. Enter the trip with no fear of dying or going mad, realize it is the fear itself that will drive you mad, Overcome your fears by living right and treating people kindly. You will then be brave enough to see what it is that we all feel, but few understand.</p>",
 "year": "1999",
 "id": "2089",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-24T07:00:00.000Z",
 "views": "3194",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(tea)"
  }
 }
}
