{
 "title": "I Became a Very Quiet, Intense Person",
 "author": "Jonathan",
 "citation": " Jonathan. \"I Became a Very Quiet, Intense Person: experience with Methylphenidate & Amphetamines (Adderall) (ID 20891)\". Erowid.org. Jul 27, 2007. erowid.org/exp/20891",
 "substance": "Methylphenidate & Amphetamines (Adderall)",
 "bodyweight": "220 lb",
 "report": [
  "<p>When I was younger I had ADD/HD really bad. I couldn't focus on anything and I bounced off the walls. It felt like a million things were going through my mind and I had no control over them. I did very poorly in school and generally got into trouble/fights because everything I did was a total knee-jerk reaction.",
  "Then came the 'Put your child on Ritalin or he's out' from the school. So my parents did. For five years I took varying forms of Ritalin. It was horrible. Sure I calmed down and stopped talking but I didn't have control. It cured the hyperactivity and to a lesser extent the attention problems but Ritalin wanted to slow everything down. Essentially it made me walk when i wanted to run.",
  "So fast forward some years. I took Ritalin off and on in highschool just to get by for exams, usually the end of the year. Then came college and I did okay, having sort of grown out of the add/hd phase. Then a friend told me about Adderall. He said it would put me in absolute control of whatever I wanted to do. I could focus on something to near exhaustion. Now having played tournament chess and working with computers most of my life I thought this was grand. So I asked my doctor and he gave me some 5mg to start with. Now for me, 6'1, 200lbs, 5mg was nothing. So after three days I took a higher dosage: 15mg. That worked but only for an hour or two. I literally just fell asleep two hours after taking it. So I took 20mg and finished out the Rx with that; three days.",
  "The 20mg worked great. I could sit down and take notes like mad, read anything, study for 8hrs straight. After about four months of this it began to feel like I only had a five hour window of positive effect. The remainder of the day was like drinking lots of coffee/soda. The true effects of Adderall were gone.",
  "So I asked and I was given 30mg. I am on day six of 30mg and its very strange. I am obsessively interested in anything and everything. It doesn't matter what it is, if my mind finds it itneresting, I'm diving head first into it for hours. However at the same time I become a very quiet, intense person. No smile. NO personality. Intensity. Everything is to-the-wall. I sit and study for 10hrs at a time. I take it at 8am and then even at 11pm I am sitting in the bed twitching. Soemthing has to be moving. When I am just sittign at a desk writing (like now) my leg is shaking, bouncing. It's like my mind is using what it needs to stay on top of the world and whatever else has to get out some way else.",
  "Basically this drug is a horrible but amazing thing. The reason I say this is because if you can take the side effects of the twitchiness (your hands and legs mostly just want to kind of move or shake), decreased libido (not really decreased but it takes much longer to reach orgasm), biting of the inner linning of the mouth; not grinding but its like one set of teeth just once to press against the other set just to make sure they're there; weight loss/appetitie supression: with 30mg my mind has forgotten I need to eat. I actually have to set a reminder alarm to eat now. I feel hunger pains and stomach growling but I don't conciously think 'thats because I need to eat' but rather 'my stomach is just making noise and hurts'.",
  "All in all I will continue taking it. It helps me focus and study and I feel more confident, lucid, and in command. I don't feel euphoric or like a God. It's as though I have complete control over my mind. I do what I want to do and I do it until I decide to stop; exhaustion is nothing.",
  "The only complaint is I have to personality and I always feel like Im in a very intense, focused situation. If you are going to take Adderall you need to get up and take it early in the morning and then set a time to 'wind down'. If your normal bed time is 11pm, make it 9pm instead. Sleep requires an extra hour or so to get into.</p>"
 ],
 "year": "2002",
 "id": "20891",
 "gender": "Male",
 "views": "14299",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Pharms - Methylphenidate",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Amphetamines",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2007-07-27T07:00:00.000Z"
}
