{
 "title": "Peruvian Marching Powder",
 "author": "dokmai",
 "citation": " dokmai. \"Peruvian Marching Powder: experience with Cocaine (ID 20909)\". Erowid.org. Feb 7, 2003. erowid.org/exp/20909",
 "substance": "Cocaine",
 "bodyweight": "240 lb",
 "report": "<p>I have been fortunate regarding cocaine for two reasons.  The first is that amongst my close circle of drug using friends, cocaine is not the drug of choice and only appears on rare occasions.</p><p>The second is that when cocaine is around I am able to exercise restraint in terms of the amount I consume.  I am the only person I know who can buy $100 worth and still have most of the bag around a month or two later.</p><p>Recently a friend from overseas came to visit and he is quite fond of cocaine, something that is quite difficult to find in his home country.  Since he has family in the area he was able to get ahold of some coke quickly and we spent many afternoons during his visit doing coke in my office and we had a blast.</p><p>This was the first time I had done so much coke, probably every afternoon for two weeks or so.</p><p>My friend had an emergency at home and had to leave on short notice and since he couldn't bring the coke on the airplane home he gave the rest of his mighty bag to me.</p><p>I, in turn, while still exercising restraint, did a little bit every day for a month or so.  At first I thought it would help me work but I realized later that it was a distraction, so I saved a line for the end of the day every day.</p><p>Eventually, with a great deal of coke still left in the bag I had to stop because the coke fucked my sinuses up so bad.</p><p>I never had a spontaneous nosebleed, however my sinuses were constantly inflamed and packed solid and blowing my nose produced a tremendous volume of mucous and blood.</p><p>I gave the rest of the bag away lest I cause more damage to my sinuses.  Still, even after stopping for several WEEKS my sinuses were fucked.  Always hurting to some extent, always bloody and goopy inside.</p><p>I tried nosesprays, I tried the steaming devices that people with sinus problems can breath hot, mentholated steam from I even tried Yogic 'nasal irrigation' with a special device that allowed me to flush my sinuses with salty water.</p><p>It took more than a month for my sinuses to recover.  The negative aspects of my damaged sinuses far outweighed the fun of the coke.  Next time I'll pass.</p>",
 "year": "2003",
 "id": "20909",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-07T08:00:00.000Z",
 "views": "59774",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
