{
 "title": "My First Experience",
 "author": "Franz Ermit",
 "citation": " Franz Ermit. \"My First Experience: experience with Salvia divinorum (ID 20912)\". Erowid.org. Mar 30, 2007. erowid.org/exp/20912",
 "substance": "Salvia divinorum",
 "bodyweight": "156 lb",
 "report": "<p>In this post, I hope to inform potential Salvia users of the power and seriousness of this substance.  My experience was unlike that of any other drug, and it was something that I will never forget.</p><p>It began when I recieved a package of Salvia Divinorum leaves I had ordered from an internet herbalist.  For economy's sake, I created my own extract (approximately 10x) using acetone as a solvent.  I redeposited the extract of about 10 grams onto 1 gram of normal salvia leaves. </p><p>I was impatient to try the drug, however I managed to prepare in a few ways.  Over the past week, I had been feeling unusually happy and healthy, so I decided I was at a good point to try a new substance.  I am 18, on no medication whatsoever, and I have no medical conditions.  I invited a friend over to be my sitter.  We had both read many reports of Salvia experiences to gauge what he might expect of my behavior.  I did very little to adjust my surroundings, I sat at my desk with the lights on next to a window to blow smoke out of.</p><p>I used a glass pipe with a small bowl.  It held about a quarter gram of salvia leaves. I this bowlfull in two hits.  I felt very little except a slight lightheadedness that I usually get with any type of smoke inhalation.</p><p>I refilled the bowl with another 1/4 gram of the extract, and took my next hit.  I realized that the glass pipe was a bad idea because lit ashes were being sucked into my throat.  However i didnt seem to care.  My Head felt as though it were bouncing from side to side, and I felt quite excited that I was being effected.  The last thing I said before entering the trip was 'I'm almost there'</p><p>Now began one of the most peculiar experiences of my life.  As I took the last hit of extract, my reality split into two.  For a very small moment, my mind processed the smoking process, and in a second reality i saw a purple column suspended in space.  Rings of fire (which I associated with the smoke) were passing through the column.  I felt as though I had a goal.  I also felt bombarded by something I couldnt quite define.</p><p>I felt a bending sensation during my last moments in physical reality.  The room became divided by a three-dimensional grid; I was stuck in this grid.</p><p>For about 8 minutes as I later found I hallucinated.  I may have taken too large of a dose  because much of my trip I could not immediately recall.  However I remember a wall with several holes, cartoonish heads popping out of them, etc.  According to my sitter, I was talking during the entire trip, however my words were not english and made no sense.  For some odd reason though, they rhymed.</p><p>As I came out of the trip I was frightened.  I was filled things to say, but as I said them they made no sense to me.  As far as I can gather from later pondering, I was speaking my emotions, which at the time had no words to associate with them. I returned to reality and moved onto the couch that my sitter was on.  I felt incredibly vulnerable, but thankful that I was back and safe.  I tried to tell him that I was ok, but i couldnt get out more than a few words at a time.  Over the course of the next two minutes, my power of speech came back.</p><p>All in all, from smoking the first hit to the point where i regained coherent speech, 9-12 minutes passed.  I had no idea what amount of time had passed as i reentered.  I had read about intense time distortion, but I did not know if my experience was longer or shorter than the actual time.  It was timeless.  That, I believe, is why the trip was so confusing.</p><p>I can surely say that I learned a few things from Salvia.  I learned new feelings of loss and vulnerability (mainly from briefly losing the power of speech). At the same time, I feel as though I had learned a bit of wisdom about my own mind,  and the fact that perhaps we do have simultaneous dimensions in our subconscious.  When people say that Salvia isn't for everyone, they are most definitely right.  I actively sought the drug out, I researched it extensively, and I was out to find some of the knowledge that one of the world's only hallucinogens can provide.</p>",
 "year": "2003",
 "id": "20912",
 "gender": "Male",
 "timestamp": "2007-03-30T07:00:00.000Z",
 "views": "2894",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
