{
 "title": "A Sure Fire Way to See God",
 "author": "JK",
 "citation": " JK. \"A Sure Fire Way to See God: experience with Mushrooms (ID 2092)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2092",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Mushrooms - P. cubensis"
 ],
 "report": "<p>Our sacrament today is mushrooms. We all like mushrooms, don't we?</p><p>Schedule a day and evening when you have nothing to do and can be by yourself in a safe, comfortable place. The day need have no special meaning, but if it makes you feel good to pick a certain anniversary or holiday, so much the better.</p><p>Sunset on the day you choose will be the Zero hour.</p><p>At zero hour minus one week, remove all toxins from your diet - meats, alchohol, refined sugars, even our friendly green ally. Maintaining a strict vegan diet consisting mainly of rice, beans, cereals, grains, fruits, and vegetables is recommended. Drink plenty of water. Meditate 30 to 60 minutes a day on the purpose of your journey to meet (fill in the deity or entity of choice). Prepare a question, or questions, or a prayer, or a piece of information to pass on. Preparation, reason, and readiness are the keys here.</p><p>At zero hour minus 24 hours, begin your fast. The fast starts at sundown, and continues until sunrise the morning after the zero hour.</p><p>At zero hour minus 6-8 hours (midday), have an enema. Refrain from any physical activity on this day. Refrain from any overwhelming mental stimulus on this day, like television, music, etc. Writing, practicing an art, or playing music is recommended. A combination of cleansing of your physical space (house, room, campground, etc), meditation, yoga, and quiet napping is also suggested. At zero minus two hours, refrain from drinking any liquids.</p><p>As the zero hour approaches, your Will will be waning. You may not think you have the strength to take the journey. You will want to eat. You will feel tired, burdened, physically weak. This is the time of departure.</p><p>At zero hour minus 40 minutes, consume 2-5 grams syrian rue extract with a small glass of water. As the rue enters your system, ask it to carry you safely across the void. It is the job of the rue to ready the body for the poison, and make sure it is properly tuned for the voyage. Meditate on it's function for at least 10 or 15 minutes before the zero hour.</p><p>Zero hour - Bless your sacrament. Tell it all your hopes and fears. Ask that you enter into a bond of mutual respect. Tell it that you are ready to yeild to its power, and that no tricks are necessary. Consume your sacrament - 3 to 5 grams dried cubensis or cyanecens.</p><p>Wait. It is difficult to wait. Try lying down with arms folded, breathing deeply. Do not seek distraction. Just wait. You've been waiting all week, just a few few minutes more.</p><p>Zero hour plus 40 - extreme doubt, fear, and agitation set in. Do not fight them. Say goodbye to yourself, your reality, all the things you know, all the things you love, all your addictions, all your obsessions, all your fears. Just say goodbye. You are leaving them now. It is okay to cry. It is best to cry. If you hold back tears, yawning will force you to tear. Might as well let it flow. It is a cleansing.</p><p>Just say goodbye.</p><p>When you push through the pain and reach a state of inner peace, THEY will visit you. When you hear them beginning to whisper in your ear, calmly introduce yourself and tell them why you came. They will know this already, but it is just a formality. They will ask you to enter the darkness, lie down and close your eyes (pillows and blankets are good here). Do what they say and they will produce miracles for you. Once you pass through their little world, they will release you into the void.</p><p>Leave your body with an exhale. Travel through time, merge with the ether, contact beings and gods and long-lost friends, return to your true home. This is your home. This is where you came from, this is where you will return. Have tea with god, make lightning bolts with your mind, sing creation into existence. It is all possible, it is all real, it is all wonderful. You are pure light, pure energy, pure bliss...</p><p>Please, don't forget to thank your hosts.</p><p>With an inhale you return to your body. You are back. You are alone. You are weak. You are thrust back into your life. All your problems are still there. All your questions remain unanswered. only a few hours have passed, but it seemed like an eternity. How long were you dead? Were you really dead? Was it just a drug? What just happened?</p><p>You want to seek refuge in the comfort of others, but you must wear this night out alone. If you are lucky, a voice will visit you and sing you to sleep. This voice will sing strength back into your body. It will infuse you with sorrow and hope. It will tell you little jokes about yourself. It will share childhood memories with you.</p><p>Fall into an exhausted sleep with tears of sorrow and joy. You will wake early, refreshed, invigorated - surprisingly strong.</p><p>You will feel reborn.</p><p>Milk it.</p>",
 "year": "",
 "id": "2092",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-24T07:00:00.000Z",
 "views": "33776",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 }
}
