{
 "title": "Ayahusca And Additives, A Divine Stupor",
 "author": "Alkaloidaholic",
 "citation": " Alkaloidaholic. \"Ayahusca And Additives, A Divine Stupor: experience with Hoasca - Misc. Combo (Mimosa hostilis, Syrian Rue, Amanita muscaria, Mandrake, Nicotiana rustica & Anadenanthera colubrina (ID 20950)\". Erowid.org. Mar 8, 2004. erowid.org/exp/20950",
 "substance": "Hoasca - Misc. Combo (Mimosa hostilis, Syrian Rue, Amanita muscaria, Mandrake, Nicotiana rustica & Anadenanthera colubrina",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "3.0 g",
  "oral",
  "Syrian Rue",
  "(seeds)"
 ],
 "report": "<p>My intention was to learn, to be guided, to experience a divine influence on my life. The decision to imbibe this precious Amazonian drink was spontaneous. I knew that it was my time to voyage. The brew, which two people consumed, consisted of:</p><p>20 Grams Mimosa Hostilis</p><p>3 Grams Syrian Rue + 3 Grams Syrian Rue</p><p>4 Grams Amanita Muscaria</p><p>500mg Mandragora</p><p>500mg Nicotiana Rustica</p><p>1 Gram Anadenanthera Colubrina var. cebil</p><p>Prior to ingesting of the brew each person consumed 3 grams of Syrian Rue. The Syrian Rue was placed in a small shot glass and water was added. Each person drank the entire amount of seed. The brew was cooked for 30 minutes in a medium sized pot on a stove top.</p><p>15 minutes after the ingestion of Syrian Rue each person consumed 20 ounces of the brew. After 15 minutes the effects started to become apparent. Visual hallucinations were strong and accompanied by a very 'pineal' feeling. Within 20 minutes I began to feel a very heavy feeling in my head that was not typical with this drink. A heavy stupor fell over me. My eyes felt heavy and weighted. My mind and body felt as though it was poisoned. Within 45 minutes both my associate and I fell into a strong uninterrupted sleep for 12 hours.</p><p>Possibly the addition of mandrake to the brew caused us to fall into this state. Unfortunately I did not experience anything divine. The visions were overwhelming at first and it was very difficult to attend to them. The outline of some sort of tiger or jaguar kept appearing on the ceiling. The fan's movement caused the entire room to pulsate with energy. I was visited by a familar 'entity' that I had encountered on a previous voyage but it was brief and vague.</p><p>I have consumed ayahuasca several times prior to this and everytime it yeilded a very rewarding outcome. My advice to you is to use caution when dealing with new plants and entheogens. If you are not familiar with them start out low. Ayahuasca and other sacred entheogens are quite powerful and should be used with respect.</p>",
 "year": "2003",
 "id": "20950",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-03-08T08:00:00.000Z",
 "views": "20819",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  }
 }
}
