{
 "title": "Adventures With Junior Junk",
 "author": "Gnobody",
 "citation": " Gnobody. \"Adventures With Junior Junk: experience with Nalbuphine (Nubain) & Butorphanol (Stadol) (ID 20957)\". Erowid.org. Feb 11, 2004. erowid.org/exp/20957",
 "substance": "Nalbuphine (Nubain) & Butorphanol (Stadol)",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "IV",
  "Pharms - Nalbuphine",
  "(liquid)"
 ],
 "report": "<p>My first experience with opiates came via a source who supplied some rather unknown pharmaceuticals including nalbuphine (Nubain) and butorphanol (Stadol). Although pretty much unheard of among most of my psychonaut friends, these painkillers seem to be the opiate of choice for the bodybuilding drug scene.</p><p>Both of these drugs come in liquid form only, an advantage to needle-fiends like myself. Although I suppose there shouldn't be any reason it can't be baked up and snorted.</p><p>They are also both partial opiate agonists and for that reason are considered to have relatively low 'abuse potentials' as far as opiates go. What this tends to mean for the user is (1) they are going to be infinitely easier to get than any other heavy duty pharmaceutical meant for injection and (2) while they may not be as fully opiate-like in their feel, and could be somewhat unpleasant at first, if used properly they can be very pleasant and fun (more than their scheduling would suggest anyway).</p><p>I was originally introduced to butorphanol in its veterinary form (known as Torbugesic, and other than the name, seems to be identical to its human version: Stadol).</p><p>A friend of mine administered an injection (of a typical dose, something equivalent to 10mg of morphine). I wasn't in any particular kind of mood, and I was anticipating something pleasant. I began to feel ill. Mostly nauseous but just generally crappy. I got a vial of the stuff and just held onto it. I had no real desire to try it again and I wasn't going to throw something so interesting away. Finally curiousity got the better of me and I tried it again. Almost none of the previous unpleasant effects took place. It produced a much more opiate-like feel. It was probably a combination of trying a smaller dose and building a tolerance to the nauseating effects, but it had a completely new feel to it that really surprised me.</p><p>I proceeded to go through the vial pretty quickly. Never did too much of the stuff at once, but I did it a lot. When I ran out after maybe 2 weeks, I was expecting to be kicking the stuff for at least a few days before I felt good or normal again. But the stuff was pretty sparing as far as withdrawls go.</p><p>Eventually I got my hands on some Nubain. This stuff was mg/mg equivalent to morphine while still being only a partial agonist/antagonist. While supposedly similar to butorphanol, this stuff was a much smoother buzz. It seemed to have more of the peaceful, calm, confident trancelike effects you get with normal opiates. Never had a bad experience with it except for getting slightly hooked, but again, getting off them isn't too hard.</p><p>A friend of mine, one of the few privy to my habit, wanted to try some, so I obliged. She seemed to experience the same unpleasant effects I had with my first couple butor experiences. The unpleasantness definitely faded but didn't completely disappear with use. She experienced similar discomfort (stomach upset mostly) with other opiates (oxycodone, hydrocodone and such). Whereas after the first few times, I never had any nausea or pains from opiates ever again. I guess people have different sensitivities. I would think if you react well to opiates in general, you'll probably like the partials as well.</p><p>Having tried just about every other pharmaceutical grade opiate since then, I'd say nubain, and to a lesser degree, butorphanol are two of my favorites. They can be somewhat addictive, but withdrawls seem to be slight if at all noticable. I never found myself increasing my dose or building much of a noticable tolerance even with 2-3 weeks of pretty regular use. Partials also seem to reach a dose-response peak unlike normal opiates. This means that after a point, taking more simply won't give you more of a high. I never seemed to need more than the standard 10mg equivalent.</p><p>At any rate, they're a lot more fun than they're given credit for. If you simply can't control your hankering for trying something IV, you're probably a lot better off trying these than injecting pills or some whoknowswhat mystery street powder.</p>",
 "year": "2002",
 "id": "20957",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-11T08:00:00.000Z",
 "views": "18637",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "IV",
   "substance": "Pharms - Nalbuphine",
   "form": "(liquid)"
  }
 }
}
