{
 "title": "First Extended Trip",
 "author": "Dirty Sanchez",
 "citation": " Dirty Sanchez. \"First Extended Trip: experience with AMT & Salvia divinorum (10x extract) (ID 20978)\". Erowid.org. Feb 4, 2003. erowid.org/exp/20978",
 "substance": "AMT & Salvia divinorum (10x extract)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "AMT",
   "(capsule)",
   " T+ 3:00",
   "25 mg",
   "oral",
   "AMT",
   "(capsule)",
   " T+ 8:30",
   "25 mg",
   "oral",
   "AMT",
   "(capsule)",
   " T+ 12:00",
   "5 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "20978",
   "Male",
   "",
   "Not Given",
   "Feb 4, 2003",
   "10210",
   " "
  ]
 ],
 "report": "</p>\nThis past Friday night, me and some buddies of mine decided to seize an opportunity that fell in our collective lap:  an old friend of mine offered us some AMT.  I acquired 5 capsules, each containing 25 mg of the substance.  At 2 pm, 3 of us each ingested one.  A fourth friend had to watch his daughter that night (responsibility is a bitch) and couldn't have fun with us.  The fifth capsule was an extra that I had gotten, in case another friend wanted to join us (he ended up not wanting to).</p><p>I had heard of AMT before, but never knew anything about it until I had the opportunity and desire to take some.  I went online, read about it for about an hour, including some published experiences, and kind of hyped it up for myself and my friends.  We were expecting something absolutely unforgettable, an experience unlike any other.  We were surprised by what actually happened.</p><p>Roundabout 3:30, mine started kicking in.  I felt like I was mildly rolling, with the jittery body buzz and faint lightheadedness.  The other two gentlemen felt nothing at all.  That's very strange to me, but one of them is 6'1/205, and the other is 6'3/280.  I myself am 6'1/220.  I was the only one who felt anything at all, and it was an experience.  I was beginning to increase the feeling of rolling, but I think that was due to the meth-like effects of the drug.</p><p>At about 5 pm, I ate the spare capsule.  I didn't think that the one was going to last me all night, because it hadn't done too much to me yet.  I then left our home base to talk to someone about compensation for the failed substance.  As I was sitting at his work, talking to him, I began to trip (6:30 pm).  Not hard, but things began pulsating and I began getting kind of giggly, especially when his Robo-trip began kicking in and he started making an ass out of himself.  I looked in the mirror in the bathroom and of course my pupils were fully dilated.  I then knew that I was in for something that I hadn't expected.</p><p>He and I went to someone else's house to make more DXM, and I began tripping really hard.  Wood grain panels were swimming, pictures were pulsing, and I had a very pleasurable body feeling.  After being there for almost two hours, we left and I returned to home base, where the other two friends had eaten some mushrooms and were themselves tripping in an entirely different manner.  They had the fifth capsule that our other friend had wanted to give back to me, so I ate it (10 pm).  I now had approximately 75 mg in me.</p><p>We had some fun for a while, then another of our roommates came home.  She began playing Mario Brothers 2, which is an absolute blast to watch when there's trails on everything.  About 1 am, the third pill kicked in.  Then I started seeing wonderful patterns in the air, on the ceiling, on posters, from the lava lamp.  I was zooming around, and loving every moment of it.  Mind you all, my friends were still tripping on their psilocybin, so we all had a great time for a while.  I started to ebb, which made me realize that the entire night my trip was ebbing and flowing, i.e. sometimes it was a strong trip and sometimes it was like a strong roll.  I don't know if that's normal, I hadn't heard anything about that.</p><p>About 2 am, a friend (who had ingested 200 mg of AMT throughout the night) called me and told me that if I had any, I should smoke some salvia.  So I said why not, and smoked 5 hits of a bowl that was almost entirely extract.  It was only 5, because the fifth floored me with an indescribable pins and needles feeling throughout my body.  I then sat down and began watching TV.  One of the shroom-zoom team had come down, but the other was still going strong.  We turned on Trainspotting (my fellow zoomer had never seen it) and enjoyed that.  Unfortunately, I had only gotten about 6 hrs of sleep over the past two nights and was extremely tired, so I passed out sometime around 4 am.</p><p>I woke up at 8:30 to a phone call about the Columbia tragedy, and was no longer tripping, though I was considerably stumbling through ideas that I was trying to talk about with a friend who had come over to smoke at 10 am.  I don't know if that was due to the salvia, or the AMT, or the marijuana I smoked.</p><p>I thoroughly enjoyed my experience, except for the fact that it took so long to kick in.  My friends that also did it with me didn't enjoy it, as it didn't work for them.  I took higher dosage, spread out over time, and I think that if/when I do it again, I'll follow the same ingestion pattern.  It was very pleasurable, but I don't think I'll drive again.  That may have been a mistake, as I don't remember the route I took, but I did get to where I needed to go.  I wouldn't recommend it, driving that is.</p>"
}
