{
 "title": "The Day After Is What Got Me...",
 "author": "Egotripper",
 "citation": " Egotripper. \"The Day After Is What Got Me...: experience with AMT & Cannabis (ID 20973)\". Erowid.org. Nov 26, 2003. erowid.org/exp/20973",
 "substance": "AMT & Cannabis",
 "bodyweight": "200 lb",
 "report": "<p>Its 9:52, nearly 60 hours after I ingested 25mg of AMT and I cant tell you how good it feels to be baseline.  Let me start from the beginning.  Last Thursday my buddy from down the hall (I live in a college dormitory in Ohio) came into my room and asked me if I wanted to try the new research chemical that the government is going all crazy to ban: AMT.  He told me it was a strong trip and that its length was the most impressive feature.  It was going for $10 a hit (25mg) and he told me that though most people like to go with a 40-80mg dose others are perfectly happy with 25mg.  I bought some of the off-white powder from him to distribute among my buddies.</p><p>I had to work that night, but two of my friends dosed.  3 Hours after they dosed I got home from work.  I saw one of them on instant messenger and he told me he felt a slight buzz but aside from that he was sure I had been sold crushed-up pharms.  I was pissed. </p><p>The next day I got a call from the same kid.  He had taken 1 and a half doses (37mg) that afternoon and it completely messed him up.  I decided to dose that night. </p><p>10:00PM Friday  I drink a mixture of orange juice and 25mg of the AMT.  The setting was my friends R and As dorm room.  I was the only one tripping that night.</p><p>10:30  Im nauseous and dizzy.</p><p>11:00  It feels like half a roll at this point.  A very nice body buzz and slight euphoria.</p><p>12:00  From here on out time means nothing.  I had been playing Tony Hawk on PS2, but no longer had any desire.  My pulse was about 100 b/m and I was very hot.  A few of As friends had come up to visit and showed up with plenty of beer though I didnt feel like drinking.  At about 12:30 (though Im not sure it might have been 1), I headed back to my dorm with 3 others to pick up some kind bud from my closet.  The 2/3 mile walk back to my room was excellent.  My body felt great and the colors of the night mixed with the white snow on the ground were great.  I was beginning to see my first visuals at this point (mostly just fish-eye lens vision and trails).  A friend told me my eyes were fully dilated. </p><p>When we got to my dorm it was insanity.  About 20 kids were standing outside the door smoking and I was informed that almost everyone was tripping on AMT.  As I started to socialize it felt very much like all of us were on MDMA.  Everyone was very friendly and talkative.  It was great.  I went upstairs and grabbed the weed and walked back to R and As room with my buddies. </p><p>At this point I noticed that I had no real fear.  If I had been on mushrooms I would have been a blabbering fool, and though I had a similar body feeling, my head was clear and I could carry on a conversation.  I had no fear of law enforcement like I did on shrooms and generally enjoyed the feeling. We got back to the room about 2 and smoked a bowl of KB.  I closed my eyes and enjoyed some geometric CEV which eventually became more complex.  At one point I saw the face of Jesus, which freaked me out to the point where I opened my eyes. This was the peak of the visual portion of the trip.   My friends faces were play-dough looking, the floor had a distinct pattern on it and the ceiling was like water.  Very cool. </p><p>About 2:30 the trip took a turn for the worst.  One of the kids who was visiting whipped out the flick Altered States.  This was not a good movie for me to watch in that state.  I dont want to ruin the movie for you but it basically concludes that not only is there no higher being out there, but that nothingness is not nirvana, but is TERRIBLE. </p><p>So here I am, still tripping at 4:30 with a head full of AMT and the idea in my head that after I die I will go on in terrible nothingness forever.  I can deal with the idea of nirvana after death, but not terrible nothing</p><p>I walked home alone, because everyone else was going to sleep.  I sat in my room on my computer trying to listen to some soothing music but it just wasnt working.  For the first time in my life I studied calculus for fun it was the only thing that interested me at the moment.  I stayed up until 7 and went to sleep for 2 hours (I had to wake up at 9AM to do some quick maintenance work part of my college job).  When I opened my eyes I realized I was still feeling the AMT and was mildly depersonalized and that freaked me out.  My pupils were still half dilated.  I went and did what I had to do (took about half an hour) and came back to my room. </p><p>I searched the internet for a while, looking for quotes from right before people died trying to get at what they saw as the next step.  I got inconclusive results.  I studied religion for a while, considering breaking out from my agnostic state and just picking one at random (?!  I must have been pretty depressed =D) After that I listened to some Built to Spill (Theres Nothing Wrong with Love) and Nirvana (In Utero).  The later of the two was a bad choice you can literally hear Cobains pain in the music and this threw me into a mild depression for the rest of the day. </p><p>At 6 I left for my friends room.  He was taking 50mg of AMT and I wanted to be there to see how it went for him.  I was so depressed/paranoid and it showed, so at about 9 I decided to just come back to my room and crash.  I slept for 12 hours and now I feel great.  It looks like the depression was completely drug/movie induced.  I seem to have found the filter again that lets my brain accept my lack of knowledge about death and just ignore it altogether.  In fact, Im back to looking at death as the great mystery.</p><p>I have one dose of AMT left, but I think Ill save it for the spring.  It seems like a good outdoor drug, as the most fun I had was the time I spent outside.</p><p>Be careful and happy tripping</p>",
 "year": "2003",
 "id": "20973",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-26T08:00:00.000Z",
 "views": "6165",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
