{
 "title": "Good? Bad? Not Sure",
 "author": "jason",
 "citation": " jason. \"Good? Bad? Not Sure: experience with Mushrooms (ID 20976)\". Erowid.org. Mar 12, 2003. erowid.org/exp/20976",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "report": "<p>I'm 17, live in Canada, and I've only smoked pot (for a while though).  A friend of mine notified us that his parents were going away for the weekend, so we bought some mushrooms and decided to try them at his house.  I myself was excited to try them, but was worried about a bad trip so I only bought 2gs.  I was told they were very strong and that I only needed a small amount if I was unsure.  My friend who was getting the mushrooms had had them a few times before and bought 4gs.  My second friend had never tried it before, but also decided on 4gs.</p><p>We ate them at about 6:00pm alone, but had some chips with them to mask the taste (not too bad but bitter).  I ate about 1.5 and stopped.  My friend (first time) had about 3 and began to worry.  We soon convinced him to eat the last g.  The other friend planned to eat his later.</p><p>For the first while we sat in the kitchen talking.  It came on slow, but faster than I thought it would.  I was told lights would get brighter and appear to glow.  After about 30-40 minutes, I started to feel a little strange, but nothing special.  I grabbed some paper nearby and began to draw and listen to my friends talk.  I lost track of time, but after about an hour or more later I was feeling very strange.  I couldnt connect where I was with memories of the rest of my life.  I knew I was living, and i knew where i was, but i wasnt sure why i was there.  I wasnt sure if i was enjoying myself or not, but I felt very good.  Im not sure how to explain it, but i felt almost reborn, like my body was fresh and new.  My friend on the 4gs would repeat his plans for the night about every 5 minutes for the next 3 hours.  This was very frustrating.  He would repeatedly ask me if i was 'feeling it'.  He seemed stressed and asked if I wanted to 'just go to sleep'. </p><p>However, this was just the beginning.  He stopped speaking completely for about 2 hours, and I had to watch over him to make sure he didnt break things or wander off.  Nothing he said made any sense, and I couldnt connect any of it to what we were doing.  My sober friend told me that this was normal, and to not worry.</p><p>I had just gotten over the flu a few days earlier, and I was sort of worried about my temperature.  I felt very cold, and then soon very hot.  After a while I started to relax.  Things that happened were extremely funny, much more so than pot, and i had to leave the room a few times because i was laughing too hard.  I hadnt really taken enough to hallucinate, but simple patterns in walls and carpets stood out and seemed to be flowing like water.  My friend on the 4gs told us the next day that he was constantly hallucinating, but couldnt remember what was going on.</p><p>Even though this wasnt the best experience i could have had, I am excited to try it again now that i know what it is like (3 or 4 for next time).  I recommend that it is done in a place with no worries and with people you trust.  I think it also helps to have someone sober to remind you of things.</p>",
 "year": "2002",
 "id": "20976",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-03-12T08:00:00.000Z",
 "views": "7104",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
