{
 "title": "Retrospective",
 "author": "Melchior Immanuel",
 "citation": " Melchior Immanuel. \"Retrospective: experience with Anadenanthera colubrina (ID 21007)\". Erowid.org. Feb 3, 2003. erowid.org/exp/21007",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "150 lb",
 "report": [
  "<p>This is a retrospective as I have decided to close the door on my experiments with this substance.  To those who are curious about it, I heartily recommend Jonathon Ott's paper on the subject, which is to be found floating around on the net somewhere.  (Ott, 2001)",
  "I stopped using Yopo mostly because a.) it was very painful, and b.) I felt that the experience was too quick and extreme to be of use in any spiritual or psychological manner.  One snorts the powder, and simultaneously vomit copiously and get blown into outer space.  The pain is pretty intense for the first 10 minutes or so.  Then once the pain resides a bit, the relief is a revelatory experience.  Unfortunately, this period of euphoria is short, and immediatley followed by a sudden comedown.  You don't really get a chance to adapt to your new state before being dragged back down into you fully exhausted body.  In contrast, with Ayahuasca, I feel that one goes through a purgation/ purification cycle, but that this is merely the gateway to the ayahuasca experience.   Also, I find that it is harder to space out 1 hour trips than normal 6 - 12 hour trips.  After a good dose of mescaline, for example, i have no problem staying sober for a few weeks, letting the experience integrate.  Yopo is the only hallucinogen i've tried to take two days in a row.  You can do it, but it's not recommended.  I find a minimum of two weeks between trips is necessary, and it's simply too easy to keep coming back to the stuff.",
  "The substance has some things to reccomend it.  The visuals produced are unique to the substance, and can only be described as being trapped in a Miro painting.  It is very economical (ok, that's not such a great reason).  and, ummm...  it certainly is hallucinogenic!",
  "I think Bufotenin freebase may be a much more pleasant and useful experience.  I'm not too tempted to try, though. ",
  "On a side note, a friend of mine was sent to the hospital after consuming Yopo in conjunction with other substances.  I believe my friend was merely having a particularly rough time, and was unprepared for it, and not in any real physical danger.  Nevertheless, I feel a terrible guilt over not being present to help, and can only re-emphasize the *extreme* importance of always having an *experienced* sitter, with all new substances, and this one in particular.",
  "So I am now not such a big fan of the stuff.  I hope i haven't offended any die-hard followers, but this is what i've seen.</p>"
 ],
 "year": "2002",
 "id": "21007",
 "gender": "Male",
 "views": "19847",
 "dose": [
  {
   "time": "0",
   "amount": "4 seeds",
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina",
   "form": "(ground / crushed)"
  }
 ],
 "submissionDate": "2003-02-03T08:00:00.000Z"
}
