{
 "title": "An Immediate Lift",
 "author": "Alter-Ego",
 "citation": " Alter-Ego. \"An Immediate Lift: experience with Mushrooms & Betel Nut (ID 2101)\". Erowid.org. Jun 25, 2000. erowid.org/exp/2101",
 "substance": "Mushrooms & Betel Nut",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Betel Nut",
   "",
   " ",
   "oral",
   "Mushrooms"
  ]
 ],
 "report": "<p>Simple, but very useful observation: chewing Betel nuts is a great stimulant that offsets many of the undesirable effects of mushrooms and even adds to the strength of the trip. Betel nuts, I hear, are apparently the world's most common 'lift', surpassing even caffeine, believe it or not, despite the fact that its almost unheard of in the US. (Incidently, my wife is from Sweden and she tells me that there's plenty of things that are unheard of in the US!). Hey, kids, don't worry I am not a saleman or anything trying to sell Betel--heck, if this damn message causes a run on the stuff then I'll have to wait weeks for a refill. But the stuff works so well with shrooms that I couldn't keep it a secret, so here I am.</p><p>Alright, we all know shrooms are kinder to your head than other hallucinogens, thank goodness. However, the physical stimulation that allows you (or in some cases, forces you!) to walk 16 miles during a trip on other stuff just isn't there for shrooms. I even read somewhere on a shroom website to 'Get out your pillow, you'll need it', or some such. That's exaggeration, no doubt, but is there anyone here who wouldn't like a mild stimulant once in a while to complement their shroomy feeling?--as long as it doesn't cause Tension, the Big Enemy, right? Well, try Betel nuts. For me, it gives an immediate lift. There won't be any question about it--you will feel the lift within one minute of starting to chew, its reliable.</p><p>Arecoline is a mild central nervous system (CNS) stimulant, which increases respiration while decreasing the work load on the heart. Now, name me an experienced shroomer who hasn't experienced a need to yawn during certain stages of the trip--an indication that respiration isn't keeping up, and here arecoline can help.</p><p>Yes, yes, I know, technically arecoline is in the same cholinergic alkaloid group as is muscarine, found in Amanita muscaria (fly agaric). But, although I haven't researched it deeply, it seems to me the upshot of this is simply that arecoline affects the acetylcholine receptor, Big Surprise. You won't find much similarity between the chemical structures of arecoline and muscarine, muscimol, ibotenic acid, etc. However, I suppose it is possible that there is a deeper interaction which could account for an apparent increase in the effect of the mushrooms. Someone should investigate this.</p><p>I would consider it more noteworthy that many people consider Betel an aid to meditation and those sorts of things.</p><p>So, shroomers (especially party shroomers, although I suppose you have other additives), give it a try. It's a substantial lift without the tension, irritability, or anxiety that is often associated with other stimulants (and don't we do shrooms exactly to get away from that sort of crap?). It is also worth mentioning that extract of Ashwagandha (Withania somnifera), preferably taken sublingually, is a great restorer if you're coming down from shrooms or any combination thereof, and for whatever reason had some stress during the voyage, which we all know can get amplified. And finally, I think it is good to check and make sure that everyone is being sure to meditate or do their hypnosis during the time when they are first coming on to their shrooms, so as to relieve any heaviness of spirit and focus on what is important. What?! You don't meditate OR do hypnosis every day?!! Shame on you...</p>",
 "year": "",
 "id": "2101",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-25T07:00:00.000Z",
 "views": "36808",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Betel Nut",
   "form": ""
  }
 ]
}
