{
 "title": "Tobacco : It's All In The Mind",
 "author": "Rain",
 "citation": " Rain. \"Tobacco : It's All In The Mind: experience with Tobacco (ID 21023)\". Erowid.org. Feb 4, 2003. erowid.org/exp/21023",
 "substance": "Tobacco",
 "bodyweight": "11 kg",
 "report": "<p>All my life I've been told how smoking can ruin your life and cause an untold amount of diseases. One day my curiousity got the better of me,  and feeling like the rebellious teenager I saw myself as,  decided to try smoking to see what the big deal was all about.</p><p>Every weekend, me and my friends used to head up to the boulevard to skate. I'd had a bit to drink and wasn't feeling particularly health conscious. My friend offered me a cigarette (which I wouldnt put as peer pressure because he'd done it before and I'd turned him down,  and no fuss was made about my decision)  and I accepted. I sparked it up and took it back, and I was surprised as to how harsh it was on the back of my throat. The air was still, and the smoke blew from the smouldering cigarette into my eye (why does it always do that?!) which hurt intensly. I remained undeterred, and proceeded to smoke the rest of it.  I remember a few drags and beginning to feel very light headed and dizzy, which I must admit I enjoyed. It wasnt too dissimilar from the first effects of marijuana  (which I had smoked before considering cigarettes, surprisingly), with diziness and the recession and retardation of motor control I was used to experiencing with pot, but not as strongly.</p><p>I proceeded to feel slightly nautious and I had to sit for a while,  although after trying smoking on a few occasions post to this, this feeling of nausea faded. I must admit I was impressed with this legal and stunningly popular drug, although it is hardly seen as a drug or nearly as frowned upon. smoking is something I could do in front of my grandparents and not get a second look. this was a year and a half ago,  and still I see commercials warning about how addictive smoking is. I write in protest to this as I have smoked socially for a year and a half,  and never experienced a craving or desire if you will to smoke. If I am offered, I will accept,  but no chemical need for nicotine has ever flinched me. I began college six months ago,  and you are allowed to smoke.  I smoke almost daily when there is little else to do and still I can go for weeks (as I do)  without thinking about it or feeling the need to smoke.</p><p>I am merely pointing out that everyone reacts differently  (indeed, I have seen many friends succumb to the temptations of smoking as a habit) and am in no way implying that you can't get addicted, my parents smoked for 20 years and went through hell to get off tobacco. I just seem to go without the cravings. It still remains a pleasant social activity,  With the added bonus of physical effects and a state of mental well-being. Hail the leaf.</p>",
 "year": "2003",
 "id": "21023",
 "gender": "Male",
 "timestamp": "2003-02-04T08:00:00.000Z",
 "views": "33468",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  }
 }
}
