{
 "title": "Quit Smoking w/ Hydrocodone",
 "author": "Tim",
 "citation": " Tim. \"Quit Smoking w/ Hydrocodone: experience with Hydrocodone (with Acetaminophen) & Nicotine (gum) (ID 21105)\". Erowid.org. Dec 8, 2005. erowid.org/exp/21105",
 "substance": "Hydrocodone (with Acetaminophen) & Nicotine (gum)",
 "bodyweight": "155 lb",
 "report": "<p>I had desperately tried to stop smoking - a pack per day for 15 years - for at least 5 years, and diligently for 2, with no success at all. Following a routine Oral procedure, I was given Vicodin for pain, and subsequently noticed that when I had taken it, I didn't 'need' to smoke as much - I may have 'wanted' to smoke, because I was a bit euphoric (big difference) so I decided to try an experiment: I went to the store and bought some Nicotine Gum, and made another stoic effort to quit smoking.</p><p>I took one Vicodin (5mg/500 APAP) every morning and one every night and chewed the gum as prescribed. I did this for approx. 30 days.</p><p>Did it work? I haven't had a cigarette since that day. I didn't experience ANY of that horrible craving, jittery nerves or aggressiveness so many of us experience when attempting to quit smoking. Is this for every one? I don't know, of course, but I do know that it totally worked for me. Because of the length of the regimen, tolerance and dependance will probably develop, but this can be easily curbed with Tramadol (Ultram), which works wonderfully for any opioid withdrawl. If it is planned and the plan is adhered to, I believe those certain and particular folks who have so much difficulty stopping smoking will find Hydrocodone a great adjunct, and will potentially be saving their lives.</p><p>One year after I quit smoking, my daughter was born, and I assure you I am beyond grateful to be around to be her dad. Smoking would have compromised that..forever. In my personal opinion, I believe most opiate drugs to be so completely benign and their being assigned the evil designation they currently suffer as to be solely in regard to politics, as do many doctors believe. Please use them safely and judiciously. And also, remember this: If they (opiates) weren't designed to be a natural part of human experience and even potential enjoyment, but certainly human manipulation, humans would not have receptors (mu receptors) for the opiates to bind to. Even semi-synthetics, like Hydrocodone, are perfectly normal chemicals in life to be used naturally by people, and since human are capable cognitively to discern 'right' from 'wrong' or any destructive behaviors, it is therfore perfectly acceptable to believe that one can design one's own judicuous use of these drugs. Simply, just be safe, ask questions, get knowledge, and improve your life.</p><p>That is precisley what I did. I must end this discourse, my little girl is yelling loudly to come downstairs, so off I go...good luck, and be safe.</p>",
 "year": "1997",
 "id": "21105",
 "gender": "Male",
 "timestamp": "2005-12-08T08:00:00.000Z",
 "views": "58755",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(daily)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "buccal",
   "substance": "Tobacco",
   "form": ""
  }
 ]
}
