{
 "title": "Nootropic or Nostrum",
 "author": "snip",
 "citation": " snip. \"Nootropic or Nostrum: experience with Hydergine, Piracetam & Choline (ID 21114)\". Erowid.org. Nov 10, 2003. erowid.org/exp/21114",
 "substance": "Hydergine, Piracetam & Choline",
 "bodyweight": "132 lb",
 "report": "<p>Setting: At home, online</p><p>Mind Set: Curious to objectively evaluate a rarely tried substance</p><p>Having ingested 800 mg of piracetam in the form of an orange, notched tablet of Nootropil, I have decided that it would be best to do this 'live and direct.' That is, rather than describing (possibly biased) recollections of my 'trip' hours after the fact, I will be reporting my experiences as they come.</p><p>For starters, let's begin with dosage (i.e. the 'recipe'). I took the hydergine and piracetam separately, each with a capsule of choline and a glass of water. As implied, the hydergine was taken first, the piracetam following not more than three minutes later.</p><p>Although I've followed the same recipe at least a dozen times before, I am a bit nervous and drink another glass of water. The only thing making this time different is that I took the tablets later in the day.</p><p>As usual, I don't notice any major changes in perception or emotion. I feel slightly less inclined to express myself or communicate with anyone in general. This is probably because I realize that over 90% of my ordinary speech is meaningless 'clutter.' I also notice that I am slightly more inclined to 'read into' names and titles. I scramble and reverse the names of tracks I am listening to, and I compute the sums and products of random numbers. But it is hard for me to notice any changes in perceptual ability or computational speed. I simply 'feel' more 'aware' (possibly placebo).</p><p>I return from having discussed with someone. Effects are often best noticed when discussing with others. I realized that I could recall facts and names that I would have otherwise thought were forgotten. But the differences are not strong enough for me to notice them without trying to.</p><p>An hour and a half after taking the tablets, either the effects or my willingness to detect them is wearing out. I am beginning to feel tired and this report will soon end.</p><p>A common and only side effect I have noticed is a slight feeling of nausea. This is alleviated by the choline, but it is still present.</p><p>For those of you expecting sudden, dramatic changes in perception and intellect, neither piracetam nor hydergine is a magic potion. It may be true that repeated daily dose can increase your overall intelligence, as I have yet to experiment with such a regimen. But a single dose is, as has been pointed out, either 'subtle or nothing.'</p><p>Much more experimentation has to be done with these substances before we can categorize them as either nootropics or snake oil. I encourage others to experiment freely with similar combinations, if not to improve their own abilities, to contribute to our knowledge as a whole.</p>",
 "year": "2003",
 "id": "21114",
 "gender": "Male",
 "timestamp": "2003-11-10T08:00:00.000Z",
 "views": "43482",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4.5 mg",
   "administration": "oral",
   "substance": "Hydergine",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "(capsule)"
  }
 ]
}
