{
 "title": "Black and White Movie",
 "author": "Knad Deew",
 "citation": " Knad Deew. \"Black and White Movie: experience with Cannabis (ID 21215)\". Erowid.org. Feb 10, 2003. erowid.org/exp/21215",
 "substance": "Cannabis",
 "bodyweight": "210 lb",
 "report": "<p>I had tried smoking about 3 times in 8th grade, but to no avail. I gave up on it and didn't even think of trying it until the Summer before 11th  grade.</p><p>My friend who lives very close to me, C, went to buy a gram from a reputable dealer. We went back to his house, and decided to smoke at night. I slept over his house, and at around 1:00 AM we snuck outside.</p><p>We smoked with a coke can pipe. I took a couple of hits, and i wasn't really feeling anything.</p><p>It was a full moon, so everything in my sight was either black or a pale white. I didn't quite feel the weed in my body yet, but I got the strange feeling I was watching a black and white movie of my friend smoking. He would pass the pipe to me, and i would wait for the movie to react and grab it, but i kept forgetting that it wasn't a movie and it was real. So i would grab the pipe and take another hit.</p><p>Then suddenly, it hit me. I got a pleasant numbness in my body. I felt like nothing was real. I thought I had fallen asleep on my friends couch and had a dream where we smoked. The same thing happened with the black and white movie, I waited for the dream to react, but noticed it was real.</p><p>Many times i completely lost the feeling in my body, and the only things bringing me back to reality were the flame from the lighter, which brought color back into my mind, and the taste of the smoke when I took a hit.</p><p>We finished off about 2 bowls and went back inside. When inside, I finally understood 'munchies' we proceeded to eat 3 bowls of cereal. Food never tasted so good.</p><p>After that and a little TV watching, we laid in our beds and listened to music. The music was so beautiful and i began to see strange patterns on the ceiling.</p><p>I had totally underestimated weed. I thought it just made me feel good and made me think things were funnier. I didn't know it was an experience. I kept asking my friend if the weed we bought was laced, but he assured me that this is how it always is. I was amazed by the sheer power of this wonderful plant.</p>",
 "year": "2002",
 "id": "21215",
 "gender": "Male",
 "timestamp": "2003-02-10T08:00:00.000Z",
 "views": "14316",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.75 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
