{
 "title": "Cid In The City Alone",
 "author": "Tristoned",
 "citation": " Tristoned. \"Cid In The City Alone: experience with LSD & Cannabis (ID 21224)\". Erowid.org. Dec 6, 2005. erowid.org/exp/21224",
 "substance": "LSD & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  "DOSE: T+ 0:00",
  "5 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  " T+ 2:15",
  "1.5 g",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 4:15",
  "1 bowl",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>If this reads a bit messed up, I just took my 6th soma/codeine in the past hour, I'm a little messed up ;]</p><p>T+00:00 (4:45pm) - Tripping on acid in the city is a mindfuck no matter which way you look at it. Tripping alone in the city is a real test of your integrity. In the city all these outside interferences mess with you mind, and there is no means of blocking them out. It was my last day in Boston, I was moving home from college, and I decided to go pick up a sheet of acid. I made a call, picked it up, went to my room, and began to cut it. I cut off a strip of five hits and palletted it, then began packing.</p><p>T+02:00 (6:45pm) - Its taken me about two hours to pack and I just finished a wrestling match with the bundles of cords from my computer. For some reason they saw it fit to tangle themselves around my chest, making me feel constricted, and threatened. Obviously the acid is doing its trick, I'm sweating profusely, the white-painted cinder block walls are dripping, the room is breating organically. I decide to make a phone call to a friend whom I'm supposed to visit once I was done packing. They say its fine to come over, so a quick piss and I'm on my way, or so I thought until I stared in the mirror. My pupils were pieplates. With this particular acid, which I had been taking for some time, (there was steady supply), I find that you peak after about four hours.</p><p>T+02:05 (6:50pm) - I begin my trip across the rose garden in Boston, towards the Fenway area. Crossing a street, I stepped out in front of a van without looking. Its brakes locked up, (There was alot of snow on the roads) and was hit by a tow truck towing an old buick, which was in turn struck by a minivan. A four car pile-up. My perception of the events are blurred, But I do recall seeing an impact wave from the sound of the cars colliding, which radiated right through my body. That was an intense moment, I fled, walking briskly across the street. Then I heard a jet taking off. From my viewpoint I could see the entire city lit up, the prudential, copley sq. etc..., and all I see is the noisy jet taking off just behind the prudential. The energy wave from the jet shook the entire city, I saw intense vibrations, and the prudential slightly bent about ten degrees to the left. Cool.</p><p>T+02:15 (7:00pm) - The walk took longer than usual, I kept forgetting where I was supposed to be heading.  But I finally arrive at my friends apartment. They buzz me up and I run to the room. I pack my large bowl, about a gram and a half of fantastic head nugget, and begin to toke with my friend. I am sweating profusely. She had taken this acid before, so I knew that she knew what I was going through, though she has only taken two tabs maximum (this is extremely potent shit). I told her I had taken five. She looked at me in disbelief, and reminded me that my father would be at my dorm at 10:00am to pick me up. Thank you for the reminder.</p><p>T+03:00 (7:45pm) - Things have been going well, my visuals are extremely intense, Out of the corner of my eye I keep seeing my female friend flicking her tongue at me in a seductive manner, but when I look back, she is doing her homework. WEIRD. We have a mellow music selection on and it is easing my trip, as I slowly tap away at my 30 rack of bud.</p><p>T+03:45 (8:30pm) - I've been playing guitar for about half an hour, and it still amazes the heck out of me. The vibrations of the strings are electric, my whole body quivers with every note I play, I play some floyd, some zepplin, hendrix, dave, and metallica to keep myself entertained. Suddenly another one of my friends comes in. He decides we should go for a walk to get some nugget. I've never really hung out with this kid, so at this point I'm weirded out, but I enjoy a good test on my mind, so I consent to the adventure.</p><p>T+03:50 - 04:15 (8:35 - 9:00pm) - The walk seems to take forever, with every turn there is a bum asking for change or a cigarette. I cant even talk to them at this point, only stare as their mouths grow long, twist, melt, and suck in. Weird visuals from the bums. We finally got to the house we set out for.</p><p>T+04:15 (9:00pm) - The person I was with is an unusual character, spent about six years of his young life (11-17) in las vegas, tripping on acid hundreds of times, so as you can imagine, he's pretty far out there and likes to fuck with less experienced people. Turns out the place he took me to is a friend I'll call Daniel. Daniel is a devil worshiper that lives with other pentagram people. We enter the appartment, and go to Daniel's room. Unfortunately for me, Daniel's stomach ulcer is acting up and he's vomiting everywhere between taking lines of cocaine. We smoke another bowl, buy some hash and herb, then retreat after what seemed like forever.</p><p>T+04:55 (9:40pm) - The walk home was intense as well. I was talking to my friend about how I can control people's minds while tripping on lsd, and I wanted to prove it to him. He said sure... As we were walking down the sidewalk, a young couple was approaching from the following direction, a young man and a beatiful brunette. My friend is not the most handsome guy in the world, but when the couple reached us, the girl broke away from the guy and stepped right in front of my friend, checked him out, gave him a smile, grabbed his nuts, then continued on as her boyfriend yelled at her asking what the fuck she was doing. The whole time I just watched and concentrated. Weird. My friend flipped out saying that it was so random etc... until suddenly some man goes sprinting bye in the middle of the street at full speed. Weird. As we get closer to home, a man says to us as we're walking by 'Hey you boys wanna buy some beers'. I reply ' NO I'm PISS DRUNK', then the man pissed himself, and my friend pointed it out first, he was only high on cannibus. Weird.</p><p>T+05:15 (10:00pm) - Ah home again.  We finally arrive home and the night continues to go well, I sit in a room and play guitar and stare at dead posters, completely gone.</p><p>T+06:45 (11:30pm) - My friends decide to watch a movie, I try to watch but they try to fuck with me by putting on the spanish subtitles, they know I speak spanish, and I'm hearing what the person is saying in english, and reading it in spanish at the same time. It was too much to handle. I left the room.</p><p>T+07:00 (11:45pm) - My two lesbian friends enter the empty room and begin talking with me. I've known them for quite some time, and they are completely gay. But one of them started to rub my thigh, then the other asked if I wanted a little going away present. Being the dumb acid head I am I said 'What are you talking about'. She replied 'You wanna unwrap me and (Jill we'll call her)'. Sure I said. She mounted me and we began to makeout, these are some hot lesbians too, what a fucking thing to do while tripping!</p><p>T+07:15 (12:00am) - I dont remember much of the kissing stuff, but I do remembert getting head from the two of them at once, it was so hard to hold in my excitement if you know what I mean, but I did.</p><p>T+08:45 (1:30am) - The sex was amazing, I can only say that having one of your fantasies come true, while tripping, is an amazing thing. Anyways, everyone went to bed, so I'm left by myself.</p><p>T+09:45 (2:30am) - Cant sleep and my mind is way out there, I'm starting to lose it.</p><p>T+10:45 (3:30am) - My phone rings, its one of my friends that I sold some of the cid to, he doesn't seem to be speaking english, so I turn off my phone and toss it aside.</p><p>T+14:15 (7:00am) - No sleep, still tripping, and I call my mother to try to delay my father's arrival. Not happening.</p><p>T+17:15 (10:00am) - I meet my father for breakfast, eating a bluberry muffin while tripping is scary. All the nooks begin to move and breathe, its weird. My father notices I'm acting strange and asks what's wrong. 'Hungover' I say.</p><p>T+18:45 (11:30am) - I'm driving home with my pops and begin confessing my love for marijuana to him, he has never done any drug.</p><p>T+19:50 (12:35pm) - Home at last, and bed for me, I cant be out with my family, the whole world is closing in.</p><p>T+21:10 (1:55 pm) - The trip has ended and I'm fast asleep. WHAT AN EXPERIENCE I MUST SAY!</p>",
 "year": "2002",
 "id": "21224",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-12-06T08:00:00.000Z",
 "views": "6763",
 "dose": {}
}
