{
 "id": 2122,
 "title": "Nothing Prepared Me for This",
 "date": {
  "submission": "2005-06-10T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "MichaBalk",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "About a year and a half ago, I bought a small bottle of 5X extract. The store I got it from told me I would experience a small, mild trip, followed by a relaxed high, and that was just what I was looking for at the time. Stuff happened in my life, and I almost forgot about the bottle I had, until I went on holiday with my parents and my sweet little dog Robbie last September. During that holiday, one night I smoked about half the bottle in a pipe, and nothing, and I mean nothing, happened. I put the bottle and the pipe in a drawer as soon as we got home, and didn't think about it for a long time, until last week.",
  "It was Friday night, and I had just bought some cannabis. While walking my dog, I smoked about half a joint. When I got home, I groomed Robbie for a bit (his coat), and after that, I had nothing planned. My parents were out to a birthday, and I was home alone. I had remembered earlier that week that I had still got about half a bottle of Salvia. I decided to give it another go. I read some directions on the website of the store I bought the stuff from, and saw no harm in trying it on my own. What happened then, is the most terrifying experience I have ever had. I am 25 now, and have tried many a substance in my life, from cannabis to shrooms, from ecstasy to LSD, but nothing could have prepared me for this.",
  "I got my pipe and the bottle, and went to sit outside on the balcony. The website told me that the effects would be nearly instantaneous, so I decided to smoke the stuff outside (since it's my parents' house), and then move back indoors, locking the door, so I could do myself no harm. I left Robbie indoors as well, so he would not be harmed in any way either (i.e., so he could not eat some of the extract I might spill). I sat with my back to the balcony wall, facing the door. I assumed a relaxed position, and filled the pipe with one third of the amount that was still in the bottle, so a normal dosage, again, according to the website. I put some more in the pipe bowl initially, but decided to put that back in the bottle.",
  "I put the cap on the bottle, and lit my pipe, and took a deep hit, which I kept inside me for about 20 seconds. I felt nothing, so I took another deep hit, but this one was different, it was like the smoke found it's own way inside me, it was unlike smoking usually is. After that, the world went crazy. I again thought nothing had happened, until I realised I was stuck in something; I had sunk into the balcony floor and wall, and was stuck. In the distance I could see two things, on the one hand I saw my mother in the kitchen of one of our earlier houses, where we moved out of about 10 years ago. On the other hand I saw a store of some kind, which I thought I recognised, and had to go to. At that moment it hit me that I had been there for years and years, and that I could never get out of that situation even again, that I would be forced to live out eternity as part of the balcony.",
  "Then I freaked, I absolutely panicked, and I wanted to get out of there, as soon as possible. At the same time, I was afraid that if I got up, I would destroy the world, and everything in it, including my mother, and that scared and saddened me even more. So I started to fight the trip, and made my way back indoors, don't ask me how; I'm just glad I didn't fall over the edge of the balcony. I got through my parents' bedroom, walking on my head (that's how I perceived things), and reached our stairwell. I dont know how I got down the stairs, cause I never noticed I had reached the stairs, I didnt even see them, all I could see was a distorted image of reality, something beyond reality, with the image of my lighter being everywhere, the lighter I used to lit the pipe with.",
  "So I fell down the stairs, which did not hurt, at the time, by the way (have a busted up shoulder to show for it though), and landed on the wooden floor in the hall. And at that point, finally, some ordinary reality started to shine through the mess I was going through. I opened the front door, and in retrospect luckily so, there were no neighbours around, but I needed to see something alive, something I would recognize, and that would help me snap out of it. Finally I saw Robbie walking with me, and went back indoors, still completely freaked out. I wanted to shake of the after effects, but nothing seems to work, except time. I started sweating profusely, and by then notice I had hurt myself, and decided to take a could shower, but not after throwing away the pipe and the remaining extract and cleaning the balcony so nothing would be there for Robbie to eat or something. I regret throwing it away now, showed no respect for Salvia, but I guess that was the reason I freaked out so much. I should have read more about this holy plant, this super powerful plant before attempting to use it. The next time, if and when, there will be a sitter present, someone I trust blindly.",
  "Show respect! This is a zillion times more profound than ecstasy and shrooms put together, and should not be messed around with without proper preparation and care!"
 ],
 "erowid": {
  "id": "17086",
  "citation": " MichaBalk. \"Nothing Prepared Me for This: experience with Cannabis & Salvia Divonorum (ID 17086)\". Erowid.org. Jun 10, 2005. erowid.org/exp/17086",
  "substance": "Cannabis & Salvia Divonorum",
  "views": "5236"
 }
}
