{
 "id": 2124,
 "title": "Not Expressible Using Our Language",
 "date": {
  "submission": "2005-04-15T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Clockwise",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  },
  {
   "time": "3:30",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  },
  {
   "time": "4:15",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "extract",
   "specific": "Hash"
  }
 ],
 "report": [
  "Boring details of author: only tripped once before on LSD, had a month of beautiful chaos with MDA, have been jolted by 2-ct-7s secrets a handful of timesand have taken a reasonable amount of street-grade ecstacy.  19 years old, university student. ",
  "It was 4oclock and I decided that I should eat about 2mg of clonazepam (I get prescribed other pharmaceutical candy, though had unfortunately run out), thinking that I may have a quiet night in.  A friend rang me up, it was about 7.30PM and the message basically was that some acid would be coming up that night.  That was a very good thing, as acid has been nothing but scarce in my area for quite a time.  I was in an inhibited state, and thought that I did not want to experience the feeling of wanting more when in the drug statebut didnt know how strong the acid was so, we ended up having some tabs in front of us, and thought lets to 2.  And we did. ",
  "About 40-50 mins later we were smoking hash-oil in my college room.  I felt that I wanted to dance, and that I was aware of each sensory receptor in my body.  My friend returned from the bathroom, and I was confused.  I was on LSD.  It took me a while to pick up on itbecause the hallucinations and the experience came from things that I had suspected anyways.  A phone rang, and it was a friend, we call him P.  P met up with us at my friends, also very average middle class college room. We were smoking more hash-oil discussing how the universe was only what could be verbalised as everything man.. while also attempting to brutally simplify acidic conversational themes that always have a way popping up mid-sentence, paragraph or word.  P came around, and he was noticibly intoxicated by the poison, Ethanol.  But, all was good and we had another person born again with the Holy water of LSD. ",
  "So then there was three of ustripping.  Walking around the university discussing why it would be a bad idea to get caught smoking hash oil in a tree amongst other things.  Colour shifting was amazing, and I re-affirmed my love for psychedelic drugs.  I had felt like until that point, my mind had been operating in a box.  But upon taking the acid, it was though I became aware that the boxs walls didnt really exist they were not solid constructs that could not be manipulatedthey were mere curtains blowing in the wind revealing a universe of infinite conscious states.  Quite a revelation.  The experience was completely unbelievable.  ",
  "Kept smoking throughout the evening/morning, taking a backseat as I watched the ego drama unfold.  I learned a lot during the experience, when looking out or simply sitting with my eyes closedhowever, the things that I did learn are not expressible using our language.  This disheartened me for the next dayasking what the moral of the story was.  Then I realised that the revelations that I experienced were very deep and penetrated the centre of my being and that everything that I think post that night, will be effected by the thoughts I was having on the LSD, many times more than any other twelve hour portion of my life.  So, I have been permanently changed after taking the LSD, and thats a happy ending."
 ],
 "erowid": {
  "id": "17088",
  "citation": " Clockwise. \"Not Expressible Using Our Language: experience with LSD, Hash (oil) & Clonazepam (ID 17088)\". Erowid.org. Apr 15, 2005. erowid.org/exp/17088",
  "substance": "LSD, Hash (oil) & Clonazepam",
  "views": "5965"
 }
}
