{
 "title": "Head First into Blissful Insanity",
 "author": "5 Boxes",
 "citation": " 5 Boxes. \"Head First into Blissful Insanity: experience with DXM (with CPM) (ID 21257)\". Erowid.org. Feb 12, 2003. erowid.org/exp/21257",
 "substance": "DXM (with CPM)",
 "bodyweight": "140 lb",
 "report": "<p>[Erowid Note: Coricidin Cough & Cold contains chlorpheniramine maleate which can be dangerous and/or fatal at high doses. This product should not be used as a source for recreational DXM.]</p><p>It had been a long day filled with some depressing experiences I'd rather not repeat, seeing as how its pointless.</p><p>It was around 6 pm, and my father had gone to his girlfriend's for the night.</p><p>I'd done coricidin many many times before this, probably 15 or 16 over 3 or 4 months. I decided to head up to the store around 7 pm and load up. I bought 5 boxes of coricidin cough and cold. Now I realize this isn't the best form of dxm.</p><p>I came home around 7:45 and sat down at my computer and put on red hot chili peppers as I downed the first box (16 pills) and waited for the effect. Dxm takes a long time to kick in for me since I've done it so much, so around 2 to 2 and a half hours later, I began to feel the first box take its toll.</p><p>I stood up and didn't feel myself move, which I know is the first sign of its inebriation. I went around the apartment and turned off all the lights and headed back to my room.</p><p>By this time it was around 10:30pm, and I had taken the second and third boxes. (an additional 32 pills) and changed the music to Planet Caravan by Black sabbath. Roughly an hour later with this song still on repeat, it began to echo as it played. Sick of the redundance of the song, I turned it off and walked around my apartment.</p><p>I could hardly pull it off, stumbled more or less rather than walked. As I approached my living room, the tv was off, but it emitted a white light which streamed all the way into my kitchen, the more I looked at it, it split apart into the entire light spectrum. I was dazzled by this but was quickly bored by it and walked past it to sit down on the couch, I couldn't take another step or I'd fall.</p><p>After about a 15 minute break, around 11:30, I took the last 2 boxes and waited, subconsciously thinking about everything imaginable the whole time until it kicked in.</p><p>By this time it was almost 1 am, and I had stumbled down the stairs and walked outside toward the woods behind my complex. There was a drainage tunnel back there that I decided I'd walk through, about 6 x 6 feet and about a quarter mile long. I'd walked through it and back, the tunnel pulsating colors and swirling smaller and bigger as I walked, much like a spiral program. By this time I headed back up to my apt to change the music back to chili peppers and turn on the flasher program. As I closed my eyes the red light pulsed through my brain until through the light I saw the image of Christ himself standing before me holding a heart. He handed me this heart and as I touched it I felt a chill run from head to toe, and a feeling of finality, almost as if my life were finally over. But after this I felt such a rush of happiness it felt like I'd blew an eight ball in 30 seconds.</p><p>Jesus stood there still, staring at me, I thought he was waiting for me to say something, so I thanked him. At this time he faded away from me, and I knew it was an answer to my depression. By 3 am the trip had peaked and began to fade away. This whole time my mind was racing with insane thoughts which had nothing to do with anything. I began to think of how everything conceivable is an oxymoron. Even life itself, seeing as how you live to approach a death at some point. as the useless thoughts ran through, I was at a peaceful feeling of which I felt I could finally destroy depression in its tracks. And proceeded to repeat this to myself for a sense of confidence.</p><p>By 6 am the trip had finally subsided.. and I was still left with the feeling of finality Jesus had left me with. I kept this in mind was I went to bed, knowing things would be fine.</p>",
 "year": "2002",
 "id": "21257",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-12T08:00:00.000Z",
 "views": "20321",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "480 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "64 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 1:20",
   "amount": "480 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 1:20",
   "amount": "64 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  },
  "4": {
   "time": " T+ 2:45",
   "amount": "480 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  "5": {
   "time": " T+ 2:45",
   "amount": "64 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  },
  "6": {
   "time": " T+ 3:45",
   "amount": "480 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  "7": {
   "time": " T+ 3:45",
   "amount": "64 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  },
  "8": {
   "time": " T+ 3:45",
   "amount": "480 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  "9": {
   "time": " T+ 3:45",
   "amount": "64 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  }
 }
}
