{
 "title": "It Tickled",
 "author": "Ryan",
 "citation": " Ryan. \"It Tickled: experience with Catnip (ID 21309)\". Erowid.org. Feb 13, 2003. erowid.org/exp/21309",
 "substance": "Catnip",
 "bodyweight": "170 lb",
 "report": "<p>Mine is a fairly normal story for legal drugs; I read about using catnip to get high on the internet, and decided to try it for myself.  That was about a year ago, when I was pretty depressed and going through counseling (which was worthless).  Helped a little, and I managed to keep myself down to a couple joints of catnip every month or so, until I no longer felt like I needed a lift every now and then.</p><p>Fast forward to February, 2003, the time of this writing.  My teeth are in horrible shape so I need an upper jaw spreader thing to make room to straighten them (and hurts like crazy), I've been diagnosed with an active mono infection (probably had it for months), my back hurts constantly (has for as long as I can remember; it's apparently something I'll 'grow out of' eventually), I've been having panic attacks, and am on an SSRI (Zoloft) for that, as well as Clarinex to keep my face and hands from swelling up like a Human balloon.</p><p>Between all that, and some relationship difficulties (thankfully, mostly straightened out by now), I figured it was time to start up with the catnip again.</p><p>I smoked a little, and experienced the usual soothing, peaceful feeling of well-being (it also dulled the pain in my teeth and back, killed my stomach cramps, and made me less hungry, which was a _real_ plus, since my teeth have been killing me enough that I've been living on milk, milkshakes, breakfast drinks, multivitamins, and painkillers for the past few days).</p><p>Problem, though, was the parents being home a lot of the times I felt like smoking.  My throat was also starting to really bug me (probably the mono).  I didn't have enough of the stuff left to 'waste' it by making tea, and that was kind of a lengthy process anyway, so I decided 'why not snort the stuff?'</p><p>I took a little, put it in the middle of a piece of paper, and crushed it all up by folding and squeezing it in the paper.  I picked out the bits of catnip that weren't reduced to powder, and took it into the bathroom with me (I was about to take a shower).  I had read a bit about using snuff and other such things, and prepared myself for the worst as I snorted a pinch up my right nostril.</p><p>Didn't burn at all.  Tickled a bit, actually, and didn't even make me feel like sneezing.  I felt the effects after about 3 seconds (if that); I was a bit more alert--almost giddy, actually.  I snorted the rest (about 3 more pinches), took my shower, dried off, and crumbled up some more, probably about 8 pinches worth.</p><p>After snorting all that, my sinuses felt a little dry and uncomfortable, and I could feel some of the stuff dripping down the back of my throat, but, as far as I could tell, the effects for me were comparable to smoking it, except that the feelings of tranquility and peacefullness were a bit less evident, the sensation of 'coolness' was in my sinuses instead of in my chest, and I seemed to be much more alert than I was before.  I also had the constant urge to sneeze, which I managed to suppress.  Duration was no different, though--about an hour or two.</p><p>It also smells _considerably_ better; catnip smoke tastes and smells, to me, like a combination of a freshly-mown lawn and burning rubber.  Not as unpleasant as it sounds, and I actually almost like it, but it's not something that I'd want to experience constantly.  Insufflated catnip, on the other hand, just smells minty--that's it.</p><p>If you've already tried catnip and liked it, but are looking for something faster than making tea and less conspicuous than smoking, I'd say to go for snorting it.  It probably won't completely replace smoking for me, but it's something different to try.</p>",
 "year": "2003",
 "id": "21309",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-13T08:00:00.000Z",
 "views": "55039",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "insufflated",
   "substance": "Catnip",
   "form": "(plant material)"
  }
 }
}
