{
 "title": "I Can See Why It Is So Addictive",
 "author": "ILLadvised",
 "citation": " ILLadvised. \"I Can See Why It Is So Addictive: experience with Hydromorphone (ID 21315)\". Erowid.org. Feb 14, 2003. erowid.org/exp/21315",
 "substance": "Hydromorphone",
 "bodyweight": "187 lb",
 "report": [
  "<p>I noticed you did not have any experiences on hydromorphone, and since this is the first time I have done this particular drug, I would submit a report.",
  "I obtained a 4mg pill of hydromorphone from an undisclosed location, and chopped it up into a fine powder.",
  "I snorted 2mg of the substance. No burn.",
  "I wait 10 min.. And feel I am breathing slower.. And my hands are clammy and there is a sense of being wanted, and I just nod and take in everything around me as being good.",
  "I tell people exactly what I am thinking, and am generally pleased so far.  So I decide to insufflate the last 2mg.",
  "I am in a NOD now.. It feels so good to sit and enjoy the moment, it is not close to oxycontin feelings or hydrocodone, I would relate this high to heroin, to the best of my knowledge, and everything is A ok in my book.",
  "This high is incredible, and I am slightly itching my arms, and the back of my kneecaps itch a little bit.",
  "Ive noticed there is a large amount of clamminess feeling to this drug, I prefer an oxycontin high to this, I'm more stimulated on that and europhic beyond pleasure.. This is bliss indeed, but in a whole different way.",
  "I would recommend any opiate lover to try this once, or twice. But I can see strong reason why it is so addictive.</p>"
 ],
 "year": "2003",
 "id": "21315",
 "gender": "Male",
 "views": "73152",
 "dose": [
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "insufflated",
   "substance": "Hydromorphone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:10",
   "amount": "2.0 mg",
   "administration": "insufflated",
   "substance": "Hydromorphone",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2003-02-14T08:00:00.000Z"
}
