{
 "title": "Try two!",
 "author": "ezek",
 "citation": " ezek. \"Try two!: experience with Nitrous Oxide (ID 21321)\". Erowid.org. Feb 14, 2003. erowid.org/exp/21321",
 "substance": "Nitrous Oxide",
 "bodyweight": "75 kg",
 "report": [
  "<p>alright, so I read about whippets on the internet, heard about the stuff from friends they get at the dentist. I had been wanting to buy some for quite a while, but it took me a while to find a place that sells them, anyway I found one, AU$4.60 for a box of 10 (~US$2.20).",
  "I made myself a nice little cracker from copper pipe fittings with a screw in the bottom to pierce the cartridge. At first I would just inhale a single cartridge, and that would be it, it was a nice buzz, everything looked and sounded weird, then I discovered more. Two cardridges at a time would just blow my mind, I would have 2 balloons, inhale one, breathe out, inhale the other. In a few seconds I would be totally out of it, then 'wake up' about 30 seconds later and think 'holy shit, that rocked' and reach towards the box for another 2.",
  "Just after inhaling the second balloon, I hold my breath, then slowly exhale, things slowly get weird, hearing 'helicopters' and vision gets all fuzzy like, thats the last thing I can remember. The high lasts about 30 seconds, when the effects slowly fade away and you return to reality.",
  "What happens in those 30 seconds I have no idea, it's so fucking weird not remembering anything and suddenly realising where I am and what the fuck just happened, usually sitting/lieing in a different position to what I can remember (like I'd be sitting on the couch, then I'd wake up lying sideways as if i've lay down). My friends have told me that after inhaling I just lose it, start hyperventilating and talking random shit.",
  "If you're wondering why I don't have more than 2, it's because after cracking 2, I'm too bombed out to crack the third and usually end up wasting it because I forget what the hell I was doing. ie. not putting the balloon on the cracker, letting the balloon go with the gas in it. I've had mates crack them for me, but I think two is the optimal experience without wasting.",
  "another thing which I've also noticed is after doing nitrous I have an unusual craving for a cigarette (which also taste almost like cherry (sort of) after nitrous!)",
  "peace - hope someone reads this and gets something out of it!</p>"
 ],
 "year": "2003",
 "id": "21321",
 "gender": "Male",
 "views": "7636",
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "submissionDate": "2003-02-14T08:00:00.000Z"
}
