{
 "title": "Wellbeing, Ruined My Sleep",
 "author": "Lance",
 "citation": " Lance. \"Wellbeing, Ruined My Sleep: experience with Selegiline (ID 21341)\". Erowid.org. Nov 29, 2005. erowid.org/exp/21341",
 "substance": "Selegiline",
 "bodyweight": "83 kg",
 "report": "<p>I'd like to write a bit on selegiline (deprenyl). I'm a 26 year old 83 kg male from Istanbul. Sorry for my (probably) bad English.</p><p>I've been using the brand name drug SELDEPAR for about 3 weeks.  I've been taking about 2.5 mg every day. Some days I took 5 mg, some days none. From time to time I use mdma (twice a month at most, usually less), alcohol (once-twice a week) and weed (very very rare). I've tried some other otc drugs but gave up for they surely don't make any good highs. I smoke.</p><p>Just yesterday and today I've came to realise that somehow some remarkable changes had happened in me. Please note that my opinions on these changes these are just yet SUBJECTIVE i.e., if I'm saying 'I'm smarter', I might be WRONG. A similar thing happened once on mdma: I though I talked to my friend's dog. Yes I did. I mean, I still don't know if I really did; but,... anyway, you got my point :) Feeling 'heyy, I'm smarter!!' and being actually smarter is different.</p><p>Since the beginning of my usage -sharply inclined since the last 2 rolls- inceasingly I've been thinking faster (real) and more reasonable. I can connect the reasons and conclusions more easily. I can understand people better. I'm more energetic. Positive. Think more clearly. Do maths better (real). Better recalling and remembering (real). Increase in rational, reasonable, very controllable temper (real and unlike the ephedrine caused temper). All senses seem to be a little sharpened. And on the overall, a sense of well being is all over. No, it's not like being on mdma. I can say it is still quite a 'high' especially after I eat a piece of chocolate, consume coffee or tea; at most maybe 30 % of mdmas efficiency. The inner strength and the sense of peace mdma provides is present all the time at a very satifactory level. Now, I'm listening to a beautiful music and you can't imagine how smooth and soft, yet powerful the melody is.</p><p>Here are some events I find remarkable during the day in timely order.</p><p>- 7:00 am had breakfast. It's been about 17 hours since last I had a sleep of 3.5 hours.</p><p>- 11:00 am ingested a whole 5 mgs pill.</p><p>- 2:00 pm I got out and on the street and realised how fast I was walking and, slowed down. The people are ssooo ssslooooowww!</p><p>- 7:00 pm I realised I did not eat anything since the morning. I did not have any appetite but I forced myself to eat. I did not thirst much either.</p><p>- At about 10:00 pm I realised my heart was beating somewhat unusually. Counted the pulse several times during the day while resting and found that it varies btwn 80-105 (normal?)</p><p>- At 10:30 pm still no sleep. Consumed alcohol to get to sleep (always works).</p><p>- At 2:30 woke up. Wrote these lines. Just realised the sizzling pain in my toe (hit badly to the corner of the couch the other day) is no more present.</p><p>- 8:00 am apetite, ate food.</p><p>- 10:00 am, still no sleep.</p><p>- Also sometimes I think I felt a very subtle 'zzzzz'ing in my head and ears. Low-premium highs seem to be after eating sweet, chocolate, ordinary food, coffee, tea.</p><p>Note: I've been giving the medicine to my 55 yr old father for two weeks about 5 mgs a day and he says he didn't realise any changes in himself but maybe a loss in the alcohol craving (he might need more time on the medicine to get something).</p><p>Conclusion and further discussions:</p><p>I do not mean to use deprenyl to consume it as a 'high' but as a lifestyle drug which can be consumed during lifetime. We read its positive results. It's probably a 'high' in the sense that it facilitates well being (maybe a little more than that). But, I'm sure there must be some hazards in its uncontrolled usage. First of all, maybe it switches off the body's pain and appetite mechanisms. Also remaining in this good mood for extended periods can not be without its price in the brain (right?).</p><p>I continue to wonder:</p><p>- As a lifestyle drug, what can be the ideal minimum recommended usage dosage by age groups?</p><p>- Any heart/circulatory system damage potential?</p><p>- Any damage potential to the neural connections? Ive heard too much and extended stimulation (as by mdma) causes residual damage.</p><p>- Specific drug interactions? (There's a lot of information on MAOI's but not specifically for selegiline) For example can one use zyban with it? Combinations with anti-depressants?</p><p>- Any negative results after extended use? (the drug becomes unwantedly emphatogen? hallucinergig?)</p><p>- Withdrawal symptoms? Bottomless depression pit aftewards?</p><p>This medicine has a lot of potential, though I might not recommend younger people like me to use it (at least unless the dosage is known). To conclude, I can say that I think I will not continue using it unless I find further satisfactory information on the drug on the above issues (it also ruined my sleep!) But maybe I might try some minimal doses like 1 mg/day. I don't know.</p><p>Ah, no more for my father either.</p><p>Thanks for the patience.</p><p>Lance</p>",
 "year": "2003",
 "id": "21341",
 "gender": "Male",
 "timestamp": "2005-11-29T08:00:00.000Z",
 "views": "32165",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Selegeline",
   "form": "(daily)"
  }
 ]
}
