{
 "title": "Slowed Down Enough to Feel",
 "author": "suki",
 "citation": " suki. \"Slowed Down Enough to Feel: experience with AMT (ID 21351)\". Erowid.org. Dec 22, 2003. erowid.org/exp/21351",
 "substance": "AMT",
 "bodyweight": "",
 "report": "<p>7:45pm</p><p>@80-100mg?</p><p>T-9:00pm</p><p>By this time I knew I was going to trip. I had waited almost a week</p><p>since my last failed attempt, and I also had only eaten one very small</p><p>meal earlier in the day, that was it. Around this time I decided to take</p><p>my usual pre-trip bath and relax myself a bit. I noticed myself zoning out</p><p>a bit and getting caught up in the reflections of the water on the bathtub.</p><p>As soon as I stood up to get out of the bath, I knew I had to vomit. This</p><p>actually was a good thing, a sure indicator that the trip was coming on.</p><p>I still really detest throwing up and was hoping it would be over soon, and</p><p>it was.</p><p>T-10:00pm?</p><p>Once the trip began I lost track of time. The rest that follows is really in no particular order, everything happening all at once and mainly during</p><p>the peak, which came about four hours after dosing.</p><p>For me, one word can describe my peak on amt...ecstasy. Not sexual...-sensual-....senses enhanced to the point of... pure fucking bliss. First thing I noticed was my eyes. My pupils were so enlarged that</p><p>any amount of light was making them tear profusively. I have white</p><p>christmas lights in my room by my window, which I had to turn off.</p><p>I even had to shut off my computer monitor, darkness with only the moonlight pouring in was the most comfortable. I also experienced a weird heat/cold situation going on...where I would be very warm but cold in my body throughout the trip, almost like having a fever and getting the chills</p><p>not uncomfortable, just noticable. I remember lying on my bed as it was</p><p>coming on and realizing right away that my mental capacities were still in</p><p>check...this continued through out the trip. Very strange, to be extremely</p><p>altered...yet have a part of me that was very lucid observing it all from</p><p>a safe distance.</p><p>This is where amt greatly differs from lsd to me at least lsd can greatly alter my mental capacities whereas amt did not alter it that much. I Practiced talking out loud and found that my speech was not altered</p><p>and I could pretty much carry on normally if I had to (which later proved to be a good thing). Yet...if I let myself relax and fall into it, I was very much in tune to another part of myself that was very instinctual...</p><p>natural, almost animalistic. This came about when the waves of pure electricity and...euphoria was undulating throughout my body. I remember</p><p>thinking to myself 'I forgot how to trip','am I doing this right?'...and my lucid 'self' was actually commenting and guiding me. 'you need to slooooow down...', 'go very slow in your movements, do not try to think</p><p>or rationalize this experience, just -be- the experience, don't worry</p><p>about anything, all is exactly how it should be'. My balance was very</p><p>off as everything was moving...I did not get many 'colorful' visuals and</p><p>almost no cev's but with my eyes open things were morphing a bit.</p><p>I could stand straight and see the walls and room tilting and breathing and swaying a few times I almost toppled over from just standing straight. The</p><p>ecstasy came about when I realized that my entire body, my entire being</p><p>felt like I was a single strand of hair...feeling the energy from the</p><p>root pulse through me....or....one single string on a guitar being</p><p>plucked, and vibrating deliciously. I peeled off my clothes like a snake</p><p>shedding skin, everything in slow motion as if I was an astronaut on the moon with no gravity...and as soon as the air hit my body goose bumps erected themselves all over...the air and atmosphere around me felt tangible as if I was swimming in some kind of translucent, electric, warm,</p><p>fluid.</p><p>At one point I ended up on the floor, writhing and moving my</p><p>body as if I was a snake sliding its way on the desert sand...I found</p><p>myself moaning 'uhhhhhhh' 'uhhhhhh'...heheh...i mean, if someone saw me,</p><p>god forbid...I was indulging in myself and the human body and all that it</p><p>is capable of feeling when one is allowed to actually slow down enough</p><p>to feel the full capacity of having skin, and the pleasure of just</p><p>exhaling breath, or the erotic feel of swallowing cold water, the</p><p>friction of carpet rubbing on skin, my warm sweaty palms carrassing my face</p><p>and body...I've never taken mdma, but...if this is anything what it is</p><p>like, I can see what all the fuss is about. I had to keep walking to</p><p>the bathroom to fill up my water, which was the only thing that interrupted</p><p>my flow...knowing I had to keep hydrated. It took me at least 15 minutes to walk the short distance from my room to the bathroom. I was taking very small steps...each movement bringing waves upon waves of heaven...i would open my eyes halfway and see translucent swirling energy, as if the very air itself were alive and filled with (?).</p><p>There was absolutely no fear, no anxiety, no paranoia. At all. everything was calm, and peaceful...i felt very empathetic and happy in a way that I have rarely experienced before. I did notice mild jaw clenching as well, nothing alarming though.</p><p>So all of this was happening and then my phone rang :/ It was my neighbor who was kicked out of his house and wanted to stop over to make a few calls</p><p>and figure out where he was going to go for the night. Earlier I had managed to turn on my tape recorder, and If I had to guess, I think I</p><p>recorded most of the trip, I listened to some of it, and it is pretty funny. It starts with the moaning episode, hehe...and then you can hear the</p><p>phone ring, and me answering...and talking with him. I think it recorded</p><p>the rest of the night as well, but I haven't listened to all of it.</p><p>Anyway..I was -this close- to telling him i was on something, but</p><p>my lucid self said that wouldn't be a good idea...so I mangaged to tell him that I had been drinking, that I was pretty out of it, was having trouble</p><p>walking, that the house was all dark because my eyes hurt etc. etc.</p><p>I didn't want to turn on any lights because I knew my eyes were really</p><p>fuxored.</p><p>So he came over and was a bit alarmed...even though I know I was confusing him because I was talking -completely normal- I certainly wasn't acting normal. He noticed when he came in that I was drinking water...and asked what I had gotten drunk on (seeing that there was no alcohol out etc.) I opened up the hall closet and showed him the hard liquor on the top shelf and mumbled something about trying a little bit of everything. This alarmed him even more and he was like 'you drank all of this, are you okay?' I was like, 'yeah, can't you tell obviously if I was really messed up I wouldn't be able to talk' which he agreed with, thank goodness.</p><p>We then went up in my room and he started making phone calls. I wasn't really freaked out by his presence just really annoyed, because I was having such a good time and now I had to try and act normal and listen to his problems, which normally I wouldn't mind, but I was peaking on amt at 11:45pm and obviously did not want to focus all my energy on his negativity. I could tell he was annoyed that I wasn't paying attention to him and that I wasn't offering to let him stay. I finally layed down on my bed and said that I was going to go to sleep, so he got the hint and said he would leave in a very snotty kind of way. Before he left he went on this</p><p>tirade of telling me about my front tires on my car and how they are 'bald' and that I need to get new ones, and that they could pop and give me a flat tire and all of this negative, worrisome stuff. I was like, 'okay okay i'll take care of it monday, okay'...it was really the last thing I wanted to think and focus on at that moment, fucking tires.</p><p>So he finally left and I could tell that my beloved peak was coming to an end. I managed to go online at this point and check out #dxm and see if any of my favorite tards were online, which they weren't. I was sad because I really wanted to share my excitement and experience with someone (most of the guys in #dxm are experienced psychonauts with a lot of chemicals, and almost all have tried amt).  But unfortunetly no one was there that I cared to talk to. I then crawled into my bed under the warm, delicious covers and squirmed around a bit enjoying the last waves of amt bliss before settling in to a light and relaxing slumber.</p><p>I woke up around 8:00am and felt really good, tired, but not exhausted like</p><p>after a dxm trip. I had a slight headache and felt like I had drank the night before due to the mild dehydration feel. I took another bath, put some visine in my still dilated (but not too bad) eyes and was able to talk and hang out with my mom who had come home around 1:00am last night/morning. We then proceeded to watch a vh1 show on Michael Jackson, which was highly disturbing, heh.</p><p>My main concern about amt was the length, thinking that I wouldn't be able to  handle 'tripping' for that long..but to be honest...I didn't want it to end :D Will I be indulging in this experience again? I think the answer is pretty clear :)</p>",
 "year": "2003",
 "id": "21351",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-12-22T08:00:00.000Z",
 "views": "21905",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "90 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  }
 }
}
