{
 "title": "Gentle Elephant",
 "author": "plantshaman",
 "citation": " plantshaman. \"Gentle Elephant: experience with Anadenanthera colubrina (extract) & Salvia divinorum (ID 21374)\". Erowid.org. Oct 5, 2005. erowid.org/exp/21374",
 "substance": "Anadenanthera colubrina (extract) & Salvia divinorum",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "5 seeds",
  "smoked",
  "Anadenanthera colubrina",
  "(extract)",
  "",
  "1 hit",
  "smoked",
  "Salvia divinorum",
  "(dried)"
 ],
 "report": "<p>Preparation...I soaked 54 anadenanthera seeds in rubbing alcohol for three weeks and put through a coffee filter. I washed the remaining plant material with clean alcohol to bring out any of the left over goodies. I put the alcohol in a pan and evaporated till it was a brownish goo.</p><p>Set and setting... My mind set was good. I have experimented a few other times with smoking the straight seed. So I had a good idea what to expect. I was home alone in my room.</p><p>1st try...I used a razor and collected roughly 1/10 of the goo on the blade. I smeared the goo onto a screen. I took two big hits out of a small glass bong and held them in. Effects were felt in moments. The experience was very mild. There was a pressure in my head which was a bit like an elephant sitting on it. The mild effect didn't last very long.</p><p>I decided this extract was not too strong and had an idea of how much to use. I had a few salvia leaves sitting on my table. I thought I would try smearing some on a bowl of leaves. I did just that. With the anadenanthera already in me I was able to take a monster hit. I laid back and in moments I found that salvia dimension opening up all around me.</p><p>t+30 seconds In a few moments I was having a strong salvia experience. The salvia overpowered the anadenanthera and for a while I had forgot I smoked it. I attempted to become the wall in my living room as I have done in past trips and discovered I couldn't use my third eye. It was like salvia was in control of it and any attempt to visualize stuff was useless.</p><p>t+ 5 min Aside from the inability to use the third eye the salvia experience was average. As the salvia effects slowly went away I could feel the anadenanthera. My head and body felt heavy. I felt very sick to my belly. I noticed a little uneasy belly with anadenanthera before. this was much worse. I laid there till I fell asleep with a miserable feeling of being sick. There was that pressure in the head and heavy body sensation. No heightened thoughts or any visionary stuff. Seems worthless at this level.</p><p>I think the extract is a bit weak. I have tried as much as double since this experience. Still it was weak and probably less powerful then 4 smoked seeds. I have not experienced neausea again. I don't know if it was from the combination or maybe I just was dehydrated and or hungry? Not sure.</p>",
 "year": "2003",
 "id": "21374",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2005-10-05T07:00:00.000Z",
 "views": "9565",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5 seeds",
   "administration": "smoked",
   "substance": "Anadenanthera colubrina",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 }
}
