{
 "title": "On the Brink of Insanity",
 "author": "Trip Daddy",
 "citation": " Trip Daddy. \"On the Brink of Insanity: experience with H.B. Woodrose (ID 21381)\". Erowid.org. Feb 16, 2003. erowid.org/exp/21381",
 "substance": "H.B. Woodrose",
 "bodyweight": "260 lb",
 "header": [
  "DOSE:",
  "8 seeds",
  "oral",
  "H.B. Woodrose"
 ],
 "report": "<p>I went to a friends house and told him about them and we both agreed to take some.  I took eight of them and he took five. We dosed at around 8:00pm  We sat back and smoked a joint waiting for the effects.</p><p>At about 10:00pm I had noticed I was still high and I knew it couldnt be from the joint of that dirt weed. I thought that was probably all it was going to be is a nice high. I was very mistaken! It just kept getting better and more intense. about 10:45 I started seeing slight peripheral tracers. I had no nausea whatsoever but my friend was running to the toilet to puke right about now.</p><p>It started getting real intense just like good acid. 11:30 My friends girlfriend started fighting with him because he was acting so stupid. This sent me right into a bad trip. He left to go in the other room and started fighting with her. I started to feel so alone like there wasnt anyone else in the universe.</p><p>11:45 I'm still alone and I'm starting to trip pretty hard. I thought I had taken too much and I was dying or causing permanant brain damage. I started having a panic atta ck and asked them to take me to the E.R. But they said that they would probably put me in a psych ward or something. That sent me even deeper into panic. I convinced them to at least take me home. 1:00am The ride home was a collage of colors and shapes It was very beautiful.</p><p>1:25am I walk in the door of my house and climb upstairs to get a bath and try and calm down. My bathtub was changing shapes and the spickets seemed to turn into devil horns and It looke like the water was bubbling all around me. Fearful that I was burning mysel inadvertantly I jumped out and dried off and went downstairs.</p><p>By now it was about 1:50am and I started calming down and learned to enjoy the buzz. Everything felt so good and looked so wild. It was like the best acid I ever had!! I continued tripping until about 7:00am when I lost all of my visuals. all and all I kinda liked it I just wish I hadnt flipped out like I did and ruin my best friends trip. It was a very self revealing and spiritual thing. Will I try them again. Hell yes!! But this time not so many. I underestimated it because I thought it really wouldnt work anywhere neer that good. Just be safe if you decide to try these because they are a very powerful psychadelic. They have definitely earned my respect.</p>",
 "year": "2003",
 "id": "21381",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-16T08:00:00.000Z",
 "views": "15937",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 }
}
