{
 "title": "Switching Realities",
 "author": "Anonymous",
 "citation": " Anonymous. \"Switching Realities: experience with Salvia divinorum (ID 2139)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2139",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "report": "<p>This was my first time, and I guess I was lucky, because it was amazing. I was a bit chicken, after reading some reports of it being more powerful than 5 grams of mushrooms and that sort of thing, so for my first time I only used about half of a bowl. I prepared a bed, lined with about 10 pillows, so I was definitely comfortable. I had no lights on, and had Peter Gabriel's Passion Sources album playing softly.</p><p>I first took a small hit, and then a large one which I held for a long time. The first thing to happen was for my vision (I could still see a little, from a small digital clock in the room) to just spin out of control, into a tunnel. I got a bit nervous, reaching for the light. With the light on, I felt a little strange, but no visual activity, so I mustered up some courage, shut off the music and shut it back out. I layed back and relaxed.</p><p>What happened was wonderful. At first I kept switching realities. This is something that has been happening to me at random lately, even when not on anything, but not like this. Usually I just feel like I was just somewhere else, and I have a thought in my head that I FEEL has something to do with where I just was. (I know that sounds strange) But I very rarely get even a whole distinct thought. Well with the salvia, I was completly somewhere and someone else. I lived a complete life, had a complete memory of this life, and was was just putting something on a shelf when I snapped back here to who I am. This sort of thing happened about three times. In one of them, the only thing I was aware of was that someone had just let out a blood curdling scream. I was back here instantly, although I was scared that someone in my house had just heard that scream, but luckly it wasn't me screaming.</p><p>After this I just enjoyed some morphing color patches. They were not very bright, but very beautiful. Then the plant starting to talk with me. It was definatly female. I felt as if my mother was holding me as an infant, but unlike my mother- - This was somehow more comforting. I felt better than I have ever felt in a trip. I felt more comfortable than with opium if you can believe it. I talked with the plant for about a half an hour. The effects wore off, and I just layed there astonished for about 2 hours. I just sat up and started typing at 3am.</p><p>Greatest plant experience of my life. The plant was very intelligent, Some of the things discussed were intensely personal, and some were the plant's own feelings, which is something I have never experienced. I am sorry I am so blunt about just bluting this thing out, without all that much explanation or analysis, but I am just blown away.</p>",
 "year": "",
 "id": "2139",
 "gender": "Not Specified",
 "timestamp": "2000-06-26T07:00:00.000Z",
 "views": "168105",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 }
}
