{
 "title": "Paranoid, I Know I Am",
 "author": "Tren",
 "citation": " Tren. \"Paranoid, I Know I Am: experience with 5-MeO-DiPT & Cannabis (ID 21398)\". Erowid.org. Jul 8, 2004. erowid.org/exp/21398",
 "substance": "5-MeO-DiPT & Cannabis",
 "bodyweight": "175 lb",
 "report": "<p>I was looking forward to this experience, I'd had foxy twice before (in smaller doses) and enjoyed it a lot. I was with a group of 7 friends on a holiday, living at a beach house, the town we were in was virtually deserted and had a very relaxed environment. At 8am we were woken up and had a small amount of breakfast than a couple of large lines each.</p><p>The initial pain is not too bad, the drip of foxy down your throat for the next 15-20 minutes is disgusting, nothing can remove that taste. We all tried to eat marshmellows to disguise the taste, it doesnt work. The best thing we can do is to drink water and lie down until it passes.</p><p>The previous day we'd had about 4 gms of mushrooms, I dont think any of our brains had recovered fully from this trip. After about 25 minutes of lying about moaning, we joked about how the foxy was probably poison because the bad feeling wasn't wearing off. I took a shower, then made myself vomit because I was feeling pretty bad. It made me feel a lot better and soon after I began to get visuals.</p><p>I went inside, since darker places are much better places for visuals for me. The flowers on the seat cover grew and shrunk and looked like they were blowing in the wind. I found some record covers that kept myself entertained and called my friends inside. A forest fire on one cover could be made into burning skulls. A picturesque landscape became so 3-D every aspect of it seemed alive. This was a good trip so far, I wanted it to get better. We had about half an ounce of good weed sitting outside for whenever anyone felt like it. I took a hit, and a minute after recommended it to my friend.</p><p>About 10 minutes later things started to take a turn for the worse. I started to hear a buzzing sort of sound in my ears, a little like radio static when you haven't go the right station. I'd heard this sound once before, just before I convulsed when I was in Amsterdam (off to many mushrooms and weed). This freaked me out, I kept telling myself to stay with it, dont get locked into my thoughts or I would definitely start looping in my head and it would spiral out of control.</p><p>I kept trying to stay with reality but I couldn't, my paranoia was getting worse, everyone turned away as soon as I looked at them, they had a grin on their face as though they were laughing at me. Then the looping started. It is like when you get deja vu, except you maintain that feeling for an hour or so. I wasn't sure if everything I was seeing was from a dream I'd had recently or if I'd really been to this place before. Elvis was playing on the record player on loop (this didn't help either), and most my friends were just lying around not doing much or saying much. Occaisonally a series of conversations would break out, they didnt seem to have a start or end and then it would all abruptly stop. I kept pacing now and then trying to keep it together.</p><p>Then after thinking for what felt like an eternity, I had it. I had worked out the meaning of life. This was a very, very bad thing. All these people around me had been put here to try and direct or hinder me from this meaning, they were not real. God told me (this is who my brain told me was the other voice in my head) that once you work out the meaning, there is no point living because that is what the point of living was in the first place. I disputed it heavily with myself -</p><p>How could so much be going on around me in the world and it had no relevance, what a waste! I went to talk to one of my best friends (I was unsure whether he was really my friend at this point). I told him I was having dejavu continually and he laughed and said he had the same. This made me even more paranoid. I then thought, if I tell anyone about what I have discovered they will just call me paranoid. God told me 'paranoid is the real name we give to people who know too much'. I went inside, there was still foxy on the table, the elvis song teddybear was up to the point 'It's now or never' - I thought it was telling me it's now or never to go the full-distance take all the rest of the foxy. I didn't want my life to end here, I walked/ran from the house to the beach.</p><p>One of my sober friends found me down there about 40 minutes later. I had been rolling with my shirt off around in the seaweed talking to myself and was running around in the shallow water. He took me home and things calmed down a little. There is so much more to tell but it would only make sense to me. It took me a few days to start believing in reality again.</p><p>I believe the smoking triggered the paranoia, it has done similar things to me before on a comedown from E. I personally will never smoke after E or during foxy again.</p>",
 "year": "2002",
 "id": "21398",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-08T07:00:00.000Z",
 "views": "10283",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "35 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
