{
 "title": "Never Thought It Would Work",
 "author": "NoName",
 "citation": " NoName. \"Never Thought It Would Work: experience with Morning Glory (ID 21402)\". Erowid.org. Sep 16, 2007. erowid.org/exp/21402",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "report": "<p>I have never ever done drugs in my life, and I am a fairly good kid. I honestly have tried weed once, without much success, but that is about it. Being into Pink Floyd and all that great Classic Rock, my friend and I decided to try Morning Glory as I have heard music sounds so great when you are high. We read up on it on the Internet, and decided to use the 'Stoner's Method'. We washed the seeds and tried to grind them, but they wouldn't break. So the chewing began. After awhile, the taste started to give me the shakes. We kept drinking kool-aid to help get rid of the flavor. After about 1/2 or more of the 8 packets, I decided that was good for now.</p><p>I started to feel so sick, really, really fluish. After lying aorund for a little bit, I started to feel better. Nothing seemed to being happening, and we were kind of upset that we wasted somewhere around $20 for 16 packets. I defenitly had eaten alot more than my friend had, and she was still rolling around about to throw up. Soon, my stomach felt alot better and I was moving all around. Everything felt so much softer and I couldn't stand still. I kept grinding and pushing my hands together and rubbing everything in sight. It was weird, it just felt right. I kept making this really weird face, like I was going to scream of happiness. It felt so good to strech out my face and I could not stop smiling. My friend was the same way, but still really queezy.</p><p>After both of us continued to roll around on the floor, and make funny calls to our friends, it started to hit me more. We decided to turn on the black light. This is where it all really started for me. It was so creepy, but really cool at the same time. Suddenly, I just started sobbing. I had no idea why. I was trying to smile, but the tears kept falling. So we turned on the regular lights, and I didn't know where I was. We then proceeded to do this process over and over, then we just left the black lights on. I was definetly getting 'higher and higher' and this point. I felt lifted on a solid rock and just sat there. I was so scared to leave the room. It felt like the room was where I was my entire life, like I didn't know anything else. I was terrified to walk out. I was so comfortable with the lights and the coziness of the room. Everytime I turned to different parts of the room, it looked diffrent. A few times, I started to feel clausterphobic.</p><p>Amoungst the fear of forgeting what it was like to feel normal, I started to realy enjoy this other world I was in. We turned up the pink floyd and it was insane. The music was like the narration for what was happening to me. I started crying again because the lyrics were right on. The morning glory made me so emotional it was crazy. Time was all messed up as well. It was going SO SLOW. Wow, what an experience.</p><p>My other friend, who realized this was happening, came to pick me up and drive me home. I'm SO GLAD she came because I would have crashed the car, I could barely see straight or control my movements. It was 11:30pm, and we had started to consume the seeds around 8pm. By this point I was having trouble walking and almost fell over a few times. I couldn't really see things right. I went outside to meet her, and the car ride is really hard to remember. I just closed my eyes and felt like I was flying through space. Wow, what a feeling. The car was floating, and so was I still.</p><p>I got home, unfortunetly to meet my parents. My face at this point was swelling like a balloon, and my eyes were puffy and started to become dialated. My friend, who drove me home, tried to cover for me. My parents were pretty obilvious. I was so quiet, but when I talked I was yelling without knowing it. My ears felt clogged and my nose did too. Everywhere I looked, things were dragged out, and I started to almost hallucinate. My face was swollen pretty bad now, and all I wanted to do was SLEEP, and throw up. By this point, I was going numb, and I could feel my insides, but they weren't really attached to the rest of me. I needed to vomit so bad, but I couldn't.</p><p>Out of fear, my friend helped tell my parents. She soon left, and I was stuck, so high, with my parents. What seemed like hour after hour, I sat by the toliet and stuck my finger down my throat, and threw up around 7 times to get the stuff out of my stomach. My eyes had a green tint, and were bloodshot as well. My mom gave me anti toxiant stuff to get it out of my blood faster. I was crying SO HARD becuase I thought I was going to die, I'm not kidding. I wanted to sleep so bad but I felt like if I did, I would never wake up. My dad kept telling me that I was just coming down and I'm not gonna die. I had to finish throwing up, however, before I went to sleep. I would have passed out right away, but I forced myself with all I had to stay awake. Now, after throwing up a bunch of times, I really started to hallucinate. It was friggin crazy. Barely able to stand up, I went to bed, my mom with me during all of this, and I layed there.</p><p>Everyhitng had a film of pattern over it, almost like tie-die. I have to admit it was so neat. When I talked, the film would vibrate to the tone of my voice. Everyitng was moving, and everyhting looked like surrealism. All I wanted to do was draaw everthing. My body felt like shapes, so I could draw exactly how I felt. I kept singing songs in my head, and I could really hear the song. Noises that were prosonified sounded like the beat of the song. I almost wanted to enjoy what was happening. I wanted to move around or lay there and listen to music. Unfortunetly, my mom was there and I don't think she would appreciate that. I understand why people do drugs now, if I was artist I would do this quite often. I can't get over how awesome everything looked and felt. I was no longer sick at his point, but still very high. It was going on 4 am at this point. As I was going to sleep all the shadows danced all over the ceiling. It was amazing. I finally forced myself to sleep.</p><p>The next morning, this would be yesterday, I was so tierd. I got up and still had a hard time walking. I was really tipsy and still think it was in me or something. My eyes weren't dialated, but boy, my face was still puffy as all hell. Today even, my face is still a little swollen. I slept ALL DAY yesterday, and felt like crap. By the evening I finally felt normal again.</p><p>It sucked being caught by my parents, but I had to be because I was so scared. Morning Glory can have pestisdes, so I wasn't sure if I was actaully poisioned, but it ended up that I was just coming down, and it sucked. I feel that I was pretty f*cked up, I couldn't walk or talk for godsake. I tried to drink and I couldn't feel it go down, so it went all over my face, and when I tried to throw up my finger couldn't feel anyhthing inside me. I was completey numb and 'distached' from my body. What I was saw was amazing, but I won't ever do this again. It was way too scary and the after effect of all the swelling sucks so bad. I hate to admit that I enjoyed it all after the sickness was gone and I was hallucinating. And the music kicked ass, but it wasn't worth it. But I experienced it first hand, and I learned so much. The worst part is that I hurt some people in the process that shouldn't have been involved.</p>",
 "year": "2003",
 "id": "21402",
 "gender": "Not Specified",
 "timestamp": "2007-09-16T07:00:00.000Z",
 "views": "3039",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 }
}
