{
 "title": "Tunnels",
 "author": "Raven",
 "citation": " Raven. \"Tunnels: experience with Salvia divinorum (ID 2143)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2143",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "report": "<p>After inhaling the smoke I quickly set the pipe down on the floor, held my breath for a while, sat back and slowly exhaled the smoke. Within (estimated) 15 seconds two huge cone-shaped tunnels appeared, stretching out towards me from the corner of the room. These tunnels were alive, growing and rotating. They were filled with beautiful points of light in every colour imaginable and engulfing the room, my friend and myself as they grew in size.</p><p>As I became part of this swirling, spiralling vortex I could feel a similar swirling in my body that had a 'pins and needles' type of feel to it. It was powerful but not unpleasant. I dont know how but I came to understand that these cones were being laid down, i.e like a road. Also this 'road' had to come right through my friends house and our bodies included!! Why? because these tunnels contained the meaning of everything that has ever existed. So although I may not of wanted to become part of a cone I had to because me, my body etc is included within the division 'everything that exists'. At this time I was not watching this like a spectator but completely immersed in it, I had no recollection of having smoked salvia and what was happening was utterly real. I also believed my friend was experiencing exactly the same thing.</p><p>A minute or two later I stood up and moved to another seat, looked to my right and said 'in a moment I'll feel silly.' Only after saying this did I realize what I'd said and at the same time ordinary consensus reality returned and I did indeed feel silly (for believing the tunnel roadways were real etc) Then over the next ten minutes the effects lessened so I decide to have a 'top up'. I smoked an even smaller amount, a generous pinch at the most. I lay back shut my eyes and almost immediately the visions returned (closed eyes this time) I saw multi coloured paper - chains linked together and spreading everywhere. I thought that they represented probabilities. The probabilities of ANYTHING HAPPENING to anything or anyone at any time. It seemed like these probabilities exist throughout past present and future simultaneously. So for example If i say 'hello' in one moment in time accompanying the event (saying hello) are many 'non-events' i.e the non-events of me saying good-bye, the non-event of me not saying anything etc. So this event is not just determined by itself, but also by countless 'non-events' which assist in determining the event ! After this I enjoyed a peaceful, contented afterglow for about ten minutes and repeatedly found myself saying 'WHAT AN ABSOLUTELY INCREDIBLE SUBSTANCE!!!'</p>",
 "year": "",
 "id": "2143",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-26T07:00:00.000Z",
 "views": "3208",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 }
}
