{
 "id": 2143,
 "title": "A Religious and Constructive Experience",
 "date": {
  "submission": "2005-07-20T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Passenger",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I'm writing of my last trip in retrospective. I ate ten grams of morning glory (heavenly blue variety) seeds with three other friends. We were about to have one last three day party/chill session at a friend's cabin. This was to be only a few days before the first of us would part ways (I believe that this forced us to be a little closer than we would be otherwise, but there was none of the passionate farewells that some might have). Our intentions were not to have an intensely mystical experience, but merely to get fucked up with a lot of pot, alcohol, and seeds and have some fun. We didn't open the alcohol.",
  "One ate ten, another ate six, and my third opted to be a sitter. I began by eating about three grams after a liquid lunch (smoothie). About an hour later, I had moderate nausea and discomfort accompanying the first tinges of psychedelia. This consisted of nothing more than recognizing the type of mental state that would usually envelop me before fully reaching onset. I proceeded to eat the remaining seeds over the course of the next two hours, in considerably more discomfort than morning glory usually gives me: however, one bowl of marijuana between the three of us would have easily alleviated our troubles. As a side note, at this moment I became acutely aware of the amazing power of marijuana as an anti-emetic. About three into the trip I began to become increasingly giddy (the type of experience that I generally experience with about four grams), and over the next hour, I realized the bulk of my trip. I remained mostly sedentary, as the chemical's vaso-constrictive properties made motion uncomfortable and my limbs weak. Nevertheless, my vision became dominated by fractals and tactile experience, such as rubbing sand at the base of my scalp, became fascinating and extremely pleasurable.",
  "Most significantly, my mind began to enter the realm of ideas that always accompanies my morning glory experiences. I thought in the fashion of the general Buddhist philosophy, in particular, that of living specifically for the moment and regarding notions of past and future as irrelevant. I've thought of this concept many times before, but only at this moment was I willing to be honest enough to accept 'nowness,' as we would deem it later. Initially, I battled with confusion relating to interpersonal relationships and the nature of social organization: my primary challenge was accepting unconditionally my love for my friends. Once I allowed myself to move beyond sophomoric fears of appearing homosexual, I entered into a state of jubilation unlike any I've ever experienced before.",
  "At this moment, I ceased to see fractals or hallucinate in any way. I clearly saw everything around me realistically, yet one could argue that my emotional response was a hallucination. I felt endlessly happy at being able to accept all things as they were. I was so overwhelmed by the magnitude of my happiness that I explained it to my friends - at that point, we had gained a fifth member and we had all smoked two bowls - and found that we all believed endlessly in 'nowness.' The experience became amazingly religious as we decided that living purely for the moment was the ideal way to live. I recall relating the experience to conventional religion by saying that while the belief in heaven could be viewed as a blinding light of ecstasy at the end of a tunnel, we saw the blinding light as being all around us at all times, permeating every experience. This bliss lasted about two hours, when vigorous discussion led to the simultaneous, internalized realization that our vision could not be adequately applied to everyday life. From this point, we all began to descend into silent contemplation and inevitable sleep. We each came to the conclusion that we didn't have the willpower to accept our bliss as a lifestyle that could be maintained in everyday life.",
  "This experience was disheartening, but in the weeks since I have thought often about the beliefs we adopted and they have given me a greater appreciation for the minutiae one encounters at all times. As a complete entity in and of itself, the trip strengthened my work ethic, increased my hope and sense of anonymous brotherhood, and left me as a more content and better person. In retrospect it was probably the best day of my life.",
  "-The Passenger",
  "Notes: The seeds were perhaps a year old when eaten and may have been less potent than those in other reports. My larger trips have been consistently less positive than those in the eight to ten gram range. If nausea is a concern, marijuana could be a great help (Mezclizine works, but not very well) and has been for me. A full stomach can increase the wait horribly with no decrease in nausea, so I eat after dosing."
 ],
 "erowid": {
  "id": "17141",
  "citation": " The Passenger. \"A Religious and Constructive Experience: experience with Morning Glory (ID 17141)\". Erowid.org. Jul 20, 2005. erowid.org/exp/17141",
  "substance": "Morning Glory",
  "views": "8304"
 }
}
