{
 "title": "A Little Buzz",
 "author": "Anonymous",
 "citation": " Anonymous. \"A Little Buzz: experience with Salvia divinorum (ID 2145)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2145",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "",
   " ",
   "oral",
   "Salvia divinorum"
  ]
 ],
 "report": "<p>Salvia was introduced to me by a few friends during the summer of my eleventh grade year. Being as we were all high school kids salvia seemed like another golden opportunity to blow our minds. They ordered a great many ethnobotanicals, leaves containing dmt, morning glory seeds etc. Anyway, i had three friends who ate acid one night and smoked salvia, they had been smoking it for several weeks on and off getting slight buzzes. The acid however accelerated the salvia trip. it put them in the zone. One guy visited a memory from his childhood, he was sitting in his old house in massachusetts, a thousand miles away from where he really was, writing a letter to his mother. When he came to he was lying on the ground. Another kid said he was packed in a crate full of elves. The last guy walked through a dark tunnel that led into a garden full of exotic flowers and birds. All three verified that it was a fun experience even though they looked like terrified animals at the time.</p><p>With this in mind and my first checkbook ready i was ready to order some ethnobotanicals myself. I ordered a half ounce hawaiian harvest and tried many methods. I smoked up to seven bowls in succession. The first bowl always was the most potent. It felt like a milder version of a nitrous buzz. My body was relaxed, everything slightly colorful, that's it. I ate 10 leaves in a quid and still only slight effects. I smoked a few bowls while i was whacked out on acid and grass and it heightened my trip but nothing as amazing as it sounds. I tried it with ecstacy same as acid. the best results were out of a bong me and a roommate shared a few bong hits and i suddenly could no longer communicate with him, legs felt cold and clammy, i could barely walk felt slightly nauseous, everything moved in slow gradual waves but my perception was still mostly the same. My mind in control, it had a clearing effect on my mind like meditation. I felt completely relaxed and broke out in a sweat (salvia always gives me the sweats). After a few minutes i sobered up enough to talk and walk with my friend to the cafeteria. The setting has been shitty its hard getting peace and quite in a dorm. There have been moments when it was quiet though and i smoked but the effects changed little, lights off as well. I think for a mild experience leaves are the way to go, i hope to experiment with extract in the future. </p>",
 "year": "",
 "id": "2145",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-26T07:00:00.000Z",
 "views": "3888"
}
