{
 "title": "Super Intense",
 "author": "Spork",
 "citation": " Spork. \"Super Intense: experience with 5-MeO-DMT (ID 21462)\". Erowid.org. Feb 21, 2003. erowid.org/exp/21462",
 "substance": "5-MeO-DMT",
 "bodyweight": "130 lb",
 "report": "<p>It was November of 2002. I had aquired some 5-meo-DMT. My girlfriend</p><p>and I went to her dorm room to smoke it.  I took a piece of tin foil and made a bulb shaped container.  I put the 5-meo-DMT in the bottom of the bulb and wrapped the rest of the tin foil around the end of a straw, forming a freebasing apparatus.</p><p>I sat on my girlfriend's floor in our dorm and prepared to dose myself with the 5-meo-DMT.  Her roommate came back unexpectedly, so I told her that the substance was not technically illegal and not to call an ambulance when I passed out. I was kneeling on the ground when I hit the straw pipe and inhaled a lungful of burnt plastic plum smelling and tasting smoke.</p><p>First the entire world became 6 dimensional. All the space around me in the room was composed of hexagonal blocks that were constantly shifting and moving. Wherever they moved they left acid like motion trails that were red and gold. I looked at my girlfriend's vibrating face and said, 'Oh my god!'</p><p>Before I could say more the drug hit me fully. From my girlfriend's point of view my pupils went from normal to fully dilated in one brief moment.</p><p>At that same moment I lost all contact or knowledge of my body, the room, or the normal laws of the universe. My girlfriend saw me fall over backwards off my knees, hit my head on her bed, and then writhe and thrash around underneath the bed.</p><p>The first few moments after I lost contact with reality were utter uncontrolled madness. My perception of my body had been entirely scrambled; it was as if every nerve in my body had been randomly connected to the wrong input in my brain and  all the inputs set off at once.  I was experiencing vertigo, I couldn't tell that time was passing, and instead of a 6 dimensional room I saw a 6 dimensional void which was repeatedly shattering. Intense feelings of being shocked with static electricity were snaking up and down my arms.</p><p>I experienced powerful synesthesia between hearing and touch. I ran my</p><p>hands over the sharp edges of the springs underneath my girlfriend's bed and simultaneously heard, felt, and saw an intense static/sharp/bright sensation.</p><p>This was probably the most unique sensory imput of the entire experience.</p><p>After an unkown period of time in my head and approximately 5 minutes of outside time I returned to reality. Almost as abruptly as it started it disapated and I was (by comparison) fine. I was still tripping as I was before the hit took effect, but that was incredibly mild compared to the full on insanity that had preceded t. 20 minutes after I came to I was completely normal and ready to deal with serious matters. As I was coming down I talked animatedly to her roommate, who drinks but definitely does not freebase hallucinogenic chemicals. All things considered she was pretty receptive my mad ravings.</p><p>Being completely out of control of the very underpinnings of reality was terrifying. It took an unknown amount of time according to my internal clock to adjust to my new sensory environment and be able to function rationally in any way. I overcame the initial disorientation and vertigo by treating it as if it were a bad acid trip. It's hard to express how exactly one suppresses drug induced panic but it's definitely an aquired skill. I would therefore highly recommend 5-meo-DMT only for experienced psychedelic users.</p><p>The dose is difficult to determine and very small, and the timing and exact execution of freebasing is complicated. I didn't determine the dose with a scale or experimentally, but instead relied on my friend's advice to take 8 crystals. Yeah, I took 12 instead, but I like my psychedelics strong. He determined the dose by taking first tiny pinches (by which I mean difficult to see grains of powder) and then increasing the dose untill he found a high enough one. It is important to start *very small* when experimentally determining a 5-meo-DMT dose; a tiny amount of powder is enough to put you completely out.</p><p>After that experience I did 5-meo-DMT about 10 times. Twice more that day,</p><p>and about twice a week for a month. It's short duration is useful when you have work to do the next morning, and it's fun. It is still frightening, and so I stopped using it because the trips were rapidly becoming uniformly bad and scary.</p>",
 "year": "2002",
 "id": "21462",
 "gender": "Male",
 "timestamp": "2003-02-21T08:00:00.000Z",
 "views": "8075",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "5-MeO-DMT"
  }
 }
}
