{
 "id": 2147,
 "title": "Living Irresponsibly",
 "date": {
  "submission": "2006-05-26T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": "143 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>It was about 11:50 and we had just gotten out on a half day.  ME and my friends 'R' and 'K' went wandering down the main drag in our town in San Diego searching for a friendly booze buying bum.  Low and behold, we found one about an hour later.  We gave him money and he gave us his unopened 40oz. so we knew he wouldn't make off with the Bacardi Limon he was about to buy us.  He bought us a 1/5th and we found the worst place in the world for underage high school kids to drink, the bowling alley. ",
  "We then proceeded to get cups for 'water' and I had two Large styrofoam cups of it, and 'R', after finishing his two cups, proceed to drink the rest of 'K's second cup due to the fact that she is a lightweight beyond beleif, and me and 'R' being more experienced drinkers finished off the rest of the bottle.  I had to leave to go home and I arrived, stumbling, reeking, and having no idea what time it was, told my dad id be skating outside.  I then found my other friend 'R' and I layed down on the sidewalk.  I didn't feel too drunk considering I had drank a little less than half a 1/5th on a completely empty stomach.  I went into my room and layed down with a trash can by my head and tossed about 20 times, and the last few times, it was blood red, and I knew something wasn't quite right. ",
  "I threw up around 70 times that night, mostly blood and bile, and I finally realized I had alcohol poisoning.  I looked up through my soggy eyes in the mirror and saw a spinning room, then myself falling down, and I fell into the bath tub.  I immediately stood up and went to my room. I passed out, occasionally waking up to puke, and that lasted about 12 hours.  I never went to the hospital, never told my dad what I did, and all I had to show for it the next day was a really sore throat and various sore innards.  My friend 'R' wasn't so lucky, he fell on the way home and hit his head, causing permanent brain damage, and also got alcohol poisoning.  'K' just went home fucked up and played solitaire for a few hours and fell asleep.</p>"
 ],
 "erowid": {
  "id": "17159",
  "citation": " Anonymous. \"Living Irresponsibly: experience with Alcohol - Hard (ID 17159)\". Erowid.org. May 26, 2006. erowid.org/exp/17159",
  "substance": "Alcohol - Hard",
  "views": "6436"
 }
}
