{
 "title": "High Dose Mixtures, Overheating, and Psychosis",
 "author": "Egor",
 "citation": " Egor. \"High Dose Mixtures, Overheating, and Psychosis: experience with Cocaine, 5-MeO-DIPT & Alcohol (ID 21488)\". Erowid.org. Feb 21, 2003. erowid.org/exp/21488",
 "substance": "Cocaine, 5-MeO-DIPT & Alcohol",
 "bodyweight": "175 lb",
 "report": "<p>In january of 2002, the research chemical 5-meo-dipt began being sold as 'a candyflip' in my particular group, and it spread like wildfire. I have extensive experiance with the substance and in my trials, I personally have had no abreactions to it, but I was involved with an extremely serious situation which I beleive warrants serious attention.</p><p>Two 9mg gel tabs of pure powder were purchased by a man well known for having a lot of experiance with halucinogens. We will call him J. He went to a party to trip, and for several hours went by without incident; but after about 6 hours we got a call from one of of the people that he was with saying J was having some problems. This was not at total suprise (1 other person also had a problem; though much less serius; with this particular tryptamine). She told me that he was vomiting violently and his body temp was approx 101.</p><p>At first I was not too concerned because the moderate body load had caused some minor discomfort in me and others. I told them to give him small amounts of cool liquid and to take his shirt off and give him a damp towel and a fan to cool himself at a rate that was comfortable to him (he was slightly agitated and withdrawn; and to keep an eye on him and call me to come over if he wasnt getting better in an hour.</p><p>  About twenty minutes later she called to say that he was getting somewhat more agitated and out of control. She also took this oppurtuntty to tell me that he had also been smoking crack and coke freebase, snorting lines, and drinking heavily while on the 5-meo-dipt; all of which he was warned not to do before hand. She wanted me to come over because I was the member of our group with the most experiance with 5-meo-DIPT, but he is one tough guy and he said that if anyone else came over, he would kill them (he had a history of assault and violent crime), and I did not doubt him at this point.</p><p> She suddenly said that she had to go and I did not hear back from them until the next morning when I was told that J was settling down and that was going to eat somthing and try to go to sleep. I took this as a good sign and I did not hear anything form that group until 4 or 5 days later when my friend C en at has house and that shit went crazy.</p><p>I was told that over the next few days he went into what was called a psychotic episode that culminated in taking 12 people that were in his house hostage, beating most of them, and attacking 1 man with a machete. I do not know if it was the 5-meo-dipt, coke crack or alcohol; or the combination that caused this severe episode, but I thought other 5-meo-dipt user should know about this event.</p><p>[Editor's Note: Erowid chooses not to publish most second-hand reports we receive because they are notoriously unreliable and outside the scope of the Experience Vaults.  Because this second-hand report is of an incident involving the concurrent use of multiple psychoactive substances and someone with an unknown medication and mental history, it is important to note that identifying a single cause for mental health problems is nearly impossible.]</p>",
 "year": "2002",
 "id": "21488",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-21T08:00:00.000Z",
 "views": "27398",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cocaine",
   "form": ""
  },
  "2": {
   "time": "",
   "amount": "10 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  "3": {
   "time": "",
   "amount": "3 ",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": ""
  },
  "4": {
   "time": "",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  }
 }
}
