{
 "title": "Kind of Nice",
 "author": "uriboros",
 "citation": " uriboros. \"Kind of Nice: experience with Divalproex & Cannabis (ID 21490)\". Erowid.org. Dec 15, 2005. erowid.org/exp/21490",
 "substance": "Divalproex & Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>Found a kind of nice combination of things.  One summer night I took Depakote which is a presciption anti-seizure med commonly used as a mood stabilizer.  I went downtown to hang-out and have a coffee.  I ran into a friend and he and I smoked a joint.</p><p>I don't remember too much, except for the really spiritual impressions that I got all night long, and some thoughts and emotions that were largely normal, but for some reason my brain seemed to process them as hallucinatory because of a kind of 'choppy' and 'dissociative' quality.</p><p>I remember the weed hit me kind of harder than usual, and I left the outdoor table at the coffee house for the parking lot across the street where a lot of people hung out and played car stereos.  I told my friend, 'I can't take this, I gotta go hide.'  I'm kind of over the rainbow as far as remembering whether it was light or dark--everytime I remember the conversation it seems like it had happened at a different time of day.  I think I was asking him about art, but in a kind of God-is-an-astronaut type way, and he gave me really basic answers, but they seemed really cryptic and elliptical, like I would say, 'What is the importance of art?'  And he would say, 'It's watching the colors.'  Then, I would say, 'What is time in painting?'  And he would say, 'It is watching the leaves fall.'</p><p>I ran across the street and climbed up a fire-escape to sit on the platform.  Then, as it got dark, I depersonalized.  I became a line that vibrated with the music I heard, then the line dissolved, and I was all alone and started to panic.  I was lying in a heap up on the fire-escape.  You know how sometimes you can have a nightmare that scares you so much that you can't even scream when you wake up?  That's where my voice went, and I could only weakly say a few words...</p><p>I think I curled up and vomited through the grated floor of the escape.  That's when the magic happened.  Some candy kids were close by, and one girl came up and played nurse.  I vomited two more times.  She gave me some water.</p><p>When I looked at her face, I felt a feeling like someone gave me a big-ass hug.  I thought I had gone to that numb and fuzzy place never to return, but she was like a beacon on light in the dark.  I didn't hallucinate visuals, or hear anything, but I wasn't in Kansas anymore:  I was surrounded by swimminess, water as far as I could imagine, and I understand that traquil-water fantasies are like an orgasm without the mess.  I came to see that everything was really just like water--it looked together, but easy to separate.  An impression of showering electrons.  Words were like buoys, bobbing in and out of the sea of reality.  I said it.  Bob.  Bob.  Bob.  Like hypnosis.  Everything was rippley.</p><p>All in all, it was a feeling like no other, and I think I slept well after the more intense aspects of the high wore off.  I haven't forgotten or really ever gotten over the feeling of it since.</p><p>Only side effects that I noticed are that I have a tendency to get all sorts of things backwards now, especially in thought, emotion, and language, but it's more of an annoyance than anything.</p>",
 "year": "2000",
 "id": "21490",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-12-15T08:00:00.000Z",
 "views": "13050",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Pharms - Divalproex",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
