{
 "title": "Grandfather DXM",
 "author": "Erik",
 "citation": " Erik. \"Grandfather DXM: experience with DXM (Robitussin Max Strength) (ID 21493)\". Erowid.org. Feb 21, 2003. erowid.org/exp/21493",
 "substance": "DXM (Robitussin Max Strength)",
 "bodyweight": "156 lb",
 "report": [
  "<p>Set: My bedroom - mainly on my bed not moving at all.",
  "Setting: I started drinking DXM around 11:30 PM.  Parents were asleep, and I was in a great mood and ready to trip.",
  "This story begins about 3 months before the date of 2/21/2003.  I am fairly experienced with drugs.  Weed, DXM, Vicodin, Codeine, LSA, Xanax, Nutmeg (awful to say the least), and PCP (laced weed, not my fault), and Diphyenhydramine (my 2nd fav, DXM is my 1st), were some of my previous drugs I had done.  At the time of this experience I was taking the following medication: Zoloft 150 mg.  I purchased 3 bottles (4 oz. each) of a generic Robitussin Max Strength Cough (and yes, I know the proper ingredients and all... 15 mg. just like robo max strength, and only DXM as the active ingredient).",
  "11:30 Gulped one 4 oz. bottle down in a single gulp (at this point I enjoyed the sugary taste).",
  "11:45 Same as above.",
  "12:00 Same as above.  I had now ingested 12 oz. of DXM and was waiting for it to kick in.",
  "12:20 It has been awhile since this experience, so I am estimating most of these times but they should be very close to the real time.  DXM starts to kick in.  It feels like an average 1st-2nd plateau trip.  I proceed up to my room as I didn't want to be messed up downstairs.  I hopped on my computer and talked to people on aim.",
  "12:30 I call a girl I liked from school's cell phone and talk with her a little while.  It starts to hit me harder.  I go on the floor so that I am in a comfortable position.  I describe to her what it is I am looking at and what it makes me feel like.  She understood perfectly.  I happened to be looking at my a crack between my beanbag, trashcan, and toolbox on the carpet (up close as I was lying next to it).  It seems so large, and I seem so small.  Pretty average and cool...  I hang up.",
  "12:40 I hop back on my computer and proceed to call a friend.  He's very drunk on the phone and I wasn't sure if it was him not making sense, or me not making sense.  Anyhow, he knew I was messed up without me telling him I was.",
  "12:45 I'm talking to some friends on the computer when a techno song I had listened to earlier in the day started playing very loud and clear (as if a stereo was on), right behind me.  It seemed to be centered in the right corner of the wall.  I toy around with it and imagine a certain song and it would play.  My own personal jukebox!  Hehe...  The trip gets stronger, faster.",
  "1:10 I jump on my bed while I still can.  I start to fade in and out of my brain.  Sorta like falling into your own head (into a blank grayness).  The next thing that happened can sorta be looked at as an in-body experience rather than an out-of-body experience.  I fall into my own heart and droop through it.  It looks like a dark burgundy real heart shaped glob that is kinda bleeding itself (hard to put into words).  Next I fall down further into my veins.  I travel down my left leg and explore for a bit.  All of a sudden I realize I have a body and open my eyes and I was back.  Of course everything just didn't look or feel the same as usual.  Not scary at all.  Rather, well, how do I put it - dissociated.  I look to my left and my dog (who really happened to be there) was on my bed next to me.  I started bonding with my dog.  I felt like my dog was protecting me... actually more like she knew I was tripping and was there to do whatever she needed to do to help me.  Really good feeling to me as I am a dog lover.",
  "Somewhere around 1:30 I repeat this falling into my self business, however I didn't explore my own body anymore.  All I remember of this next part is a singular picture of what looks like the pod scene in The Matrix with the electricity going through all of the bodies in that huge black room with thousands of people lying down - only without the electricity or the bodies.",
  "1:45 I am travelling backwards (facing forwards) through a spinning green, red, yellow, etc... colored tunnel.  I feel the movement and it is very fun.  Really, really, really alienesh.  Fun.  I remember juts single pictures of sprawling alien landscapes.",
  "2:00 This falling into gray emptiness continues on for awhile, however I don't remember every account of exactly what happened each time.  All I remember was remember once in awhile that I had my body and wanting to check up on the outside and bam, I would be back.  Then whenever I wanted I could go back to dreaming again.",
  "2:40 I wake up (I don't think I was asleep, however.  I can never sleep on DXM, just dream) and try and focus my eyes on my green LCD lit clock.  I see double of the screen and it is very blurry and fuzzy.  For some reason, I knew that Grandfather DXM (sounds cheesy) was going to come in through my open window and show me something new (possibly teach me something, or something to that extent) at approximately 3:00.  Why it was 3:00 I do not know.  What I was going to learn I do not know.  I waited, and waited, and waited for what seemed to be a few days (I knew it wasn't, but I still felt it was) until 3:00.",
  "3:00 on the dot - Nothing happened.",
  "3:01 I realized he was not coming.  A large disappointment for me.  This sort of turned the trip around for me.  Now I was stuck in time.  Time did not move.  It was eternal.  I was stuck in a loop, however I kept come and was not frightened.  I knew I had done something to make me not be in reality, however I didn't know what.  I did know that eventually I would be back, so I never even thought about panicking or anything like that.  I just tried to get some shut eye (to no avail).  Next all I remember was imagining being at school the next day and hugging the feet of the girl I called earlier.  The room was soooo large, and I was sooo small.  She liked me hugging her feet, and I loved hugging her.  It warmed me and I just wanted to be there right then.  However, I couldn't see above her legs, so I never saw her face.  But I knew it was her.",
  "10:00 am My dad wakes me up.  I have my first flying lesson.  I am still heavily intoxicated, hover I am back enough to act normal.",
  "12:00 I'm flying a plane 700 feet above the ground and getting a small amount of g-force.  What a rush.  Great time, DXM made it better.  No hangover, just a little freebie in the morning.  Fun times.",
  "Well... All in all this was an excellent trip.  Even the stuck time crap.  Its all part of a large message that someday I will discover.  I have yet to drink 12 oz. since.  Only up to 8 oz. which does not get me anywhere near this type of experience.  Peace, and good luck!</p>"
 ],
 "year": "2003",
 "id": "21493",
 "gender": "Male",
 "views": "17180",
 "dose": [
  {
   "time": "0",
   "amount": "12 oz",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2003-02-21T08:00:00.000Z"
}
