{
 "title": "The Two Poles",
 "author": "Lotus",
 "citation": " Lotus. \"The Two Poles: experience with Mandrake & Skullcap (ID 21509)\". Erowid.org. Nov 28, 2003. erowid.org/exp/21509",
 "substance": "Mandrake & Skullcap",
 "bodyweight": "140 lb",
 "report": "<p>I have read some interesting things about Mandrake root tea, but nothing about people smoking it, Skullcap was the same way, nothing much to find, so here is something about the effects of smoking a mixture of skullcap and mandrake root, since it appears that not many people have tried anything with them other than teas.</p><p>The other day, after visiting a herb shop and picking up some mandrake root and skullcap, I made up a mixture of 1 part ground root to 3 parts skullcap.  My friend and I thought about making a tea out of it, but after reading the expirences that other people have had on it, we decided against it.  However, we still wanted to try it, and thought 'Hey, if we bypass the digestive system, then we might not suffer the ill effects that we have read about.'  So, we decided to smoke it.  We had one bowl each, and it affected us in completely opposite ways.  About 15-20 min after we finished our bowls, it began to take effect.  For me, it seemed to release any energy I had in me, I wanted to take off and run somewhere, and could not sit still, I had to be moving.  For my friend, it affected him much in the same way as weed, he did not want to move, and said that a very euphoric feeling came over him.  This feeling lasted for about an hour for the both of us. </p><p>I was a little anxious when I first smoked it in part because my car had just been totalled, but other than that, we were both pretty relaxed to start out with, then I got this feeling that I had to keep moving.  It was actually quite a fun experience.  I had no ill effects, not even the nausea or dizziness that usually comes with smoking weed was there.  Also the smoke is much smoother and more pleasant tasting and smelling than that of other substances that I have tried.  All in all, it was fun, something I would definately do again.</p>",
 "year": "2003",
 "id": "21509",
 "gender": "Male",
 "timestamp": "2003-11-28T08:00:00.000Z",
 "views": "20584",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Mandrake",
   "form": "(roots)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Skullcap",
   "form": ""
  }
 ]
}
