{
 "title": "God for 15 Minutes",
 "author": "Ferg",
 "citation": " Ferg. \"God for 15 Minutes: experience with Salvia divinorum (ID 21561)\". Erowid.org. Dec 16, 2004. erowid.org/exp/21561",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "3 hits",
  "smoked",
  "Salvia divinorum",
  "(leaves)"
 ],
 "report": "<p>This was my first time smoking salvia.  It was the summer of my senior year of high school.  I had been busted a month earlier for posession of marijuana (a stupid situation that I brought on myself), so I was somewhat scattered emotionally (parental relations got kind of rocky).  Me and 2 friends decided it would be fun to take a trip out to the coast (Washington State coast) and get away from the world for a few days.  My friend has a cabin on the coast that is 40 miles from anything and anyone, we had to drive on logging roads for about an hour before we got there.  The cabin was beatiful, and had large windows overlooking the ocean.  There was no power or running water, as the whole thing was hand-built.  It was high up on a bluff, and slowly falling off (over the course of many years) so the whole thing was tilted a little bit towards the ocean.  There was also a path down the bluff it was built on down to the beach. </p><p>We built a home-made bong out of rubber tubing, a glass bowl, and a 2-liter bottle, and named it Doctor Mario.  I think this is one thing that helped, because after building and naming the bong, we had sort of a 'connection' with it.  The first night we built a fire on the beach and had a few beers, and got talking about deep stuff and I ended up putting my mind at ease about the whole parents/weed/arrested thing.  If I hadn't sorted that out, I would have had a horrible trip. </p><p>A note to anyone who reads this:  BE AT PEACE WITH YOURSELF.  IF YOU HAVE ANY INTERNAL OR EMOTIONAL ISSUES AT THE TIME OF THE TRIP, DO NOT TRIP.</p><p>The second day is when we tripped.  At about 10pm, we all went into the master bedroom of the cabin (there were 4 rooms.  A living room/kitchen, a bedroom with bunks, a master bedroom, and a crappy home-made sauna) and sat on the bed.  We sat in a circle, with Doctor Mario (the bong, heh) in the middle.  One of my friends hit it a couple times (we were smoking dried leaves, by the way), then his eyes glazed over and he passed into a kind of lucid half-dreaming state.  Before he was done tripping, I decided to hit it.  After 3 hits, I fell backwards onto the bed (I was sitting cross legged) and closed my eyes.  All of a sudden, I was flying through a solar system then I zoomed in on a planet and I was creating towns and villages and buildings.  I had become a god on some far away (but earth-like) planet.  I started remembering all these things that 'I' had done as a god (created species, etc) and I *became* that god.  I remember repeating to myself that 'it's what I do' (make worlds, that is).  That lasted for about 15 mins, then I came out of it.</p><p>The day after that, we all went down and hung out on the beach most of the day.  That night we brought Doctor Mario down to the beach and sat against a log at about sunset.  I was the first person to hit it, and after about 2 big hits, I got up and walked about knee-deep into the water, clapping the whole time.  Sunbeams from the setting sun were forming bridges and walkways into my eyes and down onto the surface of the water.  I clapped for a good 20 minutes, I'm not sure why.  It wasn't like a happy, excited clapping, it was more like a rhythmic sound.  I tripped for about 20 mins out there, and at some point one of my friends came stumbling out after me (him tripping pretty hard too) and we melded our trips togethor.</p><p>All in all, it was an amazing and mind-expanding experience (even if it does sound a little lame, heh).</p>",
 "year": "2002",
 "id": "21561",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-16T08:00:00.000Z",
 "views": "7301",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
