{
 "title": "Sudden Dismissal",
 "author": "Matt Himself",
 "citation": " Matt Himself. \"Sudden Dismissal: experience with 2C-T-2 (ID 21579)\". Erowid.org. Feb 24, 2003. erowid.org/exp/21579",
 "substance": "2C-T-2",
 "bodyweight": "165 lb",
 "report": "<p>Experience  First time</p><p>Setting  my basement</p><p>I have been interested in the 2C compounds for awhile now. My first experience with 2C-I was almost perfect. I felt I needed to explore these chemicals a little more, rather than limit myself to one.</p><p>For the evening I was trying to decide on 2C-T-2 or 2C-C. I was debating whether I should go with something Ive wanted to try for awhile, or go with something new and be adventurous. I opted to go with the 2C-T-2 as it had been on my to do list longer.</p><p>I had heard of the horrible nausea that had been associated with 2C-T-2 so I decided to mix my dose into a drink, and sip it over 30 minutes. I poured myself a tall glass of juice and sprinkled 14mg of 2C-T-2 into it. I lit some incense and prepared to drink.</p><p>11:10 PM  I sip my 2C-T-2 cocktail. There is no taste other than the juice. I am pleased as I did not want a chemical flavored beverage.</p><p>11:30 PM  Im still sipping my drink. I am almost  done with it. I feel a bit light headed. There is no nausea to speak off. I had a garbage bag nearby in case I needed to throw up, but I could tell it wasnt going to be a problem.</p><p>11:38 PM  I finish my drink. I have a mild body high now. It feels a lot like how I remember 2C-I feeling. My mind seems to be drifting off.</p><p>12:00 AM  My depth perception is definitely altered. I am at my computer and it seems much farther away from me than it did a few minutes ago. I reach out for it and my arm seems to extend forever until it makes contact. Quite interesting.</p><p>12:05 AM  I notice a bit of a headache. This feels much like the 2C-I headaches I usually get. I have not read of 2C-T-2 giving headaches, but I just dismiss it as something that I will have to deal with. I also notice some objects are taking on a breathing effect. The room seems to be coming alive now.</p><p>12:08 AM  There is a light directly above me. It feels so warm. I makes me quite happy and I feel very comfortable.</p><p>12:20 AM  Body buzz is getting stronger. I also notice a splash of color on the walls. It looked like someone splashed red paint, and then it faded away. It was quite nice to see. I call my girlfriend R as she had been out for the night, and wanted to hear from me. Talking to her increased my mood even more.</p><p>12:35 AM  Strong patterning has appeared. Very colorful images are sliding across the carpet. I try to describe them to R but I can say is they are beautiful. She laughs. I have no problem talking to her while tripping, as she knows how incoherent I can become. And because I know she is aware of this, I feel no shame.</p><p>1:00 AM  I hang up with R. I am still completely in awe of the patterning Im seeing. The body buzz is still there but actually seems weaker. Could it be I have passed the peak in less than 2 hours?</p><p>1:30 AM  The patterning stops. This surprises me as the hallucinations I was having were so vivid and now they are gone. The breathing of objects seems to have diminished as well.</p><p>2:00 AM  All visuals are gone. The body buzz is mild at best. My mind feels completely sober. I am extremely confused by this. I had read the duration of 2C-T-2 was roughly 6-8 hours. It was almost 3 hours since I started ingesting it and I felt sober. Perhaps this comes in waves I thought. I decided to just wait, and that it would all come back to me.</p><p>3:00 AM  Nothing. I still feel sober. But I feel stimulated. I am rather disappointed the results here. I try to go to sleep, but it does not work. I feel like Ive had way too much caffeine. I take 10mg of Valium.</p><p>3:30 AM  The valium has knocked me out, and I am done for the night.</p><p>-------------------------------------------------</p><p>I dont know exactly what to think here. I was really disappointed with how short it was. I dont understand why this happened. Perhaps my body metabolizes 2C-T-2 very quickly. Also, it could have been my dose was weak; a mere 14mg. Also, drinking over the 30 minutes could have made a difference.</p><p>The results of this could have been a combination of things. I guess Ill need to try this again. I think next time I will take a higher dose (16-18mg) and Ill take it all at once, and just try to deal with the nausea that may come.</p><p>The effects of this drug were quite pleasant for awhile. It was just a shame to have them all end so fast</p>",
 "year": "2003",
 "id": "21579",
 "gender": "Male",
 "timestamp": "2003-02-24T08:00:00.000Z",
 "views": "16123",
 "dose": [
  {
   "time": "0",
   "amount": "7.0 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:30",
   "amount": "7.0 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:50",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  }
 ]
}
