{
 "title": "Disney Themed Trip",
 "author": "Pup",
 "citation": " Pup. \"Disney Themed Trip: experience with Salvia divinorum (5x extract) (ID 2157)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2157",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "",
   "2157",
   "Not Specified",
   "",
   "Not Given",
   "Jun 26, 2000",
   "5944",
   " "
  ]
 ],
 "report": "<p>I first heard about salvia from an online head shop. I bought a concoction that said it was a 5x salvia extract. The package arrived while i was away at a week long trip at disney land so it was a nice surprise to have it waiting for it the minute i got back. So I loaded a pinch of the green shit into the bong and expected to smoke the whole bowl, and to be 'high' fo a few hours, but what happened was what i least expected. I took a first hit with the lights on, and held it in for a few seconds. I was inexperienced with smoke back then and i was surprised how smooth the smoke was as MJ used to tickle the crap out of my lungs at that time.</p><p>After the first inhalation I 'Woke Up' to a strange moaning, whining sound, and watched a diamond shaped animation of little mickey mouse heads moving along this diamond shaped path on my wall. I was just dumfounded at that point and i laid back and closed my eyes and found my self bombarded by army's of the disney Alice In Wonderland Card soldiers, fluttering all around me (i was really overstimulated from disneyland I guess). When I opened my eyes again i realized I was back in my room again but the color was really distorted, hard to explain how, but it was definitely not normal, almost like looking through a green filter, definitely the greens and reds were the most affected but it was an overall shift in color scheme, however it was this altered color scheme that was REALLY familiar, it reminded me of somehow of childhood, really young childhood, reminded me of how i perceived the world differently at the age of two and three. how my surroundings were so mysterious and and seemed to have a single persona, as if everything I saw was part of a separate entity or being, that was there with me, and could talk and interact with me as another person or animal would do. I felt this way again, as if was re awakened to the mysteries of the world as they are perceived by a fresh and inexperienced mind of a very young child. </p><p>This whole experience lasted only two or so minutes mind you. While still under the salvia about the third minute, I looked down at my feet. When I saw that they were at least 800 feet below me I began to giggle uncontrollably and waved down at them. I still laughed at called out to them in a very childish voice 'HIIIIII!!' when I realized that I was not really 800 feet above the ground and snapped out of the idiot like stupor i was filled with a tremendous amount of Joy. 'This is the greatest shit ever', i said out loud to my self I heard my friend pull up in a car out side and i wanted to call out the window to express this unbelievable joy and happiness, but i got caught up in my euphoria and just started dancing around the room for a good two minutes, when i went two the window to call to him there was no car, no friend, by this time the trip was only a memory. I couldn't wait to do it again, but there was a certain reluctance, a caution i felt, before trying it again. </p><p>This isn't just a casual recreational experience, it feels more like a mission or journey that must be respected and not taken lightly. I don't know, Very powerful plant!</p>"
}
