{
 "id": 2158,
 "title": "Intense At a Club",
 "date": {
  "submission": "2002-09-02T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Captn' Trips",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "225",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Let me start by saying that DPT is very intense and is not recomended for the unexperianced or close-minded.  I am a semi-experianced psychedelic user who has tried X, shrooms, amyl nitrite, N20, Weed (duh), and acid.  This, however, takes the cake over all of the others in intensity.",
  "One night 2 female friends of mine were on our way to find some MDMA and were callin' all of my friends who usually can spare some, but tonight they were all out of luck in that area.  That is until I called a good buddy of mine who I had tripped with several times who said that he still had a good bit of DPT left from a previous experiment of ours.  I told him I was interested and he brought it to the Jack in the Box were we were.  I paid him and we went to the club.",
  "On our way I snorted the small pile of DPT (about the size of a nickle) and figured that would be a good dose to dance on... I was wrong.  About 5 min into getting to the club, I begain feeling light-headed and uncomfortable.  At 10min we were in the parking lot and I was felling very nauseated, but not in a bad way, just in a weird crazy drug way.  I proceeded to throw up and justified to the strangers who were walking by that I had been drinking.  After 30-40 seconds I attempted to enter the door and was frisked down (I ditched all the stuff I had in the car) and went to ID check inside.  As I entered I felt as though I was in Fear and Loathing in Las Vegas when he was checking into the hotel.  The ID person's face was melting as was my ID and wallet.  I stumbled through the process of going in and was helped to walk by my friends.",
  "I proceeded to sit (where I was to remain for at least 30 min) and was enveloped by the truth of the universe!  I was folding in and out of myself and the world.  Durring this time I was watching the entire place drip from the celings and walls.  The multi colored lights that they had were just clouds in my mind.  I couldn't walk and was not paranoid at all.  My other friends who were waiting for us came and brought me to a calmer area and I just kept on my journey for at least 3 hours.  After that I was in an X like haze (with out the love and empathy) and started dancing non-stop for like 2 more hours.",
  "I came down compleatly in that time and drove the 30min drive home with no problem.  All in all a wonderful experiment, but beware that it was intense and a less informend psychedelic user would have probably not made it in there.  Not recommended for clubs or raves since the songs all ran together and were too loud.  Use at home and realise that for the first hour it is so intense that you will probably throw up or something.  Expect bodily discomfort for a while... it is not avoidable.  I felt anxious but couldn't move, odd at best."
 ],
 "erowid": {
  "id": "17203",
  "citation": " Captn' Trips. \"Intense At a Club: experience with DPT (ID 17203)\". Erowid.org. Sep 2, 2002. erowid.org/exp/17203",
  "substance": "DPT",
  "views": "8615"
 }
}
