{
 "title": "Mystified at Being Human",
 "author": "Gyute",
 "citation": " Gyute. \"Mystified at Being Human: experience with Salvia divinorum (extract) (ID 2158)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2158",
 "substance": "Salvia divinorum (extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "report": "<p>The following is an account of one of my trips on Salvia Divinorum using the denatured alcohol extract:</p><p>For my extract I used only twenty leaves initially due to the fact that the leaves I was using were (reportedly) very potent. Just recently I decided to try some out to see its effects in comparison to smoking plain dried leaves. I had found that smoking the whole leaves was powerful, but it came on too suddenly so it always seemed impossible for me to smoke anymore once it hit me. I always ended up confused, or sometimes I would laugh hysterically. I wanted to see what was beyond the state I had found smoking the whole leaves. That led me to the extract.</p><p>In a dark room I packed up a 1 1/2 ft. bong with the extract and a piece of a whole leaf to keep it from pulling through. I proceeded, torching the bowl to make sure as much of the extract was lit as possible. I held the hit in a very long time before blowing it out; at that point I already felt the plant coming to me...but it kept getting more and more intense! So much so that I struggled to finish the bowl on the next hit. I could faintly see the dim room begin to spin; side to side - tilting. I laid down staring up at the dark ceiling. At this point I can only give an estimate of what came about...as I was in a completely different state of consciousness.</p><p>All that I remember at this point was being very confused. I was mystified at the whole idea of being a human being. I felt as though I wasn't one anymore! Nothing about us made sense - not even the voices I was hearing. But in a weird sense they did... but on a very primordial level. They seemed to be very confused as to what was going on, and it was reflected in the number of questions that were being asked. I don't know what they were asking, but I knew they were questions because of the tone in their voices. I almost think that it was me asking all the questions. It was like everything in my head had become a separate entitiy, and the plant and my body were listening. I don't know where all this was taking place, although it seemed somewhat internalized; almost as if my spinning vision traversed into something else... a wormwhole of the mind!</p><p>Then, after some time had elapsed, I remember seeing the movement of my friend in front of me. His shadowy figure moved about, almost in a manner that replicated a video being played forwards, and backwards, and forwards more, and backwards less, and so on. Along with it, his voice was being distorted. I could make out the phrase 'stand up, you'll feel better'. So I did. I was slowly coming to grips with the fact that I was human, but it was more like I had decided to play the role of one, and that I was acting. My vision was still unstable but it came back very quickly, and with it so did my ego, so to speak. I then became who I was, capable of contemplating and understanding my human reality.</p><p>The trip pretty much ended there. I estimate that it had been 15-20 min., but I'm not positive.</p><p>Interesting note: Apparently, my friend never said anything to the likes of what I heard. He said something about how it felt good to stand in front of the open window. (He had tripped on Salvia minutes before I had, and was sweating as a result.)</p>",
 "year": "",
 "id": "2158",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-26T07:00:00.000Z",
 "views": "3167"
}
