{
 "title": "Four Experiences with Salvia",
 "author": "Cope Head",
 "citation": " Cope Head. \"Four Experiences with Salvia: experience with Salvia divinorum (ID 2159)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2159",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " leaves",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "report": "<p>A short time ago, I acquired a supply of dried Salvia Divinorum leaf. Intent on exploring the properties of this unique entheogen I embarked on a series of experiments. This report covers my first four experiments.</p><p>My first experiment was casual. On the day I recieved the salvia, I impulsively decided to give it a try. I put clean water into my bong and got a bowl that didn't have any cannabis residue in it. Both of my room mates were out. It was approximately 4:00 PM. A single leaf, crushed, completely filled the bowl. I had read that it could take as many as 5 or 6 leaves to 'go', so I wasn't expecting more than peripheral effects. I smoked the leaf in 3 medium sized inhalations, set down the bong, and sat back with my eyes closed. I immediately felt almost struck. It felt as if my consciousness had been grabbed and pulled from my head. I could visualize it in space, about six feet to the left of my head, still connected and thrumming and vibrating. I heard a female voice, and opened my eyes to see who was in the apartment.</p><p>When I opened my eyes, I realized I was alone. Everything looked energized, with somehow more depth. The salvia seemed to rapidly dissipate once I opened my eyes, so I quickly loaded another leaf and smoked it in a few big tokes. This time I didn't achieve the trance. I simply felt a tremendous pressure on my head. I felt pulled to one side, and disoriented. I tried to walk around, and this intensified the sensation that I was being pulled to one side. I sat down and continued to feel strange for a short period of time.</p><p>My next experience occured later that week. In the meantime I had observed a fellow psychonauts 'breakthrough' salvia experience, and her reaction had left me a little anxious. This time, I loaded three good sized leaves into a special large bowl I had purchased for this purpose. My roommates were there to observe and 'babysit'.</p><p>The entire bowl was smoked in four giant hits. By the last hit, I was drooling quite a bit, and a heavy sweat had broken out all over my body. Again, I felt wrenched and as if I had been struck. I sat in the dark room, vibrating and trying to figure out what the hell had just happened. I was suddenly unclear as to where I was, who I was, and what I was doing. The whole room seemed to be vibrating. I was aware of my room mates, and knew that I knew them, but didn't have a clue as to who they were. I felt distinctly not-me, like I was someone else. The 'else' in question seemed to be at times an Indian, participating in some sort of ritual, and at times a kid in some seventies juvenile delinquent B-movie. I felt a pressing need to figure out what was going on, and this quickly brought me out of it. There was an after buzz that lasted approximately twenty minutes, though I felt slightly 'up' all night.</p><p>My third experience occured about a week later. I had moved into a new apartment with a new room mate. He and I decided to smoke the last of the salvia. He went first, and had a positive experience, which he always does with salvia. I loaded the bowl and sat on the floor with the two foot bong in front of me. I smoked the last three leaves in four large inhalations. Around the third hit, the salvia started to overtake me. Suddenly, I was unsure of where I was and, more specifically, when I was. I wasn't sure if I was sitting on the floor in my new apartment or on the couch of my old one the previous week. It felt as if I were in both places at once, smoking salvia. I felt I became unstuck in time. It seemed I was existing simultaneously in the past weeks trip, the current moment, and thousands of other times, both in the future and the past. Not only other times of my life, but of other's lives as well, all existing as a four dimensional hyperbeing linked through salvia. My vision had a very 'edged' aspect, as if everything had an extra dimension. While I was laying on the floor with eyes closed, 'time tripping', I didn't exactly see anything, but I had a definite sense of being in numerous places, a sort of mental map. As I came up out of the trance I was exhilirated, and started laughing in wonder and joy. I took a couple of hits of cannabis as the salvia faded to nothing, which seemed to have the desired result of synergizing with the remaining salvia, extending and enhancing the after 'buzz'.</p><p>My fourth and final (as of this report) experiment was with a different kind of leaf. A friend and fellow psychonaut brought some leaf he had to a get together. Everyone there took turns trying it. I smoked three or so leaves in five large bong hits. At the fourth hit I felt the now familiar onset of salvia, though it was considerably less intense than previous attempts. After the last hit, I lay down with eyes closed and tried to 'go with it'. The effects were much less than I had previously encountered, and I was unable to get far into it. I was very aware of the people around me, and I wonder if that didn't distract me from the trance. This last attempt produced only trace mental effects, though the body effects seemed to be present. I felt like I was skating along the edge of the trance, and couldn't quite break through. I suspect that the leaf had deteriorated over time, as one person present had previously smoked the same leaf and had much stronger results from it.</p><p>Of these first four experiments, I found the second and third to be the most intriguing. The third in particular, as I was more prepared for the shock of the onset of it. Both of those experiences seemed to have elements of time travel, or of existing in seperate realities simultaneously.</p><p>In all of my experiences, I get the impression that I am 'bringing back' only a small portion of what I am experiencing. The sensations come at a breakneck pace, and it is difficult to even hang on, much less pay attention to what is actually going on. All of my experiences seem to have a somewhat consistent aspect. They feel very real, in a strange way.</p><p>That is one thing I can not state strongly enough. Salvia is easily the most bizarre entheogen I have ever experimented with. The realm it gives access to seems vast and complex. I find salvia to be a unique, puzzling, and somewhat challenging entheogen. I look forward to further explorations in this dimension. </p>",
 "year": "",
 "id": "2159",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-26T07:00:00.000Z",
 "views": "6042",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ]
}
