{
 "id": 2159,
 "title": "Master Mindfuck",
 "date": {
  "submission": "2002-09-27T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "BlazingHussy",
  "gender": "Female",
  "weight": "250 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I had been very careful in my preperations.  I ate nothing after lunch on Saturday and a few spoonfuls of cottage cheese when I woke up with my coffee.  I ate nothing after that and drank only water.  I hadn't been taking anything OTC or Rx.  I had been reading anything I could find on AMT and was dosing with someone who'd experienced AMT's effects several times previous.",
  "Wow.  What a master mindfuck night that was.  I have never tripped that hard in my life.  But, oh god, how it was fun.  We dropped about 3:30 and then smoked a bowl and watched cartoons.  (We smoked several bowls during the trip.) About 4:15 we started feeling a little speedy, sort of twitchy and jittery.  From that point on it was a steady climb until around midnight for me and then I hit the plateau for a little while.  About 3 hours later I started to come down.   The comedown was slow and soft and with the help of a  tablet of something (the name of which escapes me) hed brought in case I wanted out of the trip early and another bowl I managed to go to bed successfully about 7am.  I never really slept, it was more like I laid there and didnt think of anything for about an hour at a time.  Then Id open my eyes, look at the clock and go back to sleep for another hour.  After 3 hours I was up and feeling a little nauseated since I hadnt eaten anything but a few spoonfuls of cottage cheese since the morning before.  I smoked a bowl and alls well now.  I just really dont feel like I could eat anything right now.  I still notice that I have some trisma and rocking left over from the night before and Im still a little jittery.",
  "I never did get a headache or nausea really last night.  Due to the visual disorientation caused by the massive amount of nystagmus I did feel something related to motion sickness but I couldnt truly call it nausea.  A Dramamine about halfway through the come up helped immensely.",
  "I have a spiky leaved plant in my sunroom and the hallucinations were stunning.  The plant seemed to be underwater waving gently in the currents.  I found if I stared at my ceiling for more than a few seconds the shadows would turn themselves inside out.  I saw two turtles in my turtle tank.  And although I knew the second turtles shell was really the end of the log Bob hangs out on, I couldnt make it a log in my mind, it was a turtles shell, the legs clinging to the log, head above water.  A Steinlen print on my living room wall was alive, in 3D and moving and it was very, very cool.",
  "Id read that the CEV (closed eye visuals) werent really all that spectacular.  Bullshit.  He put on some great music, lots of quiet bleeps and blorps and just really neat beats and holy mother of god it was amazing.  Lots of colorful kaleidoscopic patterns bouncing and twisting with the different tones.  The color seemed to be much more prominent in the OEV (open eye visuals) after I peaked and after having my eyes closed.  Id open them and see colorful flashing lights moving across the room.",
  "The amount of introspection this drug brings on was incredible.  I understood and dissected a million different aspects of my personality last night but forgot them almost as soon as Id realize what Id done.  A few did stick with me, but I think Ill keep those to myself.",
  "There were times, especially during the peak, when I needed bodily contact.  I snuggled up to him and put my hand on his knee.  At one point I reached for his hand and held on to it for a while. And there were several times where I would want that hand again, but could never quite come back to reality to do more than a rudimentary searching with my hand that never extended past a feeble waving/grasping motion.  I knew what was happening, but I couldnt stop it.  The objectiveness was VERY interesting.",
  "We did wander outside at one point.  And the light behind the pine trees turned them all to frosted, variegated green glass.  The crickets were everywhere and we could hear each individual call and where it was coming from all at once.",
  "At one point I saw two black cats dart across the top of my stove.  I had to double check to make sure it was just a hallucination and not my two cats playing on the stove.",
  "This was definitely a body intensive trip.  Gum was of vast importance as was pot.  Otherwise I really think the edginess of it would drive one mad.",
  "Great trip, most enjoyable and I do think Ill be doing this again.  I dont, however, think Ill be doing much of anything today.",
  "I recommend anyone who is considering taking this read as much as possible, be very careful as to what you eat the day before and be aware of any complications from mixing with any other chemicals you put in your body.  This is not a party drug and this could seriously fuck someone up who isn't prepared for the effects."
 ],
 "erowid": {
  "id": "17205",
  "citation": " BlazingHussy. \"Master Mindfuck: experience with AMT & Cannabis (ID 17205)\". Erowid.org. Sep 27, 2002. erowid.org/exp/17205",
  "substance": "AMT & Cannabis",
  "views": "19546"
 }
}
