{
 "id": 216,
 "title": "Very Comforting Experience",
 "date": {
  "submission": "2005-07-15T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Com. Marcos",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "I have recently begun to have a reclaimed interest in entheogenic compounds after having been completely 'clean' for maybe 5 years (no, not even any cannabis). I have had many experiences with psychedelic drugs, primarily falling in the 'let's drop a couple of hits of windowpane, get really f***d up and go dancing' range in my teens, but recently have been more interested in the personality exploring, mind expanding nature of botanical psychedelics when used in a respectful manner. After doing much research, I decided that due to many factors, I was really very interested in exploring the salvia experience.",
  "I procured a gram of Salvia and set myself aside a comfortable time to devote entirely to the experience with no distractions.",
  "To be honest, I found myself a little hesitant due to some of the horrible experiences I had read about, but decided to go through with the experiment. I situated everything I needed around my favorite chair, so that I had a place to set the pipe should I become immobilized (which I did), put on some nice Brazilian drum music (c'mon got to have the right atmosphere for a shamanistic experience) and smoked the stuff.",
  "First impression was 'Wow, NOTHING HAPPENED'except that I had this funny little piece of metal in my hand with smoke coming out of the top and had no idea whatsoever what it wasafter I got my self together enough to set the pipe down and relaxed again, I really started to enjoy the stuff. I had left the windows open, and as it was just a few minutes before sunset, the long yellow and orange afternoon light was under the influence of the plant, filling the room, to the point that I perceived (didn't SEE, but you couldn't have convinced me otherwise, strange) everything was being rolled flat under the weight of the light. Except that it wasn't oppressive, rather, all enveloping. Very strange. I had the impression (realization? I still don't know, it was simply as though a fact had become completely obviouslike finding something you had been looking for right under your nose) that the plants in my living room as well as my goldfish were extremely alive, were aware of my presenceliked me, and liked living with me (very weird thought). I don't know, it is a very difficult experience to explain. I am a very uncentered person, and have to say that the Salvia world is the first place I have felt that entirely part of what was going on around meI also got the impression that I was 'allowed' (hey, was the exact feeling, like being permitted to visit a beach or an office) to visit whenever I liked.",
  "Anyhow, just sat that for an hour rolling in this extremely comforting 'place' until it slowly wore off and I could safely move around again, although it took almost three hours for my thought processes to speed up to their regular, shotgun, 200 mph pace again.",
  "Different people have different experiences with different plants, (i.e. I personally find the THC experience absolutely horrifying) and as Don Juan tells Carlos in 'The Teachings of Don Juan' everyone has to find their own ally. I have without a question found mine."
 ],
 "erowid": {
  "id": "10221",
  "citation": " Com. Marcos. \"Very Comforting Experience: experience with Salvia divinorum (Extract - 5x) (ID 10221)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10221",
  "substance": "Salvia divinorum (Extract - 5x)",
  "views": "2975"
 }
}
