{
 "id": 2160,
 "title": "Heart/Breathing Problems",
 "date": {
  "submission": "2003-12-15T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "S-J",
  "gender": "Female",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "My first bad experience with pot was over the weekend, when I went around to my friends house to smoke. I was driving there and I had made it clear I wasnt going to have that much so that I still had plenty of time to sober up until I had to drive home again.",
  "I stupidly ended up having a bucket and it doesnt take much for me to get stoned at all, it hit me much sooner than usual also. It probably would have been about 30mins afterwards that my heart started to beat really really fast. I could feel it moving throughout my entire body, and it was pumping extra loud in my ears. This was scaring the shit out of me. I kept thinking I wasnt going to get home and I didnt want to be stoned anymore. I was stuck in this situation where I had lost all control over what was happening to me. The other people around me were stoned also, and I was trying to figure out if I should tell them what was happening or let it go. I think I made a few comments about my heart rate, but of course the whole paranoia thing was working against me on both behalfs.",
  "I was seriously thinking about telling them to call someone when I couldnt breathe properly. It felt like my wind pipe was closing in.. But I think it was just the fact that I was probably gulping in air trying to breathe but really making it worse. I had eaten a lot of food due to the munchies (pancakes, biscuits, ice-cream and we had finished off a whole block of chocolatemostly thanks to me.) So I was feeling pretty damn ill also.",
  "I went outside. and I was shaking badly. It was cold, but no one else was shaking as much as I was. People kept telling me I looked like shit.. and I felt it also. I was so scared as to what was happening to me and I kept asking if the weed was laced or not.",
  "When I got back inside I laid down and started to feel my heart beat relax a little.. And I would go in and out of my heart beating faster and slower, until it eventually relaxed to normal. Then the twitching started and I could feel occasionally my nerves twitching and my legs/arms slightly jolting every so often. These ceased after a while also and in the end I started to feel normally stoned.",
  "The whole stoned experience lasted about 3 hours, and then I was straight enough to drive safely. It was about 40 mins into the experience I started to feel a panic attack, and I assume that lasted for at least 20/30mins (my time skills were pretty distorted though) and I wasnt feeling really good until about the last hour.",
  "I have always enjoyed being stoned, but this was definitely a new experience for me. I think I will have weed again for sure, but only because I started to feel a nice stoned feeling towards the end. If I hadnt of felt this I think this experience would have scared me off doing it for a while at least. I am pretty sure all I had was a panic attack and not a severe reaction to the drug.",
  "Its still enough to say that something isnt right. Your body doesnt do these things for no reason. It was telling me something, and I think I can say that will be my last bucket for a long time and I will go back to smoking out of a pipe where I have controlled usage.",
  "Another thing is I had the fact I had to get home in the back of my mind. If I had of gone into the experience much more relaxed it probably would not have happened.",
  "Next time I am going to make sure I am not as uptight as I was before I smoke."
 ],
 "erowid": {
  "id": "17206",
  "citation": " S-J. \"Heart/Breathing Problems: experience with Cannabis (ID 17206)\". Erowid.org. Dec 15, 2003. erowid.org/exp/17206",
  "substance": "Cannabis",
  "views": "17639"
 }
}
