{
 "title": "A Million Points of View",
 "author": "RandomStu",
 "citation": " RandomStu. \"A Million Points of View: experience with Salvia divinorum (ID 2160)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2160",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "",
   "2160",
   "Male",
   "",
   "Not Given",
   "Jun 26, 2000",
   "3119",
   " "
  ]
 ],
 "report": "<p>I started with 2 bong hits of regular dried of Salvia Divinorum. By the end of the 2nd hit, I could sense reality melting (visually & otherwise) around the edges, so I stopped & lay down. Interesting feelings & a nice clear mind that lasted for at least 15 mins, but no real voyage. It was more along the intensity of a big pot experience, & in this state (at least after the first minute or so) I could happily discuss what I was feeling with my sitter.</p><p>Within an hour, I tried again with 3 bong hits. They weren't all huge hits. I lay down & felt pretty normal for maybe 20 seconds.</p><p>The first change was in my body perception. I could still feel, in a pretty normal way, the left side of my body, & also the right side. But there wasn't a unified sense of a body. Then, there was a sense of this split multiplying (from 2 parts, to more, to many more).</p><p>I'd definitely intended to keep my eyes closed, & they may have been closed at first. But next thing I knew (there was a moment of blankness in there, I think), my eyes were open & I was viewing the ceiling in a very odd way. (This of course getting into indescribable stuff, but it's my best shot.) It was like there were a million different points of view, & I was seeing through all of them, or perhaps jumping very quickly from one to another. Hard to say which, since time didn't seem to be running normally. I kinda wondered whether time had stopped & I was experiencing all these different things in the same moment, or whether I was jumping back & forth among different moments. I was aware of 'my' body, but in a different way (not necessarily pleasant or unpleasant). It was something like my 'I' was floating in the body, seeing through the eyes in that unusual way but there wasn't the normal sense of being the body. I think I was aware of a quickened heartbeat, at least at some point.</p><p>There was a bit of fear at such a strange state, but at some point I remembered that I'd smoked, & that it was like I was on a temporary roller coaster ride. From my floating 'I', the idea arose that I should let my sitter know that I was OK in there, as if he was watching my body explode into a million pieces! In another moment -- I'm not sure, but I think I realized that my experience was subjective. In any case, getting those lips & tongue to move in order to communicate with the sitter was out of the question for the moment.</p><p>As I went out, as if sailing away from unified reality, connected only by a thin bungee cord I think I sensed that I was approaching a limit of fragmentation, as if there were a wall, & maybe something on the other side. I was ambivalent at best about crossing over. The bungee began to pull back, & the parts began to de-fragment, bringing me gradually closer to consensual reality.</p><p>At some point, I clearly recognized my own breath, & took a breath or two with extraordinarily heightened awareness. Eventually I found my lips & tongue, & all I could say to my sitter was 'Wow.' He said, 'Wow what?' & I laughed.</p><p>This seemed to all happen in a minute or so, but could have been 5 or more. I was soon able to sit up & communicate, & for 15mins to half an hour my mind was quiet & my perception clear, & I was drawn to deep questioning of reality (in a pleasant way). For a while, I also had some rushes of body feeling, which were also pleasant.</p>"
}
