{
 "title": "Opiates for Anxiety",
 "author": "Xedd",
 "citation": " Xedd. \"Opiates for Anxiety: experience with Hydrocodone (ID 21615)\". Erowid.org. Mar 4, 2007. erowid.org/exp/21615",
 "substance": "Hydrocodone",
 "bodyweight": "66 kg",
 "report": "<p>Opiates for Anxiety</p><p>Ive been using opiates regularly for almost a year.  Am I an addict?  Probably.  Though I solely use them in social settings (rarely by myself) to enhance my own level of social interaction and beat down anxiety.  I have been diagnosed with social anxiety disorder, among a few other things.  I have found that the Klonopins, Lorazepams, and Xanax just dont cut it.  The only thing I have found to be completely affective in warding off my panic attacks, nervousness, etc. is opiates (primarily Hydrocodone, but Ive done lots and lots of Codeine and Percocet, and when Im lucky Ill come across some Oxycontins or Morphine).</p><p>I am aware that regular Acetaminophen doses are extremely hard on the liver, so for about the last 4 or so months Ive been using a cold water extraction technique to alleviate this problem when Im dosing with Hydrocodone.</p><p>So, every morning before I head out the door to class I measure out a dose of Hydrocodone.  I typically measure 45mgs worth of pills from a valid prescription I received for some severe migraines I was having, crush them up, soak the powder in approximately 4ml of 39 F degree water for every pill and wait 20-30 minutes as the solution sits in the refrigerator (while stirring every 5 minutes).  Also, I usually drop a few ice cubes in the mix to drop the solutions temperature much faster.  (Hydrocodone is soluble in water while Acetaminophen is only slightly so).  After the time is up I proceed to pour the liquid into a bleached coffee filter, allowing it to drip (filter) down into a small glass or cup.</p><p>I enjoy dosing this way more then any other way due to a couple of factors. 1.  Its safer and healthier.  2.  In liquid form opiates tend to hit (effect) me much more quickly.  The only really downside to this method is the taste of the liquid, its terribly bitter.  To counteract this I have used Crystal Light or Stevia (a natural sweetener found at most health food stores).</p><p>This account is of my most recent Opiate (Hydrocone experience).</p><p>T 0.0m  I dose down 20mg of liquid Hydrocodone (half of what I prepared), before I go to the store, and then on to school.  I hop in my car and get going.  I am aware there are precautions about driving on opiates but I myself have never felt unable to operate my car.  In fact I rather enjoy driving on opiates.  Its very relaxing.</p><p>T 10m  I feel a warm tingle originating from the base of my spine shooting the slightest bits of euphoric impulse all throughout my upper half. </p><p>T 20m  The same tingling sensation is causing moderate euphoria at the moment.  I am very relaxed.  I feel comfortable and appreciative of every person who is around me.</p><p>T 45m  Im absolutely intrigued by everyone, the future seems so completely clear.  I am able to conceptualize the exact tasks I need to accomplish in order to reach the future I desire.  I feel excessively euphoric and a bit itchy around my nose and eye brows.</p><p>T 120m  Im starting to feel the lovely opiate euphoria decrease.  Ill probably redose in about another 30 minutes.</p><p>T 150m  I redose.  At this point Im feeling somewhat irritable and uncomfortable.  That feeling almost instantly went away due to the fact that I know the opiate will soon be affecting me once more.</p><p>T 220m  I feel great!  I know the high will last me throughout the rest of my classes.  I dont mind being sober for the remainder of the night, though I know Ill be irritable and sort of pissed off.</p><p>I strongly recommend you dont get involved with Opiates.  They havent damaged me in any perceivable manner as of yet but I can foresee the road they are leading me down, and it isnt a happy one.</p>",
 "year": "2003",
 "id": "21615",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-04T08:00:00.000Z",
 "views": "60902",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(extract)"
  },
  "1": {
   "time": " T+ 2:30",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(extract)"
  }
 }
}
