{
 "title": "Fear, Paranoia, and Happiness",
 "author": "Strange Journey",
 "citation": " Strange Journey. \"Fear, Paranoia, and Happiness: experience with Cannabis (ID 21649)\". Erowid.org. Jun 18, 2007. erowid.org/exp/21649",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>School was over, it was around 2:30 and me and a few of my friends decided to smoke.  It started out just like it normally did, 4 of us, sitting in my car in a construction site, taking incredible hits out of our 12 inch bong.  My first hit took me by suprise, I began coughing, a lot.  I kept on coughing until suddenly I realized I had another hit coming to me.  Good, I thought to myself, I'm happy I get to have some more of this, I want to get really high today.  I had no way of knowing what kind of very strange experience I was about to have. </p><p>The rest of the story is first person, what I was thinking in my head while this strange trip was happening:</p><p>After my second hit, I coughed even more, and decided, 'Maybe I should slow down, no, wait, maybe I should just stop.  Maybe I'll turn up the music, get my mind off the slight paranoia that is beginning to settle in my brain like a worm burrowing into an apple.  Wow, what the hell am I talking about.'  I turn the music up.  My friends keep passing the bong around.  'Don't do it' I thought, 'Don't take another hit, you will not like what you'll get.'  I decided to listen to my brain for once, and instead, I tried to come up with an excuse for not smoking anymore.  I suddenly yelled, 'I'm thirsty, who's thirsty, anyone thirsty, because I am, maybe I'll just eat some snow.'  That is exactly what I did, I crawled out of my car, and ate a handful of snow.  As I walk back into the car I think 'Wait a minute, that was kind of strange, why would I ever do such a thing.  Something is different here, very different.  Maybe I'll just look around and see what my friends are thinking.'\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>So I looked around and they are all waiting for me to do something.  'Oh, ya, ummm, lets go' I said, and slowly prepared myself for a drive.  I turn out of the construction site and am instantly lost, aware that my hand is fidgeting at a ridiculously rapid pace, I don't care, because it keeps my mind off the racing heart and the meaningless fear and paranoia.  I make it out of the streets, and go towards a parking lot for a supermarket.  Blurriness, everything molding into a ball which is turning at the center of my vision.  'Huh?  What the hell?'  That was all I could think.  HONK!!!  I was inches away from slamming into a car.  I tried to stay calm, and went into a parking space, the farthest one from the store.  'I could use a walk' I thought.  'Hey can you get me a gatorade'  my friend says to me. 'Sure', I said, 'I'll be back'. </p><p>I made my way into the store, cycling in a loop of fear, paranoia, and absolute happiness.  Unfortunatley these cycled so quickly that I thought that they were all happening at the same time, so I felt almost like the past and future was the present, and the present was the past and the future.  My mind was completely distorted. 'Wow' is all I could think.  I grab a soda at a fridge, and open it.  I began taking laps around the store, while drinking the unpaid soda.  'Hmmm. Now what was it that he wanted, gatorade, right.'  I walk towards the gatorade, or at least I though it was gatorade.  When I got close, I realized it was powerade.  My mind twisted in horror.  I couldn't believe the way my eyes had played tricks on me.  'Okay, calm down, why are you so scared, you've been through this before, you've never gotten scared like this' I thought to myself.  At that moment, fear and paranoia went away. All that was left was happiness, and no control of my body whatsoever.</p><p>The director of my body decided to make me walk up and down every isle, if I saw someone, I felt quick panic, and tried to look interested in the products.  'Just look interested, they can never fool with your mind that way.  Especially that old lady right there, be careful, they make you feel guilty, paranoid, and fear.  Wait, its just an old lady you fool, just buy the damn coke like your supposed to.'  So I droop unwillingly toward the register, and I look straight at the lady at the register, hand her my wallet, and say 'Thank you for your help.'  The lady looked at me, speechless.  'I'm sorry, a little tired I am.'  I mumbled, and took my wallet back and paid for a coke and a candy bar.  The candy bar somehow got replaced with gatorade in my mind, strange. </p><p>I walk out to the car, 'Oh shit, I must have been in there for ages' I thought.  My friends all look at me, and I say 'Here I can't remember what you wanted, so I got this' and I handed him the chocolate.  Then I mumbled, 'U guys wana just stay here for a while?'  They were like 'Dude were in a parking lot, its kinda sketchy.'  'Ok, I duno if I can drive though, I'm really messed up.'  I said.  So my friend says he can drive, and he drives everyone home, and then I get in the car when we get to his house.  I get back to my house, finally alone, and watch a movie. After this, I just drifted off into a peaceful daze, amazed by what had happened to me. The high wore off at around 6:00pm, but the after effects are lasting up to the time I'm writing this now, which is 9:00pm.</p><p>Although it was a scary experience at some times, it was also a fun and amazing one.  Something that in the long run, am glad that happened, but wouldnt want to go through it again.  I learned that thinking too much while smoking, especially bongs, will cause you to feel this way.  This was not just a high, it was more of a journey.  Everything was molding into each other, kind of like a strange movie, or reality tv show or something.</p>",
 "year": "2003",
 "id": "21649",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-18T07:00:00.000Z",
 "views": "3419",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
