{
 "title": "I Just Melted Away",
 "author": "Holdon Kundera",
 "citation": " Holdon Kundera. \"I Just Melted Away: experience with 2C-C (ID 21642)\". Erowid.org. Feb 26, 2003. erowid.org/exp/21642",
 "substance": "2C-C",
 "bodyweight": "155 lb",
 "report": "<p>[Erowid Warning: The following report documents the ingestion of an unusually high and potentially dangerous dose of 2C-C.  We have chosen to include this report to help document the dose range, but its inclusion does not imply that this dose is safe.]</p><p>On Friday, February 21st, 2003, I went to a party at a friends house.  I had been very depressed for a week or two.  At around 12 I insufflated 40 mg of 2C-C.  I heavily drank beer.  I either lost or ate another 40 mg capsule at some later point, I can't remember.  I had a similar as before, but much more sedated.  Trails of dots following cigarettes, rapidly jumping thoughts, etc...</p><p>When I woke up at noon on Saturday, the 22nd, I immediately insufflated 120 mg of 2C-C.  I broke it into two lines and snorted 1, then the other about 10 minutes later.  I had to focus to do the second line.  I was still a little under the influence from Friday, and it hit me fast.  I heard voices, laughed continuously, saw quick lines of color, had rapid thoughts trying to find significance in the most basic ideas and processes, and felt extremely internal.  I went outside and laid down on the stairs, cold rain drizzling on me.</p><p>After around 20 minutes I went inside and lay down on the couch and became very cold, yelling and laughing for blankets.  At this larger dose, I felt complete vertigo, both physically and mentally.  I wanted company, but felt like a burden to my friends who were there.  I could not stand or light my own cigarette.  I laughed, and talked little.  The vertigo is the part that was completely new; its hard to describe.  Just a strong desire to pull all the way inside myself until .</p><p>I had many questions that I asked myself, but few answers.  This lasted strong for around 4-5 hours.  I went home, and my internal thoughts turned into dazed depression.  I cried and felt hopeless.  I had been feeling very down for the last couple of weeks, and this brought it all down on me heavily.  I ate some pizza with my friend and smoked a few bowls of pot.</p><p>I remained depressed until I went to sleep at around 10.  I felt much, much better the next day.  I don't think I will take that quantity of a substance I don't know that much about again when I am depressed.  It was a learning experience, though.  It gave me several deep questions about myself that I am soberly contemplating.  I do not regret the experience.</p>",
 "year": "2003",
 "id": "21642",
 "gender": "Male",
 "timestamp": "2003-02-26T08:00:00.000Z",
 "views": "16889",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "2C-C"
  },
  "1": {
   "time": "",
   "amount": "120 mg",
   "administration": "insufflated",
   "substance": "2C-C"
  }
 }
}
