{
 "title": "The Devil's Secret Weapon",
 "author": "Truth Be Told",
 "citation": " Truth Be Told. \"The Devil's Secret Weapon: experience with Crack (ID 21640)\". Erowid.org. Apr 15, 2006. erowid.org/exp/21640",
 "substance": "Crack",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Crack",
   "(freebase)"
  ]
 ],
 "report": "<p>In my early years (junior high, high school) the only experience that I had with drugs was the joint I copped off of my brother's dresser ... when he got home I was busted because I had fell asleep on his bed. After that time I rarely participated in drug related activities ... even at the bequest of family and friends.</p><p>It was April of 1988, on my way home from the club, I had picked up someone who was on foot leaving the club and offered him a ride home and I had thought to stop at a convenience store to pick up some chips and a soda before making my way. It was at this store where we ran into a couple of 'hot chicks' who inquired if we wanted to 'party' of course the two of us didn't want to turn that down so we agreed in unison ... once out of the store,these girls expressed an interest in getting high by smoking cocaine (if I had only known the destruction that would have for my future). I suppose I could have taken a cue from the guy I had picked up when he at the time of their offer made clear to 'just take' him home ... but not me ... that just meant more women for me ... lucky me (ha).</p><p>Let me just say this ... it's been fourteen years of nothing but pain and misery ... yeah, the high is a blast, but the pain I dish out to the ones that love me and the self-inflicted pain is not worth the temporary, ever having to chase after to get more of the same high or higher high (if that were even possible) high that crack cocaine never truly delivers! It was created to make me want more and for you to never quit.</p><p>I have gone from state to state - rehab to rehab - job to no job - I for one understood what Carrol O'Conner's son was going through when he blew his brains out ... I have had many times when I thought like that ... but then rememberd I had always said 'I'd be homicidal before I'd be suicidal' so those thoughts were as temporary as the high of crack cocaine.</p><p>Bottom line is this ... a physcholgist put it like this ... 'if you were to ever try crack cocaine, let it be with the last breath you have in your body!'</p><p>I'm on a mission to be free from Satan's secret weapon ... and I believe that God is in agreement with me ... so perhaps one day soon I will become a useful member of society once again!</p>",
 "year": "2003",
 "id": "21640",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-15T07:00:00.000Z",
 "views": "9335",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 ]
}
