{
 "title": "A Collection of Salvia Reports",
 "author": "Various",
 "citation": " Various. \"A Collection of Salvia Reports: experience with Salvia divinorum (ID 2166)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2166",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "",
  "Salvia divinorum"
 ],
 "report": "<p>From: Michael H.</p><p>Subject: Salvia Divinorum--Smoke, don't chew!</p><p>Newsgroups: alt.psychoactives</p><p>Date: Aug 1994</p><p>A friend stumbled across a reference to smoking S. Divinorum in Jonathon Ott's 'Pharmacotheon.' Guess what? It works! Having tried to chew the stuff, which was unsuccessful due to the INTENSE bad taste (and I'm one who has chugged down a lot of harsh liquids in my entheogenic studies) I was really surprised at the effects--an immediate, intensely weird buzz that lasts for about 5 to 10 minutes. It is truly bizarre--I can't come up with any comparison with any other substance. It is a very powerful, yet short-acting trip. Definitely beats chewing the stuff, which is reminescent of chewing dirty poison ivy.</p><p>Anyone else aware of this intriguing plant? I'd be interested to hear of others' experiences in the realm of S. Divinorum.</p><p>Professor Pan</p><p>From: Kermi</p><p>Subject: Re: Salvia Divinorum--Smoke, don't chew ! and grow too.</p><p>Newsgroups: alt.psychoactives</p><p>Date: Aug 1994</p><p>I'll step forward and derve as Guinea Pig. I'm growing cuttings now but they are growing very slowly. I've tried outdoors in a pot and in the shade, and no bushy growth , just longer and stronger stems..  Any idea about how much plant material is required to smoke in order to get an effect?</p><p>I've chewed 10 leaves as a maximum dose and had no effect. Maybe saliva (not salvia) or stomach acids destroy the psychoactive compounds before they get to the brain. So smoking may be a better delivery route, it' doesnt have to go through spit and bile before it hits the bloodstream.Unless maybe you have fasted for 2 or 3 days and your system at that stage will immediately absorb the goodies prior to destruction.</p><p>I'm still skeptical though about smoking Ska Pastora , the other post said that the psychoactives might be all gone two hours after harvest.. This does not spell a strong argument for smpking , because if they're gone that suggests evaporation or oxidation. The same thing that happens when you burn plants. So , I wonder if the goodies are not liable to burn up in the bowl before hitting the lungs.</p><p>Also, two hours after harvest would not allow enough time for drying. How do you smoke green/wet leaves? I guess I could sacrifice one leave to find out.</p><p>These are difficult plants to grow, So far. Any one have a few tips?</p><p>From: Anonymous</p><p>Subject: Salvia Divinorum --smoke, don't chew</p><p>Newsgroups: alt.psychoactives</p><p>Date: Sep 1994</p><p>Especially if you don't have a huge plant, you don't need to chew. About three large leaves and a water pipe has been enough for two people,speaking from experience. You need to let each other have about six or seven 'inhalations apiece, depending on the leaf size is how many leaves you need. It lasts about 1-2 hours in different stages. By the way, a humidity tent is a must, as well as for more exotic plants like B. caapi and P. viridis, if you live in a dry climate.</p><p>From: hooten</p><p>Subject: Re: Salvia Divinorum--Smoke, don't chew ! and grow too.</p><p>Newsgroups: alt.psychoactives</p><p>Date: Aug 1994</p><p>Well *I* can tell you that smoking dried leaves *does* work, and the leaves are supposed to be chewed and kept in your mouth for at least 15 minutes, so the active constituents can absorb their whay through your cheek and gums into your bloodstream.  There may be something in your stomach that breaks it down.  It is believed that the indians would take up to 70 leaves, but this number was not necessary, just that it took about 15 minutes to eat that many, and hence, have leaves in your mouth for that long.</p><p>I can't confirm the oral route, although it seems pretty clear from what I have read and conversed with other people.</p><p>From: pla</p><p>Subject: Re: S. Divinorum (Diviner's Sage)</p><p>Newsgroups: alt.drugs</p><p>Date: Oct 1994</p><p>Ayahu (ayahu@aol.com) wrote: : In Dekorne's fall issue of Entheogen Review someone (RN of WY) describes : an intense out-of-body experience after 'smoking two or three consecutive : bong hits' of S. Divinorum. He says 'it is very potent'. As in the case of</p><p>well, that's good for him, but in my case i smoked (rather painfully... that shit burns *hot*!) close to 2 grams with no effects whatsoever...</p><p>From: Pentarexx</p><p>Subject: Re: Salvia Divinorum</p><p>Newsgroups: alt.drugs.psychedelics</p><p>Date: Nov 1994</p><p>2 live plants purchased from ...OTJ Dried 5 leaves over a period of 2 days, rolled into a joint and smoked no result.</p><p>Took the rest of the fresh leaves from the plants, (approx. 9 leaves) rolled into quid, stuffed in mouth. Waited 45 minutes. No chewing, no swallowing, no results.</p>",
 "year": "",
 "id": "2166",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-26T07:00:00.000Z",
 "views": "4148",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Salvia divinorum"
  }
 }
}
