{
 "title": "Trying Valerian as Anti-Anxiety Treatment",
 "author": "Coward",
 "citation": " Coward. \"Trying Valerian as Anti-Anxiety Treatment: experience with Valerian (ID 2175)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2175",
 "substance": "Valerian",
 "bodyweight": "",
 "report": "<p>First off, you should know that it really does smell like dog shit, or the bathroom at a Mobil station (others have described it as dirty socks, etc...)...</p><p>I've got a bit of depression, anxiety, etc.., and I'm also interested in recreationals/entheogens, so I decided to give valerian a try as a sleep aid/anxiety cure, kava being fun, but leaving me with withdrawal, and melatonin having the tendency to leave me knocked out the next day (therapeutic doses of melatonin vary widely for me, and they don't often convince me to sleep - I just stay up through the active period and leave my biological clock completely fucked..)... but anyhow, I'm supposed to be talking about valerian.</p><p>I started taking a capsule at night a week ago, and the first day or two sucked - It worked well at night, but the next morning I would wake up feeling bent, something like a cross between marijuana and valium - overly relaxed, and my short term memory was gone. For some reason, I decided to keep up with it, even though I felt like true hell... well, lo and behold, after that day, everything has been fine, I've been a bit more relaxed and tend to fall asleep at a 'reasonable' time (usually a bit early, actually)... as for dream potentiation, I thought melatonin dreams sucked, but valerian dreams are worse - seems like my brain runs through all the situations and anxieties that the valerian has let me ignore while conscious... although there's barely any memory of them after I awake.</p><p>I decided to get a better idea of the dosing curve, so I tried two capsules two nights ago, and then 3 last night... (recommended dose is 1-2 caps)... 2 seemed to be a bit more effective but for a bit more loginess in the morning, but 3 seem to have left me with a big headache now that they've worn off. I'm guessing this probably has a minor withdrawal syndrome, like kava, so if you're taking two caps a day and you're about to run out, I'd say that you'd want to move down to taking one cap a day to avoid any shock to your system when you stop taking it... I've also heard rumors that the actives are related to valium, so drinking while taking it is probably a bad idea (not that mixing tranquilizers/depressants is ever a really good idea..)</p><p>Synopsis: Not very recreational, pretty good as a therapeutic, if you can stomach the odor, and if you're using it therapeutically, don't give up if you get side effects during the first two days as I did.</p>",
 "year": "",
 "id": "2175",
 "gender": "Not Specified",
 "timestamp": "2000-06-26T07:00:00.000Z",
 "views": "38809",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  }
 }
}
