{
 "title": "Good Effects, but Am I Reliant on It?",
 "author": "digital caveman",
 "citation": " digital caveman. \"Good Effects, but Am I Reliant on It?: experience with 5-HTP (ID 21798)\". Erowid.org. Dec 30, 2004. erowid.org/exp/21798",
 "substance": "5-HTP",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "75 mg",
  "oral",
  "Tryptophan - 5-HTP",
  "(daily)"
 ],
 "report": "<p>I've been taking 5-htp for 2 months now. So, I am familiar with its effects. I took it for a mood lift, and to see if it would help me sleep. I took 50mg once every other day usually, but it varied. Here are some observations of more immediate effects:</p><p>Mood lift- yes, it seems to reverse depressed feelings, and lower anxiety</p><p>Sleep- seems to induce a light sleepiness that lasts about 2 hours (50mg), increased dreaming is recalled.</p><p>Anxiety- lowers anxiety short term</p><p>Decreased Appetite- this is what a lot of 5-htp is sold for. Yes, an undesired effect of low appetite and slight upset stomach were noticed up to 6 hours after taking it.</p><p>Drug interactions- weed: increases high significantly. 2C-I taken 8 hours after: increased euphoria. 100mg taken 4 hours after mdma helped make a smoother comedown. GBL, alcohol: not a good combo. Increased sedation, less euphoria.</p><p>After being on it for 3 weeks (50mg once a day), I noticed if I hadn't taken it for 2 days, I would feel depressed, anxious, and lousy, definately more so than normal. I still notice this, even if I just missed 1 day now. The body relies on the external source, and that doesn't sound good.</p><p>I will keep taking it, right now it is 75mg once a day. This morning I woke up feeling terrible and anxious. But, I took a 5-htp to experiment, and 2 hours later I felt fine.</p><p>Be careful taking it long term. I will probably quit soon, I feel almost dependent on it. It works 100x better than SSRI's like paxil and celexa in my opinion. Those drugs only caused me problems.</p><p>I was looking up info on 5-htp, and found a vitamin store selling it. Theyre recommended dosage was 100mg 3X a day. This pissed me off, how greedy and inconsiderate they are. Doing that for a while would definately mess with my brain. The recommended dosage on the bottle I have is 50mg once a day, or 75mg once a day. This even may be too much after a while.</p>",
 "year": "2003",
 "id": "21798",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-30T08:00:00.000Z",
 "views": "34112",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP",
   "form": "(daily)"
  }
 }
}
