{
 "title": "Wormwood is a Flea Repellant",
 "author": "Moron",
 "citation": " Moron. \"Wormwood is a Flea Repellant: experience with Wormwood Oil (ID 2179)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2179",
 "substance": "Wormwood Oil",
 "bodyweight": "130 lb",
 "report": "<p>Many years ago a friend suggested that I might want to try oil of wormwood out since that was what was in absinthe. At the time my frame of mind was 'anything to get high' and I didn't really care that much if I lived or died (pretty disenfranchised punk street kid). Anyways, I said sure, why the hell not. They had this little bottle of 'essence' they had bought at a health food store and the intention was to try out just a few drops. I tilted the puppy back and 'glug', the whole bottle's worth went down my throat by accident.</p><p>This is foul tasting stuff let me tell you. Think essence of cedar or shots of Pine Sol. I managed to keep it down but felt queasy for the next few hours. After a while I ended up walking around with a friend but wasn't really feeling anything. Suddenly I started feeling a bit sick and then I blacked out. I came to later on in an ambulance and according to my associate I was walking along and then suddenly collapsed and started convulsing. He started screaming for help and someone called an ambulance. According to him the convulsions just stopped and he said that he put his head to my chest and couldn't detect a heartbeat so he started giving me crude CPR and then the medics arrived and away I went to hospital.</p><p>Whether my heart really stopped who knows but for anyone thinking of playing with oil of wormwood you should know this: After I recovered I went to the health food store to ask what they actually sold this stuff for. The answer was as 'flea repellent'. You put a few drops of oil of wormwood on your dog's collar and the fleas stay away. Think about that before you test some out or your trip may be funkier than a chicken if you get my drift. Categorize this stuff with model glue and mystery pills.</p>",
 "year": "2000",
 "id": "2179",
 "timestamp": "2000-06-26T07:00:00.000Z",
 "views": "55745",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "(extract)"
  }
 }
}
