{
 "title": "DWAI that Should Have Been Avoided",
 "author": "Arjuna",
 "citation": " Arjuna. \"DWAI that Should Have Been Avoided: experience with Alcohol & Cannabis (ID 21827)\". Erowid.org. Mar 6, 2003. erowid.org/exp/21827",
 "substance": "Alcohol & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Alcohol - Hard",
  "",
  " ",
  "",
  "Cannabis"
 ],
 "report": "<p>Reported Dose: 8 Mixed drinks, 2g cannibis</p><p>It was my 22nd birthday party, and I had been drinking throughout the night. At around 11:30pm someone had asked me for a ride home. I obliged, knowing that I was sober enough to drive. At the time, I suspect I was near the legal limit when I got behind the wheel. And then I made two of the worst mistakes of my life. By the time I arrive at my friends house, he decides that he doesn't want to go home yet, and suggests that we have another drink. 'Cmon man, its your birthday!' He says, and I obliged. One drink turns into six, and by last call I was completely intoxicated. At this point my friend wants to come stay at my house, so we start heading back, knowing that the whole trip was pointless to begin with.</p><p>At this point I made the second mistake that ended in my downfall. I began to feel invincible. I decided in my delusional state to run every red light from downtown to my house. My luck ran out when I blazed through a red light at well over 60 miles an hour, coming within feet of striking a squad car. I was immediately pulled over, road tested and arrested.</p><p>By the time I was detained and processed, I had a blood alcohol level of .167, double the legal limit for a DWAI, and .067 over the DUI limit. At this point I was hauled off to detox, where I was held against my will until 11:30AM the following morning. After my arraignment, plea bargain and sentencing, I lost my license for three months, was forced into alcohol therapy sessions for six months, and ended up paying well over $2000 in fines, fees, and inflated insurance costs.</p><p>Ultimately, I consider myself fortunate. If I had ran that light 3 seconds later than I did, I would have been prosecuted for vehicular homicide of a police officer. The cop I nearly hit may have very well saved my life.</p><p>Please, don't drink and drive. I thought I could handle my liquor, until I lost all sense of rational behavior. As the old clich says: 'The life you save may be your own.'</p>",
 "year": "2001",
 "id": "21827",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-03-06T08:00:00.000Z",
 "views": "22193",
 "dose": {}
}
