{
 "title": "Soaring to Higher Orbits",
 "author": "Grant McHerron",
 "citation": " Grant McHerron. \"Soaring to Higher Orbits: experience with 2C-B & MDMA (ID 2182)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2182",
 "substance": "2C-B & MDMA",
 "bodyweight": "",
 "report": "<p>All around him is dark yet he can sense the many people he shares the space with. His hands raise above his head and the laser pops flash as he presses the buttons with his complaining, over-worked fingers. Someone must be getting his signal, here or in another land, another dimension, a place where even now the sun is shining and the air is warm... He has gathered together with like-minded folk to worship shared gods. They are gathered close to the front of a large hall in the lee of a great dias, monolithic towers looming on either side. A movement on the raised platform draws his attention as he again ignores the sweat running over his body from his manik exertions during the previous bout of music. His vision blurs from the 2CB he has consumed in epic quantities, his gestalt grows to surround those around him as the E he has also recently taken makes contact with the ids of other partakers of the blessed E. A lithe figure beside him returns his grin - who could she be???...</p><p>The movement becomes figures as two gurus approach their respective altars, priests ready to sacrifice to the great god of techno - arcane idols are placed around the altars, a chicken and some sheep. A beanie wearing head appears over the edge of the altar on the left and its hands are raised - to the right, another figure seems to be doing the same. Discs of some bizzare plastic substance are placed on the altar and the priests of Techno begin their ritual - music swirls and sounds emerge. The crowd screams and the trance begins as more and more people join the rapidly increasing numbers of space cadets, launching to a higher orbit. Lights flash and the music lifts, carries, drags the listener into greater and greater stages of bliss. Forgotten words are exchanged with those around him as auras of pure joy increase around his being. The crowd sways and people moan, screaming out in joy as familiar riffs and samples boom out from the massive towers around the altars. He is joining in, his laser pops flashing and waving, disappearing into his mouth as he sucks greedily on the watermelon candy, its light illuminating his cheeks. Above him, the priests are engrossed in their rituals as discs are spun and exchanged...</p><p>Suddenly a crackle and the sound distorts somewhat, never becoming the same again as the assistants to the priests become over-zealous in their attempts to overwhelm & entrance the adoring crowd below...</p><p>Looking at the lights, his head back, and the 2CB cuts in again, his mind stepping even further out of his body, only to be bought back lovingly by the music to find his body swaying and feet moving to the groove... Again and again he soars to higher orbits as he shares the adventure with those around him. The music peaks and his body goes with it, his mind engrossed in the images and sensations surrounding him... Lights flare around him and he is bathed in their glow, bizzare images that do not seem real leaping into view, burned forever into his retinas... Higher and higher he soars in his capsule, sharing grins with those around him, all engrossed in the vibes the priests are producing from their altars...</p><p>Suddenly, it is over. It has lasted for ever but was over in seconds. He wonders why it can't go on - thunderous roars as the priests step back from their altars, their tasks done, as another soul steps forward to take their place. The crowd dies down, many turn to leave, and as the music starts up again, he begins to dance harder than before the show, harder than he ever has before, as the incredible energy he has stored up during his worship is released through his feet and hands. The crowd parts, many join the dancing, but some begin to leave. Eventually the music changes and the vibe has broken, never to really return, it is gone, lost, but it will return on another night...</p><p>He grabs a drink of water and washes his parched throat, standing on the side of the crowd watching, wishing he had the energy to get into the hardcore. Eventually it returns and after time spent mumbling with friends off the floor ( a floor where the vibe has turned ugly and the crowd is pushing, hogging their space and hating those around them ), he rejoins a somewhat emptier, happier floor and begins dancing to the beat once again, not as ecstatic as before, but the energy is there to use...</p><p>He finds himself standing, the residuals of the 2CB washing over him. It makes him want to hug and cuddle but there is no-one there he feels comfortable with, his friends are scattered and the others in the crowd are strangers, he has no desire to make a fool of himself or screw up someone else's night, so he keeps his desires to himself, pulls inwards and watches, feeling a little sorry for himself...</p><p>Suddenly, a friend is before him waving wildly 'Come on, you Ozzie bastard!' and he is dragged back into the centre of the floor, pointed in the direction of the dias. SHOCK! One of the altars has been removed and a new guru stands at the remaining slab, spinning music he can move to. He grins at his friend as the smoke rolls over them and the lights flash around. His laserpops shine beams of light through the cloud and he begins to move his hands madly around him, sending shafts of color out through the mist. Happiness returns thanks to the music and his friend, he dances on until the music stops, the plug is pulled and the crowd is cheering the guru, sharing his anger at the rude method used to end his act...</p><p>Eyes blinking wearily, it is 6:15am and he is one of the last to leave. His friends are nowhere in sight and the queue for the after- hours stretches before him across the street. He can remember all he has seen, heard and felt, almost every minute of the 7 hours can be recalled, but it all seems so short, why can't it go on forever? The vibe is gone and he has things to do later today, he starts walking down Broadway and by 7:30, he has arrived at the World Trade Center where his friend's appartment awaits....</p>",
 "year": "",
 "id": "2182",
 "gender": "Male",
 "timestamp": "2000-06-27T07:00:00.000Z",
 "views": "42298",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "2C-B"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ]
}
