{
 "title": "First Encounter with the Green Fairy",
 "author": "Arjuna",
 "citation": " Arjuna. \"First Encounter with the Green Fairy: experience with Absinthe (ID 21831)\". Erowid.org. Mar 6, 2003. erowid.org/exp/21831",
 "substance": "Absinthe",
 "bodyweight": "165 lb",
 "report": "<p>I had ordered some Czechoslovakian absinthe pilsner from a reputable online vendor, with the intent of trying this mysterious liqueur for the first time. When the bottle arrived, I went to a friends house to split the 16oz bottle with him. We went to the store to pick up sugar cubes to experience this exquisite beverage in the traditional fashion. We poured the liquor over the sugar cube and mixed it with equal parts water, expecting to see the traditional alchemical effect of the emerald color turning into a milky white. This effect, called the 'louche' was not present in this particular Czech blend of absinthe. Unfazed, we begin to slam the beverage down the gullet.</p><p> Initially, I was taken aback by the harsh bitterness of the anis and wormwood, followed by the incredible burning of the ethyl alcohol (nearly 144 proof!) This dissatisfaction subsided, as the magic properties of the herbs began to take hold.</p><p>At approximately T+0:45, A feeling of warmth and comfort rushed over my body, which was potentiated  by the bowl of cannabis we had begun to smoke.</p><p>By T+1:30, I began to notice a red shift in my visual perception; everything began to look sharper, cleaner, and surrounded by a deep red aural hue. I was quite drunk from the high alcohol content; yet unlike a normal drunk, my speech was not slurred and my thoughts were clear and rational.</p><p>Around T+2:00, I was comfortably in the buzz, lying on the couch listening to ambient music in the background, while enjoying spectacular CEV's similar to low - dose mushrooms. The effects seemed to last well into the night, for about 4 to 5 hours. The next day I woke up energized, cleansed and refreshed, with no hangover to speak of.</p><p> Since this experience I have tried many different brands of absinthe, and it is my opinion that the best is that of the French or the Spanish. Both of these absinthes are typically less bitter and have the traditional 'louching' effect.</p><p>For anyone who appreciates fine liquor, I highly recommend this vice that befell some of our most famous poets, authors and artists.</p>",
 "year": "2000",
 "id": "21831",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-03-06T08:00:00.000Z",
 "views": "23279",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 oz",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 }
}
