{
 "id": 2187,
 "title": "5-MEO-DiPT and SSRI observation",
 "date": {
  "submission": "2002-09-10T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "enchantedporkfist",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Paroxetine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": ""
  }
 ],
 "report": [
  "I've performed many trials with many individuals trying 5-MEO-DiPT for the first time.  Most have enjoyed it, even though 1 out of 10 people will throw up (once, not repeatedly) during the 1-2 hrs of dose-dependent nausea at the start of the trip.  Aside from this figure i haven't found out anything that I thought was worth posting for people to read, until last night.",
  "I gave two people doses of the substance last night.  Two people of similar height and build took 15mg.  One was on no other perscription medications, the other had been taking Paxil for over a year.  The one on Paxil had taken a dose of 9 or 10 milligrams a few days prior (long enough for tolerance to go away) and reported that he felt minimally little to nothing for the duration, while others taking the same dosage from the same dilution had felt effects.",
  "  This second time, the control kid, who was on no perscriptions and dosed from the same batch as the Paxil kid etc, experienced the full expected effects from his ingestion of 15mg.  The Paxil kid, however, reported little or no effects.  Furthermore, the unscrip kid felt the typical squeamish belly body load for the first while, commented on it to me, but it passed without incidence of vomiting.  My paxil kid reported that he didn't even feel these effects, let alone psychedelic effects. ",
  "I am not (yet?) a pharmacologist, but something is probably going on here, if anyone could explain this maybe, or confirm this sort of happening (or disprove it by dosing someone effectively who is on an SSRI).",
  "love,",
  "enchantedporkfist"
 ],
 "erowid": {
  "id": "17329",
  "citation": " enchantedporkfist. \"5-MEO-DiPT and SSRI observation: experience with 5-MeO-DiPT and Paroxetine (Paxil) (ID 17329)\". Erowid.org. Sep 10, 2002. erowid.org/exp/17329",
  "substance": "5-MeO-DiPT and Paroxetine (Paxil)",
  "views": "13206"
 }
}
