{
 "title": "Tastes Like Shit!",
 "author": "oscarette",
 "citation": " oscarette. \"Tastes Like Shit!: experience with Poppies (seeds) (ID 21897)\". Erowid.org. Jul 22, 2003. erowid.org/exp/21897",
 "substance": "Poppies (seeds)",
 "bodyweight": "114 lb",
 "report": "<p>I first bought 24 ounces of poppy seeds from this Indian marketplace for about $10. I then got about a quart of concentrated lemon juice. When I got home my boyfriend was laughing hysterically because he couldn't believe we were actually going to try this. (Oh ya, I forgot to mention we take oxycontin on the regular so he wasn't too convinced a spice was going to get us high.)</p><p>At 7pm we poured the poppy seeds in a large pot, then in went the whole bottle of lemon juice. It was really thick so I put some hot water in with it. I let them soak in this mixture for half an hour, mixing every 5 minutes.</p><p>After the half hour was over we strained the seeds through a t-shirt (a trick which I got from this site.) We then drank this so called tea, although it was now room temperature and the most disgusting thing I have ever tasted in my life. Then I remebered reading you could put sugar in it to make it taste somewhat like lemonade. So we put some sugar in it, still vile! We realized there was nothing we could do to make it taste any better. So we just suffered through it and swallowed it all. All the while thinking this tea better work to go through this shit!</p><p>Now that the tea was all gone I felt relief that I didn't have to drink any more but I did feel very nauseous. (I almost yacked while drinking it.) When I say this shit is gross, you really have no idea.</p><p>It's now 8:30pm, I feel very relaxed but my boyfriend just feels exhausted. We decide this stuff doesn't work. At around 9pm I look in the mirror and my eyes are so heavy and bloodshot, it looks like I just smoked a bone. But still no real effects.</p><p>It's now 11pm and we're not as messed up as our expectations had us thinking but we are very relaxed, no withdrawals from the oc's, and we both slept really well on this. I would say the effects were the same as if you take some sleeping pills and force yourself to stay awake on them. So pretty much it sucked.</p><p>I'm not saying that it doesn't work, maybe we made it wrong I think it would've worked better without the water added, but I'm telling you right now, I didn't care how high I got, nothing could ever make me drink that shit again!</p>",
 "year": "2003",
 "id": "21897",
 "gender": "Female",
 "timestamp": "2003-07-22T07:00:00.000Z",
 "views": "30703",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " seeds",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "(tea)"
  }
 ]
}
