{
 "title": "The Other Side",
 "author": "Robo Users",
 "citation": " Robo Users. \"The Other Side: experience with DXM (ID 219)\". Erowid.org. Aug 16, 2001. erowid.org/exp/219",
 "substance": "DXM",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "8 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "report": "<p>\nMy friends and I have been using dxm (robotussin) for about a year and a half. When we started using it we would use it about twice a week.  In  the last six months we have only done it about 6 times. This is the story of my most extreme trip on dxm. We had planned on a 'robo trip' for about three days. We went and bought all the psycadellic equipment such as black lights, posters, etc.</p><p>We set up my apartment and drank 2 bottles of extra strength robotussin at about 8 pm. We waited for about an hour then it hit us.  At about 9:30 pm I started to feel a little sick to my stomache. I went to the bathroom to puke but never did. For the next hour I lay on my couch and tried not to think about puking. I think I may have fallen asleep for awhile but I cant be sure.  The next thing I remember I was in the bathroom looking in the mirror which was a huge mistake. I cant be sure of the time but i think it was about 11 pm. </p><p>As I looked in the mirror many things happened to me.  The two that stick out in my mind were seeing my reflection covered in blood and then covered in shining metal plates. At this point I lost all control of my mind and body. I went and lay on the floor in the living room and closed my eyes. I saw the most intense hallucinations I have ever seen. I opened my eyes which did no good because my whole world had changed. All normal objects were tilted at wierd angles and every so often objects in the room would melt and drip to the floor. I would look at my friends and their faces would be different or sometimes blurry. I had a real hard time identifing them. They would talk to me and I wouldn't know who they were.</p><p>I wandered through my house which now seemed to me to look like a palace of some sort. I went into the kitchen only to find a huge swimming pool where the table was supposed to be. I was so lost I didn't know where I was. I couldn't feel any parts of my body and had trouble moving specific parts. I went back to the couch and lay there for what seemed like hours. I watched my house plant grow till it was about twice its original size.</p><p>The most intense part of my trip happened next. I was sitting on the floor when the wall I was staring at suddenly exploded. I was the only person in a room that seemed to be spinning through outer space. I watched stars and planets fly by me. I would say this lasted for about half an hour. When it stopped I was once again in my room sitting on the floor. I was astounded by what i had just seen. I went to the bed and lay down until I fell asleep. When I woke up I felt energized but very stiff and awkward. </p><p>I have been 'robo tripping' for about a year and a half and never really had a bad trip.  Sometimes I will lose control and think I am never going to snap out of it. Just remember that it's all in your mind and try not to move around too much. I think this adds to the nervousness and confusion. Just sit back in a comfortable spot and enjoy the ride.  All in all I enjoy 'robo tripping', but be careful and try to have at least one person who is sober to trip-sit everyone. It really helps to have someone who is not tripping to talk to about what is going on with you.</p>",
 "year": "2000",
 "id": "219",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-08-16T07:00:00.000Z",
 "views": "8003"
}
