{
 "id": 2190,
 "title": "Not my Drug",
 "date": {
  "submission": "2001-07-18T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bill Hayes",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.25",
    "unit": "g"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I recently took cocaine for the first time.  When I try a new drug, I usually try to keep a written log of what I'm doing and how I'm feeling so as to remember later how I felt when I used the substance.",
  "Here's the log I wrote while having my first and (probably last) cocaine buzz:",
  "07jun2000",
  "23h35",
  "Nervous as Hell. I'm about to use coke for the first time.  It tastes bitter and numbs the tongue in a funny way.",
  "23h43",
  "I'm REALLY nervous.  After all, this is COKE.  OK, I'll just do it now...  I did it... How much time will it take before it does anything?",
  "23h48",
  "I'm not sure I feel anything.  Although I suspect something's just around the corner...  I feel the coke going down my throat.  It's rather unpleasant, just like when something you're drinking gets to your nose.",
  "23h53",
  "I don't feel hungry anymore.  I'm gonna take a second line to see if anything happens then.",
  "23h57",
  "I cut two other lines.  I'm taking them.  One's in.  In the right nostril, just like the first one.",
  "00h00",
  "OK, the third one's in the left nostril.  At least half of it.  I finished the second half with my right nostril.  This smells/feels synthetic.",
  "00h03",
  "OK, I think I'll just wait and see now.  All my palate and teeth feel numb.  Is this really coke?  I don't feel euphoria.",
  "00h07",
  "I think I've been fucked.  Because I don't feel any euphoria and to tell the truth, I even feel a bit paranoid that I might have taken something bad for me.  My perception is slightly altered.  I wouldn't say it is hightened.  The pseudo-feeling I get somehow ressembles the one I'd get off of pot, only weaker.  I think I might have gotten PCP or some crap like that instead of coke.",
  "00h16",
  "I don't know.  This doesn't seem really great.  I definitely have a ping, though.  I think my heartbeat's faster and that I'm affected in some way.  My mouth's gone from frighteningly numb to simply numb.  Should I take this experiment all the way and use a large quantity of coke?  The feeling of 'mental precipitation' somehow ressembles that of acid:  it seems to make you unfocused and prone to make more mistakes (typos for instance).",
  "00h35",
  "I've been trying to find a chat room where I could ask people about coke for the past few minutes.",
  "01h09",
  "I have found that cocaine is not for me.  I read some info on websites that says some people feel anxious and really don't enjoy coke.  I guess I'm one of them."
 ],
 "erowid": {
  "id": "1735",
  "citation": " Bill Hayes. \"Not my Drug: experience with Cocaine (ID 1735)\". Erowid.org. Jul 18, 2001. erowid.org/exp/1735",
  "substance": "Cocaine",
  "views": "27896"
 }
}
