{
 "title": "Yet Another Try",
 "author": "Zam",
 "citation": " Zam. \"Yet Another Try: experience with 2C-B (ID 2192)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2192",
 "substance": "2C-B",
 "bodyweight": "220 lb",
 "report": "<p>DOSE : ~15 mg 2cb powder \rMethod : Directly in mouth \rSetting : Home, no previous food for 8+ hours \rIntent : Sexual/Sensual\rOnset : +45 minutes</p><p>My intention for 2cb this time was to once again try to experiment with this substance which I have heard can be very sensual and positive. In the past 9 or so tries with it, I have had very mixed results. The first 6 were generally uncomfortable, generally not so great experiences, one was good, another was not so pleasant, and another was neutral.</p><p>This time I planned to work by myself (I often experiment with a partner) at home to be able to hopefully work with my set and setting carefully again. (Most previous attempts were with a partner.. With the last couple of tries I have felt that I have started to 'learn' 2cb)...</p><p>Total entheogenic experiences of all types ~30. No food for 8+ hours. 15mg powder, slightly yellowish/tan, directly in mouth, tastes bitter but not as 'sour' as MDMA. Tastes like other tasted 2cb.</p><p>T+45 mins : Minor alerts, subtle changes in visual. Start to read The Only Dance There Is (Ram Dass), look at some pictures in some art books, read some excerpts from The Art of Sexual Ecstasy (?) and look at pictures from a 'normal' sex magazine.. yuck.</p><p>T+60 mins: Mild effects start to be felt, I feel a little silly and happy to be in a new head space. I have some trouble focusing on the words in Only Dance and now have trouble staying mentally focused on the paragraph-content.. seems like its time to move on to things where I don't need to have a long attention span. I poke around the art books and find them to be slightly enhanced as I am reacting somewhat more fluidly than normal.. I open the Sex magazine again and find that my normal cynicism and distaste for such things seems to have mellowed. Instead of reacting with anywhere from mild indifference to revulsion at the pictures (especially the ads), I find that if I dont like a picture I just dont look at it or care. I also find that I am drawn towards the part of the pictures that are OK: 'she has a nice calf' or 'he has some interesting makeup on'.. I find the magazine mildly arousing and fun instead of (at baseline) mildly distasteful or cynically amusing.</p><p>Interesting.</p><p>I close my eyes and focus on the internal feelings of my body and notice that (once again) my stomach feels the weirdest in a negative way. I decide to work on that and focus on the sort of 'comfortable, cuddly' feelings in my legs and arms and try to bring that feeling to my torso... The stomach feeling and feeling of 'restlessness' seems to continue.. so I decide to try to add one of my most trusted allies: cannabis.</p><p>(when I smoke, I usually smoke very little and don't actually pull any smoke into my lungs.. I use a pipe and use a pipe-smoking technique where I pull the smoke into my mouth and hold it there.. Ocasionally I open the back of my throat and pull the smoke into my thoat..)</p><p>I smoke (as above) a small bowl of nice tasting green cannabis and very quickly start to feel a change in the 'restlessness'. The feeling of restlessness starts to fade into a feeling of 'stimulated comfort' or something like that.</p><p>I try again to focus on 'smoothing out' the stomach feel and it starts to work and as I play with the odd sensations (mostly a sort of childlike rolling around, playing kinda feeling) I notice that the weird stomach feelings (which has sometimes almost taken over my 2cb experiences) fade into the background.</p><p>T+90: my sitter asks if its OK to put on a movie: Rasputin.. I say OK and continue to lie on the bed and close my eyes.. The first 30 mins of the movie seem very interesting but mildly confusing.. I find that my attention seems to be somewhat mercurial but able to be focused. I seem to be finding the experience 'fun'.. not terribly profound.. somewhat body-based.. and definitely sense-oriented.. with reactions and boy-oriented feelings enhanced.</p><p>T+2 hours: The movie starts to seem more coherent and less confusing and I find myself enjoying watching it most of the time, with the rest just sorta 'lying there' and talking with my sitter about my experience. The movie is good.</p><p>I also start to feel like eating something light would be a nice thing.. I chomp on some dried fruit and nuts. Dried apricots were very nice. Yumm.</p><p>T+4 hours: Part of the idea for trying 2cb again has been to try to work towards a sensual connection with my partner. I thought that, perhaps, since we had been mostly unable to find this connection when coming up together that if I tried it first, I could find the sensual place and then she could come up and I could try to lead here there. Soo.. I was pretty happy with how things had gone and the effects were 90% gone..</p><p>T+4 hours: I take 10mg 2cb powder orally straight and my partner takes 7mg (she generally needs less than the average dose).</p><p>T+4.75 hours: Start to feel mild effects again.</p><p>T+5.3 hours: The effects of the 10mg are noticeably less than the 15mg earlier (no suprise). We find that this level of 2cb is a nice mild stimulant and seems to allow for a little easier sensual connection. I sometimes feel a little of the 'merging' feeling as we kiss and play.. not exactly merging with my partner so much as merging with the feelings of openness and closeness and/or the feelings of touch. Hmm..</p><p>In the feelings of the effects, it felt somewhat analagous to the good feelings of 3 or so glasses of champagne, without alcohol's short-up curve and long downslide. Also, adding a little cannabis here has a nice 'smoothing' effect on the stimulated feeling where it can often enhance the 'tired' feelings of alcohol (not always and not when used carefully :)...</p><p>Overall, the experiement was a complete success. Im starting to feel like I 'have a handle' on 2cb and kinda know how to steer my ride down the river with this entheogen. If I were to try to describe how to work with it to someone else, I would tell them to:</p><p>be careful about eating beforehand (true for all entheogens for me) \rFind some positive material to have on hand and some positive music playing. \rIf the body feel starts to become unpleasant, lie or sit down and close your eyes and focus on breathing and look for parts of your body that do feel good and work on cultivating that feeling? \rIf cannabis is an ally, try a small amount and work up very slowly. \rMake sure you have a comfortable space. \rClean up your space before ingesting. I have found my aesthetic sense with 2cb to somewhat enhanced and I found myself becoming annoyed (in previous experiences) at some very unaesthetic garbage and mess that was around.</p><p>Its been almost a month since this experiment and I've tried it again since with perhaps even more comfortable effects.</p>",
 "year": "1997",
 "id": "2192",
 "gender": "Male",
 "timestamp": "2000-06-27T07:00:00.000Z",
 "views": "32243",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  }
 ]
}
