{
 "title": "Smooth Ride",
 "author": "Brock",
 "citation": " Brock. \"Smooth Ride: experience with LSD & 5-HTP (ID 21960)\". Erowid.org. Dec 30, 2004. erowid.org/exp/21960",
 "substance": "LSD & 5-HTP",
 "bodyweight": "285 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)",
   " T+ 1:00",
   "2.5 hits",
   "oral",
   "LSD",
   "",
   " T+ 4:00",
   "100 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)",
   " T+ 7:00",
   "1 shot",
   "oral",
   "Alcohol - Hard",
   ""
  ]
 ],
 "report": "<p>I was trying to find some info on using 5-HTP with LSD, but I didn't come across too much good info.  I tried it this past weekend and have decided to post my report.  I had heard that in combination with 5-HTP, it gives the LSD trip a bit more of an MDMA feel.  Here are my findings.</p><p>8pm Dosed 100mg of 5-HTP</p><p>9pm Dosed 2.5 hits of average quality LSD.</p><p>9:45pm I am feeling the mild calming effects of the 5-HTP when the LSD starts to kick in.  I'm feeling the typical anxiety I always get with LSD, but it doesn't seem as bad as usual.  No real MDMA type feeling though.  Just less anxiety.  Maybe my touch was a little more sensitive.  I chilled out with my gf (who was also doing LSD and pot).  I didn't smoke any pot though because I don't deal so well with it.  Watched some dance videos on BPM for a while.  Then put on some soft porn since we were both pretty arroused.  Fooled around a bit, couldn't concentrate too much on the sex though due to the acid.  Listened to some tunes and watched some winamp visualizations on my big tv.  I was getting some pretty sweet audio distortions.  Was feeling the music in waves go through me.  Got some decent color trails, but nothing spectacular.  One thing I noticed was that it was a total positive vibe from start to finish.  I attribute this to the 5-HTP. </p><p>Around 1am, I took another 100mg of 5-HTP for the ride down.  I was getting a bit edgy just before I took it and in about 15 minutes, I was nice and relaxed for the comedown.  Not edgy 'stone skin' type feeling.  It was a total warm and fuzzy comedown.  I was able to sleep by about 5am.  That is the earliest I have ever gotten to sleep after an acid trip.  The 5-HTP didn't shorten the trip or anything, it just enabled me to relax during the comedown and I didn't have to sit awake through the whole 7:45...7:44...7:45 thing.  The most annoying part of LSD is when I am just tired of tripping and want to go to sleep, but can't!  The 5-HTP really helped this.  I also had a shot of vodka around 4am, but it usually takes about 4-6 shots to really get me to calm down enough to even think about sleep. </p><p>Also, just a note.  I don't feel that the first dose of 5-HTP gave me any MDMA type feeling in combination with the LSD.  If anything it kept me calm while I was taking off.  I probably wouldn't bother with it before the LSD in the future, but definitely for the comedown.  Happy travels!</p>",
 "year": "2003",
 "id": "21960",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-30T08:00:00.000Z",
 "views": "15302",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP",
   "form": "(pill / tablet)"
  }
 ]
}
