{
 "title": "More Intense than Friends Who Took Full Trips",
 "author": "c-man",
 "citation": " c-man. \"More Intense than Friends Who Took Full Trips: experience with Cacti - T. pachanoi (ID 21969)\". Erowid.org. Mar 11, 2003. erowid.org/exp/21969",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "78 kg",
 "report": [
  "<p>As I have had a difficult time finding experiences of people trying mescaline whilst taking antidepressants I have decided to write this.",
  "Doses",
  "nortiptyline :20 mg (daily)",
  " mescaline    :approx   trip",
  "(based on a 75cm piece of san pedro 10 cm in diameter containing 4 trips)",
  "We started the day by preparing the pedro. First we removed the husks and cut off all the green slime. This was then boiled for approximately 4 hrs stirring occasionally. The mixture was then strained through a cloth and the liquid was divided between the 4 of us. I had read about the additive effect of tricyclics on hallucinogenic drugs so I only wanted to at the most take  a trip on this occasion.",
  "It was my 20th birthday and I was in a pretty excited but nervous state of mind. I wondered if it would end up turning out bad (mabey ending up in hospital) but I felt safe in the fact that I had my friends to look after me if anything went wrong. At the same time I thought that hallucinogenic drugs were probably talked up quite a bit but if they werent I'd have a blast. It was a party atmosphere where my friends were drinking and having a fun time.",
  "(time 0) I decided to only take  of a trip (just to be safe) and drank the vile tasting liquid (not as bad as I had been told though) in several goes. I then walked round the house to wait for it to start to kick in.",
  "(time 45 mins) A short time after I had taken it I felt quite queasy, I had sensations that my body was heavy and things just didnt feel quite right. The only time I have felt this feeling before is when I was put on a new prescription medication and they were non-compatible. After 10 mins or so this sensation had left me apart from things not feeling quite right (probably the drug starting to kick in).",
  "(time 1 hr) Nothing much had happened to this point,I was starting to think I had been screwed. I had seen an aura behind one of my friends but that was all.",
  "(time 1  hrs) I decided that if it was going to kick in it would have kicked in by then so I took the other  of my trip and then ate a few spoons full of cookies (cookies are the pulp left in the muslin after straining) and played the waiting game.",
  "(time 2hrs) The trip had now kicked in. I was running round the house yelling and screaming about stuff (like distorted reflections in a window) and I was unable to stop laughing. I would see something,and in my mind it was the most hilarious thing that I had ever seen. I was almost rolling round on the floor because things were so funny. Not  many visual effect to this point though.",
  "(time rest of trip) After the uncontrollable laughing stopped I started to get quite cool visual effects. These included, my shoes talking to each other (one was happy one was angry), having posters winking at me, running through a forest of trees with facial expressions (while I was sitting on the couch), seeing Diablo and seeing a blue tunnel that wanted me to walk down it when I closed my eyes or hid under a blanket (it protected me from the outside world the blanket that is).",
  "In general my experience was far more intense than any of my friends who took full trips. They didnt get anywhere near as intense hallucinations as I did. But they did get some mild effects.",
  "This experience has changed my life. I didnt know that anything could be as intense or as funny as that. I had my best birthday to date (and probably forever) and it will never be forgotten.",
  "Note To Reader:",
  "This was just my own personal experience and there was nothing scientific(or medical) about the above experience. I am only writing this to show people who are on tricyclics to be careful when  trying hallucinogenic drugs.</p>"
 ],
 "year": "2003",
 "id": "21969",
 "gender": "Male",
 "views": "29299",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Pharmaceuticals",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "1.85 in",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(liquid)"
  },
  {
   "time": " T+ 1:30",
   "amount": "1.85 in",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2003-03-11T08:00:00.000Z"
}
