{
 "title": "The Clinking of Countless Spent Whippets",
 "author": "Anonymous",
 "citation": " Anonymous. \"The Clinking of Countless Spent Whippets: experience with Nitrous Oxide (ID 21998)\". Erowid.org. Mar 11, 2010. erowid.org/exp/21998",
 "substance": "Nitrous Oxide",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "report": "<p>I had heard of laughing gas since I was a child, but never had any appreciation for it until I started inhaling it on a regular basis. I ordered a couple boxes of whippets, and over the next week, inhaled them all. The rush I felt was incredible, and nitrous became my drug of choice. The intense euphoria and mindtrip was addictive, and I began buying boxes of whippets in bulk.</p><p>In about three months, I inhaled over 2500 whippets. Whenever I emptied my trash can, I could hear the clinking of countless spent whippets. I never felt like I was out of control. I scoffed at the name 'hippy-crack', after all, it was just a simple gas. My daily intake was about 15-20 whippets. While under the influence of another drug, my consumption would sometimes cross 150. Many of my friends occasionally inhaled as well; I supplied, as I always had tons of nitrous oxide, but none did it to my degree. Every time I took a hit of nitrous, I was reminded how wonderful it was and how unique I felt for appreciating nitrous for its true potential.</p><p>However, as time passed, I began to notice adverse effects. I would never properly sleep. It felt like I was always in a waking dream. My circulation began to suffer, and I would grow light-headed (accompanied with headaches) often and my arms and legs would tingle. I started to grow severely depressed. I took B-12 supplements to counteract the depleting effects of nitrous. Single hits no longer gave me a noticeable effect, and I was double and triple dosing.</p><p>I ignored (or didn't take seriously) these warning signs and continued to inhale. My last binge was about 60 whippets while I was tripping in my room. After I was done, my brain felt like mush, and for the first time, it truly hit me how much nitrous I inhaled. I felt ashamed for myself and for 'wasting' so much nitrous. The following week, I finished my remaining 8 whippets and haven't inhaled in over a month.</p><p>I have respect for nitrous and continue to think it is a wonderful drug. It mixes well with every drug I have combined it with, and will launch me into outer space and then bring me down just as gently.</p>",
 "year": "",
 "id": "21998",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2010-03-11T08:00:00.000Z",
 "views": "10235",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ]
}
