{
 "title": "Exploring the Dark",
 "author": "Psyconaut",
 "citation": " Psyconaut. \"Exploring the Dark: experience with 2C-T-7 (ID 2199)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2199",
 "substance": "2C-T-7",
 "bodyweight": "145 lb",
 "header": [
  "DOSE: T+ 0:00",
  "25 mg",
  "oral",
  "2C-T-7",
  " T+ 2:25",
  "8.0 mg",
  "oral",
  "2C-T-7"
 ],
 "report": "<p>there is this new chemical that I just came across, 2-C-T-7, it is truly amazing. I dosed myself with 25 mg at 8:55 pm and an hour later could feel onset effects, including an aphrodisiac effect and vision persistence after I closed my eyes, but this was a week feeling, after two hours, I felt like I was still coming up, the visual effects had not really kicked in yet, but there was a tingling feeling across my skin. Definite touch enhancement. at 11:15, I decided that the dose was too weak, so I took 8mg more. I realize in hindsight that was probably not needed, because 5 minutes later I felt the effects rush in. and 40 minutes after that, there was another rush, probably the 8mg.</p><p>The visuals were intense, playing off of the different colors of the spectrum in the room i was in. Open-eyed, there were patterns of complex, colorful geometric shapes and visual distortions, for instance, I looked up at the ceiling where there was a black light tube and watched a rift appear and the ceiling parted and was pulled towards the walls. But closed eyed was where the visuals took on anything I wanted...there were bomb-like patterns, pure hallucinations, and DPT-like visuals, I assume this was because the last psychedelic that I had previous to this was DPT.</p><p>At one point in the night, I turned out the light in a black walled room and there were only a couple sources emitting light, a few glow-in-the-dark materials. The chemical took on a very different course at this point, my mind was open to what anyone suggested for my visuals. Someone started to put images of other people in the room in my head, and I saw a native-american chief sitting next to me, and my eyes were open. There were bodies everywhere and I got very paranoid very fast.</p><p>The mental aspects of this chemical were fairly strong, especially in the dark room. With not much light to see what the real world was like, I drifted off into my thoughts and found myself in a panic in no time, but at any time I could just snap my mind right out of it by making a noise. Also, it made me quite stupid, as I thought for about 10 minutes and couldn't figure out where i had to be the next day. It was extremely easy to loose focus in a conversation if there was a flashing light to distract you.</p><p>The trip lasted for about 13 hours, when I could finally get to sleep. I was peaking for about 9 hours. and then there was a slow comedown to the 13th hour when I still had closed eye visuals, but no more open eye. It was very hard on my body, and my head hurt afterwards, but when I awoke from sleep the next day I felt fine. I did notice it had the shrinking effect and I was cold for a good portion of the night. Also it caused a slight twitch on the rush in. All in all it was a very exciting experience and I would recommend it to everyone.</p>",
 "year": "2000",
 "id": "2199",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-27T07:00:00.000Z",
 "views": "22892",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-T-7"
  },
  "1": {
   "time": " T+ 2:25",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "2C-T-7"
  }
 }
}
