{
 "id": 22,
 "title": "From Panic to Enlightenment",
 "date": {
  "submission": "2013-07-15T07:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "Mouff",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "550 ug",
   "administration": "buccal",
   "substance": "25I-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "Just a little background here. I am rather acquainted with psychedelics. However, RC's are a totally new playground for me. This is my very first experience with any of them, let alone the Nbome series.",
  "I've done just about all of the research I can possibly do about 25i. I've read trip reports and news reports about people dying. I've read about the chemistry and the effects of the chemical on the brain and I'm expecting a shallow trip with plenty of visuals and music appreciation.",
  "00:00 - Placed 550 g complexed blotter between my upper lip and gums. I notice a slightly bitter taste, but nothing compared to what I expected from reports I've read.",
  "00:10 - Starting to get irritated by the amount of saliva in my mouth. I'm glad these are complexed. I don't know if I can hold it for an hour.",
  "00:20 - I go ahead and get my playlist ready for this trip. I don't plan on leaving my room except for maybe a potty break here or there, so I better go ahead and take care of this step. I put on some Uneven Structure for the come-up, and add in A Silver Mt. Zion for the trip, to be followed by Godspeed You! Black Emperor.",
  "00:30 - Starting to notice some tingling in my extremities and and light-headedness. Nothing too crazy. I move the blotter to the other side of my mouth to make sure everything gets absorbed.",
  "00:40 - The usual feelings of anxiety that I get from most come-ups are very apparent at this point. Vasoconstriction is becoming an issue and my blood pressure is increasing more than I would like to.",
  "00:55 - I spit out the blotter and the excess saliva. I go to the kitchen and grab a beer to ease the tension of the come-up. The 25i is coming up a lot faster than I expected. I guess I'm a bit more sensitive than others.",
  "01:00 - 01:20 - Colors are becoming vibrant. The wood grain of my door stands out and everything around me is almost glowing in intensity. I'm beginning to get very anxious. My blood pressure is way higher than I would like and I'm having trouble keeping myself from moving around. I feel extremely stimulated to the point where it's annoying.",
  "01:30 - 2:30 - This is where shit goes downhill for a while. I can't decide what the hell I want to do right now. I have tons of energy, and it's raining outside, so I'd prefer not to go for a walk. I start focusing on the blood pressure issues I'm having. Big mistake. I enter into a cycle of feeling like I'm having an adverse reaction to the drug, telling myself it's just a drug and I'm going to be fine. This is probably the worst come-up I've ever experienced.",
  "2:30 - 5:00 - The visuals are starting to take hold. The walls are warping, tracers are forming and my CEV's are absolutely beautiful. I move away from the negative feelings from the come-up and focus on the CEV's and Godspeed You! Black Emperor playing in the background. Let me just say, if you have never listened to them whilst tripping, I highly recommend it. Every song is absolute journey. I remember with many of my DXM trips, I was transported to another dimension listening to these guys. For the next few hours, I switch between listening to GYBE and A Silver Mt. Zion's beautiful soundscapes. I have never experienced synesthesia before, but 25i has made me feel music in ways I never have before. My CEV's are like a movie following the music behind my eyelids. It was around this time I lost track of my body. It wasn't the same feeling as being dissociated from it like with ketamine or DXM, but I just felt that it no longer mattered anymore. In fact, my own personal opinions and feelings are irrelevant as well. This train of thought led to my own ego death. Strangely enough, I can honestly say I've never felt as much of a relief as I did the moment I died.",
  "5:00 - 8:00 - I can distinctly feel myself coming down. Quite frankly, I'm glad. The body load this drug produces is the one reason I don't plan on doing it more than once every few months. I spend the next few hours watching youtube videos and Rurouni Kenshin, an awesome anime if you're into anime.",
  "8:00 - ? - I turn A Silver Mt. Zion back on and do my best to fall asleep. I am absolutely exhausted and have to work in the afternoon. From about 4:00 AM until noon, I roll around in bed shifting between sleep and being awake.",
  "The next day is when much of my introspection occurred. After this experience, I find it hard to believe that this is a shallow psychedelic. I pondered a lot of very personal thoughts all day after this trip, and also spent a lot of time integrating the whole experience of ego death. This is only the second time this has ever happened for me.",
  "Despite the overwhelming come-up, I do feel that 25i is a wonderful tool for personal enlightenment. It may not be another LSD, but it certainly has its uses. However, the body load is absolutely dreadful and it will keep me from redosing for at least a month or two."
 ],
 "erowid": {
  "id": "100135",
  "citation": " Mouff. \"From Panic to Enlightenment: experience with 25I-NBOMe (ID 100135)\". Erowid.org. Jul 15, 2013. erowid.org/exp/100135",
  "substance": "25I-NBOMe",
  "views": "575"
 }
}
