{
 "id": 2200,
 "title": "Inside a Four Layer Cake",
 "date": {
  "submission": "2005-06-14T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Satan 922",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "Well, this happened a while ago, but I still have the journey burned in my mind. I've smoked salvia before, no extracts, but never to any effect except raised body temp. and a little 'salvia gravity'.",
  "One night I was sitting in my garage, by myself, with a bowl of weed and salvia. I read that it's best to use a butane lighter ( the jet-flame type)to obtain better results, but I didn't own one at the time. I had the lights off, and I was sitting in the back room. It has 2 windows in the corner, each with 4 separate glass panes. I started to smoke, holding it in as long as possible, and set my pipe down to wait for the journey to start. I wasn't expecting much, because the other 5 times I've done it I didn't really have an 'experience'. This time was different. The onset effects began, I got extremely warm (like an alcohol buzz),and I was looking at my windows. All of a sudden my vision became curved, and all I could see was the windows wrapping around me. Then each glass segment lost the outside (whats outside the window, I mean)and the glass was no longer see-trough but white. The metal in between them turned a burgundy-pink color, and it looked like a giant vanilla cake was in front of me. Since it was fish-eying around me, it appeared like I was in the 'cake', like I was standing in the spot where someone took a piece out of it. Then I felt like I was being pulled into it (salvia gravity) and that the piece taken out was re-forming while I was sitting where it once was. then my vision faded to black, and the 'cake' disappeared into empty space.",
  "It felt like I was falling in a vacuum of nothing, absent of color or anything around me. Then the journey was beginning to end, and my vision started to come back. While I was 'moving' (or moving because of the salvia gravity), I thought, while in the vacuum, that I was going to be on the floor or moved from my starting physical position, but I hadn't moved at all. Overall, I didn't know what to think of my journey or the meaning of any of it, but it wasn't a bad experience at all. I plan on continuing my Journeys later in the future."
 ],
 "erowid": {
  "id": "17386",
  "citation": " Satan 922. \"Inside a Four Layer Cake: experience with Cannabis & Salvia divinorum (ID 17386)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17386",
  "substance": "Cannabis & Salvia divinorum",
  "views": "4297"
 }
}
