{
 "title": "Not a Smart Combo",
 "author": "cephi",
 "citation": " cephi. \"Not a Smart Combo: experience with Ziprasidone (Geodon) & Cannabis (ID 22026)\". Erowid.org. Aug 10, 2005. erowid.org/exp/22026",
 "substance": "Ziprasidone (Geodon) & Cannabis",
 "bodyweight": "167 lb",
 "report": "<p>I'm writing this the day after my experience because I believe anyone out there taking an anti-psychotic like Geodon should know of the risks he or she is taking when marijuana is involved. I've been taking Geodon for only 7 days now. It's an anti-psychotic prescribed to schizophrenics and what not to lower the amount of dopamine in the brain. 7 days.</p><p>And how cocky I was on that 6th day! I decided, at about 9:30 PM, to go ahead and smoke a couple bowls of the ol' plant just to see...wow. What a horrid mistake. At 9:45, things were smooth and I was stoned. My mood was decent and nothing was wrong. But at around 10:00, everything changed. I started to have trouble breathing. My mind was cloudy. My heart was racing. (At 10:18 I checked my pulse - 126 bpm...) I had enormous trouble trying to calm myself down. I was sure that I was going to die. I woke my mom up (I'm 18, still in the house), and explained the situation to her. At first she was angry (understandable), but then she got me to calm down a bit. I didn't come down until 12:40 AM. Interesting, eh? I fell asleep with the TV on and my chest still aching. Of course, I'm still going through weird aches and pains today, but hopefully they're nothing serious...Well, now I know what not to do with an EXTREMELY potent anti-psychotic. I'm lucky to be alive.</p>",
 "year": "2003",
 "id": "22026",
 "gender": "Male",
 "timestamp": "2005-08-10T07:00:00.000Z",
 "views": "12222",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Ziprasidone",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
