{
 "title": "Dosage Variability",
 "author": "Don Pedro",
 "citation": " Don Pedro. \"Dosage Variability: experience with 2C-T-7 (ID 2203)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2203",
 "substance": "2C-T-7",
 "bodyweight": "190 lb",
 "report": "<p>10mg & 5mg Weight: 190lbs I recently had the opportunity to sample 2C-T-7. I've had 2C-T-2 and mescaline on several occasions, and 2C-B once, and am quite fond of phenethylamines in general. I expected 2C-T-7 to be similar to 2C-T-2, but was surprised to find that it was much more like mescaline than 2C-T-2, by far. My preferred dosage for 2C-T-2 was around 20mg (I took 24mg once and enjoyed it, but there was some significant nausea on the come-up which lower doses eliminated). Although I've never shown unusual sensitivity to this class of drug, I decided to start low with 2C-T-7 anyway, because it is a new material and I've been whomped before by starting with 'full' doses and have learned my lesson. It seems this was wise, as I am apparantly one of the people who are unusually sensitive to this compound.</p><p>I weighed out 10mg and ate it. Within a half hour I felt an alert. At T+1h, I began to feel a glowing warmth in my solar plexus. I began to meditate and do breathing exersizes, and felt this warmth gradually spreading out over my body, along with a contented sense of well being. The next hour or so it remained at this level... there were certainly similarities to MDMA and 2C-T-2 both. At a little past the 2 hour point, the full effects kicked in - when this happened, it happened very fast, over the space of 2-3 minutes. At this point I went to lie down on my bed, where I had some very powerful experiences of apparant telepathy, remote viewing, and out of body travel - all things that are quite common for me on higher doses of other phenethylamines (including MDMA). The visual aspect was nice, but less pronounced than the visuals from 2C-T-2 or mescaline. The physical body high was similar to mescaline, and quite enjoyable... except towards the end I felt some uncomfortable neck and shoulder muscle tension similar to the phenomenon one of Shulgins associates in PiHKAL described as the 'MDA cloak'. During the peak, I noticed extreme time dilation, similar to 2C-T-2. I also noticed some very extreme aphrodisiac effects during the first hour or so of the trip. This material also doesn't seem to kill the appetite, and I found making and eating a meal after the peak to be an incredible experience. From the time I ate the drug until I was able to fall asleep was around 9 hours. I found the trip to be comparable to 20mg of 2C-T-2, although there are very significant differences between the two.</p><p>I sampled the material a second time at a low dose (5mg) during the recent blizzard which hit the east coast in january. This produced a very joyous, childlike state in me, I went for a 2 mile hike out in a driving blizzard, and had a great time. There was definately a strong visual component even at this low dose... the snow falling looked like clouds of shimmering diamonds. The light from street lamps refracting off the snow drifts gave the impression that the world was covered in huge mounds of purple and pink ice cream. The cold didnt bother me at all. I walked down to a local park where I stood in awe at the snow covered trees. I threw snow balls into the air. I got home, took a hot shower, and made myself some curry. The trip lasted a mere 6 hours or so, but was very nice... comparable to perhaps what 12mg of 2C-T-2 would do to me.</p><p>I should point out that I gave a friend 10mg, after seeing what 10mg did for me. He ate it and felt no effects at all. Another friend ate 15mg and had a satisfactory trip, although he said that he'd do more if he did it again.</p><p>Its interesting that I'm unusually sensitive to 2C-T-7, though I show no unusual sensitivity to 2C-T-2. Just goes to show that you cant make assumptions one one drug based on another, no matter how similar they may be. Erowid's advice is well given - start low and work up!</p>",
 "year": "2000",
 "id": "2203",
 "gender": "Male",
 "timestamp": "2000-06-27T07:00:00.000Z",
 "views": "6075",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 }
}
