{
 "title": "Slipped into a Dream",
 "author": "Lawrence",
 "citation": " Lawrence. \"Slipped into a Dream: experience with Hydrocodone (ID 22055)\". Erowid.org. Mar 14, 2003. erowid.org/exp/22055",
 "substance": "Hydrocodone",
 "bodyweight": "165 lb",
 "report": "<p>I had surgery on my shoulder last year and recieved a large bottle of vicodin. I was very excited at this, for I had always wanted to try vicodin. I had tried vicodin once before, but I only took 2 pills and smoked a large bowl right after the effects started. I finished my bottle of pills pretty fast, except for 6 pills that I saved for a church trip to Disneyland.</p><p>I suffer from insomnia. Once I fall asleep, I don't wake up easily, but it takes me anywhere from 30 minutes to 2 hours to fall asleep. Disneyland was still two months away, so I decided to finish the 6 pills. I swallowed them all at once, and within an hour I was feeling the effects.</p><p>What I have learned about pain relievers, such as vicodin and darvocet, is that once they kick in, to get the best effects one should lie down in their bed. I did this, and slowly slipped into a dream. My thoughts were uncontrollable and ran free. I would see whatever I was thinking as if it were a dream. I was trying to think about a girl, hehehe, but within 10 seconds I would be so far off topic that I eventually gave up.</p><p>Any sound I heard near me would immediately bring me out of my completely interactive 'day dreams', or if I opened my eyes at any point the dream would be immediately gone and I wouldn't be able to return to it. It was ok though, for a new one would start almost immediately.</p><p>Eventually, I fell asleep and had the most detailed dreams. When I woke up the next morning, I was still tired, but I felt really good. If I had enough pills to do vicodin every day I probably would.</p><p>On Several occasions I have used vicodin with weed. It increased the high, but I could barely feel the vicodin. One night I took 11 pills of vicodin and a few hits of weed. I had a better high then I normally would have had, but for taking as much as I did I should have been completely out of it. Of course, I was out walking around and not near any place I could relax.</p>",
 "year": "2003",
 "id": "22055",
 "gender": "Male",
 "timestamp": "2003-03-14T08:00:00.000Z",
 "views": "33186",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6 tablets",
   "administration": "oral",
   "substance": "Hydrocodone"
  }
 }
}
