{
 "title": "Hyperspatial Crossroads",
 "author": "Diamond Joe",
 "citation": " Diamond Joe. \"Hyperspatial Crossroads: experience with 2C-T-7 & DMT (ID 2205)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2205",
 "substance": "2C-T-7 & DMT",
 "bodyweight": "162 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "2C-T-7",
   "(capsule)",
   " T+ 3:00",
   "5.0 mg",
   "oral",
   "2C-T-7",
   "",
   "",
   "1 hit",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>\nSet: calm anticipation + 0.5mg. alprazolam pre-dose (just for posterity) Setting: Ts house: T,S,G,and I.</p><p>Dose: 30mg. 2C-T-7 in gelcap. (approx. 6:30pm)</p><p>All began slowly; smooth transparent shimmers of light defining dimension and propounding relation</p><p>The Grateful Dead condense a magnificently chaotic jam: pulling it backward through interstellar space until finally it punctuates the atmosphere and floats gracefully back to the earth from which it was created</p><p>A buoyant sensation begins to thermally maneuver and spread itself throughout my body, outward from my heart and through the interwoven network of cells until it finds release through the skin. I am warm physically and feel the psychic tension of everyday reality dissipating like so much steam from a kettle. A simply delicious elatedness washes over me, not so powerfully and overwhelmingly as with MDMA, but smoothly, effortlessly sly creeping passion flower. And, as T has forespoken, crystal in character: affording bright lucidity amid reality-deconstruction like a sober astronaut looking out on infinity.</p><p>S and G are already spaceborne, soaring over some stroboscopic psychic landscape together and absolutely loving it, gleeful galactic panoramic outbursts swim through the room: you see that?? and look way down there!!</p><p>(approx.9:30pm) T and I boost with another 5mg TC-T-7, and assure the ladies that we are on the way to join them.</p><p>Certainly no more than ten minutes elapse before a gentle wave comes along and silently carries us upward with its motion to warmer water where color frees itself and swims beneath my eyes. Synesthetic fluctuating sounds emerge surreal and psychosomatic structuring realigns itself adroitly. We are all the grand conductors in the orchestra of our own lives, but we are more: we are each the audience in whole I feel the musical quality of the very air we breathe, and move my hands in concert with the pulsing rhythm of the cosmos.</p><p>G is like an electrified bolt of consciousness. At some point I find myself alone with her and we peer the eternal distance in each others eyes. She is absolutely explosive with energy, but so controlled!! Like a human superconductor inside a supernova. She attempts to speak, moving her mouth slightlyand then falls silent as we both apprehend the comic uselessness of speech. We share a moment of absolute mental clarity that is both wordless and wonderful.</p><p>As T and I reach the crest of the wave, just as vision reigns resplendent and weight floats free, he reminds me about the DMT. I wait until I am confidently wading across the liquid plateau with bearings set, perhaps 5 to 10 minutes, and tell Trey that I am ready.</p><p>The two of us adjourn to his bedroom where there is sufficient light for the pipe. I relax and we go over the basicsthis is not my first experience with DMT but it is my first in a long timeand simply ritualizing/preparing is very reassuring. I inhale slowly, steadily and with absolute delight as I taste that most splendid of all natures flavors. It is all I can do to hold the smoke in as the world cascades away beneath me and I lose all tactile sensory input. Possibly 30 seconds elapse and shhhhhhhhhhifftttttt through into.(I hear T ok, release)so far away but I open my eyes as I exhale the colors of liquid crystal inner space in to outer space and he puts the pipe to my lips for the second toke and I try my hardest to concentrate on inhaling but the glass and smoke and flesh and breath become one before my eyes</p><p>Rrrrrrrrrrrrrrhhhffffffffff - shockwave through my body jolting me conscious apparent crystallization of matter all around mefelt even, like being within a sentient prism. All spatial perception seems to enfold itself in to a gravity well of such ineffable density that it is like floating on the event horizon of a black hole, a prudent observer to nothing less than a multidimensional miracle. T and I, flowing together, are not alone out here, but rather two of innumerable participants to bear witness in this moment disembodied souls in hyperspace.</p><p>I hear T say Breathe and it is pure manifested Truth. The word, verbalized, is the original symbol of the noetic dreamscape we are treading. I just soak it all in.</p><p>The tryptamine/phenethylamine combination is remarkable. The DMT acts within my body as a catalyst, first noticed as a lightheaded feeling throughout my limbs, and swiftly, over the course of roughly five minutes following initial comedown, penetrating my entire bodythe feeling is almost indescribable. It is as though every cell has conductively attuned, one by one, to the true vibration of existence, leaving the body a vessel for pure energya channel of the Tao.</p><p>All together in the living room, the four of us are stargazing. S, now Venus- gloriously electrified and powerfully nude- plays her didgereedoo. The sound is absolutely primal. It summons forth archaic beauty in the minds eyean audiovisual kaleidoscopic window back up the genetic chain. I peer up as I listen to the ancestral vibration.</p><p>Reflectively, I am brought forward to see 2C-T-7 as the chemical bridge which traverses the river of Cartesian Dualism. It is the span connecting cosmic imagination with human feeling.</p><p>Goddess Bless.</p>",
 "year": "2000",
 "id": "2205",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-27T07:00:00.000Z",
 "views": "22780"
}
