{
 "title": "Curses, Foiled Again",
 "author": "Croc Hunterdm",
 "citation": " Croc Hunterdm. \"Curses, Foiled Again: experience with AMT & Melatonin (ID 22061)\". Erowid.org. Apr 21, 2006. erowid.org/exp/22061",
 "substance": "AMT & Melatonin",
 "bodyweight": "154 lb",
 "report": "<p>One of my biggest problems with tripping is that it interferes big time with my sleeping pattern. I usually tend to dose right after getting off of work on the weekends, around 7pm. This usually keeps me awake until 8am the next morning, and this is where the trip ends, whether the substance is DXM or tryptamines.</p><p>With yesterday being such a fine day, I decided to try an experiment to test my mettle against the trip-related insomnia. I had a pre-capped 50mg capsule of AMT, which I took on an empty stomach save for morning coffee, a multivitamin and vitamin C. This being a school day, I planned to take my dose before my first class so the AMT would kick in just as I was getting out. I was already comfortable with this dose and knew I could keep my cool, which I did.</p><p>I took the capsule and waited two hours, as normal, but saw no huge effects other than an excited feeling. It wasn't until about 3.5h, around 2:15pm, after dosing that I started getting visual effects. The effects were nice; good trails, distortions, things moving in fluid like patterns. Also the euphoria kicked in, I felt absolutely great. I was quite a bit more active in my afternoon class than I had been in recent weeks, and I don't think anyone took the time to look at the size of my pupils.</p><p>I finally got out of class and amused myself in the computer lab for about an hour, and then went home. Around 6pm I was still getting good effects, but I could tell they were wearing off. I ate an orange, the only food I'd had all day.</p><p>Around 11pm I took a melatonin capsule and an aspirin to help with the oncoming headache which I usually get at the end of tryptamine experiences. I felt pretty tired, and hoped that my dosing some 13 hours earlier would allow me to sleep comfortably. By about midnight, I noticed something odd- My trip seemed to be restarting. While it had almost fizzled out a few hours earlier, it was now back in full swing as far as the visuals were concerned. I'd like to think that this was due to the melatonin I took, as I understand this substance converts to DMT and other tryptamines in the body. Perhaps this isn't a scientifically sound statement, but I like to think that the tryptamines in the melatonin gave me a boost.</p><p>The bad thing was that I still couldn't get to sleep. I tossed and turned and I remember looking at the clock at around 4:40am, and finally I must have caught a few hours of sleep, because I woke up at 9:00am. So now I'm pretty tired, but not dead tired as I usually am if I get no sleep at all.</p><p>Curse the tryptamine insomnia, but bless the tryptamines!</p>",
 "year": "2003",
 "id": "22061",
 "gender": "Male",
 "timestamp": "2006-04-21T07:00:00.000Z",
 "views": "11883",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 12:00",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 }
}
