{
 "title": "Skepticism Replaced by Euphoria",
 "author": "RoBsTa",
 "citation": " RoBsTa. \"Skepticism Replaced by Euphoria: experience with AMT (ID 22065)\". Erowid.org. Sep 23, 2008. erowid.org/exp/22065",
 "substance": "AMT",
 "bodyweight": "160 lb",
 "header": [
  "DOSE: T+ 0:00",
  "45 mg",
  "oral",
  "AMT",
  "(capsule)",
  " T+ 1:30",
  "1 bowl",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>It was monday afternoon and I had just picked up my package of AMT from the mailroom.  The week prior was spent reading stories and doing research on this substance.  Later in the day, after I had finished my last class, I decided to measure out four doses (2-40mg doses and 2-45mg doses).  (I will also mention here that the AMT I purchased was rated at 99.8% purity, and the strong smell usually associated with this substance was nearly non-existant.</p><p>Later that nite I met up with some of my friends (who had never heard of the substance before) and inquired if they would like to trip.  At 9:00pm, I ingested one of the 45mg doses and let the other 3 people choose which dose they would like to take.  After about 20 minutes I noticed the beginnings of some nausea.  35 minutes after ingestion, I was sweating profusely and decided to go throw up in the bathroom in hopes of relieving the nausea.  After throwing up for 5 minutes, the nausea subsided rather quickly and I returned to the group.  The other three who had taken the AMT mentioned a slight feeling of nausea, but none of them threw up.</p><p>1.5 hours after ingestion we all decided to go outside and smoke a fat cone of some cannabis that we had purchased earlier in the day.  3.5 grams were smoked between 5 people and we were all feeling high by the time we finished.  Around the 2 hour mark I started getting the urge to smile and express feelings of warmth.  Our group went and sat in the lounge on our floor and munched out on food that we had purchased at the nearby vending machines.  At 2.5 hours everyone had completely stopped talking about AMT and we were all very talkative.  It was at this time that we all started mentioning how weird we were feeling.  All at once we all started spitting out adjectives to describe our current state: 'warm', 'happy', 'buzzing', and 'insane clarity' were the typical comments. </p><p>At 3.5 hours we were all sinking deep into the peak.  The mind blowing aspect of this drug was the indescribable clarity of my mind.  There was no mind fuck, no depression, and no paranoia whatsoever.  Also, everyone was acting very level-headed: everyone was in control of themselves and there was no feeling of being an e-tard.  Around 2am (t+5 hours), we got our friend B to drive us around the city so we could enjoy our buzz on the road.  As for the visuals, there were definitely visual anomalies but only when I specifically looked for them.  All bright objects seemed to be colorful and have an electric glow to them (similar to a low-dose of LSD).  At this point the four of us who were tripping were talking non-stop and were communicating with an indescribable happiness among one another.  We ended up rambling on to our friend B for the next 3 hours about how good we felt and how everyone in the world should be able to try this divine substance.</p><p>The rest of the night was spent watching television and talking to one another.  The come down was surpisingly smooth and the happiness lasted well into the day.  I went to sleep at 10:30am (t+25.5) and woke up at 7pm feeling slightly tired.</p><p>Overall, this was hands-down the best drug I have ever experienced in my life.   The best part of this drug is the clarity of my mind:  imagine LSD combined with MDMA without the mind-fuck and feeling of stupidity.  This drug also produced a feeling of immense satisfaction during and after the peak.</p>",
 "year": "2003",
 "id": "22065",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-23T07:00:00.000Z",
 "views": "5795",
 "dose": {}
}
