{
 "title": "Levels of Red",
 "author": "Stiggers",
 "citation": " Stiggers. \"Levels of Red: experience with Cannabis (ID 22064)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22064",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "report": "<p>I want to share an interesting experience I had the other day with Cannabis.  I am a somewhat experienced drug psychonaut.  I have only tried weed, opium, acid, e, shrooms, and salvia, and a number of pharamaceuticals.  The other day I had some high quality buddha and was smoking to myself, because all my friends were either asleep or busy.  So as the night came to an end, I was lying in bed, still pretty damn fried from the smoking I had been doing all day.  I was home alone, so I sparked a bowl while still in bed.  It got me extremely stoned, because this was the last of my bud, so I packed an extra large bowl.</p><p>I noticed the room was cooler than usual.  I stared at the string hanging from my overhead fan that controls the light.  It was totally motionless because the fan was not on, and my room has no draft, however it seemed to be moving very far away, and then coming very close to my face.  I stared at this for a while, then started looking around my room.  Letters on boxes seemed to dance around, gyrating and pulsating on the box.  I closed my eyes because I was getting tired, and I noticed I had CEVs.</p><p>Now normally when I close my eyes, I either see total darkness or blobs of shape that I suppose are normal when everyone closes their eyes, these blobs have a somewhat dark purple tone to them, I believe.  Anyways when I closed my eyes, I didn't see any purple blobs, I saw different 'levels of red.'  What I mean by that is the colors of red were placed differently as to give depth.  These 'levels of red' morphed into what seemed to be a videogame being played right in front of my eyes.  The shapes were moving around very fast, and I soon realized that I was playing a Sonic The Hedgehog game in my head.</p><p>I thought this was cool, but once I started focusing on it, it seemed to fade away.  I let myself go, and the CEV of the video game returned.  I found that if I let myself go, but payed attention to what I saw, I could control the video game character running around.  It jumped, ran, and did all the other stuff at my will.  I opened my eyes and I could still see a faint image of the video game character right in front of my eyes for a couple seconds before it disappeared.  Whenever I opened my eyes and closed them again, the video game character would return, but at what appeared to be a different level in the game.</p><p>This went on for about 10 minutes or so, when I had a Kool cigarette that made me a little more stoned, but the CEVs went away.  It was interesting that Cannabis can produce CEVs, I didn't know that until now.</p>",
 "year": "2003",
 "id": "22064",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-02T07:00:00.000Z",
 "views": "2536",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
