{
 "id": 2208,
 "title": "Magic Jello",
 "date": {
  "submission": "2007-07-06T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blue Star",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "Tbsp"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "cookie/food"
  }
 ],
 "report": [
  "Well, I have been experimenting for quite a while with this magical little flower, and decided to try something unheard of, I decided to make some magical jell-o. Thats right, that fruity little snack we love to consume. My recipe for MG tea proved successful, so this was the next obvious step. Yesterday I went down the street to help myself to some wild growing morning glorys, and went back to my kitchen to prepare the jello. I set two cups of water to boil. After it had reached a nice rolling boil, I set 20 flowers in to stew for 30 minutes. After which the water had turned a purple, blue, and green mess, and the flowers had turned green! Dunno what from, but they did. I mixed in the pack of jello, and added another two cups of water and then stuck it into my fridge to cool.",
  "About two hours later me and my lady friend helped ourselves to three massive spoonfulls each. Tasted yummy :)At about T+30 the effects started to set in. It felt like sudenly weighing about -50 pounds, and we literally floated up out of our seats. It made eveything in the world right, like it was meant to be. We felt very in touch with each other, and this effect lasted about 2 hours. The effects had seemed to dissappear completely, then at about T+4 I laid down on the couch and was out like a light. This fact was again proven today at exactly T+4 I crashed out again.",
  "If nothing else, this makes a wonderful sleep aid, as well as a very potent (and not to mention cheap) high. Go for it, you won't regret it :)"
 ],
 "erowid": {
  "id": "17408",
  "citation": " Blue Star. \"Magic Jello: experience with Morning Glory (ID 17408)\". Erowid.org. Jul 6, 2007. erowid.org/exp/17408",
  "substance": "Morning Glory",
  "views": "5456"
 }
}
