{
 "title": "Redosing the Warm Body Buzz",
 "author": "Shams",
 "citation": " Shams. \"Redosing the Warm Body Buzz: experience with 4-Acetoxy-DiPT (ID 2208)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2208",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "130 lb",
 "report": "<p>After having measured out ~25mg of the 4-acetoxy-dipt, dropped it in a cup with some apple juice and downed it: yuck, foul tasting stuff. Onset was fairly rapid, about a half hour, and I was settled into it rather nicely. At around the 45 minute point, one of my housemates came crashing through the door, which was a tad unsettling to the experience. The first dosing was somewhat uncomfortable, which perhaps had something to do with the fact I hadn't slept terribly well the night before and woke up feeling a bit unbalanced. I found the material to be warm (especially in the head) and fairly colorful, with pastel purple, blue, pink and green visuals not unlike those experienced with 5-meo-dipt, and similair to those experienced with dpt. At the 25 mg level, the experience was largely body-oriented with relaxed breathing and general body warmth.</p><p>At the 90 minute mark, I swallowed another 25 mg and experienced much the same over the next 90 minutes-2 hours. And, although the body-warmth and relaxed breathing was pleasant, the material didn't strike me as being particularly engaging: pretty generic as a tryptamine. So, I decided to push the dose a little and at around 3-4hours from the time of the original dosing I downed 30-40 mg. As it came on, I became aware of some fairly intense sensations in my eyes: it was an icy hot feeling that wasn't altogether comfortable, but definitely tolerable. At this level, it was a little more engaging and interesting; with more visual play. At some point, I found myself reflecting on the dpt-state with some clarity; realizing that although there is some overlap with 4-acetoxy-dipt and dpt, the former is nowhere near as engaging, ego-dissolving or challenging. With dpt, one is seized by the spirit of the experience, and there is no room for distraction. 4-acetoxy-dipt is more of a body buzz with nice relaxation and some visual play.</p><p>I found dancing at this level to be particularly pleasant, as the body was very fluid, relaxed and enjoyable in it's movement. My second housemate arrived at some point, and I was able to be collected enough to negotiate plans for the evening and following day. After he left, I opted for one last whopper of a dose (40-50 mg) at 6 hours from the initial dosing. This last dose seemed to come on a little slower, and I noted an increase in the sensations in my head and behind the eyes. Behind the eyes was particularly electric, and the heat in the head was close to feverish. I lay down and start listening to music. At this level, the visual aspect became more prominent; however, the ego was well intact. Music was quite enhanced and pleasant to listen to; the final track of 'towards the within' was experienced quite poignantly. I found myself very naturally crying, with huge amounts of fluid coming out of my eyes. At the point of crying, tthe visual element became much softer and more fluid; and some of the residual tension I had been experiencing throughout the day seemed to dissolve. This was definitely the most enjoyable dosing; and, after crying I felt very refreshed.</p><p>As the evening progressed, I came down quite slowly-perhaps due to the large amount ingested. I had a difficult time falling asleep, and was rather dehydrated. It took me awhile to figure out that alot of the evenings discomfort had to do with the dehydration, and after drinking ALOT of water I fell asleep. I had to wake up quite early the next morning, and felt pretty good for only having gotten 4 or so hours of sleep. I did note that in the days following, I was somewhat depressed: this might have had something to do with the lack of both sleep and food (generally, I get depressed when I don't eat and sleep). Overall, a nice, warm body buzz; good for dancing and the like.</p>",
 "year": "2000",
 "id": "2208",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-27T07:00:00.000Z",
 "views": "10977",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 1:30",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 3:30",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 6:00",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(powder / crystals)"
  }
 }
}
