{
 "id": 221,
 "title": "Don't Do It Alone",
 "date": {
  "submission": "2000-12-14T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Odysseus"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  {
   "time": "0:45",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "My first experience with morning glory seeds had none of the terrible nausea and wrenching mental anguish often described in stories about the seeds.",
  "My previous experience with psychedelics was one low-level LSD trip, two MDMA experiences, and some grass.  I was fiending for some acid, but none was to be found in my area, so I figured I was gonna have to improvise.",
  "I ate two 1.5g seed packets...but I didn't feel anything, so about forty-five mintues later I ate 4 more. I was on the phone with a friend at the time, and I noticed before I'd finished with the other four packets that I was talking faster and moving around a lot more. I warned my friend (who happens to be rather anti-acid) because I didn't think she'd understand if I just cut the cord or stopped making sense. She chewed me out and the seeds were starting to kick, as confirmed by a pupil check and the fact that I simply did NOT want to move.  Acid euphoria started in (which I still think is the best feeling off of any drug I've tried) before any real perceptual distortions, and then, just like LSD, I began to look around the room and it was a new world - the lights were brighter, every sound in the house could be heard (I was the only one awake) and I was having mild hallucinations (certain aspects of photgraphs or paintings disappearing, everything on TV seeming liquid including people, and tracers).  The most fantastic thing was to walk outside and hear EVERY SOUND in the entire neighborhood, from a car that must have been miles awa,y to my neighbors sleeping in their beds, and being able to FEEL the bark of a dog on my skin (it was electric, like thousands of tiny pin pricks).",
  "But these things aren't terribly important, any acid head will realize them before too long. What is of importance is what happened in the last two or three hours of my trip.",
  "The paranoia off the morning glory seeds was worse than any other paranoia I've felt, possibly because I was alone, but I felt VERY SURE that I was going to get caught if I didn't sneak around the house and quickly run to my room and go to bed.",
  "BIG MISTAKE.  I snuck into my room and immediately tried to lie down and force myself to sleep. Remember always that when you're tripping you cannot just turn it off, and if you try to control the trip completely, you'll get burned.  I panicked, broke into a cold sweat and felt what was singularly the most intense panic I've ever felt. It was completely foundless. I was terrified, but there was no object of my terror, and I tried to turn off my mind by concentrating, only to be greeted by a rapidly shifting field of squares of changing color which encompassed my vision more and more distinctly the harder I tried to fight it (and sped up the harder I fought, too).  I heard the most eerie unearthly techno that I've ever heard in my life, but there was no music on, it was all in my head, and it freaked me out. All the lights on the various digital clocks in my room jumped around and had tracers and I felt like I was completely losing control, and for some reason was licking the pillow just to make sure I was grounded.  Sounds funny now, but I can assure you it was NOT pleasant.  I kept going like that until I eventually just sort of passed out a few hours later.",
  "Morning Glory seeds are just great for a trip, but for God's sake don't do it alone, or if you do, don't scare yourself. You get really nightmarishly paranoid if you don't just take everything coolly."
 ],
 "erowid": {
  "id": "1024",
  "citation": " Odysseus. \"Don't Do It Alone: experience with Morning Glory Seeds (ID 1024)\". Erowid.org. Dec 14, 2000. erowid.org/exp/1024",
  "substance": "Morning Glory Seeds",
  "views": "26934"
 }
}
