{
 "title": "The Right Amount of Mushrooms",
 "author": "Arlington Shroom Man",
 "citation": " Arlington Shroom Man. \"The Right Amount of Mushrooms: experience with Mushrooms (P. semilanceata) (ID 221)\". Erowid.org. Aug 16, 2001. erowid.org/exp/221",
 "substance": "Mushrooms (P. semilanceata)",
 "bodyweight": "155 lb",
 "report": "<p>After a rather successful mushroom picking expedition into some local pastures, my friend and I decided to try a test sample. Giddy with all of the acquired mushrooms (4 1/4 lbs to be exact), we eagerly placed about a pound of wet liberty caps into a cauldron-style pot of boiling water. We let the tea continue boiling for 30 minutes. At the end of 30 minutes, I took a potato masher and smashed the mushrooms into the bottom of the pot to further extract their juices. The whole mess was then filtered through a large paper towel-lined colander to remove debris. What was left was six coffee cups full of tea so dark one could not see an inch into it.</p><p>We each drank three cups right in a row. Within ten minutes of finishing my last cup, I could feel the psilocybin invading my body. It started in my stomach as almost a tingling sensation and progressively spread out through me. By the time it reached the tips of my fingers, it felt as though my muscles were all being involuntarily flexed. My cheeks became rosy and my eyes lost all color. I thought about every minute thing with incredible intuitiveness. In my euphoric state, people amused me. Simple actions and mannerisms seemed so foolish and unimportant. It was almost as though I felt like some higher being, like a god. I wanted to help people understand how trivial their lives are, I wanted them to see the bigger picture and to be as at peace as I was. I rarely spoke during this time, it seemed like the English language could not allow me to express what I wanted to get across.</p><p>After about six or seven hours, I fell into a sort of numb stuper which can be best described as dreaming while awake. Ever since this experience, I have looked at things differently. The way people act amuses me. Advertisements and marketing strategies seem comical and stupid. Even more comical is the media and the way that people follow its lead like a herd of cattle. I would not recommend this large of a dose for any but the experienced tripper and even to them I give warning. My experience has changed my way of thinking forever.</p>",
 "year": "2000",
 "id": "221",
 "timestamp": "2001-08-16T07:00:00.000Z",
 "views": "16851",
 "dose": [
  {
   "time": "0",
   "amount": "3 cups",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata",
   "form": "(tea)"
  }
 ]
}
