{
 "title": "Godspeed to You Emperor",
 "author": "TS",
 "citation": " TS. \"Godspeed to You Emperor: experience with 5-MeO-DiPT (ID 22107)\". Erowid.org. Jul 29, 2006. erowid.org/exp/22107",
 "substance": "5-MeO-DiPT",
 "bodyweight": "150 lb",
 "report": "<p>The first night of spring break, a few friends and a few acquaintances left our tiny mountain college town to attend a performance by the instrumental rock band Godspeed You! Black Emperor.  After arriving at the venue, I learned that one of the acquaintances (we'll call him 'J') had brought along a small collection of drugs, including three capsules containing low doses of what he only called 'Foxy,' saying that it was 'kind of like Ecstasy.'  I was pretty sure this description wasn't the most accurate, but didn't know enough to argue.</p><p>I'm usually far more responsible when it comes to experimenting with new substances, but I decided to go ahead and be stupid tonight and take the pill offered to me (J was taking the other two).  I swallowed the pill sometime around 11pm on an almost empty stomach.</p><p>Another friend, C, was curious about drugs but hardly ever used them herself (she doesn't even smoke marijuana, in fact) and so asked me how I was feeling 15-20 minutes later.  I told her that the only noticeable effect was that my eyes would take longer to adjust to light immediately after closing and opening them -- I imagine this is only because my pupils were beginning to dilate.  At this point I was pretty sure I wouldn't get much out of this drug, but I knew to be patient and wait for any further effects.</p><p>And waiting was all I needed to do.  GY!BE's music is highly emotional to begin with, and I believe that the drug only heightened that effect.  During the songs' lengthy crescendos, I found myself grinning wildly with eyes closed, filled with a great sense of joy and hope as cymbals crashed and feedback swelled.  I became intensely aware of my 'personal space' and often watched my feet, noticing my distance from other audience members and feeling simultaneously closer to and further away from them (note that this was just a 'feeling,' not any kind of actual visual distortion). </p><p>I also found myself touching and rubbing my pants and especially the insides of my pockets.  During what I would assume was the peak of the experience (I found my sense of time and my short-term memory impaired, but I would guess this was about 2 hours after ingesting the pill) I experienced some very subtle closed-eye visuals that are difficult to describe, but were nothing uncommon or extraordinary as far as synthetic/chemical psychedelics go.</p><p>After the concert I went to a Waffle House with C and a few others and realized that I was still quite energetic and still feeling the effects of the drug.  My face was slightly warm and had been sweating some and my jaw had a tendency to clench, but these were the only noticeable side effects...I never experienced any nausea or real discomfort.</p><p>Overall, a positive experience: just powerful enough to enhance my enjoyment of the music without overpowering it.</p>",
 "year": "2003",
 "id": "22107",
 "gender": "Male",
 "timestamp": "2006-07-29T07:00:00.000Z",
 "views": "3225",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(pill / tablet)"
  }
 }
}
