{
 "id": 2215,
 "title": "A Kind of Purity in the World",
 "date": {
  "submission": "2007-07-06T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Interested Party",
  "gender": "Female",
  "weight": 55
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have never felt 'fucked up' at all while rolling.  There is no haze which fogs the brain; there is no inability to control my physical actions, unlike alcohol.  I would describe it somewhat as the opposite of 'fucked up.'  There is a stripping away of an outer core, one which normally holds me to all of the societal fears of opening up to people and seeing my world with clear, fresh eyes.  To experience MDMA is to experience a kind of purity in the world, not an adulteration.",
  "Three years ago, I had experienced 'E' more than ten times and felt that the effects were becoming weaker and weaker.  Mind you, those ten times had been very close together, and I had lost interest.  A couple of weeks ago, my sister and I (who live 2,000 miles away from each other) had the opportunity to experience the chemical together and we jumped at the chance.  None of the 'old magic' had been lost.",
  "We prepared for our evening of ecstasy by eating a small lunch that afternoon of Vietnamese noodle soup, as well as some spring rolls.  We then went home, and, planning a relaxing evening in instead of hacking it at the club, acquired the provisions--the tablets and one slim but firm joint of hydro.  My friend and her husband were with us and we all dropped around 6:30 p.m. while it was still daylight.  It was wonderful.  Our dogs were with us and they were eagerly lapping up the attention we lavished on them as we all warmed ourselves in the garden. ",
  "After our moment of awe with the sunset, my sister and I enjoyed a good peak-puke--like a pleasant little cloud rising in your throat as she says--and talked around the base of the toilet for a long time, about our parents divorce, about our own estrangement from each other, about characters in books we identified with, about everything.  My friend, with whom I had not yet become close, suddenly became very accessible to me, and we are now incredibly close friends.  He and I sat by the stereo, plugging in Steve Vai and Tears for Fears (intense peak music), Pat Metheny (nice plateau music) and Miles Davis (chill come-down music)for much of the roll.  He and I are both involved with our education, and we talked about that quite a bit.",
  "It was, as it always is, over too quickly.  But, my sister and I had to part ways the next morning and head back to our homes and lives.  So we went to bed.  As for the aftereffects, I felt as I had the last times I had done 'E'.  I felt like I had taken a really hard test the day before and hadn't slept the night before in studying for it.  I felt this way for a good three days; I didn't care much for being really active during this time.  But, it's always worth it--and it should be my right to determine what's worth it for my body and self."
 ],
 "erowid": {
  "id": "17438",
  "citation": " Interested Party. \"A Kind of Purity in the World: experience with MDMA (Ecstasy) (ID 17438)\". Erowid.org. Jul 6, 2007. erowid.org/exp/17438",
  "substance": "MDMA (Ecstasy)",
  "views": "4768"
 }
}
