{
 "title": "A Fantastic Voyage",
 "author": "chemlab",
 "citation": " chemlab. \"A Fantastic Voyage: experience with Hawaiian Baby Woodrose Seeds (ID 22178)\". Erowid.org. Mar 17, 2003. erowid.org/exp/22178",
 "substance": "Hawaiian Baby Woodrose Seeds",
 "bodyweight": "170 lb",
 "report": "<p>I recently aquired some Hawaiin Baby Woodrose seeds from a source claiming that they were grown in Hawaii.  I had read numerous reports concerning the fuzzy coating surrounding the seeds.  Some theorize that these seeds (and morning glories) are intentially poisoned by seed companies to disccourage people from consuming these seeds.  Also, I have heard that these seeds and others such as Apple seeds naturally produce cyanide inside their seeds.  Nevertheless, I thought it would be a good idea to scrape these fuzzy coatings off before consuming the seeds.</p><p>First off, this is no way my first experience tripping or other highs. It would be easier to name what I haven't done.  Notable psychedelics that I have done would include LSD, MDMA, MDEA, 5-MeO-DiPT, Salvia, DiPT, 2CT7, Psilocybin + Psilocyn Mushrooms, Amanita Muscaria Mushrooms, DXM, Ketamine, AMT and probably some others that have been forgotten.  Basically saying I have seen a large spectrum of hallucinagenic substances.</p><p>Anyway, getting onto the real experience.  I have read many reports of people complaining of being nauseous and hear the same from experiences of my friends.  I have never felt nausea from LSD and thought maybe the possible naturally cyanide inside would be the culprit.  So thinking of putting LSD on my toungue and letting it absorb sublingually, I chewed the up 10 seeds (that had the fuzzy coating scraped off) and kept them soaking in my mouth for as long as I could.  The strange taste from the seeds began to build up after 15 mins or so and I couldn't take it and spit out the seeds,  Being completely sober before chewing the seeds, I felt a strange head change.  This was about 9:30 PM.</p><p>I then started to play Grand Turismo 3 for Playstation 2.  I dont like sitting around thinking about the experience to come.  I figured Video games would keep myself occupied for a while.</p><p>Around ten o'clock I thought it would be worthwhile to eat some more seeds.  This time I thought, I will swallow them.  I chewed up the seeds and swallowed them with some Dr. Pepper.</p><p>Instanly after I guess the first 10 seeds kicked in.  I suddenly felt anxious.  Suddenly the nauseau built in my stomach.  I looked at the video game screen and thought I shouldn't have swallowed those seeds.</p><p>I decided to try smoking a nice nugget from my glass pipe.  A couple puffs of the sweet sinsemillia and my nausea was gone.  Also, accompanying my stomach feeling better were the start of visuals.</p><p>Around 11:30, I looked at my pupils in the mirror.  They were a little bigger than normal.  But, I never beleive I am tripping unless my pupils cover most of the colored part of my eye.  I was a little discouraged, but I still felt a nice buzz.  No one can put the way they feel in words, its impossible.  However, it did feel like its cousin LSD.  But, instead of being stimulated, my body felt depressed.  I was really lazy, lying down.  Something I would never do on acid.  I wasn't sure if this was due to the LSA or other ergoline contents of the seeds or the intoxicating effects of possibly cyanide. </p><p>I decided to chew up 4 more seeds and held them on my toungue but did not smallow them.  I spit them out after fifteen minutes and instatntly felt my effects jump dramatically.  I was surely tripping now.</p><p>I looked at my pupils and I could see only large black pools of oil, I thought. The walls began to breathe and things began to 'shift.'  This was different from the flowing motion produced by LSD, Psilocybin, or 2CT7.  I would look at the celing and it would shift right, then back.  Something I have never seen from any other hallucinagen.</p><p>I packed up my bong with some more sensi.  I took a couple hits and felt even more intoxicated.  These seeds feel so different than all the other trips I have done.  I feel like I have downed a 12 pack of Beer, but took some LSD on top of it.  I usually drink when I trip and this is what it felt like.</p><p>I thought about so many things in my life.  I also thought about how I wanted to talk to people.  I usually trip with other people, this was a unique thing for me to trip by myself.  I also thought about all the crazy subtances I have consumed and the impact on my brain.  Nevertheless, i was enjoying myself.</p><p>I chilled out for a while, smoked some more Cannabis and watched Pulp Fiction for a while.  Around 3 AM, I felt drowsy and ending up falling asleep very easy.  This also totally different from all the other psychedelics I have done.   It didn't interrupt my sleeping pattern.</p><p>I was extremely impressed witht these seeds.  I slept all night and woke up feeling excellent.  No hangover.  I felt extremely happy the whole next day.  I think when I chew them up and keep them in my mouth, the LSA and ergolines are absorbed but not the toxic substances of the seeds.  Unfortunately, I need to consume nearly twice as many seeds for similar effect to swallowing.  Not swallowing them makes them feel more psychedelic and less intoxicated drunk feeling.</p><p>I liked these seeds and did not ever get the 'freaked' out feeling achieved by Mushrooms or LSD.  They seemed to have more effects on my body and my vision than my thought processes.  Overall, I'd say they feel like good clean hippy acid, but even more natural and way less stimulating.</p>",
 "year": "2003",
 "id": "22178",
 "gender": "Male",
 "timestamp": "2003-03-17T08:00:00.000Z",
 "views": "16108",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "10 seeds",
   "administration": "buccal",
   "substance": "H.B. Woodrose"
  },
  "1": {
   "time": "",
   "amount": " T+ 0:30",
   "administration": "10 seeds",
   "substance": "oral"
  },
  "2": {
   "time": "H.B. Woodrose",
   "amount": "",
   "administration": "",
   "substance": " "
  },
  "3": {
   "time": "smoked",
   "amount": "Cannabis",
   "administration": "(plant material)",
   "substance": " T+ 2:00"
  },
  "4": {
   "time": "4 seeds",
   "amount": "buccal",
   "administration": "H.B. Woodrose",
   "substance": ""
  },
  "5": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
