{
 "title": "A Paradox of Emotion and Visions",
 "author": "anonymous",
 "citation": " anonymous. \"A Paradox of Emotion and Visions: experience with Salvia divinorum (ID 22187)\". Erowid.org. Mar 17, 2003. erowid.org/exp/22187",
 "substance": "Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Cannabis",
   "",
   "",
   " ",
   "",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "report": "<p>[after cannabis]</p><p>I'll never find the right words to describe what happened, but here goes. The first thing I remember was a series of 5 objects indescribable yet completely different from each other. For some reason I think of the color tan when I think of them, so maybe it was part of them. But the 5 objects were lined side by side and moved at me quickly, and my thoughts were read aloud and seemed quite foreign, I was able to sub-think or counter my thoughts that were read aloud with completely different thoughts, from seemingly another person, but they were definitely self-generated.</p><p>Every time I did this counter thinking, one of the objects would be affected by it, I had no idea what caused each object to be affected, but it didnt see to be random. By affected, I mean a notch, like, a replica of the main object would appear right behind it in a row, and I saw it in a sort of  birds eye view. I only faintly remember thinking about something, I believe it was something of the din. Din being the only way I could think to describe the sound. The thought that was being read aloud thought it was Family of the (something sounding like Din) Its quite unclear what happened right after that, but Family of the Din was of great importance. I remember all of a sudden having a strong feeling that I was sitting at a chair at a dining room table, I looked at a father who was to my right, and to my left a mother and the chair opposite me was empty. It is very hard to describe because a lot of things that happened were feelings and not visions, things never otherwise felt or experienced. But visions were definite along with the feelings sometimes.</p><p>The next thing I remember is feeling like I was sitting on top of the table and I felt ashamed because I knew I shouldnt, but I didnt move. I look to my left and on the edge of the table are 2 fingers, curled from beneath it, pulling the wood making up the table as if it were cloth. A strong feeling of being pulled in the direction of the fingers coincided with the vision. A lot is foggy around this point, hard to remember in detail all of the strange events. But I seem to remember some great importance to the left and right corner of the dining room table, the fingers were on the left, but on the right I cannot recall, I only remember both spoke in separate distinct voices. Not much happened or I cant recall or describe, but not long after that, the intense period had ended and it was smooth sailing to baseline.</p>",
 "year": "2003",
 "id": "22187",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-03-17T08:00:00.000Z",
 "views": "7452"
}
