{
 "id": 2222,
 "title": "Smoking Shrooms is a Waste",
 "date": {
  "submission": "2003-12-02T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sean the Shaman",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.75 g",
   "administration": "smoked",
   "substance": "Mushrooms - P. cubensis",
   "form": "dried"
  }
 ],
 "report": [
  "I managed to come across shrooms constantly and I was buying Ounces back to back. With all the shrooms that I had been acquiring, I knew that I had confront the controversy on smoking shrooms.  Up until this point I had never tried smoking them, but read that psilocybin breaks down at relatively low heating temperatures. But people have told me that were trippin balls from smoking shrooms.  I didn't know what to think.",
  "So I had about half an 1/8th Ounce (1.75 grams) and I bought a bought a Dub sack of weed (1 gram).  I figured that if the smoking shrooms works a little I could try to intensify it with weed or if it dosent work at all then at least I could blaze. I didnt know if this was going to work or not, either way would have been fine with me; I was experimenting. So I grabbed my bong, filled it with water, loaded the whole bowl with dried crushed Cubensis, opened my mind, and hit it.  The shrooms were really hard burn but I did it. I noticed that the smoke cloud was thin and faintly blue.",
  "Since the shrooms were hard to burn, I decided to break down some weed and mix the weed and shrooms in the same bowl to see if it would burn better.  That didnt do much good either, the weed was burnin fine and the shrooms still were not, so the bowl was blazin in different areas.  Again I noticed the smoke was blue and I found this interesting and worth noting since I did not read this anywhere.",
  "I finished off smoking the remaing shrooms and saved the weed. I waited for the next hour to feel any effects of the shrooms. I felt none. I wasnt mad, but it would have been nice if it worked. So naturally I smoked the rest of my weed. In the end I was satisfied that I could say that I have tried smoking shrooms."
 ],
 "erowid": {
  "id": "17457",
  "citation": " Sean the Shaman. \"Smoking Shrooms is a Waste: experience with Mushrooms - P. cubensis & Cannabis (ID 17457)\". Erowid.org. Dec 2, 2003. erowid.org/exp/17457",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "19935"
 }
}
