{
 "title": "I am the Fourth Right",
 "author": "Gooch",
 "citation": " Gooch. \"I am the Fourth Right: experience with Salvia divinorum (5x extract) (ID 22225)\". Erowid.org. Apr 4, 2007. erowid.org/exp/22225",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "175 lb",
 "report": "<p>I was at my friend Lucas' house during the summer with a few friends of ours.  We live in this 'fastest growing city' in Missouri, called O'Fallon.  It sucks.  I am almost 20 years old now, and all there is to do is hang around and experiment with drugs.  I have had Saliva Divinorum on other occasions, and I knew what I was up against.</p><p>I had bought some Salvia 5x Extract from this local head shop near me, and brought it to my friends.  A couple of my friends had never tried it, and had 'experiences' as well.  My friend Brian, who you see only laugh like once every 6 months, was sitting in the corner of the room laughing his ass off for about 5 minutes after hitting it.</p><p>I was sitting on the floor of his bedroom, and I packed myself a metal bowl full to the brim.  I was sitting on this quilt that was black and an array of assorted colors in square patches.  I hit the salvia and held it in as long as I could, feeling my body temperature rise as it does when smoking salvia...  I let it out and quickly inhaled the next hit.  The next thing I knew, I was being pulled down towards the blanket and floor.  I was laughing, and I instantly turned into a small fleck, flying down INSIDE of the quilt.  Rushing through the tunnels of stitching.  It quickly turned into what I can only describe as flying through underground dirt tunnels, with tree branches and roots visible and hitting you as you fly by.  Every once in a while there was a hole opening up to a view of a jungle and light shined in.  I flew out of this tunnel and over a black murky, dirty, muddy looking river, JET BLACK.  It was the lowest of the 'levels'. </p><p>I was flying up what looked like giant steps, about 50 feet tall, and 50 feet long each, and they had trees, and grass and stuff.  But each level, about 25 of them, were each different colors.  And as I flew from the very bottom (jet black) the colors faded from black, to blue, to purple, to red, etc.  When I arrived at the very top level (The top I could feel was best.  The levels got better and better as you went up. Earth was at the lowest.) There were 3 entities that I could feel and somewhat see.  I was told that I was god of this world, the world that we as humans know as reality.  I was told it was all just a creation of my mind, everything was made up in my head, from spoons, to cars, to the music we hear, to the people we see, and the names we know, EVERYTHING, was made by me, or so I felt and was told by these 3 'Rights' as I called them.</p><p>I was supposedly the 4th 'Right' or god.  And I created earth, and humans, etc.  I was told that I was just in this body to 'test' my creation and see how poorly of a job I did.  I was happy to be back to this land, where I felt I belonged.  They then told me I was to go back until this life was over.  They basically threw me back down these levels, and I splashed into the black murky river down the lowest level, lowest = worst.  I awoke with my face on the black part of the quilt and was still fucked up.  I was ranting about my experience to my friends, and saying how salvia 'ISN'T A RECREATIONAL DRUG, IT'S A TRUE EXPERIENCE.'  I reached total divinity.  I knew everything at that moment, and when you reach those moments (I have more than once) it's amazing.  Salvia is good to do as long as you approach it with respect, and know that it's not for fun, it's an experience and mind expanding.</p>",
 "year": "2002",
 "id": "22225",
 "gender": "Male",
 "timestamp": "2007-04-04T07:00:00.000Z",
 "views": "2571",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
