{
 "title": "Hitting the Upper Atmosphere",
 "author": "abaZabaa",
 "citation": " abaZabaa. \"Hitting the Upper Atmosphere: experience with AMT, Cannabis & Diazepam (ID 22227)\". Erowid.org. Jul 13, 2013. erowid.org/exp/22227",
 "substance": "AMT, Cannabis & Diazepam",
 "bodyweight": "131 lb",
 "report": "<p>I have used AMT 3 times orally before this and have also smoked AMT. The smoked method was not very interesting and maded me feel depressed.</p><p>A little about the setting. Me and B had decided that we would travel to ZZZ for an experince with a science center while we had 'opened' a few doors. AMT is nothing new to both of us so we were ready with a large group of other things to boost the experince. B had brought 1 gram of P. Cubensis that he had wanted to share with me but for reasons I'll explain later I thought that I shouldn't take them. Our doses were decided a week in advance and I wanted to take 60mg but decided that morning to go for 55 while B went for 45-50. We started the road trip to ZZZ and begin to talk about our past trips and decided to dose about 30mins before we arrived at the science center. We both dosed at sometime around 10am. We spent time in the science center, walking around this city, and in an IMAX/OMNIMAX.</p><p>The trip,</p><p>T 0hrs - A little anxious about the day. Take my dose and a few hits of hash. I'm pretty stoned at this point because the hash is pretty dank.</p><p>+30mins - I puke because I'm a pussy prolly. B still feels fine. I get sick to my belly over the next hour and puke 4-5 times. I peak at about 1 hour it seems but I keep tripping harder and harder. I feel like a plane that is taking off in terrible conditions and then hitting the upper atmosphere and seeing nothing but clear skies and sunshine. I can see space from this point.</p><p>T + 1hr 30mins - I have peaked for sure and I am very happy with myself and my life. I feel ready for the day ahead. B was a little worried when I was puking in the science center but he took charge and helped me alot. Another reason why a buddy is important.</p><p>T + 2 hrs - The visuals are strong when I let them go where they want to go. But I'm not really impressed with the visuals I was getting as compared to my last trip. My stomach feels ok now but doesn't want anything to do with food. Water is good though.</p><p>T + 3 hrs - The big moment. We go to see IMAX while tripping. Holy shit is all I can remember. The Imax was called Coral Reef Adventure and Crosby Stills and Nash did the songs to it. It was SOOO crazy that I have no idea how to tell anyone in the world about it. I took some Diazapam at this point to calm my nerves. It worked but I was really ficked up. I don't remember the trip much from this point.</p><p>T + 4-12 hours - trips slowly comes down but lasts a long time. I loved it. We return to my house at about 8 pm still trripping and decided to toke down about a half a gram of has and eat several diazapams. We do not remember what happened.</p><p>All in all I think AMT is special and will lose its importance if I abuse it. I think that I should be careful in public because I got alot of funny looks because of the permagrin I had plastered on my face. I was also stumbling around quite a bit I think.</p>",
 "year": "2003",
 "id": "22227",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2013-07-13T07:00:00.000Z",
 "views": "492",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "55 mg",
   "administration": "oral",
   "substance": "AMT"
  },
  "1": {
   "time": "",
   "amount": " T+ 0:00",
   "administration": " hits",
   "substance": ""
  },
  "2": {
   "time": "Cannabis - Hash",
   "amount": "",
   "administration": " T+ 3:00",
   "substance": " tablets"
  },
  "3": {
   "time": "",
   "amount": "Pharms - Diazepam",
   "administration": "(pill / tablet)",
   "substance": " T+ 4:00"
  },
  "4": {
   "time": " repeated",
   "amount": "",
   "administration": "Cannabis - Hash",
   "substance": ""
  },
  "5": {
   "time": " T+ 4:00",
   "amount": " repeated",
   "administration": "",
   "substance": "Pharms - Diazepam"
  }
 }
}
