{
 "title": "Definitely not for Clubs",
 "author": "James",
 "citation": " James. \"Definitely not for Clubs: experience with AMT (ID 22233)\". Erowid.org. Mar 5, 2008. erowid.org/exp/22233",
 "substance": "AMT",
 "bodyweight": "200 lb",
 "header": [
  "DOSE: T+ 0:00",
  "100 mg",
  "oral",
  "AMT",
  "(powder / crystals)",
  " T+ 1:00",
  "1 repeated",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>It was a Friday night the mindset was neutral. My friend T called me and asked if I wanted to dig in to my stash of AMT =/. i couldnt resist. He later came and picked me up. We ran in to some girls that live in my neighborhood lets call them S and D. They wanted to go clubbing in Chicago (Mardi Gras party). We decided to go and take the AMT to see how it is.</p><p>We dose at around 6pm. then we call S and D to come and pick us up. I purchase some Marijuana (mid grade) to smoke on the drive down.</p><p>T + 1 hrs</p><p>T and I have to walk about a mile to a popular fast food joint. we start to come up but effects aren't noticeable.</p><p>T + 1.5 hrs</p><p>The girls finally show up and we start heading to Chicago. Once we get on the interstate we roll up a Blunt (about 1.7 grams) me D and T smoke it. This is when the effects are noticeable. T and I confirm that were tripping. Theirs no way we could drive on this dose. The lights from the card going past and going along with us have trails about 1 yard long. Music sounds nice and T and I are excited about the club because their are some good DJ's playing tonight. We both don't Puke or have nausea.</p><p>T + 2.5 hrs</p><p>We arrive at the club and out pupils are fully dilated (hoped they let us in) We get in and the club is bumping. We settle in and the night begins.</p><p>T + 3 hrs</p><p>T and I are now 'TRIPPPING BALLS' S and D want us to dance so we go out to the floor and give it a go. we dance for about 30 minutes and all I remember is the lights and people looking at me funny. I couldnt really dance well on this dosage.</p><p>T + 4 hrs</p><p>T and I decide to sit and watch the ladies dance since it is Mardi Gras =). We both are getting great Visuals and fell great.</p><p>T + 5 hrs</p><p>D and S are party poopers and want to leave. We almost go to a kegger but decide to go home. T and I then sit around the house and play with our tripping toys hehe. We roll up another blunt and we peak again. Nothing worth noting happened though out the rest of the night. </p><p>We finally fell asleep at T + 10 hours.</p><p>It was a enjoyable night, but I wouldnt take this high of a dose at a Dance Club ever again. Maybe I will try 50mgs just as stimuli. I had nausea at times and the visuals were intense at times. i smoked marijuana to ease nausea at around T + .5-1 hrs.</p>",
 "year": "2003",
 "id": "22233",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-05T08:00:00.000Z",
 "views": "4038",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
