{
 "title": "Ecstacy Nightmare",
 "author": "Ska Girl",
 "citation": " Ska Girl. \"Ecstacy Nightmare: experience with PMA (sold as Ecstasy) (ID 22245)\". Erowid.org. Mar 19, 2003. erowid.org/exp/22245",
 "substance": "PMA (sold as Ecstasy)",
 "bodyweight": "120 lb",
 "report": [
  "<p>I had done ecstacy once before, and I wanted more than anything to repeat the experience.  My friend picked up some white double stacked pills with white triangles on them, that we were told contained MDMA.  I took the pill around 11AM in my house with one friend.  We both had a pretty laid back mindset, and neither of us had consumed any other drugs that day.",
  "The substance first kicked in around 11:45, with this hazy sensation that seemed like a very supressed and unintense roll.  However, I was not the slightest bit happy, which was the first red flag that something was not right.  I tried dancing to some trance that we had playing, but I did not want to listen to music, and dancing made me feel sick.  I also refused to drink water, and I felt like I was going to throw up.  I figured it was just a lot of caffeine or something, until I looked at my bulletin board on my wall.  I saw words, but somehow I just couldn't read them.  I became increasingly confused and felt increasingly sick over the next 10 minutes.  Suddenly I felt extremely feverish and wanted more than anything to take off all my clothes and cover myself in ice.  Anyone who has ever rolled will know that that is about the last thing you want to do while you are rolling.",
  "I went downstairs in search of my desired ice cubes, but I couldn't make it down the stairs without throwing up my breakfast.  I felt sicker than ever, and layed down on the cold tile floor.  My friend felt my forehead and immediately got some cold rags to put on my naked body in hopes of lowering my body temperature.  I became delirious, my vision blurred, and I was shaking horribly.  I stayed on that cold tile floor with my friend changing the rags for almost two hours.  I thought I felt my temperature going down a bit, so we decided to drive back to his house.  After being outside fully clothed, I began to feel feverish again.  I threw up once on the side of the road and once more at my friend's house.  We repeated the drill with the rags for another hour, until I thought I was feeling better.  At this point we agreed it would be best for both of us to go do something, since we could feel the sickening effects of the drug wearing off.  We decided to go see a movie, which we did. ",
  "After about 20 minutes of sitting in the theater, I was shivering so badly that I needed to leave my seat.  At this point I felt like I was freezing, my lips were blue, and my hands were ice.  I spent a good 30 minutes in the women's restroom running my hands under the hot water, and huddling underneath the heated hand dryers.  After the effects wore off, I realized how lucky I was for surviving outside of a hospital.  I really did feel like I was dying in those few hours of lying on the floor, and I am pretty sure that my body temperature was well above 104 degrees. ",
  "Since this experience I have avoided all pills that were not manufactured and given to me with a label.  I realized that I have no idea what is in a pill that someone may tell me 'ecstacy'.  After doing my research I am almost positive that the substance in that pill was PMA, though I can not be 100% sure.</p>"
 ],
 "year": "2001",
 "id": "22245",
 "gender": "Female",
 "views": "37087",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "PMA"
  }
 ],
 "submissionDate": "2003-03-19T08:00:00.000Z"
}
