{
 "title": "Foxey Yes, Lovely No",
 "author": "Mem",
 "citation": " Mem. \"Foxey Yes, Lovely No: experience with 5-MeO-DiPT (ID 2224)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2224",
 "substance": "5-MeO-DiPT",
 "bodyweight": "",
 "report": "<p>Was fortunate enough to gain access to some 5MEO-DIPT recently. After reading many trip reports, decided that it might be nice to try prior to going out dancing. Took 10mg orally in gelcap at 1AM. Empty stomach, no other recent psychoactives present. Wound up at a 'ravey' event held at a niteclub. sat still and paid close attention at first, felt very similar to coming on to mid-low dose (150-200mics) LSD at about T+1hr. color enhancement, very little for OEV's otherwise. No noticeable body load. I began dancing at about T+2hrs, despite some distaste for the music. Quite unlike MDMA or LSD, paying attention to the music did not make it better, and in fact caused me to focus on elements I found unpleasant. Felt an almost overwhelming antipathy for those in the crowd who obviously believed they were on MDMA. This passed, but I was unable to feel any connection to the event. Left and laid in a very comfortable space and listened to music. Addition of cannabis increased visual activity dramatically, significant tailing. CEV were remarkable. One of the more interesting aspects for me was how attention modified the experience. Attention to breathing brought to mind a very clear picture of what tobacco had done to my lungs.(and I have not been able to smoke tobacco since) Focus on portions of recordings allowed visualization of the rooms that recordings occurred in, many aspects of records I am familiar with (in many states) which had gone unnoticed. Was nearly asleep while lying still at T+4.5, but upon getting up and moving felt tremendous rush of energy. Felt very alert until sleeping at about T+7.5 Next day felt little load, even after only 5hrs of sleep and a full day of activity. Quite pleasant, definitely not a social creature. Will do again, possibly at higher dose. </p>",
 "year": "",
 "id": "2224",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-27T07:00:00.000Z",
 "views": "4282",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  }
 }
}
