{
 "title": "Pass Next Time",
 "author": "3rdEYE",
 "citation": " 3rdEYE. \"Pass Next Time: experience with Morphine (ID 22268)\". Erowid.org. Mar 21, 2003. erowid.org/exp/22268",
 "substance": "Morphine",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "oral",
  "Morphine",
  "(pill / tablet)"
 ],
 "report": "<p>At around 11 PM last night, I popped a blue 100 mg morphine pill.  Having taken numerous pharmaceuticals over the years, I didn't really think much of it - except that maybe I should take the other one I had.  Thankfully, I chose not to, as I had read of other experiences and noted the doses that others needed.  I had eaten about 1.5 hours before.   </p><p>It started in my face and extremeties, then moved inward; a wonderful opiate body high.  Then, the effect I had been waiting for came - the feeling that I was floating on air.  I literally could not and did not feel anything for a few hours, long enough to watch The Ring.  Then, I just felt good until about 3:30 AM, and decided to go to bed.  Oh - I didn't itch all over or vomit as many of my friends have when on morphine, so that was nice as well. </p><p>When I woke up today, I tried to urinate, but much to my dismay, I couldn't.  I knew this to be a side effect of the morphine, but it was not one that I expected.  I also felt very groggy and overall unpleasant, so I decided to return to bed.  I awoke about two hours later, at about 2:30 PM.  Still couldn't piss.  I also tried to drink a glass of lemonade, but it came back up within 5 minutes.  I returned to bed once again.  I awoke at about 4:15 PM, and finally was able to urinate.  As I write this, I am trying to keep a glass of milk down. </p><p>Overall, I would not suggest morphine as a recreational drug to anyone, but if you are bent on trying it, much as I was, be prepared for the side- and after-effects.  To me, the high was not worth it.  I'll pass next time.</p>",
 "year": "2003",
 "id": "22268",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-03-21T08:00:00.000Z",
 "views": "31945",
 "dose": {}
}
