{
 "title": "Great Caution Should Be Taken w/ MAOIs",
 "author": "Admenuem",
 "citation": " Admenuem. \"Great Caution Should Be Taken w/ MAOIs: experience with Syrian Rue, Mushrooms & 5-MeO-DMT (ID 22329)\". Erowid.org. Mar 8, 2004. erowid.org/exp/22329",
 "substance": "Syrian Rue, Mushrooms & 5-MeO-DMT",
 "bodyweight": "130 lb",
 "report": "<p>I write this not to recount the subjective details of the experience but to serve as a warning to those interested in the MAOI + 5-meo-dmt combo.  Here is a quick recount of the trip in general.  This was done alone, inside.</p><p>T+0:00 - Dosed 7 grams syrian rue water to resin extract.</p><p>T+0:25 - Dosed 3.5 grams psilocybe mushrooms</p><p>0:25T~+3:00 - The trip has calmed down a bit and I am in the familiar maoi/mushroom trance.  I smoke a cig and play a game of tetris.</p><p>T~+3:45 - I decide to try a very very small dose of 5-meo-dmt that I packed previous to the trip.  A couple grains (~1 or 2mg).  Using a foil and straw, I vaporise the small amount of chemical.  I miss much of the smoke, and only get a very small taste of the 5-meo (I'm not expecting any noticible effect).</p><p>T~3:46 - The rush is slow to start.  I feel it coming.  It gains on me quicker.  This is not very comfortable (I can't believe such a small amount is doing this) but I don't feel in serious trouble.</p><p>T~3:47 - The sensation is radiating through my body and I feel very zen'ed out.  Breathing is becoming more and more labored though.  I am starting to feel a little woozy.</p><p>(approx 5 min of struggling with woozyness and catching breath)</p><p>T~3:52 - I can't recall really but I remember feeling like the drug had ran its course at one point shortly after I started feeling sick.  I held down the nausea, and tried to catch my breath again.  The sensation came back though, stronger.  I had to vomit.  I got up and went to the sink (not too much trouble moving).  I tried to vomit.  No luck.  Tried again.  No luck.  The sensation grew stronger.</p><p>T~?:?? - I wake up (or come back... or something).  I'm on the floor which is very cold lying in a contorted fetal position.  I feel very glad to be alive, and hope that I didn't hurt myself if I fell (I could have layed down... I couldn't remember.)  I'm not exactly sure where I am and then I begin feeling the sickness again.  I vomit on the floor, twice.  Then I feel perfectly fine.  I get up and go to bed.  Still feeling sorta good from the maoi/mushrooms. </p><p>It was a scary experience.  Not something I want to try again.  However, waking up in the floor as I did was a wonderful feeling of rebirth, which is very much what 5-meo-dmt is about.  Maybe some people would like this combo or can tolerate it better, but be prepared for the worst.</p><p>Admenuem</p>",
 "year": "2003",
 "id": "22329",
 "gender": "Male",
 "timestamp": "2004-03-08T08:00:00.000Z",
 "views": "18749",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  },
  "1": {
   "time": " T+ 0:25",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 3:45",
   "amount": "1.5 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
