{
 "title": "The Cactus That Was Too Long",
 "author": "legit_water",
 "citation": " legit_water. \"The Cactus That Was Too Long: experience with Cacti - T. peruvianus (ID 22323)\". Erowid.org. Oct 13, 2004. erowid.org/exp/22323",
 "substance": "Cacti - T. peruvianus",
 "bodyweight": "80 kg",
 "header": [
  "DOSE: T+ 0:00",
  "20 g",
  "oral",
  "Cacti - T. peruvianus",
  "(ground / crushed)",
  " T+ 6:00",
  "40 mg",
  "oral",
  "Pharms - Temazepam",
  "(pill / tablet)",
  "",
  "2.0 mg",
  "oral",
  "Pharms - Clonazepam",
  "(pill / tablet)"
 ],
 "report": "<p>I bought the dried cactus from an online supplier. As preparation I ground up all the dried cuttings using a coffee grinder. This provided a nice fine powder which I could easily fill the required amount of gelatine capsules with.</p><p>3:00pm -- Ingested all the pills along with a lot of grapefruit juice. (no vomiting luckily)</p><p>4:00pm -- slight hint of an effect coming on but nothing definate.</p><p>4:50 - 5:20 -- The Trip starts...</p><p>6:00ish -- Trip is much stronger, and knowing that I had another hour or two (considering ingestion) of the mescaline peaking I started to worry slightly. At this level my thinking kept dashing from one thing to another, I couldnt concentrate but not in a lethargic way, instead too many emotions and feelings were there. It was as if 4 or 5 lines of thought were working but I kept shifting between them. However things such as drinking water, movement were easily performed. I found the STRONGEST effect I got from it was when listening to the radio, voices and music sounded completely different, certain aspects of voices were enhanced greatly and they seemed to speed up and slow down. Music itself sent me off into wild imagery (pleasent) that I could not put down as dream like or visually percieved but a strange combination of the two.</p><p>8:00 Peaking, I now began to feel a bit of anxiety mainly brought on by the constant brain work I had been doing, trying to understand the visuals and the sounds and everything had tired me out mentally and I felt I needed a break although I knew that wouldn't come soon.</p><p>9:00 By now I was certainly feeling mentally tired and needed a break so much so I went for the tranquilizers which I rarely touch out of principle. I gobbled down 40mg temazepam and 2mg clonazepam, which is quite a lot and only then after a while could I finally relax. Although I still felt tired and basically went straight to sleep.</p><p>Conclusion:</p><p>At this dosage I found mescaline to be less visual and much more emotional that is emotions that blended with my vision and hearing as well as touch.</p><p>The experience was well worth while but due to the length and inability (for me maybe) to relax into it I felt it was maybe a bit too much. I may one day try it again but not for a while.</p>",
 "year": "2003",
 "id": "22323",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-10-13T07:00:00.000Z",
 "views": "27631",
 "dose": {}
}
