{
 "id": 2234,
 "title": "Surprisingly Intense",
 "date": {
  "submission": "2000-07-20T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Theseus",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Recently, I had quite a strange experience with Diphenhydramine (Benadryl).  As it was my first with it, I decided I would try it, then write a report the second time out, so I could just concentrate on the trip the first time.  However, I probably won't do it again for a few months, so I decided to write this up based on what I remembered.",
  "I was considering doing twice the dose I did.. I'm so glad I didn't.",
  "I was also considering doing this while out at a movie.  I'm also very",
  "glad I didn't: no way I would've made it home.",
  "Alright, in what was the stupidest things I've done with a drug, I did 250 mg of Benadryl (10 pills) without knowing anything beyond what 3 people who did it said.  I had no idea how powerful an effect this stuff was going to have on me, and I had a hell of a time finding out.",
  "I'm not really sure how long it took to start the trip, but I'll start from when I know the effects did.",
  "I was sitting at the dining room table, reading a book.  I kept seeing my friends out of the corner of my eye and I'd hear them say something or call to me, so I'd turn and look and then I'd realize that they wouldn't be in my house.",
  "I was talking to my mom, and I had to think very carefully about what I was going to say or I'd just spew random syllables at her.",
  "Eventually, she went to bed, and I was in the room alone, reading.. I thought that one of my friends, A, was lying on my dining room table in front of me.  He said something (I wish I could remember what...) and I looked up and, completely out loud, said 'What do you mean?' It really shocked me when I realized I was talking to a hallucination, and I decided I'd better head downstairs before I wake people up with my lunacy.",
  "I was sitting at my computer, and the TV was off next to it, and the screen swirled around like mineral oil on water.  It was neat to watch, and I went to the bathroom and found the toilet to be doing the same.",
  "I was definately having problems walking, staggering about a bit.",
  "I'm not sure the order of these events, so they'll be put in the order I think of them:",
  "I was looking at my swirling computer screen, caught my reflection, and then something happened that makes all my friends laugh their asses off: He started to dance.  My reflection, as if another person, started to swing his arms around and shit right in front of me.  A lot of the stuff I saw that night were corner-of-the-eye stuff, but this was definately there, right in front of me.",
  "My vision kept going a little blurry, and focusing on reading small writing took a lot of concentration.",
  "While watching my computer screen, a spitball on the wall near me started to move around very rapidly, jumping from place to place. When it finished up, a red plastic cylinder on my desk decided to go for a walk.  I stared at it and it stopped, but when I looked away it started to do it again.",
  "My arms looked BRIGHT RED and I thought 'Well, I guess I got sun burned.'",
  "Someone was sending me an mp3 of some music they thought would go well with the trip, but in my drug-hazed confusion, I ended up thinking it was the porn movie 'Debbie Does Dallas' and was annoyed the next day when I couldn't find it on my computer.",
  "Music had a very 3D feel to it, very layered.  I was also hearing stuff in music I hadn't heard before (although it was really there, just things in the background I hadn't picked out before.)",
  "However, that only happened with stuff I'd listened to a lot in the past. The mp3 I had been sent just seemed like noise to me, I wasn't putting it together into a song in my mind.",
  "My legs were cramping a little bit, as happens when I do LSA, but not much.. they mostly just wanted to be stretched.",
  "I wish Diphenhydramine didn't make me so drowsy.. it was pretty hard to stay awake, but I got some advice from a fellow benadryl-head in #drugs: you're not really tired and you dont really need sleep, that's just enadryl",
  "playing with you - just ignore it.  Some people also suggested mixing the diphenhydramine with ephedrine to keep you awake, although they said ephedrine, despite being OTC, can be a little tricky to find.",
  "Probably as a result of how much you need to fight the drowsiness, Diphenhydramine makes you think a lot about drugs and why you do them... If you gave a junkie this, he might just give you all his heroin if you ask at the right time in the trip.",
  "A lot of fun, for sure.  But not safe, given how little I know about it."
 ],
 "erowid": {
  "id": "1749",
  "citation": " Theseus. \"Surprisingly Intense: experience with Diphenhydramine (ID 1749)\". Erowid.org. Jul 20, 2000. erowid.org/exp/1749",
  "substance": "Diphenhydramine",
  "views": "74855"
 }
}
