{
 "title": "A Matter of Choice",
 "author": "withoutwithin",
 "citation": " withoutwithin. \"A Matter of Choice: experience with Piracetam, 2C-I & 5-MeO-DMT (ID 22351)\". Erowid.org. Jan 2, 2004. erowid.org/exp/22351",
 "substance": "Piracetam, 2C-I & 5-MeO-DMT",
 "bodyweight": "190 lb",
 "report": "<p>This is not so much a trip report as a summary. I had planned on taking a journey today, perhaps sampling 5MeO-AMT for the first time. But as it was rather late I thought I'd wait and try for DPT later. Then the thought of a 2C-I experience came to me. Perfect!</p><p>I took 2400mg piracetam and then 25mg 2C-I half an hour later. It was the typical 2C-I trip, building up in periods of intensity and fading again. I spent a few hours listening to music and reflecting on my life. I then thought some 5MeO-DMT might add some insight. There is not much info regarding this combo, which is why I am writing this. I discovered several months ago the unique character of this combination, and vowed after that to use 5MeO-DMT only in conjunction with 2C-I. It might seem like an odd mix, but they actually blend very well indeed. Much different than my 2C-T-7/5MeO-DMT experience a few years ago.</p><p>So, I vaporised 10mg 5MeO-DMT and inhaled. This was not a planned experience, but just seemed what was required at the moment. It hit me very hard immedately. This experience was just as intense as my first encounter with 5MeO-DMT, but with much more personal meaning. As I lay there in a sort of limbo between life and death, I began to realize that I had to make a choice. To live or to die? No, I knew that I was not going to physically die. I soon began to understand that the choices we make are the single most defining element in determining our fates as individuals. This may seem simple on the surface, but choosing is much more than just saying so. It requires a commitment and dedication, an unbending intent to realize the maturity of those choices. Every movement we make should be done in full awareness and deliberateness.</p><p>Some time ago I had vowed to only take knowledge or information and never give. This was based more on a past personal relationship than anything. As I lay there wondering whether I should write all this up, I perceived that it would only be a self serving maneuver. But as I thought about it, I could perceive that choosing not to write this could be seen as equally self serving. I laughed at the paradox and decided to write this up just for the hell of it, for my own amusement:) If anybody else finds this usefull, so be it. This was not a waste of my time! Well, just another anecdote for the archives:)</p>",
 "year": "2003",
 "id": "22351",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2004-01-02T08:00:00.000Z",
 "views": "11056",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2400 mg",
   "administration": "oral",
   "substance": "Piracetam"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  "2": {
   "time": "",
   "amount": "10 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT"
  }
 }
}
