{
 "id": 2237,
 "title": "A Roller-Coaster in a Pager",
 "date": {
  "submission": "2000-06-13T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Theseus",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "154 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "Preperation:  Cleaned the seeds with water and liquid soap to remove the chemicals they put on them.",
  "- 9:20 pm to 9:30 pm",
  "Ate 154 Pearly Gates.  Just stuck them in my mouth and ground them up with my teeth.  Tasted like dirt, made me vomit into my mouth, had to swallow my vomit or I'd have had to spit out ~120 seeds.",
  "Get rid of any drugs, glass, knives in the area.  Just in case.",
  "- 10 pm",
  "Nausea setting in.  Less and less urge to chat on the computer, lying on bed (next to computer) and just waiting for messages.  Starting to buzz, very similiar to an alcohol buzz.",
  "I keep getting really strong urges to tell a female friend (H) that I'm deeply in love with her (which I'm not... I don't think.)",
  "Instead of doing that, I simply tell her about these urges, which helps relieve them.",
  "Something I noticed:",
  "It's interesting that the names 'Heavenly Blues,' 'Pearly Gates,' and 'Flying Saucers' all alude to trips.. and those are the three types of MG seeds that will get you high",
  "- 10:30 pm",
  "My pupils are still normal size.  Getting some visual effects: a shimmering around the edge of my vision.  It's like when you look at something through steam, but more tightly woven, individual cells.",
  "- 11 pm",
  "H called me on the phone.. my nausea is gradually fading away, I'm lying in bed chatting with her.  Put her on hold, went to the bathroom, the wallpaper had a flower pattern on it that seemed to be sticking out.  Had to touch the wall to be sure that it wasn't.",
  "- 12 am",
  "Nausea is mostly gone, but leg muscles (calves, thighs) are cramping, hurt to the point of making me sick to my stomach when I stand or walk around.",
  "I held my pager up to my eye and turned the light on so it glowed blue, and I saw blue and orange pixels in the form of a roller coaster track, which I rode around.  It turned into a city street and I passed along it until I let go of the button and the light went out and the pixels faded away.",
  "I did it again, and I saw rows of the same pixels, in a spherical shape, like a star exploding.",
  "- 1 am",
  "I went to the bathroom, closed the door, turned off the light, put the toilet lid down and sat down in the dark.  I started seeing colours, which formed into a kaleidoscope of vibrant pastels.  This changed into a horizon-type view, like in 2001.  I realized I could decide what colours came at me, but I couldn't control when the horizon started to spin around.  I changed this into a sort of hilly wireframe landscape.",
  "- 6 am",
  "Went to sleep, still buzzing, but definately on the way down.",
  "- The next day:",
  "Got up at 9 am, felt really sick, threw up, and kept on throwing up until",
  "around 1 pm when I went back to sleep.",
  "Feeling sick, I started wondering: Is this worth it?  To start with, I thought no, and was considering going to the point of never doing halluciogeons again. But, when I calmed down, I decided it was worth the hangover the next day."
 ],
 "erowid": {
  "id": "1750",
  "citation": " Theseus. \"A Roller-Coaster in a Pager: experience with Morning Glory Seeds (ID 1750)\". Erowid.org. Jun 13, 2000. erowid.org/exp/1750",
  "substance": "Morning Glory Seeds",
  "views": "4464"
 }
}
