{
 "title": "Not Worth It",
 "author": "Fumis",
 "citation": " Fumis. \"Not Worth It: experience with Catnip (ID 224)\". Erowid.org. Jul 16, 2000. erowid.org/exp/224",
 "substance": "Catnip",
 "bodyweight": "155 lb",
 "report": "<p>I found myself once again sitting alone on a Satuday night, looking for a high. I had no pot or any other more potent drugs, so I searched the internet hoping to find some way to naturally get high. I remembered reading about you could smoke catnip to get high, and I happened to have a good supply of naturally grown catnip layin around. I couldn't find any dosage charts, so I improvised. I made a cheap pipe out of a medecine pill bottle, some aluminum foil, and an ice pick, and filled it with about 1 cubed inch of catnip.</p><p>I held the poorly made pipe over a candle for a few minutes until I could smell the fumes from the catnip from a few feet away. I then put the top up to my mouth and inhaled deeply and steadily through the hole in the top of the bottle, then held the vile vapors in my lungs for about 15-20 seconds. It tastes sweet and smells sweet, and it almost 'tastes green'. It is terribly hard to describe with words, but it is like freshly cut grass and someones freshly eaten vomit. I am not trying to just describe something gross, but this metaphor is as close to the awful smell as I can describe. I started inhaling at about 2:30, a few deep breathes for every 20 seconds over the fire or so. By about 3am, I could feel some slight effects even though I was still steadily doing my routine of inhaling every 30 seconds.</p><p>The effects were very mild, and it was a little like a standard, over the counter sedative. My limbs felt heavy, and my vision darkened a little. The effects lasted about an hour, and after the peak around 4am, the high dropped sharply. I became very sick and puked badly. However, I had no problem sleeping even though I didnt feel tired. It was a very deep sleep, but getting up at 1 the next morning was tough. for an hour or so after waking up, I had a terrible full body itch. I cannot be sure that it was from the catnip or not, but my best guess says that it is. Trust me on this - catnip is terrble stuff, and its not at all worth it. Go to the store and buy a few sleeping pills. Mix them with some caffeine pills, and you should get the same effect as this... Its not worth it to smoke this stuff.</p>",
 "year": "2000",
 "id": "224",
 "timestamp": "2000-07-16T07:00:00.000Z",
 "views": "41715",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(fresh)"
  }
 ]
}
