{
 "id": 2243,
 "title": "A Queue of Potential Actions",
 "date": {
  "submission": "2005-06-14T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Oscillating Duck",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "This was my third experience with salvia divinorum, and my second with the concentrated extract form of salvia.  My previous experiences were not similar to the one I describe here, other than the sensation of 'pins & needles', which I had experienced both previous times.  I was sat on some steps in my garden during the experience, and approached it with a sense of fear, which I found unusual seen as I had had no significant effects from the drug before.",
  "In this experience, I smoked about 200mg (1 cap) of '5x' Salvia Divinorum extract through a bong.",
  "I took in all the smoke from the cap in one toke, waited a few seconds and then exhaled.  As I was exhaling, I felt what can only be described as a different part of my mind to the one that normally controls me taking over.  For some reason I emptied the water in the bong on the floor (fortunately I was outside!), and tried to walk back to my front door.  I felt my normal state of mind as an unseen blue entity struggling to regain control from this new state of mind, which had taken the form of a green 'f'-shape, surrounded by concentric circles of white and green.  Almost as soon as I tried to move, I felt myself being dragged by some unseen force into the wall to my left.  This made walking very difficult, and I tripped several times on the short walk to my door.",
  "At the same time as this was happening, I began to feel a sensation similar to the pins & needles felt when you've been sleeping on your arm or something like that - a sort of numb, slightly unpleasant feeling.  It started in my face, and gradually spread through my body.  I got to the door, went inside and tried to run upstairs to my room, but felt pulled into the stairs.  Every step I took got progressively harder until I finally got to my room and fell onto my bed.",
  "At this point, I began to lose contact with reality.  Moving took a great deal of effort, so I stopped trying to move and relaxed into my mind.",
  "I then saw a line, or a vertical grid of beings, who looked like the blurred outlines of people.  I was standing in this line, a blurred blue outline with several layers of similar blue outlines above and below me, and lines of differently-coloured outlines standing to my left and right.  In the distance was a sort of door, which seemed to lead back to reality - a distant door to my room.  I tried to move my blue outline, but I could only look around.  It dawned on me that I was the physical representation of a thought in my mind!  The other beings were all thoughts as well, and each differently coloured vertical line of beings represented a different importance of thought.  There were a few yellow beings standing closest to the 'door', which I took to be important thoughts, then there were a greater number of beings of different colours, who were less important thoughts.  I was one of many blue beings/thoughts, of middle importance, and there were thousands of red beings far to my left who were unimportant thoughts, even further than my being from the door. Sometimes these red beings seemed to go on forever, sometimes they faded into the top of my vision and disappeared into blackness.",
  "Ocassionally, a being was sucked from the grid and through the door, where it became an action of my real physical body. From the eyes of my being, i could see the actions of my physical body through this door.",
  "Many different beings were sucked into this door, and eventually it was the turn of my blue being.  As soon as I was sucked into the door, I opened my eyes, and the grid of beings disappeared.  I was back in my real body! I took a few minutes to get the experience straight in my head.  I still felt altered at this point, but I had regained control of my body and could move around ok.  It had been about 25-30 minutes since I had smoked the salvia.   Over the next 20 minutes, the pins & needles (which I had felt even as the blue being), gradually faded to nothing, and I returned to normality completely.",
  "I didn't use a sitter during the experience.  I know others have recommended it, but as soon as I'd got to my room, I remained fairly immobile until the trip was over.  This doesn't mean I recommend not using one - it's a good idea for someone to provide reassurance.  Throughout the trip I felt a sense that I couldn't get back to my body, and that I would be stuck as a thought forever!  This was fairly unnerving and a little unpleasant.  The experience as a whole was unlike anything I have felt before, and although worrying at the time, looking back on it now I see it as a positive experience overall, and one that makes me want to experience more of what Salvia Divinorum has to offer."
 ],
 "erowid": {
  "id": "17512",
  "citation": " Oscillating Duck. \"A Queue of Potential Actions: experience with Salvia divinorum (Extract) & Cannabis (ID 17512)\". Erowid.org. Jun 14, 2005. erowid.org/exp/17512",
  "substance": "Salvia divinorum (Extract) & Cannabis",
  "views": "3305"
 }
}
