{
 "title": "Patterns In The Darkness",
 "author": "Red Eyed Craig",
 "citation": " Red Eyed Craig. \"Patterns In The Darkness: experience with Morning Glory (Heavenly Blue) & Cannabis (ID 22466)\". Erowid.org. Sep 16, 2005. erowid.org/exp/22466",
 "substance": "Morning Glory (Heavenly Blue) & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "50 seeds",
   "oral",
   "Morning Glory",
   "(seeds)",
   "",
   "5 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "</p>Looking at the seed rack, I spotted the Heavenly Blue seeds which I had went into town for that day. I bought four packets, each containing an average of fifty seeds, as I had read two hundred seeds is enough for most people to experience a trip.</p><p>I returned home and decided against any form of preperation as it would take too much time. I set out about one hundred seeds onto a plate, and began munching on them. They were rather hard, and tasted a little like nut. I expected them to taste worse, so was quite relieved when it was not that bad. I began eating them at about 7:00pm.</p><p>Probably as soon as the seeds began to digest, I felt sick. At this point, I had not eaten very many seeds, and was quite sad that I was getting stomach pains so soon. I looked on the seed packet, which said 'Harmful if eaten,' which could mean that they had a layer of poison on them. I forced a few more seeds down, now hating the taste, and feeling increasingly worse. I probably managed to eat about fifty seeds, maybe a few more.</p><p>Nothing, I felt nothing...well at least nothing special. I probably felt distanced for about ten minutes, but that would be it. I did not really expect to feel anything, and because of this I began focusing my efforts on getting some cannabis. I managed to buy a little more than a gram of cannabis hashish, and was satisfied that I could get stoned whilst watching the T.V. and listening to music.</p><p>On my way to buy the cannabis, I walked the dog. Whilst walking down the street, I seen a friend at the bottom, I was nearer to the top. In what seemed like a second, I was at the bottom, but my friend was no longer there. It would never take me a few seconds to walk down that street, so I became a little confused. I felt distanced again, and began to wonder whether the seeds were working slightly...without making me trip, maybe they were just screwing up time.</p><p>I bought the cannabis and returned home. I went to my bedroom and started to hit the pipe. After my first pipe, I felt rather stoned...more stoned than normal. Usually, one pipe would make me feel different, but not stoned. I lay in my bed, watching the T.V. The television was a lot of fun. It was just after 10:00pm. I hit the pipe again, and again and again. I must have had five pipes or so. I continued to watch the television, feeling quite wrecked...but quite different. Things that people were saying on the T.V. began to trigger thoughts,which led to more thoughts and then more thoughts. It seemed that I was able to think about five thoughts at the same time...which would send me into a pit of my own mind, which would then end up with me having to remind myself where I was. These thoughts became stranger and a lot worse. I became a lot more relaxed and sedated. The light was off, all I had was the light from the television.</p><p>I looked up into the air, and immediately noticed patterns in the darkness. These patterns were moving a lot, and were very colourful. Instead of watching the televsion, I watched these in complete awe. When I closed my eyes, the patterns were still there, and I was now having what seemed like a hundred thoughts a second. I felt so secure and happy, probably one of the best feelings I have ever had from drugs. I was laughing to myself a lot, and felt like if there was somebody with me I would have talked and talked. I was having to remind myself that I was in my room over and over.</p><p>I knew that it was getting very late, and I needed to go to sleep as I had to be up quite early the next morning. I could have layed there forever. I closed my eyes, but there was just too many thoughts and patterns, and I found it quite hard to fall asleep...and even when I did, the sleep wasn't good at all.</p><p>I woke up the next day feeling great, very refreshed.</p><p>I was very shocked at how the seeds affected me, as I did not eat very many. Was it the cannabis mixing with it? Do I have a bad tolerance to LSA? These things I shall never know, but I shall continue with my exploration with Morning Glory seeds.</p>",
 "year": "2003",
 "id": "22466",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2005-09-16T07:00:00.000Z",
 "views": "7546"
}
