{
 "title": "Goa",
 "author": "james",
 "citation": " james. \"Goa: experience with Mushrooms (ID 22479)\". Erowid.org. Mar 28, 2003. erowid.org/exp/22479",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "report": "<p>This was my first experience with any sort of drug.</p><p>Before I get into the actual experience I will describe the setting, mood, and preparations that I had made.</p><p>The setting was a small Goa trance 'party' if you will on some public camping land.  The specific area was fairly densely wooded with a large clearing for people to setup tents, and was right next to a lake.</p><p>I had done a lot of reading (mostly on the internet) about mushrooms, and more importantly, I had thoroughly quizzed a friend of mine (I'll call him RP) who was an experienced psychedelic user.  RP was attending this party as well, and he said that he would be glad to watch out for me should I choose to use mushrooms at the party.  There is no doubt in my mind that the comfort factor of having a 'babysitter' contributed to the pleasant nature of the experience.  The general mood of the party was nice.  Everyone was sharing water, food, tents, etc.</p><p>I dosed twice, the first dose about 1 gram and second was about 2 grams.</p><p>A couple of guys that I rode with to the party found a girl that had a baggie of mushrooms to get rid of, so we all went in on it together.  RP advised me to be catious with dosage, and so I took about a gram dried.  the taste wasn't nearly as bad as I was made to believe it would be.  if you've ever eaten *extremely* stale french bread crust, that was about what the texture and taste was like.  after this RP and I went and sat down where the music was playing waiting for the effects to come on.  at T+15 a strange feeling of energy began brooding in my torso.  there were several 'trippy' symetrical tappestries hung up between the trees in this music/dancing area, and the colors were brighter.  There was a slight overall change in visual perception...reality seemed more vivid.  At T+40 or so I noticed that I had become very talkative, and had this overall positive feeling...contentment would be a good word.  I was also happy to be in the presence of other people, which is weird because I'm normally not a social person at all.  These were the extent of the effects for the first dose.</p><p>At about t+45, RP and I went to sit by a big campfire in the clearing that several people were gathered around.  I was feeling disappointed with the mushrooms at this point.  The slight visual alteration and positive feelings were nice, but certainly not anything like I had read about.  I decided to get over it and enjoy the experience while it lasted, maybe try out the whole 'social' thing for once.  this is when I met the hippie chick...i'll refer to her as HC. it turned out that RP and HC knew each other, and RP informed her that this was my 'first time'.  Upon hearing this she walked me around the fire and introduced me to another guy who was also first-timing with mushrooms, and told us to talk to each other.  The guy was out of his mind, and frightened.  He sat down by the fire and stared at the ground for a very long time.</p><p>At some point RP went back to the music area, and I was sitting at the campfire kind of off by myself feeling stupid for getting my expectations up over a drug.  I don't know if I made a comment to HC (hippie chick) about being disappointed by the experience...but for some reason she got out of her chair, walked over to me, and discreetly handed me about 2 grams of mushrooms.  she said 'i hope you get something meaningful from it.'  it felt like fate.  I said 'thank you' and then ran off to consult RP.  He told me that if I felt comfortable with it that it shouldn't be a problem.  So I ate up, bringing my cumulative dosage to appx 3g.</p><p>From here the effects began to intensify noticeably.  The campfire seemed brighter and surreal-looking.  I got up and wandered back towards the area where the music was playing. It was pitch black except for a glowing coming from the music area, and at one point I thought I saw someone moving in the darkness a few feet away from me.  I moved closer to investigate (no one was there), and in doing so my foot slipped into a rut in the ground and gave me a jolt.  At the exact moment that my foot hit the rut, I had a very brief but intense 'hallucination'.  It was as if my vision were composed of a matrix of hexagonal shapes (kind of like this: ), and upon my foot hitting the ground, the entire matrix lit up, covering my field of vision in a geometric pattern.</p><p>For the next 30 minutes or so I was 'going up' to where I would eventually plateau.  I started to feel nearly euphoric, and the 'energy' in my torso intensified.  Also, I felt a tingling sensation on the back of my neck around the base of the skull.  I remember getting a couple of sticks of incense from somewhere and walking around twirling them in front of my face.  It was a nice smell / visual effect.  RP came looking for me and we went back over to the music area and sat on a blanket.  The symmetrical tapestries that I had mentioned before were rippling in the wind, and seemed very odd.  RP told me to look at one of them up close.  The one I chose was very colorful with some winged cat-like creatures on them.  They seemed to be breathing...porous almost.  The eyes of the creatures were solid black circles, and they looked as if they were pulsating...or beating like a heart, or maybe gyrating at a ludicrous speed.  And the tapestry in general seemed to be very alien.  It probably had something to do with the black light.</p><p>I went back over and sat by RP and his friend, and leaned back and looked up at the sky.  This was when I 'peaked.'  From this moment on, time became irrelevant.  Looking up at the pitch black sky and leafless tree branches, I was completely amazed.  I fell back into a laying position, and stared for what seemed like an hour, but in reality was probably a few minutes.  My entire perception of my surroundings had altered dramatically.  It was very intense...like an information overload.  There was a physical feeling in my head that is very hard to describe.  It seemed to be centered at eye level and the best I can do describing it is to say that it felt like all of the images that my eyes were seeing were screaming into my head at 1000x their normal speed.  If you've ever ridden a high speed roller coaster...imagine the feeling of the wind rushing into your face, and then apply that feeling to all of your senses.</p><p>I started wandering around the area.  There was a moderate feeling of disorientation and lack of balance.  I never fell over, but it was there.  Everything at this point was amazing, and I wandered around staring at everything in amazement for awhile.  Someone had setup some club-like light devices...one was like a discoball that sprayed out a rainbow of colors, and it was pointed up at the canopy of tree branches.  I stared.  I went back over to the campfire and sat down staring at the fire.  Someone I knew came over to me and greeted me and started talking to me.  I remembering thinking 'hello', but I don't think I actually said hello.  It was a serious mind bender.  It felt like everything was screaming for my attention, and the synergistic effect was confused amazement.  At some point the music that was being played wouldn't let me ignore it anymore, and so I ran back to the music/dance area.</p><p>Geometric patterns were a major attention getter, as well as textures.  The bark of trees was covered with tiny geometrical shapes, and felt amazing.  I also got on my hands and knees and stared at the ground.  The combination of dirt and leaves was full of geometry. I hesitate to call them geometric hallucinations.  The geometry was there all along, but only now was I seeing it.  I simply noticed much greater detail, especially with patterns. I picked up a handful of dirt and let it run between my fingers.  It felt great. And the music.  The music was unreal.  Old school Goa...it was as if I were hearing every discreet element of the tracks that were playing through a different ear.  No words can really do justice to this so I'm not going to try to explain any further.  I started dancing.  My movements were timed rhythmically with the music and precise to the millisecond.  Every track seemed an old friend that I was eternally familiar with.</p><p>This went on for an indiscernible amount of time.  At some point I stopped dancing, and looked up.  The sky was no longer pitch black, but a grayish hue of blue.  The sun was coming up.  I looked back down, and everything had changed.  I could see beyond the tiny black-light enclosed area where everyone was dancing, and out into the surrounding forested areas... an endless landscape of bare trees.  Perceptually it felt like the entire world had transformed from darkness to light in a single moment.  I rotated my body and took all 360 degrees of my surroundings in.  This was profound.  From here on as the sun came up the experience became very spiritual.</p><p>I started to wander around aimlessly shortly after this, staring at anything and everything. It felt like I had been born again into an alien and extraordinary world, and was exploring its intricacies with a very child-like and innocent curiosity. I wandered on a path back and forth between the dirt road and the area in the trees where music was playing; muttering things that I'm sure made no sense at all. I did this quite a bit. A guy handed me a bottle of Mr. Bubble, which became a source of much confusion later on.  Somewhere lying on the ground I found a neon-green cargo netting, and for some reason decided to drape it over myself and walk around.  The funny thing was that I was completely aware of how absurd I must seem to everyone around me, but I didn't care at all. I walked around several parked cars that people were sleeping inside of, and stared at them through the windows. And then I decided to walk towards the lake, which was about 100 meters away. I would walk about 10 paces and then stop and stare at the bottle of Mr. Bubble in my hand, completely confused.  And then walk 10 or so more paces, stop, stare confused, repeat ad nauseum.  It was ridiculous.  I finally got to the lake. At this point I believe I was coming down.  I was very calm and 'at peace with the earth.'</p><p>Now I'm not normally a very nature-oriented person.  One might even call me cynical.  But when I stared out across the lake, I was taken aback by the beauty.  The sky, the grass rippling in the gentle breeze, the water...all seemed so perfect. And I was very at peace.  I felt united with the earth.  I sat at the edge of the lake and started thinking about your typical 'complexities of the universe' type things...how complex and precise everything is, from solar systems to ecological systems right down to the smallest one celled organism.  it was a blitzkrieg of thought.  There was a single thorny bush in the grass at the edge of the lake, and it arrested my attention for awhile.  I kneeled by it and I think I actually talked to it. it didn't talk back. I moved my hands along it, feeling its texture. </p><p>Now the state of mind at this point...was one of amazement, but too much amazement and I became confused. I was having a hard time wrapping my brain around the concepts and ideas that were shooting in and out of my head at 200mph.  It was very overwhelming.  My thoughts and senses became so greatly intensified that making sense of it all was very difficult.  if you start to think about something like the complexities of the universe, your train of thought will quickly spiral out of control and overwhelm you.  It wasn't necessarily a bad thing, just sort of unsettling.</p><p>Another noteworthy thing was that I grieved for my mother who passed on 7 years ago, and it was the most serene grief that I've ever experienced.  I understood that death was simply a natural part of life and that it will eventually come to us all and that my mom had completed her 'journey' so to speak, and it put me at peace.  In the 2 months since my mushroom experience, I've dealt with the grief of my mother's death more than I did in the previous seven years.</p><p>After this there's nothing else to report that's much different.  After some more wandering around and staring at things, RP tracked me down and told me that he and his friend were leaving, and asked if I would be ok.  All I could manage in response was to giggle like a schoolgirl and nod my head.  so he left, and not too much later I went home.  By the time I got in the car, the mushrooms had worn off. There was just a very slight visual alteration...things seemed brighter than normal. I was very chilled out on the ride home, even though I was crammed into a tiny backseat with an annoying girl and a guy 3 times my size.  It didn't bother me; I was too much at peace.  And there's nothing more to tell.</p>",
 "year": "2003",
 "id": "22479",
 "gender": "Male",
 "timestamp": "2003-03-28T08:00:00.000Z",
 "views": "10519",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  }
 ]
}
