{
 "title": "Full Speed Ahead",
 "author": "P--J",
 "citation": " P--J. \"Full Speed Ahead: experience with Methamphetamine (ID 2248)\". Erowid.org. Sep 9, 2000. erowid.org/exp/2248",
 "substance": "Methamphetamine",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>\nCrystal meth is by far my favorite drug.  It's extremely powerful and you really have to watch yourself with it because it's easy to o.d.  I started taking crystal when i was about 17.  I was at a rave, and from that moment on, I used it more and more.  After you do a bump, it's like you wake up--you have a tremendous amount of energy, you talk A LOT, you dance nonstop, you can't sit still. I took it during college and my grades skyrocketed because I could stay up 24 hours and read/re-read my study materials.  I read one chapter in a textbook so many times that I could literally recite the whole thing.</p><p>As much as I love crystal and will most likely do it again if i can get some, I will admit that it is pure evil.  Let me tell you about one scary experience I had at a rave in a club.  I had sniffed more bags of crystal than I ever had.  I didn't realize what I was doing until I felt a heavy pressure in my chest.  After bouncing around all night, I immediately sat down on a stool at the bar. My head started spinning and it felt almost as if it had an intense tingling inside it.  I put my right hand over my heart--it was racing out of control.  I folded my arms and rested my head in them.  I kept thinking 'you're going to die right here in this club'.  I was burning up.  My face was so hot.  All of a sudden, i jumped up again--somehow I felt wired.  I alternated between feeling pain and feeling energy for the next 4 or 5 hours.  My friends found me by the exit of the club. I was jumping up and down yelling by the door.  One of the bouncers was looking at me, and I knew then I had to leave or else he'd probably call the cops. </p><p>I got into the backseat of my friends well-packed car.  I felt claustrophobic and dizzy again.  I HONESTLY thought I was going to die.  My vision disappeared and reappeared--I would see a big ball of light, kind of like a white ball of lightning, then it would go away and I'd see little black dots. I was terrified.  We had to stop the car about 5 times to let me out to jump up and down and yell (it was the only thing that helped me calm down). I'd get out of the car, run back and forth and yell. Then I'd sit down and stand up over and over again. </p><p>When I got home I was very sick. I have never had so much pain in my chest-it was disabling.  I was laid up in my bed for 2 days.  I had no voice, and if I tried to speak it would bring that horrible pain in my chest back.</p><p>In retrospect, I should never have taken that much crystal. I had never taken that much before.  I thought nothing much would happen if I spread it out during the course of the night, but as I started to use it, I really don't realize nor did I care how much I was taking.</p><p>Crystal meth is highly addictive. It makes the world seem like it's moving full speed ahead.  Be careful not to take too much of it---you could end up in the same condition I was in that night.</p>",
 "year": "1998",
 "id": "2248",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2000-09-09T07:00:00.000Z",
 "views": "24950"
}
