{
 "id": 2248,
 "title": "The Gentle Teacher",
 "date": {
  "submission": "2005-06-15T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Paste Pot Peet",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "leaves",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "I am new to the psychonaut arena and I have decided to focus on Salvia D. to make my first encounters with dream space.",
  "I'm at a scientific/experiment stage where I am taking things very slow and easy.",
  "My smoking technique is not very good and I hope to work on other ways to take in Salvia. So three leaves might have a much more powerful effect on someone with good technique that said... my experience...",
  "I had gone to a smoke shop earlier to get supplies (pipe, long wooden matches). I brought all of these items plus a candle and some incense into my bathroom. Sitting on the floor in front of the toilet. Lit the candle. Did deep breathing. Packed the pipe with three leaves. I used the long matches (lit by the candle so I didn't have to strike them) to ignite the leaves holding the match above the bowl as I drew the flame in. Held smoke for 1/2 minute then exhaled caught breath quickly and repeated.",
  "After a couple minutes I had the feeling that the bathroom was much larger than it is and I had a sense that I was being watch by two police officers and a diner type waitress who was discussing my with the cops. At one point I choked badly on the hot smoke. I had a feeling like the three that were watching me didn't want me to have that lungfull (maybe it would have been too much for this experience). After finishing the bowl I lit the incense and went to my darkened bedroom and put on headphones and listened to Portishead.",
  "Salvia is helping me have a waking dream. I'm not sure how much is me and how much is Salvia. I seem to be able to control my actions somewhat in this dream state. I encounter someone in there who I converse with. It is hard to remember details but the gist was that this was the same space as when you go to sleep and that Salvia aids you with getting there while being conscious. I remember being upset with a 'that's all there is' feeling. I had hoped for aliens or some other fantastic experience but the entity conveyed to me that all there is is here and now and we've but to experience it.",
  "I forced myself to push forward thinking this entity might be trying to hinder my process. I was deep underground now in some sort of temple. I saw long hallways and some ancient carvings. Spirits/bodies came out of the floor and walked toward me. I felt a moment of fear and then calm. They grabbed me and lifted me upward into the earthen ceiling. I punched through the ground and uncurled as a sprout would be seen growing in the soil with time lapse photography. Salvia was conveying the circle of life to me. Soon after that I felt a presence in the real world and bolted upright. It was my wife checking on me.",
  "About 20+ minutes had passed to I figured my time was done anyway and didn't try to re-enter the dream space.",
  "I will continue my experiments. Trying Quids and possibly extracts.",
  "The experience has been very gentle at this point."
 ],
 "erowid": {
  "id": "17535",
  "citation": " Paste Pot Peet. \"The Gentle Teacher: experience with Salvia (ID 17535)\". Erowid.org. Jun 15, 2005. erowid.org/exp/17535",
  "substance": "Salvia",
  "views": "3440"
 }
}
