{
 "title": "Hello My Old Friend",
 "author": "Rahvin",
 "citation": " Rahvin. \"Hello My Old Friend: experience with Nutmeg (ID 22509)\". Erowid.org. Apr 4, 2007. erowid.org/exp/22509",
 "substance": "Nutmeg",
 "bodyweight": "190 lb",
 "report": "<p>Ok, the first paragraph thingy is going to be just a description of me, so that you can relate, compare, and contrast, to see how different surroundings may effect the 'magic'. To get riht onto the reprt, skip down past the history. Just recently I discovered the wonders of Nutmeg from reading posts, about how other users felt and reacted to certain things, and by that beginning, it's probably quite obvious that I had a good experience.</p><p>I'm 17 years old, I don't go to school, I got my GED, I have acomputer in my room. I normally live at home with mom in a three room house: My room, the bathroom, the everything else room (including her bedroom). I'm about 6'1 and weigh approx 190lb, and I'll admit, its not all muscle, speaking of nutmeg, I shall have a bit while I type. I smoke marijuana once every couple weeks, and use Vicodin when I get it, once every month or two. I felt I should describe my surroundings for an accurate report of what happened. And I'll try to get the T+-00:30 thingy down, its not easy for me right now :P</p><p>*******************************</p><p>CAUTION: I AM LONG-WINDED HA HA</p><p>*******************************</p><p>On with the story.</p><p>It was 4 pm on a wednesday afternoon, and I was ticking away the moments that make up a dull day. I ground up a bottle of nutmeg so that it'd be easy to take more if I had to, AND, I didn't want to have to do it again. I had some old old nuts that had been in the kitchen for, probably 3 or 4 years. Well, I had about 20 grams worth, I figured that would last me for a while until later when I found out it would take about that much to have any effect.</p><p>t=4:23pm-I ingested about 7 grams of this horrible putrid disgusting vomitous ground nutmeg with about a gallon of water(it took that much to get it all down the first time I tried nutmeg.)</p><p>t=4:45pm-I read some more and realized it was going to take the rest of the pile of nutmeg to have a full effect, so I ingested 14 more grams worth(I'm assuming here).</p><p>t=5:30pm-No real feelings yet, still sitting around reading up on nutmeg and chatting with my friends online, had pink floyd in the backroud.</p><p>t=6pm-My mom gets home, I walk over to her and give her a hug and tell her the wonders of nutmeg that I've learned online, she gives me a 'I should spank you' look, says some dirty words, and asks me to tell her how it is after the high is over. By now a slight drunkeness feeling has come over me, when I look around at things my eyes don't follow as promptly as normal.</p><p>t=7pm-Definatly feeling the effects now, but not hard. They're noticable though. I'm watching TV and even though the story-lines to most movies are becoming hard to follow, I manage to keep up..</p><p>t=9pm-I remember 9 pm it really started to kick in. I felt great, very calm, almost as if I'd just taken a hit of marijuana.</p><p>t=midnight wednesday night-wow a 3 hour high is quite amazing for me, normally its worn off by now, but it kept on getting stronger. Cottonmouth REALLY kicks in.</p><p>t=1am-Nothing else good has happened, but things are all so much cooler...I enjoy looking at my hand. And cottonmouth is horrible, it's never been so bad.</p><p>t=2am-Cottonmouth unbareable. But I found a solution at last, I can take a sip of water. Well, I take a big swig of water from my cup, then I don't swallow. I hold it in my mouth and breath through my nose, rolling my tongue in the pool of water. Yeah, it sounds gross, but it really does work. When the water gets to be about the same temp. as my mouth, I swallow but then take another drink immediatly.</p><p>t=3am I'm off in la-la land now, I have my music on and it sounds so beautiful, I'm calm and relaxed, and even with the news going on about the war in Iraq, I don't care. I'm normally a peace activist. :P Well, I put on Tool for a change of beat, Darkside of the moon is great, but not after 11 hours of it on repeat.</p><p>t=4am-I'm having troubles keeping my eyes open, but I fight sleep to see the ending. I've begun hallucinating and when my eyes are closed, I feel like they're open and I'm looking through my eyelids like a screened in window. Music has gone from beautiful to hypnotizingly beautiful.</p><p>t=4:30(about)-I decide enough is enough and I go to sleep(The song of sleep is so very sweet sometimes, ya know?)</p><p>I awake around...1pm, so we'll start it there.</p><p>t=basically all the next day-I wake up, still high, like...a pleasant buzz, it makes me calm, I don't feel much like moving, but I'm enjoying everything...even silence if it's there. Everything is serene. I enjoy my day and take lots and lots of naps. I enjoyed just sitting back, sipping some chamomile tea, and watching easy movies to follow, like Alice in Wonderland and Cinderella. Mice that sing and dance are incredibly funny while high, especially when one is named 'gus-gus'.</p><p>Friday-Effects are gone completely, but I do have plans for one of my friends to come over friday night, so we'll see how that one goes. ;)</p>",
 "year": "2003",
 "id": "22509",
 "gender": "Male",
 "timestamp": "2007-04-04T07:00:00.000Z",
 "views": "3622",
 "dose": [
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:22",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ]
}
