{
 "title": "An Incredible Experience",
 "author": "Euphoria",
 "citation": " Euphoria. \"An Incredible Experience: experience with Morning Glory (Heavely Blue) & Cannabis (ID 22513)\". Erowid.org. Apr 4, 2007. erowid.org/exp/22513",
 "substance": "Morning Glory (Heavely Blue) & Cannabis",
 "bodyweight": "165 lb",
 "report": "<p>'Introduction: [Time - 2:30 p.m]'</p><p>It had been a pretty good day at school when during last period 'I' had been speaking to some classmates about the affects of LSA when one of my friends comes up to ask 'me' and asks if 'I' wanted to join him after school in trying the seeds.  Since I had already read for hours about the seeds on this website and knew a substancial amount about the affects, I felt safe and agreed.  When school had ended we went to the local Supermarket and picked up a total of 8 packets of Heavenly Blue Morning Glory seeds, each containing 1.5 grams each.  Upon counting the bags we purchased, we discovered they each contained roughly 75 seeds each. </p><p>'Extraction Method: [Time - 3:30 p.m.]'</p><p>'We' then took all of the seeds and placed them in a bowl with soap and water, after washing the seeds, 'we' dried them off with paper towels and dumped them into his coffee grinder and ground them until we did not hear anymore seeds being spun around by the blade.  'We' took the powder we had just made and put it onto his counter and split it up evenly into two sections.  Now came the tricky and nasty part, we had to eat this stuff.  'We' took small plastic cups and placed the powder inside them, 'we' quickly put the powder into the back of our mouths and washed it down with water.  This method was not bad at all and definately made the experience more enjoyable.  (Note: When eating the powder, do not think about it at all, it is not as bad as you think it is going to be and if you think about swallowing it, that will only make it worse.)  After eating the seeds we cleaned up the mess we had made and made our way to his bedroom for the duration of the trip.</p><p>'The Trip Itself: (Part One) [Time - 3:50 p.m]'</p><p>'We' sat down facing eachother and just sat playing Mortal Kombat: Deadly Alliance for about 20 minutes to pass the time until the affects reached us.  After playing Mortal Kombat 'we' both agreed that we should pack a bowl of marijuana and smoke.  Both of us taking about three or four hits from the pipe we sat back and relaxed.  (Note: Before smoking my friend stated that he felt a slight bit of nausea, but hardly anything, 'I' too had felt slight nausea, but it really was not anything to complain about.) After smoking, my friend got up to turn on his stereo, both being fans of Pink Floyd, we decided to put on Dark Side Of The Moon.</p><p>The cd had not been on for more than five minutes and when it finally got into the first song, the music began to make it seem as though I was in a movie and it was the soundtrack, although we were just sitting there, the music definately began the trip for me.  'I' sat there paying attention to nothing and then suddenly 'I' got my first visual, I turned my head to his desk, the entire desk seemed to be jumping up and down.  Lights began to explode like fireworks when 'I' looked at them and it felt great. </p><p>Shadows began to move and morph into things, as well as everything having a trail to it.  Sounds were amplified and hundreds of thoughts began to race through my head all at once.  'I' began analyzing everything that came into my head and suddenly everything began to make sense.  No matter what questions I asked myself I had an answer for them that made complete sense to me, my mind began to open up and my IQ was undoubtably raised to a much higher level of intelligence.</p><p>'I' looked down at his wooden floor, the kind with the knots in it, and all of the waves and knots transformed into fish and swam towards me.  Light was a very good thing, I played around with the lights to create different moods, 'I' found with more light, I got heavier visuals and with less light 'I' got an incredible feeling within my body with slightly less visuals.  All of this had been within about 60 minutes of the first visual I got. 'I' decided to sit down in a chair and stare at the entire room as we put Dark Side Of The Moon on for a second time.</p><p>The music once again created intense visuals that dictated the music itself.  Objects would move and lights would blink and flicker with the sound of the music, when the music slowed down, so did the visuals, and when the music was incredibly intense, the visuals became very heavy.  My friend had a real large American Flag on his wall and as I stared at it, it began to sway as if it was on a flag pole being blown by strong winds. We tried to watch the movie The Fast And The Furious, but 'I' just could not get into it.  'I' found that anything I did not want to do would be extremely hard to accomplish.  After a few hours I decided to get up and go to the bathroom, upon looking into the mirror I found myself to look very drugged but extremely happy, and my pupils had taken over my eyes. (Note: Talking to my friend who was also on the seeds was extremely easy, however talking to people who were not was very hard and hiding the fact that 'I' was messed up was also very hard to do). </p><p>'The Trip Itself: (Part Two) [Time - 6:30 p.m]'</p><p>Several hours had passed and we decided to smoke some more, we smoked another bowl and it felt as though the marijuana had once again trigged the LSA, only this time it was very mellow, but the hallucinations were still present.  We put on a Phish Live show and began to listen, we found that music was the best thing to do when on this substance and although being fans of all the music we listened to, it felt like it was the perfect music to listen to while tripping.</p><p>Everything was still moving as we continued to sit in his bedroom and listen to the music.  During the entire experience we did not talk very much, there was no need to speak to one another, we were both in our own little worlds.  However when we did speak to eachother, mostly during the time while we were smoking, we spoke of things that we would normally not speak of and felt comfortable doing so.</p><p>'The Day After:'</p><p>All in all the trip lasted for about eight hours, then with a few hours after that which left me feeling good but was not accompanied by any hallucinations or increased thinking.  When I woke up I felt very energized and ready to do whatever I had to for that day.  However, my friend had felt extremely tired and spend the majority of the next day laying in bed not doing very much of anything.</p><p>'After Thoughts:'</p><p>Having taken mushrooms before, I can easily compare LSA to a  more intense and longer lasting shroom trip, the seeds helped me have insight into my own personal life and allowed me to be more open to anything, this was definately a life changing experience and I recommend this to anyone looking for a truely crazy experience along with insight into their own life.  Be careful though, these seeds are extremely powerful and must be taken with caution, it has been known for alot of people to vomit the seeds up.  Some of my friends have taken the seeds and have thrown them up, even after throwing them up, they still tripped pretty hard.  Although I cannot mention everything that I learned from this experience, I must say that it definately helped me to grow as a person.</p>",
 "year": "2003",
 "id": "22513",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-04T07:00:00.000Z",
 "views": "5681",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
