{
 "id": 2254,
 "title": "Tight on Absente",
 "date": {
  "submission": "2005-06-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "oz"
   },
   "administration": "oral",
   "substance": "Absinthe",
   "form": "liquid"
  }
 ],
 "report": [
  "This summary is a general report of my experience with Absente. Absente is a 110 proof liquer that is legal to buy in the US (good liquor stores). The illegal wormwood is replaced with southern wormwood, a cousin to the former. It contains less thujone (the active chemical) that botanical wormwood, but still conatins it none the less. Other than that, Absente ingredients remain virtually the same as they were in the 1900's.",
  "I like to do Absente two ways - shots (chilled) and the traditional method (pouring water over a sugar cube througha slotted spoon and into the glass of Absente, turning the emerald green drink into a opalescent white).",
  "The usual buzz from alcohol occurs but about 5-10 minutes after feeling the alcohol, I start to get very light-headed and euphoric. I begin to laugh and also have aural and visual differences. My hearing is somewhat distant (as if everything is coming through a long tube) and objects leave trails of color behind when I move them. Lights appear to flicker and perspective is somewhat affected. This high lasts for about 45 minutes if a full glass has been drank (approx. 3 oz.). The alcohol buzz continues for another hour or two. My friends have reported similar effects even though they do not drink it as frequently as I do.",
  "I am a fan of good liquor and find that this is one of my favorite drinks. It has a great taste and if you don't mind paying a little extra, it is worth it. I hear of friends trying to make homemade absinthe and they say it just tastes like shit. My advice is don't make your own and go and buy a bottle (also comes with a nifty glass and a slotted spoon for preparing) and get tight on Absente."
 ],
 "erowid": {
  "id": "17546",
  "citation": " Anonymous. \"Tight on Absente: experience with Absente (ID 17546)\". Erowid.org. Jun 15, 2005. erowid.org/exp/17546",
  "substance": "Absente",
  "views": "9376"
 }
}
