{
 "title": "Acknowledgement of Beauty",
 "author": "Binnie Pasquier",
 "citation": " Binnie Pasquier. \"Acknowledgement of Beauty: experience with Nitrous Oxide (ID 2258)\". Erowid.org. Jun 29, 2000. erowid.org/exp/2258",
 "substance": "Nitrous Oxide",
 "bodyweight": "",
 "report": [
  "<p>I am fortunate to agree with William James and the Nitrous Oxide philosophers, though I know it is not everyone's path--Nitrous brings me close to God. Through the years I have enjoyed recreational drugs, and yes, remember an all is one flash on acid in a California creek a long time ago. Although I took gas happily at the dentist's for many years, the past decade has found me eagerly awaiting the root canals that middle age can bring! I have explored spiritual disciplines ranging from Judaism to the Course in Miracles to Eastern meditation. On an intellectual level they all seemed to speak truth but lacked any direct experience to back up the comforting dogma. But all that has changed with gas.",
  "My experience in the chair of late can best be compared to a sexual climax but without a strong physical component. My body becomes one element in the chain of a mental and emotional trip. My eyes are closed. The first part of the journey involves fear and anxiety being left behind. One by one, my fears of violence, loss, pain, inadequacy, even sickness and death, rise to the surface and are dispelled with a great sense of peace. This leaves me with only the positive. Now a spiraling, intensifying acknowledgment of beauty presents itself in single file. The people I love, my work, writing, the music on the dental office stereo appear to me singly and with great import, filling me with joy. I am then compelled to open my eyes and join the physical world . It shines. Every word the dentist and assistant speak are perfect and comforting and full of humor! The areas of my life which I have assigned importance are the right ones for me. I judge nothing as harmful or no one s path as unworthy. At this point I usually force the suction tube from my mouth to tell the dentist that I love him.",
  "Yesterday s wisdom tooth extraction led me to the following conclusions, seemingly independent of the echoing theology that exists in the great traditions. It all boils down to the following conclusions:",
  "the breath",
  "love",
  "the need for another person- the gatekeeper so to speak",
  "make of this what you will. I wonder- are there others who are chosen to feel God in this way?</p>"
 ],
 "year": "",
 "id": "2258",
 "gender": "Female",
 "views": "12872",
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "submissionDate": "2000-06-29T07:00:00.000Z"
}
