{
 "title": "More than Just Interesting",
 "author": "Innervoice",
 "citation": " Innervoice. \"More than Just Interesting: experience with Salvia divinorium (ID 22581)\". Erowid.org. Apr 4, 2007. erowid.org/exp/22581",
 "substance": "Salvia divinorium",
 "bodyweight": "150 lb",
 "report": "<p>I had been reading about Salvia for some time and was fascinated by what I had read about it. First off, I'd like to say that with the standardized salvia... a little goes a long way and... it's not an experience to be taken lightly, but you learn as you go.</p><p>EX #1:</p><p>The first experience involved salvia extract and a subsequent single hit of dried salvia. Now, the extract is a time consuming task. It takes time for it to absorb sublingually not to mention dealing with the abundant amounts of saliva that build up while retaining it in the mouth. The first dose had little or no effect whatsoever, I spat out the extract and it was followed by a second. (this stuff is very bitter by the way!)</p><p>This time around, midway through, nearly everything had presence to it. It was perceptual, not visual as was hoping for. When I walked from one room to the next it was as though no effort was being exerted, almost like gliding. My head felt fixed in place. I tried to listen to music to see if it was enhanced in any way like with other things but it wasn't. I used a third dose.</p><p>After I finished the 3rd dose I spit it out. Disappointed by not realizing any open eye visuals or audio enhancements, I laid down on my bed in the quiet. When I shut my eyes, I saw fantastic spiraling. This makes me think that the salvia experience is more cerebral than physical. I laid there for about 10 mins before I got up and floated into the kitchen where I took a single hit of dried salvia. I stood by an open back door as I held it in, looking at the snow. There were circular formations in the snow where I had stepped previously and had melted during the day. Some of the ground/grass spots prominently displayed in the center of the snow.</p><p>I exhaled. As I continued to look at the labyrinth of snow and dirt and grass, the scene became immensly contrasted, bright and dark. The circles in the snow seemed like eyes staring at me. This single, supplemental hit took me to another level. I caught myself talking, but who the hell was I talking to? I know I was responding to a voice because I was laughing and replying. I went back inside. I was laughing incredibly hard, I can't even remember what I was laughing about. I couldn't stop moving. I was compelled to move. I moved from room to room unable to stop. My head felt like it was on a track, following a set path and I wasn't able to stop. I quickly managed to sit down on the couch and layed down. I was being pushed down, deep into the cushions keeping my eyes shut. After about an hour, I felt incredibly relaxed. 'And that was it?' is all I could think to myself. It was over.</p><p>EX #2</p><p>About a month later, on a boring Sunday night I took a single hit of standardized salvia. It burns very completely and makes a cool crackling sound. I stood there at the stove, staring at the knobs on the stoves' console. Everything became very contrasted, absolute, bright. I remember repeating the last thought in my mind over and over and over. My head tingled, I knew that I had better sit down right away this time, but I managed to make a curcuit of the house first prior to sitting down. My head felt like a plume of feathers extending into ifinity and shower of sparks were covering me. It was incredible. This experience only lasted about 5-8 minutes. I wasn't timing it, but then it was over... it doesn't seem to linger, only followed by a relaxed feeling.</p><p>Afterthoughts:</p><p>Salvia is more of an experience than for recreation. I used it twice on my own, but I would definately recommend that anyone trying it to do so under supervision. The experiences above were with Salvia alone, nothing else was used with it. I don't find it addictive.</p><p>PROS: Closed eye / perceptual visuals, relaxed state afterwards. I never wigged or freaked out during any of this. Although the experience was a wee bit bizarre, I never felt any angst.</p><p>CURIOUSITIES: Voice Hallucinations; With the first experience, there was a higher dose. I'm fairly certain that I was responding to an inner monologue of some sort. The voice was very clear but I didn't perceive it to be my own, it was different, a friendly voice that had its own characteristics. I wonder if this is perhaps what persons' (that talk to themselves outloud) who are institutionalized experience?</p><p>CONS: Sit down! On both occasions I was compelled to move and unable to stop without some effort. Stay focused and remain in charge, this herb commands some respect. The smoke is a bit harsh, the extract is terribly bitter. No audio enhancements.</p>",
 "year": "2003",
 "id": "22581",
 "gender": "Not Specified",
 "timestamp": "2007-04-04T07:00:00.000Z",
 "views": "2780",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
