{
 "title": "Saw Myself Age",
 "author": "Hippie Kid",
 "citation": " Hippie Kid. \"Saw Myself Age: experience with AMT (ID 22599)\". Erowid.org. Jul 14, 2013. erowid.org/exp/22599",
 "substance": "AMT",
 "bodyweight": "135 lb",
 "header": [
  "DOSE: T+ 0:00",
  "80 mg",
  "oral",
  "AMT",
  " T+ 3:00",
  " repeated",
  "smoked",
  "Tobacco - Cigarettes",
  " T+ 6:00",
  "1 bowl",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>I am 15 years old and have done AMT many times, prbably around 12 times. After all my trips have only found one bad thing about AMT, the smell, is smells like old people. The last time I triped I started as usual by not eating and taking vitiman-C pills all day(vitamin-C is a must) I went to my dads house and ate my AMT around 9:00 I just chilled with him for a little bit untill around 10:15, I started for feel the nausia and my vision was getting a little hard to focus so I went on a walk on teh walk I puked my ass off(another must) when I came back I was talkative and very open and a little jittery. When he went to bed around 11:30 I was still coming up, I stated peaking probably around 12:00 thats when all the lights go off and the glow sticks come on. I was trippin nuts and giving myself lightshows for a hour or so and watching the war on T.V. I was seeing mad visuals around now faces, eyes and patterns everywhere both open and closed eyed. I lit another cig and we to the bathroom to see what was goin on in there I looked at myself in the mirrior and saw myself age. Another good thing about AMT is that Im not parinoid like acid. Its a mellow trip but very intense. About 2:30 or 3 I started hitting a bowl anddrinking more orange juice. About this time I called my friends C and J who were also trippin on AMT they were watching fantasia. I talked to them for a little while, pretty much all that was said was'man I'm gone' AMT is teh best drug ever but I make sure I have cigs, I smoked a pack and a half during this trip. 80 mg is a good trip.</p>",
 "year": "2003",
 "id": "22599",
 "gender": "Male",
 "age": "15",
 "timestamp": "2013-07-14T07:00:00.000Z",
 "views": "403",
 "dose": {}
}
