{
 "title": "Better than Any Pills I've Ever Had",
 "author": "Loki",
 "citation": " Loki. \"Better than Any Pills I've Ever Had: experience with Poppies (ID 22608)\". Erowid.org. Apr 2, 2003. erowid.org/exp/22608",
 "substance": "Poppies",
 "bodyweight": "165 lb",
 "report": "<p>I first discovered Poppy Tea when I was inquiring a new way to get opium, since pills are too expensive and opium is scarse here in Southern New Jersey. I new that I can extract LSA from Morning Glory seeds, so I figured mabey I could do the same with Poppy seeds.  I found some seeds (420 g) at a local flea market and made the tea for the first time.  I  soaked the seeds in lemon juice and, basically, it was the shit.  I downed it very quickly.  While on it, I went down to Ocean City with some friends and did a couple Nitris balloons.  This tea was better than any pills I've ever had, including Oxycontin.  On the way back from the beach, nearly 5 hours later, the tea was still runnin strong as I listened to the Wallflowers and some Dylan the whole ride home.  In short, the tea lasted throughout the next day and was incredibly euphoric.</p><p>Throughout the next year, my friends and I made the tea once a week and each endulged.  However, we still used the lemon juice to extract the opium.  It was just a couple days ago, the one year aniversary since I first endulged, that my friends and I found out that we could just use water to extract it.  Then all we have to do is add some Koolaid mix or Juicy Juice and it tastes good as hell.</p><p>The tea makes me feel extremely euphoric.  It makes mefeel energized yet incredibly relaxed.  It, also, gives me a never-ending apetite.  One of the coolest effects is that the cold does not bother me nor does it affect me.  One time, I went to a football game in icy, frozen, bitter-cold-as-hell temperatures, but it didn't bother me at all.  In fact, I went to the game in shorts and a t-shirt.  Everyone else was bundled up in winter jackets and shivering, while they stared at me in amazement.  On the tea, laying back and watching a good move with my friends can be one of the most euphoric experiences there is.</p><p>After taking the tea once a week for a whole year, there are some side effects.  The tea, for one, kills my sex drive.  I really, basically lose the desire.  It's worth it though.  I stopped taking it for a couple weeks and then took the tea again and felt none of the side effects.</p><p>Not too long ago we decided to try boiling down the poppy tea (in water) so that we would have to drink less liquid.  We used about 500 grams of poppy.  We boiled the water down to a sticky, black substance.  I guess this substance was opium tar.  We put a little bit of weed in with the tar and smoked it.  This was a whole new experience while reflected the old one- the tea.  It made our heads feel like they were floating and our bodies felt like jello.  (Actually I just smoked a bowl of this tar an hour ago)  Today, we took 3,500 grams of poppy seeds and made the tea.  Then we boiled it down into a tar, and scraped the tar off the bottom of the pot.  We rolled it into a black, sticky ball (about the size of a large marble).  We smoke by making a bowl out of a soda can and reeped all the benefits.  It is also possible to put a doses-worth of tar into capsules.  It is far more effective than oxycontin and far less expensive.  Taking these homemade pills is great and just like taking the tea but much less messy in the end.  However, smoke the shit is great too because I feel it very quickly and it doesn't last too long.</p>",
 "year": "2003",
 "id": "22608",
 "gender": "Male",
 "timestamp": "2003-04-02T08:00:00.000Z",
 "views": "55721",
 "dose": [
  {
   "time": "0",
   "amount": " seeds",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "(tea)"
  }
 ]
}
