{
 "id": 2262,
 "title": "Feels Like E and Acid",
 "date": {
  "submission": "2005-06-16T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Meeeeeeeeee",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "300",
    "unit": "seeds"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "seeds"
  },
  {
   "time": "0:20",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Very general over view:",
  "T+15 minutes: feel sick to stomach with extreme nausea",
  "T+20: take Dramamine to prevent from puking and smoke marijuana",
  "T+45: get warm fuzzy feeling all over body with swells of ecstasy like happiness(no more sickness after Dramamine)",
  "T+1 hour: tripping balls: walls are wavy and I get this sense that every thing is laughing at me",
  "T+4 hours: hallucinations have stopped but the happiness is still there",
  "T+6 hours: no more happiness but it feels like meth or something speedy like that with the intense body high feel that marijuana gives",
  "T+9 hours: fatigue and what feels like a slight marijuana buzz, sleep",
  "Just to give an idea of how strong this stuff was here is a clip of something I wrote while on the stuff probably at about 2 hours into it:",
  "The warm fuzzy feeling that your muscles get right when you wake up and it gets so intense when you move that you cant stop laughing. The ceiling the walls even the tissue box was laughing at me. I could feel my lungs looking at me and laughing at the expression on my face. Tee hee keyboard is just smiling at me for no reason. The tin cutters on my desk resemble the face of an alligator which is also laughing at me. I should clarify: they arent laughing at me, they are just laughing uncontrollably which makes me laugh. The cartoons on TV seem more bizarre than normal. Spongebob is not making any sense. it feels like eels are biting my heels, but they are laughing too, so their tongues are tickling my feet and making me laugh even more. Its odd, I'm not actually laughing, I just think I am and can hear my laughter amongst the laughter of everything else. (5 minutes of staring at the ceiling) the ceiling exploded in a mushroom cloud, which turned into what looked like a clich poster from the 60s. (got up to go look in the mirror) did not recognize self. Now I actually do start to laugh, at the feeling that my ankles make when I vibrate them. I'm pretty sure that I cant feel pain. I dont want to try because if it does hurt, I think that the feeling would be so intense that I just might pass out from it. (Now that Im back at the keyboard I dont remember what Ive been doing for the last 30 minutes)",
  "Ben just called to tell me the movie times for signs. There is no possible way I could see that movie right now as I would just start laughing at inappropriate moments. As I lift an empty can of coke to try to get the last drops out of it, I laugh as I watch the can float out of my hand and continue through the ceiling. Typing is very easy. I'm watching meet the parents. Its in fast motion which I also think is funny. I dont see how one could freak out on this drug. Everything, including the walls and the ceiling, is just sooooooooooo happy. (went to the bathroom) pissing is soooo fun. The ecstasy it gives me makes me wish I could just keep pissing for ever and ever. Sitting on the ground and staring at the ceiling I can feel my soul rising out of my body. My consciousness goes with my soul and then I wake up giggling. Wow. Its worth the sickness. I wonder if I will be able to remember this. ???",
  "(I just wrote what I was feeling)",
  "Later on I tried the extract (mixing ground seeds with water, straining and then evaporating off the water and mixing with 151 rum) and I did not experience the immediate effects promised but within 15 min I had the same type of trip but it only lasted about 4 hours total.",
  "Fun stuff thats easy to get. Just be careful as always."
 ],
 "erowid": {
  "id": "17572",
  "citation": " Meeeeeeeeee. \"Feels Like E and Acid: experience with Morning Glory & Cannabis (ID 17572)\". Erowid.org. Jun 16, 2005. erowid.org/exp/17572",
  "substance": "Morning Glory & Cannabis",
  "views": "6348"
 }
}
