{
 "title": "Plastic Soul/Childhood Trauma",
 "author": "Tara",
 "citation": " Tara. \"Plastic Soul/Childhood Trauma: experience with MDMA (ID 22634)\". Erowid.org. Apr 3, 2003. erowid.org/exp/22634",
 "substance": "MDMA",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>A guy I was datings friend said that this batch of E was pure. We all took one. I was 18. I had huge hesitancies, which could have affected the trip of course. I started off crying tons because I thought about how awful it was that I did not want to find my birth mom because she was so awful to me. Then I had a typical great high where all was sunshine and love. I found a joy in the fact that this world of streets and buildings and cars are just here for everybody, even though most of us will never have to do the work to bring it here. I felt blitzed out for 2 weeks.</p><p>From then on for about a year and a half I felt like I never came back to my true soul self. I felt weak and drained. Worst of all, I had dreams where my soul was plastic, and I no longer could relate to my past journals. Also, for at least a year (I forget when it finally went away) I could never look at a tree without my vision constantly reajusting. Trees never stood still! I happen to be someone who has since commited to taking no drugs, and have had amazing shamanic dreams and visions since. I first had them in middle scool before and they went away when I started trying hallucinogens. I just want to say that if a person is is already gifted 'psychically' they should consider not messing with drugs in general because they are already open and healthy that way. Also, if a person has had childhood trauma, E can give too much to deal with too fast. I became depressed and dropped out of school. Now I see a Shamanic counselor and have grown, healed emotionally alot, and learned so much.</p>",
 "year": "1997",
 "id": "22634",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-04-03T08:00:00.000Z",
 "views": "8383",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
