{
 "title": "Good for Hanging Out with Friends",
 "author": "Stu",
 "citation": " Stu. \"Good for Hanging Out with Friends: experience with 5-MeO-AMT, Alcohol & Cannabis (ID 22632)\". Erowid.org. Feb 26, 2004. erowid.org/exp/22632",
 "substance": "5-MeO-AMT, Alcohol & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "4.0 mg",
  "oral",
  "5-MeO-AMT",
  "(liquid)",
  "",
  " ",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  "",
  "1.0 g",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>SWIM had been planning on taking a pass at 5-Meo-AMT for a while.  He had dosed three weeks before (3mg) with no remarkable effects but slight nausea and diarrhea. SWIM had the opportunity to obtain 500mg (+/- 0.05mg due to scale inaccuracy) of 5-Meo-AMT from Harvey the Rabbit, and so he did.  SWIM dissolved the powder into 500 ml of drinking water, making an aqueous solution that measured out to be 1mg per 1ml. I watched as he drank 4ml of the solution after finishing his work for the day at approximately 4pm (T), following a refreshing session of Tai Chi.</p><p>T+ :30 - Nausea became noticeable.  The want to purge was strong but nothing happened.  This feeling prevailed throughout the trip; however, SWIM never did vomit.</p><p>T+ 1:30 - Walking in the woods.  Not much has happened up to this point.  Visual field became altered, but hardly noticeable.  SWIM talked to me quite easily and wore a big smile as he did so.  He said he could feel a difference, but it was very subtle.</p><p>T+ 2:30 - I walked with my friend to another friend's house where we all had a few beers and watched the sun set.  The nausea became more pronounced with the coming of the beer, but SWIM still didn't puke.  He did need to visit the john once, and from what he said it was not too pleasant. </p><p>T+ 6:00 - Mild tracers became apparent.  Light played tricks in the twilight, but did not come close to SWIM's expectations of 'LSD-like visuals'.</p><p>T+ 9:00 - SWIM seemed to be quite at ease throughout his journey.  He joked and laughed jovially.  One could not tell that he was tripping besides the fact that his pupils were the size of tea saucers.</p><p>T+ 12:00 - SWIM returned home and recorded what had happened to him throughout the trip.  He could not sleep at all.  He smoked the rest of his cannabis in his bong as he reflected on the experience.  The pot worked on him hard and made him a very stoned man.  He noted that the air had an almost electric quality to it, like translucent, microscopic christmas lights floating downward.  He eventually drifted off to sleep and awoke the next morning feeling energized.  The gastric complications that accompany this substance carried over into the next day.</p><p>Overall, He said that it was a good experience and good dose for hanging out with friends and taking it easy...for a long long time.  He feels fine today, the day after the dose, but will abstain from trying it again to protect himself from any negative effects that constant use is sure to incur.  He will wait about a month before trying a slightly higher dose, much earlier in the day.</p>",
 "year": "2003",
 "id": "22632",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-26T08:00:00.000Z",
 "views": "10566",
 "dose": {}
}
