{
 "title": "The Lesson",
 "author": "Infojunkie",
 "citation": " Infojunkie. \"The Lesson: experience with LSD (ID 22648)\". Erowid.org. Apr 3, 2003. erowid.org/exp/22648",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "12 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>My second experience with acid has been, to date, my most signifigant and was a transformative event in my life.  Before that point I had a healthy respect for the drug but perhaps not to the extent I should have. At the time I was doing relatively well financially so taking a pharmacopia of drugs into a rave wasn't unusual for me.  I would bring some for myself and enough to resell at cost to several dozen of my friends.  I wasn't interested in making a profit, just in buying affection.</p><p>My previous acid trip had been in a low-key environment but I had no qualms about trying it in the frenetic atmosphere of a party for some reason.  I intended to drop and take ecstacy later on. I took 2 hits of a large sheet and then proceeded to deal out a score of caps of E waiting for the effects to kick in.  The building was quite familiar to me; in my area there are few venues available to rave promoters.  Every time I went to a party there it seemed smaller. </p><p>Around this point my memory becomes rather vague.  I remember being hungry and eating something but not what that something was.  My friends tell me they remember seeing me munching on some paper and subsequent investigations revealed that in my delerium, I had eaten the entirety of the rest of my acid. Time ceased to move forward of its own accord.  Events would only proceed through a conscious excercise of will.  Additionally, I no longer chose to do things, I chose the alternate reality in which I did the things I wanted myself to do - an fine distinction. I gradually lost touch with my fundamental understanding of who and what I was.  I had the strange fear that I had seen a deeper layer of reality and, having done so, I would never be able to regain a normal viewpoint; never be able to pull the wool back over my eyes. Out of the whirling ball of paranoia that I had become, one thought concept finally cut through and calmed me.  I realized that no matter what straits I found myself in, whatever trials I faced, just by concentrating on the moment and living for that instant alone I could always be perfectly content. </p><p>It was a new idea for me although not new to the world as I later found out.  Further reading revealed that many schools of thought had advanced such a conclusion and had developed it much further including Buddhism, Gnosticism and a few varieties of shamanism.</p><p>After that trip I gained new appreciation for the Buddhist practices of my mother and I now attend meditations with her and I have never been happier.  All in all a very welcome lesson.</p>",
 "year": "2001",
 "id": "22648",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-04-03T08:00:00.000Z",
 "views": "7819",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "12 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
