{
 "title": "Terrible Night's Sleep",
 "author": "Vermithrax",
 "citation": " Vermithrax. \"Terrible Night's Sleep: experience with Coleus (ID 22663)\". Erowid.org. Oct 7, 2004. erowid.org/exp/22663",
 "substance": "Coleus",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "10 leaves",
   "buccal",
   "Coleus",
   "(leaves)"
  ]
 ],
 "report": "<p>My wife was reading some information about Salvia Divinorum, which we are desperate to try, but has recently (last year) been pre-emptivly banned by the Aussie Goverment, and so came across an article about Coleus Blumei being the another alternative for Mexican Indians as a divinitive aid. She pointed out that we have one growing in the garden!</p><p>I do not do much stuff, I do not drink (very little indeed) or smoke, and have not had anything of stimulants for a good 3 months or so (hence looking for natural highs). Well, after some research about toxitity, found nothing concrete on it, i tried a little experiment. I rolled 10 leaves into a quid, and put it in my cheek. I did not swallow at all, but just let the spit build up over 20 mins, then spat it out. It's incredibly bitter if you let the juice to the back of your mouth. Then sat watching TV in the lounge. Time around 8.30pm.</p><p>Effects</p><p>-------</p><p>Felt a little wierd after 20 mins or so, a bit drifty, and was watching TV, when my perception of what I was looking at changed dramatically... Robert Dinero's head was suddenly square, and the next character on telly had 50% of his head a complete right angle.. only lasted a sec or so, as I did a double take, but It was a definate distortion of my vision. Did not happen again for the rest of the night....</p><p>Rest of the night went without anything to mention apart from feeling a little bit strange and mildly stimulated, then went to bed as normal 3 hours later  but i had a TERRIBLE night's sleep.  Was very aware that I was semi-consious all night, vaguely aware that I was asleep.... Not unpleasant, but the following day was quite a depressed feeling, which is not like me at all....</p><p>Will try this again at some point, but with a much higher dose. One thing however, is that I found some information that is relevant to health warnings.</p>",
 "year": "2003",
 "id": "22663",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-10-07T07:00:00.000Z",
 "views": "18219"
}
