{
 "title": "The Visuals Won't Go Away!!!!!!!!",
 "author": "lostmind",
 "citation": " lostmind. \"The Visuals Won't Go Away!!!!!!!!: experience with 5-MeO DiPT & Zopiclone (ID 22666)\". Erowid.org. Jul 23, 2004. erowid.org/exp/22666",
 "substance": "5-MeO DiPT & Zopiclone",
 "bodyweight": "65 kg",
 "header": [
  "DOSE:",
  "20 mg",
  "smoked",
  "5-MeO-DiPT",
  "(freebase)",
  "",
  "30 mg",
  "oral",
  "Pharms - Zopiclone",
  "(pill / tablet)"
 ],
 "report": "<p>Ok, this isnt so much a 'my soul changed' type experience. But it was a case of the combined effects did not equal the individual experiences.</p><p>For the past few days I had been taking zopliclone to correct my sleeping patterns to something 'regular'. One night I felt like a hit of foxy so I pulled out the pipe just before I fell asleep.</p><p>Now, I've never really had visuals off foxy, and Im not sure if many people ever do but as soon as it hit me the carpet started to move (similar to the simple visuals I get on acid, mushies, mescaline from patterned objects) but it really was moving now, I mean about a foot above the ground in swells, kinda like a storm.</p><p>Well F I thought, this is great but I can't stay awake, I've got work. So Off goes my light. This wasn't a great idea. Everything that was moving before, just got pissed off, on top of that anything which wasnt regular (eg the door hand wrt to the rest of the door)  started to grow some very strange, well things. They remind me of the aliens depicted in the movie final fantasy, except they wernt luminecant but instead based on the the aterial the protruded from.</p><p>Ok so on top of that I got a lot of very cool visuals which I mostly can't remember or can't put into words. Ohh for a mind's eye camera.</p><p>The point of this post is that the other day I took zopiclone (by itself) and the visuals started all over again. That was fine but they havent stopped for about 3 days. I think its dying down...its just really hard to convince myself that my hand  isnt covered in small fleshy tentacles when I can clearly see them, loook at them!</p><p>As a side note, if you do get to this stage by accident, try closing one eye and focusing on the edge of your nose. Its interesting what pops up to say hi.</p><p>man I rant</p>",
 "year": "2003",
 "id": "22666",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-23T07:00:00.000Z",
 "views": "16723",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "smoked",
   "substance": "5-MeO-DiPT",
   "form": "(freebase)"
  },
  "1": {
   "time": "",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Zopiclone",
   "form": "(pill / tablet)"
  }
 }
}
