{
 "title": "Not Quite There",
 "author": "ikm",
 "citation": " ikm. \"Not Quite There: experience with 2C-T-4 (ID 22661)\". Erowid.org. Jul 10, 2003. erowid.org/exp/22661",
 "substance": "2C-T-4",
 "bodyweight": "160 lb",
 "report": [
  "<p>Previous experience: 2C-I, 2C-B, MDMA, MDA, MDEA, shrooms, 5meo-dipt.",
  "Substances: 15mg 2C-T-4 (note this was sold to us as gamma-2C-T-4)",
  "Setting: In the living room of our new house with 3 other good friends.",
  "We ingested the substance dissolved in water and sat back in the living room and started watching some videos. I felt first effects within about ten minutes but my friends didnt really feel anything. This is probably due to my prior experience with other 2C- type chemicals  I knew what I was expecting. It felt like the start of a 2C-I trip.",
  "After 30 mins the trip was slowly building. All of my friends started to feel something. It didnt really seem to be coming on fast. Again there were similarities with 2C-I. I was getting slight tracers when moving around and lights looked sparkly and had long rays shining off them. Smoking some weed brought the visuals out a bit more but it was still very much a background thing rather than the full on warping that I got off 2C-I. My friends said that they thought it wasnt strong enough but I told them to wait.",
  "After 1hr it was still building. At this point I was starting to feel a little disappointed. I was sure that I should be feeling more at this point. As my previous 2C-I experience had been truly amazing I was getting into a negative state of mind due to this thought. This wasnt helping and I tried to forget that and think about this as something different.",
  "The slow comeup continued past the 1hr 30 mark with visuals slowly increasing. There was a slight shifting of colours and lights left small tracers. My head was very clear which is something Ive noticed with 2C-I and 2C-B. At this point I started to feel a tightness in my stomach. It wasnt too bad but was enough to distract me slightly.",
  "After about 2hr 30 mins I felt Id reached a peak. It wasnt particularly impressive and disappointed me as it felt like there was potential for a decent trip which was never reached. All of my friends felt the same. We smoked lots more weed which made the experience a bit more intense, bringing out more colour shifting but these things were only visible if you concentrated on them. One picture on the wall caught my attention and by looking at it I started to see a movie playing on it of this persons face morphing and changing shape.",
  "The peak continued for about 3-4hrs after. It was hard to tell as we continued smoking weed and the heavy stoned feeling started to overpower the 2C-T-4. The tight stomach got worse during the peak but calmed down as I got more stoned.",
  "Towards the end of the peak I started to get waves in which the effect would diminish then slowly build back in again and out again. This continued for quite a while. 8hrs after Id taken the stuff I decided to go to bed. I found it impossible to get to sleep despite being extremely tired. I just lay in bed for about 6hrs before getting out and having a shower which refreshed me and made me feel ok. I felt a bit cracked out for the remainder of the day  any effort was quite difficult as I felt drained though this was probably due in a large part to smoking large amounts of weed and not having any sleep.",
  "Comments",
  "When I tried this compound i was led into believing it was actually gamma-2C-T-4, the 2,4,6- substituted isomer. Subsequent analysis found the chemical was actually 2C-T-4. The overall experience was pretty disappointing but I was expecting something like the amazing 2C-I experience I'd had before. In hindsight it was quite alright but it didn't really show me much and the long tailed out features were a bit annoying when trying to sleep.</p>"
 ],
 "year": "2003",
 "id": "22661",
 "gender": "Male",
 "views": "12277",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-T-4",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2003-07-10T07:00:00.000Z"
}
