{
 "title": "Well and Truly Warped",
 "author": "ikm",
 "citation": " ikm. \"Well and Truly Warped: experience with 2C-I (ID 22662)\". Erowid.org. May 18, 2003. erowid.org/exp/22662",
 "substance": "2C-I",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "4 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  "",
  "22.5 mg",
  "oral",
  "2C-I",
  "(pill / tablet)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>Previous (relevent) experience</p><p>2C-B, MDMA, shrooms, LSD, 5meo-dipt</p><p>Setting</p><p>My friend's house, empty apart from my mate and his dog + cats</p><p>Summary</p><p>22.5mg 2C-I</p><p>approx 4 pints of lager consumed beforehand</p><p>cannabis smoked at various intervals</p><p>Report.</p><p>I'd already tried 2C-I once before. This was at 15mg taken on the tail end of a night where I took 400mg MDMA powder. It smoothed the comedown over well and gave me a sense of tranquility but there wasn't really any psychedelic action apart from a slight shimmer to surfaces and changed depth perception. This time was completely different.</p><p>I'd been looking forward to trying 2C-I again after my first experience. After 15mg I didn't really feel much so I decided to up the dosage to 22.5mg (The 2C-I was packaged as 15mg pills so 22.5mg was easy to measure out). In retrospect this was unnecessary and I'll be doing less in future. I'd already been out for a few beers with my friends before I returned to my friend's farm. After a cup of tea we took the 2C-I and put the TV on.</p><p>At about t+0:30 we started noticing the effects. Lights had a sort of starbust effect round them. Initially i thought this was due to light shining through my eyelashes but it slowly intensified. I could feel the beginning of a euphoric rush like I experienced off 2C-B.</p><p>At t+0:50 the effects were definitely developing. I could see luminous green patterns in the carpet. The TV seemed to be moving backwards and forwards. I could feel a tingling body buzz.</p><p>At this point an annoying side effect started to develop. I got a tight stomach similar to what I've experienced off 5meo-dipt. I wanted to just let go and enjoy the experience but the stomach kept nagging me. I never got this off 2C-B and my friend didn't notice it at all. I think it may have had something to do with the combination of beer and greasy food I'd had earlier.</p><p>The effects built very slowly and seemed to come in waves. Each wave would bring a stronger set of effects than the last and would leave you slightly incapacitated. As each wave subsided we could talk about what was happening.</p><p>For the period of t+1:20 till about t+6:00 i lost track of time but I'll try to explain what was happening in that period.</p><p>At t+1:20 we decided to get up and make a cup of tea. At this point we noticed how heavily fucked we were. The walls of the room seemed to curve over the top of us. It sort of felt like we were little kids in a huge cartoon house. The wallpaper was constantly shifting and the paintings on the wall kept shimmering and moving. Walking was a strange experience - it felt like walking up and down hills yet the ground was completely flat.</p><p>Once we'd managed to work out how to work the kettle we got an instant sobering influence - my friend's dog. He's quite young and playful and was not what I wanted around in my state. Surprisingly he seemed to be quiet around us. I've read before about animals noticing altered states and think this could be something to do with that. Unfortunately this did not extend to his lack of house training and the big turd and puddle of fluorescent piss was not the most pleasant sight, especially with my dodgy stomach.</p><p>Pouring the tea was an interesting experience as we couldn't work out what was horizontal and what was vertical. I was pouring tea at what looked like a horizontal angle but I knew this couldn't be real so I managed to fill the cup without spillage. As I filled the cup I noticed an effect that would become more apparent later on - as the tea changed colour as I added the milk the entire room changed colour too. The tea was delicious and helped my stomach a lot.</p><p>Back watching the TV at about t+2:00 the visual effects were amazing. I think I was reaching the peak at this point. The colours on the screen would spread out in a starburst and colour the entire room. I would get completely lost in pointless TV and forget what was going on. Colours were bleeding into one another and pulsing. This really was like the patterns people portray as 'trippy'. Everything was moving. It was impossible to tell how big something was as it would grow and shrink at random. The paintings on the wall became full 3D images.</p><p>My vision was completely shot. Waving my hand in front of my face produced enormous trails. I was seeing stuff in slow motion and freeze frames. Everything had a fuzzy indistinct edge to it.</p><p>Surprisingly despite all this madness I was pretty much with it mentally. I wasn't confused at all and I noticed the occassional problem with thought processes.</p><p>We then decided to listen to some music. I put on a Nick Warren mix cd that I'd listened to on 2C-B. It was amazing again. Visuals ebbed and flowed in time to the music. The whole perspective and mood changed with each change in the music. The music became a 3d entity that I could actually see into. This carried on for quite some time.</p><p>The peak lasted about 2 - 2 1/2 hrs but the tail off was very long indeed. Just as it had waved in and out to begin with it left in the same fashion. Just as you thought you were straight everything would warp again. 18 hrs afterwards I was still feeling the after effects.</p><p>The next day I felt fine. No serious comedown or anything.</p><p>*************************</p><p>This was definitely the most visual trip I've had. In terms of warping my vision it was amazing. My mate compared it to mushrooms by saying that mushrooms are an open kind of psychedelic while 2C-I is more inward. Everything warped inwards. I definitely think I did a little too much. I'll go for less next time.</p>",
 "year": "2002",
 "id": "22662",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-05-18T07:00:00.000Z",
 "views": "11148",
 "dose": {}
}
