{
 "title": "Better Than Expected",
 "author": "Barium",
 "citation": " Barium. \"Better Than Expected: experience with 2C-D (ID 2269)\". Erowid.org. Jul 13, 2000. erowid.org/exp/2269",
 "substance": "2C-D",
 "bodyweight": "67 kg",
 "report": "<p>10mg: After about an hour or so, feels very much like having a few drinks without the `drowsyness' of alcohol. Conversation is sparkling; get a bit more creative, without mania. Slightly excited feeling in my stomach. Surprised to find that at this level there is already a hint of visual activity: unknown patterns in the carpet seem to pop up, slight movement.</p><p>50mg, one day later: Come-up a bit difficult. At points a bit stoning. Forming sentences in another language is too difficult in the first hour. Talking is anyway difficult. Basic feeling when not stoned is somewhere between mild euphoria and plain feeling good. Things are improving after 90 minutes. At the 2 hours point, visuals begin to start; similar to 2C-B (moving/morphing). Very friendly. Other side effect is that 2C-D keeps you horny all the time. Doesn't do much in terms of erotic hallucinations, a la MDA; is much more a `generic' psychedelic.  At about 3 hours, I notice a familiar buzz in my ears (similar to high doses of 2C-B/2C-T-7; down-shifting tone with lots of reverb). 15 minutes later, I'm surprised to hear that some artist liked a similar sound effect and incorporated that in his production. Naughty boy!</p><p>2C-D also has serious `insight-enhancing' capabilities. At one point, I noticed that a lot of male around me had `cop-like' capabilities (I wasn't surrounded by real cops, just by archetypical police-agents/soldiers. Think ISTJ and so on). Wondered a bit about which type I am.</p><p>Socially, 2C-D at this level feels like a lot of alcohol; silly things are extremely silly. Tendency to overengage in conversations. Also, annoying/dangerous things are noticed & neglected. Do not use this stuff at places with lots of easily agressive people.</p><p>At about 3 hours, moving & morphing tended to diminish a bit. The whole thing wasn't over yet: whites suddenly tended to be slightly pink-colored, with series of very fine black/grey/blue dots in them.</p><p>4h: go home. Visual still magnificent. Being outside is OK. 2C-D has a tendency to see archetypes in everything, including buildings. Modern architects just have no clue.</p><p>Sleep was OK. Afterglow OK.</p><p>Note: Shulgin's description (pharmalogical tofu) doesn't really do justice to this compound. I really like this tofu.</p>",
 "year": "2000",
 "id": "2269",
 "gender": "Male",
 "timestamp": "2000-07-13T07:00:00.000Z",
 "views": "27817",
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  }
 ]
}
