{
 "id": 2269,
 "title": "Good Dramamine & Cannabis experience",
 "date": {
  "submission": "2005-06-22T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DrDoob",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "0:15",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "0:25",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:30",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "0:45",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "1:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "1:10",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "1:35",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "1:45",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  },
  {
   "time": "2:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I had been reading about several Dramamine experiences on Erowid, and was curious as to the effects.  Most everyone seemed to have bad experiences, but I wanted to believe it could be a good experience if done propery.  Instead of taking them all at once like I had read others do, I wanted to do controlled amounts over a period of time until I hit what appears to be a common dose, or I simply cannot take anymore.   I will intersperse those with some cannabis.  I describe my experiences below.  This represents exactly what I was writing as I was experiencing everything.  I am transcribing word for word, so some of it won't make sense towards the end.",
  "T - 0:00 - I start with six Dramamine.  I also have a sitter online to keep me going, and maybe prevent a bad trip if I feel one coming on.  I don't understand the people who say nothing happens for 30 to 45 minutes.  It has been about 10 minutes, and I feel it start to settle in",
  "T + 15:00 - I take two more.  My strategy is to take two every 15 minutes.  Starting to become more relaxed.  I can feel it in my head just a little, kind of like a sluggish feeling.  I notice typing is getting a little more difficult. ",
  "T + 20:00 - still no major effects, but my palms are sweaty and my mouth is a little dry",
  "T + 25:00 - smoked a bowl.  Overall a very relaxed feeling.  I'm feeling a little jumpy as my leg bounces up and down.  My eyesight is being affected a little as well",
  "T + 30:00 - I am getting much more of a cottonmouth, probably agitated by the smoke.  I am having some problem burping, a problem I read about in other accounts.  My fingers start to glide across the keyboard.",
  "T + 35:00 - legs are feeling heavier, room is a little brighter.  My glasses are feeling heavy on my face",
  "T + 40:00 - really beginning to feel it in my face.  My body is definitely moving or floating a little slower, and getting a little more difficult to translate.  I am enjoying it",
  "T + 43:00 - starting to have more trouble concentrating, and it is harder to swallow and see.  It is rapidly kicking in",
  "T + 45:00 - two more takes me to 12.  writing is definitely becoming more difficult.  Have to cut back to one every 15 minutes.  I just ate some grapes, hoping it would keep my mouth from getting really dry",
  "T + 50:00 - my trip sitter just logged off, so i am on my own.  Definitely feeling and hearing different.  Right now hearing is accute. Really kicking in now.  Hands and body are heavy, things starting to sound louder. ",
  "T + 55:00 - A very heavy feeling has come over me.  Legs, arms, and thing are starting to move slower.  My writing still looks fine, but the pen feels so light in my hands.  I feel like if I let it go, it may float off",
  "T + 60:00 -  one one more D.  (NOTE: remember I am transcribing everything I wrote down during the experience, so i really did write 'one one'.  Keep that in mind as you continue to read my writing really starts to go down hill in about 15 minutes)",
  "T + 62:00 - I really feel it now. ",
  "T + 64:00 - When I tried to walk earlier, I was starting to stumble a little, almost like I'm drunk, but I am not.  My trip sitter is back and we are chatting.  It just keeps kicking in.  I should be trying to describe it, although it really is the same as before, just more intense.  My eyes are starting to have trouble focusing. ",
  "T + 70:00 - (NOTE: I believe I took another here, although I did not officially write it down.  I am having serious difficulties concentrating by this time, and thoughts become very random).  I almost forgot to write down the time.  I have a feeling this will be incredible.  Having more difficulty - concentrating.  It took me 15 seconds to write that down.  OOPS my eyelids are heavy, but don't close",
  "T + 75:00 - The paper is turning different colors.  I almost forgot that sentence.  Leg still bounces.  I can hear the silence in between the sounds.",
  "T + 85:00 - same feeling but greatly intensified",
  "T + 87:00 - just used the calculator for something, but don't know what I was testing",
  "T + 95:00 - Did another.  Should make it # 15.  It's not really fair for anyone who doesn't smok.  I am not sure what that means.",
  "T + 102:00 - cottonmouth. really heavy and relaxed.  By",
  "T + 105:00 - # 16 - eyelids are very heavy and the date does not change",
  "T + 120:00 - hard to swallow, but getting it done",
  "T + 130:00 - set to go all the way. (there was something totally illegible written after that)",
  "T + 165:00 - last for the night.  I'm trying to wipe down. ",
  "After that, my writing becomes totally illegible, although I didn't write too much.  I was really messed up by then.  I had continued to smoke some weed throughout, although I never wrote it down, so I am not sure how much.  My trip sitter said I kept saying I was enjoying it, although towards the end the things I typed made no sense at all.  I know I had some minor hallucinations, but for some reason couldn't write them down, although I may have been trying to describe it but that was when my handwriting became unreadable",
  "Personally, I loved the heavy body feeling that came with the experience.  I remember going to look in a mirror, and my pupils were heavily dialated, which probably explains why things appeared so bright.  I was still trying to chat on cannabis.com, but was so confused I couldn't follow a conversation.  I accidentally logged off cannabis.com, and could not figure out how to get back in.    I think I must have passed out after a little more than three hours because there was a four hour time frame where I didn't write anything. ",
  "Overall, I enjoyed it.  I would do it again, and would recommend it if done at a slower pace, and with weed.  I had serious problems trying to walk as my legs and feet were very heavy, and clearly couldn't hold a conversation, so this would be one of those rainy day, can't go anywhere experience."
 ],
 "erowid": {
  "id": "17584",
  "citation": " DrDoob. \"Good Dramamine & Cannabis experience: experience with Dramamine & Cannabis (ID 17584)\". Erowid.org. Jun 22, 2005. erowid.org/exp/17584",
  "substance": "Dramamine & Cannabis",
  "views": "24914"
 }
}
