{
 "id": 227,
 "title": "My Cat is Jealous",
 "date": {
  "submission": "2005-07-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chix",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 bowls",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  },
  {
   "time": "0",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  }
 ],
 "report": [
  "Well, I tried smoking what I affectionately called 'crack-nip' once, it was this stuff you could give to your cat in pellets and they wigged out, like the hash of catnip. When I smoked it, it sucked, and I swore never to try it again.",
  "That is, until I read a few decent reviews of catnip. I'm waiting on some MJ, so I'm in that jonesing stage, all stems and seeds and resin is gone. And I have catnip. And smokes. And a can of whipped cream.",
  "What the hell, right?",
  "So I smoke three bowls of the catnip in rapid succession, making sure that I'm also smoking a cig every now and again to boost the effect and then BAM. I'm relaxed, and happy. My skin is a bit tingly. I suck down the nitrous and my brain is floating. The feeling right now (about an hour and a half later, but I've been smoking more of the catnip) is like a mild MJ high, very pleasant, and a good way to wrap up a hung over kind of day.",
  "The setting is my beautiful apartment, and looking out the seventh floor window over the East End of the city is even more relaxing. I'm not going to overthrow MJ for catnip, but it sure is a good way to stop jonesing and smell the prettyherbs once in a while. I'm considering trying a mix of MJ, catnip and tobacco."
 ],
 "erowid": {
  "id": "10256",
  "citation": " Chix. \"My Cat is Jealous: experience with Catnip, Tobacco & Nitrous Oxide (ID 10256)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10256",
  "substance": "Catnip, Tobacco & Nitrous Oxide",
  "views": "21258"
 }
}
