{
 "title": "Live as The Waterfowl",
 "author": "Lavos",
 "citation": " Lavos. \"Live as The Waterfowl: experience with LSD & Cannabis (ID 22721)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22721",
 "substance": "LSD & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "1.5 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  "",
  "2 hits",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Ill never forget that night. How comfortable it made me feel or how peaceful, serene and beautiful it all was. Lake Elkhorn really is wonderful, and it took a walk of the entire lake and some of the most potent LSD I had ever had to fully appreciate it. It was fairly foggy, we (me and a close friend of mine) had thought it would rain tonight, but we hoped not. I was the only one on the acid. My friend and I had stopped under a bridge, just before the lake, to roll a joint. It was a really good one, considering it was rolled standing up. As I sat and waited for the joint to be finished, strong uncontrollable laughter came on. It wasnt unpleasant at all; it was quite reassuring of the pleasures soon to come.</p><p>Soon it was done, and we left towards the lake after lighting it. I only took 2 hits of marijuana the entire night, I didnt feel the need to be on it or any other drugs while experiencing the LSD. Not long after hitting the joint, my face felt flustered and phlegm build-up was bad in my throat. A very small amount of it got vomited up and within 2 minutes I felt great again. We started up the right hand side of the lake from the bridge. I was captivated by the wind pushing the water at seemingly unnatural speed. We sat on a bench in someones backyard facing the lake. My friend continued to smoke his long burning joint as we sat, enjoying the sounds of the ducks and the lovely trees and water.</p><p>Not long after sitting, another strong burst of laughter had come on. Since we were right in a strangers backyard, I had tried to silence myself to no avail. After a while on the bench, the joint was done, he threw the roach to the ducks and we continued along the paths. By this point, my senses were heightened three-fold. Lights glowed brightly, and sounds were easily heard, and just by hearing them, I could identify the source and location. I wondered how many miles the path around the lake was, because at this point we wouldnt see another bench for a while. While walking, we saw geese and ducks, swimming, walking, singing and yelling. Much silence grew between my friend and I as we listened to the sounds of nature and life all around us.</p><p>After about a half an hour or so, we came across a public bench, again, facing the water. On the back of the bench, we noticed The Waterfowl was written. We thought it was strange and were determined to find out its true meaning by the end of the night. Trees hung overhead from this place, and a gazebo was near. Bats flew frantically overhead, but didnt seem to notice or care about us. Families of ducks continued to swim past, like a single mother leading 5 children through a crowded toy store. Not long after we sat down, I began laughing hard again, this time being the hardest since. It must have gone on non-stop for easily 5 whole minutes or more. I could still think while doing this full body heave, but I couldnt speak clearly or move my arms too much.</p><p>I remember thinking how wonderful of a time I was having at this lake, and how if I could truly understand what I was laughing about, then I would somehow be blessed or enlightened. This trip I had was like no other. All of my other acid journeys had been indoors, as I did nothing but look for visual falsities to perhaps laugh about or misinterpret as a life-changing event. Every animal I encountered that night got unusually close to me, they didnt even seem to notice me. I felt accepted by the natural world, as all humans once were. Then they turned away, and began to kill her, building their mechanical world of plastics and hate. I felt that this walk wasnt across a lake, or Owen Brown or even America, but I felt it was a walk across the world as it once was and now should be. I loved every plant and animal and mindless piece of landscape I saw, I appreciated them as brethren and wanted to coexist with them, in their carefree world.</p><p>We got off the bench after a long time, we were both caught up in the beauty of the moment. But not much time passed until we were on the move again. This wasnt a strong visual trip, it was all about thought, feeling, love and Earth, but as we walked I thought I was hallucinating, it turned out to be 2 lovers, sitting and talking on a bench not far from the bench we had come from. We greeted them and I apologized because I thought we interrupted sex, the mans laughter reassured me there was no sex happening, and we kept on going.</p><p>Not long after seeing them, some geese sat on the path, no more than 9 inches from us. We greeted and were amazed by these beautiful creatures being so close and so unafraid. We got to the first place I had recognized in over an hour, it was my friends old house, I knew we had nearly completed the journey around the lake. We came across one last bench along the paths. This bench provided an amazing view as well, but not nearly as stunning as the last. Again, not long after sitting came the laughter, pretty hard this time too. I decided to attribute the laughter to LSDs roller coaster of euphoria.</p><p>We sat here for a while, and after a few minutes we could hear something flying and swooping over the water. It would scrape its feet just above the waterline and it made an intimidating sound. It turned out to be 2 large birds of some kind, we couldnt see them half of the time but the sounds were unmistakable. The 2 birds turned out to be fighting, perhaps over food or women. One of them undoubtedly kicked the others ass, and then taunted him afterwards. We were both absolutely astounded to have witnessed a real life nature fight. That completed my feelings that I was finally truly accepted as a part of the natural world.</p><p>After some butt pain, we decided to get up and complete the circling of the lake. We neared our starting point and had both agreed this was a true life-changing event, even though I was the only one on the acid, we knew magic was in the air tonight. We headed back the way we had come, wondering where to go next. It was getting late, but we still had no specific destination. I decided to just let my feet take me, and my friend walked with me. As we walked across the village center, I had another laughing attack, this time I was standing though, it felt good. I was worried about being out in the open while laughing hysterically, even though it was early in the A.M., we hurried out of the parking lot. We walked the strangest path ever, in the middle of the street some of time, across huge fields and hills. I did whatever I could to avoid pavement, after flirting with nature, I felt a hatred of mechanization, cars and where human advancement had gotten the world.</p><p>The strange path we walked ended up bringing us to our homes, we live quite near each other but the path we took to get there easily added 20 minutes to the walk. When we got there, we sat at the public playground, in the shadows on a bench, facing a tree. My friend stuffed a cigar with weed, while I sat, laughing and studying the intricacies of the bark of the tree. With my senses still heightened, I found myself looking for cars before they even came up the main road, and I could identify human voices from all around. My friend was likely quite stoned and seemed pretty sleepy. After a while he suggested we go home, as he went towards his house, I told him I thought It would be best if I went to my home. We bid our farewells and I went home.</p><p>Still tripping quite hard, I drank a beverage and reminisced on the night so far, then closed my eyes, enjoyed some colored geometric patterning, and alas, went to sleep, happy that god finally decided to give me life. While sitting at the playground before I went home, I thought a lot about the natural world, the Earth of the past and the animal life. While doing very deep pondering I know that I made some connection between The Waterfowl and all of the events of the night. The Waterfowl was of great importance, and I could damn near kill myself for not remembering all of the hours of thought that went into discovering its meaning. I dont see how I could have remembered it all, I just wish I could remember the answer to the question I already worked so hard to answer, What is The Waterfowl.</p>",
 "year": "2003",
 "id": "22721",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-02T07:00:00.000Z",
 "views": "2841",
 "dose": {}
}
