{
 "title": "Tropical Submarine Rising",
 "author": "Starbucks",
 "citation": " Starbucks. \"Tropical Submarine Rising: experience with 2C-I & DXM (ID 22738)\". Erowid.org. Nov 1, 2004. erowid.org/exp/22738",
 "substance": "2C-I & DXM",
 "bodyweight": "56 kg",
 "report": [
  "<p>Male, 25 years old, 56kg",
  "prior 2C-i use: 1 time approx 18mg",
  "prior DXM use: plenty of times, syrup, extractions, powder ranging from 150mg to 900mg",
  "My overal feeling with 2C-i is that it is a very benign userfriendly substance.  My expectation was that the DXM would probably drown out the 2C-i. But I like knowing not speculating.",
  "0.00 - I took a travel sickness tablet, I've had quite bad motion sickness all my life and find that DXM often preys on this and makes me travel sick.",
  "+0.05 - took approx 12mg of liquid 2C-i.",
  "+0.15 - took a capsule containing 350mg of DXM powder, there after I went about my normal business, and paid little heed to the 1st alerts and inital effects.",
  "+1.35 - I'm feeling an unsurprising but much appreciated range of effects, deepening of music, slight trails and patterning, increased energy, mild euphoria - these effects grow steadily over the next hour.",
  "+2.35 - The sense of alteration is total (except for olfactory, scents did not seem as intense as they can on DXM), and it's largely good news, the 2C-i seems to have drawn out and highlighted all of DXMs best aspects, and some of its less desirable effects seem far more distant than usual. The visuals both OE and CE are more vivid than in either drug seperately, I'd have to say the 2C-i seems to be dominating this aspect, because they are more like enhanced 2C-i visuals than what I'd come to expect from DXM. Music is as good as ever, tho there seems to be a distinct absence of the 'phlanging' that sometimes occurs on DXM. My mood  a decent euphoria, but nothing extravagant, alas this is a retrospective report and I can't clearly recall how my thought processes were working, other than that they weren't normal, but I don't think they were too abnormal. Physically thru the peak I had an ongoing sensation that I would describe as tropical aquatic submarine rising, I felt warm, I felt as though I was under water, and a steady gentle rising sensation, as if I were standing/sitting/walking on the outside of a submarine that was slowly rising up thru lush tropical waters - this feeling was the highlight of the experience for me.",
  "In the midst of this I struggled thru an e-mail to my friends stating that whilst I had been in more extreme states than this, it was the most 'trippin' I had even been whilst at the same time being capable of using a computer. After that task I just sat back and soaked it up, engaged myself in nothing in particular, and over time it began to wear off.",
  "+6.35 - went to bed, however upon getting there sleep was elusive, so I played with my cat for a while eventually going to sleep at around about +8.",
  "The next day I felt more of less fine, up until the point that I drove to do some food shopping, I felt a little spacey in the car, and as I wondered around the supermarket. Nothing serious though. That aside no major come down/hangover.",
  "I thoroughly enjoyed this combination, and anticipate doing it again.</p>"
 ],
 "year": "2003",
 "id": "22738",
 "gender": "Male",
 "views": "9614",
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:10",
   "amount": "350 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2004-11-01T08:00:00.000Z"
}
