{
 "title": "Feeling the Love of Nature",
 "author": "Doz",
 "citation": " Doz. \"Feeling the Love of Nature: experience with Mushrooms - P. mexicana (ID 22737)\". Erowid.org. Mar 29, 2007. erowid.org/exp/22737",
 "substance": "Mushrooms - P. mexicana",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Mushrooms - P. mexicana",
   "(tea)"
  ]
 ],
 "report": "<p>I tried the philosophers stone truffles with a few friends last friday. The method for taking them suggested on the internet was in tea, so we prepared 10g each using a garlic crusher and added that to a cup of tea. We didn't have any other drugs that afternoon other than the truffles.</p><p>The weather was really nice and sunny so we decided to sit outside. The tea tasted fine, quite mushroomy obviously and it only started getting nasty when the tea was stone cold :). Anyway, for the first hour there were virtually no effects - maybe some mild perceptual changes, no noticeable nausea.</p><p>After about an hour the effects started to become much stronger. Overall was an extremely euphoric feeling, everything was very funny. Combined with this was a lack of coordination and sense of 'losing your mind'. This wasn't worrying though, but seemed really entertaining.</p><p>Eventually, about 2 hours after ingestion i guess, the transition from a normal state to the 'mushroom state' was complete and the 'losing your mind' sensation had vanished. For the next 2 hours, maybe longer, we had great feelings of empathy with nature. I felt that I could talk to the grass and the trees, who were all very friendly. We walked in to a wooded section of the garden and were a bit concerned to see that some of the plants were 'ill'. They had holes and suchlike in their leaves, but we were happy to hug and comfort them anyway. I hugged a large tree and felt a huge mutual love between us.</p><p>These effects lasted for a significant amount of time, it's hard to say exactly because time seemed to be going very slowly. The high was followed by a very steady and easy 'come down'. Everyone was incredibly relaxed and able to talk very easily and openly to one another.</p><p>After sitting outside for a while longer we decided to go inside since it was getting dark. Being inside a house was quite daunting at first, although more in a strange than scary way. Sitting inside, I could see trees outside the window and it was these that grabbed my attention for a long time. Gradually the effects of the truffles wore off and there was a slow, comfortable slide back to soberness.</p><p>Overall, I was very pleased with these truffles, the high was very happy and peaceful, a sense of 'oneness' with nature. These are by far the most mellow and pleasing drugs I've taken. The whole experience was very uplifting and didn't leave me tired like many other drugs would have.</p>",
 "year": "2003",
 "id": "22737",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-03-29T07:00:00.000Z",
 "views": "4567"
}
