{
 "title": "Psychedelic Sickness",
 "author": "Mongrel Prophet",
 "citation": " Mongrel Prophet. \"Psychedelic Sickness: experience with 2C-T-2 (ID 22760)\". Erowid.org. Apr 7, 2003. erowid.org/exp/22760",
 "substance": "2C-T-2",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-T-2"
  ]
 ],
 "report": "<p>I've done many different psychedelics...not as many as I'd like, but far more than your average user.  I've had my share of beautiful trips, and I've done my share of really stupid things (i.e. DXM, Dramamine, etc).  However, only recently did I have the opportunity to try 2C-T-2, a research chemical that few people know much about.  My friend and I were warned not to take a whole pill.  Me?  Not take one whole pill?  That's like telling...for lack of a better analogy...Cookie monster NOT to eat the whole cookie.  Alas, we both dosed at the same time, one pill each.  We had no idea what to expect.</p><p>It didn't take long for the effects to come on.  The first thing I felt, always a telltale sign of psychedelics, was PARANOIA.  We were at my friend's house (what the heck, let's call him 'S'), just sitting in his room, when suddenly I HAD TO GET OUT.  NOW.  NO QUESTIONS.  S's father was home and stomping around the house, and I knew that before long, my pupils would be the size of quarters.  I couldn't sit still!  So, S and I bolted to the river, which is an easy 5 minute walk from his house.  We took a walk along the bike trail, smoked some herb, and enjoyed the open air.  Ahhhh....Free.</p><p>******</p><p>It only took a good 10 minutes for the chemical to wrap itself around my brain.  While walking along a dirt road with S, I looked up at the sky and, to my suprise, was able to spot every insect in the air within a 20 foot radius.  I mentioned it to S, and he chuckled, noting that all he felt was nausea.  We continued to trudge along, as I admired my new vision upgrade; I felt like a hawk, able to spot mice from hundreds of feet away.  Any movement within my field of vision was unnaturally obvious to my now very dialated eyes.  S and I lit up again, and decided to head back to his house.</p><p>******</p><p>Somehow, we made it past his Dad and into the safety of his room without notice.  We didn't stay long, however.  The longer I was in his room, the more paranoid I began to feel.  I'm almost convinced that the paranoia caused a placebo effect on me, only it was much much more.  I began to feel very sick...as if I might vomit at any time.  S agreed, and said he felt the same.  I was so afraid that I was going to lose it, that I convinced myself that if we could go outside again, it would all be OK.  Again, we retreated.</p><p>******</p><p>Around this time, my nausea began to subside, while S only began to feel more nauseous.  We took a seat on a wooden staircase on the river access, and waited for it to pass.  I wasn't seeing bugs anymore, but I still felt as if I was teetering on the edge of complete psychedelic chaos.  We smoked a bead of hash, and walked back again.</p><p>******</p><p>I remember listening to some music, perhaps Phish, and watching S's closet walls breathe.  Now, I'd seen breathing walls before, primarily on Shrooms and LSA, but this was insane!  The whole room seemed to move like it was attached to the ceiling with fishing line.  I looked at S's bedroom wall, and immediately experienced the most intense open eye visuals I have ever had.  The wall swirled with intricate colorful patterns, and began to ripple, as if a stone had just been thrown into a body of water.  It was quite a trip, but I still had a sick feeling...an uneasiness in the stomach.</p><p>******</p><p>About 30 minutes later, (who knows, maybe it was an hour) S began to trip, just as I was coming down.  Bummer.  He said it was very mushroom-like, although personally, I disagree with him.  2C-T-2 is a very different chemical, and it's not for the weak stomached.</p><p>If you ever get a chance to try this interesting drug, by all means enjoy yourself.  However, I'd suggest not eating until after the onset of the trip.  Nausea was all that nearly ruined my incredible psychedelic experience.</p>",
 "year": "2003",
 "id": "22760",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-04-07T07:00:00.000Z",
 "views": "10245",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-T-2"
  }
 ]
}
