{
 "id": 2278,
 "title": "I Felt Funnier, Cooler, and Even Better Looking",
 "date": {
  "submission": "2007-08-03T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "David C.",
  "gender": "Male",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40",
    "grams": 0.04
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "At the end of the 2001-2002 school year, a couple of my friends started experimenting with the drug adderral. It is used to keep kids with ADD under control. I never got any, but always wanted to try it. Well, the next year (2002) I was in the locker room changing for gym when my friend started talking about how he was making cash selling adderral. I asked him if he had any, and he said. 'Yeah, just one,' so I took out a 5 and bought one pill, and told him to just deliver the other later. After gym class, I took the pill. I knew from talking to my friends that the effects wouldn't start for a little while. I had taken some other kind of ADD drug before (It waas blue and was not effective for me) and was kind of expecting what happened next. Everything slowed down, but my thoughts were the same speed. Collors blurred slightly and I enjoyed it for the few seconds that it lasted. When I got to my English class, I sat down and started watching the clock.",
  "As class went on, I felt a little more relaxed. About 30 min. after I took the pill, I felt an intense satisfaction with life. I looked down at the vocabulary words I was supposed to be learning and found a period (yes, the punctuation mark). I stared at it for 20 minutes non stop. The time flew by and I intensely enjoyed myself. As I headed to lunch, I spotted a hot girl who I was normally too afraid to talk to her. I walked up and began talking with her. I was totally comfortable. I felt funnier, cooler, and even better looking. I had much more confidence in myself. I asked her to a dance at our school and she actually said yes. After lunch, I was with my buds outside (We weren't allowed out there). Me and my friend were throwing stuff down a hill, when who should come up but the 7'1 (I'm serious) assistant principal. He started yelling at us and I was so afraid I would be caught using the drug. Luckily, he let us off easy (We had to pick up some shit).",
  "During the next class I was a little paranoid, but generally still feeling cooler, funnier, etc... When I got home, I had no problem doing my homework and had lots of time to hang out around the neighborhood. That night was the worst part. I didn't really sleep, but hovered in between falling asleep and being awake. I didn't sleep at all and ended up getting up at 5:00 AM the next day.",
  "Well, it has been a week since then and my friend hasn't been able to get me anymore adderall. Every time I ask and he says he doesn't have it, I feel like I might go crazy. It's not really anything major, but I just feel a little depressed until I hook up with some friends, then I forget about it. The one thing to watch out for is to make sure you eat something (It eliminates my hunger) and take it early in the morning so that you will be able to sleep.  Hopefully my friend will hook me up with more of the great pill tommorrow!"
 ],
 "erowid": {
  "id": "17610",
  "citation": " David C.. \"I Felt Funnier, Cooler, and Even Better Looking: experience with Amphetamines (Adderall) (ID 17610)\". Erowid.org. Aug 3, 2007. erowid.org/exp/17610",
  "substance": "Amphetamines (Adderall)",
  "views": "7918"
 }
}
