{
 "title": "A Dull and Boring Trip",
 "author": "Crushaa",
 "citation": " Crushaa. \"A Dull and Boring Trip: experience with MDMA & SSRI's (ID 2279)\". Erowid.org. Oct 11, 2000. erowid.org/exp/2279",
 "substance": "MDMA & SSRI's",
 "bodyweight": "220 lb",
 "report": "<p>fire: this is the first one i've encountered like this. i'm not sure i did the primary category correctly. would this be a difficult experience bc he had no effect from it, or a combination? would i force 2 if it's a combo? do i have to fill in dosage chart for the pot he smoked later? thanks -shell</p><p>*****</p><p>A short while back, a few friends of mine and I went to Amsterdam for a few days. I am usually one to only smoke MJ and take a few shrooms here and there but when in Rome...</p><p>One night out, we ran into some very cool locals at a club who gave us each a hit of X. It was, by my friends' accounts, the best, cleanest, and most pure X they had ever, ever taken.  They were rolling like champs. After several experiences back here in the US, they still reminisce that 'pure trip'.  For me on the other hand, being diagnosed with moderate but constant depression several years ago and taking Zoloft 100mg a day, the trip was a frustrating event.</p><p>As I watched my friends have the time of their lives, I sat on a stool in the corner barely able to express emotion - and when I did it was usually mild anger. I do not have much to say on the subject other than this observation led me to suspect my Zoloft interfered with the X. After two hours I gave up and went across the street for some MJ, the depression was really eating at me. I have seen a few accounts of others noting that the two substances basically work against each other, and anytime you have that (like Valium and Coke), you have the ingedients for big trouble with larger doses it may take to get one 'off'.</p>",
 "year": "2000",
 "id": "2279",
 "gender": "Male",
 "timestamp": "2000-10-11T07:00:00.000Z",
 "views": "9145",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
