{
 "title": "Raw Data",
 "author": "joshi",
 "citation": " joshi. \"Raw Data: experience with Salvia divinorum (10x extract) (ID 22822)\". Erowid.org. Jun 2, 2003. erowid.org/exp/22822",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "170 lb",
 "report": "<p>There are many trip reports where people share their memories of a Salvia experience.  Here I share a different kind of recording.  When I smoked Salvia, my friend Santiago (which of course may or may not be his real name, and anyway I sincerely doubt that he cares) and I decided to videotape our Salvia trips.  I have transcribed the following excerpt, which occurs after his trip, and starts before mine.  I differentiate between the two of us by indenting everything he says. </p><p>At a certain point, we were both intoning 'Om' for a while.  One can assume that when I write 'Ommm...' it goes on for a bit.  I have not cleaned up my language at all, and I do apologize if this, especially in the later bits where I'm stumbling to explain what happened to me, obfuscates the meaning, but I think it's important for this to be a real document... I'm kind of embarassed at how many 'like's and 'y'know's are in my everyday speech, but I think that the frequency of these verbal crutches just  underscores how dismal language really is at capturing the psychedelic experience.  I have a few moments of glosslalia, during which I have attempted to spell what I said phonetically.  Kind of interestingly, all of my neologisms rhyme...  I have a vague memory that this kind of sound or word was very important to the epistemology (if dare I use the word) of the trip.  Stuff in 's are actions, and I put in a very few editorial comments in ()'s.</p><p>For what it's worth, I'm not sure I meant at all what I said at the peak of the experience -- I think I was trying to communicate something entirely different.  Even when I talked about the drug wearing off, that had only been a peripheral thought, but it was the only thing I could say when I was trying to communicate distinctly other things.  The real 'being in the trip' stage of the experience lasts more or less until I say 'oh my fucking God!!' although the effects are present to a certain degree for a while thereafter.</p><p>Another thing to note is that this is an example of an AMAZING Salvia sitter, something one can only be after having done Salvia. My friend Santiago totally made the trip for me, and that's quite important.</p><p>The dose was approximately a tenth of a gram of 10X extract.</p><p>TRANSCRIPT:</p><p>I'm going to turn this (i.e., the mattress I was sitting on) so I'm totally facing the black shit, and then you tell me whether</p><p>I'm still in the frame. I don't know why it's so necessary to get a good movie of it, but anyway...</p><p>Am I still in the frame?</p><p>\tYeah, that's perfect.</p><p>All right, here we go.</p><p>ahh, Salvia</p><p>I feel like...</p><p>there's a...</p><p>shtumpemplease</p><p>this thing implies, can't wait till I'm dead.</p><p>Can't wait till it drips out.</p><p>It's running out.</p><p>Can't believe... wait till this drug has run off.</p><p>Can't wait till this drug had run off.</p><p>Santiago, I - I'm going to be okay.</p><p>\tYou are okay.</p><p>Thank you.</p><p>\tIt's only going to run out.</p><p>What?</p><p>\tIt's only going to run out.</p><p>Yeah, okay.</p><p>\tAnd we don't want it to.  We want to trip.</p><p>Yeah, okay.</p><p>\tOmmm...</p><p>What's the drug I did?</p><p>What drug I did?</p><p>\tOmmm...</p><p>I've done the drug before.</p><p>\tOmmm...</p><p>Ommm...</p><p>Thank you.</p><p>Ommm...</p><p>Yeah, there's no explaining...</p><p>\tOmmm...</p><p>Ix stream gratemplease</p><p>Ix cream madamplease</p><p>I'll see it on the recording Omm...</p><p>There's no recording of it that will do it justice. (semi-sung)</p><p>You brought me here, and we're mostly off the recording.  Wow.  Oh my God, Santiago.</p><p>\tOmm...</p><p>Ommm...</p><p>Thank you for bringing me here, Santiago.</p><p>Ommm...</p><p>Oh my fucking God!</p><p>It's a specific place that we go, it's a specific place.</p><p>Omm..</p><p>\tOmmm...</p><p>I didn't understand everything.</p><p>Ommm...</p><p>\tYou're crazy.  How was it?</p><p>Oh my fucking god!!!!</p><p>\tWhat's up, dude?</p><p>Thank you, you were the best, you were the best!</p><p>\t(laughs)  No, I'm just here.</p><p>Ahh, God.  It was, should I explain it now?</p><p>\tWhenever you're ready.</p><p>Oh my God.</p><p>I can't, it's this other place, this other world.</p><p>\tI know, it's another place, man.</p><p>It's another world which doesn't look like this one and, but it isn't like, it - it's sort of like it's enough like this one, but it overlays this one.  It's like everything in this world, but it is the stuff in the other world.</p><p>I had all these stripes.  And that  was like a - a school, a hallway.  I knew it was going to be over soon and I was sad.  When I smoked it, well, I talked about it being over because I was scared at the same time that it would never be over, and I didn't even know what 'it' was. And I saw myself as this special separate entity, but there were these stripes that were pulling through me.</p><p>And it was.. I.. oh god.. I.. \tNo, keep talking, keep talking, keep talking.</p><p>I'm going to make me on the video machine.  \tKeep talking</p><p>It was like the... Oh my God!!!  It's over but, I can't believe what happened.  I lost myself completely, I was some...  But it's not like I lost myself, there was nobody; I was somebody, I was this person, and this  this was the... I didn't see this, there was this school, it was like a hallway in a school and there were windows, and I came around because you were the person that also understood. And I couldn't remember your name for a while... did I call you 'S,' what did I call you?</p><p>\tNo, you called me Santiago.</p><p>Oh I did?</p><p>But it was pushing on me, this something...  I don't remember getting it up at all.  I remember finishing smoking the pipe, putting it down, and then it sort of was hitting me, and I had the real visual.. like - like  abstracted other visuals, but, I mean, y'know... It's like, you think it's like, 'Oh yeah, it's the same psychedelic visuals,' and then there we are, y'know, like at the top of a peak of the - of a.. mushroom trip, but it's a different kind, and like, it was like, y'know... it was one thing here, and one thing here, and they were - they were, y'know, images, but it -</p><p>it expanded, it broke up, it expanded around me, and it became one of these lines. And it was like you were still here (i.e., in the Salvia realm, I think) and you wanted me to be here too.  And that's why I was so impressed with you having done Salvia and still being under the influence that you could like have the posession of mind to like bring me, try to bring me so that I was - I was also there at the same time that you were there and that we were... in that place, and I know necessarily that you weren't really there but you.. you.. you remembered enough, you were close enough to the Salvia consciousness that you, y'know...  Motherfucker!!!  That's not like DMT, y'know DMT...  This is the most amazing drug there is.</p><p>\tI love it, man.</p><p>Y'know, I didn't, I didn't get the real... I mean I got, like, I turned on the Salvia page and then I lost it, y'know, last time.  But, but here I was on the fucking page.</p><p>Are you going back?</p><p>\tI won't go back, it's too little.  I would need to take at</p><p>   least three hits like that.  Cause last time...</p><p>\tone time I smoked one, then two, then three, then four..</p><p>    four times, every time I increased the amount.</p><p>\tBut it was five times extract.</p><p>That is the butt-ass, weirdest...  It's like, I become another person.</p><p>\tHuh?</p><p>It's like becoming another person.</p><p>\tShould I rewind the tape?</p>",
 "year": "2002",
 "id": "22822",
 "gender": "Male",
 "timestamp": "2003-06-02T07:00:00.000Z",
 "views": "30004",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.1 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
