{
 "title": "Easy to Swallow",
 "author": "Wolverine Burger",
 "citation": " Wolverine Burger. \"Easy to Swallow: experience with Nutmeg (ID 22826)\". Erowid.org. Apr 2, 2007. erowid.org/exp/22826",
 "substance": "Nutmeg",
 "bodyweight": "175 lb",
 "report": "<p>This last winter I had just left school after only one semester and was having absolutely no luck finding a job. One night when I found myself alone at home, extremely bored and with no drugs, I started to look around the house. Not finding any dxm or diphenhydramine in the bathroom, I next decided to scan the spice rack for nutmeg. I had never tried it before, and was eager to test it out. Unfortunately we only had the pre-ground stuff but there was a whole unopened 25g container of it. I also noticed an identical container of mace, a little more than half used.</p><p>I spent a few minutes deciding how to take it, and I decided on the quickest route, swallowing it in a glass of water. I knew the taste would be horrible, but I have a very strong stomach and figured it could be done. Into a glass of warm water went the entire 25g of ground nutmeg. I stirred it up, dismayed to find that the nutmeg would not dissolve entirely, leaving the mixture gritty. I was starting to think maybe this was dumb, but I finally got up the courage to chug some down.</p><p>Let me tell you I could not believe how easy it was. Practically every source I had found complained about the disgusting taste of nutmeg in quantity, particularly in liquids, but I found it considerably easier than say, an 8 oz. bottle of Tussin.</p><p>I got on the computer for about an hour, with no noticeable effects. I didn't even feel sick. This encouraged me so I decided to take the mace as well. Down it went, even easier than the nutmeg. It was close to another hour before I started to feel something, a mild and pleasant buzz, not unlike a few hits of decent herb. The feeling stayed with me for a few hours until I decided to go to sleep. Usually I have trouble getting to sleep, but on nutmeg it was no problem.</p><p>I woke up a little earlier than normal the next morning, only about 6 hours after going to sleep, to find myself in a sort of hangover even more pleasurable than the buzz I'd had the night before. Everything was buzzing now, alive in a way not totally unlike being on psilocybin, but with no visual effects. However, I did find I had an unusual fascination with the texture of things around me, the kitchen table, wallpaper, the arm of my computer chair, etc. I also found my motor skills a little more off than normal, and any extensive movement generally resulted in a short lasting body high that would return whenever I was being active (which wasn't much).</p><p>These effects lasted all day, tapering off towards evening, and that I slept very soundly and very long. I didn't even care that I was stuck at home all day, I think nutmeg is the perfect unemployment drug. The next time around, I'm going to try about 25 grams of whole nutmeg made into tea and see how that sets me up.</p>",
 "year": "2002",
 "id": "22826",
 "gender": "Male",
 "timestamp": "2007-04-02T07:00:00.000Z",
 "views": "4906",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "25 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 1:00",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ]
}
