{
 "title": "My Perception of a Near Death Syrian Rue OD",
 "author": "Salviadog",
 "citation": " Salviadog. \"My Perception of a Near Death Syrian Rue OD: experience with H.B. Woodrose & Syrian Rue (ID 22835)\". Erowid.org. Apr 16, 2003. erowid.org/exp/22835",
 "substance": "H.B. Woodrose & Syrian Rue",
 "bodyweight": "200 lb",
 "header": [
  "DOSE: T+ 0:00",
  "1 seed",
  "oral",
  "H.B. Woodrose",
  "",
  " T+ 0:45",
  "3.0 g",
  "oral",
  "Syrian Rue",
  "(extract)",
  " T+ 1:00",
  "6.5 g",
  "oral",
  "Syrian Rue",
  "(extract)"
 ],
 "report": "<p>I got a package in the mail in the middle of spring break. It contained 50 HBW seeds and 2 oz. Syrian rue seeds. I immediately started on the lemon juice syrian rue extraction with about a heaping tablespoon of seeds. The plan was to take about 1/3 of the extraction on the following day.</p><p>I figured I would eat just one HBW seed while I was boiling the rue just to see if it would do anything to me. Well, not much effect but I could tell my mind was running a mile a minute and I was thinking of very neat creative ideas. After this started to subside, and my extraction was complete, I decided it would be a good idea to try out the syrian rue that night. So I drank one third of the concoction, and in about five minutes I started to feel this warm flushing sensation in my head and remember saying 'Wow, this is awesome.' So, I went and grabbed the rest of the syrian rue and drank it all. BIG MISTAKE!!!</p><p>Being in a very good mood and starting to feel a little dizzy I had to go take a piss. I half-stumbled to the bathroom and was pissing when I noticed I heard a fan running (the so-called carrier wave). I was wondering where it was coming from and went out to the living room, where the buzzing sound followed me, and asked my roomate if he heard it; of course, he said no. So I was starting to trip and went upstairs, I looked online for when I would peak after taking syrian rue. It was very hard to do, and eventually I gave up and I started to trip pretty hard only about a half hour into it.</p><p>It was not a very pleasant sensation anymore, great feelings of anxiety and paranoia began to set in. I decided to lay down on my bed because I also felt light-headed. I tripped worse and worse until I finally felt that I took too much and got up to puke. I came back to bed and looked at the time. Thinking that I had peaked I said to myself, 'It's ok, just wait it out, it'll all be over soon.' I try falling asleep, and it seems like I've been trying for about a half hour. I look at the clock again, and it says that two minutes have past.</p><p>Oh crap, now I'm starting to get worried as the second wave of nausea hits me. I stumble to the bathroom feeling as if I'm going to faint. Puke a bunch, go back to bed. I close my eyes and begin to see a cycle of flashing colors, Blue...Red...Green over and over. I manage to fall asleep again for about a half hour. Wake up, and notice things have gotten worse, I go to the bathroom and now I have to puke, I've got the shits, and I've got to piss. Worst feeling EVER. Go back to bed, try falling asleep, some very cool CEVs occur. One was a blue 3-D room with some creatures and a ladder (reminded me of HR Puff and Stuff even though I've never seen an episode).</p><p>Wake up an hour later and open my eyes. There's a frame around my eyes and whenever I move them, it flashes. Tracers abound, I moved my hand in front of my eyes and it was one of the coolest things I have ever seen. When I got up to go to the bathroom, I would think that I was farther along than I was, so I would have to stop for a second and jump back into my body.</p><p>Back in bed, I'm starting to feel very depressed about the fact that I was going to die. I started to think about my home and how I didn't get along too well with my parents, but it was all my fault. I just lay my head down, knowing I was going to die and never be able to make amends with my family. Woke up about two hours later, still seeing the 'eye-frame' and tracers, but the tripping sensation was gone.</p><p>Woke up again about three hours later, everything seemed normal but I still was seeing tracers and started to get worried because of what I had read about HPPD and I thought I was going to be f**ked for life. This really didn't matter in the scheme of things though, because I didn't die overnight. Luckily, the tracers subsided in another three hours, and I thought I was in the clear. The next day, I started to feel funny again, maybe because of what I ate. I decided to sleep it off instead of dealing with it. At school a few days later I started to flashback again, but luckily I got it to stop. Now, I think I'm actually still seeing tracers, I thought it was like normal at first, but it's not. They don't interfere with my daily life though, so that's a plus.</p><p>So, my trip lasted about 6 hours, with afterimages for another 6, and tracers that will probably last a lifetime. I don't think I would have taken that much rue if I wouldn't have take LSA right before. It must have lowered my inhibitions. In short, this was the worst I've ever felt in my entire life, and the closest to having a near death experience. Not all bad though, I am trying to get back on good terms with my family.</p><p>To those of you out there who think that syrian rue isn't psychoactive by itself, you are dead wrong. But, to get the desired effects, you might just have to almost kill yourself.</p>",
 "year": "2003",
 "id": "22835",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-04-16T07:00:00.000Z",
 "views": "28509",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 seed",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  },
  "1": {
   "time": "",
   "amount": " T+ 0:45",
   "administration": "3.0 g",
   "substance": "oral"
  },
  "2": {
   "time": "Syrian Rue",
   "amount": "(extract)",
   "administration": " T+ 1:00",
   "substance": "6.5 g"
  }
 }
}
