{
 "title": "Too Much",
 "author": "toomanymushrooms",
 "citation": " toomanymushrooms. \"Too Much: experience with Amanitas - A. muscaria (ID 22868)\". Erowid.org. Nov 14, 2003. erowid.org/exp/22868",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "150 lb",
 "report": "<p>My friend got an ounce of Amanitas off the internet and never ate them, and so yesterday gave them to me. The plan was to eat half of them, I foolishly ate them all.</p><p>6pm- ingest about 12 grams (2 caps)</p><p>6:45- a little giddy</p><p>7:15- eat the other two caps for a total of 25 grams.</p><p>8:00- things starting getting crazy. The tv makes no sense. everything is moving around. best visuals I've ever had.</p><p>8:30-11:15- blacked out</p><p>11:30-1:30- still real messed up but fairly clearheaded. can barely walk b/c of cooridination problems.</p><p>Things were going great until I came to around 11:15 and slowly realized that I'd been gone for three hours. Friends say I was incoherent and my eyes were usually closed. I appeared to freak out a couple of times, but never got out of my chair. Other wise just sat there, moved around from time to time. Drooled a lot.</p><p>Around midnight I thought I was starting to straighten up. Maybe compared to my early state I was but the mushrooms sure weren't done yet. I tried to go to bed and apparently drifted off to a comfortable sleep, but entered some sort of dream state that was at times very scary. There was nothing there but me, and my voice. No vision of anything, so not really a dream, more of a trance. I really thought I was dead at times, or at least stuck in this place until I died. Lots of things were going on that I can't remember clearly, but lead me to believe I was done for. It was really very terryfying, but then I started to talk to someone. Eventually I realized it was my girlfriend trying to comfort me. I couldnt see her, but she reminded me that I ate the mushrooms and then everything cleared up. I still kept losing myself in my head for several hours, but after that I could always remember i was just still tripping. I remember not being able to feel my arm but being able to move it anyways, that was fun.</p><p>Overall this was a really weird experience. I have lots of experience with LSD and mushrooms, but nothing prepared me for this. I really wish I had  just stuck with the 12grams. Even that might of been a bit much but I wouldn't have blacked out for three hours and wasted the trip. I never thought it would of been possible to eat too many shrooms and to black out like that. I might be lucky to not remember the things going through my head though.</p><p>My advice is too never ever eat this much Amanita. It was a real dumb thing to do. I'm sure I scared the hell out of all my friends. This is the closest to a bad trip I've had, even though I don't remeber much of it. Be careful with this stuff!</p>",
 "year": "2003",
 "id": "22868",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-14T08:00:00.000Z",
 "views": "30964",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "12.5 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 1:15",
   "amount": "12.5 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  }
 }
}
