{
 "title": "Opiates Galore",
 "author": "infectedmushroom",
 "citation": " infectedmushroom. \"Opiates Galore: experience with Oxycodone, Hydrocodone, Morphine & Hydromorphone (ID 22872)\". Erowid.org. Feb 10, 2006. erowid.org/exp/22872",
 "substance": "Oxycodone, Hydrocodone, Morphine & Hydromorphone",
 "bodyweight": "145 lb",
 "report": "<p>This is not a report on any 1 experience. It is however a summary of my experiences with opiates.</p><p>I started using pain killers about 3 years ago. I am very experienced with psychedelics, (mushrooms, LSD, LSA, MDMA, MDA, DXM) speed, marijuana, alcohol, and everything in between. Shortly after my exposure to opiates I lost all appetite for these other drugs. I loved opiates with a respectful passion.  At first I had no desire to keep taking more nor did I feel any sort of addiction. I never suffered from any sort of nausea or any other symptoms of the drug no matter what my dosage seemed to be. This being, (with my ability to keep eating them) led to a serious incline in tolerance. From eating 10mg oxy to eating 40mg in about a month. I had a pretty good hook up so I continued to buy for myself and for a bunch of friends. At the height of my tolerance I could easily eat 120mg oxycodone in a day. We would binge out for a few weeks and then BAM, wed be out and hurt physically for more. We would find substitutes like vicodin and morphine to ease the withdrawal.</p><p>This is how I learned the hard way about withdrawal. First my nose is runny, and then all I do is sleep the next day. Then once I wake, I am awake for the next 3 days, cant eat, cant move, throw up, basically feel shitty. Never continue taking any pain killer for more than 4 consecutive days. This is how I got addicted. I used to wake up every morning and do a few lines and throw down a few lorcets and head on to my day. When I ran out of pills, I wouldnt want to get up or do anything without them. After a bunch of hard lessons I now limit myself to once a week doses. Its just not worth it.</p><p>'Were the doors of perception cleansed, man would see things as they truly are'</p><p> Peace!</p>",
 "year": "2003",
 "id": "22872",
 "gender": "Male",
 "timestamp": "2006-02-10T08:00:00.000Z",
 "views": "4606",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Opioids",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Opioids",
   "form": "(pill / tablet)"
  }
 ]
}
