{
 "id": 229,
 "title": "Not Pleasant Nor Unpleasant - Just Annoying",
 "date": {
  "submission": "2005-07-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "NoMore",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "liquid"
  }
 ],
 "report": [
  "Extracted 9 Vicodin 5-500 using the coldwater extraction method.  Ingested a little over half of the extract with 2 Benadryl (which is said to greatly enhance the effects of opiates).",
  "Result: many hours of a 'pre/half-sleep' state.  Everything in my body was comfortable, I felt completely unmotivated to do anything or think anything.  All I wanted to do was lay in my bed.  The state was not necessarily pleasant nor unpleasant - just mildly annoying.  I thought I could use the state to mediate, but my mind would just wander all over the place, and the feeling was completely un-spiritual.  I finally ended up doing some stretching and yoga so that the experience wasn't a complete waste.  Even more scary, I could feel that this 'blah' state was addictive.  I could feel myself wanting to remain in this state, even though it was completely blah and annoying.",
  "Breathing became distracting - I would drift off into sleep and then suddenly feel like I wasn't breathing, and that would jolt me awake enough to take a big breath of air.  The half-awake/asleep state was not pleasant or 'high' - it was just odd.",
  "I did not take the rest of the liquid extraction.  I'm actually thinking of dumping it.  Something that doesn't feel wonderful, but feels somehow addicting feels very frightening and negative.",
  "I felt cloudy-minded the next morning and slept a LOT.  When I woke up I felt exhausted, depressed, and a bit shaky for part of the day.  The effects feel completely gone now, and I'm happy about it.",
  "Having a sister who was a heroin addict, I feel like I can relate to that heroin-induced/nothing matters state a little better now.  I just can't understand how it could be something wonderful, unless it was an escape from something extremely terrible.",
  "In summary, I felt like opiates could only really be used as an 'escape', and even in that escape, there was no push for change - only to remain in that 'escape' state of mind.  Frankly, use of opiates feel very negative and downward-spiraling to me, and I don't plan to use them again."
 ],
 "erowid": {
  "id": "10259",
  "citation": " NoMore. \"Not Pleasant Nor Unpleasant - Just Annoying: experience with Hydrocodone & Diphenhydramine (ID 10259)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10259",
  "substance": "Hydrocodone & Diphenhydramine",
  "views": "28703"
 }
}
