{
 "id": 2290,
 "title": "Pleasant Day",
 "date": {
  "submission": "2005-07-27T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "geokills",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "90",
    "grams": 0.09
   },
   "administration": "oral",
   "substance": "Codeine",
   "form": "ground/crushed"
  },
  {
   "time": "1:10",
   "amount": {
    "unit": "g",
    "grams": "0.1",
    "quantity": "0.1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "1:40",
   "amount": {
    "unit": "g",
    "grams": "0.1",
    "quantity": "0.1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Waking up at 12 noon, and consuming one spaghetti and meatball lunch around then - I decided to make it a day of opiates. The sun was shining through the tall redwoods and a cool breeze danced through the air. Having purchased pure codeine phosphate from an international pharmacy in 30 mg tablets, I decided to crush three pills and wash 'em down with some apple juice at around 1:50 pm. Following is a log of my experience:",
  "T + 0 minutes:  Dose 90 mg pure codeine phosphate, crushed and washed down with apple juice.",
  "T + 25 minutes: Effects begin to become apparent, with relaxation setting in.",
  "T + 40 minutes: Effects increasing, very relaxed. Movement sloppy/uncoordinated.",
  "T + 50 minutes: Somewhat of a body high, very euphoric feeling, contemplating a smoke.",
  "T + 70 minutes: Feel nice, relaxed, no adverse side effectswill proceed with smoking.",
  "T + 85 minutes: A very high high. euphoria persisting, and very relaxed. Things seem extraordinarily comical.",
  "T + 100 minutes: Smoked a bit more (cumulative: no more than 0.2 g of high grade herbs). A bit slower, still feeling good. pupils are small, but not pinpoint. Clarity of thought is somewhat diminished, but public interaction would still be quite possible. Mild hunger setting in.",
  "T + 120 minutes: Intense hunger, likely as a result of the marijuana smoke. Euphoria has dropped significantly, but I'm still enjoying myself.",
  "T + 250 minutes: No noticeable effects persisting, somewhat drowsy.",
  "That was my experience. As you can see, I experienced no bad effects, aside from the temporary hunger (which was quickly resolved). There is no mindfuck involved with codeine IMHO, although it will slow you down a bit. It was nice to just lay down and listen to mellow music such as the Grateful Dead, Pink Floyd, or the like. The peak effects persisted for a good hour and fifteen minutes, making for a very worthwhile experience. Really wanted to do it again today, but I gotta be careful with those opiates - so I'm going to wait another week or three to experiment with a higher dose. ;)"
 ],
 "erowid": {
  "id": "17662",
  "citation": " geokills. \"Pleasant Day: experience with Codeine (ID 17662)\". Erowid.org. Jul 27, 2005. erowid.org/exp/17662",
  "substance": "Codeine",
  "views": "54851"
 }
}
