{
 "id": 2291,
 "title": "Wide Awake",
 "date": {
  "submission": "2002-09-25T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "afterhours",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Picture this.....I'm sitting in front of my computer smoking a cigarette and coming down from a night of doing blow.  It's 7:30 am now.  I started at 10:00 pm the night before. I've been sitting in front of my computer for about 8 hours now.  In and out of chat rooms because I wanted to chat with people who had no clue who I am.  My shoulders are tense and my nose is runny.",
  "I've been doing blow on and off for about a year now.  More often in the last couple of months.  The feeling I used to get from it isn't there any more.  I've read all the stories on this site.  Some of them I can relate to and some of them I can't believe.  Everyone has a different experience from it.  I'm here to share mine because of the ones I can relate to have opened my eyes.",
  "I've noticed a few changes in myself physically and pyschologically in the past few months.  Physically I am tired all the time.  My nose is congested or runny which is a pain....I always blame it on alergies when people ask me.  Strength wise I am weaker.  Pyschologically I am irratable, more alert, less caring, driven and I have little or no patience. ",
  "Once I do a few bumps I'm back to normal.  I am my old self again.  That is the scary part.  I don't rely on it but it brings me back.  I say I'm not addicted to it but for some reason my mind craves it.  I can't wait for the next line.  The problem I have now is that the next line doesn't do anything for me.  1 leads to 2 to 3 and so on.....",
  "So for all you people who are in the same boat.  Let me say this.  This is the beginning of an addiction.  You are at a fork in the road.  You can choose to continue on the same path or move onto a cleaner path.   I'm here now.....I don't know what to do!",
  "Good Luck!"
 ],
 "erowid": {
  "id": "17672",
  "citation": " afterhours. \"Wide Awake: experience with Cocaine (ID 17672)\". Erowid.org. Sep 25, 2002. erowid.org/exp/17672",
  "substance": "Cocaine",
  "views": "16160"
 }
}
