{
 "title": "Drama-queen",
 "author": "Jasmine",
 "citation": " Jasmine. \"Drama-queen: experience with Dimenhydrinate (Dramamine) (ID 22955)\". Erowid.org. Mar 12, 2010. erowid.org/exp/22955",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "12 tablets",
  "oral",
  "Dimenhydrinate",
  "(pill / tablet)"
 ],
 "report": "<p>Me and my friend have done this before, him uncounted me about 10 times more or less, usually in a place were you don't interact with people (In our rooms or in a secluded area outside the house, not like the park, like in the woods or the country were people don't go) This time around I took them when I was in my room, I took 12 and waited for the effects, I also had a notepad and some paper and I wrote down what happened, unfortunately I lost it so I will have to give you what I can recall of what I wrote down.</p><p>About a half hour after taking them I began to feel drugged up and sleepy, but forced myself to stay awake, I felt things around me and they felt very extra textured to the touch, I spaced out a lot and the music I listened to sounded very different (lyrics melody wise) and very far off, I can recall listening to Nirvana and hearing things in one of the songs that I knew wasn't suppose to be there.</p><p>I also watched on my computer a music video clip that I wrote about but couldn't actually remember about until I read what I had written on my pad the next day, kind of like a dream in my theory, you have to try and remember what happens by either reminding yourself or writing down what you saw or you'll forget it, kind of like dreams.</p><p>After awhile my mother walked in on me, during this time (recalling former trips) I kept reminding myself to remember what she was saying, and to try and act awake, also told myself what I saw and heard aren't always real so I was wary of things that would seem out of place in a normal conversation, I also kind of hid my face so my eyes were out of sight (my eyes always look really gazed over and out in space) and she went away in a short while after asking about something I can't recall.</p><p>Then I felt really sleepy so I went to lay down on my bed and call it a night, I remember before falling asleep that I was talking to my friend and I could see her, and I knew she wasn't there, but I kept talking to her anyways, until I realized she wasn't real and my brain understood it and I was like, duh shes not there stop talking to nobody. I did this a few more times and fell asleep until noon the next day,</p><p>The day after I felt numb, tired and in a dreamlike state, my brain also couldn't pick up things as well, like math, my writing was crappy, etc - I just felt extra stupid, this lasted for the next couple of days and gradually went away completely after a week or so. Basically I had done it before so I knew what to expect, the first time I ever did it I had my friend watch me.</p><p>If anyone does this ever I recommend reading up on it first, then finding someone you trust to watch you and to remember before and while tripping on d.z that anything unusual or scary is most likely not real. And to stay away from people or places were you could be found and taken away to the hospital for acting like a loony, oh yea, I don't suggest taking it more then once in two weeks time, I did it once within a few days of the last trip and I was fucked up for a lot longer and felt numb longer then usual and it carried on for about a month, blah</p><p>Thats about it, for the long-term effects. I don't know, I haven't had any yet and its been a year and a half since I started tripping on it, so there ya go.</p>",
 "year": "2003",
 "id": "22955",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-03-12T08:00:00.000Z",
 "views": "4241",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "12 tablets",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 }
}
