{
 "title": "A Crouton In My Mouth, and Women at the Gate",
 "author": "Hobbes",
 "citation": " Hobbes. \"A Crouton In My Mouth, and Women at the Gate: experience with Salvia divinorum (10x extract) (ID 22969)\". Erowid.org. Apr 5, 2007. erowid.org/exp/22969",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "150 lb",
 "report": "<p>This is the short story of my first experience with Salvia 10x powder.</p><p>A little background:</p><p>My first experience with a psychadelic, acid, ended badly.  The first two hours were good, but then the girl I was 'dating' at the time starting making out with somebody else.  I was 15 then, I'm 23 now.  Every time after that, I hoped for the trippy fun of the first two hours, but it never came, and on turn five I gave up.</p><p>I don't smoke weed anymore, either, for a simuliar reason.</p><p>I'm agnostic, so in the below report, I'm going to avoid pinpointing any of the semi/pseudo mystical implifications of the trip.</p><p>This is the tale of my first experience with 'Lady Salvia,' and she welcomed me with open arms.</p><p>Now, I didn't know exactly how much I should smoke, but I decided to err on the side of caution. In retrospect, I should have done it the other way around, but that's a story that I'll write another day.</p><p>Bowl Number One</p><p>I used a small pinch for the first hit, mixed with some Tobacco. Now, this is a bong. My thought was that I'd use the Tobacco to buffer the Salvia so that it wouldn't fall straight down into the chamber. It didn't work too well, and the Tobacco made me cough. By the way, I smoke 20-30 cigarettes a day. Go figure.</p><p>Bowl Number Two</p><p>So, I went against my principles and put a screen into the bong. I loaded the bowl with the Salvia 10x so that it was about even with the top of the bowl, tightly packed. Lighter in hand, I inhaled. It was smooth.</p><p>So, so smooth. Not harsh at all.</p><p>I held it in for 25-30 seconds, it's hard to remember exactly when the numbers went away and the trip showed up. You see, my mouth was open. It felt like my jaw had become disjointed, rendering my mouth stuck open -- or more like this: for a few moments, I had no body, and when I came back to it, there needed to be an explanation. The only logical conclusion for this, of course, was that there was a GIANT CROUTON in my mouth, and I started laughing hysterically at the thought.  But it was a calm hysteria, which is of course totally contradictory, but it just was...</p><p>Nothing spectacular happened. Just some great, calm, but somehow hysterical laughter. Nothing was scary or weird -- it was just great fun, which is weird in retrospect, because most people say that this isn't a 'fun' drug.</p><p>After the crouton wore off, it seemed like the trip was pretty much over. It lasted maybe five minutes, and after that I just felt euphoric. I wanted bigger, and better.  And more than that, I felt as though something was inviting me to join the party.</p><p>Bowl Number Three/Four 12:10 AM</p><p>This time, I packed it even tighter, lit it for longer, and held it for longer. Repeat once. Two hits, about 2 minutes apart.</p><p>My eyes stayed closed. In the background, Orbital's Snivlization was playing, and I could see the music coming in from behind me, swirling into a vortex of vibrating colors and rolling down a drain that resembled a tie-dyed black hole. When the drain filled, the music kept flowing in, still rotating, and it slowly spun out into a disc of gas and stars. It slowly became a galaxy; speeding away from me. And it was beautiful.</p><p>The stream of music was still coming in from behind my closed eyes. It split down the center and flew off into forever in both directions, it merged in the center, and became a fence. Two beings that I interpreted as women in feathered head dresses stood adjacent to what looked like a sort of vaulted doorway, minus the door. They invited me to come with them, but for some reason or another, I couldn't follow. With that, the whole scene sunk off into the distance, speeding away from me until it was finally gone. There was no sense of rejection, just a sort of ... disappointment. Not in myself, or in anything tangible.  'Maybe next time,' I thought to myself.</p><p>And then the music started flowing from behind my eyes again, and again it went off into two directions of infinity. It split along the vertical axis, and then came together like a zipper without the teeth.</p><p>The whole thing was serene and beautiful, and I knew that it was over.</p><p>I opened my eyes, and it looked like the area infront of me was a crashing ocean -- as if reality was suddenly being splashed back upon me. The effect didn't last, and suddenly I was back.</p><p>I still felt euphoric, but I wasn't tripping.</p><p>12:30ish AM</p><p>All in all, it was a very positive experience and I'm looking forward to doing it again. I've only got one question: Is this as powerful as it gets? I've read other trip reports where people who have done as much as I did (I think), and their experiences are much more intense.</p>",
 "year": "2003",
 "id": "22969",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-05T07:00:00.000Z",
 "views": "2680",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
