{
 "id": 23,
 "title": "First Time With Ethocin",
 "date": {
  "submission": "2013-08-11T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "treetops",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "35"
   },
   "administration": "oral",
   "substance": "4-HO-DET"
  },
  {
   "time": "1:45",
   "administration": "oral",
   "substance": "MAOI"
  }
 ],
 "report": [
  "Intro: Had planned my day out earlier in the week, very clean house, organized spaces, intentions set and a ready mind. Not trying to 'control' things too much but preparing. A perfect day outside in the wild west here, 70 degrees, sunny and mild wind.",
  "9:50am I took 35mg (between 35mg and 40mg, scale problems). I had taken earlier that morning some basic supplements: Fish Oil, Rhodiola rosea, and Bacopa, and a few sips of coffee followed by a small cup of green tea.",
  "+30 minutes: Not feeling any change in mental status, still focused thoughts. I turned on Disneys Fantasia for nostalgia and classical music. Stomach is not sore but feeling different.",
  "+1:00 hours: Body sensations and change in feelings occurred, coming out of left field. Fast approach but not 'hard.' I usually have to stretch a bit when tryptamines enter my system, sometimes muscle stiffness happens or some urge to flex joints, in this case I needed to stretch my neck and pop my knuckles.",
  "+1:10 hours: Body sensations include increased awareness in limb positioning, upset stomach, needing to use the toilet, slight lightheadedness. My vision is a little blurry/wavy possibly visual distortions at this point (squigglys). When I talked out loud my voice seemed to come from somewhere further than me. The stomach pain increased and I paused Fantasia. My body now had a mild pulsing sensation. My body told me to go to the bathroom.",
  "I spent the next twenty minutes around the toilet. A lot of disorganized but coherent thinking, very uncomfortably physically for my stomach but this is not uncommon with psychedelic substances. I had a very liquid bases BM and then kneeled over the toilet thinking I was about to throw up. I accepted this, throwing up is far from fun, but happens, I respected the substance and thanked it for its power/potential and patiently waited to hurl the little fruit and tea in my stomach. However this hope was never met, I came close to throwing up 3 or 4 times but kept riding the wave. Feeling better than not, for twenty minutes on and off. I had a beautiful vision in my minds eye of a large tree appearing to be viewed through a kaleidoscope and when I spit in the toilet and almost hurled I had detailed closed-eye visuals of mucus, tar and bile-like fluids being stored in my body. I saw purple tar mucus hanging like curtains to my lungs. I used to be a heavier smoker (3/4 pack a day) where now I have maybe 7 rolled cigarettes a week, but beautiful detailed images.",
  "+1:45 hours: walked around my house into the various rooms, open spaces, white walls, high ceilings and large windows. A very clean and open environment I know made a large impact on this trip. I had a very clear mind after getting through the stomach pain. I could think and was only a little bit giggly. I had ideas that interested me, like different perspectives on modern culture, who my family was, how the people I work with might feel. I was confused when thinking about how many people seem to be not relaxed. I was perplexed. I think it isn't that most people don't seem relaxed but most people seem busy, afraid, tired, stressed or unhappy. This made me empathize them, for it is some powerful suffering to do on a daily basis. I took another supplement at this time, an MAOI combo to lengthen the adventure.",
  "The next few hours things had plateaued and remained at a good level trip but I was maybe slightly disappointed for I wanted a little more of a mental-shift or visuals/distortions. I was and am grateful. It was a great time and learned some things.",
  "I sat outside in my yard for most of the remainder of the trip, in shorts and a light shirt I laid in the grass looking around at the nature around me. I live on some land and got to watch some birds, squirrels and bugs do there thing. I felt like the squirrels knew I was tripping and were impressed, the birds were elegant and friendly and the bugs hard working and curious.",
  "I wrote a song on my computer with a keyboard and some other midi gear. It started the idea for an album long music project involving a UK garage sound, future garage, bassey breaks, trip hop vibe. Beautiful song Im proud of.",
  "+3:45 hours: Things were starting to come the beginning of the close of this trip. My vision when looking at things was very clear, a little shaky/vibrate but detailed and bright. That lasted longer.",
  "+4:30 hours: A fine trip. Only a little trouble falling asleep that night, no mood alteration, no interaction with my appetite. I would rate my experience of this trip a 5.5 out of 10 on a scale of my fun/quality level.",
  "If I try this again I will raise the does considerably. I have been on psychiatric medications in the past relating to depression and other symptoms, and I think that this has lead to a high tolerance in me when it comes to psychotropic and psychedelic stuff. I have experimented with various psychedelic substances and a small number of research chemicals but am open minded to try this again later, maybe next year or sooner. I enjoy 4-AcO-DMT better. I dont recommend anything but am sharing my experiences. Please be safe and knowledgeable in any chemical endeavors. Peace and "
 ],
 "erowid": {
  "id": "100157",
  "citation": " treetops. \"First Time With Ethocin: experience with 4-HO-DET (ID 100157)\". Erowid.org. Aug 11, 2013. erowid.org/exp/100157",
  "substance": "4-HO-DET",
  "views": "860"
 }
}
