{
 "title": "Harming Myself",
 "author": "Bacon",
 "citation": " Bacon. \"Harming Myself: experience with Buprion (Wellbutrin) (ID 23053)\". Erowid.org. Feb 1, 2005. erowid.org/exp/23053",
 "substance": "Buprion (Wellbutrin)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3000 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   "",
   "600 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23053",
   "Male",
   "",
   "Not Given",
   "Feb 1, 2005",
   "20591",
   " "
  ]
 ],
 "report": "<p>Ive been diagnosed with severe depression for several years now, it seems like Ages. Through this Ive been on many medications Zoloft, Effexor, Wellbutrin, amitryptaline, seroquel and a lot others I cant remember. Ive commited suicide several times, many different ways, I slit my wrist 4 times now, the 3rd I needed stitches, and the 4th I would have but I didnt get into emergency for hours, like HOURS and I was bleeding fucking EVERYWHERE, my arm was COVERED in blood. So I had a new psychiatrist took me off zoloft and put me on a 150 MG dose to start with then raised it to like 300 mgs twice a day, so as you can see Im on a very high dose of meds. One day in a fight with my mom I got angry and wanted to harm myself, mutilate myself, just HARM myself, but I resisted, so instead I took 10 of my wellbutrin.... BAD IDEA  I guess you can say I 'tripped' but it was more of an extreme delusion, EXTREME delusion, not like datura, or benylyn and those types, it felt like I was drunk, and things kept going through my mind and I had LOTS of energy, felt good, but I puked like ever hour. Every hour Id go retch, come back and do my thing. I cleaned my entire room that night, my room looked like a landfill LITRALLY and I cleaned it all up 100% I didnt even do this during my speed addiction.  </p><p>I felt the effects for a few days, even after it wore off and I slept, I still was sick and nauseous. All in all I wish it didnt happen. The actual use with wellbutrin has been great, I have been recovering from my depression gradually, and I feel great. Ive abused ALL addictive meds, and realized how close these chemicals are to meth and coke, and doctors are pumping them into kids  anyways. Remember, when your prescribed something ask questions, research, and think about what your being prescribed, and please dont abuse your medication, it throws your disorder so out of balance.</p>"
}
