{
 "title": "Halcyonic Libation",
 "author": "Soggy",
 "citation": " Soggy. \"Halcyonic Libation: experience with Cannabis & Alcohol (ID 23052)\". Erowid.org. Dec 1, 2006. erowid.org/exp/23052",
 "substance": "Cannabis & Alcohol",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "4 hits",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "4 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>Spring break had finally descended upon my friends and I, and like any ordinary suburban citizens, this was a perfect justification for immense consumption of narcotics and other fun substances. Coupled with the fact it was T's birthday, we needed nothing further to make us gather in 'The Spot' where our ritual blazing festivals occurred.</p><p>We packed a bowl with some fresh and luscious Vermont-grown herb, which was still sticky and wet. The bowl was transferred from hand to hand among five people, each of us struggling to detain the potent vapors within the confines of our defenseless lungs. After about 4 hits, an unusually small amount for me, my cheek muscles began to involuntarily twitch, the telltale sign my body displays to let myself know that I'm high. Next, I downed 4 bottles of Smirnoff Ice in the midst of a body high that can only be explained as oversaturated pulchritude.</p><p>As the alcohol and THC mingled happily together within my synapses, waves of gorgeous chemical pleasure assaulted my brain and perception mechanisms. The simple task of focusing became literally impossible. I felt that if my eyes stopped moving, I might miss something, and so, I sat there for about 5 minutes shifting my eyes as fast as possible, never actually seeing anything at all. My perception of depth became completely compromised, as objects in my retinas were always closer than they appeared. This effect cycled in and out in overwhelming waves that I thoroughly enjoyed.</p><p>Throughout these glorious minutes I laughed ceaselessly at the fact that we as humans are conditioned to believe that such experiences are evil and sure be avoided. Nobody can tell me that what I felt was wrong, evil, negative, detrimental, or bad in any sense of the words. I was where I wanted to be, forever.</p><p>I became very aware that my usual veil of self-consciousness was slowly being dismantled. This process became oddly tangible, as bricks of my shield were smashed away by rushes of THC and its alcoholic sidekick. I really enjoyed not being bothered with the complications of a conscious thought process. My brain was existing in a pure and quintessential form, and I loved it. I said anything I felt, and I did anything I wanted to.</p><p>Suddenly I became very loving and sexually aroused. I began carressing and feeling one of my female friends who had been lounging in my lap. I felt so close to her, so amazingly connected. Our bodies meshed together in a form of sexual fluidity as we rubbed each other and smiled happily. I had no previous interest in this girl, and it was then that I realized that she looked a heck of a lot better than usual. I didn't like that, for no other reason than I just did not like the concept of thinking and making rational realizations.</p><p>I opened my eyes around 6 or 7 minutes later and realized that I had forget to finish the end tail of a blink. I had actually forgot to open my eyes. I realized that when my eyes were closed and I just absorbed the energies and sounds that were filling the room, my high was a lot more enjoyable. My friends were crawling all over and engaging in all sorts of odd and hilarious antics.  My friend A had an M&M suit on, and was galantly screaming some hip-hop lyrics. The very visualization made me laugh harder than I've ever laughed before.</p><p>Before I knew it, two hours had passed. I can not stress my altered perception of time enough. Literally, I had thought that 30 minutes, MAX, had passed. It was the weirdest feeling ever. As people began to gradually depart the gathering, I tried to calm myself in an attempt to psychologically contribute to ending my high's reign, but to no avail. My friend D and I discussed pointless and random issues such as the spelling of the word 'four' and why the hell it has an 'F'. These conversations left me short of breath and rolling on the floor in a fit of hysterical laughter.</p><p>Eventually I returned to my normal state and slowly made my way home. It was a very fun night.</p>",
 "year": "2003",
 "id": "23052",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-01T08:00:00.000Z",
 "views": "9053",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
