{
 "title": "Grow Little Guys!!",
 "author": "H.Q. Kipper",
 "citation": " H.Q. Kipper. \"Grow Little Guys!!: experience with Mushrooms (ID 2310)\". Erowid.org. Sep 25, 2001. erowid.org/exp/2310",
 "substance": "Mushrooms",
 "bodyweight": "",
 "report": [
  "<p>I want to lend a word of encouragement to those of you who wish to try the wondrous experience of cultivating mushrooms. Using a combination of various methods (based around pressure cooking some brown rice cakes), I have been successful! I began with 2 spore prints about 1 1/2 months ago. One print I aquired by mail, the other I had made myself while overseas (with a piece of paper and a p. mexicana cap). I suggest that anyone who wants to try this should get a spore print from a reputable source. The one I made myself has worked, but many more jars became contaminated.",
  "Persistence has been key in getting my jars to the point of sprouting 'shrooms. If you asked me last week, though, I would say it was a failure. The rice cakes, fully colonized, had been in my humidifier-tank for almost two weeks, and we were just gonna eat the cakes. When I pulled one out, I noticed some little mushroom nubs near the bottom. Rejoicing followed.",
  "All the info you may need is easily attainable online, but I would like to make a couple of important observations/techniques available as well:",
  "First of all, my successful jars were all clones of the strongest mycelium from the spore print growth. This required an extra two weeks, but was well worth it. Once my first round of jars became colonized, I simply cut off small bits of mycelium from the two strongest-looking jars and innoculated fresh rice cake jars with that. These jars were colonized completely within two weeks and turned out to be very resistant to my sometimes-careless handling which likely introduced contaminants.  These are the jars (with the exception of one earlier run and one 'mexicana' I saved) that are fruiting right now.",
  "This leads me to my next observation: Getting the cakes colonized was relatively easy, but fruiting? They took their sweet time. Hey, I'm in no rush, but it was disconcerting; wondering if the cakes would succumb to infection before bearing the sought-after fruit.",
  "The jar to fruit first was one that I didn't 'pop' out of its jelly jar and set in the tank. It was one that I left IN the colonization jar, due to one small exposed patch of rice. Well, condensation ran down the inside of the jar, and this wet spot was where the little 'shroomies first appeared--not on top, as I expected.",
  "When I noticed these little guys poking their heads up (as we were about to eat the cake, since we thought it wasn't gonna grow!), I popped the cake out onto some vermiculite and into the tank. Lo and behold, all the cakes (which are NOT all the same age!) began fruiting within a day.  Perhaps sort of like the action of ethylene, emitted by the pears and peaches in your kitchen as they ripen, stimulating the ripening of their nearby fruits, the mushrooms may stimulate their neighbors. This seems likely to me due to the simultaneous fruiting of jars of various ages. One jar is only 50% colonized, on the top half, it's still in the jar (uncovered of course), and it is fruiting right next to the others.",
  "I'll have to take a 'shroom-coated cake with me on a little picnic to sit next to the big ol' cow pie I innoculated out in the yard. Grow little guys!!! Grow!!  Draw what educated conclusions you can from these uncontrolled, amateur lab observations. Maybe this will help some of you in your own 'growing' projects. Best of luck!</p>"
 ],
 "year": "2000",
 "id": "2310",
 "views": "25393",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Mushrooms"
  }
 ],
 "submissionDate": "2001-09-25T07:00:00.000Z"
}
