{
 "title": "A Musical Plant",
 "author": "Tom Aido",
 "citation": " Tom Aido. \"A Musical Plant: experience with Salvia Divinorum (plain leaf) (ID 23127)\". Erowid.org. Feb 13, 2007. erowid.org/exp/23127",
 "substance": "Salvia Divinorum (plain leaf)",
 "bodyweight": "160 lb",
 "report": "<p>This is my first experience with salvia (or ANY substance) and I think it went quite well.  I was at my cousins house and we were very excited to try this plant, so that night we went outside to the garage.  We were using a large peace-pipe made from a big mailing tube with a foil bowl, specially constructed for this occasion. My cousins and friend went first; there was alot of laughter and silliness from them and I wanted to go somewhere quiet for my experience.  So, myself and cousin A went outside, about a hundred yards away under a tree, and I took a big hit.</p><p>The first thing I noticed were vibrations, coming from above and to the left, and they began to make a beat. After taking another, smaller hit I got up to walk. I felt that I should walk with the beat; I began taking very large, Mr. Natural type steps and bobbing my head and humming to myself, dum dum da dum dum.  I felt a silliness at what I was doing but felt it was good.  Throughout the experience there was a sense that I SHOULD be doing these things.  Not that I HAD to, or was being forced to, just that it was the appropriate thing to do. My head was clear, I realized it was silly, but I felt it was the right thing to do.</p><p>then, to the vibrational rythm, I began to dance.  My cousins asked me if I liked dancing, and I replied 'I have to. Well, I don't HAVE to but it's better if I do.'  As I spoke, I noticed my speech was a little slurred.  Then somehow how we ended up at the burn pile and sat down.  Passage of time and space were less noticeable than usual.  I still felt the vibes.  I may have taken another hit at this point, although I'm not quite sure.  As I stared at the dark ground I began to see alot of colored vines that wove together to create a little village for elves.  I was thinking about this as cousin B tapped me and asked what I was experiencing; I told him about the village and said that salvia was a powerful psychedelic.  He asked why and I replied 'Because I'm seeing things that you can't see!' at which point I saw a large, red vine creep along the edge of cousin A's body and knock him to the ground.</p><p>Inside now, in a dim room with classical music, I took another hit.  I closed my eyes and BECAME the music, I don't know how else to put it.  I saw a tunnel made of the vines and each color was a different instrument; I became various vines and felt the essence of each sound, VERY incredible.  I soon went to sleep and had a lucid dream that night.</p><p>That's what I remember.  To note: The hallucinations of the vines and the village were very clear and undoubtedly visual; there was another sensation, however, experienced by myself and my cousins: Thought hallucinations.  Like the sense of appropriateness, the vines being an elf village, the dancing, all these were things I just THOUGHT.  Not to say we were delusional; to the contrary, we had very clear thinking.  We recognized these unusual thoughts coming on.  My cousins all thought they were in a circus. 'It doesnt look like a circus' they said 'Its just like were in one'.  Also, I can vouch for the common report of heavy sweating as a side-effect.</p>",
 "year": "2002",
 "id": "23127",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-02-13T08:00:00.000Z",
 "views": "3062",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  "1": {
   "time": "",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  "2": {
   "time": "",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
