{
 "title": "Reality Transfer Machine",
 "author": "BRF",
 "citation": " BRF. \"Reality Transfer Machine: experience with Salvia divinorum (5x extract) (ID 23120)\". Erowid.org. Feb 16, 2006. erowid.org/exp/23120",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "60 kg",
 "report": [
  "<p>It's a nice warm Easter sunday, feeling very relaxed and quite spaced out after an all night acid party and only 2-3 hours sleep. Me and my friends have been smoking Salvia for the last couple of weeks, slowly familiarising ourselves with it's effects. I just smoked a relatively small dose (0.05g) of Salvia 5x and had quite an odd experience:",
  "I took the hit in one go, held it in, and closed my eyes.",
  "Fairly suddenly, but not alarmingly so, I became aware of  a large machine, best described as a sort of ferris wheel. This machine was  rolling across me very slowly from right to left as a lay on the sofa and I was distinctly aware of there being some kind of entities, which felt human, on board this machine. I felt the presence of a male entity in the middle of the machine and various female entities sort of climbing round the machine 'operating' it. There was a real sense of them urgently trying to put things in order so I could be transferred from this reality into another, perhaps the one they inhabit, or maybe they were just trying to send me on my way somewhere else? I don't know.",
  "As the machine 'rolled' over me I felt that it's point of contact represented the joining of 2 seperate realities/dimensions and, as it passed across me, my head moved involuntarily from facing left to facing right, almost like I was being physcally pulled into this other reality/dimension. Then the effects subsided and I was left lying on my sofa speaking to the entities on the other side and thanking them for trying to help me across and saying that while I was a little scared and apprehensive of the whole Salvia thing I would try to break through again soon.",
  "Needless to say this was quite a strange experience for me but not at all scary or unpleasent, in fact I feel happy in the knowledge that there is something else out there and I look forward to exploring this plant/dimension in the future.</p>"
 ],
 "year": "2003",
 "id": "23120",
 "gender": "Male",
 "views": "3809",
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "submissionDate": "2006-02-16T08:00:00.000Z"
}
