{
 "id": 2315,
 "title": "Becoming The Unbeing",
 "date": {
  "submission": "2005-07-18T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "What's In A Name",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.25",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  },
  {
   "time": "0:05",
   "amount": {
    "number": "0.25",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "Ive wanted to have an experience like Ive read so much about on the internet for so long, and although it took some effort, I got what I wished for. Its weird because although Ive done mushrooms, DXM (I dont feel as stupid when I call it DXM not Robitussin), and morning glory seeds among others, but it never felt proper to write a trip report about my experiences. They somehow seemed private; experiences whose details I didnt feel should to be shared. I obviously dont feel this way about my most recent and first level 5 trip on salvia.",
  "I had smoked salvia 3 times previously in attempts to attain a level 5 trip, and meet salvia, to voyage to other times and become something like wet paint, as I had read in one report. I guess Ill start from the beginning",
  "The first time I smoked salvia, it was in my glass bowl, I got some 5x and put in what I figured was a 10th of a gram. A friend and myself had driven back on a road where no one is at night, next to some soccer fields where I figured it would be safe. I torched it, but didnt realize how hot the glass would get, I had to hold the bowl with my shirt that I took off because the bowl got so hot I couldnt touch it and cover the carb without getting burnt. I did however manage to pull off a few good hits from it. The first thing I always notice when smoking salvia is the prickly feeling in my chest, which soon became rather uncomfortable.",
  "Before I knew it I was already tripping pretty hard, I was watching the last of the salvia as it burnt when I got my first open-eyed visuals. The cherry looked like a teddy bear, and then I realized that everything looked like a teddy bear. It was if the world was glossed over with a film covered in them. I think its just as hard to explain low doses of salvia as it is high doses. I remember muttering something about tripping pretty hard, and I walked about 20 yards away and soon realized that I had no where to walk, and figured I should just sit down and experience this. When I sat down I closed my eyes and saw that I was on top of a huge spinning tunnel, like if I was on top of a tornado looking down to the ground. The tunnel was mostly black, but there was a light at the bottom of it. I had a good mindfuck going, lots of thoughts coming to me. Soon I opened my eyes and the inebriation left me back in reality. I knew I had had a hard trip, but had the feeling that more was to come.",
  "The next night I smoked some salvia again, this time in my friends car (dont do this, cause I realize in 20/20 hindsight that if I was at a level 5 that I might have just opened the door and fell out). This time I held a quarter over the carb and my friend did the torching. It worked pretty good. I smoked just a little more than I had the previous night, but felt it a lot more. It was uncomfortable smoking in the car because I felt confined, and the prickles were accompanied by feeling like I was covered in some icky, sticky substance, which I later figured out was my own sweat (normally I dont think its icky and sticky, just slick). I began to feel more and more uncomfortable, like I wasnt supposed to be there, doing what I had done at that moment, so I instructed my friend to drive. I felt like I had to escape what I was doing.",
  "On the ride down the street we were on, I saw for the first time beings in what appeared to be the fabric of the universe. I felt like I was in an alien carnival, watching them go about doing their business. I hate to be so nondescript but until I interacted with these beings later on, it was very hard to know what was happening my body and mind. I think that is the reason that some trip reports are so nondescript, that people dont know themselves what was happing, and were very confused by the level of ego death they were experiencing. I watched these beings for a good 5 minutes before coming back from a comatose state and being able to finally put the bowl down which I didnt realize was still in my lap.",
  "I waited a full week for my next experience. I picked up a cheap tobacco pipe, so I didnt have to worry about holding the carb. I loaded the pipe with what I eyed up as about twice as much as I had smoked the first time. This time I made sure to not have so many things in my pockets, and what I did have I gave to my friend, because previously, I had became very worried about still having my things like keys and inhaler and stuff. I smoked the bowl in about 2 minutes, held each hit for as long as I could, by the time I was done I was really far-gone. I had already slipped back into the glossy type view of the world I had previously experienced. I managed to hand my pipe and lighter to my friend and laid down on my jacket which I had taken off to lay on (we were outside again). I also gave him my glasses because they felt really, really uncomfortable for some reason. I closed my eyes, and was met by the same vortex spinning down to the center of the earth as I was before.",
  "This time however I traveled down what I figure was about 20 or so feet, and although I couldnt see the beings this time, I felt their presence. Then I heard a voice to my upper left, through the side of the vortex. She spoke softly but firmly, she said something to the effect of, Youre here now, what would you like to know? I didnt know what to say, but told her that I would be back with a question. She then guided me to an area in salvia space that I had not seen before. When I first saw it I felt like I was entering into a sacred temple. I really cant say what it was that I saw there. But the trip I was experiencing was emanating from it. It was undulating (think thats the right word, kinda like pulsing) with waves of pure trip coming off from it. I felt very insignificant in the face of it.",
  "I then slowly ascended out of this vortex and opened my eyes, but I was still dreaming, I wasnt that scared because I remembered that I had smoked the salvia and reminded myself that I would be normal soon. Salvia had seemed kind of mad that my friend was present, Im not sure why, but one theory is that he has not ever, and I dont think ever will smoke salvia. She was kind of offended that I brought an outsider to sit for me on something he knew nothing about. We proceeded to walk to a friends house down railroad tracks, and for the first minute or two of walking, all of the rocks around the tracks had smiling faces on them. They seemed playful and content. Although this was a very powerful trip, I knew that it wasnt a level 5, I love those trip reports where theyre like and what happened next just cant be explained in words, but I ceased to exist. But this wasnt that. I still was aware of some concept of self throughout this whole experience.",
  "Well I waited a whole todays, thinking and thinking of a questionwhat can I askwhat? Then I had the bright idea that I would go back, this time without expectations of reaching anything that I had not previously. I had my set. This time I decided to stay put in my room, where I feel very secure. I didnt have to worry about all my stuff. I hate worrying about my stuff. Not like Im OCD, but I think my stuff acted as a link to reality, and that if all my stuff was in the right pockets, I could tell myself that there was still a reality. I also took my shirt, shoes and socks off. Leaving only my boxers and gym shorts. I figured that hopefully I wouldnt have that icky feeling this time if my shirt was off. I set up my bed with pillows to lay back on, and my nightstand to put my pipe and torch on afterwards. I put on Dave Matthews - # 34, a very relaxing song, and shut all of my lights except for the computer monitor. I kinda like the bluish glow that my background gives off to the room. Voila, my setting.",
  "I cleared my mind of the days thoughts and started to hit my pipe. I managed to smoke about a quarter gram of the same 5x standardized extract as I had smoked all the previous times. I guess I have a high tolerance because this did not put me to level 5, but what it did was very interesting. As I was hitting the pipe, I noticed the same feeling of falling back out of my body. Standing a few feet back, I watched myself draw the last of my last hit from the pipe. My whole vision became very choppy, and I started to fall into the vortex. As I was just starting to sink in, a voice to my left started saying, Awww look, hes here! Another voice in front of me said, Howd he get here? The first voice replied, Dont you see, he was smoking something and now hes here.",
  "Soon I saw more and more of these same beings as I had seen in the car before. You cant explain where they exist other than saying in salvia space. They all seemed to be doing a task, making sure that I was ok, making sure that everything in my room was ok, making sure the universe was playing out according precisely to plan. Sometimes they would speak to me in English, and other times they would be talking amongst themselves in their own language, in which basically all they could say was pure trip. Its as though the mindfuck a trip gives you was being verbalized and communicated with. I watched this go on for a minute when I realized that I was not at a level 5, but I had another quarter gram of saliva left, and could make my best attempt to get there. I was astounded that I could get up, walk to my computer, and pour the extract into the pipe in this state.",
  "Getting up was very odd because when I got up, it felt like I was walking on my wall. Gravity had been switched around and vertical was now horizontal. When getting up, these beings were all around, there was one by the vial of extract, point at it saying look here, here is what you want, and another one saying dont forget to be careful pouring it in the pipe. The beings seemed happy that I was going to smoke the rest of my salvia, they were awaiting the arrival of it back to their dimension. It was as though smoking it brought the salvia back to salvia space along with me, back to their home. It was actually pretty helpful to have the beings helping me smoke their buddies, cause I was pretty confused as to where I was, nothing in my room looked familiar. By the time It took to get back to my bed, all but a few of the beings were left, I was gonna be sober again soon.",
  "I started to draw from the pipe again, and almost immediately all of the beings came back, including the one I had first talked to, she said hey there again I thought we lost you. I managed to pull off smoking the bowl, and by the time I was drawing my last hit I was already falling back into the vortex. I remembered that I had to do something, but couldnt remember what, then I remembered I had to put the pipe down, which literally took every ounce of effort I had to find the nightstand and put the pipe down. I laid back, I cant remember if my eyes were open or not, it didnt matter at this point. But I slowly started to drift back and down into this vortex. Hundreds and soon thousands of beings were visible. I asked one of them what they were called, one of them responded, Were the workers. I said oh, and he said gestured for me to look around at all of them and their work. It was as though they were the ones responsible for our physical existence. They kept everything stable, running in our world.",
  "I asked several times, Where is she? to different workers, but the older ones said sternly that since I didnt have a question that she didnt have time for me. I was a little upset that I could not see her at first, but the reality of the situation sunk in. Then one of the workers said look, you are a worker too, and youve gotta do your work. For a minute I almost started to panic, because I could not remember where I had come from, I only knew that this worker had just put me to work, doing the task that all of them were doing. Some of the workers around me seemed to be new workers too. They were unsure of what they were doing there the same as me, but older workers reassured us that this is how it was, this is what we had to do.",
  "Then as I started to do my task, I started to realize that this is how it was, this is how I have been, this is where I will be forever. It was the most unsettling and settling thing I had ever experienced. Because somewhere in my mind I knew that I had not been here my whole existence, that I had a life, but other parts of my mind were relieved that I now had a task, a purpose. The very second I let this fact settle in, I started to move faster and further down into the vortex where the workers live. What I saw was like one of those videos you see on TV where they start with a picture of a fly, then zoom out and you see its on an elephant, then it zooms out and you see the whole countryside, the elephant is very small, then it zooms out and you see the whole outline of the coast of Africa, then it zooms out and you see the entire earth, and pretty soon the earth is just another point of light.",
  "I saw the worker I now was on a shelf, with thousands and thousands of rows of other workers, each second seeing more and more rows of them. Pretty soon the rows became indistinguishable and blurred into a bluish grey whizzing thing, that I realized was the side of the vortex that I was falling into (I was laying sideways). I was picking up speed fast, one minute I was doing my job, the next I was flying like a jet down towards the end of this tunnel. As fast as a space ship, as fast as the earth around the sunstill accelerating. It was as though I was moving at the speed the galaxy moves in relation to other galaxies around it at one point. Then in a flash I hit light speed, and everything just stopped.",
  "What happened next really does defy explanation in words alone. I felt what was left of my soul, my self, dissolve like ripples into a still pond into the universe. In one single moment, I became the unbeing. I did not exist. This is the part that I most wish I could put into words, but know I cannot. Coming out of such a place is just as amazing as going inone minute you are the unbeing, you see everything, and the next, you are again. Now instead of being the bottom of the vortex, I could see it again, it was miles and miles across, stretching in all directions. I felt as tiny as an ant as I rose off its surface. I could see waves of life energy rising from it, and lightning bolts of energy all around. It was chaotic down that far in the vortex, and very few workers lived down that far.",
  "I started my journey back up as I realized slowly that this would end. I said my goodbyes to all of the workers I had met and actually gotten to know on my journey down. As I got to the top I said bye to the first workers I had met, working close to the top of the vortex, and in a momentit was all gone. I looked up and saw what I thought should be my room, I was very happy to be able to see again. Only something was offit was not my room, it was the room of another me, in an alternate universe. I started to panic, and it took a few moments to gain my composure and remind myself that I had smoked a lot of salvia. I was still panicky so I went to the computer and said yo to a friend on AIM. He responded, but somehow I thought that he was part of a ploy, he was in on the act, he knew that this was not my reality, and he was trying to trick me. I went and laid back on my bed, I was scared shitless. I thought what will my parents think when they see Im gone, when my friends never see me again. This was momentary however, because I was able to convince myself that I would come further back to reality in a short while. I laid back again and realized that I was still a few feet back from my body, as I had been when I had put down my pipe to start off the journey. In another 2 minutes I was out completely, and although I felt off, I was back to where I am now.",
  "This was without a doubt the most powerful experience of my life, I learned many things that night. I'm sure if I put my mind to it I could write a whole book including all of the ideas and theories that came to my head during this experience, but I think those are best left for everyone to discover on their own. I can honestly say that I find myself happier much more often since I first tripped. Because I know what true fear is, either the fear of a DXM trip gone wrong, or the sobering fear of knowing that I would be a worker the rest of my life. So now I can live my life realizing that I can be happy and appreciate every day Ive got. I hope I was able to entertain you a bit, maybe get some cool visualization going in your head of the events that took place in mine. If you read the whole story, thanks. Cause I feel its important to gain new information about what is available to us, and to be able to make more informed decisions with that information. Take everything in stride, and safe journeys. :)"
 ],
 "erowid": {
  "id": "17743",
  "citation": " What's In A Name. \"Becoming The Unbeing: experience with Salvia divinorum (Extract - 5x) (ID 17743)\". Erowid.org. Jul 18, 2005. erowid.org/exp/17743",
  "substance": "Salvia divinorum (Extract - 5x)",
  "views": "21173"
 }
}
