{
 "title": "Pre-Sleep Hallucination?!?",
 "author": "joshi",
 "citation": " joshi. \"Pre-Sleep Hallucination?!?: experience with GHB (ID 23151)\". Erowid.org. Jun 2, 2003. erowid.org/exp/23151",
 "substance": "GHB",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "GHB"
 ],
 "report": "<p>This experience happened a long time ago, but is so idiosyncratic that I thought I'd write it up nonetheless.  Before I had access to Valium, GHB was the drug I would use when I found myself in a position of NEEDING to go to sleep.  Nota bene: this does NOT AT ALL work with LSD, and one of my least favorite drug experiences was taking enough GHB to kill a horse at the tail end of a seven-hit acid trip and finding myself, without the coordination to speak or move beyond rolling about on my bed, STILL unable to sleep.  (this is in great contrast to the awesome power of diazepam versus LSD, a power much greater and more useful, in my opinion, than any potentially self-destructive 'recreational' use it might have)</p><p>Anyway, at the time of the experience in question, I had been up late at night working on some paper or some assignment, and I had drunk a lot of tea and maybe taken an ephedra to keep me awake, so when I was done with the project, I decided to take some GHB to fall asleep.  I have no idea the actual dose, but it wasn't huge.</p><p>So, I lay down in bed to go to sleep, and pretty soon, the GHB started to work, in a predictable fashion.</p><p>Then something weird happened.</p><p>I found myself confronted with STRONG closed-eye-visuals, of being in a very bright rotating tunnel.  It lacked the beauty and complexity of visuals from some of the real psychedelics, but it was unquestionably there, and bright.</p><p>And now comes the really strange part.  I heard music.  Loud.  Mostly, when I have had the experience of hearing music before I go to sleep (which happens sometimes under the influence of nothing), the music is on the edge of perceptibility.  This music was quite perceptible.</p><p>The music wasn't very good, either.  It was a kind of cheesy-variety downtempo electronica.  I remember distinctly an electric guitar part.  I could sometimes influence the music, like 'I really want a high-hat to come in here,' but it would only work about half the time, and the other half, the piece would just do what it wanted.  This went on for a while, and then the song changed.  The quality of the music was no better, nor was my ability to influence it.  Halfway through the song, the audio started to glitch and hiccup.  I actually stood up to go to the computer to fix whatever was wrong with the playback before realizing that the computer was off.</p><p>I think that this experience is some weird offshoot of a pre-sleep hypnagogic state.  I was totally aware during the whole thing, and in no way did it have the character of most borderline-sleep SWS-1 dreams.  Somehow the GHB caused a very different sleep pattern to emerge -- maybe this was even a form of lucid dreaming?  I'm not sure; it's really at the boundary between psychedelic effect and dream.  Nothing like it has ever happened to me before or since.</p>",
 "year": "2000",
 "id": "23151",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-02T07:00:00.000Z",
 "views": "20887",
 "dose": {}
}
