{
 "id": 2319,
 "title": "Enter The Hyperreality Playhouse",
 "date": {
  "submission": "2002-09-27T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Grail",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This was a whim-of-the-day type of experience. I've done this stuff once before, and only ",
  "My friend mixed up approx. 40mg of Alpha-O Dimethyl Serotonin (as it is sometimes called) into a large container of Ice Tea, then named 'The Administrator'. I took a glass of it (about 5mg or less) then ate a capsule(another 10mg plus or minus 3mg) very soon after a breakfast of an organic egg omlet with mushrooms, green onions, and jalapeno jack cheese. So my day begins (at about 1pm)",
  "Last time I snorted it, but I expected the effect to be slower since injesting it takes longer to get into the bloodstream. I encountered the usual queasy feeling after about an hour, but able to mentally combat the effect for another two hours (at which point I hurled, but not severely, since my breakfast was mostly digested at that point).",
  "Ah, then the hyper-reality truly began.",
  "First I got moving/shimmering shadows. Then I got outright strange visuals (the lemon slice in my icewater appeared to morph into various wicked Giger-esque shapes). I was somewhat nervous, hyper almost, with my legs shaking and all sorts of twitches going on. When the effect was fully on, it was unstoppable. Television was unbearable. I tried reading a bit of Neal Stephenson's Snow Crash, and it seemed to take forever as I pondered the meaning of every sentence construction.",
  "Good think I had a buddy zinging with me, because I almost left to go to an ex-gf's BBQ party (before I was truly into outer space) but we decided that the unreality of the apartment was more than enough and the outside world was simply OUT OF THE QUESTION.",
  "Music listened to: Well, I listen to some scary music and my zinging preferences verge on the 'psychotic paranoid' flavor, rather than the 'trippy happy fun time' mentality. We listened to Neurosis, God Speed You Black Emperor, Sleep, Electric Wizard, and other dark stuff. We took some scary digital camera pics of ourselves, heheh.",
  "We also smoked some kind bud. That helped calm me down, especially after the distress of vomiting: we put in Built to Spill, and my partner remarks, 'This music makes me want to puke!', which I prompty did. Funny pun, right? Ah, never mind. The MJ didn't really change much, just calmed me down a bit.",
  "On the wind down (occuring at approx T+8:00 hrs) we watched 6 straight hours of Pee-Wee's Playhouse on tape. The wind-down was marked by a tremendous headache, which asprin or ibuprofin could cure (though a lot was needed). Like all AMT's, MAO inhibitors should be avoided, such as beer, bananas, and hmm, other things I can't recall. (we didn't have any complaints).",
  "Wow, good conversations, great visuals. The one thing I can say is that I was always aware of how wide my third was open. I even managed to cook a zucchini stir-fry but how I managed to do that without harming myself is unbelievable. Holy shit. At one point my roomate came in and tried talking to us and there was that strange psychological dilemna of 'should we tell her or not?' but in the end we told her and it was still cool (she was drunk).",
  "So like other experience files I've read, I had no dreams when I went to sleep (about 5am), and felt pretty zombie-ish the next day (serotonin levels drained).",
  "Damn, I hope this stuff is never scheduled, but I still will only embark on such a journey once every 3 months or so. Good times should be had in moderation."
 ],
 "erowid": {
  "id": "17754",
  "citation": " Grail. \"Enter The Hyperreality Playhouse: experience with 5meo-AMT (ID 17754)\". Erowid.org. Sep 27, 2002. erowid.org/exp/17754",
  "substance": "5meo-AMT",
  "views": "12024"
 }
}
