{
 "title": "Improperly Dried",
 "author": "JS",
 "citation": " JS. \"Improperly Dried: experience with Mushrooms - P. cubensis & Cannabis (ID 23229)\". Erowid.org. Feb 7, 2006. erowid.org/exp/23229",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "154 lb",
 "report": "<p>First some background info...</p><p>In the summer of 2002 I experienced psilocybin containing mushrooms for the first time, whilst on holiday in Amsterdam. This was a highly enjoyable affair consisting mostly of fits of laughter, colour enhancement & a certain sense of euphoria. In light of the experience I decided I would like to be able to try these mushrooms again once I had returned home, so the group of friends I was with decided to split the cost of a P. Cubensis grow-kit so that we could cultivate a small crop back in England.</p><p>So, about 1 month later the first (and rather disappointing) flush of shrooms were ready for picking, which I stored in a box of rice & salt, with the hope of drying them out until the other flushes had developed.</p><p>After a week or so the 2nd flush had popped up and a friend of mine was having a small social gathering, so it seemed the perfect time to try out our harvest. Unfortunately the specimens I had attempted to dry appeared to have done so in a rather 'dodgy' manner, turning a worryingly dark shade of blue and looking rather unwholesome with it. Nevertheless, I decided that I would ingest these, whilst 3 other friends of mine ('D', 'A' & 'J') split the 60g of fresh mushrooms that had been picked earlier that day. From this point I will describe the evening's events in the form of a timeline in the present tense...</p><p>7:30 - I and a number of others arrive at D's house, and proceed to smoke a number of joints. I am excited about tripping for a 2nd time and so was eager to get on with the evening.</p><p>8:00  - I eat my shrooms in one sitting, the amount of which I estimate to be about 4 grams, but since I have no scales I cannot be sure. They taste vile, largely due the incredibly salty flavour they have acquired during the drying process, but I manage to get the down without too much trouble.</p><p>[I now realise this was somewhat foolish, as was eating any at all, as they were probably actually rotten, but I was (and still am) rather inexperienced in the field of psychedelics and was feeling quite gung-ho about the whole matter.]</p><p>8:30 - Feeling nothing other than the slight remaining effects of the joints smoked earlier, but I realise I have left my food for the evening at R's house and so make a journey over there to retrieve it, much to the concern of R as his parents are in and he fears I may start tripping in front of them.</p><p>8:45 - I arrive back at D's house, not feeling much so I begin to eat my food, but don't get far - I don't feel particularly hungry and am beginning to act slightly silly. I'm getting hints of the effects coming through and my pupils are extremely dilated. 'I'm in for a good time' I think to myself... I then proceed to smoke some more cannabis outside and get the first real effects kick in - as I walk back inside the house the light inside just hit me, I almost hear it rush towards me. At this point I realise that things might get a bit more intense that I was expecting. By now D & J have eaten their fresh mushrooms and are anticipating the effects...</p><p>9:30 - Things are really getting going now - my head is all over the place and I'm having real trouble concentrating. We are sitting in D's living room listening to music but I'm so full of energy I want to go for a walk, so we skin up a few joints and decide to head out. As I get up to leave I nearly walk into a wall - I can't focus at all, so much is going on inside my head I'm almost losing contact with reality at points... Despite all of this I'm feeling extremely adventurous and excited and can't wait to get out, but another friend, M, arrives, with nothing less than a great big ganja plant in his hands. This sends me screaming throughout the house with joy. I'm beginning to get hysterical and slightly delusional. For some reason this plant has lead me to believe that myself and everyone else in this house now have an unlimited supply of cannabis which will last us for the rest of our days. I feel that every aspect of my life is coming together at this one point in time - something very special is happening it seems, although at the time I do not attribute this to the substances I have taken, it seems like fate is taking some very strange twists....</p><p>[As it happens the harvest from that plant was rubbish - no potency at all. Quite funny really...]</p><p>10:00 - 'A' now eats his portion of remaining mushrooms before we all finally leave the house. I'm really tripping hard now and am experiencing some serious delusions. I tell my friends that we should go and get jobs right now, so that we could fly over to Amsterdam. I also seem to think I can go over to Norway so that I can meet my favourite bands, all in this very moment. I run off, causing my friends to become quite worried. They catch up and try and talk some sense to me, but I barely recognise them. Their faces are morphing and sliding, they take on different characters, like actors, even genders become blurred. Words are so utterly confusing, they echo round my head in some infinite loop, which leads me to believe that I have hit some glitch in creation, discovered some sort 'key to existence' and so I run around raving about this revelation. I begin to forget that I've even taken anything, or at least believe that these mushrooms have literally taken me to some 'higher level'.  I doubt the reality of reality. I believe the world is my own creation, everything I've ever known and experienced is a result of my own imagination. I feel rather proud of myself.</p><p>10:45 - I've reached eternal paradise. Or so I think. In reality I'm lying in a bush, eating sticks and I've pissed myself. Passers by notice the commotion and ask my friends what's going on - they tell them that I've had too much to drink and try to move them on. I'm completely oblivious to all of this and am beginning to completely lose touch with reality, moving into a 'Level 5' type trip. I'm dead. Or reborn at least. Flying over some fractal backdrop as my friends drag me back to D's house, my trousers beginning to fall down as I scrape along the concrete.</p><p>11:30 - I'm semi-conscious lying in D's garden. Screaming out the repetitive codes fed to me by some divine being, whilst my limbs flail about, acting out this form of esoteric semaphore. The codex of existence is passing through me.</p><p>Meanwhile, back in the land of the living, A has decided to go home, feeling little to no effects from his dosage. D has vomited and is experiencing some visuals. Everyone is too shaken up to enjoy themselves. They take shifts to look over me.</p><p>??:?? - Entire lifetimes have flashed before my eyes, not just my own but numerous others also. More cryptic messages flow through me, dictating my movements and vocalisations. I am a plant. Cannabis plant. Struggling through various stages of life, growing, evolving, repeating - very symbolic...</p><p>2:00 - I begin to regain lucidity and contact with reality. However, I'm convinced I am in a dream - I try to get into D's house, R tries to stop me. They hide all the knives in the house, unsure of what I might do. I am angry and aggressive, angry at this 'dream'. I feel trapped; unable to awake or return to the divine state I was previously in. I felt contempt for this existence; I feel I am being mocked. I sit in D's living room, in front of the television, with the friends who have not left feeling confused. I don't know where I am, how I got here or how I can get out. I am unsure of who I am, having spent the last few hours without any ego.</p><p>2:30 - I am starting to come to terms with reality again. D asks if I am OK and offers me a glass of water. I grunt out an answer along the lines of 'yeah' and accept the water. I remember eating the mushrooms, but have no idea of what physically to me happened over the last 6 hours, I am left only with the memories of the profound and confusing concepts I experienced. I settle on the idea that I must have passed out, with my experience just being one long dream.</p><p>__________________________</p><p>It was a number of weeks before I fully realised what happened to me that night. It was a truly amazing experience, one that I am grateful to have been through, but not one I would like to repeat, at least, not without some serious preparation beforehand.</p><p>The whole ordeal was also very taxing on the friends who looked after me. Their tolerance of me and the way they dealt with the situation was excellent. I am glad I was in the company of people who managed to keep me out of trouble so well.</p><p>I don't know what caused such intense effects from the dose I took. Perhaps it was larger than I guessed, or perhaps the shrooms were rotten. I know now to take a more caution and care when dosing and to stay clear of any suspect looking fungi.</p><p>Happy Tripping....</p>",
 "year": "2002",
 "id": "23229",
 "gender": "Male",
 "timestamp": "2006-02-07T08:00:00.000Z",
 "views": "8470",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "1": {
   "time": "",
   "amount": " T+ 0:30",
   "administration": "4.0 g",
   "substance": "oral"
  },
  "2": {
   "time": "Mushrooms - P. cubensis",
   "amount": "(dried)",
   "administration": " T+ 1:15",
   "substance": " "
  }
 }
}
