{
 "title": "Uncomfortable and Disoriented",
 "author": "D",
 "citation": " D. \"Uncomfortable and Disoriented: experience with Quetiapine (Seroquel) and Marijuana (ID 23327)\". Erowid.org. Feb 11, 2004. erowid.org/exp/23327",
 "substance": "Quetiapine (Seroquel) and Marijuana",
 "bodyweight": "145 lb",
 "report": "<p>Let me start out by saying that Seroquel - an anti-schizophrenia drug - is NOT fun and is NOT recreational.. so just leave it alone.</p><p>I haven't done a large variety of drugs in the past. I've done alcohol a lot; smoked boatloads of reefer; tried salvia a few times with minimal success; popped hydrocodone, codeine, and tramadol various times. That's about it.</p><p>3 days ago a friend of mine came over to sell me 1/8th oz of pot and mentioned that he had some pills - the Seroquel 200s - that he called a really fun tranquilizer. Another friend I was with at the time said he tried them (at a much lower dosage, which I didn't know at the time) and they were great fun. Usually I research any new drug before I try it, but this time I figured it would be OK because I trust these people.. and that IS A BIG MISTAKE. Even if they are your good friends and wouldn't lie to you, you need to research the drug on your own to see how it could affect you. Those friends might not know what will happen.</p><p>Anyways, I popped one Seroquel 200 and smoked about a 15 sack worth of MJ between me and the three others present. The usual marijuana buzz hit quick, being as I smoked out of a bong this time, and it was very pleasant. About 30-45 minutes into it, I started to feel real sluggish and laughed hysterically. Sometimes I'd laugh so hard at nothing, I'd collpase onto the floor and struggle for air through the laughing. At this time I thought 'Hey, this isn't so bad, I should do it more often' and traded a joint for 3 more of these demon pills. Thank God almighty that I didn't take them then, as a matter of fact I still have them and have no intention of taking them,  because something really bad could have happened.</p><p>About an hour and a half after I had the pill, I felt really tired. But, when I went to lay down, my legs would get restless. So, to try to alleviate the restlessness, I'd get up and walk around. Walking (or even standing or sitting for that matter) caused extreme blood rushes to my head and very fast heart beating and were very VERY uncomfortable. This feeling of restlessness and hypertension persisted for about 8-10 hours. As an attempt to sober up, I took a shower. The shower felt relaxing, but once I got out I was SEVERELY lightheaded. I had to rush into my room and lay in bed to avoid passing out. My vision started to cloud up so I could see just a little bit in the center and the rest was pitch black. I had to lay down for about 20 minutes before this feeling went away. I lied on the couch for the remainder of the day, in and out of sleep, until I went to my bed that night and slept till the morning.</p><p>The next day, the major problems were gone, but I still felt a little disoriented and detached all day. Today, 3 days later, I still feel slightly detached, but overall I'm back to normal.</p><p>So, bottom line here folks, always research any new drug before trying it - EVEN if your friends say the drug is OK and never EVER take Seroquel thinking it will give you a fun buzz, because all it does is make you feel like crap for a day. I learned my lesson the hard way, but at least I learned it.</p>",
 "year": "2003",
 "id": "23327",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-11T08:00:00.000Z",
 "views": "53360",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(pill / tablet)"
  }
 }
}
