{
 "title": "Excellent Concentration Aid...",
 "author": "ozjono",
 "citation": " ozjono. \"Excellent Concentration Aid...: experience with Modafinil (ID 23322)\". Erowid.org. Jun 30, 2003. erowid.org/exp/23322",
 "substance": "Modafinil",
 "bodyweight": "135 lb",
 "report": "<p>Ive recently been prescribed Modavigil as an experimental treatment to aid the symptoms of Chronic Fatigue syndrome from which I suffer. Anyone who suffers CFS would know the terrible symptoms of brain-fog in particular which can make concentrating and mental tasks extremely difficult. Modafinil seems to be able to help in this area, but Ive had varied experiences, and this drug seems to have few peculiarities.</p><p>It takes about 2 hours to kick in from my experience.</p><p>The first time I took an oral dose of 100mg at 9:00am and by about 11:00am I felt like I had taken 20mg of dexamphetamines or something similar. I am generally fairly sensitive to the effects of stimulants, so this might not be the same as that of other people. My mood was elevated markedly, I couldnt wipe the smile from my face, I felt an increase in confidence, and the urge to talk to people. On arriving at a university lecture I found I was able to devote my unabated attention to a 2 hour property law lecture, something I would have normally found impossible.</p><p>The next few times produced similar effects, which became more subtle after about the 5th time of taking it. Now I no longer come close to experiencing the dexamphetamine-like effects of the first dose. The enhanced concntration abilities, mental focus and wide awake feel still occur, however.</p><p>Generally it provides a nice level of stimulation. It's a wide-awake sort of feel without any edginess or motor stimulation. It doesn't really have recreational value that I can see, but is definitely a good aid to concentration and mental tasks. Ive found that it not only makes concentration easier, but one feels almost motivated to do intellectually stimulating tasks like university work.</p><p>The only side effects I've experienced is a difficulty sleeping on occasions when I've taken a second 'booster' dose too late in the afternoon, (although I have gotten to sleep eventually after some tossing and turning) and a mild to moderate headache on other occasions.</p><p>As a drug in aiding someone pulling an all nighter, or to increase concentration and mental focus, especially in a sleep-deprived situation, modafinil would probably prove an excellent substance. Recreationally, however, I can't see it having much value.</p>",
 "year": "2003",
 "id": "23322",
 "gender": "Male",
 "timestamp": "2003-06-30T07:00:00.000Z",
 "views": "22754",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 }
}
