{
 "id": 2335,
 "title": "Timewarp dream back to childhood",
 "date": {
  "submission": "2004-02-20T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Monkeyboy",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "We were studying consciousness in my psychology class and how dreams and drugs (especially hallucinogens) can enhance your perspective of the world.  I was interested in trying salvia to experience the way that it would shift my perspective.  I was not disappointed at all.",
  "The living room was a comfortable 80 degrees and well lit by the light behind me.  My friend packed about half a bowl of the leaves in an ice bong.  I took the bong and sat on the right side of the couch.  I tried to relax and get comfortable among the pillows because one of my roommates warned about the mystical 'push' that salvia can do to your body.  I took two big hits to smoke the leaves.  I held both of them in my lungs as long as I could and then as I exhaled during the second hit I felt my body get heavy.  I felt my head kinda float as my vision became cloudy like walking through a heavy rainstorm.  Then I could feel as if my body were being pushed from my left side by a giant 'fence' of chicken wire that seemed to mold to the contours of my body and all over my face. ",
  "It was almost as if I were caught in a dream, but I was awake and my eyes were open.  I started to piece together everything in the room.  It was like my brain was trying to make sense of everything my senses could pick up.  My friends were talking and I saw visions of them as other people I knew in my life.  I saw my two best guy friends molded into cosmic replicas of my dad and brother.  Then my friend's girlfriend was in the room and she molded into a replica of my mom.  It was like I had been transported back to when I was a young boy with my family.  Then I 'sensed' answers to questions that I pondered, like how relationships work (with friends, loved ones, and myself) and I began to piece together the puzzle of many questions in my head.  My perspective then shifted into a more consciously awake feeling as I started to wake up from my dream-like state.  My vision started to blur into thousands of tiny geometric shapes like the Legos I used to play with as a kid or a video game puzzle like Tetris or a similar game.  Then I kinda 'fell' back into reality as if I had jumped off of small cliff and landed back on the couch.  This all occured probably within 2-3 minutes.",
  " I felt very tired and groggy, so I decided to lay down on my bed and play some music.  I put on some Pink Floyd and some Incubus.  I kinda drifted off in a state of meditation and I felt as if the music penetrated my soul.  The words and melodies floated through my head as if I were watching the words appear before me.  After about an hour of this I returned to baseline."
 ],
 "erowid": {
  "id": "17816",
  "citation": " Monkeyboy. \"Timewarp dream back to childhood: experience with Salvia divinorum (5X dried leaves) (ID 17816)\". Erowid.org. Feb 20, 2004. erowid.org/exp/17816",
  "substance": "Salvia divinorum (5X dried leaves)",
  "views": "4312"
 }
}
