{
 "title": "Me and Mary Jane ...",
 "author": "MileHighGuy",
 "citation": " MileHighGuy. \"Me and Mary Jane ...: experience with Cannabis (ID 23418)\". Erowid.org. Mar 13, 2008. erowid.org/exp/23418",
 "substance": "Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>I thought I would relate to anyone who will listen, the Journey I have been on with Mary Jane.  Let me start from the beginning, before the summer of '02, I had hardly experimented with any drug, excluding alcohol, not due to lack of desire, but lack of avalability.  I had a duplicitous reputation around my school of being both a 'brain' and the 'alcohol guy', needless to say this led to an interesting combination of friends.  However, I never really enjoyed drinking, it was only something I did to be social. </p><p>What I had always quested after was knowledge and experience, and alcohol could only take me so far down this road, I wanted the real stuff, the meat and potatoes, the hallucinogens.  Then, in early July, opportunity came knocking on my door, in the form of a portly jewish boy turned buddhist.  We had been friends in the past, attending the same elementary and middle school, but he had moved to the mountains for a more suting lifestyle, but I digress.  He gave me the perfect opportunity to breach into the drug subculture. </p><p>I found quickly that marijuana can be a 'gateway drug,' if that is your intention for it.  I smoked daily, up to 1/4 oz. This, again, was not so much that I enjoyed it( not to say I didn't, in fact I did thuroughly), it was more of a tool to meet new people with connections to what I was really wanted, and soon was experimenting in all sorts of hallucinogens, from mushrooms to mescaline, from LSD to AMT, exploring a vast new realm of consciousness, all the time continuing heavy use of Cannabis.  Soon however, this came to a screeching end. </p><p>One cold day in early January, a friend and I were warming ourselves over a nice bowl when it hit me, like a ton of bricks, I felt my brain slow down to the point where I couldn't formulate a thought for the life of me, I wasn't even able to speak, hardly move, luckily, I was with one of my experience tripster friends, and rather than freaking out and calling my parents, he wisely helped me lay down( I couldn't myself) and let me be until morning, When I woke, I was cognative again, but still felt slow, we talked over my experience and we bth concluded we'd never seen anything like it before. </p><p>I decided to give it a rest for a week then try again, same results, but to a lesser extent, I was able to function, but could not keep conversation, or concentrate on driving, I asked a friend to drive me home an once again I slept it off.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] After this, my body has never reacted to Mary Jane in the same way, I have attempted smoking 2 since then, both times having similar results. </p><p>Whatever this is has affected my use of other drugs as well.  I recently tried some mushrooms, but rather than the normal blissful state with wonderful hallucinoges, I had a violent reaction, My skin turned a pale yellow, and I shortly passed out. I would normally attribute this to bad boomers and forget it, but me and my friend had shared the same 1/2 oz.  When I try to relate these experiences to other, they seem not to understand, or perhaps they are simply not interested. </p><p>I have now shifted my pursuit for knowledge to meditation and other such methods of enlightenment.  If you have read this far, I hope my story has showed something to you, and if there is anyone who has had even a vaugely similar experience, I feel your pain, and know that function does return, slowly, after 2 months of sobriety, I am recovering, and although I am not back to my oiginal capacity, I am close, and feel I will be completely restored within the next month, and hope to soon surpass this with my my new meditational practices.</p>",
 "year": "2003",
 "id": "23418",
 "gender": "Male",
 "timestamp": "2008-03-13T07:00:00.000Z",
 "views": "3541",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
