{
 "title": "Magical World of Dragons and Lore",
 "author": "Morgan",
 "citation": " Morgan. \"Magical World of Dragons and Lore: experience with Mushrooms & Cannabis (ID 23423)\". Erowid.org. Apr 11, 2007. erowid.org/exp/23423",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  " ",
  "smoked",
  "Cannabis",
  " T+ 0:30",
  "3.0 g",
  "oral",
  "Mushrooms"
 ],
 "report": "<p>Before trying shrooms for the first time, I had been smoking pot actively for a few years and had one month previously tried LSD.  Having negative to no effects from the acid I took, I decided to try shrooms.  Me and 4 friends took them together, me the only first timer. They all had an 1/8 to themselves and pinched a little from each of theirs to give to me, an equal amount for us all. About 30 minutes prior to eating the shrooms, we had smoked a couple of good bowls of pot.  I ate the shrooms straight and returned to my room to play video games.</p><p>For the first half hour I had a feeling of anxiety (yet much calmer than on acid) and the computer game seemed to take my mind off it. Then I started to notice my visuals were dragging, like a video camera on a slow shutter speed.  After awhile of adventuring in a non-linear path, I started to lose interest in the game and I suddenly noticed that my room was filled with people.</p><p>I felt very relaxed and more easy going than normal.  I began to close my eyes and witness the closed eyed visuals my friends had told me about.  My roommate (also on shrooms) wanted to leave the room, saying he felt trapped (it's a small room).  I laughed hysterically at this, my laugh sounding different.   I ventured into another room where I sat in a plastic box for some time talking casualy to people, often echoing my own words.  Somone started playing Prodigy and I felt as though the whole room would flux and shake with every heavy bass beat.  At this point we headed outside.</p><p>From this point on I started a new found respect for nature.  Trees, plants and people just seemed to glow and move in a whole new way.  I felt as though I was in a perfect harmony, respecting everything and everyone's views.  Usually I'm a bit of an introvert, but I was meeting everyone I saw and having lucrative conversations.  People I had somewhat knew I began to formally introduce myself to.  I spent alot of time watching some plants sway in the wind and often became speachless when I tried to describe what I was feeling. </p><p>Me and my friend then went and sat in my car, turning on the heat and putting on some Radiohead, about 40 minutes after I started tripping.  I knew I couldn't drive, but the combinations of the street lights, my car's windsheild defrosting and 'Everything in its right Place' made for the most intense visuals I had during the night.  I dared not blink and became enthralled. My friend remarked that my eyes were watering 'like crazy' and my pupils were very dialated.  Me and a group of friends then embarked on an adventure through my college's beautiful campus.</p><p>I was qouted as saying 'We live in a magical world of dragons and lore'.  My friend and I had many deep talks on several topics, recurring themes being 'Why are we here?' 'What do people normally do?' and 'Isn't this totally awesome?'. Then we stumbled upon an area that was straight out of Narnia.  We sparked a bowl, and I had reached possibly the best high of my life.  I was perfectly relaxed but at the same time somewhat anxious.  The trip began to wear off about 25 minutes later, a total of about 4 hours of straight tripping. </p><p>That was my first time really tripping and I enjoyed every second of it.  My friends who had already done it said this wasn't so much of a visual trip like their last times. I can't really explain how I felt, I can't even remember the feeling all the way.  But if you have the chance to feel what I felt, I would highly advise you consider Mushrooms.</p>",
 "year": "2003",
 "id": "23423",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-11T07:00:00.000Z",
 "views": "3029",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 }
}
