{
 "title": "Bizarre Combinations",
 "author": "Liz",
 "citation": " Liz. \"Bizarre Combinations: experience with Amphetamines (Adderall), Alcohol, Opium & Cannabis (ID 23446)\". Erowid.org. Oct 3, 2007. erowid.org/exp/23446",
 "substance": "Amphetamines (Adderall), Alcohol, Opium & Cannabis",
 "bodyweight": "127 lb",
 "report": "<p>Living outside of a small town during a particularly snowy winter brought rise to many of experiences quite possibly due to boredom.  To be completely honest, I'm always willing to try new things, but I never took multiple drugs at once.  Granted, marijuana and alcohol are not the most impressive drugs, yet the effect I had during the one evening is probably unlike anything I had ever tried.</p><p>A friend had bought a liter of vodka, and because alcohol is simply a favorite of mine, I couldn't resist the occassion.  Despite the fact I 'regularly' drink, typically once every weekend, the experience I encountered that evening was a first.  It was no later than 9:30 at night when I arrived at the house.  Before we even took one sip of the vodka, my friend offered me an adderol pill, which can basically be equivolated with speed.  I never tried it before and therefore I was a bit anxious upon taking it.</p><p>After we had just began to drink, I was beginning to feel a buzz, yet I also felt much more alive and stimulated.  I only had approximately 4-5 shots, or possibly a bit less--it was enough alcohol that I was able to feel 'the giggles' but I wasn't absolutely tanked.  On a normal basis, I probably would have drank more, but the adderol made me feel as though I had just eaten a thanksgiving dinner.  Our friends made a routine stop at the house we were staying at, and we decide that it would be fun to go on a ride and smoke some pot.  At this point, it had to have been an hour since we started to drink, and an hour and a half since the adderol.  I had actually began to feel extremely social, an affect from alcohol I tend to rarely get.  My mindset that evening, in addition, was not particularly outstanding; it was simply an end to a rather tiring day.  On the contrary, the last thing on my mind at the moment was sleeping.</p><p>After we jumped in the car and packed the bowl, my friend and I were talking to these two people who picked us up as though they weren't even there.  It was very odd--but I believe the adderol just made us extremely hyper.  Naturally, I smoked on a regular basis, but I simply was too apprehensive to ever try it with opium.  Yet my friends tried it before, and they claimed it was a good experience, so I decided that it was a possibility that I enjoy it as well.  Perhaps I just have an extremely weak tolerance, but I am a slender female, and from just smoking a bowl is enough to get me stoned.  So after two bowls of this marijuana sprinkled with opium, I began to feel something unbelievable.  The alcohol and the marijuana alone might have made me pass out.</p><p>It is extremely unlike me to have energy even while drinking.  I tend to be a rather depressive person when I am on substances.  Therefore this experience was entirely new.  Once I began to feel the opium kick in, I could have just chilled all night in that car, smiling up at the stars.  I have never before been in such a clear state of mind.  Ideas were flowing through my head, the most obscure ideas.  I believe the opium just made my body completely at ease.  I certainly did not experience a bad high at all because the regular paranoia of simply marijuana had been entirely eliminated.</p><p>To feel the enhanced humor from the alcohol and the rate of time completely slowed from the marijuana, along with throwing in adderol and opium, made my body feel so weightless.  Every step I took on the snow-covered grass left an imprint on my shoe, and the sound of myself breathing in the cold air was all the entertainment I needed to suffice.  My vision was a bit in slow motion, yet all of the noises were definitely enhanced.  I sat in the car talking about useless information, yet I payed no attention to the sound of my own voice, but to the sound of the motor running in the car.  It actually startled me to know that I had no idea what I was saying, nor that I could remember what I had just said.  Ironically, because everything had slowed down visually, I was analyzing nearly everything in my brain, and I was spilling all of my thoughts out loud.</p><p>My friend made some unbelievable statements that I shall never forget because they are so wild and almost revolutionary.  However, I regret to say that I had completely lost track of time.  The whole experience is simply so jumbled; parts are missing, other parts are completely enhanced.  In fact, had it not been for the fact that once we were back at the house we had written down these statements she made, I probably would have forgotten them by the morning.  One of the more noticable qualities of the experience that stood out in my mind is when I finally checked the clock, it was around 4 o'clock in the morning, and the effects of the night were finally beginning to wear down.  At that point I nearly collapsed into bed.  My night came to an absolutely abrupt end, yet from the things I can manage to remember, it was quite the experience.</p>",
 "year": "2003",
 "id": "23446",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-10-03T07:00:00.000Z",
 "views": "11298",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "4 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Opium",
   "form": "(tar / resin)"
  }
 }
}
