{
 "id": 235,
 "title": "In Morning Glory Heaven",
 "date": {
  "submission": "2001-01-06T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Ipomea_71",
  "weight": "235 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "550 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I have been doing research on Erowid and other related sites for the past few months on alternative highs.  I have recently come under suspicion of using drugs at my place of work and am now liable to be submitted to random drug tests.  This makes my usual favorites (weed, cocaine, ecstasy, opium) not safe to consume, under threat of ruining my life.  So, I decided to bone up on my plants, read some Castenada books and find the stuff that made the Indians get high. ",
  "After much deliberation, my friend and I decided to buy some Morning Glory seeds from a store.  We got twenty packs, about $35, some Heavenly Blue, some Flying Saucer, and a couple of mixed packs.  Each pack contained from 50-60 seeds in it so me and my buddy split the sacks 10 & 10 and we washed all of the seeds.  We were becoming lazy in our preparation so we used some body wash to clean them that didn't thoroughly rinse out. ",
  "Down the old hatches they went, we each consumed between 500-600 seeds that tasted slightly soapy.  Almost immediately we felt a kind of soreness in our jaws.  We didn't crush the seeds, just chewed them and swallowed.  Within 45 minutes to an hour we felt queasy, not to the point of vomiting but definitely uncomfortable.  My friend ate a full meal and said that helped the queasy feeling.  I, on the other hand, did not feel like I could eat and probably suffered more because of it.  After about another hour or so the nausea was gone and all that was left was a feeling of melting.  Walking became effortless and the ground had a spongy quality to it that made sinking into it a definite option.",
  "The peak didn't arrive until 4 hours after ingestion!  This was great because the high was not unpleasant or too intense to maintain.  I mean to say it wasn't LSD intense, coming in waves of surreal tsunamis.  Instead the seeds seemed to maintain a constant 'pressure' on us and not wean or drop until after the peak.  The visuals were mostly melters for me, but my friend had dramatic, but pleasant, hallucinations that weren't as fragile as pscilocybin ones.",
  "Along with the melting sensation came a sensation of rotation around some unseen axis, or a kind of stretching around a circle.  It was comparable to the feeling of being dropped suddenly, but gently, from a high place, like on the first hill of a roller coaster. ",
  "It is impossible to explain all of the effects I and my friend felt.  Along with the physical and visual effects was a great mental exploration, comparable to LSD but not as frantic.  I acquired an ability on my trip to wrap my mind around things like on acid but not so rushed, or not as nervous as on mushrooms.  All in all, a very relaxed trip, but still, it took a great deal of work to get through it.",
  "My suggestion to those who wish to try MG seeds is to try to find a natural retailer of them.  The store- bought seeds are expensive and they are covered with pesticides and things to make foolish people puke.  If you do buy them from the store don't make the mistake I did and use a harsh 'sticky' soap, use a light detergent of some kind and RINSE THOROUGHLY.  This was probably why we got nauseous - we still had soap on the seeds when we ate them.  I just ordered a pound of Heavenly Blues from a retailer out in California.  I estimate that a pound of seeds will probably facilitate 50 trips or more."
 ],
 "erowid": {
  "id": "1028",
  "citation": " Ipomea_71. \"In Morning Glory Heaven: experience with Morning Glory Seeds (ID 1028)\". Erowid.org. Jan 6, 2001. erowid.org/exp/1028",
  "substance": "Morning Glory Seeds",
  "views": "11511"
 }
}
