{
 "id": 2352,
 "title": "A Glimpse of Infinite Wisdom",
 "date": {
  "submission": "2000-06-14T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Anonymous",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>Tonight I had an experience which was so anomalous as to provoke mention. To be sure, a water pipe had been passed around before I arrived home. But before you dismiss it on the basis of my intoxication, consider that this still begs the question of where *any* experience comes from. We are made of experiences, and this is one of them.",
  "To be precise, I had two bong hits at a friend's house. I was on my way home anyway, and though I don't enjoy smoking in public, there seemed no harm in this case. 'I'll just have a little,' I thought. Well, it soon became clear that I was very stoned indeed, so I took my leave and headed home. Thereafter I was treated to the most spectacular display of neurochemistry I have ever witnessed.",
  "I was seated, cross-legged, on my couch. Falling easily into a state of deep relaxation, I became tightly focused on the present, on the origin of thought. I thought of the Buddha, of the meaning of 'infinite wisdom'. There was jazz playing downstairs at the cafe below. Filtering through the floorboards, it became muffled, and distorted. I stared ahead, unmoving. My mind continued to focus. The pitch of the ambient noise began to rise, blending into a hum which sounded like an engine starting up within me.",
  "Whether I saw what was coming or not, I cannot recall. But I think it was a _gradual_ thing. Let's say it was a *fractal* thing, the most gradual of all! That is to say, there was a progression, but it did seem to happen rather quickly, the more I realized what was going on.",
  "Most people don't ask for Enlightenment, and many others never get it. Maybe someday I'll understand. But this experience made a mark on me, however small and briefly lingering. I have had ecstasies of a simliar nature, but in degree so much less than this, in _awareness_ so much less!",
  "For a single instant, one trilling and triumphant moment, I pierced what Blake might have called 'the Mundane Shell.' I saw shapes swimming in a field of neon bands, surging with the colors of Africa. I saw the world before my eyes through the alchemical crystal, revealed, at once, in its simultaneous compelxity and simplicity. My third eye must have blinked. But only a glimpse -- and then, a ripple, a slackening of intensity, and the moment was lost.",
  "But now, my fancy played with reflections of the infinite. Billowing fractals loomed up, flowing towards the s5n which lit the sea floor. They were like whales, ponderous and silent, speaking their own strange language, watching. In slow steps threafter my concentration dissipated. Soon I sat forward, exhausted. I wondered what had just happened to me.",
  "Yet there was so much more, now forgotten! In the period that followed there seemed to be a cycling of stimulation, so that now I was privy to visions of transcendant beauty and magnitude, then sequeing into a linguistic phase, and then a musical one, then a 'waking' moment, and back again. (I cannot recall the actual order.) I remember lying on my bed in darkness, and seeing myself broken and surrendered on an alien world, beneath a sweep of galactic vastness. Planets, huge and crowding, peeked from dusty nebulae, and a sort of twisting neon grid seemed to stretch across the immensity above. Then came the chanting: Sanskrit poetry in rhythmic cadence, rhyming syllables of beauty and power. This too gave way, and I heard poetry, English poetry! A voice in my head, reciting poetry as I listened in joy, and tried in vain to remember...",
  "This was the most intense visionary experience I have ever had. And all from a humble green vegetable.</p>"
 ],
 "erowid": {
  "id": "1787",
  "citation": " Anonymous. \"A Glimpse of Infinite Wisdom: experience with Cannabis (ID 1787)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1787",
  "substance": "Cannabis",
  "views": "71670"
 }
}
