{
 "title": "Turned Bright Red",
 "author": "Ellis Dee",
 "citation": " Ellis Dee. \"Turned Bright Red: experience with Anandenanthera spp. (ID 23522)\". Erowid.org. Jul 16, 2003. erowid.org/exp/23522",
 "substance": "Anandenanthera spp.",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "4 seeds",
  "insufflated",
  "Anadenanthera spp.",
  "(ground / crushed)"
 ],
 "report": "<p>[Erowid Note: The term 'yopo' is traditionally used in reference to Anadenanthera peregrina. Recently many people have started using it to refer to both A. peregrina AND A. colubrina. This report specified only 'yopo' so we do not know the exact identity of the seeds used.]</p><p>I have heard few positive experiences with this perticular substance, but curiousity got the best of me and i had to try it for myself. 4 seeds were heated in an oven until popping. Seeds were then crushed until powder fine and mixed with cigarette ashes. Material was then broken into about 5 inch sized lines and snorted. Let me tell you these little fuckers burn like hell. About a minute later i could feel it come on. I got extremely pukey and eventually had to expell the contents of my stomach (wonder if marijuana would help this).</p><p>I decided to get a shower because i felt considerably 'dirty', and upon removing my clothes i noticed that my whole body had turned bright red (I know these seeds have lots of bufotenine in them and think that could account for the redness because of the bufotenine entry on TiHKAL states that Shulgins face had turned red). By now (probly around T+5 minutes) the trip had progressed quite nicley, I was experiencing a very foreign body high (much like LSD) and had some pretty decent visual activity. Visuals seemed to start off closed eyed as hundreds of different colored wavy twisty lines, and eventually the lines could be seen with eyes opened. In about a half hour i was close to baseline, but could feel a slight 'hangover' for about 2 hours after the experience. The experience wasnt great but where i come from LSD and mushrooms are hard to find so i will more then liekly do this again.</p>",
 "year": "2003",
 "id": "23522",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-16T07:00:00.000Z",
 "views": "11074",
 "dose": {}
}
