{
 "title": "A Year of Usage",
 "author": "Golden Calm",
 "citation": " Golden Calm. \"A Year of Usage: experience with Triazolam (Halcion) (ID 23531)\". Erowid.org. Feb 10, 2004. erowid.org/exp/23531",
 "substance": "Triazolam (Halcion)",
 "bodyweight": "140 lb",
 "report": "<p>I don't know how many people will be cruising over to the triazolam section of erowid, given the vast quantity of way more interesting things, but I did. So I might as well give an account of my experience with this drug. Sorry if this is overly long, but there aren't any other reports here and I don't want any visitors to be disappointed with my description.</p><p>My first experience with benzodiazepines was with valium, in doses up to 40 mg. For those who don't know, 40mg will induce confusion and amnesia. Luckily, it won't bother you at the time. 10 or 20 mg MAX is my recommended dosage for valium, but this is a side topic.</p><p>Valium might be considered recreational. However, I would not recommend that you take Halcion before you go to a party. It is too gentle of a drug to be recreational, and higher doses make you forget things. Its soft nature is what makes it so great for sleeping.</p><p>Most of the literature groups Halcion along with other sleep aids like Ambien (which is the devil, IMHO) by saying that it should not be taken for more than two weeks, or addiction will occur. This may well be true generally, but I have been taking Halcion for about a year now, with no signs of addiction. At one point, after three months of nightly usage, I quit cold turkey without any of the ill effects described in the literature - hallucinations, chills, or some such nonsense.</p><p>On another side note, during this month off halcion (when I simply hoarded my pills) I used capsules of Valerian root with melatonin, with great success. I still use them now, at doses of about 1 gram Valerian and 6 to 9 mg melatonin.</p><p>However, valerian simply cannot compare to the gentle, yet powerful, sedative entity that is Halcion. Halcyon is a word that means:</p><p>'A fabled bird, identified with the kingfisher, that was supposed to have had the power to calm the wind and the waves while it nested on the sea during the winter solstice.'  or a golden feeling of calm.</p><p>I take the pill, and while I lie in bed reading, I suddenly yawn and feel a gentle calm wash over me. It is so subtle and magical, it is barely discernible from that delicious feeling when you are pleasantly tired, and stretch out your legs before you go to sleep. It is not a 'knock-out pill'. It is the noble kingfisher that calms your mind and eases you into a wonderful snooze.</p><p>And, this drug does not last 6 to 8 hours like most sleeping pills. It lasts about 2 hours. Halcion puts you to sleep, then leaves you so you can enjoy your rest. It does not seem to have any effect on dream states. Coupled with melatonin it should produce an almost natural sleep without many side effects.</p><p>On a more recreational note, this drug works very well up the nose. Halcion fits into my general assumption that the 'little drugs' -those that are measured in small doses and are small pills, such as Ritalin and Demerol - are effective intranasally.</p><p>The pills are relatively small - .25 mg being about 7 mm by 4 mm - and the golden colored powder simply disappears up the nose. Little nasal drip, and what does reach my tongue doesn't taste bad.</p><p>Effects begin within a few minutes. Subtle, good feeling. The halcyon calm steals over my mind a bit faster, but interestingly, I don't feel as tired. Of course, if I lay down I fall right asleep. But if I stay awake, objects take on a slightly golden tint and make me happier to look at.</p><p>Insufflated effects (for me) begin at .125mg, but this might be because I've never tried anything less than that. I have snorted up to 3 pills at once. Or was it 4? I can't remember, and that's the point. Any dosage above about 2 pills, or .5 mg, causes amnesia. It is a very odd sort of amnesia, similar to but milder than valium. I can remember certain parts of what I have done, but everything else is hazy or blank. I can remember important things, like if I did something crazy, but anything mundane (like talking to people or reading a book) is gone. While under the influence of large dosages, I feel the need to tinker with things and create weird shit.</p><p>For example, one night I snorted .25 mg to go to sleep. I wandered around for a bit too long, and made the mistake of thinking I wasn't tired yet. By the way, Halcion twists your thinking process. Anyways, I snorted another pill. And a half. I was up until 3 AM, meticulously counting my large supply of Ritalin until I proceeded to crush 30 of them (300 mg), mix them with water, and put them in my empty Afrin nasal pump spray bottle. My golden-calmed mind didn't bother to consider the fillers that make up most of the pills, and which clogged up the spray pump. All this while half-naked. I eventually realized the stupidity of my ways and laid down to let the kingfisher whisk me away to sleepland.</p><p>In summary, for me Halcion is an amazing sleep aid with few side effects or addiction potential, when used in a responsible manner. I must admit that the golden sleep is very psychologically addicting. The drug's subtle effects and short duration make it a much better choice for me than more popular sleep-aids, such as Ambien, which last a long time and can cause amnesia simply by waking up while they are working. The kingfisher is a beautiful and gentle chemical ally. I highly reccomend him.</p>",
 "year": "2003",
 "id": "23531",
 "gender": "Male",
 "timestamp": "2004-02-10T08:00:00.000Z",
 "views": "29969",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Triazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Pharms - Triazolam",
   "form": "(ground / crushed)"
  }
 ]
}
