{
 "title": "Philosophy or Insanity",
 "author": "Steve S.",
 "citation": " Steve S.. \"Philosophy or Insanity: experience with Mushrooms - P. tampanensis (ID 23540)\". Erowid.org. May 4, 2007. erowid.org/exp/23540",
 "substance": "Mushrooms - P. tampanensis",
 "bodyweight": "165 lb",
 "report": "<p>We considered ourselves experienced mushrooms trippers, living in Ireland where they grow wild we had tried many different kinds of 'shrooms at varying and often crazy doses but nothing could have prepared me for this. We aquired a quantity of these truffle funghii (Philosophers Stones,or Tampenssis) sufficient for 5 people to take a double dose. Twice the recommened dose would have been no big deal if the mushrooms were liberty caps or cubensis. Myself and 4 friends decided that the best way to experiance these 'shrooms would be to camp out in complete isolation in the mountains.</p><p>We chose our location right down in a valley surrounded by indiginous woodland with steep mountains towering down on us, it was an awe inspiring location. We knew a mix of lanscapes and textures would add to the intensity of the trip, so we camped right by a river close to a small elevation with an amazing view. We had left well prepared with about 8cans of beer per person, and a big bag of high grade homegrown bud. I should probably mention now that we touched neither of these intoxicants, we didn't need to.</p><p>We ate the truffles and waited.</p><p>Within 30mins I felt like I was coming up, hard and strong. it was an overwhelming feeling. Soon after the converstaion between us dried up as every person drifted off into their own world. Without thinking I wandered off into the woods, I felt like something was calling me.I felt incredibly anxious, but when a tree in my path stopped me and began giving me advice on where I was going wrong in life my anxiety ceased. I had a two way conversation with the tree and soon a collection of granite rocks that were near by added to the conversation. I was told to close my eyes.</p><p>When I closed my eyes I was vividly recollecting scenes in my life with those who were closest to me, and I also had vivid recollections of a great friend who had died a few years ago.The voices of the tree and the rocks narrated over these scenes in such a way as to remind me of how lucky I was to have and to have had such great people in my life.When I reopened my eyes I realised I was lying on the ground and was wrapped around the tree. By this time I was experiancing intense open eye visuals.I had no sense of how long I had been there, and I didn't care.I spent a while gazing at the sky, where the stars seemed to be dancing for me. I then saw a plane flying quite low, this reminder of technology and the modern world gave me a nasty jolt. I then thought I saw a helicopter, and  it was coming for me. I was convinced that it was chasing me, so I hid until the lights had passed over me. I felt immense relief when I knew I was alone again.</p><p>I thought that I should better get back to our camp site. When I returned everyone else was still there, and the scene had become a bit manic. Conversations were making no sense, and the extremely loud music that was playing on our ghetto blaster convinced me that we were pissing off whatever authority it is that rules nature and the universe. My anxiety began to resurface.I informed everyone that the isolation situation goes down a treat on these mushrooms. By now the moon and the stars looked fake and I felt as if we were in some sort of Truman show situation. Tree branches seemed to move like limbs and each tree somehow had its own personality.Leaving everyone else to go and find their own piece of tranquility myself and my friend Duke remanined at base camp. At one time Duke stood still for about ten minutes and didn't utter a word or move a limb. Something jolted him and he awoke with a sense of euphoria, as he was alive. In his trance state he had convinced himself that he was dead. We then discussed the possibility that we had taken too much.</p><p>A while later my trip reached a different state. The sky looked as if the earth was being pulled into some sort of worm hole, and I became convinced that the world was going to end. I could hear a roaring noise in the distance and I felt the fear of god in me.My anxiety passed and I soon felt that if the world was going to end then what the hell, I had had a privilaged and full existance. This sent me into a spiral of thought reaching into my inner consciousness. I decided that if the earth survived I would be less selfish, I would give these crazy drugs a rest and I would sort my life out. The laughter of the others returning from there nature walk awoke me and I felt almost reborn. I was happy and the anxiety was gone. The entire scene looked indescribably tranquil.</p><p>Myself and Dukes' inner trip was followed by about two hours of constant laughter and hilerious catch phrases. Just the art of conversation seemed hilerious.We then realised that we hadn't touched our supplies. We all wanted to smoke a few joints but I was so uncoordinated that I couldn't even open a can. No drug has ever made me so uncoordinated. After much bumbling about we managed to smoke a coulple of joints and then it was time to retire from the madness of the night. We lay back and stared at the sky, the visuals were continuing but were all pleasent and pallatable.The scenery looked amazing in the moonlight, and soon the morning fog began to rise off the valley floor, just as the moon was setting behind the sheer mountain face. We talked deep and meaningful but we were happy.</p><p>I could write a book about that night and all the thoughts and realisations that occured to me but I think this is sufficient to give people an idea of what it was like. We each had our own trip, some more intense than others. The next morning despite the fact that I felt mildy sick I felt incredibly happy. We spent the morning smoking joints in the sunshine, recanting tales of what happened inside each persons mind the night before. There was no come down and the next day that reborn feeling remained with me. The trip lasted about eight hours though I have no idea of the timeframe, and to me wasn't comparable to anything I had done before. One thing that strikes me is the incredible vividness of my memory of the trip.I had taken these truffles several times before but the increased quantity caused them to take on a completely different character.</p><p>I wouldn't openly recommend anyone to do this dose but I was extremely bored with life, and now I'm not, so it was a positive experience, despite the rollercoster character of the trip.I'm not big on class A drugs, I don't really like them so the experianced narc. users out there might scoff at such an experiance, but I do consider myself a psychonaut and this was my biggest trip.</p>",
 "year": "2003",
 "id": "23540",
 "gender": "Male",
 "timestamp": "2007-05-04T07:00:00.000Z",
 "views": "3648",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 g",
   "administration": "oral",
   "substance": "Mushrooms - P. tampanensis",
   "form": "(fresh)"
  }
 }
}
