{
 "title": "Behind Their Eyes",
 "author": "Matt Himself",
 "citation": " Matt Himself. \"Behind Their Eyes: experience with MDMA (ID 23588)\". Erowid.org. May 8, 2003. erowid.org/exp/23588",
 "substance": "MDMA",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23588",
   "Male",
   "",
   "Not Given",
   "May 8, 2003",
   "12329",
   " "
  ]
 ],
 "report": "<p>Substance - MDMA</p><p>Experience - First time</p><p>Setting - a concert</p><p>I have been interested in MDMA for quite some time. Almost everyone I have talked to reported such wonderful things about it. I have held off on trying it mainly because of the number of fake pills and such sold. I had planned to order a testing kit, but never got around to ordering one. Recently a friend of mine had approached me saying he had bought an ounce of good ?molly?. I had been told ?molly? was 100% pure MDMA. While I doubted my friend had PURE MDMA, I decided I would trust him, and the testimonials of many others, and buy some. He told me he would meet me in the parking lot of the concert the next night, and I could buy some there.</p><p>Next night came around and I drove up to the venue with my friend ?T?. T and I were going to be seeing the Disco Biscuits. There was plenty of partying going on the parking lot. There were many ?neo-hippies? walking around drinking beer, smoking marijuana, or selling a wide variety of drugs. We walked through the crowd and finally found our friend. He had been expecting us, and quickly sold us what was said to be 1/10 (100mg). Whether or not it was exact I will never know now.</p><p>We waited around the parking lot for awhile talking with people. T was drinking beers, but I chose to abstain from anything just yet. I wanted to feel the MDMA on its on.</p><p>I checked the clock and realized it was 8:45 PM. I had planned on taking it orally, but it was later than I thought. I had to be able to drive home by 2:00 AM. I decided that insufflating it tonight would probably be my best route. I went over to my friends car, sat inside it with T, and we prepared.</p><p>9:00 PM - T and I each insufflate ?100mg? of MDMA. I had been told it would hurt a lot, and it burned, but it honestly wasn?t as bad as I had been expecting. I kept sniffing to get that clogged feeling out of my nose. In 1 minute, I was out of the car, and my nose felt better.</p><p>9:05 PM - I was starting to get really shaky. I felt a strong presence of a drug in my body. I new it was time to get moving inside, as I didn?t want to get patted down by guards when this got stronger. I felt slightly fuzzy in the head, and a bit confused. T and I walked to the entrance quickly and made our way inside.</p><p>9:10 PM - Passing the guards was much easier than I thought. I made my way into the main room. There were no seats in this room which didn?t matter. I saw a few of my friends inside, and I went over to talk to them. It suddenly hit me that I am not this talkative normally. This just made me giggle and I continued on. </p><p>9:15 PM - The Disco Biscuits hadn?t come on yet, but a CD was being played through the house speakers. I had no idea who it was, but it sounded familiar. It sounded very good. I looked down, and noticed I was dancing to it. I personally hate dancing. It is not something that entertains me in the least. But right now, it felt so right?</p><p>9:30 PM - The Disco Biscuits came on. They came out of a cloud of smoke with strobe lights. I stared in complete awe as they started there first song. As soon as the music started, I began to dance again. T laughed at me, as I guess I looked foolish. But it didn?t matter. I was feeling good. It felt good to move.</p><p>9:45 PM - The music has completely taken over my body. I cannot stop dancing (or is it I just don?t want to?). The music flows through my body and moves my arms and legs like a madman. I felt like I was one with the song. I have said this about other psychedelics, but something was different this time. I completely let go.</p><p>10:30 PM - Am I seeing visuals? Not exactly. However, everything in the room looks so crisp and well defined. It looks as though I went from watching a fuzzy TV to a high definition one. I can see every detail of everything in the room, and I can see them all at once. I turn to my left and see a friend who had just snorted some of the same MDMA that I had. He looked very happy, and we talked for a moment. It felt good that someone else was experience something as wonderful as I was.</p><p>11:00 PM - I have lost count of how many people I have randomly started conversations with. Everyone is my friend! Everyone on my left and right, they are as good of friends as I have ever had. I am happy to talk to them, and they happily talk right back to me. I cannot help but wonder why this is illegal, as there is no violence here. There is no anger amongst the people in the crowd. There is no hate. There is only love. And as the Beatles said ?Love is all you need?.</p><p>11:30 PM - The first set has ended. The effects are tapering. I find T and ask him how he?s feeling. He says that he?s coming down as well. He goes off to smoke to marijuana, but I choose not to again. Although the concert is not over, I still need to drive later. I wanted to ensure that I would be sober when that time came.</p><p>11:45 PM - I feel mostly down. The effects tapered off fast. I am still quite happy at this time. I have a terrific afterglow. I would not consider myself sober yet, but I am definitely not too intoxicated. I was slightly depressed to see the effects go. Everything just seemed so right. Who could have thought that such happiness was just a little line away?</p><p>Then Disco Biscuits came back out and played their second set, and all my sadness was lost?</p><p>--------------------------------------------------------</p><p>MDMA was more than I had expected. I can easily see why this has become such a popular drug, especially in the club scene. It induced feelings of extreme euphoria. The social effects were amazing as well. I never felt so trusting of complete strangers as I did. No one was there to harm me. All the worries of the world were gone. Nothing matters anymore. All that exists is you, and what you allow to. And you are happy. </p><p>I think this could definitely be helpful for people. People who are socially maladjusted could definitely benefit from it. Also, people who are troubled by deeper things would probably be more willing to spit them out and share with the world. MDMA could possibly bring out the true nature of a person?s psyche and help to resolve any issues they may have.</p><p>As far as the after effects go, the next day I felt great. I felt a little tired, but it was from the lack of sleep (MDMA is an amphetamine). There was no 'hangover' which I had read so much about. I was very pleasant towards people. I was eager to talk to everyone, including my family. It was just a great feeling. It was great to be alive. The world seemed like such a friendlier place.</p><p>I would really like to do MDMA again. Next time I would take it orally. I would also prefer to take it with a group of friends outside the club setting. I would love to take a long hike, or just spend a day in the sun, getting to see what?s really behind their eyes.</p>"
}
