{
 "title": "Om",
 "author": "Murple",
 "citation": " Murple. \"Om: experience with MDMA, 5-MeO-DMT & Nitrous Oxide (ID 2365)\". Erowid.org. Feb 24, 2001. erowid.org/exp/2365",
 "substance": "MDMA, 5-MeO-DMT & Nitrous Oxide",
 "bodyweight": "170 lb",
 "header": [
  "DOSE: T+ 0:00",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 0:55",
  "2 hits",
  "inhaled",
  "Nitrous Oxide",
  "(gas)",
  " T+ 2:15",
  "1 hit",
  "smoked",
  "5-MeO-DMT",
  "(powder / crystals)",
  " T+ 2:45",
  "1 hit",
  "inhaled",
  "Nitrous Oxide",
  "(gas)"
 ],
 "report": "<p>I'm going to take the other half of the Crown E pill I took on the</p><p>9th. I've also got 2 hits cans of whipped cream I plan to do. I've been toying with the idea of MeO on MDMA, but probably won't tonight... if it doesn't feel right. I'm stoned from a bowl of marijuana, but pot doesn't seem to cloud MDMA much that I've noticed.</p><p>1:00AM</p><p>------</p><p>I swallowed the tablet at the turn of 1:00. I'm putting on a Bach CD and will take a nitrous hit when I feel the ecstasy substantially kicking in. Until then, I just got Shulgin's PiHKAL and TiHKAL today, and have been absorbed, so I'll read.</p><p>1:47AM</p><p>------</p><p>Taking much longer, but its beginning to kick in. Bach's Italian Concerto on harpsichord is playing...sounds very jolly; what an odd word, but it seems the only one with the proper subtleties of meaning. At 1:50, I inhaled about half the nitrous from a can of whipped cream. I've never mixed MDMA and nitrous. I immediately feel warm and floaty, and close my eyes and lay down. Neither the MDMA nor nitrous dominates, they meld smoothly into an even synergy. I take the rest of the gas at 1:55, and get a little cream in my mouth. I think to myself, 'It tastes like clouds!' As I lay down again and close my eyes, the Italian Concerty goes from its slow mid section back to the jolly fast melody. I feel as if I'm flying - not of my own power but as if being pulled along. I have imagery of pink and blue</p><p>sunset clouds all around me, as I fly high in the atmosphere. It's 2:05 now and I'm back to an MDMA high... but its alot stronger! Some of the nitrous flavor remains, especially as far as physical sensations... Music, now the Violin Concerto in E, sounds simply divine, each note having a corresponding physical sensation, I feel like a leaf floating gently to the ground moving to and fro with the sound of the violin...</p><p>2:10AM</p><p>------</p><p>    I think I just now hit peak. Right as I realize that, my cat runs over, jumps on the bed, and lays purring on my chest, licking my shirt. As I sit up to write this, he's laying on the opposite page. I'm endlessly fascinated by animals reactions to people on psychedelics. Not only do they always seem to know, but they seem to enjoy it greatly... I've even had times where I felt I could telepathically communicate with them, on a very basic level.</p><p>    This trip doesn't seem to be very entactogenic - I just feel happy and in the now. Like a beach holiday for the soul. When not writing, I'm happy just listening to music and petting my cat, and not thinking about anything not directly in the here and now.</p><p>2:50AM</p><p>------</p><p>    Around 2:25, I put on a CD of classical guitar and light some more candles, turning out the lights. I lay in bed alternately watching the candle flames, and closing my eyes. My mental imagery takes on a subtly 'medieval' tone (in the good sense). Looking at the candles from the right angle makes them shoot off long thin rays, no less bright than the flames, in cone shapes above and below, the points meeting at the heart of the flame. I passingly think of a girl I'm friends with and wonder why I've  got no interest in her beyond friendship, when she has many positive traits. Aside from that, there's none of the deep introspection I usually get from taking X alone. MDMA can produce yet a third type of experience thats like a mental vacation. Relaxation, a childlike sense of the here & now, daydream-like fantasies of a cheerful, non-personal nature. It feels very much like lying on the beach, closing your eyes, listening to the surf and feeling the warmth of the sun. While not very profound, its very valuable to step out of everyday reality and emotionally be a happy child for a while.</p><p>I feel the effects wearing off. The peak was definately over by 2:45 - the problem with taking only half a pill is it wears off much faster. I'm seriously toying with the idea of taking a small hit of MeO soon. Maybe. I'm in a positive mindframe for it.</p><p>3:27AM</p><p>------</p><p>I took a real small hit of MeO at 3:18. I felt a strong energy flood my body. I stand and look at my Buddha image. I raise my arms. Blue discs seemm to be rising from the candles on either side of the Buddha statue, forming an arc between them. I contemplate the face of the Buddha, then merge with the statue. Subject and object fuse. A few minutes (?) later I go and lay down. I close my eyes and see a huge mandala of rotating, pulsing pale blue-grey irregular shapes twisting clockwise, filling my inner theatre entirely. Opening my eyes then closing them again doesn't change it. Neither MDMA nor MeO dominates, both fuse into an intense, unique experience. At 3:34, I'm still seeing very intense trails. They move alot faster than LSD tracers, though. The MeO seemed to dissipate very fast, but it has changed the MDMA trip... its as if I'm having a second peak, definately MDMA in flavor, but with a strong 'yogic' energy from the MeO, and, oddly, mildly shroom-like visual effects. I had nothing to fear, it was entirely pleasant. I wish I'd taken a larger hit of MeO... most definately worth further research! Neither MeO nor MDMA are unusually visual (if at all!) for me, but the combination sure is! Quite uniquely too... blue-grey being dominant. Not a typical psychedelic color... The MDMA seemed to completely do away with the terror that MeO can sometimes cause... the combination seems to bring out the best of both and combine them into a very nice whole. 3:45, I'm still feeling psychedelic effects... rather, I feel the MDMA stronger than I did before the MeO, but I've got visuals. Very good mix!</p><p>3:50AM</p><p>------</p><p>At 3:48, I finished off the can of whipped cream, getting a moderate</p><p>sized hit of nitrous. I am propelled into a state I can only describe as *weird* and even now, 2 minutes later, can hardly comprehend what just happened. Writing is still hard. I ceased to be localized in my body, then ceased to be me. I fused with my entire room, with myself and everything I saw being not separate objects, not even one whole, but as an instant in time. Music sounded as if coming from another dimension, and yet was part of the now that I had become. Fuck it, words are just useless here. With the possible exception of one - 'Om.'</p><p>4:10AM</p><p>------</p><p>The effects of the last nitrous hit are long gone, and seems ages ago. I've got a whole can of whipped cream still, but I think I'll save it. The MDMA and 5-MeO-DMT combination is still going strong... especially the visual and mental aspects. I still feel quite energized, but that's fading, probably since its so late and I could be getting tired, physically. Mentally, I'm quite alert. I didn't expect the MeO to make the ecstasy last longer! I was quite down at this point from the other half of the pill last week.</p><p>This has been a cool trip... very much a meditation on the Now. I'll most definately be experimenting with MDMA and MeO together again! I've a strong urge to read some Buddhist writings and I'd like to be able to sleep before sunrise, so I'm going to go read, smoke some pot, and try to unwind and think about the trip. so I can relax enough to sleep. I've definitely gotten alot out of this trip spiritually, even if I can't put it in words right now (and probably not ever). Om mani padme hum!</p>",
 "year": "1998",
 "id": "2365",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-02-24T08:00:00.000Z",
 "views": "24696",
 "dose": {}
}
