{
 "title": "30-40 Urine Drug Tests in the Last Two Years",
 "author": "Byron",
 "citation": " Byron. \"30-40 Urine Drug Tests in the Last Two Years: experience with DXM (ID 23667)\". Erowid.org. Oct 30, 2003. erowid.org/exp/23667",
 "substance": "DXM",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "8 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "23667",
   "Male",
   "",
   "Not Given",
   "Oct 30, 2003",
   "18736",
   " "
  ]
 ],
 "report": "<p>There have been reports of false positive urine drug tests caused by DXM. Opiates and/or PCP are the substances DXM can supposedly mimic. There has been little published on this subject. Most information are personal reports. I shall add mine.</p><p>I have taken approximately 30-40 urine drug tests in the last two years. They have been for employment, mandated by a correction facility, rehab, and probation officer. I have also had 4-5 urine drug tests either in the emergency room or as an inpatient of a hospital. All of these times I had drunk 8 oz of Robitussin Maxi-Strength Cough syrup either the day before, or on the day of the test.</p><p>I provided urines at four different social agencies and 4-5 different hospitals.</p><p>Results:</p><p>None of the samples came up postive for opiates.</p><p>One sample came up positive for PCP. I'm not sure where the testing was done. I went to the emergency room of one hospital and a couple days later I was transferred to another hospital. It was at the second hospital where a doctor confronted me about my 'PCP use.'</p><p>I do not know if the test was done at the first hospital or the second. I hope the second because at the time I was working at the first hospital. If at the first hospital it would have been 1-2 days after ingestion. At the second hospital it would have been 3-4 days after ingestion. I was hospitilized for a Staphylococcus aureus blood infection.</p><p>Commentary: None of the drug screens at the social service agencies showed up positive. This is good because these are legal drug screens and can carry severe ramifications. The same with the pre-employment screening. Because of the legal implications any positive would have to be confirmed by a second different method, GC-mass spec being the gold standard. This should eliminate the reporting of any false positive.</p><p>Many hospital labs nowadays use a method marketed as 'Triage' for their drug screens. This is a simple quick immunoassay. In my professional experiance it would not produce a false postive. The methodology the second hospital uses where I was asked about PCP is unknown. The drug screening performed at the first hospital is bt 'Emit' immuboassays run on ab Olympus chemistry analyzer.</p>"
}
