{
 "id": 2367,
 "title": "Cops Shakedown the Party",
 "date": {
  "submission": "2006-08-05T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jesophocles",
  "gender": "Male",
  "weight": 125
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  }
 ],
 "report": [
  "[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I had just gotten out of school for the holiday. I was asked to go to a party that night by my boy h2k earlier in the day. there was only to be a few people there so I said alright.  We had scored a fat sack of shrooms the day before (about 4 grams) and we were going to trip at the party. It was all good.",
  "So we get to the party at about 7:30  My friend had bought everyone alcohol for the night, but me and h2k werent drinking. When we got there h2k busts out with a cigarette pack filled with joints.  He lit one up and we started smoking.  We smoke the kind goodness for a while and the we went back inside. Remembering that we had shrooms we decided to take them. It was 8:30. I washed the shrooms down with some Smirnoff ice (since thats all there was to drink)",
  "Ok now Im being dead serious now. By 8:45 I was tripping my fucking balls off. I had tripped before and it has never hit me so fast and so sudden before. so me and h2k (who was also tripping at this time) decided to go for a drive. That was a mistake.  We got about two blocks away from the party and he had to stop the car to let somebody else drive. it was funny as hell.  We cruised for a while smoked a joint and went back to the party.",
  "As soon as we got back it started getting crazy. The floor was moving and it felt like I was sinking into the floor.  At about 9:30 me and h2k went outside to blaze a fatty. As soon as that was done I lit a cigarette took two drags and I heard '5-0, 5-0'",
  "I didnt think it was happenening. I then saw a cop walking through the trees. Again it seemed unreal until he came and said something to me. He asked me what I was doing and I told him I was just standing there.  He was cool and when he went upstairs I followed. it was mayhem upstairs. I watched my friend get arrested for contributing to the alcoholism of minors. Then the cops called our parents. I wasnt even at the peak of my trip yet and I was going to have to go home.  oh well",
  "H2k left and the cops called my mom. When my mom got to the house the cops called me into the kitchen. I put my hand on the counter and it sunk in like it was a liquid.  When I pulled my hand out the coutertop seemed to come with it. It was definitely bugged out.",
  "Anyway the cops said I wasnt being charged with anything because I wasnt drinking.  little did they know we had eaten shrooms and there was a pack of joints in the yard.I was relieved that nothing really happened to me and h2k.",
  "So I got home at about 10:15 took a shower and stared in the mirror for what seemed like an eternity.  It was so mesmerizing.",
  "That was pretty much the end of the night for me.",
  "In closing I would like to say that magic mushrooms make the world so much better to me.  Tripping on shrooms has made me see everything for what it really is."
 ],
 "erowid": {
  "id": "17937",
  "citation": " Jesophocles. \"Cops Shakedown the Party: experience with Mushrooms (ID 17937)\". Erowid.org. Aug 5, 2006. erowid.org/exp/17937",
  "substance": "Mushrooms",
  "views": "6060"
 }
}
