{
 "id": 2369,
 "title": "Heaven In Powder",
 "date": {
  "submission": "2005-07-19T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Y2A",
  "gender": "Male",
  "weight": "131 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "It was my 4th time doing cokethe night before was a downer because me and my friends were looking for coke or shrooms and nothing came up. So the next night I talked to my friend and he got me 0.5 g of cocaine. He tried it with his friend and said it was real good stuff.",
  "That night I bought it and went home with it. I was very anxious to do it. It has been about 6 months since I last did it and every time I had done it before I was with people who were coked up also, or stoned on weed. This time I would be doing it alone. I went to my room and cut it up a line to start off.",
  "First linemmmmm my teeth and gums were a little numb. About 3 minutes went by and there wasn't much going on so I took a second line. Second lineahhhhh this one was great. Parts of my forehead were numb. I started feeling really greateven the drip (cocaine users know what the drip is) wasn't phasing me at all. The cocaine taste in the back of my throat actually felt pretty good. My mind started racingand I couldn't keep up with my thoughts but everything was so great. I put on some techno music which was greatI started to get a rush similar to amphetamines when the music tempo rose. For about 15 minutes, I was in complete heavenmind, body, and soul.",
  "About a half hour of feeling great and listening to music went by and I wanted a little more to bring me back up. Third lineahhh it was like the second line all over again. My teeth & gums went numb once again. I felt so good, I wanted to call my girlfriend to tell her I loved her but it was too late. My mind raced from one thought to anotherIm sure there were things I was really thinking about seriously that I totally forgot about a minute later. The whole time, my body moved along with the music I had on. It felt great. 4th lineit was a massive line and I felt the effects almost immediately. My thoughts felt cloudy but in a good wayI was still vibing with some music and in about 10 minutes I hit my peak. God it was like I died and went to heaven, everything seemed so right. My life looked perfect (and it's far from perfect). I just wanted to tell all my friends I loved themI wanted to live forever.",
  "Soon I crashed. I wanted more cocaine, but it wasn't to the point where I would do anything for more. I just told myself to hang in there. I felt a little paranoia that lasted for about 15 minutes. Then I was just depressed. I couldn't sleep at all which is characteristic of cocaine. My body still felt like it was racing but my mind slowed downalmost stopped at one point. I almost felt like crying. Then I guess I just fell asleep.",
  "My advice to anyone who is going to do cocainehave fun with it but it can be highly addictive especially if you let it get to you. If I'm crashing and I feel like you need moreI stop myself and just hang in there, it don't last forever. I have to accept the fact that cocaine is still a SYNTHETIC happy feeling and I can't feel like that all the timethen it will lose its magic. So like all drugs, use cocaine with respect and you may find it very enlightening. I know I certainly did."
 ],
 "erowid": {
  "id": "17939",
  "citation": " Y2A. \"Heaven In Powder: experience with Cocaine (ID 17939)\". Erowid.org. Jul 19, 2005. erowid.org/exp/17939",
  "substance": "Cocaine",
  "views": "37428"
 }
}
