{
 "title": "Tramadol Trials Out of Boredom",
 "author": "DevilDoc",
 "citation": " DevilDoc. \"Tramadol Trials Out of Boredom: experience with Tramadol HCl (generic) (ID 23709)\". Erowid.org. Dec 3, 2003. erowid.org/exp/23709",
 "substance": "Tramadol HCl (generic)",
 "bodyweight": "175 lb",
 "report": [
  "<p>I've recently received two different shipment of tramadol, each of a different type. The first was a white tablet, no name, no insignia, no label of any kind (other than tramadol HCl, 50mg)  - this made me a little uneasy. But I trusted the source completely, so I tried to settle my nerves. The second was a pink and dark blue/purple pill  - this one was called Domadol - also labeled 50mg tramadol HCl.",
  "I worked my way up, as suggested, both to try to appreciate the substance better and to assure my own safety. 50mg, 100, 150, 200, 250, each on a separate day, separated by 3-4 days each time to try to stave off tolerance, alternating between the two types of pills.",
  "I really noticed nothing until I hit a dose of 200mg, and even this dose was very mild - manifesting itself as a mild intoxication (very mild) that lasted 8 hours or so. I would liken the effects to a couple shots of liquor, mixed with maybe 1.5mg/kg DXM. When I upped the dosage to 250mg I noticed little more intoxication, but a marked increase in nausea. And I felt a definite increase in the DXM-like effects and a huge increase in nausea (to the point that I ALMOST lost my lunch). I didn't notice any iching, but did have difficulty staying with conversation or interacting with people.",
  "I can't say that I really enjoyed the experiences, unfortunately, but I also was taking generics, and not Ultram. This might or might not have an effect, but I generally find generics to be inferior.",
  "I can't stress enough how dangerous this compound can while driving, at high dosages. When I liken the effects to DXM, this isn't a direct comparison, but the frame-by-frame visual input at 150 mg and higher seemed to be clearly similar to a 1st plateau experience with DXM.</p>"
 ],
 "year": "2003",
 "id": "23709",
 "gender": "Male",
 "views": "36993",
 "dose": [
  {
   "time": "0",
   "amount": "-999.0 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2003-12-03T08:00:00.000Z"
}
