{
 "title": "No Gnomes or Elves",
 "author": "Weedwulf",
 "citation": " Weedwulf. \"No Gnomes or Elves: experience with Mushrooms & Cannabis (ID 23747)\". Erowid.org. May 14, 2003. erowid.org/exp/23747",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "145 lb",
 "report": "<p>My first reaction to the trip was slight disappointment. It was not as intense as I was hoping for, but I only ate a small dose and my hopes are still high for my next trip.</p><p>I felt a powerful lust for marijuana so we smoked a blunt or two while we were tripping and that did intensify it a little bit, but overall I just felt like I was really high without the sleepiness or munchies. I definitely couldve whipped up a 20-page paper with little effort.</p><p>I did see a few things that were definitely a result of the trip:</p><p>1.) When I closed my eyes I saw lots of intricate lattice patterns that changed as I watched.</p><p>2.) After this I opened my eyes and looked at the ceiling, which turned blue and then the patterns started appearing on the ceiling.</p><p>3.) I looked into an ashtray and the ash started swirling around like quicksand. Attempts to demonstrate this to others who were sober resulted in nothing more than several off color remarks about how Fucked Up I was.</p><p>4.) When I was smoking the blunt there was a piece of the wrapping that unraveled and started moving and swirling. It was particularly disturbing because part of it was an ember that looked like an eye, and I was semi-convinced that I was holding a miniature dragon. The rest of the blunt didnt look so cool but it was rotating as if it was made up of four or five cylinders spinning in different directions.</p><p>5.) Colors tended to bleed, if I was looking at a spot of blue ink on paper, the rest of the paper would temporarily turn blue.</p><p>In general, I felt very relaxed and happy. I was only afraid for one moment when I started thinking about the meaning of life. It made me go down the path of mortality and left me feeling slightly despaired at the fact that life is so short. There were no gnomes or elves guiding me to the 12th Dimensional gate or the Forest of Magical Fantasy. Those elusive friends I hope to meet in future trips. The effects I saw this time were of two categories, the patterns on the ceiling and when my eyes were closed (it was like being on a roller coaster, or more specifically the Rainbow Road level from Super Mario Kart 64), and the second visual effect made actual objects appear liquid and flowed like a bunch of disturbed snakes.</p><p>It was an experience. That's valuable.</p>",
 "year": "2003",
 "id": "23747",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-05-14T07:00:00.000Z",
 "views": "8233",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": " ",
   "substance": "smoked"
  }
 }
}
