{
 "title": "Hold the Hand of a Little Flower",
 "author": "Jasper",
 "citation": " Jasper. \"Hold the Hand of a Little Flower: experience with Mushrooms (ID 23756)\". Erowid.org. Apr 16, 2006. erowid.org/exp/23756",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "report": "<p>Before this trip I had 'climbed the mountain four times. The first time was a mushroom tea made with three cups of water, three bags of green tea, and a quarter ounce of some red capped psylocybes between three friends. The next time was a random acquaintance's gift of a handful of bluecaps from washington state on some pepperoni pizza. The third time was a beautifully intense encounter with my girlfriend and a quarter of gold caps(no sex, but more intimate than was previously imaginable) at ocean beach, San Diego (not a chill spot). The next time was the same batch with a first timer homey of mine at the same beach. All good shit. All more or less mellow and psychadellic. This next trip, my fifth, was to be the most spiritually enlightening experiences of my life to date.</p><p>I know from my endless endeavors into the depths of the web that psylocybes have been used all over the world wherever they grow wild as a 'teacher plant', bringing visions of gods, music from within, and personal and spiritual insight I'd been longing for from the confines of a strict catholic upbringing. I knew that obtaining and holding these beautiful little creatures was a felony, no matter how much I had, and I also knew that the anscestors of mine that were native american (injuns) had used peyote as their main divining plant.(still haven't tried that shit...pissed)</p><p>I decided to take my friend up on a trip (pun intended) to the desert. He has some serious problems with the sruumz, and doesn't want to go back after his last trip, but he loves living vicariously through those who enjoy psychadellics, so I was willing to help him out (I'm so considerate). we loaded up the quad on the back of his benz (we're idiots), gassed up the crwn vic, and headed out for ocatillo, California.</p><p>I, another experienced shroomhead, a first timer, and two second timers munched 3 grams each once we got the the cool, crisp, fresh, NOT CITY AIR. They were of some trippy, not so mind expanding brown babies mixed with some superb, mind expanding, yet not trippy bluecaps, and we washed it down with some extra pulp OJ, Courtesy of yours truly. After approxmately 30 minutes, I heard my buddy nile (first timer) start giggling from inside the crown vic. I was kicking stuff around and making a fire circle of rocks to keep my mind clear for the trip, and turned around to see him, beaming at me and just laughing his dialated ass off. It reminded me of my first trip and how overwhelmingly good it felt, and I started giggling as well. Someone busted out the glow pens and these fools just visualled off of those for hours. I meanwhile set off on a fucking jorney of a lifetime.</p><p>I grabbed a pack of cigarettes, put on my hoody, snagged a lighter, and went foreward. I felt the shrooms coming from my stomach in a way that I could undertand being described as nausea, but the instant remedy was simply laughter. I walked towards an undeniable force, pulling me what felt like up, but ended up as forewards. I kept my head down because it frightened me a bit. the sad was breathing with me, and seemd to know something that it would (not could) not articulate. I walked for a while until I stubbed my toe and realized that I should look up and stop trippin off the sand.</p><p>THE SKY and stars noticed that I noticed them, and came down at me, ZOOM! POUND! ZOOM! POUND!, screaming whispers of advice on personal matters, but it was too loud and fast to understand. I laughed hard as I could, it was indescribably beautiful. Something caught my attention from my left and right side, and I began to melt into a technicolor fabric eminating from a giant of some kind that I was aware of, but unwilling to look at. As if manipulated by partially invisible entities, I turned my head to see what I'd come to and knocked my foot against. A gasp left me as a towering mountain loomed over me, rumbling and breathing in unison with the sand, and the sky, and myself. It asked me if I understood it (him? her?). I answered yes.</p><p>I spotted the precipice, and decided it was truly time to climb and conquer the mountain. I took a deep breath, and put my hands on the first stone. MOTHER. I put my feet on that stone, and climbed upward (weraing vans and my usual trippin shirt). I put my hands on another stone. NEW LIFE. I lost my footing, and laid my hip into the mountainside with much force. PAIN WILL COME. I took a deep breath and let out a defeated 'no'. I looked down the mountain to see how far I was. I was alredy halfway. I had tranced myself up a hundred feet of mountain. I put a determined look on my face. I grasped a stone and pulled myself erect. 'what are you saying, mountain????', I said with desperation. I was rewarded with silence. I put all of my mettle into my heart and pressed on. I will conquer this. I put my hands on a stone that was much larger than I was, and felt very, very warm. JORNEY. journeeyy. I took my hand away because it felt so good. it was a bit daunting to be making life decisions and conversation invoving a giant mountain's insight and seemigly infinite wisdom. but I put it back. JORNEY. LOOK. LOOK OUT. OUT.</p><p>I looked the direction it had asked me to. I saw the horizon, hundreds of little lights coming from atv's, houses, a border check, the impending sunrise, and a mountain range that taunted me for endless miles. I put my face on the rock and closed my eyes. I believe theclinical term for what came next is 'Lucid Dreams', in which my body gave up, and my mind gave way. there is a place somewhere sandwiched between hate and order, between freedom and trust, between society and what works in an environment, a place where everything is beautiful, and everything is known. this place is mushroom mountain. I was being pulled along by a fully visible entity now, that hadn't the characheristics of my earlier trips. it was a little flower, or mushroom, or child. or all three. it was holding my hand, and pulling me through a path. no words were exchanged, only motions, expressions, and (once again) indescribable singing.</p><p>I could hear my body singing out softly on the mountain with the other humans, but I refused to go back to the world I had come from, this one was entirely too beautiful and (for lack of a better word) educational. no statements seemd to come to me. questions were left to me to articulate for myself, and answer for myself. 'they' would prod me to come to a firm descision, and then elaborate with more questions.</p><p>I opened my physical eyes, and erected myself once again. The summit was only so far away. it was time.I made my way to the top, ignoring further words and ideas coming at me, placed the stars back in their rightful positions and asked everyone to just give me some time to sort it all out. orion's belt seemed pleased with my progress. when I was about ten feet away from the mountain, I thought to myself: 'when I get to the top, there's going to be a 360 view of my surroundings. a beatuful landscape will lay in front of me, no matter what direction, and I will be the conqueror of that mountain.'</p><p>I reached the top, and a gust of wind tried with all it's might to throw me. I stood tall, firm, accomplished. this was my first wncounter with what I call the 'moral of the mountain'. it goes as such:</p><p>'A mountain calls me. it may call me with admiral purpose, with insight and wisdom. it may call me to conquer it's jagged, unwelcoming crests and contours. I will conquer this mountain, but I understand that once I reach the summit, the only thing I will find on the other side is a bigger fucking mountain.'</p><p>and there was. but it was not dissapointing. it was intriguing.I looked back at my doing. I felt the wind, I saw the mountain laughing, and I felt it coming again from my tummy. I felt my face, and noticed that I felt 'perfect'. like... gushing. I was</p><p>melting... I was dripping, I was letting out an emotion. It was like vomiting, and fucking and church and love and parents and school and pain. I was crying. I was flowing with tears and I was laughing with more meaning than I had ever thought could come from laughing. I wanted to thank it,embrace the mountain, but could find no way to show my appreciation for it, so I sat. I felt a little giddy, and I thought it would be very fulfilling and hilarious to bite the hand that feeds me. I took off my shirt and pissed on the motherfucker. the wind died the second I dropped the zipper, and didn't come back until I was good and done.</p><p>I decided that my friends were probably wondering where I was, and definitely needed their shaman (however halfassed I am) to help them out, and trip with them. There is much introspect in a group of those holdng hands with the little flowers. I made my way back down the mountain, who was silent now, and unmoving. I found camp and there was no one there. as soon as I got to the spot where the crown vic was, the benz, the quad, my experienced homeboy, the two first timers, the two buddies with little 50cc bikes, and the crown vic all showed up simultaneously, all beaming with smiles and meeting with new gregariosity. The rest of the night was spent around the fire, playing guitar, and going on more missions (in a herd this time).</p><p>I've since shroomed five more times, with and without the same group, with and without the same shrooms, in and out of society. I've since gone to a different desert, and learned the  moral of the endless sands there, but that's a different trip, a different story. Mushrooms are the closest I've come to spirituality in my life, and find myself much more at peace with myself and that which surrounds me now that I've climbed to the summit of the mushroom mountain</p><p>sometimes trips get heavy. sometimes trips get frightening, but all one must do to have all of their deepest questions answered, is hold the hand of a little flower.</p>",
 "year": "2003",
 "id": "23756",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-16T07:00:00.000Z",
 "views": "7870"
}
