{
 "title": "Detoxing Routine",
 "author": "TiDi",
 "citation": " TiDi. \"Detoxing Routine: experience with Chlordiazepoxide (Librium) (ID 23755)\". Erowid.org. Sep 21, 2005. erowid.org/exp/23755",
 "substance": "Chlordiazepoxide (Librium)",
 "bodyweight": "180 lb",
 "report": "<p>Well after already going through the DT's from Alcohol withdrawal all by myself and with the help of my Ativan and Trazadone prescription....my counselor suggested I go ahead and go into detox anyway. What they do is basically this give you 4 to 6 librium pills....not sure the exact dosage...which basically make you completely useless....I could barely walk .....so I slept alot. You take librium for the next 4 or 5 days depending on how well your detoxing...slowly tapering off. I'm all for being heavily sedated...but after the second day I was burned out on being this walking zombie. I checked myself out after the 3rd day cause I wasn't getting anyhelp ...except for being higher than shit on librium. Went and got some counseling and group sessions going that day figuring that that would be a better way to deal my problems than being a drooling 2 year old (librium behavior).</p><p>My advice is if you have access to valium or ativan and a quiet caring place.... detox yourself. Also, I found (for you psychic/empaths out there) that it was impossible to shield the other detoxers emotions and thoughts on high dosages of librium.....actually making me have MORE ANXIETY. I wasn't able to shield myself from other detoxers till I got to the lowest dosage of librium. Places to detox can be full of mean bitter employees and clients...so be warned if you feed off other peoples energy...it could make you worse. Good luck.</p>",
 "year": "2003",
 "id": "23755",
 "gender": "Male",
 "timestamp": "2005-09-21T07:00:00.000Z",
 "views": "14344",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 tablets",
   "administration": "oral",
   "substance": "Pharms - Chlordiazepoxide",
   "form": "(pill / tablet)"
  }
 ]
}
