{
 "title": "Number nine, Number nine, Number nine...",
 "author": "Murple",
 "citation": " Murple. \"Number nine, Number nine, Number nine...: experience with DPT & MDMA (ID 2376)\". Erowid.org. Sep 10, 2000. erowid.org/exp/2376",
 "substance": "DPT & MDMA",
 "bodyweight": "170 lb",
 "report": [
  "<p>I was listening to the Beatles' White Album, when the song 'Revolution #9' came on. Someone once told me this contained a backwards message, so I decided to play it backwards... I was pretty surprised to hear that it was in fact a trip report! I've transcribed it below for those who may not have this record...Look up DPT's entry in TiHKAL...what number is it? :)",
  "Well, I quit smoking when I went to bed Wednesday night. Withdrawal was pretty rough but since I was finally ready to quit, it was doable (GHB helps alot with the physical symptoms, by the way). Friday and Saturday were the worst. I was unable to sleep Friday night for more than an hour... yet I felt oddly stimulated all of Saturday. At about 1AM (Sunday morning now) I decided to take a pill of MDMA and follow it up with some DPT. Very spur of the moment, and normally, I'd never have considered taking a psychedelic after having been up for 2 days...but I digress.",
  "I took the pill of MDMA (a 'double-stacked Mitsubishi') at a few minutes past 1AM. After taking it, I proceded to cut up 100mg of DPT into two lines. I waited until the MDMA was kicking in, then snorted one 50mg line of DPT. Within a few minutes, I realized I wouldn't be needing the second line, and put it away.",
  "The DPT took dominant control of the experience, though it was difficult to separate out the effects. The DPT and MDMA blended very well. The first hour or so of the trip was of pretty overwhelming intensity. I turned out the lights in my room and lay in my bed. Small LEDs and LCDs on various electronic devices in my room, normally barely noticable, were now bright enough to brilliantly illuminate my bedroom. I closed my eyes and was wrapped up in a warm fuzzy sensation that was equally DPT and MDMA. All of the sudden, I heard a voice start talking to me. It was telling me all the great things about being a non-smoker, and how horrible tobacco is. It was laying out an entirely new thought system about tobacco. Eventually, I recognized the voice as my own - and when this happened, it stopped addressing me as 'you' and became 'I'. 'I don't smoke.' How simple!",
  "An hour and a half after the peak started, it began to wear down, and I got online. The trip continued for several hours at pretty good intensity, until I was finally able to sleep (with the assistance of GHB) at around 5am. Throughout the trip, I felt the DPT was dominant - the MDMA's effects seemed to be absorbed into DPT's phenethylamine-like qualities, and greatly enhanced them. I think the MDMA also contributed to the entactogenic introspectiveness of the trip. Definately MDMA's main contribution though was to greatly lengthen the duration of the DPT's effects.",
  "A very worthwhile combination! And a trip that I think has made a large impact on my life. DPT is one of the good ones, folks. This is real medicine.</p>"
 ],
 "year": "1999",
 "id": "2376",
 "gender": "Male",
 "views": "9713",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2000-09-10T07:00:00.000Z"
}
