{
 "title": "Centuries Younger",
 "author": "Murple",
 "citation": " Murple. \"Centuries Younger: experience with DPT (ID 2380)\". Erowid.org. Sep 10, 2000. erowid.org/exp/2380",
 "substance": "DPT",
 "bodyweight": "170 lb",
 "report": "<p>I woke up around 10AM to find about an inch of snow on the ground, with more coming down rapidly. I told work I wouldn't be in, and insufflated about 50mg of DPT. I went out for a walk. This is the first time I'd had DPT during daylight hours, first time in the snow. Not to mention that this is the most snow we've had in about 3 years here.</p><p>I went out the first time and there was already close to 2 inches on the ground. I just walked around and stopped occasionally to watch the snow fall, or to close my eyes and listen to the rustling hiss of the snow fall. I saw billions of darting, living, brilliant bluish-white sparkles flying around, i couldn't quite tell if they were on the surface of the snow, right in front of my eyes, or somewhere in between. It was like walking through a field of diamond gnats. It was like seeing the pure essence of the snow. Billions of diamond gnat Christs, dying for the sins of the world, their sparkling shells leaving the world bathed in pure white newness. I went in for a few minutes to warm up.</p><p>I went back out and stood under a tree, watching the snow. I'm wonderstruck by the beauty of the snow painted world. I think of my friend who committed suicide 3 months ago. What difference would one snowfall have made? I look at my own life. I think of the things I've done recently, the changes I've made since then. I've quit smoking, decided to move, made alot of other big decisions I'd been wanting to make.  Paradoxically, though, I've been feeling more and more lost lately. But I realize now that it's just fear. Fear of finally feeling I'm doing the right thing? I guess so. Newness is a beautiful thing, but it can be scary if you think about it too much. Just flow with the changes. Be one with the changes. It dawns on me that I *am* this snowstorm. The changes I've been making in my life and this snowfall are manifestations of the same energy.</p><p>I went to warm up a little before going out a third and last time. This time I brought a camera, and snapped off a couple pictures. Its after 11:30 now, and the DPT is wearing off. The beauty of the snow, however, is unsullied.</p><p>It kept snowing all day. Around 11:30PM, there was about a foot of snow, and more falling. I found the plate of DPT from earlier, with perhaps 30mg of DPT layed out on it. I insufflated this and went to walk in the snow. It was amazingly beautiful. Everything sparkled, and the air had a magical glow to it. Trudging through foot deep virgin snow was profound. Looking at the snow frosted trees reminded me of being a kid in Germany. It looked as if my neighborhood was buried in ice cream. No words I can use can do justice to the beaty of nature. I feel centuries younger.</p>",
 "year": "1999",
 "id": "2380",
 "gender": "Male",
 "timestamp": "2000-09-10T07:00:00.000Z",
 "views": "11322",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:30",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ]
}
