{
 "id": 2380,
 "title": "Oops, That Didn't Work...",
 "date": {
  "submission": "2004-08-17T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Strange Philosopher",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "16 oz",
   "administration": "oral",
   "substance": "Cacti - M. geometrizans",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>I'm an eighteen year old Ecuadorian American guy. I am a very liberal philosopher/photographer/mediator/student.  I am 60 and weigh about 160 lbs  Im a lightweight and I am rather sensitive to substances like alcohol and marijuana.  I consider myself intelligent, creative, ambitious, and curious, and only recently have I tried to expand my consciousness with mind-altering substances.",
  "In my pursuit for altered mindstates, I discovered online info about cacti.  After extensive research, I decided to try and find a San Pedro cactus or something similar to that.  None of the nurseries around where I live carry San Pedro or any Trichocereus for that matter.  However they did have a medium sized Myrtillocactus geometrizans (Blue Flame) which reportedly contained mescaline.  Im writing this report to dispel that rumor.  While it may contain trace amounts of mescaline, it doesnt come close to producing the amazing visuals that San Pedro does.",
  "The cactus I used weighed close to a pound and a few weeks previous to this, I fortified the soil with tyrosine and dopa.  I had even been taking 12 mg melatonin supplements for the past week.  So I honestly tried to make the most of the experience",
  "I started by removing all the spines.  Once that was done, I painstakingly peeled off all that waxy skin on the outside.  I removed the core and then chopped the cactus up into itty bitty pieces and boiled it for close to 1  hours.  I then poured the water into another pot (not aluminum) to boil down.  I refilled the big pot and boiled the cactus mash again.  I did this process for 5 hours.  To filter out the last of the floating debris, I poured the final batch through a tshirt.  By the time I was done, I had about 16 oz of a dark greenish brown, rank smelling liquid which I put into the fridge to cool down for the following morning.",
  "This morning I choked down the terrible sludge for breakfast.  Prepared for a mind blowing trip.  Heres what actually happened",
  "11:30 AM",
  "Yuck, that tasted terrible",
  "12:00 PM",
  "Hmm nothing so far.  I decide to go out with friends to a Flea Market.",
  "12:30 PM",
  "Shouldnt something be happening now?  Slight nausea.",
  "1:00 PM",
  "I feel better now, but no visuals or body high.  Nothing at all.",
  "1:30 PM",
  "Colors seem slightly more vibrant.  Could be placebo.",
  "2:00 PM",
  "Yup, it was placebo.  Damn it!",
  "2:30 PM",
  "I sit down to write up this report.  Feeling very bitter about the whole ordeal.  Oh, well at least I didnt puke.",
  "So what went wrong?  I did add 500 mg of tyrosine during the extraction.  That might have somehow affected the mescaline.  I dont know.</p>"
 ],
 "erowid": {
  "id": "17983",
  "citation": " Strange Philosopher. \"Oops, That Didn't Work...: experience with Cacti - M. geometrizans (ID 17983)\". Erowid.org. Aug 17, 2004. erowid.org/exp/17983",
  "substance": "Cacti - M. geometrizans",
  "views": "12373"
 }
}
