{
 "title": "I Did it for Me",
 "author": "Just Gaia",
 "citation": " Just Gaia. \"I Did it for Me: experience with MDMA (Ecstasy) (ID 23810)\". Erowid.org. Feb 5, 2007. erowid.org/exp/23810",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I finally did MDMA. I've had my doubts and temptations to try MDMA for many years. Pretty much ever sense I heard about it and decided that it was morally ok for me to use illegal substances. It was a wonderful experience.</p><p>I dropped my pill at 9:30 PM on Wednesday evening. I had a normal amount of food that day, my homework was finished, and I was ready. I cleaned up my room, brushed my teeth, and took my contacts out just like I was going to bed. I had myself prepared for almost anything. Not to mention I was relaxed. My mind felt content. Perhaps it was a little nervous, but no big deal.</p><p>During the first half hour, or so, I was talking to my little brother. We were talking about school, what things we liked, etc. There was no arguing, fighting, or the usual sibling crap we go through. I was completely relaxed.</p><p>Then about another half an hour later I just started feeling a little funny. I was even more relaxed, and my mind was completely clear of worries and fears. I just felt happy. I wasn't a big rush either. I could still tell that my mind and body were connected. I was still myself. That part I was a little surprised about. I wasn't sure how well my soul would be connect to me, like some other drugs. It was great.</p><p>I was watching Better Living Through Circuity, a documentary on electronic dance music and rave culture. The music was terrific, but I am glad to say that it's just as good, or even better, when I'm straight. I can recall tears just flowing down my cheeks. I wasn't sad, I was happy. I just felt so good. My body felt alive.</p><p>Things were going well. I wasn't getting intense rushs and I wasn't freaking out. Last year around this time I had a little accident with over the counter sleeping pills, and I flipped. I had to drink charcoal, go to the ER, and spend a day at an institute. This is part of the reason why I wanted to try MDMA. I wanted to prove to myself that I can take certain drugs on my own and be ok. I know I shouldn't be alone, but for once I felt the need to. I definitely achieved my goal.</p><p>Later on, I danced and flowed. My arms felt like water. Free flowing and cool. I was in heaven. At that time I noticed my jaw clenching and chattering. I sucked on a lollipop and that helped it a lot. I was sure to drink water. I wasn't dancing that much, but my mouth was getting dry. What's a little water anyway? Those were the only bad side effects during the experience.</p><p>The peak was incredible. I'm not exactly sure how far along I was when I peaked. Tears were flowing again, and I just sat in my bed. I was getting little fuzzy buzzes over my body. I just felt like I could fly. I kept thinking about how wonderful I was feeling. It was intense, but in a very pleasant way.</p><p>I think it was 4:30 AM when I attempted to settle down a little. I tried to sleep some, but I had music on. I needed to let my arms flow. I think I got to sleep around 5:30. Mind you, I get up for school at 6:00 AM. I slept for that half an hour, but when I got up for school I still had a fair amount of energy. I rushed to the store before school to get a lunch and some caffiene just in case I needed it.</p><p>I was relaxed and content with myself all day at school. I didn't need to take my Zoloft either. I was starting to feel pretty tired. I made it through the day. Work was kind of brutal though. I was very, very tired. I made it though. Sleep was still a litle uncomfortable.</p><p>The day after is when I really started to feel the negative side effects. My mouth is still incredibly dry, my stomach is a little queasy, my arms hurt (that's from dancing though), and I'm tired. It's kind of like having a minor cold. I'm sure it'll clear up within a few days.</p><p>But yes, it was so worth it. It's not something I would want to do every weekend. Once a month is plenty for me. It's a nice thing to use when I want to relax. It's fun. I don't really suggest doing it during the school week. I kind of got my schedule a little messed up. Rolling by yourself is ok, but I'm sure with close friends would be better. Be prepared for NASTY cotton mouth. It's gross.</p><p>Oh yeah, and eat an orange. It's the best thing I ever tasted. Plus, the vitamin C doesn't hurt either.</p>",
 "year": "2003",
 "id": "23810",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-02-05T08:00:00.000Z",
 "views": "3868"
}
