{
 "title": "Grasshopper Puts Humans in Their Place",
 "author": "fisheye",
 "citation": " fisheye. \"Grasshopper Puts Humans in Their Place: experience with Ketamine (ID 23853)\". Erowid.org. Aug 19, 2005. erowid.org/exp/23853",
 "substance": "Ketamine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "111.7 mg",
   "IV",
   "Ketamine",
   "(liquid)"
  ]
 ],
 "report": "<p>A few years ago while in Oaxaca, Mexico, I met an english fellow who told me where I could buy ketamine. I am a pretty experienced tripper and I always wanted to check it out, so I headed down to the market and got totally lost looking for the vet pharmacy. Eventually, though, I found it, and with a rather unbelievable story, I  was soon walking away with 4 bottles of ketavet 1000. I pulled out the little dosage sheet and read all about how much to give your snake, monkey or dog, but of course nothing on people, so I figured the lowest dosage (monkeys, 1 mg./Kg. Body weight).... I weigh about 70 kilos, so I figured if I just did 10 mg. to start with I would just get a feel for what this stuff does. Well, in haste I misread the label and thought it said that each 10 ml bottle contained 111.7 Mg, when actually each milliliter contained 111.7 Mg.... So figuring I'd have to do a full milliliter for even a small dose, I bought a one ml syringe and went back to my hotel. I got comfortable and filled the syringe. I knew that most people prefer the IM route to IV with ketamine, but I never liked muscle shots (too painful) so I shot it into my vein.</p><p>I was setting the syringe down on the table when I heard the crickets, they got louder and louder till I couldn't hear anything else, and then I found myself in a tent in the desert. The air smelled of chilis and sage, the walls were flapping in the wind, and there were holes through which I could see a landscape of dry red earth and cacti. There seemed to be millions of insects buzzing around me, but I didn't feel threatened, just that they might be curious about me. I looked up, and saw that there was a giant grasshopper, much larger than me,  in the tent with me. It was sitting upright, staring at me with huge multifaceted eyes. 'What are you doing here?' It asked. ' I'm a traveler, I want to experience all possibe worlds', I said. 'No. What are you doing here?' It asked again. 'If you mean the point of my existence, well, then I don't know.' I answered. 'Good. You can stay.' it said. After this all of our communication was wordless, though I don't know if telepathic is the right word. The grasshopper (el chapulin, a popular snack in oaxaca, and also identified with the trickster) told me the history of the evolution of the insects, the population booms during warm climate conditions, and the crashes of the ice ages. After what seemed millions of years of insect evolution had passed, el chapulin said :'Now humans think they rule the earth, but we insects have been here for much longer, and we will rule again.'</p><p>I looked down at my body and  it seemed very insectoid. I looked at my hand, and it had become  three fingered claw. I kept trying to count my fingers, but I could only count to three. I looked over at the bed, which seemed to be a vast expanse of yellow sand, and sort of stumbled/fell onto it. I was looking at the wall with one eye and for a while I was a dead fish, waiting to be gutted. It wasn't unpleasant, just dead. After a while I began to wonder if maybe I wasn't really a dead fish, and eventually I regained my humanity, and then I remembered my identity, but it took a while to figure out where I was. At first I thought I might be in jail, then I considered it could be a hospital, but when I finally realized I was in a hotel and had done a drug, I felt pretty clever for not being in jail or the hospital, as I probably would have ended up in one or the other had I done it anywhere else. I got up and puked, but felt no nausea after that.</p><p>Since then I have done k probably 150 times more but never again saw the grasshopper, and  though I have met other entities, that was probably the most profound drug experience of my life. I really think it made me a better person with a larger understanding of the world. Hooray to the grasshopper!</p>",
 "year": "1999",
 "id": "23853",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-19T07:00:00.000Z",
 "views": "9434",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "111.7 mg",
   "administration": "IV",
   "substance": "Ketamine",
   "form": "(liquid)"
  }
 ]
}
