{
 "title": "Beginning To See the Nasty Side",
 "author": "Murple",
 "citation": " Murple. \"Beginning To See the Nasty Side: experience with 5-MeO-DiPT (ID 2387)\". Erowid.org. Jul 13, 2000. erowid.org/exp/2387",
 "substance": "5-MeO-DiPT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "5.5 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>8:40PM</p><p>I just ingested 5.5mg of 5-MeO-DIPT, obtained from a different source than the last 2 samples. This batch is a white, fluffy (well, looks sorta like cottonballs under a magnifying glass), crystalline powder which has a very strong indole smell. I opted for a small dose because I've noticed that this substance has a long tailing stimulation that lasts several hours after other effects have worn off, and I'd like to get to sleep before 4AM.\r8:55PM</p><p>Alert! A generalized tingly sensation...\r9:15PM</p><p>Things are going pretty well...still building though. I have the bright colors, warm tingly feel, and the sensation of comfort that I am fast coming to recognize as the signatures of this substance.\r9:50PM</p><p>Pretty nice! I think a larger dose and a better setting would have been nicer, but oh well, I just wanted to sample this batch and compare. Effects are pretty much what I expected, based on my other 2 experiences. This is a nice alternative to sitting around and watching TV.</p><p>I've got some stomach upset... nothing major though. Unsure if its connected. I got it the first time I did 5-MeO-DIPT as well, but not the second time. Could be coincidental... could be from having eaten beforehand... although all I had today was a bag of pretzels. Perhaps NOT having eaten much? \r2:30AM</p><p>Wow...damn... Still having strong effects. This was quite a bit more than what I was expecting! This seemed much more of a stimulant and was alot more LSD-like in its feel - though it was definately the same drug.</p>",
 "year": "1999",
 "id": "2387",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-07-13T07:00:00.000Z",
 "views": "7882",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5.5 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
