{
 "title": "Experimentation",
 "author": "Drugs",
 "citation": " Drugs. \"Experimentation: experience with Various (ID 23909)\". Erowid.org. Jul 22, 2007. erowid.org/exp/23909",
 "substance": "Various",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "",
   "Various"
  ]
 ],
 "footer": [
  [
   "2002",
   "23909",
   "Male",
   "",
   "Not Given",
   "Jul 22, 2007",
   "16177",
   " "
  ]
 ],
 "report": "<p>I was warned when I warned young, my parents told me to stay away, they made it sound like it was deadly, and being fucked up just was not the way. Have you ever heard curiosity killed the cat, I guess thats how the story starts. This isnt bullshit, its coming strait from the heart. Its almost too good to be true, the way it makes you feel, and fuck the money that I spent, I swear I got the better deal.</p><p>When I really felt it, when the  acting geeked shit was over, my whole life seemed to be moving just a little slower. I always said it wouldnt happen to me, this shit will never take me in. And now its apart of my life, like its one of my best friends. I feel like a cartoon because of the way my bodys moving, and mom you said this shit is bad, to me its super soothing. </p><p>God made this plant for us. Not for it to kill you, start getting high, and it might bring out the real you. I sit down in my chair, put my feet up to recline, fire up the bowl, and now Im on cloud nine. Now my head is spinning, Im really working on a buzz, I havent a care in the world, and I owe it to the drugs. Fuck drinking beer, it only makes me feel dumb. So I swallow a few zanex, two will get me numb. Im thirsty as hell but I cant get up to walk, and I would ask my mom, but I dont have the spit to talk. Now Im not a druggie, and this isnt all I do.</p><p>I used to like sports, and I go to a blue ribbon school. I havent lost my friends, and I still have an interest in life, these drugs are only helping, I promise Im doing it rite. I showed up at my buddies, there were people all around. So I headed for his room, only to burn a couple down. Around an hour later, when all the weed was smoke, my friend said he had a surprise, then he pulled out a bag of coke. I didnt want to look at it because I just wasnt down to get involved, he insisted that its harmless, and all my problems would be solved.</p><p>He dumped it on a piece of glass, a pile as bright as snow. Then reality set in, and it was hard as fuck to just say no. He seemed to be a pro, the way he was using the razor blade to perfection. It was no longer just a pile, they split into four equal sections. I watched him roll up a dollar bill, I was glued to his every move, he had a dirty smile on his face, as if he had something to prove. He put the dollar in his nose, and quickly sniffed a line, got up and cleared his throat, and everything was fine. He passed it to his right, and now Im third in line.</p><p>I tried to anticipate the feeling, but that I couldnt find. Because never in my life, had I thought of snorting lines. I was waiting for my conscious, to kick me in the ass. The next thing I knew, they were passing me the glass. My brain shut down, and I excepted it with open arms. It happened in the matter of seconds, and all I thought was darn. Five minutes later, the high had just kicked in, I was on top of the world. I was everyones best friend. The guilt left my mind, like a bad told joke. And what I failed to realize was, I just did coke.</p><p>Its honestly hard to admit that what I did was wrong, at least I wasnt hooked, or should I say not for long. Get out your books children, get ready for todays lesson, and I hope your taking notes, todays topic is aggression. They say it makes you horny, and when your with a girl it hits the spot, it was forty dollars for one pill, so I knew I wouldnt roll a lot. I was full of rage, as blood covered my fists, it was the last night of the summer, I added xtacy to the list.</p><p>I spent all my money for this upper, and it only made me pissed. December 7th, it was Christmas Dance night, I knew I needed something special, to get me feeling rite. I showed up at the dance higher then a kite, not knowing that night, would be the best of my life. We showed up at some guys apartment, that consisted of just one big room, and on the table I saw a bag, filled to the top with shrooms. I dropped thirty dollars on an eighth, just to see what the shit would do. I had heard they get you fucked, but the experience to me was new. Cap after cap, and damn they were hard to chew. After finishing off the bag, I desperately had to spit, are you sure these are shrooms, I could have swore I was eating shit.</p><p>Now you might think Im clowning, from what Im about to say, but with the blink of an eye, his walls turned from white to gray. My eyes kept playing tricks, and every ten minutes I would hear a voice, but all I realized was, I had found my drug of choice. Call me a druggie or call me worthless, I could give a fuck what people say. At least Im here to talk about it, and remember, tomorrows just another day.</p>"
}
