{
 "id": 2390,
 "title": "There Was No Turning Back Once I Tried It",
 "date": {
  "submission": "2000-06-14T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Katie",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "lines"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "One night I had some of my older friends over at my house, my parents were away. I was looking to get high off acid or weed, but my friend Larry insisted that we get some coke. I agreed. The coke arrived and Larry crushed and prepared it, Danielle was so excited, she couldn't wait. I was scared, it did not want to get addicted to it, I just wanted to try it. When it was ready everybody snorted a line or two. It was my turn, I was so scared. I picked up the pen tube; held it to my nose and took a deep breath and snorted it. In less than five minutes I was jumping all over the place, it felt so good, I was so aware, so alive. When my 'high' finally wore off I begged and begged for some more. I wanted it so badly, just after one line (the first time too). Larry told me to calm down but I couldn't, I wanted some more so badly.",
  "After awhile, after me nagging so much. He gave in and prepared more lines. This time I jumped right on it, the first to snort, I took in 5 lines. Shortly, I was jumping off the wall again. I wanted it so bad, there was nothing better than this feeling, i loved it. The drip was the only bad part. Larry light up and joint and I insisted he roll it in coke, so he did. Everything just seemed so much better at the time.",
  "In the morning when I woke up. I had such bad side affects, I was so groggy. I had a horrible headache and I felt extremely nauseous. I could not get a hold of any more so I started snorting my Ridalin. It gave me a weaker experience but it worked. Soon I started snorting anything I could get my hands on: sugar, ridalin, prozac, and advil.",
  "Now I can never stop thinking about it, its always a temptation to call a dealer and get some. I would do anything to get some coke. One time lead to another and that lead to many more. It always sticks in the back in my head now. I can not stop thinking about it. I want it more and more. Everyday I think of getting some, but I must learn how to get over my temptations. Cocaine changed my life forever, it will always not matter what stick in the back of my head. I will never completely forget about it."
 ],
 "erowid": {
  "id": "1801",
  "citation": " Katie. \"There Was No Turning Back Once I Tried It: experience with Cocaine (ID 1801)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1801",
  "substance": "Cocaine",
  "views": "320891"
 }
}
