{
 "title": "The Them",
 "author": "Dharbigt",
 "citation": " Dharbigt. \"The Them: experience with Salvia divinorum (10x extract) (ID 23915)\". Erowid.org. Feb 28, 2006. erowid.org/exp/23915",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>I ordered 1g of salvia divinorum with treated leaves, which are tinctured with salvinorum-A extract. Specifically, I got the 10x standardized from an online supplier. I also ordered 10g of dried oaxacan salvia leaves from the same place. I checked to make sure it wasn't scheduled just in case and it still seems to be legal and without pending legislation of note.</p><p>The stuff is apparently not like any other drug chemically either. Not an upper, nor a downer. It's not an amine or a tryptamine. It's not a narcotic. It is not an alkaloid. There appears to be very little danger physiologically from the substance, however there are reports of some danger to one's self. At high dosages (when used in extract, especially) salvia or salvinorum-A can lead to such intense alterations of reality that hurting one's self may go unnoticed, and delusions/illusions/hallucinations may be so intense that such simple facts as 'which way is up' may cease to be apprehensible. One may forget if one is alive or dead, or even what sort of creature one is, and, of course, (at least for a time) cease to be able to use the necessary evidence to remind one's self of these facts. I must just be well-grounded... I find myself able to console myself and remember that it's cool and just enjoy the ride.</p><p>I can vouch that a dark room and a bed are probably a good idea, especially for a first trip, but a nice deep chair is not bad. A sitter is probably a good idea, especially in potentially dangerous surroundings. Swimming, using sharp, hot or explosive objects is strongly contraindicated. Driving a motor vehicle or operating heavy machinery is out of the question. I certainly recommend a good read, because there clearly are some (manageable) risks. Probably a good idea to have someone take your lighter away.</p><p>FIZZLE</p><p>The dried foliage is not unpleasant but not as pleasant as my old friend Mary. It delivers a sort of sparkly sensation and a mild euphoria, mild inhibition of thought processes. Not really fabulous to speak of, but better than nothing I suppose. I mixed it with damiana leaves 1:1 and smoked it 100mg at a time with a brass pipe. After maybe 1g I felt kind of like I was on benzodiazapines, without the drowsiness...and the weak end of the spectrum.  A little sparkly in the vision, and a little playfulness in the old thought process.</p><p>WHAM (Leaves + Extract 10x -- $20 for 1g)</p><p>The leaves with the 10x tincture applied, on the other hand, knocked me on my ass. As above, I loaded about 100mg into a one-hitter (a full hit). I took a pull and looked out into the room to sort of judge my vision, still holding my breath. I had that common thought of 'man, this isn't doing shit' which I sometimes have even when the shit is good. Well, the shit was good... a few seconds later I felt my heart beating a little faster from holding my breath so I let out my inhale and felt myself sinking. I cuddled up to my chair and thought the most pleasant thought I could muster -- setting the stage.</p><p>What followed is almost impossible to describe. It's been said that salvia cannot be compared to any other substance. Maybe, maybe not. It actually reminded me of nitrous oxide to a degree. I didn't see any special visuals other than the sparkliness of vision that is so common with other substances (including nitrous)... anything else I saw was probably contradicted by my indifference about seeing. One turns inward sharply and the whole world, whether seen or unseen, is in the mind. While salvia is not a depressant or a stimulant, one is definitely not out of line to say it leaves one 'on the nod'. Most people describe the sensation of being pulled backward or downward. Being 'sucked into' someplace and 'sinking' is also common.</p><p>Aside from that, there's not a lot of comparison I can offer. I will try to be descriptive, but it is difficult. Let me say first that salvinorum-A is a powerfully psychoactive compound and may well be the most intense thing I've ever experienced, including LSD and psylocibin. Motor function was reduced to zip. A light sweat broke out. Then came a long and interesting head-trip. Total duration of departure was probably 5-10 minutes or so. Following this, there was a slowly lifting fog that lasted perhaps 30-45 minutes longer, feeling slightly hung-over. By the time two hours had passed, everything was back to normal. I wouldn't mix this with any other psychoactive substances to start with (and have not yet).</p><p>Many accounts mention certain entities as part of the trip (and I believe the term 'trip' to be appropriate here). This can be a G/god or G/goddess or a group of gods or goddesses. Mexicans refer to 'las mujeritas' in reference to the sensation of this/these entities. I prefer to refer to it simply as 'the them'. In my experience, the them are most definitely present for every journey. I did not see any of the them, but I did 'hear' them talking amongst themselves and also talking to me. One 'hears' with one's mind, obviously, and so the conversation is seemingly telepathic... in my experience, they are communalistic and are eager for you to join them. They seem to be wise, but maybe that's just because they come from somewhere I do not. Other accounts describe being laughed at by the them, taunted by the them, escorted or told great secrets by the them, and some even go so far as to say they are tortured by the them. As with many trips, I suppose it is all mindset.</p><p>Not too long before the trip I had taken an internet quiz that purports to tell one which level of hell one is likely to end up in according to Dante. I completed the quiz only to find I was in the devil's company on level 9. So, depending on how you see that, I could have had a pretty big hang-up and felt like I should be punished, but for whatever reason (probably because I don't believe in hell or the quiz or both) I didn't have any struggles or conflicts with the them. The most common report I read is from people who claim 'not to have taken lady salvia seriously' and who were taunted as a result. Maybe the them just like me more than they like these other people. I don't know.</p><p>THE MEANING OF THANICHROTIZE</p><p>There is one part of the experience which I am slightly hesitant to share, but for the sake of completeness and because it was really rather cool, I will share it with you anyway at the risk of offering 'too much information'.</p><p>At one point in my second trip, I 'saw' the vision of a woman with whom I have some acquaintance. The them asked me in a rather solemn way whether I had feelings for this woman and I admitted that I did. They then asked me if I would like to 'thanichrotize' with her. I was not aware what this was, but I got the clear sensation that it was some sort of expression of affection. I assented to 'thanichrotize' with her. And thanichrotize I did. Essentially, over the period of what seemed like one or two minutes, I was mentally enveloped with the feeling of her presence. Her spirit and the vision of her eyes overtook me and, while still immobile, and without physical sensation of any kind, I had what felt to be an orgasm of seismic proportions. After it subsided I was so awed that I couldn't help but laugh at the queer splendor of it all.. that and I was still pretty buzzed. Once I came to my senses enough to regain motor function I took myself to the bathroom and verified that this had indeed been a physiological as well as mental episode, which ample evidence found in my drawers did indeed suggest. Enough of that. Hopefully you can see why this seems relevant to my description of the substance and its effects.</p><p>ETC.</p><p>The substance is conducive to laughter in my experience. Others seem to find fear... that the them are a sort of mad bunch with a very under-the-stairs quality. I can see how that could be so, considering how mindset effects these psychedelic types of trances. One definitely becomes a little detached from one's moorings... and I think it's safe to say that a delusional state of some sort or other is assured, whether it be that one's eyelids are one's only connection to this universe or perhaps that one is being scraped slowly out of this reality into another one. These delusions are hard to describe because they are so illogical and atomic in nature. One just has the 'feeling' that so-and-so is true and so it is, like that the world is closing like a book (which may be your eyelids or a blanket or just your perception) and the darkness is sweeping in. I think the most important part of it all is not to fear whatever it is. Remember that the world is-- and all worlds are--  filled with light.</p><p>I would suggest a mint or hard candy if one has the self-possession to keep it in one's mouth. The sensation is quite appealing during the trip and it helps with both the salivation and the slightly-off taste of the leaves (sort of like smoking October foliage straight from the yard). Two of my 200mg trips led me beyond salivation to drooling. It has been my experience that if one 'packs one's mind properly for the trip' it can be very insightful. If one goes bearing a question, one often returns with an answer. If one goes looking for adventure, I imagine one would find it. I have mostly gone just to see what is there and come back.</p>",
 "year": "2003",
 "id": "23915",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-02-28T08:00:00.000Z",
 "views": "6317"
}
