{
 "title": "Zero Recreational Potential",
 "author": "Phantazm",
 "citation": " Phantazm. \"Zero Recreational Potential: experience with Quetiapine (Seroquel) (ID 23933)\". Erowid.org. Feb 11, 2004. erowid.org/exp/23933",
 "substance": "Quetiapine (Seroquel)",
 "bodyweight": "200 lb",
 "report": [
  "<p>While this experience was not accidental, the effects of the drug in question (Seroquel) were not as intended at the time of dose.",
  "A total of 600 mg of Seroquel was taken orally over a period of 15 minutes.  Each 100 mg tablet was taken whole with a swallow of water.",
  "Intended Effect: Sleep (Previously unsuccessful at lower dosages, such as 200-300 mg)",
  "-------",
  "After battling depression for several years, a doctor seemed to have gotten it under control with Effexor and Amantadine.  Unfortunately, this doctor was relieved of his duties (at the clinic at which I was a patient).  The replacement doctor was kind enough to provide me with some Seroquel as a sleep aid and as an anti-psychotic (I'm bi-polar).",
  "After many failed attempts to sleep at the suggested dosage of 25 mg (he said I could go up to 200 mg) and up I decided I was going to try a LARGE dose.",
  "Now, I did not do this blindly (not saying it wasn't dangerous, but MANY people have overdosed FAR beyond what I did, and lived) I spent several manic hours researching the effects of an overdose.. among them, 'fainting', 'passing out', 'coma'.  AKA -- Sleep .. or so I thought.  Also, hallucinations were among the 'side effects' and OD effects.",
  "About 15 minutes post-dose I felt very drowsy.  I laid down on my bed and began to experience hallucinations far beyond what dimenhydrinate (Benadryl) produces.  Open and closed eye visuals were unavoidable and actually quite scary!  At this point, I had no sense of time what-so-ever, but vaguely remember getting up to go to the bathroom.  I remember my limbs being VERY heavy.  It was difficult to walk, yet somehow I made it to the bathroom.",
  "The next thing I remember is waking up about 18 hours after I had taken the Seroquel.  I didn't have a bad hangover, yet it was definitely present.  Again, I didn't intend for this to happen, and this experience is intended to DISCOURAGE the use of Seroquil as a 'recreational' drug of any kind.  In my opinion, it's recreational potential is zero.</p>"
 ],
 "year": "2003",
 "id": "23933",
 "gender": "Male",
 "views": "64369",
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2004-02-11T08:00:00.000Z"
}
