{
 "title": "Fantasticly Real Hallucinations",
 "author": "Paradox X",
 "citation": " Paradox X. \"Fantasticly Real Hallucinations: experience with Dimenhydrinate & Amanitas - A. pantherina (ID 23947)\". Erowid.org. Jul 22, 2007. erowid.org/exp/23947",
 "substance": "Dimenhydrinate & Amanitas - A. pantherina",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   "",
   "2 caps",
   "oral",
   "Amanitas - A. pantherina",
   "(tea)"
  ]
 ],
 "report": "<p>It is now the day after my fourth experience with dimenhydrinate.  I have been purchasing this drug at the local pharmacy.  The generic motion sickness tablets cost $3 for 30 pills.</p><p>The first trip, I decided to play it safe and take 8 pills (400mg dimenhydrinate).  I would say that was about perfect for the first time.  It allowed me to understand the nature of the trip, and feel the side-effects, without feeling that I was going insane, or on the brink of death.  I did not experience any true hallucinations.  I did see the strange translucent film over everything, as described in many reports on erowid.  I also experienced some closed-eye-visuals (CEVs) remeniscent of those experienced on LSD or mushrooms.</p><p>The side effects included: need to urinate frequently, dryness of the eyes and throat and drowziness.  Eventually I gave in to the tiredness and slept.  The next day I felt fine, although a little 'dreamy.'  I would not describe this trip as particularily 'good' or 'bad.'</p><p>The second trip, I took 12 pills (600mg dimenhydrinate).  This trip started similarily to the first.  On this trip, however, I began to hallucinate.  I heard people calling my name from outside, and would see bugs flying around the room.  When I closed my eyes, I had strange visions.  I would see fantastic imaginary worlds.  These images would flow and melt into one another.  This process reminded me of previous DXM trips.  Again, I felt ok the next day.</p><p>The third trip, I took the remaining 10 pills (500mg) from the first box of 30.  I decided to try something that im not aware any one has tried, and also drank some aminita tea. The tea was made with 2 aminita pantherina caps steeped in about one litre of water.  The pills kicked in quickly, about the same time that the tea was ready, about 40 minutes after the pills had been consumed.  I drank the tea and screwed around on the computer for another half hour or so, before retiring to my bedroom. </p><p>I lay on my bed, quite ammused by the strange, rippling film over my walls and celing.  I began to get drowzy, and closed my eyes.  I again experienced strange visions of ethereal worlds.  Eventually I started blacking out.  I would dive into these strange worlds and begin exploring, only to awaken and wonder what I had just seen and experienced. </p><p>During one of these blackouts, I moved to the bathroom.  I didn't turn on the light before I closed the door.  That one oversight provided for some of the strangest tripping I've ever experienced.  By this time I was very high on both the dimenhydrinate and the aminita pantherinas.  I crawled around the bathroom, flowing back and forth between unconscious and semi-conscious states. </p><p>When I finally returned to a conscious state, I found my self urinating on the wall.  I realized what I was doing, and fumbled around for the light switch.  When the bathroom lights came on, I cleaned up the urine, and noticed my pants lying in the corner of the room.  Apparantly, I had urinated in them, then discarded them, before continuing my trip.  I picked up my pants and returned to my bedroom.  By this time it was about 4:30am.  I had consumed the motion sickness pills at about 7:30pm.  I crawled into bed and fell asleep.  Although I would not really describe this trip as 'pleasurable,' it was a good, fascinating experience.</p><p>Yesterday, I bought another 30pack of motion sickess pills.  This time I started with 10 pills, and as the trip progressed ingested 8 more, for a total of 18 pills, or 900mg dimenhydrinate.  This time I had full out hallucinations.  I saw tiny little colourful bugs crawling over my bed.  I could even pick them up, and feel them between my fingers.  I looked out my window and saw a large glowing ball of energy hovering beside my room.  There were people talking to me, including my boss, some of my friends, and some strangers.</p><p>Looking out my window, I would see cats or people walking down the street then fading out of existance.  At one point I saw some big-headed, ostritch-like birds battleing on my neighbors' lawn.  I saw some strange translucent shapes moving around both inside and outside of my room.  These shaped did not seem to be part of the sheet of gel that covers everything on a dimenhydrinate trip. They seemed to be individual entities.  I must say, I have seen very intense visuals on LSD and mushrooms, but I had never truely hallucinated before this trip.  There were times when I actually thought that there might be bugs in my bedroom, or that someone outside was really calling me. </p><p>My eyes were somewhat itchy and my throat was very dry.  I contemplated taking some cough syrup, both to ease the throat and to add to the trip, but the only bottle in the house contained an expectorant, and I had no idea how the expectorant might react with the dimenhydrinate.  Dimenhydrinate is a very strange drug.</p>",
 "year": "2003",
 "id": "23947",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-22T07:00:00.000Z",
 "views": "7353",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ]
}
