{
 "title": "Liquid Overdrive",
 "author": "Xaos",
 "citation": " Xaos. \"Liquid Overdrive: experience with Mushrooms (ID 23965)\". Erowid.org. Mar 31, 2006. erowid.org/exp/23965",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "report": "<p>It was in the summer of 2002 that I had my first and only experiance with mushrooms. I live in Florida and have (since I can remember) been taught that I should never eat wild mushrooms.</p><p>Only later in that summer did I find out why.</p><p>My roommate (who has been my best friend since 2nd grade, and thus all but my brother in blood,) his girlfriend, and myself, were spending a Saturday night watching movies in our apartment. A friend of his (who I absolutely did not trust, and now despise) stopped by about 2 a.m. in the morning and asked if we would like to go shrooming in a safe spot (a field whos owner he knew.) My friend (rather drunk) immedietly agreed. I was completely sober and so I naturally agreed to come with him to make sure he did not get into any trouble.</p><p>We got to the field about 3 a.m. , and my roommate and I collected approximately 20-25 mushrooms, of which 8-10 of the caps were approximately 6-10 inches in diameter. The remaining 10-15 were 2 inches or less in diameter at the caps. We had never been shrooming before. We had to go on the description of the right type of mushrooms to pick that we had been given by his friend. At least 6 of the 8-10 were Purple Ringers (which I had researched and knew to be good for tripping) all the remaining shrooms were supposedly immature Purple Ringers (they had caps that had a nipple and a small ring, but were not purple).</p><p>On the way home, we asked his friend if we had gottend the right shrooms. He said 'yes those should be enough to fuck both of you up.'</p><p>We got home and put the shrooms in a blender, it filled about 2/3 of the pitcher. We then puoured orange juice up to the top of the shrooms, about 1/2 a quart, and pureed it. We filled 2 carafs with the mixture, which we later found out was about 1 liter each, and chugged it.  We then ran straight to stotr (which was about 2 blocks away,) and bought a pack of cigerrettes. When we got back into the car we already felt a body buzz.</p><p>We got back to the apartment and smoked one bowl of Krypee out of a gravity bong (shared between the two,) and then set down on the couch. By this time approximately half an hour had passed since we had chugged the shrooms. No more the 5 minutes had passed since sitting on the couch when I knew we had drank WAY too much of the shrooms. I looked at my friend and knew he was thinking the exact same thing, but of neither of us mentioned it. 15 minutes later I was already wishing that it would stop.</p><p>I was still sitting on the couch, but it felt like I was being launched into space on the fastest vehicle I could imagine, and that vehicle was accelerating exponentially. That is the closest I can come to a description of what my trip felt like. I could never put into words what I felt or thought. It is just not possible. I will, however, do my best to describe the things I can.</p><p>It was the most terrifying, enlightning, and profound night of my enitire life. I knew and still know that nothing I will ever experience can equal the intensity of that night. Unless of course what I experienced as the process of the brain dying is true.</p><p>After 1/2 an hour, I was in my apartment, but recognized nothing. I didn't know where anything was, the entire living room was moved around and I had no idea where where our entertainment center was when I tried to find a movie. I could not remember where anything was, and failed to recognize anything. I lost connection with my body, and could not feel my legs. I watched myelf walk around like I was watching thru a security camera. I remember tripping over a glass I couldn't see, but was there. We tried to wake my roommate's girlfriend up while we still had some concept of reality, but it was about 5:30am at this time, and she had no idea how fucked up we were. Anytime I looked at my best friend he had three faces, much like the Living Tribunal from Marvel Comics.</p><p>After 40 minutes I began to lose touch with reality. All similiar colors started to blend together. So when I looked at the wall, it did not look like a wall. Instead, it looked like a computer moniter running one of those psychedelic screen savers that looks like plasma oozing randomly, only it had geometric shapes repeating in rows and columns all over it like patterned wall paper, only the shapes were constately rotating and changing in size and shape. You must remember this was real to me, and that everything looked like this. It was when those shapes began to change into Swatzikas that I started to become scared.</p><p>The worst part was not being able to control my own thoughts. My brain randomly shot off in tangents and I could not focus any thoughts. I had never heard of this happening before and was not prepared for it. I knew it was only a matter of time before I would go insane.</p><p>We all have a stream of consciousness. A voice in our head that is constantlay talking, whether we want it to or not. I began to notice that the voice in my head was thinking on it's own. Not only that, everything it said began to repeat itself. Over and over and over and over and over. Everything I thought and everything I heard repeated itself. Anytime my friend said 'this is crazy,' I had his voice in my head repeating over and over again 'this is crazy.' It was the same with my own thoughts. Only my own thoughts were not my own. I still knew who I was, but I had lost control of my consciousness. It was only a matter of time before It thought something Bad.</p><p>5 minutes later The Fear to set in.</p><p>It was in those few minutes that time stood still. 6:21 a.m. was a lifetime, I had more thoughts and more voices in my head than I had ever imagined possible. Everyone I ever had known was talking or yelling at me. I began to lose my grip on reality. Everything I could remember preceeding that moment seemed like a fraction of a instant compared to that one minute. I do not know how many times I told my friend this is the longest minute of my life, but I will never forget staring at that clock. The rest of those 5 minutes I have all but forgotten, but I do remember trying to go to sleep. NEVER do that, it felt like no less than a years worth of time, but it was less than 2 minutes.</p><p>As I said, in those 5 minutes the fear began to set in. It is hard to describe, but anyone who has been through it knows EXACTLY what I am talking about. It is the KNOWLEDGE, not the THOUGHT, but, REPEAT, the KNOWLEDGE, that I am going to die.</p><p>That night I KNEW I was going to die.</p><p>I was sure of it.</p><p>So sure, in fact, that I actually felt myself die.</p><p>This is where the trip becomes very hard to describe. I was in my room, sitting in a chair. I saw everyone of my friends walk into my room one by one, until they were in a group and they each told me the same thing. I was about to die, and that I would feel the most intense pain I could ever imaginge, but that it would be okay.  I than felt the most intense and focused pain I have ever felt in my fingertips and toes, it slowly spread all the way through my body to my heart. Once it reached my heart it felt like my entire body was on fire. Slowly, starting at my figertips and toes, all of the pain began to migrate to my heart. Eventually, I felt all the pain I could ever possibly imagine in my heart, until it stopped. Of course I was just hallucinating, but I actually felt my heart stop and I KNEW I had died.</p><p>At that point, I would estimate about 6:15am, I entered what I can only describe as a waking dream.</p><p>I could see and feel every hallucination that I was having, but I had no control or even consciouness or awarness of who I was or that it was a hallucination. There was NO self awareness. I remember I was in the afterlife, and that nothing mattered. I was completely alone and had all of eternaty to do whatever I felt like, so I took off all my clothes and was walking around my apartment naked. My best friends girlfriend was fully awake and had realized what was going on by this time, so she had called another friend of ours who came over to watch us both and make sure we didn't hurt ourselves. I had awaken my other roommate by this time when I walked into his room repeatedly, and said 'don't drink the shroom juice.' In my trip, which was like a dream, they all appeared as angels, and were my guides in the afterlife.</p><p>In reality, all they told me was 'put your pants on.' I remember thinking I was going to fight in World War II, and many other things that would just seem like nonsense to someone who has never had an experiance like this. Please remember it was like a dream, and like a dream, I have absolutely no control over what goes on. It is like watching a movie as if I were the projector.</p><p>I had this experience about 9 months ago, and have never even thought about touching any shrooms again. Do not mistake this, I saw and felt things that I could never imagine in a million years. When I died I saw the entire Universe from beginning to end, then in reverse from end to beginning. I could feel the light coming through my window as the Sun rose, but for every good thing I saw and felt, I saw and felt its evil twin.</p><p>Not a day goes by that I do not think about that night. My friend had a similiar trip, except he thought he was falling through Hell.</p><p>I can't (and don't want to,) even imagine the things he saw and felt.</p><p>I have since talked to other people who have had similiar experiences (dying, walking around naked, uncontrollable thoughts, etc.) since this has happened.</p>",
 "year": "2002",
 "id": "23965",
 "gender": "Male",
 "timestamp": "2006-03-31T08:00:00.000Z",
 "views": "3522",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(liquid)"
  }
 ]
}
