{
 "title": "Ruined My Life",
 "author": "Anonymous",
 "citation": " Anonymous. \"Ruined My Life: experience with Oxycodone (Oxycontin) (ID 23974)\". Erowid.org. Jun 25, 2007. erowid.org/exp/23974",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>Well it all started when I just turned 16. I had been smoking pot for about half a year now and was in search of new highs. I had thought about trying everything from heroine to cocaine, but hadn't..Then I remembered my older brother stealing my moms pain medication and snorting them at a friends while we were playing Halo on XBOX. He asked if anyone wanted the last line ,I wanted to say yes but he restricted me to only smoking pot, so he went ahead and did the line.</p><p>Well, about 4 months ago I stole my first 3 pills from my mother, they were called Oxycontin.I had researched them on the internet a lot trying to find out how much to snort. I had seen several cases where people overdose at 60 - 160 milligrams. Well, me being depressed went for 80, that was 1 oxy (O.C.).</p><p>So I then went to school on this great high, but immediately some friends noticed and I told them I was on top of the world, and yet so relaxed. I told me girlfriend and she said she was scared for me, I reassured her I knew what I was doing. But about 25 minutes into band Im in percussion, and I didnt do a thing there so I was just standing there chillin with a friend and I told him I wasnt feeling too swell..</p><p>I started to feel really nauseous really fast right then, so I threw up right next to my friend, well band was really loud so no one noticed, so I ran to the bathroom and got some paper towels to clean it up. Long story short, I threw up about 7 times before I went home and puked my brains out! It was all cool though..that was 4 months ago, now I am an addict who has been kicked out of school (got caught with cocaine and O.C.)..I am now on probation for 6 months and if I stay out of trouble the charges get dropped and everything is forgotten.</p><p>O.C. has ruined my life, as I sit here listening to Marilyn Manson I now realize it ruined the relationship with my girl, my family and friends and my entire life, Im going back to school next year as a changed person, not going to hangout with the druggies at all.</p><p>Stopping has been the hardest thing in my life. I used to steal them from my mom like it was nothing. I was abused up to 60 milligrams of O.C. everyday throughout school for several months. I was a district cross country champ and my health had gone down the drain.</p><p>I have now started to run and workout, but I have the withdrawals so bad, it seems like all I think about is the girl that I used to have, now I dont think she will ever be with me again.</p><p>And since being kicked out of school I havent had a cigarette, smoked a joint, or even had a drink of any alcohol, or snorted a damn thing.</p>",
 "year": "2003",
 "id": "23974",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "7251",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "80 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 ]
}
