{
 "title": "The Curiosity of Not Knowing",
 "author": "V. Herschoft",
 "citation": " V. Herschoft. \"The Curiosity of Not Knowing: experience with Mushrooms (ID 240)\". Erowid.org. Sep 2, 2001. erowid.org/exp/240",
 "substance": "Mushrooms",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "3.0 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>What I took I am still not sure about to this day, but it has no resemblance to any psilocybin trip that I have heard of and is a lot closer to the LSD trips that I have heard of.  Of course many people say that the trips are very similar.  I had done shrooms once before with a friend and had eaten an eighth of them then as well.  I smoke marijuana a little more than occasionally and was intrigued with tripping.</p><p>Christmas break was arriving and I was to go home for it from college.  I was bringing a whole half of an ounce for me and my friends.  The night that we decided to do it turned out very awry.  My ex girlfriend and her friend came over and my best friend and me and them ate these shrooms at nine o'clock PM.  We ate them with Teddy Grahams, which makes them quite tasty.  They were dried and covered in blue something.  Stripes of blue all up the sides and everything.  In our haste we walked right by my parents and I realized that I forgot to say goodbye, something odd.  I said that I should go back and I went in to talk to my mom.  She tried to engage me in conversation and I noticed that I was having massive problems with communication.  I was already tripping!  That is one thought as to why LSD might have been on it.  We drove up into an area called the Canon behind my house and we decided to walk around.  It was cold, though and we soon came back to the car to sit and wait for the onset of the shrooms.  I was already feeling very, very odd.  I was laughing almost uncontrollably at everything and I realized that I was really tripping when I couldn't stand being in the car anymore.  I was squirming all about and even started crawling all over the seats.  So, we got out of the car to walk. </p><p>Nobody was quite feeling it yet except for me.  A bad part was probably that I was doing it with my lovely ex only three weeks or so after we had broken up and maybe two after she had screwed another guy and only after she had come back to me.  Emotional problems were very hard that night.  I noticed that I couldn't explain very much very easily as we were walking.  My ex was laughing hysterically and I realized that I wanted her to shut up so I turned around and screamed at her, not feeling what I was actually saying.  I wanted to hug her and tell her that I was sorry, but I was completely afraid of anyone touching me.  Especially my best friend.  He had the appearance of a circus clown in a certain light and I wanted him more than anyone not to touch me.  Well, he was the only one that would come near touching me.  I was pacing in circles and raving in my head, thoughts going so fast that I don't remember what they were.  I remember my ex dancing in the street like a little hippie and her friend being completely stagnant, so I stopped paying attention to them.  I stepped off of the road for a car and in the snow (the melted holes to the ground) was a face of a skull staring at me, gaping with its jaws in a sinister laugh.  I remember then that everyone was in the snow piling it into their faces and my friend Ian was raving about how we needed to be with our friends and go to the woods.  I was afraid of the skulls and bones in the snow so I stayed on the road, which enraged him.  I started to see a low humm on the horizon of mixed colors, blue, green, red, yellow, it was beautiful. </p><p>I then looked to the sky and I saw the stars melting downwards.  They were very pretty and I asked one for its permission to hold it.  I then reached up ito the sky and pulled it down to talk to it.  I played with it for a moment and then let it snap back into position as though rubber attached it to the sky.  Then the stars took me over, I battled them.  They captured me and all that I can say was that I was locked into their gaze with this orgasmic like feeling all through my body.  I know that I was moaning very loudly as it felt amazing.  When I finally accepted the stars into me I saw the face that was in the stars.  Later I associated this face with god, but not until later.  At this point I was just communicating with it through my mind.  My ex's friend had grown cold (she had eaten maybe a half of an eighth) and she had my ex walk back to the car with her.  I knew that I was losing my mind and that I was on the verge of not being able to make rational decisions, so I voted to follow them as Julia, my ex's friend, had thoughts of real things like cold which I could only understand that I could not understand.  She seemed still sane to me. My friend, Ian, was in the bushes raving about how we were all fucking idiots and we could not leave it behind.  I somehow convinced him to come with me, I think because he cared about me and knew that I was too scared to stay without the sane one, Julia.  I went to them and just sat under a streetlight with my ex thinking and telling Julia that she was sane and I didn't want her to leave or we would be lost.  She decided to walk home, about three blocks, and then we were lost. </p><p>Ian returned to the riverside woods and my ex and I sat raving in a streetlamp aura like maniacs.  We had taken some vitamin C because of what we had heard about how it makes it better.  I subsequently had the bottle in my sweatshirt pocket.  I started thinking then for the first time about how she had screwed that other guy because she started saying that she could not differentiate between there and where she goes to school.  Well, she was trying to say that but it kept coming out that she couldn't tell the difference between me and her fling-buddy.  I didn't care at this point, I thought that it didn't matter because it happened, oh well.  Then I turned and in my hood I saw LONG blonde hair next to my face, like her fling-buddy had.  I thought suddenly that I was him and he was me.  The reason that she had confused the two places was due to the fact that he did things like go insane on drugs and her image of me was always a little more conservative, although I am quite the opposite.  Well, I suddenly became filled with the idea that this guy and I were one complete person and we were individuals of a single human side.  He was happy, goofy, joking, flirting.  I was romantic, serious, thinking, loving.  We became one at that moment. </p><p>Then I turned away from her and looked to the tree.  Again, like with the stars, I became rapt with some odd power that overtook my entire body.  It screamed into me and I stared at this tree as it froze with a solid sheet of ice over it and then turned into a face of an old man, quite like the stereotypical god image with the beard and heavy brow.  We communicated for a while through our minds and expressions and then he turned into man, many faces.  They were all staring at me when one of them looked at me as though I had stepped on its toes.  I turned and ran away.  Not remembering this I had in that time thrown the car keys at my friends because they were cold and needed to get warm. That was about the only rational thought that anyone had all night.  They were now sitting in the car and I approached it with an intriguing curiosity.  I passed the car and looked again to the sky.  It spoke to me.  When I finally did approach the car I opted for the passenger side as my best friend was in the drivers seat and his goofy faces and hysterically fast moving manner was pissing me off. </p><p>I had already begun talking the vitamin C bottle and communicating with it.  It kept telling me to eat them so I was sucking them down one after another.  I finished off half of a very big bottle quite easily.  Approaching Tiff's side I realized that I needed help, why I don't know.  They had to open the door for me, though, because I could not figure it out, what it was.  They opened it and I still didn't know if I wanted to get in or not.  What followed was a ravingly lunatic conversation consisting mostly of the word 'fuck.'  I was yelling at my best friend because he would yell at me to get in the fucking car and I would almost decide to when I would yell at him to shut up and he would.  Then he would turn and yell again and betray me so I always ended up walking away and talking to the stars again. </p><p>Then, one time, I went over to his side.  I looked at his face and he turned and smiled at me and he was satan.  He had been banging his head on the window and had two lumps where horns would be, so they were there as were the fangs dripping blood and the fire in his eyes and also the music.  At one point before I had looked at him sitting among some rocks that appeared to me as piles of dead and bald bodies committing very sinful acts of the flesh.  In his shirt stripes when he became satan were those bodies again, fucking like mad.  Well, I was not scared of this, but actually quite aroused and intrigued and also it set me into a stir of comedy.  I felt associated in no way to either one of these people at this point.  My ex had become a mannequin with a flapping jaw at one point and was now a dripping mushroom candle that I had an amazing urge to 'hop' on top of.  She was dripping all over herself like a candle.  My friend had taken a bag of her belongings and thrown them all over the place.  He was also throwing weeks old tortillas at me with vengeance and I was a raving lunatic.  I could have easily been committed as all of us could have. </p><p>I looked up to the trees to escape the lunacy of the other two (I felt sane while they weren't, even though I was actually worse) and I saw a very sexy, feminine tree and my mind took note of it as it stretched high above me, higher and higher.  Then I looked to her right and there was a small and dumpy pine tree that was very angry at my attempts to hit on his wife.  I didn't want a barroom brawl, so I walked away and told him that he had had one too many.  Then as I returned to the car a cop pulled up along side the passenger side where I was standing.  He immediately rushed us and accused us of being drunk.  There was stuff thrown all over around the car and Tiff had been nibbling on the tortillas and making a paste out of it and putting it on the seat.  When he accused us I retorted loudly that we hadn't been drinking, as we hadn't.  He asked us then why he smelled it so strongly.  As he looked in the rear windows with his flashlight I made a small attempt to bite his neck but the noise of it caught his attention too quickly and his gaze returned, calming me down.  He told us that park hours were over and that we should leave. </p><p>A sense of rationality did overcome me at that point and I opened the door, got in and we drove off.  Driving up to Tiff's house I looked at my skin and saw the ivy crawling all over it. The trees outside were changing colors and the road was swimming away from us.  We made it safely, I don't know how, and went up to Tiff's very happy room.  I looked into the mirror and saw my face melting everywhere.  Lucky that I was in Tiff's home as it was my second home for the previous year and a half.  I could move my face like it was clay and all of her feminine condiments were swimming atop the counter.  They were ebbing like the ocean.  I went into her room and sat on the floor.  Ian was on the bed hoping for nothing more but to be sane again.  For some reason it didn't hit me that anything out of the ordinary was happening.  I was playing with Tiff's miniature poodle and it was jumping to and fro leaving itself all over my hands.  The floor was ebbing like water and I had the most tremendous sense of comfort and warmth. </p><p>I was looking into Tiff's eyes and realizing what children we had been for so long, fighting with each other and such.  I knew then that I loved her perfectly and beautifully.  She was looking at me with the same warmth.  Ian, not feeling very at home, was almost crying.  I had him sit next to me on the floor and I just held him.  I held him and soon Tiff crawled up under an arm.  I felt so much love and I never wanted it to end.  I felt as though I would have been happy sitting in that room forever just holding them.  They felt like the warmest family that I had ever had.  I didn't ever want to leave and I almost started crying because I knew it would.  I was holding Ian when I realized that I could easily kiss him romantically, that I was sexually attracted to him.  That was the start of my acknowledgment of my bisexuality.  It was so amazing.  I felt at home and complete for the first time in my life.  I was watching the walls melt all around me and it was so amazing.  At that point it was around three in the morning. </p><p>We drove around and looked for Julia after that because we did realize that she could have gone anywhere if she had lost her mind relatively as badly as we had.  We couldn't find her and assumed that she had found her home because we had, even though she had no one else there.  We were still tripping hard and went back to Tiff's to cool down.  We watched the walls melt until around six in the morning when Ian decided that he needed to go home.  I watched the trees all around me growing and moving and knew that I was too afraid to be alone.  Tiff stayed at my house and the only thing that could comfort my eyes to sleep, around nine a.m., was thinking about vanilla frozen yogurt.   I slept for a while and woke up still tripping hours later.  I had flashbacks very strongly for a long, long time.  In fact, I still do at night when we are on roads in a car or when I am typing at my computer, especially with music.  Whatever I took was beautiful, I am shrooming again this weekend.  I was blown away.  I highly suggest going insane for a night, it brought me into perspective.  I felt for a long time as if my life was simply building to that point and then I finally hit it, I finally was real.  Now I am whole.  It completed something in me that is unexplainable.  It made me realize that I had never matured past seven years old and at that point I went through every stage of maturing that there is. </p><p>",
 "year": "2000",
 "id": "240",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-09-02T07:00:00.000Z",
 "views": "6946",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
