{
 "title": "Writhing and Clawing",
 "author": "TheGreenPhantom",
 "citation": " TheGreenPhantom. \"Writhing and Clawing: experience with 5-MeO-DiPT & Syrian Rue (ID 24026)\". Erowid.org. Sep 9, 2003. erowid.org/exp/24026",
 "substance": "5-MeO-DiPT & Syrian Rue",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "18 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)",
   "",
   "3.0 g",
   "oral",
   "Syrian Rue",
   "(capsule)",
   " T+ 1:28",
   "1.0 g",
   "oral",
   "Syrian Rue",
   "(capsule)"
  ]
 ],
 "report": "<p>11:07 pm</p><p>Finally I have some time alone, so I've decided to drop ~18mg of 5-MeO-DiPT with around 3g of powdered Syrian Rue, which is in capsules. The plan is to meditate the rest of the night, open up my meridians.</p><p>I've taken foxy at this level 8 times before, but never with a MAOI.</p><p>11:18</p><p>Starting to feel a little light headed, with a sensation at my solar plexus that's too weak at the moment to catagorize.</p><p>11:25</p><p>I'm going to smoke weed now to help me through the come-up. Tryptamines often have the affect of making me feel depressed while they kick in; the weed helps me with that.</p><p>11:30</p><p>Colors seem brighter. If I stare at a certain spot, by slowing my breath and breathing out with slight throat friction like I'm sighing, I can make everything in front of me look farther away.</p><p>The moon is low tonight... just below the treetops.</p><p>12:04am</p><p>Blood pressure 130/100.</p><p>12:18</p><p>No audios. No visuals.</p><p>12:35</p><p>Took an extra 1/3 teaspoon of syrian rue.</p><p>...The rue has a definate sedative effect... I feel mellow right now, but I'm not really tripping.</p><p>12:42</p><p>The rue has given me slight ataxia.</p><p>12:51</p><p>Feel a slight foxy-ish buzz going on... feels like an extension of the pot, thogugh. My limbs feel light -- like they're composed of air. CEVs are dreamy... a little more visual than when I'm just on weed alone.</p><p>12:58</p><p>Finally getting visuals!</p><p>1-6am</p><p>The come up is hard. Only writhing in orgasmic bliss seems to stop the harsh body load. Breathing is heavy and labored.</p><p>...I'm a total sexual nerve...</p><p>...my sore throat is gone...</p><p>...sexual charge is enormous!...</p><p>...just watched some porno (man, people fucking look weird when you're tripping) and jizzed about 5 minutes ago. I'm already charged up again....</p><p>...the body load is TOO MUCH with s. rue! I'm completely tired, but my body wants to writhe continually like I'm about to orgasm... this is very, very annoying!</p><p>I can't stop moving for even a second. When I do, within a few seconds I'm back to twisting around on my bed or floor, moaning. There's complete sensory close-out.</p><p>12:30pm (following afternoon)</p><p>That had to be among the worst trips I've ever had. After wacking off, the body load just kept building and building, causing more or less sensory black-out and incesant writhing. I could not stay still, meditate, and enjoy the trip for a second. I basically lost all control of my physical movements (to an extent). I kept having to jerk around and writhe.... I imagine what I experienced was somewhat similar to what people with Parkinson's go through.</p><p>Dreams/hallucinations consisted of very large, squat and round people with severe cases of edema hooked up to blood monitering devices in a nursing home.</p><p>Midway through this excrutiating ordeal, when I threw up raisins and an orange in my kitchen sink, I remembered that AMT is also a MAOI. I'd gone through this experience before when I'd done 60mg AMT with ~12mg of Foxy 6 hours into the trip. Upon realizing this, I could almost hit myself.</p><p>I finally managed to sleep it off around 6am.</p><p>The rue still has me K.O.ed. I have a slight temporal headache, bilaterally; no energy; my heart rate is ~120 bpm; and tingling extremities.</p><p>________________</p><p>Afterthoughts</p><p>Shit kids, stay away from mixing 5-MeO-DiPT with any MAOI! At ALL costs!!!!</p><p>The body load was enough to make me go insane for a little bit. I really could not take the incessant need to twist and claw at my mattress nor the visuals of repulsively bloated humans hooked up to blood cleaning machines and catheters. I started screaming at several points that I wanted the trip to be over. If I wasn't a seasoned user of psychedellics, I might have turned myself in to the ER. At points, the trip was downright scary and the thought crossed my mind that I was getting brain damaged.</p>",
 "year": "2003",
 "id": "24026",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-09-09T07:00:00.000Z",
 "views": "10147"
}
