{
 "id": 2405,
 "title": "The Detached Symbols of Self",
 "date": {
  "submission": "2002-12-05T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nowhereman",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "85 g",
   "administration": "oral",
   "substance": "Psychotria viridis",
   "form": "leaves"
  },
  {
   "time": "0",
   "amount": "7 capsls",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "ground / crushed"
  },
  {
   "time": "0:30",
   "amount": "7.5 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "0.3 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 10x"
  }
 ],
 "report": [
  "170 grams of Psychotria viridis was prepared using the lemon juice extraction method.  This concoction was split between my friend N and me.  This dose is not nearly as high as it seems on account of severe degradation of the P. viridis (it lost approximately 2/5ths of its potency from age and unavoidably poor storage conditions).  7 double zero capsules were filled with ground harmala and swallowed an hour before drinking the putrid brown-green liquid.  Beforehand, we had mixed two table spoons of sugar into each of our 3/4ths cups of extract and it seemed to help a lot.  N and I sought solitude in separate levels of the house.  Later we would meet up and I would futilely stammer out a few phrases of thought (directionless babble) from the experience to him.",
  "A half-hour later I began to feel the usual nauseous/trippy flavor of the onset.  After a quick, grueling, puke I was at a +3.  The coding of symbols underlying my perceptions was visible.  Flat surfaces were covered in a particular style of symbol while objects with depth were covered in symbols whose shapes and dynamics changed in relation to how close they were to me.  To use a generic though wholly relevant example it was like the end of the Matrix.  Little else was occurring though and I was nervously eager to get started (this undoubtedly had a lot to with why little else was occurring).",
  "With some apprehension I lifted the bong off the floor in front of me.  It was packed with about a 1/3 standard sized bowl of salvia 10X and between 5 and 10mgs 5-MEO-DMT.  This particular combination of substances was new to me and I had never heard of anyone using it before: for the mind there is no greater death than to be annihilated on the front lines of experience. ",
  "Annihilated I was, but I was reassembled, the birth pangs were terrible and beautiful. ",
  "Maybe ten seconds after the bong left my lips the experience began.  The 5-MEO was first off the starting line but the Salvia soon caught up.  The Salvia wrapped itself around the 5-MEO both multiplied in effect by the harmala; they diffused into each other to create a new incredible hybrid that rode on the crest of the ayahuasca.  Before my eyes there appeared a confused asymmetrical symbol that repeated itself in patterns moving at first to the right and left, then in many directions both familiar and impossible.  My skin was being scorched with chemical fire; I erupted in sweat then opened my eyes.  I: a cloud of dancing symbols had been scattered to the wind, each piece repeating itself in countless directions along with other pieces of my surroundings.  All was malfunction, a torrent of meaningless cryptograms; should one find their key it would open to an infinite series of locked doors. ",
  "Our perceptions are dead leaves with a precarious hold on our undergrowth; they tremble in the winds of causality.  In gales their grip is lost and they are scattered exposing the rigidity of our branches.  But even harder winds may blow and shear off even our bark, the sheer friction will cause us to burst into flames; the fire will carve us into new and impossible symbols and ever more delicate ash will stream off our skin.",
  "Amidst all of this I was there, not the I typing this report, but the unwavering I, my framework.  The cold I with eyes frozen open whose existence is distant and alien to me. Born into this new self I found that my surroundings were myself and I found them slippery and dark.  Though I peered into my surroundings I felt as though I was peering into myself (an overwhelming feeling that periodically haunts me even weeks later).  I had no symbols to build into illusions and no images to trace.  The illusion had not ended; I needed only to find its new hiding place. How does one progress from here where all known handholds crumble into vapor?    A shadowed though beautiful answer is all I took from that place, presented here in all the ineptitude of my metaphors: We must learn to climb up our own backs and leap from our shoulders into the infinite sky where the strongest winds fan our flames hotter and the light of our destruction beams brighter.  We burn forever, our ascent is eternal."
 ],
 "erowid": {
  "id": "18058",
  "citation": " Nowhereman. \"The Detached Symbols of Self: experience with Psychotria viridis, Syrian Rue, 5-MeO-DMT & Salvia divinorum (10x extract) (ID 18058)\". Erowid.org. Dec 5, 2002. erowid.org/exp/18058",
  "substance": "Psychotria viridis, Syrian Rue, 5-MeO-DMT & Salvia divinorum (10x extract)",
  "views": "24182"
 }
}
