{
 "title": "Open The Door Naturally",
 "author": "An El Shy",
 "citation": " An El Shy. \"Open The Door Naturally: experience with Morning Glory (ID 24143)\". Erowid.org. Mar 11, 2007. erowid.org/exp/24143",
 "substance": "Morning Glory",
 "bodyweight": "175 lb",
 "report": "<p>I had purchased several packets of MG seeds a few years ago after reading about their effects.  My first experience was by grinding the seeds and consuming them with water.  I could not handle the taste and gagged the whole time.  That night my trip consisted of my holding my head and wishing myself to vomit.  I was woefully unprepared for the journey.</p><p>Now I have a few more psychedelic journeys and was much better prepared to make the journey. My wife was coming home, and I timed the MG consumption so that they would hit as everyone was going to bed leaving me alone with my thoughts and silence. Earlier that day, I had ground up my seeds and was preparing to do a water extraction.  Time and impatience got the best of me; so, I spooned around nine grams of seed material and washed it down with water.  No muss, no fuss.  The taste was nutty although the simple expecting a horrible taste almost got the best of me.  Then the waiting began.</p><p>(T+1) 9pm:  I crawled into bed w/ my wife.  I knew I had a while before the effects hit; so, I figured I would watch TV w/ my wife until she went to sleep.  She nodded off about 9:45, and I turned off the TV.  I am used to going to sleep on DXM and waking up mid trip, but I am not worried this will be the same.  The growing turmoil in my stomach was keeping me for sleeping anyway.</p><p>(T+3) 11pm: The nausea cannot be ignored any longer.  It grew inside me like a giant watermelon.  It would be an annoying companion almost my entire journey.  I went into the living room and began watching 'Farscape', but my thoughts began to jump.  I could not quite concentrate.  The best is yet to come.  I watched some anime and tried to play some chess online.  Sitting still was really beginning to trouble me.  My wife came out and asked if I was okay.  I told her that my stomach was just giving me a tumble.  My pupil are growing.</p><p>(T+5) 1am:  My vision is really changing.  My pupils are HUGE at this point.  I turned off the television for a moment, and I could practically see in the dark.  I begin to panick a little b/c I do not know if this will ever stop.  My body is tingling.  My temperature has raised.  My thoughts were racing past me.  I had the urge to use the bathroom, but only a trickle would exit at a time.  I fought the urge to vomit and sipped on ginger tea.  Fresh ginger would have been better, but I forgot it when I went to the grocery earlier.</p><p>(T+6) 2am:  What did I get myself into??  Someone please put a fork in my eye and distract me from my stomach.  The nausea was peaking at this point, and I tried to concentrate so that I could use that discomfort to fuel my journey.  I think many dislike the MG expereince b/c the want the'good' effects w/o the 'bad'.  The nausea was necassary to make the insights are profound.  At the same time, however, my childrens toys began to speak to me while I attempted again to read an email.  The kind of freaked me out a bit.  You would freak out too if Dora the Explorer walked up to you began to chat w/ you telepathically.  I went through many emotions.  I briefly thought I had poisoned myself but mananged to calm down.</p><p>(T+7) 3am: The hallucinations were lessening, but I had a strange clarity of thought.  I tried to throw up one last time seriously.  The pit in my stomach had stopped growing, but I had thought that it might make me feel better.  If I could have written at the time, I could have penned a great story, or at least a few chapters.  These great words would disappear quickly of course. </p><p>(T+9) 5am:   Sleep welcomed me w/ open arms.  I was not tired but thought it was the right time to try.  I sleep until almost ten.  When I awoke, I was a little groggy but still felt refreshed. </p><p>(T+20) 4pm:  (right now)  My vision still shifts a little, but that is not a concern.  My appetite is slowly returned, but I am constipated.  Overall, I enjoyed it very much.</p><p>With my remaining seed material, I am going to try a water extraction and compare the results.  I would like to someday try the extraction in the MG FAQ as soon as I can order some pet ether.  Many look down on legal highs b/c of the misguided thought that 'it can't be good if I can't get caught'.  They are truly misguided and mistaken.  I have experienced quite a few substances MJ, K, X, coke, salvia, opium, DXM, and  mushrooms.  The sensations I felt last night were the most powerful I have ever experienced.  I felt more than I did than from a 3.5g shroom experience a month ago.  With acid being practically extinct, MG is a good alternative.  I still want to try acid if it is ever around, but I will reserve room for another MG journey in a few months.   I like MG because I would like to start my next journey from my backyard instead of at the checkout line.  This research tool cannot be underestimated.</p>",
 "year": "2003",
 "id": "24143",
 "gender": "Male",
 "timestamp": "2007-03-11T08:00:00.000Z",
 "views": "5000",
 "dose": [
  {
   "time": "0",
   "amount": "9.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  }
 ]
}
