{
 "title": "What Was I Thinking?",
 "author": "Anonymous",
 "citation": " Anonymous. \"What Was I Thinking?: experience with GHB (ID 2415)\". Erowid.org. Oct 23, 2000. erowid.org/exp/2415",
 "substance": "GHB",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "report": "<p>\nAll right, I attend a high school in a small town and it is completely boring, so to keep it interesting we take a lot of pills. We always have pills, but one day we didn't and we asked everyone if they had anything, and one guy informed me that he had some ghb. I didn't know what it was at that point in time, so me and two of my friends decided to take some. He put an unknown amount in a bottle and mixed it with gatorade. We mixed it as well as we could and took turns taking swallows. After only four or five minutes I could feel the effects. I began to almost float, and it felt really pleasant for about ten minutes, but after that I started to feel extremely drunk (like I had drunk a case of beer) and I couldn't walk at all. I just sat in my desk and was waiting for the effects to disappear, but it lasted longer than I expected. I don't remember much after this stage of the trip, except for me being consumed by the fear of the bell ringing because that sound meant I had to get up and walk to another room for class. Although I didn't recall much, my friends did. Luckily we were not having class that day because of a blood drive at our school, but there was a teacher in the room. My friends said I began to sweat profusely and shake, so they helped me to the back of the room so the teacher couldn't hear or see me as well. They said they sat there and watched me, and all of a sudden I began to drool and convulse mildly. The next thing I remember is the bell ringing. It was the most horrid sound I have ever encountered. It took what seemed like an eternity to get out of the room. Everyone in the hall thought I was on some crazy dope, because the first thing I did was run into a locker and fall down.  I eventually made my way to outside of the school and threw up. After this I just said 'fuck it!' and attempted to make my way home. I made it about one block before I was forced to stop on the shoulder of the road and vomit for what seemed like an hour. I threw up so hard that I realized the next day I had busted several blood vessels in my eyes from all the strain. Following this I drove directly home at about 20 miles an hour. Since this experence I have used ghb several times, but I have learned to know what dose I am taking.</p>",
 "year": "2000",
 "id": "2415",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-23T07:00:00.000Z",
 "views": "20179"
}
