{
 "title": "Rips Me Out from the Inside",
 "author": "BurnsXL",
 "citation": " BurnsXL. \"Rips Me Out from the Inside: experience with Heroin (Black Tar) (ID 24167)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24167",
 "substance": "Heroin (Black Tar)",
 "bodyweight": "185 lb",
 "report": "<p>I've always been the kind of person who tries everything once, on the principle of true knowledge. In other words, how can I give a valid opinion for or against something without experiencing it for myself? Only recently have I learned from this mistake, and I'd have to cite black tar heroin as the main reason.</p><p>I never intended to do heroin, even during my biggest experimentation phase at 17 or so. I was eventually tricked into it by an annoyed drug dealer who couldn't score any opium despite my frequent requests.</p><p>I remember having him call me and tell me that he finally got me some opium, and it would cost me $25 or so. I went and picked it up, and was fascinated by the packaging it came in: cellophane paper wrapped in tin foil, sealed inside a tiny balloon. Despite being the size of an M&M mini, the little rock of black goo got me really really flying about 5 times when smoked out of an opium pipe from my local head shop. Right away I wanted more, and I went on to buy about 6 balloons for $100 every two weeks or so (I later found out that these balloons are street dimes). I usually got loaded in the morning, and every third day or so would smoke again in the evening. It amazes me now how much the body adapts to the drug, and the tolerance that derives from it.</p><p>After about three months of this, my dealer said his connection was gone and that it was over with the opium. I was heartbroken, as smoking the stuff had become my favorite thing in the world. I luckily felt no withdrawals, probably because of the inconsistant use, and went on with my life. Six months went by, all of which were burdened by a desire for more opium.</p><p>Somewhere along the line I happened to be reading the paper and caught an article about a big heroin bust. The article claimed that the police had seized over 10,000 balloons, and all of a sudden it hit me. The balloons the paper described were the same thing I was getting, and I knew it was too late for me. I was addicted to heroin.</p><p>It was only a matter of time from that point before I scored a new connection at 1am in a Mexican food joint. This time though, I wasn't getting ripped off by a pissed-off dealer. I was getting whole grams in powder form for $50, as cheap as I've seen to this day. Those balloons I had been buying usually had about 0.1g of heroin in them, which lasted me a few days and five or six highs. By the time I went to detox five months later, I was smoking 0.1g or 0.15g at a time, anywhere from three to ten times a day. My habit went from $100 every 14 days to $50-$75 a day. My life was merely a pathetic search for dope money to keep myself away from withdrawals.</p><p>It's been another five months since I detoxed and went through rehab, and I still suffer every day. The drug ripped me out from my inside, and will never let me go. I was told that it will be around four years before my sleep cycle returns to normal, and about a year before I feel totally normal physically. I was told the relapse rate is about 95%, and I fear that it's only a matter of time before I give in and go back to a pathetic doped-out existance. I never knew what I was getting into when I started, and I write this only in hope that I can save someone from getting mixed up with this shit, even if it's only one person. Nobody gets addicted in one day, and being a cocky and arrogant youth made me learn the hard way.</p>",
 "year": "2003",
 "id": "24167",
 "gender": "Male",
 "timestamp": "2003-06-02T07:00:00.000Z",
 "views": "24144",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Heroin",
   "form": "(daily)"
  }
 ]
}
