{
 "title": "Absinthe and Schizoaffective Disorder",
 "author": "The Schizoid Man",
 "citation": " The Schizoid Man. \"Absinthe and Schizoaffective Disorder: experience with Absinthe (ID 24178)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24178",
 "substance": "Absinthe",
 "bodyweight": "240 lb",
 "report": "<p>I suffer from Schizoaffective Disorder AND I enjoy trying recreational drugs (much to my psychiatrist's dismay).  In case you don't know, Schizoaffective Disorder means a person suffers from symptoms of Bipolar Disorder and Schizophrenia without actually having the full symptoms of either disease.  Anyway the Schizophrenic part of my disorder does cause me to have psychotic episodes where I here voices and occasionally see things.  The meds I was on during my experience with Absinthe were Effexor XR 300mg (anti-depressant), Depakote 1000mg (mood stabilizer used for bipolar), Seroquel 200mg (anti-psychotic used to treat schizophrenia), and Xanax 0.5mg (used to treat anxiety).  Well, I prepared and drank the absinthe in the recommended manner.  It was La Fe Absinthe which is 68% alcohol.  I told my psychiatrist ahead of time that I was going to take it and she told me that there was a good chance of having a bad trip because of my disorder.  She believed that I could have a severe psychotic episode if I consumed it. </p><p>Well, I drank it anyway and this is what happened: I felt a little dizzy for a couple of minutes and then I felt nothing.  After the dizziness was gone the only indication that I had drunk the absinthe was that I felt a warmth in my throat and chest and a slight numbness in my tongue.  Basically it was a letdown.  It is possible that the Seroquel countered the psychoactive effects of the absinthe, however, I'm not sure how likely this is since it doesn't seem to ever affect my marijuana experiences.</p>",
 "year": "2003",
 "id": "24178",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-02T07:00:00.000Z",
 "views": "22979",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 ml",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 }
}
