{
 "title": "Never Underestimate the Power of LSD",
 "author": "Innerself",
 "citation": " Innerself. \"Never Underestimate the Power of LSD: experience with LSD (ID 24193)\". Erowid.org. Oct 2, 2003. erowid.org/exp/24193",
 "substance": "LSD",
 "bodyweight": "85 kg",
 "report": "<p>I'm writing this report to make aware to people who are considering taking acid or have experimented with acid before to remember one very important thing, all acid comes in different strengths that can only be known after taking the drug. Unlike a bottle of scotch which has the alcohol content on the side of the bottle, acid comes in many different strengths.</p><p>I had experimented a few times with acid and had only mild visuals that lasted for a couple of hours. I remember the first one which was a blotter and had a picture of a key with wings on it. I had a couple of other different ones with little effect and pretty much thought that I was a seasoned tripper who could take any tab of acid and be alright. Thats until I had my 6th trip.</p><p>It was a friday night and me and my friend, lets call him G, had decided to go and buy some acid from a guy we had met a couple of times at local death metal concerts we used to frequent. This guy used to scare the shit out of me, he had a massive inverted cross tattooed on his back along with other scary tats and scars from self mutilation all over his arms. We paid him only half the price we had paid for acid we had purchased previously from other people and I was a little sceptical. The acid he gave us was a blank blotter which he reffered to as a 'White Tile'. I thought sure mate you probibly cut it from note paper about ten minutes ago, but I wasn't going to argue with him.</p><p>So anyway, me and G got back into our car and dropped the acid, roughly 8 pm at night, and drove back to his place. We sat down in his room and played some music for a bit waiting for the effects to kick in, the whole time which I spent complaining about how I thought we got ripped off. After 30 mins had passed nothing. So I suggested we smoke some skunkweed I had to help bring on the effects. Whilst on my second joint the trip kicked in. The first thing I can remember is that it felt like one second I wasn't tripping and then the next second I was tripping stronger then I had previuosly before. It was really funny at first because me and G both started tripping at the same time. We decided to walk to another friends house about 3 kilometers away. Whilst walking there the entire time the trip was getting stronger. I would stare at parked cars and see them breathing in and out. Looking at my friend it seemed that his shaved head had now grown dreadlocks and all the trees had faces which were all looking at me.</p><p>I told my friend what I was seeing and we both laughed about it, he told me that my face looked pale green and that I had fangs and large weeping sores all over it. By the time we got to our friends house I was tripping harder then ever.</p><p>We sat in a small shed, lets call our other friend D, had in his backyard. We used to sit out there so his parents wouldn't bother us. It had three chairs around a small table covered in grafiti with a bucket of water on it which we used to smoke marijuana from using a cut coca cola bottle. G pulled out his weed and started to smoke some while I stared at the table, I was mesmarised by it, I could see faces which seemed to be only inches from my face smiling at me then withdrawing back to the table only to come back at me. I looked up at G at this point, roughly 11pm, and told him I was fucked up and tripping too hard. He offered me some weed and I said noway, in fact I decided to give my remaining skunkweed to D because I said I would never smoke it again (this turned out to be an acid induced lie). My visuals were overwelming, I found it hard to look at people because of the shit that I was seeing. And I had this overwelming thought that the shed I was sitting in was a small shed in the middle of a vast shanty town on which leaving the shed would mean that I was lost in a labyrinth of slums.</p><p>G and D eventually convinced me that I would be alright and we left his house to go to the local 24 hour shop to buy some munchies. When I was walking in I couldn't stop looking at things. Everything was swirling and melting into each other then going back to normal then melting again. At one point the man behind the counter came up too me and asked me if I could close the door to the fridge which had the coca cola in it because I was standing there looking at it with the door open for about 15 minutes. This seemed like only a minute or so. I eventually grabbed a snickers bar and a coke and went to the counter. All I could do was stare at the man, because he was staring at me. It felt like I was staring at him for about 5 minutes or so before I reached into my pocket and grabbed a ten dollar note out which I promptly spent another 5 minutes staring at. I'm not actually sure if this was the actual time spent but my time perception was completely out the door.</p><p>I eventually gave the man the money and walked out without waiting to receive the change and met D and G outside. They spent the next couple of minutes laughing at me because I was so wasted, which I had a little laugh at too.</p><p>I think the the trip was still kicking in because things started to get even more different. I became aware of how unbeleivably small I was in the universe and felt a depression coming on due to the fact of how insignificant I was. I could feel the valves in my arteries opening and closing, and could feel the blood circulating through my whole body. I was able to look down at my chin which appeared to be stretched down to my waist, and was able to run my hand down it. I found at this point I was grinding my teeth alot and clenching my fists so hard that all the blood seemed to be squeezed out of them. At this point I wanted to go home. I threw my unopened chocolate bar and can of coke away because I didn't know what to do with them and started walking home with G. I remember walking past traffic lights which would change colour and give the entire night sky the same colour.</p><p>By now it was about 2am. I got home and decided to sit and watch a little tv. I was all alone because my mother was out and felt shit scared something was going to happen to me. Everything was still spinning and there was a small green dragon next to the tv which wouldn't let me past to get to my room, so I thought I would wait on the couch until either it went away or the acid wore off. This is the time when my mother came walking through the door (I hadn't heard her car pull into the driveway), she asked me how I was and how my night was which I remember replying by saying with my eyes extremely wide open 'fine, just fine....I'm off to bed now, goodbye'. I remember her looking at me with this weird look, you know the 'what the hell is this guy on' look. Lucky for me she didn't follow to investigate. I pretty much spent the rest of the night lying in bed unable to sleep staring at a poster of a band called Obituary. The band members faces would come out of the poster to me and stare at me, which scared me alot, so I closed my eyes and could see a myriad of shapes and colours swirling into uniform patterns shapeshifting into different shapes marching accross my mind and could here a bubbling sound which I was convinced was my brain desolving in my skull......pretty cool huh?</p><p>At about 7 am I was able to sleep. I awoke at about 9am in a sort of dopey hangover zombie like state. My brother drove us to McDonalds to get a burger and on the way back was nearly in a serious car accident, I remember the car skidding for about 10 metres at which I put the burger up to my mouth and had a bite, the car kept skidding and narrowly missed and oncoming car which was at that point I thought 'holy fuck what just happened', Needless to say by brain wasn't quite all there yet.</p><p>From that experience I pretty much learnt that It was a huge risk taking the drug. I thought it was going to be a walk in the park but it turned out to be a ride to hell and back. I think that I couldn't have got through the night without my friends being with me and I would never take LSD again without someone with me to help lookout for me.</p><p>So you want to know if I have ever done LSD again? yes, several times, but always with a trusted friend with me. I beleive that LSD opens up a part of your mind that allows you to see things new and unseen, much like a small child wondering and amazed at seeing something he or she has never seen before.</p><p>Goodluck.</p>",
 "year": "2000",
 "id": "24193",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-10-02T07:00:00.000Z",
 "views": "10326",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
