{
 "title": "I Have Also Been There Before...",
 "author": "jamesisvoid",
 "citation": " jamesisvoid. \"I Have Also Been There Before...: experience with Cannabis (ID 24204)\". Erowid.org. Jun 2, 2003. erowid.org/exp/24204",
 "substance": "Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I am writing this report due to the fact that I read a similar report by b. williams, titled 'I've been here before', which deals with his ingestion of mushrooms at a raggae festival. If you read this report, I recommend reading his as well, as you may find some similarities.</p><p>Sometime last year, april or may.</p><p>My friday afternoon was looking to be an enjoyable one, as I had made some plans to meet a friend at a george clinton show later in the evening. I figured at a george clinton show there would be some pot smoking going on, also, I hadnt seen my friend in a while and we often smoked together, so I was very excited to be aquinted with him and our hobby. I had been on a break from pot, as I was trying to bring grades up in school, and get other personal things straightened out. I was readily looking forward to the evening.</p><p>Around 8pm, when the doors opened, we rushed in and began checking out the scene. Later on, during the opening act, my friend wipped out a j and we began to smoke. My prior use to this night consisted of lots of pot smoking for approximately 3-4 years, on a weekly basis. I was also in the middle of some personnel distroughts, such as anxieties, mild depression, and unknown diagnosis' that I had been trying to figure out, hence my 'break'.</p><p>After finishing the joint, we went over to grab a drink at the bar. While waiting in line, a familiar voice (that I could not hear, but I could sense) was telling me 'I have been here before, I know where I am, and I sure as hell know what is going to happen to me.' This was basically a confirmation of where I was headed, which was down a bumpy path. Soon after this awareness, I had a complete full blown anxiety attack. What happened is actually similar to b. williams in his report. A quote from his report:</p><p>'I thought that everyone was relying on me to know this simple answer. I even heard clear audible voices that came from somewhere in the campground, but they were people I knew back home. One was shouting, 'Come on any two-year old knows this answer.' He was also saying things like, 'Does some drunk red-neck want to step up and take his place?' While the other voice was shouting, 'Come on, hurry up, hurry up!' I sat there going crazy in despair, for I could still not remember the answer.'</p><p>Examples of what I heard were along the lines of: 'He's so far off' or 'This guy has absolutely no idea'. I was hearing people talk, and saying things that were specifically pointed to me, and what they were trying to convey was simply along the idea of how funny it was watching someone who doesn't understand to 'go with the flow' and surrender to the beauty that was waiting to take hold of me. I felt like i was failing at accomplishing something and rejecting the good, while I kept on taking in the bad. I went completely blind, and could not find the right way to stand up straight. This lasted for a brief 30 seconds, and when it was all over, I felt very relieved, and that I had just gone through a very bad nightmare. For the remainder of the night, I felt very alone. I couldn't find out the way to have fun and enjoy the concert. I didnt know if I should dance, and when i tried, I completely lost all confidence. I also felt it was me against everyone else that was there, which made me feel very alone. I didn't even talk to my friend that much. </p><p>I know, the voices I heard and the thoughts I had during that episode were just hallucinations. People are not like that, and they don't act with grandiose attitudes towards people who are having a bad experience with a drug. What I have learned is so many interesting lessons and ideas since this episode, and others. I realize what I went through was a state of accepting false realizations of reality. Prior to this event, I had somewhat been coming to ponder if people really act like that towards me, even when I am sober. I took this false belief after an acid trip, and a similar mushroom journey years ago, where I fell into a dark loop of false representations of reality. I believe some ideas carried over.</p><p>It has been my duty, to disbelieve these ideas and thoughts, as they are not real. I have an utmost respect for certain drugs and hallucinogens today, and I truly believe that peace within yourself can be found. My greatest trouble is being myself. I know, that with the right environment, people, and attitude, I can succeed at this.</p><p>'Time will tell.' - bob marley</p>",
 "year": "2002",
 "id": "24204",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-02T07:00:00.000Z",
 "views": "9927",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
