{
 "id": 2420,
 "title": "A Positively Life-Changing Experience",
 "date": {
  "submission": "2005-08-01T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Louise",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I had been considering trying ecstasy for some time, going through phases of being really open-minded and wanting to gain new experiences; and phases of being quite anti-drugs, telling myself that I didnt need them to have a good time. I had a few good friends who had been occasional users of E for a few months, a few more who hadnt taken it but wanted to, and others who were completely against it. Eventually I reached the decision that ended up changing my life for the better. I arranged a night out with three friends who had taken ecstasy before, Ill call them A, J and L, and two who hadnt and were going to take it for the first time along with me, Ill call them I and K.",
  "I was really excited about what I was going to do in the week leading up to it, even though I had a couple of arguments with friends who were trying to persuade me not to do it.",
  "I had researched ecstasy and knew exactly what I was doing, and it certainly helped a lot that two of my friends were experienced and could give me first-hand information and advice. The night didnt get off to a good start - we took our pills before going to the club we were planning to go to, but we werent allowed in as we were asked for ID and some of us were under 18 at the time. There was no other suitable club to go to in my small town, so we decided to spend the evening in a favourite pub of ours. The pub wasnt the typical place to spend a E trip, but it has a nice atmosphere, quite quiet and hidden away but with a good jukebox and a room with a pool table and comfy chairs, etc.",
  "I had taken one pill, which I feel was sensible for my first time, and turned out to be very adequate. When we got into the pub we sat and chatted, feeling a bit excited and nervous. I had been told by my friends that it would take about an hour for the effects to kick in, and I couldnt help looking at my watch all the time and wondering when it was going to happen. I and K, the other virgin E users, were both sitting very quietly and looked quite miserable, which worried me a bit. I could tell that A was starting to come up because she suddenly became very chatty, talking quite excitedly and openly to me. Shes a good friend but she never usually discusses her feelings. But now, she was telling me how she really wanted to be better friends with me, wanted to spend more time with me and get to know me better. This made me feel really happy, but at this point I still hadnt started coming up.",
  "It was about an hour and a half since Id taken the pill, and I was getting worried that Id somehow done something wrong and that it wouldnt affect me. My friends were paired off on both sides of me and I was just sitting alone, not talking. But then I started listening to a conversation two of them were having that sounded interesting, and I moved my chair closer to them. By doing this, as well as making me physically closer to them, I felt emotionally closer and suddenly I felt a sudden rush of joy and exhilaration and I knew I was coming up. It felt absolutely amazing. I never imagined how good it would be. It felt as if Id suddenly come alive, and I could talk about absolutely anything to my friends, and we all knew exactly what the other person was talking about. I felt such strong connections with them and felt like they understood me completely. The music wed put on the jukebox sounded like musics never sounded like before - I totally love music, but now it sounded so much more important and uplifting. We started dancing to it, and even though this was quite unusual behaviour for this pub, I didnt care what people thought and I felt more confident than Ive ever felt.",
  "I spent the evening moving from one friend to another, having such lovely, happy conversations, hugging and kissing each other and generally just sharing the amazing experience. Id been having some problems at the time that made me quite depressed sometimes, but now they seemed so small and trivial, I could talk about them and smile at the same time, feeling like they didnt matter a bit.",
  "I think one of the contributing factors to my amazing experience was the conversations I was having with A. I was having great conversations with everyone, but me and her had never bonded so well as we did that night. We realised that we were very similar to each other and I realised that she thought very highly of me. Every time we spoke to each other, I would get a massive rush and start dancing ecstatically again.",
  "Even coming down was a nice experience. On subsequent occasions, Ive felt quite disappointed and sad when I realise Im coming down, but this time it just felt right, and it was really relaxing and pleasant. I went home with A, J and I. I got into bed and the others sat in my room smoking dope and we all chatted for hours. I felt really warm and content and just absolutely amazed about my experience, so happy that Id decided to take ecstasy. I only take it every few months as I dont want to be taken over by drugs, but it truly has made my life better."
 ],
 "erowid": {
  "id": "18116",
  "citation": " Louise. \"A Positively Life-Changing Experience: experience with Ecstasy (ID 18116)\". Erowid.org. Aug 1, 2005. erowid.org/exp/18116",
  "substance": "Ecstasy",
  "views": "5026"
 }
}
