{
 "title": "A Multifaceted Substance",
 "author": "Dazs",
 "citation": " Dazs. \"A Multifaceted Substance: experience with 1,4-Butanediol (ID 2423)\". Erowid.org. Jul 31, 2000. erowid.org/exp/2423",
 "substance": "1,4-Butanediol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "1,4-Butanediol",
   "(capsule)"
  ]
 ],
 "report": "<p>I have tried GHB from several different makers and find that the effects are not consistent. 1,4-Butandiol, however, supplies consistent results; of course this all depends on how much and how recently I've been ingesting it.</p><p>Ingestion technique: Swallowed in gel-caps. 0, 00, 000 in various combinations. On an empty stomach effects can be felt within 5-10mins, on a full stomach up to 30mins and then not as strong. The effects recorded below are my personal response after about a week of no GHB or 1,4-B. (to restore total lack of tolerance about two weeks is primo).\r[Erowid Note: The following dosages are unusually high requirements for the noted effects.  Many people get sick and pass out at 6 ml.  This report is included as an unusual datapoint, definitely not as a dosage guide.]</p><p>FULL Stomach:</p><p>1ml-no percieved effects</p><p>2ml-hints of threshhold effects (just feel like smiling)</p><p>3ml-threshhold effects (feel like smiling and talking to people)</p><p>4ml-hint of full effects (will talk to people)</p><p>5ml-stronger hint of full effects (will talk to people, body will begin to feel intoxicated)</p><p>6ml-full effects (bodily intoxication, feeling really friendly at this point)</p><p>7ml-full effects+ (will talk to about anyone, definately intoxicated)</p><p>8ml-full effects++ (will be friendly to everyone, intoxicated to the point of not feeling safe driving)</p><p>EMPTY Stomach:</p><p>1ml-hints of threshhold effects</p><p>2ml-threshhold effects</p><p>3ml-hints of full effects</p><p>4ml-verge of full effects</p><p>5ml-full effects</p><p>6ml-full effects+, full effects++</p><p>7ml-full effects+++ (will not drive, feeling VERY friendly)</p><p>8ml-full effects++++ (likely to drift asleep for 5-10 minutes at time)</p><p>9-10ml-will induce sleep.</p><p>These effects in these dosages are consistent, regardless of external factors. This is also while using solely 1,4 butandiol.</p><p>Uses:</p><p>1) Get along with unpleasant co-workers (full effects)</p><p>2) Get to know people in a social setting (full effects)</p><p>3) Get friendly with people of the opposite sex (full effects+, full effects++)</p><p>4) Making out with boyfriend/girlfriend (full effects, full effects+)</p><p>5) Diner with the family (hint of full effects)</p><p>6) Evening with the family (full effects)</p><p>7) Need to sleep for four hours (full effects+++, full effects++++)</p><p>8) Need to sleep (full effects, hint of full effects)</p><p>I have found that if I swallow 8ml, go to sleep right away (naturally, not letting the 1,4-B do it), I'll wake up in exactly four hours feeling like it was the best full nights sleep that I've ever had, perhaps making up for several nights of minimal sleep.</p><p>The dosages that work for me will not be the same for you. Some people get full effects on 1ml. If you are new to 1,4Butandiol start with 1ml, even if you are a regular GHB user. The purity of the GHB you're body makes from the 1,4B is very high. Effects will last up to hour 3.5, dopamine release is usually exactly at hour 4 from ingestion.</p><p>If you are inclined to try this substance with pot, smoke the pot first and don't do anymore 1,4-B than will take you to the full effects, or else you won't be able to enjoy the interaction the two can have.</p>",
 "year": "2000",
 "id": "2423",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-07-31T07:00:00.000Z",
 "views": "25530",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(capsule)"
  }
 ]
}
