{
 "title": "Slurring and the Cops",
 "author": "DJ Skeptic",
 "citation": " DJ Skeptic. \"Slurring and the Cops: experience with Alprazolam (Xanax) (ID 24248)\". Erowid.org. Jun 4, 2003. erowid.org/exp/24248",
 "substance": "Alprazolam (Xanax)",
 "bodyweight": "145 lb",
 "report": "<p>First let me start by telling you how much I enjoy Xanax. At age 17, I was prescribed .5 MG of Xanax to be taken twice a day for general anxiety disorder (GAD). I took them until I was 19, when I switched to a different doctor that thought that I no longer needed them (yeah right). I am now almost 23 and have had no prescription to them since. I feel that I have gotten better through the years as far as my anxiety goes, but I think it is only due to the fact that I used Ecstacy very frequently for over two years straight.</p><p>Since this is my favorite drug, when I get a chance to pick up on a quantity, for personal use as well as to sell, I jump at it. About 2 weeks ago, a buddy of mine got a bag of 100 2 MG bars (not generic either) and asked me if I wanted any. So I said I would take whatever he didn't want for himself. I went and picked up 85 of them, took 2 of them, and went on my way to distribute to others.</p><p>A few hours later, after a total of 3 had been digested, and I had sold about 40 of them, I joined up with a couple of friends. We headed five deep in my car out to a camp site to meet up with some friends. (Keep in mind that when I am on a lot of Xanax, I don't really realize how screwed up I am and appear to anyone who is sober.) By the time we had arrived at the camp site, I had 6 MG's in my system working and had taken 2MG's more shortly before arriving.</p><p>When we got to the camp ground, I was screwed up, two of my buddies were drunk, and all of us had just got done smoking a joint. Suddenly as we were driving around the camp looking for our friends who had a site there, a group of people came chasing after us with flash lights. When a friend in the car reminded he had a warrant, I attempted to leave, but one of the mystery people jumped behind my car with a flash light. These people (little did we know were the owners) demanded we stay in the car, but would not tell us what we had done wrong.</p><p>Within five minutes, there we three cop cars there and they began to question us. This is where everything went to hell. They started by walking up to my door. Doing the usual, license, registration, etc. They asked me to step out of the car. I opened the door and of course, my bag of pills lands on the ground. After this we knew we were in trouble.</p><p>After everyone existed the car, the cops let everyone go free, except for me. They left me sitting in my car staring at their spot lights for over an hour. All I could do was fall alseep by this time, but managed to stay alert. They gave me several sobriety tests before they finally gave up. They took my pills, some weed and let me go. I wasn't suitable to drive though they told me, so I had my girlfriend and her friends come and drive me away from the scene for an hour, and went back to retrieve my car. And to make matters worse, the next morning I awoke to my buddy (who I had gotten the Xanax from) calling me from jail telling me that he took three Xanax bars and got involved in a hit and run. He only had 5 bars left and got a felony charge. Meanwhile, I was lucky. I had over 40 of them and they let me go.</p><p>The point of all this is that Xanax, while fun, is one of those drugs I can't really hide when I am twisted on them. Weather you know it or not, your speech will sound like you are drunk, when it sounds normal to yourself. Because of all this, I lost money and a night at the camp ground, and my friend lost his car and has three charges pending right now. So use cautiously!!</p>",
 "year": "2003",
 "id": "24248",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-06-04T07:00:00.000Z",
 "views": "64605",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 3:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 3:30",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  }
 }
}
