{
 "id": 2426,
 "title": "Escape from Depression",
 "date": {
  "submission": "2006-04-21T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Reborn",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>This wasnt exactly an experience.It was a dream I had while sleeping which I think was manifested by my alcohol consumption. It was a couple of weeks ago when I had drank approx. 6 shots of whiskey. I am a chronic insomniac so I thought getting totally drunk every night would help me sleep better,well I was right and wrong.",
  "Another problem of mine is emotional frailty,this whole report is based of one single girl, everything in my life is.Anyhow, I have been totally in love with this girl for about 2 years and about 4 months ago I had seen 'A' as I will call her at the county fair.After I had seen her she was all I could think about day and all night,we went and talked for about twenty minutes with her friends and even though sober,this was very euphoric for me.",
  "So now back to my expericence,it was like any other school night I was gettin happy on the whiskey as I would alwayz do,pretty good buzz,happiness the usual.I began drinking about 8:45 pm,the average time for me to start my nightly drinking binge,nothing out of the ordinary,good buzz smoked a dozen cigarettes and layed down for the night.Now I am sleeping in my bed without a care in the world hating the fact that I have to wake up and go to school tomorrow,agian nothing usual. I have no perception of when and why the dream occured but I believe it to be alcohol based. I wake up and recollect of the dream while smoking my morning cigarette and listeing to my internet music files.WOW! I had a dream of 'A'.We were in town at lunch and in my dream I was totally feeling the effects of alcohol,but it was better than drunk,I was talking kindly to everyone,even people I hated.",
  "I was having deep and meaningful conversations with my enimies and I felt more love for them than my girlfriend.I saw 'A' outside the carry out I usually hang out at.She was stnading there and I walked up to her and I said 'A' you are so pretty,'A' had a shocked look on her face and oh my god,Her face was prettier,clearer,and more beautiful than anything I have ever seen.Her big brown eyes were so soft and warm,Her nose and lips were so sexy.Naturally I am preverted and when I see her I say to myself I wanna fuck her.",
  "This time in my dream was different becuase it was pure understanding,love,peace,tranquility,epiphany,euphoria,a new perspective of the world.I preceded to give her a peck on the lips and she just smiled at me,her sexy smile lit up my world!These words cannot even cover the tip of the ice berg of what I felt for 'A'.It wans't lust or sex that felt for her,It was love,compassion ,understanding,sympathy.These feelings where nothing else but pure.I'm not sure if my dream experience means anything or everything but it sure relived my depression and gave me a new outlook on everything.Its amazing on how only alcohol can change my perspective on life!</p>"
 ],
 "erowid": {
  "id": "18132",
  "citation": " Reborn. \"Escape from Depression: experience with Alcohol - Hard (ID 18132)\". Erowid.org. Apr 21, 2006. erowid.org/exp/18132",
  "substance": "Alcohol - Hard",
  "views": "6930"
 }
}
