{
 "title": "Meant to Be",
 "author": "Metalchimp",
 "citation": " Metalchimp. \"Meant to Be: experience with Salvia Divinorium (5x extract) & Cannabis (ID 24266)\". Erowid.org. Dec 27, 2006. erowid.org/exp/24266",
 "substance": "Salvia Divinorium (5x extract) & Cannabis",
 "bodyweight": "76 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "250 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "125 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "125 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "report": "<p>Myself & one of my friends have been interested in Salvia and the whole ethnobotanical scene for quite a while now. I have been growing Mushrooms and san pedro and he has set up a hydroponics system for MJ as well as tomatoes & other herbs etc...</p><p>We decided to get some salvia divinorum cuttings sent to us from an online resource & we were especially pleased to learn that we would get a free gift of 1 gram of 5x salvia extract as well.  There was a mixup with the order and lots of messing around with customs and excize but eventually I got this extract and it sat in my draw waiting for an oppertune time. Last night I went over to my friends house with my specially purchased salvia pipe</p><p>After the obligitory spliff or two and a cup of tea we decided it was time to see what all the fuss was about. We turned off the music as we had read that noise could be quite a distraction and I took all of the stuff out of my pockets and made myself as comfortable as possible. We had a gram and at the time we didn't really know how much we should smoke so we split the gram into four & I loaded up my pipe. Neither of us really knew what to expect, I wouldn't have been surprised at that time if we had smoked the lot and had no decearnable effects. I had read so many reports of nothing happening.</p><p>I lit the pipe and breathed in as much as I could & held it for about 20 seconds as I breathed it out I remember thing 'oh nothings happened' and I said to my mate 'its not very nice' (I don't really like bongs either, my friend said it was fine for him) at this point my mate went to get us a glass of water, as he left the room I took another lungfull (it was still burning) and held it.</p><p>As I breathed this second hit out I felt the room slide down to the left & my head drooped to my right, I felt a pins & needles sensation all down my left side including the left side of my face, it was as if there was a line seperating the two halfs of my body, my left side was floating free with no pressure on it at all, stretching away into the ether, but my right side was still firmly anchored in the real world. I slumped to the side and in periferal vision I could see a landscape of infinate purple fracturals. I still had my eyes open & I had the sensation of being stretched out behind my body.</p><p>My mate had returned & quickly loaded up the bowl with a little less than a quarter (I had mumbled that he probably didn't need all of the quarter as I has seen that not all of mine had been used). He took his hit, afterwards he told me that it had been like waking up from being passed out, he had no conception of who either of us were or where he was. As he was piecing all the information back together I said 'I think we had enough' & he eruppted into uncontrollable laughter. I was worried his kid was gonna wake up and we would get an earfull from his wife.</p><p>We discussed our experiences over another joint & prepared ourselves for another journey, although the trip itself only lasted for about 10 minutes there was a definate afterglow period which seemed to be prolonged by the joint, much like after a mushroom trip although I would be loathe to compare it to a shroom trip.</p><p>This time we loaded up an eighth of a gram each. It was alot more intense the second time round, I sat back & closed my eyes suddenly people were talking in my head asking me who I was & why I was there. The voices then seemed to merge into one female voice, but it was not the young attractive voice I had expected, more a motherly but at the same time scolding voice. She questioned my entire conception of myself stripping all of my ego down to my bare self the vulnerable sensative core of my soul.</p><p>She was questioning where I was & whether my mate liked me, and then she went on to say that this was it! That reality was a dream and that I should go with her, that I was crazy (and boy did I feel it, I reasoned that I must be insane because voices were talking to me) all this time my body felt as if it was hanging from reality into an infinate abyss of purple fracturals by the top left portion of my head. I still couldn't let go & eventually normality began to return. She was telling me I could go with her & that would be it, I could wander the universe, when she realised I was still grasping at reality she became a little more annoyed & asked me again why I was there. I replied that I wanted to be her friend that I wanted to share myself with her. I was quite scared at this point, almost pleading and a little taken aback. And very humbled. I was as innocent as a child all my protective barriers were gone, there was just me and her.</p><p>I was afraid that I would never come back to reality. As I came out of it I tried to remember everything she had taught me so that I could recount it to my friend</p><p>I looked over at him just as he opened his eyes & I said 'dude I have so much to tell you!' he laughed and said 'yeah me too.' We had another spliff, more dicussions and another cup of tea.</p><p>We prepared for the third and final trip of that evening. Unfortunately I don't remember much about this trip. After inhaling I laid back and smiled thinking to myself it was ok and I would return to reality having learned a huge lesson but I still couldn't let go completely. Once again my body stretched away but part of me still was clutching and although I was trying to let go I couldn't. I remember talking once again to the female voice (the goddess?) she told me that I hadn't had enough (previously I had taken two lungfull and this time I only took one) she said she couldn't take me because she couldn't get enough control, or somthing like that.</p><p>We finished there for the night and although we still had a bit left decided to leave it for the time being we had a last spliff to cap off the night and I headed home.</p><p>I can understand why some people choose never to repeat the experience (although I said I was loathe to compare it to a mushroom trip I have no other frame of referance) it was like being thrust into the most intense trip in a matter of seconds. I almost experienced what I take to be 'ego death.' I however feel that if I can just learn to let go of my fear a wonderfull experience awaits me.</p><p>I was very humbled by the whole experience & no matter how much I researched it I don't feel I would ever have been quite ready. I awoke this morning to fing that my Salvia Divinorum cuttings had arrived .........some things are meant to be.</p>",
 "year": "2003",
 "id": "24266",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-27T08:00:00.000Z",
 "views": "1085",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
