{
 "title": "Quite a Sunday Afternoon",
 "author": "93 Skidoo",
 "citation": " 93 Skidoo. \"Quite a Sunday Afternoon: experience with Mushrooms & Cannabis (ID 24280)\". Erowid.org. Oct 6, 2007. erowid.org/exp/24280",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Mushrooms",
   "(fresh)",
   "",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2003",
   "24280",
   "Male",
   "",
   "Not Given",
   "Oct 6, 2007",
   "2462",
   " "
  ]
 ],
 "report": "<p>I have taken mushrooms around a dozen times in my life, always at night.  I decided that a change was necessary and took them about 4 in the afternoon.  I can't stand the taste of fresh mushrooms, so I smoked a little cannabis to fight nausea, then chopped my mushrooms up and added them to fruit salad, since it has the right consistency, masks the taste, and provides nutrients.  Finishing it took about ten minutes, followed by a gram of Vitamin C and some ginseng.</p><p>At this point I realized that I really needed to do some grocery shopping.  I knew I had about 45 minutes before the shrooms really kicked in, so I hurried to the store, worried that my rushing would negatively affect the trip.  While waiting in line to check out I realized I had little time left, as I was already starting to feel some effects.  I also went to the pizza place in the same shopping center to pick up some post-trip food.  I must say that walking diagonally across the stripes was a new and interesting experience on shrooms, even though the trip had barely begun.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  I drove home with no problems (yes, yes, I know one shouldn't indulge in anything and drive, and I would strongly discourage anyone from doing so). I put the groceries away, put the pizza in the oven to keep warm, and found that I had to psyche myself up to go out for a walk.  I tend to have a touch of agoraphobia, so perhaps the shrooms emphasized that, along with the idea of being out in public on a very strong mind-altering substance.</p><p>Finally I left.  It was about an hour after I had taken the shrooms.  The day was sunny, cool, very pleasant, a bit windy.  I was a bit underdressed, sandals, shorts and t-shirt.  I pressed on, not wanting to delay again, as the world seemed to shine and glimmer in beautiful waves.  I walked quickly to the park near my home; it is heavily forested, quite beautiful under normal circumstances.  Now, under the influence of psilocybin, it was transformed- magical, Gaia-like.  Green sexy nature surrounded me as far as I could see.  I walked along, seeing squirrels frolic.  I left the main path for a smaller, less traveled one.  I walked silently along.  I spied an orange and white mass to my left.  I couldn't figure out what it was, so I stopped and stared at it, thinking it could be some kind of wood fungus.  The cat awakened quickly and stared at me.  I apologized and walked on.</p><p>I took note of things that I normally overlook; I looked at a fallen tree, saw the molds and fungus, the ants and termites consuming it, saw them all as part of life, not as something gross.  I felt like a little kid, awed by everything I saw.  Every leaf, every breeze seemed to shout in exuberance with life.  I was terribly happy.  I realized that though they seemed wild, the woods were actually quite tame.  Oh, there may have been a poisonous snake somewhere in there, maybe even some poor animal with rabies, but basically I was safe, and I felt safe.</p><p>I came to a cemetary that is within the park.  The original inhabitants of the area were 18th century immigrants.  I always like to pause and pay my respects to their bravery and search for freedom.  I removed my sandals to enter, feeling, in my life worshipping way, that it was holy ground and the proper thing to do.  I crouched and looked at the weathered graves, reflecting again on their courage, coming across the ocean on wooden ships, to a land none of them had ever seen, leaving behind everything and everyone they had ever known.  I savored the feeling of the grass under my feet, the coolness of the earth.</p><p>I left the cemetary and went to my favorite part of the park, a small path near some huge oaks.  As I looked out cross the park, I reflected on how life exists in such a thin film on the surface of the world, maybe 100 meters up and the same down.  I realized that life doesn't really need people around, except to witness all the beauty that exists around us.  Alone, I took off my shirt, feeling the breezes blow across my skin.  I felt like nature was saying that, even if it didn't need me, it was glad that I was there.</p><p>It was starting to get dark, then, so I started to head back home.  I crossed a small stream, enjoying the challenge of walking on the slippery stones, the sudden shock of the cold water on my feet.  I took off my sandals again on the main path, feeling the warmth of the asphalt on my bare feet.  I padded along, smiling, peaceful, a part of the life around me.  I made it home without incident, just sitting in the dark, enjoying some mild visuals before showering, another sensual delight.  Dressed, I sat down to my dinner, watching cartoons and laughing with complete abandon, at one point becoming completely breathless.  I did have a hard time falling asleep that night, and would suggest to anyone wanting to trip to get a fairly early start if they have to be somewhere the next day.</p><p>All in all, I would say that the trip was one of the best I ever had.  If you have just stayed at home, or in a home like setting, consider going out into nature and feel the life around you and within you.  Earth, after all, is the greatest show on earth.</p>"
}
