{
 "title": "Not Exactly What I Expected",
 "author": "apathie",
 "citation": " apathie. \"Not Exactly What I Expected: experience with 'Ecstasy' (Unknown, possibly 5-MeO-DiPT) Cocaine & Diphenhydramine (ID 24298)\". Erowid.org. Jul 23, 2004. erowid.org/exp/24298",
 "substance": "'Ecstasy' (Unknown, possibly 5-MeO-DiPT) Cocaine & Diphenhydramine",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "Unknown",
   "(pill / tablet)",
   " T+ 0:30",
   " ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " T+ 4:30",
   " ",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   " T+ 15:30",
   " ",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>This past week, a friend and I decided to get some cocaine and MDMA.  So we picked it up.  We picked up our stuff and got 2 smilie pills.  We ate them around 7:30.  They were sorta round and tasted HORRIBLE!  Not to mention the press was one of the worst I've seen.  I almost gagged on the pill when it touched my tongue! I figured that it was just some sort of an outer casing or something, not really caring a whole lot.  Btw, I live in NY.</p><p>Coming up I noticed I was EXTREMELY hyper.  After a half hour or so we did some more blow and we just kinda roamed around for a bit.  I was still under the impression that it was E, so I guess I tricked myself into thinking I was really happy or something, but I noticed that it was far too trippy then normal MDMA.  I asked what the hell was happening and my friend said that we probably weren't used to good MDMA any more so this should sort of be normal.</p><p>He was wrong.</p><p>I went home around 12 or so and turned on my computer.  Everything was alive and moving.  'Shit' I think to myself, 'this is FAR too trippy.'  Having to get up for work the next morning around 6:40 I decided to take some sleeping pills.  As I layed in my bed I got astounding visuals which were very 5-MeO-DiPT like.  I can tell the difference between the two drugs by the body load and the CEVs.  If those don't answer my questions, the trip length is a dead give away.  I eventually took some some Simply Sleep pills to try and get to some rest in hopes I could make it to work - no dice.</p><p>I spent the entire night and most the next morning in my bed tripping.  I had to miss work (very annoying) and played sick.  The trip eventually ended around 11am and I then I finally passed out thanks to a second dose of Simply Sleep.</p><p>My advice:  be careful of what you buy and who you buy from.  If it looks fishy - it probably is.</p>",
 "year": "2003",
 "id": "24298",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-23T07:00:00.000Z",
 "views": "15141",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Unknown",
   "form": "(pill / tablet)"
  }
 ]
}
