{
 "title": "Cheap and Cheerful",
 "author": "Fuzzt",
 "citation": " Fuzzt. \"Cheap and Cheerful: experience with Inhalants (Butane) (ID 24328)\". Erowid.org. Oct 24, 2006. erowid.org/exp/24328",
 "substance": "Inhalants (Butane)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>It was a Friday night when realizing I had no drugs I craved a high.</p><p>I frantically searched my home for any abusable mind altering substances and struggled to find anything.</p><p>Feeling quite desperate I decided to try an inhalant for the first time, hearing about all the dangers involved I thought 'screw it' and got ready for my first huff. I checked my watch, it was 10:36pm I grabbed a can of lighter fluid, I sat on my bed and huffed away.</p><p>After the first 3-4 hits I did not feel much, so I kept spraying as I quickly inhaled through my mouth and out through my nose. I continued until I felt an overwhelming buzz. It was then that I felt strange sensations, I could feel my cheeks being pushed in and my jaw clamped, my vision turned quite blurred...</p><p>Realizing it would not last for long I rather ignorantly started urgently huffing quickly until I fell back onto my bed in a daze.</p><p>I stared at the ceiling, I could feel a force pulling my body, I was drifting on a raft deep at sea, all my senses were distorted and I was experiencing quite vivid visual & audio hallucinations.</p><p>Still staring at my ceiling it opened up to show a blue sky, patterns forming different symbols. From this point onwards I am unsure If my eyes were open or closed.</p><p>I saw a skull and crossbones form on my ceiling, it was then that I panicked 'I've poisoned myself', I sat upright and realized that I had been huffing, I had somehow thought that I had taken pills and had poisoned myself. Assuring myself I was ok I lay back down feeling very happy, as I lay down I felt shockwaves around me, slowly they swirled around my body in trippy patterns, my vision now seemed like a 2d painting, I could distort it how I liked..</p><p>Gravity seemed none existent as I felt all manner of forces on my body, I closed my eyes, I was still on the raft, I felt something grab the raft from under the water and was pulled underneath, as I descended to the bottom of the sea I felt very relaxed, I saw many odd things drift past me in the water as I was being pulled. Finally I reached the bottom of the sea, it was my bed, my bed was at the bottom of the sea, I opened my eyes.</p><p>As I opened my eyes the water swiftly evaporated and everything I heard seemed very loud, started blinking, every time I blinking objects seemed to become closer or further away, my ceiling was now back to its normal state, but I could not tell how far away it was, my whole perception of distant was fucked.</p><p>I sat up and turned on the T.V, looking at my watch It had been about 5 minutes from when I had started, what seemed like endless hours had been merely minutes, I found it hard to concentrate on T.V, it was a comedy, I started to laugh..</p><p>The visuals started to fade away, and I was left with a nice body buzz, and slightly fuzzy sight.</p><p>It was a shame that it only lasted for a few minutes, at the time it seemed longer but still, I felt quite annoyed.</p><p>In my stage of annoyance I decided to visit the raft in the sea once more, using my fast huffing method it did not take long for the visuals to reach me again, this time it was different.</p><p>Everything I heard echoed and I lay down once again, I could feel myself sinking into my bed, slowly sinking my body felt like it had just quickly dissolved, all that was left was my eyeballs.</p><p>I was just a pair of eyeballs on a bed, looking around, it was freaky, but strangely amusing. I couldnt laugh, I had no mouth! I couldnt get up, I had no body!</p><p>I was not expecting such vivid hallucinations, I was quite surprised, my leg started to itch, suddenly I felt my hole body form back to its solid form, my body now felt like jelly, as I sat upright I felt my body wobble as I reached down to scratch my leg, I was staring at the wall.</p><p>I felt my pulse rate increase as I realized my leg was not there, I was feeling everywhere on my bed but I could not find either of my legs! I wondered how the hell I could of lose my legs in the space of a few minutes. I was panicking.</p><p>I could not find my legs because I was staring at the wall, using my sense of touch to find them, I was sitting on the bed with my legs over the side, not actually on the bed anymore. I was looking sideways, I looked down and saw my legs, what a relief.</p><p>I slowly drifted back to reality and checked my watch, 10:58.</p><p>I had a painful headache, I watched T.V for a few hours before I decided to call it a day and fall asleep.</p><p>To be honest, although I enjoyed my first inhalant experience, it will most certainly be my last. Its not worth the dangers involved when the trip lasts only a few minutes.</p><p>I think I'll just stick to weed and acid in the future!</p>",
 "year": "2003",
 "id": "24328",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-10-24T07:00:00.000Z",
 "views": "24012"
}
