{
 "id": 2432,
 "title": "Truly Delusional",
 "date": {
  "submission": "2000-06-14T07:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Mark Marshall",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>Having used datura a few times in my youth as well a related plant that, I believe, here in California, is called Angel's Trumpet. I determined the dosage from reading between the lines from the first Don Juan book. Perhaps, I was just lucky. While it is accurate to say it highly psychoactive, it is not hallucinogenic. It is delusional. I have never believed that any hallucination I saw under the influence of mushrooms, mescaline, acid was anything more than a mirror of my mind or the perception of things usually filtered. Datura and this other plant produce a state where you believe that what you perceive is real. Truly.",
  "It contains similar alkaloids as belladonna (scopolomine) and can be very dangerous. The 'high' lasts about 36-48 hours. It will allow you to do very stupid and dangerous things. As an example, a group of us, consumed a tea made out of the seeds and finely chopped roots. One guy, who dealt drugs and wasn't particularily centered and/or able to connect with anyone else in the group decided to take off. Another guy and I understood that it was dangerous for anybody to become separated so we pursued him down to a busy boulevard where after a couple of blocks we became freaked and ceased trying to talk him into returning with us.",
  "We went back to the house. He went on his way, went to his house, got a suitcase full of drugs, walked to a strange neighborhood and into some old people's house. Whereupon, he began to behave as if he was in his own house. What occurred next I'm sure is obvious. If ya really want to get whacked out and have, perhaps, a transcendent experience, this is not it. If reports here and elsewhere are correct, and you want something like that, find a chemist, synthesize some DMT, find a safe place and your deity be with you. At least you won't die.</p>"
 ],
 "erowid": {
  "id": "1815",
  "citation": " Mark Marshall. \"Truly Delusional: experience with Datura (ID 1815)\". Erowid.org. Jun 14, 2000. erowid.org/exp/1815",
  "substance": "Datura",
  "views": "9054"
 }
}
