{
 "title": "Epiphanies of Space/Time Symbiosis",
 "author": "sungod",
 "citation": " sungod. \"Epiphanies of Space/Time Symbiosis: experience with Salvia divinorum (ID 2433)\". Erowid.org. Oct 7, 2001. erowid.org/exp/2433",
 "substance": "Salvia divinorum",
 "bodyweight": "165 lb",
 "report": "<p>What can I say?  My perspective of 'reality' and existence in general has been permanently altered.  I gained insight into the actual workings of our universe as a whole; as this infinitely choreographed, intimately related collection of neural pathways connecting sentient beings across this reality and the next.</p><p>I obtained the shipment of salvia earlier in the day and was able to restrain myself from immediately sticking some of the darkly foreboding leaves in my newly purchased bowl (extra large and bought specifically for this purpose).  I had heard so many warnings about the importance of a 'sitter' so I decided to wait until mine arrived, in this case my girlfriend.  So she gets there and I decided to briefly meditate to center myself and focus on what I was hoping would be a truly enlightening spriritual journey.  I really don't even know how many leaves I stuck in the bowl, but it was enough for me to be able to take 4 massive bong hits and one final puff at the end.  I felt the effects begin to take place after maybe the third hit. </p><p>I have extensive experience with LSD, mushrooms, peyote, etc.  Nothing prepared me for the truly frightening yet completely reassuring affects of the salvia.  I could feel external pressure on my body, mainly my head, that was pulling and pushing on me in an accordian-like manner. Almost immediately I had a complete shift of perception.  Although I never lost the feeling of 'me', I could no longer identify 'me' with anything other than what I was at that moment experiencing.  Suddenly, I saw our visual, physical reality as false; it was simply a shell covering the true reality, and I accepted this as quickly as it was shown to me.  Like a sheet in the wind, I could see in the distance a wave rippling through our planet, and at the base of the wave was something resembling a black hole, sucking everything that lie in its path.  I could feel a distinct and unquestionable presence; one that seemed to be truly ancient and steeped in wisdom.  Although I sensed a benevolent nature, I didn't feel the benevolence was directed towards me so much as I felt that I was simaeltaneously being tested and taught, and most intrigueingly, shown an ultimate and cosmic absolute truth.  This was the most profound experience I have ever had with any psychotrope and I would highly recommend it to anyone who was curious about the symbiotic relationships present that span all measures of space and time. </p><p>When I came down, my girlfriend kind of looked a little alarmed.  I had laughed hysterically for the entire 4-5 minutes and drool was running all down my chin.  She was in disbelief at what I told her about my experience; of course, her turn was next...</p>",
 "year": "2000",
 "id": "2433",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-10-07T07:00:00.000Z",
 "views": "6269",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 }
}
