{
 "title": "Creepy State of Happiness",
 "author": "Redrum",
 "citation": " Redrum. \"Creepy State of Happiness: experience with LSD (ID 24343)\". Erowid.org. Apr 7, 2007. erowid.org/exp/24343",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "report": "<p>Until now I had never triped on acid before. I had wanted to for years now but I could not find it anywhere. After trying it I couldn't believe of the power this drug has.</p><p>It was a Friday afternoon, warm and sunny. Me and friend J has planned to pick up some acid today. We met up around noon and took the half hour ride to the town were J's dealer was located. When we got there J ran in and came out 5 minutes later. We drove off and then pulled into a gas station nearby. He told me to pump and pay, and which I did. When I got back into the car he was examine the acid. It was wrapped in tin foil and inside the foil were 10 small pieces of blotter paper which had a design of a sun and rainbow on them.</p><p>J took 1 of the blotter and stuck it in his mouth. He wrapped the rest of it up and drove off. About 30 minutes later we were back in are home town. J pulled in to his house and we went in up to his room. 'The acid works' he said. J told me he was feeling the effects hitting him.</p><p>J was an experienced tripper, but me on the other hand had never done it. I had been worried for a small portion of the day on what to expect and if I would have a bad trip, but after talking to J and him telling me to just go with the flow, think positive, and remember it is just a drug, I felt better. Basically for the next few hours we sat around, I played on the computer and he sat on the floor toying with a yo-yo.</p><p>'Feeling better now' J remarked. I was feeling better about things now and was ready, I wanted jump into the world of lsd. 'Its time to really trip he said' He told me by judging what one hit had done to him, that I take atleast 3 hits to really start tripping. He unwarped the foil and handed me my 3 hits. He took 3 more hits out for him and dropped em. I dropped the hits right after him. They had a bitter taste almost like vinegar or licking a penny or something.</p><p>About an hour went by and I hadn't felt anything. J had began to trip already and I worried something may be wrong. I got off the floor and went back onto the computer to browse the internet for awhile. I got bored of it really quick, and began to mess around with the paint program. Again I got bored of it, and began to find myself very restless. I got out of the chair, feeling in the mood to walk around. I walked around looking at the posters on the wall then down at J. J was sitting there on the floor still and looked at me and began to laugh. I laughed back then cut it short. 'Oh shit' I said out loud.</p><p>I could feel the acid start to effect me. I felt very giddy and happy, fuzzy and a little strange, like begin disconnected from the current world. It worried me a little but the happy giddy hyper mood I was in didn't make it matter to much and so I began laughing again. J joined in on the laughing, and we had to be laughing over nothing for at least 5 minutes straight. After that I sat back onto the chair. I sat there and looked at everything in the room. 'Wow' I said.</p><p>Everything in J's room was very sharp now, as if everything had a huge epic story behind it. Each object had a birth somewhere in a factory or workshop in a country and has worked it's way down the complex chain to J's room. My vision by now had become very foggy. Things were twinkling in the corners of my eyes, and I had a very strong body high by now. My mind raced with thoughts, anything imaginable would come across my mind. Anything I looked at could have made me ponder for hours on the origins of it or it's use.</p><p>J had been sitting on the floor and had gotten up now. He was staring deeply at a poster on the wall. My attention was directed to the poster. Everything seemed to move in it, the serpent, the waves, the ship, as if at the time an epic battle had begun. 'Do you see that' I said to J. Yea he murmured, as if his attention was directed more onto the poster then reality.</p><p>By now the trip had really began to take off. After looking away from the poster I noticed how much I really was tripping. The room seemed to dance in movement, even tho everything really was sitting still. I heard all sorts of noises that didn't make sense with the atmosphere. It began to confuse me greatly. The noises increased and i became very confused. His room had been depleting from around me. Everything was fake. Evrything was just a mirage, and so was I. I only exist until the point I realize I'm just a mirage, and then I vanish. I sat there waiting for me to vanish out of existence.</p><p>I was very scared at the time. Just let it happen I thought. The chaos of the room grew, and I began to freak out. 'What the hell' I yelled. I seen J come over to me. I was scared to look at him, but the thought of him made me think of him, and now he would disappear of existence. He walked over to me. He look like an alien, something I had never seen before, his face morphed into stretched out shapes and fickeled colors. He reached to me, and I put my hand out, yet it seemed to go right into me, and he pulled out real quick. Suddenly the noise stopped.</p><p>'The music was way to loud' he said. Ok just the music, it was only the radio the whole time not my mind, the drug had made things distorted that all. I stamped that into my mind, but the sight of the room made me scared it would repeat. 'We need to leave' I told J. 'OK' J said and we both walked out. It occurred to me as we went down the steps, neither of us knew exactly were we were leaving to. At the bottom of the steps J stopped turned to me, and said something. It made no sense at all. I said 'What' but his reply still made no sense. 'Oh shit' I thought accidently saying it out loud. Now what? I felt as if we were trapped in a void, we could not communicate cuz we were from 2 different planets. We would stand there like cavemen for ever trying to communicate. The feeling of the fake reality had returned, and I began to get worried again.</p><p>Finally I pushed J, and he began to walk. He went out the front door and onto the porch. The outside world was totally different. It was bright, warm, sunny, beautiful day out. The sky danced in colors, the ground moved in flowing waves, the houses around us had a perfect cheery look to them. It was total bliss and I wanted to be there forever. 'Stop' I yelled. 'Lets chill here' J turned around and sat on the step. My mind raced again, and 2 thoughts replayed in my head that I remember most. First was the thought for some reason that the acid had fried J's mind into a caveman state. He just moved around not talking, and sticking to primitive moves. It prolly would have made sense if I was sober, but now to me J was just a mindless drone. Not worth even talking with, I didn't want to be a guide for mindless nothing. The second thought was the surroundings. They slowly went from total bliss, to a creepy state of happiness.</p><p>I began to feel uncomfortable out there and wanted to go inside. Forgetting completely about J I stood up and went inside. But had trouble getting in. I could not open the door, I had forgot how to. I stood there not knowing what the hell I was doing trying to open the door, until J's mom appeared standing there. She said something but it came out in fast noises that I did not understand. I looked up at her and smiled and went in brushing her out of my way. When inside I had the feeling she was staring at me from behind, and I turned around quickly. She had been outside, and I worried if J was involovd with her.</p><p>I sat down on the couch and watched tv. The words made no sense, and everything on the tv seemed to jump livly kinda like watching a 3d movie with those blue and red glasses on. The couch, very confrotable at the time, had felt like it was eating me alive. I sunk deeper and deeper into it until I called out for help. J's brother, who knew we were tripping on acid, told me I was fine and to watch tv. I look at the tv and watched as it danced with life and color, gazing onto the screen almost as if I was controlling what happened on it with my mind. This amazed me and I must have spent hours staring at the tv 'controlling it with my mind'.</p><p>After awhile I felt myself return back to reality. Slowly things began to make sense and reality began to come back to me. I glance towards the door and it was dark out. 'Damn I wonder what time it is' I said aloud. I was still speaking my thougts aloud on accident. I could still feel buzzed, when I got up to walk, I felt wobbly and dizzy, tracers still frizzed around, but I knew I was for sure coming down off the acid.</p><p>My mind was in a total jam. It felt warped, as if I had been through this loong mental chaos, as if I had lost my mind and just got it back still confused as if I was tripping or not. But then I realized I pretty much had been thorugh it.</p><p>About an hour passed an J emerged from upstairs. I guess when I was peaking on the couch I had not noticed when J came inside, or really when it had changed from light to dark outside, or when J's brother had fell asleep on the couch across the room. My buzz was going away fast, and J said he was still tripping a little bit but was coming down also. About an hour later I found myself dozing off on the couch and soon after fell asleep.</p><p>The next morning I reflected on my experience. It was crazy, deff different kinda experience. I enjoyed most of it but some was a little negitive when the confusion was strong. Yes I would do it again.</p>",
 "year": "2003",
 "id": "24343",
 "gender": "Male",
 "timestamp": "2007-04-07T07:00:00.000Z",
 "views": "3338",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
