{
 "id": 2435,
 "title": "Time Freeze Brownies",
 "date": {
  "submission": "2002-10-14T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Killerz",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 ",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  }
 ],
 "report": [
  "<p>I had eaten brownies 1 time before and got REALLY stoned but it doesn't even remotely compare to the experience I had last night. I am no stranger to weed, I smoked just about everyday this summer and every weekend since then, gotta chill for school. I bought 4/8 of DANK DANK bud and tossed it in a pot with 2 bars of butter. I brought it up to boiling and then let it simmer at its lowest heat for around 7 hours. I strained the butter/weed mixture through a cheese cloth directly into the brownie mix with the powder, eggs, and water. I squeezed all the butter from the leaves and then tossed it. I mixed up the ingredients and threw the batter into a pan and into the oven. I made 12 brownies total and couldn't wait to try one.",
  "Let me tell you, my friends and I took the brownies the next day, homecoming at my school, and I was not prepared for the wild ride I was soon to experience. We downed the brownies around 7:30 and by 9:00 I was feeling pretty good. I was feeling like I did with the other brownies I had, just very very stoned. We were watching a movie and having a good time when 10:00 rolled around. I thought that I had already peaked but boy was I wrong. I started to get all cold and I started shivering. I went under a blanket but that didn't help. I got up and went into the bathroom and I was pale as a ghost. I was feeling REALLY REALLY messed up now, like I had just taken a gravity hit. I looked at my cellphone and the time said 10:59 PM. What seemed like a few minutes later I walked into the kitchen to grab a drink and the microwave clock said 10:58 PM. I didn't think anything of it at first because clocks are usually off by a few mins. So I sat back down in my chair and glanced at my cellphone again but the time still said 10:59 PM.",
  "Now I was starting to freak out and I went in my room and the clock I had in there said 10:59 PM. I quickly ran back into the kitchen and the clock said 10:56 PM. Now I was just frantic and wanted to know why time was going backwards. I was in my own little world running around from the kitchen to the living room and then back to my bedroom checking every clock in the house. No matter how many times I looked at any of those clocks the time was either 10:56, 10:57, 10:58, or 10:59. I just wanted it to be 11:00 already so I could calm the hell down. I guess at this point I should have just sat and watched the clock but I just had to keep moving. I went back in the living room and I knew time was going foward because the movie was definitely nearing the end, so I had no explanation for what the clocks were telling me. I just ignored it and didn't mention it to anyone because I thought they would think I was crazy. I had had bad trips before so I just reassured myself I would snap out of it.",
  "I went back into my room and the clock said 10:58 PM and I started flipping again and when I walked out of my room my friend was standing next to my dvd rack checking out the dvds. I just stood there across the room watching him and noticed that he hadn't moved in what seemed a long while. So I walked up to him and just kept staring at him but he really wasn't moving. I looked around the room and noone else was moving either. This happened in like 5 second spurts, like everything would be frozen for 5 seconds and then it would be normal again. Later on in the night I had some visuals but nothing major because I wouldn't let myself. 11:00 finally came and I started to calm down and then enjoyed the rest of the ride.",
  "So much more happened but that was the most messed up thing from the night. I have bugged out many times in the past and was not very good at controlling myself and I was going to stop smoking until I managed to get a grip on myself. That was two years ago and I haven't really bugged out since. This experience was just SO intense that although I contained myself and came out ok I just wanted others to know what pot can actually do to you. But I think if you just chill out, and talk yourself through it, you can sit back and enjoy the ride because it will all pass sooner or later so just enjoy it while you can!</p>"
 ],
 "erowid": {
  "id": "18162",
  "citation": " Killerz. \"Time Freeze Brownies: experience with Cannabis (ID 18162)\". Erowid.org. Oct 14, 2002. erowid.org/exp/18162",
  "substance": "Cannabis",
  "views": "21400"
 }
}
