{
 "title": "Words Flying From Waterfalls",
 "author": "Joel",
 "citation": " Joel. \"Words Flying From Waterfalls: experience with Salvia divinorum (ID 24376)\". Erowid.org. Nov 29, 2004. erowid.org/exp/24376",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "report": "<p>As I expelled the fumes left over from the 30+ second inhalation of the second hit (15x extract from 2 foot waterpipe), I sat back and non-expectedly awaited the results. I felt myself quickly losing control of all reality. As in reality, I was outside, wind blowing, birds chirping, etc... I could sense that I was on the brink of either insanity or nirvana. I set my waterpipe down and that's when the sky surrounded me and there were misty, cool clouds only some feet below me.</p><p>At that time I realized that I was floating, only I was not myself, but rather looking at myself from my own eyes. I looked around at my breath-taking environment and it very much resembled the jungles of Africa, with the beautiful waterfall towering behind me, and an amazing array of birds sounding off and other wildlife as well. It seemed as though I were floating for miles away from the waterfall, only when I returned my glance at it did I realize it was in the same place. I followed the raining water back to the peak of its downpour, and saw the huge head of an African tribesman. The river was flowing out of his gaping mouth, and he was uttering something without moving his lips. I could tell it was an ancient tounge by its amazing variety of clicks, tones, and strong accents. As the man spoke, letters spelling out his endless speech poured from his mouth, just as the water had done. Giant block letters of yellow and and red that had umbrellas attached to them at the top-center. The hook at the bottom of each umbrella, beneath the letter, seemed to catch a wire floating in mid-air as they fell over the edge. As each letter floated downward in a diagonal straight line, it disappeared into the mist of water.</p><p>Suddenly I was ripped from this beautiful reality and found myself sitting next to 3 sentient beings that I could not recognize, but felt a strange familiarity to. I looked around slowly, and with great difficulty. The beings had long black dreadlocks, very thick, and had a powerful aroma about them. All three were men, and they were facing their backs to me as though I were not there. I reached out to touch the one of them that was closest to me. I kept stretching my arm to touch him, but he was inevitably out of reach. At this time I could sense a familiar feeling and started my descent back to reality. I looked at the men once again, but they were vanishing before my eyes, when all at once I was sitting with my friend and he was just staring at me with the most confused, and disbelieving look I had ever seen. I told him of my journey, and he told me simply... 'you need therapy...' I don't know where all these visions of the African culture were conjured from but I am not of African descent, so I can't explain that strange connection I had with those 'rastamen', and why it seemed to be set in Africa... perhaps it was my brain inducing memories of recent television shows I had watched or magazines I had read... WHO KNOWS?????</p>",
 "year": "2003",
 "id": "24376",
 "gender": "Male",
 "timestamp": "2004-11-29T08:00:00.000Z",
 "views": "5378",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
