{
 "title": "Aytomatik Ixe",
 "author": "ellipsis",
 "citation": " ellipsis. \"Aytomatik Ixe: experience with LSD (ID 24375)\". Erowid.org. Jun 11, 2003. erowid.org/exp/24375",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "report": "<p>This experience happened quite a while back. It was by no means my first or last experience with acid, but hopefully it conveys some of the reasons why it is my favorite drug.  Enjoy.</p><p>My boy E had just returned from a trip with an entire fifth gallon of liquid.  It was yet undiluted, and he graciously gave me 10 drops of it, equally distributed onto 5 space treats.  Although it was already past midnight, we glanced mischieviously at each other and knew it was time to ride.  We quickly got my girlfriend H to agree to the mission, and for the fourth traveler, we phoned my friend B.  We told him to go back to sleep and await further instructions from us in person.  E, H, and I hopped in my ride and took a 15min ride out to the country.</p><p>At 2am, we awoke B, who lives next door to one other house.  It was a cold, winter night and we shuffled indoors to stay warm.  Once indoors, B greeted us with some organic tea.  We lit candles and made ourselves comfortable with some Dj Cam.  We each took just 2 hits (later to become an inside joke), and centered ourselves for what was to become the energetic apheleon of our lives.</p><p>Although lsd usually takes an hour to come on strongly with me, I was beginning to get serious teeth chatter and body shaking within 15 minutes.  The tea made me have to piss, and when I stood up from the circle I tried to walk down the hall to the bathroom.  Already quite confused, I stumbled in the hallway and landed on B's bed (fortunately).  My friends were very concerned about the noise, but I assured them that I was OK as I burst into nervous laughter.</p><p>In the bathroom, the lights were out but just enough candle light came in for me to make out the fixtures.  Within seconds, my mind was tricked into thinking that the walls and doors had become some sort of 'ice'.  I started thinking of how get out, but then figured out where the door was and proceeded back down the hall to rejoin the group.  The group I came back to had been rapidly accelerating as well.  We joked about how crazy this was already becoming within 20 minutes of ingestion.  Little did we know.  The next hour or so are pretty vague in my memory.  First of all, an ice storm began to rage outside (literally).  We were marvelling at how the weather was mimicking our mental meteorology.  All of a sudden, the power went out.</p><p>We weren't too upset about the light because we were already on candle power, but the music went and the heat went almost as quickly.  This led to some confused negotiations about leaving or staying B's tiny and cold house.  We were pacing about the place, and in and out of the front door.  No one had any destination or idea what was happening.  B suggested we sit in his pathfinder to warm up for a moment.  We all piled in and the heat felt good.  While seated in the back with H, I was being taken down a tunnel into darkness at high velocity.  It looked as though I was levitating and flying over infinite rows of seats in a theatre with a luminous screen.  There was no sense of actual body.  When I tried to realize sensations, for example my hand, then I would trap a very vague concept of hand along with some mixed signals of whether or not I could feel my own.  The visuals were extremely intense and there was definitely some concern from B as to how to handle it, as he had never gone so hard or deep before.  Colors were literally pouring out of molecules of thin air and vaporizing into fractals of tangible reality.  There was very little difference between eyes closed and open because it was all becoming one concept.</p><p>B's confusion became sort of pathological and he wanted it all to end immediately.  E and I, the most experienced out of the Four tried to calm his fears despite our own dealings.  He got paranoid that the neighbors would hear us going in and out, and that the music was too loud (remember, the power was out).  In an effort to make it all stop, B told us to leave, as if he could just go back to sleep and pretend we never showed up with the liquid launch pad.  He literally locked us out, and we heard him rummaging around inside.  We tried to convince him to let us back in and that his idea wasn't going to work, but he wouldn't listen.  E, H, and I had no choice but to drive home.  Woah.</p><p>Now some people might get concerned that three travelers in our state of mind would take to the road in an ice storm.  H and I seriously questioned whether this was even conceivable, but E assured us that he had it as long as I could back out of B's long, steep driveway.  My black car loomed before us like a dragon, huddled together against the cold.  It breathed and swaths of paisley camoflauge spun off its back.  We got in and began to leave.  E took over the controls once on the road and I in shotgun.  We pumped the drum and bass on my system and let the heat flow.  The experience of moving at high velocity was breath-taking in our heightened state.  Everything visual and tactile was so warped.  Suddenly, H grabbed my shoulder from the back seat and squeezed the hell out of my arm.  With great fear in her voice, she told me she was falling into nothingness.  I tried to calm her down and told her that we would take care of her, but she was really on her own.  Her energy spun me for a loop and I could no longer tell where we were.  I thought seriously how crazy it was getting in B's house, but didn't understand anymore that we were in my car.  E had his shit on lockdown though, cuz we were all of a sudden in my parking lot.  Scared H wanted my keys to get in the house, and I sat back to see if she could figure out how to get in.  She almost started crying but I ran up to show her how to use them.  She looked at me like I was some sort of magician. </p><p>Indoors and with power on, we continued to experience massive amounts of spacetime distortion.  While talking to H in one room, I explained how strange it was upstairs and she told me I hadn't been up there yet.  I started to geek out at how confusing it was on this unprecedented level of tryptamine infusion.  We couldn't decide on what was really happening, so at some point we just chose to surrender to the hyperreal vortex of particles and energy.  My sober roommate awoke to have us turn down the music.  We just started laughing at how he floated in and out of the universe we created.  Until we saw him, no one had even considered the possibility that there were others in this place who weren't experiencing the same thing.  In my mind, there was absolutely no concept of sobriety left, and all sense of ego was dissolved.</p><p>We went to my room to sit and enjoy the ride.  H dissolved into the bed and didn't move for the longest time.  E and I just looked around the room and felt.  My room, lights on, was transformed into a 4 walled patio with a perfectly clear and starry night sky overhead.  Don't ask how, it just was.  B called my house and said that he had calmed down and wanted some company again.  We told him to ride on over if he felt comfortable driving.  He was down and 20 minutes later was at the door.  Upstairs we all synthesized some incredible energy flow and transfer.  H finally snapped back into our consciousness with a big smile on her face.  She said she had gotten lost in the bed, but was glad to be back.  The positivity we felt after getting through the first few hours was incredible.  For an hour in that room, we just sat in silence and looked around.  It was the surface of an alien planet in a time when none of us existed.  The speed and variation of the visuals was sooooo intense.  One thing I remarked about using lsd of this concentration is that the crystalline structure of my visual field was composed mostly of large pieces.  This is one reason why it made it so difficult to discern what the physical world was.  LSD of a lesser concentration seems to appear as smaller particles which allow one to see what objects are versus space. </p><p>After what seemed like eons, we realized dawn was breaking outside and we wanted to go for a stroll.  Up we walked on the slick street behind my house.  The trees were totally encased in ice down to the last twig.  The sun reflecting through this giant prism was unforgettable and amazingly beautiful.  All of a sudden, we heard a loud 'crack', and an enormous tree (70' oak) fell across the street right behind us in slow motion.  The noise and sight were unbelieveable, drugs or no drugs!  We were so awe-struck, that we questioned whether it had really happened or not.  After a minute of playing on the tree, we chose for it to be real.  It entirely blocked the street and narrowly missed crushing two parked cars.  We continued walking.  Sometimes I felt too conspicuous to be outdoors whilst blowing up so hard.  I thought that I was throwing up my insides and turning back out in a continuous cycle of mental v physical awareness.  It proceeded like a hollow, flexible and crystalline cylinder at light speed through the universe...continuously rolling and sliding in impossibly complex patterns, such was my consciousness.  The meditation was intense and beautiful.</p><p>Later in the morning, we tried to eat at a restaurant.  My buckwheat pancakes were more interesting to look at then to eat.  They tasted like air, but were hard to swallow.  On the surface of each blue-violet circle I could see new worlds forming and dissipating.  I remembered reading about how it would look if you peered out of a black hole into which you were falling.  Before the event horizon, you would see galaxies' birth and death in firework-like speed and splendor.  E, being the old master that he is, ate my breakfast as well as his own.  After another hour or so of kickin it back home we all split up.  H and I showered together and then hit the bed.  E and B flew away for the time being.  In bed, we made love with pure and energetic spheres of radiance around us.  The soft one and I drifted off into a light sleep with surprisingly little resistance, exhausted and clean.</p><p>I awoke around 3pm with a start after a 4 hour nap.  The visuals were still very noticeable although nowhere near as intense as the peak hours of madness.  I had an overwhelming feeling of calm and purity to the point where I cried lightly a few times.  We just kicked it inside my lovely little apartment smoking high-grade herb and snacking on real foods to replenish ourselves.  E and B later came over to revel in the afterglory.  It taught all of us alot about ourselves and brought us even closer together as friends.  Throughout the previous night and forever afterward, we would ask E how many hits he actually put on our space treats.  With his mischievous smile he would reply 'just 2'.  Later he would ask us, 'just 2?', and then laugh his ass off.</p><p>I recommend taking smaller, known doses for the uninitiated.  For the experienced traveler...well, sometimes you just see where or when the path leads you.  Overall, it lasted for ~20hrs before totally leaving us, thus the day after was still very interesting.  That night of the ice storm is called 'lsd death night' by H and B, but E and I call it 'automatic ice'.  It took me to the edge of sanity for a long time.  I loved the person that I found there, and we emerged together with a profound love for life and the Earth.  The harmony of existence is infinite.  Here is something that made me cry the next day in light of the experience, I hope you enjoy it as I did:</p><p>A heavy snowfall disappears into</p><p>the sea.  What silence!  Knock on the</p><p>sky and listen to the sound.</p>",
 "year": "2001",
 "id": "24375",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-11T07:00:00.000Z",
 "views": "6973",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ]
}
