{
 "title": "Addicted to Gasoline",
 "author": "Eniac",
 "citation": " Eniac. \"Addicted to Gasoline: experience with Inhalants - Gasoline (ID 24386)\". Erowid.org. Jun 30, 2005. erowid.org/exp/24386",
 "substance": "Inhalants - Gasoline",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  " repeated",
  "inhaled",
  "Inhalants",
  "(gas)"
 ],
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>My story starts out pretty simple.  I was in my shed one day, and found a tank of freon (R-22). I had always looked down on huffing, but I was depressed, so I took a 'whippit' balloon and filled it up, inhaled, my voice got deeper, and this is where I started doing it frequently, making prank calls with 'the voice', etc. Finally, after about a week of inhaling on this 30lb tank, I got the weirdest feeling in my mouth. Like chalk dusk. There was even a little demon/gremilin that would appear at times. This was only the beginning.</p><p>Being in a 'fuck it' mood', I went to the shed and took a can of gas, opened the 'carb' hole (put there for east pouring) and sucked the fumes straight from the nozzle. At first I was just amazed my how the wood grains would form shapes and images, later I actually found myself talking to what I call 'gas buddies' (the hallucinations)</p><p>One day I was huffing and I thought my friend died because the hallucination of him came to me.</p><p>I found myself huffing not only for the visuals, but for the company of these imaginary 'friends' that would come to me when I would start to huff. I have been struggling with this addiction for about 7 months now, at one point in time, I noticed some neurological damage, for one side of my finger was numb for about a month. I still fight the constant urge to inhale the evil fumes. All the hours I spent, with my eyes closed, inhaling and visualising VERY prominent shapes, people, places, sometimes seeming so real that it felt as if I had been warped to another dimension.</p><p>I always just thought kids huffed to get a buzz, I never got that, I thought I was the only one who hallucinated off of it. For a while I thought it was brain damage, which I know now, that I do have some brain damage. (If I look at an object for a couple seconds and close my eyes, it's outline will appear in various colors).</p><p>At one point in time, I was contacted by a guy's voice, his name was 'Lord Zonar'. He said, 'I will grant you three wishes to [used a very long, made up word] your parents.'</p><p>He kept saying this, it echoed in my head, I asked what the word meant... the reply, 'TO KILL' 'TO KILL' 'TO KILL', it kept echoing in my head over and over and I didn't touch the shit for about a day or two, but soon found myself in it's clutches again. I now have boarded up any possible openings to the shed, and put a padlock on it, giving the key to my mom.</p><p>If I were to include every sngle detail, bad or 'good', this would end up being a novel. All I can say is thanks to the people who submitted their reports on this similiar situation, for now I know I'm not the only one. I have experienced alot, from a to z, including crack cocaine, and IV drugs, but the psychological addicion of this fuel had been the hardest to quit. No joke.</p><p>If I could do it again, I wouldnt make the same mistake by even 'experimenting once', because as soon as I got those closed-eye visuals, I was hooked.</p><p>Take heed to my words. PLEASE.  I am less 'scarred' by my past IV use, than I am by this horrid, horrid addiction of huffing.</p><p>Peace,</p><p>Eniac</p>",
 "year": "2003",
 "id": "24386",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-30T07:00:00.000Z",
 "views": "10894",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 }
}
