{
 "id": 244,
 "title": "A Sample Trip",
 "date": {
  "submission": "2004-09-04T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "bent_razor",
  "gender": "Male",
  "weight": "137 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "<p>The day had begun for me at about 11:00am, which is actually pretty early for me, undisputably a night person. I began to engage in a typical morning's tedious activities (i.e. the common practices of hygene, satisfaction of hunger, etc.) when the phone rang. It was my friend Kim, who invited me to go to her apartment to smoke cannabis and converse as we'd been doing every Thursday for several weeks.",
  "When I arrived at her place, she loaded the pipe and let me take the 'Green' like she always does. After we'd finished, we talked casually for a few minutes. I don't recall what prompted her, but her expression turned serious.",
  "'This is going to make you mad...I tried to do something for you too, but I couln't.' She must have read my confusion, because she stood up and left the room. When she returned, she was carrying two very large bags of mushrooms.",
  "Despite her expectations, I was actually very impressed; I'd never actually seen them before. I pulled my bag out and found a decent-sized bud, which I traded for two small caps and a couple stems. The stems had bruised blue, indicating their authenticity. I was overjoyed, even despite the small quantity I'd received.",
  "I decided to eat them later that afternoon at a friends' sisters' house. I'd always heard the taste was terrible, but they seemed okay to me. I was with three friends, as well as another aquaintance, Steve, and his girlfriend. We joked and passed around a water-pipe. What I experienced about twenty minutes later definitely qualified as a drug-altered conciousness.",
  "I remember the first effect I noticed was the change in sensation I felt throughout my body. The novelty was fantastic, so much different than marijuana or alcohol. A visual change took place shortly thereafter. Lights had a noticable haze over them, and colours seemed far brighter.",
  "'Wow, these are really starting to work!' I proclaimed.",
  "Apparently, Steve's girlfriend took this as an invitation to start fucking with me. She began to push her face close to mine, then pull it away quickly and repeat.",
  "'I'm still coherent, though,' I grumbled, slightly annoyed. Still, the movement of her face hypnotised me, and I realized that her face was the only thing I could see. I watched her for a moment, when a sudden feeling of amusement overtook me. Amusement gave way to euphoria, and I could feel the peak coming.",
  "During the next fourty minutes or so, I didn't speak or interact with the others, but I was still having an excellent time. The feelings I experienced were like no other I'd ever known. The sensation came over me that I could actually feel the two substances working on every cell in my body. My minds eye saw what was apparently two large transparent clocks with no numbers. I learned quickly that each was a representation of the drugs I had taken. I sat and smiled as I watched (strange as it may sound) my trip slowly tick away into normal conciousness. I was so taken by the experience that all I could do was flash a metal sign.",
  "'Here's to natural drugs!' I gushed",
  "Concerning my first experience with psylocybin, I regret only that I couldn't have consumed a larger dose. The time-space warp and sharpened abilities of self-relflection that a standard trip is alleged to offer do sound very intriguing. I call the experience my 'Sample-trip' because, much like samples of food in a grocery store, I only recieved a taste, an insignificant portion of the psychedelic experience. However, this sample did manage to fullfill the true goal of every sample, which is to set the customer's taste with a small amount in hope that they'll purchase the item in bulk. Needless to say, I'll do just that. I'll count the days until I can once again eat those cute little fungi and experience the outlawed miracles they tend to perform.</p>"
 ],
 "erowid": {
  "id": "10311",
  "citation": " bent_razor. \"A Sample Trip: experience with Mushrooms (ID 10311)\". Erowid.org. Sep 4, 2004. erowid.org/exp/10311",
  "substance": "Mushrooms",
  "views": "7086"
 }
}
