{
 "title": "The Foxiferous",
 "author": "The Cuddly Commando",
 "citation": " The Cuddly Commando. \"The Foxiferous: experience with 5-MeO-DiPT & Nitrous Oxide (ID 24424)\". Erowid.org. Aug 5, 2006. erowid.org/exp/24424",
 "substance": "5-MeO-DiPT & Nitrous Oxide",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "5-MeO-DiPT",
   "(gel tab)",
   "",
   "9 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>3:15 pm Decided to have a solo trip, explore the possibilities of 5-MeO-DIPT in a personal, uninterrupted setting. Took one geltab that contained between 18-20 milligrams of Foxy. Now waiting for it to take effect. Took a shower, cleaned up a bit, drank some iced chai tea and bumbled about.</p><p>3:55 pm  Starting to feel a few twinges...nothing big. Playing the Legend of Zelda on n64having a little trouble concentrating.</p><p>4:11 pm  Definitely starting to feel it, gonna lay down and watch rat race (the newer version). This should be interesting.</p><p>4:23 pm  Ran to the store for some more supplies, milk, etc.</p><p>4:42 pm  Made it back, and only just in time. The beginnings of a foxy trip in a pharmacy is pretty daunting.</p><p>4:46 pm - There are lovely color distortions among the waves of psychedelic color/sensation pulses. I can SEE waves of synthetic distortion.</p><p>4:49 pm  The onset of foxy feel good waves and grinning fool-dom! Joy!</p><p>4:58 pm  All within a couple of minutes, full onset of tripbreathing walls, peripheral color distortion and tracersfoxy energetic rushesauditory distortion tooabout to do a whipit.check back in ;)</p><p>5:02 pm - Foxy adopts and lengthens the dissasociative affects of Nitrous. The waves of waaa are stretched, lengthened and deepened.</p><p>5:20 pm - Oh my lordjust looked at clock. Only 18 minutes since last at this computer. Foxy definitely distorts time perception whewfingers snaking into keyboard. Trying to describe body highalmost like too much ecstacy or body energyfeeling of expanding soulmy skin is stretched too tight for my being. Maybe thats why people dont like the body loadfeeling of constriction.</p><p>5:42  Feels as if my heart is connected fundamentally to the musicno foxy trips without musicI couldnt even imagine it.</p><p>5:56 pm  I can see how some of us talk about self and one and Center so muchI am herewith the proper music, drugs and atmosphere, I feel completely at one with myself. Most joyous feeling in the world...something akin to the purest feelings of joy when I was a child (christmas mornings, camping trips, etc)</p><p>6:04 pm I wonder if other peoples headspaces are like thissex and music inextricably intertwinedIve found that I can play with audiowith enough focus, I can choose and distort sound in my own head. That is the high of psychedelics to meI am the mistress of my own universe for one day. I control shadow, light, sound and thought from the center of my being. Its never this good in real life. Hehnow to get there without drugs.  Must listen to the Orbital remix of Perfect Drug when soberI dont remember it being this synthy/distorted/wavy</p><p>..or maybe orbital is just that good.</p><p>6:12 pm - I take it backthere is a connection with nature through this drug. Must try mushroomssee how much more organic it gets. Silence is lovelyI turned off the musicthe sounds of the world are strangely rhythmical and purposeful. Sunset is going to be awesome.</p><p>6:39 pm  Peaking now maybeeverything very deep and far awaymuch meaning assigned to the faintest perceptible motion or sound. Personal connection to the movement and every sound around me, very sacred hue cast upon the entire world.</p><p>6:56 pm - Just had one of THE ONES. One of those nitrous balloons that kicks me into the next century and sends me skidding on the ass of my soul for a while. YOW.</p><p>Attempting to sing on hallucinogens is definitely interesting. I wish I had a tape recorder. WHEEI have no idea what this sounds like. Sounds pretty strange on my end, what with the auditory distortion and all.</p><p>7:36 pm - Went and talked to my roommatedunno if he knows that I know that he knows that uhyeahI'm not currently residing in this dimension.  I totally just recreated a scene from the wizard of ozwhere she opens the door to Technicolor and *WHOOSH*! the cutesy 50s music changes. Except the scene was my back deck, and the music was Orbital's Bladerunner. The sunset is beginningits fargin awesome. The shades of light and dark are much more pronounced on foxy, creating the illusion of deepened color. I really do feel like Dorothy in the Wizard of Oz...everything is in electric technicolor.</p><p>7:41 I feel like the most sensitive membrane of skinany sound or movement or sight vibrates along my entire being most pleasantly.</p><p>7:48: Just had an intense spiritual momentI stared at the world outside and was presented by what (I swear to god sounds so silly but fuck ill say it) looked like a symbolsymmetrical, curving and somehow very meaningfulit just floated out of the trees and hung suspended midair for a moment and thenI pulled away and it dissipatedI was left with an overwhelming feeling of awe. WowI certainly hope this makes sense someday. But for just a moment, I vibrated with it, lived in its space and was the symbol with my mind and bodyand then it just floated away. I got to keep it, though. Forever burned on my eyes. A lady bug just flew in and landed on my finger. Is the world saying hello?</p><p>8:25 pm - Still definitely tripping, although I seem to be past the peak, feeling utterly drained psychically, psychologically. My brain has been thoroughly probed and explored.</p><p>8:56 pm well, Im on the hind end of a uniquely satisfying trip. Im back, for the most partcant say whether Im in one piece or not ;) I am, however, enjoying some very fine strawberry shortcake ice cream and wishing that my baby were here. I may even be up for going out laterthe night is still young! I must look completely haggard, tho..after this much goings on in my head, I can imagine what my body looks like. Well see later. Heh.</p><p>6:42 a.m Morning after. Stayed up quite late, sizzling in a pile of overexposed quivering psychedelic goo. I had to battle some small pesky demons in the wee hours of the morning. The extra sensitivity foxy lends one's eyes and ears is not friendly when one is desperately trying to sleep. I wooed myself to Neverland with thoughts of warmth and love and the next day to be had. The only thing I truly dislike about foxy is its tenacity on the comedownit will NOT let me sleep. But I think I eventually got a good two or three hours in. The ravens woke me with a very colorful conference outside on my back decktwas quite fun to watch. A night of therapeutic self exploration well accented with foxy.</p>",
 "year": "2003",
 "id": "24424",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-08-05T07:00:00.000Z",
 "views": "3810"
}
