{
 "title": "Life after Exstacy",
 "author": "Dawn",
 "citation": " Dawn. \"Life after Exstacy: experience with MDMA (Ecstasy) (ID 24435)\". Erowid.org. Jun 11, 2003. erowid.org/exp/24435",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "2002",
   "24435",
   "Female",
   "",
   "Not Given",
   "Jun 11, 2003",
   "11798",
   " "
  ]
 ],
 "report": "<p>I started taking exstacy with my husband because one of our friends tried it and recommended we try it.  The first time we took it, we were at home with the kids tucked tightly in bed.  We retreated to our family room, turned on some R & B, snuggled on the couch and within 40 minutes, we felt a rush of warmth all over our bodies. We sat up all night long just talking!  We literally didn't walk up the stairs until 7:30 the next morning. Scientifically, when you take X, it releases seratonin in your brain and when it is released for the first time, there is no better feeling in the world!  The first time we took it, we took 1 1/2 pills each.  That was more than enough for our first time.  The next few times we took it, which was within 6 weeks, we took 2 each.  </p><p>As we did it more and more (about every 6-8 weeks), we had to take more and more.  The effects weren't as wonderful as the first time though.  Therefore, some people may say it loses its affect the more you take it.  That is what happened to me.  I just couldn't take it anymore.  I had my fun with it and that was it.  I noticed though that after I stopped taking it I had become depressed.  I was even on anti-depressants for 6 months.  It doesn't effect everyone the same way.  My husband still gets that old time feeling every time he takes it.  Though he doesn't take it anymore because I don't.  If we were to do it again, he would feel as though it were the first time.  So, if you take it, know your limits and if you do get depressed, it is best to go see your doctor and be honest with them!  If they dont' know what you have taken, they can't help you.</p>"
}
