{
 "title": "My Trip Within a Trip",
 "author": "Wario",
 "citation": " Wario. \"My Trip Within a Trip: experience with Morning Glory & Ginger (ID 24508)\". Erowid.org. Apr 11, 2007. erowid.org/exp/24508",
 "substance": "Morning Glory & Ginger",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Morning Glory",
   "(ground / crushed)",
   "",
   "2.5 g",
   "oral",
   "Ginger",
   ""
  ]
 ],
 "report": "<p>I took the infusion Saturday evening. I made preparations two nights before when I ground the seeds (Heavenly blue Morning Glory seeds, stolen from Sears, 3 packs of 2 grams each. I managed to get unpoisoned ones.) behind the closed door of my first-floor bathroom, taking breaks so as not to overheat them. I used a coffee grinder. Then I put the powder into a plastic bag, and packed it covertly in the clothing I was bringing on vacation, along with ginger, in root form. I found it hard to get all the powder from the grinder.</p><p>Two days later I was at our destination, somewhat bored. I went to my closet in my room at our condo and used a spoon to put it in a bottle of ginger beer. I figured that it would help with the nausea. I spilled some powder in transeferrence, which may have amounted to a weaker experience I was nervous. My mom came in the room once, but she didn't see me. I drank the mixture, somewhat disgusting but nothing too bad. 5 Minutes later I swallowed a few chunks of ginger root with some juice. It got stuck in my larynx and I coughed up some juice but eventually swallowed it down. I had some pasta about 10 minutes later, and I wasn't hungry. The nausea was kicking in, and became rather bad for about one hour to 75 minutes. It was strong, but I didn't vomit. I believe the ginger tempered it.</p><p>Around that time also began the dilation of my pupils. They were large, the size of coins. I am lucky to have normally big pupils so they did not arouse much suspicion, but if anyone had scrutinized they could have guessed something was up. And after that hour of nausea had passed that something was me. I rode with my friend on bike to the nearby market and was feeling a good high feeling on the was over, a nice heavy high while I was there, and euphoria on the way back, even though we were soaked by a storm. I remember feeling my inhibitions lowered and I found the reflection of the trees in the puddles fascinating. Even though it was getting dark I had good night vision, presumably due to the dilation.</p><p>While I was at the hight of the trip (this lasted about six hours) everything was fascinating. At one point we all were sitting in the living room and my mom was laying down ground rules for our stay at the resort and talking about things we'd be doing and I was in total agreement. We talked about the Civil War, because there were many historical sites nearby and I thought and commented that the main thing was that it was sad that so many people died. My sense of touch was heightended and my bedding and couch felt great and fascinating. Everyone else left the condo and I proceeded to brush my teeth with an auto toothbrush which was also, you guessed it, fascinating.</p><p>Then I got in bed and listened to a Metallica CD I had got. It was very good, and it felt like I was conducting the music. Time was distorted, and seemed at once fleeting and infinitely slow, without being either too fast or boring. I also experienced some minor wall-bending and closet-shifting, which was very cool. Later my friend came in and played some Castelvania, which I found interesting. I thanked him for always being there for me. When not on drugs I am not quite this sentimental. My brother wanted to play Legend of Mana, and I let him. It is a very colorful game, and was very fun to watch.</p><p>After that we watched the Simpsons on DVD. It was freaky, with many of the colors seeming to be pink gradients. Everything was, in fact, shaded. I did not have the fantastic closed-eye visuals I have heard about, except for some swirling, Sanskrit-seeming dull rainbow patterns which were vague and not terribly satisfying, but I still felt great. When I woke up I felt groggy and kind of achy, not rejuvenated like many people report. However, the experience was a good one, being my first real experience with drugs. I will try it again, with more experienced friends, in more comfortable and stimulating environments, and at a higher dose. It has fantastically piqued my interest.</p>",
 "year": "2003",
 "id": "24508",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-11T07:00:00.000Z",
 "views": "3473",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  }
 ]
}
