{
 "id": 2454,
 "title": "A  Perfect Specimen",
 "date": {
  "submission": "2002-10-16T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kriz",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.0",
    "quantity": "2.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "fresh",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "I recently started a 'mycology' project and yesterday had my first sample of the fruit.  It is day 30 in my project and one cake that had been an exeptionally fast colonizer, (covered jar in 10 days) had a single advanced primordia about 2 inches long.  Earlier that day i had cleaned the cake of a few aborts and noticed small blue discolouration on some areas.  This cake had a slight contam problem for a couple days, bout a week ago so i wasn't sure if it was a relapse, bruising from my scraping, or natural discolouration.",
  "There was a risk of me loosing my first tiny beautiful equador to contamination and it had been whetting my appetite for a week! (The veil had formed that morning)",
  "So I convinced myself (agaist my better judgment) that even if it were contaminated the amount was small enough that id either get a little sick, or a little high. So after giving thanks to the mycelium, I plucked this single, perfectly forming specimen, and down the hatch she went. (for better or for worse)",
  "First effects were felt in 1/2 an hour and increased over the next hour to a nice glow. No nausea from the contamination whatsoever (guess it wasnt contam).  Combined with a few splifs and a couple shots it made for a very pleasent evening. And to top it off, i didn't really expect to 'feel' anything off of a baby wet equador, which means these guys are nice and potent and my other four cakes should have similar fruits by the end of the week."
 ],
 "erowid": {
  "id": "18203",
  "citation": " Kriz. \"A  Perfect Specimen: experience with Mushrooms (P. cubensis) (ID 18203)\". Erowid.org. Oct 16, 2002. erowid.org/exp/18203",
  "substance": "Mushrooms (P. cubensis)",
  "views": "13417"
 }
}
