{
 "title": "Emotionless Head Space",
 "author": "B.D.S.M.",
 "citation": " B.D.S.M.. \"Emotionless Head Space: experience with 5-MeO-DiPT (ID 24563)\". Erowid.org. May 9, 2005. erowid.org/exp/24563",
 "substance": "5-MeO-DiPT",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "4.0 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Well to start off, my intention with this report is to review my run-ins with 5-MeO-DiPT in hopes that it will help someone who might be in a quandary of whether or not to indulge in this particular reasearch chemical. I will relay to the reader my history of psychedelic use first.  I have used LSD, mushrooms, MDMA, 5-MeO-AMT, morning glory seeds, and 5-Meo-DiPT (duh!).  My LSD experiences have all been positive as were all my mushroom trips.  My MDMA experience has left me with a great respect for the value of the drug.  I have only taken 5-MeO-AMT once and had a trip that was also positive.  I took morning glory seeds once and had no negative effects, but felt like all the work I did to extract the LSA was not really worth it.</p><p>Now that I have bored you with this irrelevant information, I can get on with things.  I have taken 5-MeO-DiPT on 5 occasions.  The first time was with 6 mg and no other substances were involved.  I had a feeling of emotionlessness that I really did not enjoy.  I did get a little 'foxy' as people mention as a characteristic of this drug, and ejaculation was more pleasurable than normal, but the pleasure left as soon as I was done and it was back to having no emotions for me.  I tried to work through personal issues in this head space but could not focus long enough to do any good.  So, overall this experience was not really useful.  It had no fun aspects, no possibilities for personal work on life issues, and there was no body high either, except during ejaculation.</p><p>My following three uses were with doses that ranged from 3-5 mg and were used to increase my altered conciousness even further.  On these occasions, I usually had 8-10 drinks in me as well as small amounts of pot.  These experiences were actually good.  I got the 'foxy' effects from the DiPT, with none of the emotionlessness I had before.  This 'foxy' feeling was very nice in combination with my already pleasurable effects from the pot and alcohol.</p><p>The last time I tried the chemical was last night.  I had 6 beers in me and a few hits of herb.  I decided to take more this time though for some unknown reason and swallowed 10 mg.  This proved to be too much and put me back in that dreaded head space with no feeling.  So, I sat around for two hours, not getting comfortable with my body or mind.  Luckily 5-MeO-DiPT is short acting.</p><p>Anyways, the reason I write this is because there seem to be a lot of people who write positive experiences, and I figure all opinions on the matter need to be expressed to help out any future users of said research chemical.  My feelings are that this chemical, as least for me, is useless except at the low dose range (3-5 mg) in combination with alcohol.  In other words, I find it works at recreational doses on a friday or saturday night, but not for personal exploration and growth that I have gotten from all the psychedelics mentioned in the beginning of this report.  One thing that I am not sure of though is that maybe it is better at even higher doses.  I have seen people take between 20 and 40 mg with positive results, but I think my experiences at low doses are a peek into what might happen at larger doses, so I remain wary.  I hope this report helps anybody who might be researching this chemical.</p>",
 "year": "2003",
 "id": "24563",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-05-09T07:00:00.000Z",
 "views": "7697",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
