{
 "title": "Lifes Realizations, Purgatory, & Change",
 "author": "American Buddah",
 "citation": " American Buddah. \"Lifes Realizations, Purgatory, & Change: experience with MDMA & 2C-B (ID 24570)\". Erowid.org. Oct 11, 2003. erowid.org/exp/24570",
 "substance": "MDMA & 2C-B",
 "bodyweight": "125 lb",
 "header": [
  "DOSE: T+ 0:00",
  "2 tablets",
  "oral",
  "MDMA",
  "",
  " T+ 0:30",
  "15 mg",
  "insufflated",
  "2C-B",
  "(powder / crystals)"
 ],
 "report": "<p>Introduction:</p><p>This is THE most profound, life changing, ecstatic, scary, demonic, metaphysical, intense, and difficult experience I have ever had. Let me give you some background information about me: I was looking for an answer for my social acceptability, religion, life, and fear of death. I tried to be more socially acceptable by experimenting with different drugs such as MDMA, weed, mushrooms, salvia, DXM, LSA, and Nitrous. I have found through this experience why I experimented with these drugs and why I dont need them anymore. This was my chemical catalyst for me; everything has a higher meaning now. This new state of consciousness can be obtained without the use of psychedelic drugs but psychedelic drugs can open your mind to new perception and realities. My new mind is now working in different and new ways.</p><p>Before the Trip:</p><p>Friday morning, B and I left to visit his cousin. His cousin, A, had some 2C-B so we wanted to meet him and try it. A is someone who I thought we had similar interests in which is: drugs. He is a stranger and his apartment was filled with a lot of interesting shamanistic, chi-like art, books, and other psychedelic items. We were planning a wonderful experience, but in the end it totally changed my views on perception, reality, religion, truth, and will continue to change me forever. Friday night we all smoked a bit of kind bud and we all got really high. A, was rapping like a madman, I didnt understand this at the time, but later I did. B, snorted about 20mg of 2C-B that night. He was very euphoric and he loved the visuals. He told me it was a really nice experience. So I was happy about that and was excited to try 2C-B the next day.</p><p>No turning back:</p><p>The next day, A and I, dropped 2 MDMA pills containing a small amount of meth. About 30 minutes later we felt the VERY euphoric, love-dovey, happy effects of MDMA. </p><p>We each snorted about 15mg of 2C-B. I never snorted anything and always had fears about snorting because it looked like something a coke addict would do. But I snorted it with no fears because I was rolling and the burn wasnt so horrible because I was rolling. B also snorted about 15mg of 2C-B. We decided it would be good to go to the pool and swim on that hot day. By the time we got to the pool we were all starting to feel the effects.</p><p>Harmony:</p><p>We arrived by the pool and dove in. The water felt great and I was seeing rainbow colored refractions on every ripple and current on the water. Swimming felt great, talking was smooth, and I had no fears of what other people thought. I was seeing the birds and beautiful dragonflies flying around and it was in perfect harmony with everything. I saw the fine intricate details in everything. The details that normally are not seen are seen, the beauty in nature thats always there is, I recognized and appreciate. We got out of the pool and decided to go to the hillside. It felt so perfect walking barefooted on the grass. Trees, plants, animals, the sky, and human beings felt like everything was in harmony and perfect. The clouds in the sky swirled as I stared, sort of like the painting starry night cloud swirls. It was so beautiful and ecstatic, the suns rays on my self felt great. We chilled and talked for a while as I watched the beautiful visuals melting around me, birds and entities, I felt in harmony with nature and everything.</p><p>Lifes Realizations:</p><p>We all went back to As apartment. He showed us this video which was very trippy. The video showed the earth and how life got started. The visuals were great and things made total complete sense. Many things that related to my life were in that video, also I saw the energy thats in everything. I appreciated all the art in his apartment and later realized that it all had a deeper meaning. I cant describe everything, everything was in the details, thousands of details I could appreciate and realize that normally I would shrug off. A had this psychedelic art book, as I was looking at the images, I realized that this was how life was. All the images somehow related to my life as a human being. A was playing music and this was the revelation and downfall. At first the music all had meaning to my life, every lyric was somehow tied to my life. A was actually rapping to the music at the EXACT same time. Every conflicting problem that related to good or bad was introduced in the lyrics.</p><p>During this time I felt the energy and the voices in the lyrics were trying to bring me into the light. I tried to embrace the light to the end, but I wasnt ready, it wouldnt accept me. I felt this incredible tingling sensation, but somehow knew I couldnt let go of death and the physical body so the incredible tingling slowly creped out of my body. I tried to embrace the light to the end, but I wasnt ready, it wouldnt accept me. At times I thought I was embracing god in the light or the ball of light. But I realize now names dont matter, the feeling of this love and energy is all the same, Lord, Ali, names dont matter---its all the feeling in your spirit which matters. Tuning into the lyrics led to practically ego-dissolving after very difficult experiences.</p><p>Purgatory:</p><p>I thought A was Jesus Christ at times when I thought he was truthful then he was someone else when I didnt feel the truth. I was having battling conflicts into my perception of reality. Living in a world of eastern religion origin and brought up in a Christian home may have been a cause of seeing Jesus Christ. Being in a new-age shamanistic apartment did not help. I didnt know what was true. I told A and B to leave the apartment so I can work it out without any influence on me.</p><p>The rap was still playing and it was hell. It was now all negative, I thought the lyrics were a figment of my imagination, it was now 12 hours after we had the MDMA + 2CB but these thought still lingered. For 2 hours I was conflicting with my own religious issues. Was this evil use of drugs leading me to the devil? Where the feelings of Jesus Christ that were embracing me fake because of the drugs? I screamed because of the voices.</p><p>I tried praying, if I messed up my words on praying, it was over and the feelings disappeared from ecstasy to nothing ness. I felt helpless. I kept praying but it wouldnt help. A storm was brewing up outside. I thought I was in hell. I thought I was going insane. Am I in hell? The thunder was getting stronger, the lightning more frequent. I went outside and everything felt like I was in hell. I was out of control and laid on the couch in pain and fear. I was scared god couldnt accept me anymore because the feelings I felt werent real, and I had eaten the evil apple from the tree. B came and we left, but many incredible things happened during this time.</p><p>Scientifically, I can explain this kind of bad trip at the end because of the MDMA crash and the tiny bit of speed in the pills making my thoughts race. Spiritually, I found out we need to find our own path in life and not let other people choose for you. B came and we left, but many incredible things happened during this time.</p><p>Change:</p><p>A lot of important details are left out because they have no meaning to you. Everyone is unique and a life-changing experience will be unique for everyone. This chemical catalyst of 2C-B and MDMA was able to change my perception of reality. Sure it could have been because I was on a drug, but this type of experience will totally change me on how to live life and how I perceive it. This experience told me that drugs arent the answer for me.  I now have a journey to find my own path.</p><p>Thank you for reading this far and please respect psychedelic drugs. Drugs arent for everyone, I just hope you dont find out the hard way.</p>",
 "year": "2003",
 "id": "24570",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-10-11T07:00:00.000Z",
 "views": "14900",
 "dose": {}
}
