{
 "title": "Now I Need 2?",
 "author": "OverRide",
 "citation": " OverRide. \"Now I Need 2?: experience with MDMA (Esctacy) (ID 24592)\". Erowid.org. Jan 6, 2007. erowid.org/exp/24592",
 "substance": "MDMA (Esctacy)",
 "bodyweight": "138 lb",
 "report": "<p>My friend who recently came to visit me, introduced me to some people he knew before he moved out of state. My friend explained to them that I was looking for E. So one of his friends walked into the house and after a couple minutes came out with another man who was on the phone. The man on the phone told me he could get white triple-stacked sunshines with little blue specks on them for $20 each. Upon hearing this I jumped at the opportunity and said I wanted 2. I have done E 4 times prior to this at raves and with friends. I've seen a lot of my friends buy pills and roll at parties, but I have never seen a triple-stacked pill before, so I was pretty psyched.</p><p>As planned the guy came at around 10PM with what I wanted, and I was so excited that I swallowed one pill whole immediately after receiving it. We talked to the people for a little while, then we decided to go home. As me and my friend were on our way home at 11PM, I started feeling very energetic and happy, and I noticed that around the edges of street lights and tail lights there was a mild flickering and glow. That was the extent of the effects so far.</p><p>When we arrived at my house at around 11:30PM I still wasn't rolling, and I decided that I just couldn't wait any longer for the pill to kick in. I crushed up my second pill into fine powder and snorted it in 4 regular sized lines. The reason it broke up into 4 lines was because the pill was so large. It was the biggest E pill I had ever seen.</p><p>Within 5 minutes of snorting the 4 lines my pupils were huge and I was completely satisfied with how I was rolling. I felt my jaw tense up and I couldn't stop clenching my jaw. That didn't bother me since I felt so good. My friend started laughing at me because I was rubbing my head and telling him how I wish he could understand how good I felt. (I tend to do that sometimes, hehe)</p><p>After I had peaked I got into a conversation with my friend about a lot of different issues in our lives. I felt very open to talk about anything with him. We stayed up the entire night talking. At about 8PM I left for work while my friend tryed to fall asleep. As a result, I was extremely tired since I didn't sleep and because of obvious reasons from rolling. After I at lunch at around 1PM I was feeling like I had some of my energy back, but I was still a little drained from not sleeping.</p><p>Two days later, I decided that I wanted to buy a bunch of those same pills for my friends since they are hard to find where I live. So my friend and I called up the same guy and we went and bought 20 more of the same pills from him.</p><p>Later, the day that I bought the 20 pills I started remembering how I didn't really get the effects I wanted until I took the second pill. So at about 10:40PM I crushed up one of the pills I had just bought, swallowed it inside of a piece of kleenex tissue. Me and my friends call this 'Parachuting'. It helps the pill to absorb a little faster since it is already broken up.</p><p>By Midnight I still hadnt started to roll so I decided to look in a mirror to see if AT LEAST I had a little pupil dialation. I noticed my pupils were randomly getting bigger and smaller, but not staying at either for more than a fraction of a second. This confused me but I came to the conclusion that nothing was going to happen, and that I was going to go to sleep. I laid in bed for almost 2 hours tossing and turning, and unable to fall asleep. This is another factor that shows me that the pills contain MDMA, but just not enough to get my desired effects.</p><p>I was kinda upset because I realized that I probably wasted my money on a bunch of weak pills. I knew they were real because I was rolling very nicely from 2 of the same pills a few days prior, and I was getting some onset effects from the 1 pill, but how am I going to give them to my friends for the price I paid for them if I know they will need 2 to get the desired effects? Looks like I got screwed on this one. I feel incredibly ignorant for buying 20 pills withoug even considering that it took 2 pills the first time to get the effects I wanted.</p>",
 "year": "2003",
 "id": "24592",
 "gender": "Male",
 "timestamp": "2007-01-06T08:00:00.000Z",
 "views": "4972",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:30",
   "amount": "1 tablet",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(ground / crushed)"
  }
 ]
}
