{
 "title": "Remember in the Morning, That I Should Do",
 "author": "Anohate",
 "citation": " Anohate. \"Remember in the Morning, That I Should Do: experience with LSD  &  Cannabis (ID 24593)\". Erowid.org. Jan 23, 2007. erowid.org/exp/24593",
 "substance": "LSD  &  Cannabis",
 "bodyweight": "110 kg",
 "report": "<p>I shall relate in as much detail as I can remember the thoughts, feelings, events and hallucinations that made up a recent LSD adventure.</p><p>The night began with the taking of the little piece of paper. For the day and night before hand I had been feeling what I could only describe as cravings, I hadn't done acid for quite awhile and had never felt this kind of feeling before, except now the possibility of taking it again was about to be realised. The craving was for the tingling sensation that you get when the drug begins to work its wily ways. This is when you know you have taken something more interesting than a run of the mill brain solvent.</p><p>An early adventure included a walk to the service station. It was only to gain emergency supplies but several concepts were thought up that proved useful for the rest of the evening. Such as the concept of practical n, that is when talking about something occuring for all numbers, you normally say 'for any n'. Well we had 'for any practical n' meaning something would occur for any number that was practical in context. Various logical dilemmas were discovered but brushed under the rug.</p><p>Things started slowly as we waited for the drug to take effect. We watched TV, we laughed alot as the drug took hold. Once we started to feel the effects we decided to go for a walk. We eventually lay on a golf course, staring up at the stars. Space seemed so much more viable, it wasn't just a painting stuck in the sky. At this point we made the commitment to take another tab each. More than one tab was uncharted waters for me, so the new adventure did seem quite alluring. A noted piece of humour came from trying to walk like zombies back to the house, that is by dragging one foot behind you. The natural progression was to prove that ambidexterous zombies are real zombies too, that is by being able to drag either leg behind you on command.</p><p>After taking the second tab each, one fellow addled person and I decided to go for a long walk. This walk encompassed much distance. We found underneath a bridge a strangely lit area with strange spiked leaved plants. The light was blue and red where all the other lights in the area where white. Our walk took us to the thriving lights and sounds of the city. We made our way up and back through the heart of the meat market district, the concerns of rampant procreation seemed so irrelevant from our lofty vantage point.</p><p>Lollypop in mouth and with my bare-footed companion, we floated past so many whos aims in life seemed so trivial. Females with vomit dripping out of their mouths, buff fuckwits posing underneath balconies and the worse of all, strutting sluts. The strutting slut of which I speak, was making her way down the road robed in a short skirt and scanty uppertop, strutting along to a song coming from a nearby car. This was fashion show style exaggeration. It wasn't just our perceptions being fucked with, this was actually happening. Our journey ended with my companion getting a slightly wounded foot and him and I slowly making our way back home, several hours after we had left.</p><p>A sidenote on the walk, I was feeling unbelievably good. The state of mind that I was in felt 'perfect', as if it always should be that way.</p><p>On arrival home, we decided to take the last tab we had left. Between three of us this meant a third each. Two and a third tabs were buzzing through our systems, we were thinking the first one might be wearing off but once we sat down, turned on music and decided to partake in a contest of wills to see who could smoke the most bucket bongs, the world flipped.</p><p>I like to think of taking a tab as 'flirting with the psychadelic goddess', but the more you flirt the more she responds until eventually she becomes a high-maintenance girlfriend that just wont let go. This is what the trip became like. The brain candy was unbelievable, but the pace and frequency of the doses were incessant. I shall now give various snippets of some of the things I was percieving.</p><p>As reality slipped away, I began to have concerns about not coming back. I could see myself waking up in a mental hopsital or something. The mental image of me sitting on a bed in some white austere room somewhere then suddenly shrank and duplicated itself in a spiral pattern slowly getting smaller as the images spiralled 'into' my vision. This is with my eyes closed. These images then became black and white with flashes of bright primary colours in place of the white at different times. Most of what was going on behind closed eyes is too hard too describe properly, but it involved alot of bright colours and geometric patterns. Some more examples include certain patterns or images have a particular kind of texture, say furry, then slowly warping into a hard, shiny version of the same thing. A recurring theme was also travelling through mental tunnels that consisted off strangely shaped or patterned supports. Things like pink, indian temple style architecture adorning the sides of an endless tunnel.</p><p>Opened eyes also saw things. Looking down a corridor I saw an open closet door and just past it another open closet door, except it looked exactly like the mirror image of it. So for a long period of time I was convinced the corridor ended in a mirror. In the same corridor at one juncture in time, I began to feel a very deep sense of forboding and the walls and doorways all began to transform into thin, crackly-hard demons that lay in wait to leap out at me. I needed to travel through the area. The walls throbbed and swayed and slowly constricted around me, the doorways becoming rounded and small, the walls closing in on all sides. The only slightly sobering tool we had was turning on the light, but even doing this wasn't always enough to keep the psychadelic goddess at bay, for even a brief moment.</p><p>The bookcase was melting. The blue paper mache penguin with interal christmas lights that flicked on and off in various patterns was creating an interesting ambience in the darkened room which let the brain play visual tricks. The bookcase started to convulse and pinch as if being smeared and being made of rubber. A particular shelf of books kept melting. The books all dripped into each other but then become whole again in an endless loop. Later on, this same bookcase became a large metal square creature, with the highlights that made the body stand out being particualy light shaded books in the bookcase. Hard to explain, and this was way after the rest of the things Im about to relate.</p><p>Another memory is of standing infront of a paper mache Virgin Mary, adorned with hazard symbols and a gas mask. Standing there, my vision became simply a huge 'scape' of glittering multi-coloured fractal patterns made out of diamonds.</p><p>After a long time, things eventually gained some normality, but it was a long time into the next day before I could truely feel 'free' from the goddess' grasp. Even in the curse of daylight, the ground was convulsing as if affected by an earthquake. It was good to know that I was half-sane and not in a psychiatric ward somewhere ;)</p><p>I leave out much, but only so much makes any sense without context. The title comes from the one thing I can remember telling myself in the middle of reality loss.</p>",
 "year": "2003",
 "id": "24593",
 "gender": "Male",
 "timestamp": "2007-01-23T08:00:00.000Z",
 "views": "3403",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "0.3333 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
