{
 "title": "Climbing the Drugs Ladder",
 "author": "n00bian",
 "citation": " n00bian. \"Climbing the Drugs Ladder: experience with Heroin & Buprenorphine (ID 24623)\". Erowid.org. May 11, 2006. erowid.org/exp/24623",
 "substance": "Heroin & Buprenorphine",
 "bodyweight": "140 lb",
 "report": "<p>This isnt so much an account of an individual experience rather a short story about how drugs have affected my life.</p><p>I am a 25 year old male who grew & lives in the suburbs of London, England. I grew up within a stable family life in a quite well-off area, the perfect 2.4 children family. I smoked my first spliff (reefer) at 15 years of age & graduated up through my teens trying all the mainstream drugs in the following order: Alcohol, Cannabis, Speed, LSD, Ecstasy, Cocaine, Ketamine, Crack & finally the big H, yes heroin! I had already discovered that I leaned towards the depressant drugs (except alcohol) & when I first  Chased the Dragon (I have never injected & I never intend to) I had reached the pinnacle of pleasure. I have always loved cannabis & when I took the two together I would drift for hours, the feeling is virtually indescribable but the saying wrapped up in cotton wool sums it up. Any pain I have, be it  physical or mental just disappears, time doesnt seem to exist & every so often I would realise just how detached from the real world I would be.</p><p>The first relationship with heroin was very pleasurable (apart from the nausea) & as I was getting it through an unreliable source, I would go quite a few days without & hence I never became addicted. My source was a work colleague who happened to be the boss's son. I finally left that job & never stayed in contact with him.</p><p>The second time I used heroin was to drown the mental pain of losing a girlfriend I loved (in other words she dumped me). I would use it in the morning, during the day at work & long into the early hours. Needless to say, I lost my job because I was so wasted that I couldnt even write properly. I got in debt, lost loads of weight (I was skinny to begin with) & after 7 months of hell I finally went through detox with a case worker & 2 weeks worth of drugs to counter the withdrawal symptoms but not enough Valium, I can never have enough Valium. I finally got myself together but only after a stint in a psychiatric ward because after withdrawal depression & boredom sets in.</p><p>It is now 2 years after I went through withdrawal and I am now on another detox programme. The worrying thing is I had no reason to use again but without a shadow of a doubt I know I cannot handle heroin. The drug I am using to come off this time is Subutex (Buprenorphine) & I must admit it is quite remarkable apart from the first day I took it. It puts me into withdrawal as the Subutex takes over the opiate receptor & gets rid of any other opiate already attached to it. The next day I felt totally fine, no cravings & no sickness. I take 8mg a day but can easily get by on 4mg, especially as when it is used as a painkiller at only 0.4mg. I dont get any real buzz  from taking it but then I am opiate dependant. It isnt absorbed into the bloodstream very well so I have to let the tablets dissolve under your tongue which takes about 15 minutes. Of course I have crushed them up & used them intranasally which gives me a mild euphoric high a bit like a small dose of a benzo.</p><p>I have an addictive personality. Moderation & variety is the key I will try and live by those words for the rest of my life.</p><p>Peace to you all.</p>",
 "year": "2003",
 "id": "24623",
 "gender": "Male",
 "timestamp": "2006-05-11T07:00:00.000Z",
 "views": "17386",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Heroin"
  },
  {
   "time": "0",
   "amount": "",
   "administration": " ",
   "substance": ""
  }
 ]
}
