{
 "id": 2463,
 "title": "You Really Think You Have Willpower?",
 "date": {
  "submission": "2002-10-17T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Moonraker",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "(The coke I describe in this experience was around 96%-99% pure, I know from a melting point test--I say this because 'cut' coke is a lot weaker)",
  "The first time I tried coke, being just a pothead, I did one small line since I was so scared.  I felt a pleasant sense of elation, more positive in mood than a triple espresso but a similar level of stimulation.  Mostly I was surprised how mild it was--WRONG.",
  "So then a few days later I did a couple big lines and the experience was totally different.  Very strong euphoria and kind of a rolling feeling in the middle, back and sides of my brain.  My heartbeat picks up and I do become stronger and faster.  Conversation becomes extremely easy and it feels like I can anticipate what others will say before they find the words.  It pretty much makes me feel like a master of tactics, like a champ.",
  "But even on two lines, the comedown sucked bad.  Conversation becomes more difficult.  I feel a little 'empty' mentally and my dreams get a little more crazy and intense.  I think this is due to the dropoff of neurotransmitters after the flood that the initial dose causes.",
  "Soon two lines became 3 at a time, even 4.  One night I did 16, possibly 20 lines (2-4 at a time) and had a great time but it really fucked me up.  I began to love the ritual of chopping up the coke with the blade too.  Not good...",
  "Coming off of those 16 lines was pretty much hell to me (I haven't tried hallucinogens so maybe not a true hell experience, but for me it was).  My head felt like it couldn't generate a positive thought and I felt terribly depressed.  Listening to music I liked and thinking about my girlfriend didn't help at all either.  What was once ease of conversation turns into slurring worse than I've ever experienced while drinking even vast quantities (~20-24 drinks) of alcohol, and I felt very unbalanced. ",
  "I drank a shitload of water, pissed as much, and waited it out.  I felt decent again maybe 16 hours later.  I could do nothing but like in bed, unable to sleep, sweating like a pig.",
  "As bad as the comedown was, I experienced persistent negative effects even after I felt sober again.  Total loss of sex drive.  I lost feeling in my ears, nose, lips, fingers and face for nearly a *week* and had periodic hot/cold flashes and sweats.  Needless to say this is not great while at work.  I didn't feel very awake anymore either when I woke up each morning.",
  "One thing I did to feel much better was to force myself to jog and run to help wake my body up again.  I'd recommend this to anyone who is trying to get by without it after a binge, it was enough to make me feel better.  Smoking weed after the comedown helped the blood go back to my face/limbs, as did eating a good amount of jalapeno peppers (no joke).",
  "I've tried coke once since then, over a year after the 16-line episode, and found it to be too harsh once again.  This drug is simply not worth the comedown and it takes the willpower of a goddamn captured spy resisting interrogation to avoid becoming addicted.  I have the strongest will of anyone I know and I had major problems fighting the cravings.",
  "There is also nothing that destroys my sense of judgement more than cocaine.  Alcohol might distort judgement, but coke completely shreds it.   So whatever coke I have on hand, I'll end up doing it all, once I'm too high to know better...so I never buy more than I intend to do that night.  ",
  "So don't ride the white train y'all...I flirted with addiction and feel damn lucky to have escaped..."
 ],
 "erowid": {
  "id": "18230",
  "citation": " Moonraker. \"You Really Think You Have Willpower?: experience with Cocaine (ID 18230)\". Erowid.org. Oct 17, 2002. erowid.org/exp/18230",
  "substance": "Cocaine",
  "views": "31479"
 }
}
