{
 "title": "Touching the Sky with my Mind",
 "author": "Glow",
 "citation": " Glow. \"Touching the Sky with my Mind: experience with LSD (ID 2468)\". Erowid.org. Feb 3, 2001. erowid.org/exp/2468",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "report": [
  "<p>my friend G and i each took a hit of acid at my girlfriend's house and then after about 3 hours we left and drove 50 minutes back to my house...nothing.  we felt nothing.  5 hours later.  nothing.  duds, we were mad.",
  "so G left and went home and at about midnight, my world exploded like an atom bomb.  i have tripped once before this, and i didn't understand what was happening, but i knew it was so good, it was SOOO good... ",
  ":::conscience:::",
  "i just grooved with it.  my head opened up and i thought every thought and dreamed every dream that anyone had ever (and will ever) think or dream.  my entire being overflowed with life and thought and dreams and hope and...",
  ":::awareness:::",
  "i laid down on my floor and put on my studio headphones (AMAZING sound quality) and turned on some Hallucinogen (for anyone reading this, Hallucinogen is a british psytrance artist.  his album 'twisted' changed my world, and i recommend you buy it N OW).  so i just succumbed to these booming trance beats and guttural grinding noises and i let myself float to the outer reaches of my own mind.  i traveled untrodden trails of my own brain and discovered avenues of life in my head that i never knew were there.",
  ":::pulsating:::",
  "then i took these gloves i have for raving that have glowing LED lights for fingertips and i went into my bathroom with a discman playing 'trance stimuli' and i just left my body.  i went through the entire album dancing in my bathroom thinking these explosive thoughts and discovering new life in an album i heard so many times.  and my gloves...my gloves blew my mind.  when the last track finished i was dripping with sweat down my entire body, but i wasn't tired.",
  "3:15am",
  ":::serene:::",
  "i laid on my front lawn and smoked cigarettes and just re-examined my ENTIRE being.  i thought about every aspect of my existence inside and out and i came to a conclusion after 2 hours of constant thought.",
  "everything is all right....",
  ":::peacefulness:::",
  "i eventually slept and called G immediately when i woke up to tell him what i had experienced.  'say no more my friend,' he replied, 'i was right there with you.'",
  "and he was.... we never told each other about our trips because i knew and he knew there was no need.  we had a telepathic connection i never thought possible...he KNEW, and i KNEW.",
  ":::inexplicable:::",
  "but WONDERFUL.</p>"
 ],
 "year": "2000",
 "id": "2468",
 "gender": "Male",
 "views": "7265",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD"
  }
 ],
 "submissionDate": "2001-02-03T08:00:00.000Z"
}
