{
 "id": 247,
 "title": "Girlfriend's First Voyage to the Antipodes",
 "date": {
  "submission": "2006-03-23T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jerry",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "4:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "11:00",
   "amount": "6 ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "Set: mentally relaxed, having abstained from LSD and other psychedelic use for several months following a period of sustained heavy use. In a period of slight uneasiness trying to figure out career goals and options. Mentally tossing around the idea of pursuing a minor in religious studies at school to supplement my psychology degree.",
  "Setting: my apartment, the surrounding area. This is in a small city in upstate New York famous for two of its colleges. The immediate neighborhood is zoned as heavy commercial (grocery store, auto shop, etc.) but it is within 5 minutes of woods, 20 of a waterfall.",
  "T + 0: Having obtained some 'pink pyramids' which turned out to be good blotters, I ingest my first along with my girlfriend and roommate. This is my girlfriend's (called A for the sake of this story) first trip. My roommate (call him N) has tripped twice before, both with me after hearing about some of my experiences with psychedelics. So, I end up being the 'wise old man' when it comes to drug/psychology questions. This role is partially flattering and partially uncomfortable.",
  "T + 1hr.: We begin by telling light hearted stories, listening to music, making jokes, and smoking a prodigious amount of good outdoors cannabis. This particular strain is very smooth and good tasting, and we end up consuming a LOT over the course of the evening.",
  "T + 2.5hr: The peak of the first hit occurs around 6:30pm or so. We decide to go on a walk at this point after smoking a couple more bowls. Walking along the street we all comment on the sensation of being dissociated from our legs as we walk... we seemingly glide across the pavement on a back road towards the waterfalls.",
  "T + 3hr: We spend some time at the base of a large waterfall. This is part of a state park, which is closed since it is after dark. At one point we hear voices and see figures across the water on the other side, coming down a trail. Assuming them to be park rangers we try to blend into the darkness. Eventually, the figures get into a car and leave. We leave soon thereafter and walk back to the apartment.",
  "T + 4hr: Upon return we smoke several bong loads. Me and N take another hit each, A takes a half. We become engaged in a rather abstract and freewheeling conversation about a variety of topics.",
  "T + 5hr: During the course of this extended conversation my first visual disturbances appear. These consist of faces in the carpet, fluid movement in the wood grain of our walls, and some minor halo or aura effects. My visuals never become very pronounced during the trip despite the heroic amount of marijuana smoking we did.",
  "T + 6.5hr: We decide to put in a movie, and I ask A to select one that she wants to see. She decides on the anime Akira, which I had recommended to her another time. We watch it, completely blown away by the storyline and visual effects, which seem perfectly suited for an acid trip.",
  "T + 10hr.: We decide to go on another walk to smoke a joint on a bridge near our apartment. The walk is much colder than the last as the night has become quite chilly. We come to the bridge, only to find a new fence around it. This especially upsets N, who gets very scared and wants to leave. We do end up going to a park nearby to smoke.",
  "T + 11hr.: Back at the apartment I set into drinking a six pack of Sam Adams Ocktoberfest. N has some Molsons and A abstains. I tell her drinking a little might help with possible insomnia, but she has no problem with that... she drifts off to sleep as we watch Cartoon Network.",
  "T + 13hr.: It is the early hours of the next morning, sometime around 6am or so when I finally carry A up to bed and we pass out. Sleep comes quickly, but is accompanied by an odd dream where I am a street hot dog vendor who is serving little people in my buns rather than hot dogs. I wake up after sleeping almost 11 hours and feel extremely refreshed.",
  "In the aftermath of this experience we spent the rest of the weekend in quiet contemplation, cleaning and studying for school. We decided to lay off marijuana for a few days because the smoking gave us all sore throats. All of us feel very much refreshed and renewed by the experience.",
  "Some themes that came up during the trip for me were the paralells between Akira and the current U.S. military situation (deals with weapons of mass destruction, armed revolt, etc.), my ever growing love and dependence on A, my future career as a psychologist and the place of religion within that, and a contemplation of the multi-layered reality of existence. We coined a new phrase to explain away inconsistencies: 'It's all layers.' This, I think, gives me a sense of satisfaction in that I don't have to attempt to fit everything in my mind into one united scheme, it all operates on different layers for different times..."
 ],
 "erowid": {
  "id": "10318",
  "citation": " Jerry. \"Girlfriend's First Voyage to the Antipodes: experience with LSD (ID 10318)\". Erowid.org. Mar 23, 2006. erowid.org/exp/10318",
  "substance": "LSD",
  "views": "4660"
 }
}
