{
 "title": "Amazingly Happy yet Multifacted Experience",
 "author": "Quark",
 "citation": " Quark. \"Amazingly Happy yet Multifacted Experience: experience with Paroxetine (Paxil), Cannabis & Opium (ID 24701)\". Erowid.org. Apr 7, 2006. erowid.org/exp/24701",
 "substance": "Paroxetine (Paxil), Cannabis & Opium",
 "bodyweight": "190 lb",
 "report": "<p>Before I start my description of the experience let me tell you some background of myself.  I have been taking the antidepressant Paxil for about six months and started smoking weed about four months ago, and I have a trait about myself which makes me very susceptible to addiction. Okay, now on to my experience!</p><p>I had worked out some plans with my friends N, G, and B to all get together at B's place and get stoned.  We got to B's at about 1 am and started smoking weed. We finished off a bowl out of his water bong and proceeded to roll a joint. After the joint was enjoyed, we just all sat around listening to music and giggling about crazy shit.  I've only been smoking for like four months and the other guys had been smoking for years so i'm guessing I was a lot more stoned than they were that night. After talking for about a half hour B busted out this baggy with a 1' diameter black chunk in the bottem and told me to smell it and that it wasn't what I expected it to be.  I initially thought it was a big reefer resin ball when he first showed it to me, but one smell of it completely blew me away. It was the most beautifully smelling substance I had ever encountered (plus I was really baked at the time so it just smelled even better!). After B told me that it was opium, I was a bit apprehensive to try it because of its addictive potential, but assured me that one Opium experience wouldn't be enough to get me hooked even with my addictive trait.</p><p>So B rolled up a couple little balls of O and put them in his bowl.  The opium just smelled better when it was smoked and I was really excited for the bowl to reach me. Finally I got the bowl and I took an average sized hit. It tasted WONDERFUL, almost like a sweet flower from India. After a while, the bowl came back around to me and I took a second average sized hit. </p><p>After about 5-10 minutes I started to feel a little strange. I could tell that this was a much different feeling than the disconnected high of cannabis. I concentrated on the feeling and the entire of history of opium began to become amazingly clear to me even though I knew nothing of it previous to my current experience. It became very clear that this substance had been around for a very long time and that it was enjoyed all throughout history by some of the world's greatest thinkers and philosophers.  As time went on (even though it felt like there was no such thing as time) I began to form a mental image of myself sitting in the comforts of an opium den in India, smoking opium out of a hooka. Then a very strange feeling came across me. It was a very familiar feeling, almost like I had been doing opium all my life even though this was my first time. </p><p>After more time went by, the experience started to turn around and I started to get confused and paranoid.  For what seemed like an incredibly long amount of time, I was under the impression that instead of 2003 we were in the 60's sitting in N's basement and I was afraid of his mom coming down and catching us high. I started to get really scared so I started thinking really logically and I remembered that it was 2003 and we were in B's apartment, not N's basement!</p><p>When that whole experience was over, a feeling of incredible serenity and euphoria swept over me.  I could move, but it felt like it required a lot of effort, so I just sat still. Talking was the same way. Everytime I wanted to say something, I had to really concentrate unless nothing would come out at all. Driving home that night was a really scary experience, but I made it home just fine. The next day was hell though. I had only gotten a couple hours of sleep and I had to work in the morning so I felt like hell.  Also, one very frightening aspect about the next day was that I was craving the taste and smell of opium all day.  However, I was aware of the potential addiction problems that it would create if I used it in the future so I promised myself to never do it again and to just stick to ganja from now on.</p><p>Overall I'd say that it was a good experience. But only for experimentation!</p>",
 "year": "2003",
 "id": "24701",
 "gender": "Male",
 "timestamp": "2006-04-07T07:00:00.000Z",
 "views": "12010",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "",
   "amount": "",
   "administration": "2 hits",
   "substance": "smoked"
  },
  {
   "time": "Cannabis",
   "amount": "",
   "administration": "",
   "substance": "2 hits"
  }
 ]
}
