{
 "title": "A Fun but Short-Lived Ride",
 "author": "Daikon Dan",
 "citation": " Daikon Dan. \"A Fun but Short-Lived Ride: experience with Betel Nut (ID 2471)\". Erowid.org. Jul 16, 2000. erowid.org/exp/2471",
 "substance": "Betel Nut",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3 ",
   "oral",
   "Betel Nut",
   "(fresh)"
  ]
 ],
 "report": "<p>\nAfter arriving here in Guam and hearing about 'Pugua' as it's called here, I couldn't wait to try it. After I chose a place to live and began to explore the surroundings I found several Betel Nut trees just a few minutes from my front door. A quick check in the shrubs at the base of the trees revealed several golden nuts the size of small eggs.</p><p>I didn't know how to chew them or how much to use so my first experiences were not very fruitful. After learning a bit more about Pugua from the locals and having a handful of Pupulo (piper sp.) leaves given to me I decided to have another go at it. I chopped a few nuts in quarters with a machette and wrapped the bits in the leaves and began to chew them. The Guamanians usually don't use the lime, I opted to chew the nut and leaf only sans lime and tobacco. This style is more of a chewing like gum than a sucking as on hard candy. The mixture becomes a poltice and is swallowed bit by bit along with a beverage of your choice (mine was a dark Beck's beer) in less than 10 minutes my arms and legs felt a tingle and I felt very lightheaded.</p><p>Colors seemed a bit brighter and my vision was slightly off, I can best describe it as looking at life like it was a movie you watch on the internet not quite fluid a bit choppy, like a strobe light effect minus the light. Are you following me? I continued to chew more nuts and experienced several peaks on this trip. All in all very pleasing and relaxing. I was as the song goes 'Comfortably Numb'. I would give just one word of caution, don't chew betel nut while driving, I did this last weekend and it was a bit frightening. It's a fun way to spend an evening at home with friends or by yourself.</p><p>This morning I went back to 'my trees' and collected 122 nuts! Many more nights of 'Pugua rides' to come!</p>",
 "year": "",
 "id": "2471",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-07-16T07:00:00.000Z",
 "views": "52835"
}
