{
 "title": "Good Things Come To The Curious",
 "author": "Dr. Gonzo",
 "citation": " Dr. Gonzo. \"Good Things Come To The Curious: experience with Cannabis & Olanzapine (ID 24724)\". Erowid.org. Jun 23, 2003. erowid.org/exp/24724",
 "substance": "Cannabis & Olanzapine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "insufflated",
   "Pharms - Olanzapine",
   "(ground / crushed)",
   "",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>I suppose it was just plain curiousity that led to this strange combination of drugs.  That and boredom with my usual lineup of drugs (weed, ecstasy, coke, speed, LSD, and shrooms - not all at once of course!).  I was visiting a friend who was a little dry in the cash department and desperate for some weed.  He offered me 5 Zyprexa tablets (10 mg each) if I'd front him a 20 bag until he got paid later in the week.  I figured what the hell since he was a good buddy of mine and I knew he'd pay me anyway.  I wasn't even planning on taking the pills myself.  I had another friend who was a pharmie junkie and I was sure he'd be interested.</p><p>But curiousity got the best of me.  I smoked a joint with my buddy, then  suggested we snort the Zyprexa just for fun to see what it did.  He had never taken it before - he has a brother who has manic depression and the doctor put him on different meds so the Zyprexa was 'leftovers'.  Anyway we each snorted one pill then smoked another joint.  It wasn't long before I started feeling different.  I looked over at my buddy and he was trying to get up off the couch and having a lot of difficulty.  This was amusing to me, as well as him.  I felt really good, but also really stoned like I had just smoked a LOT of weed.  I also noticed that simple things like walking and talking were a lot harder to do.  Kinda like being really drunk, but not having that 'stupid drunk' frame of mind.  It lasted for a good 3-4 hours, then wore off gradually. I didn't notice any usual side effects except I felt sleepy and had cotton mouth which is normal when smoking weed but a little more intense this time.</p><p>I'd have to say that Zyprexa isn't something for the hard core drug users or someone looking for a psychedelic experience such as those with acid or shrooms.  It adds a nice high when smoking weed, and I'll probably do it again.</p>",
 "year": "2003",
 "id": "24724",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-23T07:00:00.000Z",
 "views": "26668",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Pharms - Olanzapine",
   "form": "(ground / crushed)"
  }
 ]
}
