{
 "id": 2478,
 "title": "The Worst Thing of All Time",
 "date": {
  "submission": "2002-10-18T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pat",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "My girlfriend had just went up to New York to visit her family for Christmas, and she left me three 20mg Paxil to help me sleep that night.  I honestly didn't give a crap about overdoing it, because I am extremely resistant to random substances on a whole (how many beginner drinkers do YOU know that can down 14 shots of vodka and not really feel all that much, let alone any unpleasant side effects generally associated with the king of trash drugs (and that's just the tip of the iceberg)?), so I said to myself 'Damn Pat, you can handle it.  Sure, you did take 20mg before and got a slight case of the runs, but what the hell, just do it.'",
  "9PM rolls around, and I take all three.",
  "Biggest fucking mistake of my whole God damned life.",
  "After being abruptly snapped out of a deep sleep, I suddenly realize I've never felt this sick in my whole life.  I've shit all in my boxers, and I rush to the bathroom in a manner akin to Peter Jones rushing an all you can eat butter festival.  I'm on the toilet, and I suddenly start erupting like Mt.Vesuvius.  When I say I've never had diarrhea like this ever, I mean it!  After a brief period of the most violent bout of the shits of all time, I come to the conclusion that I'm going to spray vomit everywhere, so I change positions and start vomiting everything up I've eaten in the past eighteen years or so.  When I tell you this went on for about a minute straight, I'm not stretching the truth by any means. ",
  "Then I'm back on the toilet spraying brown water out of my anus for about a minute, then I'm back to throwing up, but now I can't breathe because I'm choking.  It was even worse this time because I was dry heaving mostly, and I really just could not BREATHE. My mom and I think my brother come to check all this out, and then the next thing I know I'm standing in the shower, in an almost detached state, soiled by feces and bile, in a freezing cold sweat, shaking. ",
  "I manage my way back to bed somehow, and when I woke up the next morning I had shit myself again.  For the next three days I felt the terrible Paxil 'buzz' (for me the Paxil buzz is random uncomfortable chills running throughout your body at random times), and then finally, sweet relief from the grasp of that terrible drug.",
  "So, what did I learn from this whole experience?",
  "Well, not to ever take Paxil again.",
  "That's pretty much it."
 ],
 "erowid": {
  "id": "18266",
  "citation": " Pat. \"The Worst Thing of All Time: experience with Paroxetine (ID 18266)\". Erowid.org. Oct 18, 2002. erowid.org/exp/18266",
  "substance": "Paroxetine",
  "views": "16452"
 }
}
