{
 "id": 2482,
 "title": "Unexplained Reality",
 "date": {
  "submission": "2002-10-18T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "David",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "2 drops",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ],
 "report": [
  "It took me 6 months to discover the acid since the first time I took it. The first times were all meaningless compared to what happened that strange night. The setting for the trip began about a week before it happened. I had a break from work and decided to visit Amsterdam. I was traveling by myself and since the moment I got there I kept counting the days backward to April 30th (queensday). The day that I would take the acid at the party. Unfortunately, a week wasnt enough time for me to find some good acid, and I got to the party empty handed.  I was unhappy with that situation. I waited a long time for this day and was sure that by now I would have had the acid already. Like I said, my first blotters were all weak and I was sure that in Amsterdam the day would come. I was in a bad mood and didnt feel like asking people at the party if they got some. Instead, I swallowed 3 extacys and was hoping for the best. A few hours later, it happened.",
  "It seemed like things were just fine. I had a great time at the party and the whole acid story didnt bother me. I kept thinking about all the good times I had during my week in Amsterdam and all the people seemed nice and friendly. Suddenly, things began to slow down. Slower and slower till my vision came to a complete stand still. I heard a blast inside my head and for a short time I couldnt see a thing. When my vision came back it was still frozen, but a lot worse: it looked as if it was being shaken.",
  "That was a strange sight. I remember thinking that if my mind is like a peaceful puddle, someone just threw a rock in there and completely blurred it. After a minute or so things were going back to normal. I tried to understand what the hell just happened, cause even 3 exs couldnt make this shit happen. I couldnt figure it out. A guy who was standing in front of me distracted me. He raised his arms to the air while shouting: I cant believe it! It was me! What a classic! Clearly this guy was on way too much drugs. Normally this wouldnt bother me, but it did. I kept staring at him. I had a feeling that he was some how related to my loss of vision experience. Bits of information came back to me one after another, building back my memory. Now I remember. Now I know what happened. And its pretty bad.",
  "Earlier that night I was in a pretty bad shape cause of the pills. I did some things that I wouldnt normally do, but I couldnt help it, and only after they happened I remembered doing them. It was like having a delay between the reality and my mind, and this was one of those things:",
  "The crazy guy and his friend were giving away MDMA and LSD for the people at the party (back then he wasnt crazy). He came to me and asked me gently: Excuse me, would you like, some, L S D?  I said yes and took a sip from his bottle.",
  "When it came to me that this is what happened I was scared to death. I took too much. And not only that, the guy who gave me the LSD was flipping out, and Im probably next I decided that the best thing to do was to walk away. I turned my head and then I found my self in a new place.",
  "It was dark. I couldnt see or hear a thing. Every once in a while I saw a star shining from a distance, and then disappear. I didnt move, and it felt like Ive been there for hours. I saw a person in front of me. I tried to look at him but I couldnt focus. He was moving, and when I tried to understand what he was doing he was actually standing still. So I tried to look at him and he was moving again I understood that it was completely useless and gave up on him.",
  "What is this place? I asked myself.",
  "That, my friend, is LSD the person answered.",
  "I couldnt understand the meaning of the word. It didnt sound familiar.",
  "LSD? What is LSD?",
  "I just couldnt understand. Was it a name of a place? Was it a feeling? Is LSD alive? I didnt know where to start looking for the answer. The word was completely meaningless. I knew that the whole situation was wrong, that I had to get out of there, but I didnt know how. Every time that word came up all I saw was something that resembles a trail of a comet.",
  "What is it?!  I asked again, desperately.  And then the blurred person answered: Its all the things combined. A trip.",
  "Less then a second after it happened I found my self back at the party. I could remember everything that just happened and was in complete shock. I just had a classic trip! I was walking in space and talking to god. It was simply unbelievable. I wasnt afraid anymore, I was happy. So happy that I completely forgot about my condition. At that point I decided that I want to take home with me some blotters so I can repeat that experience. I found the guy with the acid and asked him if he has some. He said yes. While I was busy trying to take some money out of my pocket, I failed to see that he misunderstood me. He took out a small bottle and laid a drop on my right hand. I froze.",
  "You dont have any paper? I asked.",
  "No. Thats all I got left and Im just spreading it around.",
  "That wasnt what I needed. I had enough chemicals running around in me without taking a second dose of acid, but I took it anyway. It was bitter. It felt like a thousand little hairs on my tongue and I knew that its gonna cost me big time. I came back to the party and analyzed my position:",
  "It seems that somehow I got into something that was way over my league, but I was able to escape from it. I found my way back to the real world and whats the first thing I do? I choose to take another drop!",
  "Thats bad. The first one didnt even wear off. When the second one will hit me, its gonna get ugly. I know it.",
  "Nothing more to do then wait and try to prepare myself for what is about to happen.",
  "It wasnt long before my vision started slowing down again. This time I knew what would happen but I couldnt stop it. I heard another blast inside my head and once again things froze in place. I felt electricity all over my body and in my head. When I woke up I couldnt remember a thing. I didnt know my name, where I was or what I was doing there. I had just a bit of common sense left, and I said to myself that if there is one thing that is need to be done, it is to prove to myself that I am not crazy and say my name. No name. No nothing. I didnt know anything.",
  "Listen to me, I said (to myself). You can do whatever the hell you want, but as long as you dont tell me what is your name, you should know that you are fucked up cause of the acid. Probably for good.",
  "Wait, dont panic I answered. Just give me a few seconds to add things up and Ill show you that Im not crazy.",
  "I took a deep breath and looked around. I could see that I am in a party, and I could remember my name. I was quite relieved that once again I found my way back to reality, but I wasnt aware that since that moment, I was living in a distorted reality. I convinced myself that my home was in Amsterdam, and that the people at the party are my friends. None of the above was true, but there was no way that I could have figured it out. It was like a dream. I could feel that things around me were weird in a certain way, but I was not aware of the fact that I was dreaming (or tripping) and I just accepted all the weird stuff that happened.",
  "I was enjoying my private world, with my private reality that I made up. I had no worries because there was nothing to worry about. Nothing was wrong.  All the problems seemed to have gone away and instead I got waves of positive energy. I talked to people as if I knew them for ages. I actually remembered things that never happened, but I believed they did. It could have lasted forever, but at a certain point I had to go out and vomit. After I went it was clear that it was time to go home. I started looking for my car, and couldnt find it. I was afraid that it was stolen. I didnt know what to do. How am I going to get home?",
  "And then it hit me.",
  "There is no car. There are no friends who will take care of me. I am all alone in a foreign country.",
  "This isnt my home.",
  "It was like everything that happened so far was compressed into one second of harsh reality.",
  "I suddenly realized what was happening the entire evening, all at once.",
  "This was just too much. I was now aware of the fact that I cant tell the difference between what is real and what is not. It was like waking up from a dream only I wasnt sleeping. How could it happen? I spent some time out at the fresh air, without psychedelic music thumping in my head. I felt like the trip was crawling out of me and was going back to where it came from. Its funny, I spent 6 months of my life trying to reveal what is behind the LSD, and the moment I gave up on it I got caught off guard, twice I guess that no matter how hard you can look for it, eventually it will find you.",
  "Looking back at that night I can see why the trip was developing the way it did. When you put something in the oven you know that when it will come out, it will taste like its ingredients. Eating acid is a way of finding out what your ingredients are. What you experience in a trip is for you alone. It cannot be shared. There are a few things that can be shared, like what you have just read. But keep in mind that it is only the tip of the iceberg and that it goes a lot deeper then a couple of written pages. The main thing I learned is that acid is something I have to deal with after taking it, rather then during.",
  " Thats when I have to give explanations about things that just cannot be explained."
 ],
 "erowid": {
  "id": "18278",
  "citation": " David. \"Unexplained Reality: experience with LSD & MDMA (Ecstasy) (ID 18278)\". Erowid.org. Oct 18, 2002. erowid.org/exp/18278",
  "substance": "LSD & MDMA (Ecstasy)",
  "views": "9255"
 }
}
