{
 "title": "Heavy",
 "author": "goofy",
 "citation": " goofy. \"Heavy: experience with 5-MeO-DMT (ID 24870)\". Erowid.org. Jun 29, 2003. erowid.org/exp/24870",
 "substance": "5-MeO-DMT",
 "bodyweight": "95 kg",
 "report": "<p>I have been reading info off the net about this substance for some weeks and I felt reasonably well-informed when some came into my hands today. I was excited and nervous about the experience to come.</p><p>I was alone in my appartment, which was clean if cluttered, and comfortable and I was sure of not getting any disturbances - phone off hook, etc..</p><p>First I tried smoking out of a bit of foil - probably about 2mg. but alot of the smoke escaped before I could suck it up so I figured this method was not so efficient - I might try a vapourizer next time to avoid this problem. Slight feeling that a chemical was in my body and very slight visual effects - colours seemed more vivid, but hardly noticeable really.</p><p>Then I decided to try snorting as this seemed less wasteful. Two small lines, between 5 and 10mg or thereabouts judging from effects. Within 5 minutes my body began to feel very heavy and I had some sensory distortion of my pysical awareness. Tried lying down and closing my eyes but this didn't feel very comfortable so I decided to continue footling around the appartment as i had been so far.</p><p>By the 15min. mark my body still felt very heavy (this was the main theme of the experience) and i had a strange sensitivity in my gums (which made me worry a bit as I had read somewhere about people bleeding from their gums in a similar situation). By the half-hour mark I was sweating quite heavily, body still heavy; visually things seemed a bit vivid and I popped out to take some rubbish from the car - outside a warm wind was blowing which felt great and everything seemed sparkly.</p><p>After that the effects began to wear off, and I was particularly glad to be rid of the heavy body thing which was unpleasant and really detracted from my enjoyment of this experience.</p><p>After the event I feel very indifferent to trying this chemical again. It might be more interesting, especially if I could smoke it successfully, but I'm not overly enthusiastic about the next time.</p><p>Generally I like drugs that make me feel good - physically especially - so this chemical was not so suitable for me I think. Other trip reports I have read psychically over-rate the experience I would say, though this may be due to the low level of my dose. I wouldn't want to go much higher though. A neutral experience mentally with unpleasant physical effects.</p>",
 "year": "2003",
 "id": "24870",
 "gender": "Male",
 "timestamp": "2003-06-29T07:00:00.000Z",
 "views": "6641",
 "dose": [
  {
   "time": "0",
   "amount": "1.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:05",
   "amount": "8.0 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ]
}
