{
 "title": "Evicting the Entity",
 "author": "Trey",
 "citation": " Trey. \"Evicting the Entity: experience with 4-Acetoxy-DiPT (ID 2488)\". Erowid.org. Jul 17, 2000. erowid.org/exp/2488",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "155 lb",
 "report": "<p>Around four hours or so ago, I felt a very intense impulsive/intuitive push to pull out an ace I've had up my sleeve, so to speak. It's been quite an interesting evening, to say the least...</p><p>I measured out approximately 30 mg and downed it with a small quantity of water, noting that the taste of this stuff sans-gel cap is fairly icky. Worse than the taste itself, tho, is the way it lingers on the palate for 30 minutes or so, regardless of what one may try to rinse out one's mouth. Oh well. Live and learn. I sat down and began to center myself a bit, and within around 30 minutes or so was hit totally broadside by an unexpectedly intense entheogenic state of consciousness that materialized extremely quickly. There was very little transition, if any at all - just 1 minute nothing, then the next, it was all there (gulp!)</p><p>I wasn't entirely sure what my conscious intent had been - as I said earlier, this was a completely intuitive/impulsive endeavor - but it certainly hadn't been this. Oh well. It was where I was, and therefore exactly where I needed to be at that moment in my development, so I surrendered to it. Resistance was obviously futile...I was to be assimilated.</p><p>Even though I had explored this material on several prior occasions at the same dose, this particular experience was of an entirely different order of magnitude as far as intensity, depth, and visionary content were concerned. During the most powerful phase of the trip I often found myself spontaneously lapsing into trance and undergoing visionary episodes of utterly remarkable vividness and clarity, within which highly important information of a deeply personal nature was being conveyed to me. I find Acey to be a very unique material in this regard; it seems to combine phenethylamine and tryptamine like aspects into what has the potential to be a very powerful tool for inner work. It has just enough of that euphoric, sensually delicious tactile-enhancement quality that is common to the PEAs to act as the carrot-on-a-stick to lead the journeyer through the looking glass and down the rabbit hole, so to speak. But once one is really in it, then whammo! The dreamy, trancey, content-rich vision state that is the hallmark of tryptamine materials takes over, and one is suddenly confronted with whatever is bubbling underneath the surface of ones psyche.</p><p>The most intense of these episodes occurred when I noticed a certain hollow, empty feeling begin to unfold within me, and it seemed to be physically located within my chest cavity, directly underneath my left nipple. During the months immediately preceding this journey, I had begun working through a process of dealing with a lack of self-love, and feelings of being unworthy of real love, the root causes of which I am still uncovering, being to some degree occluded from my conscious awareness. This was an occurrence of those inner tendencies rearing their head once more. Spontaneously, I had the intuition to begin doing breathwork, visualizing sending white light energy into that hollow pocket with each breath, filling it with love, affection, and acceptance. Almost immediately, I lapsed into deep trance.</p><p>In my minds eye, I saw that hollow pocket as a whirlpool-like hole within my energetic body, leeching me of strength & vitality. I continued breathing light and love into it, and as I did, the center of the whirlpool seemed to break free of its moorings underneath my left breast and slowly moved to the right, stopping in the center of my body near my solar plexus. The whirlpool then seemed to slow its rotation, and as it did it began to coalesce into something solid: a still rotating, multi-limbed, arachnoid/octopoid creature of some sort. The rotation slowed to a stop, and as it continued to condense, I was overcome with the utterly horrific sensation that there was an actual being that was writhing around spasmodically within the center of my chest cavityand whatever it was, it certainly wasnt friendly!</p><p>I perceived this entity in vivid detail, and it was truly terrifying  an arachnoid monster straight out of the works of H.R. Giger, part flesh and bone, part machine, and completely and totally malevolent in intent. At any moment I expected it to burst out through my breastbone as per John Hurts gruesome fate in the movie Alien. I was struck with a strong sense that whatever the hell this thing was, it was the sort of entity that gets its nourishment from negative energies and emotions in humans such as those I described earlier. I had apparently been a smorgasbord for this thing for quite a while, and due to my recent efforts to begin direct, intensive work on the aforementioned aspects of my character, it was no longer getting its daily ration from me. It was not at all happy about this, to say the least, and was basically throwing a temper tantrum inside my chest.</p><p>Eventually the vision faded and my awareness returned to the external world. There wasnt much of a well-defined sense of transition to this, or of resolution to the experience. It was very much like awakening in the middle of a rather vivid dream  one minute youre one place, and the next thing you know, youre somewhere else entirely. I was, however, left with a rather clear sense that what had been going on was that this entity and I were finally separating; that by embarking upon the inner work that I have referred to previously I was effectively serving it with a long-overdue eviction notice.</p>",
 "year": "2000",
 "id": "2488",
 "gender": "Male",
 "timestamp": "2000-07-17T07:00:00.000Z",
 "views": "32038",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
