{
 "title": "A Beautiful Trip",
 "author": "Vibrant Red",
 "citation": " Vibrant Red. \"A Beautiful Trip: experience with Morning Glory (ID 24898)\". Erowid.org. Jul 1, 2003. erowid.org/exp/24898",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "120 seeds",
  "oral",
  "Morning Glory",
  "(tea)"
 ],
 "report": "<p>I had had a pretty shitty week and was searching for a weekend escape. I had ordered some salvia earlier in the week and it still hadn't come in, so a friend and I had decided to try morning glory seeds for lack of something better to do. Neither of us really expected much of a trip and were prepared to get really sick.</p><p>We began by grinding up about 240 seeds in a pepper grinder and then soaking them in cold water. They soaked for probably a good 4 hours before we strained the solution and then refridgerated it for another hour or so. We split the liquid equally and were relieved to find that it was mostly tasteless. Nevertheless, I chased mine with a coke.</p><p>We were pretty sick for the first hour, not seriously though. My stomach was bothering me a good bit and I thought that I might throw up but it passed rather quickly.</p><p>We went outside in a feild and lit some candles in a clear area. Within the next hour I was completely consumed in the experience. We found that the hot wax that was dripping from the candles felt AMAZING! Everything felt so good! Greens were richer, skin felt wonderful...even my rough feet felt good to the touch. I wanted to touch everything in sight! The best part about the experience is that I was fully aware of what was going. I didn't get stupid like one does when you're stoned. I knew I looked silly but I didn't care. I can remember everything that happened and was fully aware of everything I did.</p><p>Once the sun started coming up we went running. Nothing hurt. I have a severe inflammatory disease and haven't been able to run like that without dying from pain in YEARS! It was the best feeling in the world to be able to do that. Everything felt so profoundly beautiful and I had never been happier to be alive.</p><p>After about 6 hours of being completely absorbed in the beauty around me and feeling up everything in sight I tried to lay down and go to bed. I had a rather difficult time doing so but after a few hours was finally able to. I began to come down a bit and by 6pm the next day I thought I had fully come back out of it. I drove to see another friend of mine and then realized that I was not in fact sobered up yet. I stayed the night with him and was amazed at how ticklish I had become by this point. Sand was torturously soft and sheets were orgasmically wonderful. Eating was rather pleasant as well...even water was fun to drink. :-D</p><p>Though the trip was a good deal longer than I would have liked I would thoroughly recommend it to anyone thinking about it...maybe at a smaller dose or so. It truly is a wonderful thing that makes me look at the world in a different way. It makes me realize things about myself that I had supressed and lets me think rather clearly. Besides, it's just something that everyone should feel once in their lifetime. Nothing will ever seem so beautiful.</p>",
 "year": "2003",
 "id": "24898",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-07-01T07:00:00.000Z",
 "views": "10486",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "120 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(tea)"
  }
 }
}
