{
 "title": "The Taste in my Mouth",
 "author": "Day Tripper",
 "citation": " Day Tripper. \"The Taste in my Mouth: experience with Morning Glory (ID 24894)\". Erowid.org. Apr 12, 2007. erowid.org/exp/24894",
 "substance": "Morning Glory",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "oral",
   "Morning Glory",
   "(seeds)",
   " T+ 1:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I would rate my morning glory experience as just Ok.</p><p>First, I went and purchaced 7 packs of the seed. I could only find one pack of the heavenly blue variety so I also went with pearly gates a flying saucers. First I washed off 5 packs of seeds thinking that 7 may be too much for my first time trying this. I used bottled drinking water and some dish detergent. After rising them thoroughly, I put them in some paper towels and let them dry for later use.</p><p>I have done quite a few hallucingenics including mushrooms and acid. I prepared my  mind to have a good experience with a hopefull self revelations (which I have usually gained from similar experiences in the past)</p><p>Later on in the evening I decided to eat the morning glory seeds. Not having the proper materials to perform the extraction, I just ate them as they were. This was definately the worst part of the process. After eating about  fourty of the seeds, I decided to put them in some food because I could not take the texture and crunch in my mouth anymore (the taste was not bad, actually kind of tasteless). As I chewed the food I made sure to crunch up the seeds as much as possible.</p><p>By the time I was finished doing all of this (about and hour) I was already starting to feel a bit funny. My vision became a bit smokey, as if the had a soft white light in it. I did not get natious or have any stomache or leg pains. The closest I came to a sick feeling was feeling extremely full. If someone would have sat on my stomache, the food and seeds would have come right up. I smoked some of the good stuff and this feeling went away and my trip was brought on.</p><p>In comparison to acid, this trip was very mild. I did not get many visuals, just a few tracers and rainbows off the tv and anything lit up. My mind felt fine. I acutally expected more to happen from reading the experiences of others. It took around two hours for my trip to bring itself on after I ate the seeds at 10 pm. I did not feel like doing anything except for lying on the couch. The seeds made me feel tired even though I was tripping. I stayed up until around 3 am. My tripped did not dull whatsoever durring this time. I went to bed and was able to meditiate and fall right to sleep. I had no dreams that I recollect. When I woke up, I still felt like I was tripping. Not as much as before I went to bed, but  the feeling definately still was there and my vision was hazy till around 3 pm the that evening. I felt a bit warn out but otherwise just fine,</p><p>It really felt like low grade LSD, but without much mental stimulation. Physically my body felt tingly and worn down. Overall the experience to me was not really great but was definatley not bad. I probably could have used a larger dose. An interesting thing was that the taste in my mouth. Not the taste of the seeds but the taste during my trip. It was the same taste as acid gives my mouth while I trip.</p><p>If I was to try this again, I will probably go with the extraction method. Eating the seeds was not fun and just thinking about that is enought to deter me from wanting to do it again right away.</p>",
 "year": "2003",
 "id": "24894",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-04-12T07:00:00.000Z",
 "views": "4744",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ]
}
