{
 "title": "Drowning in my Bed",
 "author": "Tom",
 "citation": " Tom. \"Drowning in my Bed: experience with Nutmeg (ID 24914)\". Erowid.org. Apr 10, 2007. erowid.org/exp/24914",
 "substance": "Nutmeg",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "8 nuts",
  "oral",
  "Nutmeg",
  "(ground / crushed)"
 ],
 "report": "<p>Several months ago I had my first experience with nutmeg, which was recommended by a friend. A natural high sounded perfect, because my school performs random drug tests daily, or not so random.</p><p>Just thinking of that bowl full of an unbelievably insidious taste makes me feel like puking. Ill never know how I got down so much of that shit like I did the first time, but I suppose its only natural to blow the horror of the taste out of proportion.</p><p>Anyway, after reading several reports, I walked over to a nearby massive grocery store, which catered to an international clientele. Looking among rows of spices, after several minutes of searching row after row, I came across a small bottle of whole, fresh nutmeg. I was anxious.</p><p>As soon as I got home I took out a garlic crusher, and began to crush up several nuts into small chunks. I tried to swallow some of the sharp shards, but the nuts are hard, hurt my throat, and tasted like shit. Disappointed, I proceeded to crush up the entire bottle that contained about 15 large nuts. I separated the chunks from the powder and proceeded to repeatedly break up the chunks with my pathetic garlic crusher. I have since replaced this method with a cheese grater and a bowl. I worked until I had a large pile of brownish, mottled powder. I ignored the dosage, as I was not near any precise scales. I estimated the amount I had eaten to about seven or eight nuts, but it was probably more.</p><p>Then came the part, which I cannot remember well, and it still baffles me how I did it. I proceeded to eat the entire bowl, (which is the most nutmeg I have ever eaten) without anything but my self-control. It still confuses me, as every subsequent time I have done nutmeg, I have been close to hurling. It was around six o clock when I ate the bowl, and I sat on the couch, about to vomit with every nutmeg burp (not pleasant). 1 hour went by. Nothing. 2 hours. Nothing. 3 hours. Nothing. 6 hours, still nothing. I decided that I would feel it when I woke up, I was right.</p><p>At around three o clock in the morning, I woke up horrified, to find that I had been sucked into, and completely melted into my bed. My limbs felt like 300-pound weights, but oddly, I was extremely excited by the tremendous results. This was more amazing than mushrooms, alcohol and pot. I laughed to myself as my body began to meld with my mattress. It was an odd feeling, like being one with my bed, but still being able to move, as if my back was attached to my bed, but the rest of me can wiggle. I know now that I must have overdosed, to get such extreme hallucinations.</p><p>I lay there, slowly raising my arms and legs, ecstatic that they were like 300-pound iron. Its such an odd feeling to have such limitations on your movement. When I was able to sit up, I felt nauseous, and my vision was unbelievably blurry and everything was spinning, sort of like being completely drunk. I staggered out of my bed, and the feeling of weighing as much as Jaba the Hut, or Rosie ODonnell, went away. What arrived in its place was, like I said, a feeling of being completely wasted, so far gone it was tremendously hard to walk over to get a bottle of water.</p><p>The next thing that happened, I will never forget. I have had dry mouth, from smoking pot, but I have never been tripping and had dry mouth at the same time. It felt as if in 3 seconds, something suctioned all the liquid out of my mouth, I could almost hear the noise of all my saliva being sucked from my tongue. I was shocked, and stood there, struggling to stand in my living room. With a crackly mouth, so dry I could feel every dried up taste bud on my tongue.</p><p>I pushed aside my wonder, and went to grab a bottle, actually 3, of water. I drank, but it was little consolation to my cracked cottonmouth. I staggered back to my bed, and lay down. I didnt sleep that night. All I could feel was a pulsing in my head, dryness in my mouth, and a feeling of being wasted like no other. Oddly, it was all very entertaining to me. I guessed I was going crazy.</p><p>Since I had eaten so much, the next day I was still feeling the effects, even though I puked on several occasions. I felt the effects all day, and the day after.  I had to pretend I was sick, so my family wouldnt notice. With a high fever, nausea, and dizziness, I was sick. Those few days I staggered around the house, the only sign that I was returning to normal was a slight ease in my cotton mouth, and I woke up on the fourth day, with a little bit of a hangover, but I felt as if the entire experience was one huge hangover.</p><p>Since that first time, I have done nutmeg on several occasions, the second I tried nutmeg tea, but I could only stomach two chugs, which, surprisingly, was enough for me. The third time was my last so far, and just remembering it, is what makes me hesitate when reaching for that bottle of nuts. The horrible taste began to eat away at my mind after the second time, and so after reading several reports, I decided to try something people do when taking ecstasy, bombing, or placing some powder in some toilet paper and swallowing it. Unfortunately, and embarrassingly, I placed a large amount of nutmeg in the package, and when I tried to swallow it with water, the large bundle wedged itself halfway down my throat, and the sticky toilet paper lodged it there securely. I spent twenty minutes puking, and choking on the horrible thing, which ended up exploding in my throat. So not only did I almost die, but I still had to taste it. I dont know which is worse.</p><p>A method I found that works pretty well is making a thick, nutmeg sort of stew, and filling your mouth with water, and placing glomming spoonfuls into the back of your mouth, using your lips to pull the soup off the spoon, and swallowing, immediately chugging more water, I barely tasted it. I recommend this method if you dont have 50 empty gel caps lying around the house.</p><p>Overall, I feel like the nutmeg trip was totally worth it, the first time. I completely recommend it if you have enough self-control to stomach it, or if you happen to find empty gel caps. You dont know how many times I have sat there, staring at that small bottle of nuts. I also dont recommend eating as much as me, I probably overdosed, but it was still fun.</p>",
 "year": "2003",
 "id": "24914",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-10T07:00:00.000Z",
 "views": "13688",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 nuts",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 }
}
