{
 "id": 2491,
 "title": "Unique in its Own Way...",
 "date": {
  "submission": "2003-04-23T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "spectralmagic",
  "gender": "Male",
  "weight": 118
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "smoked",
   "substance": "Heimia salicifolia",
   "form": "extract"
  }
 ],
 "report": [
  "I received unexpectedly some dried H. salicifolia, and after reading up on it decided to try an extract.",
  "A methanol extract was made from 5g of dry Heimia Salicifolia, and evaporated.  10 minutes ago I proceeded to suck into my lungs that extract, in smoke form.  There's nothing else in my system.  I was feeling somewhat lethargic, but generally neutral, prior to this.",
  "Physically, it's a lot like a weed stone, but with more energy - I'm as uncoordinated as I would be with THC, but at least I don't feel like a slug.  Body heat seems to be migrating around my body, legs can feel cold while face is hot, then arms get warm while hands cold...",
  "Visually, not a whole lot going on.  Colours are a bit more saturated, some multi-coloured snow with eyes closed...  I'm not noticing a darkening of my peripheral vision so much as I'm noticing an absence of peripheral vision...  almost like anything I'm not looking directy at fades to grey.  But this effect isn't too strong...",
  "Audibly, some effects... again, not as described, things don't sound far away, things just sound, well, like background noise, like what you'd hear at a club, but not as loud.  But again, this isn't too strong...",
  "Mentally...  very difficult to describe.  One moment I seem to be completely sober (minus the physical effects), next moment I'm deep in thought, or planning things...  quite alert & functional, not at all like the rest of me :-).  Bizarre.  It's like weed for intellectuals (slight exageration perhaps).  Slightly euphoric.  I'm definitely in a good place.",
  "Now, keep in mind this is from 5g of starting material.  It's not exactly the most potent plant, and who knows, maybe methanol is not the best solvent (are the actives alkaloids or oils?).  Anyway, it's convinced me to buy seeds...   I see it working well as something to mix with weed...  anyway, I've added another entry to my 'to keep in stock' list. :-)"
 ],
 "erowid": {
  "id": "18309",
  "citation": " spectralmagic. \"Unique in its Own Way...: experience with Heimia salicifolia (ID 18309)\". Erowid.org. Apr 23, 2003. erowid.org/exp/18309",
  "substance": "Heimia salicifolia",
  "views": "18692"
 }
}
