{
 "title": "Psuedo Mescaline",
 "author": "1200 micrograms",
 "citation": " 1200 micrograms. \"Psuedo Mescaline: experience with 2C-T-7 (Sold as Mescaline) (ID 24924)\". Erowid.org. Oct 14, 2007. erowid.org/exp/24924",
 "substance": "2C-T-7 (Sold as Mescaline)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  "25 mg",
  "oral",
  "2C-T-7",
  "(capsule)",
  " T+ 3:00",
  "25 mg",
  "oral",
  "2C-T-7",
  "(capsule)"
 ],
 "report": "<p>I'm writting this to warn ppl about the growing increase of research chemicals that are being pawned off as older and more established drugs. </p><p>Just about weekends ago 3 friends of mine met with a guy in the city, who said he had mescaline for sale.  Now when we looked at the viles they were powder form.  What struck me though is when he said the dosage to weigh it up at.  It was all wrong, he said .03 was a dose and I argued that a common dose of mescaline was about .25, a huge differance.  He went on that his guy told him that its really pure mescaline.  I decided not to get into it and we purchased a few vials without anymore noise.  Being a little skeptical as to what we bought we weighed it up as he suggested as to avoid any mishaps.  Before leaving he also said NOT to snort any of it, which is also strange.  I've never heard of mescaline that you couldn't snort.</p><p>A few hours later we get back into town and we all split up our capsules and went our own way.  4 hours later at about 12:30 2 of my friends call me up saying they've dosed and want me to stop on by my friends house to dose with them, even though they were already tripping.  I wanted to wait till tomorrow after I got a good night sleep.  But they were persistant and they needed somebody that knew how to roll joints under the influence of psychedelics.  It was about 1am when I got there and we started a nice fire in the backyard to chill next to.  They have already been tripping for 2 hrs before I got there.  I dropped 1 capsule and they each dropped another about an hour after me.</p><p>The whole night went pretty good.  The trip was alot like a good mescaline trip.  The whole experience was very pleasant, with a great body buzz and good OEVs.  And I kept wondering how I could be feeling like this off such a light dose if it was mescaline.  Through the night both friends threw up several times and I told them that they shouldn't of ate anything for several hrs before dosing, but they're both impatient when it comes to taking psychedelics.</p><p>About 9am comes around and my one friend, seeming fine, just walks across the fire and stumbles onto the ground face first.  We thought he was just being stupid and high and laughed, but then his whole body begins to tense up and he starts making strange animal like grunts.  It wasn't funny anymore he was going into a seizure.  I've seen someone have a mind seizure before that lasted 1 min tops.  But this kid was going into a full blown seizure.  His teeth were grinding and his whole body was tensed up and his eyes closed and rolled into the back of his head.  Then he started to convulse and was struggling with his breathing.  My other friend asked if he should call an EMS and I told him to hurry.  I tried to keep him on his side so he wouldn't choke or swallow his own tongue.  After about 10 mins the first person on the scene isn't an EMS of course it's a sherrif.</p><p>This cop immediatly looks at the situation and looks for signs of criminal activity (drug abuse).  This didn't help at all.  His muscles were starting to relax and his breathing was regular again, except for the twitching.  He finally opened his eyes and looked at me with a blank expression and asked where I came from.  I told him I've been right here.  Then he glanced at the cop over my shoulder and jumped up which really shocked me then staggered around as if trying to run and fell in a brush pile and started to relapse.  Once me and the cop pulled him out and sat him down on a fold up chair.  He started freaking out real bad.</p><p>Then my other friend came back with the ems finally.  The medics did their thing and got him to calm down.  He was responsive but not really there, kept wanting to get up and walk around.  So the medics straped him down.  Then the questions started, the cop started with his interrigation of the whole thing.  Searched my friend before the medics got him into the ambulance to take him to the hospital and he sure took his sweet ass time.  Me and my other friend didn't get searched, but were bombarded with questions.  We told the cop that he got something at a party we were at the other night.  He asked what it was, but we told him all we knew is it was a hallucinogen.  We said we didn't mess with that shit etc.  And he finally left as well.</p><p>After pumping his stomach and taking a blood test they didn't find anything that they knew of, so they sent the blood to a lab to do extensive research and the results came back with 2C-T-7.  Something I've never done before.  My friend is fine except being very well shaken up still.  Also the other friend that split up earlier the day before had a friend that had a seizure after taking 1 capsule.  His seizure was very brief and they didn't have to call for an ems.</p><p>I decided to write this to warn ppl especially if you live in the Detroit area (even farther if you come from smaller towns to the city for your hook, which most ppl do) where this psuedo mescaline is in heavy circulation right now.  It looks like these research chemicals are starting to reach farther and farther.  Earlier this spring at the DEMF (Detroit Electronic Music Festival) I ran into several ppl selling AMT and Foxy.  The fact that these are research chemicals still and that not alot of ppl do their homework on new drugs makes for a dangerous cocktail.  Tread carefully and know that when u roll the dice with the reaper the odds are always in his favor.</p>",
 "year": "2003",
 "id": "24924",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-14T07:00:00.000Z",
 "views": "30741",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 3:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(capsule)"
  }
 }
}
