{
 "title": "I Missed My Spiritual Journey",
 "author": "Cooldude",
 "citation": " Cooldude. \"I Missed My Spiritual Journey: experience with Nutmeg (ID 24943)\". Erowid.org. Mar 25, 2006. erowid.org/exp/24943",
 "substance": "Nutmeg",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "13 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>I took the nutmeg with kool-aid, taking a spoon of the nutmeg then washing it down with the drink till it was gone took about 30 mins cause we were laughin alot, wondering how the trip would be.</p><p>T+00:30 - I felt very anxious about the upcoming trip not knowing what to expect, I also had a weird sense of clarity.</p><p>T+01:00 - Me and my freind that had did it with me both left my house and  as we did, we both looked at each other and went ' man! the road looks purple! that kinda freaked my out, and after that most gray surfaces had a weird glowing purpleness to them.</p><p>T+02:00 - I couldn't help but stare at stuff, but i actually wasent staring at it, i was like spaced out, in a big daze. Not really thinking, and not really noticing. It was like a dream kind of.</p><p>T+03:00 - Still in a dreamlike state, listening to techno, head bouncing with the beat, really happy feelings, couldn't help but move with the beat, i was in a trance-like state. started to freak me out that i couldn't stop my head from bouncing with the beat.</p><p>T+04:00 - Ate some cookies and drank some water, cookies took forever to eat, it was like my hand was moving in slow motion, really dry mouth and eyes also, eyes very red and bulgy looking, also freaked me out. me and my freind the whole time these weird effects were happening were laughing about it. specialy the bouncing head to the beat. which my freind found really amusing.</p><p>T+05:00 - 06:00 - Tried to go to sleep, slight twitching of muscles, very noticable heart beat, like it was all around me. pot-like haze, but kind of different, easiest to describe would be, like i was in a big drema, nothing was really there.</p><p>T+06:00 - 08:00 - I think i feel asleep, but not for long cause i woke up in a kind of scary twitching state, I woke my freind up who i could hear was very wrestless and was rolling around or something, which freaked me out cause i thought he was having a seizsure. We sat up and I told him i couldn't stop shaking, it was like i was really cold, and it scared me badly.My freind just sat there looking at my computer eyes as red as ever. when he looked at me it seemed like he was looking past me. I sat by my computer where my friend was now sitting and just shook in my dreamworld, very scary stuff. after a while i got up and walked around, so unreal was the world i kept having to talk to my freind to make sure i was there. I was still shaking uncontrollably so i sat down on my couch and tryed to get a grip. I found that if i relaxed my feet, the shaking would stop and i felt really happy, I faught the shaking for about 15 mins, then it was pretty much gone. then I lay down and try to go back to sleep, my friend did also. during the next like 45 mins I heard tons of audio hallucinations, lots of purrs and whispers, that seemed to be all around me. but i didn't care cause i was still in the spaced out 'free' state I had been in since the first effects were felt.</p><p>T+08:00 - 15:00 - I slept no dreams no nothing just deep sleep</p><p>2nd day</p><p>T+15:00 - 25:00 - Woke up feeling fine as i layed there. but the second i stood up i noticed I was still high. no shakes, no fear, just a big dream, pretty cool. After a while I started to get annoyed at how long the trip had lasted. During this whole time the only difference from baseline would have been the dreamlike state. very hard to explain. everything just seemed unreal. like it wasent really there. like i wasent there. and at the time i didn't feel like i remembered what i had done 5 seconds before.</p><p>3rd day</p><p>T+36:00 - I had to work from 10am-2pm and felt very strange, still kind of dreaming, i didn't pay much attention, and stared at nothing most of the time. hard to keep on task. not tired, just like unaware of what was going on most of the time.</p><p>4th day</p><p>I felt fine, at the time I really didn't like the trip because of the shaking. but now i look back and see it as a really cool trip, good times. But I really disliked the length, took up alot of my life, unable to function properly</p><p>The whole point of me having this trip was to go on a spiritual journey, but that didn't happen, maybe cause it was the first time and I spent to much time noticing what was going on?  But im sure i'll try this drug again. maybe less of it. cause i really didn't liek the shaking, or the length of the trip.</p><p>Ups- felt happy, laughed alot with my freind, very peaceful alot of the time.  things seemed alot more interesting then normal. no upset stoamach like i read i'd have.</p><p>Downs- length of trip, shaking, feeling of being out of control, couldnt help myself. hazy after effects sucked.</p><p>All in all. not bad; hopefully i can go on my journey next time! maybe i should try meditating next time? and i also will be more calm since ive felt the effects and know more of what to expect. I think I need to try this drug a few times to find out how to make the trip a really interesting and spiritual one.</p>",
 "year": "2003",
 "id": "24943",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-03-25T08:00:00.000Z",
 "views": "11779",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "13 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ]
}
