{
 "title": "Streaming Soda Bottles",
 "author": "Sean",
 "citation": " Sean. \"Streaming Soda Bottles: experience with Peyote (ID 24951)\". Erowid.org. Jul 2, 2003. erowid.org/exp/24951",
 "substance": "Peyote",
 "bodyweight": "150 lb",
 "report": [
  "<p>Drove down to Mexico Jan. 2002.  Went to a great little town and a lot of people were offering to take us out into the desert to get some peyote.  We declined since they all offered horses.  We tried the next town.  There we managed to get someone to take us to some peyote by truck.  We had commited ourselves to eating in the desert, the natural way, but ended up taking it back to the town with us because, well, we were really just looking for a high not a spiritual experience.",
  "We shut ourselves into our hotel room (a concrete cube, really) and ate the peyote.  I had gotten four, having heard that less then three was a waste of time.  I only ended up eating three though, because it was the most foul tasting filth I had ever tasted (worth it though). We all had ones with about 10 to 14 segments.",
  "After about half an hour (maybe more) I started to feel a little off, not really high.  Even at the time I couldn't really tell how I was feeling. ",
  "Then, I closed my eyes.  I saw the craziest stuff without even thinking about it; it was like my brain was just showing it to me.  Stuff like bright lime green and sun yellow bottles streaming through a bottling plant.  All very cool, not bad at all, all I had to do was open my eyes and feel normal again: very controlled feeling.",
  "After a while my frinds started reading some poetry by federico garcia lorca.  I had never heard it before and it really started messing with the strange visuals on my eyelids.  Soon everything I saw was all vomit and blood.  I saw a bunch of bees decending on a feild of shallow graves giving birth to human babies into them; the babies were then carried off by large beetles.",
  "That was the worst of it though.  And still opening my eyes seemed to help. ",
  "After I don't know how much time (maybe an hour, hour and a half) I could see minor visuals with my eyes open; stuff like patterns in the stucko ceiling.  We went out to the train platform to see if we couldn't see a train.  Being out in the daylight was strange; I felt very self-conscience.  The one guy in our little group that spoke spanish found out that the train didn't stop in wadley anymore, but it came through pretty regularly.",
  "I chose to sprawl myself out on the platform while my buddies sat down.  Eventually, we realized that a family lived in the train station and left to watch for trains from the roof of our hotel.  We watched the train go through town, but not too long after that the power went out in town and I started getting freaked out and was begging to leave.  We dove out of wadley as I was coming down and we saw a burning tractor trailer on the side of the road (a little strange while coming down. ",
  "I would set the overall time at about four hours of definitly up time.  I probably should have eaten the fourth one I had harvested, but I didn't waste it; I ended up giving it to our desert tour gide. ",
  "Note: I have closed eye visuals very easily; sometimes just from getting stoned and drunk.  But, now that I mention it, it seems to have become more regular since the peyote experience.  Actually, I can't remember a single instance of it before the Mexico trip.  Maybe it showed the way to some unexplored region of my brain.  Maybe I'm just a light weight.  The latter is probably the case.</p>"
 ],
 "year": "2002",
 "id": "24951",
 "gender": "Male",
 "views": "26050",
 "dose": [
  {
   "time": "0",
   "amount": "3 buttons",
   "administration": "oral",
   "substance": "Peyote",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2003-07-02T07:00:00.000Z"
}
