{
 "title": "An Alternate Reality",
 "author": "Jon",
 "citation": " Jon. \"An Alternate Reality: experience with MDMA (Ecstasy) (ID 24994)\". Erowid.org. Apr 3, 2006. erowid.org/exp/24994",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   " T+ 24:00",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>E, X, whatever you will call it, I call it alternate reality. It all started 2 weeks ago, when my friends had been rolling for quite some time and told me it's unlike anything in the world. I began to contemplate, reading various web sites online, reasearching for days on the negative effects and if you can die from the drug. I myself do not do drugs and never have, In fact I am what they call a worry wort. Always expecting the worst yet such a melancholy person. I have know of E since I can remember back in high school when alot of people started it. I promised I would never do it, but only promised myself that not knowing or having any knowledge of the drug what so ever. Going back to the night it all started and after researching everything and anything on the drug, I can tell facts / health issues / hwo to safley use the drug / what it does etc.</p><p>Well, the following week I decided to roll, take a half of pill my first time. Reason being I decided to roll, I like to try new things and am very strong willed, I was 100% sure it would not harm me nor will I become a strong/addicted user. So it starts.... 3 of my friends and I drop Green Smirnoff pills, we did not test them we just dropped them, I took half and my friends took a whole, immediatley after I felt scared and worried I may have just got myself into something that would change my life forever and for the worse not better. I was completely wrong, 30 -45 minutes I started to feel an overwhelming giddy sensation like I was 6 years old and spoiled rotten. Later on it only got better I was incredibly happy and optimistic whitch I am usually not. The expirience only lasted about 2 hours and I knew I did not take enought to expirience a 'full blown roll' so I could only imagine the effects of a full pill. So it changed my life for the better.</p><p>Next night I did it again, only this time around a full pill and alot more activity this night. My friends and I all dropped one pill, It started up the same time as last night, and the expirience was unbelievable, I felt like a god beyond my wildest dreams, in full dominance of my every feeling and completely comfortable with the world, buzzing and vibrating my body was. We decided to take a car ride to pick up some girls a sober driver of course. Nick, my friend decided to throw on some trance music, which I never cared for and still don't unless I am rolling, the appreciation I gained for music was exactly like I read. As we listened to DJ Hydro's Trippin The Trance, I closed my eyes and I was taken to a place my mind, body, and soul have never been 'An Alternate Reality' keep in mind it was only because of the drug. I felt so exhilerated and the music only made it the indescribable physical and mental feelings 80 times stronger. I felt like an immortal god of ecstatic energy. These are the only words I can say to describe it.</p><p>After the car ride and picking up the girls I had brilliant and detailed conversations like never before with people I did not even know. Not to the point where I told them my life story or shared intimate things, just simple but real conversations that felt almost as if they were out of a compelling movie or song... and from that point on I knew I would love and accept life a whole different way. Life was not dull anymore it was breathtaking and I only wanted to learn more about life. Taking E broadened my horizons from such dull and boring every day reality, it took me to another world. Like I was reborn into a different person.</p><p>After that night I woke up and I started feeling incomplete again and very depressed like I had no hope for life it was terrible, then I realised that it was simply after effects of the drug and I came to sense with why I felt like this I could overpower the feeling and I did. The physical effects were still their headache sore throat just felt nasty but I can deal. I then did it 3 nights in a row, and had the same expirience. I am soon to buy a kit to test the pills and play it safe with this drug, it is a wonderful and indulging/enlightening exp. but I need to be smart and safe and NOT LOSE SELF CONTROL which many do who have expirienced complete chaos with it, for instance addiction, death, bad exp's., etc.</p>",
 "year": "2003",
 "id": "24994",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-03T07:00:00.000Z",
 "views": "6024"
}
