{
 "title": "Horribly Terrifying",
 "author": "Chris",
 "citation": " Chris. \"Horribly Terrifying: experience with 5-MeO-DMT (ID 25033)\". Erowid.org. Jul 7, 2003. erowid.org/exp/25033",
 "substance": "5-MeO-DMT",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "6.0 mg",
  "insufflated",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>I had never heard about 5 MeO DMT until a friend of mine introduced me to it, explaining that we should lace it on top of a bowl of weed and that I would attain an incredible trip. He only put 5 mg on and a few friends and I finished the bowl but I didn't get any results. My friends saw some trippy visions but that was it. My friend then told me we should snort a line and that I would definitely get the trip I was looking for. So after snorting 5 to 7 mg I waited for the results to kick in. After 3 or 4 minutes I felt my body getting really warm so I began to take off my jacket and I kept getting hotter and hotter and I felt my pulse pick up rapidly. At this point I began to get very concerned as I was thinking to myself that this isn't good at all. Only me and my friend snorted it but I was around lots of people in my dorm room at college. They were all anxiously watching me as I started to take basically all my clothes off except my boxers. I kept rubbing my body and touching myself everywhere as I couldn't stop moving.</p><p>I started to get nauseous about 10 to 15 minutes in and my veins in my arms were gone, my body felt numb, my heart was racing, i felt extremely hot and I couldn't stop pacing. I went to the bathroom as I felt like I was going to throw up and I tried to but I never did. While I was in there I started to have extremely negative thoughts as I was asking myself why I would take this drug I knew nothing about. Everything was intensifying and I was convinced of the worst, that I was about to die. I thought by throwing up that I would throw up blood or something or that it would kill me by doing so, so I tried hard not to throw up. I began thinking about my family and my friends and how my parents would react to their son overdosing on some drug and dying in his college hallway bathroom. I started reminiscing briefly about times with friends and how it was all going to come to and end and I kept telling myself, I have to fight this and overcome this, I can't die.</p><p>My roommates came in and checked on me as I was squatting over the toilet still and asked if I was alright and I was just trying to play it off saying I was going to be ok. After about 15 minutes total in the bathroom I went back to the room, started talking out loud to my other friends in the room saying how intense my experience was and how I wanted it to end badly. My other friend who had taken it had done 5 MeO DMT before and I was asking him if he ever felt like this before and he said that his first time reminded me of how I felt at that current time. He felt extremely relaxed and was having visions, just sitting in a chair all dazed with his eyes extremely dilated. I went on to the top bunk and tried to lay still but I couldn't. I was too scared and wired to stay still so I paced around for another few minutes, went back into the bathroom again briefly as I still felt nauseous.</p><p>My skin was very very white and completely pale. I went back into my room and forced myself to lay down. At this point I felt the nausea going away slightly but I still had to close my eyes and focus to fight it. As I was doing this I would keep talking out loud about how horrible this was and how I was waiting for it to end. I stayed still for about 5 more minutes (now 40-45 minutes in after snorting it) noticing that my heart was calming down slowly and I started breathing easier. My veins felt like they were cracking or breaking when I moved my neck, which fascinated me for a couple minutes as I kept moving my neck, making sure my blood kept flowing so they wouldn't crack. Then I started to come down more, and I kept rubbing my body against my blanket and I started to feel some comfort and pleasure. My body felt extremely relaxed and I kept my eyes closed and enjoyed a brief 5 to 10 minutes of euphoria. I sat myself up afterward and noticed my nauseous feelings were completely gone and I kept talking to my friend who was coming down as well.</p><p>I couldn't stop talking about my experience as I was convinced I was going to die but it felt extremely gratifying knowing I survived and made it through this ordeal. After about 65 to 70 minutes my trip was over and I went to sleep for the rest of the night. It was definitely something I told myself I would never do again but I'm actually planning on doing it very soon again because I want to experience a second trip now that I'm more prepared for what to expect and some of my other friends want to do it for a first time with me. Overall I would tell people who have never done it before, be mentally prepared. Meditate or whatever. I would definitely say it changed my outlook on life and gave me a greater appreciation for life.</p>",
 "year": "2003",
 "id": "25033",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-07T07:00:00.000Z",
 "views": "13634",
 "dose": {}
}
