{
 "title": "Looking Back",
 "author": "neversleep",
 "citation": " neversleep. \"Looking Back: experience with MDMA (ID 25039)\". Erowid.org. Jul 7, 2003. erowid.org/exp/25039",
 "substance": "MDMA",
 "bodyweight": "125 lb",
 "report": "<p>Having been an avid user of many drugs for many years (and having relied heavily on erowid), i figured it was about time i wrote a bit about my favorite drug.</p><p>The thing that you might find odd about my experiences with the drug is that i am not, and have never been, into the rave scene.  I was introduced to the drug by a former roommate.  My first time consisted of the most anti-rave experience possible: hosting a housewarming party while listening to the ramones.  i was drunk before taking, and as a result, barely felt its effects.</p><p>Several rolls later over the course of 5 years, varying in dosages from 1/2 pills to 10 pills, i feel some sort of responsibility to tell the net about what i've learned.</p><p>Most of the time i took them with a longstanding girlfriend.  A few times, i took them with the roomie and our small circle of friends.  The usual preparations for our rolls varied slightly, but usually consisted of candlelight and gentler music than what ravers are into.  My roomie also insisted on taking st. john's wort, claiming that it prolonged the roll.  I never did any research into the truth of this, and frankly, never noticed any difference on the occasions that i didn't take it.</p><p>The setting was usually home, or a friend's house.  always indoors, although i/we have occasionally ventured outdoors once rolling.</p><p>The actual experiences were wonderful.  Either with friends or the longstanding girlfriend, there was a lot of heavy conversation.  Also, there was always some degree of non-sexual touch going on.  Headrubs, footrubs, backrubs, and the like...all felt wonderful while rolling.  The private settings i was always in made the experiences that much more profound - there was little to distract in these environments.  One of my rolling quirks is water...i simply HAVE to be in water at some point while rolling, even if it's just a shower.  mmm...water.</p><p>As time wore on and i rolled more and more, i began to get very picky about who i would roll with.  I found that the drug left me so emotionally naked that i became adverse to taking it with anyone i didn't feel knew me very well already.  A friend of mine even joked that i was more choosy about who i rolled with than who i slept with.  And honestly, it was true.  Rolling became more of an intimate experience than sex.</p><p>I and that longstanding girlfriend (now my fiancee) will continue doing ecstasy as long as we possibly can.  While we only do it a few times a year, it is a very big part of our lives.</p><p>What i would like to tell everyone about what i learned in my ecstasy experiences is this:</p><p>- I found that i could say anything that was on my mind, something that was normally difficult sober.  I felt confident.  I felt, for the first time in my life, comfortable in my own skin - at ease with myself.  This feeling has stayed with me ever since, sober or otherwise.  I can tell you from personal experience that i can now see why this was once used as a therapeutic drug.  I think everyone should experience ecstasy at least once, and see if it works for them.</p><p>- Try it at home, out of the club scene, at least once.  Take it with someone you feel comfortable with.</p><p>- Ease the hangover by planning on staying in bed the next day.  In other words, take on a friday and make sure you have nothing going on saturday.  I've actually come to enjoy the hangover by doing this.</p><p>- I once took it alone, and was able to sort out my usually sticky and messy emotions with ease.  Try rolling alone, in a quiet place, just once.  The experience may stay with you for a far longer time than you think.</p><p>These are just my opinions, and as we all know, drugs affect different people in different ways.  However, i think the portrayal of this drug as the 'hug drug' or a 'raver drug' limits most people's perception of what MDMA can do for the psyche.  I'm not putting down the intense and lovely physical sensations that come with the drug, mind you, (god, i love footrubs).  I just want people out there who are thinking of trying it to realize that it's more than a silly little happy pill, as they often hear.  I also want experienced users who perhaps never tried the pill outside of the rave scene to give it a second look from a different perspective.</p><p>Ecstasy changed my life in a permanent and positive way.  I hope it does the same for you.</p>",
 "year": "2003",
 "id": "25039",
 "gender": "Male",
 "timestamp": "2003-07-07T07:00:00.000Z",
 "views": "7402",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
