{
 "title": "An Outstanding, Calm High",
 "author": "dalan",
 "citation": " dalan. \"An Outstanding, Calm High: experience with Dragon's Blood Incense (ID 25057)\". Erowid.org. Jul 6, 2003. erowid.org/exp/25057",
 "substance": "Dragon's Blood Incense",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Red Rock",
   "(tar / resin)"
  ]
 ],
 "report": "<p>I have just recently read your information on the subject of redrock opium and would like to try and shed some light from my experience. i have seen your pictures and compared them to my personal stash, the immediate differences i noticed was that my redrock was dull in color compared to your sample.</p><p>The next thing i noticed was that my sample smoked smoothly (like the reports i read from your page) if small hits are inhaled but if the avid cannabis user trys to take 'a big hit' that he could normally stand if it were canabis, he chokes and coughs.</p><p>Also my samples turn into a black tar like substance which bubbles while being heated in the tar state. if let to cool, the tar hardens and resembles a chunk of hardened black tar opium.</p><p>An outstanding high is obtained from smoking it straight (no canabinoids present).  The high makes time stand still when in actuality many hours pass by. For example, i was at work detailing a limosine and i was</p><p>smoking in it and i smoked a chunk about the size of a nickel to myself. it took me quite some time to smoke the whole piece and when it was finished an hour went by, i walked out of the limo and went to go get cleaners and went back in the limo. I proceeded to spray down the interior and smoke more. Another hour passed by in what seemed to be only 10 minutes.....</p><p>The effects include extreme calmness and daze.</p>",
 "year": "2003",
 "id": "25057",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-06T07:00:00.000Z",
 "views": "27389",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Red Rock",
   "form": "(tar / resin)"
  }
 ]
}
