{
 "title": "Intense Trip *After* Comedown",
 "author": "Zeb",
 "citation": " Zeb. \"Intense Trip *After* Comedown: experience with Mushrooms - P. semilanceata (Liberty Caps) & Cannabis (ID 25094)\". Erowid.org. Oct 14, 2007. erowid.org/exp/25094",
 "substance": "Mushrooms - P. semilanceata (Liberty Caps) & Cannabis",
 "bodyweight": "154 lb",
 "report": "<p>Background: I was 24 at the time, at University, reasonably well balanced.  I've smoked a fair bit of pot in my time, and had done mushrooms a few times prior to this, at doses of 75 caps (probably the turning point in my recent life, lots of hang ups were resolved in one of the coolest, most in depth conversations with my tripping friend that I've ever had with anyone), then a low dose of about 25, one of 33 and another of about 50.  All of these were positive experiences, although the 25 shroom trip was quite anxious in the sense that I wasn't *quite* tripping, and I was feeling frustrated at not being in the zone, whilst my friend was clearly having a great time.  Overall, pretty happy with my experiments with the magical shroom.</p><p>This particular trip took place in about November 2002, a couple of friends joined me, one who I had tripped with before and another who was a good friend, but not a previous tripping companion.  The setting was good, we spent it at home, mostly in my room listening to my mushroom mix playlist on the PC and doodling, and having the occasional spliff, as cannabis definitely intensifies the trip in our experience.  Earlier in the day we had gone out to a nearby hill to collect the shrooms, and we certainly came up with the goods.  Between us we gathered about 1000 mushrooms, and divided it among the hunting party, which left about 400 for the two of us in the house, which we were going to share with the others who were going to come round.</p><p>In the end a few people bailed, so when the time came there were three of us.  We decided to take 250 in tea, with the newbie having a little less tea, which should have given me a dose of around 75 - 100 shrooms.  We were seeking that first magical experience we got on 75.  However, I got the last bit of the mug of tea, which had all the shroomy 'bits' in it.  This may have given me a somewhat higher dose than the others, I'm not sure.</p><p>For an hour or so, nothing much happened, and then the rushes came on - this phase is to my mind the best part of the trip, incredible feelings of happiness and a desire to dance to trancey music, so I did.  I was alone at this point as I wanted a little bit of personal space during this bit.  The main part of the trip came on, and basically, it was another wonderful experience.  Inhibitions dissolved, we were back to childlike wonder, getting really into music, pretty lights, and curiously, some dust on the stairs which was really cool.  I think actually it was more the feeling of being 5 and seeing familiar surroundings through more open eyes.  We were having a fabulous time!  I won't go into detail, but it was classic good trip material.</p><p>Naturally, time passed, albeit veeeeeery slowly :) and a few hours later I found myself coming down with the others.  At this point, I was mentally sitting on a mountainside on a red bracken covered industrial landscape, feeling a little unsettled, as I do when I can feel all my day to day perceptual filters kicking back in. I start to feel self-conscious and avoid eye contact and so on.  A little while later, I was basically baseline again.  My friends went to bed and home respectively, and I tried to go to sleep too.  </p><p>An hour or so later, I still couldn't sleep, and my thoughts were beginning to accelerate, then the closed eye visuals kicked in.  I couldn't even think of sleeping because every time I closed my eyes I was confronted by a seething mass of slightly greenish, mucusy looking liberty caps.  Everything seemed to in some way or other to relate to mushrooms.  I attribute this phase of the trip to the fact that we'd been out crawling around on our hands and knees intently scrutinizing the ground for mushrooms earlier on in the day, maybe next time I'll pick them one day and eat them on another.  It wasn't hellish, but it was kind of disturbing. </p><p>So, I was beginning to get a little freaked.  I thought my heart was beating at incredible speed.  I thought I should get some sugar so I drank some cola, and tried some food and went back to bed.  But, when I tried to lie down, the pressure in my head seemed to grow and I got something akin to pins and needles all over my face, similar to the feeling I get if I hang upside down for too long, so I sat up.  This was OK for a while, and then I started feeling incredibly sleepy, and could barely stop my eyes closing.  But when I flopped down to sleep the pins and needles came back, and I was still seeing mushrooms and now some organic-geometric patterns.  This cycle of lie down until I had to sit up, until I had to lie down, until I had to sit up carried on for about half an hour and I was really getting a bit frightened, as everyone else was asleep and I really needed someone to talk to and calm me down.  </p><p>I went downstairs to the toilet, this was about 2 hours after what I thought of as the comedown, and as I was standing at the toilet I noticed some little worm creature wriggling around on the porcelain.  'Aaah, how cute, it's a liddle worm' I thought.   But then I took a closer look and realised it wasn't a worm it was some errant pubes and hairs (it's a student house, we don't have the cleanest toilet).  Right.  So they shouldn't be moving, except they were, they were knotting and unknotting themselves performing a quite beautiful little dance really.  This seriously freaked me out, as my two companions were now back to normal and asleep, so why the hell was I still tripping, and tripping hard?</p><p>I sat down and tried to get grounded, which was a mistake, as the bathroom floor is speckled linoleum, with lots of little sparkly bits in it.  Naturally they all started moving, patterns forming and shifting in the randomness of the sparkly bits, and at this point I knew that I was far beyond anywhere I had been before, and I was all alone in it.  If you've seen Fear and Loathing in Las Vegas, it was rather like the bit where they check into the hotel and the carpet starts moving.  I thought I was going to die, stupid, but I wasn't really thinking straight, and I was really getting the fear.  At this point I think I swore off all drugs forever (again, I wasn't really thinking straight!).</p><p>Eventually I calmed myself by going into the kitchen, nibbling on some food and staring out of the window at the sky, as dawn was approaching.  I felt I needed to get in touch with the real world, and ignore what was going on in my head.  Slowly, this worked, and I sat in the kitchen for a while, just gradually trying to let it all subside, concentrating on rejoining the real world, and our grimy kitchen was gritty and down to earth enough to facilitate this.  Probably an hour later I was able to sleep, so I went to bed and slept.</p><p>However, this isn't quite the end.  For a couple of weeks aftewards, I experienced occasional phases of altered perspective and depersonalisation, triggered by the odd perspective.  I felt altered but not actually high, and it lasted for maybe half an hour each time, so it wasn't just some 10 second flashback.  I actually had to leave a lecture in uni at one point feigning nausea, because I was just panicking, the physical feeling of that bad part of the trip seemed to have returned and I had a vivid experience of raging paranoia.</p><p>Curiously, some non-shrooming friends have had similar experiences with occasional bouts of 'oddness' in the past year, which doctors attributed to a possible low level viral infection, so maybe I had something like that which came at a particularly inappropriate time, and the similarity to mushrooms was what was scaring me into thinking I'd damaged myself irreperably, but in all honesty I don't know.  All I can say is that it went away after about 4 weeks, only *really* bothered me for a couple of days and hasn't troubled me since.  At the time however, I thought the mushrooms had broken me :/</p><p>I look back on it now as just a bit of an overreaction.  I think, had I been able to talk to someone experienced at the time, I'd have been OK.  The problem was that I was alone and my mind was running in circles.  In future, I will write 'It's just a drug, it'll be over by the time the sun comes up' on a piece of paper and use that to calm myself, and make sure that I have a trusted friend around (or at the end of a phone) who I know wouldn't mind talking me out of a bad place at 4am.</p><p>To conclude, I'd do mushrooms again, but less of them, and I'd have a mug of the tea to myself so I knew exactly how much I was getting.  Mushrooms have profoundly altered me in very beneficial ways, and it would seem a shame to utterly write them off on account of one bad experience.</p>",
 "year": "2002",
 "id": "25094",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-14T07:00:00.000Z",
 "views": "4294",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata",
   "form": "(tea)"
  }
 }
}
