{
 "title": "I Am Not the Only One Worrying",
 "author": "communication",
 "citation": " communication. \"I Am Not the Only One Worrying: experience with Cannabis (ID 25096)\". Erowid.org. Mar 4, 2011. erowid.org/exp/25096",
 "substance": "Cannabis",
 "bodyweight": "63.5 kg",
 "report": "<p>Hi, it seems weird writing this report after months and months of indecision. Not quite knowing what quite is happening to me, psychologically. Even writing this I feel nuts, but I give it a go.</p><p>I have been a regular user of cannabis since I was 14, and have smoked it regularly now to the present (17). When I first started to use the drug I loved it, everything about it, the look of it, the smell, the ways I can use it. And the way I felt after I smoked it. Believe me I love to get off my face.</p><p>Me and a group of friends would smoke most days, generally block and occasionally weed. We would have competitions on how much we can smoke. I always felt like the leader, I could always smoke the most. And I was the only one at the start who could get hold of it.</p><p>At this point everything I was doing felt ok, pretty normal, then everything started to go wrong, slowly with out me knowing. To be honest I can't really remember how my experience(s) started all together I think its through the week on week abuse of cannabis from an early age.</p><p>At the moment I feel that I am in my own little world, where I am the only one, and everything revolves round me. If I could describe what I am is a THINKER. Through smoking cannabis I think constantly about my life, my friends, how the world is so fucked up. My parents, how I can't communicate with them, because I'm trapped in my world where I think bullshit all day. But I still smoke weed, which I know is fucking me up big time. Constantly thinking, how much I am fucking my life up. Believe me this is fucking hard to explain, but I know there is so many people out there like me. Trapped in our own heads. Shit scared. Immense levels of paranoia. That's the thing its all head games, not knowing what I am thinking is normal, if I am properly mental or not, or the truth I now know, the real reason for this the cannabis. Unsure about myself, what direction I'm going. What the future has for me, am I going to be a drug addict, or will I see the light. To a person who hasn't done drugs before they would properly thinking I am a nutter. But I know this report and reading other cases like mine has helped me.</p><p>To write down what I am actually thinking in my head would be impossible, so many thoughts and aspirations, so many questions need to be answered, and the only way to do this is get other people to write down what they're feeling in reports. I need to know what other people are feeling. It is fucking hard growing up these days in the world we live in. I know there will not be many out there like me but we need to talk like normal people again, not all are feelings and emotions trapped into our heads.</p><p>I need to know that I am not the only one feeling this way.</p><p>[Reported Dose: 'regular use']</p>",
 "year": "2003",
 "id": "25096",
 "gender": "Male",
 "timestamp": "2011-03-04T08:00:00.000Z",
 "views": "2544",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
