{
 "id": 251,
 "title": "Evil to Selfishness",
 "date": {
  "submission": "2006-11-28T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blah",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 lines",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "This past weekend I tried methamphetamine for the first time, and learned how evil it is.",
  "I know somebody who once told me it is truly a one-hit addiction.  I did enough to see how easily that *could* happen.",
  "This was a weekend of significant chemical abuse.  Friday night was MDMA.  Saturday night was lots o' alcohol.  We were coming back from having some food after going to a club and one of the people i was with found some meth in her purse.  It's kind of a funny story really - she said she hadn't used the purse in a couple years.  Apparently the meth had been in there the whole time.  She didnt remember where it came from, etc.",
  "Anyway, we got back to the hotel, and cut it into 8 small lines.  I did 3, one of the people I was with did 3, and the other did 2.",
  "After a few minutes, I felt like I was on MDMA, but without the empathic properties and general 'fuckedupness' I get from MDMA.",
  "I was relatively intoxicated from alcohol prior to snorting the lines.  I did not feel the alcohol at all after a few minutes.",
  "I believe the dose was relatively low - one of the people I was with said conversations get intense on meth, and the urge to smoke is pretty ridiculous.  I really didn't experience either of these.  In fact, the experience was pretty uninteresting to me - I prefer MDMA because its more 'empathic'.  Meth is so much about the person who's using it, and nothing else.  I like MDMA because it shows me what I am NOT (an outgoing, free-loving, carefree person).  Meth is more like my typical personality (focused on myself, confident, etc.)",
  "Anyway, now I get to the unpleasant part.  It's been 4 days since ingesting this small seemingly insignificant amount of meth, and I still dont feel right.  I feel like I am trying to quit smoking, but I haven't.  I can't concentrate on everyday tasks (went home from work early today because I could not focus on anything), I can't sleep at night, I am drinking about twice the amount of coffee I usually drink.  I know all of these symptoms are classic low-dopamine levels in the brain.  I am sure I got here because of meth.  My friend who knows more about it said I should start feeling more normal tomorrow.  I hope he's right.",
  "(I realize that my situation may have been exacerbated by the MDMA and alcohol in the near-recent timeframe.  However I've done those both in a weekend before and NEVER remember feeling this terrible)",
  "Today, my thoughts centered around trying it again - did I miss something the first time?  Is there more to it than what I didn't see the other night?  I am not going to give in though (it helps that I dont really know where to get any).  I've had my taste, and I've seen how truly evil this substance is.  I've seen it destroy other people as well.  I've spent too much time and experienced too much stress, and pain to get to where I'm at in this world to throw it away over meth.  I think that's exactly what would happen if I tried it again.",
  "I feel I essentially traded 8-12 hours of speeded up goodness for 4 days of suffering."
 ],
 "erowid": {
  "id": "10323",
  "citation": " Blah. \"Evil to Selfishness: experience with Methamphetamine & Alcohol (ID 10323)\". Erowid.org. Nov 28, 2006. erowid.org/exp/10323",
  "substance": "Methamphetamine & Alcohol",
  "views": "10128"
 }
}
