{
 "title": "Overview of Our Experiences",
 "author": "Clearlight",
 "citation": " Clearlight. \"Overview of Our Experiences: experience with DMT & Syrian Rue (Extract) (ID 25157)\". Erowid.org. Jul 10, 2003. erowid.org/exp/25157",
 "substance": "DMT & Syrian Rue (Extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "DMT",
   "(powder / crystals)",
   "",
   " ",
   "oral",
   "Syrian Rue",
   "(extract)"
  ]
 ],
 "report": "</p>\nWe tested some of the DMT (Mimosa Hostilis Root Bark Extractions) and harmala with a group and have started to come to some conclusions about dose and timing.  Harmala was extracted from Syrian Rue.  Both extracts were encapsulated before use.</p><p>Everything went off excellently for everyone... 35-40 mgs w/ 10 - 15 mgs boosters  2 participants declined boosters.  (Let me know if you have any questions on any of this...  it sure was fun!)</p><p>Here's what we discovered:</p><p>Mao Inhibtor takes 20 minutes to come on fully:  Experience is described as soft glow in room, body relaxed like hot tub.  DMT required 45 minutes to come on, peak 1.5 hrs after. tt to peak = 2:15 hrs</p><p>The dosaging IS body weight dependent.  If one's weight is less than 175 lbs, or they are sensistive, then the following applies:</p><p>Light : 25-30 mgs</p><p>Moderate : 35-40 mgs</p><p>Strong : 45-50</p><p>Intense : 50-65 mgs</p><p>If body weight is over 175 lbs :</p><p>Light : 35 mgs</p><p>Moderate : 40-50 mgs</p><p>Strong  : 50-60 mgs</p><p>Intense : 65-70 mgs</p><p>If body weight is 245+ :</p><p>Light : 45-50 mgs</p><p>Moderate : 50-60 mgs</p><p>Strong : 60-75 mgs</p><p>Intense : 75-100 mgs</p><p>Based on this, I computed the mg/kg dosage schema based on our results:</p><p>.45-.46 mg/kg : light dosage/sensitive</p><p>.47-.485 mg/kg : moderate dosage/average</p><p>.49-.51 mg/kg : strong dosage/resistant</p><p>Note: These are from limited bioassay results and 'resistant' is for the hard-headed ones among us, based on experience.\n Experience Key:</p><p> Light:    Slow build up, no nausea no body activation, conciousness is mobile, info/insights can be processed, no cev's, no problem w/ balance,  walking</p><p> Moderate: Some initial body discomfort, energy activation of body field, closed eye visuals, probable nausea, some synthesia, CEV's. Some walking difficulty. Moderate to deep insight</p><p> Strong: Stomach nausea may be present. Complete body energization,  walking is difficult. Synthesia of sounds/tactile to light. Conciousness can be easily projected into and out of body. Strong CEV's.  Deep insight into object/people/processes.</p><p>Intense: Nausea usually present.  Unable to walk. Intense CEV's Out of Body for most of trip. Insights and cosmic potentials arrive. Unity with the Divine. Enveloped in Divine Love. Conversations with God. Consciousness penetrates whatever it is directed to. Telepathy and Clarivoyance are present and immediate.  Approach this state w/ caution if you do not have a background in meditation, self examination or prior mystical experiences. If you do not understand the distinction between the unreality of your thoughts and suffering, and your pristine enlightened consciousness,  you should probably discover that before you have your hands full here.</p><p>--------------------------------------------------------------</p><p>Notes on Nausea:</p><p>In our circle some folks got sick, others did not.  There are two reasons why people get sick on Ayahusca.  The first is that in the traditional preparations w/ root/vine barks and/or leaves, there are a lot of chemical components, called saponins present.  When these compounds are mixed with water and/or alkaline components, they form soap.  MHRB Extractions only require water to generate enough suds to completely clean the glassware!</p><p> The other reason comes from traditional chinese medicine and it's analysis of morning sickness.   When a mother is pregnant, the child's chi and energy can overload the capacity of the mothers channels to harmonize and flow with the additional energy.  The Ren channel, which runs up the center of the front of the body, being a yin channel, is the one that is usually blocked or obscured, typically at the solar plexis under the sternum.  This causes the energy to back up at that point and make you want to throw up.  This may be dealt with in several ways.  1) Do breathing/yoga/tai chi exercises to open and relax the channels. 2) Incorporate some massage up the center of the front of your body from navel to throat.  3) Using your fingers at the base of the sternum/solar plexis, forcefully flick the fingers outward in a spreading motion from the centerline. This disperses the blockage. 4) Inhale and exhale deeply to the belly to disperse nausea.   In all of our pharmahuasca preps, we have never had anyone experience diarrhea even at high doses. This correlates well with the lack of soap in the preparations.</p>",
 "year": "2003",
 "id": "25157",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-10T07:00:00.000Z",
 "views": "57538"
}
