{
 "id": 2515,
 "title": "Yopo: Effective, But Not a Future Party Drug",
 "date": {
  "submission": "2002-10-22T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Melchior Immanuel",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "2:00",
   "amount": "3.5 seeds",
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "5 seeds.  My good friend TIHKAL on aya.com recommended 4, but my unconscious instinct is that an overdose is better than an underdose (consciously, of course, I know this is idiocy, and why my last few trips have been bummers)  I only ended up doing 2/3 or so, and the intensity was just right, so 3-4 is good advice. ",
  "Prep:",
  "put them in a pan, put the lid on, turned on the heat, and after the fifth pop (the seeds are flat, when you heat them they fill with air until they burst, like popcorn) I took the seeds, put them on a dish, and ground them up with a spoon, and added some baking soda (not quite a whole 1/4 teaspoon full, about 2 yopo to 1 soda ratio).  swished the stuff around gently and put the dish in the oven to drive off the water.  Resulting residue was scraped up, ground down again, and arranged in lines.  Snorting stuff has a definite rebel mystique to it, but it is also a pain in the ass.  It came out to about to a little over a dozen lines.  I made it through maybe 2/3 of them.  OW.  about five seconds after I stopped, I knew I didn't need to take any more.  I think the literature calls this a 'tryptamine alert'.  So I got myself a cough drop (I had a sore throat, and the post nasal drip tasted NASTY) and big glass of water and lay down in my solarium.  This is the end of the non-subjective report.  The plateau started at T+2, was over at T+15, was followed by 45 min. of decreasing hallucinations, and *checks clock* 15-20 min. of 'sober but damn I'm light-headed, euphoric, and disoriented' afterglow.",
  "I was lying on these matresses, and the stuff kicks in, T+2, as I said.  then I feel as if every single cell in my body is swelling, and worry that I didn't basify properly.  This fear doesn't last very long, as soon I feel as if every limb in my body is moving of its own volition.  I look down, and everything is fine, but the feeling persists.  Then the visuals turn on.  Not geometric patterning like I'm used to with Pedro or 'hoasca or shrooms, but streams of snaking lines covering everything, flowing towards me, flowing within me.  I got nauseous, which may have been from all of the yopo-laden snot falling down my throat into my stomach, although I'm 98% sure that M. Hostilis and P. Harmala have conditioned me to associate tripping with wanting to throw up, and that my nausea was imagined (or, better put, hallucinated).  I didn't throw up, although that and the huge amounts of mucus and snuff flowing out of my sinuses and down the back of my throat made the experience rather uncomfortable physically. ",
  "It was the first psychologically comfortable trip I've had in a while, though, and there are many benefits to being sober after an hour (those first fifteen minutes will draw themselves out, believe me). ",
  "Conclusions/further inquiry:",
  "1. Sedative effects.  Despite forgetting that I'd taken Aderall T(-2:00) (Don't tell me I'm dumb for doing that, I already am aware of my stupidity.  Side note: one reason I looked into Yopo was as an aya alternative with no MAOI effects), at about T0:40 I was exhausted.  May be my student lifestyle, but it was very sudden and very weird.",
  "2. Reducing the material. Without doing an extraction (I'm kitchen chemistry phobic), how can the amount of material that needs to be crammed up your nose be more manageable?  I've heard the seed covering doesn't contain much in the way of goodies, and it must have a lot of the fiber, so I'll try removing that.  Perhaps if a more efficient basifier than baking soda could be found, less plant material and less basifier could be used.  or if it were liquid, boiled off entirely.  chemists should work on that one.",
  "3. Smoking.  I'm not too interested in smoking this stuff, as it needs a high intensity flame, and you probably need to hold a whole bunch of it in your lungs for a while (DMT-style)."
 ],
 "erowid": {
  "id": "18371",
  "citation": " Melchior Immanuel. \"Yopo: Effective, But Not a Future Party Drug: experience with Anadenanthera colubrina (ID 18371)\". Erowid.org. Oct 22, 2002. erowid.org/exp/18371",
  "substance": "Anadenanthera colubrina",
  "views": "51989"
 }
}
