{
 "id": 2518,
 "title": "Unique Freshman Experiences",
 "date": {
  "submission": "2002-10-23T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Paganchica",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "Fall of 2001, Savannah, Georgia",
  "Names have been changed to protect the innocent",
  "I was walking down the street with my new friend, Nissa. Nissa and I had just met a few weeks ago when I had hitchhiked to Savannah to get away from the miserable college town that I lived in. We were waiting for her roommate who had left us stranded in the park when she handed me a pill. I knew that it was a roll and had always wanted to try one. I took it without looking at it (smart, huh?) and kept on walking down the street. Finally, we found our ride and we were on our way back to their apartment.",
  "For those who have never been to Savannah, the fog gets pretty thick at night. I sat in the truck bed with Nissa and Greg. I had never sat in the back of a truck so when the wind started to pound in my face, I was surprised. The bugs slapped my face so I looked down at Greg's head in my lap. After fifteen minutes (approx. 30 min after taking the pill), I looked up and felt a bug hit me in the face. All of a sudden. I realized that things looked surreal. I couldn't turn my head so all that I could see were the trucks headlights illuminating the surrounding fog. Things looked wavy and a bit out there. I screamed 'Holy shit!!!' over the roar of the wind and Nissa smiled. The warm wet air made my skin tingle all over and the feel of the bugs hitting my skin was no longer painful but almost expected. Dark's eratic driving didn't help the wavy feeling that i felt.",
  "When we reached the apartment, I could no longer walk properly. Dark picked me up and set me down on the ground. Dark ran into the house and said, 'stay there.' I looked at him and said, 'Where the hell am I going to go?' Nissa walked Greg and I inside and brought us both a cup of water. I wanted it but then again my throat wouldn't cooperate and I felt like I was trying to swallow a cool silk scarf. Dark grabbed me and Greg and drug us into the bathroom. The room was completely filled with steam. Greg picked me up and set me on the toilet (I am only 5'4 but I am curvy and muscular). I giggled when I saw him strain to pick me up. He set me on the toilet and ran his hands up and down my body while I had my hands on the bumpy ceiling. It felt like little feathers running all over my body. Then I jumped off the toilet and massaged him. Finally, we stepped out of the bathroom and I felt my whole body start to tingle. It was so much cooler out there that my body felt like a walking goose bump. I sat on the well-worn couch and enjoyed rubbing myself on the furniture. Greg grabbed me and kissed me. I spent the whole rest of the night kissing him until I fell asleep.",
  "I am not a huge advocate of drugs (seen one too many friends become strung out) but I liked this one. It was a nice experience and I have done it since. It was a great enhancement for meditation."
 ],
 "erowid": {
  "id": "18379",
  "citation": " Paganchica. \"Unique Freshman Experiences: experience with MDMA (Ecstasy) (ID 18379)\". Erowid.org. Oct 23, 2002. erowid.org/exp/18379",
  "substance": "MDMA (Ecstasy)",
  "views": "7664"
 }
}
