{
 "title": "Being a Kid Again",
 "author": "Jezebel in Hell",
 "citation": " Jezebel in Hell. \"Being a Kid Again: experience with Cactus (San Pedro) (ID 25229)\". Erowid.org. Jul 14, 2003. erowid.org/exp/25229",
 "substance": "Cactus (San Pedro)",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  "6 in",
  "oral",
  "Cacti - T. pachanoi",
  "(tea)"
 ],
 "report": "<p>I had been growing a San Pedro cactus for a little over six months. Me and the little guy had grown pretty close, but the day came when we both knew it was time for him to serve his purpose.  I took a 6' cutting and thoroughly despined it and removed it's outer skin.  The inner portion was chopped into small squares and it and all the goo scraped from the skin were thrown into a pot of distilled water.  I let the brew simmer for approximately two hours on very low heat, then removed it and let it cool before pouring it into a Sobe bottle.</p><p>The tea sat in my fridge for probably about two weeks, until the perfect night presented itself: The beginning of a three-day weekend, and the first snow of the winter.  Me and my best friend K decided to go sledding, and before we left I quickly drank my concoction.  It was surprisingly easy to get down, seeing as I have a horrible gag reflex and generally have to spend a half hour getting a glass of anything harsher than booze into my system.  No complaints of nausea either.  Guess my little buddy decided to take it easy on me.</p><p>K and I made a stop at Wal-mart to pick up cheap sleds, and I could feel the mescaline starting to kick in as we were walking through the parking lot.  I just felt elated that it was snowing, a feeling I haven't had since I was about eight years old.  I had to jump and slide on every single patch of ice, which amused K greatly.  I even got him to join me a few times (guess my enthusiasm was contagious). </p><p>There were no real problems interacting with society on a normal level as we walked through Wal-mart.  The only thing anyone would have found odd about me was the enormous smile on my face.  Visuals were pretty mild.  Everything seemed brighter and more colorful, but that was about it.  Kind of like a real mild mushroom trip.  I don't know if it was the visuals or the giddiness, but walking through the toy aisle to get to the sleds, I suddenly felt like a five-year-old with a credit card.  Once we got our sleds, K had to physically stop me from buying a $75.00 set of Legos, an RC car, and a cotton candy machine.  He did let me buy a can of silly string, and that was enough to get me grinning again.</p><p>We made our purchases without any strange looks from the cashier (always a good sign when tripping in a supermarket), but then I HAD to stop and get a gumball out of the musical gumball machine.  It was one of those new fangled machines that sends your gumball through a labyrinth of gears and slides and such before it dispenses it to you, and I of course had to pump 5 quarters into it before K dragged me out to the car.</p><p>On the drive to our designated sledding spot I was so excited that I was bouncing up and down in my seat.  K kept looking at me, then grinning and shaking his head, but I knew he was wishing he was tripping with me.  When we finally arrived we raced up the hill and sledded for about an hour and a half.  I remember feeling my hands and toes going numb, but just needing to go down that hill again and again.  This is, once again, something I equate to being a very small child.  K, being the sober one, eventually decided we were going to get hypothermia if we didn't go home soon, so he packed up our sleds and drove back to our apartment.</p><p>By the time we got home I was starting to come down.  Visuals were pretty much gone, but I still felt that sense of happiness and contentment very strongly.  K and I stayed up talking and listening to music for about another four hours, then we both retired to our seperate rooms and fell asleep. </p><p>Woke up the next day without the slightest sign of a hangover.  Had to fight off the urge to brew up the rest of my little cactus and take it immediately because I had felt so wonderful the night before.  I think next time I try it I'll do a slightly larger dose, as I got only very mild visuals, and none of my usual introspective trip thoughts.  I will definitely be doing small doses again though.  The chance to view the world through the eyes of a six-year-old with all the knowledge of someone in their early twenties is truly beautiful and amazing.</p>",
 "year": "2002",
 "id": "25229",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-07-14T07:00:00.000Z",
 "views": "11196",
 "dose": {}
}
