{
 "id": 2523,
 "title": "Expanded Consciousness Defined",
 "date": {
  "submission": "2005-08-03T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jebus of the Toad",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.0",
    "quantity": "2.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "g",
    "grams": "1.0",
    "quantity": "1.0"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "My  story actually begins two weeks before this trip. I was going to go see Lord of the Rings on mushrooms, but when I got there it was sold out and I had already eaten the mushrooms! Oh well, the night was fun anyway.",
  "So this time I made sure I was going to get in. I decided to go with my friend right after school, so there would be no line up. I skipped last period (about 1:45 before the movie was supposed to start) and went home. I ate my two grams slowly, breaking off little pieces at a time. This, I've found, is the best way to take them, if you can stand/like the taste. I love the taste :). It took me about fifteen minutes to eat the two grams and then I sat around for half an hour watching TV. When I had an hour to go before the movie, I went outside and spent some time smoking my gram and then walking to the theatre. By the time I got to the theatre (about fifteen minutes before the movie was to start) I was feeling nice and high from the pot, with the mushrooms just starting to kick in.",
  "Then about a third of the way through the movie, the mushrooms came on slowly. Reality started losing its grip. So many thoughts went through my mind that it would be impossible to record them all. Time slowed down to a crawl. The entire trip seemed to last days, when it only lasted until the end of the movie. Eventually I thought that the theatre was the inside of my head and everyone in it was part of my imagination, and I was seeing out into reality (the movie). The screen began to change. It stretched and morphed. Characters' faces flowed like liquid, a whole range of hallucinations came and went. Then something incredible happened. I obtained a higher level of consciousness. The world around me became unreal, unimportant. The five senses became unimportant. I was beyond them. I was conscious of everything without having to sense it. I closed my eyes and could still 'see' everything happening on the screen. It was as though the human body and it's 'senses' were nothing but a filter, allowing only so much through to the consciousness. I lost all fear of death on this plane of existence, because I knew there was so much more beyond it. I wanted to leave this place, because it was no longer real. I felt as if I were a white ball of blinding light, consciousness, pure and expanding with every minute. I experienced much more than the five senses, I could fell another person's emotions and desires. (sometime during this, the big battles scene with Sauron was replayedthere was a FLOOD of thoughts from the people and orcs on the screen).",
  "I journeyed to several places in my mind (too many to list). Books that I read, childhood memories, fantasies, they were all rushing through my head, but I was not simply a passive observer, I encompassed everything that was happening, I was a part of everything. I could control everything, but I could also set up a scenario and let it play out, with no knowledge of what was to happen. I was an ultimate being of knowledge and understanding. And I was not alone. I felt another consciousness out there, calling to me. We were as two strings wishing to be entwined. I yearned to be joined with this consciousness. I thought then that I'd gotten trapped in this mortal world and that the other consciousness had set up the scenario for me to eat the mushrooms so that I could be 'called back' to the outside world. I felt as though I could just slip out of the mortal world, back to where I belonged, so I could be with this other consciousness. But I was afraid. I regained a little bit of rational thinking and was afraid that if I 'stepped over' I would really send my self into a coma or something and that this was all in my head. But it was all still real enough for me to ponder the question for a long while. I also at this point had no idea how my mind would be able to revert back to normal, after being enlightened as it had. How would I be able to comprehend the world as it was if I chose to stay here? I decided to stay in this world and see what would happen. Minutes after I made this decision the movie ended, the lights came on and I was back in reality. The sudden and complete transition was shocking in its lack of effect. Although a bit disoriented, my mind was nicely back in reality.",
  "I'm sorry this was so long, but I don't know anyone who has taken a trip anything like that, so I thought I'd be thorough. I am writing this about six months after it happened. I still feel as though there is something more after this life, though I don't feel in any hurry to leave this world. There is infinite time :). I just wish that everyone could have experienced what I did. I think it would be beneficial."
 ],
 "erowid": {
  "id": "18397",
  "citation": " Jebus of the Toad. \"Expanded Consciousness Defined: experience with Mushrooms (ID 18397)\". Erowid.org. Aug 3, 2005. erowid.org/exp/18397",
  "substance": "Mushrooms",
  "views": "3168"
 }
}
