{
 "id": 2524,
 "title": "Day Of Initiation",
 "date": {
  "submission": "2002-10-24T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fr Moonwatcher 343",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.5",
    "unit": "mg"
   },
   "substance": "DOI",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "T: Dosage was administered relatively early Friday night.  Preperation was an hour and a half divided equally between hatha yoga and Tibetan diety meditation.",
  "T+1:30: Three hours can be a while to wait.  We decide to watch a movie, Meetings with Remarkable Men.  Good movie on mysticism.",
  "T+3:30: Movie ends we're going pretty strong, spend a few hours talking.  There's a strong sensation of moving sideways.  Shulgin had talked about this, now I know what he meant.  Other than that, it's a pretty minor psychedelic.  Very gorgeous in it's subtlety however.  Time is really weird now.",
  "T+6: Starting to feel incredibly exhausted, coffee helps to level me out.  Spend the next 5 hours playing some of the best chess I've ever played.  Things are really clear.  I'm learning incredible things about the game.",
  "T+11: Take a perk to ease the comedown.  Seems to help a lot.",
  "T+12: I take a few bong hits.  Very interesting.  The sideways motion sensation has returned along with the most intense auditory hallucinations I've ever experienced.",
  "T+13:  I take a short nap.  Maybe 15 minutes, very rejuvinating.  Very dream filled.",
  "T+13:30:  It's morning now.  I do my daily practice.  Hatha and diety yoga.  Hatha yoga goes really well.  My body is very relaxed.  I'm more flexible then normal.  The diety yoga was mindblowing.  It added a wonderful spiritual glow to the rest of the day.",
  "T+16:  I travel a few towns over to witness initiations into one of my orders.  I really hope I'll be able to crash.  The 45 minute drive is a bit stressful, but completely doable.  I've still got a good buzz, analogous to a speedy Gang.",
  "T+20:  When the inits start up I go back up.  Esoteric imagery really seems to make this stuff shine.  Deep, intense experiences here.",
  "T+24:  Drinking seems to ease the sleep dep symptoms.  I have a few beers and hang out for another 4-6 hours before passing out.",
  "T+34:  Next morning, Sunday.  Still going very slightly.  Well rested and in a good headspace.  I go home spend the rest of the day napping, not sure when exactly it ended."
 ],
 "erowid": {
  "id": "18398",
  "citation": " Fr Moonwatcher 343. \"Day Of Initiation: experience with DOI (ID 18398)\". Erowid.org. Oct 24, 2002. erowid.org/exp/18398",
  "substance": "DOI",
  "views": "16946"
 }
}
