{
 "title": "This was NOT Fun...",
 "author": "Crying Wolf",
 "citation": " Crying Wolf. \"This was NOT Fun...: experience with Salvia divinorum (5x extract) (ID 25266)\". Erowid.org. Jul 15, 2003. erowid.org/exp/25266",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "154 lb",
 "report": "<p>Yesterday evening I decided to try my first attempt. I sat on my back lawn with a pipe and torch lighter. Took one, deep hit, held it for 30 seconds, did the second hit and BAM!!! I was in deep trouble. Every time my heart beat, it was like every muscle in my body was getting electoshock. I could see my limbs jerking. My head 'felt' like it looked like a half deflated, pushed in basketball. SOunds and thoughts just repeated over and over in my head like a skipping record. And I was SWEATING BULLETS. I could see my dogs watching me and they were getting agitated, which only reinforced in my mind that my body was somehow physically distorting and freaking them out. I started to panic and tried to get up and sort of just careened across the lawn (thank god I wasn't in the house) but did finally make it to a chair. About this time, the really violent effects were wearing off and I was just sweating and sort of dazed. Then--nothing. It was like, after this first, 30 second ass-kicking, there was nothing following. I then tried the chewing method for an hour or so, but still really felt no additional effects.</p><p>I was not pleased with the experience; ironically though, I feel really good today, better psychologically than I have in a long time (I suffer from depression and anxiety and have been on Paxil and Celexa over the last few years, but not currently). I will most likely continue to experiment, but with less powerful methods of smoking the 5X. That was just too intense and unpleasant. But I will most likely try to find a comfortable method/dosage.</p>",
 "year": "2003",
 "id": "25266",
 "gender": "Male",
 "timestamp": "2003-07-15T07:00:00.000Z",
 "views": "8205",
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
