{
 "title": "To Put a Long Story Short, I'm You",
 "author": "Caleb",
 "citation": " Caleb. \"To Put a Long Story Short, I'm You: experience with Mushrooms (ID 25272)\". Erowid.org. Apr 12, 2006. erowid.org/exp/25272",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Mushrooms",
  "",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>So, this one time, I went to visit some old friends and do some drugging.</p><p>I was 19 at the time, and it was the end of december. that part's not terribly important. well, maybe it is. anywho, the important part is that at the time, my life was in a pretty stable position, I thought. this is because at the time, I was undergoing the highest degree of stability my life had seen since it had become my own.</p><p>of my own volition, I had been working at the same place for about six months (the same place where I work now) and had been living in the same place (the same place I live now) for about seven. I had also been regularly practicing a musical instrument for a few months by this point. this was something that I had been kind of planning on doing for about a lifetime before then but had never met the proper circumstances for it until that point. through a combination of my post-quitting-school intellectual endeavors (I didn't start to read until I stopped going to school) and newfound capacity for the fulfillment of daily responsibilities, I was able to learn about and maintain one form of life well enough  for long enough to yield me a cheap car and an extremely hazy month of december (and thats all Im gonna say about that).</p><p>other factors for the illusory concrescence of my ego at the time?</p><p>well, I had given up the alcoholism thing for about a year by that point, which I thought to be quite an accomplishment. separation from something that is acknowledged to find its effect by decreasing one's capacity for the objective awareness of one's self and one's environment can in turn give a false sense of security in one's currently acknowledged view of self and environment and the relationships between the two. in short, realizing that 'habitually drinking makes me stupid' had a capacity to produce a notion of 'habitually not drinking makes me smart', which isn't necessarily true, but was enough of a truth for me at the time to provide me some sort of direction to follow along.</p><p>and that direction was turning out to be quite a pleasant path of cementing myself into existence and establishing my individual self all over again. by this point, my first year of actualizing my self into what I thought I wanted to be was drawing to a close, and I felt like I was finally beginning to take shape as the individual that I was supposed to be. to me, at the time, I was turning myself into a quickly budding musician who found great interest in the investigation of whatever information he could find regarding the world of drugs and religion. this is because my life up to that point had been most greatly affected by the pervading forces of drugs, music, and religion.</p><p>drugs because I'm naturally (read: genetically) attracted to the altered states that they bring about; music because of its ability to captivate my attention and guide my experience; religion because it remained a complete mystery to me, as I had been exposed to (birthed by?) plenty of believers, but never seen anything out of the ordinary that I could believe in.</p><p>so, there I was, agnostically workin a steady job, eatin steady food, playin a steady beat, smokin steady greens, doin steady amounts of thinkin, havin a steady supply of cigarettes, and takin in steady amounts of words. I was a completely different person than I had been a year before, and I felt extremely secure in all of it.</p><p>well, I had some time off from work for christmas and new year's eve, so I figured I might as well go engage in some chemically-induced retardation with some friends from high school. one of my closer friends whom I had formed much of my alcoholism around in high school was enjoying a birthday on the occasion in question, so that gave further reason to get intoxicated. with my newly secured personality, what better to do than go get totally fucked up in a different town with some good friends that Im already accustomed to getting fucked up with? hell, I might even get laid. c'mon, it's not like I'm gonna die or somethin if I go up there...</p><p>oh wait, yeah, that's what happened, I died, or something.</p><p>because I thought I knew who I was, because of the distortions still in place in the way I viewed my self in relation to everything else, because I had disregarded the notion of my existence being seated in a  contingency, I went to austin for new year's eve and I think I fucking died.</p><p>so, I mentioned something about having thought that I may have died at some point in my past.</p><p>sounds impossible, seein as how I'm alive now, right?</p><p>yeah, it does.</p><p>to my ears it even sounds impossible, and I'm the one saying it.</p><p>so, given that, I should likely comb through my memory once more so as to gain some further recollection of how it's possible that I died that night in austin. seeing as how that event has had a great deal to do with the composition of the lens through which I view the world, that memory exercise will hopefully shed a bit of light on how it's possible that I view things as I view them now. there doesn't seem to be a much better way to reach a worthy assessment of the validity of my perspective as it currently exists than to carefully examine the more profound events from which it has been derived through the medium of language.</p><p>and if there is a better way, hopefully I will some day have the capacity to understand it, because this way sure does feel like a whole lot of linguistic masturbation (although, I know deep down that I'm not masturbating here, I'm makin love with my self).</p><p>anyway, the first night we're in austin, we're hanging out at the apartment. not much to do besides sit around and wait on other people while other people wait on phone calls. there isnt much planned for the evening other than visiting with old friends and possibly making some new acquaintances dependant upon who decides to randomly show up. well, that, and our host was waiting for a special friend to arrive so that he could make a healthy purchase of what was to be divided amongst us as our entertainment for the evening, something which may carry us along through the night so that we won't have to go out anywhere on our first evening in town. I might also mention that this was something that a couple of us there (myself included) had a very fleeting if not nonexistant familiarity with, but had a good bit of familiarity with things purported to be similar in their effects (which are, now that I can see more clearly, greatly dissimilar in very important ways).</p><p>the guy eventually gets there to do his thing and hang out for a little while, just long enough to witness the ritual of 'who gets how much, how much does who need to take at once?' that tends to precede nights such as this one. well, it was a good thing he was there, because had he not offered his opinion, I likely would have dosed myself lower. in fact, based on the words of the man that the stuff came from regarding how much he was comfortable with doing at once out of this batch as compared to other batches, I increased my dosage by slightly more than a third of what I had originally planned. so, the dude leaves, and we all decide it's time to start our fun.</p><p>down the hatch.</p><p>here we are, fifteen minutes later, sitting on the couch. the initial restlessness of waiting for something to take effect having been subdued by certain mood-stabilizing agents, any new sensation from here on out is directly related to what I did fifteen minutes ago. I should remember this, but I won't, because one of those sensations is the sense of forgetting all about anything not immediately at hand so that I'll then be forced to remember it all over again.</p><p>a general feeling of resltessness resumes its mounting in my limbs. each new sitting position seems just a little better than the last one, but not quite as good as the next one that I'll be sitting in just as soon as I change my position just one more time. it's a dry thirty degrees or so outside, and people are going in and out of the apartment with frequency to smoke cigarettes. because of this, a pocket of cold air would periodically move through the living room where I'm seated. brrr...</p><p>...that one made me shiver. oh, wait, did someone just open the door, or was that just me? hmm. can't quite tell. did the cold go away yet? if so, then someone probably just opened and shut the door. um, now that I think about it, I still feel pretty cold. is it just that cold in here?</p><p>was the heater turned off at some point?</p><p>as I pay closer and closer attention to my body temperature, I can feel the shivering</p><p>run deeper and deeper,</p><p>through my exterior flesh,</p><p>conditioning the contents of my blood,</p><p>resonating deeply into my bones,</p><p>orienting the elementary particles of my being</p><p>into atoms</p><p>into molecules</p><p>into macromolecules</p><p>into cells</p><p>into tissues</p><p>into organs</p><p>into an organism;</p><p>a deeply penetrating, sharp vibration,</p><p>increasing in magnitude with each cycle of attention,</p><p>a conglomerate of all its precedent forms extant since its realization,</p><p>unified in their vibrating experience of...</p><p>what was I thinking about again?</p><p>...if somebody did turn off the heater, then that's pretty fuckin stupid, it's cold as shit out there and makin me freeze in here. out where? outside over there, through that door that's....just done being opened, and in the process of being closed. wow. did all of that happen in the time that it took someone to open and close the door to go outside and enjoy a cigarette? and it's only been fifteen minutes since we decided to leave baseline, you say? oh, what an evening we must be in for.</p><p>here I am, completely mystified by what's happening inside of me,</p><p>wishing only for a way to somehow relate it all to one of these other, smiling, spirit-reflection machines, biological robots designed for the purpose of resonating the essential nature of whatever they take into themselves,</p><p>adorning the room around me, realizing that my capacity for linguistic expression has completely escaped me as I can no longer remember how to coordinate the movements of my mouth to the movements of my larynx, which I can't remember how to coordinate to the movement of my diaphragm, which I cannot, for the life of me, seem to coordinate to the overflowing shitstream of language dashing around in my head...</p><p>So, any attempts to speak end up rendered as 'hey...mh..rp...wha-...shit...I have no idea what's going on right now (this is a phrase I still manage to fire off from the most altered of states; it requires no thought to release).'</p><p>At this point, I feel for some reason that it is important to smile, even though a smile would not at all reflect what I would have evaluated my interior at the time to represent. but, nobody will think I'm having a bad time if I'm smiling, and maybe I'll trick myself into thinking this is somehow fun. speaking of time, it seems to have lost its meaning. or, rather, time seems to have lost its limiting grip on the process of reality, the waning of its power allowing much more than just the information at present to occupy my experience of the room around me.</p><p>'this is too much,' I think to myself, amidst a legion of door-knocks, an orchestra of telephone rings, and an unending ocean of gibberish and jargon and popping and clicking from the unfamiliar monkeys in the room surrounding me, all undergoing a lysis of locality which I find confusing to no end.</p><p>what if I become nauseated?</p><p>would that mean that I'm nauseous?</p><p>I hope not.</p><p>what if I have a seizure?</p><p>what if my brain accidentally tells my heart to stop?</p><p>or forces it to work itself into arrest?</p><p>let's smoke some of this green stuff, it seems like that should keep the nasuea at bay, not to mention take out some stress from the situation, at least.</p><p>woah...everything from before, times a thousand, minus the immediate urge to puke.</p><p>oh wait, scratch that, there's the nausea again. I must stabilize myself now.</p><p>How to accomplish this? maybe with my breath. that is, after all, what makes everything go, so taking control of that would allow me the control I need to maybe offer up some stability 'round here. breathe, breathe, steady, breathe. only problem is, my breath wasn't steady. or, if it was steady, I was steadily breathing too deeply, too frequently. I was likely taking in waaay too much oxygen, and thus stimulating the hell out of whatever process was occurring in my body that I had been initially trying to transcend through controlled breathing in the first place.</p><p>oh boy.</p><p>with every breath, my experience of the apartment around me would disintegrate into brightly colored, organically structured, kaleidoscopic vomit. this disintegration occurred accordingly to what seemed to be discrete, albeit supremely chaotic mathematical principles. the perceived area around me would dissolve into itself this way, only to immediately reintegrate the parts that had moments ago fallen away, reorganizing the room back into something similar to what it had been just before its magical act of moment-to-moment self transformation.</p><p>each time it occurred, a greater and greater percentage of my conscious experience would be involved in this disintegration. it was almost like there was a bubble around me, protecting me from dissolution, but steadily closing in on me, the interior space holding my little island of reality together so that I could use it as a lens through which to experience the whirling void surrounding it. and with each dis- and re- integration came a feeling that the area which I was viewing from, the center of my universe, was in greater and greater peril of being assimilated into this exploding ritual that existence had begun to perform on itself.</p><p>I was to be swallowed by the world, and all that I had previously been and known to be would be shat into the vacuum that exists between the frames of my existence. it would take less than a jiffy to happen. literally.</p><p>one more breath and I can feel this force of disintegration drilling into my body from every point of contact with its so-called environment, licking each node in my neural network with the sandpaper tongue of a porpoise. a wave rushes through me, I feel the biological tapestry of my body unraveled mercilessly by the timeless hands of nothing, all order inherent to my being stripped away to the point that my cells are no longer cells, no longer atoms, nor particles, but absolute nothingness.</p><p>then, woop, back in my seat, in the living room.</p><p>it's still been less than an 'hour' of 'time' since whatever the hell it was that happened earlier, whatever it was that's vaguely related to where I am right now, but it seems like it was so long ago that it doesn't matter to the point that it may as well have not even happened.</p><p>anyway, there are people around me whom I do not recognize, there is media being blasted at me from a glass screen which I cannot hope to comprehend, and I can't figure out what color the room is, much less what it is that's making me feel like Im dying right now. all I know is that for my sake and for the sake of everyone else, I had better go in the other room by myself for a while, just in case things get any uglier than they already are (which, they inevitably will, but not forever).</p><p>so, there I go, into a dark bedroom to lie down and see if I can't sort out at least an inkling of what's going on right now. and that's just what I needed, to go lie down in the silent darkness, in order to ensure the totality of my disintegration from reality as I had previously known it. so that's when I did it. I curled up with my self in that bed and we dove headfirst into the abyss of the timeless, killing for me all that I had been previous to that event, drowning in a sea of my own chaotically blank reality, crossing the event horizon that is the ultimate act of life, death.</p><p>and so then, after all of the confusion and wonder and pain and awe of finding the proper place to do it, I lied down and waited for death.</p><p>What was it like, you say? well, I would want to say that it was beautiful, but I'll leave that part of the story for later.</p><p>For some reason, I find myself walking into a bedroom whose familiarity is fleeting, at best. I've seen it once or twice before for a brief minute or two in the light provided by the wall switch and central light fixture complex, but didn't pay it much heed outside of a quick structural examination. there is no light on now, but I know that there is a bed in front of me, a place where I may hope for comfort. I can reach it if only I can determine how to continue moving in a straight line upon entering the room.</p><p>but what's a straight line?</p><p>am I really moving in that straight of a line?</p><p>Could the path being taken by the elements of material reality currently captivated by my immediate attention not be better described as something else? possibly some sort of infinitely complicated fractal spiral? how can I continue to do something of which I have now become unsure whether or not it was possible for me to have been doing in the first place?</p><p>Walk in a straight line, my ass. there are no straight lines. just curving, curving, curving, in, out, around, topward, upout, inways, onneath, alward, everywhere. alright, let's just breathe, breathe, breathe.</p><p>Ok, now, we're walking into the room, and there are no lights on. this is welcome. I do not need the lights, for I no longer wish to see. I feel as though I've seen enough. I'm overflowing. I'm sick with vision. I am drowning in the light which I have willfully brought into myself, and it pains me in an indescribable way to give awareness to the notion that I maybe put something inside of me that I maybe would rather have not put in there, thinking I'd engage in some self love only to be presented with strong urges toward autodecompilation, but I just don't know.</p><p>why don't I know?</p><p>I must have wanted this to happen, at some point, on some level, otherwise I wouldn't have put it in there, right? so let's not lose any of it by doing something stupid like barfing it all up on the floor, ok? it probably hasn't even reached its peak yet, you're just a pussy.</p><p>But, it feels like the part of my brain that's required for encoding visual memory is begging me to just go lie the fuck down and black out all this light,</p><p>For the love of all that's not a migraine,</p><p>We're running out of circuitry to work with, ripping and expanding my brain like some muscle atrophied by a lifetime of disuse. we need a review break, a time for some cellular growth, for this course is too rigorous. I'm going in here to see if I can't somehow just sleep through this nastiness, wake up in the morning and shit it out the various pores of my being.</p><p>But, wait, so, I don't want to puke it up and risk missing out on the totality of my experience that I have so diligently sought, but I do want to hold it in while I go unconscious, skipping over the part that I've fought so desperately with my self to secure? what a beautiful juxtaposition of desires.</p><p>and why did I call it nastiness?</p><p>maybe I'll know in a few hours. what the fuck is a few hours?</p><p>god, I don't know, a few hours just seems like words to me. do they refer to anything I can directly experience at this point?</p><p>hardly.</p><p>then how the fuck am I going to get past this thing if I can't shift my experience in a chronologically describable fashion? I can't possibly see to a time when this will no longer be as it is, because I cannot see time. well, I have brief glimpses, moments that amass themselves from out of the atemporally swirling light, taking form to give me the illusion of the sequential darkness which I seek by method of this clumsy investigation of what I think might in some foreign tongue of which I currently have no controlling grasp be called a 'beh drume.'</p><p>surely I will meet my eternity within these walls, surely there is no escape other than to escape the life within my body.</p><p>there seems to be an impending transcendence of process, and it seems I should likely not be standing when it arrives, so as to avoid injury to my falling corpse. as I shuffle my feet, I can feel myself wading through a puddle of objects, items randomly strewn about the floor of the room, becoming a part of my past as I slide them out of my future with a quick flip of the ankle. holding my arms in front of me, I clumsily feel out the darkness in hopes of somehow gauging the imminence of the bed in which I hope to forever find soft, comforting warmth. I feel the air move out of (around?) my way as though it were some continuous veil from which I cannot conceive to escape. it permeates my being with every diaphragmic rhythm, fuelling my process, ensuring the continuation of all this, this, whatever it is.</p><p>I just want to be able to remember whatever it was that I used to be, to be back wherever I was before I so naively pried open this fissure in my reality.</p><p>I yearn for the comforting womb of ordered, monkey experience with its placental earth from which I am currently being excavated. I hope to god that I will find reentry to that womb upon finding the comforts inherent to this bed, but that hope is nothing more than illusion, because I wouldn't allow me to miss my self for the world. I'll also determine that there is no comfort inherent to a bed, nor is there nastiness inherent to an experience. I'll know this because I'll know that these are not essential constituents of anything, but simply words, sequences of artifacts resonating with their usage the world-at-large as experienced by their creators. these art forms are manifested by humans and projected onto their experiences for the sake of better understanding themselves, and nothing more. that, however, is not to devalue the utility of language, for without these inexact expressions it would be impossible to resolve the truths of the experiences which they dare to represent. when using them, I'll just have to remember that, uh, something I forgot.</p><p>I told myself I wouldn't write about anything else until I was finished with the current portion of this narrative.</p><p>however, every time I think I would like to continue in my description, I am inevitably derailed by the confusion in which my mind has entangled those memories. while certain ideas and occurrences  from the period with which I'm having such difficulty can be loaded into my imaginative memory, there is no sequence in which to lay those events.</p><p>this is because in those memories, experiential time does not operate in the ordinary sequential fashion that we're used to but rather seems to operate in a fairly arbitrary and difficult to understand way. establishing a context in which to describe these phenomena seems an impossibility under the rule of 'normal' spacio-temporal behavior. nevertheless, here we go in trying to put into words what is, as someone once described it, unenglishable.</p><p>there I am, bed below me, ceiling above.</p><p>darkness surrounds me, whipping about faster than (just as fast as?) I can see, moving accordingly to the attention of my visual field in order to alert me of the powerful presence of nonexistence. a ribbon of inky nothingness pours into the space around me, flooding the room with its lack of being, washing through every shift and becoming every object of my decreasingly valuable ocular gaze.</p><p>bodilessness.</p><p>out of this nothing? something!</p><p>rushing.</p><p>stars.</p><p>bodies of colored gas.</p><p>fission.</p><p>water.</p><p>I am flying at the speed of light.</p><p>terrestrial landscapes.</p><p>culture.</p><p>geometry.</p><p>entropy.</p><p>collapsing.</p><p>union.</p><p>lonliness?</p><p>solitude.</p><p>oscillation.</p><p>Moving across my self at the speed of light, I stay where I am.  I am the black hole at the center of my universe, allowing no light to escape, observing with the unendingly keen eye of my extreme density the entirety of existence as it passes through me into a microcosm of itself. I am awash in a sea of pink. I am a wave in a sea of pink. I am a sea of pink, my waves energetically peaking and troughing in order to wash my self, in order to cleanse it of me.</p><p>it becomes increasingly difficult to describe an experience which does not suit the senses provided by my current architecture.</p><p>barely able to realize the infinite possibility of the moment in which I find myself, a desire not available outside of this sphere springs forth from god knows where. in no time, a panoptical view of my surrounding environment is verbally requested via telepathic means.</p><p>I think Id like to see in all directions, please.</p><p>and so it is done, but not without a headache. if I were able to conceptualize the existence of my brain at the time, I would likely have labeled it 'full' (which, I guess would be an apt term, if the universe did in fact put all of itself in there like I asked it to). I am quite literally up to my eyeballs in information.</p><p>however, at the point of experiencing this plenum, I have no method of encoding into my memory any translation of it that I can hope to reach. so, it's all just the art of the universe to me, to be viewed by me as its patron but not understood by me as its creator.</p><p>not yet, anyway.</p><p>so, I take back with me my lack of understanding of this infinity which I have invoked in myself. I take it with me unwillingly, desiring to understand more. my newfound contentment with and desire for nonexistence in the physical sense is 'rewarded' with a mental message that it's not time for that yet, and that for some reason, there is somewhere else that I should be.</p><p>as though I'd been kicked backwards by god down some light-years long spiral slide through the pink ocean of my self, I am thrust out of my image of eternity, back into the alien being of corporeal form. I am thrown back behind a visage which I, by this point in my experience, denounce as a completely foreign ordeal whose very mechanics are preposterous, at best. it disgusts me to be thrown back into such a limited frame. but why? it seems like only yestermoment that I wanted nothing more than to escape the pain of psychological fission and be back in control of 'my' body. but this doesn't feel like mine, at least, this isn't the body that I left before. it's not the same, and I can't say how. or did I leave? I just can't figure it out. what is a body, anyway? is it really the same thing from moment to moment? if it's not, then how can I say that I've come back?</p><p>but wait, was I maybe in two places at once, experiencing two different versions of reality simultaneously during the same segment of natural time?</p><p>after an extensive period of careful examination, the memories contained within the brain computer that I'm currently operating within this human body suggest something quite peculiar. my memory suggests that concurrently with all which I have just described, I was also in 'normal' space and time, interacting very peculiarly with the things in my environment. it seems almost as though the vital principle of my experience was experiencing parallel versions of reality simultaneously. bilocation seems the most logical answer to the question of how it's possible that I seem to have two sets of experiential memory derived from the same period of time.</p><p>multilocal experience, eh?</p><p>how the fuck did I manage to think that? that doesn't sound like it makes much sense. Im sure there are plenty of reasons why its probably bullshit. but for now, I'm just going on that paradigm when describing this experience to myself because so far it's been the best concept to hold in mind when trying to determine the contents of my memory. the idea that there are (at least) two (or more) bodies of experience communicating with each other in order to compile the collective 'me' just seems to fit with what happened in that bedroom.</p><p>as far as how my psyche would be fragmented in order to sustain such an experience, there would be two (kinds of) parts. one part would exist within the constraints of the ordinary passage of time while manifesting its intent onto its perceived environment through the medium of physical activity. the other part would then supercede time for the sake of total information access and thus the ability to guide the behavior of the temporally oriented part of my perspective to the extent that communication between them can be established. up until that night, I had been only aware of the former of the two, the materially bound aspect of my self. previous to that point I had defined my existence as only that which is made available to the time-bound me. thus, I was totally unprepared for the revelation that I might have a twin that is also a division of me, a doubled half of myself, so to speak, existing atemporally and giving me clues (epiphanies?) as to how I should be acting within the constraints of time.</p><p>I was especially unprepared for this revelation to come in the form of a complete role-reversal between these apparently conscious and unconscious aspects of my being; the conscious part being the sentience accustomed to dealing with the type of experience provided by time-controlled corporeal form, and the unconscious part being that which is accustomed to experiencing the world as a singularity.</p><p>nevertheless, the more I go over it with my mind, that's the way it seems more and more likely to have happened. so, if the conscious part of me has slipped into the world usually navigated by the unconscious part, it only seems natural that concurrently with that the element of myself navigating my physical body (the region generally navigated by the conscious part of my will)  would have been the part of my will that generally operates unconsciously.</p><p>so, there's caleb, lying on the bed, his body being populated by a spirit which has only known no time and is therefore very alienated in its experience of such a phenomena. the intellectual facility of this spirit is suited for operating within the concrescence of infinity, so over complication of the operations of a monkey robot upon existence as such is unavoidable. it takes careful examination of the inner workings of this creature, telepathically outlining each of its potentials. every neuron is fired, every connection exploited, every possible thought, feeling, memory, and every possible path between them traversed, every facet of my neurology laid bare for the perusal of some hyperspacial puppeteer who just wants to know how the hell to work this thing. or, at least, it wants to know how the hell this thing has been working itself.</p><p>it wants to know how this thing works itself so that it can appease these other bodies, things assumed to be somewhat like it, who've managed to work their way into the room. they turn on the lights and beam messages at me to which their facial expressions seem to beg responses. but they can't possibly be decoded and responded to properly until the methods of this machine's operations are fully elucidated.</p><p>other reasons for this thoroughly analytical combing of my insides?</p><p>well, aside from the appeasement and subsequent going-awayness of these other entities, I can only assume that if the duty of my unconscious self is to guide me in my conscious endeavors and my unconscious self were given a romp in the body generally occupied by my conscious self then it would follow that the unconscious mind would want to learn as much as possible about the mechanics of such a body in order to better guide the master of its behavior once normality is returned and it can get back to playing the role of existential advisory.</p><p>that's why it's doing what it's doing, I think.</p><p>caleb writhes symptomatically, and caleb's writhing garnishes the attention of the others. it wishes they would all go away so it may continue with a more focused examination of this body's machinations, which they would gladly do if only it would use caleb's mouth as a medium of communication and just ask. but it can't ask without first figuring out how, and it can't figure out how when it's being bombarded by these other presences.</p><p>they want to know that everything is ok, so that they may leave it alone, but it cannot make any assertions as to the ok-ness of its being. or, rather, it knows that it is ok, and knows that they should know this, but doesn't know how to find the proper expression of this state. in trying to devise a method for the conveyance of this lack of need for alert, a game of 'point toward object, queue up the last linguistically-oriented neurological mechanism associated with said object, execute language,' is begun. in turn, this yields a spookily hilarious scenario of caleb's body, possessed by the all-knowing, pointing at people and things in the room and spouting arbitrarily associated gibberish as if to say, see, Im fine, you can go now. what a sight it must have been.</p><p>the inefficacy of these verbalizations soon becomes apparent, and it decides the best course of action would be to disregard their presence to the best of its ability and to continue its corporeal investigation regardless of their continued occupation of the immediate airspace. the waning of its attention given to them ensures the waning of their attention given to it, and eventually it is left alone to continue its work. but, the light is still on. it should be off. no matter, it's figured out enough of how this monkey robot works to be able to stand up and turn off a light, right? well, what's the difference between 'turn off' and 'disable', anyhow?</p><p>so, yeah, 'I' broke the light. sorry.</p><p>so, anyway, all exterior distractions having been sufficiently vanquished for the time being, my unconscious self, controlling the monkey that they often call caleb, decides to lie the body back down and make its departure, allowing my consciousness to return from its little 'vacation'. well, it seems as though coming back would be a nice break from all the confusion. it couldn't possibly be more confusing than what was just happening, could it?</p><p>well, there happened to be two beds in the room with me at the time, on consecutive walls, lined up in sort of an 'L' shape with each other, but with a few feet between them so as to be 'across the room' from each other. when the 'possession', if you will, of my body was taking place, the body stood up at one point in order to turn off the light. this action was clumsy, to say the least. the ultimately confusing effect of this action is that when my body lied back down, it unwittingly lied down in the bed opposite the bed it had been lying in previous to turning the light back off. imagine my confusion upon reentry to a human body, finding myself not in the same place (the room looks totally different from the other side, keep in mind) that I had previously left.</p><p>it was as though I had entered the white rabbits hole, been through wonderland and returned unscathed to the wrong reality.</p><p>I triumphantly passed through the port which I'd so diligently sought for a way home, only to realize that the gate that I had just 'returned through' wasn't the same as the exit I had originally taken.</p><p>fuck.</p><p>then where am I? I know this seems like the 'normal' world that I left behind before with similarly observable rules and order, but it seems fundamentally different in a way that's making me have to rearrange (invent?) my entire cosmology, making me have to restructure the medium through which I gain cognizance of the order of the universe, making me entirely skeptical of the reality of anything around me, including myself. paranoia grips me. I do not know who I am, where I am, or what I am becoming, and it all seems like I'm stuck in a dream with no characters or plot other than myself and whatever comes to mind.</p><p>am I truly dead?</p><p>is this all a virtual construct of reality, as I exist within the imagination of my after-death state? am I making it all up, creating a world with my mind based on what I've known of the previous world I've inhabited? I didn't have the proper psychological terms at my disposal to rationalize any of what was happening or had happened throughout the night. I couldn't take into account the idea that my being had been fragmented, and I couldn't fathom the idea of a timeless identity of myself transmitting information to me telepathically through the medium of my inner dialogues so there was no way of telling myself that I had just taken a conscious plunge into the abyss of the timeless to be washed of my past while simultaneously my timeless self took a little ride on the temporal tsunami of my body in order to take stock of everything my conscious self has done since its entry into the world of humanity. I had no way of realizing at the time that once that switch was done and the probes were finished, my unconscious self was rather displeased by the (lack of) ontological data being operated on by my corpse.</p><p>but, nevertheless, my lack of understanding couldn't possibly shield me from the coming barrage of telepathy in which, according to the most socratic of methods, my unconscious mind began an interrogation of my being which I still have yet to emerge from. however, I just saw it as 'thinking' at the time, so naturally I felt completely insane. yay, schizophrenia, Ive heard about that. so, I (on a fundamental as well as superficial level) don't know where I am or what's going on, even though it's all perfectly clear in the field of my senses, and I can't stop drilling away with my inner dialogue at that lack of understanding. at all. ever. it is a process which began at that moment and has not yet stopped. instead, its just gone on and on, fluctuating in its intensity but constant in its duration, rationalizing my life away. and its a good thing, too, because it helps me to better know my place.</p><p>so, where were we? have we lost our place yet?</p><p>out of the twisting, swirling, and cramping of the ecstatic experience of being all that is, I am screwed back into my physical form.</p><p>reset.</p><p>waking up, I am sitting on a bed. I stand up and reach out for a cord to pull on, but for some reason the light hanging from the ceiling fan won't turn on. sitting back down, it is dark, but my eyes have adjusted. there is a lamp a few feet away. I can see an alarm clock, and a chest of drawers. there are fixtures on the walls, posters and such. there is a doorway on the wall adjacent to an open closet across the room. these all seem like familiar objects, I remember them from before, but something is wrong. I remember the closet being on the same side of the room as me. I turn on the lamp.</p><p>in the dim light, I recognize each of these objects individually. but their positioning in relationship to each other and myself is not how it should be given the arrangement I remember leaving when passing out earlier. the composition of the room is not the same.</p><p>it seems that while my eyes were closed, the room (including walls, furniture, doorway, and other more 'permanent' structures) decided to rearrange its component parts such that I would open my eyes to something that would make me feel completely mixed up. I was overcome with the sensation that this was not the room I had initially lied down in.</p><p>wait, did I pass out earlier? what happened again?</p><p>I remember coming in here feeling extremely ill. I remember feeling as though I was being poisoned. in that memory, my mind raced for clues as to the source of my illness, conjuring up reasons for my imminent death in every possible way as I curled up in this bed and eventually just let go.</p><p>the fear was immense.</p><p>immense is not a proper term to describe my fear. dinosauric, maybe?</p><p>my suspicion that I was, in fact, lying down to have some sort of brain seizure or similar event resulting in death created a fear in me that was dinosauric in size. I was sure that I was dying, as sure as I was sure that I did not want to die and was not ready to die. I did not want to die because I feared death dinosaurically.</p><p>and what happened before this that had served to mount that fear?</p><p>uh...it's kind of blurry. I seem to remember something about growing up in magnolia at some point, or something? then I moved to houston, maybe? something about a friend in austin?</p><p>I might be a cigarette smoker, but I honestly can't remember. if I were, I'd probably need one about now, or at least feel the need for one, but I can't figure out what I feel right now, much less what I need...I'm just not sure. sitting on this bed, the memory is nearly completely unavailable.</p><p>or, maybe if not unavailable, the memories were at least useless. it is as though I've just awoken from the dream that was my life with memories of who I was and where I've been and what I've seen seeming like an unsorted pile of pictures taken of a museum exhibition of my life, an exhibit whose time on display has long since passed. those pictures are all jumbled up with random photographs from the daily lives and vacations of numerous strangers, and it's difficult to figure out what's what.</p><p>where was I before I was here? where am I now? Trying with all of my mental might to form some sort of sequence within my memories, the last recollection of being before this room I'm in now is of something resembling space and everything contained within it (bodies of mass with physics and reactions and lights and such).</p><p>well, that's not entirely true.</p><p>it was more like the source of space and everything contained within it (coming out of it?), along with every possible product of that source. I can vaguely remember being required to be that place in order to be in that place. and I remember witnessing lots of light, all of the light that existed at the time. for some reason, my memory tells me that I was all of that light, and that everything I had been experiencing had also been myself. because all of it was me, anything it was doing, I also would have been doing, regardless of the scope of my volition and its expression. that is to say that just because I was everything didn't mean that every action I perceived was voluntary. have you ever sneezed? it's kinda like that, except the involuntary action taking place is that of history occurring, rather than the act of blowing snot out of the nose (although, I realize that this snot-blowing does occur quite frequently within history, so I guess on some level they're pretty much the same thing then, right? history = snot rocket, gotta 'member that shit).</p><p>oh, and, I remember the color pink for some reason.</p><p>so that's where I was before this room? existing as my environment rather than within it, intentionally orienting the universe in which I find myself utilizing a manner of movement similar to the way in which an animal's mind might orient its component body parts?</p><p>well, punch me if I'm wrong, but being made to be identified as universal coordinator sounds like that 'being with god' crap I've heard about before, right?</p><p>but, I don't believe in god, do I?</p><p>hey, I didn't say I believed it, I said that's what my memory tells me. so, if I was doing that before I was doing this, then how did I get there? how did I get here? is this the same place, and do the same principles apply here?</p><p>hmm, how did I get there? well, I seem to remember having ingested something probably purchased on the black market, a market whose quality control enforcement is nonexistant and thus whose products are intrinsically dangerous to consume. or, at least, I seem to remember being sick as a result of said consumption. I was so disoriented on my way into the room that the actual ingestion process had become but a tiny speck on the horizon of my memory, thence becoming subject to an extreme lack of clarity.</p><p>leading up to my 'godhead' experience, so to speak, there is only memory of extreme confusion. I say that I must have consumed something only because that's the best scenario I can derive from the washed out memories of 'waiting, then confusion, then lying down, then dying' that are available to me as I sit on this bed in this strangely familiar yet completely foreign room trying to piece this all together. ok, so on the subject of how I got there where god is, so to speak, it must have had something to do with a toxic reaction to some object that I placed inside of my body.</p><p>ok, so, this toxicity, was it lethal?</p><p>I don't know.</p><p>I lied down in the bed while my world collapsed, right? my fear of death slipped away from the vice grip I had placed on it as I disintegrated my conscious experience from my body and became one with everything else, right? my perception was then made identical to that of the source of all that exists, correct?</p><p>well, if I didn't eat poison, die, and enter the 'after life' state, I must have done something very much like it. now, as far as how I got back to this gravitationally oriented somatic form, I can't exactly say. I just remember finally coming to terms with the universal fact that, as far as I could tell, I had been separated permanently from the biological object to which I had previously held a lifelong attachment. then, nearly immediately after becoming somewhat contented by that realization, I remember waking up reattached to that object, or at least something very much like it.</p><p>it doesn't particularly feel like this place that I'm in right now, this cluttered bedroom, is any different from the place I was in previous to it, the place where I had exited my body to. however, it does feel distinctly different from the place that I had been in before the departure of my perception from my physical form. it's almost as though this room is simply a reflection of the goings-on of the last place that I was, and that I'm actually still in that place, the place that is most easily described as the source of all that exists.</p><p>so does that mean that I'm in some way, within the scope of my mind, creating all of this that I'm experiencing, if I'm not actually here and none of this is actually real and I'm actually still in the place that I went to after I curled up and died or whatever the hell happened earlier? am I my environment?</p><p>well, if my environment as I perceive it is no more than a time-filtered, virtual construct of the 'real' world where everything is happening all at once, and that construct exists in the region of reality designated as 'my mind', then yes, I am my environment.</p><p>well, if I am my environment, can I bend it to my will? am I actively god? or is this just some program of experience that I authored for myself when I stepped outside of reality for that moment? can I just manifest my intent onto my surrounding 'environment' in whatever way I feel or is there some more specific mechanism by which this must be done?</p><p>well, I guess some of that could be, to an extent. I think that it feels like I can alter the perceived structure of reality at a given moment in time using my mind because the human frame I'm perceiving my mind as being attached to is not only moved by my mind, but is also intimately connected to the perceived structure of the entire rest of reality. so, moving my body with my mind in turn effects change throughout the entire course of the world within which it exists simply because of its physics. upon examining that sentence, I realize that the converse might as well be stated, that to the extent that a mind is not controlling the body it is attached to, that body will be puppetted  instead by shifting forces in its surrounding environment. it seems from here that the stuff of mind could be described as something that gathers information and reaches rational conclusions based on that information, exists outside of time until it perceives itself as an object, and then moves that object through time through the medium of its mechanical orientation in accordance to the perceptual data provided to it by that object.</p><p>If one were to wish to move mountains using the power of mind alone, given that mind is not a body-specific phenomenon but rather something ubiquitously distributed throughout reality that latches onto and controls bodies in a top-down sort of way, one would then be required in some way to shift one's awareness to that of the matter composing the mountain to be moved, to experience the world as the mountain experiences it, and to then move as the mountains mechanical properties allow it to move.</p><p>but, do mountains have eyes to see with? ears to hear with? muscles to motivate with?</p><p>well, crap, it seems I've gotten myself into a bit of a quandary here, as I do not really see why the current metaphor is necessary. maybe it's so I'll sound more pedantic? yeah, that seems necessary in this sort of writing, for some reason. but, hopefully a better excuse for these words will come in time. like, woah, bro. anyway, back to the mountain thing...</p><p>To my last question, no, a mountain has no senses of that sort, no intelligence gathering devices, no machinery to move itself with, and thus achieves its movement through the ignorance of and subsequent control by its surroundings. so, in our efforts to move a mountain with our powers of mentation alone, we've sacrificed our freedom and our senses and become a lump of dirt. so, maybe it would make more sense to use the mind as a tool in combination with other tools (which, yes, I realize are also, on some level, according to the model I'm building, made out of mind and not able to be differentiated from mind, but just hear me out). while we are trying to use imagination alone to directly manipulate the fabric of reality, it seems fairly rational to assert that this manipulation must be done through the medium of some part of that fabric that has the capacity for self-actualization. this way, if we want to move mountains, we can move our bodies to move shovels to move mountains, while still retaining a sense of direction and conscious choice based on perceptual data.</p><p>it seems that a human body is as good a tool as I can imagine for moving around in, becoming aware of, and intentionally manipulating the temporal resonances of eternity being constructed by the awareness it has designed itself to support. if anything, it's good for allowing mind to complicate the fuck out of some damn matter, as is clearly evident in the words I've created.</p><p>so, I think we've got it at least partially fastened, if not nailed down, that I don't know if I'm alive or dead because I can't remember if I died or not and that because of that particular boundary dissolution, the dissolution of the boundary between the world of the living and the world of the dead, I have had to reach the conclusion that the perceived world, my environment and my body, isn't the same place or thing as itself from moment to moment, but rather a constantly shifting reflection of something which exists outside of time as my body ordinarily causes me to experience it. these reflections, the cells in the cartoon of reality, so to speak, are not identical to each other, but they are identical to the thing that they reflect, and they all reflect the same thing. so, this place is always the same but always different, at every moment, and I'm always in the same place, making it all up with my mind.</p><p>very confusing, indeed.  I don't know what the hell I'm talkin bout, batman.</p><p>How the hell do I explain the existence of other beings claiming sentience outside the scope of my self, then?</p><p>If they are to claim their perceptions to be composed by anything other than the same mind as the one I use for my own composition, does that mean they're largely operating out of environmentally mandated procedures? could the laughter and dismissal response so frequently elicited by sentiments of 'you are me' be something set into motion by my mind from the perspective of other bodies in order to trick me into thinking the opposite of all that I've just 'learned', just to keep me on my toes or something? fuck, I don't know, I'm getting tired of this. </p><p>ok, so where was I? this just keeps getting more complicated.</p><p>ok, so I think by this point in our little narrative we've been milling about for a little while now in a space that has been determined to be some sort of strange bedroom in a strange apartment with strange rules for the behavior of its composition that don't quite make sense yet in relation to the changes in my perspective occurring over the course of time leading up to now.</p><p>tonight's been a uh, discombobulating turn of events, to say the least.</p><p>In an effort to determine some sort of location and mode of operation for myself, several heuristic exits from the room have been taken. my memory gathers data from the interactions between the various forms of organization operating in my perceptual field while the rational part of me tries to establish functional relationships within it. all new data is subjected to all previously derived relationships so I can figure out what the shit's goin on and how I should act in said shit. my mind allows me to glide my experience from room to room upon the friction arising from the interplay between the psychic intentionality of the feet below me and the gravity of the floor beneath them. the active conflict of the lesser parts serves the intended purpose of the connected whole.</p><p>I soon find myself in a bathroom, staring into the mirror at what looks to be a form of organization which could provide the perceptual data and mechanical components necessary in order for consciousness to intentionally manipulate matter to the extent that it is aware of it. an endlessly shifting human figure stares at me from the mirror, and I assume that this reflected image of matter held together in rhythmic flux is representative of the body from which I am experiencing everything. ok, so that's me in the mirror, I think, but it still feels like I'm the whole bathroom, looking at itself through the eyes of the human form contained within it. at this point, interaction with other people seems to be of experimental necessity in order to better establish some sense of self and other. feet, legs, body and floor, take me to the living room, I got some socializin' to do and some interactions to analyze.</p><p>in seeking a definition of self and other, I periodically insert this form that I've found in the mirror, this form whose product is the data currently at hand, into these organismic interactions being provided to me by my senses as I perceive them. but, this is to no avail as the intentional mechanisms employed by every interaction are made entirely obvious to me. the logic behind everyone's actions is outlined to my imagination in a nearly automatic fashion. it all seems so intuitive. as the rationale underpinning every intentionality is telepathically made perfectly explicit, the roots of everyone's behavior coalesce into one trunk of activity. ultimately, our intent does not appear differentiable. is there just one mind guiding the power captivated by all of these biological rhythms?</p><p>the formal interactions taking place seem to frequently undergo a significant degree of conflict on a local level. however, they do not seem to ultimately contradict each other. rather, they seem to create a pattern of interaction which suits the movement of some higher degree of order being implemented throughout the reality I find myself in. through its intentionality, it seems to establish a context within which these locally observed forms can act. could we all be parts of some larger whole which has temporarily fooled us into individuality with these immediate conflicts between our apparent intentions and the apparent intentions of our peers so as to perpetuate the expression of its own intent through the directed energy arising from our individual conflicts? when I make a decision, is the part of me that made the decision something that's making decisions for everyone else too, even if those decisions conflict with each other in a material sense?</p><p>this contextual unification of intentionality challenges the notion of the existence of my ego, not to mention calls into question what exactly this higher system I find myself acting as a lower component of ultimately wants us to be doing. I honestly can't tell the difference between myself and everybody else when from my perspective it feels like we're all behaving like perfectly balanced parts in the machination of reality. but I'm an individual, making conscious decisions which guide my actions based on my individual experience, right? from there, can't I then choose to contradict the will of my peers in order to disrupt what's going on? can't I, as an active participant in all of this, willfully imbalance this structure for my own intent in opposition to the intent of everyone else?</p><p>I can try to cause deviation from what I would ordinarily define as 'normal' activity through deviations in my behavior from what is defined as normal as it is perceived by the 'other' people in the apartment, but through the reactions of other seemingly intelligent beings, balance always finds its way back. every attempt at throwing things off is denied, and the reasons for each denial immediately spring forth in my mind as perfectly rational in the 'I can see exactly why that person reacted that way and I, also, would have reacted identically had I been in possession of that person's experiential memory at the point of decision, thus making my inability to individually mandate the order of this system both apparent and logical,' sort of way.</p><p>why does it seem like these other piles of highly organized, perceptually guided matter are operating with near total accordance to previously determined functioning rather than with the free will that we're so convinced that we're using? is everybody a robot? it feels as though there is some protocol for all of this, and it feels very strongly as though the author of that scripture isn't restricted by time. gazing upon this idea with the light of my experiential memory, I am reminded that I don't know whether or not I died earlier. this allows such ideas to arise as the thought that all of this reality that I'm perceiving exists outside the scope of the time that I once knew.</p><p>as far as I can tell, dead = no more experience of body = no more experience of time, or, at least, in a dream = no more experience of exterior world = no more normal experience of body = no more normal experience of time. so, from here it looks maybe like there is a world supporting my dying body, and within that body, I am a mind dreaming into itself all of the material form that is currently being made available to my awareness. body with a mind inside with a body inside with a mind inside? and so on? I guess so, to infinity, or something.</p><p>I would like to say that the formation of matter is dependent upon the passage of time, but I cannot exactly say how. I would say that the subjective experience of physical existence and the passage of time are intimately related, but I can't say whether the physical movement of matter amounts to the passage of time or if the passage of time amounts to the physical movement of matter. both may as well be true I guess. I would, however, like to view the situation at hand as material movement being something that arises out of the passage of time with the experience of said passage of time then being the result of the movement in matter that it causes. in short, time's passage makes matter exist objectively in such a manner that matter will in turn make time's passage known to itself subjectively.</p><p>The data gathered in this observation of the passage of time seems to be a decent well from which to draw defining information regarding the self in contrast to other. the idea that I had died or was lucidly dreaming or something similar that would disconnect me from my subjective experience of time and subsequently my self as I had previously known them allowed me to view my existence as also being outside the scope of matter as I once beheld it. I am apparently something fleeting and dynamic, immaterial, being able to change my form dependent on the experiential data captured by my attention. while it's debatable as to whether or not I am the previously mentioned material object doing the experiencing of itself, I am at least an autocompilation of the data from the experiences gathered by that object in its perception of itself in reality.</p><p>this amounts to my place being somewhere within the bounds of the mind I use to gather information about, determine, and manipulate said location. so, I'm in the place that's inside the place that defines places, I guess I could say (which, really says nothing about where I am). within this apparent nonlocality of my self, an illusion of location is created in the schism of defining self and other; self being the central point of the process of experience and the supporting matter experienced as most immediately connected to that process and other being the environmental matter surrounding it from which the self is alienated in this act of definition. however, the intimately related nature of the processes of the material world as it is perceived from the perspective of processes occurring within it is such that no true distinction can be made between the body supporting the mind and the environment surrounding that body. that is to say that because the matter most immediately related to supporting the processes of mind is supported by and thus immediately related to all other matter as it exists in the perception of mind, no separation between the biological object from which I know myself and the environment I perceive myself as existing within can truly be made.</p><p>this notion of possessing a virtually nonlocal existence and, a 'materialistic omnidentity' allowed for a thorough solipsism to set in. is that to say that all of these expressions of order, all of this perceived matter with physical properties and gravitational pull and such that seems to be surrounding me, that all of these other people and things in the apartment around me, even down to the time that I'm currently perceiving as orienting it all is on a fundamental level something illusory in nature, something that's only in my mind, something that doesn't matter?</p><p>well, if something 'doesn't matter', I'd say that means it doesn't necessarily exist in a material form. and if I were to go out looking in my memory for something which doesn't matter but still exists, I'd most easily point toward information. if my existence is bound totally by the scope of my mind, then knowledge derived from experience seems to be what I've been trying to describe here as the 'stuff' that everything is made out of.</p><p>so, I think what I've just begun to state is that from the perspective I'm currently describing, matter exists fundamentally as information, a collection of data gathered and contained within my mind. my mind, then, is the context within which this information called matter operates. because it would appear that mind is somehow something supported by and extant within matter, this hierarchy finds a structural oscillation with its formation finding mind within body within mind within body for eternity. from here, it can be stated that the entire world as it is made real in my perception exists on the interior of my mind to the same extent that I perceive it as exterior to myself. it seems logical then to say that my mind could, in a sort of shifting balance of power act as the compass of reality to the extent that reality is not acting as the compass of my mind. the converse of that should also be stated, but I don't feel like it.</p><p>in creating this description, I seem to have resolved for myself the issue of the difference between mind and body by defining them as composed of the same thing, information, and then finding my body, the corporeal image of myself, being something most easily controlled when worn on the inside of my mind, with my mind, the actual body of my existence and resulting self image being the entirety of reality within which my body operates as I am conscious of it.</p><p>so, how am I supposed to act, now that I'm myself and everything else and everything is itself and me? well, if I could only drop the illusion of separation between myself and everything else, I could maybe glean some information from that kind of experience and find some commonality between its resultantly developed perspective and the ego-limited perspectives I've previously held.  then maybe I can figure out the intent behind it all, the ultimate order sought by all of this reality in its unending action on itself. from there I could probably find out how I'm 'posed to act in the midst of it all, but for now, fuck it, ima just sit here for a minute while I feel somewhat calm for once before I go back to trying to put the world back together.</p><p>so, what now? it feels like everything should be about back to normal by now. I've got a decent perceptual grasp on what's happening superficially in my temporary environment. a return to normal restrictions on biological rhythm yields normal, somatically-restricted awareness and a subsequently limited memory accessing only that which is directly related to my individualized senses. my intellect displays to me sensually only what has been genetically determined to be of evolutionary importance. with cigarette in mouth, I'm back to seeing, hearing, remembering, and feeling like caleb. but there's still the issue of my self having been redefined within that memory as everything else. wait, what?</p><p>if I'm everything else, then how am I supposed to act?</p><p>which impulses are more appropriate to follow, those which appear spontaneously or those whose manufacture I have witnessed? I guess that a first requisite for choosing which impulses to be compelled by would be that the action being impulsively represented should bear with it some sort of ultimately pleasurable reward to be experienced by my senses as a result of my participation. but, this should not be the only requirement as actions bearing a pleasant sensual reward to and a subsequent aggrandizement of my immediate experience do not always avoid aiding in the detriment of the experience of other sensual clusters in their observance of my chosen actions. because of the possibility of being an asshole in order to subjectively feel good in an immediate sense, it seems like I should be a little more discriminating than just 'do it if it feels good.' but that's not to say I won't be using this hedonism as a foundation on which to build the rest of my behavior. this foundation, however, also has its exceptions, as not all actions beneficial to my self in the long term are immediately pleasurable to their performer.</p><p>in determining whether or not it actually makes a shit if I piss anyone off with my acts of selfishness, I ask myself, if I am every thing, does it make a difference to the rest of me how the caleb part of me acts? well, if my self is every thing, then that means that within my self exists every body, and that means that on some level I behold everything that everybody beholds even if that information isn't currently available to my awareness. that would mean that when acting from the perspective of caleb, I'm also perceiving the effects of caleb's actions from all other perspectives from which those actions can be felt. so, if I end up stepping on anyone's toes when acting to reward myself , I'm technically stepping on my own toes. I probably shouldn't do that. time may choke these perceptions out of my experience, but time doesn't seem to be quite the necessary event that it was once viewed as.</p><p>so, I now can't see any reason why I would want to directly bring negativity through my actions into the experience of any sentient intelligence observed within my perception of it all unless I, too, desire such a state of disagreement within my own experience in order to fulfill my self's design. because I now can't see any necessary distinction between myself and everyone else, all intellectual resonances of my actions serve me sympathetically. if I project positivity into the experiences of other people, then I'll be affected positively; if my projection is one of negativity then I'll be affected negatively. regardless of whether or not their experiences are currently being made explicit to me, all intelligences witnessed as being outside of the perspective of caleb are a part of my self and therefore the same as my own.</p><p>it seems that self-centeredness is impossible to avoid. why do I say this? well, I've explained that everything is perception and that perception is me, what I call my self, right? well, if all things can be labeled 'self', then whatever thing is labeled 'center' would also fall under the label of self. because reality seems to surround and emanate out from the point at which my experience is assembled and because every experiential assemblage point is essentially a universe unto itself, I would give a description for the location of the seat of my perception as it is determined from its examination as the relative term 'center' in the universe I find myself. this centrally active compilation of experience within the self is what I've been referring to as myself. this is to be defined in opposition to a nearly identical phrase whose only linguistic difference is the addition of nothing, a space, between its syllables.  'my self' is what I've been using as the designator for the entirety of reality within which myself is compiled. from here, any action finding its expression through me would have to be one born of a self centered being, a being which refers to the center of its universe when using the term 'myself.'</p><p>this is not to say that all actions are primarily dedicated to the ingression of pleasure into the body of my senses as I currently perceive them. but it is to say that every impulse is evaluated in relation to how it would affect that body and thus the methods in which each action would serve my body of sensation are fully examined in order to make a conscious choice on how to act. it seems that if an act requires me to bring an apparent disagreement between myself and what I'm doing into my immediate experience of the world, that act will nonetheless be screened rationally such that it no doubt serves the ultimate intent of self, whatever that may be. now, as far as what that intent might happen to be, I guess that might be something which gets consciously decided based upon the collective experiences gathered by the intelligent aspects of self. or maybe its just something totally arbitrary. I do not know for sure. in any case, meaningful or arbitrary, the universe seems to be a slave to its own design. whether the objective of this self I find myself as an experience of is ultimately good or bad I guess doesn't matter now. so long as I remember to act in a manner that coincides with the reality that I've experienced up to this point I'll likely avoid disagreement between what I am and what I'm doing.</p><p>well, it seems as though I'll be acting in an unavoidably selfish manner, but I'm pretty sure that anyone claiming that there is a possibility of acting otherwise is basically denying their own existence. it seems to be common in the culture in which I find myself to avoid carrying the label 'selfish' due to some negative connotation such a label should carry, but I find this connotation and the avoidance it spawns to be hypocritical. instead, I am made aware of an avoidance of negatively selfish action which can be sought through a proper definition of self. if one defines one's self as everything beheld to one's senses, then acting in a manner which ultimately benefits the self will ultimately benefit everything and everyone existing as a perception of that self.</p><p>with this, the efficacy of all of this rambling description of outlandish events becomes clear. if there is one reason to try and understand all of the words in this story regardless of the truth that they entail, it is this: given that my experience has been verbally related in a clear enough fashion such that it may be assimilated into the experience of other intelligent beings, the golden rule of 'treat others as you would treat your self' that my mom taught me as a kid will find itself underlying all consciously determined behavior to the extent that this story is understood by consciousness. regardless of whether or not any of it actually happened it all seems important to understand for the purpose of getting along with reality a little bit better than before. or, maybe I'm wrong and we're supposed to eat babies and drink pee or something. ok, blah blah blah...this is quite probably quite an incomplete myth...but, for now, as Ive said so many times before, fuck it.</p>",
 "year": "2001",
 "id": "25272",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-04-12T07:00:00.000Z",
 "views": "3291",
 "dose": {}
}
