{
 "title": "Quite Possibly the Worst Drug Ever",
 "author": "Mushroomhead",
 "citation": " Mushroomhead. \"Quite Possibly the Worst Drug Ever: experience with DXM (ID 25271)\". Erowid.org. Aug 8, 2007. erowid.org/exp/25271",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "DXM"
  ]
 ],
 "report": "<p>I try to think back to the origin of my hopeless addiction, and it all started off with my first real dxm trip at 175 mL (525mg).  I never knew too much about DXM, all I knew is that was truly the best night of my life.  I began experimenting with DXM (300mg-750mg).</p><p>Now I have enough experience to know some facts on dxm.  DXM is VERY addictive.  I have tried opiates, and I would have to say DXM is much more addictive.  How so?  When on DXM, I am in a delusional world.  I am not happy, and if I am it's only the DXM delusion.  The next day I suffer with mild to severe withdrawal. </p><p>I feel sweaty, depressed, dumb, shaky, itchy, and it is truly the worst feeling ever.  Its the feeling that theres never anything on TV, even when your favourite shows are on, they just are not funny.  The only way to make it go away is to drink a bottle of dxm, and the following day the withdrawal symptoms are back, and much worse.</p><p>The reason I am writing this is to tell other teenagers to never even try this drug.  Want to have a psycedelic trip?  Call a drug dealer, and pick up some magic mushrooms or LSD, because this drug can become a nightmare to some people.</p><p>Today is day 3 without DXM for me.  I know the I will never be able to quit fully.  The cycle always continues, no matter what.  How I feel is completely different each day.  Some days I know I don't need it, other days its almost impossible to not get it.  I come up with excuses to do it.  I sometimes find it makes me a more social person the day after taking it, or something pisses me off one day, so I use it as a reason to take it.</p><p>All I know is DXM will make me lose my family, it will kill my stomach and liver, it will make me an anti-social prick, I'll begin stealing to get it, I'll lie so much to my parents who are trying to help me, and I will fry my brain.</p><p>After doing much DXM I have felt the NMDA impairment.  Its worse the day after taking it.  Each day I feel a bit better and it does get worse after I do it again. </p><p>All I have left to say is the DXM is death, addiction, fear, hopelessness, and dissociation.  Mushrooms are life, happiness, laughter, hope, and awareness.  Do I really want to ruin my life because DXM is so cheap and easy to obtain?</p>",
 "year": "2003",
 "id": "25271",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-08T07:00:00.000Z",
 "views": "12714"
}
