{
 "title": "Powder Coke & Crack: Like Apples &... Crack",
 "author": "DeeDee",
 "citation": " DeeDee. \"Powder Coke & Crack: Like Apples &... Crack: experience with Crack (ID 25347)\". Erowid.org. Jul 17, 2003. erowid.org/exp/25347",
 "substance": "Crack",
 "bodyweight": "115 lb",
 "report": "<p>Barbara Walters interviewed a very prominent, talented singer who was caught ordering nothing but baking soda through room service at a swanky hotel.  (For those who don't know, baking soda is the key ingredient in turning powder coke into crack.)  Barbara asked the singer straight-up: 'Did you do crack?'  The singer replied, 'crack is a poor man's drug.  I have money.  Why would I do crack?'</p><p>I can answer that.  She couldn't wait the 3 minutes it takes for powder coke to seep into those nasal membranes and get you high.</p><p>I was once a powder coke dealer in L.A.  A business associate - someone higher up the 'ladder' than me - cooked crack in front of me in a hotel room about four months ago.  I thought, what the heck?  Coke is coke.  I was already snorting a good amount of it at the time.  He lit the pipe for me, I took a big toke, and BAM.  That was it.  Powder coke was just a waste of time.</p><p>Even though it made a cracking sound when he lit it up, he flinched every time I called it crack.  'It's BASE,' he insisted.  'Crack is dirty, this is clean.'</p><p>When people ask me what crack is like, I can only say this: even when you're high, you're thinking about your next hit.  The come-down is horrible... and you come down about 10 seconds after your high.</p><p>This guy actually compared crack to caviar.  'You can't do it all the time.  It's for special occasions.'  If crack is caviar, then Miller High Life is truly the champagne of beers, like it says on the label.</p><p>This guy is now incarcerated.  But I'm still a crackhead. </p><p>Crack is not a poor man's drug, it's not a black man's drug.  It's a very conniving drug that will eat me up like cancer.</p><p>If you want to snort, be careful.  With crack, there is no 'careful.'  They are two totally different drugs.</p>",
 "year": "2003",
 "id": "25347",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-07-17T07:00:00.000Z",
 "views": "20627",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 }
}
