{
 "title": "Opium - Op'ed Up",
 "author": "Packetized",
 "citation": " Packetized. \"Opium - Op'ed Up: experience with Opium (ID 2539)\". Erowid.org. Sep 11, 2000. erowid.org/exp/2539",
 "substance": "Opium",
 "bodyweight": "200 lb",
 "report": "<p>I've smoked Opium before sprinkled on top of weed, a couple of times actually. To do that you break off a peice of the rock and put it into a folded bill and grind it up to a powder then sprinkle it ontop of a bowl/pipe with weed. You can definitely taste that Opium was present after smoking the bowl/pipe with just smoking weed. But today, I'm submitting a real Opium experience without any other drug, so I took a few pictures (So they can be added to the Erowid archive) of the opium rock I had left and in a few moments I'll begin to smoke and experience what a real Opium high is without the weed. I'll be smoking it out of a glass bowl, with a screen in it, and I also cleaned out the bowl. Right now I'm fully sober, and feel completely fine. Not for too long. I originally bought 1 Gram of Opium in rock form for $15. This is about 1/4th what was left, which is what I'll be smoking.</p><p>Right After Smoking:</p><p>I feel very distant, colors looks brighter and seem cool to look at. I feel a bit stoned, and a little drunk at the same time. I've also learned that when you smoke a rock of opium it'll melt right through the screen. Oh well, I'll have to clean my bowl. No biggie, it definitely had a stronger and different taste than smoking it sprinkled on top of weed. Almost like smoking a very light tasting incense. (No I've never smoked an incense... :p the taste reminds me of the smell if a light smelling incense) My mind is at peace right now. It's almost like smoking weed for the very first time. I'll put some music on loud to see how that is. My ears are very sensitive over sudden, music is wonderful... I'll be back in about 20 minutes to add more.</p><p>20 Minutes Later :</p><p>Music is so wonderful, I'm so mellow. I can't put the music loud enough, I want the music to engulf me. In the last ten minutes I put on a program that danced with the music. It was FANTASTIC to look at. I went through some porn to see how my eyes went with that. I was very attracted to the beauty in the girls faces. How their eyes looked. I love Asian Women. Anyways, this isn't a report on Asian porn. Right now I have Pink Floyd on, 'Hey You' and the guitar is awesome. Overall I think Opium is alright and I've read it's extremely addictive. I don't feel an addiction to it nor do I feel I should do it all the time. $15 a gram isn't bad. It's getting fucked up about 4 times for $15. I prefer weed or shrooms. :) It feels like my head is completely empty without a worry in the world, I love drugs.</p>",
 "year": "2000",
 "id": "2539",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-11T07:00:00.000Z",
 "views": "59838",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.25 g",
   "administration": "smoked",
   "substance": "Opium"
  }
 }
}
