{
 "title": "The Divine Moment of Truth",
 "author": "ALittleWiser",
 "citation": " ALittleWiser. \"The Divine Moment of Truth: experience with Mimosa hostilis & Syrian Rue (ID 25415)\". Erowid.org. Nov 3, 2004. erowid.org/exp/25415",
 "substance": "Mimosa hostilis & Syrian Rue",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Syrian Rue",
   "(seeds)",
   "",
   "20 g",
   "oral",
   "Mimosa tenuiflora",
   "(extract)"
  ]
 ],
 "report": "<p>I recently had my first experience with DMT and pretty much my first experience with a strong hallucinogen period (except for one LSD trip about a year ago). It changed my life no doubt, let me give you some info about myself to help explain where I`m coming from.</p><p>I`m a 16 year old male from the northeast with a high I.Q. I first tried smoking pot when I was like 11 and have pretty much a steady pothead ever since with a strong interest in hallucinogens. Although Psychedelics arent the only drugs I`ve done. I`ve pretty much tried it all.</p><p>For some reason I thought I could handle DMT after reading just about every report on the wid` and lycaeum. With all the knowledge of the reports in mind I ordered 1 oz. of Mimosa Hostilis root bark and 4 oz Syrian Rue for under 20 bucks. I wanted a ++++, and I knew that 1 oz of Mimosa would be much more then enough. I set the date for a week later when me and 2 of my closest friends (M and K) were going camping. M has been my best friend since we were like 7 so I figured if anything went wrong he`d be able to help at least a little bit, even though he has always been against my habitual use of marijuana and other substances.</p><p>Preparation</p><p>1 oz. of Mimosa root bark was added to about 1 cup of water and 3 tablespoons of lemon juice, put on a camp fire in a pot and allowed to boil for about 30 minutes. While that was boiling I chewed around 5 grams of rue. The mimosa solution was then strained and since it was getting late I decided to drink what i had and save the rootbark for a later date instead of doing a second and third extraction. Time of ingestion was about 1:00 AM</p><p>Experience</p><p>I write this one day after the experience. I will try and describe this as best I can although I can only remember certain pieces. All times are approximate...it was real hard to keep and actual timeline.</p><p>I started to drink this terribly awful tasting shit and ended up only getting about 20 grams worth down before i felt very sick to my stomach. I layed down half way on a big rock that was near the fire while M and K went to go get more wood. By the time they got back, probly about 3 minutes had passed, M asked me how I felt, I replied 'sick', sure enough talking brought the mimosahuasca back up and I quickly fled to a near by tree to expel the contents of my stomach.</p><p>By the time I got back from throwing up I think I was starting to feel it but I wasnt to sure what to expect. I sat down and noticed my body felt very numb and immediately I checked my pulse (as i habitually do on new substances), it was skyrocketing. I tried to lay down and relax but I found no matter what I did I was terribly uncomfortable and the visuals were starting to kick in. I kept trying to stay positive but I was being bombarded with huge waves of visuals one after another (the whole trip peaked probably about 10 minutes after it started, so needless to say, intense isn't the word). About 10 minutes since I drank the brew I was in a state of total panic and decided to try and lay down and close my eyes, HOLY SHIT!!! I saw the most amazing jungle paterns ever......they totally consumed me. I quickly decided that laying down was a real bad idea, I couldnt feel the 'inside' of my body at all, (it made sense at the time) and tried to explain this to my friends (very frustrating).</p><p>I knew it shouldn't last much long then 2 and a half hours so I asked M what time it was, he told me 20 after 1 I think...didn't matter it was impossible to figure out what the hell that meant, so I asked him how long all this was going on for, he replied 'about 10 minutes.'  I was panicking terribly and knew the only thing that would make it better was time, but I had almost totally forgot what time was. While I contemplated on this, I figured at least 5 hours must have passed, I ask M again what time is it then both M and K started laughing and M replied 'it`s been seriously like 2 minutes since the last time you asked me'.</p><p>I was seriously scared now, I thought I was gonna die, but then it hit me that I didn't know what death was so what did it matter? But for some reason it did matter, I just wanted to go to the hospital so I asked M and K if they were in any condition to drive in case I had to go to the E.R.  (they were drinking). Let me digress for a moment...I'm the kinda of person that would seriously rather die then go to the hospital, so of course my friends were worried.</p><p>About now I think I really had M freaked which really freaked me, so I decided I had to try and be strong for his sake. I told him I was sorry for everything and that he was right, that I shouldn't be doing this kinda shit. We had a sappy moment and I felt much better after I got his forgiveness. I told myself I never wanna be in this condition again and promised myself (and M) that I would cleanup...not even smoking pot anymore.</p><p>After all this happened time started going way faster and my mind was reduced to a wet washcloth. I remember trying to make sense out of everything but to no avail and finally just gave into it. They say that if you dont give into DMT then it will make the next 2 hours of life your life a living hell, they aren't kidding. After I gave into it the trip was really looking up. I spent the next 10 minutes trying to put on my sweatshirt before I finally gave up and figured it would make a much better belt (don't ask). I finally got used to my new surroundings (everything was totally out of whack and I didn't know what anything was...it simply just didn't make sense). I didn't even know what my body was, my whole life before this trip totally ceased to be. I had no idea that this wasn't the way I am....if that makes any sense. I even started talking again at one point, talking was kind of autonomic, I didnt have to think about what I was saying it simply came out, and more surprisingly, made sense.</p><p>Anyway I spent the rest of trip trying to figure out what I was, and slowly but surely everything started making sense. I was baseline about 2 hours after the trip started, and fell asleep with little dificulty, before having a night of the wierdest, most vivid dreams I've ever had in my life. I woke up feeling pretty good considering the events of the night before.</p><p>Conclusion</p><p>DMT kicked my ass. I don't think I got any higher then a +++ but that was way more then I could have handled. Theres no doubt in my mind that if M wasn't there, I would have lost my sanity...I owe him big time. Yet one good thing did come from this experience, I`m finally doing something to clean my shit up, which is great because at the rate I was going, I was bound to end up at a place I never wanted to find myself. I refered to this point in my trip as the Divine Moment of Truth (take from the shpongle song...it fits that point perfectly).</p><p>I belive there is lots to be learned from DMT....I simply don't think I'm ready for its knowledge. As for doing it again, I probably will, but I think im gonna wait a few years. As for anyone who is not experienced in psychedelics and wants to try this....DON'T! Making this my first real psychedelic experience was my first and biggest mistake of the night. Thanks for listening.</p>",
 "year": "2003",
 "id": "25415",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-11-03T08:00:00.000Z",
 "views": "12751",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  }
 ]
}
