{
 "id": 2541,
 "title": "Big Eyes",
 "date": {
  "submission": "2005-11-03T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Piperazines",
   "form": "capsule",
   "specific": "BZP"
  },
  {
   "time": "1:00",
   "administration": "smoked",
   "substance": "Piperazines",
   "form": "powder/crystals",
   "specific": "BZP"
  },
  {
   "time": "1:05",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "3:00",
   "amount": "3 capsls",
   "administration": "oral",
   "substance": "Piperazines",
   "specific": "BZP"
  }
 ],
 "report": [
  "It is about T=18.00 CET, took about 200mg 99.3% pure BZP in a capsule. From reading about it, I expected to feel something after 30 minutes. But felt nothing. Also, I was on empty stomach.",
  "T+1h",
  "I had thoughts that the stuff I have is not pure enough or maybe fake. So I decided to smoke a little to feel the effects faster. My expectation was to feel after 2 minutes, but I felt as before this experiment began. The way I smoked, was with foil from a chewinggum packet and a rolled paper roll (the usual way that I smoke yaba). It tasted soapy and then I became convinced that it is BZP. There was a weak taste of burnt plastic too, pherhaps that was from the foil, I was sure that I burnt the plastic off before use, pherhaps there was some left? Also I snorted very little, it did not burnt, but it cleared away some snot. I thought for myself that I've found a best way to clear snot from the nose.",
  "T+1.5h",
  "At this point, my eyes were not dilated. But there was something going on in my body. To enhance my feelings, I went to the local store, bought some beer, then drank 4 beers (14 cl alcohol).",
  "I was on party mood, called friends, but nobody could go out with me, they have to work the day after.",
  "T+3h",
  "I found that BZP is too weak for me, so I made 3 new caps. Took them all at once, then went alone to the city. There was now 1000mg BZP in my body.",
  "T+4h",
  "Now I started to experince that I'm stoned, I walked on the escalators and felt myself lighter, as the floating when on ecstacy. But that feeling lasted only for few seconds. Anyway, I knew that I was stoned. I ended up in a bar, where I sat alone, found myself looking at people very interesting. In the bar they played only hiphop, and I don't like that kind of music. So I left after 45 minutes. At this point my eyes were fully dilated.",
  "T+4h to T+6h",
  "I looked for a disco, but couldn't find any good one. Felt for female company, but not sex. When I spoke to people, they did not understand what I said to them. In my opinion I spoke clearly. When I walked I did it very quickly, sort of like running. Time went slow, and standing in queues were somewhat annoying. Most people ignored me when I asked what time it was etc. I must have had a very stoned look.",
  "T+6h",
  "I got to a place that played hip hop. While dancing I found out that my heart is beating rapid. I got a anxious, tried to talk with people, they did not understand what I talked about, or they just turned away ignoring me. Later I sat down next to a table with lot of glasses. Then a few guys came, and it was OK for me to sit there. I tried to explain about my pulse to some guy and told him to watch 1 minute for me, instead he bought me a drink. Well.. later I was back on the dancefloor.",
  "T+8h",
  "The place closed and I went to another one. I tried to write my phone number on a piece of paper, but couldnt see what I wrote. The person I gave my number to had a hard time reading what I wrote. I had a hard time talking and understanding what people spoke to me. Anyway, my pulse was high, but not as high as in the disco.",
  "T+10h",
  "This third place closes and I walk around in the city. Take the subway home. On the way home I had problems with my pockets, I don't know what pocket is there and I can't examine them. It is also very hard to wrap up the paper from gum.",
  "T+13h",
  "I'm back home. Couldn't read the newspaper. It is still hard to read, the letters are just a big mess. Tried to read a map, it was too much information for me. Saw myself in the mirror, my pupils were not only dilated, my eyes were really wide open. I think this could have been the reason people avoided me. I had a weird look. I stopped drinking water, didn't feel thirsty. During the night I think I had several liters of water.",
  "T+31h",
  "My eyes are a little less dilated and are not as wide open as before.",
  "T+34h",
  "My eyes are still dilated. I goto sleep.",
  "T+39h",
  "I wake up. My eyes are back to normal. Everything is as it used to be, except that my lips are very dry.",
  "Myself, I prefer ecstacy. I think this could be an alternative to those who find ecstacy too heavy. To be stoned on BZP is closer to meth than ecstacy. On meth I talk more and meth is also heavier. That my eyes were dilated for a such long time was really annoying. If I take this again, I will take 300-500mg. No way more, and if I wouldn't feel anything, I don't care, because I don't want to repeat this eye dilation. And a having a friend watching me is a good idea, what if I would have collapsed on the dancefloor?? And I almost got stopped by police, I saw them staring at me from their car, that would have been an unpleasant experience. I had harder time making contact with people on BZP than on other drugs."
 ],
 "erowid": {
  "id": "18444",
  "citation": " Anonymous. \"Big Eyes: experience with Piperazines - BZP (ID 18444)\". Erowid.org. Nov 3, 2005. erowid.org/exp/18444",
  "substance": "Piperazines - BZP",
  "views": "13199"
 }
}
