{
 "title": "The Image Lingered",
 "author": "Grey Knight",
 "citation": " Grey Knight. \"The Image Lingered: experience with Tramadol & Fluoxetine  (ID 25411)\". Erowid.org. Jun 22, 2007. erowid.org/exp/25411",
 "substance": "Tramadol & Fluoxetine ",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)",
   "",
   "1.0 mg",
   "oral",
   "Pharms - Clonazepam",
   "(daily)"
  ]
 ],
 "report": "</p>\n[Erowid Warning: There are case reports of people having bad reactions when mixing tramadol with SSRIs. This may include potentially life-threatening adverse reactions such as serotonin syndrome. See Tramadol Health Concerns]</p><p>I'm writing this the morning after, and I'm still a little cozy.</p><p>After years of adventure with phenethylamines and tryptamines  , I have found it my responsibility to counterbalance with chemical supplements that lean toward the comforting sides of consciousness. The power of MDMA has made my heart feel small within this vast picture we psychonauts live in, and I can't smoke cannabis anymore without having a panic attack, so anyway, I've been taking 20mg of Fluoxetine for about 2 months and 0.25mg - 3mgs of Clonazepam off and on for about a year.  Recently I found a psychiatric facility in Europe that allows me the personal responsibility that many local psychiatrists will not, so for the past 2-3 months I have been on a daily regimen of 1mg of Clonazepam, plus 20mgs Fluoxetine.</p><p>From this same European distributer, my room-mate was able to acquire 60x 100mg tabs of generic Tramadol. The came in the mail yesterday. Their are significant warning about mixing Tramadol with Fluoxetine (or any serotonergic drugs) because of the way the two drugs differ in their accommodation of serotonin. Despite these warnings, I decided to take 100mg of Tramadol.</p><p>After about 30min. I felt slightly restless, and agitated without any noticeable analgesic effects, so about an hour later with little to no change, I decided to take 2mgs of Clonazepam. This quickly settles my restlessness, and I just sat and pondered my consciousness. I was now feeling minor analgesic affects, but I decided to take another 100mgs of Tramadol. The analgesic affects were heightened, but not a lot. I was pleased going about methodic and tedious tasks, a similar sensation to when I first experimented with higher doses of Clonazepam a few years ago.</p><p>I debated taking more, but it was about 4:00am so I just went to bed. As I was nodding off I noticed that I would visualize an image that I would normally see in a dream state, but as I 'awoke' the image lingered in my vision while my eyes were opening, and faded slowly relative to how fast I regained waking consciousness. Earlier when I was reading the medical documentation on Tramadol, I noticed it's unusually large amount of common side effects (compared to other analgesics), one of them being hallucinations.</p><p>I fell asleep peacefully, and as I awoke today, minor and pleasant analgesic effects linger. I think I may hold off on the Fluoxetine for awhile and see how a similar dose affects me. If it is the same, I will probably want to take 300-350mgs to feel an opioid comparable analgesic experience.</p>",
 "year": "2003",
 "id": "25411",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-22T07:00:00.000Z",
 "views": "16519"
}
