{
 "title": "Claws Were Closing on My Stomach",
 "author": "Victim",
 "citation": " Victim. \"Claws Were Closing on My Stomach: experience with Datura ferox (ID 25436)\". Erowid.org. Jul 14, 2013. erowid.org/exp/25436",
 "substance": "Datura ferox",
 "bodyweight": "80 kg",
 "report": "<p>So I've been waiting for a chance to try Datura for a while now. I read a lot about it and I thought I was ready for what's to come. I invited an old female friend over to spot me since she tried almost every drug out there (Datura not included) and after she got here I told her not to let me smoke, pour water down my throaght if I seem not to manage to do it myself, hell I even had handcuffs ready for if I go berserk and try to attack her. I told her to check my pulse and temprature every once in a while and to call the hospital immidiately if anythings seems wrong.</p><p>I then went and crushed about 0.25 tsp and mixed it with about 330 ML of water. I boiled it for a few minutes, let it chill, and drank it in small sips. I did not drink the seed leftovers.</p><p>So we sat and talked for about 20 minutes before it hit me. I thought that since I used such a small dosage I'll be only mildly experimenting with it rather than f**king myself up, but was I wrong. At the beggining I felt very naucious, my guts hurt and my mouth went dry. Since it was bearable I decided to drink some coke and try to let it pass.</p><p>By now I was hurting all over, my head started pounding as if I was in the sun too long and hadnt a drink for hours. The pain was overwhelming, but apparently my pulse was still within normal because although my friend seemed rather worried, she did not call the hospital. I felt as if claws were closing on my stomach but my head was somewhere else. Kind of a fainting feel.</p><p>I'm out.</p><p>I wake up in my bed a couple of day later (saturday). My friend prooved her friendship and stayed right next to me for the entire period of time. She said that for the first night she cuffed me to my bed because she didnt want to go to sleep when I'm like that, but then she said I was like moaning so she untied me.</p><p>I wasnt violent. I wasnt moving. She said that I wasnt there at all. I was looking forward with eyes half way open and entirely dialated.</p><p>I wasnt mumbling most of the time, and I cant recall a thing. I kind of shrieked sometimes. I did pee on myself but I was ready for that and covered my bed with plastic bags under the sheets. I was sweating like hell but it was fairly hot.</p><p>The only thing I remember was an occasional gag over a water bottle that was shoved in my face. I did not hellucinate that, and probably did not hellucinate at all. If I did I cannot remember a thing of it.</p><p>After I woke up I still had a fever but my pulse was perfectly normal. I did not bleed and did not die, but it did not feel like a trip. You can get the same responce from drinking a nice glass of bleach (DON'T!).</p><p>The most dominant pain was the stomach clawing, after that was the dryness, which was taken care of by my good friend whose friendship I came to value even more. I couldnt see almost at all, but this calmed down rather quickly for me.</p><p>I want to stress that this is not the commonly used datura, but the kind that grows round these areas. This is just strictly poison.</p>",
 "year": "2003",
 "id": "25436",
 "gender": "Male",
 "timestamp": "2013-07-14T07:00:00.000Z",
 "views": "1091",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  },
  "1": {
   "time": " T+ 0:20",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 }
}
