{
 "title": "Simply Unbelievable",
 "author": "n00dle",
 "citation": " n00dle. \"Simply Unbelievable: experience with MDMA(Ecstasy) & Nitrous Oxide (ID 25457)\". Erowid.org. Oct 14, 2007. erowid.org/exp/25457",
 "substance": "MDMA(Ecstasy) & Nitrous Oxide",
 "bodyweight": "70 kg",
 "report": [
  "<p>Substances:",
  "\tMDMA 1/2 tablet",
  "\tNitrous Oxide 1.5 whippets",
  "Vicks Nasal Inhaler ~40 breaths (not strictly a drug but important for the story. \tSemi-Synergistic for its head clearing effects and short acting clarity.)",
  "As the bedroom door shut for the last time that night I was quite nervous about trying E and N20 for the first time. I had tried neither. However, the closer I got to the point of ingestion, I was overly confident, getting my mind into gear. We only had one E that we found. We just found it, but read up on pill reports and found it to rate a 9/10 so it seemed okay. We cut the tablet in half and anxiously quarreled about who went first. After my partner took her half and I took mine, we settled in waiting for it to kick in.",
  "What happened next hit me like an oncoming train. I never thought that it would hit me this hard, but lying in bed, after a while I said 'This isn't going to work', but just as I said it, surely enough the roof melted away into the blackness and into the night sky, full of stars. My mouth was wide open with awe, but smiling as I was fascinated. The soft trippy music in the backroom was throwing me into a place I'd never been or enjoyed so much. I stared back. If my partner had not been talking to me I might have forgotten she was there, because I was so fascinated with the stars. I tried to grab some stars with no luck, however doing this found me a new toy to play with, the air. I felt the cold air run across my hands. It felt amazing, heavier, and almost watery. Maybe I felt liquid love.",
  "There was a strip of moonlight coming in from the window and I placed my hand into the wide strip to have a look at my hands. I could not believe it. They were massive! They were much larger than my own head. I resumed playing with my massively large hands, they felt bigger and bigger and I was kept in awe. My partner gently stopped me from looking at my hands as she was concerned about how much I was enjoying it. But it was fine. :)",
  "I talked. A lot. My partner didn't feel like talking, but enjoyed listening to me, so I must have talked for about 10-15 minutes or longer, straight, letting the thoughts roll off my head. All of them were about how much I love my partner and how I was going to make her whole life happy. :) My partner felt a bit closed in, she had gone out to the bathroom earlier and found it felt nicer out there. While she was out there, I inhaled a few times on the nasal decongestant. It only contains menthol, pine oil, camphor and some other nice things, but I must say it is such a head clearer. I had about 40 sniffs, 20 in each nose while she was gone. I am now addicted to the smell of camphor. :)",
  "So we sat on the couch and I proceeded to talk to her more and more. Eventually she felt like going outside, so we went out into the cold air and sat down on the moonlit driveway. My partner's cat was sharing out love of the night with us and came to join us from the next door neighbor's yard. Watching my partner place the cat in her lap, I sat and smiled at how good it made her feel to be patting and cuddling the kitty. :) We went back inside as it was getting chilly and went back onto the couch for a while. After a while longer my partner felt like going back into the bedroom so off we went.",
  "We sat down on the bed and she asked me if I wanted to try the nitrous now. I agreed and she fumbled to get the cracker working. She got a bit aggravated and softly swore, which I felt inappropriate because there was so much love and beautiful things happening to us. She apologized and smiled with agreement. After getting the cracker going my partner pushed it towards me, helping me get the mouthpiece near my mouth, controlling the pressure release of nitrous to me.",
  "I took really really deep hits and nothing really happened. My partner had her cracker and put the gear down and lost all control, she slumped into the bedside for a few seconds. I wasn't worried because I knew she was enjoying it so much. N20 blasts her out of this world. Maybe not so much for me. Letting her recover, she said the next one was all for me, but we ended up sharing it. After some instructions on taking deeper hits, we had the second whippet. She was totally out of it, starting emotionless into my eyes again. I stared back, I wish now I had done something like tried to stand up or talk, because I wanted to see how strong it was.",
  "My partner's face turned from emotionless to smile and we fired up the next whippet. I think this one I could feel the most but I still envy how high my partner gets off them. I think I fell back a bit, or leaned back a little, tasting the spent N20 air as I exhaled, and it had a very fruity smell and taste. I could not say what fruit because it didn't exist. This hit totally took her away, she began slapping herself in the face over and over again, and I had a light smile because she was so so high that I envied it in a nice way. After the N20 wore off my partner asked me to lie with her. We cuddled close for a long time. I felt really good and I spoke a bit more about how much I loved her.",
  "We tried to get to sleep. She was tired but I was still going. Eventually the MDMA wore off and we drifted into sleep. All in all this has been the best experience I have ever had, which encouraged me to write this report. I hope you enjoyed this report as much as I had writing it. :)</p>"
 ],
 "year": "2003",
 "id": "25457",
 "gender": "Male",
 "views": "4896",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1.5 carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "submissionDate": "2007-10-14T07:00:00.000Z"
}
