{
 "title": "Blacked-Out And Did Foolish Things",
 "author": "DDD",
 "citation": " DDD. \"Blacked-Out And Did Foolish Things: experience with Alprazolam (Xanax) & Alcohol (ID 25452)\". Erowid.org. Feb 10, 2004. erowid.org/exp/25452",
 "substance": "Alprazolam (Xanax) & Alcohol",
 "bodyweight": "168 lb",
 "report": "<p>I had taken Valum and Xanax every once and a while, usually when it was accessible.  For all those not aware, Xanax and the like are very easily obtainable in places like Latin America or South-East Asia.</p><p>During this particular experience, I was with in Thailand.  I went out for a night with my father in a beach-front town, riding motorbikes and drinking beer.  Once my pops was preoccupied for a moment, I took off over to a pharmacy and bought an 8 tablet-package of 1 mg. Alprazolam.</p><p>I took four, after having already consumed 3 12 oz beers.  I immediately picked up a 24 oz. beer for the ride.  Incidentally, this particular brand of beer, Chang, when purchased out there is anywhere between 7 and 14% alcohol by volume in a given bottle.  It's a gamble.  Alcohol definitely contributed to my experience. </p><p>I lost all memory after being on the motorbike for 20 minutes or so, but the onset was like any Xanax or Valum:  My head felt light, as did all my movements.  No deep pleasurable body highs like opiates. </p><p>I woke the next morning in my hotel room, naked from the waste down, a cigarette had burned into the bedding.  The room was a complete waste-the small fridge was open and various beverages and food items opened and scattered about.  It was clear that I had stumbled all over the room and was hungry before finally passing out.  As for my exposed bottom-half, there was no girl next to me when I woke so I would assume I came to my room alone.</p><p>My dad rattled on the door a few minutes later telling me to get my shit together so we could get breakfast.  I had told him I must of had a bit too much to drink, because I didn't remember a thing.  He was shocked at the state of the room when I let him in, and he explained, laughing, that I had ordered a whole feast's worth of room service to his room for him and the girl he was with.</p><p>That's not the first time myself or friends of mine have blacked out from the combination of Xanax and alcohol.  I have explicit footage of people doing and saying outrageous things while under the influence; showing them later drew forth no recollection.</p><p>I guess my recommendation is first of all not to take as many as 4 while drinking- I can honestly say that the effects of 2 seem the same as 4 without drinking, so one wouldn't be missing much.  Also, it's probably best not to drink heavily on them.</p>",
 "year": "2002",
 "id": "25452",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-10T08:00:00.000Z",
 "views": "34964",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "36 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": "",
   "amount": "24 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
