{
 "id": 2546,
 "title": "Not For Me",
 "date": {
  "submission": "2003-09-04T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "FlowGnome",
  "gender": "Male",
  "weight": "132 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 14:00",
   "administration": "",
   "substance": "Kava",
   "form": ""
  }
 ],
 "report": [
  "The other night, I decided on sheer whim to take a Paxil and see what it would do to me.  I suffer from seasonal depression and was thinking of looking at it as a prescription option if my depression returns badly this year.  Now, I understand that side effects are most severe during the first week of treatment, but after that night I honestly don't understand how anyone could take this stuff on a regular basis. ",
  "I took it at about 7:00PM, and noticed first effects within an hour.  Slight tingling sensation, metallic taste in my mouth, and slight mood elevation.  I went to go have a few beers with my friends, and the alcohol affected me much more than usual, mainly adding to the mood elevation effects.   It came time to sleep, but I soon realized that this wasn't going to happen.  Luckily a friend was awake, and they stayed up all night talking to me.  I finally slept about 14 hours later with the help of some Kava-Kava, and awoke within another 3 hours feeling like crap.  I had a nasty headache and some gastrointestinal problems that carried well into the next day.   The most important thing I noticed though, was that I was far too 'high' from this drug to hope to be functional around sober people, and this is coming from someone that wouldn't mind eating a few hits of acid in a public place and interacting. ",
  "All in all the experience wasn't all that bad, or good, but I decided I would definitely not be requesting this as a prescription at my next visit."
 ],
 "erowid": {
  "id": "18454",
  "citation": " FlowGnome. \"Not For Me: experience with Paroxetine (Paxil) (ID 18454)\". Erowid.org. Sep 4, 2003. erowid.org/exp/18454",
  "substance": "Paroxetine (Paxil)",
  "views": "21259"
 }
}
