{
 "title": "Confident Trip",
 "author": "Gentle Green Giant",
 "citation": " Gentle Green Giant. \"Confident Trip: experience with Salvia divinorum (5x extract) (ID 25478)\". Erowid.org. Sep 14, 2007. erowid.org/exp/25478",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "25478",
   "Male",
   "",
   "Not Given",
   "Sep 14, 2007",
   "2536",
   " "
  ]
 ],
 "report": "<p>I had only tried Salvia divinorum once before, about a month before this experience.  And although Salvia is not considered a party drug I used it with six close friends.  The hallucinations were almost non-existent that time, but it was only used to test if we enjoyed the drug as I had a very small dose.</p><p>I decided that I was going to try the drug again, and waited till the opportunity arose. It was about 10 p.m. at a friends house.  There were five of us this time, but only my friend and me were planning and using Salvia divinorum.  The other three were planning on just using cannabis.  My friend was going to mix cannabis and Salvia divinorum but I was just planning on using Salvia divinorum.</p><p>We sat at the kitchen table, and the three using cannabis packed up the bowls, and my friend and I packed up a bong.   My friend took the first Salvia divinorum hit, and passed it too me.  I took a hit holding it in for 30 sec. About 25 sec into holding it, I could already feel the affects.  I turned back to my friend, to hand him the bong, but he had his head in his hands, sweating pretty badly. He refused to take another hit, so I took another.  I held this in for 30 seconds as well.  When I exhaled, I started to laugh profusely.  It took me about a full minute to calm down.  There was still a hit left in the bong but my friend said that he had enough, so I finished the bong.</p><p>We left the kitchen then, and went into the garage.  The three using cannabis started to smoke, and I packed up another bong.  I sat with my back to the wall in the garage.  I lost track of time here, I think I smoked 1 or 2 more bongs, but I cannot be sure, my friend doesnt remember if he smoked more or not.  He was smoking more cannabis, but we are not sure if he smoked more Salvia divinorum.  Right after finishing the last bong, a friend took a rake and pulled it away from me so that I could see the trials and I found this very amusing, asking him to do it over and over while I couldnt stop laughing.  He left after what he said was 2-3mins.</p><p>It was at this time approximately 10 min after the first bong hit, but 5 min after finishing the last bong, that it looks like I left my body.  I was apparently staring at the garage door for around 15 min.  I remember looking at the shadows, and they started to grow. Then all of the colors started to change.  I started to see just in black and white.  Then I saw in just blue and black, then purple and black.  And then just total black.</p><p>I felt like I was standing and floating at the same time, then there was a rush like I was flying through space and time, it felt like I left my body and my sprit was going into another dimension or another time.  I felt like I came to a sudden stop, and I looked around.  I was in space and below me was a purple/blue planet.  I stayed without thinking anything just enjoying the planet for what seemed like a minute but could have been much longer.  Then a voice starts talking in the back of my head.  It keeps saying The General over and over.  I felt like I was The General, I felt like this planet under me was under my control.  I was king, I commanded it.  I was filled with confidence, I felt great because I WAS great.</p><p>The voice stopped a said simply Whats your decision, General?  Before I could answer my sprit was thrown back, pulled, and ripped from the spot, and put back in my body.  I looked up and say one very concerned friend (one that was using cannabis) asking if I was OK.  I had not moved in about 15 min and they thought they had better make sure I was there.  I assured them that I was just having a good trip.</p><p>That is the way my first trip happened.  But Salvia divinorum doesnt allow linear time for the user.  To my memory, I remember the trip correctly, but I do not remember actually moving from the kitchen to the garage.  Also from the time of my first hit to the end, felt like 10min where it was closer to 30min.  Ever since then I have been more confident.  I do at times feel like I control the world; I decide my own fate.  It was great. I loved it.  If there is anything I learned it is to be more confident, and I am MUCH more confident.</p><p>I think I used just the right amount for me, but everyone is different.  I was able to trip, but I did not get up and walk around.  I thoroughly enjoyed the use of Salvia divinorum and plan on using it again.</p>"
}
