{
 "title": "Different",
 "author": "Mr. Sean",
 "citation": " Mr. Sean. \"Different: experience with 4-Acetoxy-DET & Nitrous Oxide (ID 25476)\". Erowid.org. Mar 8, 2006. erowid.org/exp/25476",
 "substance": "4-Acetoxy-DET & Nitrous Oxide",
 "bodyweight": "170 lb",
 "report": "<p>I had been looking foward to trying this material for months, finally found it and took it today after dinner. I was feeling some negative anxiety before taking it because of some problems with my 'friends', (they were spose to meet me but didnt on purpose), which wasnt very nice, so I was a little sad but tryed meditating for a few minutes before hand, to alleviate any of the anxiety.</p><p>First alert was noticed at +15mins, was nice for talking but was rather mild, I was really expecting it to be ALOT more like shrooms, had the breathing thing going on but not as much as I thought there would be so we decided to go buy some whip cream. We went to the stream in the woods ajacent to the train tracks (not a good idea) we had 9 cans of whip cream and it was just like getting kicked in the head but in a good way, it was one of the most intense things I've ever done, intense spriling visuals whilst coming off the nitrous, there was a world in there first time in was exactly like this negative reacurring feeling everytime I ever abused duster. Its like a flashback feeling where I'm actually there in the first time I ever did duster in my x-gf's bedroom, I felt like I was there. Second time I was thinking woah this isnt even that good and not a second later I was sitting next to a dumpster then in a false childhood memory of getting punched out while aready on the ground. Then I woke up and realized I was leaning WAY to far over the stream and a train comes out of nowhere and we had to jump out of the way. Then we went back for one more  and this time my friend turned into a dragon and we were like demonic royalty breathing out grey smoke and he had a tounge that was split and 6 inchs long, it was some serious shit. </p><p>But then all our sweet sweet air was gone and we were really burnt out and all the magic of the trip was completely gone, we walked around in a haze from the nitrous for a halfhour and after the haze was gone so was the ACO-DET we were basically completely sober.</p>",
 "year": "2003",
 "id": "25476",
 "gender": "Male",
 "timestamp": "2006-03-08T08:00:00.000Z",
 "views": "6099",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "33 mg",
   "administration": "",
   "substance": "4-Acetoxy-DET"
  },
  {
   "time": "",
   "amount": "",
   "administration": " repeated",
   "substance": "inhaled"
  }
 ]
}
