{
 "title": "Discontinuation Preferred to Cold Turkey",
 "author": "Baseline Boy",
 "citation": " Baseline Boy. \"Discontinuation Preferred to Cold Turkey: experience with Venlafaxine (Effexor XR) & St. John's Wort (ID 25507)\". Erowid.org. Nov 19, 2004. erowid.org/exp/25507",
 "substance": "Venlafaxine (Effexor XR) & St. John's Wort",
 "bodyweight": "210 lb",
 "report": "<p>I posted sometime last year describing my decision to begin antidepressant therapy for depression and irritability.</p><p>My decision to discontinue Effexor was based on several things. Most important, I recently got laid off, and without a foreseeable income and/or medical insurance, the thought of going cold turkey in the midst of job search hell was highly undesireable (see below for description of Effexor withdrawal). Second, was the vague sense that most of the positive benefits from taking the drug were a result of the placebo effect -- this seems to be backed up by Wyeth Lab's test data for the original (non extended release) formulation: the data was shocking, in that more test subjects in the non-placebo group committed suicide than the ones in the placebo group. If this was indeed a placebo, than I reason, I'd be much better off taking St. Johns Wort than to be taking this chemical substance whose long term physical effects are completely unknown. Third, since beginning Effexor, I had  felt listless, tired, and my mind kind of foggy.</p><p>I have gone cold turkey on Effexor about 4 times. The first 3 times were just to experiment with the envelope -- to see how bad it might get. The last time I went cold turkey was due to a miscommunication between my doctor and pharmacist that left me without my meds for about 4 days -- I ended up in the hospital, with extremely intrusive, violent, and self destructive thoughts. A shot of haldol and a dose of Effexor later, I was feeling much more stable, and 2 days later I was able to eat again.</p><p>Cold turkey goes something like this: day 1 is mostly okay, but towards the end of the day, the brain shivers (the zaps) become noticeable. These are like gentle electrical jolts that kind of zap through my brain each time I re-fix my gaze upon something or else re-focus my eyes or perception. Look up from reading a book: zap! Look back at the computer screen: zap! It's un-nerving and at worst, it can be very uncomfortable.</p><p>By the second day, I had no energy, and I felt really sad. My body felt kind of achey, and the zaps were becoming very prominent. I felt a vague sense of panic all day long, and by afternoon, I was beginning to enter a sort of vertigo state: I realized I was sitting still in my chair, but my body felt like it was free-falling. And this was not just confined to my body: my whole soul felt like it was tearing in two and breaking up. I lost my appetite by the end of day 2. When day 3 began, after an extremely restless sleep, I was just wrecked. In my first 3 cold turkey sessions I went back on Effexor by the end of the 2nd day.</p><p>I can go on and on, but I'll just say this: a word to the wise -- never go cold turkey on Effexor.</p><p>With all that in mind, I set out to taper off the stuff. Effexor XR does not lend itself to easily measuring a very accurate tapering dose -- the reason is that each capsule contains time release pellets of various size, so even with an analytic balance, one could possibly measure out a dose with the correct weight, but which dumps its load only in the morning, or the evening etc.</p><p>Rant: I believe strongly that it the responsibility of all pharmaceutical companies to provide accurate dose discontinuation kits, especially when they push these drugs on people who probably don't need them. Everyone I've met who was on Effexor has complained that they wish they could stop because of the negative side effects, but the process is just too rigorous, so the only option is to stop taking it.</p><p>I do not possess an accurate balance, nor do I know anybody who does, so I did the next best thing: I eyeballed 14 doses, each with a few more pellets removed from it than the last (150mg tapering to 0mg over 14 days). The day 14 (last) dose had only about 5 little pellets in.</p><p>I started the taper -- and I'll admit this was against the advice of my MD and my therapist, neither of whom has ever experienced Effexor cold turkey I am pretty sure. Anyhow, during the taper, my worst symptom was a mild case of zaps and a slight lethargy. I was sure to drink plenty of water, I took several multi-vitamins a day, and I took large doses of St. John's Wort (not to mention an occasional puff of blessed kind saint marijuana). So I popped my last Effexor capsule on day 14, and after that, things got a bit worse, but not unmanageable like before: I got the 'flulike' symptoms for a couple of days, and I became very emotional over little things. These lasted only about 2 weeks.</p><p>The only lingering effect since I quit Effexor has been an occasional zap, especially when I'm tired or fatigued. While they're not entirely unpleasant, I'm hoping they are not a permanant fixture. Still kind of frightening -- what irreversible damage have I done to my nervous system?</p><p>I am not sure how to approach my depression and irritability. I find that engaging my mind in dialog ('Mind, help me stay positive today') is a pretty effective tool for me. Also I stay busy, try to exercise and eat healthy. I've been unemployed and Effexor free since May, and I seem to be handling it okay (once again, with a little help from my friends).</p><p>Baseline Boy (rhymes with Vaseline Joy)</p>",
 "year": "2003",
 "id": "25507",
 "gender": "Male",
 "timestamp": "2004-11-19T08:00:00.000Z",
 "views": "41820",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 ]
}
