{
 "title": "Worked Fine",
 "author": "Ackysnay",
 "citation": " Ackysnay. \"Worked Fine: experience with Meperidine (Demerol) (ID 25503)\". Erowid.org. Jun 19, 2007. erowid.org/exp/25503",
 "substance": "Meperidine (Demerol)",
 "bodyweight": "145 lb",
 "report": "<p>I drove myself to an emergency room with an extremely painful kidney stone. The stone turned out to be small - about 5mm. In fact, it was so small that I was a bit taken by surprise when it finally came out. Nevertheless, it hurt intensely while it was in my ureter. The pain was so intense I felt like throwing up. I felt hot and sweaty in well-cooled rooms, and the nurses later told me I had turned gray in color.</p><p>The Demerol (meperidine) was administered intravenously. It was probably something like 100mg, give or take (I'd be surprised if it were more than that). About a minute after injection, the stuff did its job: the pain was greatly dulled. It was dulled so much that I drifted off a couple times. Believe me, that's an awfully big transition, from not even being able to sit still. Another effect I noticed was that I felt a bit cooler.</p><p>I wasn't keeping very close track of the time, but I think it was roughly an hour later that the pain started coming back. A nurse came in to check on me, and noticing that I'd begun writhing in pain the way I had when I came in, so she got the ball rolling on getting me some more Demerol (I should really have just hit the nurse call button, which is exactly what they told me). The way I remember it, I dozed off most of the rest of the time I was there. The story ends around the time the stone moved somewhere less uncomfortable (probably into my bladder), ending my pain. I parted ways with the wee fellow less than 24 hours later. The final goodbye probably sounded something like this:</p><p>**whizzzzzzz**</p><p>(short pause)</p><p>**whizzzzzzz**</p><p>Me: That's IT?!</p><p>I count myself lucky.</p><p>Anyway, back to the Demerol. One of the most noticeable things about it was that my eye tracking was terrible while I was on it. Everything kept drifting - I forget whether it was up or down, but it was the same direction the whole time. Before my injection, my voice was shaky, unsteady, and punctuated by a bit of sharp shallow breathing. After, I still couldn't speak normally - only this time, my voice was slow, soft, a little bit high-pitched and drawn out. I couldn't put any expression in my voice if I tried (and I did try). I didn't attempt walking during this experience, but I'm positive it'd have been a major challenge.</p><p>I'm a little fuzzy on exact times, but I believe my last shot came around two hours before I left the hospital. Or maybe it was three hours? Anyway, at this point I was no longer dazed out of my mind, I felt mostly normal and I drove myself home uneventfully and with no significant feeling of impairment other than the residual tiredness. I felt kind of weak, unsteady, and tired for pretty much the entire day afterward; I believe this was due to the Demerol. These feelings weren't so bad, though. The tradeoff was definitely worth it.</p><p>In short, Demerol does what it's supposed to. It's supposed to provide less of a euphoric rush than other opioids - I wouldn't know from personal experience.  While Demerol is not the drug of choice to give to terminal cancer patients or other people with severe chronic pain, it was pretty adequate in taking the edge off my kidney stone, which is often said to be the worst pain one can experience.</p>",
 "year": "2003",
 "id": "25503",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-19T07:00:00.000Z",
 "views": "16196",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "IV",
   "substance": "Pharms - Meperidine",
   "form": "(liquid)"
  }
 }
}
