{
 "title": "Death and the Neverending Thought",
 "author": "Crispy",
 "citation": " Crispy. \"Death and the Neverending Thought: experience with Amanitas & Salvia divinorum (10x extract) (ID 25539)\". Erowid.org. Nov 12, 2003. erowid.org/exp/25539",
 "substance": "Amanitas & Salvia divinorum (10x extract)",
 "bodyweight": "140 lb",
 "report": "<p>Background:  I had used salvia a couple times, smoked marijuana, and drank alcohol. This had been the extent of my drug use till the amanitas. The amanitas and salvia combo was no doubt the most terrifying ordeal of my life.</p><p>Dose:</p><p>I had ordered amanitas off the internet and had been very anxious to try them. I ate around 10-15g of the mushroom straight, with candy in between bites to lessen the bad taste.  We headed to a party and after an hour or so I felt a bit dizzy and figured that's all that would come of it. After getting bored with it, me and a friend went into the bathroom to smoke some salvia.  By this time I was sweating, and shaking at the same time. I now see it was from the mushrooms. Anyways I managed to take a deep hit of the salvia and hand the bowl to my friend.  This was my first time with 10x.</p><p>Experience:  I remember the toilet fading away and me crawling into nothing. Next thing I knew I was clawling at the bathroom wall and I was in the tub. I was yelling about getting to the bridge on the other side.  Everything I saw was geometrical and cartoon like. Soon my high let off, but I could still feel the salvia 'weight' leaning against me.</p><p>This is where the mushrooms started to kick in. I lay on the ground and closed my eyes. I watched lines of color pulse to some sort of energy and I felt I was the center of it all.  People asked me questions that I could repond too but I kept my eyes closed and was in a trance state.</p><p>The next part of the trip was the most horrific experience of my life.  I found myself caught in a neverending loop of thought. (I found the same ordeal in another report, interesting) each time the thought would cycle, it would speed up. I felt I was in some sort of hell, destined to experience this loop forever.</p><p>Then it ended and I heard music (later to find it was from the tv) I could name the song right now. I was feaful of what was next in my hell.  It was my life. The life I had failed.  Frame by frame, backwards. My hell was to experience my life moment by moment and to feel all the pain I had caused and had felt. I saw my dad looking over my dead body, I tried to call his name but my voice was weak and he could not hear me. I felt helpless, lost, forsaken. I then realized I was not only to repeat my life moment by moment, but everyone on earth. Everyone that had ever lived. I was to experience every pain of any human being that had ever lived. This was terrifying to the greatest extent. This was my hell, I had failed my test of life and deserved it.</p><p>Then I came back to 'reality'. I called the name of the lord. I cried for God. I moaned I was sorry and to take me back.  I thought it was my second chance (was it my second chance?)  I ran to the hallway to tell people of the lord and his mercy. No on was around so I ran back to the room and made my friend sit down. I explained to him that I had died, gone to hell and had received a second chance. I talked to him for around a half hour with little response from him. I told him I was an angel and that my whole purpose was to change him and that the lord was the only way. This life is a test and the worldy things so important to us now are nothing in the next life. </p><p>I laid back down hoping I had passed my second chance and not knowing if I would awake in the morning.</p><p>I did</p>",
 "year": "2002",
 "id": "25539",
 "gender": "Male",
 "timestamp": "2003-11-12T08:00:00.000Z",
 "views": "23011",
 "dose": [
  {
   "time": "0",
   "amount": "12.5 g",
   "administration": "oral",
   "substance": "Amanitas",
   "form": "(dried)"
  },
  {
   "time": " T+ 1:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
