{
 "title": "Good and Easy",
 "author": "Jerkoff",
 "citation": " Jerkoff. \"Good and Easy: experience with Zolpidem (ID 25558)\". Erowid.org. Mar 21, 2006. erowid.org/exp/25558",
 "substance": "Zolpidem",
 "bodyweight": "140 lb",
 "report": [
  "<p>I remember the first time I ever tried ambien, my friend came over to stay for the weekend and brought some of his with him, (10mg's each). He suggested that I try it with him, he had told me that it was extremely fun, so I did. We both popped 1 pill each, for me the effects have never taken more than 20 minutes to kick in. The high is always very pleasurable for me, and I have been using ambien to get high for over 4 months, I have somewhat built up a tollerance for it, as did my friend but he stopped using it for a month and then started again and the tollerance had completely vanished, like he had never taken it before.",
  "The high, on 10mg:",
  "slight double vision, very talkative, good mood, not shy, a good numb body high, physical activities are very fun and I've also noticed that when I am around people, the high somewhat intensifies, I have found it to be very pleasurable.",
  "20mg:",
  "quite a bit of double vision, good mood, slight loss of coordination, still very talkative, not shy AT ALL, I could tell your deepest darkest secrets to a complete stranger, a very good body high.",
  "30mg:",
  "extreme double vision, good mood, extreme loss of coordination, still very talkative, no shy at all like always, this high is quite risky as 30mg is quite a bit.",
  "10-30mg:",
  "I've noticed something somewhat weird with all the doses that I've taken with ambien, its weird but fun. I've noticed that if I lay down and close my eyes and think about a certain thing long enough the image will form in my head, and I've actually caught myself talking to people that I've seen.</p>"
 ],
 "year": "2003",
 "id": "25558",
 "gender": "Male",
 "views": "9218",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2006-03-21T08:00:00.000Z"
}
