{
 "title": "Rage and Energy",
 "author": "A night of PCP",
 "citation": " A night of PCP. \"Rage and Energy: experience with PCP (ID 25571)\". Erowid.org. Mar 22, 2010. erowid.org/exp/25571",
 "substance": "PCP",
 "bodyweight": "190 lb",
 "report": "<p>The night started like any other one.  I was chilling with my friends at the hill, smoking a few joints and relaxing.  A couple of my friends walked by and told me that they were doing PCP later.  I hadn't done any chemical drugs in a long time, as I respect the health of my body to most degrees.  For some strange reason though, I decided that tonight was the night to do PCP.</p><p>I had experimented with the substance before, but never a strong dose, only little samplers.  I know how bad the stuff is for you.  I decided to do a full out dose of 20 mg, knowing that would be the perfect amount for me to explore a more full PCP high.  I split the 20 mg dose into two seperate lines and inhaled.  I decided to wait a few minutes, then smoked another joint to help bring the effects into motion.  That's when the energy started to come.</p><p>Everything was so intense and extreme.  I never had such a sense of what was really real infront of me, which is strange because one would figure that a disassociative would do the opposite.  Violent thoughts ran through my head constantly.  I had mental pictures of fighting my close friends, and complete strangers.  Luckily I wasn't so out of control that I acted on these thoughts, though I can understand how a higher dose of this substance would make a person lose that control.</p><p>I ran, I jumped, I did pushups for no reason, I was king of my own reality.  Everything was so easy to achieve with my hands... but I couldn't think well at all.  Matters of might were nothing, yet matters of mental were impossible.  They call it dummy dust for a reason.</p><p>After returning home, being around 3 hours from taking lines, my roommate was watching the movie Blade 2.  What better movie could a man on PCP want?  I found myself mesmerized by the blood and gore, wishing that I could take place in the fighting.  Did I mention that I'm a passive blood wuss in real life?  That's the power of this substance.  Anyway, after watching that, it was late and I decided to try my hand at sleep, which I knew wouldn't be easy.  I stayed up all that night thinking about kung-fu, then went to work the next day with a massive headache.</p><p>That is all.</p><p>Use don't abuse.</p>",
 "year": "2003",
 "id": "25571",
 "gender": "Male",
 "timestamp": "2010-03-22T07:00:00.000Z",
 "views": "7494",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "PCP",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(fresh)"
  }
 ]
}
