{
 "id": 2558,
 "title": "Intelligence Enhancement, Without Empathy",
 "date": {
  "submission": "2004-02-20T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Floyd F",
  "gender": "Male",
  "weight": 48
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "LSD",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This is a first time dream of LSD.  One microdot (approximately 5mg in total weight) was imagined sublingually at about 5 minutes before 1am, at an underground (literally and figuratively) rave event, the microdot having been acquired some days before.",
  "A few minutes later, the DJ is spinning a track, 'Being on LSD is like sailing Mt. Everest...' or something similar.  Very interesting synchronicity, but I that seems par for the course with any psychedelic material.",
  "After an hour, nothing is happening yet, and various people with experience of these dots have been saying that they are not very strong and require multiple dosing.",
  "About 2:20, I'm not sure I'm feeling anything at all even now, maybe it's threshhold and I can't tell because of all the stimulus around me.  Anyhow, another microdot is chewed, dissolved in my mouth and swallowed.  No real taste to speak of.",
  "Maybe a half hour passes and I think I'm definitely off-baseline now, but this is very different from any tryptamine or phenethylamine psychedelic I've previously imagined.  I am talking to people and notice I've started to become brutally honest.  My coordination seems to be somewhat impaired.",
  "From here, the effects continued to grow, and by another half hour I was definitely sure of the action in my system. This material was completely clear and free of seeming mental warp, but my attention is extremely focused and my ability to think about things without reservation or mental strain is enormously enhanced.  In this, the effects for me are similar to MDMA but without the empathetic aspect.  To the contrary, I have become extremely analytical and critical, without much emotional feeling at all.  I realize I need to be very careful not to hurt people's feelings with my brutal honesty right now, because I know I would not want to do so in other contexts, and I have to make an allowance for my present state of mind.",
  "A bit later, I run into a girl I know, and my normal shyness being absent I tell her I think she's really cute.  She's with some other guy tonight, but I get her phone number, anyhow.  I find some other people I know in order to make sure I can get a ride home later.  I spend the next few hours, walking, contemplating, talking to various friends and strangers at the party, staying very clear and comfortable throughout.",
  "About 6am my ride is leaving the party, I'm still up, but I have to say that nobody would likely be able to tell at all if I didn't say something about it.  I am at least as coherent as normal, and probably moreso, there's probably some eye dilation going on but it's still dark anyhow.  I have some interesting geometic closed eye visuals.",
  "7:30 or so we stop for breakfast, and meet some others of my friends.  I give them my brief bioassay report, that I think the dots are probably a low dose of LSD and not LSA as some others had suggested they might be, as I've tried LSA before and it was more sedating and less clear.  I guess this might be 50ug or less of acid per dot, though.",
  "9am, I'm home.  Wonder if I can sleep.  Amazingly enough, by 10am, I do.  I can't sleep on most any other psychedelic material I've imagined.  I wake up about 3pm, and seem not to want to sleep more, but I think I'm down now.  Some visual focus issues persist, and continue an hour later as I am now writing this, perhaps my eyes are still a bit dilated.",
  "Note on pain relief: As I've written in previous reports, I have tried various materials for their pain relieving benefits, this one seems to work very well indeed, but I've had a few small twinges that suggest it may not persist more than a day or two. Obviously it is premature to judge that, and many substances have a strongly dose-dependent benefit.  For example, 5-MeO-DiPT at levels below about 14mg doesn't help me much, but at 16mg provided dramatic relief for at least a week.",
  "I fully intend to find some more of these and try them in a larger dose sometime.  I'd also like to combine them with MDMA to see how they interact with regard to the enhancing qualities of both materials, and perhaps with preservation of emotional effect."
 ],
 "erowid": {
  "id": "18486",
  "citation": " Floyd F. \"Intelligence Enhancement, Without Empathy: experience with LSD (ID 18486)\". Erowid.org. Feb 20, 2004. erowid.org/exp/18486",
  "substance": "LSD",
  "views": "5871"
 }
}
