{
 "title": "A Beautiful Thing ...",
 "author": "Dan_zig",
 "citation": " Dan_zig. \"A Beautiful Thing ...: experience with Mushrooms & Syrian Rue (ID 25619)\". Erowid.org. Jan 29, 2008. erowid.org/exp/25619",
 "substance": "Mushrooms & Syrian Rue",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "1.75 g",
  "oral",
  "Syrian Rue",
  "(seeds)",
  "",
  "1.75 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>(This will have been my third experience)</p><p>11:00 PM last saturday night, some friends of mine come cruising up to the house, one is leaning halfway out the window with his shirt off saying 'bring your shrooms man!'...so I knew it was going to be a strange night from that right there.</p><p>We got to my friends sister's house, where we were house sitting. I had never been there, so and I had yet to see this place in full light...so I was wary of tripping there. None the less, I ate about a 1/16th, along with the same amount of syrian rue, so I was hoping for the effects of a full 3.5 gram trip. My friend, E we will call him, had eaten cheese earlier, so he didnt want to take rue, but he ate 3.5 grams of mushrooms, and the third of us, R, ate the same dose as I (Rue & Mushrooms).</p><p>We got the VCR set up so we could watch Fear and Loathing as while we tripped, then consumed our doses around Midnight. As we started to feel them, we stepped outside and smoked a J, which sped up the process. It all hit me hard and fast, I was the last of us to be swept away...R kindof curled up on the couch and did nothing...waste of our mushrooms that we so kindly gave to him was what I was thinking...E and I headed outside after some time...about when the peak was coming on...</p><p>It was nightime, we were in a place we had never been before...we had no idea of our surroundings...so we did some exploring...we ended up sitting alongside the house, tripping hard, muttering things to one another...but we were both too self absorbed at this point, or perhaps too absorbed in our surroundings...to carry on a conversation. I remember being very pleased that I was enjoying these with such a good friend. We went back into the house, and explored the house we had never been in before, looking at the possesions, trying find out what kindof people live here...too strange...trying to find a flashlight to go exploring with...listening to the movie as it droned on in the background.</p><p>E and I were outside again, still going pretty hard, I had a shovel for some reason...it must have been about 1:45 am...</p><p>around 2:30 am at this point, we're sitting around outside talking...the dog is wandering around us, the dog seemed very human, I could sense how it was feeling, as if it was speaking to me. Along the side of thehouse a motion activated light goes on, and I see a dead mouse on the pavement...strange...now the trip has mellowed out...I'm more talkative...E and I explore around the back of the house where we find some chairs and a pool on a big concrete pad. We get skateboards and roll about, talking about everything, Im seeing people in trees...we're philosophizing about society....our selves...friends...life...everything makes so much more sense. We end up laying on the pavement, looking at the stars, still talking, having the most fun I've ever had...so enjoyable...</p><p>We head back inside....its 3:30 am, we watch the last half of the movie Old School...that was wierd...then he went to sleep (we had to be up at 6:30 am the next morning). I decided I wouldnt sleep, so I just wandered around the house. Around 5:30 when the sky had just began to light up, I went walking. I walked down the road, my shirt is now gone as well...its pleasant enough though...the willows around me are full of leaves rangeing from green to yellow and red...all the colors so vibrant.</p><p>Im staring out over a conyon, at the top of some houses driveway, when I realise there is someone at the window of this strange house looking at me. So I walked away and found a different spot to see the sun rise...I hiked through the woods, and came to a hilltop. the sky was a range of pinks purples oranges and yellows, the clouds warping still.</p><p>This was indeed all in all the most satisfying trip I have ever had...Syrian Rue is indeed a great enhancer, and in teh summer when its too hot to trip by day, trip by night, and experience sunrise through during the afterglow...I was left with a great feeling about myself, my friendship with E seemed much better now...almost like brothers... and everything in general was just beautiful.</p>",
 "year": "2003",
 "id": "25619",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-29T08:00:00.000Z",
 "views": "3399",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  },
  "1": {
   "time": "",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
