{
 "title": "Extremely Poisonous?",
 "author": "Unwitting Victim",
 "citation": " Unwitting Victim. \"Extremely Poisonous?: experience with AMT (ID 25615)\". Erowid.org. Sep 22, 2008. erowid.org/exp/25615",
 "substance": "AMT",
 "bodyweight": "",
 "report": "<p>Ingested orally 17.5 milligrams in capsule... the night before I had done quite a bit of codeine but that was probably a very small part of the problem... as it was about a day later that I tripped and was feeling completely normal up until the ingestion of the AMT... no other drugs were consumed at the time.</p><p>The trip was as described by most except the peak for me was a close to death experience. My body lost feeling as if the blood wasnt reaching most parts of it, even my face. I commenced to have heavy relentless panic attacks as well as the feeling of physically being extremely close to death. I told my friends to call an ambulance around 5 hours after oral ingestion. It was an extremely small quantity so it may have been an alergic reaction but my body barely survived.</p><p>I was plugged into an IV and recieved 4 full plastic bags of nutrients into the bloodstream as well as several calming shots and I was plugged into oxygen. I survived but beware. I reacted extremely bad to a low dose of smoked DMT as well so it may be a problem with tryptamine. I felt extremely poisoned and a complete drainage of my seratonin resulting in panic and near physical death. if anyone knows anything about this kind of ridiculously extreme reaction to such a low dosage please report it as well so I can figure out the causes. 3 other friends with me ingested the same dosage and tripped hard but never reached my reaction level. The dosage may have been under-estimated but I am pretty sure it was not more than 20 mg.</p>",
 "year": "2003",
 "id": "25615",
 "gender": "Male",
 "timestamp": "2008-09-22T07:00:00.000Z",
 "views": "5674",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "17.5 mg",
   "administration": "oral",
   "substance": "AMT"
  }
 ]
}
