{
 "title": "Exotic Ending",
 "author": "Jimmy",
 "citation": " Jimmy. \"Exotic Ending: experience with LSD (ID 25641)\". Erowid.org. Oct 14, 2007. erowid.org/exp/25641",
 "substance": "LSD",
 "bodyweight": "168 lb",
 "report": "<p>Place of Experience - Devon, Eng</p><p>Date - June 2003</p><p>Confusing games of chess with my companion (Jeddy - also his first time); normality disappearing entirely; walking endlessly through a small wood by my house (now known as Gandalf's forest); and lying in long grasses, our eyes swimming with blue / white tabpoles in the sky.  After much two-ing and fro-ing, when the light began to fade (Time roughly being 7.30pm - 6 hours into the trip), my 'partner in crime' had to head of home.  From here on in we were both to be taken on a trip of a life time with our new friend 'Sid'.</p><p>On arriving back home I had to briefly interact anxiously with my unaware parents, which though was a very strange experience as I felt awkward and unwelcome in their presence, it was also a very amusing one.  For some reason I couldn't stop chuckling under my breath; it was this uncontrollable behavour which lead me away from them.  This Paranoia was by far the worst moment of my trip, and could have been where it started to go wrong.  I found though by quickly leading myself away from the cause of this bad emotion, it soon left me.</p><p>For the next few hours I watched what would turn out to be the best TV I had ever seen in my life, feeling strong emotions for nearly everything that I saw.  Even the commercials were causing me to react emotionally, and for the first time in my life television actually moved me.  To stop me from waffling, I will now cut to the 'exotic' finale of my trip.  After listening to late night radio for a few hours, at about midnight, I decided to turn off my bedroom light and cut off all sounds.</p><p>At first, I just felt that I couldn't sleep, and tossed and turned beneath sweaty bedsheets.  But then, without much warning, unbelievable visuals enveloped my entire thought pattern.  My body and mind were taken over by exploding blossoms of deep red flowers, bursting and unraveling in magnificent light before me.  With my eyes either closed or open, these images just kept on coming.  By now my mind was being taken on a journey which I had no power to stop, and I was feeling such raw joyous emotion, that I never wanted it to end!</p><p>With each new image, none lasting more than a second, my emotions gradually began to build.  A wall of colour had taken up position as a pivotal point in my mind, and from each side of this the images now pushed through.  Faces entangled in vines forced through as if they were escaping from a jungle, straining their expressions as if they were being chased:  yet I never at any moment felt scarred one bit.</p><p>My bed now had no physical presence in my mind, for all I knew I was floating on thin air, and my room was simply an extention of space.  Throughout all my visuals this feeling of complete alienation from the world stayed, and ever since my bed has taken on a strange aura of nostalgia.  The final visuals which left a strong memory were the most bizarre.  The wall had all but gone, but the exotic theme seemed to remain.  Large, naked, overly bloaled olive skinned ladies appeared, and their skin seemed to be pulsating as if something was trying to push through from inside.  I never saw one of their faces, just their huge, distorted bodies.  I can remember my thought patterns distinctly; a dark, warm feeling came over me.  It was as if their was a presence, not in my room but in my mind, and a glowing sensation engulfed my stomach and lower body.</p><p>Time by now was non-existant, and I have no recollection when my trip ended and sleep began; I'd put a rough estimate that I slipped into somber at around 3.30am, nearly 12 hours since taking the tab.  Since this first trip, I have yet to take Acid again, but will soon be embarking on a weekend of 'being with Sid'.  ;-)</p>",
 "year": "2003",
 "id": "25641",
 "gender": "Male",
 "timestamp": "2007-10-14T07:00:00.000Z",
 "views": "3289",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
