{
 "title": "Pure, Unadulterated Pain and Intense Puking",
 "author": "bornagain",
 "citation": " bornagain. \"Pure, Unadulterated Pain and Intense Puking: experience with Anadenanthera colubrina (ID 25664)\". Erowid.org. Jul 28, 2003. erowid.org/exp/25664",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "190 lb",
 "report": [
  "<p>Bob (we'll call him Bob) decided to try Yopo. [Erowid Note: The term 'yopo' is traditionally used in reference to Anadenanthera peregrina.] So he toasted four seeds and then ground them to a fine powder, mixed said powder with some baking soda in a less than 1/1 ratio, Yopo  predominating of course, lined the whole mess up and proceeded to snort the whole cocktail rapidly in through both nostrils until it was all gone, bye-bye.  This, my friends was his mistake and his mistake alone, as he soon found out.  Actually, by soon I mean 5 seconds after finishing the line of nutty smellling powder. This was when Bob came face to face with the most intense burning, flesh ripping pain he had ever felt explode in his nasal cavity and sinuses.  The burn very quickly grew into an overwhelming and complete swelling, throbbing pressure throughout his entire head.  Witnesses say his head and face turned purple like a grape, his eyes nearly bugging out of his head.  He paced with frantic energy. First to the bathroom.  should he blow it out?  No, wait! His girlfriend was about to try some.  back to the kitchen.  sweety, no!!! Don't try it!  Back to the bathroom.  Back to the kitchen.  Back to the bathroom. ",
  "He was confused with a rush of manic, panicky energy and the pain was just too much so he grabbed a kleenex and started honking gobs of Yopo snot into it-- elapsed time: about 2 mintues; and before he could even finish blowing that shnozz of his, the most intense and complete and certain wave of nausea overcame him.  Holding the vomit back he stripped naked.  His girlfriend came in: 'Oh my god! You don't look good at all.  You're bright red, no purple!'  Bob was burning up all over.  from his shoulders up he was beat purple and sitting on the edge of the bath tub in a panicked stupor unable to decide whether to puke his brains out, take a shower to cool off, or call 911.  Well, before he could make that decision, the spirit of El Yopo must have called him to its porcelain throne, because there it was where he knelt on bare knees before the Gods and after a couple of false starts projectile vomited into the toittee- elapsed time: 5 min. ",
  "The hallucinations came on strong during the vomit.  Eyes closed, Bob saw those squiggly snake designs pullsating at warp speed.  Eyes open and things had that shifting, distorted look they get from the ubiquitous seeing of after images.   Also, Bob saw stars.  Not unlike after an unhealthy huffing session or a clean knock to the head.  Everything was sizzling with these stars.",
  "Bob felt a little better and went to lie down.  By now he was already starting to come down.  the hallucinations weren't nearly as intense (10 min or so after the beginning) and the pain, throbbing, and nausea were still distracting him from the trip.  after a while the pain and nausea went away but kept returning with lesser intensety at unpredictable intervals, in waves, waxing and then waning, waning and then waxing, as so did the intoxicating effects too-- the visions came and went.",
  "Finally, about an hour later, after barely any effects were perceptable and Bob was feeling glad that he was still alive (and wondering how, too, after his head had nearly burst, or so it felt) Bob left with his girl friend to the store to get a second dinner since his first was sacrificed to El Yopo.  At the store, a surprising wave of euphoria and clarity told Bob this trip wasn't quite over yet.  Boy, I sure had fun shopping!, he told his girl friend.    Bob went home, ate, and went to sleep experiencing strange but forgotten dreams throughout the night.",
  "At last, after a full night's rest, Bob woke up the next day feeling like a goddamned million bucks.  No joke, this Bob was happy, focused, even tempered, and reborn anew. What the hell was all this Yopo shit all about-- self abasement, or deliverance? Bob will surely never know... unless, perhaps, he tries it again another time.</p>"
 ],
 "year": "2003",
 "id": "25664",
 "gender": "Male",
 "views": "35093",
 "dose": [
  {
   "time": "0",
   "amount": "4 seeds",
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina",
   "form": "(ground / crushed)"
  }
 ],
 "submissionDate": "2003-07-28T07:00:00.000Z"
}
