{
 "title": "My Experience, Two Years Coming",
 "author": "Mr BS Humor",
 "citation": " Mr BS Humor. \"My Experience, Two Years Coming: experience with MDMA (ID 25706)\". Erowid.org. Jul 31, 2003. erowid.org/exp/25706",
 "substance": "MDMA",
 "bodyweight": "160 lb",
 "header": [
  "DOSE: T+ 0:00",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 0:30",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 1:00",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 1:30",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>I read up on MDMA my freshman year in college, back in 2000. It was here that I decided that, while I was not interested in drug use of any kind at the time, were I to ever go that route, Ecstacy would be my first try.</p><p>More than two years later, in the spring of '03, the timing turned out just right. I overheard my best friend and this girl I had been seeing off and on (she didn't want to commit to a relationship) talking about holding an E party. I decided that I would like to participate. I, understanding the importance of comfort with this drug, helped design the setting, mix some of the music, and pick the guests. The party consisted of ten people that all knew each other in a small house with a big backyard. I openly told my best friend that I would pay for the pills and help set up the house, but I could still back out if I didn't feel sure of myself. With his assurance, I went ahead with the party.</p><p>My reasons behind it were simple. I had a girl present who cared a lot about me, and a very good friend there as well. Both of these individuals had rolled a number of times before, and I knew that I could trust them to help me through any conceivable problems (anxiety, bad trip, etc.).</p><p>I took my pills over the course of two hours in half-pill doses, but it took more than an hour for my first dose to take any effect. I guess it's true that on your first time, you don't know what your feeling, so I may have been touched beforehand without knowing. My female friend came late and took her pills well after I was under the influence. What I first noticed were physical effects. Rush of blood to the head, warm feeling, 'soft' visuals (kind of a slow motion).</p><p>I believe my case may have been unique in that I did not expect the drug to do anything to me. The feelings I felt were ones I had come across naturally, in both intensity and duration. The sense of euphoria and connection especially. What I noticed was how Ecstasy helped me focus those feelings easier. Conditions did not need to be as perfect. I could talk to anyone on their level, and, paying special attention to the music, I was able to get a sense of being 'surrounded' by it, able to hear the different parts simultaniously focus in. That was truly amazing.</p><p>Back to the female friend of mine. I will always remember this half-hour we spent on a trampoline in the backyard talking. See, she was constantly letting her fears of past relationships get in the way of us. We had talked before about becoming a couple, and it just wasn't going to happen. That night, she came to me and asked ME out, telling me she couldn't push me away anymore. We talked about how the fears were still there, but there was no need to let them control our lives. It wasn't a talk that we couldn't have had sober, but it would've been so much harder to ever reach that point had we not been in each other's company and rolling. I was worried that she was using the pills to get here, and wouldn't be as confident in the morning, so I, keeping my head, told her that I didn't want it to be 'the drugs talking,' and that I would ask her the next morning if she still meant what she said. She did, and we became a couple.</p><p>What you have to understand is that we had that 'relationship' talk a month before, and it wasn't going to happen. We were both scared, and a very recent breakup meant she was simply unable to step out on that ledge again (maybe ever). Being able to have her see me and me be with her while high on Ecstasy gave us an entirely new perspective on who we were and who we wanted to be with each other.</p><p>I'm thankful for the boost given to us, but I also believe that it wasn't the pills that did anything for me, it was my faith in the experience and the connection that we had (which was magnified through the Ecstasy) that allowed us to take what we considered a very large step. MDMA didn't create anything between us, it just channeled what we had in a more direct route, and removed our doubts and fears of uncertainty so we could discuss our feelings truthfully and simply.</p><p>Outside of gaining a girlfriend, the night was great. I have always loved to dance, and I learned a lot about myself through my movements that night. I also had never noticed so many single blades of grass (and that was pretty much the tone).</p><p>Also, I was so thankful to have my best friend and my (girl)friend there to be with me and to introduce me to the experience. That was probably the best part. I wouldn't have ever been able to be as comfortable and willing without either of them.</p><p>Our high lasted about 6 hours, hers going well into daylight because she started so late in comparison. The short time my girlfriend and I shared under the MDMA shaped the beginnings of this relationship in a very loving and caring way, and it has been a very strong aftermath. I have yet to take any more MDMA or do any other substances to date, but I plan on rolling with my (now) girlfriend in a private setting sometime soon so that we may continue what started that night privately. As for my best friend, he was able to tell me how much of a friend I was, and I was able to see that I had been neglecting his friendship over the past couple of months, and Ecstasy helped me reforge my bond with him.</p><p>So amazing, I would recommend it to everyone, but understand that comfort and security must be number one. This is not a drug that works by taking over. It merely lets you enhance the good feelings you have anyway.</p>",
 "year": "2003",
 "id": "25706",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-31T07:00:00.000Z",
 "views": "10817",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 1:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
