{
 "title": "Easy Preparation",
 "author": "Gnostikoi",
 "citation": " Gnostikoi. \"Easy Preparation: experience with H.B. Woodrose (ID 25702)\". Erowid.org. Dec 23, 2003. erowid.org/exp/25702",
 "substance": "H.B. Woodrose",
 "bodyweight": "220 lb",
 "header": [
  "DOSE:",
  "5 seeds",
  "oral",
  "H.B. Woodrose"
 ],
 "report": "<p>I've been reading some of the HBWR reports, and I saw a lot of complicated ways of preparing them.  I really couldn't say whether it increases the potency of them to perform all kinds of extractions, etc., on them, but I've used them a few times in a really simple way that's been perfectly adequate.</p><p>When I use them I take five seeds, stick them in a teacup with about a cup of water, and microwave them for 45 seconds.  Then I fish the seeds out, chew them up thoroughly, and wash them down with the water.  That's it.  After the brief microwaving they're soft enough to chew without any problem, and although they're slightly bitter the taste is really not all that unpleasant - they sort of remind me of peanuts.</p><p>Two things I should point out are:</p><p>1.  The source that I buy my seeds from guarantees that they are not treated with pesticides or other chemicals.  That's why I don't bother with scraping the outer skin off.  If you're unsure about this, you may want to take the time to do that step.</p><p>2.  Every time that I've taken them I've experienced some nausea.  Typically I will throw up once or twice.  This doesn't bother me - it's not violent projectile vomiting like what I've experienced with ayahuasca and AMT, and it doesn't go on for very long.  I consider it a minor cost of the trip.  If you really hate throwing up, you might want to try one of the more complicated preparations, although it seems to me like many people go through a whole lot of steps and end up throwing up anyway.  Up to you.</p><p>As far as the experience, I really enjoy LSA.  It's something that I like to do alone - the first time I tried it was with other people, and I ended up retreating to a bedroom upstairs by myself.  I like to find a comfortable place to lay down and just watch the ceiling tiles move around.  It's much less intense than LSD, at least at this dosage, but I find it actually more pleasant in many ways - something about it seems somehow warmer, softer, and gentler.  For me, it's an extremely sensual drug; not particularly in a sexual sense, but in the sense that I'll end up slowly writhing around on the bed just because it feels GOOD to move.</p><p>Fun stuff.</p>",
 "year": "2003",
 "id": "25702",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-23T08:00:00.000Z",
 "views": "29162",
 "dose": {}
}
