{
 "title": "An Experience in Itself",
 "author": "Catatonia",
 "citation": " Catatonia. \"An Experience in Itself: experience with Dimenhydrinate (Dramamine) (ID 25717)\". Erowid.org. Oct 14, 2007. erowid.org/exp/25717",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "425 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I've done a few drugs in the past, but I wanted to experience a halloucinagenic. I heard that dramamine, at the right dosage, can make you trip. I can get most kinds of drugs when I want for a good price, but I remembered that I had some lying around the house, so I decided to look into it. I did some research to find the right dosage. Since it was my first time taking any halloucinagenic, I took less than what most other reports took.</p><p>So one night I slept over a friend's house and waited until his mom went to bed. Once she did, I downed 8 1/2 of the 50 mg pills. They tasted horrible, almost enough to make me want to gag. My friend just smoked some pot instead. I downed them with some soda and went on the computer to pass the time. Not too long after that I began to feel lightheaded and bit stoned. My stomach felt very heavy, as if I swallowed a big rock, so I decided to lay down on the couch. I just laid there and waited for the effects to kick in. Every now and then I though I saw something move out of the corner of my eye, but looked and realized it was nothing.</p><p>About 30 minutes after taking the pills, I began to notice objects 'breathe', but only for a few seconds then stop. Then I would notice a small little 'glitch' in my vision fly past me. I stared at the white ceiling and noticed big black blobs form and move around, but even after seeing all this stuff, I thought nothing of it and decided the drug hadn't affected me at all except for an upset stomach. My friend and I proceeded to go upstairs to the bedroom. It was hard to stand up, I felt like I had just gained 100 pounds all in my lower body (stomach and legs).</p><p>We layed there and watched TV, but I can't remember what was on. I remember looking in the corner of the room and seeing a poster that said 'WANTED: DEAD OR ALIVE', but alive was crossed out, and there was a bunch of small print underneath it that I could not read. I stared at it for a short while, but eventaully it faded away into nothing. For the next 1 - 2 hours I began to notice more and more visuals, such a the lamp shade bending and things changing shapes into other things, and audio effects, such as people calling my name and strange growling (which wasn't scary, just weird).</p><p>About 2 hours after taking the pills, I got up to turn off the TV and I could barely move. My body was so heavy it was hard to sit up. Once I got the TV off, I quickly laid back down before I fell. It was as if my body was drunk but my mind wasn't. When I laid back down in the dark room, my stomach bothered me so much that I didn't want to move at all. I just laid there and watched all the small visual effects take place. I went to rest my hand upon my chest, but when I did, my hand melted through my chest. I got really freaked out and quickly moved my hand away from my body. I did that about 5 more times later on.</p><p>About a half hour later, I closed my eyes and relaxed, except my legs wouldn't stop twitching and it really started to piss me off. They would twitch violently about every 30 seconds. It didn't really bother me, it just got very annoying. When I closed my eyes and laid there for a while, for some reason I thought I was playing a video game. I had my hand out as if I was holding the controller, I was not aware I was doing this at the time, and I was 'pressing the buttons' to control what I was seeing in my mind. I really did think I was playing a video game, even though I was just laying on a bed in a pitch black room with my hands out. When in the video game I died, I jumped up and yelled 'Shit! I died', only to realize I imagined it all, but at the time it seemed all so real. I had many experiences like that where I would be seeing myself in a conversation somewhere else and I would jump up and realize I really wasn't. Eventaully I fell asleep. I slept for about 13 hours that night and when I woke up, I felt great.</p><p>The overall experience was pretty good. The only bad things were the bad stomach discomfort and the twitching, but other than that it was fine. I probably will try Dramamine again, maybe in slightly higher dosage, but it's definitely not an everyday drug.</p>",
 "year": "2003",
 "id": "25717",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-14T07:00:00.000Z",
 "views": "5152"
}
