{
 "title": "Light Blue Hue",
 "author": "alphaOdure",
 "citation": " alphaOdure. \"Light Blue Hue: experience with 2C-C (ID 25729)\". Erowid.org. Jul 30, 2003. erowid.org/exp/25729",
 "substance": "2C-C",
 "bodyweight": "170 lb",
 "report": "<p>Having limited exposure to phenethylamines (besides your over-ordinary, same old MDMA), i seized the oppurtunity immediately to acquire some 2c-c.  With a few experiments below 50 mg, i concluded i needed to push this further; i wanted to get to know 2c-c a little better, so to speak.</p><p>So i decided to dose 55-60mg in middle afternoon.  I had fasted all day for good measure even though 2c-c has given me little to no nausea in the past.  Interestingly enough, the chemical took just over an hour in a half to completely come up.  The visuals were very colorful (and were considerably increased after cannabis use) but different than tryptamines (things seemed less alien, visuals were more comforting and subtle).  I actually wasn't anticipating any sort of strong experience seeing how the day prior i dosed 4mg of 5-meo-amt (i know there shouldn't be any cross-tolerance between PEA's and tryptamines, but still...) and the day before that, 40 mg of 2c-c.</p><p>One visual alteration that remained consistant was a light blue hue noticed in all white/offwhite colors.  During the peak this was accompanied by vein-like patterns of blue, red, and yellow that seemed to crawl, suspended in space, over any lightly colored surfaces.  Objects also seemed to breathe. but beyond all this there wasn't all too much in the area of visual disturbances.  There was however a distinct magical sparkle attributed to everything that sort of made me grin all the time.  It was almost as if i was noticing this energy w/in everything that was a constant source of euphoria through out my trip.</p><p>There seemed to be little negative body effects.  In fact, i remember feeling extremely relaxed and inhibition-free, somewhat similar to low doses of benzo's or GHB but without the highly sloppy, intoxicated feeling (although there was some of this, but not at all in a sickening, posioned fashion like w/ alcohol).</p><p>All in all the experience lasted about 5-6 hours and rapidly dropped off at the 6 hr point.  It seemed to have very little character of its own and seemed to be somewhat mild.  At the same token, it seems to be a wonderful substance to use in social settings comfortably.  2c-c seems to be very friendly and not pushy at all, even in higher doses.  Because of this, it seems to me to be good for first time trippers or experienced users to just chill w/ some bud and friends for the night.</p>",
 "year": "2003",
 "id": "25729",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-30T07:00:00.000Z",
 "views": "11876",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "55 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  }
 }
}
