{
 "id": 2573,
 "title": "Smokin' Tree Datura",
 "date": {
  "submission": "2002-10-30T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lysenergy",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Brugmansia",
   "form": "flowers"
  },
  {
   "time": "0:05",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Brugmansia",
   "form": "flowers"
  },
  {
   "time": "0:10",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Brugmansia",
   "form": "flowers"
  }
 ],
 "report": [
  "Two days ago I was walking with my wife through Waikiki. We have noticed three different Tree Daturas growing in the surrounding area. Since it has been calling my name for quite a while, I picked one a brought it home to dry.",
  "2 Days Later.....",
  "I have read many of the reports on datura in newsgroups, this site, lycaeum, and just about everyone else. The one thing that all trips had in common was. People who EAT it, go to the hospital. So I decided to smoke it. Smoking is better because you can have a bit, wait for 5 minutes, have a little more, wait another 5..... This is what I did; I cut of the bottom half of the colored part of the flower. Smoked a quarter of that (effectively 1/32 of one flower) I already felt strange, a bit off balance. I waited and when I felt that I hit a plateau, I smoked another bowl. This time I felt the beginnings of a strong body stimulation. I waited and then again one more bowl.... OH SHIT!! The dry mouth is HARDCORE!! NO JOKE. I had a headache earlier that night and decided to try it anyways considering that I heard it can give you head aches. I got rid of my head ache at first, but then it came on like a migrane. I kept laying down and getting back up, because my head hurt worse when laying down. Everything would bend when turned my head or moved my eyes. Once my head ache lightened up, I laid down and closed my eyes. I could see vague images that would become very real when I wasn't paying attention. All in all, it was fun. Next time I will try more. I think the secret to Datura is going slow, try a little, then gradually move up in subsequent sessions. Three hits, hit me hard. Mabe the best effect would be to crush it up and mix it with Mary J. ONLY A LITTLE. She doesn't let go easy."
 ],
 "erowid": {
  "id": "18537",
  "citation": " Lysenergy. \"Smokin' Tree Datura: experience with Brugmansia (ID 18537)\". Erowid.org. Oct 30, 2002. erowid.org/exp/18537",
  "substance": "Brugmansia",
  "views": "33741"
 }
}
