{
 "title": "Misuse Was a Mistake",
 "author": "Czekmayte",
 "citation": " Czekmayte. \"Misuse Was a Mistake: experience with Trazodone (ID 25757)\". Erowid.org. Jun 21, 2006. erowid.org/exp/25757",
 "substance": "Trazodone",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Pharms - Trazodone",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>During the time I was having a horrible benzodiazepine withdrawal (from Klonopin or clonazepam, to be exact) I was looking for any way to calm the tremors/shakes/insomnia without having to spend any money.  At the time, I was taking 40mg of Celexa twice a day, 50mg of Trazodone twice a day, and .5mg Klonopin twice a day.  Here's the beginning, where the benzodiazepine withdrawal started:</p><p>I went to see my psychiatrist one day for a check-up and to get my prescriptions refilled.  He decided to take me off of Klonopin cold-turkey (I had been taking the three medications for sixteen months), and three days after that I started noticing that 'something' wasn't the same.  I couldn't eat, sleep, or do any regular daily activities.  I had several annoying and/or painful abdominal pains and cramps, my head felt like it was on fire, and at time it felt like I was being pricked with thousands of needles on certain parts of my body.  This is when I decided to try to do something about it, or at least to be able to eat and sleep.</p><p>After two weeks of going through the withdrawal, I had lost nine pounds and I was getting three to five hours of sleep per night.  I was still taking my Celexa and Trazodone regularly, but it wasn't helping.  I got some diphenhydramine and it didn't help.  I also got some melatonin.  It helped to an extent, but every day would be the same 'hell' I'd go through every day of the withdrawal.  Something had to be done, or else I would have to go to the emergency room.</p><p>I had read somewhere online that Trazodone not only induces sleep and helps depression, but can also help tremors and shakes.  I was thinking this is just what I needed, just at a larger dose.  I woke up one morning and took 200mg of Trazodone.  I became very hungry, I ate a lot (but became a little nauseous), and then fell asleep for four hours.  I didn't notice the Trazodone actually helping the withdrawal symptoms from the Klonopin, but at least I was eating and sleeping again. </p><p>That same night at around 10:00 CST, I took eight of my 50mg Trazodone pills.  A total of 400mg.  I didn't get hungry or tired, at first..  I was just real 'zonked' out.  I started getting tired about two hours after ingesting the pills, so I went to bed.  When the lights are off in my room, it's very dark.  Pretty much pitch-black until my eyes adjust to the lighting situation.  This time, my eyes never adjusted.  And after about five minutes of looking around into the darkness, I started seeing things.  Not really 'hallucinations', but things in my peripheral vision and especially 'under my eyelids'. </p><p>I saw shapes (mainly triangles), blobs of color, and lines that seemed to 'come at me'.  I stayed awake for four hours dealing with this; it would not go away if I closed my eyes.  The only other drug I've experiences something like this on before is DXM, but it was a still a little different.  I eventually fell asleep (I can't remember how), and I woke up feeling really weird and that lasted pretty much all day.  That's when I realized it wasn't a good idea to abuse the Trazodone.</p><p>I eventually ended up at the emergency room anyway because I couldn't stand the benzodiazapine withdrawal anymore (about two weeks into it).  I was prescribed a LOT (not only larger sizes, but more than I needed for the next three months) of Klonopin and started taking them immediately.  I cut the 1mg pills in half so I'd still take my dosage, .5mg twice a day.  Since then, everything's been real good.  I even joined a different mental health service which is a lot more understanding and comfortable than my last one.  Anyway, that's another story.</p>",
 "year": "2003",
 "id": "25757",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-21T07:00:00.000Z",
 "views": "69293"
}
