{
 "id": 258,
 "title": "Lengthening the Roll",
 "date": {
  "submission": "2006-12-13T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "GreenDragon",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have rolled on MDMA about a dozen times and I wanted to pass on some advice on how to make the roll last a little longer.",
  "So this is what I do: After I start to come down from the first MDMA pill, (usually 3-4 hours after ingestion) I take one 200mg pill of SAM-e. SAM-e is an over-the-counter 'mood stabilizer' that you can find at any drug store. The SAM-e usually kicks my roll back up for another hour to and hour and a half. Then, after the SAM-e finally begins to wear off, I ingest my second MDMA pill. Then, once again after about 3-4 hours of rolling when I come down, I take another 200mg of SAM-e. Taking this 200mg of SAM-e after I begin to come down off of each pill always boosts my roll back up close to peak levels.",
  "I have found that taking SAM-e helps bring back the roll farely well. It's cheaper and probably better on your body than taking 4 whole hits of E in a night. The SAM-e helps bring back a stronger roll when I smoke a clove cigarette or two a few minutes after ingesting the SAM-e.",
  "Ihere seems to be a limit on how much SAM-e is helpful.  I took 800mg of SAM-e one night during an MDMA roll, and crashed REALLY hard the next day. Taking 400-600mg, however, seems to work perfectly for me. I have found also that taking 100-200mg of the dietary supplement 5-HTP helps with the 'blues' that one feels the next day or two. I also take 500mg of the amino acid, L-Tyrosine for depression. I usually take it for a few days during the week after an ecstasy roll until I don't feel so depressed.",
  "Taking the SAM-e might not do anything for you, but it sure seems to work for me. Happy rolling, and take care of each other!!"
 ],
 "erowid": {
  "id": "10344",
  "citation": " GreenDragon. \"Lengthening the Roll: experience with MDMA (Ecstasy)  & SAM-e (ID 10344)\". Erowid.org. Dec 13, 2006. erowid.org/exp/10344",
  "substance": "MDMA (Ecstasy)  & SAM-e",
  "views": "10093"
 }
}
