{
 "title": "Surprisingly Intense: Keep Sitter, Don't Eyeball",
 "author": "anjovis",
 "citation": " anjovis. \"Surprisingly Intense: Keep Sitter, Don't Eyeball: experience with 5-MeO-DMT (ID 25819)\". Erowid.org. Aug 4, 2003. erowid.org/exp/25819",
 "substance": "5-MeO-DMT",
 "bodyweight": "80 kg",
 "report": "<p>I wrapped a cup from aluminium folio that was folded four times. I inserted it into tip of a pencil and made a fume pipe from another pencil by screwing the core out.</p><p>I put Massive Attack's 100th Window into my playlist, put headphones on and lit my lighter. The whole 5-meo-dmt was in one big crystal of size around 5-7mg, which was unfortunately simply eyeballed from a large amount. It all vapourized at once and I sucked the fumes inside with ease. Fumes didn't taste at all. I put all my stuff down beside me and laid down with a pillow behind my head. I kept the fumes in for some 15 seconds before I exhaled.</p><p>T+15s At that point it hit. I felt like I was accelerating with enormous speed to somewhere, my pulse shot to probably 150 and I had the most intense rush of my life. First my fingers and toes went numb, then the whole body followed. My field of vision begun to vibrate and thought I better close my eyes. I cannot say how long that peak lasted but it seemed to last forever. I didn't know if I still had my eyes open or shut. I was accelerating in some sort of space with the speed of light. I could feel music, it was squeezing my head into pancake, the whole space was pressured with this very intense music, that I couldn't even recognize then. I felt that this was getting too much, I must have overdozed or something. I didn't have anybody to watch out for me. I panicked. I was sure I was going to die, that was the end.</p><p>I cannot remember everything, but next thing I can tell was that I begun to feel nauseous. I fought it a little while but then it became so strong that I had to lift myself into sitting position and grab my headphones off. I grasped breath and the trip came to a sudden end with no music. I still didn't have any feel in my limbs and walking was very shaky. I went to kitchen to get some juice and put the stuff back to their places. Afterwards my mind was numb for over half an hour, I tried to listen to music in vain, everything seemed boring.</p><p>T+1.15 I went to bed.</p><p>The next couple of days I got immense rush each time I listened to those couple of songs I had been listening while tripping. This effect, which you could call flashbacks I suppose, diminished and finally vanished after some 3 days. This experiment sure taught me two things. First, keep sitter every time a new substance is tried and second, don't eyeball the dose.</p>",
 "year": "2003",
 "id": "25819",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-08-04T07:00:00.000Z",
 "views": "6680",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
