{
 "id": 2589,
 "title": "Seeds Do Work",
 "date": {
  "submission": "2005-08-04T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "The Mad Hungarian",
  "gender": "Male",
  "weight": 116
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 g",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "(tea)"
  }
 ],
 "report": [
  "I remember reading a report about a guy who made a tea out of poppy seeds and drank it to good effect. However, the report was second-hand in that the lab rat himself did not report it but a friend of his did. I had a pleasant experience once with pod tea, but I really did not believe that the seeds contained enough opiates to be effective. I was incorrect in my assumption. Seeds do work, and quite well. I decided to repeat the recipe as close as possible.",
  "I went to my local grocery store and purchased five bottles of poppy seeds weighing sixty grams each for a total of 300 grams. The report said the guy used 400 grams, but around my area the bottles cost five dollars each, so not wanting to spend too much on something I didn't think was going to work, I just stuck with the five bottles. I also purchased one lemon, as this was an ingredient in the tea. Here I differed a bit from the recipe in that it called for the juice of three lemons. I suspected the lemon was used due to the acidic nature of its juice, which would help draw out the goodies in the seeds. The thought of drinking down the juice of three lemons was unappealing, so I only used one.",
  "Upon arriving home, I opened all the bottles and dumped the contents into a glass container along with the juice from the lemon. I boiled two and one-half cups of water in the microwave and then added that to the glass container. I put a lid on top of the container and shook the contents well for about thirty seconds. Then I simply let my tea steep for twelve minutes. After the time was up, I strained the seeds from the liquid using my hand, as the container was oddly shaped (difficult to pour) and I did not have any coffee filters lying around. The color of the liquid was a milky white with a yellowish tint to it. It smelled very earthy, and of course, still like poppy seeds. The taste was not bad at all, the lemon helped by giving me something familiar to hold onto even though it was a bit sour.",
  "I decided to drink it all in a few gulps rather than sipping it over time. I did a few chores around the house to kill some time and see if anything was going to happen. I didn't have to wait too long ;). Around the twenty minute mark my mouth suddenly became very dry, and I began to feel a slight head change, but not much more. I went inside to get a soda and check my eyes in the mirror. (My pupils usually constrict a good deal on opiates.) My eyes looked normal though, and I felt almost completely sober. Slightly disappointed by the relative lack of activity so far, I decided a nice way to relax would be to go soak in my hot tub for a bit.",
  "During the thirty minute soak, I began to feel a release from my worries and a loosening of the joints in my body. Wow I thought, this hot tub is working wonders for me today. It was not until I got half way out of the water to cool off for a minute, and the night air hit me, that I knew I was under the influence of a divine plant. The wind felt like little electric sparks against my wet skin as my altered senses tried to comprehend the transition between the hot water and cold air. When I got out of the water, my legs felt heavy and my gait was a bit unrefined. I could feel the lovely flower essence pulsing in me. There was definitely a very pronounced body high. As I made my way into the house, I stopped by our good old friend the mirror to take a little look see. My pupils were quite small. I felt as if I had taken 15-20 mg of hydrocodone. The feelings of pleasure and relaxation continued to increase for another half-hour, finally reaching a high point about two hours after ingesting the tea. Effects could be felt through the entire evening and for about half of the next day.",
  "Whew! The seeds work just as well as pods in my experience. I just have to brew enough of them. By the way, the seeds were obtained at a regular market, not some specialty store. I had such a good time trying seed tea that I did it four more times, with success each time. The feeling I get from the tea vs. pharms is kind of like the difference between LSD and mushrooms for people who have been blessed to share in their joy. They are different, but the same.",
  "Let me leave you with words of caution. Although I enjoyed myself greatly, this was not a mild experience. I am a big guy, 5' 10', 255 lbs. This large of a dose could make another individual very ill, or worse. Never drive or drink alcohol while on opiates (or any other drug). And please remember, just because people choose to ingest something that is commonly available, does not mean there is not potential danger in it. Take care, be safe, and have fun."
 ],
 "erowid": {
  "id": "18570",
  "citation": " The Mad Hungarian. \"Seeds Do Work: experience with Poppies - Opium (seeds) (ID 18570)\". Erowid.org. Aug 4, 2005. erowid.org/exp/18570",
  "substance": "Poppies - Opium (seeds)",
  "views": "49012"
 }
}
