{
 "title": "Master Tripper",
 "author": "The Dark Dragon",
 "citation": " The Dark Dragon. \"Master Tripper: experience with DXM (ID 25917)\". Erowid.org. Dec 14, 2007. erowid.org/exp/25917",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "report": "<p>[Erowid Note: Over 1,000 mgs of DXM is considered an extremely high dose, see DXM Dose Chart]</p><p>I have read many trip reports on here that talk about amazing trips that people have taken on doses of 500-750 milligrams. That much is NOTHING to me! Not that I don't get really messed up, I just like a fully dissasociative dose!</p><p>BEFORE TRIP: I never eat anyting for at least 5 hours before my trip. I wait until I'm not jumping up and down hyper, but not falling alseep either, around 4 or 5pm.</p><p>START: I usually take 1-1.2 grams at the start. I wait for about an hour for stomach pains or vomiting to stop. I then sometimes took another .5-.7 grams.</p><p>MID-TRIP: I feel my body slowly dissapear into the bed. I become the bed. Being an inanimate object, I feel so comfortable in my place as though I couldn't move or breathe. I feel my body twist and turn through infinate space and time. I fall through the bed, going through the foor, and into oblivion. People occasionally stop by, match a bowl of bud, and check up on me. I try really hard to communicate, but my words are slurred and robotic. I hear voices all around besides the friends in the room. As I try to stand to see them out, I find I cannot stand at all. I am too heavy. I fall back into my world.</p><p>END: After about 5 hours of this, I begin to gain a connection with the world again. I turn on the TV to end the trip. I smoke a bowl or two to calm down and bring the DXM up a bit. I am unable to sleep for about 4 hours after that.</p><p>Many people claim to trip DXM a lot and are experienced, but try that dose every 4 days for... well, going on months now. The Dark Dragon will soon rise to be recognized. I am the TRIP GOD!!!</p>",
 "year": "2003",
 "id": "25917",
 "gender": "Male",
 "timestamp": "2007-12-14T08:00:00.000Z",
 "views": "4408",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "DXM",
   "form": "(powder / crystals)"
  }
 }
}
