{
 "title": "One Step Below Pleasant",
 "author": "Noimportant",
 "citation": " Noimportant. \"One Step Below Pleasant: experience with Lorazepam (ID 25938)\". Erowid.org. Feb 12, 2004. erowid.org/exp/25938",
 "substance": "Lorazepam",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "2.0 mg",
  "sublingual",
  "Pharms - Lorazepam",
  "(pill / tablet)"
 ],
 "report": "<p>A buddy of mine was perscribed Lorazepam, but said it made him queasy and dizzy.  I'd heard Lorazepam was a cousin of Diazepam (Valium) and having always wanted to try Valium was eager to give Lorazepam a try.</p><p>0:00  I took 2mg the first time.  The instructions on the bottle advised dissolving the pill under my tongue.  This was one of the most bitter and scathing tastes my mouth has been subjected to.  I had a friend who bit his nails, so he bought this stuff that you paint on your nails that makes them taste vulgar so he would stop.  As a joke, he  smeared the stuff allover my hockey mouthguard.  The taste never left my mouthguard and made me wretch for thirty minutes.  This was how the Lorazepam tasted, and whats worse i had to do it twice because the pills were 1mg each.</p><p>0:30  When the horrid taste eventually left my mouth, my stomach felt somewhat weakened and kind of bubbly.  It had been half an hour since I'd taken the pills but I was starting to regret it.  I lay down and watched some TV and started to relax a little and the burning sensation in my stomach became only a memory. </p><p>1:00 This stuff takes ages to come up on.  After a full hour I still felt nothing.</p><p>1:20  There was a shift in the way both my body and mind felt.  However, it was only very slight.  It wasn't even pleasant.  It was sort of a slightly headachy, stressed feeling in my head mixed with a weak pleasant sensation in my body.  I was hoping that these were just unpleasant coming up sensations</p><p>1:40-2:30  This would be the peak, if you could call it that.  The feelings in both my body and mind were similar.  Although I started to feel a little bit relaxed, and my body felt good, and I definitely felt a shift from normality, I was still very underwhelmed.  In fact I was bored.  I felt tired, but I couldn't really be bothered to go to sleep, and i felt too stupid to read or watch TV or do anything.  And lying down on the couch with the tv on was all I was capable of, and it wasn't exciting.</p><p>Around 2:00 it intensified a little bit, sending me into a brief hazy stupor.  When I stood up to go to the washroom I found my motor skills somewhat affected, and my body heavy and cumbersome.</p><p>3:00 It was hard to tell if the effects were from the Lorazepam or just fatigue, but I just felt stupid and sleepy, and thus I slept.  I had no problem sleeping, but didn't feel very refreshed when I woke up, despite the fact I had seven hours of sleep.</p><p>Aftermath:  None.  I achieved nothing because of this trip.  The effects weren't significant enough to be called bad, but they certainly weren't good enough to even be called pleasant.  I tried Lorazepam twice after this, and was subjected to the same godawful taste and boring effects.  I have some more pills, but I'm pretty sure I'll throw them away or just forget about them. </p><p>I heard that Lorazepam is about 1/10th the strength of Valium.  I could still imagine Valium being good, but Lorazepam has certainly taken away a lot of my excitement.  Altogether I'd give Lorazepam a thumbs down as a recreational drug.</p>",
 "year": "2003",
 "id": "25938",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-12T08:00:00.000Z",
 "views": "58515",
 "dose": {}
}
