{
 "id": 2593,
 "title": "I'm the Old Me Again",
 "date": {
  "submission": "2003-11-06T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zola",
  "gender": "Female",
  "weight": 55
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam"
  },
  {
   "time": "0",
   "amount": "4.5 mg",
   "administration": "oral",
   "substance": "Hydergine"
  }
 ],
 "report": [
  "Ive taken the regular dose of both piracetam and Hydergine. I took the first dose yesterday, and other one today. While Im writing this report Im under the influence of the second dose, which Ive taken 1 hour ago.",
  "I decided to take it after reading other reports and talking to friends, for 2 reasons: 1- I expect taking this 2 smart drugs with ecstasy pretty soon. 2- Ive been feeling great changes in the way my mind used to work. I forget things much more easily nowadays and sometimes I feel a difficulty that I never had before when exposing an idea. Im sure this symptoms are due to long term uses of marijuana, ecstasy and alcohol.",
  "But let's get to my experience. I slept only few hours, and I was feeling pretty tired when I took the dose yesterday. after about 40 minutes, I felt much less tired and I was extremely alert. Then, I went to meet my friends in a pub near my place.  Talking to them I couldnt stop talking. The ideas flew so easily, and my arguments seemed so convincing that I saw the old me again. (Im a very inteligent person, my IQ is 152 and, besides, Im a jornalist, argumentation is my best quality. But nowadays Ive been feeling I lost part of it.)",
  "I smoke a lot, but dont feel like smoking that much under the influence. I also drink a lot, but I wasnt feeling like drinking either. Nevertheless, I drank anyway - and I completely disrecommend that. You get drunk much more quickly, and when drunk under piracetam and hydergine, the easy flow of thoughts becomes confused and uncomfortable. Also, I started to feel a little nausea. Not like the ones I get when Im really, really drunk. But a nausea that I once felt under ecstasy - like if I had a air ball stuck in my throat, and I desperately needed to burp.",
  "But now, under only piracetam and hydergine, here in my work, Im extremely happy with what I feeling. Ideas flow easily, I have just written a cover issue that Im really proud of, like once I was of every paper of mine. Im the old me again, and that makes me feel extremely self-conscious and happy. I feel none of the posible side efects, like headaches or nausea.  The only thing I feel is that Im alert, concentrated and thinking clearly."
 ],
 "erowid": {
  "id": "18581",
  "citation": " Zola. \"I'm the Old Me Again: experience with Piracetam, Hydergine & Alcohol (ID 18581)\". Erowid.org. Nov 6, 2003. erowid.org/exp/18581",
  "substance": "Piracetam, Hydergine & Alcohol",
  "views": "27274"
 }
}
