{
 "id": 2594,
 "title": "Ghosts of a Friday Night",
 "date": {
  "submission": "2002-11-01T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Danguba",
  "gender": "Male",
  "weight": 71
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": "T+ 2:00",
   "administration": "0.5 tablets",
   "substance": "oral"
  },
  {
   "time": "MDMA",
   "administration": "T+ 3:00",
   "substance": "1 tablet"
  },
  {
   "time": "oral",
   "amount": "MDMA",
   "substance": "T+ 4:00"
  },
  {
   "time": "1 tablet",
   "amount": "oral",
   "administration": "MDMA"
  },
  {
   "time": "6:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0"
  }
 ],
 "report": [
  "About a month and a half ago I was prescribed 20mg paxil (paroxetine) daily for treatment of a general anxiety disorder.  As a believer in the medicine I have, for the most of the period, avoided all drugs.  Until last Friday. ",
  "I've been invited by a DJ friend to go to a progressive house party he was organizing.  The party took place in a complex called Metelkova City, a former military barracks but now a squat occupied by a group of idealists, artists & club owners.",
  "My primary decision was to stick to alcohol, because, due to the information I've gathered, taking MDMA would be a waste of money & drugs, all this due to the fact that SSRIs are supposed to block the empathogenic effects of this drug.  But as the evening passed and I got more & more drunk (drinking mostly Finlandia + orange juice), my self-control begun to fail and I took half a pill.  Surprisingly I noticed a slight, but distinct feeling pretty quickly, so without much thought I stopped drinking and acquired three more pills. ",
  "Results were pretty much typical MDMA high resulting in a pretty entertaining evening, although I suffered from a few black outs and some happenings acquired a certain dream like quality (did this happen or not? kind of thing).  The interesting thing that I noted was that, although I had a typical MDMA high, it appeared to be a lot more even, with no or definitely less distinct plateau or comedown. ",
  "When the party ended and I sobered up (alcohol wise, I still felt some speediness of MDMA), we ventured to a friends house for a chill.  There I took the last half of the pills I had and, to my surprise, felt no effect at all.  Actually, an hour after ingesting the pill I went straight to bed and had 4 hours of good sleep, waking up feeling slightly distorted from alcohol, but otherwise in good spirits. ",
  "I really don't know what I can make out of this.  I'm familiar with the research done which showed that alcohol can potentiate MDMA effects by increase of the plasmic concentration of this substance.  Is it then possible that MDMA concentration was potentiated to such an extent that it overrode SSRI?"
 ],
 "erowid": {
  "id": "18584",
  "citation": " Danguba. \"Ghosts of a Friday Night: experience with Alcohol, MDMA (Ecstasy) & Paroxetine (ID 18584)\". Erowid.org. Nov 1, 2002. erowid.org/exp/18584",
  "substance": "Alcohol, MDMA (Ecstasy) & Paroxetine",
  "views": "15897"
 }
}
