{
 "title": "Amazing Experience",
 "author": "Ravi shankar",
 "citation": " Ravi shankar. \"Amazing Experience: experience with Muchrooms (P. cubensis) & Cannabis (ID 25975)\". Erowid.org. Jan 15, 2007. erowid.org/exp/25975",
 "substance": "Muchrooms (P. cubensis) & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>My experience with magic mushrooms has been one of the most satisfying, happy times of my life.</p><p>I had been wanting to trip for some time now. I had taken about 0.8 of a gram before of dried P. Cubensis, but I didn't really feel anything. I had been on websites about shrooms and was reading on what they do to you and it started to sound really interesting. One of my friends, J, told me he could hook me up with some good shrooms that bruise blue. I had never heard of blue shrooms before, but they sounded powerful. Me and my other friend D, pitched on a quarter of shrooms. We were both going to take 3.5 grams each. We gave the money to J, and he left to go pick up the shrooms. When he came back, we were disappointed. He didn't get the shrooms. He had taken too long to get there and his dealer had already sold them.</p><p>About a week later, me and J were pitching on a quarter of marijuana for the day. I went to pick up he quarter from my dealer, and long time friend, A. I saw a small mushroom on the ground, and told him as a joke to sell it to some one and tell them they'll get fucked up. He then told me that he had real shrooms. I knew that in the past he didn't sell shrooms because he didn't do them because he had bad experiences. But he said that they bruise blue too, and that a few of his buddies took some and they were tripping. So I told him iI would think about it.</p><p>Later on that night we had smoked almost all of that quarter and there was a few more people over and H's house. H's dad is gone to Europe for 2 months. Every night we just chill there and smoke some weed and get fucked up every night. There were a lot more people there now and some of them were thinking about taking shrooms. We called up A(my dealer), and I met up with him and we got a half of shrooms. I got 4 grams out of it. I gave my friend D a gram, and I took 1.5. I know it doesn't seem like a lot, but you don't know how fucked up I was. My other friends that were there, S, and Adam ate 5 and 3 grams.</p><p>As soon as I finished eating the shrooms, I could start to feel the effects. I got very anxious, and excited for what was going to happen to me. These shrooms tasted REALLY bad so I ate it with some muffins. It killed the taste completely. I went into the other room to listen to some music and feel the shrooms come on clean. I started to get a really warm feeling and very happy. The feeling of Euphoria is beautiful. Things started to get a little more happier and then I went into the other room to see my other friends.</p><p>When I got into the other room, I was just chilling. Still feeling happy, still feeling anxious. I looked at the T.V. and it was starting to get really bright. The colours were alot more noticable. We were watching conan the barbarier, and I remember noticing colours and textures from the T.V. blending together. I was getting a little curious about it, because I realized I was on shrooms, but I wasn't expecting to get these kind of visual effects. I was asking if it was just me or if there was a firey texture all across the tv screen.</p><p>My friend, Jevin told me he took a pill from his boy, O, and he said he was getting fucked up off it. He said it was X, but X doesn't usually come in gel caps. He started to go nuts, and I was just laughing my ass off. It was the funniest thing to me. I don't know why but when I looked back at his face, his smile went so far up his cheeks, it was almost touching his forehead. This was wierd. It was a very different buzz then what I am used to.</p><p>I remember it started to hit me a lot when I looked down the hall and at the front door, and the window was contracting and expanding, and thats when I knew in my mind it was hitting me. I looked over at the book shelf in the room I was in and remember saying something like, 'that book shelf is gonna fall over, there is too much weight on it!'. When I looked at the top shelf, it was as if all the shelfs were folding into each other through the middle.</p><p>I looked over at the T.V. and Jay Leno was on. I looked in his background, and all the buildings looked as if they were melting together and flowing through each other. I remember saying somthing about that but it didn't seem like a big deal at the time. Everything got really blurry and things looked as if they were constantly shaking. It seemed like we were never quiet, constantly screaming about something, and laughing at everything.</p><p>I remember for about 5 minutes, I just looked down at my arm and stared at it because I could see so many wrinkles all over it, like I was 1000 years old or something. I remember looking up at a picture on the wall of a forest, and seeing Jevins face in it laughing. I looked over at one of the trees and the branches on the trees were reaching out of the painting towards me. They were all winding together and spreading out onto the wall. I just said something about it, but nobody payed attention to it.</p><p>I looked into the dining room and there was this mask type thing hanging on the wall. It looked like a native man, and I remember that room glowing bright. The mask asked me to go into the other room, but I told him I didn't trust him and that I was perfectly fine where I was.</p><p>One of the other guys who was tripping with me, S, brought a girl, L. I remember looking back at her head was expanding like a balloon being inflated. Everything people were telling me was coming into my brain, and then intantly forgotten a second later. H kept bothering me to light a joint, but for the first time in a long time, I didn't feel like smoking. This shroom high was just about enough for me. Eventually, I lit a joint, took one hit, felt sick, and then put it out. I looked down at the couch and it was shining bright green. Time was going by so slowing and what seemed like an hour was really only a few minutes. I thought I was trapped in time and I didn't know if I would ever come down from this trip.</p><p>Every face that I looked at was moving and I remember looking at D's face and one of his eyes was on his chin and his mouth was on his forehead. His mouth was moving and it seemed to spiral in my mind. I looked at the T.V. and it was still Jay Leno. It seemed like it was over, but it was still only 5 mintues in. The screen of the T.V. was rippling and even though I knew I was on this drug I still didn't understand what was happening and why I was seeing these things.</p><p>The whole time I had to take a piss, but I was too scared to get up and go to the bathroom because I didn't like the idea of being alone. I thought maybe that native man would try and suck me into his room. Finally I got the courage to get up and go to the bathroom. I closed the door and remember hearing the screaming and yelling that was going on in the back ground start to fade away. I started to piss, too scared to turn around and look into the mirror in case I wasn't really there. I looked at the tiles on the wall and they were moving fast, almost as if they were cars on a highway, speeding. I looked below me and saw the heating vent. It was almost as if it was sucking me in. I then finished pissing and then I looked into the mirror and saw that there was so many little things on my face I didn't notice before. It was like I could see every pore on my face.</p><p>I then went back into the other room. I sat down again and started tripping more. We then decided to go outside, We stepped out onto the porch and looked around. Little nails in the deck looked like crawling beetles to me. I rememebr everything outside looked like it was glowing green. Colours would flash in and out of my vision. I looked at some wood on the deck and it was as if there was a stream flowing through it. I didn't think much of it then. I just stared, trying to capture that image. I can still see it now. That beautiful, peaceful stream flowing through that wood.</p><p>We went inside because we though we heard cops coming into the drive way. of course, there was none. We chilled in H's living room for a while, just tripping and enjoying it. When we started to come down, we were still saying random, wierd things, but I wasn't tripping as much. I was almost completly done my buzz when S started to freak out.</p><p>He said that there was something wrong with his legs. He kept pulling his pants up and looking at his legs. He got up and looked at me. I remember looking into his eyes, all I saw was pure, genuine terror. It got me scared how scared he was. He was saying that we did something to him. He later told me that when he looked at us, it was as if there was something noticably wrong with him, and we knew it, but we didn't want to tell him. Well, he did take 5 grams. We couldn't get him to calm down and he kept getting more and more scared. For 3 hours he was scared and we finally got him to calm down and go to sleep.</p><p>I didn't get to sleep until 5 am and I took the shrooms at 9:30. By about 11:30 I hit my peak and started to come down around 2 in the morning. Shrooms was one of the most amazing times I have ever had in my life. Maybe it was the setting and the dosage was about right, because the time I had last night will never be forgotten. I still have another 1.5 grams and I am going to eat that in a few days.</p>",
 "year": "2003",
 "id": "25975",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-15T08:00:00.000Z",
 "views": "2943"
}
