{
 "title": "Glorious Sleep",
 "author": "Sleepy",
 "citation": " Sleepy. \"Glorious Sleep: experience with Melatonin (ID 25993)\". Erowid.org. Apr 18, 2006. erowid.org/exp/25993",
 "substance": "Melatonin",
 "bodyweight": "120 lb",
 "report": "<p>I have had difficulty with sleep for as long as I can remember. My mother tells me that it took her three years after I was born to break me of being totally nocturnal. I have never slept more than four hours at a time, and as a result, now that I am hitting 30, it's caught up to me and I have been exhausted for about three years.</p><p>A friend at work suggested that I start taking Melatonin, making sure to provide me with a handout on how to take it, because taking it during the day, or too late at night, generally has adverse effects.</p><p>I have been taking Melatonin now for a week, and my sleep, for the first time in years, has gone uninterrupted. I was accustomed to waking up a few hours earlier than I needed before, due to hangovers from over the counter sleep aids, but found that with Melatonin, I could take it at 10pm, be asleep by 11pm.  In the morning, I have gotten up with no hangover effect, and in fact, I've risen up to a half hour before the alarm has gone off, completely rested and ready to greet the day.</p><p>I have not had to adjust the dosage, having lucked upon the right dose for me with the first try.  Sleep is undisturbed, and I have been dreaming more vividly than I ever have in my life due to the attainment of the coveted REM sleep, which had been eluding me before.</p><p>I have not experimented with taking Melatonin at any other time of the day. I refuse to due to the warnings I've received and the research I have done. When taken an hour before bedtime, the right dosage will ease me into a peaceful sleep.  It is difficult to keep my eyes open within an hour, but it is not the sometimes nauseating sensation caused by the Tylenol manufactured, Simply Sleep. It feels completely natural, and it has not altered my mood in any fashion.</p>",
 "year": "2003",
 "id": "25993",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-04-18T07:00:00.000Z",
 "views": "10846",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(daily)"
  }
 }
}
