{
 "title": "Free Thought",
 "author": "Mirfus",
 "citation": " Mirfus. \"Free Thought: experience with Nutmeg (ID 25997)\". Erowid.org. May 22, 2007. erowid.org/exp/25997",
 "substance": "Nutmeg",
 "bodyweight": "140 lb",
 "report": "<p>I don't know how many of these writings actually come from the UK as they generally don't give details either way.  I am therefore letting it be known, from the start that I am in the UK.  This might make it easier for any other brits who want to know more about nutmeg in the UK.</p><p>I spent the day reading up about nutmeg and found many bad stories telling me how nutmeg was a waste of time and, as a rule has no effect.  I was on a break from smoking weed and decided I would give it a go anyway.  Besides, I had read very informative material that nutmeg did give these wonderful 'real dreams'.  I figured that even if it didn't work, jars of nutmeg couldn't be that expensive, what have I got to lose?</p><p>I made sure I knew of all the warnings, like the fact you can overdose from nutmeg (and it seems quite easy to do so).  One article I read told me I should use between 0.75g and 1.25g per 10lb body weight for the dose of nutmeg.  I didn't want to go over board for my first try and after weighing myself at 140lbs I decided to take a dose of 14g of the nutmeg.</p><p>In the same article I read that it was recommended you take nutmeg with a friend.  I advice this greatly also as therefore someone else knows what kind of state you're in, they're feeling it too.  I bought a 50g jar of nutmeg on my way to a party that evening and once there found a grater and reduced the nutmeg to grounds.  I lost the tips of my fingers and drew blood from two knuckles.</p><p>Two friends wanted to join in, so I measured out my dose of 14g and their doses respectively.  I found a little weighing device in the market for 4 that will weigh up to 50g.  We went out into the garden with our bowls of nutmeg, spoons, and water.  I had read it was not a pleasant experience getting the powder down.  The first mouthful wasn't too bad; I managed to get just the right amount of nutmeg in to be washed down by the water without me noticing it.  I put some nutmeg in my mouth then take a big gulp of water to wash it down.  I then tried a larger spoonful to speed up the process and once it mixed with the water in my mouth I nearly choked on it, eyes watering and throat gagging.  I got some more water in there and swallowed down, rinsing out my mouth and throat with water.  I then decided I had to finish what was left in two spoonfuls and just went for it. Nutmeg - Water - Swallow - Nutmeg - Water - Swallow.  The faster I went the easier it is.  You can imagine how much powder 14g of nutmeg produces, with kitchen books telling us that a teaspoon holds 5g.  Only one of my friends managed to get it all down, the other gave up after a mouthful (I think).</p><p>From my reading I found that nutmeg was not a very fast drug to kick in, it takes 1-2 hours to take any effect and between 9 and 12 hours for the 'hallucinations' to start.  I'll let you read about that elsewhere.  After about an hour and a half I was feeling like something was happening inside me, I wasn't quite right in what was going on, feeling a very mild buzz, but different to my 'normal' state of being.  Around 5 hours in I was talking utter crap at a close friend, I found the nutmeg helped to stimulate imagination and free thought, a little like marijuana does.  At one point neither I, nor my friend could stop laughing.  He even lost all energy to talk at one point, sending me a text message consisting of only: 'Too tired - no speak'</p><p>Considering we took the nutmeg at about 9pm, we weren't expecting any of the interesting things to happen until 6am, determined not to sleep, my friend on the nutmeg and I set off to the local park at 5am.  Being outside was quite strange, everything seemed very bright, until we went under trees and things were dullish, seeming quite dark.  We walked through the dark patches and each time the light came back it was very bright, I could almost feel the light wash over my body.  We decided to walk round the lake.  At one point we sat near the water, I found it very eerie to watch the water and the mist being blown towards the lake outlet, like something was sucking it out.  We smoked a cigarette about half way round the lake, part of the experiment I guess, not calling myself a 'smoker'.</p><p>When we got back to the house, 2 hours had passed, we were now 10 hours in and I hadn't had any real dreams yet.  We were very tired and so I found a space on the floor, under a table, and slept.  I slept through everyone leaving the house and when I woke it was only me, the host, my nutmeg friend and the other person who'd tried who were still around.  It was about 11am as far as I can remember.  My companion and I were told there were two free beds upstairs and we zoomed off up.  I slept.</p><p>I woke and it was 4pm.  We all started watching Harry Potter and I was getting into it more than I normally would, though not as much as I would have liked to going by other nutmeg stories.  5pm came round and I was still somewhat dazed, but we had to go home.  I got home at 18:09, exactly 24 hours after I had set off.  I slept, till 10pm.  Then stayed awake till around 4am.  The party was on Tuesday night; Wednesday was spent sleeping and all of Thursday I went round feeling somewhat out of it.  By the time Thursday night came round, I wondered where the week had gone.</p><p>I wasn't feeling 'back to normal' until Friday evening.  The nutmeg 'comedown' lasted a very long time.  I questioned myself and wondered whether it was the lack of sleep that made it last so long and made me feel weird during the night of the experience.  However, lack of sleep doesn't make my mouth dry or my eyes red.  The nutmeg had done that; it also turned my brains to mush for a while, very enjoyable.</p><p>I will hopefully be trying it again, but will take the nutmeg much earlier in the day, so that the 9-12 hour period comes in around 10pm on a party day.  I didn't experience any dream like mind states or any hallucinations but I did have a very good time, feeling very stoned even though I'd not smoked weed for a couple of days.  I therefore look forward to trying it again, next time I'm out of grass.  Perhaps that time I'll get those darned hallucinations.  As they say, 'practice makes perfect.'</p>",
 "year": "2003",
 "id": "25997",
 "gender": "Male",
 "timestamp": "2007-05-22T07:00:00.000Z",
 "views": "4136",
 "dose": [
  {
   "time": "0",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ]
}
