{
 "id": 2601,
 "title": "Long Duration - Psuedo-Opiate Type Experience",
 "date": {
  "submission": "2003-07-24T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mister Bones",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "2:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "3:00",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  }
 ],
 "report": [
  "I tend to work out daily at the gym (weights, cardio machines especially the stationary bike) for about 4 to 5 hours. I tend to over do it as well. I finally decided that I needed to take something to help with the aches and pains and to help me sleep well at night. I ordered Tramadol (generic Ultram).",
  "I started out with 2 tablets (100 mg). Surprisingly I had a slight codeine flavored buzz after about 20 minutes. I had intended to start with 200 mg, however, as I have not used this aid before I decided to start out conservatively. The intensity plateaued at about one and half hours after the initial dose. I felt fairly good and yet the buzz was slightly speeded with a lightheaded opiate like feeling. I was quite surprised as I use various true opiates and am very familiar with illicit (opium and heroin) and prescription opiates (Lortab elixir, Codeine, Oxycotin, Hydrocodone, etc.). I would place Tramadol as better than codeine (Codeine is my least favorite opiate anyway) and slightly less than Lortab and hydrocodone, though I would definitely prefer Percodan, Demerol and Oxycotin.",
  "After 2 hours I boosted with another tablet (50 mg). Though I was slightly agitated and not as calm as I would be with an opiate it was a nice buzz. After another half hour I laid back on my bed and listened to some blues. I just felt very mellow as the agitation lifted.",
  "After another hour I had considered taking another tablet but thought better of it as I was still feeling very good. Instead I consumed a couple of Negra Modelos (Mexican dark ale). This was a nice topper to an enjoyable quiet evening listening to the blues and some light reading. The ale did help to take the edge off of the agitation and made the experience a bit mellower. Note: it is recommended that alcohol should not be taken with Tramadol, therefore I would not heavily indulge in alcoholic beverages while using this drug. The entire experience lasted about 7 hours until the effects wore off. This is about twice the time I experience with other opiates though perhaps not as pleasant.",
  "As a research scientist (Geophysics), I think that I could easily work under the influence of this drug and keep my faculties about me. I may add this drug to my personal pharmacy to help overcome the physical discomfort after vigorous workouts at the gym and to help take the edge off the waning effects of ephedrine and benzphetamine (Didrex) that I use to help me get started for the daily grind of 4 to 5 hours of vigorous exercise.",
  "On a scale of 1 to 10, I would give Tramadol a 7 to 7.5. It was slightly better than Codeine and yet less pleasant than most other opiates that I am familiar with. For the cost and ease of acquisition I would give it a thumbs up. Next time I may use it at the gym for some experimentation for pain control and minor euphoric effects while I abuse my body. I reserve the right to adjust this rating as more experience is obtained. So far the possibilities are encouraging, perhaps in combination with a light dose of Valium or Skelaxin.",
  "- Mister Bones"
 ],
 "erowid": {
  "id": "18611",
  "citation": " Mister Bones. \"Long Duration - Psuedo-Opiate Type Experience: experience with Tramadol & Alcohol (ID 18611)\". Erowid.org. Jul 24, 2003. erowid.org/exp/18611",
  "substance": "Tramadol & Alcohol",
  "views": "154821"
 }
}
