{
 "id": 2603,
 "title": "+4, Words Are Inadequate",
 "date": {
  "submission": "2003-12-19T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "fict",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "joints/cigs"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "At the time of the experience, I was perhaps four months into my relationship with Wuzzle, and was quite happy in that relationship at the time. There wasn't too terribly much going on in my life, but I was feeling quite removed from my environment. Nothing seemed to be quite getting through to me; nothing was evoking any serious emotional response. Feeling the need to knock myself out of this daze, I went about acquiring 1/4 oz of P. Cubensis, which weighed out to be just over 6 grams. Go figure. Originally, there were to be three of us participating, but an unfortunate series of events left the third participant in a terrible state of mind, and she decided to back out. Given the circumstances, I can't say that I blame her.",
  "I weighed out 2 grams of mushrooms for myself, and 2 grams for Wuzzle. At about 10:00 or 11:00 PM, we started eating them. Ritz crackers and peanut butter. Delicious. Flesh of the gods. By midnight, things were starting to get interesting, but certainly not serious by any means. We played around a bit, just talking shit as usual. Wuzzle's roommate, Guzzle, wanted to smoke some pot. A joint was rolled, and then smoked between the three of us.",
  "That's about when things started getting serious. The visuals suddenly shot up perhaps 3-fold. Waving my arm left trails that remained suspended in the air for subjective minutes. The walls of the apartment were dripppppiiinnnng down to the floor, and there appeared to be faces poking out through the plaster.",
  "'You Okay?'",
  "'Yeah. It's just... it's a bit much is all,' I tell Wuzzle.",
  "I continue sitting on the couch, staring straight ahead.",
  "I move from the couch to the floor, and start looking through my CD collection for something happy.",
  "I flip through the pages, then close the book, and flip through them again. Then again. Then again. My eyes started tearing up. None of my CD's looked appealing. Every single one was a depressing mess. All of this music, and not one single, bloody, fucking stupid goddamn piece of shit HAPPY CD! FUCK. Eventually, I found some up-beat house music and put it on, but my mood didn't really change. I knew things were going to start going downhill if something didn't change, so I went outside on the landing for a cigarette. I made it to the door, and suddenly had this terrible feeling of despair wash over me... I looked down at the floor and a few tears fell to the ground while I tried to maintain my composure long enough to get the door open and get a change of setting.",
  "Which I did.",
  "But it didn't help.",
  "The floor swirled and climbed and swarmed and slithered around, the walls melted down the floor, the cigarette in my hand twisted around and around. I walked around the landing, just pacing back and forth for a bit, eventually feeling good enough to go back inside again. When I came in, I found that Wuzzle was in her bedroom, comfortably sprawled out on her mattress. We looked through her CD's a bit, and finally stumbled upon The Beatles - Let It Be. Huh. Sounds good to me.",
  "We throw in the CD, hit play... \rbingo.\rHouston, we have enlightenment.",
  "I quite literally found myself sitting in full lotus with my eyes closed, breathing in deep, full breaths of air that have never felt so beautiful. I opened my eyes and listened to the music. I looked at Wuzzle, sitting across from me.",
  "I ask her: 'Are you  ... ARE YOU FEELING THIS?!'",
  "OH MY GOD",
  "Yes. What is this? What have we found!!!??? This is important! Everyone needs to do this! Old people, dying people, my parents, teachers, world leaders, everyone needs to experience this!!! My god this is incredible! What is it? What is this feeling that we've both so suddenly stumbled upon. What is this om that's escaping my lips between beats? What is this crying out of sheer joy!? I'm crying! I'm crying out of the beauty of the world! Everything is perfect! Everything is as it should be! I desire nothing! I see everything as it is!! As it is, it is perfect! This is not euphoria! Insulting! Utterly completely different! Infintely more complex!  This isn't sadness, this isn't joy, this isn't anything at all, but at the same time it's everything rolled up into one. This is the pure white light! This is the color of nothing, completely transparent contains everything!",
  "Think the worlds imperfect?  Wrong.  It's not the world that's imperfect, people. It's you. More specifically, it's your ego. It tarnishes everything you sense. It filters this perfect world and tells you that not everything is as it should be. It fuels desire and hatred and everything ugly. It brings you suffering and sadness and disappointment and expectations. It crushes you Every second of every day and you don't even realize it until the weight has suddenly been lifted.",
  "THIS IS TOTAL SURRENDER.",
  "THIS IS GIVING UP COMPLETELY.",
  "THIS IS FINALLY LIVING!!",
  "This is the Buddha, this is Jesus. This is giving without wanting. This is the poetic genius. This is any number of names under any number of religions anywhere in the world.",
  "Ego is desire. Ego IS SEPERATION!",
  "That's what it is, isn't it!? Seperation from the outside world!? The completely shit-filled illusion that you are seperate! Everything has an inside and an outside and the outside of you is everything!",
  "Adam and Eve, separating themselves from the sacred!",
  "IF YOU HAVE NOT BEEN THERE",
  "YOU DO NOT UNDERSTAND",
  "~-~-~-~",
  "In total, the ++++ portion of the experience lasted perhaps an hour. The most beautiful, complete, perfect hour of my life showed me that every infinitely small moment is the most beautiful, complete, perfect hour of my life.  Two grams of mushrooms.",
  "The experience isn't dose-dependant. It isn't a trip you can chase. It will come to you when you least expect it, and I hope that it is as beautiful for you as it was for me. The drugs serve only as a catalyst. The drugs, however, can only show you the peak of the mountain; its up to you to figure out how to walk the path.",
  "Peace."
 ],
 "erowid": {
  "id": "18620",
  "citation": " fict. \"+4, Words Are Inadequate: experience with Mushrooms & Cannabis (ID 18620)\". Erowid.org. Dec 19, 2003. erowid.org/exp/18620",
  "substance": "Mushrooms & Cannabis",
  "views": "11098"
 }
}
