{
 "id": 261,
 "title": "The Land of The 'Neatz'",
 "date": {
  "submission": "2006-12-13T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zero",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "I have used Salvia Divinorum a total of 4 times now. I considered posting an experience report earlier, but opted not to, since my experiences had not been anything interesting or useful. All experiences were with smoking dried leaves. This was not an extract. I hope this report gives new users a slight idea of what can be expected.",
  "--",
  "Experience #1:",
  "Sitting in my room, I had just received my salvia. I rolled a small amount into a cig, and proceeded to light up. I held in every hit I took. Felt slightly stoned, my visual perception was changed. Going to bed, I felt slightly cold.",
  "--",
  "Experience #2:",
  "The next day, I packed a small bowl, got 2 hits, and held them for as long as possible. Had the same stoned feeling, and laid back down in bed, going to sleep. Had an incredibly vivid dream, that I thought was real, even a few hours after I'd awakened. In the dream, I was in bed (the same position that I was actually laying) and someone came in the door, took a look around, and left. Upon waking up, I thought nothing of it, until I realized that my door had been, and was still locked. I woke up quite refreshed, and felt great.",
  "--",
  "Experience #3:",
  "Yesterday. It had been about 3 weeks since I'd received the Salvia. I packed a bowl and took 3 hits. I felt the effects come on strong. I felt something I hadn't before, a pressure pushing against my back and arms, accompanied by a slight tingling sensation. I proceeded inside and no longer felt the pressure or tingling, the the same stoned feeling I'd had previously.",
  "--",
  "Experience #4:",
  "Today. I had a nice relaxing chair ready next to me. I took the first hit, held as long as I could. Started to take the second hit, feeling the effects start to take ahold. Third hit, I could feel pressure pushing along the back of my body, as well as a slight tingling. I was out of breath when I took the third hit, and didn't hold it in, but quickly took another 4th/final hit. I sat down in the chair with my head back, and closed my eyes, releasing the final hit.",
  "I felt as if the sober 'reality' I had been experiencing just minutes before was washing away to display the 'true reality' of the universe. I was no longer sitting at home, I was in the land of the 'Neatz'. I did not physically see these people, only through my mind's eye. It wasn't a visual hallucination, it was an image in my head. These people were short, but also proportionally small, possesing almost cartoonish looking features (almost like the munchkins in Wizard of Oz).",
  "These 'Neatz' controlled everything that happens in our universe, and lived inside every object. I knew they were watching me, and started feeling pressure at different points on my body. As I felt this, it passed over my neck, and started laughing because it tickled. I temporarily opened my eyes, and perceived my actual surroundings. I was right here at home, but I perceived it as being just a room, somewhere in this mystical realm.",
  "I re-closed my eyes, and could again perceive these odd creatures (although I knew they weren't normal humans, they were on the same intelligence level if not smarter than myself). For a second, although I did not realize I had just smoked Salvia, I knew that this reality was induced. I made a comment out loud about how someone should do a pushup (which was somehow going to make things clearer). I opened my eyes, and was still a little disoriented, but I stood up and walked into my room. Reality has returned, but I still feel slightly buzzed. I turned on the tv, but the sound seemed unpleasant, so I muted it, because I didn't like it being off. I'm gonna take a shower, then I'm gonna finish writing this.",
  "Ok, I'm not feeling the Salvia at all anymore. In the shower, I thought of a few more things to mention. Although I haven't seen the show since I was a child, the 'Neatz' remind me of some of the creatures from Fraggle Rock. When I took the first hit, it was about 11:38, and when I sat down in my room, it was 11:46. This means the strong part of the experience lasted about 8 minutes.",
  "Near the end of that 8 minutes, I remember wanting it to end, but was reminded that in a few minutes, I'd feel better. I apologize if things don't flow logically, or if it seems like there are gaps, It was an extremely new experience, and even though it was vivid, it's hard to describe. I've gained a whole lot more respect for the plant after today's experience, and with a strong experience like this, I fully agree with everyone that says this is not a social drug."
 ],
 "erowid": {
  "id": "10348",
  "citation": " Zero. \"The Land of The 'Neatz': experience with Salvia divinorum (ID 10348)\". Erowid.org. Dec 13, 2006. erowid.org/exp/10348",
  "substance": "Salvia divinorum",
  "views": "3146"
 }
}
