{
 "title": "Fighting with Myself",
 "author": "Claire",
 "citation": " Claire. \"Fighting with Myself: experience with Mushrooms - P. cubensis (ID 26105)\". Erowid.org. Apr 26, 2006. erowid.org/exp/26105",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "53 kg",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Mushrooms - P. cubensis",
  "(tea)",
  "",
  " ",
  "oral",
  "Vitamin C",
  "(pill / tablet)"
 ],
 "report": "<p>I had my 1st trip a week ago in Amsterdam, and it wasnt all good. (English is not my mother tongue and I hope to be able to express myself accurately in this language).</p><p>I didnt know anything about the mushrooms, or their effect, I didnt know that I needed to get prepared. All I knew is that I always wanted to try, and that it was supposed to bring me to some kind of other world, a new way of perceiving things, and nice hallucinations. IK thought Id be able to escape myself. Not necessarily in a negative meaning, but in the sense that I thought the only way to access the world without the philters of our normal and everyday perception was through the mushrooms. I just wanted to perceive things differently. </p><p>I was with friends who had no experience of it whatsoever and didnt want to try. I had a very positive feeling about taking them, until I saw what they looked like. I kept on thinking about it, and by the end of the day, although I was aware of the fact that Id have to eat them, I couldnt even bring myself to touch them with my fingers (Ive always been scared of anything that has to do with death: in my mind, mould has to do with death, and therefore mushrooms, which are just some type of mould, are related to death for me). I thought that if it had been a pill, it would have been much easier</p><p>Anyway, I took them late at night. It was about one oclock in the morning, and we were at my friends place. The TV was on, and I made a tea with the mushrooms, because I couldnt bring myself to eat them raw. Even then, it took me a while to eat them with my tea, I found it really disgusting and was forcing myself. I felt allright, and I knew I had to wait for 45 minutes before it starts. However I was a bit anxious, as I read that we should NEVER take them if we have any second thought about them. So during 45 minutes, I found myself wondering if I had any second thoughts and if I was scared or not, or if I was only scared of getting scared, but at the same time I was looking forward for it to work.</p><p>After 45 minutes, still nothing. I just felt some nice and strange sensations, on the skin of my skull, that I attributed to tiredness. Then I was a bit merging with the floor, but I can do that without mushrooms if I concentrate, so I wasnt so amazed and didnt think it was one of the effects. I then started to giggle, then I was laughing out loud, I was laughing at my friends, and felt relaxed and happy. It lasted for a while, and I was looking at my fingers. I was able to perceive things more acutely, objects were sharper and the lines were more defined, and I could see further than I usually could without turning my head. I couldnt say how long I remained in this state, I thought that was nice but a bit boring and I was disappointed. I didnt expect anything more then. I thought that was it, and that was the peak, and whats all this fuss about?</p><p>Then it started, very progressively. I didnt notice something was wrong then. My friends were making jokes but suddenly they were too sophisticated for me, and language had another meaning. I felt I was losing them, they couldnt reach me and I couldnt reach them, because we were not in the same world, and the words didnt mean the same for each other. They were in the same frame of mind and I was the only one who couldnt participate to their world. So I stared at a folded blanket on the floor, quite far away. The edges of the blanket were getting smoother and the blanket was growing, but it felt quite normal. Then it would come back to its normal shape and texture, and again, until I realised that this wasnt normal and I decided that the blanket should not transform into a big worm, or grow an arm that would reach me, or be alive. And thats exactly what it did: it became alive with some type of mad and blind life, not alive like an animal but rather like a plant, and it was evil. I got scared.</p><p>One of my friend called out my name, to check if I was still with them, and everything went back to normal: I looked at them and they were smiling, asked me if I could see fairies, floating pink elephants or rainbows (they were joking and at the same time trying to give me positive images for my mind to focuse on). Only before I could reply, one of them started to lose his eyes, his eyes popped out of his eyes sockets just like in the cartoons, and my other friend was getting old, her skin was getting moulded and rotten, and the shadow around her neck transformed into a snake. Because she was smiling, she looked even more evil: how can she smile when she is desintegrating with a snake around her neck suffocating you? So I looked at my other friend: asleep, mouth half open: she was growing her teeth.</p><p>I took some suger and Vitamin C, because I assumed that this would stop the trip. Well, it didnt so I panicked: what could possibly stop the trip then??? Then I remembered: nothing. Nothing could stop it. And a piece of sugar was stuck between my teeth, I was trying to get it out with my tongue, and suddenly my mouth became all sticky and my tongue got stuck between my teeth and was growing so fast that soon enough there would be no space in my mouth to keep it and my mouth was locked with stickiness so I got scared of suffocating, then I decided not get that piece of sugar out of my teeth after all, and that things should be normal, and it became normal again. That was a comforting feeling, knowing that I was in control. So I decided that I was tired and my friends were tired too, so we went to bed. I thought that this would be the safe thing to do to escape: sleep.</p><p>Well, that was another mistake: if I close my eyes, things dont disapear: theyre inside of me. And theyre so fast, it all become confusing, everything gets mixed up, reality is not there anymore, nothing to hang on to, words start to have a taste, thoughts start to have a smell, and I was cold, I was shaking, and my friend sleeping next to me was a corpse, a cold cadaver, and soon enough she was only dust, and she was not there anymore.</p><p>I didnt know whether I should keep my eyes open or closed. So I was alone, and frightened. I thought the only way to end it would be to die, but at the same time I was scared of death. Kiiling myself is a thought that kept on coming back to my mind, I wanted to jump from the window, and I had to concentrate a lot to remember that it was only hallucinations, that it would stop, that it was only in my head. Whenever I felt that it would last forever and that I would always be stuck there, I had to tell myself that it was only temporary. For some reason words were very powerful and they were materialising, so I kept on talking to myself, but I had to be careful when chosing the words (for example no negative words like not, because the words in a negative sentence didnt work).</p><p>I decided to open my eyes, because I thought that as long as the hallucinations remained visual, it wasnt so bad. I didnt want anything to touch me, and I wanted to keep things at a safe distance. Visual is fine, because things I see dont reach me, unlike things I can feel. I decided not to have any feelings anymore. I didnt want to move, I didnt want to touch anything, because I didnt know how things would be. Anything that looks solid can become liquid and enter your skin, and I couldnt anticipate what things would do. All I could do was trying to guess and imagine and because I kept on imagining the worst scenarios (eg my stomach is going to develop arms and grow through my throat and prevent me from breathing). And they would actually happen and I had to focuss on some other horror for one horror to stop (so horrible stuff kept on succeding to each other, very fast).</p><p>By focussing on visual things I could cope: life was all around the room, a blind, malefic life, crawling around the walls, everywhere things were alive, but alive in a deadly and destroying and disturbing and scary way, but they couldnt touch me. The bed and the blanket wanted to be alive to, but I shut them up. I had to go with the flow, and accept what I was seeing. I knew that it was only my own thoughts materialising, and I hated myself.</p><p>And I closed my eyes again. What happens to me scared of being dead, scared of being alive, and closing my eyes? What happens to me scared of myself? Well, I start by getting scared of my body and the unknown life inside, a stomach thats alive but never manifesting itself, Im made of living parts, and they grow like vermine, and theyre theyre me and theyre not me at the same time, theyre autonome, and thats rather scary, especially my intestines. And then the worms and the mould is inside, all living together and mixing together. Then the mushrooms grow inside, and for sure Im dead, or half dead, and also alive, and Im confused and I start crying because its cold and Im shaking.</p><p>The tear is nice, fresh, and frienly: its trying to comfort me and caresses my cheek, very slowly, a bit sticky, then travels on my nose, and I can follow it and focuse on it, its pure, its translucide and its only water, pure organic water with no living germs or bacterias, its a mineral tear and its friendly because theres no life that means death hiding there. It doesnt threaten me.</p><p>Then I find myself thinking that I want to live too, I dont want to die for real, but Im scared of living because I dont want to get old (Ive always been terrified by the idea of my body getting old) and Ill have to die at some point, not dying now is only postponing things Not very joyful thoughts</p><p>I can see the real world for a fraction of seconds, and then it transforms again into all kind of funny shapes that just mean death, like skeletons. But this fraction of seconds when I see reality is still comforting. Im scared because I dont understand whats going on, whats real and whats not, and I dont understand myself and what I want, and I dont want to be this person whos alive only because shes scared of death. I wish I was alive because I like it, and I wish I was never been born at all. I promise myself that when Im back, Ill always be nice to myself and others and Ill let people know that I missed them and that I love them (I didnt actually). And also theres the noise, not really noisy, a very strange and slow noise (I thought of it as a music but it doesnt have anything to do with it and could never ever be called music).</p><p>Then I get scared, mainly because Im scared of getting scared. I split myself into 2 different me, Im 2 persons now: a good one and a bad one. I have to fight with myself: Im a snake, the fight is because I both want to impose my reality and my visions to myself (yes, I both want: because Im 2, Im dual now). To make it understandable I think I have to simplify it, so theres the bad me and the good me. The bad one is self-destructive and disturbing, she sabotages herself and tricks herself, she scares herself on purpose, she wants to disoriente herself, shes scared of death and she wants to die, she wants to destroy everything. My other self is my lively self: she just tries to cover up the other one, to bring nice things, nice feelings. So its a quick succession of bad and good things happening, the bad one erasing all good, and the good ones mainly hiding the bad ones while the bad ones still exist but cant be perceived.</p><p>Its too quick and Im lost. The good one brings the music (house music), its a party with ballons and people with tongues blursting out of their mouths like in cartoons, cheering me up. The bad one is a snake, turning in immensity and nothingnes, all black around, and her unicerse is just an endless void. She laughs a lot (the type of witch-laugh).</p><p>Then the bad one decides to trick me (that means: I decide to trick myself) by doing unexpecting things and making unexpecting and highly unpleasant things to happen, bad hallucinations, each time the good one manages to do something good. And then Im thinking how well it reflects ms, I remember how I always start something and put a lot of energy into it and then put a lot of energy into destroying it: like my studies (gave up in the middle of my 4th year at uni), my relationships, my jobs It was all so clear suddenly!</p><p>Then I need to go to the toilets and I dont dare, and when I do, I have to switch on the light: the bad one makes everything look different, 3D patterns moving and dancing all around the room with evil laughs from trolls hiding somewhere. In the toilets I feel like Im emptying my body, out of my body fall worms, and my insides, and it doesnt stop, unknown and strange bacterias fall as well, my whole bodys becoming empty. Im giving life to death. Then the good one comes and switches off the feelings, and guides me back to the bed, but the evil one has tricks prepared all the way: snakes suddenly jumping at me and rats hidden under the carpets suddenly emerging from the floor</p><p>Back in the bed, Im scared and I cant move, I close my eyes even though I know I shouldnt, and now Im 3 persons: the bad one, the good one (trying to divert me from the bad one, entertainment not for itself or for fun, but to hide something else less pleasant). And now theres also the real one whos hiding my real feelings. So then Im looking for my real feelings, and I find that while Im chasing them up, theyre well hidden behind tonnes of masks that I have to destroy (the 2 of us have to destroy, I should say, but even if theyre at the same task, they do it as if they were rivals). I have to unravel all the different layers of fake me to be able to find myself, but I cant, and each time I think I find myself I just find another layer, and my real self keeps on moving anyway, doesnt want to be discovered. So I dont know what Im feeling.</p><p>So Im scared, and I decide to numb my feelings, since I cant reach them. I decide to feel nothing, because the only thing Im able to feel is a terrible anxiety. And I look from the outside: this is a movie, whatever happens is outside of me and I dont exist really. I cant feel anymore. Im angry with myself for being scared and for chosing to kill my feelings, when I should have had a nice trip instead of trying to impose bad feelings to myself. Im angry with myself because I realise that Im scared of reality and scared of being alive, and I realise that Ive always been like this: I always numb myself and never allow myself to be fully alive and to feel things, and when I look like I enjoy myself, I only pretend, and I only make a lot of noise to hide my emptiness (I was never aware of this before).</p><p>I thought I was alive only because theres no other way round, and thats sad. I I also thought that I never actually experienced life for real, because I numb my feelings all the time, I dont dare to live my life to the full. Everything was all so clear, but then I knew I had feelings hiding somewhere only I couldn'tfind them, and that everything would be solved when I find them.</p><p>But I tried to remain focused on reality, on what reality could bring me, that I didnt want to die. And then I found that reality was my boyfriend, that what I perceived to be reality was only what exists to him, that hes the only one whos truly part of my world.</p><p>Then I thought I wanted to write to him, it was still night, but for some reason I didnt need any light and could see perfectly, I took a pen and a paper and my eyes started to produce fluorescent rainbow lights, flashing, but it was another trick: they were bliding me rather than permitting me to see. So I wrote, part of me was fighting to write, and the other part of me was trying to prevent myself to write, and was thinking about sentences that didnt make sense. So the day after, when I read it again, I found something that didnt really make sense, my writing was pretty much altered, and the sentences were not finished. They were cut with a new sentence with no meaning at all. The pen was also transforming sometimes, so I had to concentrate quite hard to maintain it as a pen, and not gelatine or liquid.</p><p>And this was the end, more or less. I gradually came back to reality. At the end, things were still dancing around but not making noise anymore and reality was very real, and it was around 6 oclock in the morning. Then I fell asleep.</p>",
 "year": "2003",
 "id": "26105",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-04-26T07:00:00.000Z",
 "views": "8256",
 "dose": {}
}
