{
 "id": 2616,
 "title": "Stronger Reaction with Less Sleep",
 "date": {
  "submission": "2004-11-29T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "green mt. boy",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": " T+ 3:00",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This report is a warning that some people may have adverse reactions when combining psylocibin and THC. I ingested 2 grams of medium potency p. cubensis mushrooms at 10 o'clock p.m. I wasn't looking for any profound visionary experience, just a trippy evening. After three hours I felt I was significantly past peak, as it was a small dose, and felt like calling it a night. The problem with that however is that I simply can't fall asleep after eating mushrooms, my brain just kicks into hyperdrive and leaves my body in the wrong universe.",
  "A lot of people I know have told me that smoking some cannabis will dull out their brain a little, at least enough to cop a few z's. I proceeded to smoke a gram of some high powered home grown over a half hour period. At first it seemed like I was just feeling stoned and that apparently the weed had taken over and I could go to sleep. Unfortunately for me, this was not the case. The THC effects just kept increasing and were getting way heavier than what I expected. The effects felt reminiscent of that period right before you pass out from anaethesia for those who have had surgery, extremely heavy and tiring, but I wasn't passing out. I was stuck in this state and it was fine by me (I was experiencing some nice visuals involving the moon and some wispy clouds) but when I realized it was 3 hours later I freaked.",
  "I had to go to work the next day and it was now 4 in the morning. I tried to lay down and go to sleep but couldn't, I was trapped in expanded time. Every time I felt like an hour had gone by it had only been one minute. At this point I didn't no what to do so I just lay there and thought maybe I would just stay awake. Then, to my suprise the next time I looked at the clock it was 7:30 in the morning and I had to leave for work. I have no idea what happened over those hours, but I didn't feel like I fell asleep and I have no memory off it.",
  "Anyway, I think it's needless to say that it might be wise to exercise precaution before mixing THC and psylocibin. I don't no if the two reacted or the THC just made me more susceptible to the psylocibin."
 ],
 "erowid": {
  "id": "18658",
  "citation": " green mt. boy. \"Stronger Reaction with Less Sleep: experience with Mushrooms - P. cubensis & Cannabis (ID 18658)\". Erowid.org. Nov 29, 2004. erowid.org/exp/18658",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "5273"
 }
}
