{
 "title": "Pure Warmth and Bliss",
 "author": "LizardLava",
 "citation": " LizardLava. \"Pure Warmth and Bliss: experience with Oxycodone & Dimenhydrinate (ID 26190)\". Erowid.org. Mar 4, 2007. erowid.org/exp/26190",
 "substance": "Oxycodone & Dimenhydrinate",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "rectal",
   "Pharms - Oxycodone",
   "(liquid)",
   "",
   "50 mg",
   "rectal",
   "Dimenhydrinate",
   "(liquid)"
  ]
 ],
 "report": "<p>Preperation: Put 6 Percocets tablets and 1 Dimenhydrinate 50mg (to help with nausea) in a cup of warm water, let them dissolve fully then stirred the mixture</p><p>Note: administering Dimenhydrinate rectally burns a little but that feeling does go away after about 10 minutes.</p><p>The reason I did not take them orally is because I just had jaw surgery and I cannot swallow pills. I find administering rectally lasts much more longer then orally and seems to make the onset of the oxycodone to hit much faster.</p><p>T- 0:00 - Filled the syringe with the solution and administered rectally.</p><p>T+ 0:10 - Starting to feel effects.</p><p>T+ 0:20 - Feelings of a warm rush coming from my head then moving down through my body. Feeling very very relaxed now.</p><p>T+ 0:30 - Europhic effects coming on strong, also feeling side effects of itching mostly my face and scalp are itchie.</p><p>T+ 0:40 - I would usally be feeling very sick to my stomach about now, but it seems that the anti-nauseant is working very well.</p><p>T+ 0:50 - I am experiencing mild visual and audio hallucinations, I was just outside and I kept seeing things in the cornor of my eye and kept hearing my mom call my name and other noises that were not real.</p><p>T+ 1:00 - The itchy sensations are actually feeling good when I scratch were it is itchy it feels very satisfying.</p><p>T+ 1:10 - I feel so tired now, everytime I get up and walk around it feels like my body is a puddle of bliss it is kind of hard to explain, when I lay on my couch and close my eyes it actually feels like I am a puddle rippling and such. I love this feeling.</p><p>T+ 1:20 - I can actually consume food while I'm on perk's! I never can do that.  Must be the anti nauseant. I just drank a bottle of sobe lizard lava strawberry flavour it was very good, looking in the mirror my pupils are very tiny.</p><p>T+ 1:30 - It seems that the europhic effects are fading away, It seems to fade then come back for a bit then fade etc.</p><p>T+ 1:45 - Sitting on my couch watching tv I keep nodding off, then waking back up whenever I start to nod, its like I am half way asleep stuck between awake and sleep mode its really cool the way it feels.</p><p>T+ 2:00 - went to sleep</p><p>Conclusion:</p><p>This is by far my favourite drug of all time, If I had a constant sorce of getting perks I would be doseing as much as I could. Next time I dose I am going to go camping in the woods with my girlfriend.  Percocets make me very horny and loving, I'm sure it would be an awesome experince to spend with someone who I love that much.  I am also going to have to limit myself with this drug because as I said I could easily dose everyday and it would suck because my tolerance would sky rocket and I'd run out of pills very fast.</p><p>Have fun dosing</p><p>|/=Lava/Lizard=|</p>",
 "year": "2003",
 "id": "26190",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-04T08:00:00.000Z",
 "views": "12846"
}
