{
 "title": "Its Alluring Sickness",
 "author": "Stranger",
 "citation": " Stranger. \"Its Alluring Sickness: experience with Chloroform (ID 26222)\". Erowid.org. Apr 23, 2007. erowid.org/exp/26222",
 "substance": "Chloroform",
 "bodyweight": "72 kg",
 "header": [
  [
   "DOSE:",
   " repeated",
   "inhaled",
   "Chloroform"
  ]
 ],
 "footer": [
  [
   "2003",
   "26222",
   "Male",
   "",
   "Not Given",
   "Apr 23, 2007",
   "21424",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.] </p><p>It started out with a chemist friend of mine giving me 100mL of chloroform which I though I may as well take - hey, free high right? - or at least for a while. At first I thought that I wouldn't do very much, sniffing solvents being a pretty low form of high and a generally unpleasent smell, but that changed after a few deep huffs.</p><p>The smell was kind of sweet and became enjoyable as the night pressed on. The buzz was actually quite enjoyable and debillitating - not quite touching on N2O, but getting there. So from there I decided to make a bit of a night of it, seeing that I was staying home anyway. I must have been off and on sniffing the stuff for a good 3 hours (not constantly, but every 5-15mins I'd have a little binge of engulfing fuzzyness) and later on proved good at getting me to sleep, something I usually have trouble with.</p><p>I woke up the next day with the most horrible type of poisoning feeling like with food poisoning, but worse, so bad that I felt like death, or wanting to die. It felt like I had done myself some serious harm, especially in my head. I kept on heaving and could have told anyone to go fuck themselves. Moving around hurt and made me sicker. This went on for another 2 and a half days upon which I throw away the bottle. I haven't touched another inhalent since.</p><p>If anyone out there is considering sniffing chloroform, or any other solvent for that matter then keep this one phrase in mind.</p><p>'Bluuuuuyyrrrrr! OH GOD! Oh my, bluuuuuuyyyrrrrrrrrr! Ahhhh, never again, never ever eve.., bluuuuuuuyyyrrrr!' and so on and so forth.</p>"
}
