{
 "title": "Best Diet Ever",
 "author": "Yuna",
 "citation": " Yuna. \"Best Diet Ever: experience with Ephedra (Extract) (ID 26266)\". Erowid.org. Jan 17, 2005. erowid.org/exp/26266",
 "substance": "Ephedra (Extract)",
 "bodyweight": "92 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Ephedra sinica",
  "(pill / tablet)"
 ],
 "report": "<p>When I was 15, I thought my thighs were fat. I weighed 110 pounds. But I was a whale in my eyes.</p><p>At this time, I had not done any drugs. I smoked cigarattes and drank whatever alcohol I could get my hands on but in terms of drug use, this was my first of any kind.</p><p>I went down to my local drugstore and got a bottle of Xenadrine. It was 30 dollars and I didn't have the cash so I stuck it in my pocket and ran out. The directions said to take 1 pill a day to start. I promptly swalloed 3 with a glass of water.</p><p>At first I felt nothing, then about 15 minuites later, I got this terribly hyper sensation in my legs. They kept moving and wiggling and I couldn't stop it if I wanted to. My heart was thudding and pounding and my head was feeling light. All of a sudden, I was so so so hyper and thirsty.</p><p>I gulped 2 glasses of water and went outside. I must have ran 5 miles that day. I couldn't stop and felt like I had all the energy in the world. No matter how long I ran, I never got tired, just more thirsty.</p><p>I went into a deli to buy a bottle of water and to my suprise, even though it was 6pm and I hadn't eaten anything but an apple all day, I was not the least bit hungry. In fact, food disgusted me. I walked past the donuts and chips I usually would have been craving without a care.</p><p>The ephedra wore off after a few hours. By that night, I was almost back to normal, though still a little jittery. It was harder to go to sleep that night and I was peeing all day.</p><p>The effect was never the same after the first time though. It still made me energetic and thirsty and not hungry, but none of that wonderful floaty feeling. I suggest it for anyone who needs a quick pick me up. It doesn't seem dangerous if you are careful with it.</p>",
 "year": "2003",
 "id": "26266",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-01-17T08:00:00.000Z",
 "views": "22298",
 "dose": {}
}
