{
 "title": "2C-I Excursion",
 "author": "lucidinthesky",
 "citation": " lucidinthesky. \"2C-I Excursion: experience with 2C-I (ID 26277)\". Erowid.org. Aug 21, 2003. erowid.org/exp/26277",
 "substance": "2C-I",
 "bodyweight": "140 lb",
 "report": "<p>I recently received a gram of 2C-I. My girlfriend & I were going to try it together, but after it sat in my drawer for a month, I caved in and did it alone.</p><p>We were going to visit some friends & family that lived far away today, so we got up *very* early. By the time we got to our destination, I could tell I had an emotionally safe temperment and was okay to take it. Ingested the 16mg gelcap at about 2pm.</p><p>about 3pm: Smoked some MJ, Very small alerts, wondering if I had taken enough, decided to sit it out for another hour before I tried supplements.</p><p>After 4pm: Waves of energy are rolling in and breaking back. One second I'll feel like i'm pure energy, the next I feel nearly sober (actually, stoned). Still there's doubt whether I took enough, but whenever I'd think to redose, I'd get hit with the energy-i just dropped the redosing thought completely.</p><p>5pm: Visuals remind me of LSD, carpet is moving, wood paneling on the wall seems to have more dimensions--its like looking into a cave. body load is never overwhelming, feels like MDA but it comes on smoothly and gets whisked away and comes back all day long.</p><p>the rest of the day was very similiar. i like the substance and will retry at a slightly larger dose. at 11pm still feeling small effects, got to sleep quite nicely in about 20 mins.</p><p>Next day, woke early, felt great, went to school clear minded and aced my test. Later that day (less than 24 hrs of ingestions still) I had ECG & blood pressure tests done. ECG showed a normal sinus rhythm and my blood pressure was also normal on the low side.</p>",
 "year": "2003",
 "id": "26277",
 "gender": "Male",
 "timestamp": "2003-08-21T07:00:00.000Z",
 "views": "8125",
 "dose": [
  {
   "time": "0",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ]
}
