{
 "title": "My Own Personal Matrix",
 "author": "Bill P.",
 "citation": " Bill P.. \"My Own Personal Matrix: experience with Calea zacatechichi (ID 26275)\". Erowid.org. Oct 16, 2003. erowid.org/exp/26275",
 "substance": "Calea zacatechichi",
 "bodyweight": "155 lb",
 "report": "<p>I am very appreciative of the fact that my dreams are quite detailed, long, and in full color.  I can often remember at least one dream a night, and occasionally two.  About once a month I will have a lucid dream.  When this happens I will recognize that I am dreaming, and then I will pick something up, a chair or coffee table, and throw it at the wall.  I believe this happens because I recognize that rules dont apply and I am able to release frustrations in a way that I cannot do in real life.  Then I wake up.</p><p>About a week ago I received some 1g of 10x Calea Zacatechichi from a shop on the internet.  I smoked about half a bowl and the next couple of nights my dreams where clearer and more linear than usual, but not Lucid.  Yesterday I read most of the accounts posted on Erowid and decided that I would try the capsule method.  Before I went to sleep I emptied and then loosely filled a 530mg valerian capsule with the Calea.  Last night was simply amazing.  I had 5 dreams that I can remember, all of them Lucid.  I was in complete control, but not in a way where I had to create the dream myself.  If there was something I didnt like, I changed it.  It was my own personal Matrix.  The details, sounds, colors, and feelings, were absolutely incredible. </p><p>In the first dream I had my moment of realization when I was running away from someone and I decided to take his car.  Driving I could feel the gears shifting, the bumps in the road, and the thrill of driving 100mph over hills.  As I got used to the fact that I was indeed in control, my dreams progressed in what I was able to do.  The second one, I flew.  I could feel the wind around me, smell the fresh air, and go wherever I desired.  The third I thought I saw an old girlfriend, so I did, and I walked up to her and kissed her.  The fourth I was changing the color of people as if it where a computer paint program, selecting the color and then coloring the person.  In the last dream I noticed that control was becoming a little more difficult, but I was still able to fly after a truck, throw it into the air, and then crumple it with my hands as if it were a piece of paper.</p><p>The next morning I woke up completely refreshed and extremely pleased.  I will continue to use the same dose.  I thought about not taking any tonight to see how my dreams would be effected, but last night was so amazing that I think I will give it a couple of days before I take night off.</p>",
 "year": "2003",
 "id": "26275",
 "gender": "Male",
 "timestamp": "2003-10-16T07:00:00.000Z",
 "views": "19927",
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(extract - 10x)"
  }
 ]
}
