{
 "title": "I Can Look, But I Can't See",
 "author": "Blazed",
 "citation": " Blazed. \"I Can Look, But I Can't See: experience with PCP & Cannabis (ID 26289)\". Erowid.org. Oct 14, 2007. erowid.org/exp/26289",
 "substance": "PCP & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Various"
  ]
 ],
 "report": "</p>Monday, August 18, 2003 @ 10:20 pm</p><p>I had a friend coming over, but I wasnt going to bring up the topic of dust. Not yet, anyway. However, while smoking a cigarette before anything happened, my friend turned to me and said, So I hear youve got some dust. I responded, Yeah. I do. I wanted to smoke it that night myself, and it was nice to find out that Id be accompanied by someone that wanted to smoke it just as much as I did. Misery loves company, as my friend would always tell me whenever Id attack him with negativity.</p><p>We sat in my gazebo and took hits from my bong. I had filled the slide piece with hydro and sprinkled a little amount of dust on top. When I began feeling the effects, I felt like I was high, but I could feel something else to the high. It was ok, but not a proper dust high. It was too weak. Not satisfied with what had transpired, we smoked more after watching an episode of The Wire on HBO. We went outside, and I packed the slide again. This time I sprinkled a little more to feel something weird happen, thats what I always go for, more or less.</p><p>Halfway through the slide, I stopped. It was just after my turn, and I asked my friend, You think I should sprinkle a little more? But I was retarded, and I didnt know it. I looked at my friend, and I dont know what it was, it was either the background moving slower in comparison to other things I saw or him moving around all funny. We went for it. I wasnt sure what I was doing, but I wanted to see more fucked up shit. I hadnt put much thought into the fact that I was already seeing fucked up shit at the time. When I tried to sprinkle a little more halfway through, I realized my depth perception had been shrunk. It was like I was looking through a car mirror, everything appeared closer than it actually was. I couldnt tell if I should sprinkle more or not. I wasnt sure how much there was in the slide already. I couldnt be sure.</p><p>The one thing that kept bothering me was that I had turned into a little kid again, and so did my friend. We had these childish conversations about how awesome it would be to watch a movie where the FBI fights the CIA, FBI vs. CIA, just like Freddy vs. Jason. I wont get too deep into our conversations. Its nothing to remember. One thing to take out of this is that I noticed I had become more social. Not only that though. I had become more animated. If I was excited about something, Id move my hands around, even though I didnt feel I had the energy to do so. My movements came out retarded too, since I ended them quickly.</p><p>Heres what Ill remember most, the feeling. Some have described this feeling as numbness, depersonalization, sheer nothingness, or endless isolation. Id describe it as a retreat into a child beast state. Whats a child state? You got me. The concept was in a state of freefall, and I hoped it would never get to land. I guess feeling like a little kid again and not having my parents stop me when I make truthful, yet hurtful, remarks to other people. If theyd try to stop me for a reason, Id get to fight back. Its a state of total control. Or, at least, an illusion of it. In the end, its some form of it. I realized I had been subconsciously manipulated. I had been convinced that I was capable of anything, so my character had become mainly a seeker of fun. The one downside of this was that I was also be in a childlike state of unawareness. I couldnt be sure what to think of things, and I couldnt see things the way they really were, both visually and symbolically.</p><p>I felt like I could say anything I wanted, but I didnt feel like moving in order to get something that I said done. I wasnt ready to hurt anyones feelings, but Id stand my ground firmly if Id get confronted by an asshole or someone pissed about me being an asshole. Overall, it's a volatile state of mind. All dissociative drugs have their oddness factors. If anything, Id compare dust to alcohol with a slight hint of psychedelia. We joked around a lot. We had to. Everything else was in slow motion, and our bodies became heavier. It got more difficult to walk, but I found a way to alleviate that, I tilted my body forward as I walked.</p><p>Instead of being extremely fucked and ready to pass out anywhere, I felt like getting involved with something, almost as though some form of energy (hopefully not rage) was building up inside of me. I felt good about getting fucked up, and I wanted to smoke more. The only reason why I had stopped was because I didnt want to wake up a zombie block of cheese. The high didnt last too long, but the aftereffects (post-euphoria effects) got to me. My legs were too heavy for me to lift in order to keep walking, so I lied down for my demise. I wasnt getting back up, and I wasnt going to remember some of the important things that had happened. Its a shame, but somebodys got to do it.</p>",
 "year": "2003",
 "id": "26289",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-14T07:00:00.000Z",
 "views": "12608"
}
