{
 "id": 2631,
 "title": "Second Voyage: Introspective",
 "date": {
  "submission": "2002-11-07T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Alkaloidaholic",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Psychotria viridis",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>The second time I did ayahuasca I rented a hotel room and brought 4 other people with me, 2 others where also imbibing this sacred drink. They experienced no nausea or vomiting. Effects began in about 6 minutes, starting with alterations of conscousness, that 'pineal feeling.' Lay down and took shelter next to a guide, a girl whom I felt very comfortable around.",
  "The visual hallucinations began in about 20 minutes. Patterns emerging from the walls. When I closed my eyes I felt as though I was traveling deeper into myself. If I payed attention to the outside world the effects would lesson, I heard a voice telling me to just let go of the outside world. I did and the deeper I traveled into myself the more 'entities' I would encounter, I met many entities who claimed to be part of myself, I saw myself as a machine and they where the operators. They gave me suggestions about how to run more smoothly. At one point I saw the widely spoken of, 'knomes' they where pushing a crank, and they all looked very depressed and walked very slowly. My current visionary guide, who had the personality of a gangster and much style and attitude, told me that the machine was broken and not running properly. I came out of the trip with a better understanding of myself. I don't believe I ever left myself though. I was hoping that i would travel to remote places but most of the travel was restricted to my own body.",
  "Before we drank the ayahauaca we made an agreement to try to find each other in the realm but I never gained contact with my fellow ayahuasca expiditioners. They seemed to have a nice trip. so did I but I became depressed as I was coming down. I seems as though the basis of alot of my psychedelic journeys is negative and introspective.",
  "-entheomation</p>"
 ],
 "erowid": {
  "id": "18698",
  "citation": " Alkaloidaholic. \"Second Voyage: Introspective: experience with Ayahuasca (ID 18698)\". Erowid.org. Nov 7, 2002. erowid.org/exp/18698",
  "substance": "Ayahuasca",
  "views": "12311"
 }
}
