{
 "title": "A Friend in this Great Journey of Life",
 "author": "RMH",
 "citation": " RMH. \"A Friend in this Great Journey of Life: experience with 5-MeO-DMT (ID 26337)\". Erowid.org. Feb 29, 2008. erowid.org/exp/26337",
 "substance": "5-MeO-DMT",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "insufflated",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>Recently I had acquired a small amount of 5-MeO-dmt.  My self and two other friends, who are good hearted people began exploring with this intriguing substance.  We started only with small doses smoking the crystals on cigarette ashes. This rout was found to be to overpowering and unforgiving on the body. </p><p>After much frustration my companion and I decided to take another route.  Two weeks later on a nice cool night we dosed out the rest of crystals, since we had no scale their was no real way of telling how much was broke into the two piles.  What happened next is somewhat hard to explain.  We went into the trip thinking it wasnt going to be intense because the dose couldnt of been much more than 10 milligrams each.  After taking down the two lines we wanted to find a nice place with no distractions, so we climbed out on the roof of his three story apartment. </p><p>It began to kick in extremely fast, leaving my ego behind.  At that instant I realized this is it, Its really taking place.  It was all happening way to fast, what if I'm not ready,  I don't exactly have a choice in the matter.  I except it and slip away from all this madness or I'm physiological fucked. </p><p>At first I had thought something was terribly wrong, this shouldnt be happening, I'm dieing.  I somehow just accepted death at that moment, it was truly beautiful.  I was part of something so much more, full of love and happiness.  Pure electric volts were flowing throughout me, It was truly the utmost amazing  sensation I had experienced .  I was swimming in pure bliss a heavenly utopia.  I could sense every sensation and thought on a transcentual level with my friend, it was all worth living for this one moment. </p><p>At one point in the trip I could hear beautiful music flowing from with in, I looked over at my friend and he was so much more, a beautiful spiritual being  he looked like a figure from one of Alex Gray's painting.  The only problem I had was completely letting go of my ego, at a certain moment I can remember trying to resist and getting up, NOT a good idea.  Also after coming down I had trouble breathing smoothly and my body was shaky from tremors.  The drip was not to pleasant either. </p><p>Overall I would have to rate this experience very highly.  I just laid their afterwards in a complete calmness, understanding everything,  just existing.  I tried to hold on to this wonderful feeling for as long as possible.  When I finally came completely back we talked the entire night about the experience and I was brought right back in the wonderful place after listening to Tool, very good shit.  It was a truly orgasmic, spiritual experience.  Their was nothing to prepare me for this drug.  5-MeO-DMT, a friend in this great journey of life.</p>",
 "year": "2003",
 "id": "26337",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-29T08:00:00.000Z",
 "views": "2997",
 "dose": {}
}
