{
 "id": 2635,
 "title": "Cravings",
 "date": {
  "submission": "2007-07-28T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Regulator",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I've done meth only a few times.  I love the feeling.  The scariest experiance I had with meth happened when me and my friend greg smoked a small sack of meth out of a crack pipe.  I'm pretty sure we smoked it correctly, first melting the crystals, then heating them again until the chamber clouded up, taking a quick but deep hit, and exhaling extremely quickly.",
  "I took about 5 good hits and I was feeling extremely hyper.  We sat in the room and just fucking started talking about random shit, but it felt so fucking boring, I paced the room and kept looking at my self in the mirror.  I noticed my eyes were extremely dilated.  My eyes looked like spongebob's eyes when he's surprised.  I was eating a peroshki before I smoked and I had no desire at all to touch it.",
  "Finally we left and smoked a shitload of cigerettes. We walked around a bit when I started feeling a sharp pain in my spine, and I was feeling really bored and depressed.  I just wanted to sit down cus I felt like shit.  It went away after about 30 minutes.  At first the comedown was mild, it wasn't too bad.  I just felt really bored and I felt like nothing at all, not even if a hot latina chick hopped suddenly out of car and flashed me, would it satisfy me.  Everything just sucked.  We got back and decided the comedown fucking sucked.  So we smoked more meth in the crackpipe and back came that hyper feeling and shit.  It was fun.  I played baseball the rest of the day and went home.",
  "That night, me and my parents went to dinner.  Holy shit I did not want to eat.  I sat at the table and just twitched and twicthed.  The resturant was dark and it felt extremely gloomy.  I started to extremely crave a cigerette, but I didn't get to smoke one so I felt even more like shit.  I was also extremely craving meth.  I wanted to kill someone for meth, the waiter, anyone.  The comedown sucked so I smoked a bowl of weed at night and I was able to go to sleep.",
  "The next day I noticed a sharp pain in my lung.  It scared the shit out me.  Everytime I would breath, my lung hurt.  It felt like someone was pushing a stick into my lung.  I didn't smoke any meth but I smoked lots of weed, after about a week the pain went away.",
  "All I can say is that meth is addictive, it's been about a month and I haven't smoked it but the craving was pretty fucking intense.  I would start twitched in class because I wanted meth so bad.  I felt extremely depressed and angry at everyone.  After reading some of the expreiance stories, I found myself wanted meth again."
 ],
 "erowid": {
  "id": "18704",
  "citation": " Regulator. \"Cravings: experience with Methamphetamine (ID 18704)\". Erowid.org. Jul 28, 2007. erowid.org/exp/18704",
  "substance": "Methamphetamine",
  "views": "7016"
 }
}
