{
 "title": "Mental Anguish Resulted in Wanting Suicide",
 "author": "Anonymous",
 "citation": " Anonymous. \"Mental Anguish Resulted in Wanting Suicide: experience with H.B. Woodrose (ID 26360)\". Erowid.org. Jun 26, 2007. erowid.org/exp/26360",
 "substance": "H.B. Woodrose",
 "bodyweight": "128 lb",
 "report": "<p>I always wanted to try acid and experience something that takes me out of this world. I had done many pills before and after hearing about H.B Woodrose were supposed to be the next best thing to acid I decided to give them a go. As we bought them from a shop I didnt even expect them to work. We did all the requirements to take them and so we drank the water and eagerly awaited the results.</p><p>After a little while my vision started to alter and I was happy that they were kicking in quickly. My friend was feeling pretty sick and so was my brother but it was off and on. When I looked at things everything went off in different directions but slowly. This I liked but I wanted a more intense experience. My friend assured me that they get better and better and he was right. I started to trip out and I would wave my hands about and gaze dazedly at the colourful patterns that were left behind. Truly I thought these were better than pills or anything I ever had and I was even up for doing some more. The decision not to saved my life.</p><p>When we left my friends house we went to the woods. I was walking down the street still enjoying the experience and I resembled those guys in Fear and Loathing in Las Vegas. This I liked. It was getting better and better but very soon worse and worse. By the time I got to the end of the street the mood changed. I felt nauseous and so did my Brother and friend and then all of a sudden my friend started heaving his guts up. It was dark and so I couldnt see it but it sounded so violent and this scared me. Low and behold about 1 minute after he was sick I was too. I felt like my chest was gonna explode. The thoughts going through my head were all saying that this is never going to end.</p><p>When I stopped heaving I thought I was better but I was kidding myself. Everything was rapidly moving of in different directions and there were strange colours everywhere and at this moment I realised that my mind couldnt take it anymore and there was nothing I could do about it. I wanted to cry and call the hospital even my mum but I knew that if I let these thoughts get the better of me then it can only get worse. I realised that I wasnt breathing and when I tried to breath I couldnt feel the air going into my lungs and I was panicking. I couldnt concentrate on anything not even my own breathing.</p><p>When I closed my eyes it didnt really help either. I would get crazy visions that I just wanted to get out of my head but I couldnt. I realised that once its in my head it is there to stay. I thought that I had gone insane and that never would I be able to normal again. Thoughts even occurred to me that the only way to end this would be to kill myself. I didnt like the place I was in as it had started to seem very sinister and like a place of evil. This was not improving matters so I said for the others to take me back to my friends house. I was eventually able to bring myself to reality and tell myself that its all in my head and it will be over soon and after an hour or so things calmed down a lot. It was at this point when my brother came out of the bedroom and started freaking out. He had tears in his eyes and just kept saying that he was scared. He stumbled around walking into all the rooms in a frenzy of confusion before violently vomiting in the bathroom.</p><p>As my other friends didnt freak out much they didnt understand what was happening to him considering all night my brother didnt even feel the effects of them. All he felt was ill until hours after when he freaked out. I went into the bathroom to see if he was ok. He was sat against the wall with his head between his knees and he kept saying how sacred he was. I tried to console and assure him he would be straight soon as it happened to me earlier but he didnt believe me.</p><p>I nearly lost him to an outburst of tears which is what I wanted to do and I knew that if he was feeling anything like I was if he broke down in tears of terror then he would never have stopped. Luckily he didnt and after a while he got over it but the experience left us shattered. I can no longer smoke weed due to me getting so paranoid its like having a panic attack and as for my brother he can smoke but for a while he thought that he was fucked up for life as he was having anxiety attacks for about 3 weeks after we did them.</p><p>My friend said he enjoyed them but the rest of us hated them and it just isnt worth the risk</p>",
 "year": "2003",
 "id": "26360",
 "gender": "Male",
 "timestamp": "2007-06-26T07:00:00.000Z",
 "views": "4591",
 "dose": [
  {
   "time": "0",
   "amount": "8 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 ]
}
