{
 "id": 2642,
 "title": "Holy Smokin' Ghost!!",
 "date": {
  "submission": "2000-06-16T07:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "Trey",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "smoked",
   "substance": "DPT",
   "form": "(freebase)"
  }
 ],
 "report": [
  "<p>Recently I came into posession of a small amount of parsley which was laced with DPT freebase. When the sample arrived in my mailbox it bore no labels, and therefore I was unsure as to how much DPT was actually present in it. It was barely a pinch of herb, however, hardly even a full bowl's worth, so I figured that there was no way that it could constitute more than a single dose and went ahead with plans for a bioassay.",
  "I spent some time preparing for the bioassay by centering myself with meditation techniques. After about half an hour of silent meditation, I felt ready. I loaded the parsley into a steamroller-style pipe, gathered my courage, sparked up my lighter, and inhaled, filling my lungs to capacity.",
  "As I exhaled the first hit of the rather harsh smoke (not sure if the harshness is intrinsic to DPT or was due to the parsley carrier,) my thought processes began to markedly speed up, faint whirlpool-like eddies of iridescent color began to appear on the periphery of my visual field, and mechanical, whirring sounds that were quickly rising in pitch became audible over the meditative music that I was listening to on headphones. These electronic-sounding, machine-like auditory hallucinations persisted throughout the strong-effects phase of the experience. They were highly unique, distinctly different from the xylophone-like music often present in DMT experiences, and unlike anything I have ever experienced previously with any other material. As I finished off the bowl with a second large inhalation, sparkling, phosphorescent, multicolored tendrils appeared to materialize out of thin air in front of my face. They resembled veins or roots, and seemed to encircle me rapidly.",
  "Suddenly I and my surroundings were consumed in an abrupt explosion of white light. It was like being incinerated in a cosmic blast furnace. I forgot where I was, what I was doing, even who I was as my entire sense of identity and indivuduality were burned to a crisp. This experience was very similar to what I have undergone on large doses of 5-MeO-DMT.",
  "After what I deduced later to be around two minutes or so, I regained a rather muddled hint of awareness that I was a person called Trey who was lying frozen in shock on the edge of his bed with a pipe in his hand. I was trying to put down the pipe, but was having a pretty hard time with concepts like 'pipe' or 'down.' I was suddenly hit with a tidal wave of fear that my roommate (who thinks that I am living a clean and sober lifestyle) would come home and find me paralyzed in this position holding drug paraphernalia. Physically I was very tense and feeling somewhat speedy, in a manner that reminded me of high-dose phenethlyamines; this stuff has a distinct body load. Multicolored, dancing fractals overlaid much of my visual field. I managed to get the pipe put away properly and lay back to try and relax into the remainder of whatever DPT had in store for me.",
  "The fear stayed with me through the duration of the strong visual and auditory effects, which lasted until around the 25-minute point. Subtle visual distortion and a feeling of being distinctly unsettled persisted until T+1 hr. The most enjoyable portion of the entire experiment was the following 2 hours, which were marked by a truly lovely afterglow that was subtly yet distinctly empathogenic. For all practical purposes I was down, but my mood was altered and lightened in a truly delicious manner.",
  "If I had the opportunity to repeat the experiment, I would definitely lower the dose. When I consulted the individual who provided the parsley, I was told that due to the nature of the process of putting the DPT on the carrier herb it was impossible to tell exactly how much was in the sample, but it was estimated to be somewhere between 75 and 100 milligrams. Based on this estimate, I'd probably try 50 next time if the opportunity were to present itself. I feel that this is quite a challenging material, and is definitely not recommended for the pleasure-seeker or the inexperienced. I do believe, however, that for the serious student of the entheogens and sincere seekers it holds great potential as a tool. I look forward to someday being able to explore it via alternative routes of ingestion and at different dosages.</p>"
 ],
 "erowid": {
  "id": "1872",
  "citation": " Trey. \"Holy Smokin' Ghost!!: experience with DPT (ID 1872)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1872",
  "substance": "DPT",
  "views": "9669"
 }
}
