{
 "title": "Fatigue Tripping",
 "author": "Paradoxical",
 "citation": " Paradoxical. \"Fatigue Tripping: experience with Prednisone (ID 26426)\". Erowid.org. May 24, 2006. erowid.org/exp/26426",
 "substance": "Prednisone",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Prednisone",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I had been up for about two days, and been having trouble breathing. This was not a consequence of my being up for so long, I stay up long periods of time almost weekly. However, I was sick, and could hardly breathe.</p><p>I went into the doctor, and was perscribed 20 milligrams of prednisone. I took one immediately after I got home. I think it is important to note here, that due to my sickness, the normal sleep deprivation experience took a strange turn.</p><p>About an hour later, I started to get tired. The tiredness was very abnormal. It felt forced and artificial, as if my body has been turned into a feather pillow. I then passed out.</p><p>I distincly remember falling through a wormhole of some sort. One which transformed the blackness of my physical reality into one which took on the colors of a psychedelic african desert. I met humanlike entities. However, the method in which they communicated was infinitely more bizarre than our own communication-- It was as if they would tell stories with geometry and symbolism, through almost a storybook medium. Absolute reality, but the kind I would find if I mixed african tribes in the desert with the saturday morning cartoons and a color scheme pulled straight from the brightest colors in a crayola box.</p><p>However, this mode of communication seemed normal to me. It was, after all, my own mind telling the story.</p><p>These people were telling a story of religion. One in which they would dance and create offerings with their voice. When they danced, no rules of anything seemed to apply. Any motion, any color, anything. It all spoke it's own purpose. As if the things they were doing were creating pure emotion. I understood how this all worked, as bizarre as it sounds.</p><p>I understood, now it was time to see what was behind it. I saw a symbol like the christian cross, except there was a depth to it unseen in anything of this world. The reality of this god shined through the symbol. One of pure emotion and understanding.</p><p>Then, I awoke. Two hours had passed. I ripped the heavy coating of blankets from me. Confused and sweating, trying to make sense of the reasons behind that extremely profoud and completely unexpected experience, I decided that I'd better stop taking prednisone.</p><p>It's not that I don't enjoy exploring the totally alien and bizarre, it's just that I'd rather not have to do it every time I'm looking for some solace at the end of the day.</p>",
 "year": "2003",
 "id": "26426",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-24T07:00:00.000Z",
 "views": "17177"
}
