{
 "title": "The Furtive Teacher",
 "author": "Frodolives",
 "citation": " Frodolives. \"The Furtive Teacher: experience with Salvia divinorum (5x extract) (ID 2642)\". Erowid.org. Nov 6, 2001. erowid.org/exp/2642",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "165 lb",
 "report": "<p>Salvia Divinorum is a most unusual substance.  Having happened upon information concerning Salvia on Erowid, I ordered 1 Gram of Daniel Siebert's 5x concoction.  I have used Salvia perhaps 5 times now, with last night being the most powerful trip.  I turned off all the lights except my computer monitor, which was alive with a program called Acid Warp.  This gave me just enough light to see where my lighter was going.  I took a very small amount of the salvia (probably less than 100 mg) and began to smoke it in a homemade pipe.  (*Here I must pause.  If you are not a smoker, you will most likely find that salvia smoke is quite harsh!  Not to dissuade any of you would-be explorers, but just a word of warning.  Luckily, the 5x leaf requires only a couple of small inhalations.)  Back to the trip.  I took the pipe, lit my lighter, exhaled all the air in my lungs, held the lighter to the Salvia, and inhaled as much as I could hold.  I held this lungful for ~30 seconds.  I exhaled and finished the Salvia with another hit. </p><p>By this time I felt prickly all over my body and I began to salivate heavily.  I would recommend that anyone who smokes Salvia does so sitting or reclining, because as soon as the Salvia takes hold of you, you are VERY unsteady on your feet.  I was smoking in a chair and it was a great effort to get to my bed which was only a couple feet away. With lights out, some mild Closed Eye Visuals came to me.  Then it hit. </p><p>The strange thing with Salvia is that it is so subtle.  All the times that Salvia has worked for me, I was tripping and didnt know it.  I will try and explain.  Here I was, lying in bed with my eyes closed in the dark, just after smoking. Suddenly, I'm on a operating table.  There are faint shapes surrounding me.  I can hear voices around me.  They are all female. (This aspect of salvia really amazes me.  I cannot fathom how this plant can make female entities appear in 95% of trips for EVERYBODY who used it!!) As unusual as the transition from dark bedroom to operating room is, this did not seem strange at all.  In fact, I spoke (or thought) to one of the people there, a woman laying next to me on the table.  'Hey, why doesnt this stuff ever work?' I asked.  She gave me this strange look, winked, and started laughing. </p><p>Eventually the operating room vanished and I began to float through some kind of space where there bright lights.  In this place, I could make my surroundings change by willing them to do so.  Unfortunately, this part is quite fuzzy.  When the trip was over, I gradually regained my senses and sat back in the chair. </p><p>Salvia is unlike any drug I have ever tried because it doesnt feel like you are under the influence of something.  I feel that it is most akin to falling asleep for 5 min and having the most real set of dreams you have ever had.  I'm sure some of you have had dreams so powerful that you wake up confused.  Though I have not had a 'mindblower' yet where reality completely melts away, I have experienced enough to want one.  Good luck to the rest of you.  Be safe.  peace.</p>",
 "year": "2000",
 "id": "2642",
 "gender": "Male",
 "timestamp": "2001-11-06T08:00:00.000Z",
 "views": "6593",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
