{
 "title": "A World A Mystical Bliss",
 "author": "Vix  Daniel",
 "citation": " Vix  Daniel. \"A World A Mystical Bliss: experience with Clonazepam (ID 26430)\". Erowid.org. May 5, 2004. erowid.org/exp/26430",
 "substance": "Clonazepam",
 "bodyweight": "295 lb",
 "report": "<p>I have experienced with Clonazepam several times in the past. With all very different outcomes. This particular occasion was like every other night. My mother had gone to bed; my brother and sister soon followed,  while I remained awake. At about midnight I consumed 6 1mg tablets of a pill I have grown to love called Clonazepam.</p><p>After I first popped the pills, I didn't feel anything, which is not unusual. At 1 am, I began feeling the wonderful symptoms. For me, firstly, I feel a soothing, warming embrace. Imagine a freshly cleaned and dried blanket wrapped around your body. The wonderful feeling you receive from that is how it feels for me when the pills begin to kick-in. Within minutes, the bliss intensifies, slowly; as if it is preparing you for what will come. At this time, I play my favorite, soothing, calming bands (for me:  Silverchair, Fleetwood Mac, Simon and Garfunkel, and the Beatles); close my eyes; and stretch out on my bed.</p><p>With your eyes closed, everything around you feels more intense. While I was lying on my bed, the pillows seem to embrace my existence, and slowly sink me into what seems like a pillow made of silk. I was laying on top of my blankets, and they comforted me with a pleasurable curressing of the blankets fibers.</p><p>I love a Clonazepam high. I, by far, think it is the best. The feelings you experience come in stages, which is a blessing because the symptoms seem to  slowly take you on a journey, letting you experiencing everything in a slow  pace. Unlike other drugs that hit you immediately, and wear off quickly.  Right now, I am only experiencing my first stage of the effects and will post as the stages progress. I'll just use an astric ( * ) to indicate my next experience</p><p>---------------------------------------------------------------</p><p>With my experience, I will list a few stories and tips for your interest and safety.</p><p>The first time I took clonazepam, it blew me away. I was never a drug fan, but I figured why not. For a first timer, the experience is amazing. It is somewhat indescribably, but it is REALLY good. I would suggest for a first timer, with my weight and hight (295 lbs, and standing at 5'7') to take anywhere between 4-6 1mg tablets. If you feel as if you want more then that, then only take up to 8, or it can get dangerous. I have had an experience with that.</p><p>That experience began like this:</p><p>I was deciding to mix my vicodin medication I was prescribed from my doctor, and I had managed to scrounge up 10 1mg tablets of clonazepam. The mixture included 4 vicodin tablets, and 10 1mg tablets of Clonazepam. It truly messed me up. I could hardly walk or talk (I was basically mumbling), and I was hallucinating. It was fun, until I woke up the next morning. I had a horrible hangover, and I puked as soon as I woke. Basically I had overdosed slightly. So, I would not suggest you do what I had done.</p><p>If you do want to mix anything with Clonazepam, I suggest favorite of mine:</p><p>1.) 6x1mg tablets of Clonazepam while drinking a small class of lemonade mixed with everclear and sugar.</p><p>I STRONGLY DISCOURAGE - drinking heavily and then consuming clonazepam.</p><p>If you want to mix Clonazepam with anything, make sure you plan ahead. I suggest taking my suggestion above.</p><p>AS for mixing Clonazepam with another drug; I have not experienced much, but I had the best experience with mixing 4 vicodin tablets with 6 to 8 1mg clonazepam tablets. Despite my one bad experience, I have grown and realized that if I want to consume any drug, I have to know my limits and don't heavily mix other drugs with them or it could be fatal.</p><p>( * )Second stage:</p><p>My vision is becoming less clear, and my attention span is to a minimum. I can best describe it as a nicer form of dissociation. My head and my eyes feel heavier, as if I am are wanting to fall asleep, but don't. I am now experiencing a slight wave of nirvana. I once had a headache, and now it is gone, and I am the happiest I have felt in a long time. At the second stage, your surrounding appear surreal. Which then sparks the curiousness of your mind. You mind is starting to wonder:</p><p>'Is anything genuinely real? What is my purpose?'</p><p>Under the influence of clonazepam can help sort out your minds troubles, because, in my opinion, you feel free and open; I've pegged clonazepam the 'Truth Serum' because, like I said before, you are very open, and have a sense of not caring what anyone say, or who doesn't like your train of thought. You say the first thing that comes to your mind, whether it may hurtful, or expressing a love to someone that you would never normally do. As for the 'horniness', hmm, yes, this drug does intensify being horny. With me, I just wanted someone to hold me and caress my body. You have a sudden urge to have sex; wild passionate sex. For me, it is not my normal behavior, but maybe I have a naughtiness deep down inside. :D</p><p>( * ) Stage three:</p><p>I am not experiencing fuzzy vision, and if I were to walk around right now, I would most likely stumble alot. So, That is why I prefer laying in my bed watching TV. Along with this stage, is the inability to think as clearly and typing a neatly as I usually do. I excuse my errors. [editors note: I haven't changed any spelling errors or bad formatting from now on to keep the original spirit of being under the influence]</p><p>For those adventurous people, I suggest walking outside to your favorite hiding spot, where it maybe in the woods or in a meadow; where ever you feel at most peace, go there.</p><p>This is my final note: Read all I have written, expecially if your a beginner. Keep a watchfull eye on how much you consume and what you mixed it with.</p><p>But, overall, I just want your experience to be magical one because that is how it is suppost to feel, magical; as if you were being rescued from your current reality, and brought into a world a mystical bliss.</p><p>good luck, on your Clonazepam adventure.</p><p>Please, for everyone, read up on symptoms and side-effects before consuming anything.</p><p>Thank you for reading my experience with Clonazepam.</p><p>I hope your experience is as great as mine. :D</p><p> --- Vix ----</p>",
 "year": "2003",
 "id": "26430",
 "gender": "Female",
 "timestamp": "2004-05-05T07:00:00.000Z",
 "views": "149674",
 "dose": [
  {
   "time": "0",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  }
 ]
}
