{
 "title": "Waking up",
 "author": "Burns",
 "citation": " Burns. \"Waking up: experience with LSD (ID 26438)\". Erowid.org. Oct 16, 2007. erowid.org/exp/26438",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "report": "<p>It has been almost 4 months since my first LSD experience. Although I have tried many other substances in my short 15 year old life once or twice, such as Ethyl Ether, ketamine, GHB, MDMA, and of course Weed, nothing compared to my first LSD experience.</p><p>Anyways, it started when one of my friends (let's call him D) told me he had bought a half a sheet of acid. I was quite excited and bought 5 hits off him instantly. As it was his first time too, so we decided to try it together. We also thought it would be a good idea to have a sitter, since we had read about so many bad trips. So we got his girlfriend, who did not want to try LSD to sit for us.</p><p>It was a week before we got a chance to do it. D's parents were going to a funeral up in Qubec city. D did know the person who had died so his parents let him stay home for the week end. So at about 2 on saturday I got to D's place. He and his girlfriend were already there, in his basement. I dropped 3 of the hits I had bought from him, and he dropped 3 too. We then waited almost 45 minutes for the effects to come on. Most of that time was spent with D complaining about how he had only 12 hits left in his half sheet.</p><p>Then suddenly at 45 minutes things seemed to get brighter. We thought the trip was comming on, so I pulled out a pink floyd CD and started to listen to it. I don't know how long we were listening but after a while it seemed as if the music was somehow controlling the flow of time, and when the music was slow, like it usually was, time went slow, and when it sped up time sped up. After a while I asked D's girl for the time and she told me it had only been 10 minutes since we started to listen to the music. I was confused at this and looked around the room. Everything seemed normal and I was pissed I was not hallucinating. So I went to go to get a glass of water from the kitchen.</p><p>That is when I saw it. As I got up the chair D was sitting in seemed to move and hug D. It scared me and I tried to pull D out of the chair. He didn't know what I was doing and looked at me blankly with pupils too big to be human. His girlfriend (I'm gonna call her A for the rest of the story) was laughing at us and I couldn't figure out why. So I asked her and she told me we had been staring at each other for like 5 minutes. This ammused me and I laughed too. So we were all in good moods when we went into the kitchen to watch all the small trippy objects move and come alive. D later told me he had seen a soup can turn into a mouse and laugh at him. We stood there for almost an hour tripping.</p><p>Then I blacked out. It was just momentary and random, and when I awoke I was still standing, but everything had changed. I was so refreshed and it thought I had been 'awoken' for the first time into reality. I was sure that everything before that was a dream and I had just 'awoke' from it. Also I could see things so much clearer. It was as if everything made sense now. I could see the personality of everybody around me. I could see why they did everything they had done. I remember thinking A was the perfect human being. So cheery and caring. Then I looked at myself, my past present and future. I could see it all in an instant. I realized y I had started to take drugs in the first place, and things like y I had not asked that girl out in grade 8. It all made sense. The whole universe was weaved into a huge web of knowledge that I could touch at any time, and explore in seconds.</p><p>I tried to explain this to D and A but they did not understand what I was talking about. They thought it was funny, and for a second I realized it was, and laughed with them. We returned to his basement and listened to music and I remember telling them how Pink Floyd and Bob Dylan must have loved LSD. We also watched things change shape and move, 'Plot against us' as D called it. He did not enjoy the trip as much as I did, and was paranoid that his house was going to eat him or something. It didn't really make sense. And it was the only thing I could not figure out. The mind of a drugged up 15 year old did not seem to matter at the time so I forgot about it.</p><p>D's paranoia eased off as the night continued and he began to enjoy all the sounds and images. After a long time of having so much fun, A told us it was 12 pm. I was shocked it was so late and thought only a couple hours had gone by since we had dropped the acid. Then I began to sink into 'sleep' again. See at that very moment my knowledge of everything began to slip away into the 'blackness', as if I was falling 'asleep' again. Then suddenly, I felt it. I was being pulled down into the 'blackness' that was my life before LSD. I was scared and my friends later told I was screaming and raving about some blackness that seemed to cover my legs, and was moving to my head. This is the part of my trip I remember the most of. I was scared and dropped to the floor and lay in a ball. I could feel the 'blackness' covering me, and in moments, it covered my head and again I passed out.</p><p>When I woke up I looked around too see D and A laughing at me. They said I was screaming about being sucked into something for 10 minutes and then had said 'Meh, it's all good.' and got up calmly. They were also a little pissed, cause I scared them, but it didn't matter. I was still hallucinating but I could not see all the knowledge I had had during my trip when I was 'awake'. D decided we should try to sleep, because he was suddenly feeling quite tierd. So we stretched out on the couchs and the floor in his basement. Well I jumped on the only couch in the room before they could stop me, so they slept on the floor haha. ;)</p><p>After a good night's sleep I awoke to feel quite refreshed. Although I was sad I had lost the answers to everything, and had fallen back into 'sleep' again, I was happy to have experienced it once in my life. D wanted to try some more the next day, but I said no. I didn't want to do anymore until I thought hard about whethere it was a good substance or not.</p><p>Since then I have taken LSD about 15 times (lost track a while ago). I won't tell you to try it or not, because it drasticly chages you. It's a personal choice if you want to trip or not.</p>",
 "year": "2003",
 "id": "26438",
 "gender": "Male",
 "timestamp": "2007-10-16T07:00:00.000Z",
 "views": "4233",
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
