{
 "title": "Take This Oxy and Shove It",
 "author": "VreeZpeerit",
 "citation": " VreeZpeerit. \"Take This Oxy and Shove It: experience with Oxycodone (ID 26458)\". Erowid.org. Oct 16, 2007. erowid.org/exp/26458",
 "substance": "Oxycodone",
 "bodyweight": "200 lb",
 "report": "<p>While surfing the Internet one evening, I stumbled upon a few Usenet articles regarding rectal administration of prescription opioid pain-killers. Although none of the respondents had specifically used OxyContin (OC's, oxies) in this way, the consensus was that using OC's this way should be very effective in getting you high. I've been sniffing OC's for a few years now, and have taken Ecstasy rectally twice in the past, so I was immediately intrigued by this idea.</p><p>There's quite a bit of detailed info about OC's available, and the official pharmacology report even mentions rectal administration specifically. It advises against rectal dosing because it absorbs too rapidly, and causes a higher maximum blood plasma concentration than the equivalent oral dose. Of course, they don't say anything about insufflation (snorting), so comparisons between plugging and snorting will have to be subjective.</p><p>The next day, I bought a 50 mL oral syringe (no needle can be attached, just a small plastic spout at the bottom) from my local apothecary, and ran home to give it a whirl. I had 8 or 9 pink OxyContin tablets (20 mg each). I removed the coating (simply put them in my mouth for 10 seconds to get the coating warm and moistened, and rubbed it off on a paper towel) from 2 pills - 40 mg total - and crushed them into a fine powder. I put about 40 mL of of hot tap water (not too hot, remember where it's going) into the oral syringe and, dumped the powder into it. I shook it vigorously to mix it. Not all of it dissolved, but it doesn't seem to be a problem. After lubing it, and lubing my bungy a bit, I slowly inserted the syringe into my anus as far as it would go (it's only about 2.5 inches long, so this is not as painful as it probably sounds) and pressed the plunger down swiftly. I left it there for 30 seconds or so, and sat on my stomach, to avoid any leakage.</p><p>I was already feeling a little anticipatory buzz, and I soon (T+1 minute) began to feel a faint warmth and relaxation in my rectal area. This was an enjoyable feeling that is hard to describe, but it was different than the initial physical sensation of the warm water contacting the skin inside the rectum, although probably it was the mild heat propogating through to the muscles in the area. I was really noticing the effects of the opiates at about T+7 minutes, which increased in intensity gradually over the next 10 to 15 minutes.</p><p>I was lying on my couch, listening to music, and just taking in the lovey-dovey euphoria of the opiates for the next 45 minutes or so, before preparing another pink pill (20 mg) for a booster shot later (rectally again, at about T+1:45). I would put the peak effects at approximately T+20 minutes, with a short plateau period (5-10 min.) that melds in with a slow and gradual decrease in intensity for the next hour. There seems to be a second, lower plateau at this point (T+1:30), where I feel relatively euphoric, but without the intense, everything-is-just-ducky 'rush' that is present at the peak.</p><p>To compare this subjectively to snorting, the peak comes on slower and more gradually via rectal administration, but seems a bit higher, and lasts longer. The come down is much longer than snorting, and more gradual. Doing a booster rectally doesn't seem as good as snorting, however, perhaps due to it coming on so gradually. For me, starting off rectally with the initial dose, and then doing boosters up my nose looks to be the way to go.</p>",
 "year": "2003",
 "id": "26458",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-16T07:00:00.000Z",
 "views": "129533",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "40 mg",
   "administration": "rectal",
   "substance": "Pharms - Oxycodone",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 1:45",
   "amount": "20 mg",
   "administration": "rectal",
   "substance": "Pharms - Oxycodone",
   "form": "(liquid)"
  }
 }
}
