{
 "title": "No Regrets",
 "author": "E-Mag",
 "citation": " E-Mag. \"No Regrets: experience with Salvia divinorum (ID 26472)\". Erowid.org. Feb 20, 2006. erowid.org/exp/26472",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "1.0 g",
  "smoked",
  "Salvia divinorum",
  "(dried)"
 ],
 "report": "<p>My drug experiences have included cocaine, meth, mushrooms, special k, and alot of weed, but this is the first encounter i have ever had with salvia.</p><p>It all started one day when me and my friend D decided we wanted to try something new, so i suggested salvia. We agreed and went to the local bong shop where salvia is sold and bought one gram. We both knew we were in for a fun night...</p><p>Before trying any new substance, I always consult erowid and research. I found out many things about salvia which contributed to my preparation: We cleaned out the bong and the bowl so it was in perfect order, found a quiet park to go to with little distraction and obtained high quality dried salvia leaves. Having everything ready to go we eagerly went to the park. D went first. He inhaled one fully packed bowl, blew it out, taking one of equal size right after exhaling. I quickly asked him 'What are you feeling?' 'Are you tripping?' He couldnt talk! Seeing how messed up my laughing friend was made me want to try it instantly so i packed my 2 bowls and took them the same as D. The trip begins...</p><p>Trip: I instantly started laughing uncontrollably. I try to start talking but the words arent coming out right. At this point a truly unbeleivable thing happened. D told me to get up and follow him into the field, and it was a complete deja vu. I could actually predict what D was going to say and do next and he did it. So I followed him into the field and I couldn't stand up straight. It was like some force was pushing sideways on me and eventually i fell. After this i figured that I wasnt high enough so i decided to go back to the smoking area to take a few more hits. It took me a few minutes to find it because for a second i completely forgot where i was and what i was doing. After a few minutes I got the bong took a few more hoots and went into D's house. I got inside his house and took one more large hit. By this point I was sweating and looking at a picture above his fireplace which appeared to be getting further away. As i focused on it I could feel my body move with it. Weird.</p><p>The whole experience lasted over the period of about an hour. I really underestimated the intensity of this substance and it was nothing like what I predicted it to be. Some really weird things happened when i was tripping, and when I look back now, I dont think I realized how fucked up it was. Like trying any new substance, salvia was an adventure, although I dont think I'd ever pay for it again. I would recommend trying it to anyone. As for me, I have no regrets.</p>",
 "year": "2003",
 "id": "26472",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-02-20T08:00:00.000Z",
 "views": "3301",
 "dose": {}
}
