{
 "title": "Aimless Wanderings",
 "author": "Jay S",
 "citation": " Jay S. \"Aimless Wanderings: experience with Carisoprodol (Soma) (ID 26487)\". Erowid.org. Dec 30, 2010. erowid.org/exp/26487",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "137 lb",
 "report": "<p>Up until a week before I actually tried Soma, I didn't even know I had it in the medicine cabinet. Apparently it was prescribed to my mother for a spasm, but she stopped taking them with 3/4 of the bottle full, and promptly forgot about them. At the same time, I didn't know that Soma was great for a spaced out day until a friend raided my medicine cabinet and freaked over the bottle.</p><p>Now - I don't go around taking pills I know little about, so we consulted my friends PDR (Physician's Desk Reference) he got a boarders books for 10$. It's a good 3500+ pages of information on medicine. Anyway, it said not to exceed around 1400 mg or so, but since the PDR is medical-use oriented, we figured we could stretch the dosage a little.</p><p>I like to test the water a little bit, so in a state of boredom, and in need of a good head change, I swallowed two of them, washing it down with a Dr. Pepper. I have little experience taking pills for a high, sticking to weed, but I do know that pills take a while to hit me. In one bizarre day, it had taken 3 hours for 20 pills of Coricidin C&C to take their effect, empty stomach too. Back to the Soma though!</p><p>While I waited for it to take its effect, I played a little Counter-Strike. In about 25 minutes (yes, quick for me) I felt a nice, dulled, fuzzy sensation in my head, which reminded me of being drunk. I found it's much more fun feeling a high on my feet if possible ;-)  so I got off my computer, and just kinda walked around my house aimlessly... actually more or less jumped and danced around as a result of a good, careless feeling, and I not once stumbled. If it were alcohol I'd probably have a few bruises.</p><p>After about 30 minutes of doing this, I returned to the computer and got back to playing. I don't think I was doing as bad as I normally do, or that might have just been my thought process at the time. At about 3 hours after I had taken the Soma, I felt the feeling begin to start its come down, I had only taken two after all... I retired from my game to watch some tv and found it hard to understand what the people onscreen were saying over the a/c, I could only concentrate on one source of sound at a time, the rest of my high was spent on an uneventful evening.</p><p>As for the next day, I had brief, subtle stomach pain that didn't bother me much, which I assume was from the Soma. I've already planned my next test of Soma, on 8/30/03 I plan on taking 4 and heading to a Labor Day weekend party that my friend's hosting.</p>",
 "year": "2003",
 "id": "26487",
 "gender": "Male",
 "timestamp": "2010-12-30T08:00:00.000Z",
 "views": "6894",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "Pharms - Carisoprodol",
   "form": "(pill / tablet)"
  }
 }
}
