{
 "title": "Riding the Billowing Wave",
 "author": "Michael",
 "citation": " Michael. \"Riding the Billowing Wave: experience with Opioids (ID 26503)\". Erowid.org. May 7, 2006. erowid.org/exp/26503",
 "substance": "Opioids",
 "bodyweight": "275 lb",
 "report": [
  "<p>A little background first:  until the age of 34 ( Im 37 now ) my entire experience using illegal drugs consisted of five joints which I bought when I was 18 and smoked over a period of a few days.  Thats it:  never tried cocaine, heroin or any other opiate, never took a psychedelic substance, nothing.",
  "At age 33 I went into business for myself and started making good money, and by the time I was 34 and a half I was making more money each week than I used to make in three months.  My business was internet-related and so I made literally thousands of contacts by email.",
  "The combination of lots of contacts and lots of extra money opened the door to easily buy stuff through greymarket internet dealers, so I experimented a little, mostly with ecstasy and ketamine.  I liked the X but hated the ketamine ( I thought I was dead  :-> ).  Anyway no great shakes, take it or leave it.",
  "One day I found out one of my customers had access to different prescription opiates, strong stuff like morphine, oxycodone and hydromorphone ( Dilaudid ), but also weaker stuff like pentazocine ( Talwin ).  To make a long story short, over the course of about a year and a half I went from popping 2-4 pentazocine a few nights a week, to injecting 100mg morphine IM ( in the shoulder ) every night, to injecting oxycodone IV ( from crushed up and dissolved Oxycontin tabs ), to finally injecting crushed up and dissolved Dilaudid tabs IV.  Until I started doing the drugs IV I was fine . . . no ( physical ) addiction, no withdrawal, despite the fact I was using the stuff nightly.",
  "What finally hooked me was the RUSH I got from injecting strong opiates IV, and Dilaudid was my drug of choice. The feeling was so good that I made the mistake of not waiting until the next night before doing it again, and I started doing it during the day.  From that point on I was lost.  I quickly became very physically addicted to the drug, to the point that if more than 4 hours passed since my last shot Id start getting uncomfortable; more than 8 hours and Id be visibly exhibiting withdrawal symptoms; more than 12 hours and I was into serious withdrawal . . . violent muscle spasms, the whole bit. ",
  "Thankfully I didnt feel this very often since I had lots of money to feed my habit which cost me around $1200 per week; whenever I did have a withdrawal episode its because the stuff was a day late in arriving, and Im not one to buy stuff off the streets . . . not to mention that its near-high impossible finding Dilaudid on the streets ( heroin didnt cut it for me . . . tried it once and found its effect very subtle compared to the Dilles, not at all as satisfying to me ).",
  "Between February and June of 2002 my habit occupied all of my time; I was too busy shooting 10 times a day and too busy savoring the effects of each shot to do or even think of much else.  Being a junkie is a full-time job.  I stopped working, which wasnt a sensible thing to do obviously but logic had flown out the window;everything will be ok, there are no problems at all, even when the world is collapsing around me.",
  "I realized I had a big problem but didnt know what to do about it.  Withdrawal symptoms were so harsh I couldnt face them.  Yet I could see how much damage I was doing to my life and my family and decided I had to stop.",
  "In July of 2002 I went to a methadone clinic.  They were going to hold me as an in-patient for two weeks but only kept me a week when they saw I reacted very favorably to the methadone.  I went home and continued my treatment as an out-patient, taking a single dose of methadone every day.  This was to continue for about 8 weeks with the dose being tapered every few days so that after 8 weeks Id be off it completely, at which point Im considered cured.",
  "Of course, all that happened was that I used the methadone only as long as it held off withdrawal symptoms, which it did for around 5 out of the 8 weeks.  After that I was more or less in a constant state of high anxiety which was bad enough during the day but also kept me from getting any kind of decent sleep at night, and they dont prescribe ANYTHING to help these symptoms, supposedly because mixing methadone with a benzodiazepine tranquilizer like Xanax isnt recommended.  This is bullshit in my case as the amount of Dilaudid I was using was dozens of times stronger ( and thus so were the side-effects ) than taking 30mg of methadone with 1mg of Xanax could ever be, and I finally understood that the real reason they wouldnt prescribe anything was because of a feeling that, since I had already become addicted to one substance, I would also become addicted to anything they gave me. ",
  "Never mind that I never used drugs most of my life and never had a substance abuse problem ( not even alcohol or even cigarettes . . . more on later later ).",
  "Predictably, I started using again, though nowhere near the amounts I was using before . . . *BUT* I eventually found a way to use not only the same amounts but a little more at a fraction of the cost I was paying the first time ( by that point I was almost broke ).  At this new level of use, I found out ( later ) that for the first time people could tell something was wrong.  One eye would be half open with the other one slowly opening and closing, as if my body was fighting between staying awake and going to sleep.  I wouldnt always have my balance.  I didnt feel pain, or I didnt perceive it as pain . . . Id bang my shin on the edge of a coffee table hard enough to make everything on the table rattle but had no apparent outward reaction other than saying whoops or something similar.  I would say something to somebody and 5 minutes later say it again as if for the first time ( having already forgotten Id said it once already ).",
  "At this point I was living off the money I got for selling my vette. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] I had two other cars, a winter car and my wifes car.  I totaled one and badly damaged the other; even when I wasnt crashing into things I would climb onto sidewalks with the wheels on one side of the car because I couldnt judge distances too well.  In retrospect Im lucky I didnt kill myself ( not to mention other people ) from my driving alone.",
  "All of this ended on March 30th of this year.  Thats the day I quit it completely.  I did it cold turkey:  no methadone, no doctors help, no nothing.  My wife took two complete weeks off work to play house-nurse to me because she knew that the first few days Id be a basket case and the next few days Id be too weak to do much for myself.  I wont go into the details of my withdrawal because this report is long enough as it is; suffice it to say it was hell and I wouldnt wish it on my worst enemy.",
  "But it worked.  Ive been clean since March 30th and feeling completely recovered since around April 30th.  I have no cravings at all; in fact all cravings went away on the fourth day after stopping, which surprised the hell out of me.  Apparently for me it was really a physical thing, and so it was a question of waiting out the physical recovery as my body re-adapted to living without the drug.",
  "In May I started working out again ( I was an avid bodybuilder for years ) and started working again.  I estimate that by the time Im back on top the drug will have cost me at least two and possibly three years of my life, even though my addiction lasted only one year.",
  "In retrospect I know that the reason I didnt think Id get addicted despite everything Id read on the subject was because I never got hooked on anything before ( I drink and smoke a few cigarettes most every night before going to bed and have done so for 15 years . . . even the cigarettes didnt manage to hook me and I still never touch them for 21 out of the 24 hours there are in a day ).  Now I know that it was just because Id never tried a drug that did enough for me, and it was just a question of finding one that did.",
  "I would love to be able to use the stuff responsibly, like on weekends only for example, but am not sure I can so I decided against it.</p>"
 ],
 "year": "2003",
 "id": "26503",
 "gender": "Male",
 "views": "13849",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Opioids",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2006-05-07T07:00:00.000Z"
}
