{
 "title": "A Valid Method",
 "author": "JuggaKlown",
 "citation": " JuggaKlown. \"A Valid Method: experience with Mushrooms & Cannabis (ID 26500)\". Erowid.org. Oct 16, 2007. erowid.org/exp/26500",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "4.0 g",
   "smoked",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>I'm sure since the discovery of hallucinogenic mushrooms, humans have debated whether or not the psychodelic effects of Psilocybin can be experienced if smoked.  However, I am here today to defend the belief that smoking mushrooms is indeed a valid method for tripping.  Firstly, for the record I'd like to state that this was my first time smoking mushrooms, I have ingested them before.  The night started like any other normal night for me; I dropped by a friend's house along with a few other buds of mine.  I quickly found a seat in a wooden chair and demanded someone pass the bubbler.  I smoked bowl, after bowl, from bubblers, pipes and bongs.</p><p>Then a friend of mine who happens to be a dealer decided he was going to give us a taste of his shrooms, insisting that we smoke them he quickly packed a glass pipe.  The taste was mild and the smoke wasn't near as harsh as Marijuana, so I happily took hit after hit.  After we had cashed the bowl, my friend packed another, and another, and the process continued until we estimated roughly 10 grams of Mushrooms had disappeared.  My dosage was 3-5g based on the number of people smoking and the amount of hits I took. </p><p>Though the exact amount of time that passed by is unknown it was probably a good thirty minutes when I first noticed the 'trippy' effects.  The kid's face across from me seemed to stretch away from his body, and hover feet away.  Lights would occasionally dash back and forth, then return to their original positions.  After watching minor hallucinations for a while I picked back up a bong and got into position, then trying to light it, I got lost.  I don't know where but I found my way again.  Staring straight ahead with not a thought in my mind, the water in the bong bubbling as I sucked air out of the chamber, regardless of the fact I had not lit the bowl.  My friends laughed hysterically as I continued this process over and over again, for some strange reason I believed the bowl was lit and I could see the orange glow of the Marijuana burning.</p><p>Finally I gave up on the bong, and sat back in my chair.  I watched people's faces detach from their bodies and wander across the room.  For some odd reason this was the most common hallucination I experienced.  In addition to the visual disturbances, Aural hallucinations were also common.  Voices of my friends sounded as if they were in other rooms, though they were sitting right next to me, and every once and a while a voice would completely switch bodies.  Example: Joe's voice came from Bob's body, and Jane's voice came from Joe's body.</p><p>I believe the whole experience went on for an hour or two until everyone decided it was time to leave, thus came the horrifying end.  I tried to stand up, but couldn't, a mixture of the Marijuana and Mushrooms perhaps?  With work my friend's pulled me up and immediately upon standing a wave of nausea struck me.  I crumbled back into the chair and the worst case of dry heaves I had ever experienced took place.  These dry heaves continued off and on for the twenty minutes it took them to get me out of the house, into a car, and to another friend's house where I would sleep.  As soon as I was plopped down on my friend's couch the nausea left just as mysteriously as it had appeared.  Based on my account of the situation and my friends' account, we concluded that when I was forced to move the nausea came, however when I was in a stationary position (the chair, sitting in the car, sitting on the couch) I was fine.  Though I have no explanation for the nausea I am sure it was the mushrooms seeing as though Marijuana has never had that effect on me before.</p><p>My experience was quite trippy and euphoric, but I don't quite think the dry heaves were worth it, on the other hand the point of this experience was to credit the validity of smoking Mushrooms, and that I have done.  Until next time, take it easy,</p>",
 "year": "2003",
 "id": "26500",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-16T07:00:00.000Z",
 "views": "30050",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
