{
 "id": 2652,
 "title": "My Dis-associations w/ the Other You",
 "date": {
  "submission": "2002-11-08T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "gonzo",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Ketamine"
  },
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "i prefer to take K w/ hallucinagenics...usually 1-2 grams of mushrooms. also i slowly bring myself up to around 3-5 tenths of ketamine over the course of an hour..... i have on several occasions had not only out of body experiences, (clear)visions of another time and heightened auditory perception, but more importantly (to me) experiences in which another soul has entered my physical body for a few minutes, then left w/ (sometimes) gratitude for 'its' allowance back into the physical realm. once out of the 3 times i have experienced this i did not welcome the soul and pushed 'him' out immediately.  each time was significantly different. each produced significant spiritual changes to myself. ",
  "the first time i had flashes of an elder black man (60-70's) and found myself playing (and writing) a blues song that seemed to come from nowhere. the words just shouted out of my mouth and at the end of this experience i vividly recall myself saying aloud 'thanks little white boy'. strange....... my second 'visitation' came from an asian man. perhaps mid 40-50's. he had a deformity in his hand. he had only 2 fingers .(the physical characteristics were mental flashes) as i sat and played guitar my right hand changed positions and i started holding the guitar pick w/my thumb and middle finger and my wrist bent 90 deg. (very unconventional) the whole time i was rocking forward to back and chanting to what seemed to me to be an asian mantra of some sort. a quiet murmuring of eastern sylables. ",
  "the third experience was a fat, southern farmer boy (mid-late 30's) i can only assume this because of his appearance and more importantly a voice in my head said so. who am i to argue? for some reason or another i did not welcome him and pushed 'him' out immediately.  ",
  "in a recent rendezvous w/k i decided to explore this K hole ive heard so much about, but have never in my 8 yrs. experience fallen into. i started out w/ 2/10, waited 10 min. then did another 1/10. this quickly put me in another realm/dimension. i was in a large room of a big house (i looked out the window to see) i was lying on a couch and felt a presence in the room, though it did not talk to me or show itself. it guided me around the room as i walked on the walls and ceiling. it was a most heavenly experience. it reminds me of written experience of astral projection and the dream world in CARLOS CASTENADA's books.  ",
  "the musical settings seem to be a strong influence on my journeys. i usually play some 'roots' music (ravi shankar ,django rheinhardt, jazz and blues) mostly without vocals to disturb the process.  i am now to the point where i can come and go as i please while i am in these realms. i've stood atop gigantic stones in the deserts of egypt. rode shotgun on a horse and buggy with my(a) family in what appeared to be the western frontier. slept (drunk) in the stairwell of a ghetto apartment complex and was kicked by passerbys telling me 'get up!' and other experiences. ",
  "-me2"
 ],
 "erowid": {
  "id": "18741",
  "citation": " gonzo. \"My Dis-associations w/ the Other You: experience with Ketamine and Mushrooms (ID 18741)\". Erowid.org. Nov 8, 2002. erowid.org/exp/18741",
  "substance": "Ketamine and Mushrooms",
  "views": "11762"
 }
}
