{
 "title": "Small Taste Yields Good Results",
 "author": "Borkhane",
 "citation": " Borkhane. \"Small Taste Yields Good Results: experience with 5-MeO-MiPT (ID 26562)\". Erowid.org. Sep 4, 2003. erowid.org/exp/26562",
 "substance": "5-MeO-MiPT",
 "bodyweight": "125 lb",
 "report": "<p>Well, I found a little bottle of 5-MeO-MiPT, so I decided to give it a try, having read a few decent reports about it.</p><p>I decided to take a very small amount to acclimate myself to the effects. I always like to do this when trying new materials, even if I am very familiar with the typical doses reported. I tested 2 milligrams late in the evening.</p><p>I felt slightly off baseline after about 20 minutes; something was happening but I wasn't quite sure what yet. I was watching television, and noticed myself becoming more engrossed in the program I was viewing. By 45 minutes after ingestion, I could definitely tell that there was a tryptamine working its way through my system. My pupils were dilated as usual with a psychedelic, amd my eyes looked a bit glassy. I felt a bit chilled, and decided to go out for a walk.</p><p>Immediately upon going outdoors, I felt a mellow euphoria building. Even though some seriously horrible things have happened to me just recently which have been weighing dangerously heavily on my mind, I was perfectly at ease. I felt a familiar glow of self-awareness. I felt as if all of my surroundings were reaching up to me and wrapping me in a soft embrace. I felt great. I was surprised by the potency of this material, having taken such a tiny amount.</p><p>I noticed some slight time dilation as I walked, feeling as though I was able to 'think more thoughts' within a given stretch of time. My thinking was very sharp and clear, and I did not notice any shift of any kind into another level of thinking, just simply becoming slightly more introspective. Everything was smooth and gentle. 5-MeO-MiPT is definitely a smooth drug. There was absolutely no body load whatsoever, and everything felt very natural and clean. There wasn't anything about it that felt artificial. I noticed that my sense of smell was slightly heightened.</p><p>I walked back to my house, and sat down in the backyard, looking up at Mars, glowing brightly in the peaceful, clear night sky. I gazed up at the big trees softly flowing to a slight breeze. The more I looked at them, the more it became apparent that they were moving much more than they should be; swaying and flowing with energy. Everything seemed to be flowing inward, curling and breathing.</p><p>I was impressed with this effect as I hadn't expected any kind of visual effects whatsoever.</p><p>I was a bit drowsy, so I went inside and laid down on the couch and watched some TV. Again, I noticed I was slightly more analytical than usual in my observations of TV. After about an hour or so from the start of the effects, they seemed to quickly subside, but a lingering insomnia persisted for a few hours. At this dose, everything was generally similar to a small dose of psilocybe mushrooms.</p><p>All in all, I greatly enjoyed my first taste of 5-MeO-MiPT and will definitely be conducting more experiments at higher doses.</p>",
 "year": "2003",
 "id": "26562",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-09-04T07:00:00.000Z",
 "views": "18581",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT"
  }
 }
}
