{
 "title": "Not Worth It, Not Repeating It",
 "author": "pdl",
 "citation": " pdl. \"Not Worth It, Not Repeating It: experience with Methadone (ID 26584)\". Erowid.org. Sep 4, 2003. erowid.org/exp/26584",
 "substance": "Methadone",
 "bodyweight": "170 lb",
 "report": "<p>My boyfriend and I received 6-7 tablets of Methadone from a friend at a party. We weren't sure if we even wanted to try this, but took them anyway figuring we could always trade them off. After a rather hectic labor day weekend, we decided to try it out. We each took 1 5mg tablet, dimmed the lights, and vegged out in front of the television. Half an hour went by, and I still wasn't feeling much, so I started folding clothes, cleaning up the house, etc.</p><p>When I first felt the effects, a light body high, I sat on the bed and continued to watch TV, which had become very interesting. I had no adverse effects, just felt lazy and content for the first 1.5 hours to lay on the bed and talk. I felt pretty good. It wasn't a euphoric feeling, just contentment and light headedness. I turned and asked how my boyfriend was, and he replied with, 'stoned, but not too much. I'm having a hard time getting out of this chair.'. In contrast, I could get up, move around, clean the house, pretty much act normally.</p><p>About a half hour afterwards, we decided to take another tablet. A while after that, we were officially spacey, like smoking marijuana without the paranoia. I was experiencing a nice floating body high. I also felt mildy euphoric. We cuddled on the bed and watched TV for a couple more hours. There was no urge to walk around or go adventuring. There were a few bouts of very mild nausea which were easy to fix, I just lay down and they went away. My boyfriend went to sleep at this point. I got up and decided I was hungry. I made a TV dinner, and ate it very, very slowly, along with drinking lots of ice water.</p><p>I fell asleep after that, feeling disappointed. All this did for me was make me sort of happy, followed by sort of nauseus, and then sleepy. I had no visuals except at the time I went to sleep, the shadows seemed to be playing tricks on me. I became a little afraid, and ten minutes later I was asleep.</p><p>The real problems came in the morning. I literally could not get out of bed until 4pm. I was lethargic and nauseous all day, and the next. The nausea went away when I laid down, so I just slept for two days.</p><p>This is not a drug I would try again. The brief mild high was not worth the two bed ridden days of misery afterwards. Other after effects included cold sweats and sour stomach. We could have taken a larger dose, but I felt that if we had taken more, we would have been sick. My stomach was very tender for a few days, and I had to watch what I ate. We were both amazed at how many bad side affects were experienced from such a low dosage.</p>",
 "year": "2003",
 "id": "26584",
 "gender": "Female",
 "timestamp": "2003-09-04T07:00:00.000Z",
 "views": "41523",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Methadone"
  },
  {
   "time": " T+ 1:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Methadone"
  }
 ]
}
