{
 "id": 2659,
 "title": "Outgoing and Happy at the Right Dose",
 "date": {
  "submission": "2002-11-10T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 62
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Total Basics For Those In A Hurry (don't rush!) :",
  "50mg - little if no buzz",
  "100mg - good buzz, lasts a while.",
  "150-200mg - ready to feel it all nite, next day.",
  "250-300mg - stronger, not as enjoyable to me.",
  "300mg+ - no need really.",
  "Ultram (Tramadol) is a synthetic opioid used to treat severe to moderate pain. Personally I'd compare it to vicodin, but perhaps a little stronger. I am fairly experienced in the drug world, although I am clean now, and have been for several months. Go me. Anywho, when I wanted to learn about Ultram, I had a rather hard time, so I'll break down all I can for you all.",
  "I first tried 50mg, and felt almost nothing.",
  "Once I tried 100mg (2 50mg pills) I felt a nice buzz, my body was tingly and sort of jello-like. My vision seemed a little affected, and my preception a bit altered as well. Talking was more enjoyable to me, and I sometimes felt quite a speedy effect. Much more outgoing and happy, and just buzzing all day. Also, sleeping on these gave me great and happy dreams, and I always woke up feeling well rested, almost without any sleep at times. I felt 100mg was good for a nice nitely or so buzz, and sometimes enjoyed it during the day. I was able to handle it very well, talk normaly and whatever...but that was after a little using...a few weeks. I'm sure most people can handle it, but you get more used to it over time.",
  "In excess, 100-250mg it seemed to be a little stronger, more tired and a lot heavier body buzz, but not essentialy more enjoyable. Another report of 500mg I belive said constipation was a problem. I've never taken 500, but 350 at the most, and never had any problems with constipation. It doesn't seem addictive except mentally to me...once I didn't have any, I'd sure miss it a lot, but that can come with anything. I also sometimes experience itching all over, not a bad itch but it can be annoying. Possibly a mild allergic reaction, not sure. Hope this helped anyone wanting to know."
 ],
 "erowid": {
  "id": "18752",
  "citation": " Anonymous. \"Outgoing and Happy at the Right Dose: experience with Tramadol (Ultram) (ID 18752)\". Erowid.org. Nov 10, 2002. erowid.org/exp/18752",
  "substance": "Tramadol (Ultram)",
  "views": "39572"
 }
}
