{
 "title": "Beyond Eye",
 "author": "peace and fro",
 "citation": " peace and fro. \"Beyond Eye: experience with LSD (ID 26596)\". Erowid.org. Oct 2, 2003. erowid.org/exp/26596",
 "substance": "LSD",
 "bodyweight": "70 kg",
 "report": "<p>Pre-Babble: This was to be one of many experiences with LSD, the first being 6 months beforehand, at the age of 15. This particular story I choose to dwell upon as I felt it left numerous festering loose-ends in the intricate channelling of my brain. Since being noted 14 Ive been smoking the greenery consistently and have downed various substances (Ketamine, Noss, Meth): I know the density of emotion/vacancy that drugs tend to evoke and am therefore less susceptible to fabricated paranoia etc  which relates to the below tale as it was composed mostly of fear and negativity.</p><p>The Acid: acquired from a friend of a friend, around 30 tabs,  apparantly White Fluff, Doubly dipped etc. Imprinted on each tab was a voluptuous set of lips, with an out-poked tongue.</p><p>No intentional preparation although I hadnt eaten that day</p><p>9:00 pm - 4 blotter tab orally</p><p>9:30 pm -  Dexedrine orally (unknown amount nor how I got it)</p><p>9:30 to 10:00  6 pack of ale/J worth of Greens</p><p>Tale:  A few mates and myself set off for a party in a neighbouring suburb. I didnt intend to take acid on the night as Id downed too many in local times, and I could feel the fry seeping into my frontal lobe, if you take my meaning. 9:00 pm fell from the sky, (wed arrived at the party half hour before, socialised etc ) and sure enough my mate suggests we perpetuate this night -with his impeccable insight into this language of ours- so we both took 4 tabs each. After an unknown hiatus of Absent-mindedly strolling around the perimeters I start to notice the preliminaries: speedy heart, rushing senses, physically uplifting electrics, confused visuals. Alls well at this point, Im contented roaching, drinking a fine ale and conducting anthropology. My mate catches up with me, informs me of; chronological presence, him being off his nut, the novelty of drunken behaviour. Herein I must of fallen deeply into intoxicated limbo, as I only recall events in an incoherent fashion with no indentifiable connective string.</p><p>I remember ingesting some amount of Dexedrine, which is thoroughly baffling as to how I came across. I recall working myself into a frenzy - induced by some trivial train of thought  and running into the  fading eye, which, in common reality, translated as a passing bus. Next thing Im sitting at a bus stop profusely bleeding from the cranium, my brain spiralling at light speed, analysing the scenery in a blandly cynical manner; fucking bobbing houses inhabited by pointlessly productive 9-5 citizens, thoroughly enlightened watching the idiot-box.uni-directional stimulimotivated by food etc. I must of become bored with myself and the clinical taste now becoming apparent in my mouth as I decided to walk back to the party, not as if I had any sense of geometry or spatial perception for that matter.</p><p>Anyhow, I managed to arrive back to the now densely populated party, where someone must have noticed me and attended my wound as the bleeding seemed to have stopped with the application of a bandage whence next my memory shot into my current consciousness. The night waned and I remember being in different rooms greeted by blotted masses of black and blue visualisations which I didnt find disturbing although now I do. I seemingly possessed an ability to make objects transparent, which I found aesthetically pleasing. Retrospectively, most of my visuals/thoughts/sensations were of a negative nature, which seemed to be what my seat of consciousness was solely composed of on that occasion. Which, I might add, is not my true self as I tend to be a light-hearted, mellow strawberry field fellow with no interest in the ill. We, w being I and the e being my mate, left at around 2:00 for my mates house. I told him of my goings-on, and vice versa, mutually still tripping it was permissible to converse our then epic revelations etc.</p><p>We arrived at the destination around 2:30, half way through the 5th hour of the trip. I was starting to come down at that stage or grow more numb as I like to say and just did. My mate just wanted to chillout with music and his tranquil state. I on the other hand, was in a deep struggle with my brain for some sense of mellowness, which since following the fading eye Id been at a loss to find. It was at this point that I regained my connection with my eyes I suppose, and I started to create evil, blackened images around the room. Even though I was sliding off the timeless merry-go-round LSD provides, I was still aware of intense visual distortion. My vision then suddenly felt as if it were splintering into a numberless amount of different dimensions, or states of consciousness.</p><p>Then, like a picture forming, my immediate view began to transmogrify into a thousand interlacing eyes peering intently with their piercing pupils upon my retarded, simplistic insignificant self. At this I stood and stared, with glazed eyes as my mate informed me later, trying to comprehend the meaning behind such a depiction, whilst I felt a flurry of emotion engulf my soul from interest to apathy, curiousity to fear as if each had no reasoning nor meaning behind, just a different aspect of constant motion. At fear, unfortunately, I lost myself to and all that it entails followed. As fear is one of the most integral, primal emotions or reaction that any intelligeable being posseses, its easy to lose ones self to such and when it is a result of some vision or something that is not an immediate threat to mortality, like the fear of death or whatever, flowing emotion is rendered perishable or susceptible to all things ill.</p><p>If all that shit made sense to you, the reader, then you can understand how I was frozen, laying on the floor with my left eye folding into my right, cross-eyed, perplexed, rendered utterly useless. Eventually I guess I passed out or something but I woke the next day feeling so fucked up and I found it hard to think, with an overwhelming feeling that I had done myself some permanent damage, which will perpetually reside in my subconscious, in other words, not easy to explain.</p>",
 "year": "2003",
 "id": "26596",
 "gender": "Male",
 "timestamp": "2003-10-02T07:00:00.000Z",
 "views": "6681",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": " ",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": ""
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
