{
 "title": "Two Sides to the Story",
 "author": "MaCkEnZiE",
 "citation": " MaCkEnZiE. \"Two Sides to the Story: experience with Dimenhydrinate (ID 26606)\". Erowid.org. Nov 9, 2007. erowid.org/exp/26606",
 "substance": "Dimenhydrinate",
 "bodyweight": "120 lb",
 "report": "<p>Ive been taking dramamine for years to treat motion sickness which I commonly experience on long road trips. After a while I began using it to fall asleep because one of the side effects is severe drowsiness, and after popping three or four, Id be out in less than thirty minutes. For some reason I was drawn to the paralizing effects of overdosing on the drug, so I began taking more and more at a time. I was at my friends house one night and I noticed that I had two entire tubes of dramamine in my bag, and I had one of those dumb 'What would happen if I...' thoughts in my head. I kept popping and popping with no results, so eventually I ingested the entire contents of both tubes. My friend warned me that I was gonna be so fucked up, but I felt nothing. So eventually I just gave up and chilled with her as we normally do. There are two sides to the rest of this story. One side is what I thought was happening, and the other is what truly happened. Ill begin with what I thought was happening.</p><p>I felt nothing from the excessive amounts of dramamine that I had taken, which surprised me, but I wasnt really thinking about it. Within a few hours people started showing up at Laurens house in black cars. Lauren was having a huge fucking party, all to surprise me. I was excited to see that all of my friends were there, especially one who I hadnt seen all summer. I spent a while talking to people outside, running around her backyard, just livin it up. I remember one specific time when I tried to get the people in one of the black cars to roll down their windows, but to no avail. I went in and out of the house talking to people, just the usual shit. After a while I went back into my friends room to find the friend I hadnt seen all summer fucking one of my other friends in her bed. I started crying and pacing around the house, going up and down the stairs until finally my dad came to pick me up. I got my stuff ready and got in the car, eager to tell my dad about the fun Id had. We didnt talk much in the car and I thought he might be mad at me, so I didnt say anything. When we got to my house I ran out onto my lawn and saw everyone who was at the party in my front lawn, and they had crucified someone on my front door. I screamed for them to get the fuck out of my house, and my dad looked at me strangely.</p><p>Okay, now on to what really happened.</p><p>Lauren never had anyone over. It was just me and her the whole time. No one else. She said I had been pacing around her house for the past three hours and I had gone outside and talked to her dads car for about an hour. At one point I actually punched her in the face. My best friend. And Im never violent with anyone. Her mom freaked out, of course, and sent me home. For some reason when I was on the dramamine I didnt think it was strange that my dad came to pick me up at three o clock in the morning. I didnt realize how fucked up I was until my father told me that no one was on my lawn, and that I was screaming at absolutely nothing. When I went inside I was finally able to distinguish real from fake, and I saw Jenny Jones in the mirror, a butcher knife hanging from a tree, and things randomly floating in the air.</p><p>This drug is way fucking scarier than acid, shrooms, or anything Ive experienced. I wouldnt suggest it, but its kinda cool. I cant figure out why I believed all I saw to be true. None of it made sense.</p>",
 "year": "2003",
 "id": "26606",
 "gender": "Female",
 "timestamp": "2007-11-09T08:00:00.000Z",
 "views": "4201",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "24 tablets",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 }
}
