{
 "title": "A Crystal Disaster",
 "author": "The Wabbit",
 "citation": " The Wabbit. \"A Crystal Disaster: experience with Methamphetamine (ID 26600)\". Erowid.org. Sep 4, 2003. erowid.org/exp/26600",
 "substance": "Methamphetamine",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Methamphetamine",
   "(daily)"
  ]
 ],
 "report": "<p>My first experience with meth was not very pleasing.  I did a small line which made my nose burn.  The drip was pretty bad.  And I was told to swallow the taste, and not try and spit it out.  Shortly after, my heart began to race and I felt very uncomfortable.  I ended up being scared out of my mind all night. </p><p>I didn't plan on using meth again.  Then my friends started snorting lines regularly on the weekends.  I joined in with them just to stay up all night and have long conversations. I was beginning to have more of an enjoyable experience with the drug.</p><p>Then the wierdness kicked in.  We started smoking off of foil, and my friend spilled a sack.  She began scraping the floor and trying to find the lost contents of the sack.  She ended up smoking lint and pieces of the ceiling. </p><p>I began using a glass pipe shortly after.  I smoked nearly a 20.00 sack everyother day.  The fun was beginning to wear off.  My funds were running low, and going to school was becoming nearly impossible.</p><p>I ended up failing an entire semester of classes.  Being only 16, my family was very concerned.  I confessed to them that I was using and felt I had a problem.  But that didn't keep me from using.</p><p>I got arrested at the age of 17 for breaking and entering.  That was no fun.  And it all started because I needed a safe place to hit my pipe.  I then realized I needed to shape up.</p><p>I quit using for a short period of time.  Then, at the age of 18, I began smoking 1/2 gram daily.  I was out of my mind 99% of the time.  During this time, I experienced psychotic episodes, severe wieght loss, paranoia, sleep deprivation,  heart problems, and kidney problems.</p><p>I finally quit for good right before my 19th birthday.  The comedown was nothing short of hellish.  I couldn't move, my body ached and I kept vommiting up whatever I ate.  The worst part of the comedown though, was the severe depression, paranoia and anxiety.</p><p>For five months, I suffered with severe depression, paranoia and anxiety.  During that time, I was clean, but definately not a functioning member of society.  I now have 7 and 1/2 months clean time, and finally I can feel normal.</p><p>I would not recommend this drug if you have a compulsive nature.  Personally, I will never touch any illegal substance again.  The time it took me to recover from my drug use is not worth a weekend of tweaking.</p>",
 "year": "2001",
 "id": "26600",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-09-04T07:00:00.000Z",
 "views": "16036",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(daily)"
  }
 ]
}
