{
 "id": 2661,
 "title": "Waste of Time",
 "date": {
  "submission": "2003-02-08T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Disappointed Kid",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>I had gone to my dads house last week to visit, since my parents are divorced.  While I was looking for some allergy medicine I ran across some hydrocodone.  I didn't really know what hydrocodone was, so I got on erowid.org and search the vaults.  When I learned it was Vicodine I nearly shit my pants, there had to be at least 50 pills up in the medicine closet...I'm not sure why, but I didn't question. ",
  "I starting thinking about if I stole them when I would be able to actually take them.  I remembered that we had monday off of school so I figured I'd find time somewhere in a span of 3 days to try them.  I went in and took 3, not really knowing how many I would need.  I told my friend I had gotten them and he wanted to buy one from me, so I sold it for a buck. ",
  "It was a friday night and I had nothing better to do so I decided to try the vicodine my dad had in his medicine closet.",
  "Now, I have read some experiences about vicodin through out the week where some rather heavy people get fucked up on only 15 mg of hydrocodone.  This made me happy because that's all I had since I sold one to my friend.  So there I was, on a friday night stuck with only two 7.5 mg pills.  I wasn't sure exactly how I wanted to take them.  I talked to my friend via AIM and he told me blowing them sucks because you have to crush them so finely for it to work (I think he was bullshitting). ",
  "Since I had nothing else to base a method on, i broke them up a bit with my teeth and swallowed them with a little water like I had done with codine earlier in the summer. ",
  "It was 11:22 pm and I hadn't eaten anything since around 6 pm, so I was expecting the pills to kick in rather quickly.  I went to the computer and turned on some doors and pink floyd for what I hoped to be a pleasent experience.  After about 30 minutes I didn't feel anything and was getting pissed and disappointed all at the same time.  I decided to give it another 10 minutes before I got totally mad about it.",
  "It was now about 11:58 or so and I had felt nothing.  I half expected this since I had not gotten any effects from some codine I had tried with my friend over the summer.  I was truely disappointed that I went through all the trouble of getting the vikes and waiting all week to use them and I felt nothing...just boredom.  I guess I did learn one thing though, make sure if you're going to do pills of any kind, grab more than you think you'll need...just incase the ammount you take doesn't effect you.",
  "Well I hope this wasn't too painfully boring and that perhaps it'll help your experience on hydrocodone.",
  "It's now 1:50 am and time to go to bed.",
  "Good night and good luck with your future experiences.</p>"
 ],
 "erowid": {
  "id": "18755",
  "citation": " Disappointed Kid. \"Waste of Time: experience with Hydrocodone (ID 18755)\". Erowid.org. Feb 8, 2003. erowid.org/exp/18755",
  "substance": "Hydrocodone",
  "views": "41708"
 }
}
