{
 "title": "Rolling on Razorblades",
 "author": "anjovis",
 "citation": " anjovis. \"Rolling on Razorblades: experience with 2C-I (ID 26669)\". Erowid.org. Sep 8, 2003. erowid.org/exp/26669",
 "substance": "2C-I",
 "bodyweight": "83 kg",
 "report": "<p>21.00 - 11mg of 2C-I ingested in powder form. Quite repulsive taste, but not as foul as tryptamines.</p><p>21.50 - 11mg</p><p>I don't feel any symptoms, except slight alertness, which hints threshold effects. I decide to take another 11mg this time in gelcap.</p><p>I get hungry and eat fries, which turns out to be the worst idea ever. All the grease makes me quickly nauseous. My wife comes to get me home. I feel the drug turning on quite strongly while finishing the fries and sitting in a car back home. Sitting in the vibrating car with nausea from too greasy food is a bad combination. I don't feel right. At home, we set our daughter to bed and nausea gets worse. The greasy food was a bad, bad idea. The trip is coming on really fast. My wife amd the baby go to sleep and I go upstairs to try some music, hoping it would set me back on the good track.</p><p>around 23.30</p><p>The floor.. dancing wildly along the music 'Namlook & Hawtin - From Within 3 - trip 05'... visuals are massive, but thinking lacks depth. I see Sea Lions on all patterns, very detailed and exquisite. No spirituality. Very much on the trip though, +2 at least. Too much for me now.. set and setting are not right.. I am at no peace, calm was broken. I try to fall back to music now.. yawning and some body buzz. A slight time dilation. Everything is squirming and whirling, visuals are too much already. I could use even some less of them. Although, they are beautiful. Patterns, everywhere. Music is quite the same as it used to be, but sensory feelings are very different. I flow into different moods and areas. 'Sibelius - En Saga' is an interesting classical piece. I see Inka motifs in front of all my desktop background pictures. I fall into thoughts or sensory input patterns every now and then, snapping back to reality and falling back. It is like rolling through razorblade sharp sensory inputs.</p><p>I close my eyes and fall deep into this image rolling on razorblade sharp perceptions. All touches and closed eye visuals seem like thin and sharp rolling sensations, very peculiar feeling. I gain back the touch with reality easily when I try to and snap back from those spiralling thoughts. It was strange, but not pleasant.</p><p>I watched Nikke Knakerton detective cartoon. It helped to lift my mood a lot.</p><p>1.05 trip is slowing down, motifs are not so clear. Patterns are not everywhere anymore. Music is fine and I can sink into it, though still far from acid experience. I try some grass, but it tastes awful. I get shudders sometimes.</p><p>1.37</p><p>I feel that I have lowered to a level of light acid trip. This is a nice level of tripping, somewhere around +1.5</p><p>Watching South Park makes me almost collapse with laughter. Well, it made me collapse from laughter after all.</p><p>My artificial (and beloved) sun (lamp) is glowing. It changes from fat cheeky sun to slim pointy sun and back. Interesting flow. The floor flows exactly as it did on my first trip.</p><p>2.17 Patterns have almost disappeared. Pattern movements are slow and still slowing down. This is still a nice +1.</p><p>This time I was fairly far and with bad vibes in the beginning, although I could set my mood for the better by concentrating a little. Too bad, the actual substance seems interesting. Quite pure psychedelic with strong visuals and some physical energy, but without any major negative effects in itself. It seem to also affect taste and especially smell perceptions somewhat. Next time I will take less, probably somewhere around 15mg would be good. Setting also must be better. I should have no other distracting things to do (like changing diapers didn't help me get out of nausea and bad trip). I also have to remember not to eat heavily before tripping, even though it has not caused any problem before this. I was close to getting +3 at the peak, but with this poor start it was not as good as I would have hoped.</p>",
 "year": "2003",
 "id": "26669",
 "gender": "Male",
 "timestamp": "2003-09-08T07:00:00.000Z",
 "views": "12319",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "11 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:50",
   "amount": "11 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 }
}
