{
 "title": "Its Just a Boost",
 "author": "Loup",
 "citation": " Loup. \"Its Just a Boost: experience with Salvia divinorium, Coltsfoot & Alcohol (ID 26665)\". Erowid.org. Jan 16, 2007. erowid.org/exp/26665",
 "substance": "Salvia divinorium, Coltsfoot & Alcohol",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "4 oz",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  "",
  " ",
  "oral",
  "Salvia divinorum",
  "",
  "",
  "1 bowl",
  "smoked",
  "Salvia divinorum",
  "(leaves)",
  "",
  "4 oz",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  "",
  "1 bowl",
  "smoked",
  "Salvia divinorum",
  "(leaves)"
 ],
 "report": "<p>Myself and three friends decided to have a night of drinking.  The previous night, we discovered when smoking coltsfoot for taste, it boosted the alcohol and gave you a sense of complete fuzziness in the head (as opposed to a clear headed feeling).  I also was curious about salvia.  I started the night drinking about 4oz of fluid which was a decoction of salvia made from approx half a gram.  I don't think the decoction did that much overall, and to extract the chemicals some other method is needed.</p><p>We (the four of us) then started drinking about half an hour after.  We went shot for shot and finished off the first bottle of 151 pretty quickly.  Then we sat around, I smoked most of a bowl of coltsfoot, the others only wanted a hit or two.  Then I decided to smoke some of the salvia.  We all agreed that like coltsfoot, the salvia also strongly boosted the alcohol.</p><p>I am skipping the details of us listening to some music waiting for alcohol to come on, and the subsequent alcohol based conversations that occurred.  Furthermore, from this point on, I can't give any time related information as my sense of time was completely lost.  After smoking a few bowls of salvia, I spent a few minutes on the phone with a friend having an aimless conversation about pussy.</p><p>On whim, I decided to start spinning around in circles.  My view was blurred, but I was able to clearly pick out which blur belonged to what object, like that brown is my friend, that white is the stove, that yellow is the table, that black is the window, etc.  And overall it was rather lucid.  I noticed that while I was standing straight, the room spun constantly; while I was spinning, I had a really good sense of balance and I could spin quickly while staying confined in a small circle of space.  We as a group then decided to go out for a walk.  All through the walk I was very hyper and bouncy, and I was jumping all over the place on top of stuff, etc.</p><p>I noticed the whole time that I was feeling predominately drunk, and the salvia only boost.  We got back and drank some more, finishing off the second bottle.  I had a considerably harder time taking it down, and then I capped it off with some more salvia.  Right after those hits, the room started spinning even more and it was almost like an amusement park ride.  I got so dizzy that I ended up puking purely out of motion sickness.  After that the details got fuzzy though I do remember taking a couple sips of some beer before I passed out on my friend's couch for a couple hours.  I woke up and noticed it was 5.30.  Everyone else was gone, so I picked up my stuff and just headed back to my place where I slept for another four hours.</p><p>I woke up this morning, feeling dizzy, and I'm typing this up still very very dizzy and with no appetite at all.  Overall though, while I did feel effects from some raw salvia leaf, I found that its really more just a boost for alcohol than anything else.  My friends really liked it that way and didn't mind the flavor smoked either.  Also worthy of mention is an herb that is used to treat bronchitis named coltsfoot also gives the alcohol a very nice boost when smoked.</p>",
 "year": "2003",
 "id": "26665",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-16T08:00:00.000Z",
 "views": "4618",
 "dose": {}
}
