{
 "id": 2668,
 "title": "Dayglo UV Queen",
 "date": {
  "submission": "2007-03-07T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alice Kitty",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "substance": "Amphetamines"
  },
  {
   "time": "0",
   "amount": "repeated",
   "substance": "Methamphetamine"
  }
 ],
 "report": [
  "Hello. Just thought I would write in with my account detailing one and a half years of speed! I thought this might be a good way to mark the end of what has turned out to be a very mixed experience.",
  "I am now 26, and have been taking speed habitually on and off since February 2000. Since I live in the UK, amphetamine is more readily available here than meth. Though having said that, this last half - year has been characterised by the ingestion of both these substances!",
  "I tried speed first at the age of 16, and, ironically considering my love of it in later years, I didn't think much of it. I realise now that it must have been of a particularly low purity. I figured I could get by on my natural energy, which was, and still is, in plentiful supply. I wish I'd held onto that thought. Between 16 and 18 I danced all night on nothing more than caffeine drinks and enjoyed it just as much, if not on occasion, more than my hyper weekenders on speed.",
  "When I was 24 I got quite involved in the club scene - I danced, did stalls with UV jewellery and tee shirts, and painted backdrops. It was excellent fun and a good way to meet people and swap ideas as well as dance until my feet bled and talk people's ear's off.",
  "A few months into 2000, I became aware that I had a burgeoning habit - I nipped into the Ladies' at work and had a rather large line - it was an antidote tiredness I obviously shouldn't have taken.",
  "I was soon taking it every weekend, then two or three times a week. I found I could go no longer than 6 days without the stuff, but never did it every day. I managed to lay off it totally after a 4 and a half gram fuelled weekender, swiftly followed by episode 1 of amphetamine psychosis, for eight months.",
  "You'd have though I would have learned my lesson, but no, in May 01 I met a girl who actually did the stuff IV. It wasn't long before curiosity got the better of me, and, after a long period of total abstinence, I mainlined it. I felt as if I had been literally wired to the wall like an electric conductor! It was amazing but I was really scared that I'd done it that way. It led to the end of my relationship with a guy I was living with at the time.",
  "Within 2 months, I was doing it every day. Mainly orally, with loads of snorting at the weekends, and the odd needle as a dubious 'treat'. I realised really fast that I had a real problem but quite simply couldn't bear to do anything about it. That went on for a year. I neglected lots of things, including some really good friendships, in favour of amphetamines and this girl who was bleeding me dry of money and trying to take up all my time AS WELL AS trying to get me into IV usage as a permanent thing. In May this year I got help and really thought I was going to give up. I did, for 19 days, very long days I can tell you!",
  "Then I kept it to the weekends, with moderate success. I was down from 7 grams to 2-4 a week, and felt much less angsty and paranoid. Unfortunately it was then that I discovered the potent meth and d-amph. mix I now know and love.",
  "Now I'm giving up for good. The impetus is that a friend threatened to 'dump' me otherwise. I also want to give up in any case. I have had amp. psychosis 4 times and am often beset by ridiculous paranoia and anxiety. I hjave lost weight, yes, but I'm never going to be big in any case - just wasn't built that way!",
  "I did have some brilliant, hypercharged times on this stuff - it's undeniably a wonderful rush when it's decent stuff - but the comedown, and the emotional costs are too great.",
  "Though, having said that, I wouldn't wish the withdrawal on anyone!",
  "Hope this isn't too long!",
  "Alice"
 ],
 "erowid": {
  "id": "18764",
  "citation": " Alice Kitty. \"Dayglo UV Queen: experience with Amphetamine & Methamphetamine (ID 18764)\". Erowid.org. Mar 7, 2007. erowid.org/exp/18764",
  "substance": "Amphetamine & Methamphetamine",
  "views": "9971"
 }
}
