{
 "title": "5-MeO-DiPT Dee Doodah!",
 "author": "Catfish Rivers",
 "citation": " Catfish Rivers. \"5-MeO-DiPT Dee Doodah!: experience with 5-MeO-DiPT (ID 2668)\". Erowid.org. Oct 8, 2000. erowid.org/exp/2668",
 "substance": "5-MeO-DiPT",
 "bodyweight": "282 lb",
 "report": [
  "<p>It seems the afternoon began with a gelcap of 14 mg. 5-meo-dipt. I then wandered the wilderness behind my mother's home. I pulled a log up to the edge of the lake and sat back to understand the mindset of the FOX. Onset within 20 minutes was a ++ within a half an hour. Slight chest energy being felt...similiar to an MDMA whoosh! Lots of goosebumps being felt. All this was going on unnoticed by me for a while because I was reading...just as I began to feel my head change gears...who should pop up into my thought to be private woods-hide-away-place? Strangers! I was able to carry on a reasonably coherent conversation about the imminent destruction of the woods area we were standing on due to God's desire for more golf courses. Ugh.  I soon yelled retreat and took it all back into my bedroom. Safety!! This is only about 1 hour in to the experiment.",
  "I've read there usually isn't much too look for visually in this substance, but I'm already having neon like gestaults tracers while I'm listening to some Mogwai, lying back on my bed. It is visually comparable to an experience with 2c-t-7, 30 mg that I have had. There was a HUGE aphrodisiac affect. Masturbation was intense and wonderful. This material has great potential for Sex-magick! At around this point I'm well into a +++ experience!",
  "Next I took a DIPT in the pool! Water was exciting and refreshing. Lots of positive energy! AND THEN...waitta a second...something's weird HEAR...all of a sudden everythings sounds shifted down a bit. I try listening to some Phish an start cracking up because they sound like a record player...dying. This aspect of the drug is entirely fascinating to me! The pitch shifting effect was easily noticable (and hilarious!) when listening to music. I wonder if it is affecting the rest of what I'm hearing? I couldn't help comparing it to to the same fascination I have with hearing my voice on Helium! I thought my voice sounded weird a few times, as if I was hearing it in a bubble, but anyhow...",
  "It's six hours later now (and dark), visually, I'm still very active. Body feels loose and energetic. Sitting in my back yard, watching leaves and limbs and shadows meld black and into each other. Neons tracers are connecting to anything with a visable edge. Mentally in fine spirits! There is a strong desire to bond with lost friends. Marijuana smoked at this point launches a second wave of visuals and pleasant energy pulsations throughout the body. Definitely will use again.</p>"
 ],
 "year": "2000",
 "id": "2668",
 "gender": "Male",
 "views": "8420",
 "dose": [
  {
   "time": "0",
   "amount": "14 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2000-10-08T07:00:00.000Z"
}
