{
 "title": "Not As Short As They Say",
 "author": "Anonymous",
 "citation": " Anonymous. \"Not As Short As They Say: experience with Salvia divinorum, Cannabis & Ecstasy (ID 2672)\". Erowid.org. Nov 29, 2001. erowid.org/exp/2672",
 "substance": "Salvia divinorum, Cannabis & Ecstasy",
 "bodyweight": "55 kg",
 "report": [
  "<p>Last Friday I got the salvia shipment from abroad. Everything was ready: A mixture of tobacco, good weed, and salvia. It was about 11 am. I closed all the windows in the house, and let just a little bit of light to come in, so I can see the bong, the lighter and of course, the mixture on the paper. I tried to relax, but still it was hard, I was very curious about what was going to happen. I heard that the salvia trip is harder then LSD, and because LSD hits me harder then others (so does weed) it seemed that my mood is not the exact one a person should have before walking into the very intense trip. I put my favorite psychedelic album-'gong-you'.",
  "The first hit I did really blew me away already when I was keeping the smoke in my lungs (kept it in for 30 secs). I don't mean that it was so intense, it was so different. I did'nt figured out what was going on, but the minute I let the smoke out I did another hit, followed by 2 or 3 more..I don't remember:)",
  "But it did'nt take me a long time to figure out that I smoked too much. The feeling I started with changed. I was now in a battle with the entity of the LSD, that fucked me up a bit. I felt tremendous forces within me colliding. I had to fight the LSD visuals that were coming back to me really hard, probably because of the weed that was in the mixture. Weed makes these visuals (which I see also when I'm not on anything) intense too. This part of the trip was quite bad. During this time I was'nt very comfortable, and changed my position in the house several times. Generally speaking, the body feeling was weird and enjoyable. I felt my body parts stretch into different proportions, and with my eyes closed I could'nt really tell what exactly is my position.",
  "When the music stopped (after 40 minutes) it was the first time I noticed how the details changes the way I think. This CD is a hard one, and made my head messy. Maybe the thoughts I had about the LSD came to me from that CD. I never tripped on LSD without it. I was glad it stopped. It was strange also to find myself still peaking after 40 minutes, because the peak time supposed to last about 20 minutes. I think it's the weed that made it last longer.",
  "I decided to play another CD of gong -'angels egg'. This CD always gives me some kind of a natural high, and I refer it as an xtc album more then an LSD album. While listening, this thought led to a great appreciation to the xtc, which always clears my head and fights the marks that the LSD left on my brain. If you know how good it feels to get out from a bad trip to a very good one, you can imagine how was it like to get up, open up my closet, and to look at 2 excellent xtc pills!:) I saved those pills for the theme park, but who cares? :)",
  "I took 1 pill, and went back to the music. At this point I got a lot better. Now I began to notice the psychedelic characteristics of the salvia. Was not confused as I often get with LSD. Unlike LSD, the insights are very simple, yet very deep. The intuition takes a big part of the insights, so I can feel how much it's true. The sounds were a bit stronger, but not altered. I think that listening to music is a must for me for this kind of a trip. The music is deep in a way I can't put on words. It has a tremendous psychological effect, so I tried to choose something not to loud.",
  "It took a lot of time for the pill to get into action, about 40 minutes, and it was more gradually. Usually it takes about 30 minutes until I'm starting to get those happy feelings, after the initial change of the body feeling.",
  "It was just great. Those drugs mixed perfectly. A psychedelic bliss. The euphoria was even more personal then social, but still the social aspect was stronger then ever. I found that out when I went to a very good friend of mine which lives next door. I felt the euphoria more then I expressed it. Sometimes on xtc I express myself in way that feels a bit fake. This time I did'nt have that feeling at all. It felt so honest, more then usual xtc. The body feeling was ideal - the salvia became an 'upper' instead of a 'downer', because of the energy the pill provided. Singing and playing gets really fun and creative in a unique way.",
  "On 2 pm, I found out that smoking more of the salvia (when I went back home) was'nt as effective as it was last time. But I was definitely tripping stronger then before, and I was still peaking on the xtc. The hours went by, and I decided to go to bed at 5pm. The effects were still quite strong, more mentally then physically. For more then 5 hours, all I did is listening to all kinds of inner voices, some of them where serious, some of them talked nonsense, and they discussed with each other. This stopped at 22:30, When 2 of my best friends arrived to try the new plant. It was shocking, because I was in a complete silence for hours, and the only voices I heard came from my mind. They told me I have that trippy look on my face. I still was'nt at baseline, and my last hit was at 2 pm. I managed to get about 6 hours of sleep, because of the weed I smoked that evening, then I woke up feeling normal.",
  "It was a very varied experience, and I can't say how good is this salvia, because I did'nt try to smoke it clean, and xtc and even a bit alcohol were involved. But anyway, just the mix of it with xtc was worth the effort of getting it, and one of my friends that took my other pill that evening and smoked salvia told me that too.</p>"
 ],
 "year": "2000",
 "id": "2672",
 "gender": "Male",
 "views": "6835",
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:45",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  },
  {
   "time": " T+ 3:00",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2001-11-29T08:00:00.000Z"
}
