{
 "title": "Easy Tripping",
 "author": "palex",
 "citation": " palex. \"Easy Tripping: experience with 4-Acetoxy-DiPT (ID 26764)\". Erowid.org. Sep 14, 2003. erowid.org/exp/26764",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "65 kg",
 "report": "<p>Introduction (those not interested can skip this part):</p><p>I work as an healthcare provider in an institution for brain-damaged people. This might influence this report in a neuro-psychiatric direction, althought not intended to be exhaustive. There's a definite link between my occupation and my interest in mind-altering drugs. Both reflect my quest in getting insight in the realms of consciousness.</p><p>By taking mind-altering drugs (or, in my vision, neuron-altering drugs), what can be said of other parts of our existence. I realise that there are a lot of implicit and explicit questions coming forth of that. And of course, these make objective science on personal scale not any easier.</p><p>I've read some time ago a report on this site stating a little bored that taking mushrooms is mainly about becoming familiar with our unconsciousness, some form of road mapping. If that's true, there's an awful lot of work to do. I believe our consciousness being a product of our subconsciousness, the first coming forth out of the latter. And this tip of the iceberg is called our everyday live. Yes, it does bore me sometimes, but there are very little ways to escape. And yes again, one of these ways is taking some particular drugs.</p><p>My search extends to that one, burning question: is there something preceding our unconsciousness. Maybe not preceding, than seperated, but anyhow knowable?</p><p>This far nothing unfamiliar. All religions try to give answers to these matters, but very little put their findings besides neurological insights. I'm trying to give my account to this, as most of the contributers to this site more or less explicitly do.</p><p>Well, this evening in september Europe is being set up to find out wether 4-aco-dipt alters my neurons enough to glimpse beyond our everyday live consciousness. (Sorry it took me so much introduction).</p><p>-------------------------------------------------------------------</p><p>Set: home, with one infant sound asleep, wife and other child out of town. Children-induced mess is structurized to orderly portions, I won't break my neck in my probable drugtrance. Gives me an restful feeling when I trip at home.</p><p>Setting: I'm feeling relaxed and generally content, looking forward to trying this long awaited substance. A mild sinusitis lingers on the background, as well as a hint of intestinal discomfort. Last meal was eaten 2.5 hours before dosing</p><p>18:35 10 mg 4-aco-dipt was dissolved in a little tapwater en washed away with juice. Bitter. I do some random things, a little nervous, this first trial. I try to listen to some proven tripmusic, like Underworld, trancemusic by various DJ's, Overtunes singing and New Age music. Nothing really interests me.</p><p>18:50 Restlessness is being recognized as tryptaminergic, as well as feeling my facial muscles and the feeling as though I'm developing a fever. I feel cold. Muscle tonus is higher, probably as a way to let my body temperature rise?? It feels as though energy surges troughout my body, up and down my spine, into my extremities. Nice feeling.</p><p>18:55 Rest seems to get hold on my mind, and another tryptamine-related sign comes forth: it takes about 2 minutes to get used to the thing your busy with (or not). I'm lying on bed, limbs randomly scattered around me, listening to Underworld. Auditory imput seems a little flat. It feels good, just as opium does, or the afterglow of the usual methyltryptamines. But this is only the coming up. I'm not peaking yet, or am I?</p><p>19:10 I'm getting too cold to feel comfortable. I feel some bowelcramps, and to my shame gas was accompagnied by a little excrement. I need to shower, giving me the opportunity to try the esthetic part of this drug. In the mirror I see a smiling bella-donna. What am I smiling at, with these huge eyes? I think it's just because I feel happy. Some motor-instability. More mental attention needs to be paid to the usual showering method. The mental sharpness I witnessed before ingestion makes place for some mental clumsyness, a bit chaotic. The 4-aco makes it's reputation well worth as I take a towel. Drying my arms and legs feels magical. But soon I get restless again as the actions neccesary for relieving my cold feeling follow to quickly.</p><p>19:20 I feel hungry and want to know wether or not food can be combined with the iprocetyl. It can, but there's less taste and all feels a bit square inside my mouth.</p><p>19:25 Scattered limbs on the matrass again, music from headphones, staring eyes see some afterimages, and peripherical swirling movements. CEV are limited to some randomly displayed indigo and white flashes.</p><p>19:50 I try to meditate. Concentration unaffected, OEV diminish as my eyes stand more and more still. The usual 'eyes-stand-still' optical illusions are perceived.</p><p>20:00 I call my grandma, she's hospitalized. The conversation goes easy and affectionate. I'm sure she wouldn't tell... Neither would my mother, just calling right after I put down the phone.</p><p>20:40 I realise after some 40 minutes most of my peak is spent by calling.</p><p>I feel no particular sexual arousal. But when tested, there's that same opiatesce properties by delayed and prolonged orgasm. Great balls of fire and rushes from top to toe. Leaves the most well balanced combination of cannabis and GHB way behind. Very intense.</p><p>21:00 For the most part I'm down. It went as smoothly as it came, leaving me astounded by this unique chemical. Watching the headlines about suicide bombers still can't bother me too much, my body feels relaxed as well.</p><p>22:30 Sleep comes easy; the next morning I feel replenished.</p><p>Next day: mild euphoria, a usual part of my tryptamine experience. (I use small amounts of 5meo-dmt as a mild anti-depressant in the dark wintermonths; 5 mg/2week does the trick). Mentally still a bit cloudy, the flow of thinking is hindered a bit. This slowly decreased over the course of a few days.</p><p>4-Acetoxy-dipt has some very nice properties in my opinion. Apart from its clear tryptaminergic signature, it's reminiscant of an opiate; at least a little bit. It's easy on the body and gives an overall easy trip. I would surely use this with my wife, providing the base of a good time together in many different ways.</p><p>There's very little 'transsition-time' (as I experience with mushrooms), dissolving in an ongoing afterglow feeling, even extended to the next day. The slight mental foggyness the days after is it's biggest adverse reaction.</p><p>In this dose it hardly prove worth in exploring consciousness and was of no gain in search for unconscious parts of the self and whatever beyond.</p><p>All in all, this substance will be used again, in different situations, in different doses.</p><p>--------------------------------------------------------------------</p><p>For those interested a short medical review:</p><p>Psychiatric: affect: euporia. no delusional thinking, some visual distortions (swirls and fosphenes); auditory seems more flat (almost imperceivable). No neuroticism</p><p>Neuro-psychiatric: structurized thinking: affected, a bit more associative, though calm. </p><p>Executive abilities: affected ability to start and maintain actions.</p><p>Focus: single-stimulus unaffected, multistimuli affected. Slightly decreased stimulus tolerance.</p><p>Stress-coping: no objective measures</p><p>Somatic: balance affected.</p><p>Nociception: little less pain-sensitive; increases skin sensitivity. Mydriasis. Probably thermostate influence, slower, deeper breathing, faster heartbeat. Higher tonus, very little nausea and bowel cramps.</p>",
 "year": "2003",
 "id": "26764",
 "gender": "Male",
 "timestamp": "2003-09-14T07:00:00.000Z",
 "views": "22821",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
