{
 "title": "REAL Love on E!",
 "author": "MTM",
 "citation": " MTM. \"REAL Love on E!: experience with MDMA (ID 26771)\". Erowid.org. Sep 14, 2003. erowid.org/exp/26771",
 "substance": "MDMA",
 "bodyweight": "170 lb",
 "report": [
  "<p>It all started with the first pill back in 1998.  After graduating from highschool I did not exactly know what I wanted to do next academically so I decided to take some time off to think.  Not wanting to be a useless individual I took on a job as a bartender in a fine dining restaurant which stayed open rather late at night.  I was an out going individual who loved to go out, party and have a good time.  Unfortunately due to my working hours I was unable to attend parties or nightclubs with most friends because they would be closing about the same time I finish work.  Accordingly I would be forced to go home early on friday and saturday nights thinking the parties were all over at 2:00am.",
  "This somewhat boring lifestyle of mine changed rather quickly when one of my good friends who I haven't seen in some time invited me to go out with his buddys for a birthday celebration one saturday night.  Unaware of where they were going I naturally regretably refused excusing myself with the fact that I was working late.  This suprisingly did not seem to be a problem since they were not planning to get to the club earlier than 1:00am.  I accordingly have been told that this particular hot-spot doesn't close its doors until the late hours in the morning.  What??? I asked myself.  Could this be possible? Hanging out in the past with only the drinking crowd I could not imagine partying till the late hours in the morning and did not even think such places existed.  Jumping in for the opportunity to to recover my dull social life I could not refuse this offer.  Accordingly I decided to show up...",
  "I met up with my friends in a parking lot near the nightclub at approximately 12:45am.  Thinking that they would already be drunk I was quite surprised when instead of holding hidden booze in their hands they were holding just plain water bottles.  What kind of fun is that??? Sipping on water for a good time? Sounds crazy to me, I thought.  It wasn't until my friend pulled out about a dozen little orange pills from his pocket that I finally realized that they were doing some kind of drugs.  Never having done E before or any drugs for that matter I felt a little out of place.  And than the convincing started... It took a good half hour before I finally agreed to drop with them.  When I first handled the tiny pill I thought it was some kind of a joke.  How can such a little,orange pill, with a goofy 'BIG MAC' stamp on it possibly make me high for hours??? It simply looked like a Flinstones children's multivitamin to me.  Well being late as it was I decided to put all pesimism aside and drop the pill...",
  "We waited in the line up for a good twenty minutes before the door man finally let us in.  We got through the security search, turned the corner and WOW............. There I was, what seemed like a wave of bodies dancing infront of me.  The music was superb, the place was packed with beautiful people just dancing the night away.  The lights were flashing, lasers were beaming in all colours and in all directions and the place was just setting off such a wonderful, friendly vibe.  I looked at my watch and it was nearly 2:00am.  I have dropped the pill nearly an hour ago and still I felt nothing.  I waited another twenty minutes or so, and I slowly began to lose hopes for a buzz of any sort...This was just not going to happen...or was it?  I am usually really tired after a 12 hour restaurant shift but for some reason I was wide awake and my energy seemed to have increased. No, it's all in my head I thought.  Slowly I excused myself from my friends and decided to head to the patio for some relief from the heat.  The place was so packed that it took about a minute to travel a 10 meter distance.  I finally got to the patio and KABOOOOM!!!!!  I suddenly began to feel an incredably warm feeling coming from withing my body.  My skin began to tingle, my mind became clearer than ever, and everything was happening so fast! I have never felt better in my entire life! I felt as if I weighed no more than ten pounds. I did not even care that my friends were all inside.  I was happy. I was happy where I was, just the way I was.  It was great. Trying to cope with all these uplifting changes in my mood and my body I leaned beside the bar in order to analyze this type of high.  As I stood there, nodding my head to the music which now sounded even better, I began to feel dehydrated. ",
  "I lifted my head to see where I could purchase some water and the first thing I saw was the most beautiful girl I have ever seen.  Our eyes locked and we exchanged a warm smile.  I figured she was enjoying the same high I was, and was happy for her.  Our eyes locked again and this time she moved closer.  We started talking right away and I felt like we had the smoothest conversation I have ever had in my entire life with anyone.  It wasn't long before we got physical and we were giving each other massages all night long.  We left the club together at 8:00am and decided to grab a coffee.  From there we talked some more...........",
  "..........It is 2003 and I have been happily married now for over three years.  To the same girl that I met that night.  We live together we both have great jobs and still drop occasionally.  I would have never talked to her if we were sober.  Ectasy has brought us together and helped us find each other.</p>"
 ],
 "year": "2003",
 "id": "26771",
 "gender": "Male",
 "views": "14033",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2003-09-14T07:00:00.000Z"
}
