{
 "title": "The Inner Eternity",
 "author": "Gnostikoi",
 "citation": " Gnostikoi. \"The Inner Eternity: experience with 5-MeO-DMT (ID 26784)\". Erowid.org. Dec 3, 2003. erowid.org/exp/26784",
 "substance": "5-MeO-DMT",
 "bodyweight": "220 lb",
 "report": "<p>'Man is a portal through which one enters from the outer world of the gods, demons and souls into the inner world, from the greater world into the smaller.  Small and insignificant is man; one leaves him soon behind, and thus enters once more into infinite space, into the microcosm, into the vast inner eternity.'</p><p>                            -CG Jung</p><p>                             'Seven Sermons to the Dead'</p><p></p><p>This is my first experiment with 5-Meo-DMT, and I'm both excited and nervous.  This compound is one that I've been wanting to try for a long time, thus the excitement; however, I don't use psychedelics nearly as much as I used to and I feel that I'm losing my ability to let go and surrender control, so the prospect of an completely immersive experience is one that I both desire and fear.  I go into the experience with the hope that said ability will be rejuvenated and refreshed.</p><p>I load the small pile of white powder onto a piece of aluminum foil, which I have creased down the middle to hold the dose.  I grip the hollowed cylinder of a pen between my teeth and apply flame from underneath, allowing the chemical to slide down the crease and tracking it with both lighter and pen.  I'm surprised at how quickly it becomes smoke, it's almost instant.  I manage to get most of the smoke into my lungs.  To me, the smoke is neither harsh nor particularly unpleasant tasting - it reminds me strongly of my days of smoking meth, the taste is almost identical.</p><p>I immediately put down the apparatus and lay back.  I hold the smoke for a while, but I let it out far before I actually need to because I'm already feeling it.  The first sensation that I notice is a growing heat in my ears, which becomes almost painfully intense before my attention is distracted by the next sensation; my whole body, but particularly my face, feel like 'pins and needles', like a limb that's fallen asleep and is waking up.  Then my mind is reeling, and I feel a strong sense of motion, but in no particular direction.  Visually there is something happening, but it's difficult to define just what - it's like my sense of proportion and my depth perception have become totally skewed, so that the ceiling looks miles away whereas the wall to my left, which is in reality a few feet from me, looks like it's a fraction of an inch from my face.</p><p>Something urges me to roll on my side, and I comply, instinctively adopting the fetal position.  At this point, only a few seconds have passed, perhaps fifteen at the most, and I am having a very intense experience.  I have a CD playing quietly - Dead Can Dance, the Spiritchaser CD - and I become intently focused on the Middle Eastern rhythms of the song 'Indus'.  The music sounds odd, most of all the vocals (which at this point in the song are wordless melodies), and the sound in general reminds me of a gramophone, sort of distant and scratchy and distorted.  I close my eyes and it becomes far more clear; I open them and it becomes distorted again - an odd effect.  I close my eyes again and slip into a not-very-deep trance, which I find enjoyable - possibly because I feel that I could leave the trance state if I wanted to. </p><p>As I mentioned, I'm laying in a fetal position, and as I listen to the music I have the sensation that my curled limbs are curling further, and that my body is becoming a spiral.  I gradually (well, it feels gradual, although in fact this all happened over the course of about one minute from inhaling) lose the conviction that I could remove myself from this trance, but surprisingly this idea does not frighten me.  I feel very peaceful, and I just sort of 'float' for a while, listening to the music without really being aware that I'm hearing it.</p><p>Its interesting that the peak is really what I have the least to say about, because there isnt much I that I CAN say about it.  In the trance I feel no sense of the passage of time, in a literal sense because it seems to last both an eternity and an instant at the same time.  During this non-time I do not have recognizable thoughts, but my first impression as I begin to surface from the trance is of being submerged in a warm, gentle ocean and drifting with the tide. </p><p>The song ends and it seems to be some sort of trigger for me, because at that point I open my eyes.  I'm having some difficulty breathing.  I have a hard time worrying about it, but I do realize that breathing is somewhat important so I make myself take deep, regulated breaths.  I suspect that part of the perceived problem is that time is incredibly distorted - I watch the light on my CD player flash, which it does about once every two seconds, and it seems like literally 10-20 seconds between flashes.  This is probably giving me the sense that long periods of time are elapsing between breaths.  I shift to my back, close my eyes again, and focus on my breathing.  It's now been about twelve minutes since I took the dose, and I figure that I'm coming down now, and I realize that at no point during the experience did I experience any fear.</p><p>I want to get up at this point, but I make myself lay down for another ten minutes to be on the safe side.  The aftereffects remind me somewhat of more conventional psychedelics; I'm still tripping very hard, but compared to the previous fifteen minutes I feel damn near sober.  When I feel that it's safe to, I get up and walk around a bit.  That seems to dispel most of the aftereffects.  For the next hour or so I feel slightly 'off', but not in any serious way.   At about the two-hour mark from the time I took the dose, I lie down and sleep for three hours.  When I wake up I feel entirely returned to baseline.</p><p>In summary, this was a highly fulfilling experience.  From all that I have heard about 5-Meo-DMT, I was expecting it to be violent and possibly unpleasant, and it was neither for me.  I can see, however, that if I had not enjoyed the effects of the compound, the intensity and rapid onset could have made it a terrifying experience.  Im glad that I started with a moderate dose, and I plan on giving myself plenty of time to become familiar with the experience before I move on to higher doses; one thing that I certainly took away from the experience is a sense of how truly intense a high-dose experience could be.  Im looking forward to exploring this compound further.</p>",
 "year": "2003",
 "id": "26784",
 "gender": "Male",
 "timestamp": "2003-12-03T08:00:00.000Z",
 "views": "20802",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
