{
 "id": 2678,
 "title": "Pure Omniscience",
 "date": {
  "submission": "2007-07-22T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jibberjabber",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.3 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This was honestly the most amazing experience of my life. It was the answer to all my questions.",
  "At 6:00 PM Five close friends and I ingested cubensis and azurescens mushrooms. The three of us that were new to the substance, including me, split 6 grams of cubensis. The three veterans took between 4 and 5 grams of azurescens each. We hadn't eaten for the six ours prior to ingestion in order to expedite the onset of the effects. At 5:30 we had ordered a pizza so that we could eat immediately after ingesting. I was amazed to witness nearly 15 grams of azurescens disappear within moments.",
  "The three veterans took their doses 30 minutes before us, and we enjoyed observing their reactions to the onset of the effects. They waited inside our dorm room and began tripping almost immediately. They, however, offered little to no description of what was occurring, besides simple 'wow's. We then ingested the cubensis and proceeded to leave the building to embark on the most amazing adventure we would ever have.",
  "My roommate initially claimed that he felt mildly buzzed, as if drunk. I admittedly felt nothing as we walked towards a forest that we had chosen beforehand as our psychedelic playground. We made a quick stop at a field at which we normally smoke cannabis. I noticed my first effects when I caught a glimpse of my good friend holding a long piece of grass between his teeth. It appeared to me that he was shooting spider webs out of his mouth, and the stream of webbing was suspended in time. I would walk in circles around him, much like one could in a 3-D computer rendering of an object. He was like an interactive movie that was on pause. After lazing around in the field for a good 20 minutes, we decided to move on.",
  "Leaving the field and moving back to the road provided an awful feeling. Anything mechanical or fabricated (i.e. buses, cars, pavement) felt wrong. They offered us nothing; they were meaningless. Not quite knowing our way, we entered what we thought was our forest. It was instead a small wooded path. This was, however, not a problem for us. Entering the path was amazing. My vision was fuzzy enough that the entrance to the wooded area was purely black. It was honestly frightening - I made someone else lead the way. Once inside however, my pupils dilated and everything became light. I ran along the path with my arms out, feeling the energy of the trees as they brushed up against me. We turned as we reached the end of the path and left. I seemed to have more energy than the rest of our 'fellowship', as we would later call it. I ran out of the path into a clearing and continued running in circles until the rest of the group joined me.",
  "Back on the way to our destination, again, this time we didn't have to take the road, which was a complete relief. As I walked I would jump and pretend that I was flying. We finally came to our destination. We walked 5 minutes into the woods until we came to a place where we could sit. This was the point at which I truly began tripping. I laid back and looked upwards at the canopy of the forest. I was amazed to see that all the leaves on the trees appeared to be growing. It was best described by my fellow tripper as drops of ink being dropped into water. They would slowly expand, much like watching a plant grow on still life photography. I enjoyed this for a while, until I stood up and began exploring.",
  "I walked into the woods deeper, and found a giant mushroom growing next to a tree. It looked to me like a skull. Under normal circumstances I would have been frightened, but when tripping, I couldn't comprehend fear. It was a simple matter of perceiving without needing to interpret. I simply knew everything about everything. There were no questions in my mind. I could look at something and simply decide whether it was good or bad. I looked forward and saw what looked like death to me, the grim reaper in a sense. It didn't by any means scare me, in fact I approached it.",
  "After doing my own thing for a while, I approached the group again. My roommate and I sat on the edge of a fairly steep dropoff. Looking down we realized that it was impossible to determine how far down it went. Our fields of vision were far too short. I picked up objects and felt as if I were God. I knew everything about them. I picked up a small rock, and showed it to my roommate. I told him to hold it in his hand and mold it. I told him to make it anything he wanted to, and he did. I talked to him afterwards and he told me, as well, that I appeared to be God to him. I found a large boulder and I was entirely convinced that it was 'infinity'. I could hold it and become part of infinity, I was holding the entire universe! It blew my mind.",
  "I'm under the impression that I took too little of a dose to experience full field of view hallucinations, but at one point I looked up at a group of trees and it became a cathedral. I believe the greatest hallucinations are possible when my eyes become completely unfocused. They both look straight ahead, and I lose all sense of depth perception. Therefore, I can look and see colors, and my brain will turn them into whatever it wants them to be.",
  "My roommate and I, for a time, experienced an immense connection. It was entirely strange. He could describe the most inconceivable ideas to me, and I would understand them fully. It was as if we had tapped a portion of our brains that was previously not accessible. Our minds directly connected to one another through methods other than just speech.",
  "At some point I decided to smoke cannabis towards the comedown of the trip. No one else was interested so I found myself smoking an entire large joint myself. Afterwards I completely lost sense of reality. I felt as though I was in a theater, watching my life as a movie. It was what I had always imagined an out of body experience would be like. We then proceeded to walk back home, since nearly everyone had baselined.",
  "When we came back to our room, my roommate and I talked about our trip for hours. It was the most wonderful thing that had ever happened to us. I sat in my bed and cried tears of joy for hours, we had cheated life. We found the answer to all our questions, and we visited heaven. Good Game Cubensis, Good Game."
 ],
 "erowid": {
  "id": "18804",
  "citation": " Jibberjabber. \"Pure Omniscience: experience with Mushrooms - P. cubensis & Cannabis (ID 18804)\". Erowid.org. Jul 22, 2007. erowid.org/exp/18804",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "2746"
 }
}
