{
 "title": "Trip Inside Myself to Tranquility",
 "author": "D.",
 "citation": " D.. \"Trip Inside Myself to Tranquility: experience with Cacti - T. Pachanoi & Morning Glory (ID 26803)\". Erowid.org. Oct 22, 2003. erowid.org/exp/26803",
 "substance": "Cacti - T. Pachanoi & Morning Glory",
 "bodyweight": "195 lb",
 "report": "<p>After 2 failed attempts at a Mescaline trip (1 wrong cactus, 1 not enough for any pronounced effects)  I finally got it right.  I prepared the cactus by first cutting off aprox. 2 feet with an axe (4in. diameter).  Next I de-spined it with an exacto knife, then skinned it, and cut off the green outer-most flesh.  This process took about 1.5 hours in all.  I put the green material into a large pot with water and let it soak overnight.  The next morning I boiled it for about 1.5 hours, and strained it.  I took the pieces of cactus and blended them up, added wated and boiled for 15 more minutes, then strained this mixture through a metal coffee filter, getting about 2 more large cups of green liquid.  I then drank the liquid slowly starting at 9:45am, violently barfing at 11:00, and drinking 2 more glasses at 11:10am.  Nothing I tried helped the taste very much, but what worked the best was just pretending I didn't taste it, then drinking some water. </p><p>The first effects were felt at 12pm.  It felt like shrooms, but much smoother and did not come on as abruptly.  Distortions in my sight, arms/limbs seeming like foreign things, etc.  By 12:30 plants in pictures were growing, walls breathing, and carpet was swirling around.  I then decided to strengthen this trip by drinking the MG fluid I had made 3 days pervious by grinding up 125 MG seeds along with about 20 coffee seeds in a coffee grinder and let them sit in a water bottle for 2 days, then filtered the mixture and left it in my closet.  I tasted good, like slightly sweetened coffee.  This came on in about 15 minutes, reaching full strength in another 15 minutes. </p><p>I began to hear trees, birds, bugs, etc talking to me and comforting my soul.  It was not a sharp feeling like I normally assiociate with acid, the mescaline definantly smoothed it completely out, and in turn the MG strengthened the trip.  I sat outside and felt completely in harmony with all the universe.  I realized that problems I had recently (depression/anger/confusion from 2 very shitty years in a row) been having were because I let the mundane insignifigant stuff pile up on top of the inner joy that everyone posseses.  This feeling of peace was not overwhelming just from the mescaline alone, but took some meditation and relaxation to acheive.  Time passed very very slowly.  I starred at a tree for about an hour, then went inside and watched TV for another 2 hours going back and forth outside and inside. </p><p>4 hours after drinking the MG mixture, I felt it wearing off, so I ground up and drank the remaining 3.75g of seeds.  This mixture hit me very fast, about 10 mins after the 1st drink, I was beginning to feel like I had taken too much after a hose turned into a mean looking snake, and it felt very much like a strong acid trip with very jagged thoughts and I began hearing very faint screams inside my head.  At this point I just concentrated on some beautiful blue flowers went with the flow to avoid having a great trip turn into a bad one, which worked well and soon enough (about 10 mins) the mescaline smoothed the MG seeds over.  The strong trip lasted until about 10pm with no noticable peak after 12:30pm.  When I began to come down and feel incredibly hungry.  I still felt dissociated with my body, and colors were still very vivid.  At about 11:30 I was able to sleep after lying in bed for an hour.</p><p>What struck me about the trip was that the next day I remembered everything perfectly, very unlike shrooms or acid where I forget most everything that I found so cool during the trip.  My head stayed very clear and conscience.  While coming down I had a great feeling of relief like I had just intensely cried for an hour and had no more troubles on my mind.  I tripped alone at my house in a comfortable setting.  It is a very long trip, so prepare well and happy tripping.</p>",
 "year": "2003",
 "id": "26803",
 "gender": "Male",
 "timestamp": "2003-10-22T07:00:00.000Z",
 "views": "17288",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(tea)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "3.75 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(tea)"
  },
  "2": {
   "time": " T+ 4:30",
   "amount": "3.75 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(tea)"
  }
 }
}
