{
 "title": "The Green , or Yes! You Can Trip on Weed",
 "author": "Zephyr",
 "citation": " Zephyr. \"The Green , or Yes! You Can Trip on Weed: experience with Cannabis (ID 26812)\". Erowid.org. Jan 7, 2007. erowid.org/exp/26812",
 "substance": "Cannabis",
 "bodyweight": "185 lb",
 "report": "<p>Prior to this experience I'd smoked and eaten low-medium grade pot on a few occaisions, with varied results. It wasn't until discovering the Leary biscuit recipe that I truly came to appreciate the effects of this plant.</p><p>On with the story...</p><p>It was another Friday evening, and as usual I was hanging out at my friend T's house. I'd spent most of the evening listening to music and watching anime with this other dude. Basically chilling out. Then I see Nos online, and he says he's coming over then we'll go get some weed and just hang out (like we always do at Ts, no one's ever there to bother us). Tonight however, we were in for a bit of a treat. Dingo knew one of the dealers and we got hooked up with about 2 grams of JA, which is a fairly potent strain of Jamaican weed we get here in the Caribbean.</p><p>Time: 11:37 PM</p><p>Since I enjoy a more 'trippy' expericence, I opted to eat mine in a bun between two slices of cheese (microwaved), as did Nos and Dingo. It'd be about the fourth time for me and Nos eating our pot as such, Dingo had only previously smoked before. We then set about amusing ourselves while waiting for the effects to kick in.</p><p>Time: 1:09 AM</p><p>While lying on Ts bed I began to feel a familiar burning/tingling in my chest. W00! We're on our way baby! The effects come on *very* slowly however, so much so that I wonder whether or not I'm actually getting high as yet. Time slows down ever so slightly as I get up and go to the kitchen for some popcorn.</p><p>Time: 1:37 AM</p><p>I can definitely feel the difference, somewhat spaced out, somewhat lighter. Every muscle in my face is active, and I'm aware of them all, individually. Suddenly I feel very active and playful, as I usually do when high, so I put on Queens Of The Stone Age to get the vibe going. Five minutes pass, but its like an eternity. I can feel the air around my limbs as though it is thickening, and start to get some intense closed-eye visuals, in which figures move in tune to the music. This world is green and muddy, much like a swamp. I open and close my eyes, going between the Green and T's Room, Its utterly fascinating for a while. Then Nos (who never, ever feels the effects as intensely as I do) realises my situation and starts to laugh and ask me stupid questions, presumably to get me to say some gibberish for his entertainment (as I usually do...). But not tonight. This is too real, too wonderful so I close my eyes and thrash about madly on the floor, swimming through the Green.</p><p>The song changes to Pink Floyd - Time (Winamp playlists are wonderful things) and strangely, so do my 'visuals'. This time the sea is red, then cycles through blues, greens, purples and yellows until I'm confronted with a myrian of dancing bears, in jester's hats. At this point I open my eyes and blurt out something about teddy bears and banannas and start to move to the music. As I close my eyes I envision my arms as great feathered wings. Dingo, on ther other hand, is pretty stoned, but in a different manner altogether. He'continuously talking about everything and nothing, all in a hilarious New York accent. Nos just sits and laughs at us, and tries to get into the fun.</p><p>Time: Sometime after 2 AM</p><p>After realising how intense this high was going to be I decided to experiment with it. We all pretty much had the munchies, so I take two Redoxon out of the tube and hand one to Dingo. After his initial paranoia (I had difficulty explaining to him that it was safe to eat) I popped mine as well and immediately the sensation burned through my entire mouth. The effervescence of it, coupled with the sweet tangy taste was mind-blowing. I felt my teeth vibrating as the tablet dissolved, and started to giggle uncontrollably, Dingo was obviously feeling the same thing (I could tell by his facial expression) and started to laugh too. We both fell on the floor, giggling like idiots.</p><p>The burnout was slow in coming on, but when it hit me I went straight to the bed like clockwork and lay down, but couldnt not sleep. Visions of green seas and shadowy dancers came to life as soon everytime I closed my eyes. Slowly I faded away, feeling completely at ease.</p>",
 "year": "2003",
 "id": "26812",
 "gender": "Male",
 "timestamp": "2007-01-07T08:00:00.000Z",
 "views": "9670",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  }
 ]
}
