{
 "title": "What Do 'I' Do?",
 "author": "Jiva",
 "citation": " Jiva. \"What Do 'I' Do?: experience with Salvia divinorum (5X extract) (ID 26831)\". Erowid.org. Feb 1, 2007. erowid.org/exp/26831",
 "substance": "Salvia divinorum (5X extract)",
 "bodyweight": "155 lb",
 "report": "<p>I have had several (maybe five) experiences with Salvia in the past several months.  This post will refer explicitly to my experience last night, although nearly every experience is identical.  This is because time is illusory and there is really just one experience of 'waking up'. </p><p>I went to bed last night early by most young people's standards: 10:00 pm (I work very early in the morning and hence am tired early).  My newly-adopted cat, Emily, and I have been living in the basement of our apartment lately because my roommate claims to be allergic to cats. At approximately 12:20am, I awoke to Emily hissing and making primitive cat noises at something in one of the storage compartments in our basement.</p><p>I switched on the light and observed her behavior.  She would slowly enter the storage compartment, begin making a low murmuring sound, and then dash out. </p><p>I suspected that it was an orange male cat that has been periodically trying to rape Emily.  With Emily outside of the storage compartment, I decided that I would close the door to the storage compartment for a while.  My reasoning was that the orange cat, fearing being enclosed, would dash out the compartment and out of the basement when I shortly reopened the door. </p><p>After a few minutes with the door closed, I could hear a lot of activity in the storage area; the animal was climbing on cardboard boxes, searching for a way out.  Aha! I thought.  My plan is working.  Time to open the door and be rid of this orange rapist cat and get back to sleep.</p><p>But when I opened the door, an orange cat did not come running out.  Instead, there was a very odd looking creature sitting on top of one of the boxes.  It was slightly larger than Emily and had a long oval shaped head and a snout with what looked like a very sensitive nose. </p><p>It was a possum (I think).  It was a very mellow creature.  It was clearly terrified and, since I had turned the light on, it appeared to be blinded by so much light.  Emily, being a cat, puffed up and started advancing on the possum with hisses and primitive cat noises.  I quickly pulled Emily away and decided to lock her in the apartment, away from the possum, as she was only aggravating matters. </p><p>After removing Emily from the situation, I returned to find the possum cowering in the back corner of the storage area. </p><p>I first tried coaxing it out with lines like, 'Here possum, possum.  Its okay.  Here possum...', etc.  When that didn't work, I decided to wait it out.</p><p>'If I give the possum a clear line to the outside door and stay out of its way,' I thought, 'then eventually it will overcome its terror and make a run to safety and home.'</p><p>Half an hour later I was becoming impatient.  By now it was well past 1:00am and my roommate, who claims to be allergic to cats, will return home to find Emily locked in the apartment. </p><p>'This possum needs to go home right now', I thought.  But how?  The poor, mellow animal is scared out of its gourd and essentially blind by the amount of light in here.  Then I had an idea. </p><p>I had a little Salvia 5X extract.  Maybe if I smoke the Salvia, the illusory separation between my consciousness and the consciousness of the possum will be eliminated and 'I', the consciousness of both myself and the possum, can casually saunder the little possum body out of the storage area, out of the basement, into the wild without fear! </p><p>So this is the set and the setting.  Set: myself wanting to return the possum to the wild, get Emily out of the apartment before my allergic roommate freaks out, and return to my peaceful slumber; Setting: my basement, no sitter (as usual), 2:00am, terrified possum in the storage area. </p><p>I don't take Salvia (or any entheogen) lightly.  Salvia, in particular, is as profound an experience as birth, death, anything 'big'.  If fact, I knew that eventually I would use up the rest of the Salvia I had on hand, but I really couldn't imagine under what circumstances.  Every time it leaves me with this feeling that 'normal' consciousness needs to be worked with before I return to Salvia counsciousness.  Returning to Salvia consciousness prematurely may result in terror, but is more likely to result in a profound feeling of a teacher scolding, 'Didn't you learn anything?'  But I was willing to endure such criticisms from my spiritual plant-gods for the sake of the possum.  Like a true shaman, I intended to smoke the magicians sage to take away the animal's terror and return it to its home.</p><p>The first hit is always mellow; my ego remains unphased.  The second hit always results in my ego saying, 'Oh shit, here we go (away) again.'  Color and form become more pronounced, as with LSD.  Then, inevitably, comes the question, 'Who is it thinking that color and form are becoming more pronounced?'  Or, more generally, 'Who is it thinking?'</p><p>Entheogens, for 'me', are a means of removing 'buffers'.  (see Gurdjieff)  In ordinary consciousness, my mind=ego won't allow an answer to the question 'Who is it thinking?' which is the same as 'Who am I?'.  The mind=ego simply throws junk in front of consciousness and thus prevents it from delving into these questions.  But with entheogens, such questions may be pursued.  But _honestly_ trying to answer such questions annihilates the self and leaves the Great Self.</p><p>With Salvia the Great Self seems to be in motion.  'I' am a component much like a gear in a machine.  But as long as mind=ego exists, the gear is slipping or malfunctioning.  I ask, 'What do I do?' without realizing the notion of 'I' is the cause of the slipping and the question. </p><p>Salvia works on the physical body.  It tries to fit the physical body into the works and for a moment succeeds.  The pores relax and open because there is no body separate from the external world (hence the sweating), the mind is relinquished, and I almost experience yoga, or unity.  But then the ego reappears because I am not quite ready.  And 'normal' (=broken) consciousness reappears and the world manifests again.  And with the world, the possum.</p><p>The Salvia consciousness came and went and since 'I' wasn't around to influence the body of the possum, there the possum remained in the storage area.</p><p>With consciousness split again into the manifested world, I decided to take a more pragmatic approach to the possum situation.  Not wanting to corner the animal, I decided to remove all the boxes from the opposite side of the storage area in an effort to get behind the possum and 'scare' it out.</p><p>This worked (kind of).  The possum ran out of the storage area, but rather than exiting the basement through the wide open door, the possum sought shelter in another corner of the basement.  I grabbed a broom and finally succeeded in 'sweeping' the possum out of the corner and out the basement door to end the nights adventure. </p><p>I removed Emily from the apartment minutes before my roommate returned home.  As I lay down to return to sleep, I reflected upon the nights events and role played by Salvia.  Salvia is a glorious teacher in a sense that transcends anything our usual mind can comprehend.  But as with all teachers, you must do your homework!</p>",
 "year": "2003",
 "id": "26831",
 "gender": "Male",
 "timestamp": "2007-02-01T08:00:00.000Z",
 "views": "3132",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
