{
 "title": "The Salvia People",
 "author": "TheSeeker",
 "citation": " TheSeeker. \"The Salvia People: experience with Salvia divinorum (15x extract) (ID 26846)\". Erowid.org. Jun 17, 2008. erowid.org/exp/26846",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "145 lb",
 "report": "<p>Me and a friend sat down one night in front of some docks.  We figured a waterfront trip would be nice.  This was my second time trying salvia.  I thought the first time was intense, but I really had no idea what intense was.  According to the report of my friend I am going to relate the experience in reality and in my salvia world.</p><p>Reality - I took 3 large hits of the 15x and held them each in for about 15 seconds.  After this I had no connection with reality or myself and I had no physical control of myself as well (danger).  I had no recollection of my self as if I had never existed.  I did not know what my body was doing but it was acting out the actions I was performing in my other reality world.  According to my friend I started laughing hysterically and then stood up(I was not controlling my self).  Then I went running down the street and into some bushes (I have no recollection of this).  I was screaming about the Salvia people trying to pull me into thier world and I also screamed his name.  When he came to my 'rescue' I grabbed onto his shirt and started shaking him.</p><p>Salvia Reality - The first thing that I became conscious of after entering my altered state was the fact that I was in a purple funhouse with different color stripes on the wall.  I had no recollection of who I was or that I had smoked salvia.  There were normal looking people walking around inside and they were trying to drag me away by my feet and arms.  I was filled with terror.  I fought hysterically for my life trying to get away.  I saw an opening in the roof of the house and outside was reality.  That was when I remembered that I had smoked salvia.  I jumped up and tried to fit through this hole to try and get back into reality but the people were pulling me back into the funhouse.  Then I thought the world was ending.  I made it back to reality but it felt like I was in a one-dimensional curtain that looked like the docks we were at.  This curtain was being pulled through a black void along with several other curtains.  It felt like the real world was being 'unzipped' into curtains.  At this point I forgot about being under the influence of salvia and I really thought that the world was ending.  I remember thinking to myself, 'there is nothing I can do I might as well just go along with it'.</p><p>Even as I came back to reality, I could still see and hear the salvia people pulling at my legs trying to pull me back in.  But I knew the effects were wearing off and I was going to be ok.  The effects quickly subsided leaving an after glow similiar to the beginings of a long psychedelic trip.</p>",
 "year": "2003",
 "id": "26846",
 "timestamp": "2008-06-17T07:00:00.000Z",
 "views": "4831",
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
