{
 "title": "First 3 Trials . . .",
 "author": "Agent Shags",
 "citation": " Agent Shags. \"First 3 Trials . . .: experience with MIPT (ID 26844)\". Erowid.org. Jun 7, 2004. erowid.org/exp/26844",
 "substance": "MIPT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "MIPT",
   "(powder / crystals)",
   " T+ 4:00",
   "10 mg",
   "insufflated",
   "MIPT",
   "(powder / crystals)",
   " T+ 4:04",
   "10 mg",
   "insufflated",
   "MIPT",
   "(powder / crystals)",
   "",
   " ",
   "",
   "Cannabis",
   "",
   "",
   " ",
   "",
   "Pharms - Bupropion",
   ""
  ]
 ],
 "report": "<p>After I recieved my fed ex package containing my gram of methyl isopropyl tryptamine, I set the first dose at 20mg with a very mild response. Perhaps a Shulgin rating of  + 1/2 (1 and a 1/2). I believe 20mg orally was a little too low for me, but I should have probally fasted from drugs for a few days. (night before I got little sleep due to street meth binge.)  I actually redosed (straight to the head) 20 milligrams (10mg, wait 3-4 minutes 10mg) about ~3-5 hours after my origanal oral dose of 20mg. After I did the second 10mg line I felt effects fairly quickly, and was suprised at how mild it still was. I would say a ++. NOT as mild as 20 orally, I believe I have seen the activity of this compound SOMEWHAT, so now I know what to look for in future experiments. I belive that the dosage (for ME) could maybe go as high as, MAYBE, ~50mg orally? I belive next time orally I would take ~30-35-40mgs and I would like to explore the insufflation route.</p><p>This intrests me to as to what some prominant effects are at larger dosages and routes of administration. I would really like to know more about MIPT, and the internet dosent seem to have much info. Google search produces erowid and supliers. I really do start to belive that I am a researcher in the fact that im learning first hand because of a lack of information on this chemical (amongst various others).  I belive for maximum benifit from MiPT, having a cleaner system (body) helps, as do letting MY NATURAL DRUGS stableize back to harmony,(via not doing drugs for a few days)</p><p>---</p><p>With the second attempt I pick a good night, after work, have ganja, tomorrow is day off. . .</p><p>about 10:00 pm I turn on my scale (autocalibrate min = 1hr)</p><p>11:00pm I am weighing out methyl isopropyl, ~26mg in capsule was consumed</p><p>11:?? turned on Final Fantasy X (o m f g, tripping and this game. . .)</p><p>11:xx til 12:00pm- Ganja hitters get hit the fuck up</p><p>12:00 - um yea? Mild?</p><p>12:30 - underestimated? yet still mellow?</p><p>12:45 - the recognizeable typtamine 'ENERGY' becomes apperant</p><p>++</p><p>(time become irrelivent)</p><p>??:?? - drank caffine (cup of code red)</p><p>??:?? - synergy? a little ganja as well, eh -- jacked the fuck up on some kinda synergetic combo? yes. INTENSE in a mild sort of way. . .</p><p>++ and a 1/2</p><p>very curious. . .</p><p>effects still have me awake till the next day. . .</p><p>5:00 pm- got the bright idea to take 200mg of DXM (on top of the fact I had no sleep and have been taking welbutrin  SR for the last week to help me quit smoking my death)</p><p>7:00 pm the next day, walla here I am, Mipt'ed out and on inhibited DXM (via Wellbutrin SR)</p><p>P.s. the healthy 'fast from drugs for like 2 days[ganja excluded]' really helped the MILDness become more of a T R I P (or was it the wellbutrin?)</p><p>during parts of my experience I experienced a 'force' from the MIPT</p><p>---</p><p>With the last trip, I determined I felt safe pushing my dose higher.</p><p>Higher turned out to be 31mg. I had been waiting all day since I got to work to get off knowing my plans after work. My old friends Cleatus and Rose Bud (lmfao, ahh, saftey measures!) Were coming over to try some of my stock of 5-meo-dipt. My friend American Psycho was dosing Syrian Rue and 5-meo-dipt a la Foxahausca. And I was taking the highest personal mipt dose yet, 31mg.  After I got out of work at about  10:30pm I eat some mipt flavored candy. Tasty, lol. We give my co-worker a ride home, and I run in to buy a bag (I found ganga to be quite excelent to have on hand during the previous two runs). We procede to go to my house. At this time it is about 11:10, and im feeling the randiness coming on allready. It progressed on and on. A clarity in my mind was there, but I was not baseline. Energy present. The same general feeling yet stronger than before. A ++ 1/2 or +++? We all watch Requiem For A Dream, Then pop in A Better Place til it fucks up.</p><p>By this time its about 3am. Still going. Rose Bud falls asleep, while American Psycho, Cleatus and I pop in my free copy of none other than Bill And Teds Bogus Journey. Cleatus tells me he has no visuals really at all and only a mild body buzz from his 22mg's of Fox and Psycho is telling me that he seriously thinks he could have died when he was vomiting up his 5G rue and 25mg Fox, I told him smokeganja@420 dosed 5G and 30mg and puked, said it was insane, yet liked it, and mentioned no death like  feelings hapining.</p><p>4:20am still smokin ganga, still gettin moderately strong effects.</p><p>Might I add that I had not been asleap the night before either because of a GIFT that American Psycho had brought to share, a FAT 20 of meth.</p><p>No sleep then, a full day of work and DEAD TIRED before dosing. I figured I could tell when the drug wore off cause then I could Sleep.</p><p>5:00 Effects STILL present</p><p>6:00 Rose Bud wakes up and her and Cleatus kick it back to there respective homes.</p><p>7:00am Psycho and I still up. Still smokin ganja. Still unable to sleep. Ganja may be prolonging the effects, they are hard to pinpoint, but most definantly real. We take a walk, as the sun is low, to the end of my lane (in the country) and psycho and I engage in our regular slapstick, nonsenseical, surealist humor on the road leading to a town(?) Of 75. I smoke hitters in the middle of the road. Psycho wants to head back to house. He is geting WHAT, TIRED? !!!  Well on the way we stop and procede to have a LENGTHY conversation with the local livestock, just hapening to be cattle. (we are very easily amused, you see. . .) I belive by this time its 8:30. American Psycho lays down. I play with myself and procede to read tihkal. Some time about 9:00 am I fall asleap.</p><p>Over all this compound intrests me. I will take a dose of either 40mg plain, or 20mg with 5G rue (methylisopropylhausca?), Or perhaps a mixture of 5-meo-dipt and mipt (before  the last of my fox is gone, sob) perhaps a 20/20? I dunno, theres no reports of this mixture, so I dunno. I would like to push it. Tihkal stops at 25. Also marijuana is a constant factor that I enjoy with this compound. The caffine in the second report did seem to help bring out some activity, or was it other factors (wellbutrin SR 150 EARLIER). Lack of sleep was a factor in trial 1 and 3. As I progressed the dosage, the duration SEEMED to be extended (dont quote me on it), but 31mg kept me up ALL NIGHT after no sleep the night before and little (2-4 hours) the night before that one.</p><p>Overall, I was very content on mipt. I did a little inner exploration but, I was not really flooded with personal realazations or enlightenments of my psyche. I enjoy this chemical, though I perfer a stronger journey. This chemical could prove useful in helping create a seting of open mindedness and centeredness for a self exploration cell or the like (a human interaction cell?) Because it opens you up yet does not disturb your view of reality to a world shatering extreme, so you can do nothing except tremble in the wake of a intense experience. It is more gentle (at least to me) : human interaction is still a posibillity ; a very social drug?</p>",
 "year": "2003",
 "id": "26844",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-06-07T07:00:00.000Z",
 "views": "12651",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "MIPT",
   "form": "(powder / crystals)"
  }
 ]
}
