{
 "id": 2688,
 "title": "Low Dose Went Ballistic",
 "date": {
  "submission": "2002-11-12T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blazed",
  "gender": "Male",
  "weight": 76
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "2:00",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "5:30",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "11/9 10:10pm",
  "Fuck it. I want to be out. I took the pill with no remorse and with no regret.",
  "Ive heard a few stories about this drug. It works like an opiate, but doesnt bind to receptor sites as opiates do. Seems interesting enough for me to consider.",
  ":20min A general feeling of slowness sets in.",
  ":40min My body is becoming heavier, more difficult to control as time progresses; however, I dont seem to be sensing (picking up on) anything else due to the fact that Im watching the new Marilyn Manson DVD Guns, God and Government World Tour.",
  "Although, Im able to pick out what is going on in my head. The effects are mild and similar to those of Vicodin.",
  ":50min The key thing to note here is that this is a low dose for me. I decided to go with a 50mg dose because Ive read about how higher doses the first time cause vomiting.",
  "1:10 Im beginning to think that a way of making this better is to smoke weed. (I wont take another pill. Im saving the 3 I have left for a 150mg dose later.)",
  "1:20 The head effects have blended into my normal feeling. Meaning? I became tired and exhausted, instead of high, which leads me to believe that tramadol is a really weak drug.",
  "1:40 I will say that tramadol is better than hydrocodone, so far.",
  "1:45 Final thoughts: weak. The nicotine in cigarettes has stronger effects than this.",
  "2:00 Time to blaze some trees.",
  "2:20 More electrical. My teeth are numb. Im able to write fairly well, unaffectedly so. Unfortunately, my vision is in horrible disrepair. My nose got cold, and that also reminded me of a time I took hydrocodone pills in the past.",
  "Im also severely retarded. My head is numb. I think the tramadol has taken a seriously stronger effect. Its great though. Im completely out of it.",
  "2:25 My fingers are numb, and I cant feel most of my body. My back is numb... it was interesting to crack my back, because I couldnt feel anything. The crack itself produced from the twist felt amazing.",
  "Im kind of afraid of dying at this point. Im having too much fun since Im so fucking gone.",
  "2:50 For me, the trees made the trip. The cannabis chemicals cremated my core.",
  "3:10 This drug has made me relaxed and very calm. Im also under the effects of a speedy-type euphoria.",
  "3:30 The attention-grabbing thing about this drug combo is that I got to the point at which I cant feel certain body parts, yet there are no tranquilizing effects present. I can get up and walk around just fine, but Im gone inside my head as well.",
  "Ill mention this one more time... this combo is highly euphoric. (Ive smoked this weed before, and its euphoric by itself to begin with.)",
  "3:45 Id say this drug has potential for high abuse rates. Its too good to be non-addictive, and its too body numbing to be resisted. The blast of euphoria itself makes it hard for me to say that Ill never do this drug again.",
  "Id take tramadol over hydrocodone any day. Hydrocodone cant separate my mind from my body after smoking weed as well as tramadol can.",
  "3:50 The good thing about tramadol is that it also lasts for a longer period of time than other painkillers.",
  "Although, the green has saved me from being dead to the world, as painkillers normally make me.",
  "3:40am I cant tell time anymore (I don't know how many hours it has been since the time I took the pill), but Ill smoke again (before I go to sleep).",
  ":20min Mentally, I feel like Im on shrooms. Its a powerful hold over mental functions, and its a trippy way of thinking...",
  ":40min Now Im starting to go numb. I cant really feel my fingers or legs. Everything seems to be moving with ease though.",
  "Peace out/",
  "The following day I spent like a zombie. Imagine not getting a full nights sleep and wishing you could stay in bed. (The sheets are very pleasurable to lie in.) The entire day feels like that.",
  "One more important thing that needs to be considered is that in the following days Ive become more willing to look and say crazy things since this experience. Im the kind of person that can sense the slightest change in behavior, and Ive noticed that Ive tended to be more obnoxious.",
  "Could this possibly be as a result of my mind not being able to release itself?"
 ],
 "erowid": {
  "id": "18837",
  "citation": " Blazed. \"Low Dose Went Ballistic: experience with Tramadol (Ultram) & Cannabis (ID 18837)\". Erowid.org. Nov 12, 2002. erowid.org/exp/18837",
  "substance": "Tramadol (Ultram) & Cannabis",
  "views": "55522"
 }
}
