{
 "title": "Sex, Erections and MDMA (ecstasy)",
 "author": "Odin",
 "citation": " Odin. \"Sex, Erections and MDMA (ecstasy): experience with MDMA (ID 26880)\". Erowid.org. Sep 16, 2003. erowid.org/exp/26880",
 "substance": "MDMA",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  " tablets",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>I have been glued to my chair reading through the articles that other's have submitted about their drug experiences, more specifically their sexual experiences while rolling.</p><p>I guess I was just curious to find out (from a collection of people who, to my knowledge are familiar with drugs) if my experiences were unique / why they were occuring...</p><p>Let me give you some background on myself first...</p><p>I started doing MDMA when I was in my sophomore year of highschool. I never used more then once every two weeks and seldom more then one pill at a time. I have never had a bad trip, provided the pills were mostly MDMA (I heaved uncontrollably when I took a yellow RN which I later discovered to be mostly composed of DXM). I am a year round athlete and a good student. I believe I have no real problems with lack of morals and/or mentalstate. The only, possibly deviant part of my character is the fact that I was brought up in a household where rules were always made clear...therefore when issues (such as sex) were ignored, I felt free to explore them. I went through early puberty (Stopped growing in 6th grade/fully developed bass voice/pubic hair, the works) and I warrant this to be part of the reason I started having sex at 13. I guess I'm wondering if this early experience plays a part in what I'm about to describe...</p><p>My Experiences (emotional):</p><p>First and foremost, unlike most of the articles I've been reading I have never (in the 100+ times I've done X) had a problem with erectile function... in fact I've experienced an almost opposite reaction. After about 2 hours into my trip (while still rising but not quite peaking) I have enormous sexual urges, this lasts my entire time on X. Almost to the point where I feel hungry for sex. This in and of itself would not be horrible, because I realize that I leave most of my inhibition behind once I swallow that pill. However, if I do not within the 8 hour period (approximately) of my high, have sex, then I feel depressed and quite upset at the world. I in fact feel unsatisfied with myself and my MDMA experience. I can't really figure out... I was wondering if anyone else feels this almost, 'Conquest' to find someone both willing and attractive to have sex with...</p><p>The Physical Part: Yes, just like everyone else my penis shrinks to 1/3 of it's flacid size while I'm rolling... but as I said earlier in this post... erection is not only possible, but common for me throughout my experience. This is sometimes quite troubling because I am arroused so easily through massages and almost any physical contact (when I roll I usually wear windbreaker material because I feel like it heightens my sense of touch) and walking around erect in windbreakers can be nervewracking. This usually means I end up flooring it and sitting down.</p><p>The times that I do have sex, like many others, I experience a heightened sense of pleasure as well as a far longer sexual stamina. However, during sex while on MDMA I find that my erection is harder and that my penis is longer while erect then normally. I thought at first there might be a rise in testosterone (as I also find that if I roll, my hair grows faster... which very well be completely unique to me) or I might just be imagining it. So with that I measured myself 10 times while erect in mildly/very/extremely turned on situations and took an average. (hey what other way is there to tell?). Then the following 5 times I rolled and had an erection, I measured and averaged. I found that (just in length) my erection was just about 1 1/4 inches longer. I cannot figure out if it's the X or if it's my mental state... or if these trials, although I attempted to be scientific, are just plain flawed. I'd also like to point out, that I my sober erections were all within 1/2 inch of each other and that I've never had a sober erection in my knowledge that came even close to my experiences while on MDMA.</p><p>If anyone has had similar experiences, please let me know...and if anyone has any insight into why I have this kind of experience please let me know.</p>",
 "year": "96",
 "id": "26880",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-09-16T07:00:00.000Z",
 "views": "53978",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
