{
 "id": 269,
 "title": "Analyzing the World",
 "date": {
  "submission": "2007-01-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "1st Timer",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": " T+ 5:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 6:00",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": " T+ 8:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>I had been curious about taking mushrooms for some time now.  So, I decided to put in an order when I discovered a friend could get some good psilocybe cubensis for a rather good price.  I heavily researched the 'Flesh of the Gods' for about 2 weeks before my experience.",
  "Friday was the day I had decided to do it, and a few of my friends decided they wanted in also.  We were all first-timers, except for one friend who had tripped twice before.  We had approximately half an ounce of mushrooms, but I didn't plan on taking my entire share (which would have been over 5 grams).  We ate a light meal around 5:30, and by 6pm we decided it was time to start tripping.  I had read the taste was bad, and that sure was the truth.  The closest thing I can think of what they taste like would be peanut shells.",
  "Now it was time to play the waiting game.  I had ingested around 2.5 grams, and was mentally prepared to trip.  I know a lot of people who have had bad trips on mushrooms, so I was a little nervous at first.  I knew I had been preparing my mind all week, but was I ready?  Was I strong enough?  I started to feel a little funny about 20 minutes into it.  At about 45 minutes a friend and I walked up to the local mini-mart to buy some things.  We both had an indescribable feeling throughout our body.  It was as if we were perfectly normal, except I could see my body behaving differently. ",
  "As soon as I entered the mini-mart it hit me.  I stood still for a minute, and was completely overwhelmed.  This feeling is also hard to explain, but for some reason I felt I should not be in that place with all the bright lights and colorful packaging. It subsided for a minute, and I looked at my friend.  He also felt it.  We did our business and left quickly.",
  "It was good to be back out in the fresh air, and we quickly made our way back to the residence halls.  I sat back down in my friends room, but I was very uncomfortable.  I had an excellent body high, but I felt like I needed something.  I needed to move.  We all got up and decided to go for a walk, everyone was feeling it now.  As we left, I saw my RA (Residence Advisor) walking towards us.  This is my only regret of the evening.  I thought my friends decided to exit the building through the basement, so I basically took of running and bolted down the stairs.  After I realized my friends weren't behind me, I walked around the front of the building, giggling uncontrollably to myself, to find my RA and another RA sitting on a bench outside.  One friend came out, trying to figure out what I was doing, but I was at a loss.  I was laughing pretty hard now, and I needed to get back inside before I really lost it.",
  "Somehow I managed to calm down and we went back inside in search of the rest of our party.  We found them sitting in a room talking to someone, and I finally felt like I had a handle on things.  All of a sudden, two people entered the room: a guy and a girl.  This was too much for me, and as I looked around the room at my shrooming friends I could tell they were beginning to lose it also.  We bailed and went outside to find two friends who knew something was up.  We told them we were doing shrooms, and to our surprise they wanted to try it.",
  "I would never try a drug without researching it, or having some sort of understanding as to what I am about to jump into, but that is a personal opinion and I cannot hold it to others.  So, we fed them a fair amount of shrooms.  At this point in time, a dosage weight guess would probably be far off from actuality.",
  "Here is where my story begins to get a little fuzzy, and I will try to keep it short from this point on.  For the most part, I had lost complete concept of time.  We all went to another residence hall, where we sat around analyzing things.  I noticed that when I waved my hand in front of my face, I was seeing tracers and had some 2-dimensional closed-eye visuals.  A dealer came in and sold us an 1/8 of marijuana, which I could have cared less at that point, but later I was glad I smoked it.",
  "We proceeded to walk to our usual smoking spot down by the river.  The mushrooms had taken hold now.  I was able to control my actions again.  It is almost as if the mushrooms talked to me however strange that sounds.  They 'told' me what they are about, and how I can harness their power.  I was analyzing everything.  Thinking past the surface of this plastic world, into a deep abyss a neurologically balanced man wouldn't dare enter.",
  "I too participated in smoking a bowl, which I thought only heightened my state of awareness.  My body was slow and methodical in its movements, but my mind was sharp, breaking down any thought that dared cross it.  It was now around midnight and time to explore the party scene.  I consumed an additional gram of Psilocybe cubensis powder, and would soon start to feel it.  We went to a house party, but it was almost too much for me.  I could not relate to these people, they were intoxicated.  They were sloppy and I was sharp.  What were they doing to themselves?  Stumbling around babbling to each other.  Then the fight broke.",
  "As I entered the dance floor, there was a man standing there screaming and screaming.  No words, just screaming.  What is wrong with this man?  What kind of freak show is this?  There were others, and they were looking for a fight.  The theme of this party was 'thugged out.'  It seemed like a bad idea to me - it was a mockery of people who have no respect for their lives or anyone else for that matter.  I won't go into the details of the fight, but it lasted a long time.  Finally they left, and it was just college students again.  Pretty much everyone had ran off, so barely anyone was left around.  What a freak show I remember thinking to myself.",
  "We left the party with a few guys who had a house a few blocks away.  On our way their, some drunk girls walked by, and I remember yelling something at them like 'stop it and look at yourselves.'  I couldn't even begin to understand what they had done to themselves, although I have been drunk many times before.",
  "We got to the house and sat down.  This is where everything goes fuzzy, and I'm not sure how it got to be after 2am so fast, but it did.  We had smoked another bowl in the house, and I was feeling very content.  It was just what I needed.  We decided to leave, and stopped by the same mini-mart I had visited earlier.  This time, there was a cop sitting there in his car watching some woman smoking cigarettes inside the gas pump area, and her car was half-parked across two spots.  There was also a Mercedes convertible parked out front, with some guy passed out in the passengers seat.",
  "In the store, out of nowhere it seems, the owner of the Mercedes tries to start a fight with this drunken homeless guy.  He said something like 'do you want to fight a marine.'  'I'm going to kick your ass.'  What a fool I thought, this guy was trashed out of his mind, and he's trying to start a fight in front of a cop.  I wish he had tried it, because this guy seemed like a real low-class freak.  The type that spends his entire military salary leasing some entry-level foreign sports convertible to try and pick up chicks.",
  "We left that strange place.  Why had this night been so violent?  I was in no condition to fight anyone, especially these derranged drunk locals.  We finally made our way back to the residence hall and I watched part of Fear and Loathing in Las Vegas before I was finally able to fall asleep at 4am.  It had been an interesting trip, to say the least.</p>"
 ],
 "erowid": {
  "id": "10363",
  "citation": " 1st Timer. \"Analyzing the World: experience with Mushrooms (P. cubensis) & Cannabis (ID 10363)\". Erowid.org. Jan 6, 2007. erowid.org/exp/10363",
  "substance": "Mushrooms (P. cubensis) & Cannabis",
  "views": "2444"
 }
}
