{
 "title": "Mind-Blowingly Intense Out of Body Experience",
 "author": "Ched",
 "citation": " Ched. \"Mind-Blowingly Intense Out of Body Experience: experience with LSD (ID 2690)\". Erowid.org. Feb 3, 2001. erowid.org/exp/2690",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "report": "<p>My trip started out as usual. I had decided to just take a little liquid (6 drops; it was decent, but not great acid) by myself and just mellow out to Pink Floyd and contemplate cosmic questions and life in general. I decided to go for a walk around my block because it had begun to rain and i thought that would be interesting. It was around midnight and i'd dropped at around 10:30pm, so i was tripping pretty good. After completing my lap, i went back into a field on a hill behind my house and spun around in the rain and stared at the storm clouds and lightning bolts dancing across the sky. As i stood on the hill, i tensed up all the muscles in my body, held my breath and made my face turn red (like you would when you're taking a really intense shit, for lack of a better example).</p><p>I began to feel really dizzy, so i relaxed and took in a deep breath. This triggered the most intense experience of my life. Involuntarily, i collapsed to the ground. As i hit the ground, i heard an extremely loud *whoooooosh*, and then my right leg began twitching uncontrollably. It was almost as if i was watching myself from outside my body. I became somewhat scared for the person i saw on the ground shaking. I forgot who i was, where i was, what had just happened before i fell. It was like complete temporary amnesia.</p><p>My leg only spasmed for about 5 seconds, but as i regained control of my body, i was still completely and utterly confused about my surroundings. Not only did i not know where i was, i couldn't even recognize what my surroundings were. The hill, the grass, the trees, the lights coming from surrounding houses, the road, the sky - it was like i was a newborn baby looking at the world for the first time. The only possible way for me to further describe the alien setting i was in, was that there were what appeared to be 'tiki gods' large and small everywhere, mumbling incoherently. The only thing i can remember thinking during this was, 'i've never experienced anything like this before, i have no control over my body at all.' What i saw was the most intense hallucination i've ever experienced, and i've eaten an abnormally large amount of acid over the years, and more potent lsd, too. The effects, after i fell to the ground, only lasted about 20 seconds. As soon as i was able to pick myself off the ground, i got up and maneuvered through the maze of trees, which i still didn't fully recognize, and almost zombified, i stumbled home. I went inside and began to attempt to sort out what just happened and what had caused it. I didn't remember tensing my muscles and holding my breath for about 20 seconds.</p><p>After i figured out what instigated the experience, i walked back up to the field to re-attempt it.  I did it again, and fell to my knees and began shaking involuntarily again. This time while i was watching my body from outside, i thought that i was a cat. I could hear an unbelievable amount of previously non-existent sounds and see the sounds being broadcast to my ears through waves. The effects again wore off in about 20 seconds, however i did once again forget my surroundings, what had just happened, and why i was on the ground.</p><p>I told some of my friends and we agreed to try it again under the supervision of each other. I understand that what caused it was a lack of oxygen to the brain, but i still don't know if others have had the same kind of experience, if it can be dangerous, or why i reacted the way i did.</p>",
 "year": "2000",
 "id": "2690",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-02-03T08:00:00.000Z",
 "views": "26063",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ]
}
