{
 "title": "The Most Intense Pain Reliever I Ever Took",
 "author": "Eric B.",
 "citation": " Eric B.. \"The Most Intense Pain Reliever I Ever Took: experience with Codeine & Hydromorphone (ID 2691)\". Erowid.org. Sep 9, 2000. erowid.org/exp/2691",
 "substance": "Codeine & Hydromorphone",
 "bodyweight": "170 lb",
 "header": [],
 "report": "</p>\nI had first gotten into opiates when my girlfriend at the time found some of her grandmother's tylenol 3's, and shared the wealth.  After that I was clued into the ability of buying dried poppies legally in a flower shop.  The poppies when ground and left in boiling water for a half an hour yielded an all-natural supplement; one that ginseng will never compare with. Doing so made tea that may not have been very pleasant to the taste buds, but was certainly a delight for the opiate sensors in your body.  As my fascination with opiates increased, I was keyed into someone who get's a constant supply of codeine. He sells each pill for 2 dollars. (Tylenol 4 with 60mg of codeine)  Also this blessed gentleman sells yellow pills which start with the letter D,(I forget the name) and contain 4mg of morphine [Erowid Note: Mophine dosages are generally much higher than 4 mg per pill.  We're guessing this is actually Dilaudid which is a yellow pill and contains 4 mg hydromorphone]. </p><p>So my most intense opiatic experience was when I attempted to inject 4 yellow pills (16mg of hydromorphone) intra-veineously.  The mixture filled up the 10cc's in the syringe with a liquid more yellow and potent than urine.  By the time I had reached the mark of 4cc's in the syringe, the opiate feeling was so intense that the only way I can truly describe it is like this:  You know the actual sensation that the opiate exudes when it's in your body, as intense as it is you are still able to distinguish your sobriety from that marvelous feeling.  In otherwords, there is still some part of your body that is not in a state of 'euphoria.'  In this case with the hydromorphone, that whole feeling was intense to the point where I could barely see straight + the feeling had overcome my whole body---I could not feel my limbs and such, only that feeling amplified logarhythmically, with not even a little bit of sobriety.</p><p>It was so intense that I didn't push all 10cc's right away.  After that experience, heroin does not stand close.  Furthermore, I would strongly suggest to anyone who is an opiate lover to stick with medicine.  The stuff on the street is unclean, less potent, and unhealthy.</p>",
 "year": "2000",
 "id": "2691",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-09T07:00:00.000Z",
 "views": "36654"
}
