{
 "title": "Methamphetamine Dosage Comments",
 "author": "Miz Kidd",
 "citation": " Miz Kidd. \"Methamphetamine Dosage Comments: experience with Methamphetamine (ID 26917)\". Erowid.org. Sep 17, 2003. erowid.org/exp/26917",
 "substance": "Methamphetamine",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "100 mg",
  "IV",
  "Methamphetamine"
 ],
 "report": "<p>The only thing I can comment on (my partner and I, actually) is the injectable dosage (IV).  I've never done meth orally, and I've never done what passes for meth these days.</p><p>Both of us started on 50 mg when we first indulged.  Later, initial dosage was around 100 mg.  The rush was instantaneous.  The 'hit' tended to last around 4 hours before the crash began.  We both would 'run' for as many as 48 hours at a time; more than that, and you get dingy (usually after 24 hrs. that would start, but by that time you'd injected around 6 times and no longer had the impetus to stop).</p><p>However, my record 'run' was just shy of 5 days.  As I say, we did do tabbed methamphetamine.  However, the usual form of the drug for us was liquid methamphetamine hydrochloride, which tends to be a much 'cleaner' buzz than tablets and lasted as much as an hour longer per dose because none was lost in the 'melt/filter/inject' process.</p><p>I must add the caveat that this is an incredibly dangerous drug to use, not because of overdosing (or overamping, as we called it) but because of it's psychologically addictive qualities.  It's really hard to stop using it; required that we both removed ourselves from those who were doing it.  I went to California (it was the only way I could stop myself), my partner moved and gave no address to anyone.  It took me a year and a visit to the 'junkie ward' at the SF General ER while tripping to finally kick it completely.  And it left me with asystolic arhythmia and early-onset osteoarthritis from the malnutrition that comes of forgetting to eat for days at a time.</p>",
 "year": "1980",
 "id": "26917",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-09-17T07:00:00.000Z",
 "views": "23952",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "IV",
   "substance": "Methamphetamine"
  }
 }
}
