{
 "title": "Have Always Enjoyed Its Effects",
 "author": "Burns",
 "citation": " Burns. \"Have Always Enjoyed Its Effects: experience with Ether (ID 26939)\". Erowid.org. Nov 6, 2003. erowid.org/exp/26939",
 "substance": "Ether",
 "bodyweight": "150 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Ether"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>Ive been doing ether on and off for the better part of this year and I have always enjoyed its effects. At small doses I found it produces a simple quickening effect and some loss of motor control. I think thats what everyone who posted had experienced. But thats only half of this wonderful drug! While on ether, if I do enough, there are many effects that havent been mentioned once. First let me say that ive never bought ether mixed with any other chemicals. I get it pure off a medical website! Anyways in all my ether experiences me and a couple friends would finish about a litre bottle of ether in one sesion. This could account for the fact that my experiences were so more intense, but I'm not sure.</p><p>On ether I experience what I believe are 'waking' dreams, plus all the effrets of low doses such as loss of motor skills and a feeling of everything increasing in speed. When talking with people, I begin to hear what they are imagining, and not what their saying. At the moment it makes perfect sense, but as time goes on I forget what was said or just not understand their words anymore. There is also an anoying buzing sound that is constantly there, but seems to calm me. That pretty much covers the audotory hallucinations, but the visual hallucinations are major part of every good ether binge. These effects include random objects appearing out of nowhere. These objects usually have to do with whatever I'm thinking. Colorful walls appear out of nowhere and stretch to the sky, objects seem to randomly come out of shaded areas and of course small to large  boxes float around peoples heads just to dissapear when the person says something.</p><p>Anyways none of my experiences seem to make any sense now. So I'm doing the best i can to describe the major effects I experienced during each trip. But the point is theres so much more to the wonderful drug ether. I bet i havnt even experienced its full potential, although i have had one out of body experince while on the stuff. Ether is so under-rated. I like taking large amounts to experience its true effects. And sorry if this post makes no sense at all, ether burns out my brain and im really burnt out from some of the best ecstasy ive ever experienced in 3 pills. Good luck with ether and happy trippin!</p>",
 "year": "2003",
 "id": "26939",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-06T08:00:00.000Z",
 "views": "25490"
}
