{
 "title": "NOT the Food of the Gods",
 "author": "SomaticaL",
 "citation": " SomaticaL. \"NOT the Food of the Gods: experience with Carisoprodol (Soma) (ID 27000)\". Erowid.org. Dec 17, 2004. erowid.org/exp/27000",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "190 lb",
 "report": [
  "<p>I'm 25 yr old male, my drug experience is: Alcohol, Marijuana, Salvia, and as for pills, only Vicodin.",
  "Well a few months ago I got a prescription for Soma, when I had pain in my arm, and was instructed to take 1 pill before bedtime, to relax the muscles and sleep easier...1 pill had no effect on me and I just stopped taking it and forgot about it. I had a bottle with 20 Soma's left over.  A while back, I read a few reports of people using Soma to get high, so it sparked up my interest in Soma, and I read all the reports, some of which told of people overdosing, and ending up in the hospital, which made me very cautious when experimenting with Soma.  I started off with 2 pills one night...which had no effect on me either...and then worked up to 3 pills another night...which gave me a very slight feeling of relaxation...but no real high. I found out my threshold is 4 pills...and here is what I felt last night:",
  "1 am :  I took 3 pills on an empty stomach with some fruit juice",
  "1:15 am: feeling nothing...",
  "1:30 am: start to get the feeling of well being...so I decide to take another pill, to boost it ...now on 4 pills",
  "2:00 am: feeling very relaxed...mellow,  no real 'high' though",
  "2:30 am: I start to feel the real Soma 'high' ..which to me is most noticable when I would stand up, or move my head to look around...I would feel kinda like the same as when I'm drunk and I move my head to look around...feels kinda like everything's moving fluidly...and I feel a lil dizzy. When I would stand up to move around...my legs and feet felt heavy...and when I walked, I felt like I could easily stumble and fall..I had to try and focus to control my walking.",
  "3:00 am: I felt the Soma very well in my system...it had me very calm and relaxed, a slightly warm feeling and I was just lounging and listening to music.",
  "3:30-4:00 am : I was now VERY lethargic...I felt VERY tired...my eyes felt heavy like I needed to close them. I moved from my chair, to the recliner, and laid back, still awake. Somewhere close to 4 am, I fell asleep...I had wanted to stay awake for the experience, and don't even remember closing my eyes and falling asleep, but it just happened that fast. I woke up about 2 hours later...and felt extremely sleepy so I went straight to bed.",
  "Overall I would say Soma is NOT a great high...because of its side effects mainly: sleepiness and tiredness. It does cause a feeling of well being, and a somewhat 'drunk' feeling, which is most noticeable when walking or moving around, and of course the 'drunk' feeling is more evident when Soma is taken in higher doses...but mostly I just end up getting VERY tired with the need to fall asleep...which to me, is not my idea of a great high. I'd recommend Soma to people with insomnia, and I'll use my remaining pills for when I need some help falling asleep. Be very careful when using Soma, work your way up with the dosage, and don't take it all at once, its best to see what effect it has on you, then adjust the dose accordingly. Stay safe...  ;)</p>"
 ],
 "year": "2003",
 "id": "27000",
 "gender": "Male",
 "views": "68583",
 "dose": [
  {
   "time": "0",
   "amount": "1050 mg",
   "administration": "oral",
   "substance": "Pharms - Carisoprodol",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:30",
   "amount": "350 mg",
   "administration": "oral",
   "substance": "Pharms - Carisoprodol",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2004-12-17T08:00:00.000Z"
}
