{
 "title": "Falling Out of Reality",
 "author": "Blake",
 "citation": " Blake. \"Falling Out of Reality: experience with Nitrous Oxide & Cannabis (ID 2702)\". Erowid.org. Nov 28, 2001. erowid.org/exp/2702",
 "substance": "Nitrous Oxide & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>Yesterday afternoon, me and 2 of my friends made a trip to the local head shop.  While their, my Friend, E, purchased a new 5' tall bong, and 2 boxes of whippits.</p><p>I had tried them several times before, but never in combination with another drug. We drove to the house of one of my friends who had some very high grade pot.  Since he lived out in the country, we thought it would be pleasant to smoke outside.  We all sat in a circle in his backyard in lawnchairs, and packed the bong.  I took a huge rip of it and it sent me coughing my ass off.  A few minutes later I realized I was *very* stoned off one rip.</p><p>I took another, and then we decided it was time for the whippits.  When my turn came around, I loaded 2 chargers into the baloon, and inhaled.  5 seconds I could feel myself beginning to 'leave' reality.</p><p>I closed my eyes and was enveloped in a sea of blue and red dots that looked the static on a tv screen flashing across a void of blackness.  Somehow, across the void I could my friends faintly in the background saying 'huh huh, he's fucked up'.  The birds were chirping outside, but all I could hear was a very rapid, loud, distorted wheep wheep wheep noise.  I tried to surface out of this blur but was couldnt.. All I could think was 'Oh shit this is really happening, im really in another dimension'  The sun was shining on my skin, and it caused waves of heat to roll through my body, which were both painful and pleasurable.</p><p>Finally, as the red and blue dots began to subside I began to come 'back into' reality.  At this point I decided I didn't want to go back, and found that if I concentrated hard enough I could go back into 'the void'.. eventually this stopped working, and I was back sitting with my friends.  The whole experience probably lasted less than 3 minutes, but seemed to last an eternity.</p>",
 "year": "2000",
 "id": "2702",
 "gender": "Male",
 "timestamp": "2001-11-28T08:00:00.000Z",
 "views": "8341",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": " T+ 0:10",
   "amount": "2 hits",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 }
}
