{
 "title": "A Quiet Smoker",
 "author": "Me",
 "citation": " Me. \"A Quiet Smoker: experience with Cannabis (ID 2707)\". Erowid.org. Mar 5, 2001. erowid.org/exp/2707",
 "substance": "Cannabis",
 "bodyweight": "115 lb",
 "report": "<p>I was visiting the hippy town of Woodstock for the weekend with some older friends (most of my friends are over 30 and I am in high school). I suspected that pot might be part of the day's activities, but I wasn't sure if my friends thought I was old enough to become one of the stoner crowd.</p><p>We arrived at an art collector's house to hang out before we went swimming. My friend J pulled out his pipe, and a little box with a bud in it, and put it in front of me and walked away. I took it upon myself to prepare it and share it with everyone else. My first inhale was smooth, maybe because I had been around the smoke before, and my lungs were more tolerant. I held it in long, hoping to get some amazing high that is spoken of in movies and cloudy rooms. I took two more hits afterward, just to ensure some reaction from the stuff.</p><p>After we finished, we went to a swimming hole by the waterfalls. This was very cool. On the way there, I was hearing my favorite CD for the first time, all over again. Every sound was a perfect harmony to my mood. It was beautiful. The water was cold, and the reflections of light on the water got my mind to wander. I closed my eyes and thought about breathing underwater, and floating in a tranquil paradise. Somewhere in this stream of thought my parents came to mind, and I began to feel guilty. This was a major bring down from my high. I quickly deminished the thought, but I couldnt get back what was lost.</p><p>The day went on, and it wore off slowly. I was in a generally calm, peaceful state of mind for the entire day. I do recommend this stuff to everyone who likes to relax and dream, but only in moderation. In excess, this does no good.</p>",
 "year": "2000",
 "id": "2707",
 "gender": "Female",
 "timestamp": "2001-03-05T08:00:00.000Z",
 "views": "9160",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
