{
 "title": "Blissful Delirium",
 "author": "Reak Hacker",
 "citation": " Reak Hacker. \"Blissful Delirium: experience with Datura (ID 27095)\". Erowid.org. Sep 27, 2003. erowid.org/exp/27095",
 "substance": "Datura",
 "bodyweight": "150 lb",
 "report": "<p>My friend called me with the good news. 'Hey, I have some Jimson.' Having read almost everything on erowid about Datura, I told him not to take any until I took a look at it. He agreed that was the best course of action.</p><p>I went to his house over the weekend and crushed an entire seed pod (almost mature, seeds dark brown.) in a mortar and pestle into a fine powder. I took it home and the day after next, I smoked a bowl (roughly 30 crushed seeds) and waited for its onset. After about 2 minutes (11:56p), I began to feel 'something' which is a sign that you have bought your ticket. There was still some jimson in my pipe, so I smoked the rest of that too.</p><p>After clearing the pipe of an remnants of jimson, I read 'The Essential Confucious' from cover to cover. I realized that I felt stoned and euphoric. I felt like I was almost lucid but knew I wasn't dreaming. I preceded to draw a few pictures which are strange and beautiful upon examination. After listening to a few hours of music, I looked at the clock (2:18a) and decided it was time to catch some sleep.</p><p>I brushed my teeth and got a bottled water from the fridge to take back to my room considering I had finished half of one from earlier. After sitting on my bed just staring off into nothingness and anythingness, I realized I could see in the dark like when on acid. I imagine I had huge pupils, as was expected. I finally hit the pillow (2:37a) and closed my eyes. It seemed like only a few minutes passed by, before she appeared.</p><p>The Green Temptress was on my damn bed, tempting me to sleep with her. (and she was quite stunning as far as phantasms go) I pondered the idea, when I heard a voice in my head distinctly say NO. I realized that I shouldn't go with her or do anything she tries to get me to do, and she swiftly disappeared. I didn't see her again that night.</p><p>I remember falling asleep. I had a lucid dream as it was easy to go from a state of being awake to a state of dreaming. I remember being in my old high school. I entered the school from the doors, walking in as the kids do for class. I was there to visit a teacher who had 'inspired' me. There was an armed guard at the school entrance, (A man in black with a bouncer/badass look to him holding an MP5 SWAT rifle slung over one shoulder.) and another guard every 10 feet. All of the kids had guns as well, except I knew they were unloaded. This did not terrify me as it would in real life. I reasoned it was an omen of the impending future: A militaristic presence in all places of education at all times.</p><p>I found myself walking down the halls past all the classrooms and teachers I didn't know. It was then that I realized that I was not in my old high school. I was in my church from 9 years ago. It hadn't changed from the past at all. I decided this was normal, all things considered.</p><p>I found myself at the classroom (which turned out to be a desk in the middle of the hall?) of the teacher I had come looking for. Her name was Mrs. Lawrence and I had memories of her teaching me how to understand algebra and how I had won many awards for the school academically. I informed her of these things, told her I had decided to major in math and that she 'inspired' me. I immediately realized that I never had a teacher by that name, or had done any of the other things that I was so fond of. I noticed she was crying tears of joy. I realized, out of the blue, that I was dreaming. I became lucid. I shifted my dreamstate to an empty room with a black painted dresser drawer and turned it inside out with sheer willpower. I believe I also flew. After that, I have no idea.</p><p>(9:30a) The alarm goes off. I wake up, refreshed, which is weird since I usually don't wake up when my alarm goes off. I experienced no blurred vision or any other side effects. This excluding, at noon, I became slightly depressed, then realized how good I really felt. Everything from there was great. I recommend this in moderation and with caution. Do not do any drug until you know as much as you can about it. And remember, dress cool in the summer, warm in the winter, stay high, and keep on truckin.</p>",
 "year": "2003",
 "id": "27095",
 "gender": "Male",
 "timestamp": "2003-09-27T07:00:00.000Z",
 "views": "14105",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "40 seeds",
   "administration": "smoked",
   "substance": "Datura",
   "form": "(seeds)"
  }
 ]
}
