{
 "title": "For Restless Leg Syndrome",
 "author": "Marco",
 "citation": " Marco. \"For Restless Leg Syndrome: experience with Hydrocodone & Ibuprofen (ID 27104)\". Erowid.org. Sep 25, 2006. erowid.org/exp/27104",
 "substance": "Hydrocodone & Ibuprofen",
 "bodyweight": "170 lb",
 "report": [
  "<p>The traditional uses for Hydrocodone & Oxycodone are primarily for pain reduction.",
  "(Besides abuse & recreational use) I have found another useful property of them.",
  "I have suffered from a sleep disorder called 'Restless Leg Syndrome'  or RLS.  This is associated with an urge to move the legs around because of an uncomfortable feeling when laying at rest.  Temporary relief is felt after stretching, or moving the legs (walking or kicking). But the sensations come back, & the urge to move around is uncontrollable.",
  "After a trip to the dentist, I received a scrip for Vicoprofen (Hydrocodone 7.5mg /Ibuprofen 200mg)for mouth pain. During this time on the medicine, I slept wonderfully.",
  "Once the medicine was gone, my RLS came back.",
  "A couple months later, & many many restless nights, I have another Dental visit, & received another Vicoprofen Scrip. I again slept in peace during the use of the meds.",
  "So I started wondering if there was a pleasant 'side effect' from taking Vicoprofen.",
  "I decided to try taking it JUST for the RLS, with no pain.",
  "With an upcoming appt a week or 2 away, I called to see if I could get a scrip to help me until my visit.  No problem. So, with no mouth pain, & no other need for the meds, I took them to see what the results, & effects would be on my RLS.",
  "I took 2 pills (total of 15mg Hydrocodone) at 8:00PM. I noticed about 45 min later the soothing, warm euphoric feeling creeping in.  Within another 20 min, the full effects of the meds were working.   I felt great, & decided I'd try going to sleep.",
  "The next morning I woke up feeling refreshed & ready to go.",
  "The following evening I didn't take anything.....  In Bed at 10:00PM, RLS symptoms coming back....  So I get up & take 3 pills (22.5mg hydrocodone) & stay up until I feel the medicine start to work.  By 11:15 I'm feeling euphoric & happy, & relaxed,....  off to bed for a good night's sleep.",
  "I decided to see if taking the meds during the day would be OK.",
  "So at 1:00 PM, after lunch I take 2 pills (15mg) & go about my daily routine at work.  about 50 min later I feel the warm sensations coming on.   This makes work a fun place to be...  so I take another 7.5mg to continue the happiness.",
  "By the time I go home, most of the effects of the Hydrocodone have subsided.",
  "It's 10:00, & time for bed.   I lay down, & have no trouble with RLS.",
  "Basically I have discovered that nights w/out the meds, I have trouble sleeping because of RLS.  Not every night, but about 4 times a week I'm plagued.",
  "But EVERY night I used the Opioid, I had NO trouble.",
  "So it seems to me that there is another wonderful medical benefit of taking Hydrocodone.  (Codeine & Hydrocodone are also given to reduce coughing....)",
  "Just thought I'd pass this along, in case anyone else suffers from the same sleep disorder.</p>"
 ],
 "year": "2003",
 "id": "27104",
 "gender": "Male",
 "views": "35573",
 "dose": [
  {
   "time": "0",
   "amount": "14 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Pharms - Ibuprofen",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2006-09-25T07:00:00.000Z"
}
