{
 "title": "A Nice First Time",
 "author": "Bullsquid",
 "citation": " Bullsquid. \"A Nice First Time: experience with 5-MeO-DIPT (ID 27113)\". Erowid.org. Sep 25, 2003. erowid.org/exp/27113",
 "substance": "5-MeO-DIPT",
 "bodyweight": "",
 "report": "<p>Me and 2 friends decided to try 5-meo-dipt for the first time about a week ago. We each had 10mg each home at my place.</p><p>After about 20-30 min my friends said they were starting to feel some effects and wanted to go outside.</p><p>We went outside for a walk. I strongly regreted I have had dinner so close before we took the drug cause I still didnt feel a thing and by this time my friends were already tripping. After about 1 hour or more we were up in a nice park and decided to lay on our back on a hill and just look at the sky.</p><p>By that time the effects slowly started to kick in for me. I started to see some buzzing lights moving around the sky and feeling somehow strange, the feeling is hard to explain but it started to grow and after laying on the hill for about 15 mins we went up and started walking again.</p><p>The park seemed much more interesting then before. The nature all around us looked different, it seemed very beautiful instead of just looking ordinary. We all sat around under a big tree. Oh this was really great- the sun, the trees, the grass and the sky, it was all so very beautiful. I lied down on my back and just looked up at the trees and the sky above us.</p><p>We started to walk again. Laughing at simple things like bushes and colorful leafves lying on the ground. Colors seemed much brighter too and everything we looked at was clearer in a strange way like we were watching it trough a lens. We then went to store and bought some snacks and stuff that we ate sitting on a bench. It also seemed to taste different, more intense and somehow better taste.</p><p>After that we went home to my place again. I lied down in the bed and listened to some music [my choice: Radiohead and Belle & Sebastian] Now music was fantastic !! I could hear each tone and every instrument in the songs clearer then ever before. The music also seemed to slow down wich felt amazing. I felt really really good :)</p><p>Some time later we decided to watch some episodes of The Simpsons. We were really laughing hysterically at the jokes. I usually find Simpsons to be very funny but this was extreme. We watched maybe 3 episodes then it started to get late and my friends were heading home.</p><p>It had been a great day!</p><p>I was feeling pretty tired but somehow I was unable to sleep :(  I watched some Tv but I just couldnt sleep.... lied awake until the morning. Went out of bed and had breakfast, sat at my computer for a while and then finally I was able to get some sleep. I dont know why I was unable to sleep for so long, didnt feel any nauesa or anything.</p><p>Well it was a nice experience and I would surley do it again. My only regret was that I ate before I took the drug. Oh well I wont do that next time.</p><p>But this was fun stuff.</p>",
 "year": "2003",
 "id": "27113",
 "gender": "Male",
 "timestamp": "2003-09-25T07:00:00.000Z",
 "views": "6859",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT"
  }
 }
}
