{
 "id": 2711,
 "title": "Spinning Consciousness",
 "date": {
  "submission": "2000-06-16T07:00:00.000Z"
 },
 "author": {
  "name": "Anonymous"
 },
 "dose": [
  {
   "time": "0",
   "amount": "750 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "liquid"
  }
 ],
 "report": [
  "With all the negative stuff floating around about DXM, I had to respond. Last night I tripped DXM. I'm typing up a complete record of all i remember, which i guess i'll post if there's any interest, but for now i'll just give the basic impressions. OK, first off this was my first drug-induced psychedelic experience, except for n2o at the dentist's once. I've never even smoked pot. I weigh about 175 pounds and I took about 750 mgs of dxm i think (2 4oz bottles of syrup, 3mg/ml dxm-hbr as the only active ingredient.) The only really ill effect i felt was a bit of nausea after quaffing these bottles in about a minute. - i would reccomend not trying to down half a bottle of the stuff in one gulp. this passed within 20 minutes or so. probably about 45 minutes after the initial consumption, i was feeling the effects. I was feeling very bouncy as i walked around, and this one hallway seemed infineitely long. During this stage i felt the need to be very active, and i did stuff like run around and roll down a hill just for the weird feeling of motion (I spent almost the whole time outside). about 2 hours into the expereince i tried to interact with some people, and this made me really realize how stoned i was, because it was very hard to talk and I knew that everything I was saying sounded stupid, but I couldn't help it.",
  "From about hour 3 to hour 6, I peaked. I spent this entire time sitting and laying under a tree, because I couldn't stand up. My whole dxm experience was devoid of any special visuals - no tracers or cool chromatics or anything like that. I did however have several visions (for lack of a better word) during this peak. Some were actually visual, in that i actually saw things but these were all with my eyes closed and pretty grainy, and none were colorful. These included some kaleidiscopic mandalas, and a weird spiraling form made up of faces, actually there were 3 spirals all circling around each other, and each was made of a stream of faces. the other 'visions' all related to my feelings about myself. these included melting into the ground, turning into hard rubber and being unable to move, and merging with the tree i was sitting against and then spinning around and around it very quickly, while it was spinning around something else, so i was spinning on several different levels. The most memorable vision was when i became aware of two axes that divided my body diagonally, and i could feel my body/my conciousness spiralling around these axes and expanding outwards along them until it became infinite.",
  "after the peak, i tried to stand up. I hugged the tree for a minute and fell back down. It took several more attempts at standing up and walking around, over about an hour, before i was able to walk back home. I was still totally wasted for about 2 hours after i made it home. I tried to talk to people during this time, but it didn't work. Someone who knew what i was doing, whom i had discussed it with earlier, tried to talk to me about how it went, and i can vaguely remember trying to relate my experience to Carl Jung's Man and his Symbols and not doing a very good job of it. Anyway, about 9 hours after the initial consumption, I was suddenly aware that I was completely sober and awake.",
  "I'm not sure if i'm hung over or not. I woke up with a mild headache and a dry throat, but that could be attributed to only getting 4 &a half hrs of sleep.",
  "miscellaneous trip notes: during the first part of the peak I had lots of strange insights, about how I had been tripping for all of my life, how the entire universe was constructed by me in my mind, and what was i thinking when i put such&such in there, surely i could have done better. I saw 4 dogs throught the whole trip, and I wondered if they were my totem or something like that. I saw them a long time before i saw their owners (there were 2 dogs each time, with one owner each time, and 2 times i saw dogs). They were all big dogs, and I'm not sure if they were hallucinations or if my sense of time was just totally screwed (their owners didn't look real, but then not much did - especially people and cars) because they seemed to run all around and basically be everywhere at once, or they would be by a tree here one instant and then by a tree way over there the next.",
  "I didn't have any warping of the senses like some people had reported. The closest I came to this was having my sense of touch messed up, so that the grass under me, and sometimes I, felt like rubber, and there was a separation of touch sensations when i touched myself, so that it was like i was touching someone else and someone else was touching me, and not the merging of sensations when i usually touch myself. also, around the last half of the trip i stoped being able to focus on anything, so I had double vision.",
  "misc. misc trip notes: -the crickets around me were playing 'heaven' by the Talking Heads for quite a long time -when i was laying down looking up at my tree, the lights of the cars on a nearby road looked like fire.",
  "well i guess i don't need to post my earlier record, that's most of it right there. some closing notes: DXM can be a very heavy trip. It knocked me on my ass for 3 hours that were full of bizarrly metamorphed conciousness. Would I do it again? not soon, and i'll probably try some of the other stuff out there first. But I would consider it a positive experience. Also, during the peak I became very aware of either a higher-conciousness me or just another higher conciousness telling me that I should do it with a partner next time, so I won't do it alone anymore, not that that was a very bad thing. So if you're curious about the DXM trip, I would say get the dextromethorphan faq (great work, whoever put this together) and try it."
 ],
 "erowid": {
  "id": "1892",
  "citation": " Anonymous. \"Spinning Consciousness: experience with DXM (ID 1892)\". Erowid.org. Jun 16, 2000. erowid.org/exp/1892",
  "substance": "DXM",
  "views": "4437"
 }
}
