{
 "title": "A Big Disappointment",
 "author": "Pulsewidth",
 "citation": " Pulsewidth. \"A Big Disappointment: experience with Nicotine (Inhalator) (ID 27127)\". Erowid.org. Sep 6, 2007. erowid.org/exp/27127",
 "substance": "Nicotine (Inhalator)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "7.5 mg",
   "inhaled",
   "Nicotine",
   "(gas)"
  ]
 ],
 "report": "<p>I've always been curious about the effects of nicotine, as I thought it must produce a good high for so many people to take the risks of smoking tobacco.  Not wanting to smoke tobacco myself, I went to a pharmacy and bought a 6 pack of Nicorette brand 10mg nicotine inhalators.  I prepared the inhalator, and began inhaling.  The packaging claimed 10 inhalations was equivilant to one inhalation from a cigarette, so I inhaled rapidly and deeply to try to get the same effects as a cigarette.  At the time I was with an experienced cigarette smoker, in safe surroundings.</p><p>The initial effects were very subtle, a vague sense that something was different, but no 'high'.  I was feeling slightly apprehensive, but I continued to inhale, and began to get more effects.  The feeling is very much like caffeine side effects with none of the mental stimulation.  Jittery feeling, mild nausea, but I noticed no mental effects at all.  About 15 minutes later the nausea had built up enough that I stopped inhaling.  The cartridge is supposed to last 20 minutes, so I estimate my dose at about 7.5mg.</p><p>The feeling of being mildly poisoned continued for a few hours, but it was easily tolerable.  I noticed a significant appetite suppression effect.  Overall, I am very disappointed with this drug.  My expectations were for a much better feeling, but I only got side effects and no high at all.  Despite having 50mg left, I don't plan on taking this drug again.</p>",
 "year": "2003",
 "id": "27127",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-06T07:00:00.000Z",
 "views": "15776",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7.5 mg",
   "administration": "inhaled",
   "substance": "Nicotine",
   "form": "(gas)"
  }
 ]
}
