{
 "title": "Coke......hmmmm....",
 "author": "indigo",
 "citation": " indigo. \"Coke......hmmmm....: experience with Cocaine (ID 2714)\". Erowid.org. Nov 23, 2001. erowid.org/exp/2714",
 "substance": "Cocaine",
 "bodyweight": "170 lb",
 "report": "<p>Of course, of course it all started with smoking pot. I loved the feeling of being in a different world which didn't so much closely resemble the day to day society we live in. Anyway, that was like four years ago and since then I've done many other drugs (LSD, opium, mushrooms, ALOT of pills and other things I can't remember). Throughout these years pot has always been my drug of choice. Cocaine was always something I never really thought about....my fiends had did it, but i never seemed too interested, mainly because it's so expensive.</p><p>The first time I did it (1-2 years ago)I bought a 1/4 gram for the hell of it(there was no pot availible), went home and ended up snorting all of it with little effect except two things. I felt wired for about 5 minutes, and for about an hour I would have killed someone for more of the strange white powder. The next time I did it I wasn't expecting it at all. I stopped at my friends apartment and he was in his car ready to take off. He said he had just bought a 1/2 gram and snorted two lines..it was his first time. He was in a hurry to go to someone's house and burn a joint. I was with two other friends and they wanted to pitch in to buy a 1/2 gram (50$). I gave 'em 10 bucks and when I got back from burning one, there was the sacred white powder..ready for me to snort. I was very excited actually...the word was it was very good coke. So I snorted a line and sat back and relaxed. I noticed my heart was racing and I was alert, but that was it. All I could really focus on was I WANT MORE COCAINE! I have never had the 'pleasure' of feeling like God after ripping a few lines.....but ohhhh did I feel the addiction. I wanted more coke soo bad even though I didn't really 'get off' from it....it was weird...within the split second that coke went up my nose...all I could think about was more .. more. MORE!!</p><p>When I went back home my girlfriend thought it was over between us because I kept blowing her off that evening (she didn't know I did it that night, but I kept pissing her off the whole night because i just wanted more coke). Well, as soon as I got things fixed with her I headed back to my friends apartment with 50$ for a half gram, but it was already gone. He told me to get a hold of him in the morning. All night and the next morning, I kept trying to decide if I should get more or not. I read many of the 'don't try it experiences' on this web site, but I still wasn't decided. I ended up going some where else to deliver some money for a future schwag/kind deal before getting a hold of the coke dealer. I was sure I was going to buy the coke...I was pumped.....but then as I arrived at the bud dealers house, I noticed a massive kind bud on the table. I was lucky enough to receive a few hits off this bud and then I suddenly realized what a fool I was. I was soo close to just throwing my money away on the half gram which wouldn't of even lasted the day, but with a little help from my friends and the God Cannabis, I made the RIGHT decision.\rAfter reading the many experiences on this page...mine doesn't even compare to all the others....but it also only took me ONE SMALL line and I almost lost my girlfriend and 50 bucks I desperately needed. I know it's all a matter a personal choice, but I'm glad my personal choice is to inhale a few delicious hits of extremely kind bud and actually be able to sit back and enjoy my 'own little world' for hours instead of snorting some bitter, half coke, half god knows what it was cut with, and become an edgy drug fiend for the night. Maybe I'm talking out my ass right now since I've never felt that 'incredible rush', but I might buy a gram this weekend for a much better price just to experience 'the rush' and sell the rest of it. I know I'm dancing with the devil there, but I'm hoping God Cannabis will cut in just in time to show me what a fool I was again, but still have the 'the rush' experience under my belt.</p><p>I don't disagree that coke has extremely good effects on an individual for a short period of time, it's just SOO DAMN ADDICTIVE and SOO DAMN  EXPENSIVE that I think I'll be just fine sticking with the sticky, green, orange-haired chronic that I find so much more beautiful than a line of white powder. Hopefully the next time I'm thinking of this 'little editorial' I wrote I'll be inhaling the priceless, chalky, white smoke from a delectable kind bud and NOT a line a white lies.</p><p>     FUCK THE POWDER.....BRING ON THE HERB!!!!!!!!!</p><p>                          JR</p>",
 "year": "2000",
 "id": "2714",
 "gender": "Male",
 "timestamp": "2001-11-23T08:00:00.000Z",
 "views": "11699",
 "dose": {}
}
