{
 "title": "Very Thought Provoking",
 "author": "Daywalker",
 "citation": " Daywalker. \"Very Thought Provoking: experience with Absinthe (ID 27149)\". Erowid.org. Dec 5, 2006. erowid.org/exp/27149",
 "substance": "Absinthe",
 "bodyweight": "67 kg",
 "header": [
  "DOSE:",
  "330 ml",
  "oral",
  "Absinthe",
  "(liquid)"
 ],
 "report": "<p>Well for a long time I had wanted to try Absinthe because I read and heard alot about it but I never had the chance to buy any. Until one day about a week ago one of my friends came over and had some Absinthe with him. I nearly freaked and begged him to let me drink some. Instead of letting me drink some he gave me the bottle and told me I could have it(it wasn't full anymore he had drank most of it the night before with some friends only about 0,33 liters left).</p><p>He advised me to dilute it with some water since it's pretty harsh to drink it straight(which I also did). Well I was getting ready to go to a Party and I wasn't about to share so I drank most of it on the way to my other friends house who was gonna drive us to the party. Once at the party, I diluted the rest of the Absinthe that was still left again with water. I wasn't experiencing anything yet only a subtle buzz and a feeling of extreme calm and serenity. Almost like when I'm high.</p><p>Well about 2 hours later with the bottle already being empty I was definitely feeling something. A feeling like explained earlier just very very calm and a slight buzz. Then me and my friend went outside to talk and started walking. While walking and talking with my friend I could really feel the Absinthe. It felt like I was sort of high sort of drunk, a mixture of both I would say. And everything was calm and I felt almost weightless. This lasted for about 45 Minutes and then I could barely feel it anymore.</p><p>Later on when I was home already I started coming up with real cool shit and got really creative. I started writing a couple of lyrics and just felt very good and felt like thinking. About life about everything. And that's about all I have to report, I would definitely do this again and I'm looking forward to it next time.</p><p>Also I think I should note that while at the party I drank nothing else. I just wanted to experience the effects of the Absinthe alone.</p>",
 "year": "2003",
 "id": "27149",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-12-05T08:00:00.000Z",
 "views": "12835",
 "dose": {}
}
