{
 "title": "Left Reality for Quite Some Time",
 "author": "Kidfun",
 "citation": " Kidfun. \"Left Reality for Quite Some Time: experience with 5-MeO-MiPT, Cannabis, & Salvia divinorum (ID 27211)\". Erowid.org. Oct 1, 2003. erowid.org/exp/27211",
 "substance": "5-MeO-MiPT, Cannabis, & Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 mg",
   "oral",
   "5-MeO-MIPT",
   " T+ 3:00",
   " ",
   "smoked",
   "Cannabis",
   " T+ 3:00",
   " ",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "report": "<p>Last night a friend of mine and myself decided to do a little experimentation with 5-meo-mipt.  I have experimented with this substance before on 3 occasions with doses ranging from 5 mg-8mg with very enjoyable effects.  This experience was a bit more intense.  We each took 5 mg orally and became noticeably effected within 15-20 minutes. </p><p>+1 hour:  feeling mostly speedy feeling, music very pleasent</p><p>+2 hour:  definite increasing in tactility, euphoric.  Seems to have a very linear onset in the sense that it starts quick and continues to climb</p><p>+3 hour:  smoked cannabis mixed with leaves of salvia.....left reality for quite some time while watching led zepplin dvd's....drum solos spectacular....band looks painted on the screen....unable to make conversation....very intense.  This intensity i believe is due mostly to the combination of the three substances. </p><p>+4 hour:  still not back yet</p><p>+5 hour:  coming down gently....still very disoriented</p><p>+6 hour:  bed time</p><p>In all this substance was very entertaining and the combination of substances was spectacular.  Be very careful when using research substances.  Despite the fact that they are easily attainable, they are dangerous and are not for everybody.  A friend of mine recently used this same substance in the same dosage and had very negative effects (mostly due to the speedieness) to the point where they had to be hospitalized and restrained over night.</p>",
 "year": "2003",
 "id": "27211",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-10-01T07:00:00.000Z",
 "views": "14289",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": " T+ 3:00"
  }
 ]
}
