{
 "title": "More Powerful Than Imagined",
 "author": "Pot",
 "citation": " Pot. \"More Powerful Than Imagined: experience with Cannabis (ID 27224)\". Erowid.org. Oct 17, 2007. erowid.org/exp/27224",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Okay, this is about my 5th time trying weed, and this was by far the strongest trip I have had. It started out with me and a few friends going to a high-school football game, and looking for some liqour or weed. We just needed something to get high on. After being at the game doing nothing for an hour or so, we decided to leave. We ended up going to my friends house (P), where they were drinking and smoking. I have no fucking clue where he gets this shit but P always seems to have the best weed ever. We bought a dime bag of Kronic for about 15 dollars, since I was friends with him, and he was already stoned off his ass.</p><p>I was sleeping over with two friends at their house (brothers). Now his parents are home and we weren't allowed to leave, and we were determined to get high that night, so we decided on equally splitting the dime and then eating it. I did not think that this would work at all. I just swallowed my portion in one bite and it was over. I waited while we were all watching T.V. on the couch. It was about a half hour later and I couldn't really feel anything, so me and my friend went out on the trampoline to try and feel the effects. At that time I didn't feel high at all just weird. After we were jumping we came inside and sat back down and watched T.V. after about an hour or so, I remembered that usually when it hits me it is because I do something to notice like change what I'm doing or something. So I get up and if fucking hits me like a ton of bricks.</p><p>I casually but confusingly walk over to his kitchen and then circle back around the house and end up back at the couch. At this time I had no clue what I just did or how I got back to the couch. I had no clue it would affect me like this. I wasn't even peaking yet and I was fucking gone. I would sit on the couch for a minute or so and then just snap out of it, and try to think back at what just happened or what I was thinking as I was on the couch a minute ago, and I remember being there, but my mind was totally blank. No thoughts or anything I just sat there staring at the wall until I would snap out of it. I would do that on and off and it would kind of scare me because I wouldn't know when I would go back into it again, but I just said 'fuck it' and sat there feeling blazed.</p><p>After about ten minutes of doing that I realized where I was and that there is a trampoline outside. I ended up going out side to get on the trampoline, but all I remember is coming straight back in. I know I was out there jump on it because my back was wet because it had rained earlier. So I am wearing a wife-beater and I go to take it off because it is soaked. I take it off and put it down then sit there begging my friend to get me a shirt to wear so his mom doesn't come down and see me half naked, and would then know what was going on. After attempting to hit, raise my voice, and repeat myself he simply turns around reaches at the table and hands me that shirt that I took off a few hours ago so I could wear my wife-beater because it was too hot. I sit there fucking stunned, how the hell could I forget that I had a shirt right there behind me the whole time.</p><p>At this point I realized how truly gone I was. I little later I raid his kitchen eating anything I can find and it added up to be, 3 donuts, 3 slim jims, a moon pie, a cinnimon bun, a brownie, some glasses of soda, and a few pop tarts. After that we are fucking laughing at each other for no reason. He is not nearly as high as I am and his brother doesn't feel anything at all. We ended up having a fucking marshmello fight taking turns hiding and pitching them at each other. I can't really remember what happens after that, but I remember his brother going upstairs and then me sitting down and seriously thinking about where he had just gone to. Me and my friend attempted to get some milk and donuts but I ended up laying on the floor not being able to breath from laughing so hard, because he took the last donut.</p><p>The next thing I remember is me going upstairs waiting for him then greeting him asking him if he got anything for me, then realizing his brother was pissed because I was waking his parents up, so I tried to play it off by asking if we were going to go back down stairs, instead of asking him for a donut like an idiot. After that I realized I was yelling instead of talking but I only because I couldn't even hear myself think. So I get to his room and lay down and watch T.V. It was Jack Blacks mtv diary. Throughout the whole thing his face kept warping around and he was looking and acting like a fucking cartoon. The whole thing freaked me out because since it was T.V. I couldn't tell if it was really doing that or not. After turning away I was looking at a picture of a car on the wall where I saw the coolest and most creative visual yet. It just warped into somthing from Van Go (I think) or Picaso, the car just turned into a person with their mouth open and a house in their stomach. I was really tripping.</p><p>I realized that earlier I had to go to the bathroom but forgot about it. Now I just acted purely on instinct and went to go take a piss. I pissed for like a minute straight but felt no bladder pain or anything which really scared me. I thought I might just not realized it and hold it in until it burst. Then for about an hour I just sat there and visualized a whole bunch of shit which seemed so real to me at the time. I ended up falling asleep at like 4 o'clock and waking up the next morning still fucking high. Not anywhere near what I felt that night before but I defiantly could tell there was some weed affecting me still.</p><p>I sat there and reflected the whole night which was pretty amazing as to happen from just swallowing not even a dime of weed. The effects of eating it were much more intense and lasted much longer than any other time. Except for maybe my first time getting high.</p><p>It makes me think about what getting high really is. It seemed that night that all it does is, for the time being, make you incredibly stupid and lowers your IQ to the point that you can count it on your fingers, only you constantly forget how to count. I couldn't make my own decisions they had to help to get upstairs and find my way around the house which I kid normally walk through blind-folded. I had a 3 minute memory span, I couldn't control my walking or actions, and I couldn't think or process information. It was like I was mentally retarded for a few hours. I think that is all that weed does to you which in a sense is a very powerful thing. Overall I think that eating the weed will bring a much more intense and a longer trip then smoking. I would do this again only I would get my own weed to eat and take it a few hours before my friends would smoke their weed because smoking just works better for them.</p>",
 "year": "2003",
 "id": "27224",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-17T07:00:00.000Z",
 "views": "4403",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
