{
 "id": 2728,
 "title": "God",
 "date": {
  "submission": "2000-05-31T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Robbie",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "My experience last night on LSD was amazing.  My second time tripping, the first of which I had taken a red gel-tab which I had later felt expanded so much of my mind, and was very visual-oriented.  Last night...I felt GOD.  I was GOD.  See, in my 'clique' of friends there has been a lot of turmoil. So two of my closest friends and I decided to have a free night of fun.  We took the acid aware of the possibility that it could be fake, because one girl we were with during the purchase freaked out about it being a 'cheap hit'.  For the first hour, and almost the second, we were in extreme disappointment.  I've been taking Philosophy and doing well in it, and well...wanted to experience the insanity from last time, in my newly philosophical mind. ",
  "Anyway, we end up driving on the New Jersey parkway (for no reason and with a designated driver) going 65 mph, in a rain storm.  My one friend and I ended up with our heads and naked upper torsos out the windows...experiencing first hand what we had stayed indoors and missed last time--NATURE!!  It was INCREDIBLE!   The air pressure was like a vacuum out there, the lights, the water, the speed, the power!!!!  I held my hand out in front of me, i felt rain going down my throat (my mouth was uncontrollably open) the rain hit my skin! OH MY GOD I TINGLED; I orgasmed mini-orgasms all through my body! ",
  "The universe then, 'versed' beyond the back of my hand, and it flowed naturally, chaotically through my fingers and then--it shrunk.  I held all that existed in the palm of my hand...and I SCREAMED!!  The universe roared!!  The fact that I was holding all that existed and knew I was in the presence of God, showing me his power...the fact that the bottom half of my body was in the car did not even exist.  I was free.  I was flying.  I felt the universe in my hand, and I can't explain through words what I felt.  The power.  I was screaming out in this storm, out in this 65mph+ wind, in pure ecstasy.  My mind and body were in bliss.  I felt God's power!  In my hand!!(still outstretched from my soaking wet face as I'm screaming to the top of my lungs to my other 4 friends in the car what absolute, what orgasmic, POWER I was experiencing.) ",
  "I heard my friend from the other side of the car in the front seat (I was in the back) screaming my name, and I knew she was experiencing what I was experiencing! Can't explain...a new reality, raw where I exist in ecstasy!  (effects similar to those of the drug, EXTASY). Normally due to the extreme wind, I think my hand would have buckled, and my lungs unable to take in the air, forcing me back in the car, but Now I was getting off on it!  I was defying it!  I was smacked right in the face by God himself!  I went into this trip, as a strongly positioned ATHIEST, and came out a touched man.  Touched by God himself.  Maybe you think it's the lsd?  But I felt Him.  I can't even begin to describe...It feels like millions of lifetimes have passed by in just these few short hours!!!  I feel as though I have experienced EVERYTHING!! And how foolish I was to be existing with all that exists and not KNOW in my heart that He exists too. God, OH GOD."
 ],
 "erowid": {
  "id": "19",
  "citation": " Robbie. \"God: experience with LSD (ID 19)\". Erowid.org. May 31, 2000. erowid.org/exp/19",
  "substance": "LSD",
  "views": "13230"
 }
}
