{
 "title": "Enlightment and Focus",
 "author": "Lovetheherb21",
 "citation": " Lovetheherb21. \"Enlightment and Focus: experience with Amphetamines (Adderall) (ID 27289)\". Erowid.org. Oct 17, 2007. erowid.org/exp/27289",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>My doctor recently prescribed me 15 mg Adderall pills for add.  I've been a regular user of weed for about 3 years, and have used shrooms about 5 different times.  I had read a lot about the effects of Adderall and was interested to enter the world of stimulants.  The first day I was to take the medication, I took twice the recommended amount, and took 30 mgs.  On the way to school, I smoked a cigarette, and was moderately buzzed walking in the doors.  About 10 minutes into first period (20 minutes after takin the pills) My heat rate quickined and I became slightly euphoric.  30 minutes after takin the pills, I was already on my peak, and was going to last for another 8 hours (I'm taking extended release adderall).</p><p>The best way to desribe Adderall is that its like the coming up of mushrooms, I feel generally good inside with a lot of energy.  Its also like weed, because I have a lot of ideas running through my head, but instead, it's much easier to focus on a certain idea.  Everything I did was so much more interesting.  It was actually fun listening to a lecture and taking notes because I was so focused on what was goin on.</p><p>By second period, I was really energetic and had to write an english essay.  As soon as the prompt was given out, I began writing and thinking at a furious pace.  In about 20 min (out of the given 50 min) I had written one of the best essays of my life.  I was at a state of enlightenment and understanding like never before.</p><p>At lunch, I didn't eat much, but was very thirsty.  In 6th period, I was still at the peak of the drug, and entered psycology, a new man.  Normally, I would sleep through this class, but that wasn't my fate today.  My teacher began a discussion on human nature, and if people are naturally pro-social, or anti-social.  I began joining in the discussion, like never before.  My ideas were so deep and complex, that no one in my class understood what I was saying except for the teacher.</p><p>One of my classmates asked the teacher how could anti-social behaviors exist, if all people were born pro-social, or visa versa.  My teacher replied that he didn't know the answer.  I raised my hand and gave a 5 minute speech about the influence of competition, survival of the fittest, and natural conflict between different social classes.  I spoke a 1000 words per minute, my ideas ran so quick, and I was so focused on what I had to say.  My words completely showed up the teacher.  Everyone was stunned.  After class, my teacher explained how impressed he was, and my nickname in that class is now doc.</p><p>Ever since then, my medication has worked about the same everyday.</p>",
 "year": "2003",
 "id": "27289",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-17T07:00:00.000Z",
 "views": "8495"
}
