{
 "title": "Slowly Painting an Image",
 "author": "Goat",
 "citation": " Goat. \"Slowly Painting an Image: experience with DXM & 5-MeO-DMT (ID 27301)\". Erowid.org. Aug 19, 2006. erowid.org/exp/27301",
 "substance": "DXM & 5-MeO-DMT",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "DXM",
  "(liquid)",
  "",
  " repeated",
  "insufflated",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>I used dextromethorphan regularly for about 3 and a half years, sporadically at first, then more and more compulsively as time went on.  As a result, I have learned much, and suffer from lingering after-effects that might be of interest to others.</p><p>I began using DXM after reading about it on the internet, experimenting with the different plateaus, and after 2 or three months I reached a level of use consisting of a 4 oz. bottle of Robitussin or the equivalent every week or two weeks, and 2 bottles once every month or 2, on average, although there was a period of a month or so where I was using it two or three times a week. </p><p>I experienced psychedelic effects to some degree through this whole period, although they would be very slight now if I were to take up the habit again and most of my really good trips later on were with DXM in conjunction with something else, usually pot or 5-meo-dmt.  I realize, in retrospect, that my use was mainly because of a mood lift that would last for a couple days after my trip, followed by a slight but persistent depression and cravings, and also the nearly complete escape from reality and feeling of power the drug provided.</p><p>Most of my trips were pretty typical for the various dosage levels, running the range from music induced imagery and body distortions to seeing the white light and thinking I was dying.  I have discovered several things of note, however.  An online source mentions that meditation can enhance DXM trips.  I found through experimentation that two particular forms are stunningly effective.  Both are described in depth in a work on out of body experiences dealing with 'the rope method' of leaving the body. </p><p>First, attempting to enter a trance state while under the influence is very easy, and dramatically enhances disassociation, i.e., one becomes extremely cut off from the outside world.  The method I used is to imagine you are climbing down a long ladder, being sure to imagine the physical feeling of my body moving down, not just the visual image.  I would loose all sensation in my limbs, and finally all awareness of my physical self except as a microscopic pin prick, on a low second plateau dose.  Second, attempting to leave the body using the rope method induces a dramatic increase in sensations of movement, body image distortion, and visual imagery, and the exit from the body is much easier than while sober.  My method is to imagine I am pulling myself hand over hand up a rope while perfectly still with eyes closed. </p><p>Once again, imagining the physical sensation and that I have moved through space to a new location is important, and complete focus on the imagined climbing is a must.  This ultimately leads to a powerful rushing, tearing sensation, a feeling that I am in two places at once, both in and above the body, and finally the ability to roam about the room separate from the body.  The common thread I think is imagining myself to be physically located somewhere else in the room.  Both methods can create effects comparable to a 4th plateau trip on a second plateau dose if applied diligently.</p><p>My second discovery is of a wonderful synergy between DXM and 5-meo-dmt.  The experience is similar to combining other psychedelics with DXM, but lacks the overwhelming gaudy visuals and confusion I find in combinations with LSD or other tryptamines.  I would come down being able to remember much more of the trip than with other psychedelics, and the trips were always powerful.  The visuals were not flashy or highly colored, but were intense and quite realistic, most reminiscent of my early days with DXM alone, but amplified. </p><p>A common theme in many of the trips was being taken back to the creation of the universe to witness it's birth in a sea of white light, then through all of history;  first the emergence of order in the cosmos, best described as a visual music, or a music of being, then the creation of our planet, the development of plants, then animals, then people, then through human history and culture, all with a powerful sense of progression from simplicity and abundance of potential and energy, a strong dichotomy of being, to fecundity, diversity, and a kind of exhaustion of resources and dissipation, as if the yin and yang had leaked together.  The first birth and explosion was much like a regular 5-meo flash, but the rest radically different. </p><p>I would insufflate about 15mg of the 5-meo an hour after the DXM.  I believe in the reality of visions, and I think that 5-meo-dmt is a powerful source of psychic energy, perhaps the most powerful, releasing the full energy reserves of the user or drawing it from somewhere else, and it provides great impetus for travel using the metaphorical vehicle of DXM, which provides relatively easy access to the immaterial realms; enough impetus, in fact, to travel back to the very end of time.  It is the plutonium in the DXM Dalorean.</p><p>I finally gave up this particular substance after experiencing disturbing, persistent side effects that could be evidence of brain damage.  The first thing I noticed was difficulty finding the exact word I wanted. The word would be on the tip of my tongue, but wouldn't come to me unless I spent a good couple minutes thinking about it.  This was very disturbing, and lead me to give up the drug, although it took the better part of a year to get off of it completely. </p><p>My verbal memory seems to have recovered now that I've quit; my brain has hopefully adapted and shuffled the knowledge to some unaffected wrinkle on the walnut, although I can't tell for sure whether my vocabulary has been cropped. </p><p>The second side effect is a visual disturbance that is nearly identical to fine textured television static, overlayed onto my visual field.  It only occurs at night and is quite pronounced, sometimes to the point of obscuring the outlines of objects.  The dots of static are a faint grey, tinged with all the colors of the rainbow.  It becomes worse while I am under the influence of serotonergic psychedelics, or immediately after I wake up.  This is also getting better, but much more slowly, and I expect it will be a couple more years before I am free of it.  While it doesn't affect my work like the loss of vocabulary, it is still unnerving.  I could hardly see the stars for a while; that was a sad state of affairs.</p>",
 "year": "2003",
 "id": "27301",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-08-19T07:00:00.000Z",
 "views": "17540",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
