{
 "title": "A New (?) Efficient Way of Taking Calea",
 "author": "Jo P",
 "citation": " Jo P. \"A New (?) Efficient Way of Taking Calea: experience with Calea zacatechichi (ID 27327)\". Erowid.org. Oct 16, 2003. erowid.org/exp/27327",
 "substance": "Calea zacatechichi",
 "bodyweight": "190 lb",
 "report": [
  "<p>I'd like to report what appears to be a new way of taking Calea. I've found no references to this method on the web. It's a very  efficient method since it requires very little herb to achieve strong effects. Also, it's a lot healthier than smoking. The disadvantage of the method is, of course, the intensely bitter taste of the herb (which for me, is not a big problem).",
  "The use of Salvia Divinorum in tincture form is well known. I was wondering if Calea tincture would be similarly effective.",
  "A report on Erowid mentions an ethanol extract of Calea. Its author claims that the extract is at least five times stronger than tea made from the same amount of herb. He recommends drying the extract and inserting it in capsules.",
  "Per his instructions, I mixed four tablespoons of crushed dried Calea herb with twice its volume of Everclear 195-proof alcohol. The mixture was shaken once a day and allowed to sit for five days. After the fifth day, the ethanol tincture was separated from the herb using a filter. This resulted in about eight teaspoons of Calea tincture.",
  "I then mixed one teaspoon of the tincture with enough water to comfortably hold in my mouth (about 12 teaspoons), and added a drop of peppermint extract and some honey. As in the Salvia tincture method, I held the mixture in my mouth for fifteen minutes, periodically swooshing the liquid around and making sure that it reached underneath my tongue (where the sublingual mucous membranes absorb the psychoactive substances). Given the very strong bitterness, this was no mean task, but listening to some classical music distracted me from the taste.",
  "After fifteen minutes, I began to feel the now-familiar initial effects of a good Calea dose: closed-eye visuals and increased hypnagogic imagery. With some effort, I swallowed the liquid in my mouth. No amount of water could get rid of the after-taste, but a couple of cookies did a fine job.",
  "I went upstairs to take a shower. In the bathroom, the closed-eye visuals were reaching a pleasant intensity, as strong as that from the tea + cigarette method, minus the irritated lungs. Ten minutes later, I was under the bedsheets. In the darkness, I enjoyed strange hypnagogic imagery: undulating serpents whose heads are flowers, bizarre ornamented ears, lizards transforming into fish and vice versa, mysterious psychedelic plants growing in 'fast forward', and a lot of other stuff that's hard to describe or remember.",
  "I woke up towards dawn after a very vivid dream. As I was trying to sleep again, I thought about the dream. I interpreted it as expressing a fear of being left in the lurch at work. Unfortunately, when I got out of bed much later, I couldn't remember anymore what the dream was about!</p>"
 ],
 "year": "2003",
 "id": "27327",
 "gender": "Male",
 "views": "42823",
 "dose": [
  {
   "time": "0",
   "amount": "1 tsp",
   "administration": "sublingual",
   "substance": "Calea zacatechichi",
   "form": "(extract)"
  }
 ],
 "submissionDate": "2003-10-16T07:00:00.000Z"
}
