{
 "id": 2733,
 "title": "The Green Dominatrix",
 "date": {
  "submission": "2007-08-29T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Sprat",
  "gender": "Male",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "This would have been my fourth experience with salvia. The past three times I had smoked the green sage, I found it utterly inpossible to keep my shit together, this time was to be no different.",
  "I was over at my friend Rachel's house, in her room which is so colorful and full of miscellaneous lights, trip toys, and stuffed animals so as to be terrifying even to your average sober person. We were chilling out and listening to music like we usually do when she tempted me with the prospect of smoking the rest of the 5x salvia extract I had given to her for safekeeping/personal use. I said alright, and then proceeded to pack her small monkeypipe with the stuff. I went into her bathroom and told her not to bother me for at least a half-hour; my intention was to take more than one hit (i can never get past the first before I totally lose control), and so, in the dark, with my legs braced against one side of her bathroom and my back against the door, I took one deep inhalation of the familiarly musty and slightly sweet green smoke that is salvia.",
  "The effects began almost immediately, I started to feel every molecule in my body vibrate, pound, and twist furiously, and disperse themselves among every object that I was in contact with. Anything that had previously connected me with reality was so far away it did not matter. I vaguely knew that I still had the pipe in my hand, and the lighter in the other, but the physical sensation of twisting, buzzing, and crawling was so intense that I could not move. I heard Rachel pounding on the door, she said something (I later learned that she asked if she could come in), which annoyed me very badly, as anyone familiar with Salvia is able to understand, nonetheless, I apparently said yes to her.",
  "And with that, Rachel opened the door. I am immediately asssaulted by the bright colors and terrifying visuals of rachel's room, unable to manage normal motor functions competently, I collapse onto her bed. As I lay there, trying to take in the room, small bits and pieces of it seem to filter through my perception: a piece of that tye-dyed sheet, the vague bass loop of that prodigy record, that light bulb somewhere, the pulsating light on the floor, all begin to swirl together to form thousands upon thousands of tiny, glowing plant people on the walls in full orgy; the mighty, chanting voices of spirits in my head.",
  "'I have to get out of here!' I think to myself. I run down the hallway, chased by long, glowing plant tendrils, until I finally reach the end, where I find something far more terrifying: a mirror. Looking through that mirror, I heard the voice of the green lady herself, telling me that she does not feel that I am ready yet, but that in her mercy, she will allow me to experience the wonderful things she has to show me.",
  "At this point I chilled out some, and so I sat on the couch in the living room which is filled with native american artifacts and paraphernalia, then I decided to get a peach to eat from the kitchen. Eating under the influence of Salvia is not at all pleasant as the food seems to make my mouth vibrate and my teeth itch.",
  "While I sat there in the Kitchen, with Rachel's mother on the other side cooking, I closed my eyes, and could see myself walking down this pathway in a forest somewhere. Where could this lead, I wondered, and I kept walking. But then Rachels mother, who was entirely aware of what I'd been smoking, started talking to me, and asking me questions about my father, who is an alcoholic. I kept on telling her (and myself) that it was of minimal importance, but she persisted in asking about his condition. So the trip tapered off gradually, and to this day I still wonder what it was that the green lady wanted to show me at the end of that path."
 ],
 "erowid": {
  "id": "19016",
  "citation": " Sprat. \"The Green Dominatrix: experience with Salvia divinorum (5x extract) (ID 19016)\". Erowid.org. Aug 29, 2007. erowid.org/exp/19016",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2799"
 }
}
