{
 "title": "Making Friends",
 "author": "Urthona",
 "citation": " Urthona. \"Making Friends: experience with Yohimbe (ID 27354)\". Erowid.org. Oct 21, 2006. erowid.org/exp/27354",
 "substance": "Yohimbe",
 "bodyweight": "77 kg",
 "header": [
  [
   "DOSE:",
   "0.3 g",
   "oral",
   "Cannabis - Hash",
   "(cookie / food)",
   "",
   "3 tsp",
   "oral",
   "Yohimbe",
   "(tea)"
  ]
 ],
 "report": "<p>I ate a piece of hash cake while I was in a very good mood and eagerly waiting for my girlfriend who was visiting a friend. I expected her to come home late and because she had to leave next morning, and be away for some time, we were planning not to sleep much this night. So I thought about something to keep me awake, and remembered the bag of yohimbe bark that I bought about 3 or 4 years ago.</p><p>I put three teaspoons in a pot with two cups of water, heated it and as I watched it and smelled it I decided that I thought it better not to boil it, I don't know why but it seemed to me that it was the right way to treat this plant. I don't know if it matters but it might change the combination of active components in the brew. So I just kept it at the point before boiling when tiny bubbles come up from the bottom of the pot for 15 or 20 minutes.</p><p>I drank the tea with honey and a little old world elderberry juice that my girlfriend had made. It tasted really good.</p><p>I was feeling very good afterwards, not tired, but no speedy / heart beating effects either, a very light and pleasant high, thinking more clearly compared to the usual effects of hashish. when she came home, we spend the night talking and eating and everything was fine. we went to bed, slept for 2 hours. When we were waking up, I already had an erection that wouldn't go away. The sex we had (12 hours after drinking the yohimbe brew) was definitely prolonged and my orgasm was great. It was a bit harder to keep in touch with my girlfriend's feelings, but with a little concentration it was no problem and she enjoyed it at least as much as me.</p><p>After that and a small breakfast, I took her to the other side of the city where she was leaving, still not feeling tired, went for a walk, played a little guitar and slept very pleasantly and without problems.</p><p>I feel that it was (for me) just the right way of using this bark, and just the right dosage as well. no need to try and take more cause it did just what I wanted it to do.</p>",
 "year": "2003",
 "id": "27354",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-10-21T07:00:00.000Z",
 "views": "17822",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.3 g",
   "administration": "oral",
   "substance": "Cannabis - Hash",
   "form": "(cookie / food)"
  }
 ]
}
