{
 "title": "Forever Changed",
 "author": "Necronomicon",
 "citation": " Necronomicon. \"Forever Changed: experience with Mushrooms - P. cubensis & Syrian Rue (ID 27407)\". Erowid.org. Aug 25, 2005. erowid.org/exp/27407",
 "substance": "Mushrooms - P. cubensis & Syrian Rue",
 "bodyweight": "155 lb",
 "report": [
  "<p>I used to be a rationalists, seeing the world only for the physical.  I thought religion was only a crutch, and for those who could not handle life all by themselves. Concepts such as reincarnation seemed completely rediculous. I wondered why people couldn't accept death for what I thought it was, the end...then I accidentaly stumbled upon a teacher who harshly showed my all my faults in logic.  It came in the form of Psilocybe Cubensis.",
  "I had what looked like a small amount of Cubensis, some fresh, some dried.  I did not weigh them, I figured I was ready for it.  I had eaten 3g of syrian rue seeds in capsules 30 minutes earlier.  I chewed and swallowed the mushrooms, now an amount I guess to be equivelant to 7g dry.  My g/f was the sitter in case anything would go wrong.",
  "It started coming on pretty strong.  My room looked twice as large.  I could perceive so many more colors and the contrast between them was so beautiful.  My room looked as if it was designed by hollywood.  I told my g/f that these were amazing and I wish I could never come down.  I got my wish,  I just kept on going up and up and up. The television started to get overwhelming so I shut it off.  The visuals on the textured walls were amazing, I was seeing goblins and ghouls fighting in my ceiling.  It kept on getting stronger and stronger. The light started to be too much.  I shut it off and lay down on my bed.  Voices were echoing through my head,  hundreds of them.  It was getting incredibly overwhelming.  Then I have a blank in my memory.",
  "My life flashed before my eyes.  Every single memory I stored was displayed to me.  My whole life was repeated in what seemed like a second.  After that I find myself thinking soberly wondering where I was.  I was looking at the earth from outer space.  I couldn't remember that I had taken mushrooms, but I got the notion that I must have died, but could not think of why.  I looked down on the earth, and it started spinning faster.  Figures of history such as Hitler and Napoleon rose and faded away.  Figures I did not recognize came up and I guessed they must be from the future.  The world spun faster, and faster, until it reached the beginning and end of time.  It melted into darkness.  I was left in infinite.",
  "I came back to my body, and was absolutely shocked at what just happened.  I tried explaining it to my g/f. ",
  "It was hard pulling myself together after that.  The Mushrooms totally destroyed my rational world completely, everything I believed in was taken away.  I now realized that there was much more than just the physical world, more than I could ever imagine.  My materialism instantly vanished, I had no desire for anything.",
  "What I experienced that night was a classic Near Death Experience.  The only difference was that I never got Near Death. All the after affects of my experience were nearly identical to those who actually almost died.  I am infinitely thankful to these sacred mushrooms for forcing me to realize my ignorance.  Use them wisely.</p>"
 ],
 "year": "2003",
 "id": "27407",
 "gender": "Male",
 "views": "3522",
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": ""
  }
 ],
 "submissionDate": "2005-08-25T07:00:00.000Z"
}
