{
 "title": "Deep Depression",
 "author": "malfunkshun",
 "citation": " malfunkshun. \"Deep Depression: experience with Alcohol & Methamphetamine (ID 27434)\". Erowid.org. Oct 10, 2003. erowid.org/exp/27434",
 "substance": "Alcohol & Methamphetamine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "Methamphetamine",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>A friend of mine showed up at my apartment one night while I was pretty drunk.  He had some crystal meth and wanted to do some.  I said go for it, and as a matter of fact, let me try some.  I had never snorted meth before, only a pill here and there so I'd never really experienced speed before.</p><p>Well, it woke me up right out of that drunk buzz.  We did lines every 30 minutes or so for about 4 hours.  By this time, I wasn't drunk at all, and I was feeling pretty good.  The sun was coming up, and my friends had plans to go see some other friends of ours and I was going to go with them.  As I was getting ready, I started to feel sick.  After a while, I realized I wouldn't be able to go.  They left, and all day I was sicker than I'd ever been before in my life.  I almost choked on my own vomit, I swear I was scared there for a second that I was going to die because I couldn't breathe.  It was like getting the wind knocked out of you but it lasted for about 15 minutes.  I finally recovered enough so that I wasn't puking, and went to sleep. </p><p>The next day, I was extremely depressed.  I was crying all day long, I mean boo-hooing, which is REALLY unlike me.  I thought something was terribly wrong with me and even dialed some help numbers and talked to some counselors.  I felt like killing myself.  I got through the day somehow and finally went to sleep.  The next day, I had a lingering depression, but nothing like the day before.  I don't know if it was the speed and the alcohol combination that caused such horrible aftereffects (possibly the vomiting was) but if just doing speed was the cause of depression like that, I'm never doing it again.</p>",
 "year": "2003",
 "id": "27434",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-10-10T07:00:00.000Z",
 "views": "25090"
}
