{
 "title": "Unprepared",
 "author": "timmy",
 "citation": " timmy. \"Unprepared: experience with Mushrooms - P. cubensis (ID 27444)\". Erowid.org. Oct 10, 2003. erowid.org/exp/27444",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "140 lb",
 "report": "<p>This is a report of my 2nd and most intense trip. After reading quite a bit about mushrooms I decided it was something that I wanted to explore. So I learned how to grow them and ordered spores and about 6 weeks later I had a small bag of 7 dried grams ready to eat.</p><p>My parents had gone out for the night and I decided to stay home and trip alone. I have to say I had no idea what I was getting myself into. I assumed I would just hang out and enjoy a nice trip and listen to some music. I was wrong. 30 min. After taking them I started to feel extremely uncomfortable and afraid. I tried to watch a comedy show to lighten my mood, but I couldn't concentrate. I felt like I was going to pass out....but this was because I was so afraid of what I was feeling that I felt dizzy. So I laid down on the floor and stared at the ceiling. The ceiling was moving like liquid. Bending and melting like it was alive. I tried to enjoy what I was experiencing but I couldn't. I started to get really scared and I wanted the trip to stop. I freaked out a little bit and flushed all my mushrooms down the toilet and threw all my growing cakes in the trash.</p><p>I went to my room and tried to sleep it off. I got under the covers and closed my eyes.....it's hard to explain the fear I felt....it wouldn't stop. When I closed my eyes I saw violet balls....like little cells multiplying and heard whining sounds. I got out of bed feeling miserable and made myself throwup to get the shrooms out of my body....but it was too late....they were already digested. I felt like I was in the worst hell that I could ever imagine. It's hard to explain exactly what was so hellish about it....all I can say is that I felt like I was on the verge of insanity and I wanted to cry. I decided I had to get out of my house. I called my friend and told him my situation and that I needed help. So he came and picked me up and took me to his house.</p><p>When I got there I felt so much better and while I was in his room my trip kept intensifying. His carpet was alive and moving. Bending and melting and growing. I started to feel like I was understanding everything. It was so incredible that all I could do was laugh and giggle. I felt like there was no difference between my friend and me and my mom....or anybody. No difference between male or female. My house or my friends house. It was all the same. I felt like we were all these cells in one organism working together according to a pattern. I remember telling my friend that I was completely enlightened and also insane at the same time. When I tried to think about death, it didnt' make any sense to me.....I felt like there was no escape from life. I also realized the importance of relationships and communication. The way we relate to each other seemed to be crucial. I know that seems obvious....but when you experience it on mushrooms.....it blows you away. I have never experienced so much in one night. I rose from the worse hell I have ever experienced to absolute enlightenment.</p><p>The only bummer is that you can't bring it back with you. You dont' stay enlightened. It's just a memory now. I would say to anyone wanting to use mushrooms to make sure you are in a place where you feel good. Be with a close sober friend. That's absolutely crucial. The hell that you can experience on mushrooms is nothing to play around with.</p>",
 "year": "2003",
 "id": "27444",
 "gender": "Male",
 "timestamp": "2003-10-10T07:00:00.000Z",
 "views": "8651",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
