{
 "title": "Listening to the Muse",
 "author": "Hailstorm",
 "citation": " Hailstorm. \"Listening to the Muse: experience with Cannabis (ID 27470)\". Erowid.org. Oct 10, 2003. erowid.org/exp/27470",
 "substance": "Cannabis",
 "bodyweight": "200 lb",
 "report": "<p>I have a theory, that cannabis doesn't just get you high, it's a connector - it places us firmly in the world of the mind, places us in a strange world half between sleep and waking. A place where the subconscious, that place we dream in can seep out and emerge, and bring its beautiful results.</p><p>One experience cemented this for me.</p><p>I've always been an off-and-on pot smoker, mostly because the rest of my family is a gaggle of big giant potheads, and I was dragged along for the fun. I don't, say, get high every day, but a nice stone once a week or so just seems so right, like the period at the end of the sentence, the good ending at the end of the story. It was nice, it made me happy for a bit, I got a good night's sleep every once in a while. It wasn't a transcendental thing until this happened.</p><p>It was fall, sometime before halloween, right when the cold air and the smell of dead leaves hammers it home that winter is coming. I was bored, as I usually was, and unlike some people I have no problem with getting stoned alone. I had a joint I had saved from a few nights ago (I roll like crap. I love my pipe.), and thought, sure, it should make things interesting for a while. It was late, I had cheetos, I had music, and so I smoked the whole thing and sat back on my bed waiting to be taken away.</p><p>WHAM.</p><p>Pot, for me, comes on slow. Due to my weight and a crazy resistance to drugs, I either have to smoke a lot of it or wait a bit to get a good stone on. The first sign, then, that this was not my usual trip was the fact that it did not come on slow. Fast, hard, hitting me like a fireball. I go through a brief period of paranoia when I get stoned, and that passed far too quickly. And then, past the usual things that constitute a good stone for me, I broke through the ice and was dropped into the sea that this was.</p><p>I could hear my subconscious, I could lay back and see the half-formed, newborn dreams that scream and screech constantly in the back of every human mind. I could open my mouth and just speak, speak to the air and the ceiling and the winter and spin tales of incredible complexity and power, emotion, plot, talk and talk until my voice died, as my mind never would. This was the wellspring of imagination, and right then I felt a Muse on my shoulder, felt like I had been taken to a semi-mythological place where I could weave world from slips of imagination.</p><p>Two hours. I lay like that, right like that, on my bed for that long. I didn't have the opportunity to put in the music or eat those cheetos, just lay there, open-mouthed and whispering, listening to the neverending sprawling story of my unsconscious, written in words, dreams, images so powerful and real that they could hardly BE real. I have always been a writer, a poet, but there, in that place I felt the real onset of genius, like some sort of disease, creeping slow and inexorable into the cracks and crevices of my conscious mind. A dam had been broken, and the water had gotten in.</p><p>Of course, sometime in the next hour I finally passed into real sleep, dreaming dreams so deep and profound they escape memory. If I was ever a writer before, here I am. I don't think I'll ever forget those long hours, laying on my bed, listening to the Muse.</p>",
 "year": "2002",
 "id": "27470",
 "gender": "Female",
 "timestamp": "2003-10-10T07:00:00.000Z",
 "views": "14204",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
