{
 "id": 2749,
 "title": "Another Life",
 "date": {
  "submission": "2000-06-19T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "180"
   },
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "0",
   "amount": {
    "unit": "1:00",
    "quantity": "T+"
   },
   "administration": "3 hits",
   "substance": "smoked"
  }
 ],
 "report": [
  "Well, I now have 2 trips to report. One from last week, and one from last night. First the week old report.",
  "As before, I ingested DXM (last time I used 150mg, this time I used 180mg) about 1 hour before smoking the leaves.",
  "Same music as before, started smoking at about the same point on the tape. This time, after 2-3 'hits', I saw a red neon wireframe large cat, like a panther. After the next hit, I rember saying outloud, 'Oh my.' I seemed to rotate forward about 30 degrees. Then off, to my right periphery, I saw a large plant with large eliptical leaves swaying to the music. This 'vision' lasted for about 15-20 seconds.",
  "I decided I wanted to experience this again, so about 10 minutes later I took another couple of 'hits.' Big mistake. Aparently I am only allowed one try. This may not make sense, but it is now my personal law; no double dipping. The result of the second try really bummed me out. I'm not saying this law applies to others. Just me.",
  "OK, now for last night.",
  "I ingested 150mg of DXM (believing that possibly part of the bad part of the previous trip was due to too much DXM).",
  "Same music as before. Same time on the tape as before. Just before lighting up, I half jokingly asked (maybe to myself, I don't know) for a fine experience, and stated that I would not do it more than once. I lit up.",
  "Wow.",
  "Before I try to explain what happened, and I'm not sure I can, I need to define a few terms. I used to believe that what I called 'me' was somehow enexorably connected to my life experiences. That is, without my experience, that which I call 'me' would not exist.",
  "I not so sure anymore.",
  "Let's call person 'A' that which I normally associate myself. Let's call person 'B' whatever constitutes the core existance of 'me', but with a different life experience.",
  "Ok, now for what happened. After the second toke, I felt as though my body was being compressed by an invisible fluid. Then my whole body rotated back, like tilting back in those power car seats. I don't know exactly what happened next. I remember talking outloud. I was excited.",
  "Some time later, maybe 10 seconds, I remember being somewhere. And I don't mean I imagined being somewhere. For all I could tell, I really was at this place, living a life, and I had no recollection of person A. As person B, I was talking out loud. Something like ' I'll be right there, I just want to look at this.' The place was kinda normal and kinda strange. The light was as intense as the early morning, but all the shadows were small to non-existant. Like those at meridian transit.",
  "About 5-10 seconds later, I slowly became aware of person A's existance. I don't think words can describe my astonishment when I realized that it was person B that was the etherial person and person A was the grounded person.",
  "For the next 5-10 minutes I was stupified. As I came back, I began to think about 'going there again.' It was hard to keep my promise, but I did. And I'm glad.",
  "I love this plant.",
  "I could imagine dying to protect this plant from the Spanish 500 years ago."
 ],
 "erowid": {
  "id": "1907",
  "citation": " Anonymous. \"Another Life: experience with DXM & Salvia divinorum (ID 1907)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1907",
  "substance": "DXM & Salvia divinorum",
  "views": "6744"
 }
}
