{
 "title": "Day Long Anti-Anxiety",
 "author": "Bio Fanatic",
 "citation": " Bio Fanatic. \"Day Long Anti-Anxiety: experience with Sceletium tortuosum (ID 27527)\". Erowid.org. May 3, 2006. erowid.org/exp/27527",
 "substance": "Sceletium tortuosum",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Sceletium tortuosum",
  "(gel tab)"
 ],
 "report": "<p>Have tried it on 3 different occasions, all consumed as a ground brown powder weighed and placed into gel-tabs.</p><p>100 mg:  It takes almost an hour for effects to reach their maximum.  The experience at its fullest consists of a light 'detached' feeling, as if rather than a muscle relaxant, this would be a 'mental relaxant', sweeping away the tight knots of worry from a person.  This effect is mild at this level and could easily be ignored.  Time slows in a somewhat classic psychedelic sense, but this too is easily overlooked.  I can feel a warm, contented glow inside my head.....The highest chakra in my body receives this energy.</p><p>Cannabis and a bit of red wine are _significantly_ potentiated.  Lovely combination!</p><p>200 mg:  Same as above experience, except notably stronger.  Processing complex patterns/thoughts takes just a little bit extra effort.  I desire only to relax physically.  Life problems can be considered without getting to wrapped up in small inconsequential details.  I wouldn't say that I was thinking in an impersonal/objective sense, rather, there was increase empathy/understanding feelings towards myself.  Sure I blow it sometimes, but looking at myself with empathy as a whole....I'm a damn good person...just need some further fine-tuning....</p><p>3-400 mg:  The overall 'feeling' is becoming familiar.  Same as other times, however, this time it is becoming difficult to ignore the effects.  I feel a little 'fuzzy' in an empathic sense.  I don't really feel like talking or going introvert either.  It would be nice just to 'be' in a warm cozy place, or in the silent company of a loved friend.  I'm feeling some lateral eye-wiggle, but it bothers me not much.</p><p>What makes this higher dose so profound is that I feel the 'contented' 'mental-relaxant' effects for the rest of the day.  Nothing worries me, although I am perfectly capable of considering and working through any problems/tribulations that rear their heads.  Life changes and difficulties are seen as routine and welcomed, rather than disruptive or bothersome.</p><p>I intend to experiment with increased doses in the future.  A solid gram seems like the next likely place to go, and with that amount, might expect truly _profound_ experiences.</p>",
 "year": "2003",
 "id": "27527",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-03T07:00:00.000Z",
 "views": "14871",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Sceletium tortuosum",
   "form": "(gel tab)"
  }
 }
}
