{
 "title": "I Saw Jesus in the Mirror and Levitated",
 "author": "Mikey",
 "citation": " Mikey. \"I Saw Jesus in the Mirror and Levitated: experience with Cannabis, Venlafaxine (Effexor), Mirtazapine (Remeron) & Amphetamine (Adderall) (ID 27600)\". Erowid.org. Nov 22, 2004. erowid.org/exp/27600",
 "substance": "Cannabis, Venlafaxine (Effexor), Mirtazapine (Remeron) & Amphetamine (Adderall)",
 "bodyweight": "135 lb",
 "report": "<p>My name is Mike and would like to share about my experience which had me question my entire existence.</p><p>So far I have only hallucinated three times... all of which were terrifying, yet interesting and valuable.  One of my experiences was from DxM, and the other two occurred after smoking up.</p><p>One thing I would like to add is that I have been diagnosed with Obsessive Compulsive Disorder for several years and have been taking anti-depressents prior to the 'trips.'</p><p>My first experience was around two yrs ago and I had just started smoking pot that summer.  I had taken a few puffs off of an entire 1/8 rolled up in a philly and coughed myself fucked up.  Instantly, I felt something coming over me... like dark clouds were starting to form.  There were four of us outside, around 7:30, up on a hill near some trees.  I was probably the newbie because I kept passing when the blunt got back to me in the rotate.  I had never felt my head trying to tolerate these chemicals so much at one time and I began to get paranoid.  Next came the hallucinations... except I think it was more about how I perceived everything around.  I was staring at the trees and the sky when I noticed 'something' was familiar.  Like I had seen the painted image before somewhere in a dream I had when I was only three.  The next thing that freaked me out was the simple fact that I had the ability to move my arm in any direction of my choosing.  By the time I decided to look at my hand... I couldn't believe I could move my head to look at my hand!</p><p>I was SO caught on the idea that I could do things naturally... and my thoughts were moving so differently from what I 'thought' I was seeing or 'actually' was seeing that sense of depth or time was completely out of question.  My thoughts were overlapping and I was soon under the illusion that another force, other than my own, was moving my body...</p><p>So time marches on and I enjoy smoking herb up until my current, freshmen, yr at college...</p><p>I was sitting in a buddies' dorm and enjoy a bong rip and a bowl pack.  There were about six to seven people in a small sized dorm, A Perfect Circle playing in the background, the smell of chronic is everywhere, and we were all enjoying ourselves. Again... the strange sensation of something familiar comes over me and my head starts to wander in directions i dont recall moving them to.  I freak out, go back to my dorm, and settle down.</p><p>Smoking experiences continue to stay normal until another week later... me and my roomate smoke a few bowls and the familiar sensations start to occur.  So far, I characterize the thoughts as: 'things that I think about when I'm high.'  It seemed apropriate since I kept thinking to myself 'You thought this the last time you were high.'</p><p>Something kept repeating in my head, almost like my compulsions related to my Obsessive Compulsive Disorder, except compulsions are acted out. </p><p>Next came the mother of all trips... The greatest envisionment I have seen which was slung through the reflection of my own body.</p><p>I was recently put back on Adderall, and Remeron for eating and sleeping disturbances caused by the Adderall, over a small school break.   So... everything amounted to my daily 300mg Effexor capsules, 30mg of Remeron, and 20mg of Adderall.</p><p>The first day back from the break, I decided to pack my roommate a full bowl pack in his bubbler which gave us both 7-8 good hits.  Instantly, I was in for it.  The part that really made it fun was that I knew it was gonna be bad.  My roommate sat at his computer and started playing trippy techno music mixed with reggae and new-age and I was just sitting at my desk looking back and forth between his computer screen and mine.</p><p>Nothing was comprehending correctly, and my heart was starting to beat faster.  I decided to lay down and had the most drastic and sudden burst of hallucinations.  At several points, I felt half of my body being levitated, and the other half totally numb to all consciousness.  At other times I felt parts of my body being pulled towards the earth while the others were being pulled away by some sort of light.  Forces coming from every direction... visions of demons and dragons pulling my body in one direction... and angels pulling from the other. </p><p>The final, and most overwhelming visual, was the face of Jesus Christ through a mirror.  I went to the bathroom to try and cleanse my eyes, and look at myself to see that I am still alive and well.  Next, I thought I looked like Jesus Christ as I was wearing a white shirt, have a small beard, and have bright blue eyes.  At that moment, as though a demon possessed me, my head jerked to one side and a voice told me I was Jesus... Another voice jerked my head to another side and told me that I was the devil.  Through my fiery bloodshot... yet shimmering bright blue eyes, I believed every thought and was convinced that every human being are four entities of power coming from four different directions.  I felt as if I was given a gift and could see 'through' the lines of existence by percieving my thoughts in this horrid and confusing manner.</p><p>Finally, I find my way back to my bed and a thought comes over me that at 4:20 my trip will end... and thats when it did.</p>",
 "year": "2003",
 "id": "27600",
 "gender": "Male",
 "timestamp": "2004-11-22T08:00:00.000Z",
 "views": "8332",
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "8 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
