{
 "title": "Floating Weightless though Hyperspace",
 "author": "Fermy",
 "citation": " Fermy. \"Floating Weightless though Hyperspace: experience with Dimenhydrinate & Cannabis (ID 27651)\". Erowid.org. Nov 9, 2007. erowid.org/exp/27651",
 "substance": "Dimenhydrinate & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   " T+ 0:19",
   "100 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   " T+ 3:20",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Mindset: Everything generally ok in my life. Not under any stress or anything.</p><p>Setting: My basement in front of my computer is where I started the experience.</p><p>3:40 pm: Took 4 tablets of 50mg Gravol, total of 200mg. Ate them with water.</p><p>3:55 pm: Sitting here on computer, feeling a little different already, but not buzzed. Just like something is changing inside me. Gonna go walk upstairs.</p><p>3:59 pm: While upstairs, I thought fuck it and took 2 more tablets. Now there are no more gravols in my house. Hopefully I experience something at least minimal and hopefully positive.</p><p>4:10 pm: Getting hungry, so going upstairs to find some grub.</p><p>4:25 pm: Just finished eating ice cream, turned on my cd player, listening to hip hop. At this point, no effects are felt. Starting to lose faith in this drug.</p><p>4:55 pm: Started to feel different about 5-10 mins ago while making myself some grilled-cheese sandwiches.</p><p>4:58 pm: Having trouble focusing eyes on some things, including my computer monitor.</p><p>5:00 pm: Getting up from my computer chair to turn the music down a bit, I felt very heavy and weird.</p><p>5:30 pm: My friend came over. At this point I was feeling very strange. Very light and weightless. I noticed my volume of my voice was a bit lower than usual, but nobody noticed. Was still able to talk to family and my friend without them wondering what was wrong. One of the stranger sensations I have is that my eyes feel sleepy and that I just wanted to sit down or lay down, but I wasnt tired, just my eyes wanted to close all the time.</p><p>5:45 pm: My friend and I left my house to go for a ride in his car. As we were driving it was snowing harder and harder (I live in the north, today was the first snowstorm and its only mid-October), but with no wind. The snowflakes falling felt like we were traveling through hyperspace, especially when my friend was going over 100 km/h. Very trippy ride, very fun.</p><p>Later on that night we smoked some cannabis, but it wasnt until I started noticing the effects were going away(around 7:00 pm). But as soon as I smoked a few hits of the weed pipe, I was getting some of the effects of the gravol coming back. The rest of the night I was mostly just high on the cannabis, but after smoking lots of it, my eyes felt tired, and sometimes they would close shut without me noticing, but I wasnt asleep, I was still aware of my friend talking to me, and I was dreaming being in his car like as if I had never closed my eyes. Everything was so real and I was able to reply to him. I was still aware of everything around me, but sometimes I would have weird random thoughts while he was talking and it would confuse me and I would reply to him, but it wouldnt make sense to him. I then realized that I was having closed-eye dream or visuals that was making me think that we were talking about something else, that doesnt make sense. Its hard to explain really, but I smoke cannabis at least once a day, and its the first time this happened to me, so I know it was just the gravol making me imagine those thoughts (even though it started to wear off), but smoking cannabis just makes the gravol buzz come back in a different strange way.</p><p>In conclusion, this whole gravol experience wasnt a bad one, nor a good one. I kinda enjoyed the weightless buzz it gave me, but didnt really experience any hallucinations (that I remember). I would try this again but next time on a higher dose (maybe 8  10 50mg tablets instead of just 6 tablets).</p>",
 "year": "2003",
 "id": "27651",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-09T08:00:00.000Z",
 "views": "9314",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ]
}
