{
 "title": "The Integrity of the Hedonistic Imperative",
 "author": "Jameszzdalton",
 "citation": " Jameszzdalton. \"The Integrity of the Hedonistic Imperative: experience with MDMA (Ecstacy) (ID 27683)\". Erowid.org. Oct 19, 2003. erowid.org/exp/27683",
 "substance": "MDMA (Ecstacy)",
 "bodyweight": "160 lb",
 "report": "<p>11pm, October 18, 2003.</p><p>I havent eaten all day, mostly because I was sleeping all day. This isnt my preparation; this is me in the wake of a night with an eighth of mushrooms and one pill of ecstasy, staggered so that the mushrooms heaved me over the threshold of midnight and the ecstasy carried me into the dawn. I was raised by an English professor and a business manager of IBM who both knew and demonstrated that therapy was guidance by compassion and example. Luckily, my first time with ecstasy brought me in the company of similar elk.</p><p>\tDown a flight of stairs and into a black-lit room. The mushrooms imparted their usual blessed logical freedom, and with a new friend who is obsessed with fantasy and computers we walked around our large campus, discussing the dilemma of identity relinquishment. If the supermind asks you to join, do you press the buttons for self-annihilation, your last decisions before supposed transcendence? So, we pondered the fantastic rate of growth of human society, the god Internet, and the titans who still battle for freedom and good: the Center for Cognitive Liberty and Ethics, Erowid, MAPS, Suzuki-Roshi, Hemp Growers of America.</p><p>\tThen, upon returning from the cold nights air to the warmly black-lit room, a 21-year-old filthy rich porn-business-genius who stays in our ivy-league university because he cant stand the air/breath in Los Angeles found himself in a compassionate mood, partially because of the E hed already taken, and offered me a free pill. My first time.</p><p>Earlier that night, before the mushrooms, I had finished writing my newest metal song on an Ibanez electric, and the bliss of creative effort had left me with a buzz I wanted to share; thus, the flight of stairs.</p><p>\tI, like most, am afraid of MDMA. No doubt many would-be psychonauts of the mid sixties became fully dissuaded from the prospect of sampling LSD because of the disturbing, ludicrous accounts of it breaking chromosomes and bringing swift death. MDMAs reputation for eating holes in the brain is in a similar vein, just scientific enough to scare the citizenry into reaction, and enough of a risk (like going to hell), to coerce otherwise logical and intelligent individuals from partaking. Yet, the porn-lord and the fantasy kid, along with a drumming whiz and a biology major whose ex-girlfriend is also an ex of mine, provided the right therapeutic touch. Compassion and example.</p><p>\tTwo pieces of Orbit gum proved wildly helpful, along with occasional massages, and generally exciting conversation. I felt very energetic. Like Havelock Elliss and Huxleys caveats, I do not consider myself a particularly psychedelic-vision susceptible individual. As our discussion and thoughts would descend down dark roads (is the governments antagonistic attitude towards chemically-induced [as opposed to?] psychoactivity actually intended to foster its growth?), my visceral mood did not follow them. This to me is the wonder of ecstasy and its true benefit. Waves of pleasure continually encouraged me to proceed with my thoughts. After this night I came a large step closer to believing the premise of the Hedonistic Imperative: that free of the specter of pain and torture, humanity can advance, progress, and create more quickly, healthily, and fully, than when haunted by it.</p><p>\tSurprisingly (to me), I realized that night that I was in love. A girl up a few flights of stairs, a theatre major, had been occupying my heart like shadows on a wall for the past few months. On ecstacy, she assumed corporeal form and my heart swelled. I went upstairs to see her, mid-E-trip, with the expressed support and encouragement of my entourage. I entered her room at 4 in the morning, waking her up, and her beauty and charm lived up to all my imagination. With a live Tori cd on loop that had been playing all night, she related to me how she had smoked marijuana for only the third time in her life that night, and was still recovering. I expressed my feelings, how she engrossed me, made me laugh, and proved herself to be the most interesting female I had ever met. She has a boyfriend; but I knew that. She, at this point, intends to stay with him. Im still in love, for really the first time in my life. But through all these drugs, there is not confusion about what theyve revealed. Careful attention, supportive and thoughtful company, and secure environments have proved for me to be the keys to enduring and benefiting from ayahuasca, LSD, mushrooms, ecstacy, marijuana, opium, and salvia divinorum. This seems to be the consensus of the psychoactive world. I would like to now invoke the Psychonauts Prayer: May you not trip in vain.</p>",
 "year": "2003",
 "id": "27683",
 "gender": "Male",
 "timestamp": "2003-10-19T07:00:00.000Z",
 "views": "13962",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  },
  "1": {
   "time": " T+ 3:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
