{
 "title": "A Moral Dimension?",
 "author": "Rotational Symmetry",
 "citation": " Rotational Symmetry. \"A Moral Dimension?: experience with Salvia divinorum (21x extract) (ID 27685)\". Erowid.org. Jul 8, 2006. erowid.org/exp/27685",
 "substance": "Salvia divinorum (21x extract)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Salvia divinorum",
  "(extract)"
 ],
 "report": "<p>During a recent Salvia Divinorum session, I experienced a 'moral' or 'ethical' dimension that caught me quite unaware. I will try to contain the information below to what is new, rather than attempting to detail every nuance of the experience, thereby repeating information available elsewhere.</p><p>I am a fairly seasoned neuronaut, who has assayed a wide variety of psychedelic and entheogenic chemicals over the past 15 years or so. I had experienced Salvia twice before my most recent voyage, in the form of highly potent extract, and I still consider myself a Salvia neophyte. This was my first Salvia experience without a sitter.</p><p>In a quiet, dim room, I first did some deep breathing meditation to still my mind, and prepared a single, small dose of leaves saturated with a 21x extract in a clear glass pipe. I addressed the plant, telling it (her?) that I wished to approach the experience with a respectful attitude, and that I would try to be open to anything it had to show or teach me. I said that I was particularly interested in any insights regarding time and space. I expected a rather 'ontological' experience. What I got instead was a highly 'moral' one, completely surprising me. I smoked and lay back still with my eyes closed. Over the next half hour or so (I think), I smoked twice more.</p><p>Among the things I most vividly remember, I 'saw' (not a hallucination in the ordinary sense...perhaps 'perceived' is a better term) my home and a group of other homes arrayed in a kind of arc. I realized these were homes in the same income group as me...I was perceiving some sort of economic/demographic image, homes of a similar level of affluence and material security traced as a pattern. I could feel the desperation, fears, and insecurities associated with making a living, eating, the whole material grind of life...The different income groups had different levels of misery, perhaps, but there was an almost universal sense of anxiety shared by all...the fundamental insecurity that is part of the human condition. Will I get enough to eat on this hunt? Will the harvest be enough this year? Will I lose my job at the office? All through history, the same nagging insecurity, affecting everyone at all levels.</p><p>I felt insecurity in myself in the form of an imperfection, as if part of me was missing or there was perhaps a hole in my side. The rickety, cobbled-together nature of humanity, always prone to poverty or disease, failure or unhappiness. I felt it very acutely in myself, this sense of being imperfect and unworthy of something. A sense of being somehow unclean. At this point, I became more aware of the 'Salvia spinning,' and some sort of consciousness just beyond the circle of the spinning, a bit out of reach. I wanted to break through to it, to be with it, but somehow I couldn't, and somehow I was 'impure.' I thought, 'Can't we just do what we want? Can't I be free? Why am I trapped here, unable to go where I want?' The presence of the being became situated more clearly to my right, and I also felt an answer to my question. I was being held down by these ties stretching to my right. They were the bonds of family, of society, of being 'good,' thinking of the community, others, the health of the planet. They were somehow noble, and I felt I should be tied by them; that to ignore them was wrong. The ties deepened, and suddenly I saw our whole world as a kind of leaf (a salvia leaf?) and the ties were the thickening of the leaf into a stem, which connected it to the plant as a whole. We are not free in this world, I felt, and it is our natural course to be connected to the stem, to bear the burden of 'doing what is right.' And this is as it should be. It was OK not to be 'liberated' or 'free'...I should be here, rather than selfishly flying away. As the experience came to a close, I perceived a series of beautiful images of the rural New England hills and fields of my youth, which was a very comforting way to come down.</p><p>The highly moral tone of the experience was, as I noted above, unexpected. I had expected a more ethically neutral exposition on the nature of reality, or perhaps direct contact with an entitie(s) that I had perceived on an earlier Salvia experience. Here, there was an entity, but it remained tantalizingly out of reach. And the sense of right and wrong was very, very strong. It seemed more important than any perceptual/hallucinogenic/'mind candy' effects.</p><p>Although the experience was pervaded by a feeling of myself as impure or imperfect, when it was over I felt no lingering negativity, guilt, or bad feelings, but was bathed in a kind of clear afterglow. I did take away the feeling that I need to be a 'better' person somehow, and that I need to find a way to be less self-centered and more nurturing. I will strive to put these lessons into practice.</p>",
 "year": "2003",
 "id": "27685",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-08T07:00:00.000Z",
 "views": "3820",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
