{
 "id": 277,
 "title": "Set Blender to Full Speed!",
 "date": {
  "submission": "2007-01-07T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shroom Boy",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "It was Friday night. My friend and I went to a rave with getting high in mind. We were planning to roll, but we couldn't find any. The nitrous guy is a very reliable source for drugs around here. So we asked him what he was selling this night (besides balloons). He said he had some shrooms and ketamine. We decided to try some shrooms. We bought 3 grams each. My friend gave one gram to our other friend.",
  "At about 10:30 I ate my first gram. About a half hour later I was feeling slightly stoned. I ate another gram soon after. Probably 10 minutes later I start to feel very stoned and VERY dizzy. I went to go sit down on the wall and started talking to these guys. Eventually, they asked me if I was on anything and I told them I had just taken 2 grams of shrooms for my first time. This guy started to give me a light show, it was so cool. The glow sticks had this glow AROUND them and it was hard to focus on anything.",
  "The next thing I know I'm dancing, it felt very cool, my body was sort of numb. Then I met up with my friend, he had ate his shrooms at the same time I did he was very shroomed out too. We sat down on the wall next to this guy and his girlfriend. They were dressed as vampires (It was a holloween rave). I was looking at the roof, it was breathing and looked like it had some sort of thing on it.",
  "Then someone spilled some Nerds candy ALL over the floor. It was sort of scary the Nerds were multiplying like bacteria and crawling all over me. I eventually calmed down. Then the Nerds started to dance. They were like vibrating and swirling in with the floor. It was so cool. It seemed like I was tripping for like 10 hours. The visuals weren't intence, they were only there if you looked for them. The numbness in my body was sort of uncomforable. But it was sort of welcomed too, it was like I was very stoned, but with visuals.",
  "Then, out of nowhere, I'm sober and back to reality, it was very shocking and unexpected. It was also depressing because I actually saw how trashed the venue was. I wanted to leave. So I bought some more shrooms and waited for my friend. It was a very good experience, I will probably shroom again. I would recomend shrooms to people, it was an overall good experience for me."
 ],
 "erowid": {
  "id": "10385",
  "citation": " Shroom Boy. \"Set Blender to Full Speed!: experience with Mushrooms (ID 10385)\". Erowid.org. Jan 7, 2007. erowid.org/exp/10385",
  "substance": "Mushrooms",
  "views": "3211"
 }
}
