{
 "title": "Strong, but Good Strong",
 "author": "kidfun",
 "citation": " kidfun. \"Strong, but Good Strong: experience with 5-MeO-MiPT, LSA & Cannabis (ID 27707)\". Erowid.org. Jul 23, 2004. erowid.org/exp/27707",
 "substance": "5-MeO-MiPT, LSA & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  "DOSE: T+ 0:00",
  "5.0 mg",
  "",
  "5-MeO-MIPT",
  "",
  "",
  "1 hit",
  "oral",
  "LSA",
  "(blotter / tab)",
  " T+ 1:00",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>5-meo-mipt is a very speedy chemical.  It comes on within the first couple minutes of ingesting and continues to climb.  This aspect of the chemical serves as a good means of lowering the amount of nervous anticipation which occurs after ingesting other psychedelics such as LSA.  The combination of the two is very stimulating. </p><p>T+15 minutes:  5-meo-mipt begins to come on.  Speedy characterisitics such as finger tapping are noticed.</p><p>T+1 hour:  Smoke one bowl of cannabis.  Slight visuals begin to come on.  As with most research chemicals i've tried the effects are greatly enhanced my smoking cannabis.  The effects of LSA (one hit blotter extracted from HBW ~ 4 seeds) are intensified by smoking as well....talking is possible but i am entertained enough to sit and watch.</p><p>T+2 hour:  smoked again.  LSA coming on much more.</p><p>T+3 hour:  smoked again.  very entertained.</p><p>Despite great levels of nervous energy produced by the mixture of both chemicals nothing great happened during this period of time.  I was content to sit on the couch and watch TV just thinking.</p><p>T+ 5 hour:  walked home about a half mile with slight difficulty and extreme paranoia</p><p>next morning:  woke up very disoriented partially due to lack of sleep and partly due to events of the previous night.</p><p>This was a fun 'safe' feeling combination.  I try not to come off like this is what i do to unravel the mysteries of the universe.  I don't take doing drugs seriously in the sense that i don't think they help you achieve any greater sense of enlightenment.  In the sense that this experience was very entertaining i would classify it as positive.  There were no great introspective moments just mostly euphoric tactility mixed with slight visuals.</p><p>As a side note the LSA was prepared using the naptha, ethanol extraction widely available on the internet.  Moderate results were obtained with use of 250 seeds resulting in 30 hits of blotter with an equivalent dosage of 4 seeds a piece.  This points to an approximately 50 percent yield which could have been increased with greater patience on my part when extracting.</p>",
 "year": "2003",
 "id": "27707",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-23T07:00:00.000Z",
 "views": "12532",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 mg",
   "administration": "",
   "substance": "5-MeO-MIPT"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": "1 hit",
   "substance": "oral"
  },
  "2": {
   "time": "LSA",
   "amount": "(blotter / tab)",
   "administration": " T+ 1:00",
   "substance": " repeated"
  }
 }
}
