{
 "title": "Good for Work",
 "author": "Mike",
 "citation": " Mike. \"Good for Work: experience with Kava (ID 27738)\". Erowid.org. Dec 31, 2007. erowid.org/exp/27738",
 "substance": "Kava",
 "bodyweight": "180 lb",
 "report": [
  "<p>Recently I've experimenting with various recipes and preparations of kava to see which one is the most effective. I'm an extremely experienced drug user and I know when a substance has a real effect on my mind and body versus a placebo effect. I've been using Twinlabs Alvita brand kava tea bags, so the potency is defintely not the same as fresh root, but today I tried a slight variation of Murple's kava brew recipe and finally experienced some 'above threshold' effects.",
  "In the short time between school and work today I decided I needed to chill out a bit, so I went home and broke out the kava. I tore open eight teabags and emptied their contents into a medium saucepan along with 1 cup water and 1/2 cup 2% milk. Then I heated the mixture on the stove for 6 minutes, stirring constantly. (note: heat on low or medium, do not let the mixture boil.) I then took it off the stove and poured it through a fine strainer into a large mug, squeezing the excess liquid out of the root muck. I added honey until it was tolerable to drink and gulped it down on my way to work, a gas station about 15 minutes away from my house.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "About ten minutes into the car ride I noticed that I was driving faster than usual (obviously not a good idea to drive on this stuff) and was feeling generally carefree. I finished my mug and by the time I arrived at work I had a slight 'buzz' going. It's not a buzz in the alcohol or pot sense, but more like maybe .25mg of xanax with less drowsiness. Three of the six hours of my shift flew by, and I felt upbeat, calm, and outgoing without the kava having much of an effect on my memory, alertness, or coordination. By the fourth hour I was back to normal, no noticeable after effects at all.",
  "This is definitely a recipe that I will use in the future when I need to chill out without getting messed up. It's perfect for high-stress situations in which I still need to be able to focus.</p>"
 ],
 "year": "2003",
 "id": "27738",
 "gender": "Male",
 "views": "28976",
 "dose": [
  {
   "time": "0",
   "amount": "8 Tbsp",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  }
 ],
 "submissionDate": "2007-12-31T08:00:00.000Z"
}
