{
 "title": "Nice, Calm Smoke",
 "author": "Sam",
 "citation": " Sam. \"Nice, Calm Smoke: experience with Damiana (ID 27733)\". Erowid.org. Jan 27, 2005. erowid.org/exp/27733",
 "substance": "Damiana",
 "bodyweight": "",
 "report": "<p>I'm a veteran Marijuana smoker, I've been off the plant for over two years now. I've been interested in the 'herbal alternatives' like Salvia and Dagga (as the prospect of a legal high doesn't seem bad), but I haven't got around to purchasing any of them yet.</p><p>Anyway, while browsing through an herbal alternative web-site, I came upon Damiana. This shocked me, because at the time I had an ounce of Damiana in my incense stash. I never knew it was used as a Marijuana alternative, though. Intrigued, I figured that it couldn't hurt to try smoking some and see what would happen. On the site, they compared the effects of the plant to a mild form of Marijuana.</p><p>So, I rolled myself a cigarette of Damiana leaf. I wasn't expecting a full blast THC high, but then again, I didn't know what to expect. I smoked the cigarette. I found it very soothing. If I had to describe the effects, I would say that it induced a feeling of serenity and peacefulness within and around me. I felt like everything was okay. Nothing drastic happened, no hallucinations or stoned feelings. Just a general feeling of calm and well-being. This lasted for about an hour. It was very pleasant and enjoyable. I would definitely smoke it again for a calm, relaxed afternoon/evening.</p><p>I wouldn't suggest this herb for others who are looking for Marijuana substitutes. To me, it's just not comparable at all, and will most likely dissapoint anyone who's expecting to get stoned. As a general smoking experience or Tobacco substitute, it would probably please just about anybody, though. Especially someone who's just looking to relax and have a nice, calm smoke.</p>",
 "year": "2003",
 "id": "27733",
 "timestamp": "2005-01-27T08:00:00.000Z",
 "views": "44044",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(dried)"
  }
 }
}
