{
 "title": "'Feeling a Little Bit Too Good'",
 "author": "Alex Person",
 "citation": " Alex Person. \"'Feeling a Little Bit Too Good': experience with 5-Meo-DIPT & AMT (ID 27740)\". Erowid.org. Oct 21, 2003. erowid.org/exp/27740",
 "substance": "5-Meo-DIPT & AMT",
 "bodyweight": "120 lb",
 "header": [
  "DOSE: T+ 0:00",
  "10 mg",
  "oral",
  "5-MeO-DiPT",
  "(powder / crystals)",
  " T+ 3:00",
  "25 mg",
  "oral",
  "AMT",
  "(powder / crystals)",
  " T+ 5:30",
  "15 mg",
  "oral",
  "5-MeO-DiPT",
  "(powder / crystals)"
 ],
 "report": "<p>Ok, Basically, dont do 5-MEO-DIPT and AMT together. I had done 15mg of 5-meo-dipt the night before, it was a good, a somewhat trippy, good visuals experience. Now it was friday night and I decided to do some 5-meo-dipt again. I took my 1 gram of white powder form 5-meo-dipt and divided it in half and in half and in half and so on till it was about 10 millgrams (yes, this is not accurate, and was one of my mistakes). I took it and felt quite nice. I listened to some music and such, and then about 3 hours after I took it I felt like I had peaked and decided to take some AMT(My first time with this chemical). I used the same divide divide divide techinique till I had approximately 25mg of AMT. I took it, and about a half an hour later I was feeling very very good. I went outside and had cigarette during the sunset, it was truely amazing, one of the best experiences of my life. I looked off my balcony at the field before me and could see and hear farther than any time before. I felt like I had some sort of crazy connection with what was going on in nature. I saw and heard everything in that field. It was great, I could hear all the birds flying around, all the cars in the distance, and the golden cast from the sunset was wonderful. Anyways, I eventually went back inside and watched Lord of the rings for the first time, it was the perfect movie to watch. About 2 1/2 hours later, the movie was over and I felt like the peak had passed. I decided to take 15 millgrams of 5-MEO-DIPT and measured it out in the divide, divide, divide, eye, method. I ate it and within 15 minutes I felt like I was coming up very very very hard. I could tell this was going to be strong. It was still very pleasant however and I put on some Clutch to listen to. I was listening to Clutch and it sounded very odd, shifted down in pitch, this alarmed me but I nonetheless stayed calm as I still felt good. A few minutes later I noticed my heart rate felt very elevated. This was very hard to tell however as my perception of time was distorted. How well could I tell my heart rate If i cant decide how fast time was going?? I decided to find a friend to watch me for the next few hours, and found out all of my friends that were close by had left for a party. Ohh well, no babysitters, and decided to rest on my bed to let my racing heartbeat go down. I layed on my bed for several minutes to try to get it to come down. Keep in mind I never had a negative or really worried state of mind. I just wanted to chill and was actually feeling good. I lay there for about 5-10 minutes and my heartrate felt like it was still increasing. I got worried and decided to call 9-1-1(since i didnt have a sitter). I called and notified them I had taken some drugs and felt 'a little too good'. They sent paramedics and I went to the hospital. This is all very embarrassing, but I feel I have to share it to prevent anyone else from combining these two drugs. They said my heartrate was 170, pretty high. Not quite to where you are likely to die any minute now, but it was clear I had fucked up. I must say to anyone messing with research chemicals, measure accurately, and dont mix drugs. I felt very good the whole time (a little too good maybe), but its not worth it when your heart-rate is 170 and your in a hospital getting heart scans and other tests to see if your healthy. (I ended up being fine however). All in all, I dont know if these drugs are safe by themselves, they might be, but I never gave them the chance to prove it.</p>",
 "year": "2003",
 "id": "27740",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-10-21T07:00:00.000Z",
 "views": "12007",
 "dose": {}
}
