{
 "id": 2776,
 "title": "Precautions for Responsible Use",
 "date": {
  "submission": "2000-06-19T07:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Insomniac",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>I've long had chronic insomnia that the doctors are unable or unwilling to successfully treat.",
  "My personal research into my condition led me to try BDO and GBL to try to alleviate my insomnia. It worked very well and seemed compatible with me. My dosage of GBL for sleep is about 2ml to 2.5ml. I weigh about 200 lbs.",
  "1,4BDO and GBL (and GHB I would assume) are very potent and should be used only by those who are informed as to the proper usage/dosage etc. If it weren't for the people who overdosed and end up in the hands of medical personnel or law enforcement personnel, GHB, GBL etc. would likely still be legal and available in a quality-controlled market.",
  "Use good judgement and common sense when using these. This is not something to do while: operating machinery, at a bar, in a car or in a public place. In addition, precautions should be taken to ensure that if unconciousness occurs unexpectedly that the environment will be safe for the person who falls unconscious. For example it is possible to fall asleep while standing up. If that person falls to the ground will they fall on something sharp or otherwise dangerous?. If they nod off while sitting will bang their head on something? Can you imagine falling like that and finding when you wake up something has impaled your eye or knocked out some teeth or something worse?? This is serious people... watch it!!! If you take this to sleep make sure you are in bed already so that these things won't happen to you.",
  "Speaking of sleeping with this stuff... if you have problems with snoring or sleep apnea this stuff could cause you to injure yourself or possibly kill yourself due to your throat closing up and suffocating you... I know, I almost died from it and was injured. If it wasn't for my dog trying frantically to awaken me I may not have been here to write this. This is very serious. I believe the possibility of blocked breathing to be the most dangerous part of it. If you try this to sleep be very careful with your dose and have a trusted person watch you when you sleep. It may save your life.",
  "I don't want to seem so negative because GBL/GHB is so helpful when used responsibly. My insomnia is now controlled to the point where I can guarantee I will get at least 4 hours of sleep a night. Also because I use it daily for sleep and the fact you should NEVER! mix it with alcohol I chose to quit drinking alcohol. If I do get the urge to mellow out but not by drinking alcohol, I will just take a little GBL. I went from an average of 4-6 drinks a night to about 4-6 drinks a month. That is something my body (and my wallet, wife and kids) is thanking me for.",
  "I strongly believe that this is something for mature adults only... this should not be used by children or immature adults.",
  "There are lingering side effects with overuse of these so moderation is important. I personally found 1,4BDO to have more side effects after taking it everyday for about a month. I then switched to GBL which seemed to have less side effects but I still have to be very careful and use in moderation or I will suffer. I once went to a job interview after using 1,4BDO and was so out of it and forgetful the next day that I was not hired (and I was going to be hired). I wasn't taking any at the time... it was just the hangover from it that messed me up. I lost my train of thought 2 or 3 times during the interview and I saw the interviewers look at each other like 'whoa this guy has a problem'. They were right.. I sure did have a problem. I lost the job offer. They never called me back.",
  "I hope this will help some others from getting into trouble. If you want to take this stuff do your research!! Don't just jump in assuming that it is perfectly safe because it is not. You must be responsible for yourself. If you make a mistake with this stuff you will only have yourself to blame.",
  "Another thing that I'd like to mention... make sure you measure your dose very carefully. Always use an accurate measure with an eyedropper or syringe or some other way of measure an EXACT amount. A buddy of mine who I warned repeatedly to do that decided he could just take a swig of the stuff without measuring because he is such a tough guy and doesn't need my advice. He ended up being rushed to the hospital due to going into unconciousness and convulsions. He called me a few days later and told me that I was right about the measuring of it. I warned him repeatedly about that but he chose to ignore my advice and was obviously very irresponsible. Later he asked me where he could get some more. I wouldn't tell him and I will not tell him because it would be irresponsible for me to do so. He is not a responsible enough person for this stuff. I don't want his injury or death on my conscience. I'd rather lose him as a friend then to lose him totally.",
  "Use good judgement!!!!</p>"
 ],
 "erowid": {
  "id": "1917",
  "citation": " Insomniac. \"Precautions for Responsible Use: experience with GHB/GBL/BDO (ID 1917)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1917",
  "substance": "GHB/GBL/BDO",
  "views": "17099"
 }
}
