{
 "title": "Grim Reaper's Salad:  Part One",
 "author": "Veganvampire2292",
 "citation": " Veganvampire2292. \"Grim Reaper's Salad:  Part One: experience with Wormwood, Cannabis & Salvia divinorum (ID 27774)\". Erowid.org. Jan 12, 2007. erowid.org/exp/27774",
 "substance": "Wormwood, Cannabis & Salvia divinorum",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "1 bowl",
  "smoked",
  "Various",
  "(plant material)"
 ],
 "report": "<p>I packed a bowl with equal parts cannibus, wormwood, and dried salvia leaves. I smoked it all. I lay down after smoking, with my chrismas lights on and some trance playing in the background. First I felt warm, then it seemed like pieces of my skin were vibrating. The feeling rapidly spread to my whole body, and intesified as I consentrated on it. My insides felt as though electric shockwaves were being passed through it. My body felt light. I started to see flashes of images I couldn't quite identify, but that seemed familier, and important.</p><p>I got up and tried to do what the surrealists call a freewrite, in which the author takes a pen and paper and writes as quickly as possible whatever comes into her head, without pausing to think or punctuate. On other substances, this has turned out interesting results, but the only thing I cound think was how my pencil seemed to be moving of its own accord very rapidly and nearly illedgebly.</p><p>Putting this aside, I lay back down and let the images come again, and come they did. What I saw is not something I care to relate, but I will say it was intense, painfully so, spiritual, and was accompanied for a time with a sort of dark euphoria, that bordered on sheer terror. I felt like I was rolling on ecstasy. The sound of my computer brought me back into my body. I talked to a friend, who has experience with all three substances. I told him of my experience even as I was still in the grips of it, hardly able to find the keys to type with. He immedietly went to try it.</p><p>After five or ten minutes the intense euphoria and spasms abated, though I still felt rather stoned. As I continued to talk to my friend, he began to feel the effects himself, and left the computer. When he returned he told me he needed a ciggerette, and we both agreed to satisfy our cravings and return.</p><p>Outside, the night had transformed. I became transfixed with a black sock I found on the sidewalk and whether I ought to return it to it's rightful owner. After realizing how ridiculous this sounded and pulling myself away (twice), I noticed pinpricks of cold which I soon discovered were raindrops. I then lost myself in the patterns of sound they made as they hit the leaves of a tree.</p><p>I tossed the blackened corpse of my ciggerette into the trash and returned inside to wait for my friend before the glowing screen. He did return, but I'm not sure if he was quiet...um...back yet? He said he too had an intense experience, and that salvia was some potent stuff. Now he was going to bed, but we could talk later. And so here I am, waiting to hear, and writing to you while I wait.</p>",
 "year": "2003",
 "id": "27774",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-01-12T08:00:00.000Z",
 "views": "10072",
 "dose": {}
}
