{
 "title": "Plugging In",
 "author": "Anonymous",
 "citation": " Anonymous. \"Plugging In: experience with MDMA (Ecstasy) (ID 27770)\". Erowid.org. Jun 14, 2006. erowid.org/exp/27770",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "135 lb",
 "header": [
  "DOSE: T+ 0:00",
  "500 mg",
  "oral",
  "St. John's Wort",
  "(pill / tablet)",
  " T+ 0:00",
  "500 mg",
  "oral",
  "Vitamin C",
  "(pill / tablet)",
  " T+ 0:00",
  " ",
  "oral",
  "Vitamins / Supplements",
  "(pill / tablet)",
  " T+ 0:00",
  "1 tablet",
  "rectal",
  "MDMA",
  "",
  " T+ 0:40",
  " ",
  "inhaled",
  "Levmetamfetamine",
  "",
  " T+ 0:40",
  "1 hit",
  "inhaled",
  "Nitrous Oxide",
  "(gas)",
  " T+ 1:30",
  "1 hit",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 2:30",
  "1 bowl",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Mindset & Setting:</p><p>I was looking forward to rolling for a few weeks and had been loading up on vitamins (C, E, and multi). I was at my friends house which was a very comfortable, relaxing home with a nice hot tub. For the experience we bought whip cream (nitrous), orange juice, vicks inhalers, and glow sticks.</p><p>Preparations:</p><p>The morning of I took a St. Johns Wort, 500mg vitamin C, 500 I.U. vitamin E, and a multivitamin.</p><p>And I took another vitamin. C&E for dinner.</p><p>T+ 0:00</p><p>I put a condom on my finger and pushed the pill (blue dolphin) up my rectum to about my second knuckle. (Uncomfortable but not painful) Some people like to crush it up and put it into a capsule. I laid on my stomach & side for about 15 minutes so it would stay in place. The area burned for a few minutes but it went away. Two of my other friends ate theirs at the same time.</p><p>T+ 0:25-0:35</p><p>It started to hit me and I felt heavy and comfortable. I became nauseous for a few seconds but it passed quickly.</p><p>T+ 0:40-1:30</p><p>I began to roll pretty hard and decided to sit in the hot tub. This felt extremely good on my body. I put 2 Vicks inhalers in both my nostrils and relaxed for a bit. Then, I decided to do nitrous from a whip cream can. I let all the air out of my lungs and did a whole can. I immediately felt incredibly slow and awesome. I felt like I floated up out of the hot tub, I was completely weightless. It was the coolest feeling I ever had! After a bit, I put my feet up and put my head under (I was being supervised) and I suddenly felt like I was in outer spaceabsolutely no gravity.</p><p>T+ 1:30-2:30</p><p>For the next hour or so I was rolling the hardest I ever had. Breathing in air felt incredibly good and I was beginning to trip. My eyes were jiggling like crazy (nystagmus). I went outside and took a hit of some weed and came back in. I sat down by the mirror and this was when my trip became insane. It was more than just a reflection; it was like I was standing face to face with myself. I began talking to the person on the other side saying, I dont know what to say to you, etc. My image was flawless and breathtaking. I viewed the person in the mirror as my guardian who looked over me my whole life.</p><p>After looking at myself for a while I rolled onto my back and looked at the ceiling. In my mind I was walking on the ceiling and tripping over hanging lights, etc. I could feel the texture of everything on my feet and hands.</p><p>I got up went over to a picture on the wall. It was a simple black and white picture overlooking a farm. I began to study it, looking into every detail. I figured out it was in the late 70s and then I was there. It was like I was hovering in the sky watching over it, protecting it. It was so real to me and I felt like I was a guardian. I couldnt touch or change anything in the picture it was just there in front of my face.</p><p>My other two friends were tripping as well but I dont think as hard as I was. My mind continued to figure things out and simple thoughts took forever to think out.</p><p>I went out and smoke a bowl with my friends and we all came back in and sat in the hot tub. We had the funniest conversations that took forever to say and we felt so slow and analytical. We took turns throwing a ping pong ball in the water over each others bodies. When the ping pong ball hit the water it felt like it was striking our bodies under water, we stopped after a while because my friend was feeling weird by this. But I found it incredibly awesome!</p><p>T+3:00-5:00</p><p>I continued to trip and was doing things like predicting the future and traveling into my mind.  Looking down at the small rising bubbles caused me to trip harder and I felt I was traveling in deep sea water. I got out and we looked at Milkdrop. It was insane and my mind traveled into the smallest part of life possible, it was like looking at life though an impossible microscope. I traveled through space and dropped to earth in a raindrop. My short term memory was completely gone and I was having conversations in my head, not sure if they were out loud or not, I was also hallucinating real things that confused me. It was the most fun trip ever. Later, my friend and I became extremely paranoid about everything, but it was fun.</p><p>T+5:00 to sleep</p><p>Sleeping wasnt a problem but I became even more paranoid, hearing every tiny sound. Honestly it did not bother me; it was actually fun and humorous. I fell asleep tripping and the next day I felt great, I took a multivitamin and a St. Johns Wort to balance it out.</p><p>Conclusion</p><p>Summing it up; plugging was the most intense roll I ever had (with the help of some vitamins and marijuana). I will probably plug from now onit was like two pills in one! I never tripped like that on MDMA but the weed helped a lot with that. Three thumbs up!</p>",
 "year": "2003",
 "id": "27770",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-14T07:00:00.000Z",
 "views": "20759",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "St. John's Wort",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Vitamin C",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 0:00",
   "amount": "1 tablet",
   "administration": "rectal",
   "substance": "MDMA",
   "form": ""
  },
  "4": {
   "time": " T+ 0:40",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Levmetamfetamine",
   "form": ""
  },
  "5": {
   "time": " T+ 0:40",
   "amount": "1 hit",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  },
  "6": {
   "time": " T+ 1:30",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "7": {
   "time": " T+ 2:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
