{
 "title": "Reaming in Wakefullness",
 "author": "Seuss",
 "citation": " Seuss. \"Reaming in Wakefullness: experience with Zolpidem (Ambien) (ID 27783)\". Erowid.org. Mar 29, 2006. erowid.org/exp/27783",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "40 mg",
  "insufflated",
  "Pharms - Zolpidem",
  "(ground / crushed)"
 ],
 "report": "<p>My first expirience with ambien was 10 mg orally, and with this experience came a relaxed, yet almost psychedelic experience. Being a medication for sleep, I expected it to make me drowsy, but in reality it didn't, and the experience was so interesting that I was more inclined to stay awake and enjoy the effects, something like ingesting a miniscule amount psilocybin, and taking a few benzodiazapenes. I liked it enough to go a bit beyond the regular dosage and try it crushed and inhaled rather than orally.</p><p>The new nasal method was quite uncomfortable and the drip down the back of my throat tasted pretty nasty, but the trade off was a more instant and intense onset of stronger effets. The discomfort was reduced to less than a minute when I held a wet paper towel over my nostrils and inhaled gently, coating their insides with a mist. Within 15 seconds of inhalation of the four 10mg pills (a copious amount of powder!) the effects were staggering. Walls and floors started undulating much as they would on any of the major psychedelics, and patterns in wallpaper began morphing into different things. Ambiguous semi-floral designs started to seem more like animated (as in moving in a lifelike fashion) cartoon animals, and check-like patterns began to swirl. A bit later it seemed as though purple snow began falling in one select corner of the room. People's faces changed characteristics and often looked quite terrible and haggard, to the point where my friend (also on the same 40 mg.'s) thought I had turned into someone she didn't know and hid in a closet. Audio hallucinations like ringing and volume fluctuations occured, as well as tingling sensations in the extremeties.</p><p>All of this occured while a very benzodiazepine mindset was instilled (like taking xanax or klonopin) and, unlike most trips I've taken, my mind didn't race and my muscles were quite relaxed. The peak of the experience was at the beginning, rather than the middle, and the duration of effets lasted about 1 hour, but extended to four if the drip was swallowed rather than spit out -  although in both cases the beginning peak experience dwindled to more subtle effects within 30 minutes.</p><p>All in all I was quite pleased, and considering its ease of procurement I believe it's an expirience that I will have quite regularly.</p>",
 "year": "2003",
 "id": "27783",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-03-29T08:00:00.000Z",
 "views": "10498",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "Pharms - Zolpidem",
   "form": "(ground / crushed)"
  }
 }
}
