{
 "id": 2778,
 "title": "Silly Madness",
 "date": {
  "submission": "2002-11-25T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "lucky",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:52",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "4:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ],
 "report": [
  "This report was captured in real time, the intent was not to write a trip report with the idea of sharing or publishing it on-line. However, after friends and acquaintances read it they suggested I submit it. The report begins at 6 p.m., sorry for the overly detailed time info, but like I said, it was written for personal consumption.",
  "'Honeybunny, do you mind if I try some research chemicals while you are working? No? Great!'",
  "6:00 I insufflate 15mg 2c-i",
  "6:11 painful for sure, eye wateringly painful",
  "6:13 wow, pain is subsiding, and already feeling it coming on",
  "6:20 that was quick, hello 2c-i",
  "6:24 quite different from my previous oral experiences",
  "6:37 high as a kite",
  "6:40 note to self: never snort this much 2c-i - especially watching Black Hawk Down!",
  "6:43 things are getting freaky now, this movie is too much",
  "6:47 twisting throbbing swirling bending sliding twirling spinning vision",
  "6:52 intense - i will try to smoke some pot, success!",
  "melting into silly madness, the Simpsons are on, and I reach for some fuzz on the floor but REALLY its a spider, so I jump up and get toilet paper and squish it and stuff, but right now everything is throbbing and pulsing and surrounded by green and blue and j is in the front room actually working. Really actually working, and quite oblivious as to what is go on inside my head right now.",
  "7:00 Cops comes on TV, Head check  nice and weird, sirens, screaming, thunder, is that on TV? It MUST be?! Damn! Is it raining? No? Yes? Uhhguuuhuh.",
  "I get up and walk around, it was storming, and I mean storming with heavy lightening and everything earlier, now its just a slow steady rumble of the storm. Perfect. crazy!",
  "7:10 I think I peaked, that was a quick ride up. Too intense almost, Im good and high now, thats for sure. thats for sure. thats for sure.",
  "7:13 how beautiful and peaceful and friendly, oh the yummy goodness,",
  "7:18 I want a smoke; I break down and go for a smoke. Im a sinner; its been days since Ive smoked. but Im weak, I smoke a death stick. I stand out in the mist, hardly a rain, and suck the smoke in and out of my body. They suck. It tastes like shit. I go brush my teeth. I feel sooooooooo good!",
  "7:26 god bless America or something or someone or anybody bless anything or somebody bless the fucking wow holy wow whoa weird good stuff man",
  "7:46 I can almost converse normally with j. Almost. But she sees that look in my eyes",
  "7:58 its about 8 oclock and Ive got company arriving in 4 hours or so, perfect, its E. No sarcasm here, this will be nice for the both of us to chat later. Damn the screen is swimming around and breathing and twisting and swirling, all so so cool. Ill smoke some more bud right now. Yes, that would be nice. I smoke da herb and the visuals are so enhanced. I guess a little music would be better then tv for sure. Wandering around the house, each room has some different vibe at the moment.",
  "8:17 love playing with winamp and the tunes are awesome! Music is da bomb.",
  "8:39 lost in space, I awake to hear Leonard Nemoy singing The Tale of Bilbo Baggins how bizarre & unexplainably strange. The techno flows. How beautiful. I go get some water and its tastes wonderful. Just plain almost luke warm water, barely a hint of a dissolved ice cube left, and its like the best thing that I could possibly be drinking in that moment in time.",
  "9:23 the reality that 2c-chems really are illegal hits me. Damn. [Erowid Note: Some 2C- phenethylamines are explicitly scheduled, some are not]",
  "9:27 wow. That was a nice ride, it hit three times as fast and three times as hard and the peak lasted one third the time vs. my oral experience. Im still pretty stimulated, but Im well over the peak. We shall see how this goes.so far its all been really good.",
  "9:53 back to semi-normal. Kinda. At least everything isn't 'breathing' anymore. Im hungry, lemme go see whats good to eat. Last I ate was some Vietnamese goodies at about 3:00 or 3:30",
  "10:00 I find a hot dog, but first I eat 10mg of valium. Need to take the edge off a little. The wife is not going to be up for me running around and screaming much longer. The hot dog is pretty good, but the only thing I can find to wash it all down with is a lone long forgotten Smirnoff Ice thing crap drink. Malt liquor, thats where its at, man, yuck, At least there is some alcohol in it.",
  "10:30 still wired like a fiend. I need .5mg of xanax and some marijuana. I couldnt possibly really concentrate on a movie just yet. Chillin w/ Saturday Night Live. Laughing!",
  "10:50 E is in Beaumont, hell be here soon...",
  "12:24 where the fuck is E? Im getting tired. The benzos are kicking in, guess I better go unlock the door and leave the light on. We are going to bed. Knock Knock Knock, the front door opens. We sit up for two more hours just talking and making fun of the Midnight movie journey to the center of the earth made for TV remake.",
  "2:00 sleep finally wins, the night is over.",
  "8:00 good morning! slight hangover, probably more from the drink and benzo but whatever. groggy, headachy. Some advil and coffee will do me good. I guess I didn't keep as hydrated as I should have, very dry this morning.",
  "NOTES:",
  "180 degree different from my 15mg oral experiences, which was slow to come & kinda mild. This was quick to come on and intense. this phenethyamine has quite a psychadelic top spin. Euphoric and tripppy."
 ],
 "erowid": {
  "id": "19174",
  "citation": " lucky. \"Silly Madness: experience with 2C-I, Cannabis & Benzodiazepines (ID 19174)\". Erowid.org. Nov 25, 2002. erowid.org/exp/19174",
  "substance": "2C-I, Cannabis & Benzodiazepines",
  "views": "9263"
 }
}
