{
 "title": "More Powerful Than You Think",
 "author": "Joe",
 "citation": " Joe. \"More Powerful Than You Think: experience with Salvia divinorum & Cannabis (ID 27815)\". Erowid.org. Dec 3, 2004. erowid.org/exp/27815",
 "substance": "Salvia divinorum & Cannabis",
 "bodyweight": "190 lb",
 "report": [
  "<p>A friend and I decided one weekend to try some salvia.  We both got a gram a piece of 10x extract.  I had read some of the articles about salvia so I made sure we were in a safe environment and waited several minutes between each hit. I smoked some weed with it since I heard that was the only way some people could feel the effects of it.  At first we didn't feel much but after a while we started a nice relaxing high.  I saw a slight pattern across everything but still not that intense. Two more friends came over towards the end and took a couple of hits, but by that point we had finished about .75 gr a piece.  After finishing it all we all felt a little but nothing as intense as some of the stories I read about.",
  "Almost TWO WEEKS go by and some friends and I ate some brownies (one and a half brownies a piece) and  decided to go see some bands play at a club.  We got there a little early and hung out at one of the bars before the bands started to play.  I was having a good time when all of a sudden I heard in the distance the sound of indian drums echoing and getting louder and louder.  This started to freak me out a little bit so I asked everyone if they wanted to walk around the club a bit.  As soon as I stood up it hit me like a ton of bricks. I felt like my feet were made of lead.  We then proceeded to walk up the stairs and as I did, the stairs started to melt and swirl around just like the visuals that you see in pink floyd the wall when they are carrying him down the hallway.  By the time I reached the top of the stairs I was ready to go home.  I then told my friends that I was freaking out and needed to go home.  The next day my friends called me up saying the whole night they talked about how I freaked out on a brownie.  They couldn't understand it for this is the same guy that had done way more brownies before and who had tried just about everything under the sun including thorn apple seeds and always had to do more than anyone else.",
  "When I got home everything turned to total chaos.  I sat upstairs for a while with my wife feeling very freaked out.  She then told me to take a shower hoping that would calm me down.  After the shower my whole body felt like a lead weight so I laid down in bed.  At this point everything I saw looked the same whether my eyes were opened or shut.  All I could see was the pattern that I saw the night I smoked the salvia, but this time swirling around in my head like a raging storm.  As I lay there in my bed it started to happen - the force that I had read about in the stories although it was not how I imagined it.  I thought it would feel like someone was holding me down, but what I felt seemed as if something were throwing me a million miles an hour into my bed.  I started to wonder if I would ever recover or would stay in this state of insanity forever.  I then found enough energy to go out into living room where I called for help from my wife. ",
  "She found me in the chair lifeless as if I were in a coma.  She told me that I was scaring her and if I didn't get up to prove to her that I was ok she would call 911. The last place I wanted to be in my state was a hospital, so with all my will and my wife's help I proceeded to go upstairs with her.  It seemed like it took an eternity and that I couldn't make it.  After every couple of stairs I had to stop and catch my breath.  For the next hour or so my wife laid down beside me calming me and watching my body twitch as the force slammed my body repeatedly into the bed until I passed out or maybe I blacked out.",
  "Some people probably won't believe that salvia could affect a person  almost two weeks after taking it, but I'm positive that that had to be it.  It must have been the amount of salvia I took and the amount of THC I took that night.  Whatever it was it was one of the most insane nights that I have ever had and I wouldn't wish this experience on anyone.</p>"
 ],
 "year": "2003",
 "id": "27815",
 "gender": "Male",
 "views": "12217",
 "dose": [
  {
   "time": "0",
   "amount": "0.75 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 336:00",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  }
 ],
 "submissionDate": "2004-12-03T08:00:00.000Z"
}
