{
 "title": "Methylone has Addictive Properties",
 "author": "MthylnMan",
 "citation": " MthylnMan. \"Methylone has Addictive Properties: experience with Methylone (ID 27823)\". Erowid.org. Oct 24, 2003. erowid.org/exp/27823",
 "substance": "Methylone",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "190 mg",
  "oral",
  "Methylone",
  "(powder / crystals)"
 ],
 "report": "<p>I'd like to share my experience with Methylone.  I have taken it on about 15 occasions at doses ranging from 130mg to 230mg.</p><p>The first few times were nothing short of magical for me.  I felt an incredible push to connect on a deep, truthful level with my wife, and we had times of sharing our deepest secrets while on methylone.  If you haven't experienced methylone before... my wife and I both experienced a push to 'come clean', drop baggage, and experience full openness.</p><p>T+25 minutes: For a long time with methylone, during the begining of the experience, I felt a great drive to improve my life -- treat my body better, work out, clean up the house, get things done. </p><p>T+1 hour: There comes an obvious 'click' point where everything seemed to become easily handle-able and I couldn't imagine going back to my normal way of thinking and being.  Many promises were made to myself that I found hard to keep, because at the time I could not see how with this 'new look on life' could ever go away.</p><p>T+1 hour, 15 minutes: Then comes the enjoyment stage, where I enjoy everything I look at, feeling incredibly motivated to connect with whatever I am focusing on.  Everything and everyone became intensely enjoyable.  This is the time when connection with others became an almost-overwhelming push.  At the same time I experience a slowly-growing desire to lay back and relax.</p><p>T+2.5 hours: the tired/relaxed stage comes for me, where I am blissfully content to do nothing, but I feel reality and my 'normal self' returning. </p><p>T+4 hours: Then comes the tired stage at 3.5-4 hours where I am fully relaxed but a bit bored and cannot sleep.  This is when there is an opposite push for me -- that connecting with anyone or anything is intensely effortful.  I just want to lay back and close my eyes and not have to do anything.  I can't imagine that I had so much energy.</p><p>T+7 hours: I can finally drift off into sleep.</p><p>During the methylone experience and for one day after, I find that my pain sense is very altered.  I can do amazing body stretches and Yoga positions on methylone that frankly hurt when sober.  I learned quickly to be good to my body even if it didn't hurt at the time!</p><p>Pot seems to ease the come-down for me, although I am not a regular pot smoker, so it could just be I was getting stoned on top of the remaining methylone effect.</p><p>My wife experienced these same stages except she doesn't get hit by the last 'bored' stage as hard as I do.  For her, I believe methylone is still 'brand new', although she experiences mood instability for several days afterwards and thus does not take it anymore.</p><p>However, What I REALLY wanted to mention is that I did methylone at 190mg once a week for 4 weeks in a row.  What I found is that I developed tolerance.  I did not feel so open and willing to fully share my thoughts and feelings, and my inhibitions started creeping into the methylone experience, where before I had absolutely no inhibitions while on methylone.  What is most disturbing is that I experienced something very curious that I recognized quickly...  2-3 days after a methylone experience I began to crave other drugs - mainly alcohol or benzos.  I didn't feel depressed, I just felt a push to seek other pleasurable states.  This felt exactly like the beginning of any psychological addiction.  I now believe that methylone MAY BE psychologically ADDICTIVE and definitely I developed tolerance when I didn't space out my doses over several weeks, or even months.</p><p>A few months ago, I took a 2 week break from the substance and then tried it again just to test if every 2 weeks would be okay for me and let me retain the 'magic'.  I experienced the same kind of tolerance and quite severe cravings for several days to re-enter the 'original, altered methylone state'.  I have not tried it again since, nor do I intend to for many months, or even years.  Not only has it 'lost its magic', but I feel like methylone can induce cravings as well, even if only used once a week.  This has never happened with other psychedelics for me, like mescaline, shrooms, 2C*, etc.  So be careful and be aware that this may be addictive.  I believe there is a reason so many people try to boost when the 'good vibes' come on -- reading the other reports here, I see it all over.  I can see why -- I found the neurological reinforcement that wants more of a good thing is present in methylone.</p>",
 "year": "2003",
 "id": "27823",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-10-24T07:00:00.000Z",
 "views": "41403",
 "dose": {}
}
