{
 "title": "Humbled, Somewhere in the Cosmos",
 "author": "Scorched individuals",
 "citation": " Scorched individuals. \"Humbled, Somewhere in the Cosmos: experience with Salvia divinorum (10x extract) (ID 27833)\". Erowid.org. Sep 14, 2005. erowid.org/exp/27833",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "",
 "report": "<p>History:</p><p>I bought an ounce of dried leaf believing that it would be best to sample its natural state first before dabbling in concentrates. After several occasions chuffing loads of this awful, acrid smoke. Seeing nothing but the odd ripple or shimmer, and only nearly getting a 'hit' once, (the feeling that something big and shadowy looming up behind me! Unfortunately I choked on the massive lung full of smoke, and the 'Big loomyness' retreated into the shadows). Major anti-climax, after major anti-climax. ('This Salvia stuff is a bit shit really', or so I thought).</p><p>I bought 1 gram of extract, (X10 strength).</p><p>Dosage- The packet states between 50-150mg, (Between 1/20-1/7 of a gram). The guy in the shop said 5 strong doses, but that could easily be stretched to 6-8 good ones.  Being an experienced psychonaut, and firmly believing that 'Your first trip is always the best on any subtance, better to make it a good one!', And never having a bad trip on anything, on top of the overrated, generally very poor visuals of the leaf, it's got to be the 'madman' dose.</p><p>The gram was divided up into 5 (200mg) doses. Psychonauts 1-5 waiting on the launch pad. The setting was my living room, nice tunes, chilled environment as ever.</p><p>Psychonaut No. 1 - Full dose smoked in a single hit, (I was quite impressed), kept down for around 15 seconds. I removed the bong from his hand, his vacant eyes told me he was already gone. Peacefully he slumped to one side, snored gently, and drooled a bit, for a few minutes. (The 4 of us looked on with big grins on our faces, eagerly awaiting his return!).  After 3-5 minutes he regained consciousness, seeming very disorientated (We all thought the UN-concious bit to be the trip, and he was now coming back to reality). He got to his feet looking very puzzled walked, (very well I must say), out of the room into the kitchen and curled up on the floor where one of our number comforted him back to his senses. (About another 5 minutes). The remaining 3 of us in the living room chuckled as to where he may have been. ('Bring it on' I thought). His first impressions, 'Fucking high! Wow! That is fucking strong stuff!'.</p><p>'Psychonaut 2 to the launch pad', (The pioneer's comforter. 'It can't be that bad if she's going next!). Again, Full dose in 1 hit, held for maybe 10 seconds. Interestingly she remained conscious throughout. An obvious wave swept over her, a look of terror on her face remained, 'No! Make it stop! NO! Please No!'. She slid from her place on the settee down onto the floor like she was liquid, still panic-stricken, and muttering unpleasantries. (The groups expressions died somewhat). The 'pioneer' this time did the comforting, assuring the subject that she was safe. 5-7 minutes later she returning to us saying that she won't be doing that again.</p><p>Someone sugested reducing the dose. 'fuck that! The First is the best...fuckin CHARGE!). I'm up on the launch pad, (comfy chair)...full hit, in 1, held for....12..13..'Things just bending slightly'...14.......(Still blackness). I'm peeling myself up off the floor, but bits of me are still on the floor, stretched down, like the cheese on the pizza hut ad. I'm trying to get up out of my position, the overwhelming feeling that this IS reality, and the vague distant world that I left was the trip. I'm all alone, fear coursing though my being. Like Neo waking up in the bubble, alone, an insignificant part of an indescribably massive whole that I'm not suposed to know about, a lone infant on his first day at university. I'm still trying to get up off the floor/surface that I'm a part of, the more I peel myself up the more of reality is begining to peel back, (am I doing wrong? what will be my fate?). Reality is made up of several stripes/slices/sections, all slightly offset from the adjacent slice, and all rotating, like enormous hamster wheels part of the grand scheme of how the universe ticks.</p><p>A dreaded sense that the governing force was looking to correct a fault, rectify a problem (me being that problem), suddenly I'm being used as a sponge or tool, rolling across all the surfaces in the reality, being moved by something huge that I can't see but I feel it clutching my being. Suddenly a glimmer of something I remember, a hint of what was and should be. I gradually return to a safe place with my friends.</p><p>Psychonauts 4 & 5 opt out, (although I can see in the eyes of one of them, 'I want to find out for myself').</p><p>12 hours later i'm having trouble with my grammer and spelling. Our heads/brains/minds feel almost brusied.</p><p>Conclusion:</p><p>After many hours of debate, we all went to the same place. We all feel that it was unpleasent to say the least. All of us are veteran trippers, name the stuff we've pretty much tried it. It is the most UN-psychedelic experience I've ever put myself through, and could've gone through my life without it in my portfolio. The only reason that i can think that this is legal is that it is short-lived and any novice trying it will be completely scared off from ANYTHING illegal. Seriously, anyone thinking of trying this, treat it with reverence. It is soul shattering. It may have just been the EXCESSIVE dosage, but if that is where I go I think dosage is not important, it is somewhere not worth visiting, (NOT FLUFFY ENOUGH FOR ME).</p><p>If I try it again I would like to try it in the countryside, and would like to 'go down' with someone in synchronicity to see if you end up together. Also I won't have as much, the 1st ride isn't always the best!!!</p><p>If you really wan't something ground breaking, spiritual, life changing or psychedelic as fuck, Do a shit load of 2C-I, (it's only a little bit radioactive), Mushrooms, (particularly ones from South Africa or Bali), and all the Ketamine you can get your nose around.</p>",
 "year": "2003",
 "id": "27833",
 "timestamp": "2005-09-14T07:00:00.000Z",
 "views": "3194",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
