{
 "id": 2784,
 "title": "Preventing the Splooge of My Body",
 "date": {
  "submission": "2002-11-27T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lily",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.5",
    "quantity": "3.5"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "This is an account of my first true psychadelic experience. I had done mushrooms 2 times before, but both times I only had about 1 mushroom, and didnt feel anything at all. Last night, my friend Bill bought 2 ozs.  Of mushrooms. I ate 1/8, must have been about 7 or 8 shrooms. We then went on a journey for orange juice, and came back to the house. There we watched T.V. and waited.",
  "I first noticed that the blinds over the windows were shifting, and the shag carpet seemed to be rising to flood the room. From there I was thrown into a different world. I watched a painting on the wall of a forest and a river shift and change, and the light in the painting seemed to be truly shining. I noticed light everywhere, and colors and stars, and everything shifted constantly. I made a journey to the hallway, because at the end of it was a room with a bright pink blanket that I wanted to explore. This was a house belonging to a friend's grandmother who was not home, and I had only been there once before. As I walked down the hall I stopped short. There was a painting of me on the wall. It seemed to be speaking to me, not allowing me to pass it. The weird thing is, this was not a hallucination, but there really was a picture that looks exactly as I see my face, of me. My friend bill came and saw it, and freaked out. We watched me for awhile, and then he somehow thought it was right to take the drawing/painting/photo (im honestly not sure what it really was) off the wall and into the living room.",
  "We then preceded to explore the house, and I found laying on the floor very comfortable. I went into the bathroom, I forget why. I no longer knew how to manage my body. I didn't know if I wanted to eat or throw up or pee or drink. But the bathroom seemed right. When I arrived in there, it changed into a whole other world. It was dark, but it seemed like the walls were shiny and slightly wet, dripping with color. Bill came in, and somehow we ended up entwined, sprawled on the floor of this bathroom in the dark. His body was no longer form, he was just a shape and a voice. Everything felt like a puzzle, the way the colors and our voices and our bodies fit together in this dark, wet world. It was then that I realized I had lost all feeling of my body, I could have been drooling or vomiting and not known. I forgot where my mouth was. The whole trip became a quest to hold my body together, and keep from drifting forever into space and time and color.",
  "I vaguely thought that this was what death was like, trying desperately to hold on, but your body just oozes away, and everything constantly moves. I felt slightly sick, but it was incredible. I needed dry. I made my way out of the bathroom and collapsed on the hallway floor, a light on the ceiling was right above me. My hands constantly changed, from orange to purple, and they grew and shrunk. They would look 200 years old, and next second look like bloated baby hands, fresh to the world. Back in the living room, where we ended up again, bill and ben could be heard having meaningless conversations and trying not to completely lose it. I lay on my stomach on the floor, and tried to pull myself together. Even in my insanity, I knew that this was a drug that was passing through me, and I knew I would not lose it because all I had to do was go through it, and I would come out the other side sober and alive, with much to think about.",
  "So I tried not to talk, because it made me feel sick and I closed my eyes and tried to find my balance, my center. Finding this tiny point in a colorful oblivion was very satisfying, and took away my sickness. I kept losing it, though, listening to everything around me. I could no longer distinguish people, voices, solid, liquid or air from each other. Everything blended, was one and the same, and I knew that this was how it always was, but it was just not visible. People asked me questions, and all I could think to say was that I forget. I forgot what sobriety was, I forgot who I was, where I was, who I was with, but at the same time I knew that if I could find my center I would remember. My hair became this white feathery webbing that surrounded me wherever I went and it made me happy. When I stopped feeling quite so sick, I found that I was completely happy.",
  "I found that I finally know who I am, I've grown up, and I'm still growing. All I felt was that the quote 'all the worlds a stage, and all the men and women merely players' means everything. I found that in life, all I am is a breath of love, and I float through life trying to share the love I have for life with everthing and everyone I can. All I am is a fairy, and my only goal in life is to live it and give love. For about an hour I lay on the floor, smiling and twirling my hair. I felt like I'd grown old and been reborn, a little girl again, innocent. My life up till this year was spent trying to grow up, and I found that I'd done all of the growing up I needed and finally I am at peace with myself and my life. I've known this before, but it seemed so much more important.",
  "I looked at bill, and I could just see that he's still so insecure and he has no idea who he is and what to do with himself. I saw that all he does is whine, and try to get attention, sympathy, for his (kind of pathetic) life. I realized how sad he is, I never knew before. Anyway, this was an insight to myself and how strong I am, and I learned a lot. It's all about exploring, seeking yourself. My only warning is, take a smaller dose your first time, because feeling sick does really jade it. But, if you are tripping hardcore, just close your mouth and your eyes and find your center, your balance, and that's all you need. Explore. Find yourself, and allow yourself to believe."
 ],
 "erowid": {
  "id": "19185",
  "citation": " Lily. \"Preventing the Splooge of My Body: experience with Mushrooms (ID 19185)\". Erowid.org. Nov 27, 2002. erowid.org/exp/19185",
  "substance": "Mushrooms",
  "views": "16148"
 }
}
