{
 "id": 2786,
 "title": "Polarity Profundum",
 "date": {
  "submission": "2002-11-27T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Zonker",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [],
 "report": [
  "<p>At massage school we learned polarity therapy as part of the courseload. Polarity is a system of energetic bodywork which fuses energetic and ethereal systems from Chinese medicine, ancient Greek and Egyptian medicine, Ayurveda, and various other sources. In some cases the session can be done 'off-body' or without physical contact. This means that rape victims, survivors of brutality or domestic abuse and other traumatized people can get painless bodywork: Polarity respects their defensive boundaries. May all who suffer so be uplifted, fulfilled and freed.",
  "In school we were taught the theory and taken through balancing exercises for the five Ayurvedic elements: air, fire, water, earth and space (or Akasha). The Fire balancing session was particularly powerful for me to receive. My partner moved through the session step by step, being no more experienced than I. As with the other balancing sessions, I reached a deep, pleasant, comfortable state of relaxation: the parasympathetic response. I could have moved, but I was so warm and comforted that I didn't want to. Near the end of the session, I saw my body as if from a vantage point in my head: transparent, empty, and lit by the afternoon sun. Then I received a tarnsmission that is very hard to describe, although I shall try.",
  "Imagine, if you will, a pan of alcohol into which a lit match has been thrown. The flame bursts out from the match and rolls across the pan of alcohol in a wave. This I felt, heard and saw inside my empty body, lying so comfy on the massage table. The flames burst out from around my chest area and spread across my back where it touched the table. As if a wind blew hard across the pan, the flames rippled up and down the back of me with a sound like a flag in the wind. Then, just like alcohol that evaporates into the flame, a few lingering flames flared and died. This all happened so suddenly and lucidly that I neither moved nor spoke nor opened my eyes for the duration. The only sign that something extraordinary was happening was my body tensing slightly. I was awed when it was over, and shared the experience with the class when everyone had finished.</p>"
 ],
 "erowid": {
  "id": "19189",
  "citation": " Zonker. \"Polarity Profundum: experience with Bodywork (Elemental Balancing Polarity Therapy) (ID 19189)\". Erowid.org. Nov 27, 2002. erowid.org/exp/19189",
  "substance": "Bodywork (Elemental Balancing Polarity Therapy)",
  "views": "7932"
 }
}
