{
 "title": "Labored Breathing at Points",
 "author": "Hightimes",
 "citation": " Hightimes. \"Labored Breathing at Points: experience with Codeine & Ephedrine (ID 27891)\". Erowid.org. Nov 29, 2004. erowid.org/exp/27891",
 "substance": "Codeine & Ephedrine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "250 mg",
   "oral",
   "Ephedrine",
   " T+ 0:30",
   "300 mg",
   "oral",
   "Codeine"
  ]
 ],
 "report": "<p>After many experiences over the years with both 'street narcotics' and pharmaceuticals I found myself regularly taking between 150mg and 300mg of Codeine extracted from Tylenol 3 tablets. Maybe once or twice a week I would enjoy this. On the specific night in question I ingested the 250mg of Ephedrine and half an hour later as effects were starting to be noticable I decided to also take the 300mg of Codeine.</p><p>At about 1 hour after taking the Ephedrine and half hour after ingesting the Codeine I was feeling very warm and complacent. Fifteen minutes later I was sweating profusely and unable to ignore myself heating up. I had two glasses of water which seemed to help. I proceeded to watch a movie with my partner while I enjoyed the trip. At times I was manic, not able to sit still and constantly chattering as though 'speeding' on amphetamines. At other points I would lapse into a dazed sort of state.</p><p>At the two hour mark I was shakey and could not walk without somewhat drunken appearance. Body tingling and quite euphoric I lay down to enjoy the trip. My speech was clear but I found myself mumbling, unable to speak above a whisper as though my chest was very heavy. It's at this point that the Codeine really took hold and I felt as though floating in a warm bath. I felt very peaceful if not somewhat detached.</p><p>The experience lasted about 6 hours from start to finish with it just fading off quite nicely. I found my breathing very labored for the peak of the trip and at points had to conciously force myself to breathe deeply to avoid panting.</p><p>I have not read any data about this combination of drugs so I would say that caution is the best route. The difficulty I found with my respiration would probably prevent me from attempting this combination again although seperately I adore both compounds and have had no ill effects.</p><p>Play safe.</p>",
 "year": "2003",
 "id": "27891",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-11-29T08:00:00.000Z",
 "views": "16367",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Ephedrine",
   "form": " T+ 0:30"
  }
 ]
}
