{
 "title": "Getting Lucky...",
 "author": "Cobweb",
 "citation": " Cobweb. \"Getting Lucky...: experience with 2C-T-7 (ID 2789)\". Erowid.org. Oct 3, 2000. erowid.org/exp/2789",
 "substance": "2C-T-7",
 "bodyweight": "155 lb",
 "report": [
  "<p>After a rather long and traffic ridden drive to NY from Boston I found myself in the middle of the most gorgeous stretch of beach in Long Island. A bonfire blazed in the sand and bodies were back lit, glowing like phantoms against the cloud covered sky. Tonight I was to be ingesting 2C-T-7 for the first time and immediately the mood seemed to lend itself to such an adventure. I wish I had had the capability to capture the trip on paper as it happened but I will have to simply jot down the sorted observations and feelings as best I can recall them.",
  "I took a 27 mg capsule at 12:30 a.m., on an empty stomach, went down by the ocean and looked at the waves which were crashing against the shore, they were amazing as there was a hurricane off the coast, the sky was alternating in patches of light and dark and the world in general was simply amazing, even before the trip started. I waited around for an hour, didn't really feel much, the very few lights which I could see on the horizon seemed to be flickering, but other than that nothing seemed unusual. Having already been warned that the trip did not really start until 2 to 3 hours after ingestion I was not worried, but rather patiently waiting, enjoying the night.",
  "At some point, about 2.5 hours into the trip, slight disorientation and nausea set in, but lasted no more than 20-30 minutes, and was easily remedied by smoking a couple of bowls.  Shortly after that things started to get interesting. I was affixed on the fire, I could not turn away from it, it seemed alive and I was utterly convinced that it was moving in time with the set our friends were spinning.  At that point my S/O asked me if I could get him some gum from my bag, as he was rolling and he jaw was beginning to get tense.  I went into the darkness, not really able to see much, fumbled around in the sand and eventually found my bag. Sitting next to my bag was a dog some of the other people at the party had brought with them, and somehow in that moment I had the most intimate deep understanding with the dog. We just looked at each other and I felt like I could read her mind. Damn weird, but really intense and beautful.",
  "I was feeling so wonderful, better than I have ever felt, I felt calm and collected and fuzzy and warm, and intricate thought patterns kept entering my head and the world as a whole just seemed to make so much sense.  Also by this time my visuals were getting intense, it had gone from having some mild persistance of vision to, in the matter of 10 minutes or so,a full-blown psychedelic light show.",
  "I brought my S/O the gum and decided to have some myself, I found this incredibly difficult and realized that I didn't really remember how to chew gum, so after a few minutes of trying in vain I threw it in the fire. All I could think the entire time was that there were no words to possibly describe what I was feeling.",
  "My S/O and I ventured away from the fire and looked into the sea where lone fishing boats lit in phosperence glowed on the tide.  The light of the boats danced and twinked and then flashing of lighting started to appear on the far horizon.  I'm sure this would have been magnificent not on 2C-T-7, but being under it's influence made the event seem so unreal and unearthy gorgeous that the only words I could muster for a good 30 mintues or so were 'Oh my god'.  The pinpoint lights to our left also added greatly to the trip as they began to flash in patterns of different colors; and what once was a small line of lights covered the entire sky in a brilliant array.  Wow.",
  "I spent the rest of the night mesmerized by everything around me, there was not much of a body load and my head felt relitively clear for nearly the entire night.  When the morning came I was still tripping fairly hard which made the change from dark to light even more spectacular.",
  "Coming down was pleasant and sleepy.  I didn't feel sick and felt quite capable of doing normal everyday things. I had no trouble sleeping and on the way back to Boston I feel asleep in the car, around 10:30am, and when we got home I slept for another 13 hours or so.",
  "All in all there were no negative effects aside for the brief period of nausea towards the beginning, and a little bit of an unpleasant hallucination of a little hostile alligator when I was trying to pee in the reeds of the beach. Took me a second to realize that it was not real but once I realized that all was well. ",
  "I would recommened this drug highly, it gave me everything I have ever in a psychedelic while also being pleasant empathenogen.  Fantastic.</p>"
 ],
 "year": "2000",
 "id": "2789",
 "gender": "Female",
 "views": "7345",
 "dose": [
  {
   "time": "0",
   "amount": "27 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2000-10-03T07:00:00.000Z"
}
