{
 "title": "2 Trips Down the Rabbit Hole Follow-up",
 "author": "plantshaman",
 "citation": " plantshaman. \"2 Trips Down the Rabbit Hole Follow-up: experience with 5-MeO-DiPT (ID 27903)\". Erowid.org. Jul 23, 2004. erowid.org/exp/27903",
 "substance": "5-MeO-DiPT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "26 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "report": "<p>Since I wrote '2 trips down the rabbit hole' much has happened and some thoughts have changed a good deal.</p><p>The main thing I want to emphasize is the muscle twitching and spasms. I wrote the report the day after but to my dismay twitching lasted about 4 or 5 months. although I continued to take foxy a couple times at lower doses, which would bring the twitching back even worse, it seemed that the pretty large dose I had that day was too much. Overall I think I took it too frequently should have spaced it at least 1 month and kept it in tihkal dose range of 6-12 mg. I feel that foxy was damaging in some way to my muscles possibly contributing to tendonitis  which I now have.</p><p>8 months later and I still think I twitch from using foxy although it has slowed considerably. I suggest anyone who suffers the muscle tremors and convulsions from fluffy space out their use and don't go beyond tihkal suggested dose.I have used foxy probably 15 times and think the lower doses are what its best for.  If you want a really powerful trip don't keep taking more and more foxy to get there. You may get pretty far after a while but for myself I find by the time my mind is where I want to be my body is in convulsions. One other side effect I have found since then is I also get insomnia for 18-24 hours. Many people dont' suffer as many body side effects and I can only speak for myself. Plz be safe and watch out for excessive twitching and possibly convulsions at those higher doses.</p>",
 "year": "2003",
 "id": "27903",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-23T07:00:00.000Z",
 "views": "11295",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "26 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT"
  }
 ]
}
