{
 "id": 2791,
 "title": "Snowballs",
 "date": {
  "submission": "2000-09-11T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dr Dempsey",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "MDA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Back in 92-93, a new kind of 'ecstasy' tablet swept through the UK rave scene. 'Snowballs' as they were known soon gained notoriety as a very strong and unusually psychedelic pill. They were allegedly manufactured in a small east-european country's government labs in an attempt to generate some foreign currency, and contained upwards of 200mg of MDA.",
  "I first encountered Snowballs at a large outdoor rave in Scotland. I purchased 3, thinking they were the 100 mg or so MDMA pills which were prevalent at the time. It was my habit to take MDMA in doses large enough to be psychedelic, which would usually entail taking 2 pills initially, followed by a top-up or 2 later on. I was warned as I bought them that these Snowballs should be taken in halves, as they were very strong. So, I took only 1 instead of my usual first 2. Soon I began to feel decidedly unusual. It occurred to me that taking another one might sort me out (it's easy to criticise this kind of reasoning when you haven't eaten 200mg of unexpected MDA). Within minutes, my surroundings, which admittedly were not all that normal to begin with, began to disintegrate into weird Lewis Carroll fragments. Physically, I felt like I was being electrocuted. As for my powers of reasoning....it occurred to me that taking another one might sort me out. It usually did. But these weren't usual pills. These were snowballs. So began by far the strongest trip of my life. Out of body experiences, communicating with strange life-forms (ok they may have been real - you used to meet some interesting characters at scottish raves), and of course plenty of furniture......furniture?",
  "Well, oddly enough, spectral furniture seems to have been an effect peculiar to snowballs - many friends have independently reported similar experiences. You could always spot someone on a snowball in a club - as they crossed the dancefloor, they would invariably squeeze past that chair (chair? on the dancefloor?), step over that little table.....I've seen someone put a glass on an invisible bar with hilarious results.",
  "So there you have it, I ate 600mg of MDA and survived. By a weird twist of fate, I just happened to have 20mg of Valium handy when I got home, which was just as well cos I think I would probably still be grinding my teeth and staring at the walls otherwise. I really don't recommend taking 3, but a single (or half) snowball was great fun. I miss them a lot actually."
 ],
 "erowid": {
  "id": "192",
  "citation": " Dr Dempsey. \"Snowballs: experience with MDA (ID 192)\". Erowid.org. Sep 11, 2000. erowid.org/exp/192",
  "substance": "MDA",
  "views": "18818"
 }
}
