{
 "title": "How to Get Wormwood Down the Hatch, and Trip",
 "author": "Rogue Psychonaut",
 "citation": " Rogue Psychonaut. \"How to Get Wormwood Down the Hatch, and Trip: experience with Wormwood & Yohimbe (ID 2796)\". Erowid.org. Oct 24, 2000. erowid.org/exp/2796",
 "substance": "Wormwood & Yohimbe",
 "bodyweight": "165 lb",
 "report": [
  "<p>Hmm...it seems to me that most other people's absinthe/wormwood experiences have been total failures... likewise with yohimbe, the other ingredient in my potion.  That's probably because a lot of users like to go overboard in order to 'increase effects' with dosage.  Yeah, like that's wise.",
  "If you can't mix a drink properly, you're never going to enjoy the stuff.  Wormwood is great--provided you have some cocktail or beverage skills.  I have not made absinthe yet, but I have been experimenting with various tea mixes for the bitter herb.",
  "My first recipe was 2 tbsp of wormwood, 2 tbsp of yohimbe (easy on this shit, too much will give you a boner from hell--convenient if you do any amateur porn, hehe), 1 tbsp of skullcap (I'm not too sure what this stuff does), 2 caps of powdered ginko biloba (for energy), and 2 tbsp of Twinings Earl Grey tea.  Eww...way too bitter.  I put in as much honey as possible and managed to stomach it.",
  "I felt something the minute I finished the first glass, sort of a dizzy drunken sensation, but more comparable to a hash brownie body buzz.  It tingled. 15 minutes later I felt (not saw) a strange, light halo effect around my head, a sensation of the crown chakra opening, as well as the third eye.  I felt sped up and energized, which I'd attribute to the yohimbe, and sort of shroomy.  The characteristic wormwood effects were that I felt like I had just taken a psychedlic.  I was thinking very clearly, speaking easily, and generally feeling very different and good weird.",
  "I couldn't walk very straight and kept dropping things or knocking things over.  I definitely felt inebriated.  My legs and arms became a little bit sore at the joints, like hash or shrooms.  I felt a real need to yawn or stretch.  Yup.  That's a psychedelic!",
  "The visuals were mild, but there was sort of an alteration of space relationships, thus the clumsiness, and a strangeness to mundane objects.  I had an easier time concentrating (the ginko?), and I felt a great sense of well-being.  On a day where I couldn't find any pot, this was quite a treat.  I decided to have another cup.  I began feeling a mashy buzz, and wanted to cuddle with something (preferably nubile and female).  I kept drinking and found that my thoughts became much more profound, but that my muscles were getting a little tense, and were quivering mildly.",
  "Being rather musically inclined, I was becoming extremely creative and wanted to play in this new mindset, so I started writing some music.  I found my composition to be more vivid and balanced, and very atmospheric.  I was also able to find enough patience to remaster some older songs I had left 'in progress.'  Now I see why absinthe picked up so well with the artists.  A very creative buzz.",
  "I had a third cup later that evening and contemplated going out.  But alas, I was broke.  Hence, no weed.  But fate struck and I found a small bud I'd stashed somewhere, so I was able to see how pot was with this stuff.",
  "Oh yeah.  That's the shit.",
  "I was getting pretty nice visuals, less of a foggy pot effect than usual, and a really warm buzz throughout my body.  Everything was super-mellow and I was nice and calm.  I slept well and had some cool lucid dreams.",
  "Most recently, I made a tea with roughly 2 tbsp of wormwood, yohimbe, and skullcap each, 2 caps each of powdered echinacea and ginko biloba, and 2 bags of green tea.",
  "I let this steep for 10 minutes, in order to get as much out of the herbs as possible.  I had no idea it would work as well as it did.  I began with one cup, about 300 mL, of the stuff, sweetened with sugar as you'd do with herbal tea.  It's actually really good with enough sugar... sort of an acquired taste similar to tonic water.  Not bad.",
  "I'm on it right now and if the way this is written is any indication this tea was a big brain buzz.  This, again, could be from the Ginko Biloba, but I suspect that it is indeed the wormwood, which I could taste more than anything else, and probably also the yohimbe.  I've been going by ear on this one, and surprisingly, it's rather potent and effective.  And my awful case of tapeworm is gone! (j/k)",
  "I'm intending to give Absinthe a try soon, if I can make some, in order to compare buzzes/experiences whatever.</p>"
 ],
 "year": "2000",
 "id": "2796",
 "gender": "Male",
 "views": "59817",
 "dose": [
  {
   "time": "0",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(tea)"
  }
 ],
 "submissionDate": "2000-10-24T07:00:00.000Z"
}
