{
 "title": "Movie Stars Turned to Hooded Figures",
 "author": "Yuna",
 "citation": " Yuna. \"Movie Stars Turned to Hooded Figures: experience with Mushrooms (ID 27974)\". Erowid.org. Feb 8, 2005. erowid.org/exp/27974",
 "substance": "Mushrooms",
 "bodyweight": "92 lb",
 "report": [
  "<p>It was at my friend Peter's 17th birthday party when I first tried shrooms. I was a small, skinny 16 year old girl who smoked and drank too much. We were sitting in his house smoking pot and drinking Jack Daniels and decided it was time to open the gifts. A couple of guys had gotten together and bought shrooms for him as a present. We decided to take some and have fun tripping.",
  "There were a few people who had done hallucigenics before. I hadn't tried them yet and was a little skeptical about it but decided to try it anyways. I don't remember how much I had, someone measured it out for me. Everyone was putting them in peanut butter sandwiches or eating them with cheese doodles but I just closed my eyes, chewed and swallowed as fast as I could and washed it down with some beer. It was disgusting and I almost threw up but managed to keep it down.",
  "After about 15 minutes, the shrooms were starting to show signs of working. Ashley was lying on her back and moving her arms as if she was swimming in water. Jake could not stop laughing. Leo threw up. I wasn't feeling much, a little lightheaded and a bit nauseous but none of the colors and visions I had heard about. I needed to pee so I got up to go to the bathroom.",
  "That's when it happened. The second I stood up, the world I had been looking at before dissapeared. Everything was in neon. Shapes were fuzzy and moving. I felt like I was spinning. At that moment, I promptly freaked out and dropped to the floor on all fours and made a sort of noise that someone later described as an 'anguished squeal'. Someone helped me up and set me back in the chair and got me to breath normal again. I had no idea what was going on at all. Then all of a sudden, just as quickly as I had felt the effect, everything calmed down. I sat back in my chair and swore I could hear some kind of beautiful elven music being played. My friends looked like movie stars. I saw Marilyn Monroe, Fred Astaire, Charlie Chaplin, Jayne Mansfield and Jimmy Dean. Everything was bright and light and wonderful. My sense of touch was AMAZING. I could feel everything. The fibers of the chair under my hands was the most wonderful thing I had ever felt. I was in some kind of incredible dream.",
  "I don't know how long I was sitting there but after a while I really had to use the bathroom. I got up and started walking to the bathroom. I felt like I was elevating off the ground and instead of walking, pink bubbles were floating me across the hall. I cannot tell you what trying to use the bathroom was. I kept stopping and looking and staring. When I was washing my hands, I swore the toothbrushes on the shelf were talking to each other and I could hear their conversation. I must have been in there for at least 20 minutes. I came back out and sat with my friend Sean. I put my head on his lap as he stroked my hair. It was the most sensual, most erotic feeling ever. Better then sex. I almost had an orgasm right there. Later I found myself sitting on the counter in the kitchen with Jake eating a plain bagel and singing something.",
  "5 minutes after coming back to the living room, it started to get bad. I was getting really cold and my lips turned blue. The pretty things I saw before were turning into dark, twisted, mangled shapes. The movie stars were gone and in their place, hooded figures with long gangly fingers that kept reaching out towards me. People were trying to calm me down but I was so scared. When someone grabbed my arm to try and help me off the floor, I screamed and began crying. He looked like a horrible demon monster and he was breathing fire. Finally, Leo picked me up and brought me into a seperate bedroom and lay me on the bed. He pulled the covers up to my neck and got into bed with me. He held me there for about an hour while I was crying and yelling and whimpering. But I finally started to calm down. I was afraid to fall asleep so I just stood awake staring at the blue wall.",
  "By then I had come down a little bit and went back to the living room. I smoked some pot and felt a lot more relaxed. It had been about 5 hours since I had taken shrooms and I was almost off them. I slept over Peter's that night, like everyone else. I was pretty tired and passed out right away. The next day I woke up at 3 in the afternoon and had some coffee. I was a little tired, but that was all. No side effects or anything.",
  "My first experience was both good and bad. Since then, I've had nicer trips. I find that acid is much better then shrooms and I prefer it over anything. But my first trip was a memorable one, and I don't regret it.</p>"
 ],
 "year": "2002",
 "id": "27974",
 "gender": "Female",
 "views": "5806",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2005-02-08T08:00:00.000Z"
}
