{
 "title": "So Very Sick",
 "author": "Yuna",
 "citation": " Yuna. \"So Very Sick: experience with Cocaine (ID 28008)\". Erowid.org. Feb 8, 2005. erowid.org/exp/28008",
 "substance": "Cocaine",
 "bodyweight": "92 lb",
 "header": [
  "DOSE:",
  "3 lines",
  "insufflated",
  "Cocaine",
  "(powder / crystals)",
  "",
  "1 ",
  "smoked",
  "Tobacco - Cigarettes",
  ""
 ],
 "report": "<p>I first did cocaine when I was 15. Now a year later, I only do it occasionally, if it's around. I have yet to buy my own coke because I don't want to become a cokehead.</p><p>Most of the times have been nice. A few times I've had nosebleeds and headaches but for the most part, it was good and I enjoyed it. Once a few weeks ago, I was hanging out with my good friend Sean and he asked me if I wanted any coke. He gave me a small baggie with some of the stuff in it and around midnight later that day after I went home, I decided to have a little bit.</p><p>I tapped it out onto a mirror and cut it up with my library card. Then I rolled up a 5 dollar bill, bent down and snorted a line. I did 2 more after that, making a total of 3 lines. No nosebleed, no headache, just that lovely sparkling feeling behind my eyes and in my head I always liked. That done, I cleaned up, lit a cigarette and sat down to watch Pulp Fiction on tv.</p><p>About 5 minutes later, I started to feel nauseous. My stomach felt like it was folding itself over and since I hadn't eaten anything that day, the stomach acid was hurting real bad. I massaged my stomach and lay down on my bed and tried to relax but it wouldn't go away. I tried to hold it in, telling myself it would pass but finally, after several minutes, I ran into my bathroom and vicously puked. Since there was nothing in my stomach to throw up, I hacked and coughed up bile which stung my mouth and tasted like shit. I stumbled back into my room and grabbed a water bottle and chugged it, hoping to throw it back up to get it out of my system. I immedietly threw up all of the water straight away but didn't feel any better. Feeling like I was going to die, I stumbled down to the kitchen and got a few more bottles. Then I came back upstairs and back into my bathroom, drank a bottle, threw it up. I continued this pattern for a while. Drink, puke, drink, puke, until finally I felt a little better.</p><p>I climbed into my bed and curled up under the covers, shivering and cold even in 2 sweaters. I fell asleep sometime that night and woke up the next day cold and thirsty and dehydrated. I drank tea and slept for most of the day to recover.</p><p>That was the only bad experience with cocaine I ever had. I don't know why I had such a bad reaction to it, the friend who had gave it to me assured me that it was good stuff. I've done it again since then and it's been fine. But being sick on coke sucked alot.</p>",
 "year": "2003",
 "id": "28008",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-02-08T08:00:00.000Z",
 "views": "33163",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
