{
 "title": "They Left Me, I Don't Blame Them",
 "author": "Aaron",
 "citation": " Aaron. \"They Left Me, I Don't Blame Them: experience with Cannabis (ID 28002)\". Erowid.org. Oct 30, 2003. erowid.org/exp/28002",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "report": "<p>I am no virgin to cannabis, but as most drug users know, if you do drugs, bad trips are bound to happen.</p><p>So I was in the woods with two of my friends and we had just rolled a nice 1g joint. Not alot of weed, but enough to keep us relatively high for most of the night. So after we smoked the joint we began to smoke some cigarettes. Due to the fact that I had just smoke some weed, I felt some hunger coming on, and food sounded great. I made the mistake of choosing not-so-great foods for the experience, and I also did not wait to finish smoking the cigarettes before I indulged.</p><p>So there I am, sitting there, smoking my cigarette, eating my chocolate-peanut butter cookies, drinking orange juice (How could I have possibly thought the mixture of the three wouldnt make me nauseous, guess it was the weed), and listening to some prime Drum and Bass tunes on my mp3 player. After about 5 minutes of straight sip, cookie, drag, sip, cookie, drag, I got really sick-feeling. I got up to try to walk it off, but that only made it worse. Eventually, as my two friends are tripping out and enjoying there nicotine, I laid down on this platform of wood that we were all standing on. Since we had been smoking, there was spit everywhere. Disgusting, but I didnt care, I was too weak to get up.</p><p>Just as I thought that I may never move enough to get out of the forest again (well, at least until the trip ended), my friends decide they are going to go to the convienence store to get some food. I pleaded for them to stay, whining about how I was tripping hard and was unable to move, but once I realized that they were high, and nothing was going to stop them from getting food, I reluctantly assured them that I would be okay, as long as they made sure to come back for me.</p><p>So there I am, once again, laying on the spit covered platform tripping out hard, and wondering how I was ever going to get out of this woods. Alone. Every time I forced myself to get up and try to move around, the nausea would set in and I would have to lay down again to keep from vomiting. I finnaly gained the energy to sit in a plastic chair in the middle of the platform. I sat there, still sick, listening to my music to try to calm me down. Even though I had my tunes blaring, I could still hear the animals of the night frolicking around me. Scary. Fucking scary. I then decided, that I had to get out of there. So I got up all of my strength and started my journey through the woods, not knowing where I was going, and how I would get there, and having to stop walking because I felt as if I was going to throw up gallons. You know that salty, warm, tingly feeling you get before you vomit? I got that every 10 seconds, while trying to wobble my way through the woods, at 9:30 at night, pitch black, trees hitting me in the face, and my ankles being killed by stepping on so many rocks and branches and twisting them.</p><p>Finally I made my way through the woods to where I could see the light of the building outside of the wooded area. Once I was out, I proceeded to walk the streets to try and find my friends. I finally found them, which was a relief, but I still felt extremely nauseous. We started or walk back to wherever, and I had to stop because I was certain that I was going to throw up.</p><p>I stopped and leaned over some grass. Back then, I didnt know that weed made it hard for me to vomit, so I tried my hardest to, so that I could possibly feel better. No avail. I sat there in the grass, moaning and groaning for all I was worth.</p><p>Now everyone knows that when you are stoned, you get the the pasties (or cottonmouth), but for me, this was the exact opposite. That warm tingly feeling came back, full throttle, and I started drooling buckets. I mean literally. My mouth was pouring drool and the insides of my mouth felt like it was a vibrator turned on level 'ANNHILATE' while being cooked at 200 degrees. My friends thought I was puking my guts up, but it was just drool. Very odd, and very scary.</p><p>Eventually, all of this subsided and I felt alot better. We proceeded to walk to my friends house, and I felt fine after that. I guess even though I didnt throw-up, all of that drooling made me feel a hell of a lot better.</p><p>The moral of the story, kids, is that getting sick while tripping hard is NOT fun. But, for me it was definitely a memorable experience. I tried to lie to myself and say that I would cut down on the weed after that, but sure enough, I was out the next day, same spot, smoking abother fatty. This time though, there was no cookies, or orange juice. I still cant even look at those damned cookies anymore.</p><p>Thanks,</p><p>Aaron.</p><p>Oh, and sorry for any typos, I dont feel like reading this over.</p>",
 "year": "2003",
 "id": "28002",
 "gender": "Male",
 "timestamp": "2003-10-30T08:00:00.000Z",
 "views": "8343",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
