{
 "title": "Given Half the Chance a Very Good Experience",
 "author": "Wicked1gottagun",
 "citation": " Wicked1gottagun. \"Given Half the Chance a Very Good Experience: experience with AMT (ID 28081)\". Erowid.org. Mar 11, 2008. erowid.org/exp/28081",
 "substance": "AMT",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "5-MeO-AMT",
  "(powder / crystals)"
 ],
 "report": "<p>Well here it goes...  It was very random that I would goto this rave, scream 5 at that, and i was just hangin around doin my own thing and stuff when someone asked me if I wanted any AMT. i contemplated for a minute or two (literally), then i said what the hell, i copped a 20..  the dude who hooked it up said that there was enough for 2 doses there, i dont know how many mg or anything, but ill explain how it came</p><p>it was in a piece of paper, maybe a inch square folded intrequetely (sp.) with the amt on the innermost portion.. im gonna venture to guess between 40 and 70 mg..  and boy do i have to say it was one of the best 14 hours ive ever spent in my life.  First of all, bieng at a rave is strange for me, i dont really like raves, or techno music that much, but my friend was in a bind so i went with her.  this just made everything so much better.  it was like candyflipping but sans-brain rot.  now bieng 4:30 the day afetr, im still awake still feeling the trippyness of the amt.</p><p>I licked the line at around 2 AM, around 2:45 i started to feel the trip coming on, auras etc.., at about 3 i got naucious, my mouth was watering like i was going to throwup but i didnt, these went away after about 10 minutes of dealing with them.. by 3:30 i felt like i was rolling FACE, visuals were coming a lot more commonly now, everything was awsome.. it was the most peaceful thing ive ever experienced in my entire life. </p><p>We left the rave at 4:20, and started our 2 hour drive back home.  the whole ride home was soooo intense..  I can handle my trips very well, never in my life had a bad trip *knock on wood*.. on the 4th of july i ate a 1/4 and a 1/8th of mushrooms and roamed around boston watching the fireworks and such, great time but anyway.. this was far more intense then even that amount of psilocybin had done to me..  not visually but as far as my thoughts and just thinking about random stuff that would only make sence to me.. </p><p>we finally got back to my friends house at 6:30 in the morning, i was stillll tripping balls and everyone else was ready to goto sleep and crash out after the rave n stuff, i kept my friend J up all day with me hehe hope shes not mad ;) she had fun with the 'trippin kid' lol we talked about stuff and defenitly bonded a lot throughout the day..  and it wasnt that type of bond you get with soemone you rolled with the night before,  thats a fake bond, this was actually meaningful and everything.. with me, every time i trip it is always a life changing experience.. for the better, i always learn something new about someone or myself.</p><p>It is now 4:40 (14 hours after initial ingestion) in the afternoon, im still awake from last nights party, still feeling mild effects from the AMT, things are blurring out of the corner of my eyes, the computer screen is wafting in the 'breeze', and my lizard (i have a bearded dragon) is pulsating. periodically, everything in my vision will get a tint of green to it.. some people experience that when they trip experience tints coloring everything around during the post-stages..</p><p>I would have to say, that now seemingly coming out of this wonderful experience, that the only thing that I want is to try it again.  I have heard from a couple people that AMT isnt the same the second time around, but everyone reacts differently to everything.  Ill just find out for myself thank you very much. :)  One reccomendation is to not take AMT at a rave or any place that youre not familiar with or comfortable in, as with any trip setting is key, bad vibes can put you in bad place.  Thats all i have to say at this moment, i feel very sleep deprived and ready for ni-nites..</p><p>Be safe everyone..</p><p>'Know your body, know your source, know your limits'</p>",
 "year": "2003",
 "id": "28081",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-11T07:00:00.000Z",
 "views": "3687",
 "dose": {}
}
