{
 "id": 2812,
 "title": "Strung Out and Tired.",
 "date": {
  "submission": "2002-12-17T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sunchaser",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "oral",
   "substance": "TMA-6"
  }
 ],
 "report": [
  "I felt confident that 40mg wouldn't be too much although I did have some reservations about the 12 hour duration and the expectation of high body load.",
  "The two of us took the TMA-6 at 9 in the morning whilst still in a fasting state. It started to kick in after 45 minutes and built over the next couple of hours to a plateau which only lasted a couple of hours.",
  "There was a nagging abdominal tension that felt it might get worse but didn't which was a mild peripheral irritation fort he first five hours.",
  "The suggestibility of the music was excellent, closed eye visuals surprisingly good, but the external reality whilst shifted was not aesthetically enhanced in the way 2C-I (for example) did. The sexual/sensual feelings were excellent once I gave into them and I found myself gasping in pleasure.",
  "Conversation flowed easily with some insight but without the empathy of 2C-I, although I my feelings deepened and realised that whatever feeling is felt just needs to be expressed not resisted for joy to emerge. My realisations for the day were to feel gratitude not guilt and how important mutual autonomy is in my relationships.",
  "The downside was that I felt like I had been put through the ringer by the end of the day and felt my nerves were frayed. Even after 14 hours, sleep didn't come easily, and I felt that because of the amphetamine effect it just lasted too long. I am not sure if I would do it again when I have more attractive psychedelics at hand."
 ],
 "erowid": {
  "id": "19256",
  "citation": " Sunchaser. \"Strung Out and Tired.: experience with TMA-6 (ID 19256)\". Erowid.org. Dec 17, 2002. erowid.org/exp/19256",
  "substance": "TMA-6",
  "views": "13968"
 }
}
