{
 "title": "An Effective Dose Level",
 "author": "Duggin",
 "citation": " Duggin. \"An Effective Dose Level: experience with 4-Acetoxy-MiPT & Cannabis (ID 28132)\". Erowid.org. May 19, 2006. erowid.org/exp/28132",
 "substance": "4-Acetoxy-MiPT & Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>Mindset & Setting: I was tired going into this.  I'd been up for a day and a half, but got sleep the night before this trip.  I didn't feel particularly tired, but I knew my body was.</p><p>Experience: This was my first time trying this substance.</p><p>Preparation: The 4-AcO-MiPT I had was very sticky, and in the time it took to weigh my dose out (just a few minutes), it had gotten twice as dark as its original tan color.  It was now brown. It dissolved over a matter of minutes into my cup of water (without stirring), and was in 2 stuck-together chunks when I dropped it in.  It's so sticky and clumpy that it would be nearly impossible to chop it up into powder.</p><p>------------------------------------------------------</p><p>9:48 start drinking my water with 8 mg 4-aco-mipt HCl in it.  This stuff tastes horrible.  I can taste it with every drink.  It's pretty bitter.</p><p>9:56 start smoking a joint with my water.</p><p>10:05 done drinking the water.  I only smoked a quarter of that joint.  I'm high for sure.</p><p>10:13 I'm seeing trails from my arms moving, etc. and I'm VERY FUCKING HIGH.  I am very cold as well.</p><p>10:15 I'm seeing awsome patterns in the floor. and on the walls. </p><p>10:17 A bit of tremoring, it's like parts of my body have shivers, and others don't.</p><p>10:20 I got under my covers on my bed and the shivering stopped.  I was pretty cold. I just turned the fan off.  Not so cold anymore.</p><p>Visuals are pretty strong now.  Great patterning everywhere now, and I'm getting aural hallucinations of the computer fan wahing.</p><p>10:31 patterning when I close my eyes.  heavy visuals from this stuff. strangely enough, visuals are heavy with the lights out as well.</p><p>10:38 I smoke more of the joint.</p><p>10:45 tripping pretty hard.  not so hard I can't type though.</p><p>10:48 it looks like the wall is the floor and I'm penned up agains a wall when I lean back in my chair.</p><p>10:49 my perceptions are changing a lot, but I think I could still hold a conversation with someone.  I'll see when my brother come in in a minute.</p><p>...can't really understand some of the stuff on TV.  Communicating with my brother is relatively easy.</p><p>11:35 I'm stoned.  colors are changing every now and then.  I'm really tired from having stayed up the last few days... I don't think the joint helped my tired state.  I just want to go to bed again.</p><p>11:41 bed.</p><p>12:24 so tired but I can't sleep.  I lay on my bed, not wanting to get up, but I can't fall asleep. The weed is wearing off now. The visuals are still pretty much here.  As well the aural hallucinations </p><p>12:39 I'm definitely coming down, and not tripping as hard as I was.  I just smoked that J down to the paper and I still feel this way about the 4-aco-mipt.  Visuals are still here, but it's just less intense now.  the visuals just don't move as fast now.</p><p>...Going back to bed.  I'm tired, but I just can't fall asleep so far.  It's very strange.</p><p>1:45 hallucinations are still there, but they're not as intense or plentiful as they were.  Not overtaking like they were.  I can't sleep.</p><p>2:53 things are chilling out.  I'm returning to 'baseline' but things are still giving minor trails/other patterning like visuals.</p><p>3:40 things aren't moving around that much. Patterns on the ceiling are there, but not moving fast at all and tracers are minor.</p><p>4:20 visuals almost all gone.  slight patterning on the ceiling.  slight tracers.</p><p>4:52 almost baseline.  I'm hungry and tired. going to go to bed.</p><p>Sleep was good, had interesting dreams.  I am amazed that this dose level was so effective.  I'd like to take this substance again sometime when I'm not so tired.</p>",
 "year": "2003",
 "id": "28132",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-19T07:00:00.000Z",
 "views": "6428",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-MiPT",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 0:08",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  "2": {
   "time": " T+ 0:50",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
