{
 "id": 2815,
 "title": "Hyperaware of All Things Aural",
 "date": {
  "submission": "2002-12-03T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dodger6118",
  "gender": "Male",
  "weight": 127
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40",
    "grams": 0.04
   },
   "administration": "oral",
   "substance": "AMT"
  },
  {
   "time": "3:05",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "AMT"
  }
 ],
 "report": [
  "T+2 And boy howdy am I feeling some kinda ansy... but its strange cause my mind is completely clear.",
  "I am having a little problem typing, but its to be expected with jitters like this. My mind is also running at lightspeed and my throat feels a little closed... like when you're not feeling well, not like when you're allergic to somethign and in deep shit. Had some really minor stomach woozies and the occasional back discomfort, but nothing bad. Oakenfold sounds very nice.... I've also noticed sucking on a throat lozenge (to help cure jaw clenches) has become hard... choked up on it twice cause I wasnt paying attention.",
  "T+2.75 I think I'm going to try playing Medal of Honor online.. this should be really amusing.",
  "Got done playing... I've noticed if anything my skills have increased.. reaction times are way up. no trouble performing in the game at all... in fact i came out in first place 5 maps in a row.",
  "T+3.5  Took another 20mg... it doesnt seem to be having the psychedilic effects I'd hoped for, though it is relatively early in the experiance. The previous test subjects (from my group) didn't report any of the hallucinogenic effects.. I'm thinking we mis measured on the low side as everyones experiances were more in tune with what some described while on 25-35mg. Plus I'm a bigger guy... over 250lbs. hopefully I'll get to see some visuals... it's thanksgiving... i wanna be thankful for at least something. The one really good thing I've noticed so far is the complete lack of holiday depression. i can justify and deal with ANYTHING! at lower dosages, so far this is an ideal party drug. I'll report in after peak and ride out to see if I still think this way.",
  "T+4.. got orbital.. the second album... in right now and boy howdy is it ever neat! their time changes and loopbacks are just sooooo phat. I'm feeling pretty trippy/cool/racy all at the same time. The fact I can still form coherent thought processes and sentences is a trip in and of itself. I can totally see my lame ass dancing like a fool at some club while hopped up on this. being rubbed feels really good.. CEV's have started though minor at the moment. I can breifly see one big ass atom floating behind my eyes.. with silver colored electrons floating around it.. all CEV right now. Gum is good... gum is necessary... though the clenchy jaw isn't what i feared it to be. I've had WAY worse on lsd. Very little nausea at all, practically none. I could almost attribute what I did have to psychosomantic effect. I haven't eaten today so my stomach has been empty well over 12 hours",
  "I'm like a kid at x-mas waiting for some killer visuals. I can feel the beginnings of a peak at the edge of consciousness... like an asteroid just entering the atmosphere of the earth on a course of assured destruction. I've no fear though, so far I've handled WAY stronger than this and come out on top.",
  "I'm really looking forward to this.. it's been a really long time since I've had some 'inner-me' time",
  "I think I am going to try a shower... hehehehe",
  "T+5... started to blow up a little... got oakenfold's 'starry eyed-suprise' stuck in my head. laid down all snug and warm and ended up with a little 'oral pleasure'... Sexual activity on this was amazing.. Thought I saw god when I had an orgasm... seemed to take minutes to recover from the bliss. Getting some 'sparkly' open eye visuals.",
  "T+7... well i think... I peaked. It wasn't what I thought... got some warping going on visual wise. Held down a couple snacky-cakes, which is good.. I *think* I'm hungry.. I know I should be. I've got some really light trails and colors look a bit brighter.. but so far it's not performing as I though. I still feel pretty awesome, body buzz is still up a lot. Nickelodean is fairly entertaining.. much better than 'the men who killed kennedy' fuck that! No thoughts of violence or killing here damnit... though it didn't bum me out to flip through that channel, I just felt compelled to move along. Also, this is going to sound really odd.. but my eyelids seem thinner.. when I close my eyes and look towards the monitor its SOOOOO bright. All in all I'm more ansy than anything. I want to go out and do something, maybe get some food or something. Its thanksgiving though so almost nothing will be open.. how ass. I don't have that 'beat up' feeling some people claimed to have, though the jaws have yet to let up. Amazingly though I don't have that 'I just wish I could come down feeling' which I almost always get on acid. CEV's got pretty cool for a bit. Not what I would call intense though. Still think it would be a nice party drug. Talking became difficult for awhile... not forming the thought, just the part where I open my mouth and make sound. It was weird because its not like when you're on acid and you've got that confused catatonic thing on, I could totally think clearly, just wasn't doing the physical aspect of the act.",
  "T+8 Still way up body-wise.. got some head going on still too. I still can't seem to tune out background noise at all.. I'm hyperaware of all things aural... Cant... shut... out... BILL COSBY!!!!  lol.",
  "T+9... not much change from T+8. had a chicken sandwich, hopefully it won't upset my stomach.",
  "T+10.. Basically the same as before... no nausea from the sandwich. Beverages have an odd taste to them, kind of unpleasant.",
  "T+12... gradually wore off but at a really quick rate... have some muscle tension in the back.. jaws are still a little clenchy and it feels like I may have a headache coming on...other that that seems like I'm completely down",
  "Overview.. from what my experiances are, I'd say its a great party drug. I didn't experiance any of the heavier effects described in some of the other entries. All in all I was a little disappointed. I expected a lot, and got minimal effect."
 ],
 "erowid": {
  "id": "19264",
  "citation": " Dodger6118. \"Hyperaware of All Things Aural: experience with AMT (ID 19264)\". Erowid.org. Dec 3, 2002. erowid.org/exp/19264",
  "substance": "AMT",
  "views": "7970"
 }
}
