{
 "title": "Lemonade is No Substitute for Water",
 "author": "Amazing",
 "citation": " Amazing. \"Lemonade is No Substitute for Water: experience with Mushrooms (P. cubensis) (ID 28168)\". Erowid.org. Apr 30, 2007. erowid.org/exp/28168",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "report": "<p>All names in this story are marked with letters of the alphabet (A, B, C, etc.)</p><p>It was friday after school, and I heard that my friend, Z, was picking up an ounce of mushrooms.  I had done it a few times, but only actually 'tripped' once, so I was anxious to do it again.  Saturday rolled around, and I got to take a look at them, and they looked very powerful, so I decided to only take a little more than half an eigth, instead of the eigth of less-powerful shrooms I had taken during the summer.  There was a big group of us planning to trip, and we all wanted to do it at the same time.  So, finally we all got our courage up, sat in our cars, divided up all the shrooms, and ate them.</p><p>After eating them, I said 'I'm having second thoughts', and my friend A said dont worry about it, its normal.  I decided I should fill up my water bottle before the experience began, because whenever I am under the influence of a drug, I like to drink lots of water, its kind of a soothing feeling.  So, I go into my friend MI's house and fill it up, and I am already noticing slight effects (I had chewed the mushrooms for a long time, in order to make the experience start quicker and more intensley).  I felt like my head was full of cotton balls, and my legs were feeling tingly, kind of like the feeling of a percocet, or an oxycodone (2 painkillers I am very familiar with).  Either way it felt extremely good, but also disturbing in a way, probably because I was a little nervous about what might happen.</p><p>I walk outside and talk with my friends, and they say that they feel the same way.  For some reason, I feel as if my trip is beginning to accelerate a lot faster than my other friends, because I am already starting to notice slight patterns in the concrete.  We all decide to take a walk through the woods, I am reluctant at first, because the green of the trees was a little overwhelming.  The effects were climbing higher and higher at this point.  It had been about 20 minutes since I had eaten the shrooms, so I knew It wasnt just in my head. </p><p>Now were halfway in the woods, and my friend Z is trying to explain something to me that I had actually asked him about, but I couldnt even remember what I asked him, or even distinguish anything that he was trying to say.  I was going into my own little dream world.  'No hallucinations yet' I noted, but I was definatley having some extreme time dilations, and a intense body high.  It seemed like we had been walking through the woods for about 20 minutes, I looked at my phone and it hadn't even been a minute since we entered the woods.  This is when things started to get really wierd.</p><p>We got to our 'spot' in the woods where we usually either drink or smoke weed, and i felt very uncomfortable and hot.  I asked my friend M how he felt, and he said he felt the same way.  I remember pacing, hearing jumbled up words all around me, I felt a kind of nausious feeling, and breathing was a task.  My mind was still somewhat intact, and I realized what was happening.  I was being overwhelmed by all the voices, and I was already out of water.</p><p>Thats what worried me, the one thing that could soothe me had run out, and I frantically began asking people for sips of water/lemonade.  My friend E gave me a sip of his lemonade, and it was a drastic change of taste from water.  I said 'remind me not to drink that the rest of the day', he sort of laughed, and said 'okay dont worry I wont.'  More pacing, I needed my own water, I didnt want to have to ask people for water constantly.  I asked my friend M if he wanted to come with me to get water, but he was definatley feeling it too and he was unresponsive, and also I could almost read his mind and understand that he didnt want to leave the woods. </p><p>My non-tripping friend D had noticed my frantic state, and offered to come with me.  I felt so happy that he was going to come with me, because I never would have made it out alone.  On the way back to MI's house, me and D talked.  He asked how I was feeling, and at this moment all of a sudden a crazy dizzyness overpowered me, and when I finally came to, I was watching myself walk next to D.  I couldnt think independently anymore, my real brain had been left in my body ahead of me.  The strange thing is that my body was not a solid, it was a translucent figure that left a trail of its previous step behind, and this went on for about 10 minutes of my tripping time (which was really about 5 seconds).  Realizing that I had not responded, I attempted to tell him what I felt like, and as soon as a word came out I went right back into my body, and I told what I had just felt.</p><p>We make it out of the woods and we are in a parking lot, the cars are all lined up next to each other in real life, but in my eyes it seemed as if some of them were right in front of me, and the others were about 100ft away, when all of them were really about 15ft. away.  I was trying to talk to D but he obviously couldnt understand me.  Then something bad happened, MI's house was locked, and there was no way I wanted to go all they way back, even though it was really just a 3 minute walk, it seemed to take 3 hours.</p><p>By now, I did not even know how long I had been tripping for, but I think it was about 20 minutes, but it seemed like almost a whole day had gone by already.  I got a little panicky, and looked at my friend D for a plan of what to do.  I was thinking about going to  a strangers house to ask for water, but D persuaded me not to, and thats why its very important to have a person with you that is not tripping.  But as I looked at him his face started getting bigger, fatter, shorter and longer over and over again.</p><p>I enjoyed it, but I was too worried about my water, and I noticed my friends were all coming out of the woods so I looked over at the opening, and the pavement under me turned a neon-green liquid color and started to ripple.  I tried to walk while looking down, impossible.  I looked up and walked normally, but after my eyes adjusted to my surroundings, everything around me came to life, it was all breathing.</p><p>I made my way to MI and grabbed his keys without even asking, and walked back to his house.  M followed me, we went into the house, I got my water and felt instantly better, but still had difficulty breathig a little bit.  M took ice out of the freezer and put it on his head, and knocked over some cheerios while doing it.  We began laughing and both agreed that it felt like we had been living there for years, it seemed so strangely familiar, the kind of feeling you get only at your home, but it was not our home.  We both look at the cheerios and they are hopping towards M, it was absolutely hilarious.  We both stared for a long time, and then MI came in saying 'cops are here, cops are here'. </p><p>Panic.  Lots of it. 'Is this a joke cause its not funny man'  I said, hoping it actually was a joke.  MI said 'no, stay in the house im going out to talk to them.  Me and M are both panicking, and my other non-tripping friend MA says 'dont worry its not a big deal they dont know anything.'  I didnt care if he knew the truth or not, it was definately reasurring.  I still wanted to crawl into a hole until it was all over though.</p><p>I said 'I wont allow myself to get arrested', it seemed to make sense at the time, and it meant that I would panic so incredibly bad that I would do anything I could to avoid arrest, or even confrontation with a cop.  MI came rushing back in and said 'theyre searching cars, STAY IN THE HOUSE'. My mind was racing, the only thing that comforted me was the words of MA, and the fact that this had happened the previous night and nobody got in trouble for what they had in the cars, but that was beer, NOT MUSHROOMS!  My inner monologue was going absolutely nuts.  I sat and waited.  And waited.  And waited.</p><p>During this time everything was very distorted and out of proportion, the walls were breathing, and I heard sirens(not real, in my head but sounded so real).  I finally calm down, and I am beginning to enjoy my trip again, and then I hear a bang on the door.  Heart racing, Panicking, I go to the door, open it, and gave out a sigh of relief, no problems, nobody in trouble, and some new faces also come in. </p><p>More crazy hallucinations happen for a while.  Music is intense, vibrating through my body, each song sets a different feeling/setting.  Lights seem magical.  I find it difficult to know who is tripping and who is not, because a lot of us were, but only a few werent.  I made the mistake of trying to relate to someone that was not, and even though they thought it was funny I felt stupid about it.</p><p>The rest of the night was not very eventful, just a lot of less intense hallucinations, and parties.  We took the shrooms at around 3:45, I was tripping until around 11:30.  This just shows that you have to know the potency of your mushrooms before you take them.  My friend MS and K did not know, or did not care, and took a full eigth, and both of them felt intensley nausious, and both vomited.  I tripped a lot harder with about 2 grams as I had with an eigth the previous time. </p><p>After this experience, I feel a lot closer to the people that I talked with during the trip, and the trip made me realize who I am most comfortable talking to.  I also appreciate music so much more, I still get the intense feeling that I got from the music when I was tripping, I now feel very happy whenever there is music, with exception to certain kinds of course.  I also look at things differently now, and I am more careful about being mean to people, its just not worth it in the long run.  I will definatley trip again, maybe even next weekend, who knows.  All I know is that 2 grams of that stuff is all I can handle, and wouldnt dream of having any more.  My advice to everyone is be careful how much you take, it may be stronger than you think, but if you choose to do it anyways, its your trip and make the best of it.</p>",
 "year": "2003",
 "id": "28168",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-30T07:00:00.000Z",
 "views": "2853"
}
