{
 "title": "Alien God and Mushroom Prophecies 1",
 "author": "TrYPtaMinE",
 "citation": " TrYPtaMinE. \"Alien God and Mushroom Prophecies 1: experience with Mushrooms - P. cubensis (ID 28170)\". Erowid.org. Dec 17, 2004. erowid.org/exp/28170",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "180 lb",
 "report": "<p>It was a warm October Friday night, a full moon was out, and I got a hold of about 3/8ths an ounce of Psilocybe Cubensis mushrooms.  Psilocybe Cubensis are the most commonly found mushrooms, due to the fact they have about moderate potency and are easily cultivated. With my 8:00 dinner I ate a bowl of salad with ground flax seed on top (rich in the Omegas which are good for the brain), took 2 all natural multi-vitamins, folic acid and b-complex. My blood type is O+ so I naturally need more of the folic and b12 as my body burns them quickly. </p><p>I ate exactly 5 dried grams at about 9:30 of 10 PM.  I ate a generous bite of banana nut bread, chewed it and put as many shrooms in my mouth as I could, until I tasted shrooms.  Knowing I had a while before they kicked in, I took my shower and prepared for bed as usual.  I filled a 1.5 liter aquafina bottle with water and set it next to my bed.  I turned off my fan, stereo and even my computer.  I did not want even the slightest hum to interfere with my trip, taking Terence McKenna's advice of engaging in a high-dose trip in the dark of your own room where you feel comfortable and will not be disturbed.</p><p>A bit nervous as this was my first trip over 2 grams, I noticed a slight 'head change' after about 45 minutes and decided I had better tell my parents goodnight and get to bed, or I would have to tell them after the trip started, lol. I climbed into bed about 11:00 or so and relaxed in the quiet as if I was going to sleep, although I knew there wouldn't be much of that tonight.  I was still nervous and calming myself with slow deep breathing (nervousness is normal for me, even without shrooms). I waited and waited for my trip to start, unaware of what was going to happen.</p><p>Finally!  Is seemed like forever!  Anywhere around 11:15-11:45 (time was the last thing on my mind at this point) my trip started.  First it started as an auditory ringing in my head, much like ones ears ring, but this had a deeper 'sound' to it.  After a few minutes it evolved into some sort of energy flowing through my head.  I plugged my ears, no change.  Was I perceiving AM or FM radio waves?  No, this had a much slower vibration type energy to it than a radio wave would.  The wave continued to increase in intensity.  My curiosity soared!  What is this?!  It had a feeling to it, like I was floating through the hyperspace of our universe.  My head felt extremely large compared to how my body felt.  I felt like I was all mind.  My physical self seemed so small.  It was a pleasant feeling.</p><p>I then seemed to hit a peak with the energy, it seemed to stabilize itself to a sustained level.  Then visualizations started. I was somehow in control over my visualizations, but saw them from a completely different perspective.  I had visualizations that almost defy description.  They were crystal clear, I couldnt have seen them clearer if I had seen them with my eyes.  I could 'ask' a question and get a visual answer, or ask for a visual and get the visual telepathically transcended across time and space to me.  By 'ask,' I mean to think the question.  Somehow an answer would get 'thinked' back to me.  This 'thinking' and 'asking' defy language as we know it.  It seemed that I was communicating with something, something not from this world.  Communicating with thought, not with words.</p><p>The mushroom almost seemed like it was built or designed to dissolve the ego.  This dissolving of my ego was like the defeat of an evil demon that had dwelled inside me my whole life.  It made me feel like an animal, or organism more than I felt like the human me.  During this 'ego death' process that took place, the mushroom seemed to equalize my mentality to a certain level.  The mushroom seemed to pull out who I really am,  assured me that everything was fine and was really pushing me to overcome my fear of what others think of me (which is my biggest fear) and take on the religious belief of the mushroom.  It destroyed the mentality that made me feel like 'I was the shit.'  The human ego, the typical male ego that thinks he is the best looking, that he is the smartest was gone and so was the ignorance that comes with it. </p><p>How many people admit they are ignorant, dumb or ugly?  Not very many, but most would agree that the vast majority of the human population is ignorant, dumb and ugly. </p><p>All this went on for 30mins - 1hour, then the energy I was feeling flow through my head took a steep incline over a period of about 5 minutes. What I thought was already a massive 'thing' communicating was dwarfed by something so HUGE that it felt like the universe itself or larger compared to an earth sized object before.  Both of these objects can only be described as being empty space, but they were somehow there, somehow occupied by something that was communicating with me. </p><p>Now the energy that I felt through my head intensified and the 'wavelength,' as I call it, seemed to speed up.  The energy now felt like it was flowing above me, but was still in my head at the same time.  I got up from being relaxed in bed lying down and turned on my lamp by my bed and drank some water.  The lamp has a 40 watt bulb and points toward the ceiling, giving me a perfect soft indirect light for trips.  I tried not to drink much water, even though I felt thirsty.  Dont do that, drink lots, and see my trip tip list at the end.  I used the restroom, on the way there I was looking at everything, how real it all looked.</p><p>I came back to my room and laid on my back, closed my eyes and thought the question 'What is to come?' I meant as a prophecy because I had been reading about that, but whoever was communicating knew what I meant.  And WOW again!  Visions of war, disaster and possibly even martial law filled my head.  I saw a US soldier wearing a gas mask pointing a gun at a civilian who was laying on the ground trying frantically to get back.  The soldier was yelling at him 'get down!'  This civilian (looked American, but dont hold me to it) was literally scared shitless.  What I made of the vision was: some natural disaster, possibly the Great California Earthquake and martial law was enacted.  I dont know when this vision was taking place, but somewhere in the near future (near as in within a few years).</p><p>I thought, 'I had better go tomorrow and buy me a gas mask,' and then I had a terrifying vision.  Some type of chemical attack happened, I had my gas mask on and then looked at my family.  They looked as if someone splashed highly corrosive acid all over their faces.  They stood together like in a family portrait, all facing me.  My mom, dad and brother, all looked at me as they slowly died.  I pulled off my mask, I was not going to let my family die before my eyes, I would die with them.  Too late, because of my greed and selfishness in only buying me a gas mask, I had to watch my family die before my eyes, I could not die with them because I had the mask on.  I had to see them die before I died myself.</p><p>Then I had a vision, this one not so clear, of some type of alien invasion.  But, what we were thinking of as aliens, were extremely evolved and advanced humans.  Some 'earth-humans' were trying to fight it with small homemade bombs, like a Molotov cocktail, or thereabouts in size.  The alien technology far exceeds our own, so our weapons have little to no affect on the force field type defense of this advanced human race.  An earth human is to an alien, as an earth human is to a monkey, much more advanced.  It did no use to fight, they knew when an attack would occur, and they could somehow know when an earth-human was about to throw a bomb.  'How could I avoid being destroyed in the invasion?  How could I be saved?' I wondered.</p><p>The answer was quite astonishing.  This alien intelligence that I was communicating with told me, using thought and visuals, that what we are thinking of as 'God' is really this universe sized alien life that I was communicating with.  The mushrooms are what opens the doors of communication and what REALLY governs us as a human species.  I was told that the mushroom use is to be a new religion. This battle between good: mushroom experience and evil: suppressor of the mushroom experience, is what we are thinking of as the Armageddon, or the 'holy war' that is said to happen in the End Of Days.  I was also told that the Government would suppress this religious belief at the consent of the vast majority population, for the government quest for world power depends on this suppression.  'He' assured me that every time there has been an opportunity to be saved, there was a small percentage that does get saved, the rest were always misled and worshiped the wrong god, each person believing strongly that he/she was worshiping the right god.  The minority religion has been the one saved during biblical times, generally being suppressed. I was then showed visions of men ruthlessly following the wrong leaders, visions of Hitler and his followers,  visions of Bush, and his war in Iraq.</p><p>The mushroom 'Alien/God' that communicates matches all bible descriptions of God.  'Alien' or 'God,' whatever you prefer to call It, is very friendly and not as commanding as may seem.  When I was not prophesizing and was merely making friendly conversation I spoke in 'tongues'.  I could not begin to type or write to even come close to the sounds of this strange language in which I could speak fluently.  I called it under-tongue for lack of a better word, until I looked it up on the net when my trip was over.  It has been said throughout Catholic and Christian times that speaking in tongues is a blessing from the holy spirit.  Many, in biblical times, used to 'speak in tongues and prophesize with God.'  These tongues are only used to communicate with this 'Alien.'  There werent words for material things like normal language.  It felt so natural to speak like this.  I can't speak in tongues when I am not in the mushroom experience.  This language seemed to be the evolution of language and seemed to continue to evolve. </p><p>Here are some things that I wrote during the intense part of my experience:</p><p>'Be outwardly accused of ignorance would any man deny.'</p><p>'So many claim to be so intelligent, but have not the intelligence to see what really IS.'</p><p>'Man is easily misled, would no man but any man deny'</p><p>'Ignore not what is not to be ignored, for what is not to be ignored will not ignore you.'</p><p>I had recently read about the bible code online.  During my trip this is what I got out of it:</p><p>The code in the bible is something so profound, so life saving that it had to be encoded into the Hebrew bible.  Something so important that human would not have access to this information until The time came.  Something somewhere knew of the evils that befall human civilization.  This was the only way that the information could be made secret as to not be suppressed throughout the thousands of years of human civilization rise and fall of empires wanting to control.  This was to be the ultimate prophecy, one that could not be unlocked without the use of modern computers.</p><p>TRIP OVERVIEW:</p><p>This was the most astonishing, demystifying experience since I learned to speak, or since I lost my virginity.  It was truly amazing and real, I scribbled frantically to write what I could.  The mushroom experience took me to a place of pure knowledge.  It was reality, pure thought and energy.  It was what was, what is and whatever will be: Pure universe.  I give it ***** five stars!  I felt awakened and just so good!</p><p>TRIP TIPS:</p><p>*Drink lots of water!! I didnt and woke up the next day with the worst hangover headache ever.  For my weight I would suggest at least 2 liters.</p><p>*If you bake your shrooms, they loose potency</p><p>*Terence McKenna's advice is:  Use them not very often, in high doses alone in the quiet of your own bed at home.</p>",
 "year": "2003",
 "id": "28170",
 "gender": "Male",
 "timestamp": "2004-12-17T08:00:00.000Z",
 "views": "7957",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
