{
 "title": "Not Your Mother's Ecstasy",
 "author": "Pookie",
 "citation": " Pookie. \"Not Your Mother's Ecstasy: experience with 2C-I (ID 28187)\". Erowid.org. Nov 6, 2003. erowid.org/exp/28187",
 "substance": "2C-I",
 "bodyweight": "150 lb",
 "report": "<p>Being a fan of MDMA since I discovered it several years ago, but not getting the same results with it that I did in the first few experiences, I decided to try out 2-ci. (Phenethylamines being my area of most interest) And from what I had read it seemed pretty gentle and sounded like a good cross between LSD and MDMA. (besides 2-cb, which sounded like I would like it best, is no longer available)</p><p>I got my little package of the clumpy white powder in the mail. (Kind of strange getting a baggie of white powder in my mailbox) My mindset was good, maybe a bit tired but otherwise mentally OK. The setting was at two good friends house, with lots of interesting things to look at and play with when we got to our desired mind state. I proceeded to try to desolve the entire 100mg of 2-ci into 10ml of warm distilled water. The fine dust pretty much went into solution right away with the remaining small clumps needing to be smashed against the bottom of the small jar it was being mixed in with the blunt end of the handle of an exacto knife. Very small bits were still floating around but seemed to be evenly dispersed. I then sucked up 2ml of the solution into an oral syringe for each of the three of us (aprox. 20mg each) and deposited it into a small glass of cranberry/blueberry juice (nasty stuff by the way) Immediately upon drinking the mixture I could tell something was going to happen. Kind of like that low voltage electric feeling you get in your mouth when you first put a tab of LSD in your mouth.</p><p>+00:30min. OK who said this stuff takes at least an hour to start getting effects? Granted I had not eaten for at least 6 hours, but I was starting to get that kind of warm stimulated feeling MDMA gives me when it first starts to hit.</p><p>+01:00hour. Still going up and beginning to get small wavy movements in my peripheral vision. Also slight pressure in my head and a tiny bit of stomach wierdness. But probably mostly due to no food and anticipation.</p><p>+02:00hours. OK, STILL going up. This is different stuff I must say. I'm getting rushes, or rather waves of sensation similar to MDMA but without that blissed out feeling you get with ecstasy.</p><p>+03:00hours. Man this is wierd. I feel like i'm still getting deeper into the experience and am a bit worried about when I'm going to stop. My vision is whacked out with every thing out of the corners of my eyes churning and bubbling like I was in an underwater current. my friends have this very cool glass sculpture of a human head lit from the inside and it looks like its changing expressions on its face. It's nostrils alternately flaring and relaxing like it had just smelled something bad. Very cool.</p><p>+04:00hours. Wow I think I really like this. When I look straight ahead it looks like I am in a kaleidoscope tunnel with the edges being pulled and stretched around my peripheral vision kind of like a warped tube. I have never had anything quite like this happen with any substance before.( but in retrospect my friend and I decided it really felt like MDA, but with more visuals, than I remember anyway.) At one point I started yawning and felt like I needed to lie down. Well, I went into some kind of wierd half awake half asleep state. And according to my friends was having a short conversation with someone or something that was not visible to any of us. I don't really remember this , but its interesting to hear about after the fact.</p><p>+05:00-06:00hours (or so) This period was pretty much like hours 2-4 but I had reached a peak and stayed there until about 5.5 hours or so into it. The comedown started rather abruptly and by about +07:00 I was pretty much down, compared to what I was anyway. </p><p>Well there it is. A truly different experience not quite like any other i've had. It had LSD and MDMA overtones kind of like I expected. But reminded me mostly of MDA. Is'nt this stuff supposed to be a chemical cousin to mescaline? Is this what mescaline is like? It would be interesting to know, since i've never done mescaline. I hope this is helpful and informative. Be careful this stuff seems pretty powerful and would be easy to overdue. Especially if you're not prepared.</p>",
 "year": "2003",
 "id": "28187",
 "gender": "Male",
 "timestamp": "2003-11-06T08:00:00.000Z",
 "views": "7328",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ]
}
