{
 "title": "An Interesting Amanita Encounter",
 "author": "The Explorer",
 "citation": " The Explorer. \"An Interesting Amanita Encounter: experience with Amanita muscaria (ID 282)\". Erowid.org. Sep 7, 2000. erowid.org/exp/282",
 "substance": "Amanita muscaria",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  "1 ",
  "oral",
  "Amanitas - A. muscaria",
  "(plant material)"
 ],
 "report": "<p>I became interested in mycology (the study of mushrooms)this past year, and experimented with psilocybin mushrooms at various points.  However, I got a sudden interest in taking Amanita after reading accounts of Siberian shamans uses of the shrooms.  I found a patch growing in some woods near my house, and dried two mushrooms from that patch.  I went to work and found a friend there who would be willing to experiment with me.  We both ate one mushroom; the initial effects were nothing more than nausea and an energy boost.  These, however, passed within thirty minutes.  Nothing followed.  We were both perplexed, and I became terrified at the prospect of having picked the wrong shrooms (a potentialy fatal mistake; be careful picking your own!).  After two hours, I was sitting in the break room reading a magazine when IT happened.</p><p>As I tried to focus on the words on the pages of the magazine, my vision became distorted.  I realized that I was unable to read - whenever I looked directly at a word, it would disappear!  I went out and found my friend, who was also feeling a little trippy at this point.  The effects increased, and after an hour, anything I looked at directly would dissolve into microscopic cubes of various colors.  Nothing greater than this sensation took place.  I came home with a strange body feeling and went to sleep.  There were no ill effects, but I wouldn't recommend using the mushroom to anyone.  The trip simply isn't that...well...trippy.</p>",
 "year": "2000",
 "id": "282",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-07T07:00:00.000Z",
 "views": "11052",
 "dose": {}
}
