{
 "title": "Treatment for Toxic Chemical Damage",
 "author": "Gene T.",
 "citation": " Gene T.. \"Treatment for Toxic Chemical Damage: experience with Hydergine (ID 28217)\". Erowid.org. May 16, 2006. erowid.org/exp/28217",
 "substance": "Hydergine",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "oral",
  "Hydergine",
  "(daily)",
  "",
  "2.0 ml",
  "IV",
  "Pharms - Procaine",
  "(liquid)"
 ],
 "report": "<p>After losing 60% of my liver function from machining toxic plastics, I later acquired components of cleaning solvents in large doses in my blood, because my liver was not removing them as fast as they were being acquired. These were:</p><p>2-Methylpentane     20.9 ppb</p><p>3-Methylpentane     57.1 ppb</p><p>n-Hexane            25.4 ppb</p><p>These are known neurotoxins.</p><p>The results were that I developed serious memory problems similar to someone in the early stages of Alzheimer's desease.</p><p>This was extremely demoralizing, and often embarrassing, especially since I was only 52 years old. I would drive onto the freeway to go somewhere and forget where I was going. My life had been literally turned upside down.  </p><p>The doctor I found to treat chemical damage, prescribed 5mg Hydergine twice daily and after a few months I could tell the difference. He preferred Piracetam, but it was difficult to obtain as a prescription in the US then. I felt much better about myself as my memory returned. In a year the change was dramatic. I continued taking Hydergine until I moved away from the doctor and could not find a doctor that would prescribe it. Also I didn't have a prescription plan to pay for Hydergine and so I started taking Vinpocetine, because of it's lower cost. In my experience, Hydergine is superior in restoring mental functions like awareness and memory.</p><p>Because of damage to my nervous system and my liver, I did not tolerate pharmaceutical calming agents, and have found L-Theanine a life saver, for when I feel slightly agitated or nervous. Also a series of Procaine injections helped calm my nervous system to almost normal. Procaine (Novacain) taken intravenously was the single most effective compound to raise my spirits and make me feel like a normal human being again. 2cc's of procaine in the vein is wonderful.</p>",
 "year": "1995",
 "id": "28217",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-16T07:00:00.000Z",
 "views": "17725",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Hydergine",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": "2.0 ml",
   "administration": "IV",
   "substance": "Pharms - Procaine",
   "form": "(liquid)"
  }
 }
}
