{
 "id": 2821,
 "title": "Tryptophan Retrospective",
 "date": {
  "submission": "2004-02-20T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Dr. Smooth",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1500 mg",
   "administration": "oral",
   "substance": "Tryptophan"
  }
 ],
 "report": [
  "<p>When ingesting about a third to three-fourths of a teaspoon (ordered as a veterinary supplement, because it's not available over-the-counter in the U.S.), I almost immediately felt a, well, 'whoosh.'  Definitely much like the moment where you first notice a serious drug-taking effect.  A bit dizzy, a bit light, and definitely some relaxation and some euphoria, I feel a slight disconnect from normal reality.   Everything is pretty funny, but definitely not 'giddy.'",
  "This is where it plateaus. ",
  "I've also found that taking more after 'peaking' (if you can call it that)will not really work.  There is definitely a sleep-inducing element to this substance, but I've seldom found it overwhelming.  If I take too much I do become a bit disoriented physically, though I can still think straight if I want to.",
  "!)One disturbing thing is that I occasionally feel as if my heart is beating differently, though it doesn't feel dangerous.",
  "No ill effects the next day.  Perhaps a small bit sluggish, but this must just comes from the deeper sleep. A normal dose of caffeine in the morning leaves no trace.  Much safer than taking chemical sedatives, in my humble opinion.",
  "However, tolerance does grow rather quickly.  After a couple days of usage, the euphoric element is much lower, though it is still relaxing and helps sleep. I have no certain idea about its effects on dreams, as I take a B-50 vitamin pill just before bed, which does increase dream vividity.",
  "I have not tried 5-HTP so I cannot compare.",
  "Overall, I find it a worthy substance when used on occasion to help unwind, mitigate depression, sleep and a small amount (800mg?) can help me when hungover.  But it should not be used daily, as the benefits decrease.</p>"
 ],
 "erowid": {
  "id": "19316",
  "citation": " Dr. Smooth. \"Tryptophan Retrospective: experience with Tryptophan (ID 19316)\". Erowid.org. Feb 20, 2004. erowid.org/exp/19316",
  "substance": "Tryptophan",
  "views": "13221"
 }
}
