{
 "title": "The Popular Nerd",
 "author": "Xtian",
 "citation": " Xtian. \"The Popular Nerd: experience with Amphetamines (Adderall) (ID 28233)\". Erowid.org. Jan 8, 2007. erowid.org/exp/28233",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "40 mg",
  "oral",
  "Amphetamines",
  "(capsule)"
 ],
 "report": "<p>My freshman year of high school was a major culture shock for me.  I'd always wanted to try drugs and suddenly it seemed like there were so many and so little time.  I'd try anything I could get my hands on.  This is how I discovered my favorite little pill to munch, adderall.  With so many attention deficit youths today there was an abundance of it.  I only ever had to pay for the strong stuff and even then it was never more than a buck a pill.</p><p>Well, I averaged about 30mg a day and this went on for a while but after a while it just faded out.  I forgot about Adderall but I always had that feeling in the back of my mind that I should take it again just for kicks.  Recently I was given two 20mg time release capsules (the kind with the little balls so it's time release no matter what).  I had a spanish, chemistry, history, and math test all the next day so I decided that's justification enough and took them at breakfast that day.  After about an hour I was floating.</p><p>As I walked down the hall I was on a conveyor belt and everyone at school was just there to get a wonderful glimpse of the 'fabled' me.  Some were even lucky enough to talk to me.  And oh, when they did they were in for a treat.  Everything I said perfectly fit what everyone was thinking and my jokes killed the audience.  Of course this is only how it seemed to me.  And this wasn't a totally foreign experience, I felt a strong nastalgia at this.  But this time it seemed strangely better.  I figured it was the amount of time since I had last used Adderall and thought nothing of it.  But as the day progressed I sunk into a sort of rhythym.  I was shaking which amused me slightly and I killed all my tests and homework before anyone could tell me to slow down.</p><p>Then came the wierd stuff.  I felt as if my mind was completely seperate from my body.  I'd whiz through school work and not even remember doing it.  The whole time I'd be considering complex issues and working things out in my head.  Everything seemed to make sense.  At the same time I was coming up with killer complements for everyone and talking up a storm.  My entire body was flying.  Thats the exact sensation I got.  I also would have extreme feelings of euphoria.  The whole thing was very intense.</p><p>That night I drew a picture of how I felt and it was really good (for being on mspaint).  I then stayed up all night surfing the web and absorbing information.  I couldn't stop learning things and everything I read I retained.  I went to bed at 4:30 not because I was tired but because I wanted to and I fell asleep almost right away.  When I woke up at 6:30 to go to school I wasn't tired at all and I didn't even feel like I had ever fallen asleep.  The entire day I still felt compelled to do all my work and everyone still liked me though the floating sensation wasn't as strong.  That's just my experience with Adderall and I must say that it was entirely pleasent because I was prepared.</p>",
 "year": "2003",
 "id": "28233",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-08T08:00:00.000Z",
 "views": "14717",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(capsule)"
  }
 }
}
