{
 "title": "Time Lapses",
 "author": "Lynda",
 "citation": " Lynda. \"Time Lapses: experience with Cannabis (ID 2823)\". Erowid.org. Nov 29, 2000. erowid.org/exp/2823",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "report": "<p>This was my first pot experience. I had tried smoking it for three consecutive nights, nothing happened. It all happened on the fourth night. I have been lately dealing with 'issues' - nothing too bad, but repressed events of my life, realizing just how I have compressed time and selectively forgotten events. I was well prepared if these issues surfaced. I can't say I fully remember every second clearly, but I sure can accurately give details about the majority of my trip. After smoking about 7 hoots in a 20 minute period, I still felt normal. I took one more hit.</p><p>I can't remember when I put the pipe down, or how long it had been. I instantly forgot every aspect of myself and my past, although I was well aware of my surroundings and somewhat aware of my boyfriend, who sat next to me. For a moment it felt like I was living in the present, and neither the past nor future existed. He seemed deeply focused on me. It looked as if he was asking me if I was okay. I couldn't seem to understand exactly. I told him it had hit me and I needed to lay down. The kitchen cupboards to my left seemed to become somewhat alive and the feeling of them moving consumed me. Next, the couch began to sway and compress and expand, and I felt like I was sinking into it. My whole body (especially lower) felt so amazing, almost even painful. It was so tingly and shaky, it felt a lot like an out of body experience, although I was well aware of the presence of my physical body, but only because of the sensation of energy that surrounded it.</p><p>The whole trip seemed to revolve in time frames. For every second or so (it felt) that I was somewhat aware of myself physically, emotionally, etc., I was instantly forced to snap into another time frame that seemed to last forever (from periods of 2 to 5 minutes that seemed like hours, until I reached periods that lasted years!). I couldn't remember the last time frame I experienced and there seemed to be a lot of gliches. I couldn't walk and I couldn't communicate. I had reached a point where I felt I was living within my mind and its understanding of time, which is drastically altered from repression. It was very scary at first, but once I started to understand when I was coming down just what had happended, I couldn't believe it, but I knew so well that I was not going to repress it, or anything, ever. I could not think as I was experiencing it or afterwards until I was coming down.</p><p>The effects of the pot and a dream-like state lasted for a period of almost 24 hours. I can't even begin to explain the time lapses, but from every moment from the next, it felt as if I was placed in the moment, not knowing how or when I got there, or even being able to understand the concept of time, or even that of a 'future,' nevermind the familarity of 'myself.' I learned a lot and I am amazed with how my mind can alter time and memory to such an extent. Nevertheless, it was quite amazing.</p>",
 "year": "2000",
 "id": "2823",
 "gender": "Female",
 "timestamp": "2000-11-29T08:00:00.000Z",
 "views": "7128",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "8 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
