{
 "title": "Definitely a Unique Substance",
 "author": "entheogen",
 "citation": " entheogen. \"Definitely a Unique Substance: experience with IAP & Cannabis (ID 28232)\". Erowid.org. Dec 15, 2003. erowid.org/exp/28232",
 "substance": "IAP & Cannabis",
 "bodyweight": "135 lb",
 "report": "<p>Dose: 45 mg oral gelcap 4:15pm  (ate spaghetti at 1:15pm)</p><p>4:30 feel stuff happening in stomach, tingle in extremities.  No nausea though --note: use of mda 60 hours ago, & cannabis @ 4:20--</p><p>4:37 music has extra beauty</p><p>4:40 tingle is in head and posture is reminiscent of mdma/mda</p><p>4:50 hr is up, am I tripping? Some visual activity</p><p>5:05 getting harder to write the paper I have been writing since the beginning of this session. Thoughts stray a bit</p><p>5:24 went to get mail. No eye dilation as of yet.  Lights starburst, trails, things look shinier than usual, energy up.  Still very much in a come up stage (it would seem). Comfortable +1.5</p><p>5:30 body temp up. Very in the zone, amped.</p><p>5:43 go to class</p><p>6:00 +2 hr still up. Focused. I might be tripping</p><p>7:00 feeling generally good and some tinglyness</p><p>8:30 class is getting to me</p><p>9:00 smoke +3. Im very talkative and wired, cannabis added alot to this experience.</p><p>10:00 smoke.  Low level visuals, tracers and stuff. Energy persists.  Very good with cannabis.</p><p>1:00am the substance is wearing off, Im still at a +2. Im not really noticing oevs but there are some cevs that should put me to sleep.  Sleep shouldnt be difficult.</p><p>Commentary:</p><p>I woke up the next day feeling alert (Im usually not) and I was still at a +1 until I had eaten lunch</p><p>I would describe this chemical as if you were to cross mda w foxy.  Good energy rush, good social vibe.  HR definately went up, body temp too.  Mixed great w cannabis.  Would be great for party situations.  The trip does not get overwhelming and I felt no nausea.  Watch out for the amphetamine in here, lots of energy.</p><p>My dose was good for oral but I have found that low doses smoked are very effective (like 5 mg).  I would expect the nasal route to be quite effective but would not recommend starting with too high a dose because of the potency observed when smoked.</p><p>This is not mdma, it's kind of like mda but definately a unique substance.</p>",
 "year": "2003",
 "id": "28232",
 "timestamp": "2003-12-15T08:00:00.000Z",
 "views": "29454",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "IAP",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 0:05",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 4:45",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": " T+ 5:45",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
