{
 "id": 2824,
 "title": "An Effortless Transition",
 "date": {
  "submission": "2000-06-19T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Toad",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:00",
   "amount": "2.7 g",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  },
  {
   "time": "3:00",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Some time ago, I read a most excellent trip report about a 2C-B + GHB combo. I filed this away into my databank as a combo of major potential and waited for the appropriate dream to manifest. After becoming familiar with dreaming with bees I decided to initiate a meeting with GHB. Before I reveal the details of this particular date I'd like to share a few thoughts on GHB. I'm finding this substance plays a major role in my pharmacopeia and has greatly assisted me in many ways. It's primary talent is integration, helping to restore balance within a contracted state of awareness. I find that using GHB in the days or weeks following a peak experience (be it entheogenic or otherwise) to greatly facilitate the integration of the new expanded perception.",
  "It's as if GHB helps move the garbage (limiting data) through the system faster and allows for a much easier down shift in frequencies. Another of GHB's outstanding attributes is its ability to smooth out and relax the nerves system. It's much more effective and desirable than benzo's in this regard as its a relatively non-toxic substance. It works especially well combined with other psychedelic agents that have a speedy or frazzled physical edge to them. GHB also works exceptionally well to smooth the transition back to baseline after a long trip. Recently, in a discussion with a friend of mine I learned of a most exciting way to use GHB. He recommended using it for the initial come on period of the more powerful substances. The initial accent of any psychedelic dream is usually the most difficult time of the trip for me as my body and psych are having to shift gears at a rapid pace. In my experience it's been very important to be aware, focused, and in a positive set during the initial accent as it can often color the entire journey. The GHB helps facilitate this transition and puts one in a totally unstoppable positive groove during the transition. The short 1-2 hour duration of GHB is ideal for this purpose as it will wear off by the time you are ready to peak. Unless of course you like The combination so much you take another dose of GHB! If you haven't already added GHB to your dreamland medicine chest, I would strongly urge you do so before it becomes more difficult. And now, here's my report of what happened when I became aware in my dream last night...",
  "I first ingested 25mg of 2C-B which is usually a nice intermediate dosage for me. When I first noticed the bees coming on about an hour later I took 2.7g of GHB. The GHB hit me even quicker than usual and within 5-10 minutes I began to feel reeeeally good. It was an effortless transition, with the bees gradually increasing in each successive moment. A familiar smile crept across my face as I noticed an incredible wave of empathy and sensual saturation. It was an emotional depth that rivaled the empathogenic high of MDMA with a simultaneous subtlety that far surpassed it. I have never had it so good with the bees... All traces of the 2C-B amphetamine backbone were washed away in the cool liquid breeze of GHB. Only the most desirable qualities of 2C-B were left floating adrift in the seductive sea of manifestation. It's a Yin/Yang thing... Without a doubt, GHB is the perfect mate for the queen Bee.",
  "Two hours later I noticed the GHB had declined and I decided to add another 2g to the brew. This boosted me right back up to the previous level and I enjoyed another glorious sexually scintillating peak. Everything was sooo perfect, and I have to say the evening far exceeded my expectations. I felt fantastic upon return to baseline and awoke feeling great the next day. After experiencing this most perfect dream combination, I can't imagine myself ever dreaming about taking bees without GHB. Unless of course, I get Kalled... He heh."
 ],
 "erowid": {
  "id": "1932",
  "citation": " Toad. \"An Effortless Transition: experience with 2C-B & GHB (ID 1932)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1932",
  "substance": "2C-B & GHB",
  "views": "43304"
 }
}
