{
 "title": "First Time and Last Time",
 "author": "MtMan",
 "citation": " MtMan. \"First Time and Last Time: experience with Oxycodone  (ID 28303)\". Erowid.org. Jun 15, 2007. erowid.org/exp/28303",
 "substance": "Oxycodone ",
 "bodyweight": "235 lb",
 "header": [
  "DOSE:",
  "20 mg",
  "oral",
  "Pharms - Oxycodone",
  "(pill / tablet)"
 ],
 "report": "<p>I am a married, 34 year old professional who has smoked some weed in the past, and taken shrooms once.</p><p>My mother has been battling some back pain and was prescribed Oxycontin among other things for her pain. Upon finding her pills, I shook several out and pocketed them, noticing they were 20 MG tablets.</p><p>Later that day, I counted them, I had taken 7 total. I had no clue now much to take or how. I decided to play it safe and I chewed one up and washed it down with some water. My wife was napping and I was watching TV and playing with my son. About 20 minutes later, I began to feel a warm fuzzy coming on, and them my body began to itch in random places, most noticeable my face.</p><p>I then began to break out in sweats. I was nervous and felt small waves of nausea as well. I felt I could go to sleep immediately.</p><p>This went on for about 2.5 hours and I was beginning to worry, for I was invited to a friends later to watch a football game. When it was time to leave, I felt close to normal and drove to the house and watched the game. I consumed 4 beers while there as well as some chili and various other spicy foods.</p><p>When I got home, I felt very ill. I ended up puking all the food from earlier and had to make up some excuse about the food for my wife. I then slept solidly for about 9 hours.</p><p>I woke the next morning with no ill effects.</p><p>Im a big guy, 6'3, 235 lbs, and thank God I didn't take more. I immediately flushed the remaining pills and vow to never take them again. The 'medium dose' was OK, nothing wonderful or worth trying again, and getting sick sealed the deal for me. Glad I experienced it, but won't be doing it again.</p>",
 "year": "2003",
 "id": "28303",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-15T07:00:00.000Z",
 "views": "20097",
 "dose": {}
}
