{
 "id": 2832,
 "title": "Totally Underrated",
 "date": {
  "submission": "2005-11-07T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dr Smooth",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.25 tsp",
   "administration": "oral",
   "substance": "Tyrosine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "So many of us have tried the speed like drugs, and found the high useful and pleasurable.  However, the illegality, expense and health effects deter, rightly, most people from relying on these drugs too often.",
  "Upon ingesting 1/4-1/3 or so of a teaspoon (~600mg-1200mg) of tyrosine powder, an almost immediate 'up' comes.  The effects are similar in many ways to 'real' speed in that my motivation, energy, mood and senses all brighten, I become 'intense.'  Yet somehow I feel somehow, 'within.'  Subjectively these feelings are more controllable and even 'cleaner' than when trying speed. This is probably due to the fact that my own brain is converting the amino acid into surplus dopamine in the brain, rather than forcing all the dopamine stores to be used, as with amphetamines. This does dull the register of pain, so much more physical activity (working out or otherwise) can be sanguinely endured!  Alas, this is still prey to 'overstimulation' in that I can become so speedy that I can't actually concentrate on any one thing for very long, and become restless, even agitated.  And there is some 'crash' about 4-7 hours after I use it, though it can be remedied with a cup of coffee or so, or actually sleeping...",
  "Curiously, this does make me want to smoke cigarettes more often (not surprising) but also reduces my physical 'reward' for smoking. ",
  "I've found that it is best a couple hours after breakfast, though it does work on an empty stomach, or with very low protein food, as other amino acids will compete with this for attention in the body.  I suggest after breakfast because tyrosine does suppress the appetite for several hours, and better to have something digested before pushing my body. It is almost tasteless, and dissolves well in the thicker juices.   ",
  "Habituation?  Perhaps I've had some, due mainly to it just being pleasurable.  Often I feel a desire to repeat the experience the day after having one, but if I resist this and go for a couple days without, any urge usually subsides.  Though I imagine it is quite possible to become truly addicted, due to its inexpensiveness and accessibility.  I'd also suspect that withdrawal would be much easier to take than with speed, as though my brain will become used to all that excess dopamine floating around, I haven't really fucked up my internal production.  Its the difference between feeding your horse too well, or whipping him until he collapses. ",
  "Taking this too late in the day will cause insomnia, and equally obvious, people with health conditions that are worsened by stimulants should avoid.",
  "In light of this, I am amazed that this substance has not become more known among people who are tweaking themselves, probably detrimentally, with adderall, people with dopamine deficiencies or just people interested in nootropics, for about 10 cents a high."
 ],
 "erowid": {
  "id": "19338",
  "citation": " Dr Smooth. \"Totally Underrated: experience with Tyrosine (ID 19338)\". Erowid.org. Nov 7, 2005. erowid.org/exp/19338",
  "substance": "Tyrosine",
  "views": "17060"
 }
}
