{
 "title": "The Dark Side Of Rohypnol",
 "author": "Survivor",
 "citation": " Survivor. \"The Dark Side Of Rohypnol: experience with Flunitrazepam (ID 28346)\". Erowid.org. May 3, 2004. erowid.org/exp/28346",
 "substance": "Flunitrazepam",
 "bodyweight": "200 lb",
 "header": [],
 "report": "<p>I would like to tell you about my addiction to roofies and alcohol. I am a male in my early twenties living in Sweden. I have been drinking alcohol heavily since I was thirteen, only recently I have stopped drinking much, but I still binge sometimes. I have experience with most of the common psychoactives: cocaine, shrooms, acid, cannabis, speed, ketamine, heroin, mdma, benzos, 2c compounds, foxy, the list can be made longer. Coke, ecstasy, cannabis, benzos and alcohol I have abused. I have probably done 3 - 400 grams of coke, 30 grams of pure MDMA, cannabis hundreds of times and one thousand benzos. One can draw the conclusion that I have an addicting personality.</p><p>I decided to quit using drugs october 2002. I had just come back from two months in Thailand - Koh Phan Ghan were they have the famous full moon party. I had not been sober from alcohol and drugs for years and I was enrolled to the university and due to start in January 2003. Withdrawal was horrible, shaking, sweating, insomnia, horrible nightmares and a sense of depersonalization. So I phoned my connections and bought a hundred roofies. What a relief, I have always liked benzos, I usually always mixed roofies / valium with alcohol to enhance the effects. Now when I was so anxious and having withdrawal the roofies gave me a sense of calm and cool that was incredible. I could cope with the withdrawal and stress. I continued taking roofies until middle of march 2003. My dosage was now up in the range of 5 - 8 mg per day, and preferably with alcohol otherwise I would not really feel it. I was so addicted to roofies that when I travelled to Asia - the far east during the break I smuggled with me a hundred pills to last for a week. I decided to quit when I got home. Withdrawal started immediatly with shaking and sweating. I got so sick, when I was trying to sleep I felt that my heart stopped and I flew up from bed and beat my chest to get it going again. I had my phone beside the bed with 911 pre dialed. I was very close calling them many times. It took a month before I got four hours of continuous sleep. In june I was feeling better, but still today I experience anxiety for nothing sometimes. I cannot point that specifically to the use of roofies but certainly my heavy usage of drugs has caused it. Rohypnol has a hypnotic effect and much shorter halflife compared to say Valium (diazepam). The withdrawal from rohypnol is a hundred times worse. Going cold turkey like me is dangerous, it is possibly lethal. For your own sake contact a detox clinic and let them handle it, they will put you on either a long acting benzo like diazepam or barbiturates which does not offer any cross tolerance to benzos. Convulsions and death occur with benzo and alcohol withdrawal.</p><p>Today I am in university, second term. I've not felt this good for as long as I remember. Be careful of overdoing drugs, it's more harm than good. Life goes on.</p>",
 "year": "2003",
 "id": "28346",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-03T07:00:00.000Z",
 "views": "27388",
 "dose": []
}
