{
 "id": 2838,
 "title": "Major Tactile Hallucinations",
 "date": {
  "submission": "2000-06-19T07:00:00.000Z"
 },
 "author": {
  "name": "Anonymous"
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 ],
 "report": [
  "Last night, two of my friends and I decided to try Hawaiian Baby Woodrose seeds. We went to the local head shop and got ten each, took them home and set out to remove any coating. We had heard/read that we should take anywhere from 6-15 seeds each, and after consulting with the clerk, who we knew, and had done them on several occasions, we settled on 8 each, expecting a fairly decent trip.",
  "We got them home and scraped off all of the coating to the best of our ability, and then washed them off. We were careful to remove all of the coating, scraping off the coating and part of the shell with x-acto knives. (Realizing that we'd still get part of the coating, but still wishing to keep it to a minimum.)",
  "After scraping and washing, we crushed the seeds up and placed them aside for later. 'K' and 'G' had to work, so we were going to do them when they got off.",
  "Around 9pm 'K' and 'G' came over and we downed the seeds. I had not eaten for about 6hrs, 'K' for about 3, and 'G' had just eaten.",
  "After 15 min. I had started to feel the effects. The onset was like being dizzy, or groggy after having just gotten up. In about 20 min, K started to feel the same effects while G just felt sick to his stomach. This feeling of groggyness persisted until 10:30, when I proceeded to throw up violently. K said he was feeling fine, and was beginning to have what he termed 'A really mellow trip' G still only felt sick.",
  "I felt much better after my episode, but was still feeling drained, so I decided to leave K and G and go to bed. This is what they told me happened to them. They went to get something to eat around 12:30 (when I went to bed). they walked around in some woods near where we live, and said it was pleasant. Quite like a very mild trip, then around 2:00, they split up and went home thinking it was over.",
  "When G got home (about 2:30) he said he became violently ill, and lost everything he had eaten the entire day. He then tried to go to sleep.",
  "K said he went home and tried to sleep, but found himself peaking, experiencing a dizzying trip with very intense tactile, and visual hallucinations. He got up from bed and ended up wandering over to G's house without putting on any additional clothing (wearing only bed-shorts) and then sitting on his steps crying. G didn't experience this sort of peak at all, and found that he was able to calm K down by talking him out of it. (K said afterwards it was like he imagined a bad trip being like. We have done acid on *many* occasions together, and have *never* had a bad experience with acid). After G talked him down, they both managed to sleep, and awoke today feeling a little hungry, and just generally groggy.",
  "Meanwhile, I had gone home, still feeling a bit queasy, and decided that I needed sleep more than anything, so I laid down (at 12:30 or so) and tried to sleep. I managed to get to sleep okay, my stomach still aching a bit, and slept fine until 3:30.",
  "At 3:30 I awoke in the midsts of the most intense trip I have ever experienced. My thoughts were totally random and I was experiencing *intense* visuals from the moonlight shadows in my room. I managed to stand up, and found that so incredibly difficult that I had to lay back down. My roomate then came out of his room to go to the bathroom, and I found this to be more than I could take... His image against the shadows in my room through me into some really wild hallicinations of wolves and various creatures devouring my flesh. In addition to the visuals, I was getting *major* tactile hallucinations from my sheets. My skin felt like I was being tickled everywhere, and was in the throws of a major orgasm. (Not unpleasant mind you ;) However it was a bit too intense for my tastes. I had several hallucinations of animal images, combined with the urge to run. I contemplated running over to see K and G and if they were having this stuff happen too, but when my roomate appeared, I was too scared to move much. I found it extremely difficult to diferentiate between reality and my hallucinations. (I didn't like this aspect of it at all. When I trip on acid, I usually find that, even though I do hallucinate, I am still conscious of the fact that they are only hallucinations. On the seeds I really couldn't tell.)",
  "After laying there hallucinating I fell asleep. I don't know how long I was hallucinating, I was really not interested in timing it either. Around 10, I woke up, and my stomach really hurt. (could have been the seeds, could have been the vomit...) I managed to get something to eat and return to sleeping for a while. I woke up again at noon, feeling well rested, but a bit groggy. I've been in that same groggy state all day.",
  "Overall, I'll say that it was worth the experiment to satisfy my curiosity. However, I will not be trying these things again. Ever. First, I have a no vomit rule about drugs... that's why I gave up drinking. Second, I didn't find the peak as thrilling, or as fun as LSD. I still think Acid has the most bang for buck, and give much more pleasurable feelings while peaking. Perhaps the dose was just too high, but based on the feelings in my stomach, I think I'll just stick to good ol' LSD and MJ."
 ],
 "erowid": {
  "id": "1935",
  "citation": " Anonymous. \"Major Tactile Hallucinations: experience with H.B. Woodrose Seeds (ID 1935)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1935",
  "substance": "H.B. Woodrose Seeds",
  "views": "46790"
 }
}
