{
 "title": "My New Love",
 "author": "Anonymous",
 "citation": " Anonymous. \"My New Love: experience with Oxycodone (Oxycontin) (ID 28383)\". Erowid.org. Jun 25, 2007. erowid.org/exp/28383",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "145 lb",
 "report": "<p>After much research online about this amazing product I finally decided on trying to locate some to give a try myself. After finding out how hard to find and extremely expensive they are in my area I purchased via a seller overseas. The day they arrived I hid them and waited for the right time to try a few since I had 15 20 mg oxycontins finally at my disposal.</p><p>The day finally came where I had no homework no work and a night of the house to myself. I took 2 of the pills and crushed with a knife into a fine white powder picking out the shell of the pill. I rolled up a dollar bill since that seemed to be the most popular method and snorted the 4 lines I had made over about 5 minutes. It burned some as I have never done anything this method before. I went to chill and watch some tv.</p><p>After about 10 minutes I really began to get some heavy opiate effects of contentment and extreme well being. Energy flowed through my body while my eyes were getting heavy and I was becoming fairly sedated. At about the one hour mark I was having the greatest high of my life with no urge to move anywhere or even change the channel. Sitting there thinking about happy things and feeling the strong body high was just incredible. Its almost indescribable as words dont do it justice. After a few hours I decided to play some video games as it faded away leaving me with great feelings of happiness and still some body buzzing.</p><p>I know its my new love!</p>",
 "year": "2003",
 "id": "28383",
 "gender": "Male",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "14988",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 ]
}
