{
 "title": "I Could Indeed See Color",
 "author": "Ezekial Mordecai Kiss",
 "citation": " Ezekial Mordecai Kiss. \"I Could Indeed See Color: experience with LSD (ID 28394)\". Erowid.org. Nov 13, 2003. erowid.org/exp/28394",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "6 hits",
  "oral",
  "LSD"
 ],
 "report": "<p>I wanted to inform you of my own experiences after reading your article, 'LSD and Color Blindness'.</p><p>I am 23 and have been experimenting with drugs and pharmaceuticals since I was 9. However, the one drug that I have always shied away from is LSD. There are 2 main reasons for this. Firstly, I do not believe that I have a psyche designed to cope with psychedelics; and secondly, when I was 14, my best friend had a bad trip and shot himself in the head, infront of me and his parents. This latter factor, I believed would always mar any trip that I may undertake.</p><p>However, that said, I recently decided to indulge my brain in a little flight of fantasy. Admittedly, when it comes to drugs, I am a little impatient for the results and expecting an MDMA style 'come-up' (without the rushes, obviously), I got carried away and ended up having six tabs in the space of an hour.</p><p>Initially, the primary effect was the sense of being almost weightless with the combined impression that it was MY gravitational pull that was keeping the Earth in place. Because of the fact that I began my indulgence at two o'clock in the morning, the forest I was in was very dark. Therefore my visual distortions were not much greater than those experienced after three days awake under the influence of Methamphetamines. However, the arrival of dawn heralded the greatest visual experience I could have ever imagined; For the first time in my life, I saw colour.</p><p>I am at the extreme end of the colour blindness scale, not quite monochrome, but close enough for me to misinterpret all but the most vivid of colours. Yet under the influence of LSD, my colour perceptions began to heighten. At first, I put this down to mere visual hallucinations, but steadily I began to notice, for the first time a difference in appearance between the leaves of a tree and its bark. Attempting to study this difference was at first difficult, due to the fact that the leaves were consistently changing into birds, faces, cakes, kites, etc... Once I had become accustomed to the intensely visual nature of the drug, I started to explore my surroundings in more depth.</p><p>Until this point, I had always relied upon the shade of an object to determine its colour; placing it into a 'grouping', such as red/green/brown, blue/purple/pink, orange/yellow/light-green and so on. During my LSD experience, it began to determine between what I can only describe as the 'hues' of colour.  My inability to be any clearer is not due to lack of observation, but due to lack of reference point.  Indeed, during one moment of intense elation, I remember giggling wildly, weeping at nature's real beauty and talking directly to the colours saying, 'I can see you, but I don't know what to call you...!'</p><p>I then began to slip into a period of contentment and after a couple of hours of manic laughter, playing with the grass, the trees, the sky and my friends' face, I decided to calm down a little and begin a serious study of the effects upon my colour perception.  Therefore, I initiated my friend into my experiments and we began testing with whatever was available. The most bizarre element to these experiments was the need to spend an hour learning all of the colours from scratch.  One I had a visual reference point, he tested me with various items, such as coloured pencils, leaves and magazines. We even attempted an online Ishihara Test for Colour Blindness, once we had retired indoors, but this was not successful due to the fact that the dots continually morphed into one another.</p><p>After several hours, my friend, who has unimpaired colour vision, determined that I could indeed see colour.</p><p>However, due to the horrific and terrifying self-examination of the inner workings of my mind and the dark passages within, that occurred in the final six hours of my experience, I have decided that should I indulge again, I shall be a little more reserved with regards to my dosage.</p><p>I have also come to the conclusion that I do not like the colour brown...!</p><p>The only lasting effect I had with regards to colour sight was a deep longing to have it back...!</p><p>Ezekial Mordecai Kiss</p><p>P.s. I am able to spell, but here in the UK, we place a 'u' in 'colour'</p>",
 "year": "2003",
 "id": "28394",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-13T08:00:00.000Z",
 "views": "56228",
 "dose": {}
}
