{
 "title": "LSD and Color Blindness",
 "author": "Jim B.",
 "citation": " Jim B.. \"LSD and Color Blindness: experience with LSD (ID 28397)\". Erowid.org. Nov 13, 2003. erowid.org/exp/28397",
 "substance": "LSD",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "",
  "LSD"
 ],
 "report": "<p>Newsgroups: alt.drugs</p><p>Date: 15 Jan 93 21:17:06 GMT</p><p>Archived by: Hyperreal Drug Archives</p><p>Seer Snively  writes:</p><p>> If someone who is blind (because of a physical problem with the eye, no</p><p>> brain problems) or who is colour blind took lsd, would they 'see' colour?</p><p>></p><p>> Does anyone think they would get visuals?  Does anyone KNOW (first or 2nd</p><p>> hand)?</p><p>Hello.  My evil twin(tm) is a green-blind deuteranomal. Due to the presence of an annoying little recessive gene on his X-chromosome, the spectral sensitivity of his middle cones peak at a different wavelength of light</p><p>than a 'normal' individual.  Thus, greens look different to him, or not like 'green' at all...</p><p>He enjoys both hiking in the wilderness and psychadelics, especially simutaneously.  In the wilderness, it's often useful to be able to spot red objects amidst all the green (e.g. reddish poison oak leaves in the green scrub oak).  He has found that LSD enhances his perception of colors, but does not greatly improve his differential perception of green.  While his hiking companions are constantly pointing out red-tailed hawks, red manzanita bark, or the poison oak he's currently standing in, he still has problems picking them out of a green background.</p><p>So when the iodopsin in one or more of the sets of cones is abnormal, the signals being sent to the brain are the same, with or without psychadelics.  How the brain on LSD recognizes these signals may be different, but he</p><p>hasn't found that the green perception improves.</p><p>But he's continuing the therapy in hopes of improvement...</p><p>As far as *visuals* are concerned, he hasn't noticed any really special greens that he doesn't see in real life.</p><p>But here's a question:  does this hypothetical individual who is colorblind (total achromat, which is rare) _dream_ in color?  Would he/she know if the dreams were in 'color'? Would he/she know if the hallucinations were in 'color'?</p><p>`jimb</p><p>'LSD: not a cure, but good therapy for color blindness.'</p>",
 "year": "",
 "id": "28397",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-13T08:00:00.000Z",
 "views": "42642",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "LSD"
  }
 }
}
