{
 "id": 2839,
 "title": "Speedy or Sluggish?",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Booster",
  "gender": "Male",
  "weight": 118
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "It had been a while since I'd used opiates recreationally when I first heard of tramadol,  a non-opiate. I had to try it out.  Plus, it's really easy to get.",
  "Mostly what I'd had before was Vicodin and straight opium, which I 'made' from plants I'd grown.  I thought tramadol would be different, and the fact that it doesn't bind as well to neuronal opiod receptors lead me to believe it was fairly weak stuff.  But I totally disagree now.",
  "At 200mg, it comes on fairly slowly, with a lot of tingling in the legs and lower body (almost like a small, extended orgasm), then climbs up to my head.  It slows me down like Vicodin in some ways, but the thought processes seem less distorted.  I notice that I move a lot more on tramadol than on any other opiate; I'll catch myself shaking my leg or tapping my foot for no obvious reason.  It feels a bit speedy, and really boosts my mood.  I gotta say it's a lot of fun.",
  "However, I came fairly clear to getting habituated to it at one point, so I had to cut myself off.   Tolerance builds up pretty quickly for me, as I understand it does with most people.",
  "My friend, however, who is about 160 pounds gets very active on tramadol.  He is usually quiet and sedentary, but he was pacing around, talking constantly, standing on chairs, and giving me improv lectures on film-making.  It was almost like watching him on ecstasy, except that he was a bit more aware of himself.",
  "So is it speedy or slow?  I've never tried a drug that seems to do both simultaneously like tramadol does.  I can sometimes get minor visual hallucinations on higher doses, and it goes very well with a few hits off a bong.",
  "I'm not a tobacco smoker; usually I can't stand cigarettes, but on tramadol I can chain smoke my way through a pack in an hour.  Odd feeling."
 ],
 "erowid": {
  "id": "19350",
  "citation": " Booster. \"Speedy or Sluggish?: experience with Tramadol (ID 19350)\". Erowid.org. Jun 25, 2007. erowid.org/exp/19350",
  "substance": "Tramadol",
  "views": "6668"
 }
}
