{
 "title": "Quite A Sedative, Generally Unpleasant",
 "author": "MiranaiAnais",
 "citation": " MiranaiAnais. \"Quite A Sedative, Generally Unpleasant: experience with Olanzapine (Zyprexa) (ID 28422)\". Erowid.org. Feb 13, 2004. erowid.org/exp/28422",
 "substance": "Olanzapine (Zyprexa)",
 "bodyweight": "130 lb",
 "report": "<p>My psychiatrist prescribed Zyprexa (Olanzapine) to me as a sedative and anti-manic.  I was in a mixed-state during a manic-depressive crisis at the time:  my thoughts were racing through my head, I had not slept more than 3 hours per night in months, I was psychotic hearing voices that interpreted events for me, emotionally I was severely depressed and extremely anxious...quite wired and frenzied.  He told me this medication would 'calm me down'.</p><p>I had eaten four hours before I dosed orally 10mg of Zyprexa at T=0:00, one hour before I intended to fall asleep that night.  At T=+0:45, while laying down I began to feel nauseously dizzy and experience some mild visual hallucinations.  My heart beat erratically.  I fell asleep by T=+1:00 to be woken by my phone at T=+3:00.  When I stood up to answer it, I stumbled and was severely disoriented, walking into walls.  My vision blurred and I laid down to avoid passing out, which I did a moment later.  I woke and propped my feet up before the phone rang again.  I talked incoherently on the phone (the caller later told me I sounded 'drugged') and a few minutes later crawled back to bed before passing out again. </p><p>This experience, orthostatic hypotension, is a possible side effect of the drug, which for me did not pass until after T=+10:00.  I was too sedated to drive, very uncoordinated, mentally slow, and felt constantly on the verge of just going unconscious no matter what I was doing.  After being awake one hour from T=+10:00 to T=+11:00, I slept until T=+16:00.  The rest of the day, I felt sedated mentally and physically and lacked appetite.</p><p>After that intitial dose at 10mg, my psychiatrist dropped me down to 5mg.  That reduced level let me fall asleep one hour after dosing for a solid 8 hours, leading me to feel groggy in the morning though articially calm.  I developed an unshakable taste preference for sweets while on Zyprexa which faded after I ceased taking it.  The inability to eat anything other than sweet-tasting food and the general sedated feel led me to switch meds.</p><p>I have a high tolerance for caffeine and have reacted badly to lithium bicarbonate.  SSRI's have little effect on me.  I do not have any aquired tolerance for alcohol.</p>",
 "year": "2003",
 "id": "28422",
 "gender": "Female",
 "timestamp": "2004-02-13T08:00:00.000Z",
 "views": "31381",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Olanzapine",
   "form": "(pill / tablet)"
  }
 ]
}
