{
 "title": "Prisoner of Thought",
 "author": "Joe",
 "citation": " Joe. \"Prisoner of Thought: experience with Mushrooms - P. cubensis (ID 28433)\". Erowid.org. Nov 21, 2003. erowid.org/exp/28433",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "255 lb",
 "report": "<p>I had wanted to try mushrooms for a long time before I had actually gotten around to my first experience. At first it was more of an Im young and I love getting fucked up, well Ill give myself a little more credit than that. I had taken LSD thrice before and had some very profound (also very morbid) thoughts and experiences. As I kind of grew out of my self imposed stereotyped role of teenage rebellion and sank more into my self imposed stereotyped role of a 20 something beginning down the path of self realization and drinking too much coffee. I also began reading Buddhist literature and trying to understand my mind and this world, through meditation and the teachings.</p><p>I realize this is all kind of long winded and you prolly dont care too much but I think its necessary background for my little story here. So, as the concepts behind meditation, the teachings, and their desired goal started to become a little clearer to me I became a bit more interested in the effects of hallucinogens and the possibilities of experiencing the world (and primarily, experiencing myself) from an altered perspective.</p><p>I acquired the mushrooms with a friend of mine that was visiting from college for the summer. I had purchased two bags, each with about an eighth of an ounce (though it looked like more) of cubensis, and he bought an eighth as well. We were going to go walking in the park and experience nature and that kind of hippy crap. My plan was to eat one of my baggies and see how I reacted with him in the park (it being my first time and my friend being much more experienced I thought it would be good to have a baby sitter) and then (unless I had a really bad experience) I was going to take the other bag of drugs (mushroooooomss.) alone at my house and well I honestly dont know what my specific intention was but I know it was along the line of delving into the depths of my mind and looking for truth, spirituality, obstacles,  the true nature of existence, and my ego less self. You know, hippy shit.</p><p>My first trip in the park wasnt bad as a matter of fact it was a lot of fun, but I had only taken about half of the intended dose, I would say around 2g, at the recommendation of my friends father. The effect was miniscule. I felt a very nice body high and I noticed a definite difference in my perception. It was very positive but there was no serious deviation from my standard reality. But I was thinking good thoughts and feeling energetic and positive. No visuals or anything, just an inflated self esteem and a large need for water.</p><p>A few days later, encouraged by my excursion in the woods but also with the knowledge that I wanted a heavier experience, I decided to take the rest of my mushrooms. So I think we would be talking about right around 5.5-6g (I didnt really know what I was doing).</p><p>Earlier on in the day before I took the mushrooms, I talked to my ex-girlfriend on the telephone. She said that she might come over later to visit but maybe not. I still had a great deal of feelings about us breaking up and I also had a tiny bit of anxiety about the slight possibility of having to deal with people while I was high on mushrooms, so I really didnt want her to come over but I also wanted to be nice so I said okay, cause in all honesty this didnt seem like that big of a deal at the time, and I went ahead as planned.</p><p>I sat down in front of my little shrine area, meditation spot, whatever the hell you want to call it, with my mushrooms and a glass of water. It is, I feel, a good place for what I was trying to do, its tranquil, familiar and pretty cozy. I meditated for about 20 minutes and then I ate the mushrooms raw. Tasted like shit. It only took about 15 minutes, tops, to kick in, I hadnt eaten anything that day. I didnt keep any kind of timeline or anything so the time span is pretty fuzzy.</p><p>It all started really nicely and everything was pleasant. I got the feeling that I was in a very deep state of meditation, like my normal sessions but on steroids (or I guess mushrooms in this case). I started feeling a warm sort of tingling, or buzzing sensation spreading up my back and to the rest of my body. As I sat there, staring at a picture of Padmasambhava I have tacked up on the wall, the wall I was staring at began to morph a bit, and the picture of Padmasambhava also began to morph around. This phenomenon distracted me a very great deal but I continued to concentrate on the picture. As it moved thoughts started floating around in my head. Subtle suggestions that became traps I set for myself. I had a thought about the moving picture turning from a picture of peace to one of menace and sure enough the picture took on a very demonic look to it. The light from a nearby candle reflected ruby red in the eyes of the picture and the look on his face took on an evil grimace. I realized right away that this was just my mind playing tricks but it started giving me the spooks none the less.</p><p>I started to have some introspective thoughts about my life and my relationships with other people, and I slowly veered away from my formal meditation. I laid down on my stomach deep in thought about myself. I realized, more or less, that I create who I am to other people and I create who I am to myself. I saw that I am only an idea to me and that I am only an idea to anyone I have ever met. The only real attachment I have to my name, my friends, my favorite music, the things that I find sexually attractive, etc., are supplied by me and my own mind. I make the decision everyday of how to dress, how to speak, what to say and, what to do based on needs that I have.</p><p>So anyway that was kind of deep to me. I realized that Im too hard on myself. I saw that any experience had is never truly bad or good but that we bring our own perceptions of that experience and attach the emotions that come with that perception. I saw that it wasnt important that I was fat or skinny; if millions of people loved me, or no one in the world liked me it was all a matter of how I perceived the situation. Through this I saw me. I truly felt that I saw myself, objectively in my minds eye as I was. Free of embarrassment or shame of things I have done, thought or said, free of the need to want to be attractive to the opposite sex, and free of all the other things that are the constant distractions that rule my ordinary mind. I felt and saw the innocence I held as a child. Even though I had my previously stated realization of bringing emotion to a situation which is fundamentally not good or bad that didnt stop me from crying like a little girl. I cried out of joy at the realization that I was okay. I was a good person and I didnt have to be so hard on myself about everything, and I didnt have to worry about things all the time. In the middle of my tears I had also begun laughing hysterically at the joy of these ideas, and yelling out Im all right! Im all right!</p><p>Oh dear god what a sight that must have been, chubby man rolling around on the floor laughing like a lunatic through fountain of tears yelling Im all right! at the top of his lungs. I have the feeling that no one would have agreed with me at the time.</p><p>By the way this was only about 40 minutes into the trip. I still had a long way to go before the night was through.</p><p>Just then I hear an explosion closely followed by another and another. It sounded like someone was lighting off dynamite in my back yard. I turned around and looked out of my window which was upstairs and I could see flashing lights like rapid fire lighting bolts, or mortar fire from some old Vietnam War flick. So then, as you might imagine, I got kind of scared. I could also tell that the mushrooms effects were increasing by the minute. My auditory perception was increasing. It felt like things were 10 times louder than normal. It was like someone was in my ears turning up the volume. The explosions sounded like they were getting closer and louder. I ran downstairs, and as I stood up I felt fungals doing their magic all over my body but that was the last thing I wanted to think about at that moment. The threat around me was more imminent. I ran to the front door to make sure it was locked, and I had a very clear thought and image in my mind of men in military fatigues going door to door killing the families on my street and I had the feeling that I was next. For some reason I thought to myself Its the 3rd Reich!  Yeah for some reason rouge gorilla military outfits in the middle of my neighborhood didnt seem so far fetched. I think it had something to do with all the mushrooms I took.</p><p>Then I ran to my back door to make sure that was locked too. I looked out the back window toward the sound and to my great relief I saw fireworks being lit off about a quarter mile away. I was very shaken by this point but I was still able to figure out that it was Friday and there was a ball park not too far away from me, and on Fridays they play games and light off fireworks. The part of me that had figured this out was telling the rest of me to calm the fuck down. This didnt work as well as I had hoped. The mushrooms were really starting to get going. I sat on the couch, thinking, and trying to calm myself. I could feel a sensation in my body and my mind that told me I was in for a serious ride. The fireworks/3rd Reich incident had reinforced that paranoid feeling of someone coming to my house to get me, the seed of which was laid by my ex-girlfriend and my anxiety over her possible visit. It became less a feeling dread of having to entertain guests while high as a kite, and more of a generalized feeling of someone might possibly come here looking for me, and the prospect of this alone was an incredibly terrifying one.</p><p>I checked twice more if the doors were locked then I vaguely remember turning on the T.V. because a part of my now scattered mind wanted to see what was on. Then I heard a furious pounding on my back door and the feeling of paranoia increased 10 fold. I walked to my back door and put on the best Im not terrified of Nazis systematically killing my neighborhood expression and opened the door. There was no one there at all. This scared me even more. I locked the door and went back into the living room. The voices of my different points of view began to argue at me, and everyone was expressing their opinion. One part of myself said I had taken too many drugs and that I might die of liver failure (something I had heard about mushrooms) one desperate voice saying that I would be fine and that I should just relax, it will all be over in a few hours, and a murmur of a thought here and a visual image there.</p><p>For a moment I had the idea to call my mother, then I had the idea to call 911, then I had a very clear mental image of an EMT crew coming into my living room, and the image was accompanied by the emotion of fear that Im sure I would have really had had they actually been there. One voice, the one I recognize as being the closest to me in my sane mind or at least the part of me that wasnt corrupted by the drug, said to me You are absolutely insane right now. You are a fucking mad man. The implications, and meaning behind those words had never fully sunken in until that point and I knew that I was a schizophrenic for the time being.</p><p>I have Attention Deficit Disorder, as so many of us do. It felt like the barrier between the normally still physical world, and the world in my head, full of scattered thoughts, concentration that follows its own agenda and a mountain of distraction, had come crashing down leaving a reality that was completely dictated by the whims of my nervous mind.</p><p>I felt myself slipping away from my normal reality, my auditory perceptions were screaming, and I was hearing things (physically hearing them) that were not there. The things I saw with my eye were equally as clear as the images I perceived in my head. I began physically talking to myself saying things like Just hold on and dont give in I didnt completely understand what I was saying or why I was saying it, but looking back I did have the sensation of being pulled away from my reality and I instantly associated that with death and my death. I had visions of headlines in a paper about a boy (boy not a man) dying in his home over the weekend. I had images and impressions of what my family would think and how they would feel. I felt sadness at not being able to see them one more time before I kicked the bucket.</p><p>I decided that I had to get these demon molds out of my belly. I ran to the bathroom stuck my finger down my throat and 86d the offending party. As you might have guessed though it was tooooooooo late for that now. I remained on my knees in front of the toilet.</p><p>My auditory issues had gone beyond their volume and right on to straight hallucination. If I had to make a guess I would say that my ears at that moment in time were in a direct link to that part of the brain that gets a song stuck in it for days at a time. I was hearing things from my environment and they were sticking to my brain like cheerios on a spoon covered in honey. The sound of leaves blowing in the wind from outside, the sound of an emergency vehicle that I think actually passed by (I cant be sure), the sound of a telephone ringing, various voices (female and male), and a bunch of various noises that sounded like old stock Star Trek sound effects, had all jumbled themselves in my brain and formed a track that lasted about five seconds. It sounded like a crude song that some experimental band might create. I didnt find it frightening I found it absolutely maddening. It was so loud and so saturating that could no longer focus on actual thoughts with real substance (like where I was or how I had gotten there). All that I had left were the traces of fear, dread, regret, and paranoia that had been imprinted on my psyche.</p><p>The weird song carried me off to a place that I have trouble putting into words. I remember it was dark but I didnt feel like I was expecting to have light. It felt as if I was ignorant of light's existence. I was in a place and I was not mentally present my mind was adrift with those residual negative feelings leading the way. I remember feeling incredibly overwhelmed by what was going on. I had loads impressions thrown at me that I cant even fathom. They werent emotions or thoughts, or actual physical sensation or something you could hear or look at but they were all those things at the same time and they were none of those things at the same time.</p><p>I think I started to leave this place and start to gain a more conceptual view of what was going on because instead of those strange impressions I had flashbacks of feelings and mental images I from my childhood, that I had long forgotten. I started to think about my father and our shabby relationship, and feeling regret at my lack of effort to help fix it. Then I thought of my ex-girlfriend and I realized that I truly did love her and that I missed her with all my heart, and I thought about my mother and blah, blah, blah regret, regret, regret. Basically it all ended with an I wish I could tell them goodbye or how I felt before I die.</p><p>Pretty suddenly, I came to myself. The music had stopped at the chaotic mess of mind that I was swirling in spat me back out and I realized that the only noise in the room was the small hiss one of the pipes under the sink was giving off. I found myself sitting in the middle of the floor with my knees pulled up to my chest just staring at the wall. For a minute I could see both sides of the coin. I could see how a still quiet room could just as easily be perceived as a riot of sound and experience. I collected myself off the floor. I still had a small (very small) feeling of fear. My mind was still racing but I could feel myself coming back to a more manageable level of mind. I knew that I had left the house in shamble with my frantic mental collapse. I cleaned up and decide to go to sleep.</p><p>I couldnt sleep at all and stayed up another 3 hours analyzing what had just happened to me. This was an incredibly terrifying experience but its also an experience I am grateful for. First of all I got to see my Attention Deficit Disorder. I was actually in a world created by its disorder and distraction. Also my reaction to what I thought was death was a pretty strong telltale sign as to how I would react when actually faced with my own mortality. </p><p>In Buddhism they often talk about grasping and aversion, and being neither attracted nor repelled by experience, thoughts or emotions. This is important in life and, now I am certain, a necessity in death. That instinct that I had to hold on and stay in this world and not give in to what the drug was doing to me was the source of all of my negative emotions. Im sure that is exactly how I would have responded if I was really dying. It left me in a world that was devoid of presence and completely ruled by fear, confusion, and regret. I think this could have really been some form of hell. Once again, I am grateful for this experience, I have a clearer picture of what I need to work towards in this life, and also a few guidelines and ideas as to how I can go about achieving these things.</p><p>Thanks for reading this ridiculously long thing. I hope that this might give some perspective to someone else who may have had a bad experience or help someone avoid one.</p>",
 "year": "2003",
 "id": "28433",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-21T08:00:00.000Z",
 "views": "14949",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.75 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
