{
 "title": "Sex and Death",
 "author": "Uncle Sid",
 "citation": " Uncle Sid. \"Sex and Death: experience with Mushrooms & Cannabis (ID 28440)\". Erowid.org. Jun 7, 2007. erowid.org/exp/28440",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>This is an account of a trip that happened a few years ago. I have never really been able to adequetely describe in words what happened, but after much contemplation the experiance has been fully integrated.</p><p>Preperation:</p><p>My three friends (T, B, R) and I were able to secure our hands on some extremely potent shrooms. We were all tripping alot at this point. Prior to this trip I had maybe tripped half-dozen times and had good experiances. I had also not taken any heavy doses. I planned on eating the remainder of a half-oz which ended up weighing 5.5. I read Timothy Leary's Psychedelic Experiance all week in preperation with mediation and a fast the day of the sacrement.</p><p>Setting:</p><p>A decent sized dorm room with music and close friends. R and I were the only one's dosing and T, B were sitting. These were really good friends so the setting was nice and comfertable.</p><p>The Trip:</p><p>After munching down on the fungus I took one large bong hit. I percieded to cough it out and nearly vomit. Very, very close. I held it down though. At this point we decided to go outside for a cig before shit gets too intense. After about 15 minutes after ingestion I noticed the table that we were sitting at was coming alive. The different rocks in the cement began to turn to luquid and ooz. Different shapes were forming however I felt very uncomfortable because I was around people who were very clueless about tripping and I had to remain cool. Anyway we got back inside safe and sound. I plopped down on the bed and began to sink down the rabbit hole.</p><p>Everything in my view seemed to have less color or lost clarity. It was as if I only had 16 basic colors to view and on top of that everything was made up of liquid. I decided to close my eyes and just let it go. I was now seeing liquid but in millions of colors. Beautiful colors filled my vision which were also somewhat terrifing at the time. I recall saying in a monotonous tone 'Whaat's Haaapening?!' My friends tried to make contact with me and thats the last I remember them being present.</p><p>This is the point of total blur. I don't really recall all that much. All I knew was that I was no longer myself. I didn't remember eating any mushrooms or being in that room. I was whisked through a world of color and scattered images. T and B report that I was falling down alot, and looked like it hurt. Wallowing around on the floor changing different positions, sometimes half under the bed, curled next to the TV, everywhere. I was apparently singing along with the music alot. They remember me saying, 'If this ever happens again, I'm gonna cry'. I remeber none of this behavior.</p><p>Going deeper into the trip I suddenly was becoming aware of some issues in my life. I was seeing many sexual images. It was as if I was being tempted by a women. She was making extremely lewd gestures. Like the most hardcore porn I'd ever seen. I remember vaguely that I thought we were having sex. However R broght me out of it and situated me in the chair. I'm sure what my friends were watching me do had to be akward. I believe this chapter of the trip was about my viginity at the time. I lost it in the following weeks. It was as if the shroom was preparing me for it. It kinda of showed me things about how I actually felt about my partner. It was showing me the difference between having sex and making love.</p><p>I suddenly became aware of death. I knew it was present.  It was hard for me to accept and I held back for some time. It was as if there was a countdown going on. It seemed as though my brain was making final preparations. Going through it final processes. At this point I was unsure what the countdown was too.</p><p>As the countdown was nearing it's end I just gave in and accepted that what was going to happen is what is going to happen and there's no stopping it. I was instantly filled with pure joy and extasy. Waves of energy rushed through me. I felt I was immortal. I felt I could create my own realties. There was no fear of death because I was already past that. Having been my first experiance with transcendence it lasted shortly. I was however treated with many visions which encompassed many things. I saw visions about how humans have extreme potentail however we aren't aware of it/ or simply can't use it yet. I saw how the use of certain pschoactive plants is very important to humanity. And that they are the key to saving the Earth and humanity.</p><p>It was at this point that I got up out of my chair and decided I was leaving. My friends rushed to stop me, 'NO, what are you doing' I was like, 'Anything I want!' They were trying to snap me back into reality. I was smoking a cigarette and to prove that I was immortal I threw my cig at B. I then bashed a bunch of lights and shit off of T's TV. I'm not sure what I thought, basically I guess I thought that I could create and destroy anything I wanted so therefor possesions or injuries meant nothing. I could create them at will. In any regard he picked the cig up and walked over to me and said, 'Bad, this burns things.' I then realized what happened, and fell to baseline. The best part of all was snapping back into reality in that chair. Just as Cheech and Chong started. I found it hilarious. A great movie to imprint with on a comedown.</p><p>Peace,</p><p>Uncle Cid</p>",
 "year": "2001",
 "id": "28440",
 "gender": "Male",
 "timestamp": "2007-06-07T07:00:00.000Z",
 "views": "3356",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
