{
 "id": 2844,
 "title": "Stimulant Clarity, Spiritual Growth, and Fear",
 "date": {
  "submission": "2005-12-15T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Guinness",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "25",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Paroxetine",
   "form": "daily"
  },
  {
   "time": "0:00",
   "amount": {
    "number": "500",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Divalproex",
   "form": "daily"
  },
  {
   "time": "1:05",
   "amount": {
    "number": "54",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Methylphenidate",
   "form": "ground/crushed"
  },
  {
   "time": "3:25",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "5:30",
   "amount": {
    "number": "15",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "6:30",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "6:35",
   "amount": {
    "number": "1",
    "unit": "cig."
   },
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  }
 ],
 "report": [
  "Let me first start by saying that I am 19, have been under an ADD specialist since the 3rd grade; and throughout that time have always been on a CII stimulant medication for the treatment of ADD.  More recently, I have been diagnosed by my psychiatrist as having chronic depression, as well as probable bipolar disorder.  I am currently taking 25 Mg of Paxil CR every morning for the treatment of chronic depression.  I am taking 500 Mg of Depakote ER as a mood stabilizer for the symptoms of probable bipolar disorder.  Before I begin the real account of this event, I wish to stress that IF YOU HAVE A MENTAL CONDITION OR DISORDER TO PLEASE USE EXTREME CARE IN USING PSYCHOACTIVES, ESPECIALLY STIMULANTS. ",
  "When I was younger I was on various doses of Ritalin (methylphenidate) until I eventually built up a tolerance to the drug.  My specialist then proceeded to try Adderall (dextro-amphetamine) when I was in 8th and 9th grade.  At that time I had no interest whatsoever in exploring psychoactives, and at the time Adderall was truly too much of a drug for me to handle.  I was then placed on 18 Mg Concerta ER (extended release methylphenidate) from 10th grade through about a month ago.  Throughout this time I can certainly say that I have seen my fair share of psychoactives (although I have never preferred uppers) and have had by far excellent experiences with almost every substance I have used.  Recently (over the past year) it became clearly obvious to myself and my family that Concerta just wasnt doing anything.  Finally after much hassle I convinced my Dr. as a few days ago to let me try Adderall again.  He agreed and placed me on 30 Mg of Adderall XR (extended release dextro-amphetamine).  I wasn't too thrilled about it being extended release but that was no big deal to me, as it is easy to bypass the controlled release function. ",
  "So without further delay, this account begins.  I was in what has become a quite good mindset as of lately (due in part to Paxil and Depakote).",
  "8:30 PM - 500 Mg Depakote orally",
  "9:00 PM - While holding both a bottle of Concerta and Adderall in my hands, a sequence of thoughts occur.",
  "9:05 PM - Crushed 54 Mg of Concerta ER to bypass the time release function and separated the methylphenidate salt from the waste prduct.  Administered the 54 Mg.",
  "9:45 PM - Feeling a smooth wave of tingling and the beginning of changes in concentration. Pleasant, soothing, but certainly capable if thinking on a fast pace track if required.  Continue to chat online and listen to music.",
  "11:55 PM - Injest two 15 Mg capsules of Adderall XR. ",
  "12:45 AM - one word.... wow.  Currently watching the movie Pi, and consuming thoughts at an incredibly fast rate.  Living on the edge, this is where it all happens.  I am quite content at this point, but I want to go further.  Pulse average of 85.  No paranoia at all. ",
  "2:00 AM - Emptied one 15 Mg capsule of Adderall XR into a small pile.  Constrained the tiny beads from shooting everywhere, and crushed contents to a fine powder, and further refined with a razor into a single line.  Not extremely harsh at all on the nose.  Significant excessive energy at this point, unwanted jitteriness.",
  "3:30 AM - I have consumed approximately 3 glasses of decaffinated tea so far.",
  "4:00 AM - 200 Mg of caffiene injested orally due to the long life of caffiene in the bloodstream. (Vivarin)",
  "4:05 AM - Go out for a cigarette. ",
  "4:06 AM - About halfway through my cigarette....God almighty, I feel like someone just hit me in the forehead with a brick, and then proceeded to take my brain and put it into a blender.  Extreme disorientation present.  Lack of stability in gaining balance after initally standing.  Slight paranoia sets in.",
  "4:10 AM - Personal Note: 'So this is what going to far is huh?... I see...'",
  "4:15 AM - Sitting outside focusing on the street lights (seemingly quite harsh at this point), I light up another cigarette.  After a few drags, I have to extinguish it and go inside due to a slight nausea when smoking, and a general anxious state at this point.",
  "4:20 AM - Get in bed and attempt sleep, despite the fact I knew that was impossible.  Pulse now around 110 sustained.  General feeling of being cold. ",
  "4:25 AM ? - Mild, but disturbing open eye hallucinations begin, so I close my eyes and turn over.  Somehow though, I am disturbed by the fact of ignorning what I know to be hallucinations so I entertain the thought and lie on my back with my eyes open. ",
  "? AM - too lazy, paranoid to turn and look at the clock.  Hallucinations become more intangible almost as if whispering whisps of gas, yet at the same time are quite defined and present.",
  "? AM - Getting more paranoid by the moment.  I get up go to my another room, shut the door, and get online.  Hallucinations follow (again of a disturbing nature, which I'm not quite sure how to describe but I would definitely categorize it as a portrayal of evil).  One or two faint trace color hallucinations appear quite a while apart.",
  "5:30 AM - Alarm clock goes off.  Panic attack due to the sudden noise occurs.  (Not too much fun there).  Feeling of almost being immobilized from panic and terror is overwhelming at this point. Yet I managed to get outside into the front yard.  A sense of getting away from something that I knew perfectly well was not real, overtook what my body thought it was experiencing.  Somewhere around this time I noted my pulse to be ranging from 150-160 sustained, with a cold sweat present.  I honestly felt as if I was going to have a heart attack, and at this time began resolving to God to not act so foolishly and deliberately taking a dangerous combination and/or dosage again. ",
  "Mild to slight paranoia continued for the next 2 hrs.",
  "9:30 AM - pulse back to normal level of 73.",
  "Again, I wish to make it clear the importance of knowing not only what your body is capable of but also what your mind can handle."
 ],
 "erowid": {
  "id": "19360",
  "citation": " Guinness. \"Stimulant Clarity, Spiritual Growth, and Fear: experience with Methylphenidate, Amphetamines & Caffeine (with psych meds) (ID 19360)\". Erowid.org. Dec 15, 2005. erowid.org/exp/19360",
  "substance": "Methylphenidate, Amphetamines & Caffeine (with psych meds)",
  "views": "27016"
 }
}
