{
 "id": 2847,
 "title": "Definite Effects",
 "date": {
  "submission": "2003-01-03T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "D"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "cig."
   },
   "administration": "smoked",
   "substance": "Damiana",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "plant material"
  }
 ],
 "report": [
  "I ordered 30 grams of Damiana along with some other herbs and extracts a while ago. I chose to try this one first as there was so little about it's effects posted anywhere. It should be noted that, like everyone else, I have tried many so called 'legal highs' from headshops in the past with no effects.",
  "I started by rolling a joint with just Damiana, I found it almost impossible to roll it, so I added the smallest amount of rolling tobacco below and above the Damiana, this made it just possible to roll.",
  "I lit the joint and inhaled, immediately I enjoyed it, it was a very smooth smoke, and very easy on the lungs. I don't smoke much tobacco, so I'm not too good at inhaling alot of harsh smoke, but this was remarkably good to smoke, I'd enjoy smoking it whether there were any effects or not.",
  "About half way through the joint I started noticing definite effects, there was quite a strong body load (well, more than I was expecting) and it reminded me of cannabis quite alot.",
  "I soon finished the joint, and just sat listening to music. I tryed to stand once or twice and it was possible, but it's definately best to sit down in a nice comfortable seat. After maybe 10 - 20 mins the body load seemed to wear off, it was still there if I stood up, but very slight. I continued to listen to music and I chatted to some friends on MSN, I was still obviously mentally stoned (ask my friends!). The obvious mental effects wore off after 30 - 40 mins, but I felt good for the next hour or two.",
  "In conclusion, there were definitely effects, I have repeated the experiment with the same results. I'm going to experiment more with larger joints, and an oral dose. I may also try an extract to see if it has the same effects, I'll probably make my own though as I haven't got any cash left :). I will also see if my friends get the same effects. Overall it was nice experience, sure it's not the same as cannabis - but what is - sometimes I just want a nice relaxing smoke without using cannabis."
 ],
 "erowid": {
  "id": "19371",
  "citation": " D. \"Definite Effects: experience with Damiana (ID 19371)\". Erowid.org. Jan 3, 2003. erowid.org/exp/19371",
  "substance": "Damiana",
  "views": "65692"
 }
}
