{
 "title": "Soul-less and Sliding in New Space Dimensions",
 "author": "Infamous Mr D",
 "citation": " Infamous Mr D. \"Soul-less and Sliding in New Space Dimensions: experience with 5-Meo-DiPT, N20, & Cannabis (ID 2851)\". Erowid.org. Sep 16, 2000. erowid.org/exp/2851",
 "substance": "5-Meo-DiPT, N20, & Cannabis",
 "bodyweight": "65 kg",
 "report": "<p>One night, a chick-friend and I had some 15mg of Foxy, had some bulbs and smoked some pot. I got /very/ nauseous and had to lie down for about an hour.</p><p>But when it kicked in - talk about tryptamines  we tripped pretty hardcore. I could see these wonderful never-ending CEV fractals. I could see (open-eye) my friend and I 'moving back' or 'sinking' our position in some other spatial dimension. It was weird. We were both in the same sorta mood, very connected, on the same wavelength  completely different wavelengths to the others in the room (one was E'ing and falling asleep, the other speeding and talking non-stop).</p><p>Wed talk to each other as if wed just discovered each sensation, feeling or object. Maybe it was an 'out-of-body', or close to it. We both felt we sorta left our souls behind. I tried to reason with different things having collective consciousnesses. Its like we stepped back and lost our 'interfaces'  the social layers above 'the real me'. I theorised that everybody, deep down, has this inner person, reflecting their deepest sense of self. For some, its a tired old man, some an angry child, or the clumsy nerd who wants sympathy. We sorta got to that person, who was sorta confused (but not scared) about being on the surface.</p><p>I saw a lot of colours differently  I saw my friend's face having a definite pink tinge. I saw open-eye the light coming to me as a collection of pixels  sorta like adding some random RGB noise to an image  I saw that to some extent for a few days after and still (2 weeks later) notice it to a very small extent.  Maybe it made me realise how perception of light works?</p><p>I could feel my brain and it hurt. I could feel very deep down into all the twists and turns and into the finest nerve detail, and it was sorta throbbing. I wondered if my mind was trying to figure out the winamp plugins, like doing hardcore semi-subconscious maths and throbbing from the intensity of what it was trying to do. Massaging my head would sometimes bring on CEVs of the most beautiful fractals. Maybe different parts of my brain were stimulated by it and contributed different effects.</p><p>I had about a dozen cones and a couple of bulbs of Nitrous along the way  they just seemed to tie in with it. I didnt total-dissociation-trip with the N like I commonly do  put that down to low dose. I would have liked some more bulbs, but seemed to hurt more with each. </p><p>[My head continued to hurt bad the next day.  It hurt more when I concentrated on it, but I couldn't help it because it hurt so much.  A sorta vicious cycle.  So I took 4 panadols, 120mg pseudoephedrine and 2 points of methamphetamine (1.5 snorted, 0.5 swallowed) and I was fine enough to rave hardcore for 8 hours.]</p><p>My friend was a very different person. I sorta saw that deep-down person. She turned ghost-like or goth-like  with the pale skin and dark hair and clothes. She looked old-world to some extent.</p><p>We felt that sinking into another dimension or changing position on it, though we still could be seen. We hadnt gone completely, just moved slightly. My friend looked like she 'sunk' about 10cm into this dimension, I felt not quite that far. Sometimes it seemed like there was a screen the exact shape of our bodies around each of us. We viewed the world through this screen.</p><p>We talked very objectively and logically, as one would, had their soul left them for a bit. Well, sorta relaxed. The sinking was very relaxing. I was surprised how much we understood how we were experiencing</p><p>It didnt feel real at all. Like stuff didnt have the importance to be really happening. We werent perceiving it as normal life. We didnt fit in, wed moved away. Stepped back. The other people were just lights and sounds through our screen.</p><p>We had moved away in another dimension, shed layers of fakeness and were in touch more with the physics, rather than perception. Broken free from the shackles of 4 dimensions, and seeing what our minds could perceive. I think we perceived the 5th. The crazy thing is, its a spacial dimension. Or we perceived it as one. Perhaps we saw it as parallel to x.  I think that dimension was brought on by enhanced shadows in our visuals. Also interesting to note is that I have singular vision. Maybe that has something to do with it.</p><p>Maybe we need to explore with drugs just how to use our brains properly. Lose the conditional upbringing that tells us to use our brains for such a limited subset of what they can truly perceive and understand.</p><p>It was a very trippy and unique experience, but one I'm not too excited about repeating.</p>",
 "year": "2000",
 "id": "2851",
 "gender": "Male",
 "timestamp": "2000-09-16T07:00:00.000Z",
 "views": "9437",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
