{
 "title": "Splitting a Pole",
 "author": "Palo",
 "citation": " Palo. \"Splitting a Pole: experience with Mushrooms (ID 28523)\". Erowid.org. Oct 18, 2007. erowid.org/exp/28523",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "3.0 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>I like mushrooms. A lot. The reason being every trip is like a gift, its always different. I learn something new everytime, usually about me but sometimes about a friend or a place. In early June some friends of mine, L and his girlfriend A, along with Junebug, moved into prospect park, a kind of post-grad student haven, lots of gardens and a park or two. And a very low hater presence. As a sort of house warming we decided to bite some fungus along with Junebugs girl M.</p><p>Some brief history; L and Junebug have been friends since kindergarten, Junebug and I since third grade. l and I met in 11th grade. Now A is what we call high maintainence and is too controlling to get along very well with hallucinagens. Wisely she chose to opt out of the trip. Okay? okay. Now, about three blocks from the house is a building known as the witches tower. So called because the roof of the tower looks like a pointed witches hat, clever right? It stands on a hill over looking a river and offers an awesome view of the Downtown Minneapolis skyline. we rolled some blunts, munched our mushies (2g), and marched to the tower, all but A, just before sunset.</p><p>T+ 00:30</p><p>As we arrived some cigarettes were had and we noticed a few paths leading down the hill and into a dense forest. Do some exploring, and what we found! A ways down the path the forest opened into a huge canopy with rocks and tress and hills and green and fun at every turn. We started to trip. It was a playful running and laughing thing. we ventured back to the top to watch the sun set over the skyline, I was the first up and I noticed that the normally white tower was now a vibrant but suttle pink. my mind still somewhat intact at the time wondered if it was a reflection of the sky but that was a burning orange. I stared for a few moments before realizing a family of picnicers staring at me, I joined my journymen around the corner on a bench. for a time we sat and spoke loudly about how we liked it better in the forest and how the rigid stucture of society was crushing us and everyone else. The seeds of escapism took root.</p><p>T+ 1:00</p><p>Taking note of our condition and topic of conversation we decided it was time to make haste away from the park with twilight taking hold. As we walked back to the house L was in his own little world M and I had sobered a bit as walking tends to do but Junebug was zoomin. He tried to describe his trip for me, what I got out of it was that for him, the world was a series of grids and diagrams, similar to blueprints and akin to the code in the Matrix movies. He would drift in and out of the grid dimension but every time he would start to speak a grid would form and intersept his sentence, making it part of the code. Now at some point L split a pole, we begged him not to but he did, almost snikering about it. Directly there after he went to see A and M, Junebug and I went on walking to a park at the end of the block.</p><p>T+ 1:30</p><p>We got to the park and decided it was time to smoke a few blunts. At this point a started to really zoom so time after having arrived at the park became incalculable. The three of use sat for a long time just smoking and talking, mostly about leaving society to while a way the says on some beach just smiling. The conversation was so liquid and easy it was like come up of ecstacy, I was totally blissed out.</p><p>T+ ?</p><p>After a few years we left the park and returned to the house. L and I decided to eat another gram. We sat about watching the Animatrix (best eye candy this side of women) we were smoking and after a while the room filled with a thick purple smoke I could manipulate with my hands, I still havent decided if that was real or not. Junebug was noticably tweeked and on ocassion would interupt complete silence to ask 'What are we even talking about?' I was a little worried about him but hes well versed in the hallucinegens he can take care of him self. I didn't say anything because I dont worry about me until someone else does. He would later tell me that he couldnt seperate the TV and reality. He also told me that he was reading our thoughts, and with out me telling him prior, said that I thought he was fine but wasn't sure and that I didn't want to say anything, he told me that L was all out concerned. A fact L reported to me that night.</p><p>Now outside, I sat in the front yard, it was thick with small plants about the ankle I sat forever and tripped. Hard. Ill spare the details but generally I need to be looking at something to really get visual, this time however the air was latent with texture, bubbles and beautiful women, all sorts of patterns just in the air. Junebug got a little better then a little worse and then M put him to bed. The three left started to watch terminater 2, but it got to me, the apocolyps scene. So I went to rest a bit.</p><p>This is when things got bad, I started seeing things I didnt want to see and threw up some. Junebug fell down and caused some confusion, but L, L lost it, he fell and his nose started to bleed, he was convinced he had mushroom poisoning and began to shout and yell. It was time for me to go, far to many bad vibes in the house, I assured L he would be fine and drove home still lightly tripping.</p><p>Some things to keep in mind about L, he and I have always walked a line between friend and foe. He is the darker half of our balance, we believe the same things but in radically different ways. That night as I mentioned L split a pole, very bad hoodoo in our circle, he was walking always ahead or behind never with us. When we were watching the movies he and A sat very close and a dark aura settled over them his look turned sinister which it has a tendency of doing, but this time a caught him mugging Junebug on more than one occasion. L displayed his loyalty that night.</p><p>Only a couple of weeks later Junebug broke some ribs and couldnt move much. Up in his room he had a cigarette, L and A kicked him out, it was a first offense in a no cigarrete house. L and A in the following days asked me to pick sides in a few more sly words. A friend wouldn't ask me to pick sides, I picked the friends that didn't. I haven't spoken to L or A in a long while. Me and Junebug still do drugs.</p>",
 "year": "2003",
 "id": "28523",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-18T07:00:00.000Z",
 "views": "2486",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
