{
 "id": 2853,
 "title": "A Paralyzing Mixture for Someone Like Me",
 "date": {
  "submission": "2002-12-05T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "sharpe",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>I'm a moderate to heavy drinker. A night of drinking for me will usually start around 8pm and go until close (2am). In this time period I have no problem drinking constantly while still maintaining a trace of sobriety (i.e. I can always walk, talk etc; I rarely puke or experience dissorientation).",
  "The beginning of one night several weeks ago boggled my mind. I usually don't respond well to weed - I'm a sleeper. I take a few drags on a joint and get all glazey eyed and have to make an effort to speak and interact socially.",
  "Whatever.",
  "We had been around drinking for a while when someone sparked up a joint and I thought why not join in... Half a minute later we were getting ready to go and I put on my jacket. My vision shot off into the distance and I fell to the ground. I couldn't feel my body or understand where I was or what was happening. Slowly, after and indeterminable period of time (it felt like I had briefly been outside of time) I could here voices of concern talking about me and 'me' seemed like an odd thing. Then the sensation that someone was touching me and talking directly to my face faded in. I clambered up to my feet and almost fell over - what was this? I'd just gotten started drinking and I felt like I was a teenager hammered off their first beer. I moved to a couch and collapsed. I was in an uncomfortable position but my arms wouldn't move to correct it. My face felt cold and tight and I could barely form words. I was paralyzed! All this from a couple drags on a joint?",
  "The next day when I woke up I noted a massive bloody scrape on my knee where I had fallen (luckily my arms broke my fall saving my face!) It was soaked right through to the front of my pants .. yummy!",
  "I suppose the moral is to understand how you react in a safe setting before mixing things in the wild. I can only imagine the results if a similar incident had happend at a bar, or anywhere in public for that matter. It also reaffirms my own personal suspicion.. mj and beer don't mix good at all.</p>"
 ],
 "erowid": {
  "id": "19390",
  "citation": " sharpe. \"A Paralyzing Mixture for Someone Like Me: experience with Alcohol & Cannabis (ID 19390)\". Erowid.org. Dec 5, 2002. erowid.org/exp/19390",
  "substance": "Alcohol & Cannabis",
  "views": "23773"
 }
}
