{
 "title": "Wellbutrin Makes Me Sick (Literally)",
 "author": "dopesickgirl",
 "citation": " dopesickgirl. \"Wellbutrin Makes Me Sick (Literally): experience with Pharms - Bupropion (Wellbutrin) (ID 28561)\". Erowid.org. Nov 21, 2003. erowid.org/exp/28561",
 "substance": "Pharms - Bupropion (Wellbutrin)",
 "bodyweight": "105 lb",
 "report": "<p>\tThis psychiatrist prescribed me wellbutrin for my 'add' and panic disorder.  (I, personally, don't think I have add.  Or if I do, its very mild.) He started me on 150 mg for four days and then said I could start taking the 300 mg.</p><p>\tOn the 150's, I didn't feel like eating.  I had a lot of trouble sleeping.  But I figured maybe these side effects would go away once I started taking the 300's...  but it only got worse.</p><p>\tThe first day I took a 300 mg, I had trouble concentrating the whole day.  And then, when I went to bed that night, I couldn't fall asleep.  I was up the whole entire night.  I've had problems with insomnia before though, so like an idiot, I continued taking the pills.</p><p>The next night, I couldn't sleep.  But then, right when I thought I would actually fall asleep, I started vomiting all over the place.  For the next three days, I couldn't eat a thing.  Not even a saltine.  No soup.  Nothing would stay down except tea.  I just tried my best to stay hydrated.  I had trouble sleeping.  My stomach ached.  My head pounded.  I was very weak.  And the whole time this was happening, I thought I just had the flu (a couple of my friends had it at the time). </p><p>\tBut then I realized all these problems started when I started taking the 300 mg wellbutrin.  I checked out the side effects of wellbutrin, and sure enough, nausea and vomiting were on there.  Other side effects were severe headaches and insomnia.  I called the psychiatrist and he said to stop taking the wellbutrin until I stopped vomiting.  Then he said I could start taking them again.</p><p>\tI am never touching that stuff again.  I dont care if a million psychiatrists around the world tell me to take it, I am never putting bupropion into my body again.</p>",
 "year": "2003",
 "id": "28561",
 "gender": "Female",
 "timestamp": "2003-11-21T08:00:00.000Z",
 "views": "19701",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  }
 }
}
