{
 "id": 2859,
 "title": "My Encounter with Calvin Klein",
 "date": {
  "submission": "2000-10-10T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Suzy",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "tablet"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This past weekend I had my first experience dosing on E.  I have to say that it was the best and most memorable night to date for me.  Let me tell you the story....",
  "My two good friends had asked me to join them on the weekend for a rave and if I'd join them in dosing.  I welcomed their invitation with open arms since all I hear is good things about people going on the drug.  We went to our fav bar for a little while about 10:30p.m to 12:30p.m.  We were still looking for the stuff when we left the bar but knew we'd have no prob once we got to the rave.  We searched for a while once we got there and finally found some at about 1:30am.  We took it right away.  My friends had both done it before so I was the only one doing it for the first time.  I was just resting on our blanket for the first 10 minutes or so waiting for it to kick in, every now and then getting up to dance a little.  My one friend kept asking my if I was feeling anything yet and I could but it was just small tracers and a little bit of heat running throughout my entire body.  I started to feel really relaxed.  I sat back down and not even a minute later I had to get back up.  I had this sudden urge to dance, but I still did not feel fucked up yet.  Well not even a minute again later, I stopped dead in my tracks I just looked around at everything. ",
  "The lights, people dancing, the glowsticks in my hands.  It was like a big hand had just pushed me since I kind of stepped back a little and I realized that I was feeling the most intense high of my life.  It was FUCKING AMAZING to say the least.  I felt as if I was literally walking on air and I stumbled back to where my friends were and said 'I'm fucked'.  The night had just started.  It was really intense for the first 20 minutes or so, I couldn't really control my own movements so I decided to sit down a while to get used to it.  It didn't take much sitting to get used to it.  Any kind of shitty feelings I had, had seemed to slip out of my body and it left behind this great sensation.  I couldn't sit still and it stayed that way the entire time.  The next time I remember looking at my watch was at 3:30am and I thought I still had 4 hours or so to go.  I met the best people that night.  I seemed to be on the same wavelength as everybody else.  They all seemed to know what and how I was feeling.  It was great.  You have this ability to talk to anybody and everybody about anything.  You have the greatest conversations with people you've never met before.  I never once the whole time I had dosed had a bad time.  But I think the atmosphere I was in was so friendly and full of positive energy that it would have been hard to have a bad trip.  You have to be prepared before you go though.  Have something to suck on (I did and it helps sooo much), have plenty of water, good friends to be with, a blanket (I seemed to get pretty chilly later on when coming down) and a really good attitude going in.  Give in to whatever your body tells you.  Dance the night away. ",
  "But the night was awesome.  Everybody I met there was mostly doing the same thing I had done, it was called Calvin Klein.  Very good stuff I have to say.  I would dance for a while then talk to some people. I always felt like I had to have something in my hands.  Something to play with. Smoking felt really cool.  I remember that the cigarettes seemed to last forever before they were gone.  Every now and then though I would have to chill out and take a break. Saw some people I hadn't seen in a long time and it felt so good to see them again. I had a really lovey feeling most of the time but it wasn't too intense.  I was really thankful to my friends for inviting me and I kept thanking them.  I find it impossible to get mad at someone while on it but its probably not impossible. I didn't start coming down until about 5:30am and so me and this girl rolled a J and smoked it.  It gave me a little pick me up and I pretty much danced until it was over at 7:15am.  By that time I had come down a lot but could still feel it in my body.  I didn't get to sleep until about 8:30am. ",
  "When I woke up at 5:00pm that same day, I could still feel it.  It was like I wanted to just get up and dance.  I wasn't screwed up like I was the night before but I was still in such a good mood and still really talkative.  I never had any side effects which is good.  Hopefully it will always be this good.  But what I want to tell everybody who considers doing it, read about it first.  It will help you a lot with how you should handle things.  Always be prepared.  I wish you a good trip to all doing it.  Until next time.........."
 ],
 "erowid": {
  "id": "194",
  "citation": " Suzy. \"My Encounter with Calvin Klein: experience with Ecstasy (ID 194)\". Erowid.org. Oct 10, 2000. erowid.org/exp/194",
  "substance": "Ecstasy",
  "views": "8488"
 }
}
