{
 "title": "My Mind is a Garden",
 "author": "Ibone",
 "citation": " Ibone. \"My Mind is a Garden: experience with mushrooms (dried) (ID 28596)\". Erowid.org. Jun 7, 2007. erowid.org/exp/28596",
 "substance": "mushrooms (dried)",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "3.5 g",
  "oral",
  "Mushrooms",
  "(dried)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Alrighty, Well I'm a junior in college, have been wanting to do mushrooms since senior summer of high school, but plans have always found a way to fall through.  So finally in late october, I had heard from a buddy of mine he could get his hands on a good amount of shrooms for a reasonable amount of $.  Oh hell yes.  So I call up a few people, roommates, cousin, brother, planning on eating them upstate and check out the lively autumn scenery.  It sounded too good to be true, and of course, plans fell through.</p><p>So we were literally on our way up, about to get off campus, when we receive a call that a few people can't make it up, so we say fuck it, and get some food, think about what to do.  Pussies, alright, me and my roommate will do it ourselves tonight. </p><p>So we sit down at around 5:45 or so with large pilsner glasses full of water, and a huge pile of shrooms in front of each of us, eating them in anxiety and with nervous smiles on our faces.  It was my roommates second time doing 'em.  We get through the salty cardboard-like taste, and get the extra salivary tendency in my mouth as if I COULD vomit.  But I was aware of this beforehand and supressed it, never feeling nauseous or anything of the sort the rest of the night. </p><p>Around an hour later, it begins.  A buzzing of awareness in my head, elevated thought and perception, so we decide to go walk around.  We get outside, wow, what a fuckin world, so many colors, smells, a delicate breeze appreciated as we stand and stare at orange foliage standing out from a glowing blue background.  Talking about the sensation we're experiencing, the 'oversimplification of everyday life' as my roommate puts it.</p><p>We pass a cafe-like deal and I want to fuckin go in and see mad people, but my roommate suggests that could be bad, so I listen to Mr. Experience and we keep on our walk.  We walk around campus, my roommate stops in a building to urinate, I'm standin in this little lobby-like deal staring at this painting, haha, its moving.  The new, high-tech building was just recently constructed and it felt like I was in some Alien spacecraft with air-tight sealed doors.  We stop to watch a herring or pelican or one of those long necked fuckers, reminds us of a dinosaur with its slow graceful movements and jagged figure.  Resting on a dock near a pond we inspect the water and the surroundings.  The water, a black basin of liquid life, moving, its alive.  The reflection of the trees in the pond imitate roots and veins, a system of capillaries and arteries which extend deep into this sphere, this core of energy and life (earth)...finally, mushrooms!</p><p>We return tripping, and begin watching sex and the city with our other roommate, paying attention to the content of the show (couldn't fuckin believe it) and even the slightest sense of humor had us giggling like little schoolgirls at the sight of a dogs junk. </p><p>So we pull out the chessboard, wow, incredible.  How could someone create such a game?!  My concept of the game was completely altered, it was no longer a checkerboard with more complicated pieces, but a battlefield, each piece representing an offensive and defensive element collaborating in a formation on an assault with one objective:  to kill your opponent.  All the while, swishing my tongue around in my mouth, taking huge gulps of water, wishing there were some beautiful woman around to enjoy every bodily sensation, every sample of touch, every operation any part of the body could possible pull off.  Maybe sex and the city had something to do with this, I am not sure, but realize oh crap, have to focus on the game again.  We go on for a bit, decide we'll finish the game later, will go smoke a blunt over at our friend's place.</p><p>We roll the fatty, about to leave, I pick up a baseball, which I hadn't done in a while, begin bouncing it off of everything, visualizing the angle and expected route, preparing to react before it even touches the wall.  Man, I miss baseball and the intensity.  And then we leave to go to our friend's to smoke.</p><p>Well, we get there, talking up a storm, and I'm usually not an outgoing guy, charming whoever I see etc.  Then we smoke.  I would have to say I could be a pothead.  Ismoke almost everyday at school.  Snd after we smoke, its like an off switch.  All of a sudden everything shuts down, no more vivid colors, no more exaggerated highlights on contours of the face, no more buzzing feeling in the brain.</p><p>We confess this to our friends, one girl wanted to buy mushrooms from us, so we say alright and head back to our place.  We get to our place and OZ is on.  Well, mass paranoia sets in.  We get the mushrooms, talk shit over about us being mad nervous, say we can't use names over phone anymore etc.  We leave our place and there are 3 public safey officers standing outside across a small grass field, conversing with each other.  We really start bugging out now.  We take a long route back to our friends place, sell her the stuff, tell her not to smoke weed cuz it just fucks it all up, and she leaves.  We talk to our boys about how we're paranoid, tell them to call up the girl we just sold stuff to and tell her not to mention our names or anything like that.  So while our boy is on the phone telling her this, he USES OUR FUCKING NAMES!!!  So I run off screaming like a banshee, not believing what I just heard.</p><p>We leave.  When we leave, there are 2 bike cops perched outside with their backs towards us.  I signal to shaun and we take another roundabout route back to our place.  Well we are shittin our pants now, I see my roommate, he reminds me of a total thug, a low-down dirty criminal, completely pale and lifeless.  We are only a little ways from our place, walking behind a student and her mother.  As we walk, the same two bike cops ride up along next to us, I am nanometers from taking off for my life, but they've seen my face.  I glance at the chinese bike cop and we make eye contact for a split second.  I say something like 'Ha wonder what the hell that was all about' as they begin to pedal off.  I flip out, inspect my wallet, I have like 200 bucks in there (planning to go upstate for the weekend).  I am shaking like a leaf. I take the money out, stop, think about running off, then put it in my boxers and continue walking.</p><p>We get around the corner seconds later, with the bike cops and a couple of public safety officers standing a couple doors down from our place, where a small frat party was going on.  I figure, well, this is it, I'm fucked, mom, dad, I'm sorry, 3 strikes and you're out.  Please, god, if you let this go, I promise I will never smoke again.  We walk past the cops, whom I look at briefly, avoiding eye contact (DILUTED EYES OMFG) and feel their gaze upon us.  I bullshit outside with an accquaintance, trying to play off my innocence, then proceed inside.</p><p>Time is around 11pm.  We're inside, whew, but they can barge up here any time they want.  I begin washing dishes and tell my roommate to put on some water to boil and make some mac&cheese.  I run the water to muffle my voice and tell him not to look out the window, because of course they'd be monitoring us.  I tell him we have to flush EVERYTHING now, (OZ of shrooms, maybe a few ozs of weed), dead serious, more stern than a boat.  I shut off the faucet and make my way up the stairs, I tell my roommate I'd reimberce him for everything, he decides he's gonna take the chance with the MJ, but we have less than five minutes to rid ourselves of this or we're fucked.  So I drop the rest of the OZ of shrooms into the toilet, my other roommate comes back moments after, can't believe what we've done, we tell our story, still can't believe it.  We sit waiting for our doom to come the rest of the night, finally pass out at around 4am.  Nothing ever happened.</p><p>Now that happened friday, october 24th, haven't smoked since, and am still true to my word of NEVER again.  The effect marijuana had on my mind after such an extraordinary experience on mushrooms has negated almost every assumption I had on the benefits of marijuana.  Paranoia amplified, mind clouded.  I haven't even had the urge to smoke it since, and my roommate hasn't smoked either, he says he will tho.  But I take this experience as a sign, to stop my trend of nothingness (smoking marijuana), to stay focused (one thing marijuana never did for me).  Marijuana took over my mind just like a weed takes over a garden and convinced me into pouring my precious mushrooms into the sewer.  There are many other pleasures from the earth which exceed marijuana, and I am hoping to experience as many as possible.</p><p>'Your mind is a garden, weed is a contamination.'</p>",
 "year": "2003",
 "id": "28596",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-07T07:00:00.000Z",
 "views": "3360",
 "dose": {}
}
