{
 "title": "Shrooms in the woods",
 "author": "Phusion",
 "citation": " Phusion. \"Shrooms in the woods: experience with Mushrooms (ID 2860)\". Erowid.org. Nov 28, 2001. erowid.org/exp/2860",
 "substance": "Mushrooms",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "0.25 oz",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "1998",
   "2860",
   "Male",
   "",
   "Not Given",
   "Nov 28, 2001",
   "27356",
   " "
  ]
 ],
 "report": "<p>\nWell, I've always been a fan of psilocybin and I figured I'd share. This was a while ago, so bear with me :),</p><p>Myself and four friends traveled into the night to our 'spot' (a grass covered hill overlooking my home town). An ounce of mushrooms were pulled out of a backpack and divied up to their respective owners. I got two 8ths of it. Previously we had bought some snacks as chasers, so the shrooms wouldn't taste so bad (a definite must). I got a candybar, put the shrooms on top and downed it. After I had consumed all of the mushrooms I sat there in the grass and anticipated the oncoming trip. After about 30-40 minutes I started to get an intense body trip. My friends watched me try to walk but fail, it was as if I had been drinking shot after shot until I could no longer control my speech or motor skills. I could lean on one friend and try to explain what was going on. They expressed little concern with my 'problem' and tried to get me off of them.</p><p>Cigarettes. Lots of cigarettes. I had bought a pack and was already through more than half of it (note that I am not a heavy smoker at all) and wanted much more. Two of my friends began to wander off and they started grabbing the trees and pulling on the leaves (later on they explained they could melt the leaves and bend/stretch them however they wanted). By this time the drunk feeling had worn off and I was free to play around inside my head. I was sitting in the grass holding a flashlight I brought with me and flipping it in the air. I could not stop, the light was a part of me; if I tried to leave it behind, it would tug at my very being until I ran over to pick it up again.</p><p>More cigarettes, I had now smoked about 30 cigarettes.</p><p>Near the grassy part of the field was a narrow gravel road (about 10 feet away). Those 10 feet felt like 10 miles, it was unbelievable. It took seconds to travel there, but it felt like a great distance had been traversed. After exploring the distance thing a bit, I went to go lie down in the grass. I noticed my two friends were still gone. I was a little worried, but the crazy shit going on in my head was far more amusing.</p><p>I looked up at the stars, the feeling I got from them was very similar to looking at the stars on weed, a big 'whoa.' Nothing new/special really. The trees, on the other hand, were growing to 600 feet tall and then would shrink to a few inches, very slowly and fluid-like. The fog was beginning to roll in, the lights from the town shown onto the fog and created a sort of swirling/flushing effect. The light would turn liquid like and blend with the fog and then just swirl, very plesant to look at. I went back to pacing and thinking about life in general and my life and how I lived it. I could look at things so much easier. I had floated above my corporeal self and was looking down with superiority over the mere mortal who stood before me.  He could not think of things that I could! Of course, it was me down there, but you understand (I hope).</p><p>After experiencing this altered mindset I was frantic, I didn't want it to go away. I knew that eventually the mushrooms would wear off and I would be stuck in normal thinking mode. It sucked. After about six or seven hours we decided to go home (it was about 6am or so) My sober friend drove me back home. After I got home the fun was sucked out of the trip. My boring room, drab colors, my parents were in the house (not awake, but still present). My head started to feel very hot and uncomfortable, an intense feeling of 'bad' enveloped me, everything sucked. My friends were gone, I was back home, I had a bad headache (and what felt like a fever). I stared out of my room for about an hour and then tried to sleep. When I closed my eyes an intense swirling/dizzy feeling came over me. I hated that as well. I eventually nodded off to sleep. I woke up with a feeling of 'thank god that trip is finally over.' I was glad to be back in reality and anxious to give it another go. I have yet to do so, but I'll post my experience when I do.</p>"
}
