{
 "title": "I Should Have Watched My Usage",
 "author": "Mr Non-Existent",
 "citation": " Mr Non-Existent. \"I Should Have Watched My Usage: experience with Cocaine (ID 28611)\". Erowid.org. Jul 5, 2006. erowid.org/exp/28611",
 "substance": "Cocaine",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>I started using 1 1/2 years ago when I had recently turned 18.  My initial reaction was the same to everyone else's I've heard.  I thought 'hey, this isn't that great.  I was expecting something very intense and noticeable it's  mellow enough so I can easily not be tempted to become a irrational cokehead.'  So my friend and I milked our new found hookup, splitting a 1/2 gram each day for the first 4 days in a row.  Well, each time I did it, I felt the high more, and I..... loved it.  I can't describe it any other way, but it was like I had just gotten a mute girlfriend who loves to give head all day.  Just thinking about it would send me into giggles.</p><p>Stupidly, I began using it more and more within months, saving up money and buying larger sacks.  I could feel its constant calling, but I didn't understand the magnitude of cocaines addictive power, even more stupidly, I started using the drug's motivational power to 'enhance' my creativity while writing music.  What it really did was make me work slower and with too much deliberation, and it killed my creative drive whenever the little White Devil wasn't around.  Within about 2-3 months of first trying it, I was stealing money from my parents to buy eight balls at a time and I would do them all in one binge. </p><p>By month 8, I had sold more than $2000 worth of gear to get half ounces at 'a better bargain!'  That I could live without at probably 25% its original cost, But I didn't care at all then.  Now it is a big regret.  But I had an attitude that life was cheap and I didn't care if I died.  That was tested numerous times when I felt like I may be dying, but I really didn't know.  Turns out I am afraid of death.  and VERY afraid of being remembered as the kid that OD'd on coke.  The worst time was about a month ago when I trying to balance out the timing of my next line with how close I thought I was to death.  it was strange, because I wasn't really getting high anymore anyway, after being up for 3  days with very little food, I guess my tolerance was sky-high and all the fucking slimy mucous covering the inside of my nasal cavity was keeping the coke from being absorbed. </p><p>Maybe it saved me, who knows.  But I remember not being able to understand why I couldnt just put it away and save it for a rainy day... or any other day because my body was aching. my heartbeat was very irregular, going from very fast to quite slow, my left arm seemed weak and tired, like I had been lifting weights, not to mention the common chest pains and of course, the nose and mouth pain. </p><p>I'm writing this because I realize I am a pristine example of a, fast, very addicted substance abuser.  I went from thinking 'I dont know if I ever want to fuck with coke' to doing 24-hour binges of 3.5 grams to the head all within a period of 3 months!  And that is what I happen to be doing right now.  And I hope this is my last time ever because I will always have to live with the past and the changes cocaine brought upon me, and why make it worse? </p><p>But I say 'I hope' because I know I've the lesser half of control.  Coke is a drug, to me, that will always present a temptation and a risk.</p>",
 "year": "2003",
 "id": "28611",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-05T07:00:00.000Z",
 "views": "12183",
 "dose": {}
}
