{
 "title": "Epiphany",
 "author": "Winn",
 "citation": " Winn. \"Epiphany: experience with MDMA (Ecstasy) (ID 28610)\". Erowid.org. Nov 22, 2003. erowid.org/exp/28610",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "135 lb",
 "report": [
  "<p>I am an expereinced drug user, been smoking pot for about two years now, but I recently quit. I've done other drugs also: tripped on shrooms, acid, done painkillers, coke, but NOTHING was as amazing as tonight. My first MDMA session. I want the reader to know that I researched this drug till it bled to death and then more. And I encourage anyone considering a session should also. I must also say that sessions arent for everyone, but it saved my life tonight. And I truly beleive that.",
  "I used to hate people when I was little. I was sickened by human form. My only friends were dogs because I liked their unconditional love. I finally started making friends in 4th grade (much too late) and finally fell deep in love for the first time last year with a girl we'll call H. I had never felt so much emotion for one human being, and I was scared to death when I realized our emotions were changing, she was going to art school, I was staying here. I was no longer the main focus in her life. This was EXTREMELY hard for me. When she went to art school, things got more and more awkward when talking to her on the phone because I didnt know what to say, because I beleived that I was still in love with her. You see, for the past year, I thought that all my happiness came from this one human being. She was my fountain of bliss, and we were so in love, and I never thought I could feel the same way about anything. It was amazing.",
  "When she dumped me, I became severly depressed. I hated people again and when I was home, I never left my room but to get bread and water and I never talked to anyone besides close freinds and my imediate family (all my relationship's were going down the drain). I only made company with my two dogs. I had it set in my mind I would never be happy again. And life presumed this way for 4 months untill one day I decided to buy this pill...",
  "To be fucking honest, this pill saved my life. I had the most spiritual trip I've ever had on any drug. I listened to radiohead all night and thought about my actions. I wrote and thought and wrote and thought and wrote and analyzed myself for 6 hours. I came to the conclusion that happiness cannot come from anywhere but yourself, or else it's not true happiness. I could not find happiness inside of H. And H did not love me anymore because I was not myself. I was a turd wallowing in mental agony. And by mental agony, I mean rocking myself to sleep in the fetal position, humming children's playground songs to try to make myself unsad. I did this almost every night. When I found out where I could find my happy place, I was reborn. I shed out of this skin and became a changed person. This is why I quit pot. It is too apathetic and I cant stand being that person anymore. At 4 in the morning on this X trip, I called up H, after 3 weeks of silence and even longer without a decent conversation. I told her about my epiphany and I opened up again.",
  "We had a 2 hour long conversation and I could talk to her as if nothing had ever happened. I blossomed into a freed butterfly. I seriously would have killed myself in at least 1 more month. I believe with all my heart that it saved my life. Im not saying X is right for everyone, thats a personal choice. I can see how x can be seriously mentally addictive, but since I was solving problems, not getting high for fun, I needed it. It made me realize that the key to happiness in yourself, not in others. I want you to print this because X has gotten a very bad rep the past couple of years. People seem to ignore the good sides of things sometimes. I dont know if I ever will roll again, but I am very glad I did because I would either be dead right now or in a straight jacket had it not been for ecstasy. If this report seems weak, its because im still rolling, but trust me this is the greatest expereince ive ever had.</p>"
 ],
 "year": "2003",
 "id": "28610",
 "gender": "Male",
 "views": "13396",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2003-11-22T08:00:00.000Z"
}
