{
 "title": "Too Much Is Not a Worthwhile Buzz",
 "author": "Wild Yam",
 "citation": " Wild Yam. \"Too Much Is Not a Worthwhile Buzz: experience with Dioscorea spp. (ID 28628)\". Erowid.org. Oct 11, 2006. erowid.org/exp/28628",
 "substance": "Dioscorea spp.",
 "bodyweight": "195 lb",
 "report": "<p>Dioscorea dregeana is one of a host of newly identified entheogens from Africa. Its name in African, 'Isidakwa' means, 'The drunkard'. It is a fascinating plant. A plant which produces a huge caudex. A caudex is a tuber which rises above the ground and develops to maturity before the rest of the plant starts to grow. The plant is a vine, related to the yam-type ivys. The caudex cab grow in native African conditions to several hundred pounds.  This is a monolith amongst weird plants rivalling the Baobab for sheer splendor.</p><p>I placed an order for an ounce of this plant to accustom myself to whatever properties it might have in terms of mental exploration. It is said to be an anesthetic and depressive. I had learned through a website that a whole ounce is enough for 20 libations.</p><p>I foolishly decided to double the dose to get the full effect.  I eyeballed less than a quarter of the ounce of the off-white dried root and put in through the grinder until it was powdered. Then I placed it in 4 ounces of water and heated it to a boil and then let it cool off until it could be drunk. Without ceremony I drank the liquid straight from the small pot and then washed the pot out. The taste was like a sordid ginger flavor which had a mild burn to it. I washed the flavor out of my mouth with some chocolate soy milk which did in fact get rid of the taste. However the stomach nausea started almost immediately.</p><p>I had to do some chores and so did them. After 20 minutes I felt a heaviness in the head which I identified as similar to the dizziness of straight caapi vine decoctions. The feeling intensified over the next 20 minutes until it was very uncomfortable. And my eyes began to lose focus while simultaneously my near vision got sharper. I sat down to read, still sceptical of the effects. But after a solid hour I stood up and walked unsteadily to do some other chores. At this point my limbs felt shaky and very wobbly and not soon after I was unable to walk.  I still had to do some work moving some furniture and it was tremendously difficult; like trying to tug something while walking on a tightrope.</p><p>The dizziness in the head expanded to become something like a full blown DXM head buzz. My limbs got very shaky until I couldn't move.  My wife told me to throw up which I did because the nausea was unbearable.  Nonetheless the effects kept climbing for at least another hour. At +2 hours I still felt immobilized similar to the effect of drinking a Belladonna reduction. I felt this way for at least two more hours. There was no euphoria or any mental effect to make this buzz worthwhile. </p><p>A full six hours later and I am still feeling very sick. My entire day was ruined.  I don't recommend that any other than the most knowledgable shaman keep this plant in their medicine chest. And definitely keep this one away from young kids. If you feel the need to try it then limit your dose to around 1 gram only.</p>",
 "year": "2003",
 "id": "28628",
 "gender": "Male",
 "timestamp": "2006-10-11T07:00:00.000Z",
 "views": "9433",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Dioscorea spp.",
   "form": "(tea)"
  }
 ]
}
