{
 "title": "Psychosis Triggered by Long-Term Use",
 "author": "Hopleton Brown",
 "citation": " Hopleton Brown. \"Psychosis Triggered by Long-Term Use: experience with Cannabis (ID 28638)\". Erowid.org. Sep 1, 2006. erowid.org/exp/28638",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I'm gonna give you a lot of boring auto-biographical psychological stuff, because this isn't a simple 'set and setting' one off trip scenario.</p><p>My use was long term and the 'set and setting' affected the drugs, but the drugs affected the 'set and setting'.</p><p>Background:</p><p>Anyways, this starts back in 2001. I had had a confusing couple years, dealing with a bunch of bullshit, most of which was a result of my own depression in all probability (a few years prior I'd been you're standard 'suicidal teen', but with a sense of humor).</p><p>Just before my final year of university, which I had finally fucking reached after work- placements and unemployment and bullshit, I fell in love with sweet, sweet cannabis.</p><p>Now, I was never before a regular user of any drug, but I would take some form or other every month or two. I wasn't a prude or a virgin, but neither was I an addict or entheo-head.</p><p>My 'paradoxical' view of drug use in general, personally illustrated:</p><p>I suspect that everytime someone tries to get drunk or drugged or otherwise fucked up, it is usually an expression of two conflicting desires within them: the urge to 'fully embrace life' and the desire for the 'silence of consciousness' of death.</p><p>In my case, during 2001 - 2002 and my accelerating cannabis use, rather than shrinking together to form some kind of balance, these conflicting urges were increasing with magnitude geometrically.</p><p>On the one hand I wanted increasingly to 'live! LIVE!' and on the other I just wanted everything to STOP.</p><p>The result: utter confusion. The day after 9-11 I didn't know whether to celebrate the end of the world or to mourn the colleagues from my company who very much looked like they'd perished in the shadow of the falling towers (in the end fortunately none of 'us' were hurt - just emotionally scarred for life from falling roasted chunks of human body).</p><p>So I did both. Black tie and suit in the morning, champagne the night before.</p><p>What getting 'high' was like for me:</p><p>Anyways, I never found cannabis to be a social rug at all. It was contemplative and meditative.</p><p>Cannabis made me think 'real deep' thoughts and hallucinate multi-dimensional fractal 'projections of the universal mind'.</p><p>I found social interaction on cannabis just lead to painful levels of analysis and uncertainty: it takes the mind years of psychological jury-rigging of protocols to deal with other people, all of which is best left unconscious like breathing and walking.</p><p>As you can guess, I was more into the 'high' than 'stoned' feelings - hence I'm not really a fan of hash or indica-heavy strains.</p><p>So I started to trip alone (WARNING SIGN! WARNING SIGN! ;) ). And frankly, I thought it made me that drug-clich: 'a mellower, more tolerant and spiritual person'. I actually said this to my very anti-drug brother when he confronted me about my use.</p><p>Anyways, so my final year at university has ended. I have barely missed getting a 'first' even though I've spent most of the last 6 months in a blue-tinged haze of smoke.</p><p>More bio:</p><p>I am about to embark on a three month placement doing really interesting research, originated by me, in a company that's practically begging me to go full time.</p><p>Even though I am bored shitless of the company, it's a good back up plan for my return from Jamaica: you see, I will use the proceeds from the 3 month placement to go to a M.A.P.S conference on an idyllic tropical beach (and I'm STILL bitter that my partners in crime went without me!).</p><p>By now, I'm so 'spiritual' that I go wondering round the city for hours on foot 'decoding' graffiti and looking at plants thinking 'profound-shit' even when I wasn't high, stuff like: 'this innocent weed is as precious to me as the cannabis plant I am growing. The branches express the 'will to live', as does the THC when I am high. Why did Schopenhauer think the Universal Will was a bad thing?'</p><p>A month before I go mad I text my friends a message: 'I've just kicked arse at Uni, I've got a guaranteed job, a salvia plant and 12 ganja trees growing! And we're going to JAMAICA! Life is GREAT!'</p><p>That's the Karma I get for over-using irony.</p><p>That's when, as reward for being the middle-man in a drug-deal for DELETED, I get a half ounce of lovely, EVIL skunk. During the next two weeks I'm smoking l'il joints once or twice a day, and two fat cones before 'sleep'. Of course I'm not sleeping at all: I'm 'meditating' until psychedelic unconsciousness.</p><p>Day the first of absolute psychosis:</p><p>I think I didn't even smoke this day - I didn't need to! I was in 'the zone', super funny and extroverted, overly intelligent conversation, spouting the occasional ad-libbed Koan 'to shake people out of their ego-driven complacency' (I was a freaky boorish wanker, in other words).</p><p>I spent the night holding court in the 'after work hangout', holding court but not dominating conversation. I think people must have thought I was on a coke+mdma trip: certainly the software engineers I was with, even the druggies, were both bemused and amused by my antics.</p><p>I would engage ANYONE in conversation, and make them like me. So much so that my enthusiasm was infectious and the yuppies I was with started inviting tramps to join us for a drink.</p><p>In a word, I was MANIC.</p><p>The next day I kinda crashed and had an early, idyllic night at home with my folks.</p><p>ARGH! Saturday I was off to a free festival to see De La Soul play. I went with arnulf and IndieBwoy. We will later be joined by the Alchemist.</p><p>I dutifully packed some 'stealth' joints for my friends, who brought the speed and beer. (BTW: in my experience stimulants+weed = VERY BAD. Although some people love the combo).</p><p>The day starts off well, I'm somewhat 'in the zone' still. My friends notice that I'm not quite myself, however. After *small* amounts of beer, speed and weed (I 'clintoned' and didn't inhale, cos I was 'high on life') the shit hits the fan.</p><p>Since we'd been discussing Glastonbury a few weeks prior, to which I have not been but IndieBwoy is a regular to, in the middle of the De La Soul Set IndieBwoy turns to me and says 'NOW do you understand?!'</p><p>I don't think he's talking about concerts. He's talking about merging into the over- mind! Things go downhill from here. I misinterpret everything, in my mind this is my 'coming out' party amongst the enlightened.</p><p>My friends are angels sent to guide me to my enlightenment(?). They're all celebrating the fact that I have finally made it back to my 'original face', but telling me to control myself.</p><p>In reality of course they're desperately trying to talk me down, but're setting me off. I am now COMPLETELY INSANE.</p><p>People's body language in particular sets me off.</p><p>The Sunday I spend with my family and some family friends. In the morning I have a heart-to-heart with my brother, laughing & crying simultaneously and giving him my stash to throw away.</p><p>Yet I appear normal to the other people I'm with. I am convinced I have finally 'got it', and in my paranoid state read spiritual messages into bill boards.</p><p>At work:</p><p>Monday: Go to work. Unsurprisingly can't concentrate, and my insanity is taking an ugly turn. As the day wears on, I'm convinced I'm in some sort of Maya/Purgatory combo (I actually half worked-out a metaphysics involving a blend of quantum theory, database theory and reincarnation).</p><p>I'm still reading spiritual messages into every form of verbal, written and body communication that just aren't there. I storm out of the the office, ranting.</p><p>On the way home I discard every 'unimportant attachment', eg the contents of my wallet.</p><p>At some stage I'd destroyed my mobile phone, making it hard for my friends to contact me.</p><p>That night I explain that I have quit my job to spend more time with my parents. They are disturbed.</p><p>I get a phone call from a schizophrenic acquaintance I had been avoiding talking to because he scared the shit out of me: this time I scare the shit out of him.</p><p>Hospital:</p><p>The next day I am convinced that either I am dead, or if I go to sleep my loved ones will die, or that reality is shutting down. In fact, some combination of all the above.</p><p>I 'confess my sins' to my dad. I go to church and demand to see the vicar, and have a spiritual breakdown there.</p><p>I come home, destroy my ganja and salvia. My brother and father are very, very concerned.</p><p>I start really raving, convinced that THIS IS THE END. A temporary power cut causes all the digital clocks to freak out, causing ME to freak out: 'I'm going back in time!'</p><p>I demand to be taken to hospital. I'm not sure whether I'm dead or whether I'm my brother's imaginary friend.</p><p>I phone 999 and demand an ambulance. They don't dispatch them for psychotic breakdowns! :(</p><p>Once I get to the hospital (thank god I have private health insurance) I am seen by a shrink.</p><p>Whilst I'm waiting I'm convinced by now that I am in fact my own mother at the age of 70, driven mad by the success of one of the towns teenage secret suicide attempts.</p><p>All of my family are in fact my multiple personality disorder. My appointment with the shrink is my weekly electro-shock...</p><p>In my mind I'm not at my most mad, in fact this is one of those painful moments of lucidity before the delirium sets back in.</p><p>In my interview with the shrink, I actually spout off a lot of psychiatric jargon to her as she asks me what I think is happening to me.</p><p>This confuses the fuck out of her, unsurprisingly ;) .</p><p>I am loaded up with ant-psychotics and spend a 'long dark night of the soul' (I don't know why people use that phrase for spiritual crises: it's actually a really joyful poem) in a room with a nurse who's there to stop me committing suicide.</p><p>I believe I am in hell experiencing retribution for all the suffering I have caused others. I now believe I died on New Year's eve on my last big drugs binge.</p><p>In my mind he nurse is some dad of a suicide bomber or something, he is here to confront me with the pain of his child's death.</p><p>The notes he's scribbling aren't my actions, oh no, they're my excuses for my sins I'm blathering.</p><p>Next day, once I'm convinced that reality is indeed real, I AM JUST SO HAPPY TO BE ALIVE AGAIN!</p><p>I believe in the wisdom and mercy of God (before this I was pretty atheist) and believe I have been given a second chance. I recognised that I was mad in consensus reality, but believed there was some sort of truth to my experience (I don't think that will ever completely go away).</p><p>I am the happiest guy in the psyche ward, bringing joy to the faces of the suicidal depressives and staff alike (I shit you not).</p><p>What a shame I've put my family through the worst experience of their lives...</p><p>After 2 weeks I get out. All is well. I am happy-go-lucky and even contact some friends.</p><p>Relapse:</p><p>After a couple days, I go out to see a non-drug using friend of mine, accompanied by my brother to begin with, but he has to go off somewhere.</p><p>I have a relapse of pure paranoia: I am convinced that I have been manipulated by a conspiracy of which my friends are all a part.</p><p>I'd explain this in terms of Cognitive Behavioural Therapy - once I have constructed 'unhealthy' ways of relating to the world, they can reinforce themselves and cause me to tail-spin, even if the original stressor is absent.</p><p>The paranoia only starts to go away after I just accept the fact that I've been gimped by the illuminati and contact a friend of mine in Taiwan - the isolation was driving me EVEN MORE MAD.</p><p>Being the fucking cool guys they are - and they KNOW WHO THEY ARE - they quickly arrange with me to see the Alchemist (by now most of that social circle is abroad) and the Overlord.</p><p>It slowly dawns on me that my friends are NOT part of a global Illuminati conspiracy to brain-fuck people, the evidence for which was everywhere...</p><p>There follows months of rehabilitation, NA meetings, 'therapy activities', and a couple sessions of actual counselling, all of which were a bit shit to be honest.</p><p>And a full year of bringing trust with my family back to the 50% mark. That's never gonna go back to 100%, but maybe 85% - in a decade.</p><p>Anyways, that's me.</p>",
 "year": "2002",
 "id": "28638",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-09-01T07:00:00.000Z",
 "views": "24851",
 "dose": {}
}
