{
 "title": "Intense Discovery",
 "author": "lucid",
 "citation": " lucid. \"Intense Discovery: experience with Cannabis, Blue Lotus & Datura (ID 28664)\". Erowid.org. Nov 24, 2003. erowid.org/exp/28664",
 "substance": "Cannabis, Blue Lotus & Datura",
 "bodyweight": "145 lb",
 "report": "<p>I have dried the above plant individually with success. I have combined Lotus and Cannabis: what I imagine ecstasy is like, extremely pleasurable, total ecstasy, I welled up with joy with no down time the next day or, hell, since then. I have also combined Datura and Cannabis: an intense high, more than just 'getting stoned'. Pseudo-life like hallucinations, some scary, but when I control my mind, I realize I will be fine. I finally decided to try all three. At once.</p><p>I made roughly 2 grams of the magic mixture, 40% Lotus (flower petals) 45% Cannabis (good shit!) 15% Datura (crushed seed). I had put in some Tool at a moderate volume, so as to hide the sounds of my experiment from others. I also had a full water bottle, knowing that with the weed and the datura especially, I would need a lot of water. I lit some Bob Marley brand incense that smells fantastic. I left the lights in my closet on (where I was) and all other lights were off. I filled the pipe, lit a candle (I light my lighter off a candle so that it doesn't make that familiar sound.) and prepared my mind for the experience (reassuring myself that I can retain control of anything bad that may happen, and I do.)</p><p>[Time 0:00]</p><p>I took two long and deep hits. The pipe was packed tight and stayed lit quite well, the lotus helps that too. I began to feel something almost immediately. I went to my bed to grab a pillow to sit on and returned to the closet. I took a hit roughly every 2 minutes until the bowl was cashed. I got a good drink of water.</p><p>[Time 0:34]</p><p>I began to load a second bowl. I placed my pipe in my AOL container (you know, the metal one in the mail. They are great.) next to the magic stuff. I sat back down. I began to pay more attention to detail. I knew this because it took 5 minutes just to stop looking at my arm and the design of my pipe and set it down. I explored my current state of mind. 'How am I feeling?' Damn good. 'Am I hallucinating?' Almost. 'Am I still having a 'good trip'?' Oh yeah. After doing that, I decided to smoke more. I currently felt like I was datura stoned - a solid stone, nice in its own way, and at the same time, I was euphoric, and ecstatic like the Lotus Cannabis mix above.</p><p>[0:46]</p><p>Bowl #2 loaded and ready. My mouth was constantly hangin open as if I was in constant awe. I believe I was. I lit the bowl and took a deep hit. I exhale and begin to feel the signs of cottonmouth. I quench again. I took another hit. I hold. I feel like the longer I hold it in, the higher up the staircase I go. I exhale and the flowers start coming out of the walls. My eyes are open. There are faint red and green flowers in a tiled pattern everywhere. I realize I have the power to make any hallucination materialize at will. Of course, being a lonely male, a naked chick soon emerges from nothing. She is as real as me. Yet at the same time, I secretly knew she was most likely 'The Temptress' (Yes, she exists. I have always seen her while on Datura) I still maintained control. I took another few hits, feeling more and more like I was climbing a roller coaster, that feeling of expectation (sort of) and adrenaline rush right before the coaster plummets (except I never plummeted). I take another drink of water and stand up. Whoa, always stand up slowly and make sure you have something solid to hold on to. I caught my bearing for a good minute before trying to walk.</p><p>[0:56]</p><p>Walking was of utmost oddity. My head was not part of my body physically, just attached by electromagnetic force. This made balance difficult if one did not concentrate. Each footstep felt like a tree being uprooted and then rooted again when it found ground. I felt alien, but not fearful, the ecstasy was somewhat diminished by the other forces in my brain. Before I left the closet, I realized that I could watch myself move from within my own brain, 3rd person perspective with accuracy as well. This felt like exploring the core motorskill area of my brain. I could feel every living part of my entire body. On a whim I could flow within my blood vessels, or exhale myself from my lungs. Still quite pleasant and relaxed. Humongous pupils, night vision.</p><p>[0:59] (I have a good sense of time and therefore don't wear a watch, plus, I can't wear any digital watches anyways. I alter them by just wearing them, family trait)</p><p>I am outside my(self) closet and hear music. I know that Tool Aenima is in the stereo, but what I hear, and subsiquently dance to, is not Tool or anything I have ever heard. I danced, which I never do, for what seemed like a long time. Just standing there, moving like a goon. Any observer would not know what to make of me. Suddenly, it's time to go to the bathroom. And piss a gallon or so of water. Damn I'm thirsty.</p><p>[1:07 or 1:17 or 1:30] (I think I'm losing that sense of time.)</p><p>Drink water, decide I'm going to finish my bowl. Remembered to act normal when going outside my room. Also remembered to boot computer when walking by. Oh, I'm still seeing those damned flowers everywhere, they never left. I take about 2 more hits (who knows) I remeber becoming extremely paranoid that I was surrounded by spiders. I am an arachnaphobe (not as much after this though.) so that is not good. I overcame that and I never really became frantic or fearful. I also hallucinated a scorpion about the size of a beer can to my right. It jumped out and stung my ass. I could even feel the stinger inside my body and a release of 'something' into my body. It was scary at first, but far freakin out too. It rocked.</p><p>From there. I remember seeing myself sitting down and smoking my pipe while that is exactly what I was doing. Everything was disassociated 3rd person, except for the spiders and the scorpion. I could see all the parts of my body, including the eye on my forehead made of white light, and my eyes that appeared to be Goku big.</p><p>I remember not much else. I know it was an excellent trip and it was pleasant. I recommend to all those explorers out there. Always research the drugs you intend to take. Never do ANY drug with the 'yeah man, let's get stoned' attitude, and remember to never be afraid. It's in your head, and of your spirit. Peace.</p>",
 "year": "2003",
 "id": "28664",
 "timestamp": "2003-11-24T08:00:00.000Z",
 "views": "24955",
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(flowers)"
  },
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "smoked",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(flowers)"
  },
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "smoked",
   "substance": "Datura",
   "form": "(seeds)"
  }
 ]
}
