{
 "title": "Psychedelic Enlightenment Or Chemical Buzz?",
 "author": "Holmes",
 "citation": " Holmes. \"Psychedelic Enlightenment Or Chemical Buzz?: experience with Ecstasy & LSD (ID 2867)\". Erowid.org. Oct 10, 2000. erowid.org/exp/2867",
 "substance": "Ecstasy & LSD",
 "bodyweight": "150 lb",
 "report": "<p>My fascination with psychoactives began at a young age, and in the years since then I have had many, what seems to be, religious, enlightening, and spiritual experiences. The folling is my best acount of the most recent experience on mix of the drugs lsd and ecstasy.</p><p>It was a beautiful labor day weekend and the party didn't stop on sunday because nobody had to work on monday. I started the day off late, getting out of bed just before dark. That was fine with me because nothing was on my agenda except partying, so that's exactly what I set out to do. I phoned a friend who already had party in mind. The plan was to go to a town about an hour away and check out a new club. That was fine with me because my friend is a generous drug dealer who makes sure the party he's at is one you'll remember.</p><p>About 30 minutes into the ride he handed me a little baggie with 3 blue mitsubishis and 3 purple rolexs (infamous pills in my town). I thanked him and broke one in half and washed it down. I started feeling good about the time we arrived and met up with our crew. The club was definitely cool, the d.j. was spinning really good tracks and  the place was full of energy until the minute they made everyone leave. We hooked up with locals and hit an after party across town at a d.j.'s house who happened to be a friend of mine. I just got new vinyl that day and I was ready to lay down some tracks for a crowd of dilated eyes. I ate 4 more tabs - 2 more mitsubishis and 2 rolexs.  It was 3 a.m..</p><p>We arrived about 15 minutes late and it was already packed. I told the other d.j.'s i wanted to go first before the drug took hold, at least I hoped. My set was about 45 minutes and the crowd seemed to really enjoy it, and nothing feels better than that.  This feeling can be heightened on ecstasy and once this has happened you can ensure a good night.</p><p>At about 4:15 the ecstasy was coming on strong. I saw a good friend from my town who had some liquid l.s.d. in a Sweet Breath bottle. There's nothing like candyflipping on a warm summer night when you're surrounded by good friends and positive vibes. I gave her the other 1.5 pills and she dropped a dose on my tongue. She and I took a walk outside and found a little park with a swingset and smoked some really good pot which makes rolling so much better.</p><p>After we got high I was at the point I refer to as 'tripping on ecstasy' when it becomes no longer just an amphetamine, but a psychedelic. I will do my best to describe this feeling to someone who has never felt it: I already felt a deep understanding and empathy. Talking to people I knew who they really were, almost knowing their words before they came out of their mouths. It seems like I can only connect with one person or thing at a time, but at an extremely deep level. When meditating I have what I call chain thoughts, or extreme day dreaming, which is this: one senses an ordinary thing (looking at an object, hearing a sound, etc.) which reminds one of something related to that object somehow, possibly on another level. This is repeated over and over again and the thoughts get more complex. Often people say aloud 'and then.....and thats......and that comes from'. It's like putting the last pieces into a jigsaw puzzle - 'I've got it'. Few get all the way to 'I've got it', because they get they get distracted by such a level of comprehension and say to themselves 'how did I come to this?', and forget the train of thought.</p><p>Tonight I managed to finish the puzzle. The one I have the most recollection of is hard to explain, but it seemed I could understand every thing and know where every thing came from. It all went back to one thing, like a force we all came from but something makes us divide and take individual form. I have little recolection of the exact ideas, I wish I could record my thoughts. The l.s.d. only makes this process happen more quickly, and the chain thoughts become harder to recall. Some might have trouble talking because they are so pre-occupied with thier own mind.</p><p>Both chemicals where running strong as we sat on the swings and watched sunrise. The cars passings by had no idea just where our minds were. Definitely a night to remember. On the ride home I sunk in my seat, turned the stereo up and got lost in the music. A night like this can give you a good outlook on life and a better understanding of you and your mind and spirit.</p><p>Psychoactives are powerful substances we should respect and research. Used in moderation in positive surroundings with good people we are allowed to experience something very beautiful and spiritual. Before taking any psychedelic be positive that YOU are ready; they produce some of the strongest reactions known to man and may be too intense for some. Stay hydrated and space out time between sessions. Make sure you are really secure with yourself, these drugs may cause you to seriously seriously see yourself at another, deeper level.</p>",
 "year": "2000",
 "id": "2867",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-10T07:00:00.000Z",
 "views": "7791",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 3:00",
   "amount": "4 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 4:15",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 }
}
