{
 "title": "Yuck! I Want a Refund!",
 "author": "Leila",
 "citation": " Leila. \"Yuck! I Want a Refund!: experience with AMT (ID 28689)\". Erowid.org. Mar 17, 2008. erowid.org/exp/28689",
 "substance": "AMT",
 "bodyweight": "120 lb",
 "report": "<p>Note: I entered the following situation believing that I was ingesting my first-ever dose of LSD. Two days later I was informed that there was a mix-up, and I had actually taken AMT, which I had previously never heard of.</p><p>When a friend of mine called and said he had gotten a hold of some LSD and was saving some for me, my roommate and I set out immediatly. The seller at his house gave us each two large, white, featureless paper squares and directed us to chew them until they dissolved. I remember thinking I was disappointed that the paper didn't have any cool blotter design on it. There were about 10 other people at the house, and a few of them had already taken some mushrooms (since 'acid' was out of their league.) As I chewed the stuff, I started to worry that maybe this wasn't the best setting for me to trip in. The last time I had done shrooms there, I went totally berserk.</p><p>I warned my roommate and we agreed we would leave as soon as we started to feel it coming on. By about 12:30am, we had successfully chewed the stuff to an oblivion (we took them at midnight.) I must stress that this stuff tasted absolutely repulsive, like chemical vomit. And indeed, vomiting was the only thing we could think about. At one point, my roommate and I snuck off to the bathroom and proceeded to vomit white foam for about ten minutes, since the nausea induced by the taste was absolutely overwhelming. We emerged giggly and lightheaded, and got a few 'looks.' From here someone decided to put on 'Fear and Loathing in Las Vegas.'</p><p>Naturally we got the usual rounds of people checking up on us and saying dumb shit like, 'so, you trippin' yet? does everything look weird?' It got extremely irritating. But even more irritating was the fact that we weren't really tripping. After about an hour and a half all we were doing was giggling. I did notice that my body temperature was wildly fluctuating, but there were certainly no hallucinations. I thought, 'what kind of acid is this, damnit?' i had read lots of LSD stories online before, and this didn't really compare to any of them.</p><p>At around 3am, my roomie and I got the absurd idea to hit up the local 24-hr Wal-Mart. Just for shits and giggles. Everyone flipped out, saying we would for sure die in our attempt to operate a vehicle 'under the influence.' But we left anyways, since we were starting to 'feel it' (but only a little). \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>When we got there, were still totally sick to our stomachs (as we had been all night) and had both developed blasting headaches. Wal-Mart was definetly more frightening than stimulating; we just lost ourselves in the toy aisle for a while, shuddering at how terrifying the Barbies looked in their little packages. When we spotted a 3-foot 'My Walking Talking Doll,' we decided to get out of there PRONTO before the onset of any serious psychological damage occured.</p><p>We came back to my place, definitely feeling a little weird and trippy, but overall disappointed that we weren't really hallucinating. More than anything our heads were exploding with blinding pain. I stretched out on the floor with a couple of pillows; roomie took the couch. We quietly stared at my Pink Floyd The Wall poster for a while (for obvious reasons), and then threw on some Miles Davis. Neither of us could move because of our headaches. By then we just wanted to relax and do as little as possible.</p><p>Since I had to go to work in a few hours, I thought I would attempt taking a nap. I fell instantly asleep, which seemed absurd considering that I was on 'acid.'</p><p>The entire next day was hell. I popped handfuls of painkillers, but nothing would soothe the incapacitating head explosions. I've never experienced anything like them in my life. After work, I napped the evening away, turned off the phone, and took a bath. By the time I went to bed I was still in pain.</p><p>When I was informed that the drug was actually AMT (2 days after the incidence) I said 'I KNEW it wasn't LSD!' I was quite angry and felt robbed of 20 bucks, as well as a good night's rest. The nausea and headaches associated with this stuff far overpowered any positive affect. I certainly wouldn't do it again, or I'd be sure to have a barf bag and a bottle of painkillers on hand.</p>",
 "year": "2003",
 "id": "28689",
 "gender": "Female",
 "timestamp": "2008-03-17T07:00:00.000Z",
 "views": "7805",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "AMT",
   "form": "(blotter / tab)"
  }
 }
}
