{
 "title": "On a 'Blind Date'",
 "author": "Gold Soundz",
 "citation": " Gold Soundz. \"On a 'Blind Date': experience with 4-Acetoxy-DiPT (ID 28697)\". Erowid.org. Nov 16, 2004. erowid.org/exp/28697",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "37 mg",
  "oral",
  "4-Acetoxy-DiPT",
  "(capsule)"
 ],
 "report": "<p>After experimenting heavily with AMT, I decided to broaden my horizons a bit and try something new. 4-Acetoxy-DiPT was brought to my attention, and I procured about 500 mg to play around with. However, I do NOT give any substances to friends without trying it myself first, so I put myself into my bedroom.</p><p>I put between 35-40 mg into a gelcap and popped it. Yechhh! Be warned: If there is even the slightest residue on the gelcap you WILL taste it, and it doesn't taste good. The taste resided just as the buzz started to kick in (30 min).</p><p>A comfortable setting is a must for this substance, and this was a problem for me. My roommates had decided to have a large party (right outside my bedroom door) and there were about 100 people making all kinds of noise. I began to feel uncomfortable and puked into a trashcan....mmm, all better. I believe this had more to do with personal anxiety, as I have not puked on this substance since.</p><p>As the buzz progressed I began to feel very warm in my lower torso, with a slight sexual edge to it. This was a constant through the trip, and very comforting. I began to have slight visuals, especially in my peripherals, and anything I watched on television was simply captivating.</p><p>After about an hour 1/2, I ventured out into the party. This is where I discovered the most valuable aspect of the substance. Empathy. I noticed everything about people from body language, tone of voice, etc, and could relate to them more than ever. However, this was unexpected and freaked me out, so I went right back into my room. I felt like everyone was looking at me!</p><p>At this point I started watching Blind Date on television and I did not stop for two hours. Throughout the whole time I had a great body buzz, but visuals were not as noticable as I was staring at the tv. There was certainly a visual aspect to it though. Over the course of 2 hours of Blind Date I saw right through everything: The graphics, music, and other distractions are on the show to keep you from seeing how truly sad these people are. I knew exactly how they felt: How uncomfortable they were trying to meet someone on a cheesy date in front of lights and cameras, how the slutty women were out for money, and the men were out to get laid. I felt what they were feeling and I couldn't get enough of it. Not to mention Roger Lodge, who acted as host for my trip and welcomed me back after every break!</p><p>It is difficult to explain 'seeing through' everything, but that's exactly how I felt. No degree of bullshit or acting could put one over on me. I saw it all. This made interaction with others a bit difficult after I left my room, 3 hours after dosing. I could not talk with people because every awkward silence was like a knife in my heart. I wanted so badly to make people more sociable, but they all seemed so sad and fake.</p><p>About 5 hours after dosing, the buzz was residing but there were still traces of visuals. I curled up in my bed, watched a couple of movies, smoked some pot, and eventually fell asleep about 8-9 hours after dosing. The hangover was not too bad (especially compared to AMT), but I felt the typical tired clarity the next day.</p><p>I recommend this for couples especially, as you could lay in bed and truly connect (the sexual buzz is a definite plus). However, this is NOT a party drug. If you plan on dancing and getting crazy, don't. Find a comfortable room, some good movies/music, and good people to connect with...</p><p>...and maybe Roger Lodge if you can find him.</p>",
 "year": "2003",
 "id": "28697",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-11-16T08:00:00.000Z",
 "views": "10952",
 "dose": {}
}
