{
 "id": 287,
 "title": "Trancey and Wonderful",
 "date": {
  "submission": "2006-03-23T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Sk",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Valerian",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Kava",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Various",
   "form": "(extract)"
  }
 ],
 "report": [
  "The first I bought was the Velarian Poppy, which contains, among other things Kava Kava and found myself hooked.",
  "It's effects are light, and may not be noticed by many. I took about 5ml to 10ml of the extract, placed betwene my gum and lip and allowed it to swish in my mouth. Best time period is ten minutes, the first few are a bit harsh due to the high alcohol content, but soon the Kava Kava causes a numbness. It doesn't taste good, but not horrible either.",
  "The effect lasts about 20minutes to 1-hour, and has an unstable strength. Some times it is stronger than others. This afternoon I felt very high comparativly, a mellow relaxed opiate-like high. It was not over-powering but very calming and relaxing.",
  "Tonight I baught the Kava Kava root.",
  "I took about 5ml, found the taste far less ofensive (but not tastey either) Held it for ten minutes or so and immediately felt a slowing down. I began to sweat slightly and I became slightly irritable at first, but it was probobly due to the fact my brother was being noisey and I just wanted to relax. But i was able to slip into undisturbed periods of trancey conciousness and a feeling of 'softness' in my seat and steps.",
  "My body was very warm, and I felt very slow, relaxed and calm. The thing i note most about both of these products is feeling like my speech is slow, calculated and controlled.",
  "I don't use needles, so I don't know about injection."
 ],
 "erowid": {
  "id": "10408",
  "citation": " Sk. \"Trancey and Wonderful: experience with Kava & Valerian (ID 10408)\". Erowid.org. Mar 23, 2006. erowid.org/exp/10408",
  "substance": "Kava & Valerian",
  "views": "16651"
 }
}
