{
 "id": 2871,
 "title": "A Bit Weird and Distorted",
 "date": {
  "submission": "2000-06-19T07:00:00.000Z",
  "experience": "1994"
 },
 "author": {
  "name": "Eric",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>Well, since everyone else shares their psychedelic experiences with the net, I feel I should too, especialy since it was with a legal one that people have their doubts about.",
  "My friend Joe and I had been trying to find some good legal drugs for a while, and had mostly turned up blank. Finally got some Hawaiian Baby Woodrose seeds. About 120 in all. I took 20 seeds, ground them up in a peper grinder, mixed with about a quart of water, let them soak for a while (Several hours), then strained and drunk. The water tasted kinda wierd, sorta like some kind of nut, but I couldn't quite identify it. After 15 minutes we were both feeling a little 'weird'. We hung out in Joe's living room for a while, and after about 50 mins I noticed some typical pre-LSD pre-Shroom effects on the floor. Where the floor looks like boards that are sliding past one anohter in oppisite directions. Seems to happen to me whenever I trip, even only a little. My hands also felt slimy. I noticed this effect once before while on LSD. ALl the feeling in my body got very slimy and milky. In a way, it was like touch-tracers.",
  "I was no longer able to feel and individual feeling, but instead a whole bunch at once, kind of after images of what I had been touching. It really didnt get that intense. After about 2 hours we went into the kitchen, and my hands started looking very wierd and distorted. I would hold my arms out to the floor, and the looked VERY long, almost as if they were touching the floor. We also got kind of silly, and I had problems putting what I was trying to say into words. VERY few visuals. Things really never got much beyond this stage.",
  "There might have been a more intense mental effect, but we never really tried to explore that. When I previously tripped on acid, we found that the 'psychedelic' effect didn't really set in until we started talking about philisophical type thigns, but once we did, it didn't stop. So maybe if we had tried talking meta-physics.. who knows. After 5 hours we got mad and smoked some REALLY good bud.",
  "Its now 24 hours later and I still feel the slimy hands effect a little bit. Interesting if your bored. I think it would also make a good first psychedelic expereince. Maybe I just feel this way because my first trip on acid was a little too intense and I got scared. We plan to try them again on sunday or monday. This time I'm gonna try 24 seeds, and also drink the seeds chunks. Oh also, we did not experience any nausea at all. </p>"
 ],
 "erowid": {
  "id": "1943",
  "citation": " Eric. \"A Bit Weird and Distorted: experience with H.B. Woodrose Seeds (ID 1943)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1943",
  "substance": "H.B. Woodrose Seeds",
  "views": "9034"
 }
}
