{
 "id": 2872,
 "title": "Relaxation, Unbelievably Detailed Visuals",
 "date": {
  "submission": "2002-12-07T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "lowercase",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Calea zacatechichi"
  }
 ],
 "report": [
  "I got some calea from an herb shop, 5.75 for 30 grams which I found would be very nice if the effects were good.  I was excited about it because of my lack of dreaming, or remembering my dreams.  I also have an intestinal disorder and the indians used this to help people with these problems.",
  "I smoked a small bowl to test out the taste.  The taste was wretched at first, but I found if I take light slow hits the intensity of the taste lessens. I immediatly felt quite relaxed.  I noticed the relaxation effect is most appreciated if I lay down for a bit, especially if I close my eyes, not to sleep but just for meditation.  After the first bowl I actually fell over after I got off my bed because my legs were so relaxed.",
  "Before I went to bed I smoked another bowl and layed down to sleep.  When I sleep I think too much so I always focus on visuals seen from meditation to get my minds off things. While I was on calea the visuals were very vivid, and random visuals out of the blue would pop up, and very detailed ones at that.  The best visual I saw was a wall and a creepy Mexican Indian priest moved around the corner.  Unbelievably detailed, I ripped opened my eyes in terror.",
  "When I woke up in the morning I could not remember any of my dreams, or if I had dreamed.  I was thinking about things and remembered an event from the night before.  Then I realized the event never happened and it WAS a dream from that night and now I remember dreaming it and having dreams most of the night. The dream I remember was just me and my friends sitting in a room. It was so lucid that I actually thought it was real the next day.",
  "Today I smoked a rolled cigarrete with my friend.  Thats definitly better than using a pipe.  He noticed the relaxation also.",
  "Overall, this is a great herb, cheap and I receive good effects from it.",
  "From reading and slight experience I believe the proper dose is to smoke some and when you lie down to sleep, if you can't feel your heart beating, then you probably haven't smoked enough.",
  "This herb has definitly gotten some bad slack, probably from people who just like getting 'messed up' from substances."
 ],
 "erowid": {
  "id": "19431",
  "citation": " lowercase. \"Relaxation, Unbelievably Detailed Visuals: experience with Calea zacatechichi (ID 19431)\". Erowid.org. Dec 7, 2002. erowid.org/exp/19431",
  "substance": "Calea zacatechichi",
  "views": "52977"
 }
}
