{
 "title": "Mistaken Package",
 "author": "Unski",
 "citation": " Unski. \"Mistaken Package: experience with Mandrake (ID 28747)\". Erowid.org. Nov 28, 2003. erowid.org/exp/28747",
 "substance": "Mandrake",
 "bodyweight": "63 kg",
 "report": "<p>Well, this was heavy shit as you might expect. Last summer I received 100g of dried mandragora root, powdered. I had another 100g bag of powdered ephedra and 3 (!) times I took mandrake as ephedra, making a mistake with the package! A huge mistake! The memories of these experiences are quite blurry, after five months I have started to recollect these details. Last summer was a very hallusinogenic one for me, taking datura, brugmansia, ayahuasca, salvia, syrian rue, brunfelsia and mandragora. After having some time sober, the memories slowly surface.</p><p>At first I made tea with six grams, drank it and waited for effects. Since I had no experience on ephedra, had no idea about what to expect from it. The first effects came and it wasnt nice. Mouth dry as hell, sleepy and nauseous. I smoked some salvia divinorum (I had intended to boost salvia with ephedra), and totally flipped out. I ran around my apartment thinking I was an eagle ready to take off! I was about to jump out the window but luckily came back to my senses. My home was not the same place anymore, something in the linear sense of my self and surroundings had changed dramatically. The nausea faded little by little. I went out to walk and enjoy nature and felt good. Then I went to sleep.</p><p>I made another tea, this time with 15g! This is the experience hardest to remember, most of it has remained total blackout. I was eager to dry ephedra (?!) again, read that 15g would be a strong dose. With mandragora this may be a lethal one! After drinking the tea which tasted all but pleasant, I started to feel very nauseous with the usual side effect, dry mouth and throat. I did it to myself again! A thought occurred that I might die but 'dont worry, its only ephedra' was my response to it. This may be the reason for staying alive. This is the part Ive remembered afterwards:</p><p>The effects reminded so much of other tropane bearing plants (brugmansia, datura) that I thought this was a flashback or the stuff wast ephedra. I was tripping for sure and decided to go with it. I remembered what my friend who I hadnt seen for two years had said about his datura trip, it lasted for two days. Suddenly he was there with me! We talked for awhile, I cant recall the details of our conversation but I remember finding myself mumbling insanities all alone like waking up from a dream. This happened again, I dont know how many times or if there were some other peole too. I was worried if my landmark living downstairs heard me freaking out. I fell asleep at some point. In the morning everthing was ok except my kidneys, they hurt!</p><p>Since I dindt remember the delirium caused by my last tea I tried it again. This third experience with 'false ephedra' was not so heavy. A strong tolerance had developed with the two previous. It was quite peaceful but my body didnt like it, meridians got stucked. I tried to meditate but felt like going in circles without getting anywhere. The kidneys were painful afterwards, again. Theres not much to say about this one, perhaps nothing special happened or its just another blackout. Like this written account depicts, I felt indifferent and still do when looking back to that night.</p><p>Shortly after the third dose of lunacy, I discovered the mistake of taking mandragora as ephedra. I was terrified, I could have died! I had made sure about what were in those bags, so I thought. Was it the magical power of mandragora that made me to mistake for three times? It must be something like that, Im always careful with magic herbs. But three times?!! Or was it my stupidity? Perhaps...</p><p>I dont know if its caused by mandragora or datura or brugmansia or other plants Ive taken but my daily life has changed dramatically. I hear voices (schitzophrenia?), I see visions. I have this thing I call mental television, like an inner eye. The voices are more like thoughts that are not mine than sounds, I see they come from another source though my feelings mold them. I can stop them at will, but sometimes theyre like raging demons and make me very uneasy. If I listen very hard (with my inner ear), I start to hear people talking (spirits?). Sometimes voices around me like my steps seem to talk. Am I a sorcerer? A madman? Some of you who know may think Im an idiot, some others who dont might be envious, dont! Theres another world beside ours, but Ive seen they dont always go hand in hand. Those 'voices' for example, they lie! Im used to this, but its still confusing. One needs the spirit of a warrior to get by amids of all this, never give up! So before you try solanaceae, think twice. And if you do, do a small dosage. When youve done it, wait awhile before doing it again. Time will show you more about the effects. Theyre not just one night joy ride.</p>",
 "year": "2003",
 "id": "28747",
 "gender": "Male",
 "timestamp": "2003-11-28T08:00:00.000Z",
 "views": "23341",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Mandrake",
   "form": "(tea)"
  }
 }
}
