{
 "id": 2875,
 "title": "In the Eye of the Mind",
 "date": {
  "submission": "2006-05-27T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Buddha",
  "gender": "Male",
  "weight": 69
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "tablets"
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "oz"
   },
   "administration": "oral",
   "substance": "Valerian",
   "form": "extract"
  }
 ],
 "report": [
  "One night I felt like staying up the whole night, so I took 5 Adderall pills that I had and ground them up and snorted them. Well this got me tweaked like hell! An hour later I decided to see what would happen if I drank some Valerian Root Liquid Extract. I drank 1/2 of the bottle, and somewhere on the label it says that it contains 1 fluid ounce, so thats half ounce for me.",
  "After like 20 minutes I began to feel relaxed, not sleepy (the Adderall fixed that), and imaginative. I noticed that when I closed my eyes the most profound thing happened. I would be transported into another dimension! Its not like daydreaming, its like crystal clear colors and pictures and people! I also noticed that I would talk (mentally) to people who would answer back without me being able to control anything that they said! They would talk to me, and I would actually 'hear' their voices. Very interesting thing.",
  "Also when I would close my eyes, the open-eyed world became dim, I would try to recall information about it, but I could only remember the basics: that it was dark, and that I was in my room. Nothing else could be remembered until I opened my eyes. But it is very amazing to note that every 'hallucination' had a mind of its own! I could not control them, they would do what they would normally do, A biker would bike, A book would show pictures that wouldnt change! That was a great experience and I hope to try it again sometime, but not soon because I need to first get rid of my addiction to Adderall."
 ],
 "erowid": {
  "id": "19434",
  "citation": " Buddha. \"In the Eye of the Mind: experience with Valerian  & Amphetamines (Adderall) (ID 19434)\". Erowid.org. May 27, 2006. erowid.org/exp/19434",
  "substance": "Valerian  & Amphetamines (Adderall)",
  "views": "16788"
 }
}
