{
 "title": "Better than Opium",
 "author": "Hypersphere",
 "citation": " Hypersphere. \"Better than Opium: experience with Lady's Slipper (ID 28755)\". Erowid.org. Jan 5, 2004. erowid.org/exp/28755",
 "substance": "Lady's Slipper",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  "1.0 g",
  "oral",
  "Lady's Slipper",
  "(roots)"
 ],
 "report": "<p>Lady's slipper (Cypripedium calceolus var. pubescens) is a beautiful yellow-flowered orchid native to my region of western Canada. I had read in the book Magic and Medecine of Plants that lady's slipper root had once been used as a substitute for valerian root, and there was a little warning that large doses could cause 'giddiness, headache and hallucinations'. I thought this sounded intriguing, so when I discovered that my local herb store actually carried lady's slipper root, I immediately bought some. It was the most expensive herb they had, but I figured I had to try it at least once.</p><p>I decided to start off with what I thought we be a small dose - one gram of the dried roots steeped as tea. The roots had a really bizarre smell to them, almost a bit of a petrochemical scent. If you've ever smelled a lady's slipper orchid, you should know what I mean. It certainly didn't have the sickly sweet smell of valerian. I settled back with my first cup of tea, looking for nothing more than a little sedation so I could get to sleep easier. So I was quite surprised when, about 20 minutes later and halfway through the first cup of tea, I started to feel like I was floating. I poured out a second cup of tea, but never managed to finish it as the tea now proceeded to kick my ass. I was incredibly sedated, all I could do was lie on my bed. This overwhelming blissful feeling swept through me, and everything in my vision seemed to wave a bit. Also my sense of pain had completely vanished. The aching knee which had been plaguing me before I drank the tea now felt just fine.</p><p>It reminded me quite a bit of the effects of opium, except stronger. I had been a bit dissapointed when I tried opium, but lady's slipper held every desirable effect I had heard of regarding opiates. Euphoria, analgesia, sedation. It also proved quite effective as a remedy for insomnia. As I lay blissed out on my bed, I sort of went into a trance, and must have fallen asleep because I didn't wake again until my alarm went off the next morning. I didn't notice any residual effects that morning, except that I felt more rested and refreshed than normal. I wonder how many other people have tried this plant.</p>",
 "year": "2003",
 "id": "28755",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-01-05T08:00:00.000Z",
 "views": "27023",
 "dose": {}
}
