{
 "id": 2879,
 "title": "The Anxious Decline",
 "date": {
  "submission": "2005-09-28T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Blondie",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "My report isn't about a single ecstacy use. Its about my using ecstacy over a whole period of time causing bad long term effects which I never thought of while I was using.",
  "Ecstacy is a really fun drug if I take it only once in a while. When I first tried ecstacy when I was 15 (about 4 years ago) and it was the best experience of my life. It was so fun that I wanted to do it over and over again. I tried it again 1 week later and fortunately for me I had a bad trip which caused me to be scared and not want to trip ever again. I had a panic attack and I thought I was going to die while I was on it. I prayed that I would be all right and if I was I would never trip again as long as I lived.  I didnt trip for a while after that. Then about 3 years later I started hanging out with a bunch of people that trip every day and I started going out with a guy who really loved E in that group. I saw how much fun they always had and even though I was really nervous I ended up taking an E pill. It was alot of fun and after that I began tripping all the time about 3 times a week sometimes 4 over the course of a whole winter (Dec. '01 - May'02).",
  "I probably never had as much fun before in my whole life. Unfortunately this had a lot of consequences. See, the whole time I would trip I would only worry about the short term effects and if I was gonna have a bad trip or not, but never did it cross my mind any of the long term damage I could do. First of all my immune system just lowered completely. Of course I know everyone gets sick but I was really healthy and I hadn't been sick since the 8th grade. When I started tripping I was always coming down with something whether it was bronchitis, the flu a cold and the worst Mono.",
  "I still am not back to my best health although I'm trying to get back there. And as if being sick all the time wasn't bad enough there were the mental side effects as well. When I started slowing down around April, May I began to realize that when I wasn't tripping I would just constantly be nervous all the time. I figured it would eventually go away but it hasn't. Then the effects got worse. I'm so weird now. I think of the wierdest things. I'm constantly nervous and paranoid. I'm always thinking and worrying about death and if something bad is going to happen to me. And if thats not bad enough I turned myself into a hypochondriac. I'm pretty much always depressed.",
  "I feel like I never have anything to look forward to anymore. I dont like going out like I used to. To top it off my boyfriends always tripping with his friends and since I quit I'm always the left out one. He's always trying to get me to do it because we bonded so much on it. I really want to but I'm just scared to. I feel like shit 24/7 and I'm constantly tired and fatigued. I feel just 'out of it' all the time. To top it off I have permanant insomnia. I can get to sleep for nothing. Maybe thats the reason for my chronic fatigue. I can't even sleep for long periods of time. I can only sleep for 3-4 hours a night. Then I wake up and I can't fall back asleep. During that little period of time I am sleeping I am constantly clenching my jaw. I know this because my jaw clicks and is stuck everytime I wake up and I also bite the insides of my cheeks too. I feel like I just tripped in my sleep. I also get nightmares alot too. When I first stopped tripping I would get weird things before I would go to sleep.  I would be in a half asleep/half awake state and my mind would just start to think of weird things and I would feel like I was spinning around and around while lying down and I would try to open my eyes but I couldn't for a few minutes. This is the only long term effect that went away tho.",
  "The only good thing is that my short term memory seems all right.  If I realized that having such a good time on ecstacy was going to result in permanant damage and I would have to live my life like this I definitely would not have done it as much. Shit I probably  wouldn't have done it at all. Because even all the shyt I got put through on ecstacy the most annoying and nastiest thing of all is that I miss it so much. Before I tripped on ecstacy alot  I would have a blast on beer and weed. Now I hate alcohol and weed is ok even though it can't compete. Even now like 6 months later I still can't forget the great times I had on it and if I go out to try to drink I practically fall asleep cuz it's so boring now. The only thing I like to do is just stay home. Sometimes I feel like just fuckin everything and just tripping again. I guess you only live once right. But I can't do that cuz in the long run it's just not worth it.  A night of fun definitely is not worth a lifetime of stress, sickness, depression and anxiety. I guess in a way I'm slowly getting better, or maybe not. Maybe I'm just learning to deal with depression and anxiety. I was thinking of trying zoloft or prozac but I'm scared to take medications now. I'm scared of the bad side effects. (another weird thing about me).",
  "Well thats about all I have to say about E. Just remember try not to trip so much because E really did have horrible long term effects for me. If I had to do over I would never have taken it cuz once I took it there was nothing like it ever again.  I miss it alot but I got to learn to deal with out it cuz my life sux ever since I became an E-head."
 ],
 "erowid": {
  "id": "19447",
  "citation": " Blondie. \"The Anxious Decline: experience with MDMA (Ecstasy) (ID 19447)\". Erowid.org. Sep 28, 2005. erowid.org/exp/19447",
  "substance": "MDMA (Ecstasy)",
  "views": "25428"
 }
}
