{
 "title": "Flying Under the Bridge",
 "author": "Synikal Boy",
 "citation": " Synikal Boy. \"Flying Under the Bridge: experience with Cannabis, Crack & Ecstasy (ID 289)\". Erowid.org. Sep 2, 2001. erowid.org/exp/289",
 "substance": "Cannabis, Crack & Ecstasy",
 "bodyweight": "75 kg",
 "report": "<p>Before I start, I realize that mixing substances like this can be dangerous, but I am a very frequent mind-flyer, and have done all the research possible for each of the substances BEFORE I tried them. Also, I realize slang changes over distance.  when I talk about cones, I'm talking about marijuana.</p><p>It was my best friend's birthday, and what better way to celebrate his 18th than by going to the casino?? There were 4 of us, me, R, B and W who were participating in the 'experiment' and a couple of others who were just along for the ride (and a bit of a smoke, too). Me and W had to go for a BIGTIME trek to go pickup the supplies for the night.  This included 1/4oz of pot, a bunch of pills and 1/2 g of crack cocaine.  This was the first time any of us had tried crack.  We had a little bit of pot to smoke on the way back to make the long return trip more enjoyable.</p><p>Then me and W met up with R and B and went to our local smoking-hangout, where we proceeded to have our pills and a smoke.  For the sake of caution, we all decided to only dump half a pill each (for now) and have a little smoke to pump ourselves up for the main event.  We got a bit stoned, and in my confusion, I dropped my remaining 2 pills on the ground somewhere!! Well that pissed me off no end, and I wasn't sure if I was gonna have any fun, but we trudged on anyway, not really noticing any effect from the pills. </p><p>We found ourselves at this little kiddy park with a cool spinning thing right at the base of a very big, impressive.  W divided the crack up into equal portions for us all (it came as a very hard rock of white powder).  It crumbled up to a little bit each, and we proceeded to place it on top of ready-packed (with pot) cones and smoked ourselves stupid.</p><p>W went first, and put a little bit of powder on top to try it.  After a little while he said it was 'unbelievable'  so I scooped up my entire portion for the night and smoked it in one go.  About 3 minutes later I scrabbled for my Walkman and put on my favorite track, which started to peak in its crescendo as I did.  I stood there for about 20mins with my eyes shut, swaying slightly, as I felt the music was a physical force, buffering me from side to side. Then my peak (which was by now as physical as the music was) flew up above my head and sat there for the tiniest fraction of a second, which then seemed to stretch out to eternity as I looked at my friends through the eyes of my peak.  My actual eyes were shut this whole time, but to this day I can still picture exactly what my friends looked like as I stood there, lost in a microsecond.</p><p>Then, when I realized I was tensing up in preparation for something, I relaxed.</p><p>BOOOOOM!!!!</p><p>It came flying down from above, and speared through my head, right to the tips of my toes.  PURE PLEASURE, MENTAL AND PHYSICAL.</p><p>I almost fell over with the rush that followed, and my closed eyes were now witness to a roller coaster ride that no one else will ever know about simply because it took off right from the point where words lose their meaning.  I have had more intense experiences than this before, but none that took me so completely by surprise.  It was as if it was waiting for me to relax before it began its beautiful onslaught of giddy pleasure.</p><p>After we had all had our experiences, we walked (a little unsteadily by now, since we were still smoking endless cones of pot) to the casino.  We thought it would be fun, but it sucked big time, coz we kept getting lost looking for each other, and a way out.  There were thousands and thousands of poker machines, and they just started driving everyone CrAZy with their DAMN ANNOYING NOISE!! We eventually found a way out, and met up with some more friends at the pub just up the main road from the casino. But everything seemed so insignificant after that beautiful, endless rush.</p><p>I don't know if I will ever try crack again, but I'm very glad that I tried it for my best friend's 18th, and I definitely don't recommend that anyone take a substance as seriously dangerous as cocaine without taking every possible precaution. Myself and all my friends have cell phones, and at the slightest hint of trouble, were ready to call for help.</p><p>Regarding comedowns:  We all smoked such a ridiculous amount of pot, that we were high for a coupla days, and probably came down in our sleep.</p>",
 "year": "2000",
 "id": "289",
 "gender": "Male",
 "timestamp": "2001-09-02T07:00:00.000Z",
 "views": "39671",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "0.25 g",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 ]
}
