{
 "title": "Time Log",
 "author": "Trizzippa",
 "citation": " Trizzippa. \"Time Log: experience with Oxycodone (Percocet) (ID 28947)\". Erowid.org. Feb 9, 2007. erowid.org/exp/28947",
 "substance": "Oxycodone (Percocet)",
 "bodyweight": "165 lb",
 "report": "<p>OK, I got a bottle of percocets for gettin surgery last week. I also got a bottle of vicodins, but I ate them up quickly. As for my tolerance, it's a little higher than normal since I took them every day last week, every four hours. At the end of the week, I was having to take 5 or 6 pills to even feel it, and at least 7 to get a good buzz. But I waited 4 days without taking any pills so my tolerance could go down.</p><p>Usually, I can take 2 or 3 and be pretty high, so I hope this will be really get me messed up if my tolerance is down enough. Well, now I have 5 percs left, and I'm taking them. I personally like reading time-log type experiences, so that's what I'll do =) By the way, I'm a pretty experienced opiate/opioid user, but I usually space my experiences out by at least a month b/c I only get a few at a time and they're hard to come by. I've done oxycodone, hydrocodone, dilaudid, codeine, and morphine. But my favorite is oxycodone (morphine makes me vomit like a mofo). So here goes!</p><p>T+ 0:00 - Just took the pills, chillen and ready. I crushed up 2, to make it hit me faster, and just took the rest whole.</p><p>T+ 0:10 - Nothin yet, just ready for them to kick in :) Just listening to some Fabolous, and chillen with a blanket cuz it's really cold. Just looked in the fridge for some grapefruit juice because I heard it lowers your tolerance, but we didn't have any :( oh well.</p><p>T+ 0:20 - Starting to barely feel it. I'm just feeling the little warmth throughout my body. =) I have a feeling my tolerance is down enough =) I'm heating up some clam chowder soup b/c I'm a little hungry. I'm soo ready for it to fully take effect :) I just loooove oxycodone!</p><p>T+ 0:25 - Damn, it's really hittin me. I'm feeling really warm and fuzzy all over, like an orgasm thru my whole body! Ahh, that all-too-familiar itchyness is setting in, too. And the clam chowder is very enjoyable. As for music now (which is a necessity to any opiate experience!) I'm listening to the barenaked ladies song 'If I had a Million Dollars.' It sounds soo nice.</p><p>T+ 0:30 - I'm definately fucked up! I'm soooo warm and comfortable. I'm not cold at all even though its 40 degrees. Lightheadedness is really taking effect. I got up to take a piss, and it made me even dizzier cuz I got up fast, which was kinda fun =)When I close my eyes, I can make myself feel like I'm spinning around. I'm also very itchy.</p><p>T+ 0:40 - Now it's even stronger! It's basically knocking me on my ass! But deinfately in an enjoyable way! It's total euphoria! Oxycodone is probably the most intensely euphoric drug I've ever taken. I think I'll go smoke a cig.</p><p>T+ 0:45 - Smoking tobacco was very nice, made the buzz even more enjoyable, tho it added to the dry mouth. But it tasted soo nice, and it felt soo nice. Everything feels just perfect! I'm starting to nod off, then come back. Its so pleasant.</p><p>T+ 1:00 - Still feeling about the same, it's hit a plateau. I can't even describe how nice EVERYTHING feels, for real. Just typing this feels so awesome. I'm drinking a Coke, and it tastes great, closing my eyes feels great, looking at pictures is great. It's the best feeling I've ever had!</p><p>T+ 1:30 - I've been on the nod. Coming in and out of consciousness basically. Wearing off slightly, but still feeling very good and warm.</p><p>T+ 1:45 - Starting to wear off a little more =( I'm also getting pretty sleepy now.</p><p>T+ 2:15 - I've come down a whole lot now, but I still feel good.</p><p>Overall this experience was very very good, it was more intense than I anticipated. I'm glad my tolerance wore down so quickly. Anyways, I hope you all enjoyed my experience report. It was definately fun! I'm getting some OC in a few days, so I'll probably write about it too. Until then, peace out.</p><p>-Jerome</p>",
 "year": "2003",
 "id": "28947",
 "gender": "Male",
 "timestamp": "2007-02-09T08:00:00.000Z",
 "views": "70291",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  },
  {
   "time": "",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  }
 ]
}
