{
 "title": "An Amazing Experience",
 "author": "jojokin",
 "citation": " jojokin. \"An Amazing Experience: experience with DXM (ID 2894)\". Erowid.org. Dec 13, 2001. erowid.org/exp/2894",
 "substance": "DXM",
 "bodyweight": "215 lb",
 "report": "<p>All I can say is WOW. This was the single most enlightening, pleasant, and mind altering experience of my life.  I should point out that I am not taking any perscription drugs, and I have a very nice life right now. I am generally a very happy person.  For me, mood has a lot to do with this drug.</p><p>I bought a 4 oz bottle of Robitussin maximum strength cough syrup at a grocery store (got a few stares from the checkout person and a sarcastic comment 'got a big cold, huh...') and made plans to use it that night. I was alone, but in a comfortable setting. The taste is not nearly as bad as people make it out to be. I mixed it with a little water to thin it out and then just downed a carefully measured 3 and a half tablespoons. After ten minutes I decided I didn't just want a buzz, I wanted an experience, so I just drank the rest of the bottle. I tried not to become obsessed with the effects setting in by just watching some tv.</p><p>0:40 - I began to feel kind of dizzy (in a very good way) and euphoric, like I had just had 4 or 5 beers only without the 'boozy' feeling. I was really getting into it and i was already satisfied.</p><p>1:00 - Now it was really setting in. I had read that it peaked after 2 or 3 hours, so I figured I had a ways to go. My whole head started to itch, as well as my hands. It was very annoying but only lasted a few minutes.</p><p>1:30 - By now I was feeling like I had had more than a few drinks, and had also smoked a bowl. This was such a great feeling. Every once in a while I would stand up and things would go crazy, my head felt like it was floating 10 feet above my body, my arms felt very light, and objects kept going in and out of focus. My vision was a bit blurry and it was very hard to concentrate, but I managed to put in a cd. Music was wonderful, the bass seemed to enter my body and linger for a few seconds, like my head was a huge echo chamber.</p><p>2:00 - Now I was completely incapacitated. I could barely walk, let alone stand up, without falling over and laughing at myself hysterically. I somehow made my way upstairs and to my bed, but I don't remember how. I would mutter things to myself and talk to the walls because I thought they were mocking me in some way, but at the same time they were very friendly and we could laugh together. I couldn't read any text, it all appeared as incoherent rambling, as did the people on tv. I put on another cd and laid down with headphones. Closing my eyes I started to see incredible visuals, colorful and strange things, not at all like the effects of acid or shrooms. This was very pleasurable and I was really getting into it. I let the music run and I fell into a sort of trance, I was awake, but I was not in my body. I was somewhere else entirely, and I have only vague recollections of what happened. My trance-like state lasted about 4 hours.</p><p>6:00 - I managed to sort of wake myself up, and I was instantly aware of my surroundings and everything that had happened. I sat up and noticed I was still under the effects, only not as strong as hours before. It was very hard to make it down to the kitchen to get some water because I was bumping into everything on my way, but I made it safely and back to my bed. From there, I just slept for about 9 hours and woke up feeling very refreshed with the whole experience still fresh in my mind.</p><p>This was an amazing experience, I found it somewhat spiritual, but at the same time very entertaining and fun. I plan on trying this again, maybe with a few friends and a *slightly* higher dose. I plan on waiting a few weeks because I want to keep the dose rather low until I'm comfortable with it. I'd prefer not taking any other mainstream drugs with dxm (such as mj). I felt many of the cannabis-like effects with the dxm, closed eye hallucinations, sensations like I was flying or falling, and the same kind of mental state at the beginning of the trip.</p>",
 "year": "2000",
 "id": "2894",
 "gender": "Male",
 "timestamp": "2001-12-13T08:00:00.000Z",
 "views": "23302",
 "dose": [
  {
   "time": "0",
   "amount": "360 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
