{
 "title": "Once a Week, Everything Fades Into Love",
 "author": "Craevyn",
 "citation": " Craevyn. \"Once a Week, Everything Fades Into Love: experience with Cannabis (ID 28966)\". Erowid.org. Sep 8, 2008. erowid.org/exp/28966",
 "substance": "Cannabis",
 "bodyweight": "107 lb",
 "header": [
  "DOSE:",
  "2 bowls",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>There are some things money can't buy.</p><p>But, often, money can buy good dope, though. While it doesn't deliver true happiness alone, you can get a good start on it by getting stoned off your ass. I like to follow this up with meditating amidst some glowing candles and my favorite mild incense while my girlfriend, who I deeply love, softly plays slow, mellow songs on an acoustic guitar across the room.</p><p>It puts me in paradise every time, especially if we add soft, beautiful lovemaking to the mix. It is never urged on by lust. That would ruin it. Instead, it is fueled by the true, unconditional love existing between myself, and her. Each experience is more intimate and beautiful than the last, as we learn more about ourselves, each other, and the world as a whole.</p><p>I achieved a mild version of this feeling once, the first time I tried just setting up a nice, romantic moment with my girlfriend with all the elements above, minus the ganja. It felt great, so I proposed that we try it while coming off a strong buzz, and that's how we've done it ever since. That little slice of heaven doubled in size, and continues to grow and grow with each encounter. The slice tastes sweeter, even more delicious.</p><p>Once a week, everything fades into love, beauty, and understanding for nine sweet hours.</p><p>Pot has become a good start to my true happiness, albeit temporary happiness. (Has happiness ever lasted forever for any person?). Still... I haven't been able to top the combination above, and haven't yet felt inclined to try, because I know that this is the view from the top. It's MY slice of heaven; the condo I rent on Paradise Island every week for no more the cost of a premium dime, candles, and incense.</p><p>Thirty-five dollars was never better spent than this.</p><p>Ever.</p>",
 "year": "2003",
 "id": "28966",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-08T07:00:00.000Z",
 "views": "3220",
 "dose": {}
}
