{
 "title": "Not For Me",
 "author": "Psyche's Sailor",
 "citation": " Psyche's Sailor. \"Not For Me: experience with Sertraline (Zoloft) (ID 28970)\". Erowid.org. Dec 9, 2003. erowid.org/exp/28970",
 "substance": "Sertraline (Zoloft)",
 "bodyweight": "200 lb",
 "report": [
  "<p>Granted, this was a medical experience, but I think it still serves well to highlight a possible side effect. ",
  "When my doctor first put me on Zoloft, he started me on 50 mg per day.  It seemed to work a bit for my depression but there was still room for improvement so he upped my dose to 100 mg.  My first day on 100 mg was fine, but by early evening the second day, I started feeling as if I was coming down with the flu.  After spending a few hours on the couch under three blankets trying to keep warm, I finally built up the energy and concern to finally find my thermometer.  It turns out that my temperature was 102.6.  A couple acetaminophens brought my fever down but I still felt awful so for the next few days I cut my pills in half to go back to 50 mg.",
  "Once I felt like chancing things again, I went back to the full 100 mg dose.  Again my temperature started to rise so I took two acetaminophen again and started feeling better.  After a few days at 100 mg, my body adjusted to the Zoloft and I didnt have any more problems with fever or body aches.  However, I was still faced with side effects that reminded me of 3 or 4 Ritalin, caffeine pills, or ephedrine.  I was jittery, talking much more than normal, my hands where shaking, and I had real problems getting to sleep at night.",
  "Needless to say, I am now in the process of getting off the Zoloft; though, I am soon to start on Paxil which, from what Ive read here at Erowid, I am not totally looking forward to.  I just hope that I wont have the experiences that others have had and, at the very least, once Im off the Zoloft, I should be able to get a full nights sleep again.",
  "I wouldnt call my Zoloft experience a total waste.  My depression was lessened, if not removed, by this SSRI and for that I was glad.  The side effects, for me, just arent worth it.  When coupled with the euphoria and beautiful conversations of Meth or the productivity of Ritalin (no, I am not ADD, but I can still write like mad on Ritalin,) those same side effects are tolerable; but knowing that I have other antidepressant options makes Zoloft simply not worth it in order to just feel normal.",
  "I guess the lesson here is that just because you get it from a doctor that doesnt mean its safe.  Moreover, serotonin is nothing to mess around with.  Honestly, I think that I feel safer with something like DXM or MDMA.  Im not saying that you can always (or, really, ever) trust street drugs like MDMA, but at least theyve been around and used for a good number of years and so there is some information on their effects, both short- and long-term.",
  "Most SSRIs, on the other hand, are pretty new and not really that well understood.  Not that Im suggesting that DXM or MDMA sure be used to treat depression or anything else; self medicating just aint worth the risks (trust me there).",
  "However, we should all remember that Dr. Freud prescribed cocaine for pretty much everything and that, in the 1950s, the psychiatric community wrote the same things about LSD that they later wrote about Prozac in the 1990s.  I will honestly be surprised if 20 years from now todays SSRIs are still being used.  After all, you only get one brain in this life and as a PhD/MD Neuroscience professor once told me, For all intents and purposes, we really dont know anything at all about how the chemicals in the brain work.</p>"
 ],
 "year": "2003",
 "id": "28970",
 "gender": "Male",
 "views": "63052",
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2003-12-09T08:00:00.000Z"
}
