{
 "title": "The Crank Diet",
 "author": "Red",
 "citation": " Red. \"The Crank Diet: experience with Methamphetamine (ID 28975)\". Erowid.org. Jan 29, 2007. erowid.org/exp/28975",
 "substance": "Methamphetamine",
 "bodyweight": "160 lb",
 "report": [
  "<p>It was three days ago I had asked my friends, who were visiting from out of town, if they would recommend speed for use in weight loss. One assured me she had done such a year previous and had lost about 30 pounds. The drawback, she warned, was that to this day if she sees it or even hears about it the cravings return.",
  "Her sister, a tweeker for years, offered to get me 'twacked' as they called it. Escaping to a clean bathroom she pulled a pipe given to her by a dealer. The bag she carried held a plastic straw cut into what looked like a pointed scoop, a blowtorch, a damp washcloth, a travel case, glass items slid into socks, a lighter, and a small ring case used to store the small baggie. Using a blowtorch she sterilized the end of her pipe warning me the chemicals left inside were not good.",
  "In order to smoke the Meth she had to hold the pipe for me. I was not able to turn it slightly back and forth while holding a lighter at the right angle and distance simply due to inexperience. She warned me to blow a little out first to get rid of a bad chemical taste and get the smoke curling at the ball shaped end. After that I sucked slowly and resisted the urge to hold my breath.",
  "I was curious when I went into the bathroom with her but all questions were held. She helped me get a few good hits and between the two of us we had a bowl' in about 15 minutes. I wanted more. I could not feel much and the smoke was not bothering me so I asked and she prepared a second bowl. We smoked that in about 15 minutes too. The best I can explain the dose is using the pointy end of a BiC pen's cap to scoop the meth. She balanced powder on the slender surface just under half of the length.",
  "At first I felt nothing. It was not until my other friend who had been watching asked what I was experiencing that I noticed I was much more awake and colors were vivid. Light was brighter due to dilated pupils and I was actually happy. It was as if all the stress about rent and a husband gone in the military had faded into menial problems. My spirits were lifted and for once I had the energy to do anything I wanted.",
  "This is when I started asking all the questions I had been thinking of. I had her explain how to use the substance in a light bulb, pipe, snorting, et cetera. She warned when you sniff it not to use your crystals for it will hurt more. If the pain was bad she recommended putting water on the end of your finger and sniffing it too.",
  "When using a bulb specially prepared she said to turn on the cold water then turn it off and place a washcloth on the bottom of the sink. This makes it damp but with enough dry spots to cool the glass. Because bulbs are so thin she told me never place a wet spot on it right away for the sudden temperature change will crack the glass.",
  "Pipes are thicker generally and she said you can use a damp cloth to cool the end after every few hits. You may not need to know this but it's better to fumble through looking like you know what you are doing than embarrassing yourself in front of thugs and addicts.",
  "The questions pounded my mind until there was no doubt I had gotten all the information I could from her. My thoughts were clear and quick compared to daily life. Feeling my pulse I counted only 80 beats (or there about by counting while watching the clock for 15 seconds then multiplying by 4). Normally my heart is about 75-80 beats per minute due to the medication I take.",
  "Let me delve into this a little further. I have asthma that is bad enough I have used a nebulizer (air mask with medicine vapor) several times this month. Because of this I have been taking Singulair 10mg. Also diagnosed with Borderline Personality Disorder which had developed into Obsessive Compulsive Disorder (cleaning), I was put on Zoloft at 50 mg once a day. I have really bad allergies and take Allergra 60mg once daily. Lastly I am hypoglycemic.",
  "It was then my sober friend said she needed to go somewhere and since I was the only one with a running car and the ability to drive a standard I went.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "My sight was tender to the sun but shaded glasses helped. The more I moved the faster my heart seemed to go until it rested at a stable 110. I was told not to resist coming down off my high, simply to drink milk and go to bed or do more. The calcium used by the drug is quickly depleted thus I recommend a glass of cool milk to everyone regardless if you use again. It helps the upset stomach part.",
  "My intentions were to stop all at once after hitting it hard for 15 or less days. According to the Body Mass Index I am overweight so my target weight was 130 to 145 which had not been accomplished by the doctor, dietitian, healthy food, and exercise. Before using I had set up three separate friends who would help me quit. If I continued to use for more than 20 days they were to call crisis intervention and get me into rehab no matter what I said or did.",
  "The first night it was hard to sleep and I lay awake in bed for what seemed a long time. The drug makes time pass very quickly and to emphasize that I was laying there bored and tired for 5 hours. I thought it was two hours by the time I stumbled to watch TV. Weed is said to be good to help people sleep so I smoked a bowl and shortly thereafter fell to slumber. Two days later when I had used again I gained a headache and felt tired. I thought it was because of the drug but quickly I discovered it was moderate hypoglycemia. Food tasted unappealing and even gross but I ate a nutragrain and drank milk. The symptoms left and I was energetic and stress-free again.",
  "The tolerance level of this drug is very high and I have found myself needing more to get the same effect. When my dose gets really high Ive noticed a persistent nausea that will not go away unless I pray to the porcelain god.</p>"
 ],
 "year": "2003",
 "id": "28975",
 "gender": "Female",
 "views": "30388",
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2007-01-29T08:00:00.000Z"
}
