{
 "title": "With Opiate Use/Withdrawal",
 "author": "axismatrix",
 "citation": " axismatrix. \"With Opiate Use/Withdrawal: experience with Modafinil,  Alprazolam, Pseudoephedrine & Hydrocodone (ID 28982)\". Erowid.org. Mar 12, 2004. erowid.org/exp/28982",
 "substance": "Modafinil,  Alprazolam, Pseudoephedrine & Hydrocodone",
 "bodyweight": "176 lb",
 "report": "<p>This may turn out to be important to anyone with a moderate dependence to opiates.  For my own sake, I hope so, but the initial data seems very encouraging!</p><p>History: Decided to start taking Hydrocodone/APAP about 2 months ago for experimental purposes.  Personally, I am one who does not get a euphoric rush from opiates, at least not recently.  The first time I had taken any was several years ago before any experimentation and subsequent alteration to my brain and body chemistry. At that time, I had only about 10 Vicodin, not knowing the Hydro content, but only a half gave me a good groove, and I spread them out over several weeks, adding them to whatever else I was doing, usually extacy, but this is focused on Hydrocodone and my experimentation with it.</p><p>After about the first month starting my Hydro, I already had physical dependence.  Not taking my next dose, which daily had risen quickly to about 100mg/day : (10) Norco 10/325, left me with initial lethargy, irritableness and VERY BAD intestinal discomfort.  Let me just add that while taking any opiates, I suggest also taking daily swigs of Senokot laxative or Senna tablets to keep you from becoming dangerously constipated.</p><p>Immodium AD can be used to offset this physical, what I call intestinal withdrawl, but that causes constipation as well.  Don't take opiates and Immodium at the same time!  You'll not go to the bathroom for a month!  This is extremely not a pleasant experience.</p><p>I am still not sure about supplementing DXM with opiate use to decrease dependence.  I never took the Robitussin Gel Caps steadily enough to know for sure.</p><p>During my initial time taking Hydro, those first two months or so, there was very little pleasure other than warding off the withdrawl symptoms, just a little relaxed feeling someone who needed a smoke would understand.</p><p>I eventually was unable to get any more Hydro and went through withdrawls for real for about a week, each day a bit better than the last.  But in order to get through it, I kept knocking myself out with Xanax ... just to sleep through the pain.  Needless to say, I was not very productive during this time, but I got through it without substituting a habit of Xanax in it's place, and I have ALOT of Xanax.</p><p>But during my constant usage of Hydro, I needed something to offset the sleepiness it gave me, so I tried adding Pseudoephedrine.  This made me feel sick for the most part, and the little lift it gave was not worth it, for me.</p><p>Well, wouldn't you know that after I thought I was through with all this silliness, I went and got another refill of Hydro.  This is all through online pharmacies, by the way.  So now here I am finishing the last 20 or so of the 90 I got only a couple weeks ago.  Once again, the knowledge of painful withdrawl haunts me.  However, I think I discovered something that may take care of this, Provigil (Modafinil).</p><p>The other night, I was working late as I regularly do, and I was going to reach for the Pseudoephedrine, when I searched out a vial of Provigil I had lurking in my stash.  I've had this for quite awhile to offset the lethargy from SSRI's I was taking at the time, but the combination didn't seem to agree with me.  But now it's a different ballgame, and like everything else, I decided to give it another try.</p><p>While mildly buzzing on my steady dosing of Hydro, I took 100mg of the Provigil.  All my pills are broken in half, as the standard 200mg was way too much back when first trying it.  I sat back down in front of the computer, as I am now, and to my utter surprise, I started to feel giddy and motivated, and the slothy, polluted feeling of the Hydro lifted off me like removing a wet sweater.</p><p>I thought I found a great combination to go with my Hydro, but again, to my surprise, it seems to NEGATE the opiate.  I'm still trying to figure this out for sure, but today I had a dentist appointment (no, i didn't get any drugs) and instead of grabbing my Hydro that i hadn't had for the last few hours, I instead started to clean off the Halloween decorations from the porch (It's now December), take out the trash, fix some things, etc.. etc.. I didn't even care for a smoke as much.</p><p>So, my hope and initial feeling is this:  taking Provigil could help you get off Hydro at least, maybe other opiates.  It has a cleansing feeling, and I think it's going to work much better than doping myself with the Xanax like last time!  And, at the very least, I keep working and working.   Provigil may have many more surprises in store.</p>",
 "year": "2003",
 "id": "28982",
 "gender": "Male",
 "timestamp": "2004-03-12T08:00:00.000Z",
 "views": "49965",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 }
}
