{
 "id": 2902,
 "title": "Astral Astronomy Class",
 "date": {
  "submission": "2005-09-15T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "shmurghi",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "My sophomore year of college I did a lot of acid.  I did it to gain insight about anything and everything.  It seemed and still seems like a miraculous substance to me, cleansing and empowering.  I decided to take it in class, and astronomy seemed the best venue.  It was in a large dark lecture hall with comfy seats and movies about the cosmos.  I dropped a hit or two a few hours before the class so that I would be past my peak by the time I was there.  I have a real tolerance to acid, and nobody can tell when I'm tripping, so I figured that it was worth a go.  I was excited to learn what the acid might help me experience this time, and not nervous or uncomfortable at all.",
  "The lesson was on the death of stars and the formation of their remnants.  It was amazing!  Pure serendipity that I tripped during a lesson where there was speculative physics involved! ",
  "The professor talking about the slowing of time, and the warping of the space-time continuum sowed the seeds in my head for one of the best school experiences I ever had.  I was amazed that my split acid consciousness could pay attention, take notes, and contemplate the universe at breakneck mental speed.  Every thought seemed to 'glow'- to have a beautiful resonance, since my mind was freed of 'static'.  The warm padded seats, general good 'vibes' of the room, and the lack of light other than that of the projector were all delectable, in ways only acid and deep meditation have given me.  I think this is also due to the lack of mental 'static' which might have otherwise dulled and blurred my sensory perception.  I left the class wishing it had been longer than an hour and a half.  My consciousness digested the lecture and experience, as my inner, higher self stilled, and . . . well . . . I don't have words for what happened, but I bet you trippers and meditators out there know. ",
  "I decided to trip again in class.  This time it was the final.  My friends thought I was insane to do so.  My inner being knew that it would be good.  I had perfect grades in the class up to that point, and I trusted myself and the acid.  I somehow instinctually knew that I should do it, in a 'part of my gut' that's never led me astray. ",
  "I dropped 5 hits of blotter a few hours before coming into class.  Going up was fun, dancing and singing in my dorm room, letting emotions expand from me through my actions.  It was beautiful.  I was peaking as i walked into the classroom.  I felt serenely confidant of the situation.  It was as if I were God in mortals' flesh, playing their game, and I was going to show them a thing or two.  The nerves of the other students and the strained expressions of the teaching assistants were like a boiling sea I could see from a cliff-top.  The kids around me were talking about how much they'd studied, and they asked me if I had. I said 'Of course not, you know me.'  and they seemed to cringe. ",
  "The paper landed on my desk and it began.  I observed the workings of my 'conscious, logical mind' as if separate from it.  It was myself that I marveled at this class instead of the infinite universe.  Numbers slid through equations in my head like kids in a slide at the water park.  Memories bubbled up in perfect synch with my thoughts, meshing with them to form essays, and make calculations and charts.  The removal of thoughts from their contexts  that my logical mind was doing startled me.  In the lecture all became one, as if I zoomed out on a picture.  In the test, the zoom went in to the ultimate degree.  I had the oddest sensation watching myself:  the processes of my test-taking mind looked so easy even though I was working at full throttle.  Suddenly it ended.  I felt the mental equivalent of a runner's high.  I raised my hand for the teaching assistant to take the test from me.  She smiled weakly at me, and walked off with my masterpiece.  I left the room aglow, and went to eat.  (I'm the only one of my friends who likes to eat while tripping.)",
  "I felt my class trips had revolutionized the way I saw school, my mind, and the universe.  I truly felt that acid is an entheogen - something that puts god within, or rather, I realized my inherent divine nature.  I do not suggest that anyone trip in class per se, but that everyone find their instinctual core - the little voice of council inside that is never wrong.  AND LISTEN TO IT!  Incidentally, I got a perfect score on the final, and A in the course, and congrats from the professor ;)"
 ],
 "erowid": {
  "id": "19534",
  "citation": " shmurghi. \"Astral Astronomy Class: experience with LSD (ID 19534)\". Erowid.org. Sep 15, 2005. erowid.org/exp/19534",
  "substance": "LSD",
  "views": "4711"
 }
}
