{
 "title": "Breaking Down the Barriers",
 "author": "Synergy",
 "citation": " Synergy. \"Breaking Down the Barriers: experience with Ecstasy (ID 2902)\". Erowid.org. Feb 14, 2001. erowid.org/exp/2902",
 "substance": "Ecstasy",
 "bodyweight": "",
 "report": [
  "<p>This past weekend, while camping out in the desert, I had one of the most phenomenal experiences of my life.  A  group of my friends and I set out to camp for the weekend, with the intention of hanging out, enjoying the outdoors and catching up with each other, since we all live far apart and don't normally have the chance.  The  first night we were there, one of my friends(we'll call him G)announced that he had brought enough ecstacy for all of us, and that if we wanted to, we could drop with him that night.",
  "We had all done it before.  However, this night was different.  I had never dropped with any of them.  I live far away from them, and the times I had done E was all spent with a couple of friends in my area, friends I knew but wasn't very close to, but never them.  At first, i was a little bit hesitant; we were out in the desert and I was concerned about becoming dehydrated or possibly awaking all of the other campers around us.  I was also concerned that, incase something happened that required a hospital, there were none around for about 75 miles.  So I dismissed the idea, and so did everyone else.",
  "The next day, as we were setting out for a hike, G told us that he was going to bring his E with him, because he felt that it would be a better experience to drop out in nature, near the water, and somewhere besides our campsite.  At this point, I had rethought my hesitancy from the night before, and decided that I was going to join him while I had this opportunity.  Things all fell into place and next thing I knew, everyone was wanting to drop.  We packed up ALOT of water, some candy we had lying around and some pacifiers(for the hardcore jawclenchers)and went off on our hike.",
  "As we reached the end of our hike, where the trail opened up onto this awesome expanse of cold, rocky river, we all dropped together.  As we played in the water, the effects began to hit us.  First, I had this initial wave of anxiety and fear; does everyone know whats happening to me?  Can they tell I'm sweating?  After that wore off, the feeling of the cold river water and the absolute brilliance of the sun shining down through the canyon we were in took over.  I felt completely at one with the water...the sun...the rocks under my feet....and most of all, my friends.  As we stood knee-deep in the cold water splashing and playing, we would stop, and hug each other and it was such a warm feeling of oneness and love that it is hard to put into words.  I don't think I have ever felt water so cold, so refreshing, and canyon walls so red and vibrant.  I also don't think I have ever felt as close to my friends as I did at that point.  When a breeze started to pick up, I remember just sitting down in the water and letting the breeze run through my hair and thinking that it was the most refreshing, most alive feeling I have ever felt.",
  "As we walked back to our campground, we all walked, hand in hand, holding each other, each encouraging the other to drink, and to have a lollipop to make sure their jaw wouldn't hurt the next day.  We all cared for each other and watched out for each other.  As we got back to our campground, we were all content just sitting down on the cold ground in a circle and spilling our emotions.  I don't think I have ever talked this deeply with my friends in my life.  We talked about relationships with lovers, with each other, past relationships, feelings about our futures, feelings about family problems...everything!  It was such a feeling of relief to finally talk to people about things going on in my head that concerned me, and have them smile at me, and accept them as part of me....then lean over and give me a hug, or drop some lotion on my hands and begin to knead them tenderly.  It was an awesome feeling.  After the campfire was started up, it began to produce shadows that flickered off of the person next to us, and the trailers it was producing, especially when looking through our holographic glasses made me feel so aware of everything that was going around me....the shadows, the sound of the crickets, the sound of wood snapping under someone's foot.  I have never felt this emotionally attached to any group of people or any place as I did that night.",
  "Soon as the effects began to wear off, we started to drink some wine.  For me, the effects were still somewhat there and the wine tasted better than anything I had ever tasted.  I could taste all of the flavours culminating in it.  That continued on this total feeling of warmth and awareness I experienced that really couldn't be duplicated.",
  "Later that night a small group of us broke off from the larger group(who had indulged in some Soma as their effects were wearing off, and were content laying in their tent with each other)and took a short walk back to the river.  There, we sat mostly in silence, closing our eyes to listen to everything around us and drinking it in.  It was nice during this time to just be silent with people you care about and hold their hand, just enjoying the sound, and the feeling of the wind.  I have never felt so comfortable or at ease in my life.  I have always had self esteem issues, and for that night, with my friends, they all were inconsequential.  I opened up and was ok with the silence around me, something I would normally be paranoid about.",
  "I have to thank both the E and my friends for this experience, because I think it wouldn;t have been the same if either of the two hadn't been present.  I have never felt as close to them as I do now after the experience because I now know that these people, who I only saw as acquaintances before, are now friends.</p>"
 ],
 "year": "2000",
 "id": "2902",
 "views": "7152",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2001-02-14T08:00:00.000Z"
}
