{
 "title": "Brain Flash Cards",
 "author": "Psychomycul",
 "citation": " Psychomycul. \"Brain Flash Cards: experience with Cannabis (ID 29050)\". Erowid.org. Jan 30, 2007. erowid.org/exp/29050",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "3 bowls",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>The whole story needs very small amount of history because I believe it may have a large impact on this particular experience.  For approximately 8 months ending 8-10 months prior to this experience  I had taken a number of doses of mushrooms due to it's accesibility.  Doses ranged from .5 grams to once 10.5 grams every 3-14 days. Going against prior belief that mushrooms aren't addictive I had finally found my drug of choice finding myself with a crave very much like that associated with nicotine at times.  I've tripped no more then once since then.  I found myself with visualizations common after mushroom trips on a daily basis when I was tired including apparent red areas like looking into to sun, minor morphings and tracers. They are nothing like a mushroom trip but can be clearly related to mushrooms. After about 3 months these existed only occasionally though generally more then normal.  Up to the point of this experience, from someone who doesn't smoke I was a heavy weed smoker and to someone who does smoke merely one of many.</p><p>The evening started out in a room with two comrades.  I had just purchased the classic but oversized Twun and loaded half of it into a bowl followed by at least a comparable amount on top of that.  One of the most important aspects is the method of intake because I've done a share of smoking even large amounts but this was an unusually upbeat uncluded high.  We smoked through a bong.  After that bowl I loaded the rest of my bag doubled once again by the other friend.  After, we smoked another loaded by my two comrades.  The 3 of us consumed at least 4.5 grams in 7-10 minutes.</p><p>The cannabis had a very quick inset. I left immediately after and caught my leg in the door trying to close it on the way out, but managed to walk out to my car.  I and one of the others set off to my house.  I felt incredibly aware and motivated and managed to make it out of the drive way at which time, I realized I was extremely stoned to the point of being unable to do much of anything.  I slid over and my comrade took my place.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I felt somewhat paranoid because I had no clue what was going on.  It was if I had been placed in a body with all of my memories replaced.  The mindset was something that didn't even compare with an overdose of cubensis.  It was if I was something else.  It seemed to last for nearly a half hour when I became aware of the surroundings around me and realized we'd driven all of a mile down the road.</p><p>The next thing that happened shaped the entire rest of my trip.  I had a thought flash into my head, not a string of words or a picture, merely an idea, a concept.  It was like thinking through something and gradually processing and being aware of the qualities, only instantaneous.  This thing was in my head. Unfortunately I don't know what it was because a second later it was gone and another thought came in, and another, and another, slow at first and gaining speed.  The thoughts began to gain substance, they had an image.</p><p>I realized we'd pulled into my driveway at which time the thoughts mostly subsided and I was consumed with an extreme paranoia, a fear so strong, sweat showed up on my brow.  Like butterflies in your stomach to an extreme.  By the time I'd gotten out of the car it was gone, consumed by the knowledge I had to act as sober as possible walking past my parents to my bedroom.  Inside, fortunately they were asleep, and I made my way to my room. </p><p>I sat down on my couch for no more then a minute before the thoughts popped into my head, only this time each thought was a picture in the back of my head.  I was imagining things one image after another.  They just flashed through my head, fast and unwhole and merely thoughts.  5 minutes passed before my comrade asked me to type his essay while he spoke which had been my mission for the night. </p><p>I sat down and the concept was almost alien to me.  I couldn't spell a word let alone type them.  I struggled to poke through 2 or 3 words before the nausea kicked in.  I knew people who had vomited after smoking but I couldn't imagine it till then.  It was one of the worst feelings.  It was magnified and my confused brain was having a horrible time coping with.  The feeling filled my brain like an infection.</p><p>I sat down and the feeling subsided replaced with the images again.  They came back with a vengeance.  They started to become more then thoughts and began to transfer to my vision.  I imagined them coming in from one side of my vision, becoming recognizable as figure in the center and flashing out the other side, yet at the same time I still knew what was going on behind the visions. </p><p>They got worse by the minute.  The images progressed into full blown hillucinations intermittantaly switching places with my normal vision.  I no more could see behind the images to reality but reality surrounded the images.  Right in the center was where my awareness and focus was strongest for both reality and the images.</p><p>This progressed into one final stage.  Though not flawless, I found that if I didn't look around at anything and focused on a single object, 30% of the time reality would be visible for the most part, but if I moved my head the slightest bit, everything was gone.  I had no reality facing me, merely unexplainable hillucinations.  The hallucinations were like a mess of images confused and random yet strangely in a complete order. It was if a thousand images all on a collage had a thousand seperate possibilities.  In a tiny instant of time, not a single image would change at the same time yet all of them changed.</p><p>Yet, not limited by the slowness of regular vision, nothing blurred together so I could still tell that every full scope of my eyes was a collection of thousands of well defined objects. Every image changed in a set pattern.  The nature of the images was rather strange.  They didn't carry a 2-Dness common in experiences.  Every image was seen with depth as if seen in the past through two eyes.</p><p>This change between the real and unreal carried on for nearly an hour gradually losing strength.  Eventually the flashes of images subsided to a state which had been with me the whole time which was a kind of mellow mushroom high: dialated eyes accompanied by bright everything and a slight pink discoloration, clogged brain, drowsiness and a general happy feeling.  The whole time I felt as if I was experiencing a drastically distorted in some way mushroom trip</p><p>The next 3 days were a blur to me, my brain still feeling incredibly slow from the experience. I lack any memory of these days as does my other comrade who drove me home.</p><p>Ever since, I again have daily mushroom flashbacks only now, they are nothing like past flashbacks having an aspect relating back this particular event and nothing else.  Nothing seems exactly as it should be anymore.  Black is never totally black anymore.   Being stoned is nothing like it use to be either.  Each stone is accompanied by visuals which had been rare in the past: bright colors, vivid imagination when I space off, and a tendency for things to change quite a bit visually in one way or another with enough focus or lack of change in focus.  Being stoned is a much more enveloping thing.  I'm much less able to accomplish anything or focus at all.</p><p>Generally it was a great experience but, take heed, I may not regret changing everyday perception, but you might.</p><p>Psilocybin Psultan</p>",
 "year": "2003",
 "id": "29050",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-30T08:00:00.000Z",
 "views": "15366",
 "dose": {}
}
