{
 "title": "A Large Scale Experiment",
 "author": "Amazing Dr. X",
 "citation": " Amazing Dr. X. \"A Large Scale Experiment: experience with 5-MeO-DiPT (ID 2905)\". Erowid.org. Dec 1, 2001. erowid.org/exp/2905",
 "substance": "5-MeO-DiPT",
 "bodyweight": "",
 "report": "<p>This year at an outdoor festival I took most of my own camp on a journey with 5-MeO-DIPT.  I have used this most remarkable substance on many occasions, and only once have I experienced any ill effects.  In that particular situation, I was forced to sit in a car while crusing around very curvy roads, and found myself carsick for a very painful hour.  Nausea, but no vomiting.  That was on a 10 mg. dose.  (I weigh approximately 110 Kg.)  Motion sickness seems to be an issue with 5-MeO-DIPT, which seems to be a good drug for either sitting or walking, but not a good fit with mechanical locomotion.</p><p>On the evening in question, I mixed 175 mg. (approx) into a container of liquid, producing approximately 25 7 mg. doses.  I then fed it to 23 people in our camp (two particularly hungry individuals received double doses.)  The dose was administered at approximately 9 PM.</p><p>The effects varied *enormously*.  Certain people had very little feeling, while others got a full-on experience.  This may be because the dosage was difficult to regulate - people probably received between 5 mg. - 10 mg. per dose.  I doubt anyone got more than 10 mg, as I was careful to ensure that people drank only a small amount of the liquid.</p><p>Specifically:</p><p>Women seemed, by-and-large, to have more trouble tolerating 5-MeO-DIPT.  This may simply be a function of body weight, but I am not sure this is the entire case.  One woman became nauseous for a few hours, and another - weighing 130 lbs - threw up three times, but still reported that she was having one of the best psychedelic experiences of her life - better than her best LSD experience.</p><p>About 15% of the individuals went into a 'head space', which they reported as rather unsociable and not all that pleasant.  They were over-thinking everything.  As my own experience with 5-MeO-DIPT is that it is not a 'head trip', this was quite remarkable, yet, in a given population, it seems that certain individuals will react in this way.  It could be set-and-setting (though that was pretty much the same for everyone involved) or it could be interactions with an individual's neurochemistry.   This, other than the nausea, is the only caveat that I've encountered with the use of 5-MeO-DIPT.</p><p>By and large, most of the camp had a very satisfying psychedelic experience, with little body load, and I found a number of them very enthusiastically enjoying the 'cozy' feeling that seems to be the hallmark of the 5-MeO-DIPT experience.  One man (who received a double dose of 15 mg.) reported the experience as 'incredibly yummy', as he cuddled with a few chosen friends.</p><p>Another person had her first psychedelic experience that evening, with 5-MeO-DIPT, and, as is the classic hallmark of psychedelic experiences, had great trouble answering basic questions like 'Who are you?' and 'What do you do?' because they seemed entirely irrelevant.  She found the experience invaluable, and will be integrating her insights over the next months.</p><p>At that dosage, the peak lasted approximately 3 hours and return to baseline began after about 5 hours.  Everyone - whether they'd gotten ill or had a great time - was feeling perfectly fine the next day, and I had many more requests for 5-MeO-DIPT!</p><p>- Amazing Dr. X</p>",
 "year": "2000",
 "id": "2905",
 "timestamp": "2001-12-01T08:00:00.000Z",
 "views": "16348",
 "dose": [
  {
   "time": "0",
   "amount": "7.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
