{
 "title": "What Happened?",
 "author": "DK Nera",
 "citation": " DK Nera. \"What Happened?: experience with H.B. Woodrose (ID 29064)\". Erowid.org. Oct 3, 2007. erowid.org/exp/29064",
 "substance": "H.B. Woodrose",
 "bodyweight": "180 lb",
 "report": "<p>I was so excited upon receiving my mail order HBW seeds.  I waited to finish my classes that day to begin ingesting them. I figured that since the trip supposedly lasts from 6-8 hours, I would have enough time to come down and go to sleep and wake up for class the next day. My room was dim and quiet. I decided to start with 6 seeds. I scraped and flamed off the hairs on the coat as best I could. I began chewing them and held them in my mouth for about 10 minutes, then swallowed.</p><p>I didn't feel anything, not even the popularly-claimed nausea. After an hour, I was somewhat disappointed. Since I had read reports of peple taking up to 14 seeds, I came to the conclusion that I simply hadn't eaten enough. So, I ate 4 more seeds. Still nothing; no nausea or hints of a trip coming. About a half an hour later, I was convinced that I still hadn't ingested enough, so I ate 4 more seeds.  Still, nothing. So, another fifteen minutes later, I ate 5 more seeds.</p><p>Well, that's a total of 19 seeds. I didn't feel a thing. I'm really disappointed. Maybe it's just the company I ordered from. But, I believe the trips are definitely possible! Just maybe I did something wrong, or I have a bad source. Good Luck!</p>",
 "year": "2003",
 "id": "29064",
 "gender": "Male",
 "timestamp": "2007-10-03T07:00:00.000Z",
 "views": "3355",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "6 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  {
   "time": " T+ 1:00",
   "amount": "4 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  {
   "time": " T+ 1:30",
   "amount": "4 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  {
   "time": " T+ 1:45",
   "amount": "5 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 ]
}
