{
 "title": "Beyond a Trip",
 "author": "Tony",
 "citation": " Tony. \"Beyond a Trip: experience with Amanitas - A. Muscaria (ID 29067)\". Erowid.org. Dec 14, 2003. erowid.org/exp/29067",
 "substance": "Amanitas - A. Muscaria",
 "bodyweight": "152 lb",
 "report": "<p>Chapter I</p><p>\tI would just lay there and think about anything.  Images of that thing along with some other images kept flashing through my head.  Tom came in and as he spoke to me and I looked at him, Id see flashes of both him and myself right where he stood.  After he left I went back into bed, and kept thinking.  Eventually I tried imagining everything and nothing (certainly not at the same time).  After some time, I was stuck, and all I could think about was everything, I did this to such an extreme and the images were coming at such amazing speeds that actual time had appeared to slow down to a crawl.  And soon enough time would start looping.</p><p>\tLost in thought I let my mind go with all of this.  Suddenly I heard a knock at the door, I knew already what was to come.  I step out into the hallway and no one was there, but I knew Stan had to be nearby.  I was certain he wanted to fuck with my head.  So after I chase him down, I try to explain my situation of being in the state of mind I was in.  I go back to my room, and sure enough he wouldnt leave me alone.</p><p>  Having taken 28 grams of shrooms (meaning 1 oz), I was very susceptible to all sorts of perplexities of the brain.  I should never have clued him into this looping of time I was experiencing.  He stood in my room, repeating certain things purposely and he surely could see I was being tortured by the strain he caused.  I cant remember all that was said between the two of us, but I know at one point I was stating I need God, I felt in someway that would help break up the looping.  It felt like eternities upon  eternities that Stan plagued my room.  I was thrown into the most dreadful of repetitions and duplications of anything and everything.</p><p>\tStan tried jumping on me at some point and at that very moment the repetitions, multiplied right before my eyes.  My vision then doubled, I saw something like a split screen with the mirror image on one side.  Things grew even more chaotic, the doubling was then repeated.  Now I saw four identical happenings of what was going on around me.  All I perceived then grew exponentially until, I couldnt even make out the world around me any more.  Existence was rapped up neatly into a cylindrical disk.  Thoughts were flowing through me quicker than time itself.</p><p>\tI was trying to bend time back to normal, but these were failed attempts.  What I felt, thought, and perceived at this moment is beyond words.  Time no longer existed.</p><p>\tLater, I found myself back in my room, with Stan trying to communicate with me.  I could understand him, but after being away from this dimension for so long, I my native vocabulary.  I could recognize the words he was saying, but I couldnt mimic them.  Little by little I began to speak.  Because of the time shifting, I was unable to say a full word from beginning to end in the right order.  I sat up in my bed.  I was told I should use the bathroom, but I couldnt stand.  All of my matter was being relayed from some place above.  The atoms in my body were being sent back and forth.  This was the reason I couldnt get up.  The particles being sent back to me were infinitely dense.  It started in my left leg, from the tips of my toes.  Stan tried to push me to get me to move, but it hurt moving just my normal body, my dense particles werent moving.  Once the atoms were all transmitted to me I was able to move again.</p><p>\tStanding up was the least of my  troubles.  When time is as unstable as the shifting winds, one can find himself stepping forward and immediately afterwards living that moment several times over in reverse.  My attempts to talk surely reflected that very point.  It was a struggle trying to convey the most simple of sentences.  I was certain that time had shifted and didnt want to budge back to where it belonged.  I interpreted time about two seconds off from where it usually was.</p><p>\tI began to notice that the particles in actuality hadnt finished being transmitted.  As the particles came (at a rate getting infinitesimally small), the world and myself started to synchronize.  Until I was just a fraction of a second off.  The joy I felt at that moment was immense.  As I was leaving, time did continue to run back and forth.  But anyone would rather that over being two seconds away from actuality.</p><p>\tAfter a few more bothersome antics, Stan & co. decide its time to go to bed.</p><p>\tFinally away from the annoyances of meddling company, I climbed into bed once more.  I wondered if Id be able to be at ease once again after all the mental agony, compliments of Stan.</p><p>\tStill shaken by the preceding events, I closed my eyes and let go.  Yet was still in the grasp of everything.  But now I was free from outside interference and I could resolve these irregularities within.  Spiraling through thought, I left our world, almost like those few seconds right before you fall asleep.  However, where I then went was far from sleep.</p><p>Chapter II</p><p>\tI must be dead.  Moments ago, I was pulled through a cosmic array of galaxies, atoms, and energy.  When a man decides to examine himself he never goes this deep.  I saw myself; first removing all connections to the superficial world, then abandoning physical form, and lastly forgetting all preconceived notions of existence.</p><p>\tThere is nothing for me to hide behind.  I am completely disconnected and free.  It is neither intensely negative nor positive.  All I know is that I am surrounded by black.</p><p>\tA few thoughts and memories creep back to me.  But I dont remember dieing.  I run through possible scenarios of my end: maybe I was shot, or killed in some freak accident involving an out-of-control eighteen-wheeler or meteor, maybe I died in my sleep.</p><p>\tThe cylindrical disk or everything is above me, I surely fell off of it.  Theres no way I can ever get back up there so I descend.</p><p>\tWhile drifting downward, I  experience bits and pieces of life again.  But not directly, only potentials in life.  The same instances, with varying outcomes. </p><p>\tMy friends and I are hanging out and I see some girls I am interested in.  My friends and I go over to the girls and talk.  My friends and I invite the girls to sit with us.  I go over to the girls alone.  I sit there with my friends and forget about the girls.</p><p>\tI am going to be born!  I will get to live this life again.  I know that  in birth I would be losing all memory of my past.  But that very past would become my future soon enough.  Bright violet and blue is all around.</p><p>III</p><p>\tNo, Im not going to be born yet.  There is more to death.  I gaze out upon distant solar systems, all positioned as if they were on a grid.  Brilliant gold and orange, they shine.</p><p>\tThese arent solar systems.  I see the cylindrical disks and the masses which lead to rebirth.  They span across the whole of this psuedo-existence.</p><p>This cant be right.  Where would God fit into this?</p><p>\tAs I stumble upon this question I find myself (meaning the simple essence of self) surrounded by nothing.  Not blackness, nothing  (If you close your eyes and look as far to the right as possible, you will notice that there is a certain area where the blackness  gives way to this nothing I speak of).</p><p>\tHere, my faith is challenged.  I know I have seen the cylindrical disks of everything and the path to life once again, but I did not see God.  Do I choose to go with the sure path  to existence, or do I risk consciousness and choose the God I have never seen?</p><p>\tIve considered myself a pretty religious Catholic throughout my life.  But I grow unsure of everything I know while out here amidst nothing.  I am being pulled to the violet and blue once more.</p><p>\tBut I choose God.</p><p>\tI can now see those gold and orange disks while floating out here.  No, those disks are lights from my cell phone and computer.  Im in my bed, Im in my room.  I have arms, I have a body.</p><p>\tI have returned to my world.</p>",
 "year": "2003",
 "id": "29067",
 "gender": "Male",
 "timestamp": "2003-12-14T08:00:00.000Z",
 "views": "13594",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "28 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  }
 ]
}
