{
 "title": "A Euphoric Walk on the Beach",
 "author": "Jcat",
 "citation": " Jcat. \"A Euphoric Walk on the Beach: experience with Mushrooms & Cannabis (ID 29078)\". Erowid.org. Jan 30, 2007. erowid.org/exp/29078",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "165 lb",
 "report": "<p>Well what can I say....</p><p>I was on vacation for fall break, relaxing in beautiful San Destin.  I had reserved an ounce of some delicious(but overpriced) cannabis I always purchase for special occasions.  You know, the green and orange frosted nugs.  Anyways, I had also purchased a quarter of shrooms.  This would be the first time I had tripped shrooms.  I had tripped lsd on one occasion but as for tripping that was it.  However, I'm a daily smoker.</p><p>I was with two of my good friends the night I ate the shrooms.  I was skeptical of eating a quarter so I measured out 5 grams instead.  One of my friends ate the same amount of shrooms and smoked herb with me.  Luckily he had his own herb to smoke on so I wasn't unnerved with having to pass my spliffs.</p><p>We ate the shrooms around 6:30 pm, nearing darkness.  We were all 3 sitting in our condo living room, balcony open with a fantastic view of the beach, smell of the ocean, breeze strong.  It was pure relaxation.  I felt very confident that I would enjoy my trip being in a very temperate florida climate with the beach within footsteps.</p><p>Wow.  The trip really started kicking in around 7:15.  I felt a little shakey and sweaty but I knew the feeling all too well from my last lsd experience.  Surprisingly, the uneasiness went away within minutes.  I'm assuming this is the difference between the organic trip and the synthetic trip at this point.</p><p>I felt very close to my two friends and their words began to hold more meaning to me.  With every hit I took from my spliff I felt the rush of thc in my bloodstream.  I closed my eyes and imagined the chemicals travelling in my veins.  It seemed that I could imagine anything I wanted to and I could live it inside my thoughts. </p><p>Holy shit.  We are walking out to the beach.  The cool breeze feels like it's cleansing every pore on my body.  As we approach the beach I stared out in the ocean.  It looked like a black abyss, territory that I wouldn't dare venture to.  Once I got my feet sandy I put on some of my favorite music and chilled the fuck out as I walked down the shore.</p><p>I lit up a spliff and slowly crept down the shore lost in the patterns the water made in the sand when the tide splashed up on the shore.  I felt synchronized with time and with everything around me.  The large buildings away from shore by the condo looked like giant glowing sculptures, being that some windows on the side were lit up and some were dark.  Needless to say, the buildings looked extremely trippy.  I thought to myself 'These shrooms grow on the earth naturally and when they are eaten one can see such beauty and feel such euphoria as I am.'  I realize it is an extremely simple and a not very exciting thought, but it comforted me at the time and made me feel connected with this world.</p><p>My heart almost stopped when I saw a group of sea gulls flying low to the water right beside me.  Their eyes glowed green and they glided so smoothly close to the surface.  It was truly a visual and mental spectacle that I'll remember and relate to forever.</p><p>After the beach the trip was slowing down and I enjoyed the rest of it with more spliffs to eventually put me to sleep.</p>",
 "year": "2003",
 "id": "29078",
 "gender": "Male",
 "timestamp": "2007-01-30T08:00:00.000Z",
 "views": "2945",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": "8 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
