{
 "id": 2909,
 "title": "Empathy and Art",
 "date": {
  "submission": "2005-09-26T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Mush Mouth",
  "gender": "Male",
  "weight": "225 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 ",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  },
  {
   "time": "3:00",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": ""
  },
  {
   "time": "3:00",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "I had the opportunity and blessing to shroom for the second time ever a week before my AP English class went to Pasadena to visit the Norton Simon Museum.  I saved a few choice shrooms from that experience (one huge cap, one regular cap and about 2-3 medium-sized stems) for my upcoming field trip. It was one of the best shroom decisions of my life.  Also, about 10 of my classmates and I had pitched in on an oz. of bomb Berkeley bud to make 20 powerful cookies, and another friend and I brought tablets of high-content Dexedrine.  It was to be a very educational field-trip.",
  "I ate my two cookies first (approx. 2g cannabis), at a rest-stop an hour away from the museum.  It didnt produce a very powerful effect right away and for about an hour and a half I thought that I had gotten screwed out of $20 bucks.  However, I almost lost my balance and fell over in the museum when the cookies finally began to hit.  I ate the Dexedrine and chased with the mushrooms about an hour-and-a-half later in the bathroom of the restaurant where we went to eat during our lunch break.  I was the only one of my friends with mushrooms because their stupid asses didnt have the patience to wait seven days to eat their left-over mushrooms at a decent place. ",
  "Shortly thereafter, I watched the world start to change and my mind slowly start to be jerked out of its rut of normal existence that we humans are so used to and bored with.  I got enveloped in a conversation that my friends were having, an elaborate discussion on a theoretical society of hammocks.  We walked back to the museum for free time which was great because I didnt have the patience or sanity to stand idly by and listen to a museum tour guide blab on about useless bullshit. I wanted to explore. ",
  "The Dexedrine and mushrooms were doing wonders to my body.  I drifted through the museum on a euphoric cloud, somehow constraining moans of ecstasy as I made my way downstairs to the Eastern Art area.  This combination was awesome. ",
  "I had to maintain as there were fellow students, teachers, and most importantly my girlfriend who wouldnt be happy with me on mushrooms.  I was anything but paranoid or worried.  The Norton Simon Museum boasts one of, if not the best, collection of East-Indian art in the United States, set downstairs in moody stone rooms.  I could feel the calming, blissful aura of the thousand-year pieces of art surrounding me.  I desperately wanted to sit down, meditate, or just curl in a ball on the ground and soak up the aura of the place for the rest of my life.  I stared closely and intently at stone and bronze statues from China and India, long dead culture carved by long dead hands. ",
  "The shrooms werent very visual but they were twisting my mind in what would normally be chaotic fashion.  I was calm and centered however, grounded by the cool clean earthy Eastern display and all of my new friends staring back at me with their reassuring stone smiles.  I thought much about Hindu and Buddhist symbolism, and the shared aspects of all earthly religions.  Why cant we ever look past differences and notice the similarities?  Why cant we understand each other as human beings, and not just occupants of man made countries separated by man made borders?  I made my way up to the rest of the museum and caught up with a few friends.  Together we explored Renaissance and 17th century art.  There was one painting in every room that seemed to particularly grab and move me but it wasnt until I saw Van Goghs Painting of a Mulberry Tree that I was absolutely dumbfounded by an artists beauty and genius.  I stared at that painting for at least twenty minutes, finally dragged away from it right before we had to leave.  Its meaning went beyond words. ",
  "I was in total empathy and accord with the painting and artist.  I felt Van Goghs presence around his obsession, his pursuit of beauty so tremendous that it hurt.  I was there with him as he covered the canvas in thick thick paint and then furiously manipulated the impossible splash of color intoart.  His painting struck me the most because I could feel Van Goghs total obsession, his complete devotion to the act of creation and I wished more than anything, anything at all in the universe, that I could be Van Gogh and experience total obsession and the addicting act of creation that accompanied it.  The painting was so amazing that it was almost too much for me.  I could conceive of my mind snapping if I really tried to digest it in its totalness. ",
  "Personally, I thought the Dexedrine/mush combo was great, especially for the ridiculous body high.  The art was simply amazing, and Im glad I had my fungi friends with me as they enhanced the field trip into a life-changing experience.  Never had I connected with art in such a manner, nor did I even think it was possible before then.  It reaffirmed my commitment to a life goal of exploring art throughout the world, not just in the form of statues and paintings.  Once again, the mushrooms taught me to look to take a different look at life, to find, learn and practice the proper art of existence."
 ],
 "erowid": {
  "id": "19543",
  "citation": " Mush Mouth. \"Empathy and Art: experience with Mushrooms, Cannabis & Amphetamines (Dexedrine) (ID 19543)\". Erowid.org. Sep 26, 2005. erowid.org/exp/19543",
  "substance": "Mushrooms, Cannabis & Amphetamines (Dexedrine)",
  "views": "7201"
 }
}
