{
 "title": "The Truth",
 "author": "1177.0001",
 "citation": " 1177.0001. \"The Truth: experience with Dimenhydrinate (ID 29105)\". Erowid.org. Jan 30, 2007. erowid.org/exp/29105",
 "substance": "Dimenhydrinate",
 "bodyweight": "190 lb",
 "report": "<p>I'd like to share my experience with the drug Dramamine and how it affected my life in ways you can't believe that would happen.  When I got into drugs, I had tonnes of anxiety with pot, and for other reasons that won't be listed here, I didn't want to use it anymore.</p><p>I had found a bottle of Nytol (Diphenhydramine HCL) in my house one day while searching around for shit to get stoned on.  I was a bored/depressed person, and I used drugs to escape.  I didn't care what it was, as long as it made the problems of my life seem out of sight.</p><p>I looked up Diphenhydramine, found out it was called Dramamine.  I read a whole pile of trip reports, and I was eager to give it a shot.  So I gave it a shot.</p><p>Unlike most people who try this substance, I fell totally in love with it.  I was so fucked out of my mind.  Branches on the trees moved, my body got pleasurable sensations, I had bizarre hallucinations of trees turning into people, gravity distorted, surfaces rippling and melting, percieving objects differently, voices and I could write extremely 'creativily'.  I was seeing things that weren't there, like people in the window.</p><p>I didn't find out the shitty effects of Dramamine use until later.  I feel in total love with Dramamine.  I wrote and said some severely bizarre shit, the trips were cheap, easily accessible, pure substance, no one else used around here (I wanted to be unique), and it was a heavy/intense/interesting trip.</p><p>All in all, I've used Dramamine about 20 times.  I used it 20 times in under a year.  I am well aware of its effects during and after the trip.</p><p>This is how Dramamine affected me:</p><p>ONSET: 30 minutes</p><p>TRIP LENGTH: 12 to 16 hours</p><p>  (After 6-8 hours I'd be so tired I'd crawl into bed and black out)</p><p># of DAYS OF AFTEREFFECTS: approximately 2</p><p>EFFECTS:</p><p>-- gravity distortion</p><p>-- urge to urinate a lot</p><p>-- pleasureable opiate/opioid buzzes at points</p><p>-- deleriousness</p><p>-- severe memory loss of the trip</p><p>-- dilated pupils</p><p>-- flushed, white skin</p><p>-- hallucinations</p><p>-- slurred speech with misplaced words (ex: man = forest)</p><p>-- difficulty burping which means respiratory depression</p><p>I'd wake up after the blackout coma-like sleep and stuff would still be moving.  I'd be dead tired for the next two days.  I'd also be highly irritable.  I felt like shit.  Of course, I didn't realize it.</p><p>I started using Dramamine whenever I could.  Which was every 2 to 3 days.  I didn't use a low dose either, I was into the 400mg to 600mg range.</p><p>One day, while feeling like shit, my brother boomed his subwoofer too loud.  I banged on the wall to get him to turn it down, he banged back like the jerk he was, and then he started shouting insults at me.  I lost control at that point.  In fact, I bet if I hadn't been using Dramamine I wouldn't have experienced what followed.</p><p>I pulled out a golf club, and in an effort to keep control, I smashed holes in the walls.  Dramamine had added to my irritability and depression so much that I lost control, gave into rage and wrecked myself.  There were several large sized holes in the walls.  Then my Uncle came home.  I'm not going to go into the gory details.  I got kicked out of my home.  I spent six months living on the streets and sleeping in homeless shelters.</p><p>In that time I got used to picking cigarette butts up off the ground, and rolling them myself.  I got used to seeing drunks pee near me.  The staff at the Salvation Army were total dicks.  The meals really blew.  The nastiest food you've ever eaten is Sally Anne fish.  In fact, it was so gross I didn't eat it.  I went hungry.  I was angry at the world, and blamed everyone/anything else for my problems, and kept thinking my uncle was going to come down and save me.</p><p>One day it clicked into my head that I was going no where.  Drugs were 'cool' right?  Drugs wrecked my life.  I took the time to talk to all the addicts, decrepid prostitutes I wouldn't pay to fuck even if I was able to wear a condom, crack whores with lazy eyes, life-time bums, coke/crack addicts, morphine users, insane people, and schizophrenics that were off their medication.  The list goes on, in short, I talked to 'society's finest'.</p><p>After four months of being on the streets, I decided to take responsibility for my life and it's past and it's future.  I started back into pot after a long time.  I liked pot now.  I smoked 5 to 9 joints a day.  I took care of my business.</p><p>I did all I had to do immediately, and smoked a lot of joints afterwards.  I used no other drugs during this period except for a bit of booze.  I searched for a place, made phone calls, arranged appointments with welfare, kept my appointments and did what I had to do.</p><p>On Sept 21, 2003 I moved into a room.  Here I am.  I'm enrolling in highschool again, I've got a job at Burger King, I've been off drugs for over a month, and I quit smoking cigarettes cold turkey almost 4 weeks ago.  I may not like the people I'm living with, but it is a start.  I'm going up in life, and that's all that matters.</p><p>I'm not going to tell you not to use drugs. I'm going to state this:</p><p>-- Go to school, and do your work, and don't come in stoned.</p><p>-- Go to work, do a good job and feel proud.  Don't come to work stoned.</p><p>-- Don't let the important things such as Family & Friends in life slip away for the illusions produced my drugs.  Don't ever be intoxicated when they need you.</p><p>Dramamine (like all other drugs) can destroy lives.  Look where my use ended me up.  But, I learned my lesson and I'm doing well now.  I'm going up in life.  For once I'm cool because of who I am.  People respect me now.  EVERYONE respects me, except druggies who believe drugs are the way to be.  Drugs don't make you cool, drugs ain't cool.  Drugs are interesting, but not cool.</p><p>I'm happy to have food, water and shelter now.  What's the need to escape from reality?  Drugs may put my problems out of sight, but they always come back to haunt me, and they come back bigger.</p><p>I have leanred to solve problems, cope, feel proud, appreciate what is around me, listen to positive music, discard negative thinking, be willing to let things go, lay back, and just chill out(but not smoke weed).  Life ain't nearly as rough as I thought it was.</p><p>I'm never touching Dramamine again.</p>",
 "year": "",
 "id": "29105",
 "timestamp": "2007-01-30T08:00:00.000Z",
 "views": "17763",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ]
}
