{
 "title": "Cyber-mind Meld",
 "author": "InsanityEchoes",
 "citation": " InsanityEchoes. \"Cyber-mind Meld: experience with DXM (ID 2911)\". Erowid.org. Mar 1, 2001. erowid.org/exp/2911",
 "substance": "DXM",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "1062 mg",
   "oral",
   "DXM"
  ]
 ],
 "report": "<p>This was my first time going beyond 2p (the second plateau), which I`d done many many times before. I wanted to see some of the hallucinations that were reported with 3p DXM use.</p><p>I can`t remember alot of what happend before the peak.. but somehow I had come into a weird 'mind-meld' with my computer and I couldn`t leave. I didn`t know who I was, I thought I had died and I had joined with god (my computer) or something. It was very weird. I typed everything I spoke automatically like it was second nature (I can`t type that good usually). As I came down I started to remember that I was a human being and my computer was not god and that I wasn`t dead.</p><p>After that (very scary) episode I spent the rest of the time exploring my room and the hall and everything. My house had an unearthly feel to it, everything looked like a cartoon, full of crayoned color walls and stuff. I looked at some picture books of the Pacific NorthWest and watched people walking around in the cities and stuff (not tripping *as* hard at least).</p><p>Finally I got tired and decided to go to bed. I think all that suger from the cough syrup kicked in and I had this huge rush. I was very restless and I don`t think I ever went to sleep until about 3am.</p><p>All and all, this was intersting.. but I don`t think I`d ever want to do it again. Losing identity seems to be common with lots of hallucinagins and people take it lightly, but now that I`ve actually experienced it I have a much deeper respect and it isn`t something I considered fun.</p>",
 "year": "2000",
 "id": "2911",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-03-01T08:00:00.000Z",
 "views": "9693",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1062 mg",
   "administration": "oral",
   "substance": "DXM"
  }
 ]
}
