{
 "id": 2911,
 "title": "Surprising",
 "date": {
  "submission": "2002-12-11T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Twirl",
  "gender": "Male",
  "weight": "60 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT"
  }
 ],
 "report": [
  "At about 6 pm, I arrived at an apartment occupied by a couple of my friends, after which i almost immediately swallowed a capsule containing 20mg of 5-meo-dipt. After a while i began to experience what could be described as a kind of motion sickness. At this point i asked my friend to play '1983' by Jimi Hendrix. After about five minutes of listening the music sounded so alien that i had to ask for something a bit more pacific. When i did, i noticed that my own voice seemed to have been pitched down for about an octave's worth.  This made me focus more on my surroundings, and i could see that some visuals were on their way.",
  "I had a glass of water and talked about my observations with someone. I don't remember anything about the conversation, but i do remember being overwhelmed by intense CEV:s before i had even finished my drink. When i reached to place the glass on a table, the surface seemed to escape my shivering hand for an alarmingly long time. After that, everything seemed to be shifting and crawling, which even made walking an effort due to loss of balance.",
  "After i had paid some attention to the quite beautiful and intense fractal-esque visuals of both closed and open-eyed kinds (something i wasn't prepared for), i lied down on a sofa and had a calming moment of meditation. When i opened my eyes, i noticed that a house plant on a shelf was dancing, as if it was being moved by a strong gust. The vision was refreshed about two times in a second.A group of empty bottles on a table now looked like a single breathing entity that had an animated jewel texture. Objects on the shelves disappered into translucency, one at a time, and when they did, i could see the wall behind them quite clearly.",
  "The text from a back of a book became unreadable, because the letters flew out of the book and changed place. At that time, i had learned to enjoy the experience. The time, i think, was something between 8 and 10pm. After i had peaked, someone turned on the tv. A documentary about the deserts of africa, i remember, was on. I still had too much visuals to actually catch anything but flowing sand on the small screen, but everything was multiplied so that i could see dunes with a herd of elephants all over the apartment. After that we mostly chilled out, and at half past mindnight, i found that all the effects were gone.",
  "The trip didn't really resemble any other 5-m-d experiences i had read about. There were quite few auditory disturbances, but the visuals were remarkably vivid. Sexual stimulation or noticable tactile sensations never took place, perhaps because i had too much other things to pay attention to. As a psychedelic, the substance is quite a charade. I had visions of the structure of mind, but the mystical quality i've noticed with other tryptamines wasn't there. I think i was a bit too tricked by sensory input. I think i'll try it again, now that i've learned to deal with this particular substance."
 ],
 "erowid": {
  "id": "19561",
  "citation": " Twirl. \"Surprising: experience with 5-MeO-DiPT (ID 19561)\". Erowid.org. Dec 11, 2002. erowid.org/exp/19561",
  "substance": "5-MeO-DiPT",
  "views": "7190"
 }
}
