{
 "title": "Handle Your High",
 "author": "kira",
 "citation": " kira. \"Handle Your High: experience with Cannabis (ID 29141)\". Erowid.org. Dec 11, 2003. erowid.org/exp/29141",
 "substance": "Cannabis",
 "bodyweight": "95 lb",
 "report": "<p>I have smoked pot occasionally (once or twice a month) for 3 years or so.  Most of the times I just am in my own world, my body feels numb and I kind of ignore everyone around me.  That was until a few weeks ago. My boyfriend and I had a gram and decided to smoke a little before we ventured off for the night. Around 8pm he rolled a joint and we proceeded to smoke in my car.  After a few minutes my foot felt light and tingly on the gas petal. We listened to music and talked for a few minutes until I realized that something was different.  I shut up and my body tensed up, only I didnt really notice it until my boyfriend put his hand on my leg.  I felt withdrawn and struggled to regain some sense of sobriety.  I couldnt remember anything that had happened in the last minute and kept trying to make sense of why I was driving to chuck e. Cheese.  I became annoyed when we met up with some other friends and wanted to just watch everything from the safety of my car. </p><p>We ended up driving through some fast food place and I ordered even though I wasnt hungry. I remember chewing in a very exaggerated manner because I couldnt feel my tongue and thought that I might bite it off and swallow it along with my food. I kept flicking it on the roof of my mouth to make sure it was still there.</p><p>After a while my boyfriend started to sober up I guess, but I was in this very strange state of being.  I would touch something with my hand, but in my mind, it was really my boyfriend's hand and I was feeling it THROUGH his hand. I kept telling him strange shit like 'I feel my body through you.' I mentioned that my hand was asleep and that I was holding my hands together, when in reality I kept changing the heater in the car. It was then that a friend called and met us in the parking lot.  I guess my boyfriend had given up on my ability to function around others, so the three of us, me, my boyfriend and our other friend drove to yet, ANOTHER fast food place.  I was in the passenger seat of our friend's car when all of a sudden his hands started looking funky, like puppet hands.</p><p>This is where I need to provide some information about a past experience.  About 2 years ago my friend had a party and I got drunk then smoked massive amounts of pot.  I then flipped out and started believing that my hands had turned into 'bird claws'.  Over the next 36 hours my friend had to keep me at her house, convincing me that my hands were fine and that I wouldn't be high for the rest of my life, like I believed. Anyway, back to the puppet hands.  I kept telling him that his hands looked like bert and ernies fron sesame street, that he had orange hands and there were only 4 fingers.</p><p>To make a long story short, by 2 am I was still fucked up, alternating between moments of complete silence and then moments of uncontrollable laughter and yelling.  I was in my own universe, unaware of the people next to me, still believing one of my hands was numb and I could feel things through other people's hands.</p><p>I ended up going home and sleeping very well. The next day I felt weird, like I had lost my soul or something. Like I could watch someone die and not really care. Apathetic. No sense of right or wrong.  Maybe I am allergic to pot, maybe I shouldn't be smoking the shit because it affects me so differently than it seems to affect others.  Maybe it was laced, or maybe I can't handle the high.</p>",
 "year": "2003",
 "id": "29141",
 "gender": "Female",
 "timestamp": "2003-12-11T08:00:00.000Z",
 "views": "8874",
 "dose": [
  {
   "time": "0",
   "amount": "0.3 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
