{
 "title": "The Spanish Conquistador",
 "author": "Jason",
 "citation": " Jason. \"The Spanish Conquistador: experience with Mushrooms (ID 29160)\". Erowid.org. Jan 5, 2004. erowid.org/exp/29160",
 "substance": "Mushrooms",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "1 ",
  "oral",
  "Mushrooms",
  "(cookie / food)"
 ],
 "report": "<p>Before I begin, I should say that up until I tried Magic Mushrooms, I had absolutely no psychedelic drug experience aside from marijuana (which I have an amazingly low tolerance for).  I had been smoking for approximately 2 years before deciding to try mushrooms.</p><p>The mushrooms I acquired were ground up and baked inside of chocolate 'pyramids' that weighed between 15 and 20 grams each.  It irritated me that I had no way of telling exactly how many grams of dried mushrooms I was eating, but I estimated that it ranged from 2 grams minimum and 5 grams at the most.  The pyramids were wrapped in wax paper, then wrapped in colored foil, and cost $25 each.  My dealer told me that one chocolate would 'definitely' be enough for one person, maybe even two.</p><p>I should convey, before I begin, about the importance of environment.  You will see as you read through my first experience, the significance that the environment had on my state of mind during the trip, probably having the power to change the trip from wonderful to potentially train wrecking.</p><p>When I first ate a chocolate, I was with my girlfriend, in my bedroom, getting ready to go to sleep.  This is probably my most comfortable atmosphere, and I was very excited about taking my first trip.  Based on my research, I expected very little, knowing that each trip is different.  I DID NOT expect to 'see things' or 'trip out,' thinking that this could ruin my mood.  I ate 1/3 of the chocolate, not wanting to over-do it on my first try.  After about 30 minutes I felt nothing, but my pupils were very dilated.  I ate the remaining 2/3 of the chocolate piece, trusting that I could handle whatever happened because my girlfriend would be right next to me for the entire night.</p><p>Still not feeling anything, I decided to lie down and turn the lights off.  The first thing I noticed was that my night vision was amazingly clear (dilated pupils). I was standing near the light switch when I became slightly dizzy (much like the head rush of a shot of liquor) and decided to lie down.  Within two minutes of lying down, I realized that the shrooms were taking effect and I felt like a force I have never felt before would soon overwhelm me.  I was getting head rush after head rush (like I was about to pass out) as I tried to stay focused on the glow-in-the-dark stars stuck to the ceiling of my room.</p><p>This is when I really started tripping.  The first major change in my perception was the sound.  The only sound in the room was the whir of the ceiling fan.  The sound coming from the fan seemed to be getting louder and louder, and within seconds seemed like it was coming from a loudspeaker positioned right next to my ear.  The sound was so loud it was almost overwhelming.  I started to giggle uncontrollably as I realized how amazing it was that a piece of chocolate was doing this to me.  The sound was still overwhelming my brain, and I couldnt find the consciousness to focus on anything else.  The sound seemed to morph and soon, it resembled a waterfall.  I closed my eyes and tried to turn down the volume of this raging waterfall, but it was no use.  For a second I panicked, wondering if my sense of hearing would be stuck like this forever, but I soon forgot what I was even panicking for.  The mushrooms seemed to be pulling my brain from thought to thought, not allowing me to concentrate on any one perception or idea.  This is about the time the visual hallucinations started.</p><p>Throughout my auditory hallucinations, the visuals slowly crept up on me.  They started out very mild, fleeting tracers coming from the green glow of the sticky starts.  The tracers were enough alone for me to step back, stop giggling, and analyze the situation I was in.  There was so much information being sent to my brain from my senses that I was literally overwhelmed!  Every color or object I saw, every sound I heard, everything seemed to be echoing in my mind, I kept thinking over and over and over that I would never make it out of this wild state of perception but I would just giggle and dismiss it because I would have already forgotten what I was even worried about.  The best way to describe it is to say I was stuck in a loop of thought.  I could watch myself thinking over and over about my sense of perception and forgetting over and over about the same thing; it was so funny I couldnt help but giggle out loud.</p><p>Somehow, I finally stopped this crazy train of thought and focused on what I had been looking at the entire time (I almost forgot that I was even conscious); the glowing stars on the ceiling.  I saw (what I thought was) the most amazing thing:  the stars started swirling, right before my eyes!  This was my first true visual hallucination, and soon the stars (and the rest of my room, including me) were spinning at a high speed.  When I closed my eyes and re-opened them, the spinning would start over, slowly at first, and working its way up to top-speed.  The fact that I could control this hallucination fascinated me to the point where I did not stop for almost 45 minutes straight.  I decided to take a rest from my spinning, and looked at my entertainment center, trying to see how much time had just passed (it felt like 4  5 minutes).  As I looked at the furniture and T.V. the shadows seemed to grow.  Now, I was watching the shadows and knew that they werent actually moving, but my mind believed that they were growing and becoming taller (either that or I was shrinking).  The mere fact that my mind was contradicting the very things I was seeing baffled me, and almost sent me into another loop of thought, so I quickly looked away.</p><p>I could hardly bear to look at anything anymore because the complexity of discerning whether or not I was seeing what I thought I saw overwhelmed me again (although it sounds scary, the overwhelming-ness was a very good feeling).  There was just so much raw information flooding my brains sensory receptors (or so it seemed) that I had to bury my face in the comforter and stare into the darkness it provided to retain my sanity.</p><p>This was the first time I consciously realized that I was having closed-eye visuals.  I was probably having them before this point (which was only 90-100 minutes into the trip), but I still dont really recall what happened when my eyes were closed.  These CEV were blue and green lightning bolts (or something similar) and they seemed to criss-cross over and over, creating an infinite pattern of continually striking lightening bolts.</p><p>I opened my eyes again and saw my first true hallucination.  Out of the green leaf-patterned comforter, came a Spanish Conquistadors humorous face.  The faces colors were morphing from the green leaf texture to a wood grain pattern and then back again.  The face had a big smile hidden underneath a thick mustache and was wearing a Robin Hood style had with a bright orange feather sticking out.  The face slowly advanced toward my own and was soon only inches away.  The face still came nearer and seemed to be less than 1 millimeter away.  I thought I felt something touch my nose, and then darkness.  I blacked out and to this day cannot remember what happened next, although I have a feeling that I was not unconscious for the rest of the night.</p><p>I woke up the next morning feeling groggy and had a slight headache.  My back seemed to hurt near the bottom of my spine.  This may have been from sleeping, but friends who have eaten the same shrooms have complained about similar pain.</p>",
 "year": "2003",
 "id": "29160",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-01-05T08:00:00.000Z",
 "views": "8609",
 "dose": {}
}
