{
 "title": "Unexpected Paradigm",
 "author": "Adam",
 "citation": " Adam. \"Unexpected Paradigm: experience with Ayahuasca (Syrian Rue & Mimosa hostilis) (ID 29162)\". Erowid.org. Dec 23, 2003. erowid.org/exp/29162",
 "substance": "Ayahuasca (Syrian Rue & Mimosa hostilis)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Syrian Rue",
   "",
   " T+ 0:30",
   "1.0 g",
   "oral",
   "Syrian Rue",
   "",
   " T+ 0:35",
   "13 g",
   "oral",
   "Mimosa tenuiflora",
   "(tea)",
   " T+ 3:35",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>This was my first experience with using ayahuasca. I must say it was a very unique twist of events surrounding my trip. I ingested 2 grams of the syrian rue at first. A half an hour later i ate another gram. Five minutes later i drank the mimosa tea. Roughly an hour later i experienced the wonderful effects of the drug. The dissapointing fact was that i didnt dose high enough and came down exceptionally fast. Roughly 3 hours after drinking the mimosa i smoked some dope and i became very tired and hungry. At roughly 3:30 a.m. i went for a trip to crave my hunger. I bought a bag of pepperoni pizza rolls. After starting to eat them, my cousin stated tht he read that you are not supposed to eat pork products while on an maoi because of a chemical called tyramine. I was so hungry that i disregarded this and continued to eat them.</p><p>Half way through my food i started to get a very wierd feeling in my stomach. Roughly 5 minutes after, I was propelled into the biggest trip i have ever experienced. Based off of my mushroom experiences, it was in my mind 20 times stronger. I was tripping so hard that it reminded me of the anesthetics you would get from the hospital before surgery. It was quite scary at first because i didn't expect to start tripping so hard. My senses were very vivid while watching t.v. My visual patterns would freeze for roughly 10 seconds at a time before gaining a new visual pattern. It felt as though a hundred hands were running all over my body. I was watching southpark because that is was happened to be on the t.v. at the time. Everyones faces were squaring off with very vivid geometric patterns. I thought that i was going to black out at first.</p><p>I eventually got used to it and enjoyed it very much. It was the greatest paradigm shift i have ever had. I'm not sure of the health risks of pork products and the ayahuasca but it was very odd that just by eating, i was propelled into a very intense trip. As of now, i would not reccommend anyone doing this because I have never heard of such a thing happening. I just wanted everyone to gain knowledge about my experience with dmt.</p><p>             Adam</p>",
 "year": "2003",
 "id": "29162",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-23T08:00:00.000Z",
 "views": "8198"
}
