{
 "title": "Decaying Laws of the Universe",
 "author": "Aced",
 "citation": " Aced. \"Decaying Laws of the Universe: experience with Mushrooms - P. cubensis (ID 29178)\". Erowid.org. Jun 10, 2007. erowid.org/exp/29178",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "40 caps",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)"
  ]
 ],
 "report": "</p>[Erowid Note: The size and weight of mushrooms, even within species, can vary widely.  However, given the average size of P. cubensis mushrooms this likely an extremely high dose, see mushroom Dose Chart]</p><p>I am a rather experienced person when it comes to psychoactives. A few that I have experience are mushrooms, LSD, brugmansia, salvia, foxy, DXM, and 5-MeO-DMT, starting at or around the age of 16. I have had introspective trips, bad trips, out-of-body experiences, blackouts, and just about every trip you can imagine, none of which had ever brought me to a level that I felt was 'too much,' until the fall of 2002.</p><p>It was the last night before the beginning of the fall semester, and a friend, G, and I decided to go shrooming. We went to our normal goldmine in central Louisiana, and to our surprise we found more than usual. I mean, wherever you looked, they were there. When we got to about 80 we decided to head back. On the way back to the car we found about 20 or so more, so we left with about 100 total.</p><p>Getting back to the apartment, we performed our usual ritual. We boiled a quarter-full pot of water and chopped the shrooms up as small as we could get them. We realized that the pile looked extremely larger than normal, so we decided to only cut up 80, and if we later felt necessary, take the other 20. This would soon prove to be a good decision. After letting the shrooms boil for about 30 minutes, we screened the chunks out and poured half the liquid into 2 glasses. We noticed that the liquid was alot thicker than normal. We filled the glasses the rest of the way with powerade, which we have found completely eliminates the disgusting taste of the shrooms.</p><p>t-0:00 We down the juice in one large gulp. We notice that there is a foul taste in the powerade.</p><p>t-0:20 I begin to get slightly nauseated. G suggests I go outside and get some fresh air because if I puke I will lose some of the substance, and we like to be on the same level while tripping.</p><p>t-0:25 G joins me outside to smoke a cigarette. I am feeling much better, and I notice that the moon is extremely close to the earth, almost like I could reach out and palm it. We are both speeding pretty hard.</p><p>t-0:35 Tripping balls like no other. I mean, never before has anything but 5meo hit us so incredibly fast and hard. The most insane visual and auditory hallucinations were scrambling through our brains. Laughing hysterically in delight, one of us (not sure who) decided we should go inside before we cause a scene.</p><p>t-0:45 The trip is still increasing at an exponential rate. Nothing negative at all about it, the rise to this day is still the most incredible thing I have ever experienced. We had tripped off of shrooms from the same field at least 20 times, and never before had it been so euphoric.</p><p>t-1:00 I dont remember what was on the TV, but G turned it off while I was watching it, and it was almost like I was pulled into the screen as it turned off.  I felt this sensation throughout my entire being. I told him to turn it back on and I felt the same exact thing except in the opposite direction. At the instant it was turned on G lets out the loudest scream I have ever heard. The mere fact that it was so abrupt startled me. I look at him and he is engulfed, staring at the TV set. I dont think twice about it. This would serve to be a foreshadow of what was to come.</p><p>t-1:20 Trip intensity is still growing. Things have quieted down over the last 20 minutes since that scream. We are both laying down on the sofas staring up at the ceiling. Beautiful octual stimulation. Lines of spectral electricity flowing in 3-dimensional lines across the ceiling. They would soon be all around me. There was one point when I forgot that I was laying down on my back, forgot I was inside, forgot I was I, Forgot that the visions I was seeing were being seen by my eyes or that my eyes even existed. It was truly remarkable. I went in and out of space and the universe totally engulfed and awed at what I was experiencing.</p><p>t-1:?? G shakes me and like being slapped in the face with a 2by4 I snap back into reality. 'Dude I think we took too much this time man. I just shitted out my insides all over the bathroom man. I think we should call someone.' I slowly realized that he was not at all joking by the terrified expression he has on his face, which in turn began to scare me. I have always been one to bring myself to a reasonable level even in ultra-trip scenarios when needed, so I brought myself together as much as possible and got up to look in the bathroom. When I stood up the realization that gravity and other laws of the universe still existed sent an unbelievable sensation through my bones, it was ultimate euphoria. I walk with G to the bathroom and open the door.</p><p>'Dude, there is nothing all over the bathroom. You are just tripping your head off.'</p><p>'Holy shit man IM GONNA DIE.' I spend the next 5 or so minutes calming him down, or trying to at least. I had never seen G cry, but I saw tears building up in his eyes and I knew that he was serious about what he was saying. I myself at this point and having a very hard time keeping control of the situation since I too am tripping harder than I ever have before. And to make things worse, the trip hasnt even come close to peaking. I begin to utter over and over that 'We are tripping, it will fade bro just enjoy it while you can, nothing is going to happen.'</p><p>The whole situation kinda brought my mindset into a darker realm, and everything seemed quiet and cold. The visuals began to have a gothic theme to them. I felt as though there were millions of eyes staring at me from every point in space. G decided to sit down on the sofa and try to gather himself, so I went outside for a walk to try to make everything a little more on the bright side. This did help. I remember sitting on a curb watching a cat walk by a car. I got up to chase it for whatever reason was going through my head. All of a sudden I hear my name being screamed from the apartment. I look up and call to G who seems surprised to see me running after a cat. 'MAN WHAT THE HELL DID YOU GO IN THE LAKE FOR???' I told him I wasnt even near the lake. He said he heard me jump in the lake and was scared I was trying to kill myself. There are ducks that live in the lake and he probably heard them swimming around.</p><p>We went back inside, and this is the point where things get sketchy. I remember lying on the floor and through a ball of puddy up and letting it fall on my face. I felt like I could control gravity and have the ball float about 2 feet above my face and this worked. Then I lost all intuition of time completely. scenarios started coming and going, like I was looping through time at different points throughout the night. I was cognitive of it taking place, and I was terrified that I didnt know whether I was RIGHT NOW OR THEN OR IN 2 MINTUES FROM NOW. Let me give you an example of what it was like. I went to get a piece of bread because I was feeling nauseous again. I would see myself walking to the kitchen, then being back in G's room eating the bread, then opening the bread and getting a piece, then throwing the ball in the air, then looking at myself in the mirror of the bathroom. It was as if I was warping through time, yet myself being in that point in time on a cognitive level. I had absolutely no control whatsoever of this and I had never lost TOTAL control before like this. I was horrified at what scenario I would be at next, perhaps in jail or in front of a judge, maybe in my coffin unable to move, maybe drowning in the lake etc.</p><p>About 2 or 3 hours later things settled down at a very accelerating rate. Just as fast as things came on, they sloped off. I realized that the entire night I had not moved from the point I got up with G and went to the bathroom. I had stared into the mirror for 4 straight hours looking into my own eyes. G had come down much before I did because he threw up 3 or 4 times, and he called some of our other friends to come and analyze the situation of me staring at myself hours on end. At one point they thought that I might have put myself into a state of insanity, which I probably did for a while, and had I not come to when I did, 30 minutes later they were going to call the paramedics. None of the things that I remember going on happened at all after I went to the bathroom with G. He says I was 'sucked into' myself, and did not move at all for hours.</p><p>Looking back, I believe that I reached the point of my exploration. I will not say that it was a 'bad' experience because I learned alot from it and actually did have fun most of the time. I do not wish to ever go back to that point where I lost control of time, that is the one thing throughout all my trips that has stopped me in my tracks. Thank god we did not eat those 20 extra shrooms, who knows what would have happened. Lower doses of shrooms can be total and absolute fun, and I have found that it is even more fun doing it with alot of friends that you trust. I will however never forget the time the laws of the universe decayed before my eyes.</p>",
 "year": "2003",
 "id": "29178",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-10T07:00:00.000Z",
 "views": "2659"
}
