{
 "id": 2920,
 "title": "Moment of Truth",
 "date": {
  "submission": "2002-12-12T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "pete s",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>The summer after my senior year of h.s., my brother(who was a year out of a 10 month rehab stint in Memphis) invited me to a rave in Baltimore with some friends of his. (Mind you,the extent of my drug use was pot at this time and was I deathly afraid of ecstacy!!).My brothers friends all assured me that I would have a great time and convined me to go. On the 45 minute ride to B-More, they all wanted to know if I was going to roll with them. My answer was a flat out no. I said that I was just going to chill and try to make some new friends. When we got there the line wrapped around the block -we waited for 3 hours!! Well, we finally got inside and i had to pee-3 hour wait?? I was entering a stall to pish when I stumbled upon a man snorting coke off the back of the toilet. I knew this was going to be an interesting night to say the least. We all met up by the back wall and they all gave 25 bucks to one of the guys in the crew. He was getting them their e for the night. In about 5 min he was back and he handed all the pills out.( I had none being as I didnt want to roll and all) My brother, after recieving his pills, turned to me and without saying anything handed me one. I had no intention of eating it so i just stared at it for a minute, contemplating what I should do. I noticed they had all taken theirs and against every fiber of my being took the goddamn thing. they were all like , ' cool man-youre gonaa love it!!' and I was alredy regreting my decision. after about20-30 min, they were all rolling and touching each other and talking all sappy-like. I was feeling nothing. I was starting to get pissed so talked them into going outside for a smoke. I took a drag of newport and BAM!! (My vision became choppy and I started to feel really warm and content. It started in my extremities and moved throughout my whole body. It was like that relaxed feeling you get after sex except euphoric and similar in a way to the feeling you get when plunging down a big hill on a roller coaster). EVERYONE around was like ' its his first time' and they all massaged me and whatnot.  I talked to everyone I saw like they were my best friend for years. It was a great night. Since then, I haved rolled God knows how many times and have found it to be spiritual and productive for deep chats with friends. I have found that taking 5-htp while rolling increases the roll and taking it before sleep help the next day hangover.</p>"
 ],
 "erowid": {
  "id": "19600",
  "citation": " pete s. \"Moment of Truth: experience with MDMA (ID 19600)\". Erowid.org. Dec 12, 2002. erowid.org/exp/19600",
  "substance": "MDMA",
  "views": "7861"
 }
}
