{
 "title": "Uninspiring Diversion",
 "author": "Corona",
 "citation": " Corona. \"Uninspiring Diversion: experience with 2C-C & Alcohol (ID 29208)\". Erowid.org. Dec 15, 2003. erowid.org/exp/29208",
 "substance": "2C-C & Alcohol",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-C",
   "(powder / crystals)",
   " T+ 0:45",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "report": "<p>An old, wise friend of mine offered to share with me the byproduct of an independent lab project since I had never tried a phenethylamine of any sort.  My experiences before had been primarily with salvia d., DMT, and psilocybin.  I suppose I had high expectations of the 2c's from hearing other folks' tales. </p><p>Since I was working with a new compound, I tried it at home first, with water, a bed, a bathroom, good music, and good company close at hand--tools to help with any funk I could find myself in.  I've yet to have a freakout and would like to keep it that way!</p><p>I'm hypoglycemic and have a hard time with fasting, so I took the 20mg in water as soon as I got up in the morning.  I held it sublingually for five minutes before swallowing.  In another five minutes, I was edging towards a +1, comparable to a 2-beer buzz.</p><p>(T-45min) Beginnings of a mild bodyload: muscle weakness and an empty threat of nausea as the effects intensified.  No visuals and not really psychedelic, but my thoughts were slowed and dulled.  I walked out to the front porch to sit with my roommate and watch a fog bank roll in just fifty feet over our heads.  I ate some cherries, some cheese, and drank a glass of red wine after my stomach stopped worrying.  I would've been happier if I hadn't. </p><p>(t-1h) My roomate began to talk about his relationship problems.  I lent him a sympathetic ear as usual, feeling no special warmth or connection, but grateful not to have to speak.  I was beginning to have to concentrate very hard to be able to process my thoughts into comprehensible phrases.  Cognition was drunkenly stultified, though I could still push past it to functionality/ +2</p><p>(t-1.5h) A few bike-tire track visual patterns briefly appeared and subside. I generally don't experience visuals on anything other than smoked DMT, though.</p><p>(t-2h) My thinking suddenly cleared and all visuals have fled--feels like the peak. </p><p>(t-3h) Almost at baseline, though a little bit fuzzy and tired. No euphoric or creative afterglow.  Feel as though I may have had a minor insight, but can't really remember many details of the past few hours.</p><p>Retrospective:</p><p>Not a particularly interesting substance in its own right.  However, it might add novelty to an otherwise uninspiring activity.  Though very mild, the body load simply wasn't worth the initiative it sapped out of me.  I'd like either ideas or the freedom to romp about, and this compound didn't inspire either.</p>",
 "year": "2003",
 "id": "29208",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2003-12-15T08:00:00.000Z",
 "views": "14374"
}
