{
 "title": "Before Mixing, Be Informed",
 "author": "over user",
 "citation": " over user. \"Before Mixing, Be Informed: experience with Bupropion (Wellbutrin), Alcohol, Cocaine, Ecstasy, Cannabis & Adderall (ID 29219)\". Erowid.org. Dec 15, 2003. erowid.org/exp/29219",
 "substance": "Bupropion (Wellbutrin), Alcohol, Cocaine, Ecstasy, Cannabis & Adderall",
 "bodyweight": "125 lb",
 "report": "<p>I've always had a laundry list of drugs that I'll never try: PCP, ketamine, crystal meth and crack.  With the exclusion of those 4, I've always been up for anything.  I've been taking Wellbutrin (an SSRI) [Editor's note: Bupropion (Wellbutrin) is not generally classified as an SSRI because it has only weak SSRI activity] for the past 7 years, but had not been taking it regularly at the time of the experience for about 2 years.  The mix of drugs that I was doing, the adderall, the coke, the diet pills, the alcohol, the weed, and the ecstasy, I'd done before and while the mixture had made me extremely edgy, I didn't feel any overtly negative side effects.</p><p>This particular night, I was hanging out with a friend of mine who had just returned from being out of the country for 3 weeks.  I had also decided that it was time for me to start taking my anti-depressant again.  I knew that the combination of Wellbutrin and alcohol could cause seizures, but had been drinking heavily on Wellbutrin since I was 18 and besides blacking out a few times (which arguably is something that happens when you go off to college and are away from you parents for the first time ever), I had never had a negative experience.</p><p>My friend and I started drinking our wine and doing lines when I saw him take a pill out of his drawer and I asked him what it was.  'ecstasy.  you want one?'  he said.  This guy is careful, he has a test kit and thoroughly inspects everything he buys, so I knew that I was getting something safe from him.  But being the reckless person that I am, I never considered that it could be hazardous to take with Wellbutrin.  Once the ecstasy started to kick in, I totally lost control.  I was talking about everything, having auditory hallucinations and felt really really uncomfortable with what was going on in my mind.</p><p>The next thing I remember is waking up with my friend leaning over me saying, 'I thought I'd lost you.'  I asked him what happened, and he told me that I'd started shaking and stopped breathing.  I've always assumed that this was a seizure, and have since done a little research on the internet on the affects of mixing ecstasy with an SSRI and think that I'm correct in this assumption. </p><p>My experience hasn't caused me to stop taking drugs, but it has taught me to look into the safety of mixing more carefully.  I wanted to share this experience because I don't think there is nearly enough information available pertaining to combining ecstasy with SSRI's.  I'm taking Wellbutrin regularly now and since that night have not touched ecstasy and will not do it again.  Mix Carefully!!</p>",
 "year": "2003",
 "id": "29219",
 "gender": "Female",
 "timestamp": "2003-12-15T08:00:00.000Z",
 "views": "85210",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "10 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(flowers)"
  }
 ]
}
