{
 "title": "'TriMix'",
 "author": "Doc",
 "citation": " Doc. \"'TriMix': experience with Cannabis, Salvia divinorum & Calea zacatechichi (ID 29222)\". Erowid.org. Jan 8, 2004. erowid.org/exp/29222",
 "substance": "Cannabis, Salvia divinorum & Calea zacatechichi",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 2:30",
   "20 drops",
   "oral",
   "Salvia divinorum",
   "(extract)",
   " T+ 3:15",
   " ",
   "smoked",
   "Cannabis",
   "(tar / resin)",
   "",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "",
   " ",
   "smoked",
   "Calea zacatechichi",
   "(dried)"
  ]
 ],
 "report": "<p>T- 0:00</p><p>Drake and I share a bowl of schwag from Bill (my bong). Drake and Mike's Excellent Adventure is had, food is aquired.</p><p>T+ 2:30</p><p>We each take a dose of salvia tincture. 20 drops, diluted with warm water, administered sublingually. Ratio is 4:1 water/tincture.</p><p>T+ 2:45</p><p>Tincture solution is expectorated. Drake reports only a mild 'level one' sensation, I experience mild visual effects- tracers and retinal burn, which I've never experienced with Salvia before.</p><p>T+ 3:15</p><p>We load a bowl on Bill, containing one large (half centimeter, maybe slightly smaller) glob of weed resin, a medium-small dose (half bowl) of salvia 5x extract, and Calea Zacatechichi filling the rest. Drake takes the green hit, I clear the pipe and hit what's left. A second bowl of the same content is loaded, this time I hit green, he clears and takes the second hit.</p><p>The effects are almost instant. Weed and Salvia combined (A mixture we call 'Havok') amplify each other, and the Calea adds a realistic level of detail and dimension to the visuals. I can't recall much of my experience. Closed eye visuals were intense and clear (though never confused with reality)- the bright 'lisa frank' color scheme gives way to darker, realistic tones as the calea takes hold. Hallucinations gain detail such as shadow and realistically-angled shading, though I can only remember fragments of specific visuals. My memory loss seems to be the direct result of the weed - eliminating it next time may have more desireable results.</p><p>I have to say that on the whole, throughout my experiences, I've been relatively unimpressed with weed. I enjoy the ambience-enhancing effects, but the short-term memory difficulty and clouded thoughts outweigh the good.</p><p>T+ 3:45?</p><p>Drake retires to the couch downstairs, and I get in bed. Though I made an honest effort (out of mindfulness of my company, directly below), I just couldn't bring myself to let such an intense high go to waste without more thorougly exploring the tactile effects of the 'TriMix' (Named by myself, after the mixture of Oxygen, Nitrogen, and Helium that deep-sea divers breathe...). Results were decidedly positive. Very positive. Incredibly positive. I then drift into a state of consciousness that was halfway between sleep and wakefulness.</p><p>T+ ?:??</p><p>I wake, still quite high, to a series of muscle spasms rippling through my legs. Like nervous or cold shivers, they're small, rapid contractions of muscle matter. I recall the spasms having a pattern as to the order that the muscle groups would convulse. Fearing some sort of chemical reation or allergic reaction, I force concentration upon my floating mind, and monitor these tiny convulsions. They hit like waves, indiviual muscle groups would spasm once, in turn- going up my legs, starting with just my feet and lower shins, but gradually affecting my upper thighs. I discover that they can be controlled if I focus, and were minor enough that they rarely caused notable movement. Being prone to minor shakes in the sober state, I wasn't overly concerned, and the spasms stopped about twenty minutes later.</p><p>T+ 12:00</p><p>I awake, feeling groggy and drained. I note a small headache, characteristic of smoking Salvia. It disappears after an hour or so, and the rest of the day is downright lethargic. Drake reports no muscle spasms, and seems quite satisfied.</p><p>And they all lived happily ever after.</p>",
 "year": "2003",
 "id": "29222",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-01-08T08:00:00.000Z",
 "views": "24706",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
