{
 "title": "Agreeable, Not Worth Repeating",
 "author": "shrum",
 "citation": " shrum. \"Agreeable, Not Worth Repeating: experience with IAP (ID 29239)\". Erowid.org. Dec 15, 2003. erowid.org/exp/29239",
 "substance": "IAP",
 "bodyweight": "140 lb",
 "report": "<p>Setting:  Home, with girlfriend.  Southern California, December 2003.</p><p>2:20 pm  40 mg IAP ingested, dissolved in vodka. </p><p>After drinking our shot & a half of vodka, my partner & I sat down to smoke a couple of bowls of good cannabis.  We expected a slow come-up, from reading others' reports, and decided to take a bicycle ride to take our minds off waiting.</p><p>By approximately 3:15, I was feeling the first alert, which came on as a strange increase in pressure in my head, with colors becoming more pronounced. </p><p>Upon riding our bicycles further, the strange nature of the compound began to be felt.  Though the compound is definitely 'speedy,' there is a strange relaxed feeling one gets, it seems as though time is slowed slightly, and one is moving in slow motion.  A very nice mood came over both me and my companion, and we continued riding in spite of feeling a bit cold (it was a windy, overcast day). </p><p>We both felt a slight oddness in our stomachs, but ignored it by smoking a small amount more of cannabis, about 1.5 hours after coming up.  My girlfriend enjoyed the 2 substances together, but I found myself uninterested in smoking (which is *strange* for this pothead!), and declined to smoke more than a single toke.</p><p>We headed home after about 2 hours out and about, and got back home around 5:00.  I was chilled to the bone, moreso than I would have been under normal circumstances, and felt the need to curl up in front of a heater with a blanket wrapped around me.  My girlfriend did not feel the intense chill that I did, and I remembered that I also get similar chills when eating magic mushrooms, while my girlfriend does not. </p><p>The peak of the experience lasted about three hours, and consisted of a pronounced amphetamine push, we both felt lots of energy pent up inside, however, I had no problem simply sitting still in front of the heater, soaking up the warmth.  In fact, after about 4.5 - 5 hours, I began to feel intensely relaxed, even yawning several times.  My partner felt the need to keep busy, playing a video game, looking thru a newspaper advertisement, practicing with a typing program, smoking cannabis, making conversation, basically whatever was around as a distraction.  At this point (4 - 5 hours in), we started to have stomach distress, with slight nausea, and unavoidable gas.</p><p>About 6 hours after coming up, we were still very much feeling the IAP, and decided to venture outside again, this time skateboarding to a headshop to pick up some Whip-Its.</p><p>My girlfriend tried the nitrous as soon as we got back home, and quite enjoyed it.  The laughing gas lived up to its nick-name, and my girlfriend had fun doing balloons while watching COPS on TV, she said she found the situations hilarious.</p><p>Shortly after a few balloons were consumed, fast food was obtained, and while my appetite was considerably diminished, I did my best to eat something.</p><p>About 8 hours after coming up, we were still feeling the IAP, but in an annoying way, we both felt a number had been done on our GI tracts, and had diarrhea that night and the next day.  I also developed a minor headache, which felt vascular-related, as it throbbed in time with my pulse.  I began to find it easy to close my eyes and 'zone out' around this time, and did so as much as possible. </p><p>Around midnight, 10 hours after dosing, we both drifted off to a fitful sleep.  Neither of us could seem to stay asleep more than an hour or so, and the next morning we felt like we could *still* feel the last 10% of the effects.</p><p>We both agree that the experience was agreeable as far as research chemicals go, but can't be used as a substitute for MDMA, and is not something worth repeating.</p>",
 "year": "2003",
 "id": "29239",
 "gender": "Male",
 "timestamp": "2003-12-15T08:00:00.000Z",
 "views": "14518",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "IAP",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "1.5 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": " T+ 1:30",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "4": {
   "time": " T+ 6:00",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 }
}
