{
 "id": 2924,
 "title": "Mary Kay...My Oh My",
 "date": {
  "submission": "2000-06-19T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Toad",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "70 mg",
   "administration": "IM",
   "substance": "Ketamine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I love to dream... I especially like it when I become aware that I'm dreaming. You can create anything you want while dreaming. This is what I created in my dream...",
  "I dreamed of a Ketamine experience that was easily one of the best trips of my life!",
  "Yes Ketamine...",
  "My first two dream experiences with Ketamine were not at all inspiring and left me with a very nasty physical reaction in the days following the experiments. I was totally disappointed with my initial explorations of Ketamine as I found it to be an awareness limiting and unconscious material. Certainly this couldn't be what they're talking about???",
  "I have been receiving some very subtle cosmic information lately, my meditations have been incredible, with my daily experience is expanding at an ever increasing pace. The K dimension has been coming through for me many times spontaneously throughout the day and talking to me. Geez, what's this I say... Its trying to tell me something.",
  "So I listened...",
  "It told me there was much more to the world of Ketamine than had been revealed to me. 'You missed the mark', it said. My first attempts were way overboard at 100mg and 125mg because they propelled me right passed the phenomenal polarity and into the polarity of nothingness. The infamous K hole...",
  "'Find the line, hit the still point', it said.",
  "So I gingerly began to experiment with it again, wondering whether or not it was going to make me sick. I was instructed to try 25mg i/m to get a feel for what a low dosage was like. It told me to take a hit of DMT while at the peak for further instructions. As the Ketamine came on I noticed the lower dosage was very similar to the higher dosage in terms of its lack of awareness and unclarity. It started off centered around phenomenal motion and quickly progressed into a more blissful and aware state as it reached its peak. But alas, I was still stuck in polarity and far away from the mark. 'Now for the DMT' it said. So I cued up my vaporizer and inhaled 3 big hits (50mg) of DMT, laying down as it came over me. The familiar storm of smiling entities rushed in, eating there way through me and laughing all the way. After doing their house cleaning they left me with a clear message of self affirmation. It was a vision in which I was looking down on myself, the entities laughed and shouted with glee 'Your so weird'. It was their own bizarre way of expressing love for me as a diversity of unity. A tasty treat indeed! As I came down from the DMT flash the Ketamine began its slow decent and the body sickness became more predominant. This made the later stages of the trip somewhat unpleasant, but nothing like the miserable recoveries of my previous Ketamine excursions. However, it had a most beneficial effect on the DMT rush and it was well worth the price. The flash was much more of a witnessing event, totally detached from the mind while the chaos ensued. In the days following the experiment I didn't notice any of the adverse physical reactions that I had on my previous experiments with Ketamine.",
  "Ok, so now what?",
  "A week later I was called. I was instructed to smoke Cannabis beforehand to handle the body load and motion sickness. 'Push it up to 70mg', it said. So quite spontaneously I decided to give it a go and start off with 4 tokes of some fine Cannabis. I noticed that I was fairly buzzed while I attempted to prepare the needle. I started laughing at myself, as it was very entertaining watching me holding a giant stinger in my hand with the full intension of forking my leg.",
  "Thwack!",
  "ahhhhhh, settle down, everything is prepared, enjoy the ride. Wow, this is getting good. So clear this time, perfectly clear. Like a camera suddenly coming into focus. Cruising now, just like a rocket being propelled into orbit. Ohhhh Myyyy YYESSSSS.",
  "'Mary Jane makes Kay' it said...",
  "I hit the target spot on, suspended between polarities at the line between existence and non-existence. This is where the bliss of freedom lives, pure awareness. I had full access to my data bank and its power source, flipping and dipping into both polarities simultaneously. I was navigating hyperspace like never before. Absolutely amazing... As I opened the hood of my being the whole engine was revealed. I could clearly see and understand my limiting beliefs and how they shape my world. As I traveled through my neural networks I discovered why I manifested the sickness in the days following my first two journeys with Ketamine. My dosage had been too high and I had unconsciously accessed my limiting program that creates sickness (sort of like a computer virus if you will) which I brought back unbeknownst to myself into conscious manifest reality. Jesus, the power of this tool... It's far beyond words. I can only compare its level of awe inspiring intensity to that of my previous journeys with the LSD/DMT/Harmala combo.",
  "After one hour of being suspended in the supreme reality I slowly began to descend back to baseline. This time there was no nausea or uncomfortable feelings during the recovery period. The Cannabis ally worked extremely well and took good care of my body. In fact, it was quite enjoyable laying there in complete awe, reviewing all of what had just transpired. The next day I awoke feeling rejuvenated and healthy, feeling better physically than I have in a very long time. Must have been that new program I installed... ;)",
  "My oh my... "
 ],
 "erowid": {
  "id": "1961",
  "citation": " Toad. \"Mary Kay...My Oh My: experience with Ketamine & DMT (ID 1961)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1961",
  "substance": "Ketamine & DMT",
  "views": "75023"
 }
}
