{
 "title": "Still Recovering",
 "author": "Dotcom",
 "citation": " Dotcom. \"Still Recovering: experience with Methamphetamine (ID 29248)\". Erowid.org. Nov 4, 2007. erowid.org/exp/29248",
 "substance": "Methamphetamine",
 "bodyweight": "145 lb",
 "report": "<p>Ive been in recovery from all drugs, specifically crystal since 01-17-03.  I abused crystal on a daily basis for about 4 years.  In these past 11 months, I have learned a lot about recovery. </p><p>The first month without crystal was hell.  I could not sit in a public place or go anywhere without feeling paranoid.  I experienced homicidal thoughts and feelings.  I obsessed about every little thing.  I could not get my thoughts straight no matter how hard I tried.</p><p>The second month, I was able to go places with my mom, but was not able to venture out alone.  I still couldn't shake the paranoia.  My homicidal thoughts and feelings were growing stronger.  Still obsessing, but recognizing it.  Still very scatterbrained.</p><p>The third month I got involved with a recovery group. I had difficulty sitting in the group without freaking out, but was able to handle it.  I felt everyone there was out to get me.  My homicidal thoughts were beginning to be less frequent, and I began dealing with my anger.  My obsessing was getting worse, it seemed that I couldn't control it.  I was becoming more scatterbrained due to my obsessing.  I couldn't get anything done unless I felt it was perfect.</p><p>The fourth month, I started feeling more comfortable with my recovery group and was able to go places alone.  Only a few fleeting homicidal thoughts.  My obsessing reached its peak, and I had to seek help.</p><p>The fifth month I was going regularly to recovery meetings and the haze was lifting.  Still a few fleeting homicidal thoughts, and feelings of suicide began to surface.  I was beginning to get a handle on my obsessions.</p><p>The sixth month I was beginning to feel normal.  No homicidal thoughts, lots of anger though.  Pondered suicide.  Still getting a handle on my obsessions, but becoming more organized at work and home.</p><p>The seventh month I felt alive for the first time.  I still had a lot of anger, and was very uncomfortable with myself, but I could face reality.  Suicidal thoughts passed.  Started sharing about my feelings.  I was able to work on work and home projects efficiently.</p><p>The eighth month my body was really healing.  I began anger management techniques and became able to control my reactions to my emotions.  I was able to stay busy for long periods of time without losing my focus.  Some obsessions began popping up again, but I was able to recognize them.</p><p>The ninth month I felt a void.  Suicidal thoughts emerged and I lost all control of my emotions.  I seriously thought about using again, but decided not to.  I floated through this month, tired and sick in the mind.</p><p>The tenth month I began recognizing my maturity.  The crystal did a lot of damage to my brain, so it was a miracle that I am now as well put together as I am.  No more suicidal thoughts.  I'm able to control most of my obsessions.  I'm getting more and more organized.  But my brain is still healing, so its a real challenge.  Ive noticed severe memory loss, both short term and long term.  Thats a new development.  Hopefully I can salvage whats left of my crystal ridden brain and continue moving forward to month 11. </p><p>I don't recommend crystal or any other mind altering drug.  It's not a 'spiritual' experience, or an amazing 'sex enhancer', it's death.  Even though I'm still alive, I'm not really.  What I had prior to my drug use is gone.  Now I'm left with this empty shell of a brain, and some hope.  Hope that I can still be a bright young person with a future.  And by staying clean, I can.</p>",
 "year": "2003",
 "id": "29248",
 "gender": "Female",
 "timestamp": "2007-11-04T07:00:00.000Z",
 "views": "11889",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "",
   "substance": "Methamphetamine",
   "form": "(daily)"
  }
 }
}
