{
 "title": "Raped by Snow",
 "author": "Wes",
 "citation": " Wes. \"Raped by Snow: experience with Cocaine & Various (ID 29259)\". Erowid.org. Nov 6, 2007. erowid.org/exp/29259",
 "substance": "Cocaine & Various",
 "bodyweight": "170 lb",
 "report": "<p>I've been a regular cocaine user for about a month.  Although it hasn't been a long term habit, there have already been instances that I've considered myself addicted.  Here is why:</p><p>My first use was not administered to a sober mind.  I was drunk, high on marijuana, as well as the typical dose of paroxetine (20mg) that I take daily.  In this first usage, I didn't feel very much.  I played pool, and I was incapable of performing.  Balls would fly all over the place, I'd lost my motor skills.  I was in a good mood until the game ended and my coked/drunk/stoned pals put on a skateboarding video.  I grew bored and decided to go home.  Upon returning home, I finished my cocaine and began to feel very guilty and remorseful.  I was simultaneously physiologically without any sense of pain.  I was elated and my every movement felt warm and sensual.  Perhaps this was the alcohol combined with the cocaine.</p><p>My next experiences cost me much more money.  The first line from my second purchase caused me to again feel guilty, and strangely, afraid.  I continued to snort throughout the night, and talked to my friend Carla, who wondered why I would abuse myself in that way.  I definitely felt energy, but psychologically I was miserable.  The effects of cocaine are mostly physiological, I then deduced.  It was totally possible for me to soberly think disturbing, negative thoughts while being high on large amounts of the drug, up to half a gram. </p><p>I went on a cocaine binge once I realized it could enhance my intelligence.  I wrote essays for university while snorting lines, and my creativity and eloquence seemed beyond my normal state of mind.  I would paint, exercise, go for walks, talk to family members (who were unaware).  I would even snort lines at work, in the washroom.  There seemed to be no downside to the drug.</p><p>I continued to abuse cocaine as the weeks progressed until I had an unfortunate incident occur at a movie theater.  I went to see the remake of 'the texas chainsaw massacre' while very stoned on marijuana as well as cocaine.  From the outset, I began to feel very frightened, and my heart raced to such an extreme that I feared cardiac failure.  I arose and told my friend that I had to use the washroom.  On the way, I collapsed in the hallway.  The theater staff confronted me but all I could visibly see was blackness and thousands of vibrating faces.  The staff called a paramedic and I regained consciousness just as they were arriving.  I explained my psychological/chemical state and they offered to take me to the hospital.  I refused and asked instead to be driven home.  Upon arriving home, I snorted more cocaine.</p><p>As my usage has increased, I have lost the sensation of guilt and fear while using, unless if a friend inquires of my financial situation or usage amount.  My nose is always encrusted in blood, I often have insomnia where I lie awake thinking of the various things I could employ cocaine to my advantage, and I sometimes become paranoid. </p><p>One evening, I much exceeded my amount at a party, and decided that I should return home.  Home alone, I heart voices, and had to back into a corner to feel confident that no one was behind me.  It was not an intense fear, only a self-indulgent game where I consciously knew that I was hallucinating, yet decided to trust my perception.</p><p>I have learned first hand the life-enhancing aspects of short term cocaine use, as well as some of the threats of sustained, long-term usage.</p>",
 "year": "2003",
 "id": "29259",
 "gender": "Male",
 "timestamp": "2007-11-06T08:00:00.000Z",
 "views": "20527",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
