{
 "title": "Pharmacological Error",
 "author": "Chromodynamix",
 "citation": " Chromodynamix. \"Pharmacological Error: experience with 1,4-Butanediol (ID 29274)\". Erowid.org. Dec 22, 2005. erowid.org/exp/29274",
 "substance": "1,4-Butanediol",
 "bodyweight": "95 kg",
 "header": [
  "DOSE:",
  "6.0 ml",
  "oral",
  "1,4-Butanediol",
  "(liquid)"
 ],
 "report": "<p>I am a qualified Pharmacologist, so I 'should' have known better.</p><p>I purchased 250 mls pure 1,4 Butanediol off the internet at a reasonable price, supplied as Video Equipment cleaner. I used a graduated 1 ml syringe to measure into my drinks, which were occasionally alcoholic. This was usually at bedtime. I never had a problem, never exceeding 2-3 mls.</p><p>On a Sunday afternoon, I decided to read the newspaper and have a 'nap'. Instead of measuring the amount of 1,4 Butanediol into some grapefruit juice, I 'estimated' the amount and sloshed it in. BAD MOVE! An hour or so later, my kids noticed me asleep, but not breathing well, and they alerted my partner. I came round in a dream like state, but was unable to tell them what was happening, and I kept passing out. Next thing I remember were paramedics checking me out and coming round in Emergency resuscitation with drips in both arms. I had already had a brain scan as they suspected a stroke, and I had been intubated.</p><p>They then started discussing doing a lumbar puncture, and possible brain surgery, and all this time I am trying to explain I was a qualified Pharmacologist, and I was not in any danger. In my confused state I could not remember the chemical I had taken, which was critical to managing my medical emergency.</p><p>Eventually, I recovered enough to explain what had happened, and apologise profusely for wasting valuable medical emergency resources. </p><p>I will not try this stuff again.</p><p>Anyone tempted, make sure you accurately measure the dose, and do not consume any more, as absorption times vary.</p><p>-------------------------------</p><p>June 2009 Addendum by author:</p><p>I would like to add a significant fact regarding my story which has since come to light.</p><p>I mention mixing the 1,4 Butanediol with grapefruit juice. There are many drug interactions with grapefruit juice, which inhibits an enzyme Cytochrome P 450 in the intestinal wall. This can cause much higher concentrations of a drug to get to the blood stream with dangerous results.</p><p>I am convinced this led to the OD reaction.</p>",
 "year": "2003",
 "id": "29274",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-12-22T08:00:00.000Z",
 "views": "19466",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6.0 ml",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  }
 }
}
