{
 "title": "Funny Way to Say 'Ego Loss'",
 "author": "Kalidor",
 "citation": " Kalidor. \"Funny Way to Say 'Ego Loss': experience with Salvia divinorum (5x extract) & Cannabis (ID 29286)\". Erowid.org. Jan 29, 2007. erowid.org/exp/29286",
 "substance": "Salvia divinorum (5x extract) & Cannabis",
 "bodyweight": "58 kg",
 "report": "<p>T+0: half a bowl of hydro white widow cannabis mixed with approx 1/30th gram of standardized 5x salvia divinorum.</p><p>I drop on the couch and close my eyes. There's this 3D enviroment that forms in my head, which corresponds loosely to the outer world. If I open my eyes, I see the outer world in a totally fragmented and twisted way, 3D-wise. I feel the presence of this old lady, which is a superiour being who watches me and makes fun of me. She wanders around and plays with my mind with all the 3D mess. The effect is very nice, I feel 'gummy' and relaxed, as opposed to the other times I have taken salvia, this is probably because of weed. The weed has not fully kicked in yet though. I decide to redose.</p><p>T+10 minutes: maybe 1/20th-1/15th gram of 5x.</p><p>This time it hits me hard. I suddenly feel floating in air, and my mental processes are very strange. I feel like the unwilling main character of a show, in which the audience makes fun of me. I always get this effect from salvia so I'm not very surprised. I've done salvia about 30 times. The 3D mess is always there, but I feel brave and I try to control it. I act like if I'm provoking the salvia: I sit up from the couch, reach for the chair and sit in front of the PC, all without problems, as to prove the salvia entity that she can't really fuck me up if I don't want to. I start typing something on IRC, and it's like I can feel the thoughts that operate my keyboard typing.</p><p>I'm a very fast typer, so all this happens in fractions of seconds: I type two letters, while the effects really start to kick in. The 'show/audience' thing in my head starts getting stronger, and when I reach for the third letter, which is C, I notice I can't find it for a very brief instant (all this probably happened in less than 1/10th of a second but it seemed very slow at the time) so the 'audience' in my head starts commenting about that, makes faces as to make fun of me. When I find the letter C, the audience goes like 'finally you got it' or something. Then suddenly ALL my thought processes become involved in this thing. All the inner workings of my subconscios become evident to me, I get an ego loss for a very brief moment.</p><p>The audience keeps making fun of me and behaves like if they knew from a LONG time all my thoughts and habitual mental processes. All this feels very very real, so suddenly I become heavily paranoid and start thinking that all my thoughts are controlled and watched by someone, and while I think this, the salvia audience keeps repeating exactly the same things I'm thinking as if they knew what my reaction would have been all along. I had just found out my inner self, discovered things I've never noticed about myself and these guys I've never seen seem to know myself better than I do!</p><p>All this stuff happened in about one second or two. So basically I am at the keyboard blocked at the third letter I had typed, C. I stopped typing because I'm totally shocked by the fact that my mind is controlled. My heart is racing and I am shaking, I have a panic attack. Then totally paranoid thoughts come to my mind. I become sure that life is a complete joke, that I'm an actor and now that I know this secret they will have to eliminate me. Many weird scenarios come up to my mind, all sounding very realistic. One of them that I remember is that salvia is a secret government's experiment, that all the information about it is fake and its real purpose is to control the druggies' minds.</p><p>So I decide that the best thing to do is talking to someone to see to what extent what I'm thinking about makes sense or is completely nuts. So I decide to go to my friend's house, on foot. I'm out of my flat, I stay out for a while to think and I behave very strangely: I start laughing loudly for the total nonsense that's happening to me, walking in circles (in public). Then I call my friend on the cell telling him that I'm coming, when suddenly I see a police car at the other side of the road, with 2 cops out of the car.</p><p>Suddenly I become almost certain that they've been called by the government to arrest me, and that they're tracking my cellphone call. So I remove the battery from the cell and start walking away very rapidly, without turning back, almost sure that the cops would follow me anyway, but at the moment I feel desperate. Fortunately (obviously?) the cops don't follow me, but I am still totally paranoid. I feel like if my brain has been 'boosted': every time some guy walks past me on the road I start thinking about every possible implication he could have with this story, in an instant.</p><p>It's like having incredibly strong analytical powers, though they are TOO analytical and ultimately paranoid. I try to think about ways to escape this conspiracy, I think stuff like 'why me, I'm nobody, I haven't done nothing' and 'this time I'm fucked, totally fucked' and so on. Then I decide to mentally repeat the phrase 'I won't tell anyone so don't do anything to me' hoping that the salvia guys would leave me alone. After about 30 or so minutes the effects taper off and the paranoia goes away. It's been hours ago but I still feel fried.</p><p>It was a very fun and interesting trip in retrospective. It was like being in the middle of a johnny mnemonic style movie, or other sci-fi cyberpunk stuff, and I love that genre. All those conspiracy theories that came up my mind made so much sense to me at the moment that I really believed all that. Needless to say I was scared like I had never been in my life, especially at the beginning when the salvia guys revealed themselves and made me understand that they knew everything about my conscious and subconscious mind. I still don't know if I believe that, apart from all the conspiracy stuff that makes no sense now. Though it was all very intense and real. For the first time in my life I have been altered so much by a drug that I lost all my rational thinking abilities.</p><p>Last thought: every time I mix weed with a strong enough dose of a psychedelic (shrooms or salvia) I seem to get ego loss.</p>",
 "year": "2003",
 "id": "29286",
 "gender": "Male",
 "timestamp": "2007-01-29T08:00:00.000Z",
 "views": "4673",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "0.0333 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  },
  "2": {
   "time": " T+ 0:10",
   "amount": "0.05 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
