{
 "title": "Double Vision Merging Into Triple Vision",
 "author": "Drunkard",
 "citation": " Drunkard. \"Double Vision Merging Into Triple Vision: experience with Carisoprodol (Soma) & Alcohol (ID 29292)\". Erowid.org. Dec 30, 2010. erowid.org/exp/29292",
 "substance": "Carisoprodol (Soma) & Alcohol",
 "bodyweight": "125 lb",
 "report": "<p>My first experience with somas was definately a positive one. Prior to this experience I'd had my fair share of other psychoactives; MJ, Mushrooms, DXM (never again!), and various prescription pain killers. So without further adue....</p><p>About a year or so ago a couple of friends and I were headed to another friends house for a small party/kickback.  Upon arrival much MJ and beer was passed around and everybody got a nice buzz going.  I chose only to partake in the beer as I was being randomly drug tested for MJ at the time.</p><p>Probably around 2 hours later (and 6 or 7 beers later) while chillin in the garage having a pool tournament, a friend of mine busted out a big bag of white pills.  After inquiring about the ingredients I was told they were '350mg American Somas', supposedly the 'good' kind, as compared to Mexican somas. Im guessing the American version is just a purer form. Anyways after some serious coaxing I was able to talk my friend into giving me 3 of the pills.  She said 'if youve already downed a lot of beer, I would wait on these...its gonna be intense.'  Interesting.  Disregarding her warning (stupid, I know) I downed all three with a swig of beer and decided I would kill it on the alcohol for the rest of the night and just kick back and let these babies do there thing.</p><p>Maybe 30 mins later I was having SEVERE trouble seeing straight.  Double vision merging into triple vision would, I guess, be the best way to describe it.  I was also feeling really...well...goooooooood.  Id had experience with a number of different pain killers before this, but none quite compared to what I was feeling now.</p><p>10 mins after that and I was all but immobal.  It was almost as if I had grown roots into the couch I was sitting on and had no intentions of getting up.  My buzz at this point was, in a word, INCREDIBLE.  Like nothing Ive ever experienced.  I was so relaxed and one with everything, very similar to effects Ive noticed after coming down off of a strong mushroom trip.  Wierd I know, as Ive never experienced this feeling with any painkiller.  I also had almost no motor skills.  Movement was a chore, although moving my mouth and forming the syllables to make words was still a fairly easy task...formulating thoughts to provoke speech was not.  A small amount of nausea was in the back of my stomach throughout most of the experience but more often then not I would start thinking about something and forget about the nausea.</p><p>I couldnt give you an exact time frame but for around the next hour and a half I sat in the same position on that couch.  Occasionally talking to a friend that passed by or had a seat next to me.  Also I do remember having a hard time remembering the extreme short term.  For example I would take out a ciggarette, and then, before lighting it, think of something else and forget about the ciggarette.  Then, once I remembered the cigg, I had no clue what I had done with it even though only 20 or so seconds had passed since removing it from the pack (most of the time it was sitting in my lap or on the ground near me, as if I had just let go of the cigg once another thought crossed my mind).</p><p>It was now around 12:30 and the experience was nearing the end of its peak so I decided to try and take a walk....</p><p>The friend I had gotten the somas from, whom I will now refer to as M, was also very intoxicated off of a soma/alcohol mixture.  After some work I managed to remove my ass from the couch and find M.  I asked her if she would like to take a walk with me and she happily agreed.  So off we went to a school down the street so we could sit it the grass and look at the stars.  Almost as soon as we arrived at the school M said she felt very sick.  Concerned, I asked her how much she had drank and how many pills she had taken, although I dont know exactly how understandable my speech was at this point.  Her reply was 3 beers, 5 somas.  M then proceeded to violently vomit for 10 mins and I became very frightened that she might have taken too many. Yet as she finished vomiting she said she suddenly felt great, and she said that sometimes that happens to her on somas.  I dont know if this is a regular occurance for some people after the injestion of Carisoprodol but apparently it was for M.  Still concerned I took her back to the party and put her to bed, while her friend, and owner of the house, watched over her for the rest of the night.</p><p>Nearing the 2 O'clock hour I decided it time to go and my friends agreed.  We found our DD (hitting a bong no less, hey, u cant win them all) and home it was.  I hit my bed and immediately fell into a deep, very vivid dream filled sleep until 4PM the following day (Boss wasnt to happy about that one).</p><p>So all in all what can I say about my first experience with somas? Amazing, great, and most importantly..STUPID.  I usually research anything I take extensively before taking the drug.  I knew a fair amount about pills, and I knew that mixing beer and pills is a bad idea...but I didnt know it was an especially bad idea with Carisoprodol.  Dont get me wrong, somas are great and I have since become a recreational user - I.E. When I can find them - but I went about doing them for the first time the wrong way, and I hope that people can gain some helpful knowledge from what Ive wrote here today.</p>",
 "year": "2002",
 "id": "29292",
 "gender": "Male",
 "timestamp": "2010-12-30T08:00:00.000Z",
 "views": "9052",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "6 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "1050 mg",
   "administration": "oral",
   "substance": "Pharms - Carisoprodol",
   "form": "(pill / tablet)"
  }
 }
}
