{
 "title": "I Prefer Smoking",
 "author": "jrwproof",
 "citation": " jrwproof. \"I Prefer Smoking: experience with Cannabis (edible) (ID 29330)\". Erowid.org. Nov 1, 2011. erowid.org/exp/29330",
 "substance": "Cannabis (edible)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   ".5 g",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "report": "<p>I came across a low priced 1/2 oz. and decided to bake brownies. I used the method of heating up the vegetable oil and adding the marijuana to that. It turned a deep brown color, smelled horrible, and sat on the heat for a few minutes until it looked fully cooked. I let it cool, proceeded with the brownie recipe, and cut the final product into 12 evenly sized squares. After de-stem/seeding (and removing some for smoking) i had about 12.5 grams in the mix... so there was a good gram baked in each brownie.</p><p>I didn't eat any that first night (I had to drive), but the feedback from four of my friends said they were very excellent. I was going to see LOTR3 so i decided it being a 3.5 hour movie I'd try them out then. I ended up splitting one with a friend (which was probably a good thing). The onset was difficult to recognize, it wasn't like smoking at all. My head remained relatively clear, but the body buzz got increasingly intense. It finally got to the point where I considered leaving the theater, and felt very near a panic attack, but it seemed I reached a peak and things kept at a pretty steady level. Mentally, my head was 90% clear. I was able to think, observe, and understand things relatively normally. Physically, I felt like I couldn't have moved if I wanted to. It was just a extremely deep state of relaxation. Then the effects would go away for about 20 minutes and I'd think the experience was done, but it would come back just as strong for another 20 minutes. The effects wavered like this for a good 3 hours before finally starting the long comedown.</p><p>The positives of the brownies were that it was a extremely intense body buzz but with a very clear head. In that sense it reminded me of psilocybin, but without the profound insight, beyond deep thinking, and empathy/understanding towards the universe.</p><p>There were a few drawbacks to the brownies. For starters, the cottonmouth was the most horrible I've ever experienced. I constantly felt like I was choking. I would have gotten a drink, but in my physical condition and with the theater being maxed out there was no way I could have made it across my row and down the steps and back... so I suffered through it. Second, I was left with a pounding headache for the rest of the day which felt more like a hangover than anything else. Lastly, I wasn't able to keep my eyes open after I came down. I was on the verge of passing out for the rest of the day.</p><p>Overall, I prefer the effects of smoking weed over eating. I found the brownie experience to be a little dull and monotonous, and what normally would be an exciting and visually outstanding movie seemed boring and drawn out because I was more focused on my dry mouth than the storyline, although a whole brownie would have been far too much for me. I think in a different setting I may have had a different attitude, although I'll probably just sell the rest.</p>",
 "year": "2003",
 "id": "29330",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2011-11-01T07:00:00.000Z",
 "views": "3223"
}
