{
 "title": "Floating in the Clouds",
 "author": "ionic/aaronumbra",
 "citation": " ionic/aaronumbra. \"Floating in the Clouds: experience with Fentanyl (ID 29346)\". Erowid.org. Mar 1, 2004. erowid.org/exp/29346",
 "substance": "Fentanyl",
 "bodyweight": "250 lb",
 "report": "<p>First I'd like to note that besides snow capping marijuana bowls with vicodin I don't have much opiate experience, but I have a high medicinal tolerance overall.  1.25MG is NOT a suggested first time dose as fentanyl is approx 40x more potent than morphine.  Using indiscretion with this substance could quickly lead to a hospital visit.</p><p>At approx 12:30AM I chew 1/10 of a 10mg 100ug/hour release (fentanyl) Duragesic patch.  Approx 5 minutes of chewing the effects begin to come on.  Drowsiness, euphoria, almost inability to keep eyes open, body numbness, and vivid hallucinations when eyes are close.  Noy psychedelic visions, but it's like seeing my room, but different with my eyes closed.  I see a bed, couch, desk, computer, but all different like it's someone else's room.  The lasts for indeterminable amount of time, but I kept track via writing down times.  Typing was almost totally impossible, as well as keeping eyes open.</p><p>2:45m my phone rings and it's my friend M who's rollin.  This immediately wakes me up, but I am still in a euphoric state.  I chain smoke tobacco and often slap myself to stay awake.  Less close eyes visuals ow,</p><p>3:30AM I can't take it anymore and pass out into a very deep sleep.</p><p>Conclusion: As I write this I am still quote 'fenta fucked.'  It's an amazing experience, but one that needs to be careful about as fentanyl is very powerful, and the 10mg patches could easily be very harmful (or kill?) if chewed at once.  I suggest 1/16 or less of a patch.  First timer might want to try as small a square they can to assess tolerance.  Absolutely under no circumstances drive or do anything that requires concentration.  Writing ths report alone is like a marathon for me.  Total lasting effects if I manage to stay awake should be 5 or so hours.  This is my 4th expereience with fentanyl.</p><p>Be safe, know your body, know your mind!</p>",
 "year": "2003",
 "id": "29346",
 "gender": "Male",
 "timestamp": "2004-03-01T08:00:00.000Z",
 "views": "36042",
 "dose": [
  {
   "time": "0",
   "amount": "0.1 ",
   "administration": "buccal",
   "substance": "Pharms - Fentanyl",
   "form": "(patch)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ]
}
