{
 "title": "Don't Friggin' Bother!",
 "author": "TheGreenPhantom",
 "citation": " TheGreenPhantom. \"Don't Friggin' Bother!: experience with 5-MeO-AMT (ID 29359)\". Erowid.org. Dec 19, 2003. erowid.org/exp/29359",
 "substance": "5-MeO-AMT",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  "5.0 mg",
  "oral",
  "5-MeO-AMT",
  " T+ 2:40",
  "5.0 mg",
  "oral",
  "5-MeO-AMT",
  " T+ 7:40",
  "5.0 mg",
  "oral",
  "5-MeO-AMT"
 ],
 "report": "<p>I'ma make this short and sweet -- unlike the 'trip' I've been on for the past 24 hours....</p><p>I injested 5mg with my trip-brother at 2:20 in the afternoon. By 5pm we both felt only slightly 'out of it' -- dizzy, slightly drunk, and slight dissociation from the outside world. No audios, no visuals.</p><p>So we dropped another 5 mgs.</p><p>At around 6-7pm we started getting minor visuals (just barely a +2, even after smoking weed and closing our eyes and retreating to a dark space). We felt only a little amped up -- though I'm sure we freaked the hell out the other guy we were hanging with by the ammount of shit-talking we were doing, tryin' to vibe each other into a deeper state of consciousness. (This other guy dosen't drop -- does weed only.)</p><p>By like 8, I was pretty pissed off that 5-MeO-AMT is nothing close to the strength or awesome power trip reports I have read attributed to it. With a subtle body-load and weak, bearly noticable -- and quite boring -- visuals, I cold hardly call this material 'entheogenic.'</p><p>At 10 we dropped another 5mgs, since our 'trip' was begining to subside. This got the visuals and bodyload back to the level just described -- hardly more. We stayed up all night watching 80s movies and talking shit about the lame motherfuckers we know. We stayed up till 9am talking shit, then hit the sack. Unable to sleep, we got out of bed after 15 minutes, and continued to talk shit and comlain about the crap-ass trip we were on.  We stayed up till noon, we stayed up to -- well, I'm still awake, wired, with a tingly body buzz, slightly disembodied headspace, normal pulse and no visuals. It's now 7:13.</p><p>In Summary:</p><p>I was totally disappointed and unimpressed with a,O-DMS. There was no head-trip at all.</p><p>The visuals are nothing more spectacular than the ones you can see when you close your eyes after a long day of work -- maybe 1.5 times stronger. I've gotten equally strong visuals taking choline -- a nutritive suppliment sold in healthfood stores used to increase the memory. Audio enhancement and appreciation was nil -- as unchanged as in my normal state of mind. As far as getting 'high'?... If 5 grams of shrooms are a UFO with a trans-galactic/interdimensial warp drive, 5-MeO-AMT is a 4-seater Cessna with a single prop engine that hardly gets beyond 3 miles high. It's a long, long, long... boring ride with no real point to it -- it circles the same air-space endlessly. And you can't come down.</p><p>Now, I don't know if I got jipped by the folks I bought this shit from (which is completely possible, even though they were reviewed in a reputable entheogen journal I subscribe to), or, if what I just described is the actual sad nature of the drug. And the reports out there are written by light-weights (or teenagers) who can't handle their psychedellics.</p><p>A subsequent trip at 15mg 2 weeks later proved to be much more rewarding, though still kind of light like the drug's cousin, AMT, minus the chills and jaw-clenching.</p>",
 "year": "2003",
 "id": "29359",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-19T08:00:00.000Z",
 "views": "9685",
 "dose": {}
}
