{
 "id": 2936,
 "title": "Nice But Takes Time Coming On",
 "date": {
  "submission": "2005-09-30T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Ady Qad",
  "gender": "Male",
  "weight": 76
 },
 "dose": [
  {
   "time": "0",
   "amount": "162.5 mg",
   "administration": "oral",
   "substance": "Pharms - Propoxyphene",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1625 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "It's a Friday evening, normally I'd be toking on a spliff, but there is a bad batch of hash doing the rounds, so I decided to lay off it for a week. As a substitute I would probably take about 4-5 30mg codeine (neat, generic) pills, which were actually prescribed for me a couple a months ago for persistent dry cough.   But guess what - I ran out! Bored and wanting to feel high - I go to medicine cupboard in the bath-room and find Co-proxamol tablets, that my father was using ages ago, for some joint pain.  Opening the box, I take out the side effects leaflet - It states that they are opioid analgesics, just what was said on the codeine leaflet. ",
  "I check on the net what the LD 50 (lethal dose for about 50% of people) is and found it to be 500mg with the toxic effects being membrane stabilizing effects on the heart  sounds harsh, but the drug is used by millions to relieve pain and double or triple dosing of the therapeutic dose of 2 tablets is not known to cause any problems. The tablets contained 32.5 mg of dextropropoxyphene each.",
  "I calculated for the effect I got from the codeine, that 5 tablets of Co-proxamol would be sufficient for a decent narcotic high.  I must note that these tablets also contain paracetamol [UK term for acetaminophen] at 325mg a tablet.  Hence I calculated that I would be ingesting 1625mg of paracetamol - higher than the recommended two-tablet dose (1000mg) but hey who gives a fuck about an extra 625mg when 20000 (20 gram) is the generally accepted lethal dose. [Erowid Note: Acetaminophen (paracetamol) can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]",
  "T - 22:00 Take 5 tablets with some Lucozade orange, on an empty stomach.",
  "T - 23:00 I can feel something, but the coming up is now where near as fast as codeine, which takes effects in about 30 min (on empty stomach)",
  "T - 23:30 I am definitely feeling the high coming on - heaviness in the head, slight facial flushing, feeling of calm and warmth.  I am not fully peaked yet.",
  "T - 0:00 Now I am peaked, there is feelings of itchiness on my scalp, euphoria, mild drowsiness, increased sweating on the forehead , again the calm and warmth sensations have increased.  The effects are similar to codeine, but the initial dizziness that I get when taking codeine is virtually absent.  All stresses of the day seem to diminish. ",
  "The euphoria is hard to describe, it is a downer, but NOT in the sense of alcohol (etc.) The closest comparison that I can make of the high is to cannabis but the silly thoughts, munchies, and  stronger drowsiness arent there.  I just feel calm and content, can be better or equal to cannabis.   I have to take narcotics (opiates) to feel the type of euphoria!",
  "The euphoria I got from the dextropropoxyphene is not as potent as codeine.  Although with codeine, the coming up tends to be fast and causes dizziness.  After peaking the effects with codeine are more noticeable and intoxicating compared with dextropropoxyphene.",
  "Conclusion - Dextropropoxyphene is an alright drug occasionally with a pleasurable mild high, but it isnt as euphoric and tranquilizing as typical common 'mild- moderate' opiates like codeine, DF118 or Buprenorphine."
 ],
 "erowid": {
  "id": "19647",
  "citation": " Ady Qad. \"Nice But Takes Time Coming On: experience with Propoxyphene (ID 19647)\". Erowid.org. Sep 30, 2005. erowid.org/exp/19647",
  "substance": "Propoxyphene",
  "views": "59176"
 }
}
