{
 "title": "The Flu Pill",
 "author": "Meilikhios",
 "citation": " Meilikhios. \"The Flu Pill: experience with 4-Fluoroamphetamine (ID 29381)\". Erowid.org. Dec 21, 2003. erowid.org/exp/29381",
 "substance": "4-Fluoroamphetamine",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "120 mg",
   "oral",
   "4-Fluoroamphetamine"
  ]
 ],
 "report": "<p>4-FA aka 4-FMP aka 4-FluoroAmphetamine.</p><p>I took 120mg of the fumarate on an empty stomach. It took an hour to kick in.</p><p>Physically it felt like a cross between being stoned and having the flu. Sometimes some chills showing up. There was also some moderate hyperthermia as often with amphetamines. Moderate heart beat acceleration. Mentally, there was a kind of matter of fact calmness, an emotionnal smooth bluntness so to speak, a tinge of cannabis-like stoning and some psychedelic-like emotional sensitivity. There was no mood lift in sight and in fact a mood that was slightly grim/sad and neutral at the same time. Pupils were dilated. After 6h i could still feel it but it was very weak and subtle, almost residual. It was never unpleasant nor threatening, but it wasn't pleasant either. It just was. There was also a faint anorexia but i ate a pizza nonetheless (i was having dinner in a restaurant with friends). Dry mouth for sure. Mini me was out to lunch. I went to sleep at about T+7h without much problem.</p><p>The next day (ie now at T+21h ) i had chills and even goose-bumps from time to time which have eventually subdued. I also have some aches coming and going on my ears, fingers and temples and my kidneys don't feel in their best of shapes. There is still a persistent anorexia (still haven't eaten) and i feel a touch of nausea could show up if i were presented food. A slight mental spaciness and i really still feel as if i have the begining of a flu. My head feels weird, almost absent. I'm not in my best of moods either, kinda down and a bit fragile physically and mentally.</p><p>All in all it's not a pretty picture. It was boring, nothing interesting at all, just a waste of time. Smoking a joint of good cannabis or taking codeine instead would have been mentally stronger and more interesting ! Now i feel sick.</p><p>I wasn't expecting this at all from what i had read. I was expecting better than that in fact, something between amphetamine and MDMA. It was light years away from either. I don't know if it's because my stuff could've degraded in solution or because i underdosed, but this is basically not something that i'm going to repeat EVER. I just flushed the rest of my vial.</p><p>Restrospectively, it seems to me like this is a toxic compound.</p><p>I would advise to steer clear of it.</p><p>Moral of the story : being a psychonaut comes with a price...</p>",
 "year": "2003",
 "id": "29381",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-21T08:00:00.000Z",
 "views": "38752",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "4-Fluoroamphetamine"
  }
 ]
}
