{
 "title": "Waking Up From Reality",
 "author": "Rebecca",
 "citation": " Rebecca. \"Waking Up From Reality: experience with LSD (ID 294)\". Erowid.org. Aug 20, 2001. erowid.org/exp/294",
 "substance": "LSD",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>Did you ever want to wake up from reality?  Sure, it sounds great...something out of the Matrix right?  Well let me tell you right now that you wont be happy with what you wake up from, and that acid is not just some fun drug to give you a light show...and it isnt the way to some greater truth either.  Last weekend I reached the peak of what acid tries to show us, and it wasnt at all what I wanted to see.  This is what happens when you lose your grip on reality.  Its long, but its very important.</p><p>A large portion of my life was determined to come closer to the truth of our existence, and to find the meaning in it all.  Despite what some of my friends now think, my life was basically led sober.  I didnt smoke pot until high school, and it was very infrequent, cigarettes only started when I was 16, and I didnt drop acid until September of 1999...first semester at college.  I will try to relay last nights experience to you as best I can, it is up to you what you believe and what you dont...Im just telling you what happened, and whats true to me.</p><p>To start with the basics, you have to understand some of my own mindset in order to understand how acid affected that mindset.  When I was in second grade I started getting nightmares...and I stopped sleeping.  After a while, the nightmares went away and were replaced with vibrant, realistic dreams--although the insomnia was, and is, still a problem.  The dreams were so real that at times I was sure that they were more of a psychic connection to something--dreams foretelling events.  I began meditating, researched different religious views, taught myself lucid dreaming, and a portion of my life was spent just searching for some great truth; some answer to our existence.</p><p>I was introduced to acid by someone who I thought had answers, in all actuality, he had just burnt himself out so badly that he was perpetually tripping; he neglected to mention that part.  In the beginning, my trips were wonderful.  The first person I tripped with led me on an intellectual journey, which was just what I was looking for.  I soon began to love acid, I believed it was helping lead me to some sort of enlightenment.  Above all, my mind was so intact during tripping, that I honestly didnt believe that I could have a bad trip.  Thats one beautiful thing about acid, how you can control it so well, just takes a strong mind...a strong mind that I thought I had. </p><p>With an interval of tripping at least once every two weeks, my time in meditation became much more realistic, and much 'deeper.'  In fact, the last time I meditated before my last trip (which happened to be in class), I actually saw visions and was brought to such a state that my teacher's voice became obsolete.  This, coupled with a new set of intense dreams that woke me up in tears, left me with a frightened, yet curious feeling.  I knew that many religions believe that a series of intense dreams means that a change is coming, I didnt expect this.</p><p>I took three black pyramids with my friends Blair and Chris.  I had taken pyramids before, but never that many...two normally fried me out pretty good.  I also gave blood the day before.  Everything was all right until we were on the roof.  On the roof the world began to be completely unrealistic...but it was somehow soothing, so I didnt really think about it.  Before I knew it everything around me had become a dream world (note, I was off the roof by then).  Blair and Chris werent Blair and Chris in real life, but dreams; images of my mind that didnt exist.  I dont know exactly when the changeover occurred, but once I was there that strong mind that Ive always had retreated way behind my eyes...and I watched myself perma-frying on acid.  I knew there was something wrong, but I couldnt quite get it across.  I mentioned dying, I mentioned not coming back from the trip, but how were my two companions to comprehend my actual meaning when they were tripping just the same as any ordinary person, on LSD.  During the dream, some other consciousness inside me took over.  I cant decide whether it was created by the acid, or brought out by the acid...most likely the latter.</p><p>While in afterglow, Ive been going through the pictures in my mind...trying to piece together exactly what I was doing.  I just remember everything being so foggy, just like a dream...and I felt like I was just floating around in a world created by my mind.  Blair and Chris were completely freaked out, I thought it was a game...Blair decided he had to drive me home, it didnt even cross my mind that he was tripping and it was dangerous.  I was gone, I was in lala land...and thats just fucked up.</p><p>They dropped me off in my dorm room, and left me to whatever was going on inside my head.  When they left, I started noticing how real my room was.  It had never looked that real in a dream before.  I pulled my covers over my head to sleep, and then it started to sink in that something was seriously wrong.  I jumped out of bed and looked around, and I saw the room from a mind that was perfectly sober.  I relayed the night through my mind, and I reminded myself that I had taken acid.  However, acid had never done anything like that to me before; Id always been in such control.  Then what I had to figure out was how my mind seemed as if I had just woken from a dream, as if I hadnt taken acid at all. </p><p>I turned on my TV and as I watched the faces swirling in rainbow colors, I suddenly realized that my body was still tripping, hard.  I had woken from whatever cocoon I was in, mentally, but my body was still there.  Thats when it all hit me.  I suddenly realized that somehow I let go of reality, and that now that I had control of my mind I had to struggle to keep it.  Being in an empty dorm room made it difficult. I could hear noises of people turning on and off showers upstairs.  I heard people talking in the hall...I even thought I heard my phone ringing, but there was no one there.  I was without any contact to real living people, and I was in a small, brightly-lit dorm room, completely fucked out of my mind.</p><p>The first thing I felt when I 'woke up' was completely outside of myself.  I was always such an introverted person; Im content with being alone.  I know that to other people I have many 'nafs', as the Hindus say...or masks, for us Westerners.  However, to myself, I felt comfort inside of my own mind, and I knew myself very well.  When I broke out of the dream-world, those masks left me.  That comfort zone, left me.  And I was very, very alone.</p><p>My first hypothesis was that I had snapped out of my other body and that that body was completely perma-fried somewhere back in reality.  From there I wondered if I had snapped into another dimension and was forced to now walk around an empty world that looked like the old one.  I was even convinced for a while that I had died, it was the only thing that really made sense.</p><p>I had hypothesized that the world is full of new and old souls (Ive always felt I was an old soul, even before I heard the term).  I thought that since I could wake up from the dream-state of reality, that it was like any other dream state.  Normal dreams are created by the one consciousness of the dreamer.  So to wake up from 'reality' made me believe that we were all connected to one consciousness, but until we all, collectively, realized it, we couldnt move on.  This is what kind killed the idea that I may have popped into another dimension without everyone else.</p><p>The next hypothesis was that since I popped out of my own consciousness that my life would just be a chore, since its no longer real to me.  I didnt know how I would be able to continue, and for a second actually contemplated suicide.  The only reason that I didnt, was that I remembered how much my life means to me.  Ive always thought it to be so wonderful to just be alive, and I knew that I was still young and had a lot ahead of me...so I just wanted to fight to stay lucid while my body tripped out.</p><p>The first thing I needed to do was to make contact with someone real, to force myself to believe that there was some sort of reality, even if not to me, to the other people living it.  So, I called a trusted friend of mine, whom I had taken on her first trip.  She was very patient with me as I told her of what I had experienced, and threw out ideas at her.  At that point there were some conclusions that were so real that I couldnt doubt them.  I concluded that there was no God, or higher power (due to how alone I felt).  I concluded that new souls are reincarnated until they become old souls and are ready to move on.  I concluded that when they moved on they would be new souls and have to learn again to fend for themselves (again due to how alone I felt).  I concluded that life indeed was a dream within a dream (thank you Poe), but that the knowledge of that didnt solve a thing.</p><p>Mandalin brought me back to the house where my tripping companions were (who hadnt gotten back, so I left a note).  She then brought me to the first person I tripped with, since he had mentioned snapping four times, he had a lot of explaining to do.</p><p>We debated a little bit, over what it all meant, but then I had to ask him, if I would fully recover.  He said that he sees a rainbow pattern all the time, but hes teaching himself not to see it, and he has trip willies and acid mouth randomly.  He also mentioned that every time hes really hungry, or tired, or stoned, he starts tripping. </p><p>This brought my mind back to something I had read on a FAQ sheet about LSD.  It had said that flashback are caused due to the high amount of psychological stress to the brain, not from the acid staying in your brain or your spine all the time.  So I logically knew that the only reason for my body to continue to suffer ill-effects from acid was the fact that I was now fighting so hard to clear my head, that I had somehow twisted my brain to believing that the side-effects of tripping were real.  What I had to focus on is that the world around me is real--to me and the people in it--but the effects of tripping were a drug that would wear off as long as I didnt cling to them.  The hardest thing to get rid of was the pattern.  As soon as I 'woke up' I saw a very vibrant, moving, rainbow pattern that surrounded everything.  However, through intense focusing, I was able to rid myself of it...Im sure itll return at random.</p><p>In afterglow I fought a constant battle between two halves: the part of my mind that had it all figured out, and the part of my mind that was just a little girl who was in a little dream world.  On one hand, I know that I freaked the hell out of the people I tripped with, but I didnt know it at the time.  I know that I ruined two friendships, and possibly more than that.  I know that I did things while I was frying that I didnt mean to do, that werent real.  Whatever dream I was in, it wasnt coming from my own thoughts...it was coming from whatever small child lies inside of me.  However, I know that Blair and Chris will never truly believe that, and to them Ill just be a really fucked up girl who wigged out on them.  I dont have enough apologies for that. </p><p>On the other hand, I had to deal with everything I had just seen, and try to put myself back together so that I wouldnt crack...and I was very, very close to cracking.  After having my reality ripped out from underneath me, I had to choose what to accept.  This is what Ive learned: acid is a drug that stimulates a dream world.  If you take too much, or let yourself go to much, the world will become a dream...in other words, it is possible to actually lose touch with reality; no matter how 'put-together' you think you are.  Now, whether that dream-world is actually a view of our reality in a new light, or just a trick of the brain, that I cant say, but I can say that to stay sane, you have to admit the possibility that you were just under the influence of a drug which showed you one view of what the 'truth' may be. </p><p>Above all, I learned that I was asking the wrong questions.  What I was shown through acid, I had already hypothesized...but for some reason I thought I had to experience it before my time.  What I know is that even if we had the answers to what comes next, no matter how wonderful or horrible, we dont want to know, it doesnt matter now and our brains do not have the capacity to rationalize it.  What we have, is a life, a reality.  Whether its real or false, its real to us, and thats what we need to keep in mind.  Instead of asking for answers from another realm, just enjoy the one youre in, and try to better it. </p><p>If you think that Im being ignorant by trying to push away what could be real knowledge, then fine, go for it...it will be the worst experience of your life if you actually experience it--and I know you still wont believe that, I didnt, but at least let me now say, 'I told you so.'  Live the dream; theres nothing wrong with dreaming.</p>",
 "year": "2000",
 "id": "294",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-08-20T07:00:00.000Z",
 "views": "25571"
}
