{
 "id": 294,
 "title": "Tales from the Bong",
 "date": {
  "submission": "2004-10-01T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Brett W.",
  "gender": "Male",
  "weight": 87
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "Method: Smoked via dry bong, usual used for cannabis.",
  "Environment: Living room, early evening. Eastenders had finished, I set a bean bag and a pillow down on my usual spot on the floor, turned of the telly. Quiet, with low-level lighting.",
  "Mindset: Looking forward to furthering my Salvia knowledge (boy did I manage that!)",
  "Sitter: My wife, watching while reading a good book.",
  "I have read much about this herb, I have rechecked and re-read postings across the web and spoken to 4 people who have also tried it. (3 of which drank a 10x concentrate and passed out!)",
  "I bought 1/2 ounce dried from a mail order place in the UK.",
  "I initially tested with 2 leaves , smoked via a water bong, the effects where pleasant but mild. I re-read accounts of similar dosages and they where all talking about turning off the lights to enhance the visuals. So I thought OK change the environment, turn off the telly and music and try to concentrate on the experience to see if it brought on more, like coaxing the last out of a trip by closing your eyes and letting the visuals take you. So this time, a Monday night, I thought up the dosage and see if I can bring on the visuals better, I wanted the full salvia trip.",
  "I crumbled two leaves into my trusty bong (9:45pm), this time emptied of water (to reduce the cooling of the smoke) and smoked them down in a couple of harsh hits. At this point I realised that the dosage was to small, so I managed to crumble another two leaves into the bowl and started again. After a couple of puffs the desired effects took hold. I managed to place the bong and lighter down on the floor, get myself comfortable on my beanbag and settled down. Eyes closed the universe took off. (9:50pm)",
  "It feels like taking off on a rocket, the rush is so strong that I was pinned to the floor by Salvia gravity, I can feel the universe ripping past (and through) my body, tugging at my flesh as I accelerate into oblivion. This rush was accompanied by a sharp pain in my right ankle and across my face and shoulders, my ankle pain seemed to be a pivotal point of this part of the trip, as if the pain was the centre of my consciousness and the rest of my world was revolving around it as if on a wheel (sounds mad, because it was!). This lasted for a short time (what is time when on Salvia?), although this was daunting, it was nothing to what happened next.",
  "I opened my eyes, to see visuals that I have never seen before!!! The entire world echoed and kaleidoscoped round on itself, I lost all reality, nothing was real. I could see my hands but in some weird tessellation that stopped my vision just short of comprehension and echoed the real world as tiny fragments. The worlds was limited to 2D (or was it?), and I had the feeling of sitting on a real white knuckle ride, the kind where you kind of wish that you hadn't gotten on, but you're sure going to survive the ride.  A kind of elation combined with pure terror, not unpleasant, but what a RUSH!!!!!! A found myself sitting upright, gripping my ankles (kiss U'r arse good bye time!!), only aware that I was holding my ankles by the fact that I had something in my hands and something was around my ankles, no real vision or comprehension just a feeling (later confirmed by my wife), re-assuring myself that the experience was short lived and it would calm down soon. I reckon around 5 minutes of this occurred, beyond anywhere I have ever been before.",
  "Bloody amazing, another universe. Nothing made any sense! When I came back, I found the visuals where very strong still, but they had dropped to levels that can be encountered with good LSD (2 Pink Floyds level - STRONG!!), the visuals where eye candy not the full blown disruption of time and space previously felt. (10:05pm) I felt exhilarated, full of energy, a mighty fine feeling. Like playing in whitewater and winning, a real sense of achievement! Although still very tripped out, I tried to relate this experience to my wife, but she says that I was talking nonsense, although at the time I was giving a detailed encounter of another universe. The next 10 minutes where filled with this feeling of mind adventures and my wife telling me how messed up I still was.",
  "The Strong Acid style visuals calmed to mild hippy party acid style (ohms), lots of geometric neon eye candy, just perforating the edges of vision and small geometric echoes of detailed surfaces (PC keyboard and printed text).",
  "Then came a strong urge to document the experience, to further that new frontier experience.",
  "The entire trip last about 10 minutes of WAY OUT THERE!!!!",
  "                       20 minutes of strong LSD,",
  "                       15 minutes of mellow mushrooms,",
  "                       10 minutes of residual trippiness (very mild)",
  "The pain felt during the beginning of the trip was totally gone (not that it was ever really a problem, but I have encountered severe pain while LSD tripping before and believe I know how to handle it). I was left with a very mild headache and continued with my usual evening of smoking and drinking vodka based mixes. The elation calmed down within an hour and I spent a lot of time reflecting on the experience.",
  "Conclusion:",
  "This is beyond hallucinogenic, this is travelling without moving! This stuff is really to be respected, it is like nothing else out there. I have down hundreds of LSD trips and thousand of liberty caps over the years, trippy on up to 4 tabs and up to 250 shrooms at a time, but nothing even comes close to the salvia D experience! Respect it, read up on it and get a sitter, if just to tell you how messed up you where!"
 ],
 "erowid": {
  "id": "10416",
  "citation": " Brett W.. \"Tales from the Bong: experience with Salvia divinorum (ID 10416)\". Erowid.org. Oct 1, 2004. erowid.org/exp/10416",
  "substance": "Salvia divinorum",
  "views": "10413"
 }
}
