{
 "id": 2941,
 "title": "The Fundamental Workings of My Mind",
 "date": {
  "submission": "2000-06-19T07:00:00.000Z"
 },
 "author": {
  "name": "Anonymous"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.75",
    "unit": "ml"
   },
   "administration": "IM",
   "substance": "Ketamine",
   "form": "liquid"
  }
 ],
 "report": [
  "Ketamine was a pretty unique experience. Though it had a PCP like feel to it, I never have entered such a *completely* altered state on PCP. It was certainly nothing like codeine, but I've never done huge amounts of codeine.",
  "About 5 minutes after taking an intramuscular injection of about .75 cc, I entered a state that was similar to being in a lucid dream. Although I was still conscious of my surroundings, I had no control over my body (not that it mattered). The experience was visual in the sense that I could 'see' my thoughts. Except that the 'seeing' was at a more fundamental level than the 2-3 dimensional imagery normally associated with eyesight. I could still hear the ambient music in the room, though it seemed to be in another world.",
  "At one point I decided I wanted to say something. The process of uttering the word 'cool' involved a seemingly involved process of building up, through different layers of conscious activity, the mental (and I suppose physical) steps required for such an effort. I 'watched' as the fundamental sparks of my mind came together and bubbled up to a surface level of consciousness where the simple act was finally executed. It was as though I was experiencing the fundamental workings of my mind from both a participant and observer viewpoint. I think the anesthetic qualities of the drug kept the mental noise level way down, and perhaps slowed all my thought processes down also, making this possible. At no time did I experience any anxiety or negative feelings. Mostly fascination. No aliens either, but I can see how one could mistaken the redirected experience of one's own thoughts as a visit from something external. I've never met aliens on DMT either, so YMMV. :)",
  "This altered state was somewhat similar to nodding out on Heroin, which was also a bit like lucid dreaming, but different than Ketamine in that it is clouded by feelings of overwhelming sensuality/pleasure. The Ketamine experience was 'cleaner' in that my mind seemed freer to explore itself and not as weighted down by feeling too good.",
  "I guess I should mention that I was in the afterglow of some very pure MDMA (and possible a little lsd, I can't quite remember) when I did this, so my experience cannot be considered to be a controlled experiment.",
  "BTW, doing a small amount of K, where you maintain motor control, is not much more astounding than PCP, or I suppose codeine, etc. It is the full incapacitating dose that is truly amazing. But this is not something you want to do on a regular basis. In fact, though I may be wrong on this, I would consider such an adventure to be a high risk one. Please be careful."
 ],
 "erowid": {
  "id": "1967",
  "citation": " Anonymous. \"The Fundamental Workings of My Mind: experience with Ketamine (ID 1967)\". Erowid.org. Jun 19, 2000. erowid.org/exp/1967",
  "substance": "Ketamine",
  "views": "5688"
 }
}
