{
 "title": "Destoryed My Face",
 "author": "Mikado155",
 "citation": " Mikado155. \"Destoryed My Face: experience with DXM (ID 29437)\". Erowid.org. Dec 12, 2007. erowid.org/exp/29437",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "report": "<p>Me and a friend decided to trip one night on DXM.  It wasn't my first time 'dexing', I'd done it a few times before and each time had vomited, but always ended up tripping nicely.  Of all my friends, I was the only one with a vomiting problem, but had always overlooked it as a necessary evil - kind of like knowing you are going to vomit from drinking too much alcohol but you do it anyways.  However, things went much worse for me this time.</p><p>I chugged two bottles of Robitessum Max Strength and my friend did one Vicks 44.  After about an hour, I started to vomit (as I expected too) and didn't think much of it.  However, I soon made a second run for the bathroom and started to gag uncontrollably.  Nothing was left in my stomach, yet my body kept causing me to try and vomit.  The force of my gags eventually lead to every one of my capillaries in my face, neck, and chest bursting, leaving me looking like a purple freak.</p><p>The next day my parents forced me to go to the doctors where I had to admit, teary eyed, to abusing 'cough syrup.'  I have never been more ashamed in my life, and in the process of having this little bit of 'fun' have risked my reputation with my family, friends, peers, and girlfriend.</p><p>The moral of this story is never underestimate any kind of drug.  Although the dosage won't kill you outright, the potetial for it to cause some sort of dramatic side effects is way too high.  Every time you dex, you risk ending up like me.  Is tripping really worth looking like a burn victim for a month?</p>",
 "year": "2003",
 "id": "29437",
 "gender": "Male",
 "timestamp": "2007-12-12T08:00:00.000Z",
 "views": "3717",
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
