{
 "title": "I was Dead and Reborn that Day",
 "author": "Maco",
 "citation": " Maco. \"I was Dead and Reborn that Day: experience with Mushrooms (P. semilanceata), Passion Flower, Cannabis & Zolpidem (ID 29453)\". Erowid.org. Jun 30, 2005. erowid.org/exp/29453",
 "substance": "Mushrooms (P. semilanceata), Passion Flower, Cannabis & Zolpidem",
 "bodyweight": "75 kg",
 "report": [
  "<p>It was early afternoon the 22 December, I got of work early because of the upcoming holiday. I didn't plan the trip, but while chatting with an old friend he decided to start the Christmas celebration with 15mg 2C-B, he kept insisting on that I should join him on the journey to the place of spells and fairies. When he finally convinced me I thought I'd take a 'light' trip, I consider myself a fairly experienced tripper, I've done LSD, 2C-B and several other psychedelic drugs numerous times. I've previously done 3 g Semilanceata and 5.5 g Cubensis on separate occasions so I figured 1.5 g wouldn't beat my mind up too much.",
  "T+0:00",
  "I weighted the mushrooms carefully, previous dosage mistakes on other substances have made me cautious. Previous to eating the mushrooms I smoked a good-sized bowl of quality weed, I smoke every day and to my experience it usually mix quite well with tripping. The bowl got me quite stoned and kept me calm during the first effects of the mushrooms.",
  "T+0:40",
  "The effects of the mushrooms are growing stronger, nothing unusual at this point. My tripping chat-friend is already way up there and tells me that he needs to spend some time outdoors, I don't argue with him because I know the urge to pay a visit to mother nature can be very overwhelming. I decide it's time for me to take a break from the computer as well, I find my way halfway to the kitchen when I remember that I've got some passionflower stashed upstairs. I know that MAOIs are supposed to boost mushrooms, and I feel quite comfortable in the trip so far so I decide to make myself some tea. I've never tried MAOIs during a trip before, but the added ingredient doesn't concern me at all. An unknown amount of passionflower is soaked in boiling water and stirred until it's cooled down, I filter the brew and bring it back to my computer.",
  "T+1:00",
  "I loaded another bowl of weed and enjoyed it along with the tea. After the second bowl the mushroom shifted gears on me, I got a slight headache and decided to rest for a while. I find my way to the bed, manage to place 'The Wall' in the DVD and threw myself on my bed trying to get rid of the annoying headache.",
  "Approx. T+1:30",
  "What am I doing? What's happening to me? The questions are rushing trough my head, which is no longer bothering me, the headache is gone. I can still hear Pink Floyd playing in the background, I do not dare open my eyes however. The effects of the mushrooms are increasing constantly and is starting to become quite overwhelming, I'm not sure how long I've been tripping but I realise that I should be peaking soon. I've got the shivers and pull every blanket I've got far up over my head. Here, buried in blankets the music starts fading in and out. I start thinking about me, my past and my future. The thoughts form images of both beauty and terror, the images turns into white flashing lights which travel trough my brain faster than the thoughts themselves.",
  "Approx. T+2:00",
  "The effects of the mushroom are still increasing, I feel completely lost and realise that I'm about to die. As I await my doom the flashes through my head is getting more and more intense, but I feel completely indifferent to the fact that my ego is being completely disassembled. The music is gone, I'm not sure where there the DVD is still playing, but it doesn't matter, nothing matters anymore. I temporarily 'pass out', I'm aware that I'm passed out but I'm not aware of anything in the real world. All my senses are gone, I now only exist in this world of nothingness, I'm dead.",
  "T+3:00",
  "I wake up with a strong feeling of satisfaction, I've been reborn. I've never experienced an ego death before, I've feared from the day I insufflated way too much 2C-B, I almost died back then as well. I get out of my bed, still tripping like never before. I carefully start to investigate my apartment and soon find it to boring to remain inside. I dress warm and go out for a walk. It's cold outside, about -15C, the snowstorm the night before has formed beautiful snow formations in the trees, on the ground, the roofs of the houses... The sky is completely clear, the stars form beautiful fractal formations in the sky, much like the clouds in my LSD-experiences. Suddenly I find myself outside my house again, deciding to go in and get another cup of tea but this time I stick to Yellow Label.",
  "T+4:30",
  "I can feel the effects decreasing and decide to make the best of the upcoming afterglow, I slice up a grapefruit and bring it and the tea up to my bedroom. I carefully study the bed before laying down, the place where I died, the place where I was reborn. I put on the TV and manage to find an entertaining show which I decide to follow at the best of my abilities.",
  "T+6:00",
  "The effects are still present but much barely noticeable, I always seems to have shorter effects of mushrooms than my friends strangely enough. I decide to smoke another bowl of weed, after this bowl I feel how exhausted my mind actually is and decide to head back to the bed to get some sleep. This proved impossible though, my mind was still doing overtime so I swallowed 5mg Stilnox just to slow things down a bit. Half an hour later I fall asleep.",
  "Conclusion:",
  "I don't know where there it was the MAOI that triggered this extreme experience, but it seems likely. This trip blew my mind like a stick of dynamite, much more extreme than any other mushroom trip I've ever had. I don't know if I should classify this experience as a good one or a bad one, it was neither, but I've learned that MAOIs can be an interesting additive to mushrooms. I will, without a doubt, try this again sometime in the future. This combo should be handled with care though, you just might end up with more than you bargained for.</p>"
 ],
 "year": "2003",
 "id": "29453",
 "gender": "Male",
 "views": "27016",
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:40",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(tea)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 6:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2005-06-30T07:00:00.000Z"
}
