{
 "title": "A Pleasant Stimulant",
 "author": "Keeper",
 "citation": " Keeper. \"A Pleasant Stimulant: experience with BZP (ID 2947)\". Erowid.org. Sep 16, 2000. erowid.org/exp/2947",
 "substance": "BZP",
 "bodyweight": "145 lb",
 "report": "<p>I have been experimenting with BZP HCl recently to see if it would be a mild substitute for ecstasy or maybe even some sort of speed. I have never tried speed (caffeine) before but I think I have a good idea what it would</p><p>be like. I was a VERY hyper kid and in high school when people started doing drugs teachers would ask me If I had taken speed. Btw, I'm a sloppy writer so please excuse errors of any sort.</p><p>Anyway I have tried it about 7 times all in different doses, oral and smoked. It's a white powder that clumps into nuggets easily if allowed contact with moisture.</p><p>I'm not going to go into any actual trip reports because my activities while high were very mundane and the drug didn't change them much. I watched a few movies played computer games etc...</p><p>THE BREAK DOWN:</p><p>* Time. coming up -> 1.5 hours, peak -> 2.5 hours, come down -> 3+</p><p>* Oral Doses: 20mg, 60mg, 100mg, 200mg, 300mg. This is interesting. After I got past about 100mg I couldn't tell the difference. hmmmmmm.</p><p>* Smoking: I smoked the stuff a few times in probably around 7mg doses. It tasted poor but not bad. It hit me about 2 mins after smoking. I got a mild rush which was nice but taking it orally lasted longer and heating</p><p>chemicals can change their make up and I'm not sure I want to mess with that.</p><p>* Snorting: I never snorted it because the one dab I put in my nose burned. I would imagine snorting to be VERY painful.</p><p>* Pros: Mild-medium euphoria, 'warm fuzzy' body high resembling a low dose of X (~30mg+). Increased energy and need to talk/relate/move etc... I also found rubbing things and playing with objects like hair to be fun and feel quite good. The one way it was most like x was the feelings of being open, connected, love. This aspect was actually pretty damn close to x (75mg+). But then again emotional openness is often very psychosomatic. So that means when you take it expect a love filled emotional trip and it will happen.</p><p>* Cons: Fast heart beat (90-120Bpm), VERY sweaty arm pits. I would sweat like a hog for 3 some hours, Mild body temperature increase. Mild nausea for about 10-15 mins about 40 mins after dosing, bad cotton mouth, dilated pupils.</p><p>* Neutral: Loss of appetite, hard to sleep, difficulty climaxing.</p><p>* Addiction: This stuff is addicting. It's very mild, tolerable, cheap and makes you feel that much better. That combo makes addiction very possible.</p><p>* Interactions: I found BZPto mix VERY well with weed. The body high was increased from about 30mg of X to maybe 50mg+. The bad part was that the cotton mouth became unbearable. BZP also mixed well with booze and GHB. I didn't feel that much drunker but the speed like effects went up, which was odd. I plan to mix it with LSD and similars in the future.</p><p>THE BOTTOM LINE: BZP seems to be a mild stimulant with effects similar to  30mg of X or a very low dose of amphetamine. A good relation we can make to speed is caffeine. 100mg of BZP had the speedy effects of ~3 cups of coffee. BZP would mix good with x if you DON'T dance on it but I still don't think it would be a good replacement, it's just not powerful enough.</p><p>As for replacing some sort of speed I believe it could replace a low dose of amphetamine (and I again I have never done it) but it could never replace meth or anything of that caliber. If your looking for speed look some place else!  I'm sure BZP would be great for recovering speed, x etc.. addicts. All in all I like it as a mild drug, for mild activites. but decide for yourself!!</p><p>The question I'm left with for myself, is BZP too mild to be good alone? It was DEFINITELY good to mix other drugs with but alone was just not enough to sustain a drug induced night. I'm kind of glad it isn't too strong though. If it was any stronger then it is it would be too addicting to be even worth experimenting with.</p>",
 "year": "2000",
 "id": "2947",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-16T07:00:00.000Z",
 "views": "21923",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(powder / crystals)"
  }
 }
}
