{
 "title": "Everything is Beautiful When I'm High",
 "author": "I'll Never Tell",
 "citation": " I'll Never Tell. \"Everything is Beautiful When I'm High: experience with Cocaine (ID 29473)\". Erowid.org. Jun 16, 2007. erowid.org/exp/29473",
 "substance": "Cocaine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cocaine"
  ]
 ],
 "report": "<p>I don't know if I was the only one who ever felt this way, but I was a little hesitant to try the stuff. It was, after all, coke, something I had never heard anything nice about. But we all feel like experimenting sometimes, don't we? And that was simply the day for me.</p><p>Once I had my drugs in my hand, and once it was my turn in rotation, I loaded up the stem and took my first hit. I was told to hold the smoke as long as I could, and so I did. Once I exhaled I noticed my lips and tongue got really tingly, nearly numb. My heart was speeding up. But most importantly, for some reason, everything was all right. Any problems I had had before, or anything that was worrying me at the time, was completely GONE.</p><p>I suddenly felt extremely emotionally attached to everyone around me, and I told them so. I was so much more opened up. I didn't hold anything back. If I thought the girl sitting in front of me was beautiful - I told her. If I was head over heals in love, more so than I had ever been before, with the guy sitting next to me - I whispered it in his ear. NOTHING held me back from expressing myself in any way. I read poetry and looked at paintings. I just had the urge to, and I got every one of them. I saw their inner meanings, the thought behind them, the beauty in each and every one. And I loved that feeling.</p><p>But everything THAT good comes with a price. Coming down from the high, which only lasts about 10-30 minutes for me, is almost emotionally painful. Also, I think I may have smoked a little bit too much that time. It was a really rough night once I had gotten home. I couldn't sleep. I finally got 2 hours of it, but it was already daytime. I was extremely nauseated, I had a raging headache, and sometimes I had some really odd thoughts. For example, for about 5 minutes straight, although it seemed like much longer, I was convinced I was going to die. Convinced! I thought I had somehow OD'd. But, of course, I didn't die. How else would I be telling you this story?</p><p>There were also mild hallucinations. I have a poster across from my bed, and while I was looking at it, the faces disappeared. Their heads were there, but no features. Also, you know how you see things in your peripheral vision? Like when you see something move out of the corner of your eye? Yeah, you're not supposed to see that stuff head on. It scared me pretty bad. The worst hallucination that night was looking at my trash can and seeing, for a split second, a human hand with moving fingers. I closed my eyes, shook my head, and then looked again, and it was gone. My whole body ached too. And I was afraid to take any medication because I didn't know how it would react with the coke in my system.</p><p>I'd do it again, I'd just be more careful with how much I smoked.</p>",
 "year": "2003",
 "id": "29473",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-06-16T07:00:00.000Z",
 "views": "5147"
}
