{
 "title": "Hell of a Night",
 "author": "Jello",
 "citation": " Jello. \"Hell of a Night: experience with 2C-T-7 (ID 2948)\". Erowid.org. Sep 13, 2000. erowid.org/exp/2948",
 "substance": "2C-T-7",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "15 mg",
  "insufflated",
  "2C-T-7",
  "(powder / crystals)"
 ],
 "report": "<p>Well folks, I had a hell of a night.  I got my shipment of 2CT7 today.  I cut up a 15 (+/-) mg dose using the graph paper method.  At 8:00 PM I snorted it.  I started to feel the effects about 10 minutes later.  I start feeling very jittery and queasy.  I look in the mirror and the first thing I think is: UhOh, I took too much! Extreme visuals and stomach cramping getting worse.  My face is swirling in the mirror, constatly moving.  It is getting hard to breathe and everything is confusing.</p><p>O man! I think I just overdosed.  I had to leave the house hoping that it would mellow out. Extreme visuals and time dilation.  I walk to the park and its getting worse.  I cant breathe.  Sweat is squirting out of my pores.  I come to realize: I JUST FUCKING ODed! It keeps getting stronger in waves the stomach cramps have me about to scream.  Well my friends I bit the bullet and called 911 from the park.  'Hi , my dumbass just ODed, I'm at the park. Help!'.  Well my saviors show up and ask thirty-thousand questions and hook me up to a heart monitor and O2.  On the way to the hospital the stomach cramps have made me scream in pain.  And insane visual and auditory halucinations are the most intense I have ever seen.  The ride to the hospital is agony, I keep telling them that Valium will counter-act it but they cant give it.  At this point I was seriously thinking I might die.</p><p>My pulse was 160, B/P very high and I can't breathe.  At this point I am screaming full blast and holding my stomach.  I get to the hospital and they stare at me for a hour before they finally give me Ataban(sp?) [erowid note: probably Ativan].  It helps some and they later give another dose.  One dose of this stuff will bring a Heroin addict back from death.  I go in and out of sleep for about four hours and then I am released about 1:30am.  I am sleepy but still having some visual effects.</p><p>Well, the doctor says that there does not seem to be any permanent damage and I am free to be a dumbass for many years to come. It seems that I am hypersensitive to 2ct7 or really screwed up on the dosage.  Well kiddies the moral of the story is to start with a very low dose and work up from that.</p>",
 "year": "",
 "id": "2948",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-13T07:00:00.000Z",
 "views": "15777",
 "dose": {}
}
