{
 "title": "This is the End, Beautiful Friend",
 "author": "CosmicComedian",
 "citation": " CosmicComedian. \"This is the End, Beautiful Friend: experience with DXM & Magnesium (ID 29523)\". Erowid.org. Sep 11, 2008. erowid.org/exp/29523",
 "substance": "DXM & Magnesium",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "750 mg",
   "oral",
   "Vitamins / Supplements",
   "",
   "",
   "900 mg",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "report": "<p>I've done DXM many times before, along with cannabis and mushrooms. However, this is the end. It was truly the worst experience of my life.</p><p>I had been planning a fourth plateau dosage for a while now, as I had done some extremely mind-bending third plateau dosages in the weeks previous. I wanted to see God, to open up my spirituality. So, 20 minutes prior the trip I took 750 mg magnesium, my first time doing magnesium with DXM, and then proceeded to take the 900 mg DXM dose in Robitussin CoughGels. It took a while to kick in as I spread it out over about 50 minutes, then when I looked at the clock I felt connections with the numbers. I don't remember the time, but I probably started taking it around 7 to 8 and looked at the clock at 9:30 or so.</p><p>I was completely out of it, and I mean COMPLETELY. I don't remember anything until later, when my dad was carrying me down the stairs. 'Just like when I was a little infant,' I thought to myself, and everything became very sad. My mother then drove me to the emergency room, since my pupils were huge and my heart was beating so hard and fast they could see it in my chest. I don't remember the emergency room until I woke up several hours later, with a very sad and tired mother next to me and a tube in my dick, the most uncomfortable thing ever. She said she had found me in my room last night on Robitussin Coughgels which she found in my drawer, and I just held her hand and talked to her.</p><p>I hadn't smoked pot in a couple weeks luckily, so when they did a drug test pot turned out negative. However, PCP turned out 100% positive! I have never done PCP, so I explained to the doctor how DXM creates a false-positive for PCP and he called poison control and confirmed it. Then the nurse pulled the tube out of my dick, a very painful process, and my mom walked me to the car with her arm around mine. This was at about 3:30 in the morning, and neither of us had gotten any sleep.</p><p>I walked back into my room when I got home still tripping pretty hard, and saw my dad had torn all my posters off my walls and searched my room, confiscating my glass bowl in the process. This was a truly bad experience. I'm done with DXM for this lifetime.</p>",
 "year": "2003",
 "id": "29523",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-11T07:00:00.000Z",
 "views": "17549",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "750 mg",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": ""
  }
 ]
}
