{
 "title": "Quite an Enjoyable Experience",
 "author": "Darke",
 "citation": " Darke. \"Quite an Enjoyable Experience: experience with Leonotis leonurus (Wild Dagga) (ID 29541)\". Erowid.org. Dec 28, 2003. erowid.org/exp/29541",
 "substance": "Leonotis leonurus (Wild Dagga)",
 "bodyweight": "135 lb",
 "report": "<p>I've had a small sampler pack of Wild Dagga leaves hanging around for awhile. Yesterday I decided to try them and see if the claims of a mild euphoric effect were true. In the mid afternoon I went up to my room and took out a large 2 chamber waterpipe and filled the bowl. I was excited yet a little nervous about trying this new herb. I had read several other experiences here on Erowid before trying it. I lit the bowl and began to smoke. Supposedly this stuff, especially the leaves, is supposed to have a thick, black, smoke with a rather unpleasant aroma. There was copius smoke, however it was not disgusting or incredibly thick, in fact I rather enjoyed the thickness and aroma. I held it down for several seconds and then exhaled. I noticed that I felt slightly relaxed and was not nervous as I had been when I started. I took another hit and upon exhaling noticed that the digits on my alarm clock looked as though they were floating slightly in front of the clock itself. However, this went away quickly.</p><p>I also noticed that I was starting to have a very relaxed comfortable feeling. At that point I began smoking away and watching the smoke drift away in a slight euphoric daze when I exhaled. The wafting smoke just seemed so beautiful at the time, and I was even sort of thinking about what it might be like to BE the smoke and float gracefully like that. I stopped after I had completed three bowls and just sat for a few minutes marveling over this feeling of comfort. The effects lasted for about half an hour after that. Then I decided to listen to some heavy metal music. I noticed that listening to it I felt like my heart was working a little bit harder and I was a little short of breath, though I did not make the connection until I read another user's comments about the stuff not mixing well with metal. I've also read that this stuff is about as addictive as tobacco. I have to say I have only smoked it once thus far and I'm already addicted, but not in a bad way.</p><p>I really like this stuff. I'd recommend it, just don't listen to any fast paced music or try to watch any action movies or anything like that when using it. I think I'm going to get some Dagga seeds and try growing some of my own. I am a gardener, and the idea of the large clusters of flowers sounds very attractive to me. I would also like to try mixing this with valerian, because valerian also gives me a mild floaty, comfortable feeling.</p>",
 "year": "2003",
 "id": "29541",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-28T08:00:00.000Z",
 "views": "42325",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(leaves)"
  }
 }
}
