{
 "title": "Pseudo-Speedball",
 "author": "lazyvegan",
 "citation": " lazyvegan. \"Pseudo-Speedball: experience with Poppy Tea, Cocaine, & Sildenafil (Viagra) (ID 29551)\". Erowid.org. Jan 3, 2004. erowid.org/exp/29551",
 "substance": "Poppy Tea, Cocaine, & Sildenafil (Viagra)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "20 buttons",
   "oral",
   "Poppies - Opium",
   "(tea)",
   "",
   "1.75 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "",
   "100 mg",
   "oral",
   "Pharms - Sildenafil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2003",
   "29551",
   "Male",
   "",
   "Not Given",
   "Jan 3, 2004",
   "58554",
   " "
  ]
 ],
 "report": "<p>This was an attempt at recreating an infamous 'speedball', without actually injecting anything. For those that don't know, a 'speedball' is slang for an IV injection of a mixture of heroin and cocaine. I have in the past had extensive experience with this combo, but have long ago abandoned experimentation with IV injection of substances with questionable purity...</p><p>..i always found heroin boring on it's own, and I find cocaine on it's own to do nothing more than make me over-stimulated, anxious, and want nothing more than more cocaine (even though i thouroughly dislike the entire experience!)..HOWEVER!!.. when mixed together and mainlined, it is by far one of the most 'physically' pleasurable experiences i have ever encountered..and i have pretty much encountered 'everything'...i find the opiate takes the edge off the cocaine, and the coke keeps me from nodding out in an otherwise blissful opiate-hole...i find together they provide me with a very balanced, flowing, ying-yang style experience...anywayz..</p><p>..Over the past few years, i have developed a wonderful, well-balanced relationship with the beautiful poppy pod..on occasion, i have found the pure, natural blend of alkaloids found in this beutiful flower to be far superior to the heroin i gave up years ago...although poppy tea is one of my favorite experiences, lately i have been dreaming about the 'speedballs' of times gone by..</p><p>The Experiment: To try and re-create the 'speedball' experience using only poppy tea and cocaine. Before attempting this experiment, i exausted all my web-resources, and i was very suprised to find not a single trip-report anywhere regarding this combo, other than when taken IV..</p><p>The Experience: My lady-friend C and i settled in for another few daze at my earthbound spacebase. We had about 40 poppy pods and 3.5 g. of cocaine. Judging on previous experience, i would say both were of the highest quality. After a few cups of tea we both began to feel the delightful warmth of the poppy tea take over our bodies and mind..i was once again perfectly completly contempt..i had no desire to change this feeling, but i was on a mission!!..i set up two good size lines for C and I...The coke added a new, delightful, pleasurable dimesion to my otherwise perfectly satisfying opiate high. There was none of the edginess or complete distaste with the chemical i normally associate with cocaine..the two were synergizing exactly as i has hoped..I liked it!..i vowed to never do coke again unless it was with poppies..but none of this changed the fact that i 'still' had to redose with coke every half-hour to maintain this feeling..that is the ticket price of cocaine..but the urge to re-dose was not nearly as strong compared to if i had done just coke alone..because each time i came down, i came down 'very' gently onto a nice, fuzzy , cushy, opiate buzz..very nice..none of the nasty  typical coke comedown..just as i had hoped..anywayz, this continued very nicely throughout the night..we watched some movies, ect..</p><p>..at some point i decided to eat a 100 mg viagra pill i had aquired..i had hoped this might counteract some of the problems i have encountered maintaining an erection when using either of these drugs alone..i found it made it no easier for me to 'get' an erection, however once i had one, it was maintained 'indefinetly', until i went to pee, make more tea, ect..this is in contrast to the previously mentioned problems just 'maintaning' on these drugs..definatly an improvement!..</p><p>..the only other change came when we had only about 1/2 g. of coke left...we decided to IV the rest over the course of a few shots..having long since given up this practice, i was a bit hesitent..but i agreed...we timed the last few shots to coincide everytime with the new cup of tea we made..i would say when taken in this manner, the IV coke rush, mixed with the fresh tea rush reminded me 'very' much of a speedball..i also found the previous coke sniffing/tea combo to come very close to the real thing, however without the IV rush..however, i have always found coke IV to be 'very' different from other methods of administration..either way it was a very interesting evening..peace..</p>"
}
