{
 "title": "Thoroughly Engaged",
 "author": "ChuckStar",
 "citation": " ChuckStar. \"Thoroughly Engaged: experience with DPT (ID 29563)\". Erowid.org. Jan 11, 2007. erowid.org/exp/29563",
 "substance": "DPT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "35 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>December 27</p><p>Experience- First Time</p><p>Setting- Movie Theater 'Lord Of The Rings: Return Of The King</p><p>I was somewhat skeptical about taking this substance in such a public place. I've heard that it can really scare people and I was curious as to how I would react. I was aware that it affected different people in different ways. Anyways, I decided to try it anyways since I have had a higher tolerance to other substances in the past.</p><p>8:20 PM  -  Insufflated 35mg of DPT. No immediate changes, horrible smell, chewed wintergreen gum to mask the taste of the drip.</p><p>8:30 PM  -  Notice slight change in mood, increased energy but still feeling relaxed.</p><p>8:40 PM  -  We arrived at the movie theater. Purchasing tickets was somewhat difficult, I had trouble thinking about what I needed to say in order to purchase tickets. My friend bought his ticket first, so that made it easier, I just said, 'One for the same thing as him', everything worked out fine. At the concession stand I was definitely starting to feel it more intensely and I even had trouble being able to order my drink, but even then, I was able to do this without raising suspicion.</p><p>8:50 PM  -  The previews began and immediately I was enthralled in every second of each preview. The loud noises of the theater enhanced each moment and I felt as if I couldn't even turn away. After each preview I felt blown away at how powerfully it enthralled me into watching it. All I could seem to say was 'wow. Physically I was very relaxed and almost felt as if I was hovering over my chair. I was never chilled throughout the experience, and remained feeling warm the whole time.</p><p>9:00 PM  -  The movie began. Feeling physically the same as 10 minutes before, that feeling lasted for most of the movie (Its about 200 minutes long).  Again like in the previews, I was intensely into each part, and could hardly turn away. I could definitely tell that this substance was enhancing this experience, but that it also didn't give me the frightening effects that I had been weary about. This pleased me.</p><p>10:00 PM  -  I decided that I couldn't explore all the effects of this substance while sitting in my chair in the movie; I needed to move around a little. I decided to make a quick trip to the bathroom. The walk to the bathroom was interesting, I accidentally walked about halfway to the womens bathroom before realizing I was walking towards the wrong one, so I had to abruptly turn around and walk to completely opposite way. I think a couple people saw this and stared at me, but I didn't care, it was a simple mistake. When I came into the bathroom I went into a stall and stared at the red tiles ahead of me. I was looking for any distortions, or that 'breathing' effect. Nothing, but for some reason I couldn't help but stare at the tiles longer, something about them engaged me for a short amount of time. I finally realized I was missing the movie and returned to the theater.</p><p>11:30 PM  -  The event of the past 90 minutes didn't change much, and I remained feeling relaxed in my chair and engaged in the movie. I could start to feel myself coming down around this time.</p><p>12:20 PM  -  The movie ended and me and my friend walked out the back door.  The cold winter breeze hit me but it felt nice, I was almost all the way down at this point and by the time I arrived home, I was completely down.</p><p>My first experience of DPT was exactly how I had hoped.  I was worried at first about how I would react but my suspicions of sensitivity to this substance seemed to be right. I saw an excellent movie during this experience and the substance kept me enthralled with the movie the entire time. I can't wait to increase my dosage to see if a higher dose will enhance this substance.</p>",
 "year": "2003",
 "id": "29563",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-11T08:00:00.000Z",
 "views": "4920"
}
