{
 "id": 2959,
 "title": "Obtaining Ketamine",
 "date": {
  "submission": "2000-06-20T07:00:00.000Z",
  "experience": "1994-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "abarnett"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Ketamine"
  }
 ],
 "report": [
  "So here's the counterpoint - I've done Ketamine several times and think it's *great*, best drug I've ever tried. I do know some people who have had miserable times with it, and it does make a lot of people puke, although I never have. It is an intense disassociative, meaning that while you are tripping you won't have much of a clue about what's going on around you - the trip is mostly in your own head. Your body becomes numb, like a shot of novocaine all over.",
  "One friend of mine who took it thought he had died, but he wasn't frightened or upset by this at all, which should give you some indication of just how weird things can get. These experiences were all achieved by injecting Ketamine into muscle tissue. I have also tried crystalizing and snorting it, which was not that great - it just made me feel really dopey and out of it, plus I looked so strung out that people were staring at me on the street. The two ways to get Ketamine are 1) as was previously suggested, filching it from a vet's office (which would be illegal and is not recommended), or from anyplace that does surgery on cats such as a shelter (but don't steal! very bad. Don't do drugs either.) or 2) Ketamine is an OTC drug in Mexico, available from any veterinary pharmaceutical supply (not as hard to find as you might think). However, the Ketamine sold in Mexico is only half the strength of pharmaceutical K available to vets, so do at least 100 cc's for a good trip - U.S. Ketamine recommended dosage for fun is 50-100 cc's.",
  "I would not recommend trying to mainline Ketamine - it does not improve the trip and is more dangerous. On a final note, Ketamine is very safe except for obvious things (I would hope) like needles (DON'T SHARE!) and puking while out of it, being used in emergency surgery on a regular basis in doses up to 10 times the recreational dose since the Korean war. Not a bad idea to have a straight person around while you're doing it, especially if there are open flames nearby or anything like that. Like I said, you'll be very out of it. Have fun."
 ],
 "erowid": {
  "id": "1971",
  "citation": " abarnett. \"Obtaining Ketamine: experience with Ketamine (ID 1971)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1971",
  "substance": "Ketamine",
  "views": "11261"
 }
}
