{
 "title": "Light At the End of the Tunnel",
 "author": "Piss",
 "citation": " Piss. \"Light At the End of the Tunnel: experience with DXM (ID 2960)\". Erowid.org. Dec 16, 2001. erowid.org/exp/2960",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "report": "<p>The previous week I had been at a party when I ran into a friend of mine who was selling powdered DXM in capsules. I had never tried any dissasociatives before, so I jumped at my chance and bought a pill.</p><p>I waited a few days to sort of mentally prepare myself, And I dropped the pill at 9:00.  It took about an hour for the effects to kick in. This drug hits my body HARD! I felt light, but at the same time like I was being sucked into my bed. Time was extremely distorted, so I lost track of it.</p><p>My vision started to fuzz, and I eventually started to see double. The effect was pretty uncomfortable; I couldn't really focus on anything so I just closed my eyes. My closed eye visuals consisted mostly of unfamiliar rooms and chambers, really uneventful. My body started to tremble and itch in a nagging and uncomfortable way. My motorskills were shot, in fact, to the point where I could NOT get up from the bed. At this point I started to have the sensation of wild body distortions.</p><p>My body felt like it was flowing and reshaping itself. I have had similar body halucinations on LSD where my body would feel the same as my closed eye visuals looked, but with LSD the feeling is of being a two dimensional pattern while this was very three dimensional. This didn't seem to last very long, but the feeling was replaced with an overwhelming sensation of being sucked out of my body. This continued throughout the trip with several different themes including being sucked down into a hole, or just drifting around outside.</p><p>At one point I had the sensation of traveling very quickly up out of my body and I remember thinking 'I'm getting really high now!', when the peak experience of my trip hit. Suddenly I was sure that I had died. It's strange how it worked, it was like my inner dialogue all of the sudden yelled 'Oh my god, your dead. you've died!', but the thought seemed beyond my control, almost as if it came from the drug rather than me.</p><p>Then as clearly as anything in my life I felt on my skin and even saw through my eyelids what I can only describe as the light at the end of the tunnel. It was such a calming, pleasant, sensation that I reached my arms out to embrace it. I felt truly at peace and I was happy to know that I didn't have to worry about any of my problems anymore. For a second it was pure bliss, but then I realised that I was still aware of my body so I must not be dead. This made the whole experience semm cheapened, and I quickly returned to my body. My peak experience seemed to take only a few seconds, but all these things occured to me in that time. The trip went on for a few hours after and kinda petered out.</p><p>Although the feeling of dying seemed artificial, It also made me put a lot of things in my life into a new perspective, and since then I feel that my life has been more satisfying. I have had a hundred psychedelic experiences prior to doing dex, but this trip seemed to finally show me what I was looking for in my inner voyages. I havn't felt a strong need to trip on anything since, and previously I've had a reputation as an acid addict.</p>",
 "year": "2000",
 "id": "2960",
 "timestamp": "2001-12-16T08:00:00.000Z",
 "views": "12951",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(powder / crystals)"
  }
 ]
}
