{
 "id": 2960,
 "title": "Slow Death",
 "date": {
  "submission": "2009-06-19T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Grb",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "substance": "Various",
   "form": "daily"
  }
 ],
 "report": [
  "Like most users I started out drinking, smoking pot and hash, but my introduction into harder drugs was a bit different. I had tried coke and meth a couple of times, but I'll never forget one night drunk off my ass me and my friends went out to go pick someone up. We were on foot and being an idiot I kicked a flower pot. Now living in Canada and it being January there was frozen water in the pot and I smashed my big toenail and my foot started bleeding badly. Good thing I was drunk, so I didn't feel the pain for about 20 minutes. When I got back to were I was earlier, someone (I think I was at a party, hey this was in '95!) offered me a tiny yellow pill. It was only 8mg! It was what became my life. Dilaudid.",
  "I got totally fucked up for 8 hours and since booze and dilaudid are downers my high was basically doubled. All it took was one pill, I was obsessed. Pretty soon I found myself waking up in the morning with a terrible feeling in my stomach and all I could think about was that little yellow pill. I started using pure pharmacutical morphine, and taking 200mg seconal pills as well as using dilaudid every day. You see I knew people that had connections. Doctor's, Pharmacisits, people who'd rob pharmacies. Put it this way; I'D HAVE TO USE EVEN BEFORE MY FIRST CIGARETTE OF THE DAY! From Jan '95 to Oct '01 I used EVERY DAY. Once in a while I'd clean up just to lower my tolerance so I'd get more high. I sold drugs to support my habit, and was rather good at it. Let's just say I'd never had a day job.",
  "I'll fast forward to Oct 4th 2001. This was the day I decided to stop, you see I should be dead 1000 times over, but even after numerous od's I was still around. By this point in my life I was about as physically and mentally addicted to drugs as you could get. ABSOLUTLEY EVERYTHING CAME SECOND TO MY HABIT. I did not want to face withdrawl but I knew it was time to pay the piper. What came next was the worst possible 2 months of my life. The drugs I was taking were extremely physically addictive, but rehab wasn't for me. I somehow was able to take a step back and realize I was going to die, so I locked myself away in my house (well I'd been locked away pretty much since '96) and the feeling in my stomach felt like I'd been starving for food but there was none to come. My joints in my body felt like they were on fire, I hallucinated that there were bugs crawling all over me, I threw up blood constantly, and my mind was racing trying to find my next fix. I spent everyday for 2 months like this, just praying to die, I couldn't even cry I was just fucking broken. Thank God I had no weapons available because I would have killed myself.",
  "I have been somewhat clean for over a year now (I smoke pot), and I don't think about it as much which is good, because the psychological addiction lasts a long, long time. Everyone has a choice in life, I don't tell others how to live but, I pray that no-one has to go through what I did for the past 7 years."
 ],
 "erowid": {
  "id": "19714",
  "citation": " Grb. \"Slow Death: experience with Hydromorphone (Dilaudid), Morphine & Barbituates (Seconal) (ID 19714)\". Erowid.org. Jun 19, 2009. erowid.org/exp/19714",
  "substance": "Hydromorphone (Dilaudid), Morphine & Barbituates (Seconal)",
  "views": "11589"
 }
}
