{
 "title": "Complete Loss of Reality",
 "author": "thel0rax",
 "citation": " thel0rax. \"Complete Loss of Reality: experience with 5-MeO-AMT, Salvia divinorum (extract) & Cannabis (ID 29602)\". Erowid.org. Feb 26, 2004. erowid.org/exp/29602",
 "substance": "5-MeO-AMT, Salvia divinorum (extract) & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "5.0 mg",
  "oral",
  "5-MeO-AMT",
  "(powder / crystals)",
  "",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(extract)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>After I recieved 2 5mg hits of 5-MeO-AMT mixed in vodka, me and my friend planned a day to trip. Right before we took it, we decided to go buy some salvia, figuring it would be interesting to try both 5-MeO-AMT and salvia at the same time. I had never done 5-MeO-AMT before, but I had done AMT before.</p><p>We took the 5-MeO-AMT and started walking around. We went to a nature trail and smoked a few bowls. By now we were feeling pretty good. I was feeling it more than my friend though. We then walked back to the main area of town where we  called a friend, and he picked us up. We hung out and then headed up to his house. This is when we decided to try smoking the salvia. After taking a few bong hits of weed, we then packed it with salvia. My friend took a hit first, and laughed his ass off. Next my friend packed a hit for himself, and then packed one for me. I told him to make a small one because I was feeling the halucinagens a lot more than my friend was. I took one hit, and didn't feel much. I didn't get the huge rush like I did the first time I did it, just the after effects. So he packed me another hit, only this time he accidentally packed a really big one. I didn't care though.. I was tripping and apathetic about it. I took the hit and thought to myself 'this is going to be fucked up'.</p><p>Next thing I know, I'm in some sort of alternate dimension. I couldn't see a single thing. everything was a tessalation of random objects in the room. I didn't know where I was or what was going on. I thought a seriously bad event had just happened. I knew it had to do with drugs, but not exactly sure what. I thought people were getting mad at me because I couldn't find the real world. I started to see things and realized I was in my friend's room. I slowly tried to grasp onto them and become part of reality. It was like my brain was absorbing some part of the universe that I normally don't have access to, and slowly I had to find my way back to the real universe. Eventually I saw my friend and heard him talking about me. All I could see was him surrounded by the tessalations that hadn't gone away yet. After about two minutes I finally realized that I just hit salvia and I said to my friend 'I have no opinion about it'. I thought he wanted to know how the drug was, but apparently he never said anything like that.</p><p>According to my friends, after I took the second hit I started laughing hysterically for about 30 seconds, then all of a sudden I just stopped, and stared straight forward. I started twitching and making really weird movements. I wasn't responding to anything they said. A few words came out, like 'you keep- ', but that was it.</p><p>This was by far the most intense drug experience I've ever had. I have never lost complete grasp on reality. Just because these drugs were legal doesn't mean they won't do quite a number on your brain. I never really did have any opinion on whether this was a good or bad experience. I was just happy that I was in my friend's room and not in serious trouble!</p>",
 "year": "2003",
 "id": "29602",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-26T08:00:00.000Z",
 "views": "10925",
 "dose": {}
}
