{
 "title": "Warped, Wild & WHOA!",
 "author": "Inosolan",
 "citation": " Inosolan. \"Warped, Wild & WHOA!: experience with Mushrooms (ID 29618)\". Erowid.org. Jun 11, 2007. erowid.org/exp/29618",
 "substance": "Mushrooms",
 "bodyweight": "210 lb",
 "report": "<p>Yesterday was one of the most intense mushroom trips I've ever experienced in my lifetime. Two days before our trip we bought 4 grams of dried magic mushrooms. At first I was quite mad because I'm an experienced cosmonaut and what we got for the money we paid just seemed like too much of a rip-off, but after taking them and experiencing the effects of these little treasures we understood why we got so little. We didn't need much. Also being experienced with mushrooms, I know that anything under 4 grams is usually a mild trip; this simply wasn't so with these. I wish I knew what kind they were simply because I grow my own mushrooms and I would love to experiment with these. They were definately of the psilocybe genre, but I don't think they were cubensis, simply because they didn't look much like them. The stems (dried, mind you) were from 3 to 6 inces long, wide at the bottom and narrowing towards the cap. The cap itsself was fairly small, gills dark brown and the top being brown and tan with brown specks all over it.</p><p>We divvied up the mushrooms at around 12:00 that afternoon, chewed them up well and swallowed. The taste was a bit stronger than other mushrooms I've taken orally, but they were fairly simple to get down and hold down. We had eaten little that day and the previous one simply to avoid upset stomachs and to experience the full effects of the mushrooms. After ingesting them, we decided to lie down and watch a movie simply to pass the time before they started to take hold. Now, I'm used to mushrooms taking at least 45 minutes to effect me, but these little crazies really snuck up on both of us. After about no more than 15-20 minutes we both felt ourselves start to vibrate and our muscles tensing up. I asked my girlfriend 'Do you feel that?' and she nodded, giggling, and I asked her to join me on the bed so we could be close together.</p><p>These mushrooms came on strong, no waiting, no thinking Im starting to feel something when Im not. They hit full tilt boogie. When a mushroom trip starts, its a deffinate feeling of 'oh shit, oh shit, oh shit, ohshitohshitohshitohshit!' I can see how this would scare a person new to them, because it was mildly uncomfortable to me, and I'm used to it. The muscles in my legs began contracting for several seconds at a time before releasing. The same for my arms and neck. Not that it was uncomfortable after several minutes, really. It was all wildly hilarious to both of us. We got the same giggling experience I used to get off of marijuana when I first started smoking. Laughing for no reason. Spirits generally high. By this time things had started to take on a soft glow and things on the walls had started to barely move.</p><p>Its at this time that I decided we should go out for a walk for fear of running into my girlfriends dad and not being able to hide the fact that I was being ripped off the face of the planet and thrown onto another strange, beautiful world where everything moves and everything glows. After much conflict with our own vision and work at getting ourselves to move, we prepared for a walk. Her father was home by this time, and talking to him was hard, simply because we couldnt hear what he was saying. Somehow we told him that we were going for a walk and would be back soon.</p><p>We headed off down the street. Walking down a busy street on hallucingens can be a bad idea. Especially when a storm is blowing in. The wind was howling and pushing us from side to side, and clouds were zooming past us. This part I know I wasnt hallucinating because my girlfriend saw the same thing and told us we should head home for fear of getting caught in a rainstorm on strong mushrooms. Not the best idea, Im sure, so we headed back home. Walking was hard. Every part of my body felt like it was being pulled in different directions, and my vision wasnt exactly trustworthy. Luckily we made it back home and sat down on the porch for a while because, well, I guess it seemed like the right thing to do.</p><p>By this time the mushrooms were almost in full swing. Mushrooms are a full body experience, every sense is distorted and changed into something else. EVERYTHING moves. Sort of like being in a hall of mirrors at a carnival and watching everything bend and contort. The strange thing is that I feel my own body bending in weird shapes. I feel like a bubble in a lava lamp. We decided to go to our room and lie back on the bed and watch the show. When I got to the room, I was at the peak of my trip. It was around 1:00PM by this time, and I was flying high.</p><p>We turned on music (White Zombie - Astro Creep 2000) and simply watched everything move and bend. Pictures on the wall came to life and strange patterns began developing, covering everything. These patterns were the most interesting part of my trip. Ive heard of alot of people seeing mushrooms and whatnot. I saw letters. Mostly J and M, but several others were there. They were small, no more than an inch tall, and they all seemed to be part of one another. Every single surface I looked at seemed to have these patterns of letters embossed all over them, these letters persisted throughout the trip all the way up to the end.</p><p>Music takes on a brand new meaning while on mushrooms. It seems to pick me up and carry me with it. Pictures sing along with it, and it takes on a whole new sound that I simply dont hear when sober. It's impossible to understand anything being said in music. Its all one sound, coming near me and drawing away (yes, even sound contorts and moves), totally surrounding me and comforting me. Being a musician myself, I love music. But my perception of music is forever changed for the better. Music is beautiful while on mushrooms. Everything is beautiful.</p><p>One of the cleches when it comes to drugs is 'Whoa, the colors!' Whoever said that must have been on mushrooms, because its very true. Rainbows dance across my field of vision, seemingly on everything. On peoples faces, on the walls, on pictures, even in the toilet! Everything is warped. The words 'Warped' and 'Wild' seemed to come to my mind over and over as a way to describe the trip, but in all honesty there is nothing in the human language capable of describing the feeling of being on hallucinogenic mushrooms. Its as if Im in a constant sexual explosion, always building towards orgasm. Which brings me to another topic. Sexual conduct during a mushroom trip is both good and bad. It feels totally amazing to touch another human while tripping. Actual intercourse seems to be somewhat impossible, simply because it would be hard to get my body to move in the way it would have to. Everything feels slowed down, and I move very slowly.</p><p>At around 3:00 that afternoon we started to come down from the effects. Things stopped moving so much and our thought processes dramatically cleared. We were able to understand what was happening around us in the 'real world' and were able to coherantly talk to one another. The patterns of letters began to reduce although I could still see them if I looked. After the trip our spirits were high and we were both very happy. Laughing, joking with one another and talking about what we had seen. I asked my girlfriend what had been taught to her from the trip, she said 'Trust'. When she asked me the same thing I told her 'Happiness'. The world is a very beautiful place, and nothing can teach this more than mushrooms. I have been forever changed.</p><p>After fully coming down, I start to feel drained. Tripping takes alot out of me, and the need to sleep overtook me. I had a slight headache and my legs and neck hurt a bit. The only parts of tripping mushrooms that I dont like are the paranoia and being so tense. This feeling is much more pronounced with other psychedelics such as LSD, but it is easy to deal with. Even after sleeping several hours I still have the headache, although, all-in-all Im very pleased with my trip.</p>",
 "year": "2003",
 "id": "29618",
 "gender": "Male",
 "timestamp": "2007-06-11T07:00:00.000Z",
 "views": "2981",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
