{
 "title": "A Trip to the ER",
 "author": "Mitch",
 "citation": " Mitch. \"A Trip to the ER: experience with DXM with CPM (ID 29628)\". Erowid.org. Dec 19, 2007. erowid.org/exp/29628",
 "substance": "DXM with CPM",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "480 mg",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "report": "</p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] </p><p>My friend and I were planning on going on a Robo-trip, so we each took 16 Coricidin tablets.  I took 8 at first, but he insisted I finish the box.  He downed his, threw up, and I went into the bathroom to throw up.  As soon as I threw up I started seeing stars, like someone had punched me in the head or something.  I layed down on the couch and looked outside.  It was dark and grey.  I knew I took too many.  I didn't want anyone to touch me or anything like that.  I told my friend I was going to die, and he said to me, 'no, you're not.  You're just in a hole right now, and you need to get out of it.'  I didn't know what he was talking about, and I replied, 'It's okay.  Everyone dies someday and today is my day to die.'</p><p>He went downstairs, and I picked up the box to try and find a 1-800 number to call about an overdose.  I didn't find one, so I called 9-1-1.  As soon as the guy answered I said, 'I just took a box of cold pills and I'm going to die.'  An ambulance came over and I was hysterical in the back of the ambulance.  They gave me some charcoal to drink (which tastes nasty) and left me in a room to trip.</p><p>I finally came down about 3 hours later, and decided I wanted to leave; so I pulled off my electrodes and pulled out my I.V.  There was blood running down my arm, blood on my jeans, blood on the stretcher, blood everywhere.  They got a security guard to watch me after that, but I must say I will never put that crap into my system again.  Be very careful with this drug, it will enhance whatever mood you're feeling at the time.  Just because it's legal, doesn't mean it's safe.</p>",
 "year": "2003",
 "id": "29628",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-19T08:00:00.000Z",
 "views": "11092"
}
