{
 "title": "The Body is Merely a Vessel",
 "author": "FibonacciDreams",
 "citation": " FibonacciDreams. \"The Body is Merely a Vessel: experience with Salvia divinorum (ID 29623)\". Erowid.org. Jul 22, 2007. erowid.org/exp/29623",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(plant material)"
 ],
 "report": "<p>In the past, salvia had been a great meditative assistant and served to sustain a positive outlook on life.  Ripping a couple hits off a bong usually resulted in the laughy, ethereal feeling.  It wasnt a substitute for anything else, though.</p><p>After school, on a beautiful september afternoon in kansas, a friend had invited a large number of people over.  I could not smoke any bud, barring a blood test in the next week, so I brought along a sack of salvia.  My friend came with, bringing along a 4 chambered, large capacity bong.  Sitting on a 2nd story deck, several gathered around the contraption and smoked.  After watching them, slighty jealous, I pulled out the Salvia.  A bowl was loaded to the brim and ready to be taken.  I had never tried smoking it out of this before, and was anxious to see what happened. </p><p>I took my first hit, held it in, and before taking my next breath, exhaled, immediately milked the bong afterwards.  The next hit came and went, and the too familiar 'weight' began pressing in on me.  I went to take a third hit but before I even could put face near the pipe, I felt a loss of control.  I dropped down to the ground, and slouched back against the wall.  I could hear people asking if I was ok, but I had no concern for that and the sounds hit me and seemed to mute off into the distance.</p><p>My visual field blurred and large coloured dots began floating around.  Rainbows fluttered up through the cracks in the decks slant pattern woodwork.  There were people there with no faces, coming and going as if in another dimension.  My thoughts raced and I realized mysteries so complex that nothing in reality compared to them.  I forgot everything I came up with almost instantly though, yet I was aware that I couldn't remember them.  I felt as if my soul unattached from my body, and I lay in a dream state.  It was not so much a lucid dream, as a realm that the conscious is involved in the subconcious's doings and undoings.  My body is merely a vessel, and my soul roamed freeeee! Time, hearing, taste, sight, all perceptions no longer meant anything. </p><p>Personally, I am not sure how or if I even could estimate how long I was in this alternate reality.  When I returned to base, it had only been 3 minutes, according to the people around me.  The afterglow of this drug is amazing.  Truly an amazing and very often misinterpreted entheogen.</p>",
 "year": "2003",
 "id": "29623",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-07-22T07:00:00.000Z",
 "views": "4109",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 }
}
