{
 "title": "Now I See the Wheel",
 "author": "Peth",
 "citation": " Peth. \"Now I See the Wheel: experience with Salvia divinorum (ID 29625)\". Erowid.org. Feb 27, 2007. erowid.org/exp/29625",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   "",
   " repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "report": "<p>1st time: About two years ago, a neighborhood punker kid brought what he claimed was salvia. He told me of the spiritualistic potential this legal plant entailed. I took one or two hits with absolutely no effect and never had the desire to try again until recently.</p><p>A little over two weeks ago, I purchased about four grams of Salvia Divinorum dried leaves from a local store.</p><p>2nd time: With a group of friends, took about five hits with minimal effects except some altered gravity sensations, clearer vision, and mild flushes. I felt something, but not nearly the salvinorin experience detailed by so many. Im not certain if it was the salvia or the leftover cannabis resin from the pipe or carryover sensations from the early morning intoxication or general placebo effects. Disappointed, we mixed the salvia with marijuana. Only the effects of marijuana were recognized.</p><p>3rd time: Took five big hits with my inexperienced brother watching. It was hard on my lung to smoke the dried leaf since I held each hit in for about twenty seconds. Same effects as last time, with a sensation that the earth was pulling me down (very mild).</p><p>4th time: Took eight powerful hits by myself with no new impressive effects.</p><p>Frustrated, I ordered the standardized extract x5 through an Internet company somewhere in the Netherlands. When it finally arrived, I couldnt wait to try with my friend Js new pipe.</p><p>1st hit: I was a little nervous since I was the only one who was smoking it. But for some reason, I was still confident that I would be able to handle it. I noticed the smoke tasted more potent. Within seconds, there was a burning/itching energy sensation that flowed through my entire body. I dont know why, but I associated the experience with the pattern of a round seven, visualizing this in my head. I had a strong sense of what I believed to be my spirit and felt like it was drowning underwater or melting to the ground.</p><p>In the meantime, I had the feeling that my tripsitters were laughing evil spirits and were encouraging my downfall. Then I remember my brother saying, You should lie down. I felt that he wanted me to lie down so that it would be easier for my soul to be taken without resistance. I forced myself up and ran upstairs in a paranoid tantrum. It felt like the earth was pulling me down (very strong), metaphorically like running on quicksand. As I ran back downstairs, the peak was over just as fast as it had begun. I was so confused about what just happened.</p><p>About ten minutes later, I tried again. This time I told my brother very sternly to watch me like a hawk and never leave my side. I also apologized to everyone for the accusations of trying to take my soul.</p><p>2nd hit: My brother began talking about Nicole Kidman to his roommate J. Although the conversation was completely innocent and superficial, I had assumed they were talking about how Nicole Kidman and other movie actors had tried salvia and had their souls taken away. I believed they were plotting a funeral for my soul. After a few more fearful seconds, I snapped out of my trance and was hysterical. My body was drenched with sweat. I began shouting at my brother for not keeping an eye on me (even though he did all along). As the peak effects wore off after two minutes, I began to put things into logical perspective. Out of the blue, I began to chuckle really hard for having such ludicrous ideas. But I couldnt stop laughing and the laughter continued on recursively for a few minutes.</p><p>Salvia Divinorum made me a solipsist and brought back memories from my old paranoia days of smoking weed. It also made me irrationally happy. I couldnt get enough and felt interrupted every time. I didnt expect a conclusion, but I needed at least a thesis to this madness. I waited about fifteen minutes and tried again.</p><p>3rd hit: I was in a deep calmer trance. The peak was still very intense, and I began to feel the objects around me spill their magnetic energies into me. Again, illogical possibilities seemed very plausible. I looked around the room and affirmed that we are part of this infinite circular slice. Ive read some reports describing a ferris wheel of consciousness, and now I understood. After the peak, I did get some closure. It was neither happy nor sad to me, only neutral that we are always part of this universal giant wheel. Under the influence or not, we are always part of this universal giant wheel. I still wonder why it is spherical.</p><p>More compulsive this time, I took another hit as soon as I was able to (maybe three minutes later). I promised myself it would be the last time for tonight, and I kept it.</p><p>4th hit: Dimensions again seemed very twisted. The sofa twenty feet away seemed like it was reachable without me having to get up and stretch my arm to touch it. I could touch the sofa with my mind, from the front, the back and the sides. Very interesting. I had more weird delusions of reality, and I shrugged them off immediately and laughed uncontrollably for three minutes until the peak was over. I loved the feeling of laughing in a trance state.</p><p>Summary:</p><p>Please be careful and dont underestimate this substance. Ive researched Salvia Divinorum quite a bit and I was still overwhelmed by the effects. Each time I tried salvia, the trips had their own unique and interesting characteristics. I did not feel any negative aftereffects, except for a mild afterglow that lasted about an hour.</p><p>I only wish that the salvinorin experience lasted longer so I could analyze and decipher my visions more. I felt that the onset, coming up and peak effects were simultaneous, immediate and overwhelmingly intense, but only lasted for two or three minutes at most. The coming down effects was mellow and relaxing, and resembled the experience of smoking dried leaf. In my opinion, the effects were less psychedelic, rushing and powerful in the familiar sense than 5-MeO-DMT, but more mentally involved and relevant for self-explorative purposes.</p><p>The dried leaves are shit (though Ive had at least three friends confirm that strong effects can be achieved from smoking dried leaf, but do expect some failed attempts). I guess its unfair to make any generalizations. My advice is to obtain the standardized extracts if possible. If youre not familiar with the salvinorin experience, then it would be wise to start with x5. Trust me, you dont have to smoke much to feel the effects.</p><p>Salvia Divinorum is without question the most unique and mysterious psychoactive substance Ive ever encountered. Its effects are incomparable to any substance Ive ever taken. I would recommend salvia to anyone interested in exploring altered state consciousness.</p>",
 "year": "2003",
 "id": "29625",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-02-27T08:00:00.000Z",
 "views": "3289",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ]
}
