{
 "title": "3 DMT Events",
 "author": "Anonymous",
 "citation": " Anonymous. \"3 DMT Events: experience with DMT (ID 2964)\". Erowid.org. Sep 14, 2000. erowid.org/exp/2964",
 "substance": "DMT",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "DMT",
  "(powder / crystals)"
 ],
 "report": "<p>I wanted to write about a recent nn-DMT experience.  This was the third time i had gotten effects from smoking nn-DMT.  I first heard of dmt back in 1992, via terrance mckenna, and it sounded extremely intriguing.  For years, I wished to try it.  I got a chance in 1994, but it didn't work.  I didn't get a chance again until just last year.  That time i experienced colorful geometric closed-eye visuals that seemed very 'lifelike'.  But, having heard all these intense trip reports over the years, i figured i had only touched the surface of what the drug could be, since the experience was pretty mild.  After that, I had a little bit of dmt which I held onto, waiting for a time when I felt ready to smoke it again.</p><p>I tried again early this year, and had a similiar experience to the first time -- colorful geometric lifelike closed-eye visuals. But again, i felt like i was only on the 'threshold' and surely there must be a deeper level.  Again, i waited until it seemed right to try again.</p><p>Last week, i had several days of very happy, calm, and focused emotions.  I always try to limit my drug-use to such mindsets (though am quite often not successful!).  One day, i realized it was an ideal time to try the dmt again, and so i did. I smoked once in the afternoon, and then twice that night. The experiences were quite similiar to my first two experiences, but this time i felt like i was not 'on the threshold' -- i was right in it.  I suspect i could do more and get a more intense experience, but i have the feeling that would just be 'more of the same' (which would be fine! Just saying i felt like i 'got it').</p><p>I learned that the visual aspects seem to work best behind closed-eyes, and in dim lighting. Also, the clarity of the visions seems directly related to calmness of mind and passive receptivity.  If my mind is 'grasping' at all, the visions swirl and spin and have a hard time forming into anything cohesive.  In other words, the more i want a vision, the more the visions scatter.  That night, my mind was extremely calm and passive, yet attentive and focused.  Perfect.  I want to write about 3 'events' that happened.</p><p>First, something about what the experiences feel like.  From all the stories i had heard in the past, i thought dmt would involve ego-loss, and 'losing touch with reality'.  I thought it would be 'mindblowing' and extremely intense.  It wasn't any of these things.  I suppose it could be if i did larger amounts.  As i smoked, a warm buzz would appear in my body.  After a few hits, the buzz would grow to a somewhat alarming level, and i would stop smoking.  I would lie back and close my eyes.  The colors and patterns i always see behind my closed eyes would be more geometric and colorful than usual -- but otherwise 'just' what they usually are -- closed-eye visuals.  As i watched them, i would never cease to be aware of my body lying in my bed, or the unpleasant burning sensation in my throat and lungs (from the nasty smoke), or the music that was playing.  I knew the whole time it was 'just a drug high'.  The warm buzz in my body could be rather intense, and felt sometimes like it was moving around.  Sometimes the 'heart' of the warm buzz would sit in my chest.  Other times, it would 'rise' up into my head.  This would feel as if a warm buzzy cloud was enveloping my head.  Whenever that happened, the visions would take on a particularly vivid and lifelike intensity.  The peak of the experience lasted about 10 minutes, then faded to a very pleasant milder level for about 10 more minutes.  Then 10-20 minutes of almost non-visual but still buzziness.  The entire time i would feel exceedingly peaceful and in awe.  The peaceful feelings i attribute as much to my calm, happy and focused mindset as to the drug. </p><p>Now, there were many 'visions' behind my eyes.  They were very much dreamlike -- in that, they were obviously 'in my head' and 'not real'. They were also dreamlike in that they would sometimes be just swaths of color, while other times they would form into 'stories' and 'events'. And, as in dreams, these stories and events could transform from one into another.  Three events in particular are memorable in hindsight -- memorable, or, seem to be 'good stories.</p><p>I smoked in the daytime, but the visions were hard to see because of all the sunlight.  In the night, i smoked again.  After a few minutes of color and 'dreamspace' i saw what i'm calling the 'flower god'.  I was of course lying in my bed in my room, and in my dmtspace, i was likewise lying back very still.  My body in the dmtspace was dark and inert, looking passively up at a colorful 'sky'.  I could see another person nearby.  This person was 'like me' -- lying back, dark, inert, passive.  They could have been another person, somewhere, doing dmt like me.  Or perhaps they were dead.  Some of the colors in the space resolved into a large 'demigod'.  This demigod walked over to the passive person i could see nearby. </p><p>The demigod's form was like this -- he (i knew it was a he) had a human body, more or less.  But rather than a head, he had an enormous flower.  I saw this flower as very three dimensional, transluscent, and glowing in neon-like lines of color.  And it was not just any flower.  The petals rose out and bifurcated in countless tiny petals and leaves, all arranged in a geometric kaleidoscope fashion (though -- from my perspective, the kaleidoscope was 'turned' to face the other person, not me).  The pistils inside the flower were like bundles of tentacles, each also bifurcating into countless tiny tentacles, the whole lot slowing turning and swirling in precise geometric motion.  This flower god was intensely beautiful -- more beautiful than anything i had ever seen before.  The colors were impossibly vivid.  The transluscency was magnitudes beyond any alex gray painting.  The geometry was more crisp and symmetrical than any kaleidoscope.  The motions were in beautiful harmony with each other.  Yet this thing was also very organic, and seemed like a living thing, with intentionality.  It walked over to the other person who was in the dmtspace.  This person was lying back, inert. The flower god stood over this person, pointing its 'flower head' down at the person, and 'displayed itself' in all its beauty. It was as if it saw this inert person and came over to 'show it something'.  'Hey, take a look at *this*'.  After just a few seconds, the vision dissipated and transformed into something else.</p><p>Later, in that space trip, i saw something else i want to mention. I remember in this case the warm buzz in my body lifted up into my head, and the colors and visions suddenly took on a greater intensity.  They resolved into a vision of a corpse, lying (upright) in the ancient remains of a coffin, buried underground.  Again, everything was *very* three dimensional, transluscent and glowing in neon lines of color.  Details were intricately fractal in a highly geometric fashion.  The corpse was little more than a skeleton.  The 'coffin' had long ago collapsed and transparent 'earth' had filled the coffin.  The corpse had its arms crossed over its chest.  Its head was tilted back slightly.  Energy was flowing up through its torso and into its head, and beyond. This energy was an extremely beautiful slow flow of blooming fractal 'flowers'.  As with the flower god, the colors were intensely vivid and beautiful.  They were transluscent and glowing.  Their motion was slow and geometric -- rising up through the body and openning into flower blooms all inside and around the corpse.  My overall feeling while seeing this was one of extreme peacefulness and awe.  This vision lasted a little longer than the flower-god one -- perhaps 10-15 seconds, before transforming into something else.</p><p>After it wore off, i was so awed, i quickly wanted to try again. :) I had heard you need to wait an hour or so before smoking more. I waited just about an hour, slightly less.  I was kinda eager, in my calm and peaceful way.  I smoked until i felt that warm, somewhat alarming buzz.  I put the pipe down, laid back, and closed my eyes.  And saw *nothing*.  I thought 'damn, i tried smoking again too quickly'.  But there was *some* color and geometry behind my eyes.  And after a few seconds, it was like a wall of dmtspace slid into view.  As compared to last time, the colors and geometry and etc was less intense, but still very beautiful.  There was a lot more 'darkness' in this trip. At some point, the visions formed into a 'shadow lady'.  She approached me face on.  I could not see her very well.  She looked at me for a moment -- a swirling kaleidoscope of color. Then it seemed like she took a long tube -- like a blowgun -- and put one end in her 'mouth', and the other end in *my* mouth, and she 'blew' a stream of colorful patterns, like glowing molecules, into me.  Although the visual intensity was less than before, it was still beautiful beyond any ordinary vision.  Plus, there was the strong sense of there really being a demigod here, giving me a gift.  I knew she wouldn't have given it to me had i not been totally receptive.  If i had been grasping at all, or if i had had any particular desires for 'getting something' out of the trip, she would not have come to me.  While she was 'blowing' stuff into me, i knew, on one hand, that this was 'just a waking dream'.  On the other hand, the sense of her being a 'real' entity was equally clear. I felt like what she did to me was equivalent to what the flower-god did to that other person in the previous vision. As she dissipated, i mumbled 'thanks'.</p><p>Later, in that same trip, the warm buzz rose to my head again and i saw something that looked kinda like the aliens in the movie 'the abyss' -- a very organic 'blob' that was shot through with geometric ribs and lines of pulsation color, trailing masses of tiny filaments behind it -- all drifting as if through a fluid. I noticed that as i breathed *in*, this 'thing' would pulse and throb with life, and would become more precisely defined and intense.  As i breathed *out*, it would fade and lose clarity.</p><p>Anyway, that's all i wanted to say.  A few days later, i smoked a little more.  I *knew* beforehand it wouldn't 'work'.  My mindset was spinny and somewhat frustrated, even depressed.  But i smoked anyway.  I didn't get enough, so the experience was very mild. And what visions i did see were spinning rapidly out of control, unable to form into anything coherent.  I had several fleeting sensations of the color patterns forming into snarling demons rushing at me in the dark.  'Obviously', i was being told that 'now was not a good time'.  But i knew that.  I did learn, however, how much 'yearning' is connected to 'transforming movement' in that space.  I kept looking into that space and 'trying' to see something.  Whenever i did that, the patterns would speed up, transforming so fast they became meaningless.  When i relaxed and 'let go', they would slow down and start to become 'alive'. I cycled through 'yearning' and 'letting go' several times. It showed me that, in my life in general, when i am yearning (which is very often), my experiences become 'less real'. The message is clear.</p>",
 "year": "2000",
 "id": "2964",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-14T07:00:00.000Z",
 "views": "8974",
 "dose": {}
}
