{
 "id": 2964,
 "title": "One of the Dumbest Things I Have Ever Done",
 "date": {
  "submission": "2002-12-19T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Igor",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(liquid)"
  },
  {
   "time": " T+ 2:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(liquid)"
  },
  {
   "time": " T+ 30:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": ""
  }
 ],
 "report": [
  "<p>I really dont do drugs, at least not on a regular basis.  But, I will try anything once, and each time is a special occasion, something I plan for, and make it a big deal.  Whenever I do anything, I go all out.  For a few months my friend Andy has been doing AMT on a regular basis.  I read a lot about it, and decided I would try it eventually.  I had finished all my classes for the semester and my friends had a party, so I decided it was time to try it.",
  "I talked to Andy, and he told me the normal dose he took was 50 mgs.  The most he had done was 80 mgs.  I decided I wanted to go all out, but I didnt think I was ready for 80.  You see, Andy is a hardcore drug user and I figured that 80 would be too much so I did 60.  I took it later than I wanted, and I wanted it to hit me quickly, so I didnt put the powder in a pill, I just mixed it with water and drank it.  I dont suggest that, this stuff tastes horrible.  I had heard it makes most people sick, so I just sat on the couch for 2 hours waiting for it to kick in. ",
  "Two hours had passed and I started feeling a little fidgety but I wasnt really tripping.  I also didnt feel sick.  For some stupid reason I decided to do more.  Why Andy would let me do more, I dont know, but he gave me 40mg more.  I had now taken more than anyone I knew, and even more than anyone I had read about.  I cant imagine what I was thinking at the time. ",
  "An hour later after I had taken the second dose everything started to shake. Every few minutes the whole room would jitter.  My friends told me that my eyes were shaking back and forth.  Over the next few hours, I still wasnt hallucinating but the shaking got much worse.  My whole vision was blurred and my eyes were shaking every few seconds.   I was talking constantly to everyone and I couldnt really stop.  My whole body was shaking and I needed to urinate badly, but every time I went into the bathroom I could only squeeze out a little bit.",
  "I spent the next few hours just talking to everyone at the party and grabbing at my crotch.  I could have perfectly normal conversations with people despite not being able to see or sit still.  Around 6 hours into it I couldnt really pay attention to anyone.  I could only hear people who I was looking at, and any conversation in the background was just noise.  I could still engage in conversation, but I kept forgetting what I was talking about.  Every few minutes I would have to ask people what I was just saying.  I also started to hallucinate.  The hallucinations werent great. Things moved a little bit, and I got weird patterns in my vision just like I did from mushrooms.   But mushrooms were much more beautiful and much more colorful.  They were also different from mushrooms or acid in that I didnt feel freaked out at all.  I felt very comfortable and I had a really good time talking to people.  It was euphoria and I kept touching people and telling them how much I liked them.  It was great, for about 12 hours. ",
  "At around 6 or 7 AM the party started dying down.  I was lying on the floor talking loudly to the remaining people.  One of my friends was passed out and started yelling at me to shut up.  I couldnt stop talking and I didnt know why.  At this point everyone was started to get annoyed with me and they just wanted to sleep.  I was ready for this to end.  I had heard that it lasted from 16-18 hours so I figured Id just have to stick it out a bit more.  Around 8AM my friends decided to get food at a diner.  I was still shaking and had things of saliva bunched up in the corners of my mouth, and I was still fucked up.  I decided it would be best if I didnt go.  Some of my friends were still staying there so I figured I could talk to them, but soon after everyone went to the diner they left.  I sat all alone in the room.  I had no one to talk to anymore so I closed my mouth. ",
  "Instantly my jaw started to hurt.  I was biting so hard when I wasnt talking.  I couldnt stop my jaw from shaking unless I bit down.  I just sat alone in the house staring at the Night of the Living Dead poster on the wall.  It was absolutely terrifying and it kept turning in to this wolf girl.  It was one of the scariest things I have ever seen, but also one of the most amazing.  It seemed like hours before my friends came home, and I was just wishing this night would end.",
  "By 1:00 PM, over 16 hours after I had taken my last dose, I was in so much pain.  I had chewed up my tongue and my lips.  My jaw hurt worse than I could imagine.  I figured the drug was almost out of my system so I asked a friend to drive me home.  I went home and watched football.  It was horrible to be alone and not talk to anyone, but I knew it would be over soon.  At half time of the game I just curled up in my bed and tried to fight the drug.  I was starting to freak out, and I just knew I had to control it.  I twitched and flipped around in my bed just praying it would end soon.  I started watching the football game again and I started to get so mad at everything I saw.  I was just thinking about how bad the announcers were, and how stupid commercials are and how much I hate reality TV.  Every thing anyone said was so insulting to my intelligence.  The game went by quickly, and my team won.  I should have been really excited, but I was too messed up to care. ",
  "It was 4:00 PM and I hadnt slept in over a day, but I wasnt tired.  I hadnt eaten in almost a day either, but I wasnt hungry.  What I was was thirsty, unfortunately I had needed to pee all day and I didnt want to drink anymore because it would just make my problem worse. The next 3 hours were hell.  I had stopped hallucinating, but I was still tripping hard.  Time went so slowly and I just curled up in my bed twitching hoping it would end.  All my friends were watching the Simpsons at 8, so I made a friend of mine pick me up.  It had been more than 24 hours since I took the drug and I was still messed up.  When I got to my friends house they all started laughing at me.  I looked like a crack head.  I was shaking and twitching and grinding my teeth.  My hair was all messed up and I was wearing the same clothes as last night.  No one believed I could still be tripping. ",
  "At around 12:30 PM, 30 hours after my first dose, 28 after my second, I stopped tripping.  I still was shaking a bit, and chewing on my tongue, but I was mostly okay.  I had left my car at their house from the night before, so I just drove home.  I still couldnt really type, or sleep or think so I took a shower, popped 2 Ambiens and took a prescription pain killer for my mouth.  I just sat on my bed waiting for the sleeping pills to take effect.  I dont really remember what happened after that, but I think I went to bed around 3 AM. I woke up to my alarm 15 hours later.  I have never felt worse in my life.  I was so dehydrated and I had the worst head ache in my life.  On top of that my jaw was in serious pain and my mouth was completely cut up.  My jaw was still shaking and my right arm was tingly.  I could finally use the bathroom but my whole genital area tingled badly.  I was dizzy and when I stood up or sat down I felt like I was tripping again. ",
  "It had been nearly 48 hours since I did the drug and I was still messed up.  I hadnt eaten in over 50 hours but I wasnt hungry.  I told my friends and they made me eat something.  It was hard to get down, but it made the headache go away. Right now, 56 hours after I did the drug I still feel a tingling sensation in my right arm and my jaw still is jumping up and down.  I have no idea when this is going to end.  I wouldnt really suggest anyone do this drug unless they were up for a truly horrible experience, however, bad trips are part of doing drugs, and I dont regret taking it.  If I were to ever do it again, I would never do more than 50 mg.</p>"
 ],
 "erowid": {
  "id": "19723",
  "citation": " Igor. \"One of the Dumbest Things I Have Ever Done: experience with AMT (ID 19723)\". Erowid.org. Dec 19, 2002. erowid.org/exp/19723",
  "substance": "AMT",
  "views": "43493"
 }
}
