{
 "id": 2965,
 "title": "No Replacement for Xanax",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tester",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "Cyclobenzaprine",
   "form": "pill/tablet"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "g",
    "grams": "1.5",
    "quantity": "1.5"
   },
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "As someone very sensitive to the physical effects of hallucinogens (and long, drawn-out come-up1), I found 1-2mg Valium to be a godsend in helping me avoid panic attacks, anxiety, and stomach trouble during the come-up of Mushrooms.",
  "As someone with no access to Valium, I decided to test an unscheduled alternative: Cyclobenzaprine, a muscle relaxant closely related to tri-cyclic antidepressants.",
  "I took the Flexiril (Cyclobenzaprine) one hour prior to ingesting a low dose of mushrooms (1.5g).",
  "It did little to lessen the come-up effects.  However, it did make me physically drowsy and mentally agitated at the same time, which was not fun.  Fortunately, the come-up from the low dose of mushrooms was not unbearable.",
  "However, once I got 'there', I had some mild euphoria, some trippy thoughts for about 20 minutes.  Then, poof.  I'm relaxed, and I'm not tripping.  In fact, the Cyclobenzaprine 'took over' the mushroom experience, leaving me with a sluggishness and lack-of-motivation, but with occasional trippy thoughts and 'mushroom sighs/yawns'.",
  "My conclusion: Cyclobenzaprine is not a replacement for benzos in easing trips.  (And it's too bad diazepam is so hard to come by)."
 ],
 "erowid": {
  "id": "19724",
  "citation": " Tester. \"No Replacement for Xanax: experience with Cyclobenzaprine & Mushrooms (ID 19724)\". Erowid.org. Feb 10, 2004. erowid.org/exp/19724",
  "substance": "Cyclobenzaprine & Mushrooms",
  "views": "35222"
 }
}
