{
 "title": "Very Powerful Ally",
 "author": "Anonymous",
 "citation": " Anonymous. \"Very Powerful Ally: experience with Mushrooms (P. weilii) (ID 2967)\". Erowid.org. Sep 14, 2000. erowid.org/exp/2967",
 "substance": "Mushrooms (P. weilii)",
 "bodyweight": "",
 "report": "<p>Bioassay of psilocybe weilii nom.Prov.</p><p>Ally: 3 Gms well dried and preserved p.Weilii, 2 months from picking.</p><p>Choice specimens were chosen from a trunkfull of fresh picked mushrooms.  They perfectly fit the descriptions and pictures in stamet's book 'psilocybin mushrooms of the world', p165-167.  These were picked from georgia red clay soil with pine straw (still seen on the stems) in an area of new home construction.</p><p>Set: Excellent mindset.  A time of great personal flux and transition, all a good thing.  The journey was consciously entered into as a personal spiritual ritual and ceremony,with the intent of working on release of set patterns and stuck energy.  Solo journey.</p><p>Setting: Excellent setting with extreme personal significance.</p><p>0:00 (Times approximated) ingested in my usual fashion.  Boil one cup water and poor into large mug.  Add 1 level teaspoon of organic brown rice miso and mushrooms.  Let steep several minutes and enjoy.  This was at 9pm, fasting 12 hours after a light fruit breakfast, well hydrated.  Taste was minimal, not as strong as some other psilocybes.  No nausea resulted (not usually a problem for me).</p><p>0:20 First sensation of tryptamine flush and energy rushes.</p><p>0:30 Further onset</p><p>0:40 Starting to peak</p><p>0:50 To 1:20 Surprisingly intense waves of mushroom madness, more intense than anticipated from the dose, though not completely overwhelming.  Sort of caught me by surprise and i rode some waves of uncertainty and mild paranoia for a short time (10-15 minutes) before releasing and flowing fully into the mushroom sspace.  This was assisted by getting up and moving physically, walking in a circle meditation fashion. This physical motion helped me to release the gathered tension and move into a very ecstatic space.</p><p>1:20 To 3:15 Prolonged peak with what felt like minimal decline in intensity. Strong kaleidoscopic columns and tunnels of morphing delicate organic geometrics.Crystalline clear.  Walking in circles rapidly and slowly and rapidly. Feeling waves and waves of trapped emotions and heartache starting to loosen a little. Multiple different emotional and thought paths, many of which, apparently, providing usefull and practical detail relative to my current challenges of change and transition.  Very much feels like a gathering of power and giving myself permission to give to myself.</p><p>3:15 - 4:15 Very rapid decline to what feels like near baseline, in terms of visuals.  Not quite baseline in terms of headspace or emotional state.  Feeling quite good except extremely tired and physically exhausted. </p><p>4:40 Zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz</p><p>gestalt: Very powerful ally.  Don't know how to quantify it yet, but it certainly felt 'different' from other psilocybes i've done.  For one thing it seemed really short but intense.  For me, 3 gms of decent psilocybe (say a pftek strain, for a point of comparison) provides a full experience, though not one that is overwhelming in any way.  5 Gms of the same material would be a more 'yowsah' dose ('high dose').  These felt stronger than i expected the 3 gms to be.</p><p>I want to honor the beauty that has been repeatedly infused into my life by the respectful and wise use of my mushroom ally!!! Ho!!</p>",
 "year": "2000",
 "id": "2967",
 "timestamp": "2000-09-14T07:00:00.000Z",
 "views": "21404",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. weilii",
   "form": "(tea)"
  }
 }
}
