{
 "title": "Be Careful",
 "author": "VariolaMajor",
 "citation": " VariolaMajor. \"Be Careful: experience with 5-HTP (ID 29683)\". Erowid.org. Jan 2, 2004. erowid.org/exp/29683",
 "substance": "5-HTP",
 "bodyweight": "170 lb",
 "header": [
  "DOSE: T+ 0:00",
  "100 mg",
  "oral",
  "Tryptophan - 5-HTP",
  " T+ 1:25",
  "300 mg",
  "oral",
  "Tryptophan - 5-HTP"
 ],
 "report": "<p>I had heard about 5-HTP some months (or years) earlier, and about its enhancement of MDMA, or the mild euphoria that it produces on its own. In November of 2003, I happened to stumble across some at a local pharmacy, and bought some just out of curiosity.</p><p>My understanding was that its effects are best noticed in the higher doses... so I might've gone a little overboard... here's how it went:</p><p>T+0:  Ingested 100mg (label-suggested dose, 50mg) in the silence and security of my apartment.</p><p>T+1hr:  Feeling a little... 'different'... mild euphoria... didn't seem to progress any further.</p><p>T+1.25hrs:  Ingested an additional 300mg, in an attempt to see how far this stuff could take me.</p><p>T+2hrs:  Felt a little hyper, much more euphoric, noticed that appetite is completely gone, despite having not eaten all day. It was time for me to go to work, my hope was that my altered state would make it a little less boring.</p><p>T+2.5hrs:  No problems driving to work (although it is only two miles), decided that I should eat something, knowing that I still required food (especially for work), even though I have no appetite. Ate an omelette.</p><p>T+2.75hrs:  Eating was a terrible, terrible idea. I was nauseous, jittery, somewhat panicked by all of the people I was surrounded by (I work in a college dining hall). The incandescent lights on the ceiling were much brighter than usual. I was still very euphoric, though. Palms and face were sweating. Also had great difficulty concentrating. Paranoid that people would notice my condition (although no one did). Decided to sit and rest for a while.</p><p>T+3.25hrs:   Nausea got worse, the misery of it counteracted the euphoria. Told my supervisor that I was sick and had to leave. The nausea came and went in waves on the way home... by the time I got to the gate of my apartment complex, I thought I was going to be okay, but then I remembered: SPEED BUMPS. I pulled into my parking space at a very odd angle, opened the door, and puked on the pavement. I lost EVERYTHING that I had eaten; and just to give you an idea as to the force of it, I spent half an hour blowing the semi-digested ham and egg out of my sinuses. This had never happened to me before.</p><p>T+4hrs:   Sickness is gone. After my stomach had been emptied, I rapidly felt better. Very relaxed and still euphoric. Took a bath and listened to some music.</p><p>T+6hrs:   Effects had mostly faded away, and I went to bed. Had some very interesting dreams (that I actually remembered, which is rare for me).</p><p>In conclusion, 5-HTP does have some recreational value, but be careful and don't take big doses your first time. Oh, and for Christ's sake, if you aren't hungry, DON'T EAT.</p><p>I underestimated its potency, probably because it is, after all, over-the-counter. I was quite impressed with what it did to me (good and bad effects), considering that I usually require large doses of much more powerful substances (MDMA, opiates, etc) before I feel anything at all.</p>",
 "year": "2003",
 "id": "29683",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-01-02T08:00:00.000Z",
 "views": "36785",
 "dose": {}
}
