{
 "title": "Double Check the Labels",
 "author": "neutopia",
 "citation": " neutopia. \"Double Check the Labels: experience with 4-Ho-DiPT (ID 29708)\". Erowid.org. Jan 4, 2004. erowid.org/exp/29708",
 "substance": "4-Ho-DiPT",
 "bodyweight": "180 lb",
 "report": "<p>Let this be a reminder; we all make mistakes, but some mistakes can really hurt or even kill you.</p><p>I had some friends over the other night for a 2-ct-2 experiment.  The plan was for 4 friends and myself.  When they showed up, however, they brought another friend of ours who was also interested in taking part.  I had previously measured out 5 doses at 25mgs each for us to take, but when our other friend showed up I gave all of the pre-measured pills to them and went to measure out another for myself.</p><p>I had consumed 3 or 4 drinks at that point to soften the come-up anxiety and to entertain myself before everyone got to my apartment.  This is where I stress sobriety in precise and important activities like measuring out potent drugs.  I reached up over the cabinet ledge where I keep my research chems and felt for the proper sized jar.  I found it and glanced at it and proceeded to measure out 25mgs of 2-ct-2 for myself.</p><p>About 30 minutes after we all dosed I started to get sweaty palms and I started feeling the definite bubbling presence of a swelling trip goblin climbing the biological staircase to my head.  I though 'Nah, couldn't be'.  2-ct-2 has always taken about 2 hours to present itself to us.  'It must be my imagination, it's only anticipation', but no, it was so unmistakeable and unexpected that I had to go to my room and lie down for a bit to figure out what was wrong with me and why I was reacting like this.  I made a quiet exit and as I lied down it only got more intense.  The trip hadn't started in anyone else yet, only me.  At this point I began to feel some anxiety, it never got out of my control, but this situation just didn't make sense.</p><p>It was then that I had a flash of realization.  I got up and walked to the area where I kept all of my chems and took them all down (the walking part was a little hard as the world was on an angle).  I looked at them all and then I knew, I was right.  I had measured out 25mgs of 4-HO-Dipt for myself instead of 2-ct-2.  This expained everything.  The jars were similar sizes and the same color with labels from the same laboratory.  I had made the critical error, the 'no, I'd never make such a dumb mistake' mistake; I thought I had cooked up a 2-ct-2 burger with a slice of righteousness on a inner-exploration seed bun, but instead I had made myself a steamed HO-Dipt platter garnished in error and sauted in a wrong sauce.</p><p>In this particular scenario, the consequences were benign.  My anxiety subsided when I realized what I had done, but it was replaced by an embarrasment and a disappointment in myself that I had fallen prey to such a careless error. I was ashamed and in a tripping head with which to reflect and obsess on it for an hour or 2.  Yes, no harm was done here, but what if it was a different bottle that I had retreived, what if it was 5-MEO-AMT (I don't have this chem but it illustrates the concept well), what if it was 2c-e or even 4-MEO-MIPT, I could easily be in the hospital or even dead.</p><p>It's that easy to make a mistake with something so potent.  I always double and triple check my measurements, but what good is that if I'm measuring the wrong substance?  Double check the labels and don't take anything for granted or with a grain of salt in this respect.  I'm grateful that I didn't send any of my friends or myself to the hospital that night.  I'm just writing this to raise awareness that this could possibly happen to someone else too.  Pay attention, stay sober while measuring, and double check all variables in the process,  that is my advice for anyone who chooses to use these substances as a playground and a classroom as I do.  Be careful,  I know I will be more so in the future.  Peace, happiness, and safety to you all...</p>",
 "year": "2003",
 "id": "29708",
 "gender": "Male",
 "timestamp": "2004-01-04T08:00:00.000Z",
 "views": "19991",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
