{
 "title": "I Feel...So...Chill",
 "author": "Frizzle",
 "citation": " Frizzle. \"I Feel...So...Chill: experience with Triazolam (ID 29726)\". Erowid.org. Feb 10, 2004. erowid.org/exp/29726",
 "substance": "Triazolam",
 "bodyweight": "160 lb",
 "report": "<p>Boredom struck me, and i found a pill of generic 0.25mg halcion.  Usually benzodiazepines have little effect on me (i have to insufflate a whole 4mg xanax bar or take at least 3 10mg valiums to do much), so i decided to inject it to get the most out of it...i was already a little tired and worn out from a day of driving, and I just wanted to relax...</p><p>So, I prepped the needle and dissolved the crushed up contents of the pill into a spoon with water...heated it to remove impurities, and substituted part of a cigarette filter for a cotton ball...I then proceeded to tie off my arm and located a nice vein...in went the needle...\r[Erowid Note: IV injection of crushed pills/tablets can be very dangerous due to unknown binders and fillers present in the tablets.]</p><p>Upon removing said needle, I felt a strange rush, but a comforting rush, nowhere near as intense as heroin or cocaine, but it was nice.  Soon, my desired effect came about--a sense of relaxation and well-being--along with slight loss of motor skills and motivation.  Right now, I just want to sit and listen to music.  Or if I had some pot, I would smoke it. Twice the dose would have been nicer...but i don't exactly have that opportunity.</p><p>Surprisingly though, the effects are noticeable and welcome (I injected a 2mg ativan once with little effect)...so either Halcion is a lot better, or I'm just weird.  Well, i'm either off to sleep or off to take a shot of hard liquor (not recommended...only professionals should attempt such a stunt)...wow...i feel...so...chill...</p>",
 "year": "2004",
 "id": "29726",
 "gender": "Male",
 "timestamp": "2004-02-10T08:00:00.000Z",
 "views": "18193",
 "dose": [
  {
   "time": "0",
   "amount": "0.25 mg",
   "administration": "IV",
   "substance": "Pharms - Triazolam",
   "form": "(pill / tablet)"
  }
 ]
}
