{
 "title": "It Sucks, Plain and Simple",
 "author": "Heretic600",
 "citation": " Heretic600. \"It Sucks, Plain and Simple: experience with Cocaine & Crack (ID 29760)\". Erowid.org. Jan 6, 2004. erowid.org/exp/29760",
 "substance": "Cocaine & Crack",
 "bodyweight": "250 lb",
 "report": "<p>I smoke a lot of weed, I've done shrooms, acid once, opium and crystal meth, and a few pills but I always said I would stay away from the hard drugs, like heroin and coke. I was always curious about heroin (and still am), but I hear heroin and coke and get you hooked using it just once. The horror stories kept me away. Seeing the way crackheads are exploited on tv, the last thing I wanted was to become one.</p><p>All that gets thrown out the window when you get 900 bucks worth of coke just handed to you. People always tell me stories about finding grams of weed or hits of acid, and I always wondered why that never happend to me. I would have loved some free drugs. Then one day I was leaving a corner store, and found a plastic baggie filled with what I though was weed bags. I quickly pocked it as to not be seen. When I got home and looked, there was 2 40 stones of crack, and 8 grams of coke. I was pretty happy about my find, and further investigation revealed that coke sold for a hundred dollars a gram in my area. I was estatic over my new found wealth, and thought about all the weed I can get with that. I figured I might as well try some, to see what it was like. I crushed up a generous line, and sniffed it up. The feeling was pretty good. I felt on top of the world. I could do anything, and nothing could stop me. In my eyes I was bigger then Jesus. 20 mins later I was brought back to reality when the drug wore off. I felt ripped off, even though the shit was free. The high wasn't as good as weed in my opinion, and it didn't last. It's definitley not worth the money, and it's definitley not worth a life of crime to get more.</p><p>Next up was the crack. I figured a stone should be better, but boy was I wrong. The high is much better. I rolled a couple crack joints, and stepped outside to take a puff. When the joint was gone, all I could to was stand there. The high was so intense I couldn't move. Crack rocked (no pun intended) it really did. However, this too was a gyp. 5 mins later I was left with nothing but a weed high, and wanting more. I can see why this stuff has a high addiction rate. Later on throughout the day I did a few more lines, and smoked another crack joint. I then sold the rest and bought an ounce of weed and some shrooms. Maybe it's just me, but nothing I've tried has gotten me higher then weed. At least I can say I tried coke, but it's something I wouldn't buy. It's certlinley not worth the money or the risks.</p>",
 "year": "2003",
 "id": "29760",
 "gender": "Male",
 "timestamp": "2004-01-06T08:00:00.000Z",
 "views": "24539",
 "dose": [
  {
   "time": "0",
   "amount": "4 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "2 joints/cigs",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(powder / crystals)"
  }
 ]
}
