{
 "id": 2977,
 "title": "Verbal Telepathy",
 "date": {
  "submission": "2000-06-20T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Ax",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "T+ 2:30",
   "administration": "75 mg",
   "substance": "SC"
  }
 ],
 "report": [
  "SETTING : With 2 friends rather than alone.",
  "DESCRIPTION : This is a (for me) rather unusual Ketamine-setting. Might become my new standard, though. Usually I do K alone, right before going to bed when I'm sure I'll be undisturbed. This time two friends, let's call them K and M, were joining me. We began the evening by ingesting a rather small dose of E, I'd guess about 80mg. My plan was to take the K directly at the peak of the E-xperience, however I found out (for the second time) that you don't actually want to dissociate while on E. Well, we weren't doing it for the fun anyway, so at last after about two and a half hours we injected the K - 75mg SC for K (female), 100mg SC for M and 125mg IM for me. [On this occasion we listened to a CD called 'colourform' by the 'Higher Intelligence Agency'. When I saw it in a shop the other day and the last track was called 'Ketamine Entity' I *had to* buy it. Well, good deal!] First half of the trip was 'business as usual', that is travelling the K-whole, alone. Although we were lying so close we were touching, I didn't notice that for half an hour.",
  "Then, after half an hour, I usually regain the capability to orient myself (recognize the music, know I'm human, etc.), mostly accompanied by the feeling, back so soon? This time however, there was another really fascinating plateau before coming down. It began when we rediscovered our speech. M started by saying hello, then I said a word or two (nobody speaks in whole sentences while on K), then K and so on. The interesting thing was that it wasn't a real talk, it was more like one thought that the three of us were forming together. Sometimes I couldn't really distinguish who was saying what. There was no concept of this comes from my head this is from yours... Truly strange. It was like telepathy, only with words. ;)",
  "When we had our bodies back, we cuddled together in order to keep the feeling of being one, not three...'"
 ],
 "erowid": {
  "id": "1975",
  "citation": " Ax. \"Verbal Telepathy: experience with Ketamine & MDMA (ID 1975)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1975",
  "substance": "Ketamine & MDMA",
  "views": "9376"
 }
}
