{
 "title": "Unlike Anything Else",
 "author": "starlaMae",
 "citation": " starlaMae. \"Unlike Anything Else: experience with Ketamine (ID 29778)\". Erowid.org. Feb 5, 2004. erowid.org/exp/29778",
 "substance": "Ketamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "IM",
   "Ketamine",
   "(liquid)"
  ]
 ],
 "report": "<p>I was working as a Vet Tech. in a small animal hospital that was not very well run. When I started, I had no idea what Ketamine was or what it does. But within a couple months of regularly using it on cats and dogs before surgery (and during), I started to research it and found what sort of dose I could take.</p><p>Things have changed since I quit, but while there, I had practically unlimited access to Ketamine- we would purchase a huge order- 100s of bottles- and no one kept track of a damn thing. They were just in a big plastic bag in a unlocked box under the surgery table. I took home bottles almost every night.</p><p>Always injected it IM- hits me really fast, almost before the needle is out. I usually used the fatty part of my upper arm but it soon had so many hematoma knots that I bled way too much, so I also had to use my thighs. Seriously- sometimes I would take the needle out any the blood would literally shoot out of my arm. I stood in front of the mirror once and watched my entire side become soaked in blood.</p><p>I have plenty of experience with weed, acid, shrooms, mescaline, narcotics, other pharms., and coke, but nothing compare to ketamine. Not that it's better by any means, just different. It's definitely not a social/party drug, at least not in the amounts I was doing. I would inject a sick amount (honestly don't remember what it was) to knock my ass to the floor. I could not walk, see, think. But it's not a drug I can freak out on either (again- not in the amounts I was doing) because it is a Dissociative- totally opposite of say, acid, where everything is sharpened, so to speak.</p><p>So it would make me feel good (or bad) like coke or pot. It certainly doesn't heighten the senses. I suppose it does relax, but way beyond that- it just knocks me the fuck out. I think I just enjoyed the needles (I would become an instant junkie if I ever did dope) and it did make me feel like my insides were swirling through themselves. This was rather cool- I remember laying on my bed, totally still, just feeling my body roll over into itself like I was completely made of liquid. And music was great- trippy shit felt like a total journey. But I can't remember any specifics- I was just too unconscious really.</p><p>I shot it into a couple friends' arms who absolutely hated it so I guess it's not for eveyone.</p>",
 "year": "2000",
 "id": "29778",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-02-05T08:00:00.000Z",
 "views": "16428"
}
