{
 "title": "First Time on HBWR Seeds",
 "author": "Marklar",
 "citation": " Marklar. \"First Time on HBWR Seeds: experience with H.B. Woodrose Seeds (ID 2979)\". Erowid.org. Oct 5, 2000. erowid.org/exp/2979",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "10 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "report": "<p>I recently recieved 20 HBWR seeds from a friend. I was really looking forward to taking them but my parents were making it difficult. One sunday morning however, they left to go out for lunch at about 10:30. So I quickly got 10 seeds out ready to take. I wasn't sure if they would be back particularly soon so I was unsure as to whether or not to do a cold water extraction. I went onto IRC to ask how long I would have to leave the ground seeds to soak, someone said about 3 hours so I decided not to. I chewed up the seeds and swallowed with water. There were still some bits in my mouth so i brushed my teeth [which helped get rid of the strange taste that chewing the seeds left] and swallowed the froth. I went and sat down by the PC and chatted on IRC. After abut half an hour i started to feel mild nausea and a bit of dizziness. This got stronger until at T+1 hour i decided that being sick was a good idea. After being sick, all the nausea went almost instantly away. However, the dizziness persisted. I went back to the computer for about half an hour and felt really comfortable in my chair. I decided to pick out different tracks off music which i can normally do well on all sorts of drugs. It was particularly easy to do on today.</p><p>After this half an hour i got up to get the mail [my post box is at the bottom of my garden] and i took about 4/5 steps and almost fell over from the surprise twinges in my leg. It felt a little like lactic acid but more of a shooting pain the the ache of lactic acid. I decided to carry on down to the postbox and i got the mail and walked back up to the house. The walk turned into a crawl halfway up the path. I lay down to catch my breath [because it was really tiring for some reason] and the stone which had been warmed by the sun felt all nice and hot. I decided to lay there for a minute but when i got back to the house i found an hour had passed. The 'journey' usually takes me about 2 minutes. I flopped about in front of the PC for about 3 hours until my parents came home. My dad tried to talk to me but i found everything he was saying really funny and was smirking at him. Thankfully, he thought i was just being annoying and left. The disturbed vision that i had since T+1 hour tailed off from about now to about 17:00 when i felt nothing except tired. That was T+ 6hours 30. I got a good nights sleep that day and felt fine the next day.</p><p>I couldnt be bothered to take the other 10 after the hassle i had with the last 10. I took them into school and gave the 10 to a friend: G. He split them with T. T had 6 and G had 3 because they dropped one. I only spoke to them at break times because neither were in any of my lessons that day but this is what was reported.</p><p>T+ 1hour 30:</p><p>G was a bit queasy but T was feeling ill.</p><p>T+ 3hours:</p><p>I here that T is feeling better but still a bit queasy. I meet with G who is very relaxed. He thanks me alot for the seeds. We walk to the tennis courts where G finds great amusement in jumping over the tennis nets in a funny manner.</p><p>T+ 7hours: I dont speak to T but i hear he is feeling better and had an okay time. G waits for the bus with me and is still relaxed and smiling.</p><p>By the way, i dont know the weights of everyone. But i suspect that G weighs about 9 stone and that T weighs about 11 stone. I weigh 10.5 stone.</p>",
 "year": "2000",
 "id": "2979",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-05T07:00:00.000Z",
 "views": "30605",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 ]
}
