{
 "id": 2980,
 "title": "Breathtaking",
 "date": {
  "submission": "2000-06-20T07:00:00.000Z"
 },
 "author": {
  "name": "Sickboy",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "5:45",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Recently some friends came to stay with me. Before they came I had tried Ketamine twice but I did not have a significant amount. Just enough to make me feel light headed and dizzy. I had tried Ecstasy plenty of times and was used to its effects.",
  "The night before I mixed the two drugs the three of us did enough to get in what I believe is the k-hole. We snorted it so I may have been quite a ways from it. But I had sensations of traveling back in time and feelings of not being able to move. My vision darted from object to object as if I couldnt control where my eyes were going.",
  "They had been suggesting to me that if I tried the Ketamine when I was coming down from Ecstasy that it would prolong the effect of the Ecstasy as well as taking me to the K-hole. I am not a big fan of mixing drugs but the idea didn't seem unreasonable since I have candyflipped once with some very weak acid. And the effects of Ketamine had only lasted for about an hour anyway. So we made plans the following nite to snort the rest of our powdered Ketamine when we were coming down from the Ecstasy.",
  "The night after we had a small party and there was plenty of ecstasy going around. I took the pill at about 11:15 PM. I had made plans to take one pill but I realized after about 15/20 minutes that the pill seemed stronger or was more potent than any I had taken before. I begin feeling it about 15 minutes after I had taken it. I was rolling at least a half an hour before all my friends. I smoked some marijuana immediately after taking the pill to calm down.",
  "The night was the most eventful of all the times I had recently used Ecstasy. There was a large number of people at my house and a lot of socializing. It was a fun time.",
  "It was around 5:00 AM the following morning and most of the people had left my house. We had been storing our Ketamine in the freezer because one of my friends had been told it makes it last longer. I have no idea if this is true. By this time the only effect I was feeling from the E was the teeth grinding. This always lasts much longer than the E itself for me. I was ready tired and ready to go to sleep but stuck with our plan.",
  "But we broke out our K and made a large pile on a mirror and chopped it up finely with a razor blade. We split the pile into 3 equal sections as well as we could. The three of us took turns snorting the lines until it was all gone. That was the most K I have ever had at one time. We were giving each other massages and had techno muscic playing, I think it was Keoki. I was back into the same K-hole I had experienced the night before but it was much stronger. When sitting in my chair it felt as if an invisible bolt was through my waist and not letting me move. I could only move certain sections of my body at once. I had the feeling I had traveled back in time to the late 1940s or early 1950s. I don't have a clue how my mind picked this era. It may be because the furniture in my house and they way it is built remind me of this. While I was recieveing a back massage from one of my friends I closed my eyes. What I saw when I closed my eyes was more breathtaking than anything I had ever seen. I saw a floating pyramid with what looked like bolts of electricity coming off of it. I saw numerous patterns of bright colors and beautiful arrangements. I also pressed my left thumb and little finger together to have the E feeling come back a little.",
  "While the K was wearing off we put in The Doors movie and began watching it. As I was laying in the chair I felt the K dwindle slowly. Before I knew it I felt the E all over again. I felt the same as about one and a half to two hours into an E trip. This was around 6:00/6:15. My friends were growing tired but I believe this is because they have used E more times and more frequently than me, so they had more of a tolerance. They went to sleep but I stayed up roaming around my house. The E feeling didnt wear off until around 9:30/10:00 AM.",
  "My experience with combining Ecstasy and Ketamine were very favorable. I feel that they go hand-in-hand like pot and acid, as my friends suggested. I am not at all objected to repeating the experience. I would suggest having at least 2 days free from obligation because your body will need a lot of sleep once the experience is over. Thank you for listening. "
 ],
 "erowid": {
  "id": "1976",
  "citation": " Sickboy. \"Breathtaking: experience with MDMA & Ketamine (ID 1976)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1976",
  "substance": "MDMA & Ketamine",
  "views": "7737"
 }
}
