{
 "title": "Overall, a Waste of Money",
 "author": "Louderklim",
 "citation": " Louderklim. \"Overall, a Waste of Money: experience with Calea zacatechichi (ID 29806)\". Erowid.org. Jan 7, 2004. erowid.org/exp/29806",
 "substance": "Calea zacatechichi",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Calea zacatechichi",
   "(tea)"
  ]
 ],
 "report": "<p>I bought a 5 gram bag of this stuff off the internet.  I don't smoke, so tea was the method of ingestion.  I tried several infusions of the herb, but the strongest effects I got were actually from the first whiff of the herb, which seemed to open all my senses and invigorate my mind.</p><p>I did find that the herb allowed me to imagine very vividly, but only when I didn't try.  If I just emptied my mind, I would find fascinating trains of thought, but the process was so delicate that as soon as I got excitated or tried to pursue the thought, it would slip away to my frustration. The most vivid experience was the first night, I was drifting a bit, and started thinking of mushrooms, suddenly before my eyes was a beautiful landscape of vivid colours and a large spotted mushroom with little ones surrounding it.  There were oranges and purples everywhere, but only for an instant, for I snapped out of it when I tried to go deeper.  Dreams were no more lucid than normal.  (People need to look up the definition of 'lucid' before getting too excited over this.  It would only be really beneficial to people who never remember their dreams or act in them I think.  Mine are always in color and memorable anyway.)</p><p>Overall, a frustrating experience that was slightly cool, but not worth the bitter taste and anxiety of not being able to touch the experience.</p>",
 "year": "2003",
 "id": "29806",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-01-07T08:00:00.000Z",
 "views": "35226",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  }
 ]
}
