{
 "title": "The Long Addiction",
 "author": "Hillary",
 "citation": " Hillary. \"The Long Addiction: experience with Oxycodone (Oxycontin) (ID 29808)\". Erowid.org. Jun 25, 2007. erowid.org/exp/29808",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "123 lb",
 "report": [
  "<p>I'm an upper class female in which most people regard me as being beautiful and smart.  I attend a prestigious college, in which I'm in journalism school. I have a history of drug and alcoholism in my family but I disregarded it the day I toiled with drugs.  It started out with non-addictive things like ketamine, GHB and X.  I was dating a pro-wrestler at the time that would bring home these strange substances and I would try them out of ignorance.  I was only 19, went to a Christian school all of my life and remained a virgin until I met him. ",
  "One day he brought home a drug I'd never heard of before called Oxycontin.  I believe I took a half of a 20mg by mouth.  The next thing I knew I wanted to feel this good all the time.  So, my boyfriend started shooting the drug IV.  He said it was better on the liver and the intensity was so much greater, as if it was a whole other drug.  So I took his word and melted the pill down and mainlined (injected into a vein) about 10mg the first time.  It was the absolute best feeling in the world and that's an understatement.  All I cared about from then on was feeling this amazing high, this drug took to me and I took to it. ",
  "For the next couple of months we did it recreationally but as time went on, I shot up more than I got up...out of bed that is.  I was doing about 120mg a day.  Even though my family and friends were there for me I shut them out and just relied on my boyfriend, no longer for sex or love but to get me that drug.  He lost his job and I never attended classes. ",
  "Finally, I decided that self destruction was not the way to go.  I had to inject 40mg twice a day just to feel normal and not get cold sweats.  I didn't get high anymore.  I was on the verge of death so many times when I shot up.  My breath would be nonexistent, pin-head size pupils and my legs would be numb.  One day, after about 6 months of being addicted I decided to quit...cold turkey.  I was no longer happy with the life I was living and knew that life had more to offer to a 22 year old than hunting a drug down day and night.",
  "Oxycontin was a concentrated evil for me. So, I went through utter hell while quitting.  Anything that touched my skin felt like needles.  My stomach cramped and ached so badly for the drug.  I would have hot sweats then be freezing cold. The thought of injecting that sweet medicine in my arm made every muscle in my body cramp and beg me for it but I cursed it. This went on for about a week and tapered off after about 3 weeks. ",
  "After 'kicking it' I took Ambien a sleeping pill to help me sleep and thereafter Xanax to calm my cravings. I still would have dreams about it.  I'm so proud to say I did it by myself and the rest of my friends and ex-boyfriend now are either in jail, rehab or the methadone clinic(which I highly disagree with substituting on addictive drug for another).  My kicking the addiction makes me feel like I can conquer the world.  I feel that if a little women like me could overcome such a battle, that anyone can. I have a very good job now and supportive family that never knew I was an addict, thank God.  I never crave or want the drug again because I never want the torment of it or the loss of a once loving friend.</p>"
 ],
 "year": "2001",
 "id": "29808",
 "gender": "Female",
 "views": "6783",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "IV",
   "substance": "Pharms - Oxycodone"
  }
 ],
 "submissionDate": "2007-06-25T07:00:00.000Z"
}
