{
 "title": "3rd One's the Charm",
 "author": "bllllllllaaaahhhh",
 "citation": " bllllllllaaaahhhh. \"3rd One's the Charm: experience with Mushrooms, LSD, Cannabis & Sassafras (ID 29830)\". Erowid.org. Nov 10, 2007. erowid.org/exp/29830",
 "substance": "Mushrooms, LSD, Cannabis & Sassafras",
 "bodyweight": "180 lb",
 "header": [
  "DOSE: T+ 0:00",
  "3.5 g",
  "oral",
  "Mushrooms",
  "(dried)",
  " T+ 0:35",
  "1 hit",
  "oral",
  "LSD",
  "(blotter / tab)",
  " T+ 0:00",
  "1 capsl",
  "oral",
  "Sassafras",
  "(capsule)",
  " T+ 0:00",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Me and my buddies smoke a ton of pot, tons. We love getting high but like all stupid kids, we're constantly looking for new things to do. Ever since I smoked some crazy pot and passed out in the popcorn line at a movie theater and had a crazy ass animated dream Id wanted to trip really bad. I'd never tripped before and wanted to so my friend Ed said he'd hook me up with some boomers. This kid's been to a buncha phish shows, he was on acid for like 3 days or something rediculous. Anyways, I trusted his 'professional' opinion and was down for whatever.</p><p>We came home from a night of smokin pot. We were chillin at Ed's house playin video games and ate the eighth of boomers at around 11:30, I have no idea what time it was exactly. We waited for like half an hour and nothing happened. We were pissed. It was about a week before new years and my friend had gotten us some acid to do that night. As we sat and watched TV I looked at him and I was like, 'This is retarded, I wanna trip sack dude.' He agreed but we didn't bring up the acid yet. 5 more minutes went by and I couldn't take it anymore. I looked at him asked him if he wanted to do the acid. Not 30 seconds later we were in his room looking at little tabs of paper. He told me to put it on my tounge an move it around, so I did. He assured me now that I would definitely start tripping.</p><p>We waited a little while longer and now that I look back on it, Im pretty sure the acid kicked in and we just didn't really notice because we were so focused on trippin that it kinda snuck right by us. So now we were on shrooms and acid which to a lot of people who don't like drugs would be stupid enough. That's when I noticed the pills. Ed noticed me staring at them. He told me what they were, sassafras. I grew curious, and immediately decided I needed to do sass too. My friend loves to drugs and he was psyched when I said I wanted to do it too. So we each took a pill.</p><p>We sat in his room and smoked a bowl then went and got some food. I grabbed a buncha clementines and a loaf of bread, I dont know why, maybe I was gunna make a sandwich. We decided it would be best to trip in his room so we headed downstairs with the food. It had been about 20 minutes since we took the sass and I noticed I became extremely interested and curious about everything I saw. I stuck my head everywhere it would fit, I rubbed the walls and my hands felt kinda funny, I was psyched. When we had opened the door to the basement stairs we weren't even sure the drugs were working, by the time we got to the bottom the drugs kicked in full force.</p><p>It was pitch black in the hall leading to his room. We had already started laughing uncontrollably. Ed kept touching the back of my head, so I squatted down in the dark to scare him. The next thing I know Im lying on the floor laughing eating a clementine, which by the way was easily the best one Ive ever had in my entire life, and wondering why a loaf of bread was on the floor of the hall. Ed was somewhere in the hall on the floor laughing histerically along with me. I didn't think I was hallucinating yet but I wasn't sure. I have no idea how long we sat there, it could have been 5 minutes or 2 hours. I was laughing so hard my stomach hurt, but I didn't care, it felt great. I began to realize I had no idea why I was laughing, which I found hillarious and just spurred my self onward. Then I started to listen to myself laugh, which was also hillarious, I had never laughed this hard in my life.</p><p>Finally we made it into his room, flicked on the lights and closed the door. This is when I realized I had been trippin in the hall. When the light went on all of a sudden all the colors and shapes and things I had been seeing disappeared and it wasn't until then I realized I had been seeing them. I stepped back into the real world, which I was unaware I had left. So tip number one is chill out in a dark place for a while, but not a creepy dark place like the woods, that would be scary.</p><p>Me and Ed had managed to calm down a little, we had controlled our laughter enough so we could figure out what we wanted to do. We pulled out one of those things that is like thousands of clear plastic strands tied together at one end that sit in this thing and they spread out so it looks like a planet and the end of each strand was a tiny little dot of color and each tiny little dot would change color and the whole thing spun. At first we almost couldn't handle looking at it. Then we were sticking our faces down into it cuz it looked so cool. Oh and also we had started laughing uncontrollably again. I was curled in the fetal position because my stomach hurt so hard from laughing.</p><p>I held my hands up to point at something. My hands were the coolest things I had ever seen. As I stared at them and wiggled them I realized that my fingers were moving slower then I was wiggling them. They just couldn't keep up with what I was trying to get them to do. This of course was hillarious. Delighted by my new discovery I held my hands out while I stared at the color changing thing. I stared at the color changing thing and wanted to touch it, I was going to move my hands to stand up but as I moved them it was like they were glued to where they were. As I moved them around they stretched like silly putty. I was fascinated by this so I stayed seated. Then the colors from the color change thing began to fill my hands. My hands started changing color and losing their shape. I couldn't distinguish my fingers and informed Ed excitedly that I could feel the colors, my hands were becoming the colors. I felt like I was melting into them.</p><p>All of a sudden I had to know what was under his bed, I stopped melting and began checking out the floor under his bed. Me an Ed decided to smoke a bowl, so he packed it up while I lay on the floor laughing and poking my head around and being absolutely fascinated by everything. All of a sudden I didn't want to be lying down anymore, I stood up and stared at the color change thing. I felt an honest love for it, the way people love their pets. I slowly petted it and the whole thing turned into a planet. It was the most beautiful thing I had ever seen. We decided to name it Plee-plee. I would take plee-plee out of his stand thing and just hold him, play with the strands and laugh histerically. Without realizing it an hour had passed by and we hadn't even hit the bowl, Im surprised we remembered it at all.</p><p>I'm not sure what part of the night I met Johnny English and the constable, but they are one of my fondest memories of the whole night. I remember saying once that I felt like I was going completely insane by myself except that I had 4 friends in my head going crazy with me. Well, two of those friends were Johnny and the constable. While the whole time I knew they were not real, I had conversations with them, not aloud, I knew what their personalities were like. Occasionally I would talk to Johnny English and reply to myself in an English accent and it was the same as if someone was really there talking to me. I dont know where Johnny and the constable came from, at all. Meanwhile, this entire time I was laughing harder then Id ever laughed, hour after hour, constantly.</p><p>None of these events are in order and quite possibly happened at the same time as each other. These are the more memorable parts of the night. Little details suck as everything I looked at was the wrong color and changing color just dont seem important because things changed colors for about 9 hours. The whole night my hands felt really weird, really really really weird, but I can't remember what it was like. Just not normal. Also, I spent about 7 or 8 hours lying on the floor and he lay on the bed with no music, no tv, nothing. All we had was the color change thing. I remember one time we went outside to smoke a cigarette and when we came in I just stood in the doorway of the garage like I was waiting for something. Slowly my mind began to show me what I was waiting for and then put it into words for me. Welcome to the jungle I said to Ed, everything I looked at began to change into a jungle scene, I almost fell over and then it stopped. There were probably a hundred of quick things like that that seem really insignificant afterwards.</p><p>I didn't really calm down until around 2 in the afternoon the next day. We were up all night, we saw the sun come up, we didn't stop laughing, as the high became slightly less intense the hours whipped by and we spent them laughing. I have never felt as content or comfortable with my surroundings as I did that night. I've never laughed that hard. I've never seen things like the things I saw. I've never talked to people I made up in my head. But I highly recommend taking acid, shrooms and sass in one night. It's one of the most fun times Ive ever had.</p>",
 "year": "2003",
 "id": "29830",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-10T08:00:00.000Z",
 "views": "4943",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 0:35",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Sassafras",
   "form": "(capsule)"
  },
  "3": {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
