{
 "title": "Stuck in an Energy Whirlwind",
 "author": "Rishman",
 "citation": " Rishman. \"Stuck in an Energy Whirlwind: experience with 5-MeO-DMT (ID 29834)\". Erowid.org. Aug 26, 2004. erowid.org/exp/29834",
 "substance": "5-MeO-DMT",
 "bodyweight": "75 kg",
 "header": [
  "DOSE:",
  "20 mg",
  "smoked",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>This is the account of the first time I tried 5-MeO-DMT.</p><p>History: I'd like to give some general info about myself. I'm a 23 year old Computer Science student and in good general health. I've had a few experiences with various drugs including Marijuana, Hashish, Crack, Opium, Shrooms, Ecstasy, Salvia, Hawaiian Baby Rosewood seeds and Absinthe. I have to say that I've always had pure experimental goals in my mind when trying out these substances (except for Hashish and Marijuana which I also use for pleasure) and have never used any of them (except for Hashish and Marijuana) regularly. My experimentation with 5-MeO-DMT was another step in the experimentation of strange substances.</p><p>Background: After consulting various sources of info about DMT and 5-MeO-DMT, two fellow travelers and I decided to test this material out. My great comrade in arms obtained 100 MG of pure 5-MeO-DMT and we were ready to go. I have to note that we waited about two months before using the substance and as DMT becomes less potent over time, a little bit of the potency might have worn out.</p><p>Setting: We did the experiment in the basement of a friend's house. Despite the fact that the place was very private and comfortable, it was very basic and almost bare of all furniture (which might have been good). Also, I think the room in which we did the experiment was not spacious enough. My companions consisted of two trusted friends. I will not go into their experiences and hopefully they'll be able to submit their own reports in the future. At any given time one of us was completely sober and ready to provide help if needed.</p><p>Set: I am generally a very happy person and always ready to let it go. I've been reading a lot about drugs and religions in the last few days.</p><p>The Experiment: I put approximately 20mg of the fine powder on a piece of folded foil and held a straw over it while my friend held a lighter under the foil.</p><p>From the Inside: I saw the smoke rise and started inhaling very deeply and took in as much of the smoke as I could. I held my breath and my friend took my straw and foil from me. ... Almost immediately I started to melt but not slowly or calmly but in a kind of uncontrollable surge. I looked at my sweaty and cold hands that I had put on the carpet and saw them melting into the ground. I heard a voice and looked up: the last thing I saw before departing for another world was my friend's concerned face as he peered at me and said 'you OKKKKkkkkkkkkkkkkkkkkkkkkkkkkkkkk .........' His voice was just lost in the great metallic hiss that I seemed to hear not only through my ears but through my whole being. And I was no longer a human or anything. There were no visuals but a great sense of light washing over me. But it wasn't friendly or soothing but more like some sort of mercury that was enveloping me. (I later thought of it as similar to the scene in the first Matrix movie, when Neo is given the pill and is being awakened except that everything was so fast). And I was just another surge of metallic hissing energy moving in a whirlpool of furious buzzing energies.</p><p>At that moment I was not thinking of death or life or anything in the world. But suddenly I thought 'I'm gonna die', 'this is it'. I think this is when I had started coming down a little bit. Because, although everything was still really scary I COULD think of death!! A few moments later, I saw my friends who were just looking at me with wonder and happiness as they saw I was coming back. And the effects went away rather quickly. And I was in AWE! This experience was one of the most intense in my life. I think it has changed me greatly.</p><p>From the outside: My friends say as soon as I inhaled the smoke I looked very strange and terrifying. Despite the fact that my eyes were wide open the whole time and I was staring at them (or through them) I didn't seem to see or hear anybody. After a few seconds I had taken my arms high and started shaking them uncontrollably and my watch was rattling and the whole spectacle was terrifying for my friends. Next I started licking my hands and rubbing them and biting them lightly and there was loads of saliva. After a while I kept saying 'I'm dying! What is this we've done? help me friends' in a very desperate way. As soon as I came back though I just said 'Wow, holy fuck, that beats everything we've tried so far!'</p><p>The Continuation: despite my great fear of the drug, that night I tried it one more time with almost exactly the same consequences except I also bit a little at the leg of a friend who was sitting dangerously close by (but very lightly, of course)!!</p><p>I'm very scared of this substance and don't recommend it to anyone except for the true seeker. I had a great experience though and will probably try this again (despite the great fear!).</p><p>Trip Safely!</p>",
 "year": "2003",
 "id": "29834",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-26T07:00:00.000Z",
 "views": "20053",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
