{
 "title": "Why I'm Now Taking Antipsychotics",
 "author": "Phydoux",
 "citation": " Phydoux. \"Why I'm Now Taking Antipsychotics: experience with Cannabis (ID 29852)\". Erowid.org. Nov 10, 2007. erowid.org/exp/29852",
 "substance": "Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Cannabis",
   "(daily)"
  ]
 ],
 "report": "<p>On January 15th 2002 I tried marijuana for the first time. It was nice, lots of giggling, hallucinations,. I could even see with my eyes closed. Everything looked like a drawing, or like TV screen snow. But when it all ended and I looked back on the past, all I could see was a gray fog covering everything. I don't remember my boyfriend's birthday, I don't remember mine, I don't remember any significant dates at all. But here's what happened:</p><p>Every day that passed that I smoked a joint or a blunt or a bowl, I'd get a little more crazy. I'd think people were being mean to me even though they weren't. I'd think that people were trying to hurt me, I'd talk to myself, I'd point out all the things wrong, I could only try and figure out problems. I always felt like my mind was a loop of questions and I kept answering one question wrong, which was messing up everything. I didn't realize that thinking that way was what was wrong. Eventually I started silently and sometimes not so silently talking to people inside my head. They were later explained to be people 'trapped in my aura' who had refused to let go of their lives because they were unhappy, and they'd play games with me because they were cruel by a Buddhist monk (my father). Of course, I didn't learn that until I was laying in bed trying to sleep, when I suddenly realized that a nazi was trying to get my to kill myself. I went to the bathroom to splash some cold water on my face to get it to go away, and it didn't work.</p><p>Six months after I'd started smoking nearly every day, I called my mother to my room and told her everything. She knew, but she'd never heard it from me. I soon went to a therapist and a doctor who would prescribe me paxil (an antidepressant) and risperdal (an antipsychotic). It had been explained to me that I had undergone a depressive psychosis, and a depression so deep that it had turned to schizophrenia. I was a little bit of everything, a little Obsessive Compulsive, a little Post Traumatic Stress Syndrome, severely depressed, schizophrenic, and some more.</p><p>Since then I've hit a joint or a bowl, and the first few times I was having the same problems as before, but now I only hit it occasionally when I take xanax, and I feel fine. But it's really not worth it to risk these months that I've worked so hard since that one experience. I'm much better now, but I fear that I've got one last trial to undergo before me. The one thing I've always felt I must do: Mushrooms. It may not be the best idea in the world, but I feel it's for my best interest. I bid thee adieu.</p>",
 "year": "2002",
 "id": "29852",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-11-10T08:00:00.000Z",
 "views": "6659",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(daily)"
  }
 ]
}
