{
 "title": "The Best New Years Ever",
 "author": "Insomniology",
 "citation": " Insomniology. \"The Best New Years Ever: experience with MDMA, Mushrooms, Alcohol & Cannabis (ID 29886)\". Erowid.org. Feb 10, 2007. erowid.org/exp/29886",
 "substance": "MDMA, Mushrooms, Alcohol & Cannabis",
 "bodyweight": "110 lb",
 "report": "<p>For this New Years, a close companion (boyfriend?) of mine, and I, traveled four hours south to enjoy the holiday festivities with a woman I met this summer, and one of her best friends.   It was to be a quiet New Years, just the four of us (Ill deliver the consonant lineup here  J, S, M, and myself), at Js house, along with Js (very large!) puppy, two shorthaired cats, and Ss dog, a Labrador, who she brought along to enjoy the evening with us.</p><p>M and I arrived at 7:00, and the four of us ate a light dinner, had a few drinks and conversation, then settled down to watch The Two Towers to pass some hours before midnight.  J had an excellent entertainment system  he had managed to acquire, through some great A/V connection, a projector system, so we were able to watch both movies and television on the wall of the living room, which was sufficiently large.  The wallpaper was textured, which leant a sort of endearing old film quality to anything displayed.  As it turns out, there was more movie than there was time to pass, so we stopped the movie about forty-five minutes short of the end to watch the ball drop in Times Square.  At midnight, we each took up glasses of champagne, and ate the capsules, which were half filled with pure mdma (Im approximating when I say 100mg), and then put the movie back on.</p><p>I found that I came up extremely fast.  I was feeling physical effects (a slight tingly, floating feeling) within twenty or thirty minutes, and began to look around at my three companions, to perhaps wordlessly detect whether they might be happening upon their substance as well.  I noticed J wiggling his toes a little, and S stretching, periodically, with a look of mild satisfaction on her face.  This pleased me.  I found it difficult to pay attention to the rest of the film, noticing instead, the grains of the wallpaper, the dogs, and my friends. </p><p>When the movie ended, I decided it was the appropriate time to give out the Christmas presents I had for S and J.   It was my first time meeting J, and I had gotten him the all time impersonal gift  a book.  Granted, it was a book I thought hed like, but I was still feeling a little nervous about the whole gift-giving thing.  Turns out I picked a great time to do it, though, because I took intense pleasure in watching them receive and unwrap their gifts.  I was definitely up on a good buzz at that point, and watching them open my presents made me even happier.</p><p>After that, M and I stepped out for a cigarette.  It was a little too cold outside for comfort, and I was not in deep enough yet to be experiencing higher body temperatures, but there was a nice bench on the porch to sit on.  M told me that he was really happy, glad that he had decided to roll with the rest of us, there had been some question, as he was due for a drug test six days later, and told me that he was having a really excellent time. I smiled and told him that I was as well.  The next hour was filled mostly with conversation between the four of us, ranging from the veterinary profession (something S and J had in common) to the animals, anything that piqued our interests, collectively or otherwise.  I gave M a massage, which I probably enjoyed giving as much as he did receiving, and S and I had a brief happy-foot moment together on the couch, as well.</p><p>At around 2:00,  S, J and I ate the mushrooms.  I feel inclined to mention here the incredible feeling of safety I have around these two friends of mine.  They are both amazing, incredibly intelligent and interesting people who brought to the encounter their considerable wealth of medical knowledge and past experience.  That sense of extreme safety and comfort with my company made it almost impossible not to have a thoroughly good time.  I was perfectly comfortable allowing J to dose me.  I recall his giving me pill number 2, though I cant remember whether it was shortly before or shortly after the mushrooms, but it was, give or take, within 45 minutes either way. The point being that my sense of time disappeared about 30 minutes after I ate the mushrooms, and didnt return until it began growing light outside.  I had trouble locating (or reading) clocks in the house, after that point, so trying to track my experiences by time is rather futile, here.</p><p>Directly after that, we milled around the kitchen, consuming water like fiends, and J disappeared downstairs where all of his sound/DJ equipment is located.  M S and I wandered into the living room, and sat on the couch, listening to him spin trance through the speakers upstairs.  I had been eagerly looking forward to hearing J spin for months, as his promo cd has not left my car stereo for an almost embarrassingly long period of time.  I wasnt aware, at that point, that the music was coming from J and not from a CD, but I somehow thought to ask.  S told me that it was, and when I expressed a desire to go down and watch, if he wouldnt mind too much, the three of us moved downstairs. </p><p>Here I have to confess to being a little muddled about the events.  I have a distinct memory of the four of us, J included, standing around there for a little while, settling into chairs, or on the floor, making puddles of ourselves with the animals.  J was pacing near the tables, looking aimless and perhaps a little confused, in the downstairs area; after a while he said I havent forgotten how to spin.   Which made me laugh, because it seems we were all appraising the growing heaviness of our individual trips.  I cant figure out how that makes sense, logically, because we were hearing him upstairs a moment before, or at some point during the evening.</p><p>Eventually he did make it over to the tables and spun for what felt like a very brief time.  He later relayed to me, through e-mail, that the fungus had gotten the better of him, and it was all he could do to put records on, let alone mix.  I thoroughly enjoyed his time with the music, though, and I think it was at this point in the evening that I did the most phenomenal damage to my body than I have done on any other clench drug. </p><p>I remember lying back in the chair, and looking through half-closed lids at the Christmas lights dangling from the wall, and letting myself sink into the beat and the melodies.  I remember indulging myself (far, FAR, FAR too heavily, in retrospect) in the act of biting my lower lip.  I was probably tripping too hard to realize that it hurt.  I have no recollection of aggressively chewing on it, but when J was finished trying to understand his DJ equipment, we went upstairs to the kitchen and the three of them gathered around me like curious animals.</p><p>Oh, honey, J said to me you need some ice.  Apparently I had really chomped down on that thing, and it was already beginning to swell.  I ended up just chewing on the ice, and probably leaving it on a piece of furniture somewhere, because I dont remember what happened to it after I put it down.</p><p>It was at this point that I was getting the serious magical effect of the mushrooms.  Dogs seemed to materialize, spontaneously, in front of me, with their large, benevolent, curious faces.  I remember feeling delighted like a little girl with their immediate and unprecedented appearances.  S asked J if he had anything that I might be able to chew on, actually what she asked him was Do you have the belt? and the fact that the two of them had a specific instrument for this purpose brought a smile to my face, and reminded me how much I loved them in that moment, in as much as I have not fallen in love with S at least 5 times over in the brief period of time that I have known her.</p><p>He returned with a leather glove, which I proceeded to chew on with the enthusiasm and unmitigated gusto of one of the dogs.  I felt very connected to the dogs. At one point, the Labrador approached my glove (temporarily dropped and forgotten about) and sniffed it inquisitively.  I felt like I could understand everything going on in his head.  I want to chew on this! Im thirsty! I want to go outside Pet me!.  In rapid succession, after that, I filled more water for all of us, smoked a cigarette outside (I was now warm enough to enjoy the winter chill), and reclined with M on the couch, cuddling very intensely.</p><p>The mushrooms had disagreed with S extremely strongly, and she was making frequent trips upstairs to vomit.  She later told me that it was the worst stomach/gut wrenching vomiting experience she had ever had, and that the tight clenching in her stomach would not subside, for several hours.  I was tripping so hard, however, that even when she was not with the rest of us in the room, I felt that she was, and I was, on more than one occasion, eluded by the fact that I couldnt see her  I was that convinced, and that comforted by her presence, that I seemed to create an essence of S in the times that she was away.</p><p>Shortly after this I began to experience the most intense hallucinations I have ever had on either mdma or psilocybin, individually.  I leaned back and stared at the textured ceiling, and it seemed to rush over me in waves, augmented with splashes of color being picked up from the images being displayed on the wall.  Drops of sparkling color would appear, from time to time, and would drip, like a pleasant rain, down from the ceiling, onto my face, clothing, the floor, other peoples faces and clothing.  I was hallucinating all over that ceiling, and it was a damn good time.</p><p>I also began to experience, at that time, a controllable level of nystagmus, which added to the intensity of my gentle hallucinations.  I was still clenching my jaw, and sucking on that swollen lip of mine with terrible (wonderful) intensity.  Every breath I took seemed to take up the entire volume of my ribcage, and with every exhale, I sank deeper into the couch.  M was peaking intensely at this point, and kept returning to a spot above my left hip, which he was alternately grabbing and stroking for long enough to flip in and out of my awareness.  His head was buried behind my shoulder, so I remember looking at his hands as small, independently minded animals, like the dogs.  M. does not really like large dogs, and his constant mentioning of it saddened me a little, because I loved nothing more, in that evening, than to scratch their fuzzy barrel-wide bellies, and draw their heads into my chest and murmur into their soft foreheads, feeling that warm, wet comforting feeling of doggy-nose in the small concavity in my neck, between my collarbones.</p><p>Shortly after the intensity of those beautiful hallucinations dropped off a bit, I began to feel sick to my stomach.  For some reason, a really hard, solid, excellent roll seems to be paired with a latent nausea, for me.  It happens every time I have a really, really good experience, and I have yet to figure out why.  I had had that feeling once before, after eating the mushrooms, but I was able to choke the welling feeling in my throat back down.  This time, not so.  The arrival of my need to vomit was fast and surprising, and it filled my mouth, and almost came out my nose, I had to run, covering it with my hands to the sink (S. was upstairs in the bathroom)  where it seemed to explode out of my body.</p><p>Strangely, this was not at all unpleasant, and felt entirely natural.  I had been drinking massive quantities of water, because I was sweating like a beast, so it all came up strikingly smoothly, and bizarrest of bizarre, I would categorize that heaving under pleasant experiences.  I felt even better afterwards, almost as though Id extended my current roll.  The experience of rolling was static at that point, I had reached what felt like a baseline, consistent floating, completely gravityless feeling.  Throwing up made me feel like I could walk a few more inches above the floor.  When S came down, I decided to go upstairs to use the bathroom.  Once I took care of biological necessities, I became aware of the beauty of Js shower curtain, to quote him Its made out of prom dress material! and for reasons that utterly defy justification, I decided to do some yoga while I was upstairs, in the bathroom, by myself. </p><p>I set myself up in mountain pose, and the plunge to downward facing dog pose felt like an extension of untapped flexibility I had never before managed to locate.  Every muscle in my body tingled with the mild exertion.  Backbends felt absolutely orgasmic.  I felt truly in tune with my body, and connected to its capabilities.  It occurred to me, as well, to do side-twisting poses, which supposedly aid the process of metabolism, and ease nausea.  All of this felt excellent.  I immediately felt like I could breathe more openly, even though I didnt feel my breathing at all restricted to begin with.  The slipperiness of my sweaty skin eventually made continuing with the yoga impossible.</p><p>So I decided to wash my face.  I have no clue in the world how much time I spent in the bathroom doing this.   It was at this point, for the first time that evening, that I looked in the mirror, and saw my face.  My lower lip had swollen out to caricature-sized proportions.  I looked like Max Moneybags from Tiny Toons, or some perverse mockery of myself.  It was unreal.  My pupils were also massively dilated, which pleased me a little.  Dont worry, I told myself youre just tripping your little face off, your reflection wont look like this tomorrow.  M came up and found me, catching me as I stared in the mirror Dont look in the mirror. he told me, Never look in the mirror when youre tripping.  I nod, and we both return downstairs.</p><p>It was beginning to get light out when J offered me a third pill.  I refused it at first, but then decided, what the hell, and took it from him.  Right after I ate it, I thought why did I do that?  I already threw up, clearly my system is done with neurotoxins for the evening.  But I shrugged that off with a happy smile and settled into the couch again, eyelids half mast, still enjoying the appearing/disappearing dog effect.</p><p>The four of us relaxed together, watching early morning cartoons, something ridiculous and colorful involving dragons or dinosaurs.  I felt like Id seen every program we watched before, and that I could predict each line, which makes no sense because not only do I not watch childrens television, I dont even own one.    The sun rose, sending long pinkish strands of wintery light through the blinds, and I may have dozed a little.  The intensity of the baseline roll had subsided, and I was left with some moderately pleasant sensations in my feet, as I moved them over the carpet.</p><p>About an hour before we all wandered off to our separate sleeping places, J S and I smoked four bowls and went to bed.  The first two were from a vaporizer contraption that plugged into a wall outlet, I had never seen or smoked out of one before, and it puzzled me.  I didnt feel particularly high until S seemed to insist on the pipe.  A woman after my own heart.  I felt very, very light, and extremely comfortable.  I felt as though the duration of my last roll was being milked for its last few moments with the cannabis.  I eased into an effortless sleep, and did not wake up until almost 12 hours later, at 10 p.m..</p><p>As one might predict, my lip was in horrible shape.  Despite my optimism, I was, in fact, not tripping all over my face, and my bottom lip really was rather severely inflamed.  The skin was gray and rubbery-feeling.  I couldnt even really feel it, though I remember having some difficulty getting my lips around the pipe when we were smoking weed.  For the following 6 days it hurt like nothing else.  Eating, drinking, and smoking were all intensely painful, and forget brushing my teeth.</p><p>I wrote the following in an e-mail to S two days later : I'm never rolling without a pacifier  again.  I don't care where I am, or who I'm with, but I swear twice over and backwards that I'm not touching uncut varieties such as yours unless I have something I can occupy my teeth with.</p><p>Ive found that Listerine, Gly-Oxide (an OTC treatment used to cleanse/accelerate the healing of wounds in the mouth, commonly used for tongue/lip/labret piercings) and Anbesol work wonders.  It has been eight days since, as I write this, and the sores have gone from being big, rubbery, blood blisters to small, barely noticeable canker-type sores on the inside of my lip, towards my lower gum.  I am feeling much better.</p><p>Hippie-flipping on New Years was the most intense and beautiful drug experience I have ever had.  So much so, in fact, that it inspired in me a rededication to the careful maintenance of a low tolerance with these substances.  It is well worth the reward.</p>",
 "year": "2003",
 "id": "29886",
 "gender": "Female",
 "timestamp": "2007-02-10T08:00:00.000Z",
 "views": "20630",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 2:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": " T+ 6:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": " T+ 9:00",
   "amount": "4 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
