{
 "id": 2990,
 "title": "Infinite Wheel of Hell",
 "date": {
  "submission": "2005-09-28T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "droid",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "333",
    "unit": "mg"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "The first time I experienced Salvia I  ordered a bottle of liquid salvia extract. I cant remember how much I did but it was 3 times the recomended heavy dose, it was the most enlightening trip I ever had, I walked along venice beach at night as the sand turned into tiny mountain ranges with rivers and trees, I sat on the beach and felt like I was talking to god, it was incredible. But the experience I had with salvia last night was nothing close to that.",
  "I picked up a gram of 10x at a head shop, I tried it the first night and felt a slight buzz but nothing too powerful, I did it again later that evening and it still didnt provide anything more than a slight body high, I attributed my failure because there were to many distractions. The next night I decided to try something different. I had read that salvia visions can best be observed in darkness, so I took out my mindfold, it is a mask that completely covers all light and lets you open your eyes in total darkness. I also used earplugs to block out all sound. I loaded the bowl to the brim, went out into my back yard, I took the biggest hit I could take put the mindfold on sat down and prepared myself. Instantly I felt a rush overcome my body. I cant even remember how it started but suddenly I found myself in a completely different place, staring out into infinity, my body felt like it was attached to a huge infinite spinning wheel of myself, there was a presence that was talking to me from the center of the wheel, it was mocking me, it felt malevolent and evil, I had the feeling like I had made the wrong choices in my life and this was a endless punishment, and my life was over, it felt like a trap, but it also felt familiar like I had been tricked a million times before.",
  "My body felt like it was attached to this wheel by a million tiny burning fingers, I struggled to free myself but the wheel anticipated my every move, whatever I tried to grab to free myself disappeared as I spun around the wheel. Nothing was real it all seemed lake a bunch of 2d cardboard cutouts that stretched off into space. I stood up and ran inside the house, tumbling through the hallways everything I was became part of the wheel spiraling off into the void. I finally made it into my roomates bedroom. Seeing his suprised expression was the only thing that brought me back to reality, he remembers hearing me mumbling 'before death,...  Before death'. Over and over. Then it all stopped. It one of the most terrifying experiences I had ever had. I felt like I had died and went to hell. And there was no escape. The whole experience only lasted a few minutes, but my time on the wheel felt like an eternity, one of the scariest parts is that I dont even remember taking the mindfold off. I found it the next day hanging from a nearby tree. I did not respect goddess and she gave me what I deserved. I AM SORRY, I dont know what exactly I was after but I got it. I",
  " strongly recomend that anyone considering trying salvia treat it with reverance and respect, I rushed it, did way too much and went too far into my own head. Salvia itself doesnt scare me, what scares me is that now I'm afraid that its my own mind and soul that I should be concerned about."
 ],
 "erowid": {
  "id": "19787",
  "citation": " droid. \"Infinite Wheel of Hell: experience with Salvia divinorum (extract 10x) (ID 19787)\". Erowid.org. Sep 28, 2005. erowid.org/exp/19787",
  "substance": "Salvia divinorum (extract 10x)",
  "views": "5893"
 }
}
