{
 "title": "Fourth Time - Tryp to Infinity",
 "author": "Hector the Crow",
 "citation": " Hector the Crow. \"Fourth Time - Tryp to Infinity: experience with 5-MeO-DMT (ID 29944)\". Erowid.org. Jan 15, 2004. erowid.org/exp/29944",
 "substance": "5-MeO-DMT",
 "bodyweight": "110 lb",
 "report": "<p>The following is a report I wrote this morning, concerning my first strong tryptamine experience. It was typed 30 minutes after the peak.</p><p>Hey. Okay. My business, that stinks of profundity, is to describe the trip, integrate the trip, as soon after tripping as I can. Now's the time I dictate: I wonder: What was real, or what IS real? I don't want a narrative, I want a meta-chronological gestalt of the fucking trip!</p><p>Well I can tell you - the flash I've been looking for - the transcendence, the boundary dissolution - I finally got there - the breakthrough. I'm confused as hell, and hardly know how to describe it - tagging any words to its shining essence feels hideously futile... but something compels me to try...</p><p>there was boundless joy, infinite joy - only a brief moment of terror - bafflement - beyond lingual bafflement - this was not elves, no fucking self-dribbling basketballs, I can tell you that - a broad bonk on the head with a blunt cerebral/celestial filter - a cleansing - for a brief moment, I was cleansed of self - my self washed away, it really happened - it was not just a theory, it was a reality -</p><p>the ontology alteration, the shattering of the world is fully gone, but psychological aftershocks are still buffeting me as I write this, jostling, stunned - christ...</p><p>do i describe this experience using words like good and bad? do I impose values on it? Somehow, that doesn't seem right - abstract as possible, concrete as possible - I keep wanting to contradict, to do opposing things at once - somehow this relates to a philosophical theme of the trip, an intuitive insistence I had not planned for, nor had any anticipation of...</p><p>when the real thing hits you - it's hard to know what to think</p><p>you should probably just shut up and look around - the world - look around your head</p><p>but you can't can you you babbling fool? - you wanna WRITE about it - in second person now -</p><p>okay, go ahead then... maybe you'll wise up next tryp</p><p>cause we ARE gonna do this again, my precious...</p><p>soon... at a higher dose - because as amazing as THIS experience was</p><p>I know there are levels above this, and that is staggering</p><p>I know if I do a bit more, with an open mind this time</p><p>I know I can get even farther out - maybe transcendent of this strange transcendence...</p><p>Okay, now I'll try a conventional narrative trip report:</p><p>My third experience resulted in about the same effects as the second, even though I thought I added more powder. This time I was very liberal with the powder (estimated 10-15mg). I was determined to get to the next level this time. Well I did.</p><p>I sat down and took one big long toke, 15 seconds of inhalation. I started feeling it very early on, very strong, and very definitely this time. I took another big long toke, 15 seconds. About halfway through this toke, I knew it was escalating toward some novel perturbation of consciousness - something I hadn't experienced yet - I was in for a ride...</p><p>I may have taken a third toke, I may have not - I don't remember - somewhere during this second toke, I phased out of the regular universe I was accustomed to, and emerged in something else - I felt pulled into some swirling foreign reality - panic immediately gripped me, but I struggled to remain calm - my whole field of vision seemed to distort - AS a field - as if what I saw was a flat texture being pulled off of some larger underlying essence - this was me stepping out of my 4 dimensional matrix of space time and encountering something greater - I could not handle the vertigo - I had to do SOMETHING - move!!!</p><p>I got up off the chair and fell onto the couch. This leads me to believe that I wasn't as high as I could've been - that being, tranced and incapacitated, abandoned to the void...</p><p>I lay there, overwhelmed, fearing my mind had been taken too far, too far to ever return to sanity - this was far beyond any psychedelic state I'd yet encountered - this was completely new. For a few seconds, I wanted nothing greater than to return to my previous state of consciousness.</p><p>I felt the panic of the lucid dreamer trapped in a nightmare - anything could happen - I felt the terror of an impending obliteration...of what, I was not sure - but I knew it was too big for ME - and I was right - the universe was not big enough for ME and IT both... It was ME that was destroyed - ego lost.</p><p>I was not feeling a void, rather a transmutation of reality - I felt my self, my ego, slip away rapidly, and completely, leaving a bizarre vacuum in the psyche that was now just a component of the universe - everything just a component - the loss of self brought me a feeling of unity and complete oneness with everything - infinity manifested as the doubt-destroying, blinding essence of existence - the self and my life were not real - life is but a dream - I'd been awakened, shaken out of the hypnosis of that narrow limited reality.</p><p>I felt ecstatic that I had reached this state - I felt triumph - I felt enlightened - I felt every question was answered - I felt immortal - but I couldn't say why ~</p><p>Profound profane hilarity - cackles, giggles </p><p>I was on a profound positive plateau, stretched as a pretzel figure-8 paradox strange loop - I felt like I'd finally inhabited certain mystic states - I felt neither cosmic consciousness nor solipsistic consciousness - the feeling was on another spectrum entirely - words I carried were INFINITY and OTHER - I went to my bedroom, through a bubbling twisting warping hallway, got on my computer, and typed typed typed... For a second I was ready to anoint EVERYONE ENLIGHTENED DIVINITY!</p><p>I typed my ecstasy, which startled to dissolve into skepticism, with revelations fleeing, fleeting like nitrous oxide truths - William James' axiom rang in my head: 'Everything in this universe is the smell of burnt almonds.' Might as well have been. Is. Was.</p><p>I was far MORE than myself, and far less as well. I felt filtered into a meta-self, shaken from self, loose, drifting, free...</p><p>but with nagging skepticism</p><p>was it all real?</p><p>what does it mean?</p><p>should I care what it means?</p><p>why am I asking this?</p><p>the jolt from this otherworld back to reality was jarring - hard - mundanities sweeping in - window closing...</p><p>what do I make of it? what do I make of it?</p><p>Pressure to make something of it - strain -</p><p>knowledge that i'll forget what it was like</p><p>I'll HAVE to forget, right? How can I retain it? No way that's possible.</p><p>I'll forget, and what's worse, I won't BELIEVE!</p><p>I'll believe I was hyperbolizing, souping up the description...</p><p>well...I dunno.</p><p>That was then and this is now.</p><p>And time keeps on slipping - slipping away</p><p>what was once a dilated near-infinite moment</p><p>is now an afternoon going by much too quickly - a trip fading...</p><p>Allowing myself to indulge in the banality of spell-check is the final sign that Im down for good.</p><p>Lol.</p><p>Why did I type?</p><p>I shouldn't have tried to english it so soon</p><p>I should have experienced, not recorded.</p><p>This is all lies though - language...</p><p>~</p><p>Ego loss, for 'me' (whatever that is) is something that I 'myself' can't really make sense of after the phenomenon is over. I only remember it as a pale fact, not a reality. If my experience on three grams of shrooms was a 5 or 6 (on DMTurner's scale), the 5meoDMT flash was probably a 7 or 8. Certainly a jolt - an unambiguous blast into new territory. And still... I must go further.</p><p>I'd rather use nnDMT than 5meoDMT, as the former is allegedly much more visual - I assume the hallucinations could better help me assign meaning to the experience - but 5meo is what I have to work with, and it's definitely powerful stuff in its own right.</p>",
 "year": "2004",
 "id": "29944",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-01-15T08:00:00.000Z",
 "views": "35537",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "12.5 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
