{
 "title": "Grossest Feeling Ever",
 "author": "Stupid Girl",
 "citation": " Stupid Girl. \"Grossest Feeling Ever: experience with Tobacco (ID 29941)\". Erowid.org. Jan 12, 2004. erowid.org/exp/29941",
 "substance": "Tobacco",
 "bodyweight": "145 lb",
 "report": "<p>One time I was weedless but craving a toke. It was too late to score any weed so I got a pack of light, filtered cigarettes at an all-night gas station. I knew cigarettes would not satisfy my hankering to get stoned, but they would satisfy the ritual of lighting, inhaling, and exhaling something, which I quite enjoy. Being a non-smoker, I was also looking forward to the 'nicotine buzz' that I had heard about.</p><p>I lit one cigarette and began to smoke it. What I immediately noticed is that the smoke was much harsher than marijuana smoke. I could only take tiny hits and even then the sensation in my air-passages was still slightly burning and stuffy-feeling. The taste of the cigarette was also unpleasant compared to the taste of cannabis (which I've grown to enjoy very much.)</p><p>Feeling a slight buzz, which more than anything merely feels like mild dizziness and light-headedness, I decided to smoke another hoping to increase my buzz. I smoked my second cigarette and the buzz was dysphoric, if anything. I started feeling very gross. My overall physical self just did not feel right.</p><p>After I finished my second cigarette, I went inside my house and an overwhelming urge to vomit came over me. I ran to the bathroom and threw up twice. Not to be graphic, but this vomit was not like any other I had produced in my entire life. It was white and foamy with some brown in it and pretty disgusting. My body felt strange and on edge. I decided then that cigarettes are gross.</p><p>Since this experience, I have smoked, but it wasn't until months later. And ironically, it was because I moved and could no longer smoke weed. Sometimes I would smoke ultra-lights to satisfy my need to be smoking something. I never smoked that much tobacco and nicotine in one session ever again though. Cigarettes still make me feel very dirty and that is why I have stopped completely. When I am drinking or out with friends I may light up, but I no longer waste my money supporting the evil big tobacco companies.</p>",
 "year": "2003",
 "id": "29941",
 "gender": "Female",
 "timestamp": "2004-01-12T08:00:00.000Z",
 "views": "48976",
 "dose": [
  {
   "time": "0",
   "amount": "2 joints/cigs",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  }
 ]
}
