{
 "title": "The Little Tripper Who Couldn't",
 "author": "Marquis",
 "citation": " Marquis. \"The Little Tripper Who Couldn't: experience with Nutmeg (ID 29953)\". Erowid.org. May 26, 2006. erowid.org/exp/29953",
 "substance": "Nutmeg",
 "bodyweight": "60 kg",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Nutmeg",
  "(ground / crushed)"
 ],
 "report": "<p>When I began abusing nutmeg I was going through a very rough patch in my life, I was very depressed, and my abuse of this terrible spice only served to make things worse.</p><p>Around April of 2002 I learned that nutmeg could be used to get high. I was only 15 at the time, and, quite frankly, all I cared about was getting high. I drank and smoked hash quite frequently.</p><p>A week or two after I learned about it, I decided to give it a shot and took a tub of the demon spice from my kitchen one night. I dosed at about 8PM that night, taking about 15g. I was awake until around 11PM and by that time I had decided that nought was going to happen and went to sleep.</p><p>I awoke the next morning for school in a complete haze. I was overwhelmingly stoned - I had terrible drymouth, my eyes so bloodshot that they were barely open and the body load was so heavy that I had a hell of a time getting ready for school. I managed somehow. At school I just sat around feeling fantastic. I was on exactly the same high as I'd get from my favourite plant, weed, and I was more stoned that I had ever been. My schoolmates all commented on how out of it I looked but I was unable to respond because the drymouth was so bad that I couldn't form a sentence.</p><p>The next day I was a little groggy yet I still felt great. Here I was, having discovered something that was as good as weed - hell, it was better than weed. I could get incredibly stoned for two days straight and all for the low low price of 1.99! I was on top of the world!</p><p>And thus it continued - I soon fell into a regular pattern of nutmeg use, as often as three times a week but more usually once every week or two. Sometimes I would drink a bottle of wine while I dosed, so that by the time the wine would wear off I'd be buzzing off the meg, as happy as could be without a care in the world, or I'd smoke a few joints while I was peaking to allow for an even better experience. I spent the entire summer in this pattern.</p><p>My method of ingestion was not as bad as how other people seem to do it. Rather than use the pre-powdered nutmeg I would buy a packet of whole ones and crush them up in a mortar and pestle until they became small nutmeg-chunks. Washing these down with water left no horrible taste and none of that nutmeg-clinging-to-back-of-throat feeling.</p><p>As for the buzz, this is what it was for me: I just felt incredibly stoned. It was almost exactly the same as a cannabis high, only MORE euphoric. Music was particularly excellent and Pick Floyd and Bob Marley would bring me to a state of ecstasy. I also found it alot easier to get absorbed in anything I was reading. I guess it aided my ability to create mental imagery.</p><p>Having read accounts online I would have expected this to be a little more trippy, but the only hallucination I ever experienced on nutmeg was this - sitting watching TV as I came up one night, the sound from the TV faded away and I was suddenly listening to Micheal Jackson's 'Black or White'. This only lasted for a few seconds and then it was gone.</p><p>On that particular night I had been trying out a new brand of nutmeg and I had estimated my dose to be 20g. It was actally less than that, though. (This is something to note - I have found that the potency of nutmeg from different sources varies vastly, and I learned this the hard way that night).</p><p>After a few hours of TV, when I had pretty much just come up, I felt extremely sleepy (unusual for me to get so tired so early) and decided to go to bed. And off I went.</p><p>I awoke at 5AM, after only 4 hours sleep. At first I didn't realise I was awake. In fact, I didn't even realise who I was. All I knew was that the face that was floating around amidst the stars on the ceiling of my bedroom was awfully close, only inches away. I wondered how the ceiling had gotten so close to my bed. It seemed to be getting closer. I lay there confused for a few seconds.</p><p>Something's not right, I think to myself.</p><p>What could it be?</p><p>Hmm... hang on... is it.. yes, that's it, I'm not breathing, that's what's wrong.</p><p>*GAASP*</p><p>Okay, we sorted out that problem anyway. Now where'd the face from the ceiling go? He must be around here somewhere..</p><p>Wait. There it is again. Why aren't I breathing?</p><p>*GAAASP*</p><p>This is odd. Normally breathing just happens by itself. Here, did the ceiling just get closer? I think it's trying to kill me. It's trying to suffocate me. Oh, no....</p><p>*GAAAASP*</p><p>That can't be it. Carbon dioxide, that's what it is. The room's filled up with carbon dioxide and that's why I can't breathe. I've got to move, I've got to get out of here.</p><p>I black out. I stop breathing.</p><p>*GASP*</p><p>What? Where am I? Why is it night time?</p><p>Oh, yes, that's it. I'm in bed. but why aren't I breathing?</p><p>*gasp*</p><p>This is starting to scare me. Why can't I feel my left arm? Why is my heart beating so fast?</p><p>*gasp*</p><p>What does that guy in the ceiling want? I can't feel my face. What did he do to my face?</p><p>*gasp*</p><p>I ought to get out of here. It's the carbon dioxide. It has to be. I'll just get up and go get some fresh air and I'll be okay.</p><p>*GASP*</p><p>OH, NO! IF I GET UP MY HEART WILL EXPLODE! My leg feels swollen and it's all numb! One of my arteries must have burst, and now my leg is filling up with blood. I'm going to die.</p><p>*GASP*</p><p>What do I do? What do I do? If I stay here I'll die, and if I get up I'll die too! What do I do?</p><p>*GASP*</p><p>Wait, think about this. How did you get here?</p><p>*GASP*</p><p>Nutmeg, that was it. I took nutmeg last night. I've OD'd on nutmeg. I'm going to die. I can't feel my face. I can't breathe. I've got to get out of here.</p><p>I black out. I stop breathing. I awaken with a gasp, and the cycle begins all over again. Suffice to say I spent a good three hours lying in bed, gasping for breath every so often and occasionally blacking out. I was too terrified to move. I stopped hallucinating but I was delusional - I was convinced that an artery in my leg had burst as a result of extremely high blood pressure. I was absolutely certain that I had given myself severe nerve damage from the nutmeg, and hence the numbness in my face and limbs.</p><p>I eventually calmed myself down a little and plucked up the courage to go downstairs and tell my mother of what had happened and that I was certain that I was dying. She called an ambulance. I spent several hours lying in an emergency room bed. I was then moved up to a ward which was filled with old men who had to use catheter tubes. The hospital staff wanted to hook me up to one. Not pleasant. I didn't come down fully until about three days later. One thing lasted, though. The left side of my face and my left arm and leg were still partially numb - I could sense temperature and pain, but not pressure. Strange, huh?</p><p>To this day I still don't know for sure if nutmeg actually caused me nerve damage or if it's somehow all in my head, but I remain convinced. While it is not as bad as it was when I first got landed in that hospital, I still can't feel pressure properly. Since this experience with nutmeg, I can no longer smoke hash and enjoy it - I associate the buzz with meg too much. The first few times I smoked up after I was in hospital I freaked out bad because, well, I was so aware of my lack of sensation in my face and limbs. It was exactly like being back in that bed, unable to move. Nowadays when I do smoke(very rarely) I don't usually enjoy myself as I just get slightly depressed, but that's all.</p><p>I also went, to put it one way, a little crazy after this experience. In addition to bouts of horrible anxiety lasting for days and loads more depression, my thought patterns just became. odd. Very odd. Sometimes my train of thought would skip from one thing to another without any logical connection etc.</p><p>This whole ordeal has been the most unpleasant experience of my life.</p>",
 "year": "2002",
 "id": "29953",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-26T07:00:00.000Z",
 "views": "34505",
 "dose": {}
}
