{
 "title": "More Detailed Than 2C-E",
 "author": "Thebeancounter41",
 "citation": " Thebeancounter41. \"More Detailed Than 2C-E: experience with 2C-T-2 (ID 29961)\". Erowid.org. Jan 11, 2007. erowid.org/exp/29961",
 "substance": "2C-T-2",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-T-2",
   "(capsule)"
  ]
 ],
 "report": "<p>Get home from work.  I had prepared a dose of 2C-T-2 the night previous.  I eat the gelcap containing the off-yellowish powder and wash it down with a soda.</p><p>T+1:00 I feel the first alerts.  Muscles tense and become a bit stiff.  Feel pulses of coolness wash over me in waves.</p><p>T+1:30 I'm starting to wonder if maybe I did a bit too much of a dose.  I'm picking up speed fast as the room starts to spin in vertiginous loops.  After wondering about the sanity of ingesting such a dose of what amounts to chemical russian roulette for about 30 minutes, I start to even out a bit and enjoy the ride.</p><p>T+2:00 Visuals have started to pick up strength and clarity.  Everything has a sheen and the walls seem to be breathing.  I forgot to mention, this stuff makes you incredibly HORNY!  Definitely rates up there with X or acid.</p><p>T+3:00 I seem to have peaked.  The bodyload is still substantial and visuals are still pretty consistent in being exactly NOT what you expect when comin DOWN from the peak.  The visuals at this point are actually BETTER than when peaking on C2E.</p><p>T+4:00 Still feel the body load but my vision has pretty much come back to level.</p><p>T+6:00 Pretty wrung out but feel fine other than that.  Neck muscles noticeably tight.</p><p>In conclusion I give this substance a definite thumbs up for the more experienced inner explorer.  It may be a bit intense for younger viewers (as in 1st timers) Hell a bit too intense for even me for awhile there and I'm a 25 year veteran of practically every hallucinogen known.</p>",
 "year": "2004",
 "id": "29961",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-11T08:00:00.000Z",
 "views": "5064",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(capsule)"
  }
 ]
}
