{
 "title": "Turn Me Off",
 "author": "LizardKing",
 "citation": " LizardKing. \"Turn Me Off: experience with 2C-I (ID 29975)\". Erowid.org. May 1, 2007. erowid.org/exp/29975",
 "substance": "2C-I",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-I",
   " T+ 4:30",
   "10 mg",
   "",
   "2C-I"
  ]
 ],
 "report": "<p>I recently obtained some 2-ci from a friend of mine. Now I'm not a big chemical guy, I've done 5-MeO-DiPT, DPT, and AMT, each once and that pretty much covers my research chemical experiences. But I have heard good things about 2-ci from a earlier batch obtained from the same source. So I have decided to indulge in it.</p><p>10:30pm I take 20mg orally and so do my girlfriend J and by best friend R. Me and R start playing music to waste some time, he has taken it 2 days prior with excellent results so he wanted to join me this time.</p><p>11:10pm I start to get chills, not sure if its because my basement is cold or its the drug. 5 mins later I get itchy same with R and J. But along with the itchiness I get the pre MDMA push feeling, that something good is coming at you.</p><p>11:50pm I start coming into this fast, I get alittle bit of overwhelming anxiety for a few minutes, so I turn on the Grateful Dead which has always proven to pull me out of the craziest acid trips. I relax and am relieved with an array of breathtaking visuals, very stimulating drug. Jitteriness of MDMA body buzz of a high doze of MDA.</p><p>1AM This drug is too jittery for me, but music is very stimulating, hallucinations are very well adapting to the music.</p><p>For some reason R has some confortations with a phone call from his girlfriends friend who is coming over to start a fight with him. I go outside to back my buddy up. The andrenaline pumps up the speedy like effect from this confrontation and never quite goes down. I come back inside and my visuals have stopped.</p><p>3am All I have been left with is an uncomfortable body buzz. I decide to take a 10mg bump.</p><p>5am The Bump from earlier finally kicks in I am hit with amazing visuals. Followed by a tightness of all my upperbody muscles. Even though there was no mind trip I was seriously worried about my health, every second was concentrated on my well being. I convinced myself to relax. This drug has amazing visuals at point but it is not worth this pain I am feeling. Such a dirty feeling right now. I want it to end.</p><p>7am R left my house and I decided to seek comfort in my girlfriend J. We made love like we usually do on any trip. I will tell you this, besides LSD this is the best feeling drug to make love on than anything I've experienced. Afterwards I lay awake and closed my eyes. I've never once experience closed eye visuals but I was swiftly taken to another world. I found myself in some type of warp through space and for some reason put into a castle looking up and down the walls. But when I opened my eyes the world dissapeared. This continued in different ways for about an hour.</p><p>9am Terrible aches and pains in my upper body go away, no more jitteriness left. I go get something to eat and sleep for the rest of the day. I'm left with a very ackward feeling for the remainder of the next two days.</p><p>I dont know what to make of this drug. I trip to achieve enlighteness and expand my mind. This did neither. Nothing like LSD or mushrooms. If your in it to see out of this world visuals. This might be for you. If you like enjoying yourself and feeling free this is definately not in my opinion.</p>",
 "year": "2004",
 "id": "29975",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-01T07:00:00.000Z",
 "views": "4146",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": " T+ 4:30"
  }
 ]
}
