{
 "title": "Conveniently Subtle",
 "author": "Merlin",
 "citation": " Merlin. \"Conveniently Subtle: experience with 2C-T-2 & Cannabis (ID 29990)\". Erowid.org. Jul 14, 2004. erowid.org/exp/29990",
 "substance": "2C-T-2 & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  "DOSE: T+ 0:00",
  "20 mg",
  "oral",
  "2C-T-2",
  "(liquid)",
  " T+ 24:00",
  "20 mg",
  "oral",
  "2C-T-2",
  "(liquid)",
  " T+ 25:30",
  "1 hit",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I had acquired two 20 mg doses of 2C-T-2 suspended in shots of 151 proof alcohol for my friend K and I.  K backed out of tripping at the last minute so I decided to go once with K as a sitter on a test round, and then if i liked it, to go again the next day by myself.  There was one catch being that we had no more nugs left to smoke, so i would have nothing to smoke if i got nauseous.  I had nothing in my stomach, so I decided to down the shot in some o.j. anyway.</p><p>About an hour after dosing i got suddenly upset to my stomach and let loose some stomach acid a couple of times.  After throwing up i felt utterly empty, however this was not bad...the 2C-T-2 was acting in a strange way such that i felt neither good nor bad, just content and really deep in thought.  This trip ended up minimal, only some underlying visual patterning and some shroom-like thinking, but on the whole nothing special, probably as a result of having puked.</p><p>The next day is a whole different story however.  I got my hand on some good bud to smoke so that this time i could kill the nausea.  I downed the second 20mg dose in o.j. again and smoked some bud right after.</p><p>About an hour and a half later i got a little nauseous again, so i took a giant gravity rip and held it for a while.  AMAZING change of thought process!!!  The longer i held the smoke in my lungs, the better and better i felt.  The nausea retired instantaneously and my trip skyrocketed along with my high.  Out of nowhere i was in an intense arena of thought that resembled an introspective shroom trip only very different.  2C-T-2 is fascinating, it's almost as if i were tripping my ass off, but completely sober at the same time.  As far as i was concerned i was definitely tripping face:...eyes dilated, crazy intensification of colors and visual patterning, an intense self-awareness both of mind and body...however nothing had really changed.  As opposed to lsd or shrooms where the trip is right in your face and so filled with character and flavor that normal bahavior and communication become almost irrational, this trip was affording me the ability to have psychedelic thoughts and perceptions and to maintain control over my everyday environment at the same time.</p><p>I was carrying on a perfectly normal conversation with my mother leaving her completely unware that i was operating on any substance.  This drug was so convenient in that it was subtle enough to let me remain sane and in control (i could very easily have driven if i had wanted to)  The trip never really got any less intense...it was pretty much getting better and better right up until i went to bed about 6 hours later, and this i did easily as the 2C-T-2 definitely left me exhausted.  In the future i can see people tripping and going to work on this drug.  I give 2C-T-2 points for its intense subtlety (only way i can explain it).  it was a conveniently placed trip that did not require any preparation other than having some nug around to smoke.  The smoking made the trip a overall great time.</p>",
 "year": "2003",
 "id": "29990",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-14T07:00:00.000Z",
 "views": "10351",
 "dose": {}
}
