{
 "id": 3000,
 "title": "The Symbolism of Nature",
 "date": {
  "submission": "2002-12-26T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Azure",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  },
  {
   "time": "0:30",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(capsule)"
  }
 ],
 "report": [
  "After a number of weeks physical and mental preperation including a digestive system cleanse and a daily routine of meditation, my brother and I decided to venture into the high desert of new mexico. One of the more beautiful spots on the planet with deep blue skies, carpets of pinon and juniper, and intricately woven cloud forms, we left late friday after work. Arriving at our campground in the evening, we settled into the cabin,  decorating our area. Both of us excited, our sleep was disturbed and not altogether deep, though comforted by the bare reality of the nature around us.",
  "Waking early (6am), we prepared ourselves, paying our days rent, each swallowing 200mg of methylone with 12.5mg 2ci. With a feeling of anticipation welling from my solar plexus, I sat in a comfortable position and began watching my breath. Early on, the tendency for the mind to lift up out of stability into the excited air of distraction was identified, and though this tendency remained through the entire experience, I recognized that distraction is a friend in returning us to the expanse of calm awareness. At 30 minutes, the feeling of expansion at the solar plexus induced a warm talktiveness. At this point, my brother was talking at a thousand words a minute. In fact, his conversation dominated the vast majority of the experience. It was recognized by both of us that his 'role' in our family dynamic was 'the go between' or 'peacemaker'; I felt a great joy in his being able to freely express his OWN sentiments in a space of mutual understanding.",
  "We decided at this point to drop the second 200mg of methylone that had been previously weighed out. Our experience than shifted into the beautiful outdoors. The crisp and cold morning air enlivened and awakened both of us. It occured to me, that the morning air was cool and crisp for just such a purpose. The depth of the sky expanded out and around before me in the shape of a bowl. Perhaps Rumi meant this recognition in stating the soul was shaped as a bowl, 'falling up into the bowl of sky, the bowl breaks...everywhere is falling, everywhere'. Up the hillside, in me was identified the tendency to establish 'goals',  and to remain in constant motion towards those goals. Again, this recognition of distraction brought me back,  'I have arrived, I am home, In the here, In the now, In the ultimate I dwell'. THE SKY, OHMYGOD THE SKY. The pinons scattered uniform like a warm carpet on the desert floor, the clothen water meet the sky...OHMYGOD. It is true beyond measure that 'the highest expression which the truth admits lies in the symbollism of nature'",
  "With my brother chattering like a fascinated child, 'what's this...why why why?', our ascent wind up the hillside to a point looking out onto the land. A stand of rocks stood opposite the valley to the north, reminding both of us of a standing troupe of pilgrims traversing the desert floor. The ground beneath us growing soft, with a firm type of assuredness, the thundering waves of distraction calling me home. Our conversation meandered through our distant past, with beautiful and sad memories. My brother seemed particularly concerned with how I related to my father, a number of stories, too long and irrelevant to share here, brought some insight to bear on the future of my relationship with my father. And though I had long since made peace in my heart regarding my father, it was useful and good to bring these insights out into the open of conversation. Our path wandered through the trees, enjoying each soft step and the conversation between us. At one point, we noticed a rare event in the desert sky. The shadow of a jet high in the sky, was cast in front of it's path such that you could see it's direction before it arrived there. Something having to do with the exact position of us in relation to the jet and the sun.",
  "Overall, the experience was marked by a fascination with the 'symbollism of nature'; conceptually, nature 'symbolizes' the realities of impermanence, non-self, nirvana, interdependence. On the realistic level of living truth, it is simply a way of being that is good, true and beautiful. All the worlds religions meet at this point, that nature is 'Good', even in it's self-sustaining brutality, there is a middle way that is beautiful and whole.",
  "At about 5 hours,  the comedown phase was apparent. Let no one deceive you into thinking there is not a crash with this material. Again, the expansion that occurs with stimulants is inevitably followed by contraction, this too is part of the 'symbollism of nature'. As such, my desire for the stimulant class of psychedelics has largely diminished. In fact, with the come-down, my brother began experiencing intense flushes of heat around the area of the throat chakra. Hence, I found some solace in massaging, cooling with wet rags, his neck and upper chest area. It was strange, as I could literally 'feel' the pain and tensions in his body. I felt these tensions as an immense sadness in my solar plexus. At one point, I felt a spot where he tensed up immensely, and tears well up from my heart. I felt a deep wonder in realizing that we literally ARE connected, and we can cry the tears of this world. May my heart be broken a million times. He seemed very responsive to this type of sensitivity and later commented that 'if you had not known what to do at that point, I would have likely been in a very sore shape'.",
  "The preceeding week was somewhat sluggish, though my performance at work shot through the roof, with me working into the #1 statistical position in the company, setting a second company record for service stats out of training. What has been most wonderful, is the almost psychic tuning that has occured between me and my brother. I derive the greatest pleasure in this world from being of service to him, my family and the world around me. All this aside, I will not be using this material again, and have definitely been losing my hunger for the stimulant psychedelics. I look forward to working with the natural class of psychedelics, which are more neutral in the view they afford on the minds contents. Until emptiness, I believe there is something more dynamic and 'magical' with the naturals. Nonetheless, the experience has been valuable, and I look forward to returning to the natural beauty of the high desert for more artistic purposes."
 ],
 "erowid": {
  "id": "19828",
  "citation": " Azure. \"The Symbolism of Nature: experience with Methylone & 2C-I (ID 19828)\". Erowid.org. Dec 26, 2002. erowid.org/exp/19828",
  "substance": "Methylone & 2C-I",
  "views": "24968"
 }
}
