{
 "title": "Take It As a Shot",
 "author": "Munkeestew",
 "citation": " Munkeestew. \"Take It As a Shot: experience with DXM (ID 30023)\". Erowid.org. Feb 24, 2008. erowid.org/exp/30023",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "report": "<p>I have read many reports on this website regarding ways of taking dxm.  Cough syrup is disguting and the problem with capsules for me is that the capsules dissolve much too slowly for the full effects to hit me.  For those of you out there that might have the same problem I'd like to share with you a way of taking large amounts of dxm without having to drink an entire bottle of syrup or swallow 30 or 40 pills. </p><p>Go to the store and purchase robitussin max. strength cough gels. These gels will come in a small bottle and should cost about 4 dollars each.  Each gel contains 15mg of dxm, and since 20 capsules come in a bottle that is a total of 300 mg per bottle, I usually use two bottles which is 600 mg.  Pour the capsules in a glass, and then fill the glass with just enough water to submerge all of the capsules in the water.  This will soften up the capsules.  Let the capsules soak in the water for about an hour or an hour and a half, then take a fork or a knife and poke all of the capsules (while they are still in the glass) and make sure that all of the capsules are broken open.  What you would then have is a liquid with pieces of broken capsules in it.  Pour the contents of that glass through some sort of a strainer, and what you would have leftover would be about a shot glass worth of a very bitter tasting liquid.  You should be able to drink this in one gulp while chasing it with some water.</p><p>For me the effects began to take place about twenty minutes after drinking the liquid.  I would reccomend trying this because it is much easier to take one sip of bitter water than to have 4-8oz of disgusting cough syrup sitting in my stomach.</p>",
 "year": "2003",
 "id": "30023",
 "gender": "Male",
 "timestamp": "2008-02-24T08:00:00.000Z",
 "views": "19453",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
