{
 "title": "Visuals and Puking",
 "author": "Xhemikals",
 "citation": " Xhemikals. \"Visuals and Puking: experience with 2-CT-2 (ID 30071)\". Erowid.org. Dec 22, 2004. erowid.org/exp/30071",
 "substance": "2-CT-2",
 "bodyweight": "145 lb",
 "report": "<p>I'll lead off with oral, mostly because I find it more pleasant.</p><p>Oral : 20 Mg</p><p>Setting : Friends House</p><p>Exp : Slight body load, almost no visuals, patters would appear to shift, and a few stray closed eye colors, but nothing surprising at all. I was rather dissapointed.</p><p>Oral : 40 Mg</p><p>Insuffated : 10 Mg upon onset of oral</p><p>Setting : New Years Party</p><p>Exp : the entire night was confusing, I deceded to insuffate after feeling the effects of the pills (2 20mg each) so I split the pill with a friend. world didn't make sense, intense visuals for around 4 hours, then the comedown which was amasingly calm. sleep and no real headache the next day.</p><p>Insuffated : 8 Mg</p><p>Setting : Home</p><p>Exp : I think it's worth its salt costwise with this method, but the negative body symptoms aren't really worth it. with a dose this small there wasn't too much stomach problems but I still felt the lucidness and body buzz from the high oral dose. I don't remember actually coming down, only forgetting about the effects.</p><p>Insuffated : 15 Mg</p><p>Setting : House Party</p><p>Exp : oh man was this a mistake, this was the first attempt at 2-ct-2 and I wasn't quite ready for it, I was surrounded by friends and all but I've found out 2-ct-2 has a strong pull to just warp my communication skills, mostly because I just stare at stuff. I puked repeatedly, having just eaten tacos  a few hours before. I also found out I forgot the batteries to my discman (it helps with the intense part of the trip, Morcheeba really helps) so I couldn't just go into my own head, and everyone just wanted to know if I had more. the visuals were pretty fun, but the setting destroyed the trip's positive side. I have since revisited the house and done a 20 mg insuffated dose and it was better, as there were less people and everyone already knew what it was.</p><p>Insuffated : 40 Mg</p><p>Setting : Same House Party</p><p>Exp : Oh man... I emptied 2 gelcaps (20 Mg each) onto a mirror and went at it. Reason, I was bored, it was midnight and no one was really there. Within 10 min's I was already at the bathroom, I think I Vomited 4-5 times, even though I had fasted the entire day. I spent the next 30 min's trying to not lose track of everything I brought to prepair (headphones and music), stuffed everything into my backpack, handed it to my friend and found a dark room with a couch where I was to spent the next 3 hours flying through a universe of hallucinations. Everything I could see had tracers, making reality very hard to interact with, I would have conversations in my head with people just walking by. All in all it was really really intense, more so then I was to feel on New Years. I wouldn't recommend doing that much, nor will I ever do that much again. Reason for this was the next day, my body felt like I had just gotten the hell beat out of me... but then again, maybe the bruises were cause I bumped into too many walls when I was tripping.</p>",
 "year": "2003",
 "id": "30071",
 "gender": "Male",
 "timestamp": "2004-12-22T08:00:00.000Z",
 "views": "10891",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "insufflated",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  }
 }
}
