{
 "title": "A Different High",
 "author": "Suburb Boy",
 "citation": " Suburb Boy. \"A Different High: experience with Cannabis (ID 30085)\". Erowid.org. Jun 12, 2007. erowid.org/exp/30085",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "3 bowls",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Im lucky when it comes to substances. I can take benadryl and not feel sleepy, caffeine or sugar and then go right to bed. But also when I take either weed or alcohol (the only substances I've tried), I need only the slightest amount to become stoned out of my mind or drunk and I never get very paranoid or have a huge hangover. And I always seem to remember everything that happened as well, though that's not always good.</p><p>One day, me and three friends decided to share just one gram of weed between three of us (one friend didnt feel like it, and he would become useful later). We made no preparations and out decision was totally spontaneous. We went out behind the garage of a car repair shop and used a bottle to smoke out of. It was a dark night in early december, and it was freezing out. After about two hits, I felt a buzz coming on. On my third or fourth hit, I was feeling the weed very strongly. This high was different from my usual ones. Instead of being hyper and apparently hilarious to all non-high people around me, I felt mellow and peaceful. At this point I usually would've stopped and enjoyed what I had already, but there was so much more left. We went through about two more bowls before we decided to stop (I have no idea how a single gram lasted that long) but there was still more left after we were done.</p><p>As I waited there with my friends, I could feel my mind jumping higher and higher into space. I began to talk to my friend about how I loved him and he told me about how much he loved me. We hugged. Soon, my mind had jumped so high that I stopped thinking. Literally I stopped thinking about anything and stared at nothing in particular for what must've been five minutes. Out of the corner of my eye I could see a street light. Instead of being a tangible light fixture, it was a giant glowing ball of energy. It was the size of two beachballs. Although this seems wierd, at the time I didn'y really care and just respected the ball of energy for what it was. After standing there for a good period of time, we finally decided to go to my friends house at the urging of our non-stoned friend. It was still below freezing out, but we didn't notice.</p><p>When we arrived at our friend's house, we for some reason didn't go inside, but instead just stood in the middle of the road. This is when I think I peaked. I suddenly closed my eyes, and there before me were flashing psychadelic colors. My body began swaying back and fourth in place. I felt like I was a roller coaster cart going along a random track. I stood there, swaying back and fourth in all directions for many minutes with my eyes closed the entire time, colors flashing before me. I felt like I could see the roller coaster track I was following with my eyes closed. It was a chalky golden beam that shone in front of the colors in my head. I'd never heard of closed-eye visuals on just cannabis before.</p><p>Now the munchies hit us. We went to a Quiznos store near us and ordered some sub sandwiches. I shared mine with a friend who didn't have any money, but regretted it because I was still hungry after. While in the store, You Can't Always Get What You Want came on the radio and I yelled to my friend, 'This is such a GREAT SONG!' He humored me, but soon hurried me away from all the people who were staring at the three of us. That night I ate: 1/2 of a sub sandwich, numerous Lindt Chocolates, a large bowl of soup, and two orders of french fries. My stomach would hurt after I sobered up.</p><p>Later that night, we smoked again and watched Jimmy Neutron: Boy Genius on TV, tho this experience seemed toned down and less exciting. I was over-saturated with weed.</p>",
 "year": "2003",
 "id": "30085",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-12T07:00:00.000Z",
 "views": "2247",
 "dose": {}
}
