{
 "title": "E Abuse 3 Years After",
 "author": "LoKi007",
 "citation": " LoKi007. \"E Abuse 3 Years After: experience with MDMA (ID 30080)\". Erowid.org. Nov 11, 2007. erowid.org/exp/30080",
 "substance": "MDMA",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   " tablets",
   "",
   "MDMA",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2001",
   "30080",
   "Male",
   "",
   "Not Given",
   "Nov 11, 2007",
   "13146",
   " "
  ]
 ],
 "report": "<p>Well it's been a few years since my addiction to MDMA.  I'm bipolar and with that comes some severe depression sometimes.  In college I was introduced to E and took a great liking to it to get rid of the depression.  I started selling it so I could do it in the amount I wanted.  I was doing about 50 pills a week for a way too long period of time.  As soon as I woke up everyday I would pop a pill even before I had a cigarette.  </p><p>I started, after months, to become pretty ill and started having horid panic attacks and heart palpitations which finally lead me away from this drug.  I was hospitalized a couple times for the attacks and almost died on one occasion when my heart rate reached 220 bpm for almost an hour while I was in the emergency room.  My heart would stop every once in a while which would just make it beat even harder afterwards.  It took massive doses of barbituates to finally slow my heart.  Having a doctor tell me I would of probably died if I hadn't come to the hospital was a wake up call.</p><p>Three years later I'm still being treated for anxiety although it has been almost a year now since I've had a real panic attack.  For the two months after I quit cold turkey I also had the absolute worse vertigo constantly for every waking moment.  If I wasn't moving I felt like I was spinning head over heals.  Sleeping was a bitch and didn't happen too often for those couple months.  Sitting in a classroom was almost impossible and lead to me taking a year off from college.  Friends and family became real worried after I stopped because of the after effects being so strong and obvious.  To top it off, 4 months since I even touched the stuff I was arrested for selling it, seems I had been under investigation for a long time.  Cost my parents $12,000 to keep me outta jail because I wouldn't work for the cops.</p><p>All said and done I just hope others don't abuse this drug because it can be helpful and insightful like no other drug I've come across.  I hurt myself and others using it the way I did and I'm pretty damned sure I have after effects that will never ever go away.  Wellbutrin has helped me greatly.  I finished college in the end and have found other ways of getting the happiness that E provides though I think about doing it again from time to time.</p>"
}
