{
 "id": 3011,
 "title": "Dealing Is a Drug",
 "date": {
  "submission": "2002-12-23T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Ms. B",
  "gender": "Female",
  "weight": "115 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Cocaine"
  }
 ],
 "report": [
  "<p>I told myself I'd never mess with coke.  Never say never.",
  "I started dealing E in July 2002.  I loved the power of helping my friends out and not working with shady, rude dealers.  Soon I was missing too much sleep, and I lost my job as a secretary.",
  "Unfortunately for me, E is not addictive enough to support my living expenses.  People kept asking me for coke.  (I live in Hollywood, after all.  It's part of the food pyramid here.)  It didn't take me long to find a reliable supplier with good stuff.  Soon I was selling to lawyers, producers, actors, etc.  Who all swore they were my friends, sincerely.  (Shyeah, right.  Let's see who'd visit me in prison if I got busted.)",
  "Cokeheads are reliable.  They will call you 3x a week and BLOW hundreds of dollars.  I could make almost any amount I desired... $300/week if i was really lazy, $1000 plus if I busted my ass and ran all over town.",
  "Of course I had to snort a little myself.  That was my excuse.  It's like Snow White... the wicked witch shows Snow White that the apple is OK by biting it herself.  Soon I was doing it every day.  Real easy when it's cheap and I'm making loads of profit.  I never kept track, just kept being pleasantly surprised by the $20s and $50s falling out of my pockets at the end of a wild night.",
  "But I'd wake up with an Amazon jungle of crust in my nose.  The comedowns would make me cry, bitch and moan.  I lost friends.  I'm surrounded by 'coke whores' who just want a free bump... blow and go.  I never meant to get like this.",
  "To anyone who's contemplating trying blow for the first time, don't waste your time.  It's so ridiculously over-rated.  For those of you currently hooked, take a step back.  I'm a professional dealer and I don't need your money.  I'd rather see you in rehab or at NA meetings (which I'm trying to attend).  There's more to life - INFINITELY more.  You don't need it.  It's a waste of time, money and energy.  When's the last time you met a HAPPY cokehead? ",
  "Above all, don't start dealing.  It's more addictive than the drug itself.  The power, friends and excitement are all a huge scam. ",
  "I got RIPPED OFF - I hope you're luckier than that.</p>"
 ],
 "erowid": {
  "id": "19853",
  "citation": " Ms. B. \"Dealing Is a Drug: experience with Cocaine (ID 19853)\". Erowid.org. Dec 23, 2002. erowid.org/exp/19853",
  "substance": "Cocaine",
  "views": "27741"
 }
}
