{
 "title": "So High I Can't Look Below",
 "author": "Kreep",
 "citation": " Kreep. \"So High I Can't Look Below: experience with MDMA (Ecstasy), Cannabis & Alcohol (ID 30180)\". Erowid.org. Nov 11, 2007. erowid.org/exp/30180",
 "substance": "MDMA (Ecstasy), Cannabis & Alcohol",
 "bodyweight": "128 lb",
 "header": [
  "DOSE:",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "1 glass",
  "oral",
  "Alcohol",
  "(liquid)",
  "",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>I have to explain this experience in third person, because I was so lit up that I felt as though I were looking at myself.  It was much of an outer body experience.  I will use the name 'Ron' for myself.  'Trey' and 'D.C.' were also there for the experience, so I will be referring to them often.  Here goes...</p><p>Ron, Trey, and D.C. decided to go out of town for the weekend to have some fun. We'll say they went to Atlanta.  Anyway, it was a feeling of excitement running through their veins, because this was a big weekend in Atlanta.  People from all over were to be there.  Upon arrival to their hotel, Ron and D.C. decided to take a nap to rest up for the night.  After their two hour nap it was time to get ready to go to the club, so Ron, D.C. and Trey popped a X pill.  This way the pill would have time to kick in before arriving to the club.</p><p>While in route to the club, Ron, being the smallest, began to feel the effects of the pill almost immediately.  First a strong feeling of depression set in.  He felt as if the night had ended already and that he had missed everything.  Then he started thinking about how depressed he would be after all the fun in the club was over.  To relieve his mind, he sparked up a blunt full of the potent midgrain.  Soon the blunt was passed around, and everyone was smoking. </p><p>The trio finished the blunt, even though they were all high after two pulls.  Pardon my French, but now they all were fucked up.  The pill had kicked in, along with the weed.  Ron all of sudden got a full burst of energy.  He was in such a euphoric state, that he couldn't wait to dance in the club.  When in the club Trey and Ron decided to smoke two more blunts.  After that they were through.  Trey couldn't stop dancing, and Ron started to come out of his clothes.  After removing his shirt, he pulled his pants down partly, so that his lower torso could be seen.  Not quite rated NC-17, but rather a rated R scene.  Everyone in the club seemed to be attracted to his small, well defined frame and began to touch him.  However, the sensation of someone's warm hand caressing his body seemed to captivate Ron's mind.  After that Ron went blank.  He had no idea what was happening, but he was loving it.  After leaving the club, the trio decided to go to an afterparty at a 4 star hotel.  While driving, Trey and Ron decided to roll up another one and smoke.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Then when they got to the parking lot they smoked another one in the car.  By this time Trey and Ron were zooted!  And, D.C., who is a social smoker and X taker, was still floating from the blunt we all smoked together.  And of course they were still high from the X pill.  Well, all the drugs kicked in together at the afterparty after Ron had a drink.  It felt as if his mind was separated from his body.  Trey and he could not stop laughing.  They even took the attention away from the strippers that were at the party.  All eyes were on them.  All they could do was say 'I am so high' and laugh. </p><p>Ron turned and looked in the mirror and felt like he was the person in the mirror.  His spirit had left his body and entered the body in the mirror.  But it wasn't so sweet, because the image seemed to be coming towards Ron.  He thought it was the end of his life, because the mirror's image was smiling the whole time.  Ron felt that he had to get out of there, then he had a semi-panic attack.  He ran down the stairs, only to be greeted by the police who had been called because of the noise.  Well the police caused the whole trio to have panic attacks, and they darted out of the place within three seconds.  As they reached the car they thought about how stupid they must have looked running out and looking suspicious.</p><p>Ron was having a special time in the car.  He began to rub on himself until Trey and D.C. reminded him that he was not in the privacy of his own home. Then a sensation filled Ron, and it felt like his brain was jerking in his head trying to run away from him.  He was tweeking seriously.  Then when the trio got back to the hotel, Ron immediately laid on the floor.  However, he became the floor.  He felt as if he were the carpet in the floor, and knew what the floor must feel like.  His body melted into the carpet, and a sense of paralysis set in.  He could not move whatsoever.  Then his body flew up to the ceiling fan and started rotating.</p><p>That was all she wrote, until D.C. came in with another X pill.  Needless to say the trio were deprived of sleep for the night. And the whole weekend.  However, the next day Ron could not stop going into these oblique trances.  He felt as if he was a ghost and that no one could see him.  This caused his to stare at everything.  The only thing was that he could not concentrate on the subject.  He would be looking at something or someone, and totally forget that he was staring at them.  However, he had no idea what he was thinking when he was staring.  It was as if this were a dream.  His only words for that day were 'I am so high.'  Three days have passed and Ron still has spasms of highness.</p>",
 "year": "2004",
 "id": "30180",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-11T08:00:00.000Z",
 "views": "2871",
 "dose": {}
}
