{
 "title": "Bliss, Minus the Weed",
 "author": "Odd",
 "citation": " Odd. \"Bliss, Minus the Weed: experience with MDMA & Cannabis (ID 30223)\". Erowid.org. Nov 11, 2007. erowid.org/exp/30223",
 "substance": "MDMA & Cannabis",
 "bodyweight": "105 lb",
 "report": [
  "<p>My boyfriend (I'll call him A) told me one of his friends had a good contact for E, so since we were both feeling a bit adventurous, we decided to fork out $20 for a dose and split it.  Neither of us had ever tried it before, and neither of us are very big, so we figured we'd be safe just trying half doses.  We were both too chicken to try mixing the contents of a capsule with something and taking it that way, so we took a vitamin capsule and emptied the contents out of it and replaced it with half of the E.  We downed it and waited.  In the meantime, A's friend G came over to hang out.  We told him what was going on and he thought it'd be interesting to see how it goes.  To pass the time he played the DJ, downloading music and keeping up a playlist.  An hour and a half went by, yet nothing happened.  Eventually A and G got bored and went out to the backyard to smoke, something I can't stand. ",
  "A minute or so after they left, I was laying on the bed listening to music and staring at the ceiling fan.  Suddenly the ceiling fan looked strangely interesting.  It was such a faint difference that I couldn't really put my finger on why it was so interesting.  Then I started singing along to the music.  For the past couple of years I'd been really tired of the Chili Peppers, and anyone who knows me would think my singing to their music would be very odd.  When I realized that the music sounded downright awesome to me, I knew something was up.  I jumped up off of the bed, and it felt so good to move.  I dashed to the bathroom and looked into the mirror - it had finally kicked in.  My pupils were huge!",
  "I ran out to the backyard to tell the guys the good news, along with a great deal of jumping.  It hadn't yet kicked in for A, but now that hope was restored I think he felt a lot better.  Noticing the cigarette in his hand, I gave him a big grin and proceeded to chase him around the yard and wrestle it out of his grasp.  I felt the uncontrollable urge to kiss him all over after I got that stinking thing away from him.  I felt so hyper!  I looked over at A's dog running around the yard and came to the conclusion that she's permanently on E, because I felt exactly like her - energetic and beyond happy.  After talking a bit, we went back inside to A's room and listened to some more music. ",
  "We laid on the bed while G continued finding more good music to play.  A was touching my skin, and it felt so unbelievably good.  I closed my eyes in a state of pure bliss.  He started moving his hand up my shirt and surprisingly, I didn't care that G was there sitting right next to us.  I would've done anything with A right then and there and not cared one bit about G.  Seeing this he promptly stopped before he got carried away, so as not to give G a show.  Around this point I think A started to feel it as well, about two hours into it. ",
  "A little while later we smoked a bowl and decided to go to the playground for a little bit.  Walking suddenly felt so strange.  Gone was the hyper feeling and the happiness; I felt extremely frustrated instead.  I wanted to move, but I felt like I was stuck in slow motion. When we finally got to the playground the guys went for the swing set, but I felt too scared to try anything.  My frustration had escalated to paranoia.  I thought I'd flip out if I moved very fast, so I just stood and watched A and G.  They tried to get me to join them, but all I could to was vigorously shake my head no.  I really wanted to go back.  By this time it was about 5:00 in the morning and the sun was just coming up.  I heard an alarm clock going off in one of the surrounding houses, and it sounded so damn loud.  Whoever it was wasn't planning on turning it off either, and that was really irritating me to no end.  G decided it was time for him to go home, and I was more than happy to go back to A's. ",
  "When the weed wore off, I started feeling a lot better.  I will never mix weed and ecstasy again.  A and I had the most awesome sex about four times throughout the rest of our experience.  I was surprised because I'd heard that it was hard for a guy to get an erection while on E, but he had no problems at all.  Maybe it was the low dose?  Laying in bed talking to him afterward, I realized that the intense happiness I was feeling was all in my head, and that I could make myself feel this all along if I tried.  It felt like it was just opening a door in my mind, that all I needed to do was be able to turn the knob myself if I could find the key.  The effects faded away after about five hours total, but both of us still felt really happy afterward for quite some time.  Sex was still awesome, because the memory of what it felt like before was so fresh that we could almost relive it.  Neither of us felt depressed at all afterward, which was good because A's got pretty bad depression as it is.",
  "I would most definitely try E again, but not for a while.  I'm afraid of liking it way too much, and the last thing I want to do is get addicted to anything.  I'm not sure if I'd want to try a whole pill next time, I'm afraid of overdoing it and getting a bad reaction.  Besides, half did the trick just fine, and it's cheaper too.</p>"
 ],
 "year": "2003",
 "id": "30223",
 "gender": "Female",
 "views": "6779",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 capsls",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": " T+ 2:30",
   "amount": "0.3333 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2007-11-11T08:00:00.000Z"
}
