{
 "title": "A Nice Relaxing Buzz",
 "author": "Istari",
 "citation": " Istari. \"A Nice Relaxing Buzz: experience with Damiana (ID 30269)\". Erowid.org. Apr 21, 2006. erowid.org/exp/30269",
 "substance": "Damiana",
 "bodyweight": "160 lb",
 "report": "<p>I went to a local health food store and found a large jar containing lots of the stuff.. It was 16.99/pound, and so I grabbed a bag and proceeded to fill it up.  I ended up with what looked like around half an ounce - quite a bit.  Anyways, it ended up costing fifty cents.. so far I'm loving it just for the price. Also, the stuff seemed pretty fresh. I don't know if thats been part of the problem for other people who have tried it and havent felt anything.</p><p>The stuff looks *quite* a bit like weed, only its all broken up - like the shake at the bottom of a bag of weed, and its also got a few long stems. I tried chewing on a little bit of it and it tasted pretty flowerish and sweet.  There is no real distinct smell to it.</p><p>Anyways, I got home and packed a very large bowl in a handpipe and proceeded to smoke it. The smoke was very harsh and it was hard to hold it in my lungs for very long, but I managed to get through the bowl just fine. After even the second hit I could start to feel a heady buzz coming on - VERY much like the onset of a marijuana high.  By the end of the bowl my body was feeling distinctly different.  Its hard to explain - but I just felt relaxed all over - and this was without a doubt caused by the damiana, it was *way* too noticeable to be a placebo effect.</p><p>Most of all, my head was feeling quite buzzed. Not like being high, but very tingly and relaxed. I sat down at my computer and listened to some music, and it definitly sounded better than it typically does, very enjoyable and smooth. </p><p>I then proceeded to go downstairs to make a cup of tea with the stuff - I mixed some chamonmile in with a little over a teaspoon of damiana.  The tea tasted pretty good, and I drank it pretty quickly.  I could feel the effects intensify as I got towards the end of the tea. Just to be clear though - the effects of this drug were definitly noticed, and it felt good, but it was nowhere close to being high at all, rather just a very mild head buzz that was enjoyable.</p><p>After downing the tea I went downstairs and chatted with my mom for a bit.  I had no problems whatsoever interacting with her and I felt fine the whole time.  I also noticed after looking in a mirror that my eyes looked normal - no redness or anything.</p><p>All in all, it was an enjoyable experience and I plan on giving it a try again sometime soon.  I was a bit dismayed to notice that pretty much all of the noticeable effects of the drug were gone whenever I would start moving around or walking.. they were only felt when I was sitting in one place not doing any significant movement. But if I decide to get into smoking this stuff on a semi frequent basis, I'm definitly going to need a water bong - the smoke is too harsh otherwise.</p>",
 "year": "2004",
 "id": "30269",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-21T07:00:00.000Z",
 "views": "19338",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Damiana",
   "form": "(tea)"
  }
 }
}
