{
 "title": "Utility",
 "author": "Magdalena",
 "citation": " Magdalena. \"Utility: experience with Amphetamines (Adderall) (ID 30261)\". Erowid.org. Nov 11, 2007. erowid.org/exp/30261",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Amphetamines",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2003",
   "30261",
   "Female",
   "",
   "Not Given",
   "Nov 11, 2007",
   "4835",
   " "
  ]
 ],
 "report": "<p>Although I do not have ADD/ADHD (at least to my knowledge), I have experimented with adderall.  I have both blown it and ingested it orally; however, I have not really participated in such activities for recreational purposes, but rather, I have used it as a utility to keep me awake and focused.  Being the procrastinator I am, I became interested in the substance, last year around finals (or midterms, I can't remember) to keep me awake to study.  The whole idea made me nervous, and I didn't end up using it to study in fear that it would backfire and the side effects would be so terrible, preventing me from studying, that I would screw myself over more.</p><p>I decided that a trial dosage was necessary, so I tried sniffing it, which was a recommendation from the person whom gave it to me, over the weekend. I did this a few times, but only once did I really sniff enough to get any effect (sorry I don't recall how many mg)-- the fleeting effects, which lasted only about 5-10 mins, were a very intense simulation, almost too intense (not to mention too short) to assist me in my studying, but not to say it wasn't pleasurable for it most certainly was.</p><p>It wasn't until yesterday that I had really given Adderall a thought again.  I really really screwed myself over with midterms this time.  Today was my AP US History exam.  Just to give you an idea of how screwed I was, our exam covered Pre-Columbus North America through, and up to the late 50s when Eisenhower was in presidency.  This whole year (half the year) I have not taken the class seriously at all.  I did most of what I had to do, 'reading' (looking at letters and mindlessly copying them down with no absorption) almost 1000 pages in our crappy text book, not to mention the other two primary document texts we have been using, sitting through class every day first block mentally asleep.  Despite how much I knew I didn't know, I waited until the night before to start studying (which isn't out of the ordinary for me).  But I had a lot to learn yesterday--more than was humanly possible.</p><p>Well I got the Adderall yesterday morning.  I wasn't sure if I should take it to study or to focus during the test.  A bunch of shit came up and I didn't start studying until 10:30 when I fell asleep about 10 mins later (a terrible terrible restless sleep where I woke up like every hour or so).  I decided to wake up early to study.  After hitting the snooze a few times, I woke up and, realizing how screwed I was, I took the pill without thinking (well maybe for a second).  It was like 5:20ish and about an hour later I started feeling the effects.  I was able to focus and cover basically everything I needed to, though briefly.  I noticed it was excellent at keeping me on task, but it also made me pretty anxious, but probably not more so than I would have been if I downed 3 cups of coffee on the day of a huge test that I was super ill prepared for.  When I noticed people were finishing before me I became more anxious than usual, but besides that, it helped me focus on reading the questions so I only had to do it once, when normally I have to reread them about 3 times to understand what the hell they are asking.  </p><p>So the exam ended about an hour and a half to two hours ago and the effects are still strong.  My whole body just feels really light and clean.  Like breathing in fresh cool air, or that wonderful feeling I get after sneezing, or in the summer when I wake up well rested with the sun shinning and a cool breeze blowing and I stretch but remain recumbent in bed for a while knowing that I don't have any obligations that day.  My heart isn't beating faster than usual.  I just feel wonderfully relaxed and awake, and like accomplishing everything I have been meaning to do for weeks now.  I came online to see what effects Adderall had on my body physically--for future reference, I guess.  The only negative thing that happened thus far, was that I got a stomach ache/crampish thing when I was driving home from the exam, and it is very possible that it was a mere coincidence.</p>"
}
