{
 "title": "Twilight Dreaming",
 "author": "Zeotti",
 "citation": " Zeotti. \"Twilight Dreaming: experience with Valerian, Vitamin B-6, Tyrosine, St. John's Wort, GABA & Tryptophan (ID 30271)\". Erowid.org. Apr 19, 2006. erowid.org/exp/30271",
 "substance": "Valerian, Vitamin B-6, Tyrosine, St. John's Wort, GABA & Tryptophan",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "900 mg",
  "oral",
  "Valerian",
  "",
  "900 mg",
  "oral",
  "St. John's Wort",
  "",
  "150 mg",
  "oral",
  "Tryptophan",
  "",
  " ",
  "oral",
  "Vitamin B-6",
  "",
  " ",
  "oral",
  "Tyrosine",
  "",
  " ",
  "oral",
  "GABA"
 ],
 "report": "<p>My dreams are extremely surreal, bright, and vivid. Most of the time they are about completely random things, but in every single one there's a goal or I'm determined to follow something. I wake up slightly and look around, I don't know if its part of my dream. This happens in and out in between my many dreams.</p><p>Almost like I'm semi-conscious, then I go back to sleep. I have a presence that I'm asleep, and my body knows that I'm dreaming but my mind is deeply involved in the dreams. Whenever I wake up in the middle of the night during that time and actually stay conscious, I realize its a dream and my stresses are completely gone. Then I go back to sleep.</p><p>It's almost as if my dreams present me with scenarios that are bright but something goes wrong, but I have two lives to worry about. My present one, and my in-dream scenario. Then when I wake up I forget about the in-dream scenario and realize that my present life isn't stressful at all and it's easy to handle.</p><p>These dreams are therapudic for me because it makes it seem like the dreams are things that are real things, but when I escape them I get a huge sigh of relief.</p>",
 "year": "2003",
 "id": "30271",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-19T07:00:00.000Z",
 "views": "24027",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "900 mg",
   "administration": "oral",
   "substance": "Valerian"
  },
  "1": {
   "time": "",
   "amount": "900 mg",
   "administration": "oral",
   "substance": "St. John's Wort"
  },
  "2": {
   "time": "",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Tryptophan"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Vitamin B-6"
  },
  "4": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Tyrosine"
  },
  "5": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "GABA"
  }
 }
}
