{
 "id": 3034,
 "title": "The Earth Below",
 "date": {
  "submission": "2000-06-20T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Anonymous",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "'Having read _Fear and Loathing in Las Vegas_ numerous times, and given that I was planning a trip to Vegas to meet some old college buddies for a weekend, I decided that I'd try a hit before boarding the plane. Having only done this 2 previous times, there was a bit of nervousness. Many thoughts of losing it and running rampant through the plane with drool spilling from my lips were streaming through my mind, but I decided that it would be worth the effort. It was. I'd highly recommend this, especially if you are an experienced intrepid traveller. I had no problems on the plane. Was over whelmed with the flight, the earth below, and the sunset that I got to experience on the flight into LV.",
  "It began with a glorious flight down the Oregon and California coast. The teeny-tiny patterns in the ocean waves were trigger enough for many a visual explosion. Highly intellectual journey as well. I was reading some book on philosophy at the time and was blown away. Landed in San Jose and actually had to have the wits about myself to switch planes. All went well. It was tough at times to keep from breaking out in uncontrollable laughter, but eventually was seated on the window again for the final leg of my journey. The desert and the mountains were just gorgeous from 30,000 feet, and the sunset was indescribable, not to mention the vision of the strip as we circled around to land. The rest of the evening was a really good time, but the flight in was one of the most incredible experiences of my life. I'm damn glad I did it.'"
 ],
 "erowid": {
  "id": "1991",
  "citation": " Anonymous. \"The Earth Below: experience with LSD (ID 1991)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1991",
  "substance": "LSD",
  "views": "3598"
 }
}
