{
 "title": "I Hate Myself",
 "author": "Steph",
 "citation": " Steph. \"I Hate Myself: experience with Morning Glory (Heavenly Blue) & DXM with CPM (ID 30348)\". Erowid.org. Apr 2, 2008. erowid.org/exp/30348",
 "substance": "Morning Glory (Heavenly Blue) & DXM with CPM",
 "bodyweight": "135 lb",
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]</p><p>I had some experience with acid before and had heard of morning glory and wanted to give it a shot. I bought 4 packs of heavenly blue. The brand has no chemicals and I didn't experience any nausea, although my stomach swelled 5 whole inches and was enourmously uncomfortable. I didn't prepare them at all, just chewed them thouroghly. Within an hour I was seeing walls breathing and moving, but I wanted something a little stronger, so I took 3 coricin cold and cough pills, which I have much experience with and is a low dose for me.</p><p>After than, it was an endless nightmare. The hallucinations were primarily mental, seeing myself as everything I hate. I was recounting all the stupid things I've ever done, all the bad mistakes, and if it wasn't one negative thought, it was another. I felt like all the things I had every done, my personality, everything had been to compensate for being ugly, or selfish, or what have you, and there seemed to be no end. I saw the trip as analogous to my present perception of my life, just one downward cycle. I'm not one who is particularly self-loathing, and have reasonably healthy self-esteem, but all the fears I had overcame years ago came flooding back.</p><p>The music was very much in reverb and echo. I began to listen to artists I thought were multi-dimensional and spoke the truth. Soon I began to paint, which eased some of the panic, colors and texture were extremely vivid. But I couldn't escape the thoughts I had had earlier, and then my belief in myself as an artist began to dwindle.</p><p>Eventually, I woke up and realized I had been missing an hour of time. The last thing I remeber was thinking about suicide and how I wanted it to end, but didn't want to hurt my love ones. When I came to, I saw my hand had been cut pretty deeply and there was blood all over my bed. I have no idea how this happened.</p><p>I really underestimated the power of MG, and don't think I had prepared myself enough. Definately an intense trip.</p>",
 "year": "2004",
 "id": "30348",
 "gender": "Not Specified",
 "timestamp": "2008-04-02T07:00:00.000Z",
 "views": "18160",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "7.2 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "90 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 }
}
