{
 "title": "Virtual Enlightenment",
 "author": "Raven",
 "citation": " Raven. \"Virtual Enlightenment: experience with 2C-I (ID 30376)\". Erowid.org. Jan 26, 2004. erowid.org/exp/30376",
 "substance": "2C-I",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "16 mg",
  "oral",
  "2C-I",
  "(powder / crystals)"
 ],
 "report": "<p>Sunday evenings are a funny time. Monday's on your back. Weekends all but over. So i decided more or less spontaneously to dose myself with my current obsession. 2c-i.</p><p>Previous trips haven't rivalled my 'so-high-i-went-blind' LSD trips or my meeting of 'the other' in a bemushroomed state. They have been full of eye candy and sensation but no food for thought seemed to be there. Until tonight.</p><p>+1 hr.</p><p>I'm a very spiritually centered person in that i meditate daily if i can, i read almost constantly about various forms of communicating with the divine (kabbalah, vipassana, shamanism) but this trip was only intended as a psychedelic sunday sojourn. So me and my flatmate got out a video and relaxed.</p><p>+2hrs.</p><p>The film was some Tom Green crap and it reeled off in the background as my mind began to go back, and back and back. Reality seemed both incredibly clear and very much distant. From this witness-mind i began having incredible insight into what it feels like to be super conscious. My ego began to gently dissolve without paranoia as 2c-i allowed me to tune to the truth of our predicament as human beings. Our optimum state, it occurred to me, is one of absolute love guided by truth. This state can be attained via meditation or momentarily reflected through certain chemicals.</p><p>+3hrs.</p><p>It seemed important not to take my ego along for this ride, and only my knowledge of buddhism/vedas/kabbalah recommended this action to me. I could imagine a big ego trip happening at this point but i kept in tune with what my intuitive heart knew to be truth, remaining highly aware. The Tom Green Film was over and i was tripping my arse off. I returned to my bedroom and began meditating.</p><p>+4.1/2hrs.</p><p>Sitting in the full lotus i focused on my breath flowing in and out my nostrils. The one pointedness of thought allowed me to travel far out on a plane of informative consciousness, filling me with understandings barely effable in common language. Beauty filled me and i realised one must not destroy ones ego because thats our vehicle for communication, our space suit, as Ram Dass says. But we must not become lost in our egos either, something i'm often guilty of. I found 2c-i 's teaching method gentle, elegant and easy to understand.</p><p>+5-6 hrs.</p><p>it was already late. My body was tired and my consciousness still and actuely aware. I read some fascinating info on bluelight about thought and awareness and how the enlightened state can be experienced for a time with the aid of certain chems/plants. I read how the feeling of ego dissolution gives way to a unity with it all, giving rise to ecstasy and beauty.</p><p>I managed to let my body and mind sleep and woke tired but alive the next day. My consciousness had been boosted. Truth seemed brighter and my spiritual path more illuminated.</p><p>thank you 2c-i</p><p>Peace</p><p>X</p>",
 "year": "2003",
 "id": "30376",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-01-26T08:00:00.000Z",
 "views": "12257",
 "dose": {}
}
