{
 "id": 3038,
 "title": "Rite of Passage",
 "date": {
  "submission": "2000-06-20T07:00:00.000Z",
  "experience": "1994-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "John Q Public"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "I was 18, and I had been backpacking through Asia with my father, who had hidden two hits of blotter inside his camera. He was planning on finding a place to give me the LSD as sort of a 'rite-of-passage.' He himself had recently had a very minor cocaine related 'heart-episode' and was reluctant to take any chances with the LSD this time around.",
  "So, about 2 months into our travels, we found ourselves on a houseboat on Lake Dal in Srinigar, the capital of Kashmir. Talk about paradise! Thousands of beautiful wooden houseboats, canoe-like boats called 'shikaras' that paddled from houseboat to houseboat selling food, hashish, trinkets etc.... No motor are allowed on Lake Dal, so it was quiet except for the sound of eagles screeching, kids playing and the 'Call to Prayer' wafting periodically through the air. Indian tea served in the morning and the afternoon... Truly paradise.",
  "We're sitting on our houseboat, and a shikara comes up carrying a middle-aged couple. The male was standing up in the boat singing an Irish drinking song. A real personality. He was a total blue-collar, pub-scrapping Irishman who worked for many years as a welder, but discovered that he was a mathematical genius, put himself through school, and now is a professor at a prestigious university in England - all the while remaining course, vulgar, happy, and drunk on whiskey. In any event, they shared our boat with us and we became good friends.",
  "We traveled together, the four of us, to Ladakh, the Tibetan region of India, high in the Himalayas. We stayed in a village called Leh which was as Tibetan a village as you could find.",
  "(and before I get flamed for being a stupid tourist, please understand that this was a number of years ago... ok - I'll accept the criticism of being a stupid tourist)",
  "At some point, Dad & I decided that this was the place where I should be initiated into the world of psychedelics. I started by taking a quarter of a hit. When John (the Irishman) got wind of this, he expressed interest, and the second hit was given to him. After about 30 minutes, I felt nothing, so I took another quarter. Another 30 minutes passed, another quarter. I ended up taking all four quarters = a full hit.",
  "Still nothing had happened. My father and I climbed up the mountain to a cemetary above the village. They call the landscape in this part of Tibet a 'moonscape,' and truly, aside from the whitewashed Buddhist Stupas that aparently marked graves, it looked as beautiful and desolate as photographs of the surface of the moon.",
  "The village was below us, a maze of adobe-like buildings and narrow winding streets. All of a sudden, something began to change within my body. I was feeling a bit of a change. At that moment, the Call to Prayer for the villages few moslems began, amplified by a cheap speaker mounted on one of the village mosque's minarets. I stood up and a giant grin came over my face. I was tripping.",
  "Dad and I walked the winding path down the mountain back into the village, with me giggling and describing the sensations I was feeling along the way. We ran into John who was sitting outside of our rooms looking at flowers.",
  "So there we were - two first time trippers, tripping our balls off in this village, with shit-eating grins on our faces, smoking bidis like fiends and generally making fools of ourselves.",
  "I have rarely had acid since that has been as powerful as this was. Both of us experienced tremendous distortions in time. I remember lighting a cigarette and tripping for an eternity on the surrounding countryside, returning to my cigarette only to discover that less than a millimeter had been burned.",
  "The Tibetans knew something was up, and there was a constant parade of beautiful teenage Tibetan girls coming around to flirt with us and watch us. We were in a garden-area, and there was a really old guy who seemed to live in the garden. He'd kneel in the garden and pray for hours on end, spinning his prayer wheel. I can still remember really tripping on the sound of his wheel spinning around and around.",
  "At some point we ran out of cigarettes and had to make the excursion into the village to buy more. Imagine two tripping fools cruising into the Tibetan equivalent of a 7-11 laughing uncontrollably and trying to buy cigarettes.",
  "The streets were muddy, and as we waled to and from the store, we passed dozens of strange and exciting people - people leading water buffalo, Tibetan monks, naked kids, Kashmiri traders and carpet salesmen, etc.... It was like a circus and it was (naturally) enhanced by the drug.",
  "My father had told me that one thing he really enjoyed when doing LSD was looking at himself in the mirror and watching the flesh on his face melt off.",
  "Sure enough, when I tried, I got the same results. I haven't been able to reproduce it since. I thought it was hilarious.",
  "Anyway, as often is the case with LSD, after 10 hours or so, it got a little tiring. I started coming down and John started getting a little weird. I remember him running down the road saying 'The cloud is a fucking fish,' or something like that, then laying down in a field of rubble and laughing and laughing...",
  "It hasn't been as good as that since. It sure was a great place to learn about the power and beauty of LSD."
 ],
 "erowid": {
  "id": "1992",
  "citation": " John Q Public. \"Rite of Passage: experience with LSD (ID 1992)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1992",
  "substance": "LSD",
  "views": "6440"
 }
}
