{
 "id": 3041,
 "title": "A Pre-Trip Trip",
 "date": {
  "submission": "2002-12-26T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DevilDoc",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "capsule"
  }
 ],
 "report": [
  "Tomorrow is going to be my first vacation in years, and I finished packing a little early so why not indulge a tad, right? I put 30mg of 2C-T-2 in a gelcap, and swallowed the cap at noon. I havent had much luck with this substance in the past  although, each time Ive tried it was from the same 1g I recently acquired from a lab out of the country. I have purchased other chemicals from them before, and have always been very happy with the quality of their products.",
  "T+ :60  - First signs - I get the familiar slight tingling in the back of my head, not completely unlike the feeling I get from DXM at first. This feeling quickly passes, though, and I just get cold (as is usual for me on this substance).",
  "T+ 2:00 - Start noticing slight trails, but conversation is completely normal. I really dont notice anything at this point other than still being cold.",
  "T+ 3:10 - Now things are getting interesting. I just felt a little rush, which always reminds me of tryptamine rush, but not as intense. With tryptamines I know that there is more to come and it sometimes freaks me out. But with this substance I feel OK  like it just wants to let me know its there, but nothing else.",
  "T+ 3:33  White walls have color to them, and this screen seems to be shimmering in a spectacular way. Thought process doesnt seem affected, but I can feel a definite change of consciousness. Concentration is a little skewed, and Im having difficulty focusing on my typing.",
  "T+ 5:00  Spent the last hour and change listening to music and watching TV. Music isnt really enhanced, and I dont feel especially drawn into drama on TV. The color shifting and image trails are nice, though. All thats really noteworthy is the off kilter feeling; that feeling of not knowing what is different, but knowing I'm definitely not straight. Having those usual paranoid thoughts of what ifs  what if I never come out of it how would I go through life like this. Not nearly as pronounced as oral 5-meo-DMT experience (with Syrian Rue), but still there.",
  "T+ 6:30  Coming down completely  it happens pretty quickly for me on this stuff. The trails are stopping, colors arent shimmering, and the mental effects are disappearing.",
  "T+ 7:30  Down almost completely. Some residual visual changes, but other than that I am almost back to baseline.",
  "T+ 8:00  Back to baseline, more or less. I do feel a little spacey, but just a tad  this feeling usually lingers for a while after dosing with 2c-t-2 for me. A headache is moving in, as usual. They usually last half a day after for me.",
  "Summary:",
  "Another successful 2c-t-2 trip, but the highest dosage Ive tried yet. The shift in consciousness was more pronounced, and was accompanied by a little confusion and scatter mindedness at this dosage. 2c-t-2 is not my favorite chemical  its effects dont impress me much, dont leave me in a productive state of mind, and it leaves me with a pretty bad headache. As always I am reminded how great weed is, and that I think Ill stick to it for a while to come. After my vacation its back to my dealer :-)",
  "Safe travels, all."
 ],
 "erowid": {
  "id": "19928",
  "citation": " DevilDoc. \"A Pre-Trip Trip: experience with 2C-T-2 (ID 19928)\". Erowid.org. Dec 26, 2002. erowid.org/exp/19928",
  "substance": "2C-T-2",
  "views": "12928"
 }
}
