{
 "title": "Mellow but Passionate",
 "author": "Watcher",
 "citation": " Watcher. \"Mellow but Passionate: experience with Tramadol, Cannabis, Alcohol & Caffeine (ID 30442)\". Erowid.org. Jun 18, 2007. erowid.org/exp/30442",
 "substance": "Tramadol, Cannabis, Alcohol & Caffeine",
 "bodyweight": "190 lb",
 "report": "<p>2pm  T:00  -- I'm 190'lbs. Had eaten lunch about 1 hour ago. Took 200mg Tramadol in four 50mg tablets.</p><p>T:00:40 -- Perhaps feel the very edge of it, little bit of a light ''uplifting'' feeling, going to go outside shovel some snow - see if exercise kicks it in.</p><p>T:01:00 -- Definately feeling a slight euphoria, just one hour in on a full stomach, this is a good sign! I don't feel dazed or cognatively challenged at all, just a little bit of pleasant euphoria.</p><p>T:01:05 -- Only five minutes after last entry - noticing euphoric feelings building very quickly now. Very thirsty too, am going to drink some OJ.</p><p>T:01:30 -- One and a half hours in, I feel good. But I'm in the mood to feel a bit better. Am going to have a few puff's of Cannabis.</p><p>T:01:45 -- Cannabis in, feel that as its own distinct and nice self. Feel undercurrent of Tramadol under it, am going to play some music and go with this relaxation a bit.</p><p>T:01:52 -- Almost two hours in -- I can tell looking at this time stamp, that my sense of time is definately altered. I would have guessed its been 20 minutes or so since the last entry - not 7!   Piano playing was fun, finger dexterity seems undeminished, creativity fine, perhaps tending a bit towards overdramatic.  I think I could drive safely right now, but I'm not stupid enough to try it! But over all dexterity and cognition seems good. Not sure about reaction time, I'll play some Unreal Tournament real quick and see.</p><p>T:03:00 --  3 hours in now. Unreal Tournament went pretty well - definately not top not reaction time - but decent. Then phone rang: had nearly hour long conversation with my wife on the phone, very good conversation. She normally can tell immediately if I've had any substances. This was a relaxed and positive talk, very loving for both of us and good for our relationship!  I'm a bit dehydrated - and definately my thoughts can wander quickly, though the thought straying I believe is mostly from the cannabis - not the Tramadol, the Tramadol seems to be doing the dehydration, but also a general muscle/body relaxed feel - and slight underlying euphoria.  I'm noticing that since the pot and pharms set it -- my reports here are getting much wordier, as you can tell!</p><p>T:3:15 -- Still feeling good, home alone tonight and would love to feel even better - so I'm having a Vodka Sweet & Sour right now. Drinking it slowly, will see what happens.</p><p>T:3:50 -- The alcohol has perhaps mellowed it all a bit, no huge change though. I feel very relaxed and happy. Made myself a very nice dinner, and enjoyed it very much - definately sensory appreciation is excellent with this combination. Am curious about sexual effects, perhaps will try in a bit.</p><p>T:4:05 -- Just wrote a love letter to my wife, this is a good combination for expressing love/passion.</p><p>T:4:37 -- Was feeling a bit tired, and its just 6:37 at night, and I want to enjoy this mellowness some more. So I'm adding one more drug to the mix - caffeine.  One big strong cup of coffee.</p><p>T:4:55 -- Coffee kicked in fast, feeling much more awake - a bit edgy, but not upleasantly so.  I'm not sure I have the ability to get sexually aroused right now, and I'm not interested enough to even try! Perhaps I'll try later.</p><p>T:5:20 -- I'm in a nice mellow place, energetic, alert, mentally on the ball - and a bit euphoric. Of course at this point its tough to sort out what is being caused by what - since I'm under the influence of 4 drugs: Tramadol, Cannabis, Alcohol and Caffeine! Am feeling a bit of itching on my body, I imagine from the Tramadol -- but, it is very pleasurable to itch each one!</p><p>T:6:00 -- In spite of caffeine, feeling tired. Still good and relaxed, but very droopy eyelids.</p><p>T:6:10 -- Seems like it was a blood sugar low, I had some sweets - and I'm feeling much more alert now.</p><p>T:6:30 -- Going to have another drink, and then maybe another bowl. So I think any objective evidence about the Tramadol is pretty much a wash at this point. Its been 6.5 hours now since injestion anyways, and I don't really feeling the underlying euphoric effects that it was giving me.  All in all though, it was a pleasent experience. Doesn't feel healthy enough to be something one would want to do regularly - but was worth it for a quick experience!</p>",
 "year": "2004",
 "id": "30442",
 "gender": "Male",
 "timestamp": "2007-06-18T07:00:00.000Z",
 "views": "13722",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:30",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 3:15",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": " T+ 4:37",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  }
 ]
}
