{
 "title": "Transformation",
 "author": "Symes",
 "citation": " Symes. \"Transformation: experience with Hashish (ID 3047)\". Erowid.org. Oct 20, 2000. erowid.org/exp/3047",
 "substance": "Hashish",
 "bodyweight": "170 lb",
 "report": "<p>I was sitting on the floor of my friend Debra's room one evening, when a friend of hers came round to see her.  They hadnt seen each other for ages and just sat there chatting and catching up, and basically just ignored me.  Id never met Suzy before, and I started to listen to some of what was said.  As I did so, something began to happen.</p><p>While Suzy was talking to Debra about some traumatic experience shed just been through, I felt myself connecting with her in a way Id never experienced before.  I realised that I knew exactly what she was talking about.  It wasnt that I could read her mind, it felt more like I was her mind!  The words she was using to describe her experiences were also describing my experiences too.  Her observation of life and her attitude were somehow also me.  It took me a while to get used to this bizarre perception, but the moment I started feeling comfortable with it, it changed into something else.  I began communicating with her using only my mind; it happened completely spontaneously, but it was totally unlike any form of mental communication Id ever heard about.  As I asked her things, the words she was using to reply to Debras questions, which were of course totally different, would somehow answer my questions too!  It felt really weird, yet at the same time perfectly normal.</p><p>Suzy left a few hours later; Debra saw her to the door.  The moment she left the room, things started to change again.  I could feel it coming and it seemed to wait for Debra to return.</p><p>The moment Debra came back in, I entered into this incredible state of ecstasy.  It felt like something was descending into me, allowing me to experience the world from a perspective that was totally different, it was almost indescribable.  I felt as if something very old was either trying to come in from the outside, or was pushing out of me from the inside.  Whatever it was, I felt like I was becoming something else, something far more real than I could possibly imagine.  The feeling of knowing that this was what was happening was so wonderful that tears just poured down my cheeks.</p><p>I went through a number of physical reactions:  My mouth tightened into a closed O shape, and my hands came up to just below my chin, tingling as if with pins and needles.  The area around my solar plexus felt like it was pulsating with energy.  The experience lasted about ten or fifteen minutes.  Debra just sat on the bed watching this the whole time.  She told me afterwards that my face actually changed and I took on an 'old man' appearance.</p>",
 "year": "1992",
 "id": "3047",
 "gender": "Male",
 "timestamp": "2000-10-20T07:00:00.000Z",
 "views": "9756",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis - Hash"
  }
 ]
}
