{
 "title": "Opiate High with Stimulation",
 "author": "Nortyy",
 "citation": " Nortyy. \"Opiate High with Stimulation: experience with Hydrocodone & Methylphenidate (ID 30486)\". Erowid.org. Jul 20, 2006. erowid.org/exp/30486",
 "substance": "Hydrocodone & Methylphenidate",
 "bodyweight": "184 lb",
 "report": "<p>Today at school (Friday) I acquired 7 5/500mg pills of hydrocodone and 2 54mg Concerta pills for a bowl of cannabis ($5 worth of pot). So I drove home and put my baggy of pills under my dresser and decided to wait until later tonight to take them.</p><p>In preparation I cut the Concerta pills in half so they do not time release and threw away the green sponge part of the pill which contains no Methylphenidate.  I broke all 7 Hydrocodone pills in half to increase the rate of absorption.  My last meal was 2 hours prior and consisted of french fries and a burger from McDonalds.</p><p>8:00PM: Dose of 35mg of Hydrocodone taken all in course of 1 minute.</p><p>8:05: Nothing yet</p><p>8:10: I think I'm beginning to feel the very minor effects of the opiate buzz. Feeling little more relaxed and just not on baseline.</p><p>8:15: Nothing more then before.</p><p>8:20: Warming in ears arms and middle part of body, I think the buzz is starting to kick in.</p><p>8:27: the Opiate buzz is definitely kicking in I'm feeling much warmer and euphoric. I'm feeling much happier just because the buzz is kicking in.</p><p>8:35: The opiate buzz is really kicking in, I feel incredibly warm, High euphoria, extreme relaxation, and very happy.  I do feel kind of disconnected from the world which really is very relieving after a week of hard work.</p><p>8:41:  I turned on some music, this is highly recommended by me when on opiates.  I feel floaty and warm, I feel extreme euphoria, complete peace.</p><p>8:55: 108Mg of methylphenidate was taken. The hydrocodone buzz is pretty intense, my prediction is that the Ritalin will add to the euphoria and keep me awake for the full time of the high. I love talking with people. I feel like every conversation I have is deep and meaningful. I also think the Ritalin will increase me thoughts and mental awareness which will go good with the hydrocodone.</p><p>9:18:  I think the Ritalin is kicking in I feel speediness, increased in number of thoughts, and the tiredness is going away. I do feel much more relaxed, my euphoria is extreme, which feels great!  I am starting to get that pleasant opiate itch. My appetite is completely gone as my need for sleep is depleted also. My happiness has reached a maximum. I had a hard week of schooling and felt worn out. This is so rewarding and a huge stress reliever, I'd say I like this better then cannabis.</p><p>9:37: Both drugs are at their peak. This is great, this combination is one of the best I have experienced.</p><p>10:00: I feel the Hydrocodone just starting to come down but the Ritalin is still at peak.  The euphoria is slightly down, I still feel very relaxed, happy, and all around good feeling.</p><p>10:25: Hydrocodone is leveling off but still coming down slowly.  Ritalin is still at same level as before. I feel all the effects as before and same intensity. The opiate itchiness is starting to subside, a sign that the hydrocodone is wearing off.</p><p>10:49: Hydrocodone is going down pretty fast now. The Ritalin is going down also. The good thing is I'm not experiencing any negative comedown effects at all.  I still feel happy, relaxed, and just great because I had a great time and feel very relieved.</p><p>11:15PM: Both drugs are pretty much reduced to small buzzes. Still feel good low euphoria, but it'll disappear soon. I had a great time and look forward to doing this again.</p><p>Summarily, this was a great combination, the best I ever tried. It lasts a decent duration and feels really good. Next time, I'll take the Ritalin or whatever stimulant about a half hour to hour after the opiate kicks in, it seems better then taking both at once.  I was also to act cool in front of my parents and actually had conversations with them. Music is a must. I wouldn't do this drug with lots of people though, it's more of a stay home drug.  I wouldn't do this combination with three or more people it just isn't a party combination.</p>",
 "year": "2004",
 "id": "30486",
 "gender": "Male",
 "timestamp": "2006-07-20T07:00:00.000Z",
 "views": "37042",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:55",
   "amount": "108 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  }
 }
}
