{
 "id": 3049,
 "title": "An Impulsive Trip",
 "date": {
  "submission": "2000-06-20T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "P.S.P.",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "5"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "My next door nieghbor and i do a lot of acid but he was in charter during this time so he came home on pass. i went over to his house and we decided to get some acid. so i was looking all day but couldn't find any so i was gonna go to the store with this one crazy guy who buys me beer and he asked this guy if he had any weed he said no but he had acid. so i met up with him at his apartment complex and got 14 hits of acid. went back to my house and called my friend and he came over so we each ate 5 hits of mad hatter acid.",
  "i started to feel real fucked up really fast so i told my friend to go home and call me in a half an hour, because i felt like i couldn't even talk or move so when he did not call me in 2 hours i went up to his balcony and opened his window i thought i saw two people in there but i was trippin' hard so he jumps out of his window naked and pushed me! and i said what the hell are you doing and he kept on saying he was a pure ball of energy. so i said put some clothes on and lets go to the park, because we had this park in our nieghborhood we liked to trip in. but he didnt and just climbed down his balcony naked and started walking around.",
  "then my other friend showed up to buy the reamaining 4 hits i had. and my friend tried to push him and he socked him but it didnt faze him. so he started walking down a main roud at like 3:30 am and i stayed in front of his house trying to think of what to do when i saw a cop car fly by so i went down to the corner and my friend got mased by a cop and when the cops asked me if i had any lsd tonight i said no and they shined the light in my eyes and still didnt know!!!!!!! but the cops face was just melting but i will never forget that night ......it's stuck in my mind."
 ],
 "erowid": {
  "id": "1995",
  "citation": " P.S.P.. \"An Impulsive Trip: experience with LSD (ID 1995)\". Erowid.org. Jun 20, 2000. erowid.org/exp/1995",
  "substance": "LSD",
  "views": "11191"
 }
}
