{
 "id": 305,
 "title": "Pipe Repair",
 "date": {
  "submission": "2007-06-13T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Billie",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "This is a lesson in bong repair, and a lesson learned the hard way. I share this to prevent similar accidents. A small party bong I owned broke, the slide cracked, my friend thought it might be a good idea to repair it with glue, and unspecific epoxy glue, as we began smoking with the bong that night with a group of about 5 people me being the last to receive it, the bong worked fine, as it got to me a took one big hit and passed, with in seconds I felt nausea and a strong light-headed feeling. I got up and excused myself from the room, the moment I stepped out side, my entire frame of reference began to shake and undulate violently, so much so that I fell over, not able to stand on ground that was moving so much, I thought I should go to my room, but I had to crawl a good 100 feet before I could gain any kind of balance, enough even to stand.",
  "I stumbled to the elevator and by this point my vision and hearing were so altered that, as later told, I could not see or hear my close friend who happened to walk by and say  hello in passing, I simply collapsed into the elevator, when I got to my room, I lay down on the couch, my vision was restored but I had what I will call enhanced sonic perception, I could hear the lights in my room, people talking down the hall, every tiny little noise seemed defining, these maladies eventually subsided, and I was left with  headache the rest of the night.  You see, the glue used to fix the bong had heated up after just 4 people hit it, and I got a large hit of super glue along with the cannabis.  I have experimented  quite a bit with psychedelic drugs, and I cant remember a time when my hearing or vision has been so uncomfortably altered."
 ],
 "erowid": {
  "id": "10444",
  "citation": " Billie. \"Pipe Repair: experience with Inhalants (Glue) (ID 10444)\". Erowid.org. Jun 13, 2007. erowid.org/exp/10444",
  "substance": "Inhalants (Glue)",
  "views": "12851"
 }
}
