{
 "title": "LSD and Love",
 "author": "Aquajo",
 "citation": " Aquajo. \"LSD and Love: experience with LSD, Alcohol, & Cannabis (ID 30505)\". Erowid.org. Feb 19, 2007. erowid.org/exp/30505",
 "substance": "LSD, Alcohol, & Cannabis",
 "bodyweight": "130 lb",
 "report": [
  "<p>I tried acid for my first time a couple of weeks ago on a Friday night before my second semester of classes began.  It was supposed to be my last night of indulgence so I could start this semester fresh and not let my grades slip again because of excessive partying and mostly pot-associated laziness.  One of my best friends and semi drug-mentor, knew I wanted to try it, and always supportive of me, decided to purchase some for himself, my boyfriend and I, and several other people. ",
  "We planned to meet at my friends house around 7 pm but because of an intense and very emotional fight with an ex-boyfriend I decided I wanted the night to get going sooner, and my new boyfriend and I took our first tablets at around 5:30.  However, we both were extremely nervous to because I was just in a very strange place mentally, both so upset at my ex, but unable to really decide if I was over him and ready to really begin something with my new boyfriend.  He knew I was really unsettled and nervous about having a bad trip because of it, and gave me some wonderful advice, since he is to say the least, an experienced drug user.  He said, 'Jo, just remember, acid does not take over your body and mind, it's still you inside, and it's your mind, you control your trip.'  And with that I took my tablet.",
  "For the next hour or so I was filled with anticipation for my trip to begin.  I have done shrooms before and had at least very intersting experiences and was fully ready to know the difference in the two drugs.  So, I looked at some artwork, had some nice conversation with other people about their own LSD uses and experiances, and then it finally hit me.",
  "I felt suddenly drunk, and incredibly happy. I loved life and just wanted to experiance it.  Everyone made me smile.  I sat and took some bong hits with my friend who had gotten the acid for us, while my boyfriend went and got some food.  We always have good conversation but tonite he just really understood me.  He was pretty incoherant though, at least more so than I've ever been used to seeing him, because he had already take three tablets, starting at around 3 in the afternoon. ",
  "Eventually I began talking to some friends of his that stopped by who I didn't really know.  At first I felt incredibly awkward and embarrassed and felt that everything I was saying was weird, and didn't enjoy the convo that much.  However, after I began telling them that I was tripping and embraced my confusion of the world and just went with it, the situation improved immensely.  It's comparable to a drunk who knows they are just so fucked up and not making sence that they just laugh and admit it, and go about the night just reminding everyone they are 'so drunk right now!'",
  "Then I left that room and sat with a girl friend of mine while we watched another experianced tripper dance with glow sticks for us.  We huddled on the couch together in awe by his dancing.  It truly was beautiful.  It really made me aware of the connection between the drug and music industry. When I was on acid and the music stopped, it felt like life ended, music absoluetly engulfed my mind and body.  And it was at this point I remember thinking how all that acid is, is a gateway to another world.  I truly felt as though I had left what I knew and was somewhere else that only few people get to visit.  This was an amazing feeling, yet at times too intense and slightly frightening, only because of how much we seemed hypnotized by the dancing. ",
  "Then my boyfriend returned and we went for a walk in the rain.  It is at this point my trip begins to amaze me.  Every house, tree, puddle, was undescribably enchanting.  We spend maybe an hour outside walking around the block, just talking to each other, holding each other and looking around.  I had such an amazing time joking around, laughing and admiring nature with him that I started to truly fall in love with him.",
  "He no longer was a just a nice, attractive boy had romantic relations with, but turned into my best friend.  I have never had more fun with a single person ever.  It is very hard to describe well enough that it doesn't just sound sappy.  But honestly, I had the best conversations, most amazing fits of laughter, and a constant smile on my face.  Also, my boyfriend is already attractive but mixed with LSD I noticed that anyone who I already do find attractive gets that much more good-looking, so I truly enjoyed looking at him and watching him laugh.",
  "We went to another party but after only staying around 15 minutes just decided to go back to his apartment.  I then sat with his puppy and had another increadible moment in my trip.  I've never felt such an outpour of love. The puppy had never seemed to look at me with such loving eyes. She even seemed to know that I was tripping, and just was so content sitting with me and being cuddled, it was wonderful.  All my boyfriend and I could talk about was how this was the best night we've had.",
  "When we were kissing and cuddling closely our breathing began to form a pattern and we began to feel as though we were connected internally somehow.  We also had been for the entire night finishing eachothers sentences, and this evolved to a point where we didn't even need to talk, it was enough to stare into each others eyes to know what the other wanted to say.  It was perfect.",
  "After several more hours of us just laying together his roomates came home with left over jello shots.  I quickly injested about 8-10 in an attempt to prolong my trip, I honestly never wanted it to end.  I then smoked about 2-3 bong hits, which by the way, I've never taken bigger or more efficient hits than that night, I believe LSD makes me take the BEST hits ever.  Then I stayed up talking and laughing constantly for another hour or so, it was around three am when this little late-night round two began.",
  "After a while I finally retired to bed because I was just physically exhausted and not feeling the best, probably from the alcohol.  This was around 5 am.  I slept soundly until about 8:30 in the morning, woke up to a slightly uncomfortable stomach but then quickly decided to sleep off the small hangover and I then fell asleep till noon.  We then went out to breakfast and I felt fine the rest of the day, only having a slight headache. ",
  "I will never forget my acid trip.  But I do not plan on doing it again anytime too soon because, first of all, I don't want to ever ruin the amazing experiance that I had on it by having a bad trip the second time, and 2nd, it scares me how much I enjoyed it and think it's better if I don't start making that a habbit.",
  "But regardless, I am thrilled I did it, and feel so lucky to have had the experience I did.  I think it makes bonds between those in love, or about to fall in love so much stronger.  It by far was the most intense enjoyment I've ever felt by just being with a person of the opposite sex, and believe that that one night will always be one of the strongest factors in staying with my boyfriend.  That was the epitome of the connection I ultimately want with the person I marry, and having been able to so already makes life seem so much brighter for the future. Because of that experience I feel so much more a part of him; body, mind, and soul.  Acid allowed me to open my mind to letting someone else in and truly experiencing a night of love and euphoria I may never have let myself feel.</p>"
 ],
 "year": "2004",
 "id": "30505",
 "views": "6435",
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "LSD",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "8 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(cookie / food)"
  },
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2007-02-19T08:00:00.000Z"
}
