{
 "title": "Energy",
 "author": "astralproject",
 "citation": " astralproject. \"Energy: experience with 4-Acetoxy-DiPT (ID 30520)\". Erowid.org. Nov 4, 2004. erowid.org/exp/30520",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "125 lb",
 "report": [
  "<p>This would be my first experience with 4-acetoxy-DiPT. I would consider myself very experienced in other hallucinogens (LSD, LSA, 2c-b, mushrooms, MDMA, etc). In preparation for this experiment I fasted quite a bit, only consuming some fruit and cheese around noon. I was hoping that an empty stomach would help ease some of the stomach cramps and gastrointestinal problems that usually accompany these chemicals. My mind set was unusually positive. Probably because I thought I would be enjoying a drug with one  of my best friends soon.",
  "Previously in the morning I had received 2 capsules of around ~35mg in each. It looked like a very small amount of powder compared to the gel cap it was in. I am for sure what I consumed was 4-acetoxy-DiPT, unless the chemical manufacturer really messed up.",
  "At 6:45 my friend R and myself consumed one capsule each. Down the hatch with an entire bottle of water. Some 30minutes pass amd I have yet to feel the first tingles of the drug. Then and hour and a half rolls around, and still I feel no effects. I called my friend, who was experienced with the stuff and said it should have kicked in awhile ago. 'Naw, I dont feel shit', I said.  How ironic.",
  "As soon as I hung up the phone, I was thrown into a very tense, but warm body feeling. I could feel every tendon in my leg. OEV's became extremely intense at this point for me, R was not hallucinating though. COE's produced little effect, which is odd for me. Then the panic hit. Coming up fast on this drug felt like hell, the muscles in my leg and neck felt extremely tense and spasmed slightly, at this point I could hardly see 2 feet in front of me clearly without visuals. Waves of energy would come from the top of my skull all the way down to my legs. Almost like a shiver or a spasm. I then threw up. This stomach problem continued lightly for the next 8 hours. R by this time was hallucinating also, but his come up apparently was not as harsh as mine. The peak of my visual experience was incredible. The room seemed to bend to me, I was energy. I can't believe Im freaking out, so I tried to great success to turn this trip around. The intense visuals and body tingles left after about two hours but stayed slightly for the next 6. The rest of the trip was spent in total bliss listening to music and talking with R.",
  "After the peak, it was a smooth sail to sanity again. Lots of laughs, but not a lot of mental confusion later on like how LSD and mushroom can do to me.",
  "All in all, I honestly think this chemical has little potential for a party setting or any solo ground breaking adventures. Visuals visuals and more visuals, but nothing that blows your mind, no 'grand universe conclusions' that I love about acid and MDMA. It lasted way longer than I expected (~7hours), and could not sleep well that night even with xanax. The body feeling was way too harsh. It was not what I bargained for.</p>"
 ],
 "year": "2004",
 "id": "30520",
 "gender": "Male",
 "views": "10522",
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2004-11-04T08:00:00.000Z"
}
