{
 "id": 3052,
 "title": "Christmas Eve",
 "date": {
  "submission": "2008-01-16T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "C Double",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "17 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "capsule"
  },
  {
   "time": "5:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "8:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "AMT experience 17 mg",
  "I had recently obtained six 8.5 mg capsules of alpha-methyl tryptamine. Unfortunately I lost four of them. With only 17 mg left my first trip on amt was going to be a lonely one. I still needed to try it as I had found a way to obtain more of it.",
  "After doing research I decided that 17 mg was close to the desired dose and that it would be necessary to take the drug early in the day, soon after I had woken up. A couple weeks later a good day came when I had a chance to try it - Christmas Eve.",
  "I had a decent breakfast of mostly fruit an hour or so before I ingested the capsules which were filled with herbal ephedra as well as the amt. I think I felt the ephedra before the amt which was slightly annoying. Shortly after taking the pills my friend arrived at the house to pick me up and I got ready and left. We were going to the mall to do some last minute Christmas shopping.",
  "On the way there I still wasn't feeling anything. I was walking in the mall when I started to notice the amt at roughly 90 minutes after I had taken it. The initial effects seemed to be a sort of exhilaration and a great deal of energy. MY surroundings seemed to go well with that. I did all my shopping at one store that sells a lot of eastern and tribal artwork and statues. I had been afraid of tripping on a new drug at the mall on Christmas eve but it turned out to be pretty exciting. Not to mention all the pretty girls that were walking around the mall.",
  "My friend wanted to find a necklace or chain so we walked around for what seemed like forever looking for one of the cheap vendors that usually you find in the middle of the mall every ten feet but we couldnt seem to find one. When we finally did my friend said the guy's price was too high and he was trying to rip us off. I thought that was pretty",
  "funny.",
  "I've heard amt described as 'acid on speed' or 'mushrooms on speed' and this is actually pretty accurate. I always had about 5 things on my mind that I needed to be doing. But there's also a very pleasant euphoric feeling, and with the dose I had taken, very little body load or negative effects. I was smiling and laughing a lot. I was also smoking a lot of cigarettes which I dont normally do.",
  "We left the mall and by this time I was feeling pretty weird. We went to a mexican place where my friend got the biggest burrito Ive ever seen and I got some chips and guacamole. The man at the register started joking around with me and I got really embarrassed and didnt know what to say. I never get visuals from most psychedelics and didnt really from this one either, beyond seeing tracers and a little distortion here and there. But I could tell that amt is indeed some powerful stuff. I can't imagine how some people take doses of 50 mg or more which seems to be the standard dose on the web.",
  "At my friends' house the next few hours I probably did a lot of wandering around, looking or personal items i had put down five minutes before, a little breakdancing, and looking for some dank which seemed almost necessary at the time especially being Christmas. This took a while to accomplish but I kept myself entertained the whole time quite easily. On this dose of amt I found it easy to do things like break which are hard to do when you're intoxicated on most drugs or alcohol. I also was very interested and entertained by doing mundane tasks like taking out the trash or surfing the web.",
  "Later we went to smoke, about 5-6 hours after taking the amt. At this point the euphoric feelings were starting to fade. But the tripping seemed like it had just begun. Smoking the kb intensified this. I read some scary stories of smoking weed on high doses of amt but with this dose it was a good combo. I was doing a lot of talking and plenty of reflecting on my life. My mind felt pretty clear and I didnt feel very much like it was operating too unusually. I remember most everything I was thinking about that day and it still makes sense, which is usually not the case with LSD, ecstasy, or mushrooms.",
  "As the amt slowly wore off (and I mean slowly), about 8 hours after taking it I took a 10mg lortab or vicodin which I had brought with me hoping it would bring me down at the end of the trip. This turned out to be a mistake and maybe an hour later I felt very",
  "nauseous for a short time, maybe 10 minutes. It faded away fast but after that, the pain killers effects were negligible, totally overpowered by the amt. Looking back I wouldnt suggest that anyone combine those drugs though I would still want to try ending",
  "an amt trip with a benzodiazepine such as valium.",
  "I returned home at +11, about 11 pm. I still felt a little buzz which was fine as I dont ever go to bed that early and I read articles and a book until maybe 2 am, when I fell asleep waiting on santa claus and his reindeer who had not showed up yet.",
  "In conclusion, I was fascinated by amt and intend to get more of it and try it again. I'll try a larger dose in the correct setting but wouldnt suggest anyone try more than 30 mg, and probably not that much the first time. It's a useful drug, and will be around for a while and probably will eventually be scheduled, so now is the time to experience it.",
  "I can also see a lot of potential problems and trips to the ER with this stuff because kids these days don't know when to stop with their doses and combinations. This is certainly not something to be fooled around with. I'm sure that on a higher dose of amt, the hydrocodone I unwisely took would have caused me to be very sick, possibly for quite a while. So be safe and keep learning."
 ],
 "erowid": {
  "id": "19959",
  "citation": " C Double. \"Christmas Eve: experience with AMT (ID 19959)\". Erowid.org. Jan 16, 2008. erowid.org/exp/19959",
  "substance": "AMT",
  "views": "3594"
 }
}
