{
 "title": "A Freaking Mind-Job!",
 "author": "lump",
 "citation": " lump. \"A Freaking Mind-Job!: experience with 5-MeO-DMT & Tobacco (ID 30534)\". Erowid.org. Aug 23, 2004. erowid.org/exp/30534",
 "substance": "5-MeO-DMT & Tobacco",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "12 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)",
   "",
   " ",
   "smoked",
   "Tobacco",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "30534",
   "Male",
   "",
   "Not Given",
   "Aug 23, 2004",
   "6116",
   " "
  ]
 ],
 "report": "<p>Well, I have tried a few different things in my time, but all I am left to say about this 5-MeO-DMT is 'wow'.  A friend of mine and I ordered 500 mgs of the substance off a given supplier, and after breaking it all down into circa 10 mg piles, it was time to experience this new-found wonder.  My friend, lets call K, takes the first trial (a couple days before me may I add), and I was well-informed on the effects of the substance.  No matter how informed I was though, no stories can give a feel to the actual thing.  K was available via AIM, and my other friend, lets dub E, was with me as a babysitter.  After taking the tips from K, I was ready to go on my journey.</p><p>I took my seat in my 'trippy room' and laid the fire upon the spooky chemical.  i took my hit with the tobacco (to avoid sucking the chemical thru, and E took the pipe away from me.  I laid back, and took a good long look at the lighten alien head while I exhaled.  Then I felt it coming up, like a stalker coming up behind you, but not being able to do a thing about it.  This stalker within my mind then grabbed my head and shook it, viciously, this would defenitely be the effects of the substance that would leave a bad taste in its victim's mouth.  My first impression was 'This is FAR too much for me!  I dont like this one bit!', but then I simply relaxed and reminded myself, this will not kill you.  Even after reminding myself this, I still felt rather overwhelmed, then E leaned in thru the curtain and handed me a bowl for vomit, but there was no need for it.  After a few more moments of this 'mental rape' and staring mindlessly at spectrum posters and black lights, I began to enjoy this feeling.  I uttered the words 'E, im going to try to walk, I hope I dont die', I stood up and grasped my balance, then wandered into the next room.  </p><p>E was there online with K, but I was in no mood to sit down and chat, I was going to enjoy my buzz!  I simply stood there in awe of my room, then gathered the attention to have a little chat with K.  As I chatted, I could feel the effect decending and decided 'This isn't so bad!' This was my first experience with the drug, but I do not believe it will be my last.  Always have somebody else with you, and happy experiences voyagers!</p>"
}
