{
 "title": "Tripping Is Not for the Weak-Minded",
 "author": "Tdm",
 "citation": " Tdm. \"Tripping Is Not for the Weak-Minded: experience with Mushrooms (ID 30593)\". Erowid.org. May 7, 2007. erowid.org/exp/30593",
 "substance": "Mushrooms",
 "bodyweight": "105 lb",
 "report": "<p>After reading all sorts of reports on psychedelics, mushrooms seemed to me to be perfect to get a good feeling of what tryptamines are all about.  Until this last experience, I have eaten mushrooms, but not ever to the extent of what I felt with this last experience.  I consider myself to be a very stable-minded female, but I don't think from my readings that I would enjoy LSD because of the 'mind-warped for hours on end' feelings that would take over my brain.  I think I almost got to this point during this last experience.  Just to let you know the drugs that I have been using these past few years are, marijuana, coke, heroin, Ritalin, ecstacy, Valium, Xanax (and all related Mexican Tic-Tacs) , oxycontin, and various other pain pills.  Out of them all, speed is just not for me.  I am an aerobics instructor and personal trainer and I think I am already too wired for any stimulants. (Another reason I havent tried LSD)</p><p>I purchased myself a shroom kit and was pleased that it was relatively easy to grow my own shoomery.  It just takes patience, but thats about it.  When my shrooms were ready to harvest, I invited my best friend, my brother and his girlfriend to partake in my new crop.  In eating mushrooms, I have found it is so important who you trip with and where you do it.  My insides are pretty much out there for everyone to see, so I have much better experiences when I am completely comfortable with my surroundings, therefore we stayed my home where I felt safe.  The worst part of the whole experience to me is eating the dreadful things, but I have found that peeling an orange and eating the shrooms with the segments has proved to be the easiest and tasteless way to ingest them.  I also get the added bonus of the Vitamin C.  I take 5-HTP as a supplement and had also taken a multi-vitamin that morning, which could have contributed to making my experience a bit deeper than my comrades. </p><p>After we had eaten them, in about 20 minutes I felt that familiar tingle like cold-chills up my spine, which means my trip was about to begin.  We all started talking about various things, this and that, and then I realized how far gone we were when my brother kept trying to tell this joke about a pirate and he couldnt remember the punch line, but it was hilarious to all of us anyway. </p><p>After about an hour (but it seemed like hours) things got very visual.  My walls are wood paneling and I could easily see faces in them.  They began to dance and I realized that they were African tribal women who were happy that I lived in my house. (I just got a new house)  We had originally planned to watch movies, but my DVD player lacked a connector so we couldnt hook it up.  Instead we watched Pet Star on Animal Planet.  The dogs were devilish looking and Danny Bonaduchi was a judge and he looked like Satan to me.  Everything I looked at was amazing.  I could see the height difference in each strand of my carpet and then colorful, bizarre patterns kept emerging.  I also have several palm trees and they waved at me throughout the evening.</p><p>After about 2 hours (again it seemed like we were up all night) I started getting buggy.  Because we were laughing at the TV and carrying on, I kept getting this feeling that someone was going to stop in and I knew I would be too fucked up to talk to them.  I told my brother that we should go in my room where it was quieter, that way if someone came to the door, I wouldnt freak out.  My brother and his girlfriend went outside for a cigarette and I told them to join my friend Jane and I upstairs when they were finished. </p><p>I somehow managed to put Pink Floyds The Wall in my cd player and after lots of effort, figured out how to play it.  Any other time I could work the thing with no thought whatsoever.  The most amazing thing to look at was my mushroom colony itself.  If you grow your own shrooms, you HAVE to look at them at some point during your trip.  Jamee and I looked at them and they were the most amazing, visual things.  I could see them actually growing and there was such a spiritual presence that I cannot begin to explain.  It was almost like looking at a microorganism under a microscope where everything is moving with life, thats the best comparison.  I could have stared at them for hours and it seemed as if I did.</p><p>I then layed in the floor with some pillows, and the rest of my party layed around near me.  I was fine then and started morphing with my floor, it became so difficult to move and I wanted to just keep my eyes closed.  Jane kept telling me there were all kinds of amazing faces on my ceiling, but when I looked I kept seeing characters from The Simpsons. </p><p>After about 3 hours had passed, everyone with me decided that they wanted to go home and be in their own environments.  I could understand this being I felt safe in mine and probably wouldnt in someone elses home, but I was worried about them driving.  We all went downstairs and I was melting into my stairs as everyone was assuring me that they were fine and I assured them that I would be fine.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Thats when my brain went to hell.  When everyone left, I had the sudden realization that it was just me and my brain at home  wide open.  I figured I would make everything as calm as possible by turning down lights, noise and the like.  I decided that a hot bath would calm me.  I was wrong.  Lights were way too much for me so I just had a nightlight in my bathroom while taking my bath.  Before I could even finish filling the tub, these very intense crazed feelings came over me and I had to get out of the water.  I jumped out as fast as I could, leaving the water in the tub and all, and jumped into my bed.  I lay there and worried about my friends and brother driving home, it starting driving me crazy.  So I decided to call them to check on them.</p><p>I called Jane who was at the drive thru at Wendys and told me she was okay, but had to go.  I could definitely understand that because I myself at the time could not have imagined driving, going through a drive-thru and talking on a cell phone at the same time.  Way too many tasks at one time.  I felt good about that and then dialed my brother.  When he answered the phone he asked if I was ok and I told him that I thought that it was that my mind was just turned up too much right now.   I had guilty thoughts racing through my head of events in the present and past that I had felt slight guilt over in my normal state of mind.  James told me to stay calm and that everything would be fine in the morning.  That calmed me completely.  I couldnt complete many sentences so my brother had to translate most of my mumbling.  I did tell him that I loved him and I dont do that much. </p><p>After this panic had subsided, I was fine.  I felt safe again in my bed and home.  I drifted off to sleep and my mind slowed down.  One thing that scared me was looking at myself in the mirror.  I try not to do this when I am taking drugs anyway just as a rule, but I did look at myself and my face looked freaky and it kept twitching around my eyes.  I hated the way I looked like this.  Tearing and yawning were the weirdest side effects.  Many times during the evening someone would ask me if I was crying, but my eyes just kept tearing.  No one else seemed to have that problem but me.  Another annoying side effect was the yawning, James and I kept yawning although we were not tired.  Lack of oxygen, I suppose?</p><p>This experience was mind awakening for me and I took much wisdom from it.  I now have the opinion that no one can really say they know what life is about till they experience a trip.  I feel like there were many parts of my brain that had never been tapped into, awakened after that.  I realized that everything I felt was controlled by my brain and knowing I had that power was overwhelming.  I even mentally tested myself by making my headache that I had gotten go away by will of my mind.  I realized that pain was all in my head, that I could control the amount and threshold of pain that I felt.  All these realizations helped me to understand how powerful these little fungi can be.  Im not sure if my realizations were true, but it gave me lots to ponder about my life.  Again, I stress that shrooms are not for the weak-minded.  Now, after this experience, this one question keeps popping up in my mind and I cant decide on the answer.  Was man meant to eat mushrooms and experience Earth in this way?  I dont know, but I hope I do realize the answer one day.  Maybe I will on my next journey.</p>",
 "year": "2004",
 "id": "30593",
 "gender": "Female",
 "timestamp": "2007-05-07T07:00:00.000Z",
 "views": "4931",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 caps",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 }
}
