{
 "title": "Loss of Coordination Entirely",
 "author": "Lorax",
 "citation": " Lorax. \"Loss of Coordination Entirely: experience with Datura (ID 306)\". Erowid.org. Oct 10, 2000. erowid.org/exp/306",
 "substance": "Datura",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "report": "<p>Whoa..... that's how I shall preface this.  Just last week was the first time I had even heard of this stuff.  The person who gave me the seeds told me the story of the soldiers at Jamestown, and I thought 'wow, I have to try this crap!' Now, I am no novice drug user, I've pretty much tried EVERYTHING, but I don't think I was prepared for the 'stinkweed trip.'  OK   </p><p>At this point I was very disappointed, so I went to bed. Well, evidently it takes longer to kick in than I expected, because when I got up to go to the bathroom about two hours later, my motor functions did NOT exist at all, I fell at least two dozen times, and ran into EVERY piece of furniture in existence in my apartment.  I broke at least one toe, cracked two ribs and bruised my tailbone, let alone the scrapes and bruises on my forearms, knees and buttocks. I also was talking gibberish, according to my mother, with whom I live, and Whom I scared shitless during this event.  I walked into her bedroom at 5:30 am and began rummaging around, when she woke and asked what I was doing I replied 'relax....' and then let loose a ten minute stream of gibberish, which I felt made perfect sense.  I also had in depth conversations with myself, although I cannot remember what the hell about.  I imagine I was still pretty fucked up for almost two days, I was unable to read small print as well until this afternoon (two days later) and I have finally stopped seeing weird movement in my peripheral vision. </p><p>Aside from the injuries I sustained, I think I would try it again, in a smaller dose, and preferably WITH someone else, and most likely out doors, where there is no furniture or doorways to navigate. If you're considering trying this stuff, be wary, take small doses.</p>",
 "year": "2000",
 "id": "306",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-10-10T07:00:00.000Z",
 "views": "14967",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  }
 ]
}
