{
 "title": "My Life's Edge",
 "author": "Koorac",
 "citation": " Koorac. \"My Life's Edge: experience with Caffeine (ID 30609)\". Erowid.org. Jun 18, 2006. erowid.org/exp/30609",
 "substance": "Caffeine",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "4800 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>[Erowid Note: 4800 mgs of Caffeine  is considered an extremely high dose, see Caffeine  Dose Chart]</p><p>This was the absolute most terrifying experience of my life.</p><p>Life. What a word. So simple. So fragile. One chance to make the world and people around me  a paradise full of joy and love, or screw up and be forced into a mind shattering death wheel of excruciating pain and agony.</p><p>Recalling this experience is difficult enough without having to type it, going through every heart pounding detail. (pun intended)</p><p>This will be quite long and detailed, but is worth the read. Not EVERY detail can be accurately recounted, as this was more then 2 years ago, but it will be very close.</p><p>A date that will forever be burned into my memory. Me and the boys ended up at a bash on this particular night. Not much of a bash though, about 30 bodies. All the normal bash stuff on the go and what not. So a few of my buddies goes out to purchase some fine Mary Jane when I discover I have forgotten my wallet. Big problem there, no money, no weed, no beers, no trip. Until someone suggests that I go to a local drugstore and get some 'free' caffeine pills. Take a couple packs, they would be a good trip he says. I had taken a few before and liked the benefits from them so I decided a few more couldn't hurt, me thinking it's JUST caffeine after all, and maybe give me a fun trip. Welcome to hell is what he should of said. The pills were easily gotten and soon I returned to the party to pop them. The time was 10:00pm.</p><p>24 in all. Thats 4800mg. I have read online that 4500mg has been described as the lethal dose. Over the course of 5 minutes all 24 were within me, just waiting to release their hell upon me.</p><p>At 11pm, me and a few boys leave the party, and by this time I was on a decent trip, if I could call it that. I felt as if I could run forever, so I did. I ran for a good 20 minutes just because I had that much energy. It was incredible how hyper I was. My speech was sped up significantly as well as basically everything else I did. Was as if my mind worked 5x faster then it normally would. Stuff just didn't seem right. I came back to find my friends and they were just about to go into SubWay.</p><p>This is where the gates of hell slowly creak open.</p><p>We go in. And I sit down as my friends buy some food. One of them comes to sit next to me and asks why I was making my right knee jerk up and down. I told him I wasn't trying to do that, and had control but not much over the movement. I forced this movement to stop, for a short while, but when it started again, I decided we should leave.</p><p>We meet with more people at this point, who had been kicked out of the party, and walked to abandoned train tracks to jump over a cliff into trees for fun. It is fun, also very stupid, but fun none the less.</p><p>Stuff is starting to get ****** up now. Everything is going so fast it was overwhelming. I put my right hand into my right pocket and it started to shake slowly at first, but then violently. I had VERY little control and could not make it stop fully.</p><p>Right then I knew I was fucked up bad so I just left and went home. Think thats the only time I ever ran all the way home from there.</p><p>Gets home. Home is where comfort is supposed to be. There was none to be found here. Relatives were over when I arrived around 12am. I had to force myself considerably to make it look as if something wasn't wrong with me. I spoke to my uncle for about 3 minutes and got by that fairly well, or so it seemed to me anyway.</p><p>By the time 12:40am came the gates of hell were wide open. Relatives were long gone, everyone else asleep. Not me though, I wouldn't sleep for a looong time.</p><p>My temperature was through the roof. My heart was pounding insanely non-stop. I honestly thought I would have a heart attack. Barfing had begun. I drank water, I ate a little, it all came back up. I wanted to go outside and run. This didn't help. It was colder outside but that didn't really help ether. I would run back and forth between my computer room and my bedroom (both luckily downstairs) so many times I can't remember. I was frantic, trying very hard to calm myself, but at this point this seemed like an impossibility. This was bad, very, very, bad. How I felt was wrong, but not the sort of wrongness or disassociation form your normal mind like say a DXM or LSD trip will induce. I mean WRONG. wrong wrong. I felt very sick and just not right. Like my body was shouting as loud as it could yelling 'youre a fucking idiot, this is not right, you are going to die!' It was like this and much worse for a horrifyingly long while.</p><p>I talked to a couple of my friends who were now home on icq. They said call poison control right away. I said no. Not getting in trouble for this. I'll just sit it through the night.</p><p>Then the dry heaves begun.</p><p>Dry heaves are not fun. ANYONE who has experienced true dry heaves can tell you this with a sharp look in their eyes. Bad was all around, black spots of fuzz clouded my vision at certain times. Just wrong everywhere.</p><p>Eventually because of my friends on icq, some called to see just how fucked up I was. They kept calling and I think the third time they called my parents had the phone off the hook too because they suck a lot. 'I took a lot of pills tonight' I said, and I heard a phone click down and stamping coming down the stairs.</p><p>They bitched, they yelled, they looked on in disgust, a little sympathy, not much, and tears. They got ready to take me to the hospital. Even though this sucked so much it wasnt even fit, what my friends really did was save my life.</p><p>I was FUUUUUUCKED by this point. I mean REEEEEEEEEEALLY FUUUUUUCKED. BEYOOND FUUUCKED. So fucked it terrified me.</p><p>This is now around 1:30am. I honestly thought I was going to die now. I was just TOO fucked up.</p><p>Heres the sickest part to this tale. My parents actually took their sweet time getting dressed and driving me to the hospital. Me the entire time I was dry heaving with my head in a shopping bag, fucked up beyond. And here was my dad driving maybe 40kmh down a road where the speed limit is 80m/h. Just for the hell of it. To make me learn my lesson I guessed.</p><p>Fucking Bastard.</p><p>Gets to the emergency room. More waiting. About 20minutes goes by.</p><p>I talked to a nurse, told my dose and what I took and stuff like that, and she said go WAIT. I could have nearly cried. I was just too fucked up now. Far to fucked to even want to be alive. But I kept going until this nightmare was to end in any way.</p><p>Approx 2:30am I get put in a room. I have to standup and give a piss test in a bathroom, then back to this room. They found some weed, so a week later I got bitched at for that, woo flippin hoo.</p><p>I am given a bedpan to barf in, this bedpan was changed at least 25 times over the course of me being in this hospital.</p><p>I lay down on a table bed thing in this room barfing in agony, this trip is in no way fun at all. Not one stain of this experience was enjoyable. It was all hell.</p><p>I remember looking at a sad expression on my mothers face as she watched me barf into the pan and make a lot of jerking motions with my whole body until I am seen by a doctor. That was probably in the top 3 worst 20 minutes I ever had. I was told it was too late for a stomach pump so they had to act fast. He quickly got me a wheelchair and IV then escorted me to the real ER where a few other sick people are and I some how get out of my clothes, and into the sheet covering thing and onto a bed. I am immediately taken a blood sample then people start injecting lots of drugs into my IV tube. A heart rate monitor with 3 suction electrode things are attached to specific points on my chest. That's a frightening sound, it was just going to fast and didn't seem normal (because it wasn't) but it scared me.</p><p>And then I just lay there. Barfing, listening, going in and out between periods of black and sight, warmer then Ive ever been, and in great pain. My gut hurt A LOT. What might of been 2 hours, of PURE HELL, nothing else an describe what I felt in these hours except this, passed, and then I passed out.</p><p>I was in the hospital for 3 nights, including the first one.</p><p>I slid in and out of consciousness the first night, terrible agony, barfing all over myself, uncontrollable movements, glimpses of a few people, vague words, and then blackness. Not sleep black. BLACKNESS. It was as if I were still awake and dreaming at the same time. Time seemed to pass normally but it was just all black. Black everywhere.</p><p>I was so scared. I am not one to be scared of most anything, but I will admit I was terrified.</p><p>The next 2 nights and days had me recovering. More drugs. More people. More terrible terrible memory's.</p><p>I was seen by a psychiatrist. She told me I HAD to be suicidal to do what I had done so I complained but was basically near ignored.</p><p>I had to see her again every 3 weeks for 3 months.</p><p>I was told over these 2 days just how close I had come to death. So close. So very close.. Gives me the shivers. I was also told how extremely lucky I was that I got into the hospital and not stayed home all night. There was such a high chance I would of been fond the next day as a corpse it made me just freeze when I heard it. Approx. 90% possibility of death had been predicted. I nearly died there on the spot.</p><p>I lost ALL trust and respect from my parents. From most of my relatives. From other people. And to this day still have this story brought up when I am discussed by people. I still carry the mental scars of this experience. But I survived.</p><p>I was restricted from low amounts of caffeine and up for 4 months, just for safety. I experienced several extremely painful chest pains after this, which never occurred before this incident.</p><p>But I am alive.</p><p>Since this experience I have come very close to completely recovering, but not all the way. I have grown and matured much. I live.</p><p>I refer to as the Remeberance Day weekend for remembering HELL. For the last two Nov.9's I have celebrated my life and that it is still on the go and will continue to do so. Life is no joke, when its gone it's gone.</p>",
 "year": "2001",
 "id": "30609",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-18T07:00:00.000Z",
 "views": "18773"
}
