{
 "title": "New Friends",
 "author": "Gonzo_",
 "citation": " Gonzo_. \"New Friends: experience with MDMA (Ecstacy) (ID 30625)\". Erowid.org. Mar 9, 2007. erowid.org/exp/30625",
 "substance": "MDMA (Ecstacy)",
 "bodyweight": "70 kg",
 "report": "<p>This was not the first time I had taken a pill before. But it was one of my most intense experiences and one that gave me 'the older brother I never had'. And it happened at an all ages rave event.</p><p>I had been to raves two times before this. I had dressed like my friends, who had been to many more raves, in jeans and a t-shirt. This time however, I was on a mission to have the night of my life. I dressed in shorts and t-shirt and my newly aquired visor. Worn upside down and around to the side. My flatmate (dressed in her kandy outfit) and her new 26yo boyfriend (several years older than myself) both accompanied me to the rave.</p><p>My flatmate dropped while we were in the car. I waited until one hour after we got to the event. I was sitting with my friends in a circle and they all started to come up. I decided to take mine. I put it under my tongue and dissolved it in my mouth. Not too tasty, but I wanted to come up fast!</p><p>We all moved off and some time later I felt light headed. I was sharing a chair with a friend who was peaking. I nearly fell off the chair. I stumbled turned around and I had the biggest smile in the world. I tried to communicate with words but I couldn't. I would be short of breath every second word. This was a new feeling I had not felt before and I looked at my friends and they stared back at me with smiles as they nodded in agreement. They knew exactly what I was feeling and they asked the retorical question 'You feeling ok man?'. I just shook their hands as I grinned at them. Then I nodded my head. For once again we were brothers.</p><p>At this point I usually go and hug my flatmate. But when I got there I was greeted by her boyfriend. He jumped up as he saw me. He had a smile on his face from ear to ear. I was moving to the music, a wicked drum and bass track that flowed through my body and into my limbs. I did a little cross-over leg move as the sea of fellow stompers parted on the dance floor. He said to me that I was the little brother he never had and if I or my flatmate were ever in need he would be there for us. I shook his hand the only way I knew how, with respect and sincerity. Then I hugged him and told him that he was the big brother I never had.</p><p>After the encounter with my new found sibling I felt the urge to move again. I wanted to go outside. I got to the stairs and stopped. I stared at the obstacle that was preventing me from reaching my goal. I was still peaking and my body buckled at the idea of traversing something as dangerous as stairs, but I started one step at a time. 4 steps took about 20 seconds And I soon realised their was someone behind me. I just so happened to be blocking the whole stairwell. I looked over my shoulder and apologized to the young girl who stood behind me giggling at my state. She understood the way I felt so she just smiled back.</p><p>She overtook me and got to the bottom of the stairs, but she stopped there and waited for me. When I got there we met each other's eyes and I realised she was so gorgeous. She was smiling at me not because she had taken a pill, but because I looked pretty silly trying to walk down those stairs. We began chatting and I noticed my hearing had changed, the way I could hear her voice so clearly and everything else was distorted. I also remember how my eyes were affected. The light was so bright as I talked to her there and her green fluffy outfit really caught my attention. She asked if I wanted to dance and I obliged. She took my hand to help me up those stairs and after a while of dancing I kissed her on her cheek and thanked her for being so kind.</p><p>I got her number and called her up after I'd been home to have a sleep. We went to a few raves together and had one of the most fun relationships I've ever had, but it didn't last longer than a few months. I meet up with her at raves now and I see her out at raves when we've got time. But I love her now as a friend and she's still gorgeous.</p><p>And my newfound brother? Each time we go to raves together on pills we would always make sure the other person knew how we felt. We called ourselves brothers. But even out of the rave scene and not on drugs we stilled called each other brothers. He looked out for me and was always looking for ways he could help. He even sent me a birthday wish 4 months after my flatmate and him had broken up.</p><p>Sometimes you can make lasting relationships based upon the intense feelings you get while you're on Ecstacy. You've just got to try and be open.</p>",
 "year": "2003",
 "id": "30625",
 "gender": "Male",
 "timestamp": "2007-03-09T08:00:00.000Z",
 "views": "3095",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
