{
 "id": 3065,
 "title": "Jack and the Lady",
 "date": {
  "submission": "2005-10-06T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "anunderwaterguy",
  "gender": "Male",
  "weight": "60 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "125 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "I can't remember how I found out about salvia divinorum, but I started reading things on the internet about this extrememly potent psychoactive drug which was legal and after reading several trip reports and the numerous warnings/advice sections on many sites I decided to give it a go.  I bought firstly some dried leaf and a small pipe, however I found it very difficult to achieve any sort of effect from smoking leaf through a pipe with a regular lighter and the smoke was extremely harsh, much mocking was caused when I let my friends try this 'new drug' to which they found no effects (expecting a marijuana substitute) so I decided to buy some extract a bong and a butane torch lighter, which I highly recommend, and try the stuff by myself. I waited for a quiet time with no distractions from other inhabitants of my house and got the bong out.",
  "It was about midnight on a friday night and the house was completely silent, after reading the reccomendations of having a sitter present (and ignoring them) I decided I had better hide my collection of knives and handguns out of site, just in case and I sat down in my room with the bong.  After a few calamitous efforts (i.e blowing the extract out the bowl with the gust of air from the lighter, and inhaling the smoke with the air hole not covered) I filled the bowl with what seemed like a tiny amount, I didn't want to go overboard, and drew the butane torch into the bowl... I held in the smoke for about 20 seconds as I lay back on the ground and exhaled... nothing happened, except I seemed to be sweating profusely, also my arms seemed to be extremely heavy and I couldn't lift them for more than a second at a time.  Frustrated at the lack of effects I decided to go all out and fill the bowl up properly, so I put in about what seemed like an 1/8th of the gram bottle I had and got the lighter ready.  I inhaled a large lungfull which felt quite harsh on my throat, as I was using an ice bong I felt this was a good sign, then I lay on my back again. ",
  "Then I seemingly emptied my head of all thoughts and had no memory of how I had arrived in this situation, I had no memory of smoking salvia and was just looking straight ahead.  I looked at my right hand and like a psychedelic music video my hand seemed to turn into a thousand hands tailing off into the distance. Alarmed by this I looked across at my other hand which again turned into a thousand hands. When I looked back at my right hand the same thing happened but this time in the back of my head to the right (hard to explain the position of a voice), a female voice said the word 'hand',I looked straight ahead and a male voice (more central than the female voice) said the word 'zoom' and the whole room was going all psychedelic, the voices now seemed to be trying to coax me into coming down into their alternate reality which seemed directly below where I was lying.  I was now pretty freaked out by what was happening and I think I was shouting out loud that I didn't want to come with them (whom I was calling jack and the lady) the female voice was saying that I had to come with them and I think I tried to get up, then things got really strange. It was like there was a conversation going on inside my head saying that I was scared and I was going to freak out and they would lose me, a bit like surgeons in an operation except it was inside my head. ",
  "I lay back down I think (hard to tell as I was completely away from my normal reality) and I kept telling the lady that I was in my room and it was an illusion, (a bit like in the film sphere I thought) I kept telling her and she kept denying it as I was being pulled down I kept resisting and then my ego managed to grab hold of my consciousness again and I could see things in my normal reality again, however the lady was still there. I had to convince myself that I was still in this reality and I picked up a sock and smelled it and I was shouting at the space where I thought the lady was (which was actually my radiator) and shouting 'see it's a sock, it's real', then I managed to be back in my reality completely and for about 10 minutes I just felt extremely drunk and hazy and I kept saying 'that was so weird' and laughing for about ten minutes, of which I can't remember exactly what happened in these ten minutes but after that it wore off and by about 20 minutes I was perfectly back to normal.",
  "All I can say is that I was completely unprepared for this and for about a day afterwards I kept thinking I would never try it again but now I think I will, and this time I will be prepared (if that is possible) and I will go with the voices and see where they take me.",
  "Another effect which was strange was that I was extremely warm and very uncomfortable lying down, I felt like I had about three people sitting on my chest allthough I found it a lot easier than normal to breathe for some reason. It is nothing like any other drugs I have tried and is certainly not 'fun' the way other drugs are, but very very cool."
 ],
 "erowid": {
  "id": "19990",
  "citation": " anunderwaterguy. \"Jack and the Lady: experience with Salvia divinorum (5x extract) (ID 19990)\". Erowid.org. Oct 6, 2005. erowid.org/exp/19990",
  "substance": "Salvia divinorum (5x extract)",
  "views": "3120"
 }
}
