{
 "title": "The Universe Is In My Bedroom",
 "author": "Jim",
 "citation": " Jim. \"The Universe Is In My Bedroom: experience with Salvia divinorum (extract) (ID 30669)\". Erowid.org. Feb 19, 2004. erowid.org/exp/30669",
 "substance": "Salvia divinorum (extract)",
 "bodyweight": "180 lb",
 "report": "<p>It has been about 30 minutes since my salvia experience, and all I can really say is 'wow'. Months of planning and researching went into my decision to try Salvia, and I read tons of experiences here on Erowid. I bought 2 extracts, 1 gram of 5x and 1 gram of 10x. Based on what I had heard though from others who had bought from the same source, this extract was really weak, and without at least 10x, I wouldn't be able to really trip.</p><p>I planned on using a sitter, although all my Salvia is now used up, and I never used that person to watch me (although any higher doses and I will. I recommend you do use a sitter, and to have a very quiet location to do this!!)</p><p>I decided though, being that my only other drug experience is with a little bit of Marijuana, I'd try a hit or 2 of the 5x without a sitter (i was at the time, still planning on using a sitter when i experimented more). After a few hits, I felt a slight marijuana type buzz with a sort of greater 'presence', which wore off quickly.</p><p>I then chose to do a little more. This time, I took 3 or 4 hits, and soon realized there were people all around me. I couldn't see these people at all, but they kept saying in my mind 'She's coming, she's coming', excitedly, as if someone very important was going to be paying us a visit. I felt like 'she' was almost there, as I quickly came back to reality. I now had a respect for the drug, but was no where near where my next trip would take me.</p><p>Remember that my extracts weren't very potent, so I'm sure my dosage was quite a bit higher. A few days had past, and I felt I was finally ready to see what Salvia could show me. My sitter wasn't going to 'chill' with me for a few weeks, and I was impatient. So I sat down with my 10x and 5x bags, znd with only an overhead light on, so I could pack the bowl. When finished smoking, I'd turn it off and lie back on my bed. I packed a bowl of the 10x, and took my first hit, and held for 30 seconds. It wasn't cashed so I lit up again for a second hit. I believe I packed another bowl, and took another hit or 2, before managing to turn the light off, and lying back.</p><p>It then hit me, that Salvia could do a lot more than I had previously experienced. I quickly found myself rock climbing with a 'friend', although I really couldn't tell who. It seemed like this same sort of 'presence' that I had felt before. I couldn't really see them, but I felt them, and knew they were there. By the way, she is a female.</p><p>Then we both started getting sucked into a hole, almost like an earthquake/avalanche(all the rocks we climbed were falling. It wasn't scary by any means. I'm not sure if I was holding on, trying to keep from getting sucked in, but this is about the time when reality hit me again, a few minutes later. But I was feeling very confident and comfortable with the substance, maybe more than I should have been.</p><p>So I packed another bowl of the remaining 5x, and some 10x, and took 2 deep hits.</p><p>I layed back in my dark room, as reality left, and I found myself spinning in the middle of space, just watching the stars. The whole universe was in my room. I then felt the spirit I always seem to encounter, flip the page of my room like a book, as she changed the scene of my trip.</p><p>She didn't speak to me (she has never spoken to me), but at the same time, she was communicating to me. I could feel her. Now, every person on earth, and their spirits were walking into me. They were marching, a steady flow, in fast foward (sort of like when a camera is fixated on a road at the same spot, and it is fast fowarded) They went through me by the billions. I felt their lives touch me, and I felt connected to each and every human being in the world.</p><p>Then I am floating on a river, peaceful, enlightened. I drift and drift, thinking of all the peoples lives who just touched mine, literally. I then fell down what felt like Niagra falls, and back into my bedroom.</p><p>All I could think or say was 'holy shit, shit that was amazing.'</p><p>10 minutes later my head felt totally clear, and here I sit about an hour later, feeling completely sober.</p><p>One thing i must stress, at least for my experience, is total silence. Although for most of the time, I felt totally out of reality, I kept hearing trucks in the distance, and sounds from my computer, which really annoyed me, and in a way kept me from drifting as far as a wanted to go. (especially on the trip where i was getting sucked into a hole).</p><p>Salvia really has my utmost respect, and I will definitely use a sitter for any future experiences. Salvia truly is amazing, and should not be in the hands of people just looking to get high. I will continue to interpret what happened tonight for a long time to come.</p><p>Thanks for reading and good luck.</p>",
 "year": "2003",
 "id": "30669",
 "gender": "Male",
 "timestamp": "2004-02-19T08:00:00.000Z",
 "views": "6280",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
