{
 "title": "Balance of Risks",
 "author": "Dan",
 "citation": " Dan. \"Balance of Risks: experience with Diphenhydramine (ID 30715)\". Erowid.org. Nov 13, 2007. erowid.org/exp/30715",
 "substance": "Diphenhydramine",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Personally, I haven't tried very many drugs. The list would be: cannabis, opium, dextromethorphan HCL and Polisirtrex (DMX), ambien, codeine and of course diphehhydramine (DPH). I weight 185 lbs or roughly 85 kgs. I really had no idea what I was in for with DPH the first time I tried it recreationally. Coincidentally, my mom came in my room and asked me if I was doing benadryl to get a high. What she didn't know is that I had no clue DPH could affect you in any desirable way, besides making you drowsy.</p><p>The first time I actually tried DPH I took about 600mgs not trully knowing what to expect. I felt very tired, somewhat anxious and I noted that moving and speaking was difficult. When urinating I experienced some minor discomfort and I also noted that my arms and feet had hives (reddening skin, blotchy). This was rather startling so I did some research online. Next I moved on to published clinical reports about the effects of DPH. Usually this was in reference to animalia however, due to the vetrinary use of this drug. The CDC also shows several deaths assosciated with DPH, however there were no published numbers on dosage.</p><p>The next night I took 900 mgs of DPH and had similar problems to my first experience. I had some minor hallucination and trouble walking. The two following nights, after my first experience with DPH, were riddled with incredibly lucid and frightening hallucinations while I was not taking DPH. At school I noticed I had something resembling DT, and was more anxious than normal. This lasted for about a week. Since these occurences, I have taken DPH occasionaly at 300 mg doses. This level is enough to cause me to have lucid dreams, hallucinations while awake, the characteristic drymout, hives, prostate enlargement, anxiety, and prolly a few more I am not yet aware of.</p><p>The hallucinations and dreams are incredible. They are terrifying and just unbelievably fun. I have seen a cat a black cat on two different occasions, and on the most recent occasion I have even attempted to pet it. It appears that the line between the waking world and the subconsious are non-existent. Most of my hallucinations and dreams have been serious and somewhat scary. Certainly this drug is not for the faint of heart or for people who are careless with drugs.</p>",
 "year": "2004",
 "id": "30715",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-13T08:00:00.000Z",
 "views": "21812"
}
