{
 "title": "Huge Roller",
 "author": "Nick",
 "citation": " Nick. \"Huge Roller: experience with Salvia divinorum (20x extract) (ID 30713)\". Erowid.org. Nov 13, 2007. erowid.org/exp/30713",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "190 lb",
 "report": "<p>My 1st time with salvia was Jan 24th 2004. I was at my apartment with one other friend. We kept the room dark and quiet. I knew someone who had smoked salvia a few times and told me about it and said to smoke it one person at a time for one to watch the other while tripping. So my friend wanted to go 1st. He didnt do much just sat there rolling his eyes back and forthlooking from one side of the room to the next. He didnt say anything. I said 'Are you ok?' He said But what is this? This was after about 2 min after he took his hit. I couldnt wait anymore so I started to milk up my bong. Once it was full, I pulled the stem, cleared it, then I laid down on my couch closed my eyes and held my hit. I held it for only about 10 sec.</p><p>All of a sudden I felt like I was on the gravitron like a great force was pushing against me and it kept getting stronger and stronger. Then it felt like I blacked out for a couple of seconds cause a black void came over my whole body and I do not remember anything that happened for those couple of seconds. then it felt like I came back but now I was in a huge roller like the whole earth was rolling over and I was trying to peel out of some kind of covering to get to into a new world (Sounds weird but thats the only way I can explain it). The new world was to my right and my life was to the left and the roller was spinning to the left in the new world there were lots of colors. I couldnt make out any shapes. And it felt like everyone but me knew about this new world. I was thinking how could everyone know about this and I had no idea. That scared me and I tried to get up and get out of the roller. It was really hard to even sit up. I must of looked as scared as I was cause my friend came over to me and said just lay back you'll be ok just lay back. I couldnt really see him but I could hear him so I knew he was there. Since I was still tripping I thought my friend meant lay back in the roller.</p><p>Still scared I laid back down this time I started getting real calm. I could hear voices saying just come through just lay back come through. I was trying to peel out of my covering but just couldnt. Then it just started to fade away slowly. I still felt like pins and needles were poking me but I knew what was going on now. Then a rush of heat hit my body it felt like 2 million degrees in my apartment then that fast that went away. And I started feeling really tired. After about 15 min the entire thing was over I felt no effect after 15 min. and for the 1st 2 days after I did this I kept wondering was that real or not? And what the fuck was that? Now I am disappointed that the new world wasnt real even though it scared the crap out of me I still had the most calming experince when I thought that this is how life will be from now on. Im glad I had a salvia experince not that Ill do it again but it made me realize that I need to be more open minded in life.</p>",
 "year": "2003",
 "id": "30713",
 "gender": "Male",
 "timestamp": "2007-11-13T08:00:00.000Z",
 "views": "2767",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
