{
 "title": "Way Too Much for a Newbie",
 "author": "J. Edward",
 "citation": " J. Edward. \"Way Too Much for a Newbie: experience with DXM (ID 3075)\". Erowid.org. Dec 17, 2001. erowid.org/exp/3075",
 "substance": "DXM",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  "700 mg",
  "oral",
  "DXM",
  "(liquid)"
 ],
 "report": "<p>It all got started when my friend C.Q. took me to Wal-Mart after a Mardi Gras parade (I live in South Louisiana). He was telling me about all the fun he and his friends had had on robitussin while I was a good catholic boy at a good catholic high school. So, he bought two bottles of maximum strength robitussin, one for me and one for him. When we got home he found that he couldn't choke down his bottle, he had done so much that now the smell made him vomit. Jokingly he handed me his bottle, saying 'You drink it.' I had already slammed down mine, so I drank his before he could stop me. He looked at me for a long moment, then said, and I quote 'Oh dear. Well, now you're in for it.'</p><p>We went back to his bedroom, and he told me to lie down and relax. I did. This was about the same time I discovered the Cure, and I asked him to put their 'Pornography' album on.</p><p>The first hint of a trip was an apparent slowing of the world around me. Then C.Q., in a brilliant move, announced that he was tired and turned off the light, leaving me awaiting a trip I was totally unprepared for in the dark with this hideously evil music playing. Playing ad infinitum, as he had put it on repeat. Eventually I became EXTREMELY paranoid, and the room seemed to become quite hot. I was convinced that the devil himself was there in the room. I did not think 'Oh I'm on drugs' or anything like that. To me, it really and truly appeared that Satan was there with me. The room seemed awash in a hellish glow, which can probably be partially attributed to my pupils dilating to the extreme.</p><p>I went on like this for the entire night (from about 2am til 7am) and when C.Q. awoke he said I was pale and sweating profusely, and gripping the bedsheets for dear life. I actually remember very little from the actual trip, I only remember the feeling that there was a tremendously evil presence there with me, and that the room was extremely hot. I'm no mystic, I am certain that these effects were due to the combination of the music, the darkness, and, of course, the 700mg of DXM coursing through me, and not some actual demonic presence. However, it was still the most terrifying experience of my life, and one I will never attempt to repeat.</p><p>I have done DXM since, mostly in smaller (200-400mg) doses, and in more positive settings. We (C.Q. and I, sometimes with other friends) mostly take it and go into the world to confuse and frighten the insulated residents of our small town.</p>",
 "year": "1999",
 "id": "3075",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-17T08:00:00.000Z",
 "views": "20984",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
