{
 "title": "So That's It?",
 "author": "inf",
 "citation": " inf. \"So That's It?: experience with Ketamine (ID 30755)\". Erowid.org. Aug 8, 2006. erowid.org/exp/30755",
 "substance": "Ketamine",
 "bodyweight": "64 kg",
 "report": "<p>NOTE: 'SD' is a friend I talked to via an instant messaging application.</p><p>I am in my living room, alone. I weighed out 100mg of ketamine powder that I have prepared from liquid ketamine which I obtained from an online source. I split it up into 10 bumps and put the mirror on a small table next to my bed. I have also prepared a bucket in case I have to throw up, something to write and a bottle of water. the only thing I ate a few hours before was a few slices of pineapple.</p><p>I'm a little anxious, my palms are a bit sweaty. I look at my alarm clock.</p><p>20:14: insufflate 5mg into each nostril - it doesn't burn much. I get back into the living room to put on some music and talk to people on irc. about five minutes later I can feel 'something' - my heart rate has gone up and it's a bit pounding, but I think it's just anticipation. I can also feel something else being different, but I don't quite know what it is. probably just a placebo effect. very light nausea is coming up, but I can easily ignore it.</p><p>20:39: I decide to add 10mg (5mg/nostril) and get back to the computer. I feel like there is cotton in my head.. not comfortable, not uncomfortable.. I can taste the ketamine in the back of my throat, the effects described before increase a little.</p><p>21:00: I snort 10mg and get back to the computer. I move and walk slowly, and it feels strange. the nausea has increased a bit and I am waiting for some more effects. moving my head feels weird, and I get quite talkative on irc. it's probably just my desire for distraction.</p><p>21:17: I'm not feeling anything of what I expected to happen yet, so I add 10mg. sometimes I lie down because I'm feeling heavy.. I close my eyes but all I see is black.</p><p>21:38: I add 10mg. shortly after I think something is happening, I get up from my chair and lie down on the sofa. I even close my eyes, but nothing happens. it's like I was about to cross the threshold of something, but it didn't quite work. I get back to irc and talk to people.. I make lots of typos, but I don't care.</p><p>22:06: apart from feeling nauseous in a 'good' way and knowing that something is 'different', I don't feel much. I can walk without any major problems, I even go to the bathroom. when I look in the mirror everything seems to be normal. I'm annoyed and add 20mg this time. when I type on irc, my fingers seem to feel very light, but so do the keys I type on, which I consider to be strange.</p><p>22:34: things are quite weird now, but even weed has given me wilder thoughts. I add 10mg. the noise from my pc seems to be incredibly loud now, but that only lasts for a minute or two. I have trouble moving my eyes, I feel like a curtain is being pulled up around me, but this happens very slowly. I think that I will be where I want when it's closed, but the curtain movement seems to have stalled. my lips feel numb like they do from coke, some parts of my body also feel 'chemically' numb when I touch them. I also think I can 'taste' an anaesthetic somewhere in my body (this is difficult to describe) - I can still walk, but I know that I would probably hit the floor if I wanted to run. when I look on the floor, I think my legs are very short, but I am higher above the ground as usual. again, this is difficult to describe. the numbness in my lips has decreased, and I can feel the taste of numbness on my tongue.</p><p>I feel like a lot of time has passed, though, but when I look at the clock I am amazed - I thought it was ~4:00 already. I talk to SD (which I have been doing since about 21:45)</p><p>I clap my hands (I don't know why) and it sounds different, it sounds really cool. I pick some other ways to slap my hands together in order to make different sounds. I think everything feels like goo, and I try to dive into that thought, but it doesn't quite work. I am disappointed, but quite mindfucked. when I close my eyes, nothing happens. I make weird hissing sounds with my mouth because they sound cool.</p><p>23:00: most of the effects have worn off, and I decide to drink a beer and smoke a cigarette. it upsets my stomach a bit, but it's no problem. I feel pretty much normal, although the bottle feels 'huge' in my hand when I take it from the fridge. the beer tastes good and refreshing.</p><p>00:00: SD asks me if I am sober, which I affirm. I'm quite disappointed - I didn't expect to k-hole, but some visuals or somewhat overwhelming effects would have been nice. I decide to drink another beer.</p><p>00:15: he decides to go to bed, which I consider to be a good idea. I decide to finish my beer and go to bed.. I go to the bathroom to rinse my nostrils with tap water. I notice a slight headache, but it's nothing too major. in my bedroom, I switch on the tv and watch CSI miami and a call-in talkshow afterwards, which ends at 2:00 - I don't remember hearing the outro music, so I assume I was asleep at around 2:00.</p><p>08:15: my alarm clock wakes me up - I don't have more trouble getting out of bed than usual. the headache is worse than when I went to bed, but it's not even enough for me to take an aspirin. when I blow my nose, my left nostril starts to bleed, but it stops a few minutes later after I plugged some tissue into it.</p><p>it was a somewhat disappointing experience. I'm ~130lbs so I highly doubt the dose was wrong - 80mg insufflated for a first-timer should be more than enough. maybe I spaced the doses too far apart? maybe the ketamine was crap? who knows. I'm definitely going to try it again in a month or so. I had big expectations, but to sum it up, I felt like I drank two sixpacks of beer with strange chemicals in it.</p>",
 "year": "2004",
 "id": "30755",
 "gender": "Male",
 "timestamp": "2006-08-08T07:00:00.000Z",
 "views": "49574",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:15",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 0:46",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 1:03",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "4": {
   "time": " T+ 1:24",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "5": {
   "time": " T+ 1:54",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "6": {
   "time": " T+ 2:22",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "7": {
   "time": " T+ 2:46",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "8": {
   "time": " T+ 3:46",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
