{
 "id": 3076,
 "title": "Oh Christmas Tree!!! Oh Christmas Tree!!!",
 "date": {
  "submission": "2005-11-13T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "lil Christmas Tree",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "plant material"
  }
 ],
 "report": [
  "A couple weeks ago my friend ask me if I would join her in a salvia smoking session.  She had explained everything that she had went through and it sounded like so much fun, so I agreed to join her. We went to her house and turned the lights dim and turned on some really soft mellow music. She said we would smoke our own bowls so I put the lighter to the bowl and inhaled the thick smoke.  Immediatly after I exhaled I felt like I was one of many cards liked being fliped across the room but the cards were like the shape of plastic gingerbread men.  So inside my mind I was being thrust back like a slinky and it was so funny.  I could not stop laughing for anything. Finally when I could stop myself I opened my eyes and it started all over again.",
  "After that happended I was like WOW!!! It was so great, I have never laughed that much in my life!! My friend smoked her bowl and then it was my turn again. I was sitting next to her christmas tree when I smoked the second bowl.  I hit it like three times and nothing happended so I was like well maybe it only happens once. All of a sudden I felt something poking my arm.  Then all over my body I could feel little pokes everywhere.  I didnt know what was happening at the time.  It wasnt untill I felt this sensation that the hair clip in my hair was like an ornament on a tree.  Then it hit me!! I was turning into a christmas tree.  It was so funny and aggervating at the same time. I became one with the tree!!!",
  "I think the tree had bad energy from being cut down and being forced to die in your living room with things hanging all over it and I think that energy went through me.  That's why I felt uncomfortable...aggravated...but it was so funny because it was so real. I have never experienced anything like that before in my life and it just makes you realize there is something more to life than you think.  Its wonderful!! I think everyone should try salvia at least once in their lifetime!!!!!!",
  "                                      Lil Christmas Tree"
 ],
 "erowid": {
  "id": "20028",
  "citation": " lil Christmas Tree. \"Oh Christmas Tree!!! Oh Christmas Tree!!!: experience with Salvia divinorum (ID 20028)\". Erowid.org. Nov 13, 2005. erowid.org/exp/20028",
  "substance": "Salvia divinorum",
  "views": "4005"
 }
}
