{
 "id": 3078,
 "title": "For a Short Time I was There",
 "date": {
  "submission": "2000-06-21T07:00:00.000Z",
  "experience": "1984-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sean Le Blanc",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter / tab"
  }
 ],
 "report": [
  "Back in 1984 I was stationed at For the last four years I had been a good little airman and gave up pot, LSD, mescaline, and other fun stuff of my youth and also like a good little airman I took to the bottle with a vengeance. Working with me was a really cool dude named Jim. Jim and I instantly connected and every friday night we put our families on hold, bought some Wild Irish Rose and Vivarin and played guitar and talked religion and philosophy 'til the wee hours. Eventually talk turned to the spiritual aspect of the LSD experience and it wasn't long before we were planning a little trip. I figured that if we dropped on friday night we'd have plenty of time to recover before monday rolled around, so it was set; the next friday we would both trip one last time and see what we get out of it.",
  "Well, things didn't quite go as planned. After my Biology class was over I headed over to Jim's house full of anticipation. But when I got there, Jim wasn't alone; he had Joe there with him! Bad enough anyone else was involved, Joe was the epitome of uptight and white. 'Hey Jim,' I said, 'why is Joe here?'. Jim said 'Check out his eyes!' and sure enough, Joe's' pupils were dripping all over the floor. Turns out Jim had mentioned it to a few people and we had some deliveries to make. 'THIS IS NOT GOOD!' I thought, but the ball was rolling... so we dropped it off to some other guys in the shop (people who reported to me as I was the swingshift shop chief at the time!) and headed back to Jim's to await the effects.",
  "About an hour went by and I wasn't feeling anything. Jim and Joe were zoomin' so I chilled out and let those two jam on guitars for a while while I relaxed. Then there was a knock on the door. 'I'll get it,' I said. I went to the door and looked out the little window in it, and as I was opening the door for this guy standing outside, I thought, ' Why is someone crouching behind the bushes back there, and why is someone over by the wall...'",
  "FREEZE! YOU'RE UNDER ARREST FOR USEPOSSESIONANDDISTRIBUTION OF LSD! Yes, it was all one word, and I felt like I was suddenly shoved underwater. Everything was so unreal, time was in slow? fast? motion, and all I thought was, 'Thank God it didn't kick in!'. Jim and Joe had a different experience, I imagine. The room was full of Security Police with M-16's pointed at our heads (even though I was cuffed behind my back) and they ransacked the place. Turns out Jim's wife blabbed to a busybody neighbor who called the First Sargeant who called the Squadron Commander who called the Office of Special Investigation and in the retelling of the story it was thought that we were bringing 6000 hits on base, possibly to taint the water supply! So we go to the base hospital for a piss test and then they let us walk back home.",
  "NOW it kicks in! Trees start looming at me, lights are streaky and I'm feeling very giddy.Even though I'm tripping, my mind is very clear, and I can see how I've just screwed up things in a major way for me, my wife and 2 year old daughter. I related the tale to my wife and told her I had to lay down for a while and work things out. I curled up in a fetal position on the bed and closed my eyes. I could see this huge octagonal carpet suspended in the blackest darkness. The colors blended from one corner to the next, and I knew that each of the eight corners was emotion; the burgandy corner was guilt, the maroon was shame, the dark purple was frustration, and so on. Slowly, one of the corners started to droop down, and as it did I could feel the associated emotion welling up inside me. Suddenly the corner plunged into the void and I was wracked with overwhelming guilt, so much so that I would violently shake and moan on the bed.",
  "My wife came in when she heard this, and I pulled myself out of it long enough to tell her, 'It's alright, I've got to go through this now.'. She left the room and I returned to the floating carpet. After 45 minutes (an eternity, in my time) I came out to the living room, exhausted and drenched with sweat. The morning sun was about to come up, and I relaxed into a chair, put on a tape, and to the opening strains of America's 'Horse with no name' the sun slipped over the horizon and shot directly, but gently, into my eye.",
  "Oh man...I can feel it now... it's so beautiful... God is silently, insistently saying everything's alright... I can't describe how much light and love was in me then... and now...",
  "Sorry, I'm back. the next few minutes are so bizarre. Suddenly there was no more music even though it was still playing, somewhere, out there... all I could think of was how much I loved my daughter and at that instant my daughter came straight out of her room and climbed into my lap. She stared long and deep into my eyes and said, 'Daddy, you have rainbows in your eyes' and I realized that I was not made of flesh anymore, I was a giant, glowing, sunshine-filled diamond, and fear fell away. Pain fell away. And I was filled with the power of the Universe. Even weeks later I could feel it. I had the power to look inside people and see their fears and weaknesses and I knew they were totally powerless against me. Of course, all the power I had was light and love and all I wanted to do to people was to love and heal them and bring them into the light. It was truly magical.",
  "The Air Force wasn't done with me yet, though. I went to jail for a few months, got busted from Staff Sargeant to Airman, money was taken from me, they made up some shit to get me in hot water with the IRS and are still making me repay some money they said thay gave me, but all in all, it was worth it. For a very short time, I WAS 'THERE' and I'd do it all over again."
 ],
 "erowid": {
  "id": "2003",
  "citation": " Sean Le Blanc. \"For a Short Time I was There: experience with LSD (ID 2003)\". Erowid.org. Jun 21, 2000. erowid.org/exp/2003",
  "substance": "LSD",
  "views": "86604"
 }
}
