{
 "id": 3080,
 "title": "Not as Long as I Thought",
 "date": {
  "submission": "2004-03-08T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ceryc",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract"
  },
  {
   "time": "1:00",
   "amount": {
    "number": "3",
    "unit": "glasses"
   },
   "administration": "oral",
   "substance": "Cacti",
   "form": "tea",
   "specific": "T. pachanoi"
  }
 ],
 "report": [
  "Both I and my friend J experianced trippers, first time with mescaline.  Both fasted all day, both in good mindset.  At J's house, very relaxed.  Some weed smoked before and during the trip.",
  "9pm: 2oz syrian rue seeds extracted and consumed",
  "10pm: 3 18' long by 3' diameter cuttings skinned and blended with lemon juice, boiled to reduce volume.  3 glasses each down the hatch!  We drank slowly, trying to ease the shock on our systems.  The taste wasn't too bad, but the texture was horrible!  Little bits of cactus pulp hitting my teeth made me gag.",
  "10:30pm:  interesting, maybe just the weed or the harmala, but we are already feeling a bit strange.  J goes to vomit.",
  "11pm:  the trip has begun for sure.  amazing body buzz, like minor mdma blowups.  very tingly.  visual field gets distorted, seems like a ring of vibrating colors surrounds the room.  getting hard to stand.",
  "11:10pm:  off I go to the bathroom!  vomiting wasn't as bad as I thought it would be, but still not very nice.",
  "11:30-3am:  the peak is reached, we plateau for quite a while.  the cev are just incredible on mescaline, better than I have ever seen.  high quality images when my eyes are closed, controlable.  I was just zoned, listening to music as I watched these beautiful movies in my head.  a real sense of opening was felt, a more organic closeness to others than I usually get on lsd or mushrooms.  oev were decent: some tracers and a ton of color enhancement.",
  "3-4am:  the trip seems to be wearing off.  funny, I thought mescaline lasted 8hrs.  maybe not for us.  smooth decline in the trip, mental activity just seemed to shut itself off, then sleep came out of nowhere.",
  "we awoke the next day at 7am to eat breakfast and go do some shopping.  no hangover, none of the 'brain-fry' I'm used to expericancing on pyschedelics.  overall a very clean, pleasurable experiance.  next time I will either extract or force myself to eat more of the slime, I would really like to see the world changing properties that mescaline has been credited with."
 ],
 "erowid": {
  "id": "20031",
  "citation": " ceryc. \"Not as Long as I Thought: experience with Cacti - T. pachanoi, Syrian Rue & Cannabis (ID 20031)\". Erowid.org. Mar 8, 2004. erowid.org/exp/20031",
  "substance": "Cacti - T. pachanoi, Syrian Rue & Cannabis",
  "views": "8068"
 }
}
