{
 "title": "Body High with Tracers and CEV's",
 "author": "Chris",
 "citation": " Chris. \"Body High with Tracers and CEV's: experience with Amanitas - A. muscaria &  Syrian Rue (ID 30813)\". Erowid.org. Aug 26, 2005. erowid.org/exp/30813",
 "substance": "Amanitas - A. muscaria &  Syrian Rue",
 "bodyweight": "135 lb",
 "report": "<p>Previous experience: first time I tripped was september 2003, I used an eighth of psilocybin shrooms, which was a mild-medium trip but very intense and profound, especially when it went bad towards the end of the plateau, but I chose not to report that because everyone knows about psilocybin. Not too many people have done this combo.</p><p>Notes: I read as much as I could handle online on syrian rue and amanitas.  The first time I took amanitas was about a month before this time, it was 10 grams but with absolutely no effects whatsoever. So this time I decided to combine it with rue just in case I didnt get anything out of it, I'd feel nice because of the rue (it didnt exactly work out that way).</p><p>Prep: (I should have followed the food list not to eat with syrian rue, but unfortunately I had no choice with the timing, the night this all happened was the only night I could have done it for about a week, and I didnt wanna just let these things sit around getting older/staler.) I ground the syrian rue and used the lemon extraction method. I heated to boil with water and one lemon, and let cool, repeated about 10 times and until the tea was no longer brown, and sorta clear, I had about 16 ounces of tea. I ate the mushrooms while I started making the first tea batch. After about 45 minutes to an hour after eating the 10 grams of mushrooms, I finished the glass of tea.</p><p>Taste: Both things were perhaps the most disgusting things I've ever tasted. I dont mind the taste of psilocybin, in fact I think the bad taste label is overrated, its sorta like reboiled leftover unflavored chicken. The amanitas were absolutely terrible, but they were stomachable with an orange juice chaser. The syrian rue was intolerable, not an understatement. Syrian rue tea is the most disgusting, foul thing I've ever consciously ingested, it took me a few minutes to describe the flavor, but a VERY accurate description is the taste in your mouth after you throw up, which I assume is gastric stomach juices, except this is even more bitter.</p><p>Results: Im not exactly sure the percentage of which entheogen attributed to the 'trip', but ill just say what I felt. About half an hour after drinking the tea, my body felt buzzy, similar to hyperness from alcohol. Soon after, I started getting huge tracers, it looked like bruce lee's hands in fists of fury when he does the circular motion and the hands follow. Things were interesting but I was not feeling very pleasant. There were very slight, hardly noticable hallucinations, like things would seem different but not sure how they were different. I was feeling restless and trembly, but moving made me feel sicker. So I just tried to relax and close my eyes as much as possible.</p><p>An hour after drinking the tea (ca. 2 hours after shrooms), I threw the fuck up. More than 7 hurls man, it was sick. I felt better after throwin up though and that knowledge that I got the shit outa my system made me relax a bit. So I just chilled, drank some water. Things were pretty much the same: loss of coordination, walking was tough, serious tracers, and trembliness, almost like too much caffeine. This was the majority of the night.</p><p>About 2 hours after drinking the tea (ca. 3 hours after shrooms), I threw up again, 6 hurls this time. Again, I started to relax, but unfortunately, the assholes I was with kept fucking blasting music I didnt wanna hear and making me recheck my pockets 8 times for a lost dutch and yelling so they were making what could have been relaxing, very annoying and unwanted. Same feelings though, buzzy with tracers and a strange alteration of perception.</p><p>About 2 and half hours, me and my friends smoked a dime haze, basically I got about 8-10 hits off a blunt, but it didnt do anything, the smoke tasted like peanut butter. It was weird. I was too fucked up for the little bit of weed to come close to matchin what was goin on with the rue and shrooms.</p><p>Then the CEV's started, these were amazing. I closed my eyes and entered a daydream that made me forget that I was sitting in the car with these 2 kids. The CEV daydreaming looked completely pictured, as if I was watching it on a TV inside my head. Whatever I wanted to see, I could imagine and see it clearly, almost like dreaming without sleep. In fact, at times I would forget that I was in the car and some noise would pull me out of the daydream and then I'd open my eyes. (good thing cuz I had a stoge in my hand). Also, some random visuals just occurred, patterns as well as images. Nothing with open eyed hallucinations though. 3 hours after, I got dropped off, threw up once again, 5 hurls, I had hardly anything in my stomach left, although by that point it shoulda been just liquid. Sleep was a much needed remedy.</p><p>Overall review: dont do this. The taste alone will keep me away from rue forever. It is not worth the taste at all. I must say that I WISH I ate only breads and grains that day for proper fasting and food intake, however, that did not have anything to do with the bitter throw up taste of the tea, and with the idea of the taste in my head, I know I'd throw up sometime during the trip anyway. I also should have stayed in my house and not bothered with those 2 assholes, cuz they fucked my shit up big time. Im glad this was a body high and not a serious mental trip cuz if it was I might be a little psychotic right now. If done correctly, this should have created a very relaxing and beautiful mental meditation journey.</p><p>Wrap up: amanitas are not a strong hallucinogen and syrian rue is a physical distorter. This was a body trip with slight visuals. It would have been more mental if I did it correctly. However, since it wasnt strong at all, and I threw up about 20 fucking times, I will not be eating amanitas again, and rue will never enter my prescence for the rest of my life.</p>",
 "year": "2004",
 "id": "30813",
 "gender": "Male",
 "timestamp": "2005-08-26T07:00:00.000Z",
 "views": "8937",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:45",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": " T+ 2:30",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
