{
 "title": "I Live In a Dream",
 "author": "Mr. Bullfrog",
 "citation": " Mr. Bullfrog. \"I Live In a Dream: experience with Cannabis (ID 30811)\". Erowid.org. Jun 24, 2007. erowid.org/exp/30811",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cannabis",
  "(daily)"
 ],
 "report": "<p>I am a daily pot smoker, and addicted to marijuana. Marijuana has been my passion for many years, and I have delved deep into the Canadian Cannabis culture. I have been a regular attendant of the Cannabis Cup in Amsterdam, and Ive always prided myself in being able to get systematically higher then any of my peers through my choice of exactly what to smoke and when. I enjoy Cannabis more than anything else in my life.</p><p>A mere hobby? That may be how it began, but please read on.</p><p>I started smoking in high school, with the other kids. It was a lot of fun, and my friends and I would get high and then go to the park or go to class and goof off. We did great in school though. Casual use worked out perfectly, and seemed to enrich our otherwise boring and rather average lives. In my final year everything changed for me however, and casual use turned into more frequent use, and then daily use. I suffered from a psychotic break that may or may not have been related to my Cannabis use. It was not until a year later that I sought treatment for my rather serious psychiatric symptoms and started a treatment regime with included doctor guided use of medications. In the meantime however, Cannabis seemed to keep my world together. It was the only thing that would lift me out of my intense depression and provide some sense of self-image. I knew who I was when I was smoking pot, and I knew who I wanted to be.. I wanted to be me smoking pot as much as possible.</p><p>It is many years and many different types of anti-depressants later, and all the same still applies. Marijuana is still my best anti-depressant, and I still define myself best as a pot smoker. My habit has led me to surround myself with other habitual pot smokers, and to build my entire world around getting high. The places I live, the jobs I keep, the music I listen to, and the people I meet are all influenced by my bitter-sweet love affair with the herb.</p><p>At face value, many people reading this may think that this sounds like heaven, apart from the mental illness. Smoking some of the best pot in the world, being able to smoke relatively freely, and living the classic life of the bohemian whos able to think and act as he chooses. But there is a dark side to this colourful and euphoric land of self-indulgence. When the come-down comes, depression hits hard and fast, making it a short matter of time before I have to think about my options for my next smoke. And Im not just depressed because Im naturally prone to it. Im depressed because Im constantly unemployed, and too stoned to go out and look for anything meaningful and fulfilling. Im depressed because my love-life is always secondary to my love for Mary Jane. Im depressed because I live in a filthy flat which Im too high to ever clean, to ever adequately illuminate, or to leave for something new. Im frozen in time. Im a sketched-out mess; constantly confused and unable to remember simple details and matters relating to short term memory. What I do remember is often inaccurate and sometimes never happened at all. I live in a dream. Social relationships are almost impossibility, and the drug that many equate with peace and love has brought only paranoia and selfishness into my relationships with other regular pot smokers.</p><p>This is my reality as a heavy smoker. Its not what I expected it to be. I look at myself now and Im shocked to see the strung-out mess that Ive become. The worst part is that Ive lost the respect of my closest friends and family. As an addict, Ive very deliberately shielded myself from their worries and their support. I dont know where Im going to go from here. I simply cant stop smoking. Ive tried again and again to quit, and every time Im lured back.</p><p>I look around at my friends, mostly failing musicians and poets, and like me they are frozen in time; unable and unmotivated to improve upon their situation. They claim that habitual use is not an addiction but a lifestyle choice. I say that any drug that is used seven days of the week year upon year is more than a lifestyle choice.</p>",
 "year": "2003",
 "id": "30811",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-24T07:00:00.000Z",
 "views": "14525",
 "dose": {}
}
