{
 "title": "Tablet Older Than Me, Better Than Expected",
 "author": "Shad",
 "citation": " Shad. \"Tablet Older Than Me, Better Than Expected: experience with Morphine (ID 30822)\". Erowid.org. Jul 22, 2005. erowid.org/exp/30822",
 "substance": "Morphine",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "16 mg",
  "IV",
  "Morphine",
  "(pill / tablet)"
 ],
 "report": "<p>The summer I turned 18 years old I had started into a great deal of trouble with opioids. I had received a lot of money as graduation presents that summer, and not being able to find anything better to spend my free cash on, I made an unconscious decision to become addicted to opioids, particularly the intravenous use of heroin, oxycontin, and dilaudids. After a long period of frequent (usually daily) use, I actually made the conscious decision this time to detox on my own and quit being a junky and just be a chipper. Fortunately for me my detox didn't seem to have all the horrible withdrawals I kept hearing of other individuals' detox and the whole thing only lasted about a week.</p><p>This brings me to my most recent experience with a form of opiates I had never tried before. In February my family was cleaning out the house of my deceased grandfather in order to sell it. During the cleaning out of the attic, all the 'junk' was being thrown out of the third story window onto the ground below to be carried to a dumpster. Now me being the curious young adult I am, I investigated the 'junk' in hopes of finding some odd piece of whatever to save from the dumpster. As I was looking around the ground I noticed a small leather zippered pouch laying on the ground. Picking it up and unzipping it to investigate it further, the contents were revealed: two small glass syringes, several bent up needle hubs in varying gauges, and several vials of chemicals containing hypodermic tablets. I read the labels on them. One was scopolamine, another atropine, some nitroglycerin, some strychnine, and one more vial containing a solitary tablet. I turned the vial around to be able to read the label; 'MORPHINE SULFATE, U.S.P. 16 mg. (1/4 grain).' My heart nearly jumped out of my chest. I realized that this kit must have belonged to my great grandfather, a doctor around the time of World War 2. 'Damn' I thought. It must be nearly 60 years old. I might as well try it. The worst that could happen would be that the tablet was no longer active.</p><p>So I hurriedly put it in my pocket and awaited the trial of this tablet for when I got home. As soon as I got home, I jumped in my car, drove over to the drugstore, and picked myself up a bag of points. I set the tablet in a spoon around 7:30 PM, heated up some water in the microwave, and proceded to prepare the tablet for intravenous injection. At this point I hadn't used an opiate in nearly 2 months, so I really wasn't going to be too disappointed if I didn't catch a buzz off of it. But this was my chance! I at least would attempt to try this old school pure morphine, which I have never been able to find on the street, and was pretty certain mophine like this couldn't really be found on the street.</p><p>I stuck that spike into my vein, drew back the plunger, and then slowly pushed the plunger down until the syringe was empty. As I undid my turniquette, the next 10 seconds of anticipation were gnawing at me. And then suddenly, it hit me! I expected this to be similar to hydromorphone, but dilaudids were a DISTANT second to the rush I felt from this drug. What an orgasm! I mean what orgasms! It was like walking in brownshoes for the first time again! I couldn't believe that a pill probably three times my age could actually do this to me. As the rush subsided, I was presented with the most spectacular buzz I'd ever felt from an opiate. More intense at least than any other buzz I'd felt, but that wasn't the best part. This buzz did not lose any of it's oomph till I eventually couldn't keep my eyes open anymore at 2 AM. That's right. This 60 year old pill gave me the most kickass buzz I ever had that lasted nearly seven hours.</p><p>Unfortunately I'm a little disappointed. Not with the drug of course, but what are the chances of this drug ever just falling into my hands again?</p>",
 "year": "2004",
 "id": "30822",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-22T07:00:00.000Z",
 "views": "37254",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "16 mg",
   "administration": "IV",
   "substance": "Morphine",
   "form": "(pill / tablet)"
  }
 }
}
