{
 "id": 3088,
 "title": "Wild Imagination and Dead Memory",
 "date": {
  "submission": "2005-04-26T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blazed",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill / tablet"
  },
  {
   "time": "1:00",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": "3:00",
   "amount": "7 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:00",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "According to the time-a.nist.gov Internet time, I swallowed the 3 pills (150mg) at 12:02am. I figured Id enjoy myself as much as possible before New Years begins. New Years to me means new drugs, more drugs and better drugs with better deals. This isnt a fact by any means, but one can hope for the best call me an optimist.",
  "12:14 Im flushing, but I dont know whether its from the pills, or its my reaction to drugs (psychological). Nonetheless, Im not experiencing anything important, so Ill stand by till the fun begins.",
  "12:49 I noticed slight dizziness. It wasnt overwhelming, but I could feel it. I couldnt get words out my thoughts melted together and broke apart. I couldnt think the way I wanted to. I wasnt as sharp as I wanted to be. I couldnt control my thought-to-word processing mechanisms.",
  "12:59 Walking is becoming problematic. Its not like I cant keep balance, but it seems as if I cant maintain a proper forward/backward posture while moving forward, so this disturbs the experience of walking. I dont think it was tunnel vision, but is seemed like it as I walked down to the basement through a narrower hallway.",
  "1:01 Thinking is becoming problematic. Things are getting interesting. Lets celebrate with a cigarette (nicotine).",
  "1:06 Im beginning to understand another effect of this drug Im more likely to be agitated. Where is the loathing coming from? I know thats its coming from the inside, but whats causing it? Im more relaxed, so it doesnt make any sense. It seems to be tinkering with my mood like a dose of Percocet.",
  "Walked away from the computer to smoke a cig outside. Around 1:10, I realized that my memory was clouded. Nothing major, just a nuisance when I wanted to remember something that happened 20 minutes ago.",
  "Once I lit up the cig, I was happy to find out that the taste of the tobacco remained the same, seeing as how hydrocodone and oxycodone tend to lessen the flavor and enjoyment of the cancer stick chemicals. [1:17, I stared off into space and enjoyed it for the first time.] 1:18, my imagination has begun to spin and wonder around, which makes me believe that this would be a good drug to visit the museum on of course, it wouldnt compare to what LSD would do in that setting.",
  "In fact, tramadol has actually made the cigs taste better. Either that or I simply enjoyed standing outside in the cold alone because that was entertaining enough. Now that I think about it, I really didnt want to walk back inside. I was having a good time looking into the darkness of the night.",
  "This is a good drug. What makes it really good is the fact that the imagination gets to run wild, while I'm in a physically serene state and weaker (more like cant get the jar open, not sleepy) condition. Even if the imagination comes down to a lower level temporarily due to factors which contribute to involving entertainment like music (I  move to it... I feel the beat, the flow, the art pounding on my eardrums), its still a pleasant experience.",
  "2:20 I feel like Im wasting the experience by sitting and listening to music. Id rather do something I think Id do 250mg next time. This (150) is still nothing of a dose. Its a lot better than the 50, but also could be a lot better weed seems to improve every drug hint, hint.",
  "3:05 TOS (Time of smoke)",
  "(The next of this report was typed the day after from the notes I took while being under the influence. I wasnt able to write much more after smoking the weed. Ill mark the end of this sober writing by /End.)",
  "I took about 7 hits (I dont know for sure, I was too fucked up to remember what was going on it is probably very close to that number) each hit significantly increased my tramadol high, which took me by surprise. It was like I didnt have any tolerance for weed all of a sudden. I felt like if I had taken more hits, Id shut down all of my mental functions; the experience would be ruined because I would end up coming back inside the house, and Id go right to sleep. (The taste and smell of the weed, which was very strong, reminded me of the high-quality weed I have smoked in the past. It was a nice moment of dj vu.)",
  "Once I got high, I realized that I wasnt thinking more/faster. I wrote, Same level of thought processes, but the mind works to grasp the speed of thoughts at a slower level. You cant grab and hold on to too much at all. My imagination seemed to have elevated as well, but it only seemed like that to me because I was dumbed down by the painkillers. All in all, it seemed that my mind was working like I was sober, but my brain wasnt recording everything into memory.",
  "After the few hits from the bowl, I smoked a cigarette and continued to stand outside. At one point, dizziness kicked in for a total of one second. It looked like a visual rotation to the left, like I was on a boat on water.",
  "This is one of the most beautiful mental conditions I ever went through. It doesnt beat x, but it comes very, very, very close.",
  "My thoughts continued to be bungled up and mixed like something in a blender.",
  "Ages seemed like seconds. Time for me has reminded the same, while earth time sped up (thats what it felt like). This goes back to what I said about my memory. It became dead, so I started living in the moment (like a fish). Whatever I was doing seemed like I have been doing for a very long time; however at the same time, earth time was passing by me very quickly. I wrote, More is happening around me than I can understand.",
  "Past that, I let my mind wonder and I started to think about cigarettes, since I was smoking at the time. I thought about how I quit twice in the past, but I continue to smoke still. I came to a conclusion I love smoking cigarettes. Thats the problem with the addiction. How can you deny love knowing that its legal and comes in a pack of 20?",
  "I cant remember. Im numb to the cold of the glass on a cold winter night. Unspeakable joy (not love) and inner excitement. (Obviously, I couldnt physically express it. I could hardly move.) Thats the opposite of x. I feel love, and I'm able to express it. Still, Id compare tramadol in combination with weed to it. Its on par with that great feeling.",
  "I feel more fucked up outside than when Im inside. Inside, being the familiar environment where I swallow most of my pills and sniff most of my powders, I seem to have a higher tolerance, so Im better able to deal with the drug effects.",
  "Once I walked back inside, I experienced extreme at times dizziness, which in turn made me nauseous, as did the warmness from the heater. Apparently, the temperature change from the cold to the warm was too great to deal with; hence, the nausea was heightened enough for me to be uncomfortable.",
  "Disorientation. Imagination: crazy. I cant stop writing. Im out of control. My heart is racing, but I feel like passing out. I couldnt stop even if I wanted to, so Ill keep writing. This type of writing is like freestyle. Things keep popping in, so I write them. Haha Im loving it. I love this.",
  "Music, any kind, was beautiful. Beautiful is a strong and all-encompassing general beauty (internal + external + spiritual), and Im using it to describe the high and the music. X is beautiful too, but its a different kind of beauty. Its like picking which parent you love more. (If youre thinking which parent youd compare these two drugs to, x would be the mom and tramadol would be the dad.)",
  "Im physically dead, but my imagination is breaking barriers of light.",
  "/End.",
  "3:49 My eyes keep crossing if I stop moving them. Memory: dead. Inside: dead. Dead. Dead. Im not numb like last time, but",
  "[I actually didnt get to finish what I meant to type here. Its obvious that I was too messed up.]",
  "3:55 Numbness kicked in for a good few seconds maybe 10-15. I enjoyed it. My legs felt like the conscious ability of cutting off was occurring without my intervention. (I chose to use cutting off to describe the ability that is most consciously noticeable and controllable in bed at night when I am falling asleep. I realize I can force a muscle reaction that makes me feel like my blood is rushing up my legs, because I've cut off circulation like I'm making my legs numb from my knee to my feet, which could possibly tingle if I hold the muscle squeeze for a longer period of time.)",
  "4:03 My body (skin) is itching, and scratching feels nice as well (hell).",
  "4:25 Id say that weed is an enhancer, if ever asked whether weed is a drug or an herb. If asked whether I was a crackhead, I'd say, 'I'm a drug-head... name a drug, and I'd do it. I dont limit myself to crack.'",
  "4:40 The last cigarette I smoked brought back some dizziness, slight nausea; and finally, imbalance hit. Now I feel like I need to pass out. Its that time. Im so fucked up that staying awake is a challenge; so therefore, its unnecessary and unpleasant.",
  "4:50",
  "With love,",
  "Blazed."
 ],
 "erowid": {
  "id": "20048",
  "citation": " Blazed. \"Wild Imagination and Dead Memory: experience with Tramadol & Cannabis (ID 20048)\". Erowid.org. Apr 26, 2005. erowid.org/exp/20048",
  "substance": "Tramadol & Cannabis",
  "views": "51761"
 }
}
