{
 "title": "I Thought I Was Dying",
 "author": "tripper",
 "citation": " tripper. \"I Thought I Was Dying: experience with H.B. Woodrose (ID 30895)\". Erowid.org. Mar 8, 2004. erowid.org/exp/30895",
 "substance": "H.B. Woodrose",
 "bodyweight": "60 kg",
 "header": [
  "DOSE:",
  "8 seeds",
  "oral",
  "H.B. Woodrose",
  "(seeds)"
 ],
 "report": "<p>I ordered the woodrose seeds from the internet and received 10 from azarius. On friday-evening I decided to take 8. I grinded them and soaked them in water for 1 1/2 hour... and then I drunk the acid...(6:30pm). Rather quickly I started to feel the effects... My hart seemed to beat faster and faster and I felt terrible cold. About 8:30pm I started to be very anxious about my health... I thought my heart-rate would kill me. I called anti-poison-centre who calmed me but adviced me to let check my heart-rate by doctor or hospital. I called a doctor at service. To my surprize he wasnt very helpfull at all. He didnt know the substance he said but he would come and pass by... I was having visuals now (moving shadows and disturbance of lines).. The doctor still wasnt there and I got even more anxious... I went out and went to emergency - I even took my gsm with me in case I passed out and could dial 911- ...</p><p>10:00pm I am in front of emergency but I hesitate to go in because my job is related to the hospital. And I thought if in go my collegues and boss will know later about my bad habits ... So I doubted - Sit there at entrance ... Which seemed the best - because if a dropped dead there they find me quickly (I already had dialed 911 on my gsm now)... anxiousness increased and I was measureing out 'do you want to live or do you want to die?' The rest of my life seemed to interesting and promising after all. The shame of being know as a druggie was worth to live on - even if I would lose my job - and I went in. The paramedics werent very friendly... then a doctor came... I was very ashamed. She took me heartbate and blood-pressure. It was ok she said. My heart would not collapse. That moment I was so fulled of joy that I embraced the doctor. I was very glad I was not going to waste...</p><p>She said I was having a severe panic-attack and gave me some diazepam to calm down. I cannot describe in words the joy I felt! I thanked the doctor... being ashamed and went home joyfully... hour before I thought going to die and now I could live further on... I was very very glad I had this experience. I definitely chosen live now. No more drugs. I was so glad that I lived on that possible consequences on my job seemed only details. I will change my lifestyle now.  This experience changed my life.</p>",
 "year": "2003",
 "id": "30895",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-03-08T08:00:00.000Z",
 "views": "7732",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 }
}
