{
 "title": "By Jove, We've Found the Perma Nitrous!",
 "author": "Green Giant",
 "citation": " Green Giant. \"By Jove, We've Found the Perma Nitrous!: experience with 5-MeO-DiPT (ID 3091)\". Erowid.org. Oct 10, 2000. erowid.org/exp/3091",
 "substance": "5-MeO-DiPT",
 "bodyweight": "160 lb",
 "report": "<p>For our fox experience we joined a group of friends and went to the beach to a small party. The music for the evening was called 'psychedelic trance'. We placed approximately 12 mg in capsules that had previously contained yohimbe that we had emptied out.</p><p>At around midnight 5 of us dropped 12 mg of 5-MeO-DiPT.</p><p>T=45min.</p><p>We all started to feel the tingly sensations of an ecstasy like body high. Slight visuals consisting of colored patterns similar to psilocybin visuals. We all felt slightly anxious so we decided to leave the party and walk down toward the beach. One friend of mine reported feeling some muscle and back tenseness. Several of us noticed slight problems with balance and coordination, as we stumbled merrily down to the beach. Mood was normal; not overly ecstatic and not down or mindtripped.</p><p>T=1.5 hrs.</p><p>We got down to the beach and began to notice more visual hallucinations. There was a collection of wood pilings lined up along the beach, and I was uncertain whether some of them were actually people and not logs. At closer examination, we discovered they were just logs, but they continued to move. We sat down on the beach and smoked a bowl. A couple of us were sort of tired and just wanted to sit down and rest. I was bubbly and pretty energetic and kept hopping and stumbling around the crew, giggling occasionally and pointing out various wierdnesses I was seeing. We smoked some marijuana. We had a lengthy conversation about penises that migrated into other topics and then just kept coming back to penises. I was starting to experience lots of auditory hallucinations. A plane flew overhead and I couldn't recognize where the sound was coming from or what it was. A friend told me it was a plane..</p><p>T=2hrs.</p><p>I was getting antsy along with a couple of my other friends and we decided to hike back up to the party. It was a steep walk and either the foxy winded us or we were just out of shape. I work out about 3-4 times a week pretty intensely and I felt tired on the 1 mile + hike back to the party. At one time when we were resting I fell over onto some iceplant on the side of the hill. At this point everywhere I looked intricate patterns overtook the ground and hillside. The best way I can describe them is that I saw groupings of colored pixels making various geometric shapes. The visuals were similar to those experienced when using nitrous. My Mood was giddy and light.</p><p>T=3hrs.</p><p>We took another 12mg capsule and smoked some more weed. Everyone sat back down on the blanket but I really wanted to go dance. I figured that getting up and moving would enhance my buzz and keep my mood up. I tried to coax my companions to join me and dancing, but I wasn't feeling very communicative at all. I was kind of hoping that foxy would allow me to be a bit more expressive than other psychedelics but I was unable to converse very coherently at this point. I went up in front of the turntables and started to dance. At first it was difficult to dance because my balance was effected but eventually I just let myself go half-danced/stumbled around. I was dancing between two fire-dancers and a giant green laser. I found it quite fun to dip my head up and down looking from the ground to the laser rapidly. At this point I started staring at the DJ who I suddenly found to be very attractive. I watched with enthusiasm as he dropped a very sick record, raised his hands and stepped back. The dancefloor went wild.</p><p>T=4hrs</p><p>My boyfriend complained that has back was feeling stiff and he wanted to go to the car and get some advil. I walked up the hill with him suddenly seeing more visuals since I was away from the center of the party again. When I wasn't focusing on a region of lights, fire-dancers, lasers etc., I tended to see more patterns on the ground. As we were walking up the hill to the cars, we heard a loud coughing sound and it took as about 5 minutes to determine whether it was a human coughing in the bushes or a horse. It was a horse, or a very fat human coughing. We debated whether we should go over and make sure the horse wasn't choking, but it stopped and we were scared to wander into someone's property while we were tripped cookies. As we were walking I felt a nitrous oxide sensation whenever I focused on a single spot in my field of vision and let my eyes go out of focus. The multi-colored pixels in my vision would increse in size and flash, like a nitrous climax. I had this sensation several times, especially when I crossed my eyes and let them go out of focus around my nose.</p><p>T=5hrs.</p><p>We made it to the car but were exhausted. We decided to sit in the car smoke some cigs and listen to music. My boyfriend was more tired than I was. I was antsy and couldn't sit still in the car, I wanted to get going. My back and muscles were starting to get a little tense as well so I took some advil. By the time we got back down the hill all of our friends were packed up and wanted to leave. I felt like I was floating down the hill on an escalator on the way down. I was able to hear every echo of the music off the mountainside.</p><p>T=7hrs</p><p>We dropped our friends off and then went home. I tried to sleep for most of the night but sort of ended up in a half-conscious daze. My boyfriend fell asleep almost right away.</p><p>The following day we got up (even tho I felt like I really didn't sleep) and smoked a bowl. After smoking, I felt almost all of the effects come back to me. I felt quite strange for the rest of the night until I finally fell asleep. I was a little bit bummed out and exhausted but I wouldn't say it was a particularly harsh come down.</p><p>My favorite quote from the evening:</p><p>'By Jove, we've found the perma nitrous!'</p>",
 "year": "2000",
 "id": "3091",
 "gender": "Male",
 "timestamp": "2000-10-10T07:00:00.000Z",
 "views": "5887",
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  },
  {
   "time": " T+ 3:00",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  }
 ]
}
