{
 "title": "A Nice Tea",
 "author": "Goatee0092",
 "citation": " Goatee0092. \"A Nice Tea: experience with Kratom (dried leaves) (ID 30918)\". Erowid.org. Mar 18, 2004. erowid.org/exp/30918",
 "substance": "Kratom (dried leaves)",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "6.0 g",
  "oral",
  "Kratom",
  "(dried)"
 ],
 "report": "<p>The other night, after unsuccessful attempts to get high off of my mail-ordered kratom, I decided to dump the rest of the dried foliage in a pot and brew some tea.  I boiled it for a few minutes, then let it sit for another ten.  The liquid turned a nice burgundy red, and tasted just fine (like Damiana tea).</p><p>Several minutes later, sitting at the computer, I noticed the effects come on.  The high lasted about half an hour, but felt beautiful-- like a mid-range dose of codeine.  Nice warmth and calmness like you'd expect from a plant with opium-like properties.</p><p>People have talked trash about kratom, but what they don't understand is that the dried foliage is often thrown out after a few days by those who have local access to it, considered bunk by then.  It is a considerably weak product when dried, stockpiled, and shipped across the globe... but it's still an active plant.  To truly enjoy it, however, you have to live in Thailand (or wherever it might be grown and harvested) and get the fresh stuff.</p><p>In conclusion, I'm thrilled that I could enjoy this exotic and legal (at least in the U.S.) substance, but ordering kratom off the internet isn't economically sound if you're trying to get the most bang for your buck.</p><p>I also have ordered some 'fake kratom' a.k.a. 'mellow gold.'  It has been described as having kratom-like properties, but who knows?  I smoked some and got no effects, but the same thing happened with kratom.  Maybe I just need to make some fake kratom tea.  We'll see how that goes.</p>",
 "year": "2003",
 "id": "30918",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-03-18T08:00:00.000Z",
 "views": "8726",
 "dose": {}
}
