{
 "title": "The Wonders of Meth",
 "author": "Garrett",
 "citation": " Garrett. \"The Wonders of Meth: experience with Methamphetamine & Cannabis (ID 30930)\". Erowid.org. Feb 20, 2004. erowid.org/exp/30930",
 "substance": "Methamphetamine & Cannabis",
 "bodyweight": "137 lb",
 "report": [
  "<p>The night began by smoking a bowl of weed with a fellow stoner in the middle of a field.  Some few hours later, the same friend was driving myself and our third partner in crime to my house.  Near the middle of the ride, I was asked if I would do crystal meth.  At first, I was unsure but after they told me they were both on it, I agreed.  Near 11:45p.m. we smoked one or two more bowls of pot, then began to smoke meth out of a lightbulb.  The ammount was 1/4 of a gram, between three people under 180lbs.  The effect of the weed soon had affect on me and I felt quite stoned and tired.",
  "As I began to lay down, I finnally got a nice hit out the lightbulb.  It was like a waterhose and sprayed me down.  I was no longer tired at all, I felt as if I could have ran for hours.  We stayed awake until near 5 in the morning, and smoked another bowl of pot in the middle of that.  The combination was amazing.  Stoned but without the fatigue.  It is very hard to explain the effect of meth, but it is like just waking up from a long sleep, and feeling like your full of energy.  The next morning, I was tired but did not feel hungover like I usally do.  The drug hardly gave me a 'narcotic' feeling that I usually get the day after I smoke alot of weed.  The combination was great, once again, but due to the health risks of meth, I'm afraid I will never do it again.</p>"
 ],
 "year": "2003",
 "id": "30930",
 "gender": "Male",
 "views": "55416",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 2:00",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Methamphetamine"
  },
  {
   "time": " T+ 2:00",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "submissionDate": "2004-02-20T08:00:00.000Z"
}
