{
 "title": "Niagra Falls",
 "author": "Sister Moon",
 "citation": " Sister Moon. \"Niagra Falls: experience with Salvia divinorum (10x extract) (ID 30938)\". Erowid.org. Feb 28, 2007. erowid.org/exp/30938",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "208 lb",
 "report": [
  "<p>I am still having trouble integrating what I experienced last evening but it definately was a huge adventure.  ",
  "I am a 41 year old woman with 2 grown kids and a generally regular professional and family life.  I have always been interested in mind expansion, alternative realities, and the ways in which natural chemicals both self induced and plant induced change perceptions.  My previous excursions into alternative realities or assemblage point shifting have been through reading, excersize, pain/pleasure play, MJ, majick ritual, a few rounds with fungus and the most useful to date, (that is until yesterday) moderately frequent encounters with lucid dreaming during regular nights sleep. ",
  "I noted years ago that white sage had an interesting effect on my perception, although didnt seem to effect anyone else.  It is always calming and mellow.  I had read periodically about about Salvia divornum and had done some research periodically about it from the various websites, my curiousity was piqued and wondered about other Sage species. From the first time I heard about it till we met face to face at least 7 years have elasped.",
  "I have grown several different sages and many mints for home grown teas and I looked for Salvia to grow in my garden with no luck.  I noted the leaves and extracts being sold online and being sceptical I didnt send away, figured it might just be like smoking catnip or something. (Damn do I have to eat those words or what?)",
  "Being a curious scientifically minded sort I finally decided that when Salvia crossed my path I would not pass up the opportunity to check it out. ",
  "So I am at a small gathering last night with my husband and several of the people I know and a few of them I dont but everyones cool.  A little champagne, a little herbage, its all good.  Someone mentions they are going to do Salvia so my ears perk up right away.  I listen to the others as they smoke it, watch their reactions.  Seems like no big deal.  One guy complaining that he just doesnt get off on this.  I chatted with a few people, they said it was alot like fungi with a bunch of body rush at the beginning and maybe some color and visuals if your lucky.  So when it is offered to me I, in keeping with my previous promise to myself, say yep Im there.   I smoked with another guy, 2 deep draws of smoke for each of us.  The colors in the room started sliding around and then the room ceased to exist.",
  "Nothing can really capture the incredible awesome terror and beauty of what I perceived to be my becoming the eternal edge of a roaring flow of energy in vibrant neon colors.  The only way I can discribe it is to compare it to the edge of Niagra Falls, exactly where the water goes over the precipice, the energy, the velocity, the Roar!!!!  But all in the most vibrant color imaginable.",
  "At first I struggled not to get swept over the edge then I realized that I was the edge.  I wasnt getting pulled over the edge, that this core of universe was the truth of existance and that my usual reality was fast disappearing from my permanent memory!  Holy Shit!  The real problem here was not getting sucked over the edge!  The real problem was not being able to get back to my real world, which was in fact not at all my real world and never had been.",
  "This exisitance, this energy, here at the Roar of universe, this is how all eternity *is*, this is my place as the edge of the cosmic waterfall.  Thoughts of awe as I started to realize I would have to learn how to exist with this reality and I wondered how long I could handle this amount of energy.  And what was it that had happened, how the fuck had I gotten here?  I was completely completely completely fucking Awestruck and Terrified!  I started to panic and got frantic about getting back to what was real but I couldnt remember what was real anymore.  I couldnt grasp even one memory and I started screaming for help.  I yelled and yelled Help Me someone help me!  It seemed like an eternity till I caught my first glimpse of my husbands face and I gave everything I had to try to tell him what was happening but I kept getting sucked back to the edge where his face would fade, this went on over and over another friend was there too her face popping in and out.",
  "I am not really sure how long the hollaring went on but I knew I kept telling him the problem wasnt with my body, it was with my mind.  It sure seemed like an eternity to get back to the room that I had left.  I was pretty darn disassociated when I returned and it took me about an hour to believe that I was really back and that people were real or ever had been real.  I had to touch people and look them in the eye and tell them they were real.  I felt trippy for a lot longer than I was expecting, very nearly 14 hours although the really intense stuff lasted 15 mins or less.  After the first 45 minutes the effects were rather pleasing and somewhat sensuous.  I do not in anyway regret this experience, it was incredible and I have learned a huge amount from it already.  But I dont think I have ever been shaken so completely to the depths of my being.",
  "But I hadnt read enough about this herb.  I didnt understand its potential, and",
  "maybe I couldnt without doing it.  My husband had no previous knowledge about Salvia and when I started screaming and hollaring for help on the inside I was pretty loud on the outside!  The panic I was feeling inside was a full fledged freak out from the point of view of the others at the party.  I scared my husband very badly which I am",
  "sorry for.  I am a very strong woman and I pinned a my good girlfriend to a wall, she was darn afraid that I was going to physically harm her.  None of these folks who had used this before had seen this kind of reaction before.  I have always been considered very stable, very balanced, very gentle person and that was just about the closest I ever care to come to loosing my mind.  We were all pretty surprised with the outcome.",
  "I would have rather I read more in advance, had a good guide and done this in a quieter setting.  I would caution first time users from smoking extract.  Treat  sister Salvia with respect, expect the unexpected.  Or arrive with no expectations at all.</p>"
 ],
 "year": "2003",
 "id": "30938",
 "gender": "Female",
 "views": "4005",
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "submissionDate": "2007-02-28T08:00:00.000Z"
}
