{
 "title": "Bad Memories",
 "author": "N/A",
 "citation": " N/A. \"Bad Memories: experience with MDMA (Ecstasy) (ID 31003)\". Erowid.org. Jul 20, 2006. erowid.org/exp/31003",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "70 kg",
 "report": "<p>I cant write very posh or anything but I think that I have a few very valid points that hopefully will help people to not take ecstasy.</p><p>I am 15 years of age and I had my first E when I was early 14. Straight away I started having it all the time, every week I would have at least 2 tablets. I would listen to peoples advice about ecstasy and ignore it if it was against taking it. I would listen to my friends advice about it being very good but that you have to be careful.</p><p>after I stopped taking it every week, I realised that I had started to crack up. I had started to feel like I didnt know myself anymore, that I had changed and ecstasy had taken over me. I felt as if I was a different person, I would have mad days or moments where I felt more confident and happy, but really I was very depressed, at night I would feel depressed for absolutely no reason. I then calmed down on them and I felt a significant difference, I felt much more like myself and started to realise the danger of pills. My parents have never taken drugs and I am pretty decent at school, however since I started to take pills I couldn't concentrate on things as well, and I have got worse grades. The last E I had made me sure that I didnt want to take e anymore. it didnt feel as good as it used to, I didnt trip anymore. my comedown was unbareable so me and my friends decided that we would quit pills.</p><p>I am glad that I have quit them now and I feel completely back to normal now. all pills do is mess with who I am. they can change my personality, not just my body. when I think of my experiences I can hardly remember anything, from what I can remember I get a horrible feeling. it makes me feel like life is shit, basically. now though I am cleaner than ever and I only smoke cannabis and get pissed. in the end pills fuck my head up. by the way pills are shit without rave. At the end of all this I am glad I had the ecstasy experience, I am glad that I have now worked them out, I am bound to take a few more in my life but now that I am experienced they will hopefully have no negative effect on me. just be careful because ecstasy can be a lot worse than it seems. :)</p>",
 "year": "2003",
 "id": "31003",
 "gender": "Male",
 "timestamp": "2006-07-20T07:00:00.000Z",
 "views": "3734",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
