{
 "title": "Calamuasca",
 "author": "the joy luck club",
 "citation": " the joy luck club. \"Calamuasca: experience with Calamus, Caffeine & Syrian Rue (ID 31005)\". Erowid.org. Aug 30, 2004. erowid.org/exp/31005",
 "substance": "Calamus, Caffeine & Syrian Rue",
 "bodyweight": "180 lb",
 "report": "<p>calamus is a wonderful root.  you can chew it, make a tea of it, or smoke it.  it's just as psychotropic (if not more) than all these other alternatives to cannabis that are availble through internet merchants, yet, it's easly obtained from the corner herb store, and for much less than say, what you'd pay for dagga or kratom, or any other alternative way of getting high.</p><p>i've been chewing calamus for about a month.  I found that when chewing calamus after taking syrian rue, that the effects are much more pronounced.  the effects are similar to a dirty reg type high.  better than any dagga i've ever smoked. </p><p>I've also had the lsd effect after chewing calamus all day long.  the visuals were definately present, although, I was sick as a dog, and couldn't enjoy the trippy effects of the root.</p><p>I put a teaspoon of rue in a coffee bean grinder with a scoop of coffee.  brew the rue/coffee mix in an espresso machine...this totally obscures the horripilating taste of the rue, while doubling up the caffine buzz of the espresso.  then chew some calamus.  it takes a while for the effects to come on, but after an hour or two, they will definately come on.  it's like lubricating my work day with glee.</p>",
 "year": "2004",
 "id": "31005",
 "gender": "Male",
 "timestamp": "2004-08-30T07:00:00.000Z",
 "views": "15235",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(tea)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "buccal",
   "substance": "Calamus",
   "form": ""
  }
 }
}
