{
 "title": "I Don't Condone Oxycodone",
 "author": "Giger",
 "citation": " Giger. \"I Don't Condone Oxycodone: experience with Oxycodone, Beer and Cannabis (ID 31027)\". Erowid.org. Feb 20, 2004. erowid.org/exp/31027",
 "substance": "Oxycodone, Beer and Cannabis",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "oral",
  "Pharms - Oxycodone",
  "",
  "0.5 g",
  "smoked",
  "Cannabis",
  "",
  "1 cup",
  "oral",
  "Alcohol - Beer/Wine"
 ],
 "report": "<p>A friend of mine offered me a couple oxycodones for a reasonable price, and I was a little curious.  I'd considered trying oxycontin several weeks prior and decided not to, mainly because it involved taking a time release pill or crushing one, and I didn't want anything that strong. </p><p>The next afternoon, I ate a single 10 mg table (they said WATSON on them and then the 3-number code for watson 10 mg oxy, I looked it up before I ingested).  My reading on here led me to believe this would be a weak dose, and I almost took two.</p><p>After an hour I wasn't really feeling much at all, so I smoked a little.  This gave me a very mild body buzz, so I figured 'hell with it' and slammed a 12 oz molson.  That was probably a mistake.</p><p>Ten minutes later I was literally too wasted to do anything.  I decided to watch a TV show on my computer, and I felt pretty good until it ended, but then I didn't know what to do.  I'd go into the bathroom and look at how fucked up and swweaty I was and freak out, and then I'd sit back down on the couch and decide I felt wonderful. </p><p>And so for the next three hours, this sine wave existed, of flashing back and forth between feeling wonderful and feeling like absolute worthless junk.  I never felt physically ill, but when I closed my eyes everything got 'choppy', I would immediatly become unable to think about anything other than how wasted I was and how much I wished it would stop.  Then I'd 'sine wave' back up, and feel like it was a good feeling again, like a really really strong hydrocodone buzz.</p><p>What bothered me the most was that even though the experience was neutral at best and hellish at its worst, for the next week at least, every day I would consider taking another oxy, even though the logical part of my brain knew I wouldn't really enjoy it.  I understand how people can get hooked on this stuff, and that sounds, to me, like a fate worse than death, literally.  I still enjoy my vicodin here and there, but my advice to anyone is, don't mess with oxy in any form unless it's prescribed to you for a medical purpose, this is NOT a 'fun' drug.  I don't really know how much the single beer amplified the effects, but I don't really aim on ever finding out, either.</p>",
 "year": "2004",
 "id": "31027",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-20T08:00:00.000Z",
 "views": "38791",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone"
  },
  "1": {
   "time": "",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "2": {
   "time": "",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  }
 }
}
