{
 "title": "Hmmm ... The Higher Individual",
 "author": "P. Stowe",
 "citation": " P. Stowe. \"Hmmm ... The Higher Individual: experience with 2C-I (ID 31023)\". Erowid.org. Feb 22, 2008. erowid.org/exp/31023",
 "substance": "2C-I",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  "20 mg",
  "oral",
  "2C-I",
  "(powder / crystals)"
 ],
 "report": "<p>Got 2C-I. took 20 mg.  Ingested at roughly 1:00 in the afternoon.  This is my second expeirience with the chemical.  The first being rather disapointing, I decided that a second was in order to truly understand what was needed to be understood.</p><p>I would like to point out that I am a true phyconaut.  I bealive in the trip, but even more, I bealive in meditation.  2C-I is the strangest trip I have expirenced, not beacuse it is far out, but beacuse it is not far out.  Instead, it is far in.  Which is rather scary.</p><p>It took about an hour to begin to feel the effects.  Much like the mind set in a Mushroom or LSD expierence.  No prominate hallucinations, they will never show up. I knew I still had about an hour before the real effects set in.  I had eaten prior to ingestion.  I try not to notice physical effects when tripping, so I'm not going to delve to deep.  Rather than tripping out, it was more along the lines of thinking out.  Every thing was thought out, so it is comparible to tripping.  things were sped up a little, and I couldn't stop licking my lips.  I don't consider it a real trip.  A real trip is natural,(meaning Mushrooms, LSD, Peyote etc.).</p><p>4:00-I am at a high school basketball game.  for the past couple weeks I have been studying basketball games, and have decided that anybody can play good basketball if they stop being an individual, and start becoming part of the higher individual, which is the basketball team. </p><p>As I watch the players I start to notice their minds and their insecurities.  I realize that every individual on the court cannot become a part of the higher individual.  When I watch the players, the refs, and the coaches, I realize that every single one of them DOES have one uniform thought, but not the right one.  If that uniform thought was the team, and the game, the higher individual would be basketball.  Instead, the higher individual is the thought of being watched.  When I watched the way people moved on the court, I saw a shared thought, that shared thought was that all eyes were on the individual, rather than the higher individual.  very amusing.</p><p>This backs up my theory that all matter works together at all times.  The fact that every individual thought that all eyes were on him/her shows that the higher individual does exist, and that we, as individuals, misinterpreted the common knowledge, and did not think past our own private individual. </p><p>This may seem regurgetated from an acid trip.  I would like to make clear that although I bealive in the trip as a tool, I came upon the theorie of higher individual through meditation, not through the trip.  I bealive that before anybody puts any substance into their body for thought expansion, they need to have a sober idea of the world around them.  That way you can fully trust the thoughts that come from a trip.</p><p>7:00-I begin to realize how powerful the chemical is.  Not beacuse I am fucked up, but beacuse I have begun to talk to peoples thoughts.  I know it was real beacuse I told a sober person to flash his brights if he felt me.  He did.  He also did not have any recollection of what happened.  But he did seem a little disturbed.  This disturbed me greatly.  Maybe you don't bealive it, but I assure you that It happened.</p><p>9:00-disturbed about what happened.  I think maybe I'm just out of my fucking mind.  Off and on a shadow seemed to pass over my thoughts, I thought maybe 2C-I was the Devils equivalent to acid.  I wasn't scared, but I had to meditate to force the shadow from my brain.</p><p>I stop thinking about what happened and began to watch smoke rising from some chimneys down the street.  As I watch I begin to realize that the smoke is following a strange, chaotic pattern.  When the smoke first comes from the chimney, it is one.  It breaks apart, and wisps follow their own pathes.  The smaller wisps are instantly torn apart by the wind.  The larger wisps hold them selves together, and if you watch them, you see that there is almost an internal battle.  And rather than slowly breaking down, the larger wisps will hold together untill nature is too much.  Than the entire thing breaks apart.  Maybe all wisps constain life, although simple life.</p><p>thats it. Nothing else worth writing happened.  Re-read with an open mind. Re-read as the higher individual.</p>",
 "year": "2004",
 "id": "31023",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-22T08:00:00.000Z",
 "views": "2780",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 }
}
