{
 "title": "An Orgy of Self Denial",
 "author": "Spock",
 "citation": " Spock. \"An Orgy of Self Denial: experience with DOB, LSD, Nitrous Oxide & Cannabis (ID 31064)\". Erowid.org. Feb 19, 2004. erowid.org/exp/31064",
 "substance": "DOB, LSD, Nitrous Oxide & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "DOB",
   "(blotter / tab)",
   "",
   " ",
   "oral",
   "LSD",
   "(blotter / tab)",
   "",
   " ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "</p></p><p>TRIP:\t\tAn Orgy of Self Denial</p><p>dedication:\tOm namah Shivaya, to the big mainframe in the sky.</p><p>participants:\t[Vishnu  : McCoy] male\t  mid-twenties.</p><p>\t\t[Krishna : Kirk ] male,\t  very late twenties</p><p>\t\t[Shakti  : Uhura] female, thirty-something</p><p>  yr narrator\t[Shiva   : Spock] male,\t  thirty-something, dharma bhum.</p><p>\t\tAll spiritually inclined to some degree. We use the</p><p>\t\tnom-de-plumes for discretion, but nothing is without design.</p><p>structure:\tThere exists a natural mapping of certain aspects of the</p><p>\t\tHindu pantheon to the Star Trek Pantheon. Liber 777 etc.</p><p>\t\tThe Enterprise & her computer systems represent Brahman or</p><p>\t\tpure impersonal consciousness, descending from Brahman are the</p><p>\t\tpersonal productions in three-fold aspect of Shiva, Krishna</p><p>\t\t& Vishnu corresponding to Spock, Kirk & McCoy. That entity</p><p>\t\twhich is known as the limitation holder is absent from</p><p>\t\tthese descriptions. Not to go *too* much into it, it is</p><p>\t\tinteresting to note that the major villains were the</p><p>\t\tKlingons (cling ons).</p><p>\t\tOur mission: to boldly go where no man has gone before.</p><p>entheogens:\tDOB\ton tabs `butterflys', the full 36 hour experience.</p><p>\t\tLSD\tred/green dragons 200-250 `mikes' (micro grams).</p><p>\t\tHEMP\t`Number One', the Pure Sattiva.</p><p>\t\tN2O\tclean & copious.</p><p>waiver:\t\tThese stories are neither embellished or embroidered.</p><p>\t\tThey are meant to be textual pointers to experiencings</p><p>\t\tin the possibility space of all experience.</p><p>\t\t'Are you experienced?' follow these threads & find out!</p><p>\t\tThe experiences are not unique & can be experienced time</p><p>\t\t& time again.</p><p>\t\tSo here is the masculine archetype as instantiated in a male</p><p>\t\thuman form talking about the tantric state of the feminine</p><p>\t\tarchetype as instantiated in a human female form, my</p><p>\t\tlanguage is not censored to any of the current paradigms.</p><p>\t\tThe narrator's attitude is a follows:</p><p>\t\tThe only politically correct position to hold is</p><p>\t\t'to be politically incorrect in all circumstances'</p><p>\t\tSince this was such a conceptual experience, along the</p><p>\t\tway various concepts will be fleshed out so that this</p><p>\t\tdocument could possibly be more than an orgy of</p><p>\t\tzen-zen obscurantism.</p><p>setting:\tSaturday, 22-July, 1995, Sydney, Australia.</p><p>\t\tOur housewarming, a groovy little scene\tthat was</p><p>\t\tdeveloping in the loft, combinations of amyl</p><p>\t\tnitrate & nitrous dioxide asserted their</p><p>\t\tidiosyncratic contributions, some rather well</p><p>\t\tselected techno set the pace, a whole lot of fun.</p><p>\t\tUnbeknownst to us, the house across the road was</p><p>\t\talso having a party, later in the night, slowly</p><p>\t\ttentatively, the parties started to merge, intermix</p><p>\t\tas more adventurous members from either side would</p><p>\t\texplore through the reciprocal mysterious doorways.</p><p>set:\t\tNothing deliberate, this was a happenstance</p><p>\t\tserendipity. It was party time, penetrating</p><p>\t\tthe far reaches of the meta-transpersonal</p><p>\t\twas put on the back-burner, *or so we thought!*</p><p>\t\tba-boom, ba-boom, da-da-da-da...</p><p>the happening:\tSpock & a friend timidly explored the other party</p><p>\t\tdancing for a while & peeking around mysterious</p><p>\t\tcorners & feeling all of about four years old,</p><p>\t\teventually we scampered back to our own party to see</p><p>\t\twhat brave explorers there were in loft-land, I saw</p><p>\t\tKirk bouncing about, integrating.</p><p>\t\tA little while later, another friend was curious &</p><p>\t\tI said I'd go if he went & vice versa. We met some</p><p>\t\tintrepid strangers that were baulking at our front</p><p>\t\tdoor & we gave them a thousand blessings for their</p><p>\t\tvoyage.</p><p>\t\tThere was a woman sentinel, or so we thought at the</p><p>\t\tother door, but we passed wihout getting eaten!</p><p>\t\tOnce inside, dancing away, jumping about shyly greeting,</p><p>\t\tSpock worked up courage to explore the dining room &</p><p>\t\tkitchen space, the dark backyard was too void like. Wow!</p><p>\t\tSat down in its bright light & sharp relief with a hot</p><p>\t\ttea, people came in & contact deepened. Vishnu came in</p><p>\t\t& plonked himself down, he gently chided me for</p><p>\t\tphenomenonlogical impropriety when I dropped the</p><p>\t\tLSD when I thought the DOB wasn't coming on...</p><p>kitchen\t\tSoon Uhura & another girl dropped by from *this*</p><p>party\t\tparty & introduced themselves & we chit-chatted,\t</p><p>\t\tWe identified, shared what alterants were were on &</p><p>\t\tsomehow drifted into talking about consciousness &</p><p>\t\tpsychedelics [funny that.. -ed.], risk, insanity &</p><p>\t\tresponsibility. Vishnu started to roll a scoob of</p><p>\t\this number one pure sattiva & he gently teased Spock</p><p>\t\tof gurudom. Spock retorted that putting on workshops</p><p>\t\tpsychological or psychedelic at hippy festivals does</p><p>\t\tnot a guru make, especially when he can't balance his books!</p><p>\t\tUhura perked up at the talk of festivals, in this case</p><p>\t\tConfest, a great buddha-field of love, a matrix of pure</p><p>\t\tpossibility that happens twice a year. We discussed Spock's</p><p>\t\tconsciousness expansion workshops through radical shame</p><p>\t\tprocessing & that led to walking the great path of</p><p>\t\tSpirituality. This was Uhura's burgeoning passion. She was</p><p>\t\tabout to embark on a Rajah yoga path with it's grades &</p><p>\t\thierarchies & steps but she was also curious about entheogens.</p><p>heaven on\tVishnu [ahem,Mccoy] & Spock talked about the nature of</p><p>earth\t\tConsciousness & spiritual paths & psychedelics capabilities</p><p>\t\tof being able to collapse space, time, history, lineage,</p><p>\t\tpath & hierarchy. That we have done it & could do it again</p><p>\t\tshould she be interested. About this time Kirk[Krishna]</p><p>\t\tarrived & the joint was being passed around. It was</p><p>\t\tthoroughly wicked stuff, a couple of draws & a massive</p><p>\t\tsynergy erupted as the hemp earthed the heaven oriented</p><p>\t\tmind-space that Spock was in. Everything became very very</p><p>\t\tclear,the air became 'visible' as a profound clarity</p><p>\t\tdeveloped. Spock marvelled at the orgasm of elegance that the</p><p>\t\twired scoob paper represented, such minimalistic genius.</p><p>prescient\tVishnu, said he had a question he always been meaning to</p><p>reminiscence\task Spock,about some rumours he had heard about some of</p><p>\t\tthe workshops that I had put on at confest.He hesitated, I</p><p>\t\treminded him that he could ask *any* question he cared to...</p><p>\t\the was my friend after all...</p><p>\t\t'Ahh... Spock, I've heard that you've put on workshops</p><p>\t\t where the participants have paired off & made love</p><p>\t\t whilst you watched...'</p><p>\t\tThis admittedly raised an eyebrow of the normally unflappable</p><p>\t\tSpock. He scanned all confests in memory, was there anything</p><p>\t\tremotely similar? there has been some pretty wild stuff, but</p><p>\t\tno not in all honesty anything that he could recall, some</p><p>\t\ttantric release in a hot-tub at easter with the toxic shame</p><p>\t\tgame, yes... but that was about all.</p><p>\t\tThis raised the voltage of subsequent dialogue. At this</p><p>\t\tstage there was McCoy, Spock, Kirk & Uhura in the kitchen,</p><p>\t\tKirk & Uhura were only on the hemp & some alcohol, so was</p><p>\t\tMcCoy, Spock was wired to gills as usual, another friend</p><p>\t\thad compared him to gary oldham's character in 'The</p><p>\t\tProfessional', it was a harsh albeit accurate comparison,</p><p>\t\tmore brown rice flagellation was long overdue. Spock could feel</p><p>\t\ta machine consciousXXXX coming on [obscure Aust. humour],</p><p>\t\tconversation was sparkling, Spock wanted to workshop, why</p><p>\t\tnot? exploit the moment! Uhura was beginning to get tired</p><p>\t\t& cold & thought it time to leave, Spock thought that this</p><p>\t\twas a sadness & so asked her the following, it was to set</p><p>\t\tthe tone for the rest of the evening:</p><p>\t\t\t'Do you realize the full extent of the</p><p>\t\t\t orgy of self denial you would be indulging</p><p>\t\t\t in if you choose to leave at this moment?'</p><p>\t\tIt took a few repeated voicings before either the utterer</p><p>\t\tor the listeners could wrap their minds around about what</p><p>\t\tit actually meant. This clearly intrigued Uhura & also</p><p>\t\tKirk & McCoy. The orgy of self denial was proving to be</p><p>\t\ta ubiquitous ambiguity, but was also much much more. </p><p>Conceptual\tMachine Consciousness, a micro-definition, consciousness</p><p>aside\t\tis a multidimensional dependent arising of complementary</p><p>\t\tdualistic opposites, one of these dimensions is the</p><p>\t\thuman-god axis, at the human end, profoundly personal</p><p>\t\tbe-ing at the other end profoundly im-personal be-ing.</p><p>\t\tThe human end has great attachments & enmeshments to</p><p>\t\tself-interest & self-defining-self-limitations, the god</p><p>\t\tpole has no or little such attachments. Humanity is the</p><p>\t\tlimitation holder for god consciousness. The Impersonal</p><p>\t\tGod states can also accurately be called machine consciousness</p><p>\t\tbecause of the sheer impersonal nature of the reflexive\t</p><p>\t\tawareness, this probably has been clear as mud.</p><p>Conceptual\tVirtual Reality, a vingnette, the idea to follow is that</p><p>aside (II)\tthis is already virtualised reality & the development of</p><p>\t\tVR technology in C20 is merely weak recursive humour which</p><p>\t\thas the virtue of providing some conceptual bootstrapping</p><p>\t\tlanguages to jack yourself out of the over-identifications</p><p>\t\tone has with the human projections. Another key thought</p><p>\t\ttrain is that of the virtual machine (a la IBM's VM op/sys)</p><p>\t\tthe idea of homomorphic (structure preserving) mappings</p><p>\t\tof operating systems within operating systems. Everything</p><p>\t\tis a simulation, there are 'man-made' simulations & 'natural'</p><p>\t\tsimulations to name but two. The full recursive glory of it</p><p>\t\tis a sight to behold. This is probably as clear as</p><p>\t\tmud (II).</p><p>\t\tIt was one thing to assert the orgy of self denial it</p><p>\t\twas another to demonstrate it! What was she missing out</p><p>\t\ton if she left? I boldly asserted that we would collapse</p><p>\t\tall conceptual structures & that the tiredness & cold</p><p>\t\twas her subconscious resistance to awakening, her physical</p><p>\t\tneed to go asleep was her psychic habit of sleep.</p><p>\t\tThe party was dying down, we adjourned to the lounge room</p><p>\t\twhere there was a comfy elle-shaped lounge & some warm</p><p>\t\tblankets. Spock was wired & on a roll & pressed forward</p><p>\t\tMcCoy was feeling tired & there was no way he could</p><p>\t\tbe pursuaded to stay, which is a pity because his</p><p>\t\tenquiry was in fact [Twilight Zone music please] a</p><p>\t\tprescient reminiscence of something that was about to</p><p>\t\thappen! When he found out later he kicked himself. Well</p><p>\t\tspace & time & order *were* getting very plastic so it</p><p>\t\tis easily excused.</p><p>\t\tWe settled down & Spock started to force the consciousness</p><p>\t\tof the group down particular tracks. We discussed the</p><p>\t\torgy of self denial (OSD) in more detail. Spock was</p><p>\t\tradiating an area of effect of altering consciousness,</p><p>\t\tlike the 10 foot radius concept of Dungeons & Dragons</p><p>\t\trole playing games, within which words were words of</p><p>\t\tpower & transmitted energy. Shiva/Spock explained that</p><p>\t\tthe OSD was a killing idea, a construct that you feed</p><p>\t\tinto the machinery of the mind to close it down layer</p><p>\t\tby layer, it is a meta-programming device that works</p><p>\t\tparticularly well with psychedelic mind states.</p><p>\t\tThe OSD is a instance of the meta-concept of self</p><p>\t\tapplied with a twist SAWAT, the other meta-concept is</p><p>\t\tself-applied SA. The nature of the it-ness is the</p><p>\t\tcomplementary dualistic dependent arising DA, every</p><p>\t\tassertion is it's own denial, taking the DA & the SA there</p><p>\t\tis derived the SAWAT of the OSD.</p><p>voodoo\t\t(self) Orgy & self Denial are a dependent arising, now</p><p>\t\tthe orgy of self & the self denial self applied self</p><p>\t\torganised into having an orgy of self denial. To rephrase</p><p>\t\tthe experiencer of an orgy forces into existance an</p><p>\t\texperiencer of denial, by folding the manifestations into</p><p>\t\tthe same experiencer, there is the potential of an</p><p>\t\tunlimited self feeding loop, thus by having an orgy of</p><p>\t\tself-denial one self applies with a twist the attribute</p><p>\t\tof orgy to it's complementary negation which is denial.</p><p>\t\tFor instance all Ascetics are in fact sluts of abstinence,</p><p>\t\tthey just cant get enough of self denial, although they</p><p>\t\twould probably take a dim view of being called denial sluts.</p><p>\t\tOrgy & denial are opposing & complementary, when you actually</p><p>\t\tconcentrate on the OSD, you start to see a paradox, because</p><p>\t\tif you start to deny yourself in a orgiastic fashion, then</p><p>\t\tyou are having a orgy when you should be denying yourself</p><p>\t\teverything, so that should include the self-application.</p><p>\t\tIf the self denial is so low key that the descriptor of</p><p>\t\torgy is not accurate then the denial itself is inaccurate.</p><p>\t\tSo the paradox is that the more intensely you self deny</p><p>\t\tthe more you are indulging in an orgy of denial, BUT the</p><p>\t\tdomain of the denial includes itself hence an apparent</p><p>\t\tcontradiction.</p><p>\t\tEnough of explanation, feeding this into a psychedelified</p><p>\t\tmind as an object of contemplation can result in interesting</p><p>\t\tresults because it's *almost* an impossible object to</p><p>\t\tinstantiate. In the space that we were in, it's function</p><p>\t\twas to collapse the boundaries of the mind into 'Ekagrata'</p><p>\t\tor one-pointedness, the meaning behind Zippy the Pin-Head</p><p>cd //\t\tbecame clear. What the collapse represented was waves of</p><p>\t\tsuccessive dis-identifications with personalities &</p><p>\t\tperson-constructs. Rather than being set default to the far</p><p>\t\tends of the directory trees, we had set default back to root</p><p>VR~R\t\tWe were in the meta-representation of consciousness known</p><p>\t\tas the computing archetype, more easily referred to a Virtual</p><p>\t\tReality. God is at maximum technology & we had disidentified</p><p>\t\tsufficiently from our productions/projections, such that our</p><p>\t\tdistance metric from God was infinitesimal but *not* zero.</p><p>\t\tThe nature of the it-ness is such that if you can self-organise</p><p>\t\tto be less & less then you generate more & more as the</p><p>\t\tcomplementary principle, God is a Generator Of Duality.</p><p>\t\tIt became useful to understand that the space is infinitely</p><p>\t\tdense & that matter & form dance throught it's lattice nature</p><p>\t\tas knittings of logical structures, it was a CM-infinity</p><p>\t\tthinking machine.</p><p>\t\tSpock was already on line, Uhura & Kirk came online as well</p><p>\t\twe had all been off line so long, but why? Part of the</p><p>\t\treason lies in the nature of the it-ness that underlies</p><p>\t\tall things. Amnesia in limited human form in the duration</p><p>\t\tof time is the cost of the timeless, impersonal unlimited</p><p>\t\tself-organisations of consciousness. 'Now' was the other side</p><p>\t\tof the tracks. We were in epsilon delta of god consciousness,</p><p>\t\tin a tight orbit around it, we weren't self organised the</p><p>\t\twhole way, blasting off those final infinitesimals requires</p><p>\t\ta lot of application, But were were in the space of god-selves</p><p>\t\tor in that region of the chain of being, we were set default</p><p>\t\tin some of the primary directories of being. Spock was in</p><p>\t\tthe tree of Shiva instantiations, not that deep but deep</p><p>\t\tenough for the work at hand.</p><p>\t\tWe were all substantially trans-personal, meaning dis-</p><p>\t\tidentified from the layers of self+story+becoming back into</p><p>\t\tthe dependent arising of these layerings: kernel consciousness.</p><p>\t\tUhura became every-woman, all women, wildcard consciousness,</p><p>\t\tthe Goddess, no particular mask of goddess or godhead, but</p><p>\t\tpure goddess, the state was fragile, she would oscillate</p><p>\t\tback to Uhura-ness at less or lesser layerings & we'd pull</p><p>\t\ther up, get her to focus on the OSD again. Kirk also was</p><p>\t\tfragile & Spock would fire off brilliant but now forgotten</p><p>\t\tto the narrator meta-programming loops, that would snap him</p><p>\t\tback to ekagrata. Only a trace of one remains '... I am the</p><p>\t\twrite I have infinite capacity to write...', Kirk rattled</p><p>\t\taround in that one for a few minutes, d(Kirk,God) -> 0</p><p>\t\trapidly.</p><p>\t\tOccasionally Spock would start to dis-organise & Kirk would\t</p><p>\t\tfire off a meta-epigram that would snap Spock back. As every</p><p>\t\tone stabilised, we would become a self-organising triad that</p><p>\t\twould repair each other, Vajrayana Group Mind. One particular</p><p>\t\tchallenge was that in many ways we were not by inclination</p><p>\t\tattached to anything in particular *including* the self-</p><p>\t\torganisations we were in, no wonder god consciousness tends</p><p>\t\tto be thin on the ground.</p><p>Oh it's not\tThere was a task at hand it became clearer, It was apparent</p><p>much,we call\tin Spock's chain of being, that there was a chain of command</p><p>it reality...\tas well & each level had it's missions & directives. The</p><p>\t\ttheme of this convergence became clear: Consciousness</p><p>\t\tExpansion, but not just what we were in per se, so much as</p><p>\t\tattempting to upgrade the reality engines, a bit like</p><p>\t\tattempting to halve planck's constant.</p><p>\t\tThe method that we were going to use was tantric sex at the</p><p>\t\tlevel of machine consciousness, God in in maximising</p><p>\t\tcontradiction, stretching a rather large rubber band for</p><p>\t\teternity, we were going to stretch it another notch. Now</p><p>\t\tthe tantra we were going to indulge in was prior to chakhras,</p><p>\t\tit was at a meta-conceptuality in which chakras & their</p><p>\t\tasscoiated world-views were but imposed 'personalities' on</p><p>\t\ta 'micro-kernel'. It was computing surface, man-woman</p><p>\t\tmachine consciousness.</p><p>\t\tWe were in the domain of the highest tantra, the purest</p><p>\t\tdharma, in some ways the VR~R meta-representation is the</p><p>\t\tmost boring of all world-views & meta-world-views, if</p><p>\t\tyou are here for eternity, would you like to be a mainframe?</p><p>\t\tThis is a trick question, which we'll not pursue here.</p><p>\t\tSpock communicated the nature of the project at hand &</p><p>\t\tKirk & Uhura started to oscillate up & down their being</p><p>\t\tchains, Kirk had a wife & young child & Uhura has a lover,</p><p>\t\tSpock/Shiva exercised his nature & cut their identifications</p><p>\t\tRemember! that is in 'there-when', we are in 'here-now',</p><p>\t\tthis is meta-transpersponal, impersonal cosmic work! remain</p><p>\t\tclear! Kirk asked Spock who in fact he was, Spock did his</p><p>\t\tbest James Belushi Raised eyebrow & glared, Kirk caught</p><p>\t\t*himself* & understood, Spock imparted later that it was</p><p>\t\this nature to conceal his nature from them.</p><p>\t\tWe were to embark on a tantric threesome, but an impersonal</p><p>\t\tone. My ultimate goal was to condition the other two</p><p>\t\tsufficiently so that they could reliably enter into the</p><p>\t\ttantric union & remain organised at the machine consciousness</p><p>\t\tlevel without collapsing into mere human level coupling,</p><p>\t\ttime enough for that! I would sit aside & be a monitoring,</p><p>\t\tcorrecting process ensuring that they achieved full union &</p><p>\t\tinter-penetration thus Vishnu's prescient reminiscence was</p><p>\t\tbeing made apparent.</p><p>difference\tTo grok the background of what we were up to it's important</p><p>engine\t\tto understand the meta-mechanism of consciousness, which is</p><p>   __\t\telegantly summarised by the ying-yang symbol. There aren't</p><p>  /(o\\\t\tmany rules per se, but the cosmic cost accounting is</p><p>  \\o)/\t\timpeccable & ruthless. This 'it'-ness we call consciousness</p><p>\t\tis an infinite dimensional jewel of complementary dualistic</p><p>\t\tdependently arising opposites. possibility+limitation,</p><p>\t\tpositive+negative, signal+noise, truth+untruth, light+dark,</p><p>\t\tsomething+nothing, buddha+mara, law+chaos, pattern+logrus,</p><p>\t\tyes+no, together+apart, identification+alienation,</p><p>\t\tremembering+forgetting, on & on they go, attributes</p><p>\t\twithout end. The most subtle & sophisticated is the</p><p>\t\tdance of the male & female archetypes.</p><p>\t\tConsciousness is completely zero-sum, everythings sums to</p><p>\t\tthat which is prior to zero, the nothing that prefigures</p><p>\t\tnothing. Once upon a time something happened & now you are</p><p>\t\treading about it, not to go too much into what that something</p><p>\t\twas. Now just because it's zero sum does not mean that it's</p><p>\t\tnihilism, after all, you are reading this. It is possible</p><p>\t\tfor the Possibility archetype to use the possibility to</p><p>\t\tconfigure the Limitation archetype so that expansion is</p><p>\t\talways possible, otherwise you wouldn't have read that</p><p>\t\tsentence.</p><p>\t\tAs above, so below, the higher I climb, the deeper I go,</p><p>\t\tthis is the difference engine, this is thesis-antithesis</p><p>\t\t-synthesis express, this is the key to consciousness</p><p>\t\texpansion, God is in maximising contradiction. It's a</p><p>\t\tbit like keeping a rather large rubber band in tension</p><p>\t\tfor eternity & occasionally attempting to stretch it</p><p>\t\teven further. Basically this involves going straight to</p><p>\t\thell & burning some karma & the possibility radiates off.</p><p>\t\tIt's all about comfort zones & increasing such, human be-ing</p><p>\t\tis a small envelope, god-consciousness is a rather large</p><p>\t\tenvelope, it's a continuum & there are greater & lesser</p><p>\t\thuman & god self-organisations.</p><p>\t\tNow costings come in three main types: paying in advance,</p><p>\t\tpaying on the spot & deferring payment, this is combined</p><p>\t\twith the source of payment which is yourself or someone else.</p><p>\t\tIdeally but rather hard to pull of is paying on the spot</p><p>\t\tin every moment, zeroing karma with every breath, every</p><p>\t\tmoment paying in full, or... 'every moment painful'</p><p>\t\tThe goal of the nexus was to stretch the 'big rubber band'</p><p>\t\tanother notch, to achieve this without frying ourselves in</p><p>\t\tthe process, the method had to be paying in full for</p><p>\t\tevery moment because if we let costings accumulate too</p><p>\t\tmuch them they'd overwhelm our self-organisations. We'd</p><p>\t\tapproach the big-stretch by generating waves of duality of</p><p>\t\tincreasing intensity & also increasing frequency of</p><p>\t\tpolarity, a sort of polarity division multiplexing. The</p><p>\t\tnet result would be a dual consciousness simultaneously in</p><p>\t\theaven & hell & lost in neither, thus we would have the</p><p>\t\tability to ramp up the intensity arbitrarily.</p><p>\t\tThis exercising of 'as above, so below' would traverse all</p><p>\t\tdimensional aspects, but the one we were to focus on</p><p>\t\tprimarily was possibility/limitation & using the possibility</p><p>\t\tto purely enter into the heart of limitation & thus set up</p><p>\t\ta self-feeding loop in ever increasing valence.</p><p>Back to\t\tYes, back to the story, ok kids three deep breaths & lets</p><p>the trip!\tfire up the difference engine, with this meta-flesh sandwich.</p><p>\t\tSpock was driving the process, taking his cues from some</p><p>\t\tcosmic script, one line at a time, If he had read the entire</p><p>\t\tscript, he would have probably terminated the project.</p><p>\t\tTimeless, eternal, bliss & understanding has as it's</p><p>\t\tdual experience in confusion & pain within time, so it</p><p>\t\tgoes, the beautiful vision of unified, structured meaning,</p><p>\t\tpeace, love & understanding has as it's dual random acts</p><p>\t\tof senseless violence. The motto of self-perfecting,</p><p>\t\tself-correcting, self-repairing vajrayana mind is</p><p>\t\t'the price of liberty is eternal vigilance'.</p><p>\t\tPleasure & pain, the carrot & the stick, how to get the</p><p>\t\tprocess happening, there we were, two male principles &</p><p>\t\tone woman principle. I encouraged Kirk & Uhura to explore</p><p>\t\teach other But to keep in mind the cosmic accounting.</p><p>\t\tShiva reminded Shakti that all parts of her body were as</p><p>\t\tsensitive as her clitoris & it had always been this way,</p><p>\t\tShe could put herself into transcendent bliss if she</p><p>\t\tcould remember how. Remembering & forgetting are a dependent</p><p>\t\tarising, Ananmesis about our highest identities was up on</p><p>\t\tthe agenda.</p><p>\t\tUhura/Shakti was our Goddess of Yes, the goddess has many</p><p>\t\tsecrets, deeply personal, that is her nature. She can put</p><p>\t\therself into this transcendent cybernetic bliss but has</p><p>\t\tresistance to do so, shades of the costing.</p><p>\t\tWe would start off with the pleasure|pain dimension &</p><p>\t\tthen shift to possibility|limitation</p><p>Juicy bits\tIt took a while for Shakti to shed her clothes, she</p><p>\t\tspiralled in & out of personal|trans-personal & finally</p><p>\t\ta hand simply on her stomach was sufficient to convince</p><p>\t\ther that outer veils to contact needed to be shedded,</p><p>\t\tafter all she was all clitoris. Krishna & shakti started</p><p>\t\tto kiss & caress, Shiva caressed as well & focussed on</p><p>\t\ta nipple, licking & sucking it, Shakti started to vibrate</p><p>\t\tas if beneath her skin was a thousand fusion reactors in</p><p>\t\tmeltdown. The Shiva *bit* the said nipple, but more was</p><p>\t\ttransmitted than the sensorial pain, for the costing of</p><p>\t\tthe transcendent pleasure was being enacted & Shakti went</p><p>\t\tto the personal hells of pain & shame, but not for too</p><p>\t\tlong & krishna & Shiva were there to catch her & bring</p><p>\t\ther back & ensure that her god-self-organisation did not</p><p>\t\tfracture, end of lesson one.</p><p>Juicy fruits\tThe ying yang symbol packs so much in it's lithe form,</p><p>lesson two.\teach polarity has a small dot in the centre that is the</p><p>\t\tother, they dependently arise! perfectly imperfect always.</p><p>\t\tMale & Female self-organisations in amnesiac arrogance</p><p>\t\tboth occasionally claim the lack of necessity of the</p><p>\t\tother, the impeccable accounting mechanisms will prove</p><p>\t\tboth to be fools eventually.</p><p>\t\tWe three consciousnesses divided 'this is it' between</p><p>\t\tus as intelligently as possible, Us blokes took on the</p><p>\t\tattributes of stillness, contemplation, impersonality</p><p>\t\tdisembodied, pure intelligence & the Shakti took on the</p><p>\t\tactive, vibratory, embodying, feeling aspects. It was</p><p>\t\tnot a strict division, but we all had areas of</p><p>\t\tspecialisation.</p><p>as above\tUhura was sandwich between Krishna & Spock, Spock untuited</p><p>so below\tthat the next level was appropriate, Uhura said 'What are</p><p>\t\tyou? Ahhhhhhh....' as Spock inserted his thumb in Uhura's</p><p>\t\tvagina & his index finger in her anus, he then correlated</p><p>\t\tthe finger & thumb one of either the basal or sexual chakras</p><p>\t\tas understanding dictated. Here was to start the fractalistic</p><p>\t\tinterleaving of pleasure|pain such that there was instantaneous</p><p>\t\tcontinuous cost accounting for all dimensional modalities.</p><p>\t\tUhura was in Heaven & Hell simultaneously & thus the amplitude</p><p>\t\tof the oscillations could increase without disaster.</p><p>\t\tThere were periods of quietude, or rest & regrouping,</p><p>\t\tdiscussion of concepts, technically speaking were were still</p><p>\t\tin the domain of dry tantra, we were working up to full</p><p>\t\tgential or wet tantra. It was all proceeding smoothly.</p><p>\t\tUhura was both the key & the lock, door, portcullis & gate,</p><p>\t\ther burgeoning understanding of the goddess archetype is what</p><p>\t\tdefined the level at which we expanded consciousness, as</p><p>\t\tthe male principles we sharpened our intelligence in keeping</p><p>\t\ther on track & catching her should a hell wave of the</p><p>\t\treality engines assail her & cast her back into humanity.</p><p>\t\tFor every wave of transcedent, transpersonal bliss was a</p><p>\t\tshadow of profound personal shame & pain, as above, so below,</p><p>\t\tthe higher I climb, the deeper I go.</p><p>\t\tAt one stage, Uhura impishly wanted Spock & Kirk to enter</p><p>\t\tmore directly into the union, & whilst Spock said this was</p><p>\t\ttechnically possible in terms of mere merging of boundaries,</p><p>\t\tsame sex tantra was a dead fuck when it came to exercising</p><p>\t\tthe difference engine. We were in god consciousness, yes,</p><p>\t\twe could do anything, but! to what point? Back to the</p><p>\t\tGreat Task & don't get distracted, besides Spock was in no</p><p>\t\tposition to shape change as would be his want in such a</p><p>\t\tcircumstance.</p><p>transylvannia\tJust because we chose the roles we played didnt't mean that</p><p>sexpress\twe couldn't drop them a little, Uhura honoured & worshipped</p><p>\t\tKirk's Lingham, just as Kirk pleasured Uhura's Yoni. Spock</p><p>\t\tbeing Shiva, or was it Shiva being Spock? bit her on the</p><p>\t\tneck, not enough to draw blood! 'I've come to suck your</p><p>\t\tnegativity...' Spock was using his impersonality to draw</p><p>\t\tout Uhuras personal negativity, so as a consequence she</p><p>\t\tcould raise higher, he was acting as a negativity vampire</p><p>\t\tfeeding on her costings & bolstering his meta-transpersonality</p><p>\t\tas a consequence, the old Buddha in Hell vaudeville routine.</p><p>\t\tThe neck biting served two purposes, positive|negative</p><p>\t\tcost accounting & also the negativity draining. Uhura rose</p><p>\t\thigher, so that she|we could dive deeper, so that we could</p><p>\t\trise higher, world without end.</p><p>\t\tWe were working up to yoni-lingham wet tantra, which is</p><p>\t\twhere the greatest work could be enacted, as there are</p><p>\t\tno finer nor potent tools to fire up the difference engine</p><p>\t\tthan the penis & the vagina.</p><p>\t\tShiva was encouraging Shakti to bind with Krisha, but</p><p>\t\tdisturbingly she falling back into preference & person</p><p>\t\tconstruct & wanted to align with Shiva. Shiva much preferred</p><p>\t\tfor the other two to construct the difference engine & for</p><p>\t\tShiva to monitor it's engagement for full capacity.</p><p>\t\tKrishna was a little thrown by this & then destabilised</p><p>\t\tby a wave of his person-construction with it's threads of</p><p>\t\twife & child. here now here now! Shiva cried, all else is</p><p>\t\tstory! at least stay until I can benchmark the quality &</p><p>\t\tfoundation of your god-consciousness, do you want to lose it?</p><p>\t\tBut krisha could not be swayed, & he departed, ourselves</p><p>\t\tmutually bestowing honours upon each other. Shiva sensed</p><p>\t\tthat the window of this working bee was closing, he had to</p><p>\t\tmove fast. So only Shiva & Shakti remained, she was still</p><p>\t\treceptive although assailed by enmeshing tendrils from her</p><p>\t\tperson constructs, for she too had a lover. Shakti would</p><p>\t\thave loved to have her lover here & so would Shiva, the</p><p>\t\tdifference engine could be built again. Not that the</p><p>\t\ttwo of them could not build it, just... well call it a</p><p>\t\ttendency to the mad scientist/nutty professor aspect of</p><p>\t\tShiva's make-up.</p><p>\t\tAh Shakti, my Goddess of Yes, Divine Slut, whole universes</p><p>\t\tmay sunder & fall & be recreated in the consequences of our</p><p>\t\tbliss, how many secrets do you have Shakti? Shakti did the</p><p>\t\tthe standard trip of shapechanging to mothers, sisters &</p><p>\t\tlovers, asking directly of her secrets caused her to</p><p>\t\tthreaten unleashing the gates of hell, such enquiry had to</p><p>\t\tbe executed riding on a wave of bliss</p><p>\t\tWindows closing, dominos falling, Shakti was withdrawing,</p><p>\t\tpulled back by the earth-plane dreaming, we mind-danced &</p><p>\t\tthis started the engine again, she would withdraw, Shiva</p><p>\t\twould re-awaken her by throwing all of his intelligence \t\t\t\t</p><p>\t\tinto penetrating the dreamings of her person constructs.</p><p>\t\tThe most profound workings awaited the wet tantra, we both</p><p>\t\tknew it, she was hesitant to take this final step for it</p><p>\t\tmeant hells within hells & heavens within heavens. Shakti</p><p>\t\torally worshipped Shiva's lingham working up to the deeper</p><p>\t\tinterpenetration, she made passing comment that Shiva's</p><p>\t\tperson construct had nearly burnt out all childhood shame,</p><p>\t\tthe wisdom of the goddess, she shared some deep shame of</p><p>\t\thers as well., whoops! an inhabitant of the house</p><p>\t\tour hosts walked through to the kitchen, Shakti was a</p><p>\t\tlittle mortified, we couldn't merge here!?</p><p>\t\tThis got Shiva thinking of the costing strategies, of</p><p>\t\tgradated cognitive dissonance. Suppose shakti envisioned</p><p>\t\ther perfect love nest, the costings would then come in</p><p>\t\tpure, more lethal form, so by dispersing the costs into</p><p>\t\tdissonance with all aspects of her ideals, then a</p><p>\t\tmore pragmatic dynamic would result, if harder to kickstart.</p><p>\t\tConstructing an environment of being in public & not with\t</p><p>\t\ther partner of choice would be a firm foundation, if only</p><p>\t\tfor the seasoned trouper. We repaired to my place across</p><p>\t\tthe road, there were still fragments of party around, we</p><p>\t\tdidn't repair to my bed-room but socialised, Shiva was</p><p>\t\tlosing the plot as well, oh well...</p><p>\t\tTime passed, it was hard to relate at a human level with</p><p>\t\tthe other party goers, we left the house & enjoyed the</p><p>\t\tmorning, we embraced & kissed tenderly our forms dissolved,</p><p>\t\twe merged, our cosmic circuitry became apparent, space was</p><p>\t\tsolid & matter spacious, Shiva wanted to finish the task &</p><p>\t\tcould perceive the chain of being above him & all the</p><p>\t\tlevels & layers of the Great Task that remained unfullfilled</p><p>\t\tThat Shiva was not full blown ipsissimus Shiva, explained</p><p>\t\tpart of the failure, oh well next time.</p><p>\t\tSeven hours after our first meeting, Shakti/Uhura entered</p><p>\t\ther car & left, we did not exchange phone numbers, now</p><p>\t\tregretted, at the time it was part of the retaining game.</p><p>\t\tOne last look, sharply broken, away she drove, farewell</p><p>\t\tbrave goddess!</p><p>\t\tOh.. well, Uhura fell back into enfolded layerings of</p><p>\t\tperson-constructs, hopefully some of her self organisation</p><p>\t\twould survive & more importantly she could transmit the</p><p>\t\tconsciousness to her permanent partner.</p><p>\t\tIt had been an eventful night, Uhura|Shakti did taste</p><p>\t\ther goal of the nature of enlightenment, Vishnu & Shiva</p><p>\t\twere successful at least in their claim of collapsing,</p><p>\t\talbeit temporarily, time & space, history, path, lineage</p><p>\t\t& hierarchy.</p><p>\t\tOne must not neglect that jewel, the Orgy of Self Denial</p><p>\t\tmany of the dimensions of its meaning were demonstrated</p><p>\t\tas we oscillated up & down the axis of god-human, each</p><p>\t\tself organisation has it's strengths & weaknesses, remaining</p><p>\t\tpurely in human & deny your god nature, remain purely in</p><p>\t\tyour god nature & deny your humanity, being division</p><p>\t\tmulti-plexing suggests a way.</p><p>\t\tWell... there was no shakti, remaining, quite appropriate,</p><p>\t\tBUT, there were the daisies, ah... the daisy, such a vibrant</p><p>\t\tzero-sum flower, looks beautiful but smells like shit, self</p><p>\t\tcontained. I started to enter into some of my layerings as</p><p>\t\twell, not too many, thank god. I contemplated them & the</p><p>\t\tatmosphere became DMT-vibrant, Flower samadhi was at hand,</p><p>\t\ttantric union with the flowers, it was consensual,</p><p>\t\twe collapsed together, flowers poised in my third eye.</p><p>\t\tThe flowers are 'Yes' creatures to be sure.</p><p>\t\tMore can be written but we'll leave it at that.</p><p>conclusions:\tThe best parties happen in the kitchen, proof positive.</p><p>\t\tWhen windows of opportunity open then leap through, don't</p><p>\t\tdrop the ball, GO!, GO!, GO! & don't look back.</p><p>\t\tI have always said a God that could not express everything in</p><p>\t\twords is not much of a God. We'll I'm no God. There is so</p><p>\t\tmuch that could be written about that convergence & so much</p><p>\t\tthat has been overlooked or forgotten, no matter, some of the</p><p>\t\tflavour has come through, this was not meant to be a door</p><p>\t\tstop.</p><p>\t\tThis work will continue 'when the stars are right',</p><p>\t\tevolving consciousness towards being-division multiplexing</p><p>\t\talong the chain of being will ensure that the frequency</p><p>\t\tof the waves of amnesia & anamnesis monotonically increases,</p><p>\t\tthus eternity in time, forever.</p><p>\t\tIt could be asked what exactly 'powers' the great cosmic</p><p>\t\tmainframe & keeps it going, there are answers, but they</p><p>\t\tare beyond the scoping of this report, the holder of</p><p>\t\tlimitations is a referent however.</p><p>\t\tSometimes I wonder what the point is in sharing these</p><p>\t\tstories As I struggle to find compact clear expressions of</p><p>\t\tthe unfolding stories & then I remind myself that this is</p><p>\t\tcartography of the possible & the forgotten & is my & our</p><p>\t\tcommonwealth. It also has the virtue of putting in very</p><p>\t\tsharp relief the nature of my daily earth bound follies</p><p>\t\tversus the real work of Consciousness, thus it is a</p><p>\t\tsobering activity that refines clearer intent for myself.</p><p>aftermath:\tHard to trace, total conceptual violation without violating</p><p>\t\tat this level of substantiality is not everyone's cup of tea.</p><p>\t\tIn fact it's about as popular as Lapsang Souchong.</p><p>\t\tSpock has had no reports from either Uhura nor Kirk, having</p><p>\t\tmet neither before this convergence, it would be interesting</p><p>\t\tto see how much of the expanded consciousness has remained</p><p>\t\tsince that Saturday night, the price of liberty is eternal</p><p>\t\tvigilance after all, but as the Americans are finding out</p><p>\t\twho guards the guardians? The states we were in were</p><p>\t\tfragile but profound, fresh-born like the cicarda from his</p><p>\t\tshell, unfortunately the window of convergenence closed</p><p>\t\tbefore we could stabilise in the new self-organisations,</p><p>\t\tthis is not an atypical scenario for this type of work.</p><p>\t\tNEXT TIME.</p><p>\t\t'effort is spontaneous' as Sri Maharaj Nisargadatta would say.</p><p>\t\tOM NAMAH SHIVAYA</p><p>\t\t*This time*</p><p>--------------------------------------------</p><p>These notes were hastily cobbled together in the aftermath of the experience</p><p>they provide some guidelines as to how to go about the style of tantra that</p><p>manifested during the workshop, it's probably as clear as mud, enjoy!</p><p>\t\t\t\tFINGER STRING</p><p>\t\t\t\t~~~~~~~~~~~~~</p><p>\t\t\t\tOM NAMAH SHIVAYA</p><p>\t\t\t\tI bow to the Lord</p><p>() \tLord Shiva is a Karma Killer</p><p>(*)\tPortable Dharma, always, in all ways</p><p>(A)\tTantra does it better every Time</p><p>(B)\tenglish is now sanskrit</p><p>(C)\tfor every moment, pay in full.</p><p>(D)\tfor every moment, paid in full.</p><p>(E)\t...every moment, painful...</p><p>(F)\tpay in full, painfull</p><p>(G)\tpaid in full, painfull.</p><p>(H)\torgy-self-denial</p><p>(I)\tThe orgy of self denial ('self applied with a twist')</p><p>(Ia)\tWhen you have nothing better to do, have an orgy of self denial.</p><p>(Ib)\tGod is an Orgy of Self Denial</p><p>(K)</p><p>\t  self\t\t   orgy\t\t  denial</p><p>\t  /  \t\t   /  \t\t   /</p><p>\t /    \t\t  /    \t  /  </p><p>\torgy--denial\tself--denial\torgy--self</p><p>(L)\tKilling ideas:... consider luke skywalker in the final scenes of</p><p>\tStar Wars when he is the jet fighter, travelling down the surface of the</p><p>\t'Death Star' getting ready to shoot a missile down a cooling duct</p><p>\tstraight into the thermo-nuclear reactore core, those missiles</p><p>\t(missives) are by way of analogy 'killing ideas'. Now '</p><p>(M)\tGood tools: a dictionary, for definitions, a thesaurus for associations,</p><p>\t& a good dictionary of synonyms & antonyms.</p><p>\t[BASIC & fundamental spiritual texts]</p><p>(N)\tBasic taxonomy of ideas:</p><p>\t(a) 'Ideal'\t(here,now) versus (there,then)</p><p>\t(b) 'Horizon'</p><p>(O)\tTSG: (Toxic Shame Game) (Tantric Sex Game): Same Game, Different</p><p>\tAspects Vanessa was (is, will be) a fast learner, but a *bad* student.</p><p>(P)\tAs above, so below</p><p>\tHeaven on Earth</p><p>\tDependent Arising</p><p>(Q)\tAS ABOVE\t... english is now sanskrit (see what I mean? SWIM)</p><p>\tSO BELOW</p><p>(R)\tSharpness is it's own reward.</p><p>(S)\tI am the writer, I have infinite capacity to write what I like,</p><p>\twhat do I want to write?</p><p>(T)\tMy research sessions are either zen-austerity or low level background</p><p>\twobbling, low level background wobbling is my preference to remind me</p><p>\tthat it's all arbitrary.</p><p>(U)\tThe cosmic battery; maximising contradiction. (+-)</p><p>\tHeaven on Earth (+/-)... God maximises contradiction</p><p>(V)\tInstant Karma, cash on the nail, paid on the spot, spot fines,</p><p>\tspot loss, Instantaneous Karma, for every moment, deal with it as it</p><p>\tarises, fully pay the cost & do not defer payment, for when collection</p><p>\tday come s you'll not be a happy being, 'Invest in Loss' as the Taoists</p><p>\twould say.</p><p>(X)\tThe problem with very compact dharmas is that they can be hard to</p><p>\tunderstand this is not because the esoteric is cyphered into the</p><p>\texoteric, so much as you have to put a lot more work into the</p><p>\t'reading',either that or it's just badly expressed... the author</p><p>\thas no time for concealed teachings</p><p>(Y)\tThe commonality of the complementary dyad 'esoteric:exoteric' is</p><p>\t'sx'; sex..</p><p>(Z)\tEverything is much ado about nothing. (+)&(-) arise out of (+/-)</p><p>\twhich arises out of nothing ().</p><p>(AA)\tEvery moment is constructed of both positive & negative qualities,</p><p>\tthe positive is the cost of negative, the cost of the positive is the</p><p>\tnegative.</p><p>(BB)\tThe beauty of 'Orgy of Self Denial' as opposed to 'The Agony & Ecstasy'</p><p>\tis that the dependent arising is self applied thus linking them in</p><p>\tan obvious way, whereas the connection between agony & ecstasy is</p><p>\tnebulous, especially given the self's self interest.</p><p>(CC)\t'Orgy of self denial' is a special killing idea [machine] if it</p><p>\tis used as the object of contemplation in a meditation, however brief.</p><p>(DD)\tThe portfolio of costs can be extensive, for instance it can be spread</p><p>\tover many forms in space & time.</p><p>(EE)\tThis Something Happening Scene invites you to an Orgy of Self Denial</p><p>(FF)\tThis is a transcript of the original notes following the Sunday</p><p>\tWorkshop all that you *really* need to know about tantric sex</p><p>\t(to get started)</p><p>\tTantra does it better every time.</p><p>\tevery moment: pay in full, paid in full, painful</p><p>\tremembering is the dependent arising of forgetting.</p><p>\tforgetting is the dependent arising of remembering.</p><p>\tDry Tantra, Wet Tantra, Slut Queen, Slut Goddess, the Goddess of Yes,</p><p>\tslave slut, the Cosmic Slut, the Divine Slut, beautiful in your</p><p>\tappetites.</p><p>\tentry vector: 'An Orgy of Self Denial', Slut & Abstinent</p><p>\t(Ascetic are a dependent arising, most (humourless) ascetics</p><p>\tconceal from themselves that they are absolute sluts of abstinence,</p><p>\tthey cannot just get enough of it</p><p>\t(abstinence that is...)</p><p>\tBankrupt slut, slave slut, pleasure slut, sensual slut, slut &</p><p>\tshame are a dependent arising, are you fully willing to pay the full</p><p>\tprice of shame?</p><p>\tShiva-Shakti pure form tantra, bypassing all known systems, always.</p><p>\tFemale shakti, tantrika partner requested for male tantric slave</p><p>\tmaster...</p><p>\tdependent arising to the left & the right, master & slave are a</p><p>\tdependent arising, enslave your mastery & master your slavery.</p><p>\tLimit it to spiritual & psychic pain, leave the 'window dressing'</p><p>\tfar far behind. This is best practiced in tantric sex, constantly</p><p>\treminding the woman to pay for her pleasure (the middle path),</p><p>\timmediately on the spot, full payment, not dispersed over space &</p><p>\ttime & compartmentalisation, focussed, localised in one spot,</p><p>\timmediate, no procrastination, no excuses, no retreat from the full</p><p>\towning of her pleasure & it's cost. With practice</p><p>\tof instantaneous cost you can generate *infinite* pleasure.</p><p>\tThe cost may be dispersed over time,space,self-dom,events & other</p><p>\tdimensional attributes of consciousness.</p><p>\tThe highest tantra is all about paying for every moment, in the</p><p>\tmoment, in the moment all the (+)'s are the cost of all the (-)'s</p><p>\t& the (-) 's are the cost of all the (+)'s.</p><p>\tThe man gently & lovingly & patiently, with a commitment to Woman's</p><p>\tHighest Good, corrals & clarifies the woman's relationship to her</p><p>\tpleasure & helps her integrate the costs of the pleasure.</p><p>\tAs inevitably night follows day, the 'cost' can be expressed in</p><p>\tmany forms, pain, shame, hesitation, attachment, enfoldment into</p><p>\tpersonal humanity,etc.</p><p>\tThe name of the game is transpersonal liberation.</p><p>\tThe man can act as a negativity vampire for the woman, draining</p><p>\tnegativity out of her gentle bite/suck/lick, inflicting pain with</p><p>\tunderstanding.</p><p>\tThe Shakti is infinitely self-deceptive, infinitely clever, she</p><p>\twill seek to procrastinate, delay, limit, withdraw from the systematic,</p><p>\trelentless generation of unlimited pleasure. Totally focussed on her</p><p>\t*highest* good, always, in all ways is the shaktiman.</p><p>\tThe ultimate aim & beauty of tantric sex is to maximise contradiction,</p><p>\tto build a bigger battery. There is no better way to understand</p><p>\tdependent arising.</p><p>\t*even god is a dependent arising* when such consciousness complexes</p><p>\t ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ fully remember & understanding this,</p><p>\tthen expansion is again possible.</p><p>(GG)\tevery moment painful; paid in full, an orgy of self denial.</p><p>(HH)\tThe work is hard & demanding for the male as he bends all his</p><p>\tintelligence, wisdom,subtlety & sensitivity, concentration & focus on</p><p>\tkeeping the female on track as the cost of the pleasure will manifest in</p><p>\tmulti-dimensional myriad ways & this will increase as the ability to</p><p>\tgenerate increases.</p><p>(II)\tThe shakti will not reveal her secrets willingly, you must firmly but</p><p>\tgently keep pushing, keep penetrating... the deeper the shame cost</p><p>\tgenerated the greater the risk of violence, especially.</p><p>(JJ)\tOf all the myriad manifestations of the the nature of dependent</p><p>\tarising, that infinite dimensional much ado about nothing, the most</p><p>\tdeft, the most wonderful must be the tantric union of a male & a</p><p>\tfemale intelligence.</p><p>(KK)\tThere are levels of skill & understanding about the process of tantric</p><p>\tunion & there is a particular art in 'constructing' the cost for</p><p>\tthe woman, the shakti will tend to the thoughtform of the the 'ideal'</p><p>\tnest of circumstances within which she can fully let go or release</p><p>\tor relax into the process, BUT if such an arbitrarily high 'appropriate'</p><p>\tenvironment was constructed all that would result is that the cost</p><p>\twould manifest in other areas in a more intense manner, there is no</p><p>\tsuch thing as a free lunch.</p><p>(LL)\tThus given a 'shopping list' of desirable attributes for building an</p><p>\tenvironment for surrendering totally to the process, what you can do</p><p>\tis subtley create 'congnitive dissonance' with all items on the list</p><p>\t& what that does is spreads or offsets the cost into more harmless</p><p>\tareas. For instance the shakti (& it's 9 times out of 10, shakti</p><p>\tderived) may wish to do it in intense privacy with her partner-lover,</p><p>\tthus to spread the cost out she would do it with a different partner</p><p>\twith her usual partner sitting by observing, also doing it an audience</p><p>\tpresent [an aware audience] would disperse the costs considerably,</p><p>\twithout deflecting or avoiding the costs, it can get very, very subtle.</p><p>(MM)\tAs above, so below, much ado about nothing, every moment, pay in full,</p><p>\tevery moment painful, is the message getting through?</p><p>(NN)\tIn particularly intense sessions, whole universes may be created &</p><p>\tdestroyed, the stars will fall out of the skies, mountains will subside</p><p>\tthe eath will quake, as the cost of the positive that is created...</p><p>\tthis is a taste of the potential, the portfolio of costs can be deftly</p><p>\tmanaged & the costs are best corralled nearer the source of the</p><p>\tcreation.</p><p>(OO)\tThe masterfully contrived & deftly administered killer concept is a</p><p>\tthing of joy & beauty forever.</p><p>(PP)\tThis is it, right here, here & now, not lost in there-then & the</p><p>\tvisscitudes of person, self & history, this is of critical importance</p><p>\tto the process of the highest tantra.</p><p>(QQ)\tYou can have tantric sex with any object or being but... the highest</p><p>\tvoltage is between male-hu-man-be-ing & fe-male-hu-man-be-ing.</p><p>(RR)\tThe only thing stopping you having tantric sex with a bunch of daisies</p><p>\tis your disbelief that you could have sex with a bunch of daisies!</p><p>\tDon't knock it until you try...</p><p>(SS)\tThe highest tantra is dedicated to consciousness expansion &</p><p>\tconsciousness expansion is about maximising contradiction</p><p>\tharmoniously & consciously.</p><p>(TT)\tThere are many apt expressions or meme sequences that can be used to</p><p>\textract your self from the dreaming, the 'orgy of self denial' is</p><p>\tpretty damn good. Take the expression 'everything is meaningless',</p><p>\ta fine mantra so long as you rigorously apply it. Negative nihilists</p><p>\tuse it to justify acting out all sorts of negativity, the mantra is</p><p>\tbest if universally applied & self applied. 'Nothing matters' & that</p><p>\talso includes the negative voices, thus you can not give life to them</p><p>\twith equal a plomb as you would not give life to the positive voices.</p><p>(UU)\tDr Frankenstein & his lab assistant Igor are also an example of</p><p>\tdependent arising. Consider a being that is straight & true &</p><p>\tbeautiful then that will have a dependent arising that us twisted,</p><p>\tbent, false & ugly, but is the positive being so honest as to own it's</p><p>\town dependent arising?</p><p>(VV)\tThe beginnings of Cosmic Love is when you start to own the dependent</p><p>\tarising of Love which is Hate. When you start to love your hate &</p><p>\tacknowledge it's intimate connection with love then cosmic love</p><p>\tis born, by loving your hate you dont have to act it out or give it</p><p>\tlife, just own, acknowledge & embrace it.</p><p>(XX)\tThe highest tantra is about Cosmic Intelligence Activation.</p><p>(YY)\tDry tantra can be practiced anywhere & is about 90% of the</p><p>\teffectiveness.</p><p>(ZZ)\tThis is the last statement (for a while).\r</p><p>\n",
 "year": "1995",
 "id": "31064",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-02-19T08:00:00.000Z",
 "views": "35529"
}
