{
 "title": "10 Hours of Visions",
 "author": "Fiction",
 "citation": " Fiction. \"10 Hours of Visions: experience with Mushrooms (P. cubensis) (ID 3106)\". Erowid.org. Dec 6, 2001. erowid.org/exp/3106",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "180 lb",
 "report": "<p>One night, I convinced my best friend to eat mushrooms with me.  Though I'd eaten them twice before, the first time feeling nothing, and the second time nearly going insane, I enjoyed the second experience and wished to feel that way again. At around 8 p.m. we ate the mushrooms and washed them down with water.  Then I left him for an hour or so and, along with two of my other friends (neither of which were on mushrooms), went out to dinner.  I couldn't eat because of nausea, but sitting in the restaurant I felt very restless.  Any little sound I heard was the most disturbing thing, including the chopping of the cook in the kitchen.</p><p>As I sat and watched my friends eat, I stared at the ceiling which was now beginning to move slowly back and forth, as if it was breathing.  Then the light from the candles began to move higher than naturally possible along the walls and was dancing, it was very beautiful.  After leaving the restaurant I went back to my other friend who'd eaten the mushrooms with me.  We were both extremely happy to see each other, but now we were feeling the effects, which were becoming very intense.  We both felt very confused, and couldn't decide what to do.  We were in our friend's bedroom, who was laughing at us because of a similar experience he'd once had, and trying to decide whether or not to go to this party.</p><p>Well, we decided to go and when we got there it might have been the most overwhelming feeling I'd ever had.  There were around seventy people there, and I felt as if they were all watching me.  My friend and I went in and out of the house.  Inside the colors of the room were shifting, people's faces were becoming digital and fuzzy, and outside the trees were clapping and dancing while the clouds moved in abnormal patterns overhead.</p><p>After finally leaving the party at around 12:30 a.m., we went for a ride.  I closed my eyes most of the way to see visions of beautiful naked women having sex, words like love, passion, lust flashing, all sorts of colors and psychedelic visions surrounding the women.  At 1:00 we went to another friend's house, where my hallucinations continued, but at around 1:30 or 2:00 I started to come down and the hallucinations began to fade.  At this point we went to a dealer's house and bought two more grams of mushrooms and ate them.</p><p>While my friend and I were eating them in a school parking lot, I saw a man with a gun run toward me and try to shoot me.  I screamed, only to realize he wasn't there, then we both laughed for about ten minutes.  The next four hours was a wonderland of hallucinations.  The trees appeared to be dragons, all the lights were brighter, and buildings and cars seemed to stand out differently than usual.  They all had a somewhat glossy and cartoon look to them.  Then at 5:30 a.m. when I finally got home and to bed, I couldn't sleep because of all the sounds in my head.  It sounded as if a factory was working in my brain.  Clanging, crashing, buzzing, humming, whistles, all were going on, including songs I had heard earlier in the evening.</p><p>The feeling most of the night was intense, but fun, like a rollercoaster or fun house.  However, for first time 'shroomers I wouldn't recommend doing them with a lot of people around who aren't on them, they only scared, confused, or aggravated me.  I think shrooms are best with six or seven people, all of whom have eaten them and who are all just relaxing in a nice chill environment.</p>",
 "year": "2000",
 "id": "3106",
 "gender": "Male",
 "timestamp": "2001-12-06T08:00:00.000Z",
 "views": "6146",
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  },
  {
   "time": " T+ 5:30",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 ]
}
