{
 "title": "Complete Loss of Reality",
 "author": "Jancaz Bru",
 "citation": " Jancaz Bru. \"Complete Loss of Reality: experience with Salvia divinorum (15x extract) (ID 31075)\". Erowid.org. Nov 13, 2007. erowid.org/exp/31075",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "135 lb",
 "report": "<p>I was hanging out at a lowkey party and had an interest in trying Salvia.  I had tried to concoct a morning glory extract dissolved in 3 shots of whiskey earlier and drank it about two hours earlier, but it had no effect, and I'm assuming it had no effect on the salvia experience.  My friend had some 15x extract lying around so I decided to try it.</p><p>I was in a second story room with a few friends watching me with a black light on.  He loaded the pipe and handed the lighter to me.  I was a bit apprehensive, my heart pounding in nervousness and excitement, but finally calmed down and lit the herb.  I inhaled to almost full capacity, held it... then it hit.  I don't even remember exhaling the smoke.  Instantly, reality twisted away into oblivion, downwards and to the right.  Images of reality stuttered and repeated infinitely.  I completely forgot I had smoked anything, and I guess I fought a little bit to control it, but no luck of course.  Time was obliterated.  I remember feeling the pipe drop from my fingers.  It came on so fast, it was like being hit in the head with a hammer and left to reel from the impact.</p><p>I kept trying to comprehend the whole experience, and it seemed like a very odd dream.  I'm told that during the experience I was grasping at the air.  The taste of the extract lingered in my mouth and I kept thinking I was drowning in reality.  At one point, after I had dropped the pipe, I supposedly picked it up and cradled it like a child.  I remember trying to talk, because everyone was just silent and watching me.  I couldn't hear myself talk at all, and I could barely hear them talk.  The silence was unnerving and I really wanted them to talk, but I couldn't even make the thought.</p><p>I was beginning to get hot, so I supposedly said, 'I've just opened the door!' and then 20 seconds later I fling open the door and almost run out of the room.  I don't remember going down the stairs at all, and people tell me I almost fell down.  I remember two still frames of reality as I make my way down a hallway and past a group of kids I don't even know.  I make it into a well lighted room with some couches and just kind of sit down.  Everything is still spinning and I'm still trying to comprehend it.  By this point, I still don't know I had smoked it.  I laid down and closed my eyes for about 5 minutes and finally it stopped. </p><p>My friends came to see how I was doing and I asked how long it had been.  What seemed like 3 minutes in the black lit room was actually something like fifteen.  Once everything stopped spinning and twisting, I finally remembered I had smoked it.  Needless to say, it was a very intense experience, one which I was not ready for.  I plan on trying the 5x and 10x extracts before trying the 15x again.</p>",
 "year": "2004",
 "id": "31075",
 "gender": "Male",
 "timestamp": "2007-11-13T08:00:00.000Z",
 "views": "2791",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
