{
 "title": "Beyond What is Real",
 "author": "Crazy S",
 "citation": " Crazy S. \"Beyond What is Real: experience with LSD (ID 3108)\". Erowid.org. Dec 16, 2001. erowid.org/exp/3108",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "500 ug",
   "insufflated",
   "LSD",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I was 16 at the time of this experience. I had my friend Pete over to my house for a night of tripping on acid. In the morning we picked up 2 microdots, which we were told contained 500ug of LSD. This number didn't mean much to us, and we had had previous experiences with a weaker strength of microdot orally. Tonight, we decided that we would like to heighten the trip by insufflating the microdots.</p><p>At 7:00, we each crushed our microdots and got two straws to snort with. We were in my brother's bedroom, both feeling in a positive mood. I went first and snorted my microdot. Instantly, I felt an insane rush of evil come over my body. The taste of the powder was like sucking on a Tylenol and it was dripping down the back of my throat. I suddenly felt like I was going to vomit, so I rushed to the washroom and hovered over the toilet for 5 minutes.</p><p>When I returned to the room, Pete had snorted his and was sitting in the corner grinning mischievously. I laid down on the couch and tried to calm myself. All of a sudden, objects in the room started shifting and walls started breathing. I looked over at a painting on the wall and a light mist in the shape of a person began to shift off the wall.</p><p>At 30 minutes after insufflation, I was getting mad visuals. Textures were infinitely complex and beautiful. The early nausea had faded away, perhaps because I was involved in what was happening around me. I looked over at Pete and he continued to smile and stare at everything he could, trying to absorb all there was around us.</p><p>We never moved from our positions for 4 hours, because the happenings around us were sufficient to more than amuse us for that time. At about 5 hours after ingestion, the visuals began to weaken but were still very nice and slow. At this time, we ventured out of the room we were in and watched the Pantera home video, also snacking on chips and pop, which felt amazing gracing my stomach. By 6 hours after ingestion,</p><p>we were down completely. A beautiful experience except for the first 10 minutes of coming up, which were physically burdening.</p>",
 "year": "1998",
 "id": "3108",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-16T08:00:00.000Z",
 "views": "6912",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "500 ug",
   "administration": "insufflated",
   "substance": "LSD",
   "form": "(pill / tablet)"
  }
 ]
}
