{
 "title": "Beautiful Horror",
 "author": "Dominator",
 "citation": " Dominator. \"Beautiful Horror: experience with 2C-E, Ecstasy & Hash (ID 31097)\". Erowid.org. Mar 15, 2004. erowid.org/exp/31097",
 "substance": "2C-E, Ecstasy & Hash",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "2C-E",
   "(powder / crystals)",
   "",
   "15 mg",
   "insufflated",
   "2C-E",
   "(powder / crystals)",
   " T+ 0:30",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 2:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "31097",
   "Male",
   "",
   "Not Given",
   "Mar 15, 2004",
   "13378",
   " "
  ]
 ],
 "report": "<p>I had been curies of 2C-E for a while when one day my friend asked me if he could give me 2C-E and I wanted it.</p><p>We went to my girlfriends apartment on the south side of Stockholm (Sweden).</p><p>I remembered what my girlfriend had told me about 2C-products 'snort max-dose or dont take anything'.  My friend gave me two rolled cigarette papers and said: in this one there is 15 mgs of 2C-E and in the other one there was 10 mgs of 2C-E, I ate the one with 10 mgs and opened the one with 15 mgs, it was like cotton, difficult to line up but I did my best and took my Royal Deluxe snortpipe and snorted up the cottonlike chemical...</p><p>T 0:00- Pain, the great mother of all pain moved into my body, it felt like my chest was about to explode, my nose was in flames, my heart was also in pain. I looked at my girlfriend and Thought 'where the hell am I going?'</p><p>T 0:05- Clear OEVs, the 'background' was wobbling.</p><p>T 0:20- The pain was no longer around and it had left no trace of ever had been around.</p><p>T 0:30- Time to ingest an Ecstasy...</p><p>T 0:31- One more of the E.</p><p>Everything glowed, my friend said: time for me to go, I ve done here for this time...and he went out of the apartment.</p><p>My girlfriend had eaten 4 Ecstasy tabs. and said: dont take more Es hunny, you dont need them., hmmm, I thought why not, so I took one more.</p><p>T 2:30 My girly asked me if I wanted to take a bubblebath, when i felt the hot tubwater on my legs I felt goosebumps all over my body, I leaned backwards so my ears came under the bubbles and I heard the snap, cracle and pop in the most wonderful way possible.</p><p>After the bath I laid down on the bed, the Es was running strong now, I felt like it was growing teeths from the back of my mouth, I asked my girlfriend what to do with all these teeth that was growing...she laughed and me too!</p><p>T ??:?? I thought that me and my girlfriend had thought over my best friend, cause he like appeard in the sofa, first I could only see the contures and then more and more.</p><p>I had smoked a Haschish-joint and the joint took me to the asylum of my mind, I looked at myself and felt dirty wearing only my underpants, and then there wes my best friend who looked fantastic, full of energy and joy, and my girlfriend on 8 Es, I was sure that the meaning of why me and my girlfriend had thought over my best buddy was because I was too dirty and filthy so he just came naturally to take my girlfriend from me, no wonder I felt like a wreck and I started to think that I didnt belong on these planes where everyone of my friend were, my dad too.</p><p>But, It was the most fantastic experience everything was so energetic and beautiful.</p><p>After 13 hours of whirling around my girlfriend gave me 3 tabs of Theralen (sleeping pills) and said 'eat!', I asked why should I eat those Im not tired...dough!...</p><p>It took several days before I were able to speak of my beautiful horror experience with my best-friend and my girlfriend!</p><p>Next time I wont take anything but MAX-DOSE IN THE NOSE </p><p>Dominator CMC</p>"
}
