{
 "title": "Hunted",
 "author": "K-Roq",
 "citation": " K-Roq. \"Hunted: experience with Dimenhydrinate (ID 31122)\". Erowid.org. Nov 13, 2007. erowid.org/exp/31122",
 "substance": "Dimenhydrinate",
 "bodyweight": "145 lb",
 "report": "<p>Having been arrested recently for possession, my parents have been surprising me with random drug tests. So out of desperation, I decided to dose on some motion sickness pills.</p><p>-All times are rough estimates-</p><p>5:00pm - The trip started out as any other; I saw the blobs, I heard thumps, things seems jiggle when I looked at them.</p><p>5:45pm - The trip took on some new characteristics. I had an unusual amount of control over the hallucinations. I remember being able to manipulate the sounds and voices I heard. I would say a word, concentrate on it, and then I would hear the word. Eventually I graduated to complete sentences and noises (ex. a car horn). I also noticed that by staring at the clouds I could get them to form pictures. I distinctly remember seeing an old man reading a book. I could also form pictures in the air by concentrating on those blobs.</p><p>6:15pm - I went inside and put on a cd, one that I specifically made for acid trips. I sat down on the floor and watched what seemed to be a music video for the song I was listening to, on tv (Lucy in the Sky With Diamonds by The Beatles). I thought to myself, 'Wow, what a coinsidence that Mtv would be playing this video at the same moment that I was listening to the song on my boombox!' Then I thought, 'Why would Mtv play a music video that's 35 years old?' Then I thought, 'Does this song even have a music video?' Then I thought, 'Is my tv even on?' And at that point the video was over and I realized my television had been off the entire time. I sat in my room for a few uneventful minutes, and finally decided that I could use a change of scenery.</p><p>7:00pm - I arrived in my living room and as soon as I hit the couch, I saw my bottle of pills staring up at me. I got this feeling that the effects of the pills were starting to dwindle (in hindsight, they weren't), so threw in three more.</p><p>7:30pm - This is when my surprisingly pleasant trip took a turn for the worst. I struggled to focus on the pay-per-view movie I ordered, but my screwed-up periphrial vision forced me to turn around every five seconds.</p><p>7:45pm - My phone rang. It almost went into voice mail before realized it wasn't a hallucination. The call was from a friend of mine, who was looking to buy some weed. I agreed, and tore up my room looking for my car keys.</p><p>8:00pm - I found the keys and started heading toward the garage, but I was paralyzed in fear when I saw a three foot tall elf dart across my living room and run into my parent's room. I stood there contemplating my next move. In the back of my mind, I knew the elf was a halluncination; but if something looks, sounds, and feels real; what's the difference?</p><p>8:10pm - I gathered up enough courage to check it out. When I entered the semi-darkened room, I let out a scream that my neighbors probably heard. I screamed because I saw sitting on the couch, bed, and floor at least five or six more elves. To my relief, these elves turned into piles of clothes, pillows, and an assortment of things laying around the room.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>8:15pm - After I regained my composure, I once again headed towards my garage. I started my car, and when backing out, I saw a man sitting in the backseat of my dad's car. A chill went down my spine. I then got out of my car and slowly crept towards my dad's car to check things out. I peered through the back window, and stared at the back of his bald head. Without warning, he violently turned towards me. The man's face had no features; no eyes, no nose, no mouth; just a blank face. The man then faded away to nothing.</p><p>8:20pm - I realized it probably wasn't a good idea for me to be driving, so I pulled my car back in the garage.</p><p>8:25pm - By now, I was extremely tired. I went into my room and the second I hit my bed, I fell asleep. That night was filled with vivid dreams, all of which I remebered upon awakening.</p>",
 "year": "2004",
 "id": "31122",
 "gender": "Male",
 "timestamp": "2007-11-13T08:00:00.000Z",
 "views": "5120",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "650 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ]
}
