{
 "title": "'Intense Relaxation the Book Sez'",
 "author": "smonkey",
 "citation": " smonkey. \"'Intense Relaxation the Book Sez': experience with 2C-C (ID 31131)\". Erowid.org. Mar 15, 2004. erowid.org/exp/31131",
 "substance": "2C-C",
 "bodyweight": "230 lb",
 "report": "<p>On a lovely rainy Presidents day an evil associate and I were planning to lounge around a friend's house and watch some films. As chance were to have it we had access to 2c-C, and being big fans of the alphabetamines, we thought we'd give it a low dose attempt as an introduction. We carefully measured out our doses and away we go.  Because of the entry in PIKHAL that mentions a long slow road to plateau we decide to insufflate in order to...well....get high faster.</p><p>First off, insufflation of the 2c family can be verrrry painful.  My evil associate was polite enough to let me go first and, as I didn't pound my head against the table in pain, he joined me.  I can't say it was a NICE experience, but it wasn't horrible.  Eyes watered for maybe 15 minutes and the pain was in the 'ouch that hurt' realm.</p><p>Within 10 minutes I was getting my first tells, mild visual field distortions, the edgy feeling of 'getting high' though of course this could be psychosomatic.</p><p>By 15 minutes I was definately off baseline.  Visual perception is noticably distorted, edges are sharpening, my mind is cranked up and cognitive connections are made more quickly.  All very much in line with 2c-b, 2c-t-7 and 2c-t-21.</p><p>At about 20-30 minutes the body load gets a little rough.  I tend to rub my face and arms and feel jittery and in this case that was coming on fast.  My companion was also noticably edgy, but that is the curse of the insufflated route and it's often rougher than normal ride up.</p><p>My trip notes from 38 minutes in note that we're lounging, watching Lord Of the Rings special features and drinking soda and all is mellower.  But since it's a lovely quiet day and I'm among loving friends and in a good mindset, I boost another 5mg we had premeasured for just such an urge.</p><p>Again the slightly rough jitters, oh, and eyes watering again.</p><p>At an hour in my notes say 'Very 2cb like'.  The similarity between them could come from obvious chemical makeup, or heck, maybe I just read PIKHAL, either way it seems similar, a very crisp cognitive feeling.  Not very disruptive, able to interact with 'baseline' people, wander around.  All in all very pleasant and smooth after the rough come-on of the insufflation is over.</p><p>By 3.5 hours out I'm pretty much over the peak, due to my personal chemical sensitivity I'm still 'up' till about 5 hours.</p><p>All in all a lovely afternoon lounging with friends.  I'm not sure I'd consider the 2c-c a very 'insightful' vehicle, but it does give some of the nice cognitive space of making mental connections quickly and easily without much an overwhelming agenda of its own.  I'm eager to try it at a larger gathering perhaps with a larger mix of people in order to talk more on it, feel out the interpersonal interaction aspects of it.</p>",
 "year": "2004",
 "id": "31131",
 "gender": "Male",
 "timestamp": "2004-03-15T08:00:00.000Z",
 "views": "19270",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:40",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  }
 ]
}
