{
 "title": "Pages of Time",
 "author": "Halfpint",
 "citation": " Halfpint. \"Pages of Time: experience with Salvia divinorum (10x extract) (ID 31138)\". Erowid.org. Jun 12, 2007. erowid.org/exp/31138",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "120 lb",
 "report": "<p>I recently bought 2 grams of Salvia extract from an online supplier.  It was rather cheap ($16US) and I definitely got what I paid for, the two dime bags looked like they were filled with left overs.  The shit they swept up off the floor.  It was another dull night without marijuana so I figured what the hell.  I was feeling pretty good, no stresses, no responsibilities waiting for me.  I've experimented with salvia before, so I was comfortable smoking it alone.</p><p>I was in my bedroom with the lights on, no distractions, sitting on the edge of my bed.  I loaded a full bowl of the 10x and went about my business.  After the thirty seconds were up I prepared a second bowl.  While holding the second hit in my lungs I got the initial buzz, a slight numbness.  Realizing how weak the extract was, I loaded a heaping third bowl.  As I drew the flame down onto the extract I noticed that something was different.  Still unsure what was different, because I was concentrated on finishing the bowl.  When I looked up from the bowl, my bedroom as I knew it was gone.</p><p>I was still holding the smoke in my lungs and the distortion of my room was rapidly increasing.  My body was frozen in a frame of time, I couldn't even move the pipe away from my lips.  Still frames of time floated around me like pages of a book.  I was a page on a book!  The pages of my history extended down and right, kind of like those circular address organizers.  I noticed something strange was going on with my face, a tube was going right through it.  Protruding out both sides of my jaw.  It wasn't painfull, it just prevented me from moving.  I exhaled the smoke, and it reminded me where I actually was.  My perception slowly began reforming itself but something was still different.</p><p>I felt like I had duties that I needed to complete, goals waiting to be finished.  So I stood up and raised my left hand up infront of me.  Don't know what I was trying to accomplish, but it felt absolutely necessary for me to do.  Like I was completing a frame in time so that I could continue on with life.  After standing there for a few minutes the trip was dimming out, so I decided to leave my bedroom.  As I took my first step towards the doorway I was hit by the coldest vibe I've ever felt.  Someone was expressing the outmost disappointment they had for my life.  It sent chills through me and I convulsed.</p><p>For some reason I had trouble leaving the room, I felt like there were loose ends waiting to be fixed.  Pages from my history maybe.  As I proceded to walk down the hall to the bathroom I viewed myself as an ugly, old, hunchbacked man.  Which also sent shivers through my body.  I took a shower then went back to my bedroom to lay down.  I was having colourful closed eye visuals and my mind was racing with new thought patterns.  I didn't sleep very well that night.  My mental screen continued to race with colours.  A splash of blood smeared across it, I could smell the blood.  It made me feel nauseous and I felt like I had poisoned myself.  The alien emotions kept repeating themselves, like my brain was struggling to comprehend them.  Had I opened a door that was supposed to be locked?  Or was I driving down a highway that was still under construction?</p><p>The next day I was feeling pretty good, just a slight headache.</p>",
 "year": "2004",
 "id": "31138",
 "gender": "Male",
 "timestamp": "2007-06-12T07:00:00.000Z",
 "views": "2383",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
