{
 "id": 3114,
 "title": "A Fun Night in a Tornado Shelter",
 "date": {
  "submission": "2004-01-20T08:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Fragbait",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": ""
  },
  {
   "time": " T+ 2:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": ""
  },
  {
   "time": " T+ 3:00",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "Setting: At house in central Arkansas with many of my friends from high school.  I haven't seen most of these people in at least 5 months.  Almost everyone is tripping on 5-MeO-DiPT tonight, with a few of us tripping on more.",
  "8:35pm: As soon as we get here the pipes are already being passed.  I break out the psychadelic box and give everyone their drugs.  Two friends and I are planning a combination trip tonight.  So we take our first drug: 10 seeds of Hawaiian Baby Woodrose.  We're all already quite stoned, and we prepare to wait out for a few hours so our various peaks will coincide.",
  "9:45pm: The bodyache/high is starting from the LSA.  My friend remarks that this bears a striking resemblance to LSD.",
  "10:35pm: Have experienced no nausea so far tonight, probably due the copious amounts of kind bud that is being smoked.  My two friends and I dose on 20mg of 5-MeO-DiPT.",
  "10:40pm: I haven't been able to tell the passing of time for the last hour (or so).  So far the night is going wonderfully, and I can feel the effects of the LSA building.",
  "----------------------------------------------------------",
  "Around an hour later, my friends and I smoked the last of my Salvia.  We were already getting heavy visuals off of the foxy, and the mental trip of the LSA was very synergistic.  This night was turning out to be exactly as we planned: excellent fun.",
  "We were spending most of our time in a small 4x7-8 tornado shelter.  There was a red light that gave everything an infrared type glow, especially the tips of cigarettes.  The concrete walls were looking more and more like a changing rainbow of colors.  Right after we smoked the salvia, this effect was immediately apparent; I no longer needed to look for it.",
  "Every time we went outside I would notice distinct patterning in the air and what I call a 'rainbow matrix.'  Imagine a very, very tiny grid superimposed across your field of vision with every square a different color.  I've gotten this effect several times before, and I love it. When I closed my eyes, I found that I could create any image I want.  I could even create complete environments and control my point of view within the new world. As the night slowly petered out, most of the weed that had been brought was gone (out of 2 ounces of kind or so, all that remained was a few joints' worth).  My ex-girlfriend brought a date to the party, and it didn't bother me all night long.  In fact, I was very at ease and content with everything.",
  "I learned so much about myself on this experience; I must repeat it in the future.  I am very content and happy with my life right now, and I think I have my thoughts on the trip to thank for it."
 ],
 "erowid": {
  "id": "20104",
  "citation": " Fragbait. \"A Fun Night in a Tornado Shelter: experience with 5-MeO-DiPT, H.B. Woodrose, Salvia divinorum & Cannabis (ID 20104)\". Erowid.org. Jan 20, 2004. erowid.org/exp/20104",
  "substance": "5-MeO-DiPT, H.B. Woodrose, Salvia divinorum & Cannabis",
  "views": "9734"
 }
}
