{
 "title": "One With Nature",
 "author": "Mushrooms",
 "citation": " Mushrooms. \"One With Nature: experience with Mushrooms (P. cubensis) & Cannabis (ID 31169)\". Erowid.org. Nov 13, 2007. erowid.org/exp/31169",
 "substance": "Mushrooms (P. cubensis) & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>First let me tell u about my history with drugs. I have been smoking weed for about a year and a half and have been smoking pretty much every day for the past 6 months. I tried mushrooms for the first time about 10 days ago. This is about my 2nd experience on mushrooms. Now the experience: I was off of school for a week and my mom told me we were going up to her friends country house for a few days. I knew this was going to be hell so I decided to pack along some drugs. I brought with me about 4 grams of weed and 5 grams of mushrooms. It was the first night and I was getting kinda bored around 11 p.m. and I wasnt tired at all so I decided to take the mushrooms. I ate a nice thick disgusting mushroom sandwich. I almost threw up but luckily I had a blunt rolled so right after I shoved them down my throat I went outside to smoke a blunt.</p><p>After I smoked the blunt I felt kinda high but I wasnt tripping yet. I decided to kill some time by watching a movie. About an hour and 40 minutes into the movie I looked at this plant that was sitting in the room. As I starred at the plant I noticed that it began to move around and all the leaves became rainbows and the plant started to dance as if it were alive. At this point I realized I had started tripping hard so I decided to go outside and smoke some weed. I started to smoke the blunt and I was tripping out of my mind. I was having amazing open and closed eye visuals of what seemed to be very native American style art. The colors were so intense. What happened next was unbelievable and I will never forget it.</p><p>First let me describe to u the landscape of the house. the house sits on top of a hill overlooking a lake, a golf course, and a forest. I went to sit in the grass and starred off into the landscape. It was the most beautiful thing I had ever seen in my entire life. Even though it was pitch black I could see all the scenery perfectly. The colors were so intense the sky had gone from pitch black to shades of purple and blue. As I starred into the trees I noticed that they seemed as though they were moving back and forth. The colors were unbelievable. I could not believe the colors I was seeing, everything was so intense. Then I looked at the grass. Every blade of grass was white with a rainbow glow around the edges. Then as I starred deeper into the grass it began to move as though it were dancing in the wind. Then the blades of grass all came together to form patterns that were similar to the native American visuals I was seeing before. The landscape was so remarkable. It was the most beautiful thing I had ever seen in my entire life. So many colors, such intense visuals. I sat in the grass for about 3 hours listening to techno music.</p><p>By the way, I find techno music to be the most mind stimulating music while on shrooms. The music itself can make the visuals and the trip itself more intense. After about 3 hours of admiring the beautiful scenery and smoking about 10 cigarettes, I went back in the house and started watching another movie. About half way through the movie I started to get bored so I went into my room and turned off all the lights and started listening to some music. The visuals on the walls were unbelievable. I saw all these native American style drawings and pictures again and they were so cool. After about an hour of this I realized I wasnt tripping as hard anymore so I decided to roll up a joint.</p><p>I went back to my spot in the grass and starred off into the distance and smoked my joint. as I finished the joint I realized I was tripping hard once again. I was once again overwhelmed by the colors and beauty of the scenery in front of me. I sat there in that very spot thinking bout my life and nature and becoming one with nature all night long. I watched the sun rise, the sunrise was so beautiful the colors were more intense than ever, and after that I stared into the morning clouds. They began to form shapes of animals and people. It was amazing. Around 7:30 a.m. I decided to go to bed. It was enough already, my mind was tired.</p><p>The weirdest thing is the after effects. Every time I smoked weed the next day I started to trip and see the colors again when I would sit outside. Even now as I write about the trip 2 days later I still see mild colors when I close my eyes. Strange. Anyway I dont remember much of what was racing through my mind, I was too caught up in the visuals and the beauty. I truly felt for the first time in my life that I was one with nature. I have never been truly mesmerized by natures beauty but this because I never truly saw it. Everyone should get in touch with nature and feel one with it. as I sat in the grass that night I was feeling the spirit of everything around me. I truly appreciate nature for what it is and realize that we all as humans have a connection with nature. Thats what this trip has taught me.</p>",
 "year": "2004",
 "id": "31169",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-13T08:00:00.000Z",
 "views": "3111"
}
