{
 "id": 3118,
 "title": "Intranasal vs. Oral",
 "date": {
  "submission": "2005-10-11T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dr. Patient",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "",
   "substance": "Morphine",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "Thursday: I obtain 300 mg morphine sulfate, in the form of MS Contin time release 60 mg tablets.  They are orange and read E 655 on one side and 60 on the other. ",
  "First Dose:  20 mg are crushed, and mixed into tap water.  I wait one half hour and drink.  After 45 mins, some effects are noticed.  I would say this is a 'threshold' dose.",
  "After seeing various newspaper articles on the trials of a new intranasal form of morphine, here is what I learned:",
  "*** 'With intranasal delivery, morphine is absorbed directly into the systemic circulation, bypassing problems that occur with oral administration, including the removal of therapeutic quantities from the bloodstream by the gastrointestinal metabolism and liver.  In contrast, plasma concentrations of a nasally administered drug often resemble those seen with injectable dosage forms, prompting fast onset of therapeutic effect and painless therapy.' ***",
  "So the next day, I crush 20 mg and snort. Immediately I feel a 'thickness' in my head, very odd sensation, similar to that of Ambien. ",
  "T :30: I begin to feel a pleasent rush, very similar to that of hydrocodone, very slight itching around my face and limbs, and a strong urge to walk around.  Very sociable...",
  "T 1:00:  By now the MSC is rushing through my veins.  I take 200mg of caffeine to avoid unwanted drowsiness.  I put in some music and sit down.  Playing guitar and writing is quite enjoyable... great sense of ease, and mild sedation.",
  "All in all a good experience.  I hope this information is helpful to anyone who is thinking about giving morhpine a try.  I would say Intranasal over Oral.  But be cautious, MS Contin does come in large doses, just like OxyContin."
 ],
 "erowid": {
  "id": "20125",
  "citation": " Dr. Patient. \"Intranasal vs. Oral: experience with Morphine (ID 20125)\". Erowid.org. Oct 11, 2005. erowid.org/exp/20125",
  "substance": "Morphine",
  "views": "81522"
 }
}
