{
 "title": "Mental Breakdown",
 "author": "Vorph",
 "citation": " Vorph. \"Mental Breakdown: experience with Paroxetine (Paxil) & Alcohol (ID 31181)\". Erowid.org. Mar 4, 2011. erowid.org/exp/31181",
 "substance": "Paroxetine (Paxil) & Alcohol",
 "bodyweight": "190 lb",
 "report": [
  "<p>I've been taking paroxetine for about 2 months now. I was diagnosed a few months ago with moderate depression and bipolar type 2. At first, it was great. I felt invincible, manic, energetic. The feeling was awesome. But, like any drug, my body became tolerant, and I went back to being my old self again. The difference this time was, I noticed that I felt continuasly stoned, and lost a part of me, the part that actually enjoyed the few things in life that I once enjoyed. It was like I had lost feeling to my soul. So, I started drinking more, and smoking more marijuana, and would notice myself fall deeper in the whole. My relationship with my girlfriend started to deteriorate. I stopped seeing my friends. I lost the ambition and drive at work. I lost the desire for intamcy, and any activities I once enjoyed.",
  "But I think the worst thing that happened was this recent weekend. My girlfriend and I had gotten in a fight on a Saturday. I was extremely rude and mean to her (something that I never was to anyone, especially her). So, I went to a party, had a few beers and came home. I had taken my dose later in the day (I usually take it in the morning) and felt a little out of it. So, it was around 10:00 pm. and we got into a fight. All of a sudden, I'm on the floor, in my bedroom, on my knees, crying uncontrollably. She was comforting me. Apparently, what had happened was, I was sitting on my stairs, and started to bang my head real hard on the wall. At this point I started to walk upstairs, mumbling incoherent words, and when my girl tried to walk in the bedroom where I was, I was slamming the door trying to keep her out. I had some sort of mental breakdown and I blacked out!!! I've had a headache for a few days now, and a huge bump on the side of my head.",
  "Well, I'm continuing to take the paroxetine, and I feel okay now... I've been having re-occurring thoughts of suicide, followed by major depression in the past few weeks. I don't know what's wrong with me, but I'm beginning to think it's the paroxetine.</p>"
 ],
 "year": "2004",
 "id": "31181",
 "gender": "Male",
 "views": "5551",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2011-03-04T08:00:00.000Z"
}
