{
 "title": "Satanic Seed",
 "author": "Spark an Owl",
 "citation": " Spark an Owl. \"Satanic Seed: experience with Venlafaxine (Effexor EQ) (ID 31294)\". Erowid.org. Jul 12, 2010. erowid.org/exp/31294",
 "substance": "Venlafaxine (Effexor EQ)",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "37.5 mg",
  "oral",
  "Pharms - Venlafaxine",
  "(daily)"
 ],
 "report": "<p>Here's the dilly. I was diagnosed with manic depression in the year 2002. I started visiting a shrink to see if there was any way to get my life back on a roll. So far I've had about seven of these drug pushing megalomaniacs each saying something different about my mind state.</p><p>The first, second, and third prescribed Zoloft, an ineffective placebo in my opinion. The next few decided to throw the government's form of cocaine at me, also known as Adderall. Finally I was prescribed a lurid little pill known as Effexor. Effexor the chemical that has made a somewhat gloomy life turn into a full blown downward spiral of anxiety, depression, meloncolly, and pure physical/mental unrest.</p><p>I started ingesting this satanic seed every morning. For the first two weeks there was no significant effect. However, by the third week I started noticing a mild feeling of discombobulation along with a clammy and offsetting sweat. That was no biggy. I could live with it. Within the next week my mind started racing and I began losing precious hours of rest and repose. Stubbornly I continued taking the medication routinely not succombing to the bizzarre change my mind was creeping to. It wasn't long before my conscious rudely slapped me in the face with the realization that something was definetly quirky with this drug. I was feeling inebriated and loopy everyday, paranoia, anxiety, and restlessness grabbed me by the throat and pulled me into a cesspool of depression.</p><p>Unforgivingly, life placed another turd between myself and happiness. My parents divorced, leaving me in custody of my little brother and stealing all my sacred privacy along with the time I needed for my homework. Thus not allowing me to send a plea for help to any professional. So, out of exhaustion and desperation I neglected taking my routine medication, bringing on to me the immense burden of withdrawal. I can only describe the following week and half as the lowest mind state a human can go through without commiting suicide. I felt like the lonliest human being on the face of the earth. I hated everything with a wrath I thought only Lucifer could feel. I could not trust a single human being on the planet including myself. It felt like what I once called life was just a constant threat. My body felt like plastic and my stomach felt like a deflated ball. I was on the verge of suicide, I felt that death was a gift of infinite repose.</p><p>I stopped feeling completely. I remained in this zombie-like state for what seemed like eternity yet turned out to be a mere week. In exhaustion I finally arrived at a weekend. I decided to lay down for a nap. That nap turned out to last the whole weekend. The longest time I had ever slept in my life. I woke up on Monday morning feeling a bit groggy. Tuesday, I felt a slight feeling of relief and finally Wednesday, like being borne again.</p>",
 "year": "2004",
 "id": "31294",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-07-12T07:00:00.000Z",
 "views": "4288",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "37.5 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 }
}
