{
 "title": "Sensory & Tactile",
 "author": "Dopeman422",
 "citation": " Dopeman422. \"Sensory & Tactile: experience with 2C-T-21 & Cannabis (ID 31325)\". Erowid.org. Mar 26, 2004. erowid.org/exp/31325",
 "substance": "2C-T-21 & Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>Set: Looking forward to a mild psychedelic experience & 'The Vagina Monologues'.</p><p>Setting: An auditorium and the dorms.</p><p>[Written before ingestion...]</p><p>a previous experiment with 10 mg (median suggested dose, according to Shulgin) produced no effects. Therefore, I'm titrating to see what an appropriate dose is. I'm currently ingesting 12.5 mg then going to see 'The Vagina Monologues'.</p><p>[...and the day after]</p><p>12.5 mg is quite an adequate dose. For a long time, I couldn't tell if i was +1 or +3, as I was altered to the point of obvious intoxication but could not adequately describe exactly what was going on in my head. After a while, I determined that this compound interferes with verbalization of thought. At verbalization's expense, however, the visual and tactile experience was very cool. Touching things felt great, and with a quick bowl, the visionary art on Erowid began to move and flow. Pot either potentiates or is necessary for this visual phenomenon, as far as my experience goes.</p><p>However, I don't think that this will be a popular compound; not for me, at least. Compared to other phenethylamines, 2C-T-21 had little euphoria and energy. Though the inhumanly happy, hyper-social experience that this chemical lacks is fun and rewarding, what I really missed was depth. There was some insight toward the middle of the way down, but I can obtain this effect from bud, which is what I had just smoked. There weren't any racing thoughts, no intense analysis, no tangentialism, only a little phenomenology, and no shift into the superlative. What's worse, I found myself unable to verbalize my thoughts, ridding me of the ability to describe and analyze the trip. If I can't pick it apart, it's not worth it. On the plus side, there was no body load or hangover.</p><p>Worth a visit, but I don't think I'm going back.</p>",
 "year": "2004",
 "id": "31325",
 "gender": "Male",
 "timestamp": "2004-03-26T08:00:00.000Z",
 "views": "11401",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "2C-T-21",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
