{
 "title": "Energy, CEVs, the Chipmunk",
 "author": "David",
 "citation": " David. \"Energy, CEVs, the Chipmunk: experience with Salvia divinorum (leaves) (ID 31340)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31340",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "150 lb",
 "report": [
  "<p>Previous Drug Experience: Marijuana, Alcohol, DXM, LSA, Dimenhydrinate / Diphenhydramine, Nitrous Oxide, Salvia.  Previous Salvia attempts failed, along with Dimenhydrinate / Diphenhydramine.  Quite experienced with Marijuana, Alcohol, and DXM.",
  "February 27th, 2004:  Ryan and I ordered One Ounce Dried Mazeteca Salvia Leaves online, with the shipment arriving one week earlier.  Ryan had lost faith in our product, but I still believed that Salvia could do wonders to us.  Ryan and I went over to our friends house, who is the owner of a three hosed glass hookah.  So Ryan, two other friends, and I pack a bowl of Salvia into the hookah.  I have read the key to smoking Salvia is to hold the hits in, and I was trying to get the others to do so too but nobody would listen.  They would smoke it like Marijuana, 5-10 seconds maximum for each hit.  But I have read the importance of holding the hit in, and I was determined to do this right tonight. ",
  "First Attempt:\tWe smoked a bowl, the four of us holding it in for around 10 seconds before the exhale.  We all felt something, just a few minor physical feelings and a very short and forgetful thought process.  So after that we pack some Marijuana into the hookah, and get ourselves a fine high going.  At this point, we decide to smoke some more Salvia, and we get the same effects as previously.  But by now there are 10 other people here, mostly all non-smokers. ",
  "The Prelude:  I was determined to go on a Salvia journey tonight, and I got much more than I bargained for.  During my final bowl of Salvia smoked (but not the last smoked for everyone) I decided to try a new way to hold my hits in.  Since it is crucial to hold the hits in, I decided to do this as right as I could.  I take a huge hit, and hold it in for as long as I can (about 20 seconds).  But instead of the exhale, I decided since its crucial to hold it in I will exhale just a little bit and suck some oxygen into my lungs to fill that place.  I then held this in for as long as I could, and proceeded in doing the exact same thing again.  I did this for a very long time, easily three minutes (about 25 short exhales and small inhales).  By now people have taken each about 5 hits or so.  I take the hose again and do the exact same thing, but sit down on a chair outside of the circle everyone was crowded around.  When I would inhale oxygen, I would lift my head up and look at the people then tuck my head by my knees and rest there, until I needed oxygen again. ",
  "The Messiah:  The next segment is very hard to explain, so please bear with me for now.  I started getting some really intense Closed Eyed Visuals.  I saw this little creature, four inches in height, and he lived inside of me.  He was red, and was made entirely out of muscle (imagine pictures of the human bodys muscles, not with their skin, but their actual muscles).  His hands and feet came to a point, like a rounded spear head.  His face resembled a squirrel or chipmunk, and he was my inner being, he was at the center of me, and where he moved I moved. ",
  "The hit that I held in this time (my second hit) went probably for 8 minutes.  So I saw this red muscular chipmunk inside of me, and I decided I needed an inhale.  So I looked up around everyone and saw I was outside of the circle, did a small exhale and inhale, and then I tucked my head down again and continued on my journey.  Now this little chipmunk got kind of excited that I was outside of the circle and how weird the situation must seem and look to everyone, even though nobody is paying attention.  This squirrel's face and body tightened extremely far, the most I can flex my muscles multiplied by one million.  In turn, my face and body did the same.  My face muscles included my cheeks flexing around, my tongue coming out of my mouth, and I felt like I was shriveling up.  Then I thought about the situation and how I was outside of the circle and I thought of it in disbelief, of how actually strange it was that I was sitting out there experiencing this.  So when I needed my next exhale, I visualized the situation that just happened, and a hand grabbing it and pulling it away like it wasnt real.  Then I looked up and took another short exhale and inhale, and put my head back down.",
  "This is only my second time holding it in for this second hit (I remind you it goes on for 8 minutes).  When I look around, the situation would get progressively weirder.  I had all of this energy inside, building around me and I could feel this energy flowing all through me, radiating two feet outside of my body.  When I say the situation got progressively weirder, an example is such.  The first time I was sitting outside of the circle alone and the next time someone might have looked at me.  When I put my head back down, the realization that it got a little weirder made me repeat the exact same thing again in my head, but feeling more energy and my muscles getting even tighter in my face, which didnt seem physically possible at that point.",
  "This carried on for 8 minutes.  Everything would get weirder, like two people would look at me.  Then I would see this squirrel creature tighten up and control me and I would be freaking out inside because the situation kept getting weirder and I didnt think it could get any weirder.  Eventually, after 8 minutes, everyone noticed me and had no clue what the fuck was happening.  It kept getting weirder, from people talking to me to eventually everyone standing in a semi circle around me staring at me not knowing what the hell is going on. ",
  "In my mind I thought of it like the movie Memento.  Each scene to come next would add a new twist to what I was experiencing and seeing and feeling.  My face was going crazy flinching and tightening and I was flexing my arms and jerking them around with all the energy I had.  I eventually realized I had to stop what I was doing, and I finally just stopped suddenly, and proceeded to exhaled all my remaining smoke. I previously tried to stop what I was doing, but when I would try to stop and I would fail in doing so, and in turn the situation got ten times weirder because I tried to stop what I was doing but I couldnt.  I had experienced the greatest thing in the world, and nobody had any idea what happened.  So I stood up and started freaking out and trying to explain, but in their highness and confused state nobody would listen.  So I spent the rest of the night on the couch relaxing, bathing in the experience that I had gone through alone.",
  "I cant even remember a lot of the details from what I experienced, these are just the vague recollections I have remaining in me.  Salvia is recommended for everybody, but please do it in the right environment and with no people around.  I plan on purchasing the same One Ounce Dried Mazeteca Salvia Leaves.</p>"
 ],
 "year": "2004",
 "id": "31340",
 "gender": "Male",
 "views": "4179",
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "submissionDate": "2007-11-14T08:00:00.000Z"
}
