{
 "title": "MonoSensory",
 "author": "Nugget",
 "citation": " Nugget. \"MonoSensory: experience with LSD and Cannabis (ID 31419)\". Erowid.org. Mar 2, 2007. erowid.org/exp/31419",
 "substance": "LSD and Cannabis",
 "bodyweight": "115 lb",
 "report": "<p>This is something that only happened a couple days ago, so I am still coming to terms with it.  It is also very hard to explain or understand unless you've been there, but bear with me.</p><p>I had received a piece of paper from a friend way back in July, and had immediately put in in my freezer for safe keeping.  I had never done LSD before, and I wanted to wait for an opportune time to have a good experience.  Back in May, I had had a rather disturbing trip on foxy, and I had been cautious about tripping again ever since.</p><p>I started thinking about the paper being in my freezer earlier in the week, knowing it was going to be nice outside on Saturday, and really wanting to trip as I felt my mind had been stagnant all this time.  Plus I wanted to make sure I could handle it on my own, knowing that if I could, I would be able to handle it with other people.</p><p>So I put the paper on my tounge at around 5:30 and left it there for about 25 minutes.  Initially, I didn't think anything was going to happen, and I was sitting at my computer having a slight body buzz.  Then after an unknown amount of time passed, I found myself sitting indian-style in the center of my room, not knowing how I got there or how long I'd been sitting there.</p><p>The next couple of hours went like any other trip in that I had some beautiful visuals, except I could definitely feel a difference in how it affected my mind as opposed to shrooms or foxy.  I was occasionally on the phone with some friends in Indiana who were also tripping, and I had some random visitors, but mostly I was alone around my house; dancing to music, watching some visualizors on winamp, going outside and enjoying the peace I always experience on nature.  The body buzz was very intense, my legs were shaking so hard that whatever surface I was sitting on vibrated.</p><p>At around 11 I believe, I got a call from the friend who had given it to me, and he was in town so he said he was coming over for a visit.  He got here and we started on a walk around my neighborhood, and my trip was feeling like it was winding down, aside from the fact that I still felt fairly jittery.  On the way home he pulled out and prepared some Cannabis, and I thought it might be a good idea, as I knew it would chill me out and relax my body some.  I didn't feel like I was tripping anymore, the hit seemed pretty weak, so even though I had received some warnings about smoking and tripping, I decided I would be okay.  We smoked all the way back to my house, and then sat out back and smoked and talked some more.</p><p>Suddenly from the next court over I heard what sounded like someone yelling.  I thought maybe I was having auditory hallucinations, but I looked over at my friend and he was reacting to it as well.  He started walking over towards the sound of what was a couple breaking up.  It was dark so we couldn't really make out what was going on, but I am fairly sure at one point or another someone hit someone else, probably more than once. </p><p>I was hesitant to follow, as I could only see what I thought was one person sitting on the ground, and I thought it was the girl and didn't know where the guy was, thinking he might jump out at us from anywhere.  As it turns out the guy was laying on the ground and the girl was kneeling next to him.  My friend later told me that the guy had just fallen down.  After a few minutes of us standing there asking if he was ok and what he was on, the guy said 'just had too much to drink, man' and we turned around and headed back, not really knowing what else to do.  The couple continued breaking up until a neighbor told them to leave, and then they were gone.</p><p>We went back and sat down, smoked a little more, not really believing that that had just happened.  I was fine, just a little shaky, or so I thought.  Then I closed my eyes and saw some very beautiful closed-eye visuals forming, and then when I opened them again, they were still there.  I started freaking out, as when my trip went bad last time, this exact same thing happened, and I took it as an indicator.  I told my friend I was flipping out, and we headed inside.</p><p>Now, the fractal pattern that was threatening to obscure my vision faded away.  But I was having trouble functioning.  I could only perceive certain aspects of reality at certain times.  My friend stood right in front of me with his hands on my shoulders, but all of a sudden he would disappear.  It felt like the blood was rushing through my body so fast that any touch sensations I might have had were completely muffled by it. </p><p>I started to question whether or not I was there.  I would appear to not be there unless I focused all of my attention to looking down on myself, seeing my body.  I couldn't hear what my friend was saying unless I focused everything on that, and then if I said something in reply, soon after I would begin to wonder if I had actually said anything out loud, or if the conversation had taken place at all.  As far as hallucinations went, nothing looked out of the ordinary aside from the fact that I could only focus on small portions of my field of vision at a time, everything else would disappear, as I kept doing and so did my friend.</p><p>The best way to explain it would be it was as though every individual sensory input that usually works with all the others to create reality was firing at me extremely intensely, only one at a time.  If I was listening to something, I couldn't feel, see, or anything else.  I started to question my actually being there because with everything so broken up I didn't understand where reality was.</p><p>This went on from probably about 12:30 to around 6 or 7 in the morning.  My friend left around 3:30, and I was tired but unable to sleep.  I had been trying a great many things to bring reality back; we had attempted a board game, I tried smoking a cigarette, watching t.v., listening to music, changing the setting of where I was, anything that was condusive to normalcy.  Nothing worked.  Slowly towards the end, it was as though the different pieces of reality started quilting themselves back together, and eventually my world was whole again.</p><p>I knew eventually I would get back to normal and I never lost sight of that.  Towards the end I found it almost fascinating because I could focus whatever aspect of perception I needed at any given time, if I needed to hear something, I could focus my attention on that, and the same applied to all of them.  I just couldn't make more than one happen at once.</p><p>The overall experience was extremely intense, and I now feel as though there's something there to be learned, though I have yet to figure it out.  It was not overly negative but I do think it was much more than I can handle, and I do not think I will be smoking while tripping any time soon, or ever again most likely.  Having reality somewhat stiffled is what makes tripping amazing, but having it completely gone is an entirely different experience, one which I don't think I want to have again.</p>",
 "year": "2004",
 "id": "31419",
 "gender": "Female",
 "timestamp": "2007-03-02T08:00:00.000Z",
 "views": "3478",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 4:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
