{
 "title": "Life After the Rave",
 "author": "Space",
 "citation": " Space. \"Life After the Rave: experience with Ecstasy (ID 3142)\". Erowid.org. Feb 15, 2001. erowid.org/exp/3142",
 "substance": "Ecstasy",
 "bodyweight": "136 lb",
 "header": [
  "DOSE:",
  "1 capsl",
  "oral",
  "MDMA",
  "(capsule)"
 ],
 "report": "<p>I have experienced extremely severe post-E / post-rave depression for about one week, followed by mild depression for several more days.  Feelings of being emotionally (and intellectually) drained often accompanied the depression.  It seems to me that decreasing the dosage of E (i.e. taking 1/2 cap) can drastically reduce the side effects while having no derogatory effect whatsoever on the high or peak.  However, most importantly, my observations have led me to believe the following very strongly:</p><p>1) Every individual must realize that their experience is unique.  Every individual also has different reasons for using MDMA and different expectations/'goals'.  Thus, awareness of one's state and of possible effects are important.</p><p>2) The experiences during the 'high' may be responsible for negative side effects as much as (or more) than the actual chemical effects.  For example, I have found that depression can be worse the more enjoyable the experience.  Being well aware that the experience will end and coming to terms with this may ease the depression.</p><p>Also, I have personally found that taking the herbal supplement 5-HTP has helped in easing the depression.  (It has never worsened the situation.)  I have taken it before, during, and after MDMA use.  It also seems to help when taken as negative depression arises.</p><p>As a side note, I believe that more negative effects arise when one relies completely / very strongly on MDMA to have a good time.  Using MDMA to enhance an already pleasurable experience seems to be a different story altogether.  If one can enjoy a particular activity (eg. going to raves) sober, then one may be less at risk of abusing MDMA to an extent where negative side effects are of considerable concern.  If one's goal is simply to 'get fucked' or to push limits, eventual negative experiences would most likely be more probable amd more numerous.</p>",
 "year": "2000",
 "id": "3142",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-02-15T08:00:00.000Z",
 "views": "6116",
 "dose": {}
}
