{
 "title": "Immensely Disappointed",
 "author": "Deformed_Neuron",
 "citation": " Deformed_Neuron. \"Immensely Disappointed: experience with MDMA (Ecstasy), Alcohol & Paroxetine (ID 31477)\". Erowid.org. Mar 3, 2004. erowid.org/exp/31477",
 "substance": "MDMA (Ecstasy), Alcohol & Paroxetine",
 "bodyweight": "67 kg",
 "report": "<p>Ok, this is not the first time I have tried MDMA, I have *probably* tried it on at least 7 different spread out ocassions, and have been more than disappointed on the outcome of the past couple of experiences.</p><p>It basically started off as a regular evening at 'The Office' (Home), after work, chilling with a few quiet drinks and waiting for some phone calls to come through.</p><p>I was waiting for a particular mate known as 'L' to come by as I was in *friendly* debt to him of not a great deal of cash, but was desperate to pay it off, as I'm not one that really likes the burden of owing my hard earned money to fellow 'Hard-Workers'..</p><p>Anyways.. 'L' had come by at about 1:40am in the morning (E.S.T.) to pick up his cash (please note, that this was a good 2-3 hours after taking my daily dosage of Paroxetine/Aropax pills and I was still in the process of knocking down cans of the beloved Pre-mixed Jack Daniel's and Cokes;)). I handed over the money I had owed 'L' after visiting the nearest A.T.M. and as I did this I had asked if he had any pills on him, as I know he is a very, actually more than frequent MDMA 'Pill-head'. 'L' simply replied with 'I only have two left and I'll throw one your way as a freebie for the punctuality of payment.'</p><p>I dropped at what was now probably 2:15am, and expected the effects to be rather intense when they hit, I heard good stories of these pills off various other sources (they were white-bluey speckled VW's, just in case the reader is curious)</p><p>But to my disappointment, when I finally felt the effects of the initial MDMA high, they were very subtle and not so very sensual as what is expected. Now I know for a *FACT* that these pills were good quality as 'L' was rolling fairly hard, also taking into consideration that he drops on a more frequent basis than I.</p><p>Basically I felt 'Nice', but not 'loved-up' as what I had expected, and was just wondering if this is really all that a common occurence where ingesting SSRI drugs such as Paroxetine is concerned. I have read recent reports that SSRI's can reduce the effects of psychedelics and stimulants, but should it have been this noticable, I mean... I was almost on above Baseline.. plus I *KNOW* these pills are very potent.. I know this is more than likely boring the absolute crap out of the reader, but I would love to see more extensive information on the action of SSRI's and amphetamines/stimulant-like drugs.</p><p>Peace-out and happy dropping;)</p>",
 "year": "2004",
 "id": "31477",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-03-03T08:00:00.000Z",
 "views": "7456",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "7 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  },
  "2": {
   "time": "",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
