{
 "id": 3148,
 "title": "Succesful New Method",
 "date": {
  "submission": "2004-10-01T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "john",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "rectal",
   "substance": "Hydrocodone",
   "form": "(extract)"
  }
 ],
 "report": [
  "I had been recently reading about rectal administration of various substances and found no reports detailing the use or success of pharmaceutical opiates being used rectally.  Being a scientist, I was immediately curious so I set myself up as test subject number one...",
  "I took four generic Vicodin pills (10mg hydrocodone + 660mg acetaminophen) and did the cold water extraction process.  When I was done, I was left with a beaker of ice-cold water containing somewhere between 30 and 40mg of Vicodin and considerably less than 660mg of acetaminophen for a total volume of about 50ml (about an ounce).  I placed the beaker in a hot-water bath for about ten minutes to bring it up to a comfortable temperature.  Then, using a soft plastic eyedropper, I administered the solution to myself rectally.  The small amount of solution was easy to hold in.",
  "Within 20 minutes, I began to feel effects.  The experience was typical of that dose of hydrocodone.  I felt no nausea (which I sometimes do on prescription opiates), and overall had a very enjoyable time.  The experience seemed to last about two hours, a little less than I would have expected from an oral dose.",
  "Overall, the onset and comedown seemed to be fairly fast, perhaps what you would expect if you took the hydrocodone on an empty stomach.  The only change I would make would be to use a true at-home enema kit instead of an eyedropper.  The process of getting all the liquid in was somewhat tedious.  If you are going to try this, be sure you know how to properly administer an enema.  It is possible to injure yourself if you don't know what you are doing."
 ],
 "erowid": {
  "id": "20206",
  "citation": " john. \"Succesful New Method: experience with Hydrocodone (ID 20206)\". Erowid.org. Oct 1, 2004. erowid.org/exp/20206",
  "substance": "Hydrocodone",
  "views": "68337"
 }
}
