{
 "title": "I Need More...or Do I?",
 "author": "white girl",
 "citation": " white girl. \"I Need More...or Do I?: experience with Cocaine (ID 31493)\". Erowid.org. Mar 17, 2004. erowid.org/exp/31493",
 "substance": "Cocaine",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>I tried cocaine for the first time only about four months ago.  I had a friend who had a dealer that lived above her at her apartment complex.  He was always trying to get us to do it with him but I was a little resistant because I had a friend that I saw go through a bad addiction to it. </p><p>However, I will never forget the first time her and I finally gave in.  He gave us each two lines and we went outside to smoke a cigarette afterwards and I remember so vividly this sudden hit of comfort...I felt like I was invisible and that I could be confident in anything I was to do on this new high.  I had been really into Extacy the few months prior to my first experiance with coke and after skiing, I just remember thinking how different and real coke felt.  I loved that I didnt look or act impaired on this drug and that it gave me this charming effect where I wanted to be in a social enviornment.  Her and I ended up buying a gram and decided to go to a party.  It still baffles me to this day how long we made a gram last between two people.  But that was soon to change.</p><p>The new year came and her and I began buying a gram every day throughout the first weeks in January because it was so easy for us to get.  However, a gram a night turned into two and soon enough we were buying eightballs (3.5 grams) and going through them faster than it used to take us to do a gram.  I even used to be a big drinker and I went the first two months of the new year and only drank about 2 or 3 times.  All I was doing was coke.</p><p>Then the money ran out.  But, I knew a solution: my mom had a stash of cash she kept at my parents house and I began taking money from it.  To make a long story short, about three weeks ago my parents found the money and informed me that almost $2000 was missing.  I was shocked.  I had no idea I had taken that much. </p><p>It was at that moment that I was overwhelmed with guilt and this feeling of, 'I never want to do coke again.'  So I was clean for a week, and that was when the psychological battle in my head began.  Besides the usual headaches and sneezing I didnt have any severe physical withdraw symptoms, however there is a part of my brain that craves it in a way that is an indescribable type of torture.  I feel the cravings from the depths of my skull to the tips of my toes.</p><p>I am actually on cocaine right now, its the first time I've done it in about 2 1/2 weeks and I have extremely mixed feelings.  I didnt even do a grams worth but it was enough to gain back that euphoria and release the terrible aching I had been experiancing to get more.  But now I sit here putting my entire situation into perspective and I'm beginning to see that maybe it isnt worth it, and for the first time I think I'm beginning to come down from the high and not want more.</p><p>My purpose in all of this is mainly to share my experience and explain my consequences and make anyone who reads these entries to be aware of when you take your using too far, because I know that I sure as hell did.  I know the battle in my head will insue tomorrow when I have a headache and will only want more, but I do believe there is hope in that my logical thinking is beginning to kick in again and make me see that it has truly changed my life.</p><p>So to anyone doing coke, or thinking of doing it, just be aware of the mental addiction and use carefully, and if you ever get to a point where you steal in order to get it...stop using, or at least give it a rest for a while.  And I wish the best of luck to anyone trying to beat this craving as I'm going through the turmoil of it all now, so just remember to figure out where to draw the line and not to cross it.  It will catch up to you.</p>",
 "year": "2004",
 "id": "31493",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-03-17T08:00:00.000Z",
 "views": "17600",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
