{
 "title": "Very Enjoyable if Used Correctly",
 "author": "Mike",
 "citation": " Mike. \"Very Enjoyable if Used Correctly: experience with Caffeine (ID 3149)\". Erowid.org. Oct 29, 2000. erowid.org/exp/3149",
 "substance": "Caffeine",
 "bodyweight": "130 lb",
 "header": [],
 "report": "<p>Up until recently I had been drinking coffee at least once or twice a day. After reading 'From Chocolate to Morphine' I realized I was addicted. Even before my reading, it was starting to become obvious. From my morning cup I got only a very slight increase in energy quickly followed about 1/2 hour later by feelings of tiredness. The effects weren't noticeable at all; I was just drinking coffee as a habit.</p><p>So I decided to quit. I went one morning without my coffee, thinking I would go through little or no withdrawal. I was wrong. I felt horrible that morning. At one point I decided I was too weak to resist the urge for caffeine; I would go back to using it the next morning. I was clearly having cravings for the drug. These bad feelings went on for a couple hours. Then all of a sudden they halted. They didn't trail off gradually, instead just went from moderate to completely gone. In one second. A couple minutes later I began to feel surprisingly relaxed. Twenty minutes later I began to feel moderate euphoria and even more relaxation, similar to that of a low opium dose. I am guessing that the caffeine had completely replaced some chemical in my brain that causes relaxation. Then my body all of a sudden began production again, after it realized there would be no more caffeine intake. The effects of this chemical were amplified because I had not 'used' it for such a long time.</p><p>I decided from that point on I would use caffeine only for a specific reason, not habitually. A few days after I quit I wanted to begin my every-other-day weightlifting routine but was too tired to do it. So, I brewed up some coffee using three tablespoons of the kind I usually made. Three tablespoons was my normal amount, so I wasn't expecting anything more than a slight energy boost, if that. The buzz came on as usual after about 10 minutes and I was expecting it to wear off just as quickly. However, it just kept getting stronger. The energy boost was very noticeable and I was even beginning to feel some euphoria. This buzz lasted a little more than three hours, and after it was over I did not experience any kind of crash like I usually do. It just kind of trailed off slowly like a good stone.</p><p>If you don't have anything else and you want to feel good, caffeine will do the trick. I would definitely recommend it over low-grade weed, but hopefully you are not in such a situation. However, don't use it too much; if you do it will lose its fun very quickly. I would say once a day is too much. Also, don't buy a cup of coffee. Grind it yourself and make it yourself. This way you can assure your cup will have a sufficient amount of caffeine in it.</p>",
 "year": "2000",
 "id": "3149",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-29T07:00:00.000Z",
 "views": "31486"
}
