{
 "id": 3150,
 "title": "The Light Shines Out Of Me",
 "date": {
  "submission": "2005-10-21T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Svetlana",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  },
  {
   "time": "0:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "This being my first time with E, combined with the general curiosity of some of my friends, has led me to be asked the obvious question a few times - 'So, what's it like?'. And what's surprised me is how taken aback I am that I can't really answer easily, or compare to any great extent, and how uneloquent the words seem to be that come out when I try to tell them. Drugs had always seemed to be things that put you into a certain mental state - pot makes you stoned, alcohol makes you drunk, etc., it's not like you drink alcohol and then choose to make yourself drunk after a while if it seems a good idea. It just happens.",
  "E, instead of changing perceptions directly, seems instead to alter the meta-level of what our perceptions mean to our consciousness and how they relate to each other. One second it's like nothing's changed, the next it's obvious that things are completely different in some way but I can't conceive that things have ever been any different in the past. I don't think or feel things that I wouldn't feel in day-to-day life, but I experience them in a different way, more fully, fitting the emotional context lacking in memory and intellectual thought back to the language, things which are usually unconscious coming back into my head again, a head in which things are happening at the speed of light and things seem to posess absolute clarity. This clarity is a combination of language and feelings which can't be expressed linguistically; it disappears when it's broken down into cold words somewhat, although to what extent depends on the audience's similar experiences, if any, and degree of natural empathy. And, as described earlier, as E isn't really similar to anything, it basically boils down to - if I've done it myself, what people write about it makes sense. If not, it's into 'describing sex to virgins' territory. So, to the uninitiated, if you think the words sound interesting, the experience is doubly so.",
  "So, enough waffle, and what actually happened? Well, it just so occurred that a friend of mine happened to pick up a couple of pills off some random guy while on a night out, and due to a combination of general fear and suspicion of their content and effect, laziness, lack of opportunity and general police-based threat, though mostly the first of these, they remained untouched for many a week. Eventually, it got to the point where we both became generally irritated by unsatiated curiosity, and so eventually it was decided I act as official poison-tester, do one, and report back if still alive on what I thought was in it. Not rating too highly the reliability of random blokes on the street, I expected at best some weak E cut to hell with something, at worst some cheap shitty stimulant high. Still, I was hopeful.",
  "Well, one evening at home I was bored, so I decided to take the thing, for lack of anything else to do. At about 9pm I had a small amount of the pill to make sure it wasn't something truly horrible which would lay me out shivering and sweating or other crazy fears. It was very bitter. Nothing happened, except my heart rate going up through stress/expectation/anxiety/whatever. At 9.45ish I had half the pill, kept reading, not much happening, possibly a slight alert and slightly greater sensibility to sounds, nothing major. 10.15 or thereabouts, took the other half, kept reading. Still nothing much, as far as I could tell just slightly energised but just interested in the book and going through it. Nothing really changed.",
  "Then around 10.45 or so, I don't know what it was, maybe just getting up to open a window because things seemed a little warm, but all of a sudden, with no hint of warning or noticable change whatsoever, everything was completely different. I felt the universal empathy before I could process it properly, but when it came out as recognisable thoughts, it was something along the lines that everyone deserved to be loved and deserved the chance to love each other and that all of the unconscious mental debris and crippling social convention and order that held it back was a result of the expression of these needs being blocked, or being unaware that the needs actually existed because of a lifetime of enforced internal and external repression. 'Everything is beautiful except hatred and order' I wrote at one point in the experience, as well as some rather less concise stuff about the limiting effects of ritual, convention and unthinking conformity, repressed and unadmitted general love, and the limitations of language.",
  "I talked on the phone to my girlfriend for about an hour, which seemed a lot less, during which a few other effects of the drug became apparent. My thoughts moved at a great speed but short-term amnesia was ever-present, so I'd repeatedly go off on a tangent and need to be reminded about what I was talking about 2 minutes before. Also, there was no quality control on what came into my head in conversation, as I found out when I switched from a general discussion of the human condition to talk about children's TV for about 5 minutes because it seemed an interesting place to go. It was good there was someone understanding and patient for when I went off and talked about Knightmare (an old UK program of schoolchildren with buckets on their head being guided around computer-generated fantasy lands, for American viewers) in a random and ultra-enthusiastic way at the exclusion of anything in any way profound. But the general connection and level of conversation and exchange of ideas and love was amazing.",
  "When I left her to go off to bed, I stuck the TV on and watched some of the day's football. Everything I focus my attention on while on E seems like the most interesting thing in the world, be it TV football, conversation or a book. Not usually a huge football fan I found myself being drawn in to the excitement of players and fans of teams I normally wouldn't care about at all (Fulham, etc). It finished, I watched some dire black-and-white prison escape film for a bit (seemed quite interesting at the time) and went to bed and lied there for a bit. During this 'peak' time the physical effects were subtle but very enjoyable. It felt like a series of warm shivers were flowing downwards through me, a bit like having a really satisfying shower, while everything just seemed really warmly comfortable at the same time, like the feeling immediately post-sex. General internal warmth was the order of the day, at any rate.",
  "Unsurprisingly, I couldn't sleep, so about 4am or so, I got up and wrote a short story for a bit, but most of the main effects had worn off by this time. Insomnia and lack of fatigue response was the principle effect now. A couple of hours later, I went back to bed. The time between this and going to sleep was the only real evidence of any particularly hefty comedown as described by others, which was manifested in images and sounds in my brain of crying babies and military helicopters. God knows why. This wasn't too horrific and I was asleep before long anyway.",
  "The next day there was no emotional comedown, though I was a bit languid and energy-less, but then I didn't sleep for too long so that might have had an impact. I felt a residual sense of extra empathy for humanity in general for the day and I think a small extent of that will probably persist permanently. I was disappointed by the moderate amount of amnesia about the happenings of the previous evening, but it was less profound than if I'd been drunk instead, so it could be worse. All in all, it was a very positive experience, and best of all one which can now be repeated by my friend without all my general anxiety about bad effects. There was no music during this experience, so next time I meet E again, that's something I'm looking forward to. Be prepared - try and have someone who you can talk to freely, and who revealing deep things to, or babbling on randomly, won't cause a bad rebound on you. Have fun!"
 ],
 "erowid": {
  "id": "20217",
  "citation": " Svetlana. \"The Light Shines Out Of Me: experience with MDMA (Ecstasy) (ID 20217)\". Erowid.org. Oct 21, 2005. erowid.org/exp/20217",
  "substance": "MDMA (Ecstasy)",
  "views": "4522"
 }
}
