{
 "id": 3151,
 "title": "One Is Enough",
 "date": {
  "submission": "2000-06-22T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "W.C.",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>All my friends had different opinions on ecstacy. Two friends said it was the best thing they had ever had, one said it didn't do anything, and one said that I shouldn't try it because 'it detaches your brain from your spinal column.' Even with the last bit of misinformation I decided to try it.",
  "I went to the apartment of two of my best friends one Saturday evening. We three, took one pill each (Mitsubishi DoubleStack). Then we started packing up their waterbong. They assured me that this would at least keep our minds off the MDMA until it's effects started. It did just that and I also believe that it had an interesting side effect, I'll discuss that later. About 45 minutes after taking the pill, my two friends were already equipped with water bottles and black and mild tips to chew on, and I started having this wonderfully euphoric feeling. My two friends were already feeling the effects. I had tingles all over my body and I couldn't keep from just feeling completely content. I was feeling the effects of the smoke, but I wasn't lazy like normal. I was perfectly happy just sitting and observing my friends conversation and the same second if one of them wanted to go for a walk or go across the hall to talk to the neighbors I was ready and willing to go. All I can say is my first time was wonderful and I think that we became 10 times better friends that night. We had no problem letting down our guard and just being exactly who we really were.",
  "The second time I tried ecstacy I was at the same friends' apartment. It was a Friday night about a month and a half later. This time there were about 10 more people. Most of whom I had never met before. This time I had a pill waiting for me when I got there, it was supposed to be the best thing around. A female aquaintance and I took our pills at the same time. She had only rolled for the first time the day before this. About a half hour into the pill neither one of us had felt anything. The only other person that took the same kind of pill was rolling out of his mind, but it was his first time. We assumed that there was something wrong, it also seemed like we had been waiting forever. So we each bought another pill, a different kind from a different person. We took those. Man. It was a speedy roll. And it was a great one. I can't say it was better than the first but it was different. The female and I became really close that night, not sexually. The next morning it seemed just like the morning after the first roll. A day later I was severely constipated, bleeding from the rectum and almost went to the hospital. Since then I have been /extremely/ hesistant about ever trying ecstacy again. But I came to the Vaults of Erowid tonight and read enough info on MDMA that I feel like I understand why that happened. One of the article said that a larger than 150mg dose of MDMA just causes a speedier roll and increased side effects, no more euphoria, no longer roll, nothing really worth the extra $25 or the extra side effects. Point being 1 is enough.",
  "ALWAYS RESEARCH WHAT YOU TAKE!</p>"
 ],
 "erowid": {
  "id": "2022",
  "citation": " W.C.. \"One Is Enough: experience with Ecstasy (ID 2022)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2022",
  "substance": "Ecstasy",
  "views": "3890"
 }
}
