{
 "title": "I Think I Damaged Myself",
 "author": "mGoLos",
 "citation": " mGoLos. \"I Think I Damaged Myself: experience with 5-MeO-AMT (ID 31519)\". Erowid.org. Mar 5, 2004. erowid.org/exp/31519",
 "substance": "5-MeO-AMT",
 "bodyweight": "68 kg",
 "report": "<p>Lets be clear on one thing; I was never stupid enough to actually take 30mg of this horrible substance all at once. I took 5mg the first time, then 10mg and finally a stupid and dangerous dose of 15mg. After the second time I swore to myself to never do this stuff again, but as always with me and drugs I found myself dosing again.</p><p>'One last time.' Have you ever said that to yourself? If so, you probably have a problem with drugs. I can't have drugs lying around the house, I always end up taking them sooner then planned. I have this idea that I can easily wait a month before doing it again. This idea is always formed when affected by a substance or have hangover and instantly forgotten when depressed or bored.</p><p>Here's a little quote from my last report: 'God knows what would have happened if I had taken the 15mg I had planned on' Yes, I am THAT goddamed stupid and I think I damaged myself with the last 15mg.</p><p>It's been three weeks since ingestion and I still have visuals, but not all the time. On a normal day I have between three and six open eye visuals. In the corner of my eyes I see something rapidly move by, I instinctively look, but nothing is there. Sometimes stuff will shift just like they did while tripping and twice I've been completely blinded by vibrating blue lines.</p><p>I have moodswings now, one moment I'm looking forward to the weekend and in an instant I'm not, because I think I'll be bored. I'll be tired, but I won't go to bed because the idea of a workday is unbearable. I remember liking my job, but I can't bring that back. A shadow shifted while I wrote the last sentence...</p><p>I have headaches and I get dizzy to the point where I have to sit down. I keep getting these annoying chills as well, they don't last long, but during one my entire body is shaking. Luckily these are not frequent.</p><p>There is no doubt in my mind that these things are caused by fooling around with this chemical. I have taken nothing else since. I will write another report if anything changes, in the meantime I should see a doctor but I doubt if I will. We'll see.</p><p>------------------------------</p><p>Update Submitted: Jun 20 2004</p><p>Just a quick update. The symptoms I described in my previous report, 'I think I damaged myself', have all completely dissapeared. Thank god. I have no idea what it was, but 1 month of after-effects from 15mg seems impossible. It must've been a light HPPD experience. Visuals are gone, mood-swings are back to normal (the weekly case of mondays and regret/paranoia from having smoked hash every night for the last four odd years) and I'm no longer getting chills or attacks of dizziness.</p><p>Lucky me. Have the self-respect I didn't have and avoid this horrible chemical.</p><p>Trip safely and NEVER take brave/stupid doses. mGoLos</p>",
 "year": "2004",
 "id": "31519",
 "gender": "Male",
 "timestamp": "2004-03-05T08:00:00.000Z",
 "views": "12983",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "",
   "substance": "5-MeO-AMT",
   "form": "(powder / crystals)"
  }
 ]
}
