{
 "title": "Very Strange",
 "author": "br0ken",
 "citation": " br0ken. \"Very Strange: experience with Butorphanol (Torbutrol) & Cannabis (ID 31534)\". Erowid.org. Mar 5, 2004. erowid.org/exp/31534",
 "substance": "Butorphanol (Torbutrol) & Cannabis",
 "bodyweight": "200 lb",
 "report": "<p>Okay, this experience happened roughly a week and a half ago, and my memory is a little shaky.  I have a good amount of experience with opiates, particularly oxycontin.  My tolerance, however, was at an all time low after a four-month abstinence.</p><p>I obtained a bottle of Torbutrol from a veterinarian for administration to my cat.  The pills came in 1.25mg pieces (5mg whole). I browsed the web to see what I could dig up on these pills.  To my surprise, I found that they are an opiate synthesized from thebaine.  I further looked into it, and found that there was a form called 'Stadol' which was an aqueous solution designed for insufflation.  I immediately grew anxious to give it a try.</p><p>I started by snorting 1/4 of a pill.  The burn was bearly noticable, but the drip tasted putrid- about two or three times worse than oxycontin.</p><p>I waited a couple of minutes and felt nothing.  I then went ahead and bumped the other three quarters. </p><p>I proceeded into my room to play Amped, a snowboarding game, on my X-Box.  Within a couple of minutes I noticed a warm sensation beginning in my stomach and radiating out into my legs and arms.  Soon, I found myself somehow scoring higher than I ever had before, even though I was barely paying attention to what I was doing.</p><p>After about ten minutes of X-box, I decided to lay down.  That's when it hit me like a ton of bricks.  The room was spinning, and I had an awesome warm, jello sensation througout my entire body.  It was pretty incredible, for a veterinary medicine.</p><p>I was soon walking around socializing, growing a little antsy.  I could tell the effects were winding down. </p><p>I proceeded to my room and bumped another pill.  This time it hit me extremely hard.  I light up a bowl and laid on my bed.</p><p>I was completely disoriented, and what started out nicely turned dreadful.  I had read of the dysphoria associated with high doses, and stupidly I ignored the advise. </p><p>I soon was feeling terrible feelings of panic and fear, potentiated by the pot.  I had the feeling that everything was out of control.  Within thirty minutes I passed out entirely.</p><p>What was to follow was the most horrific, hellish, terrible nightmare I have ever experienced.  I will never forget it, either. </p><p>I was walking through all sorts of hallways and everywhere, there were mutilated corpses hanging from the cieling.  There's much more to it, but words fail me.</p><p>The bottom line-  It was worth the experience.  The nightmare was horrible at the time, but bah, it was just a dream.  I now sit and try to analyze it and see what I can find.  For, in my mind, there is no such thing as a bad trip.</p><p>I highly recommend keeping the dosage low, and resisting the temptation to redose.</p>",
 "year": "2004",
 "id": "31534",
 "gender": "Male",
 "timestamp": "2004-03-05T08:00:00.000Z",
 "views": "33935",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.25 mg",
   "administration": "insufflated",
   "substance": "Pharms - Butorphanol",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "3.75 mg",
   "administration": "insufflated",
   "substance": "Pharms - Butorphanol",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Pharms - Butorphanol",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
