{
 "title": "For Finals",
 "author": "John",
 "citation": " John. \"For Finals: experience with Amphetamines (Dexedrine) & Methylphenidate (ID 31543)\". Erowid.org. Mar 5, 2004. erowid.org/exp/31543",
 "substance": "Amphetamines (Dexedrine) & Methylphenidate",
 "bodyweight": "155 lb",
 "report": "<p>The unfortunate thing about my experiences (besides their effects) is the fact that i really have no exact measure of the dosage that I took. I got started into dexedrine because of exams studying in 9th grade. I heard about people taking Ritalin to study, and knew I used to take something similar for my ADD. What I did not know was that my little orange friend (dexedrine) was much stronger. I would snort about 8 or 10 10 mg pills, and stay up literally all night, with no sleep. However, concentration was improved immensely, as was memory retention. I could study for hours on end, without boredom or exhaustion. The feeling was one of intense energy and increased intellectual capacity, basically like someone put rocket fuel straight into my brain. As I progressed into this habit, however my friend and I, who both used to or currently suffered from ADD, would take higher and higher doses. I got to the point where we would drive to his house during the middle of the day, and snort massive doses i would say around 15 or 16 pills of various sizes, from 5-15 mg. He later got to the point where he was taking 40-50 pills, dangerously close to overdosing.</p><p>The after effects were terrible, the worst part of th drug. I completley lost all desire to eat for around 24-36 hours, noticeable depression, and lack of any focus that I had gained with the medicine. I also had a horrible experience with Concerta, an extended release drug. It was similar to the dexedrine, but the high lasted over 26 hours, as I took 2 8-hour extended release pills. I was unable to stop smacking my lips, and a feeling of bitter cold came over me, even though it was probably around 70-80 degrees outside at the time. I would reccomend only using either of these drugs if it is absolutely necessary, a.k.a. finals. I did get a 93 on my chem exam after having a 78 the whole year after taking dexedrine for 3 days straight to study. I did not like the after effects at all, and in my opinion they definitely are not worth it. It's also really easy to get addicted, which was probably the worst experience of my life.</p>",
 "year": "",
 "id": "31543",
 "gender": "Male",
 "timestamp": "2004-03-05T08:00:00.000Z",
 "views": "34452",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ]
}
