{
 "title": "OL 101",
 "author": "digitalmemory",
 "citation": " digitalmemory. \"OL 101: experience with Lactuca virosa (extracts), Cannabis, Alcohol & Codeine (with Acetaminophen) (ID 31567)\". Erowid.org. Oct 5, 2005. erowid.org/exp/31567",
 "substance": "Lactuca virosa (extracts), Cannabis, Alcohol & Codeine (with Acetaminophen)",
 "bodyweight": "150 lb",
 "report": [
  "<p>For the following experiences the setting is my bedroom, a comfortable and safe environment, and my mindset is that of seeking relaxation and peace. Im not on any meds, and any other drugs besides the one of concern are all listed as taken.",
  "Friday night",
  "1:00 Smoked small amount with equal amount high-grade pot in ceramic bowl. The bowl was the diameter of a dime, and I used enough high grade to cover the screen, then used enough opium lettuce to cover that. Noticeable coordination impairment and only slightly lessened pain reduction, both discovered when I banged me knee into my desk. And did I laugh. Everything was humourous for once. This lasted approximately 15 minutes. Around twenty minutes later, unsatisfied with the results so far, I put enough high grade in the bowl to just cover the bottom and smoked, which made me a little high (obviously) but didnt do anything for the opium lettuce.",
  "Monday night:",
  "A bowl of pot about an hour before hand, and then:",
  "2:05 I have approx. three quarters an ounce of opium lettuce in the form of a gram of 20x opium lettuce extract from a bouncingly reliable source of such interesting botanicals. I mixed a third of it (equivalent to roughly six and a half grams of raw dried opium lettuce) with a half cup of boiling water and let steep for 15 minutes, then drank at once. I didnt bother to filter since the extract completely dissolved in the water. It didn't taste like much of anything, a slightly bitter taste is all.",
  "4:00 the tv box is funny.",
  "From around 3:30 to 5:00 I talked online with an ex-girlfriend about a lot of emotionally sensitive things, and from around 4:30 to 5:30 I cried intermittently. I believe the opium lettuce helped me to express my emotions, most particularly by feeling them in my body. My anger became a nauseous, roiling boiling in my stomach lining as if my stomach was covered in goose bumps. My sadness and anxiety manifested as a feeling of being ripped apart at the seams, my bones felt like they were collapsing at the joints and I was crashing, imploding inwards and downwards. A very skeletal feeling, accompanied by pressure and heaviness behind the eye orbs which corresponded to the sadness I felt, heavy dragging-down-weighted sadness which solidified into tears.",
  "This increased sense of self-awareness lasted till around 5:30, and at 6:00 I took a hit of high grade pot and went to sleep.",
  "Wednesday night:",
  "12:45 two shots vanilla vodka in 8 oz generic chocolate ensure. damn tasty, too.",
  "1:00 smoking a bowl of 1/3g opium lettuce and just enough high grade pot to cover the bottom of the bowl.",
  "Around 2:00 I put in more high grade, stirred around with remains of opium lettuce and smoked.",
  "2:30 Feeling relaxed, things are funny. Music is nice, which is rare these days. I imagine this would synergize very nicely with nitrous. (and the musical entity Mystical Sun.) Must try this next time. The relaxed feeling and mild sensory enhancement lasted till around 3:00, when I went to bed.",
  "Monday morning:",
  "8:30 I took about 3 shots of vodka, a T3 (300mg APAP + 30 mg codeine, from the makers of Tylenol) and smoked the other 1/3 gram of opium lettuce extract. Havent really eaten anything since yesterday afternoon, so around 16 hours ago. No pot for this experiment either.",
  "8:45 I can already feel mellow and my hands are dis-coordinated from my brain. Yea.",
  "10:10 Feel relaxed and mellowed out and all, but it was the most intense right after I started smoking, around and before 9. I wish I had more opiates.",
  "10:40ish I was only feeling the mildest of sedation, as if I had smoked pot about 5 hours ago, so I had myself three more shots of vodka. Now at 11:00 all there is is a liquor-on-an-empty-stomach feeling.",
  "FINAL ANALYSIS: I need to smoke more than a third a gram at a time (equivalent to roughly 6 grams of lettuce). Significantly more. A better extraction process for oral intake is suggested, and/or smoking perhaps half or two-thirds a gram of the extract next time.</p>"
 ],
 "year": "2004",
 "id": "31567",
 "gender": "Male",
 "views": "11968",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Lactuca - L. virosa",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2005-10-05T07:00:00.000Z"
}
