{
 "title": "Foxy With a Scottish Twist",
 "author": "UnkyCid",
 "citation": " UnkyCid. \"Foxy With a Scottish Twist: experience with 5-MeO-DiPT, LSD & Cannabis (ID 3157)\". Erowid.org. Dec 3, 2001. erowid.org/exp/3157",
 "substance": "5-MeO-DiPT, LSD & Cannabis",
 "bodyweight": "215 lb",
 "header": [
  "DOSE: T+ 0:00",
  "20 mg",
  "oral",
  "5-MeO-DiPT",
  "(powder / crystals)",
  " T+ 0:20",
  "3 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  " T+ 2:00",
  "3 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  "",
  "10 mg",
  "oral",
  "5-MeO-DiPT",
  "(powder / crystals)"
 ],
 "report": "<p>I'm a respectible young lad, expanding my horizons and such, but sometimes I go the extreme to see what the edge is like.  This experiment was aimed at bringing the final Highlander movie to complete and total life. </p><p>Having recently been brought into contact with a li'l foxy methoxy, my buddy S. and I decided that we were going to do things right and view the 'final' part of the Highlander series while visually, audiolly (is that a word?), and mentally open to suggestion.  Here goes..</p><p>Started out the night with a portion of a joint, always gets our mindset relaxed and ready.  I weigh out the 20mg for me and S. as accurately as my poor old scale will let me.  I was close enough for me in any case.  Down the hatch, mixed with some coke-type sode.  In case you're wondering, this is some foul stuff.  UGH!  I didn't like putting pure powder directly in my mouth, it tasted like crap for a long time.  ANYWAYS.  I digress.  Still haven't slept.</p><p>After this, we took off to the movie theater.  In the parking lot, while feeling the effects WHOOSH on (15-20 min to start, rises for a long time), mr. S. exclaims that he is very tripped out and needs to have some fresh air.  So we sit outside the truck for a little while and I drop my first 3 hits of some very, very happy paper and we go in.  Buying tickets was an adventure, people are so slow in line, and then getting some $2.50 sip of bottled water.  UGH.  Water is very good for you though.</p><p>So we make it to the theater, S. is totally fried and totally blown away, leaving it to me to figure out the seats.  Easy task..   Empty theater.  The movie starts off slow enough (not going to do a review here) but the beginning parts are a complete blur of coming up and intensity.  There were many-a-time when I wanted to get up and leave and hide in a corner because the visuals and audio were so intense inside that movie theater.  Plus, if you know anything about Highlander, you will understand visuals.  In the theater, this is one of the most trippadelic movies I've seen.  WOW.  Needless to say, S. was just barely hanging on to his sanity and refused to give in to the 'cid, so I dropped his 3 about 15 minutes before the movie ended.  POW.</p><p>One thing I have to say about Foxy is that it is an intense body rush.  Very hard to describe.  From my experiences (having a few now), it's kinda like X + LSD + turbo unleaded.  It just keeps going and going.  I've tripped many times, and foxy'd several times and this was an interesting combination in these quantities.  NOT FOR THE WEAK OF HEART.  My typical trip dose is 5 hits (gels, paper, etc), and this keeps me out on a limb.   I think I'm going to be taking up Tai-Chi now just because of that movie.  So intense.  Highlighted by the acid, taken into overdrive and my soul by the Foxy.  After the 2+ hour movie, the drive back home was quite an adventure.  During my insane peaks driving wasn't the most fun thing I could be thinking of doing.  :)</p><p>Finally got home, tripped for a long time and smoked a few joints, decided to try a bumper, took that extra 10mg with some OJ (good combination) and kicked back into overdrive.  That was around 4am or so I think and I'm still wired right now.  Golly!!!</p><p>Be careful with this one.  Very interesting, very, very powerful.</p>",
 "year": "2000",
 "id": "3157",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-03T08:00:00.000Z",
 "views": "6467",
 "dose": {}
}
