{
 "title": "I Thought It'd Kill Me",
 "author": "Cozmikgirl",
 "citation": " Cozmikgirl. \"I Thought It'd Kill Me: experience with Caffeine (ID 31607)\". Erowid.org. Mar 17, 2004. erowid.org/exp/31607",
 "substance": "Caffeine",
 "bodyweight": "115 lb",
 "report": "<p>One night I was really bored and in a generally ill mood and couldn't get any good speed or marijuana.  I decided to pop a couple caffeine pills and hoped I'd feel better at least.  Well, after about an hour I thought I didn't even feel more alert off of the pills, I took 4 more.  I didn't even give the pills a chance to kick in before I started taking 2 every 5-10 minutes.  Before I knew it, the bottle was empty and I was zipping around the house deleriously.  Along came bedtime and found myself laying there thinking my heart was going to literally burst.  It was the most scarey and miserable thing I have ever felt.  I tried to relax and breathe slowly.  Nothing helped.  Within an hour I was throwing up violently, my whole body was convulsing, and all my muscles were constricted and painful.  My heartbeat just got harder and faster as the night went on.  I went from the bathroom, vomiting, to my bed with shaking and muscle convulsions.</p><p>Finally, being worn out and scared to death all night, I woke my mom at the break of dawn and told her something was bad wrong.  I could hardly even speak my body was shaking so bad.  She drove me to the doctor where they gave me a phenegran shot.  When we got home I was still in a relatively bad state.  Finally, about an hour and a half later I fell asleep on the couch, exhausted, embarrassed, and extremely frightened.</p><p>I have had a lot of experiences with a lot of different drugs and  overdoses.  Caffeine is not a fun drug and in my opinion it is not a recreational drug at all.  Please don't attempt to get a high off of caffeine, it's miserable and you'll surely be sorry.</p>",
 "year": "1998",
 "id": "31607",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-03-17T08:00:00.000Z",
 "views": "15295",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 }
}
