{
 "title": "Mind Fuck",
 "author": "Nasty Nate",
 "citation": " Nasty Nate. \"Mind Fuck: experience with LSD, Cocaine & Cannabis (ID 31705)\". Erowid.org. Jun 19, 2007. erowid.org/exp/31705",
 "substance": "LSD, Cocaine & Cannabis",
 "bodyweight": "154 lb",
 "header": [
  "DOSE:",
  "4 hits",
  "oral",
  "LSD",
  "",
  " ",
  "",
  "Cocaine",
  "",
  " ",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>I just got out of school and me and a friend walked over to his house and smoked about 3 bowls. I was droppin acid that afternoon when I got home, I had bought 4 hits earlier in the week. The only other hallucinagen I have done was shrooms. When I got home some other friends that were each takin 2 hits came over. I dropped my 4 and went and played guitar and waited for it to take effect.</p><p>After about 20 or 30 minutes I felt restless and got up and started walking around. I felt really energized and everything seemed kinda wierd. I went on the computer and listened to some Jimi. I was listening to Castles in the Sand, this blew my mind. I had never liked Jimi alot, but when I was listening to it, his voice was so beautiful. The whole song kinda disappeared, and all I could hear was his voice, and his guitar. After sitting there like this, I noticed that some people were playing on my guitar amp in the other room, this causes the wall in between the rooms to shake. I had my feet on the wall, I could hear them playing but all I heard was noise, no notes or anything. I was still listening to Jimi, then the noise blended in, and the noise sounded like a space ship taking off, then my legs began shaking even more. This was really wierd, but I enjoyed it alot.</p><p>After this I walked around for a little bit, talked to people, I was the only one feeling the effects right now. I went back on the computer, my friend was in there, he had his legs crossed and was shaking his foot. This movement then moved onto the whole desk that the computer was on. The whole fixture was shaking back and forth violently, it didnt disturb me because I was still clear headed. After about 20 min we left to go to Mcdonalds and go in the play pen.</p><p>This really fucked me up, all the different sounds were coming together. I didnt know what was going on anymore really. I just sat there for like 30 minutes and thought about stuff, stared off, the bricks in the ground were moving, not alot though. Then a friend reminded me to go into the playpen and me and the 2 other people tripping went through the 'adventure' alone. The colorful tubes, the sound being changed, and not knowing where I was going. I had no clue what was going on. We got to a big chamber and I could stand up, I looked around and I forgot were I was for a second. Then I went down the slide, which was better described as feeling like being sucked out of the slide.</p><p>This is when everything got out of control. I had no clue what started it but I began to panic, I wasnt in reality at all. I had slipped into my own world, I went into my room alone, which might not have been a good idea. While I was sitting there, I started seeing patterns, nothing big really. Then everything began to echo. I heard a voice, the voice was my thoughts, but I heard it. Then I heard whispering in my room, no one was in there and I had no clue why I heard it. I went into a loop of thinking that I had takin to much, that I was going to go insane for the next 5 hours, this pretty much did happen.</p><p>My friend came and picked me up, we were driving around, it was a beautiful night, but all I was thinking about is what was going to happen to me. The two people in the front seat were talking. I couldnt hold up a conversation because I would forget what I said 5 seconds after I said it. We went to my friends house, I went into his bathroom right away. I look at myself, I wasnt really seeing anything, but I felt the need to get out of my clothes. I took off my shirt and shoes. I went out of the bathroom and I was asking anyone I saw for a pencil and paper to write down my thoughts. I felt that if I could write out my thoughts, maybe the voice I was hearing would shut up.</p><p>Then I felt the need to hear music, my friend had a computer with music on it, but I needed to have a cd player or mp3 player, I kept asking everyone for one. Then I realized I had paper in my hand, and wondered why I had it. Then I remembered I was gonna write on it, but I had thrown the pen somewhere. I left my friends house with them in just pants, socks, and a undershirt. I left my shoes and shirt at his house. When we were driving around, they decided to fuck with me for a bit, and they called out my name and when I looked at them, they were moving their mouths around alot, but not making any noise. I just stared at them for a minute, I was hearing them say things. Then they started moving my window up and down. Now all I remember is that I was staring at the moon and how beautiful it looked, they said I was talking to the window. I apparently said 'Hi' to the window.</p><p>I went back to my house and thought about the wierdest things for the next 2 hours, which seemed like 2 days. I felt as if I was being pushed into a wierd position by some outside force. This was a very strange feeling, I didnt know why it was happening. I was trying to think about comforting things, but they would leave my mind after 5 seconds. Then I began to think that maybe I should forgot about caring about myself and start thinking about how I could help mankind in general. I associated words, or people, with just the beginning of the word or name. Then I forgot what each letter was for, and thought of another name. This went on for 30 minutes. When my friends came over, my girlfriend called. This is what ended my mind fuck, I felt an overwhelming feeling of relief, as if everything was ok now, I spent the next hour sitting there and staring at stuff, trying to trip again.</p><p>Later that night, I did cocaine for my first time too, we also smoked some primo. When the effects of the weed and coke kicked in, I wasnt high. I just began to trip again. I felt like I was being pulled out of body. I would stare at something for a minute, and my head would become disconnected from my body and whatever I was staring at was a different world. There was a doorway, then someone sitting in a chair, and a t.v. I viewed this as three worlds, and whenever I stared at one, I was pulled toward it, as if it had a gravitational pull.</p><p>The next morning when I woke up, I was completely fine, I felt great. The effects of the acid had worn off completely and I could remember most of the day before. I didnt have a very great trip, but I decided that I still liked it in the end.</p>",
 "year": "2004",
 "id": "31705",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-19T07:00:00.000Z",
 "views": "6377",
 "dose": {}
}
