{
 "id": 3170,
 "title": "Intense Discomfort",
 "date": {
  "submission": "2003-03-03T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jerome",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.0",
    "quantity": "1.0"
   },
   "administration": "smoked",
   "substance": "Kava",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I just read a Kava report that states some guy smoked Kava when he couldnt find pot, and felt Pot Like Effects.  I have smoked Kava, and my expirance was extremly different.",
  "I prepaired the Kava by taking apart two pills and mixing them with a tiny amount of water (the water was completely absorbed) and letting the kava dry into a pasty clump on a mirror.  Although the kava was from a pill bottle it smelled VERY strongly, making me think it was fresh.",
  "My thinking on this was, if you can smoke it and get high why the hell would you eat this foul tasting stuff?",
  "Well the kava dried and ended up looking like the weird off-white crack I see on Cops every once in a while.  So that night I cleaned out my bowl an blazed that rock.  The smoke was thicker thatn hell, and it smoked for a hell of a song time.  Nothing happened.  I went inside my house and went in my room, and waited for music to sound as awesome as I remembered it sounding.  Thhree hours later I was sleepy and dissapointed.  However, I do remember feeling a small Bubbly sensation in my lungs, similar to those early days with doty. ",
  "The next day I woke up with a terrible cough.  My lungs hurt like something you wouldn't believe.  It was like I had some bizzar cold that came out of nowhere in the middle of summer.  This intense discomfort lasted for a week and went away.  My lungs are fine, i can still hold my breath and swim great, although that wasnt the case for that week. ",
  "My thoughts on this expirance...  I think that Kava is a type of pepper, and if ya taste it it does taste kind of peppery.  I think that smoking the Kava released the basic pepper irritant that will make you sneeze if you smell it and will make you cry if a cop sprays it in your eyes.  I have taken that same Kava before, orally, with great results.  People are always knocking pill form Kava, but i've had alot of fun with it.",
  "People also say that you need to open those pills and mix a drink out of them, when this is NOT the case.  All that pill is is a tiny thin piece of neutral gelatin.  The stomach breaks that down like nothin.  Also people say that you need to eat 1.5 - 2  bottles of this to really get the effects.  I find that one bottle will usually mess me up so bad that I'll feel sick... 3/4 of a normal pill bottle is the most I should ever need.  Peace out"
 ],
 "erowid": {
  "id": "20291",
  "citation": " Jerome. \"Intense Discomfort: experience with Kava Kava (ID 20291)\". Erowid.org. Mar 3, 2003. erowid.org/exp/20291",
  "substance": "Kava Kava",
  "views": "26886"
 }
}
