{
 "title": "Heavy Tofu",
 "author": "Morninggloryseed",
 "citation": " Morninggloryseed. \"Heavy Tofu: experience with 2C-D (ID 31711)\". Erowid.org. Mar 10, 2004. erowid.org/exp/31711",
 "substance": "2C-D",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "40 mg",
  "oral",
  "2C-D",
  "(powder / crystals)"
 ],
 "report": "<p>Wednesday, March 10, 2004</p><p>2,5-dimethoxy-4-methylphenethylamine (2C-D, LE-25)</p><p>Here we go again.  I am a guinea pig playing with an obscure psychedelic drug research chemical.  But dont get me wrong, I find it very exciting; and love to discover new properties in psychedelic drugs.  I must admit I didnt have high expectations for 2C-D.  The reports did not leave me expecting much of anything that would be too interesting.  I love when I am surprised!</p><p>This experiment took place with J, a best friend of mine since I was a small child.  He was my first officer (formally known as co-pilot) all those years ago when we ate morning glory seeds that first time and blew our heads open.  I was really looking forward to tripping with him again.</p><p>I chose 2C-D simply because there had a strong desire on my part to try a new material.  And being something new but gentle, it sounded right for that night.  J wanted to try something new as well, so 2C-D is what we selected.  After much discussion about the reports and what I knew, forty-milligrams was the dosage we selected.  The material was a beautiful and fluffy white powder, and this batch was procured from a highly reliable source.  This was my first psychedelic experience in almost five months.  For J it had been nearly a year.</p><p>I had an empty stomach, while J swallowed the material on a slightly full stomach.  We both started smoking pot so it was difficult to say when the first alert was.  I think by forty-five minutes in we both noticed it without doubt.  At first, the effects were there but difficult to describe.  J seemed a little restless and moved about my premises.  Though feeling some stimulation, I really felt fairly relaxed and stayed in my chair most of the night very comfortable.</p><p>By the one-hour point, the effects were unmistakable.  There was some slight nausea for me, but nothing too bad at all.  No nausea for J, he reported.  Now what we did both experience was gorgeous colors on all surfaces, breathing walls, colorful trails, a light show with eyes closed, and great body buzz; but best of all--a state of INTENSE introspection and deep philosophical insight.</p><p>At about one-hour in, we seemed to be peaking and we were both at a soft plus-three.  I must admit I was much higher than I had anticipated the dosage would take me to, and was very pleased with everything.  J and I soon sat down and then had probably the deepest talk Ive ever been a part of while on an entheogen.  While I still have my doubts about 2C-D as a smart drug, there was no doubt a special heightened intellectual process going on with this one that seemed different from the others.  Even on psychedelics as gentle as 2C-C, I am not talkative.  This one really brought out a lot in me.</p><p>This night, we talked of everything.  And talked with such ease.  Everything was discussed; from politics and war, space travel and medicine, to philosophy, law, and basic human existence.  Every subject was easy to relate to, and easy for us to relate to relate to each other.  I bet this material would be fantastic in psychotherapy as a tool for communication between couples.</p><p>I felt so free and easy to talk with J, yet the state from 2C-D was never forceful.  For most of the trip, I always felt completely calm, and the 2C-D-space was very relaxed in all capacities.  J however said his brain was two steps ahead of his mouth.  But he still felt it was very easy and in no way a pushy material.  I concur with that completely.</p><p>There were a few memorable things that night other than just the discussion between us.  One nice part was going outside for a smoke and seeing the remarkable light-show in the sky.  The stars shimmered and moved, and everything had rainbow-like halos around it.  Another interesting visual experience I had was when urinating.  While looking down at the tiles on the floor, they changed colors slowly from red, to blue and all of the colors in between.  Stunning!  Listening to music was also beautiful, and ended up producing some nice visuals to go along with it.</p><p>By four-hours in, we both agreed the trip was ending.  We smoked more pot which made things a little more intense, but also made us tired.  Less than six-hours after taking this 2C-D, we both fell asleep.  There was no residue the next day.  This was easy material to take, easy in all aspects, and that sure is a plus.</p><p>Conclusion:</p><p>2C-D reminded me very much of 2C-C, but it had much more content.  Though there was that phenethylamine feeling common to all of them, there wasnt much resemblance to the other 2Cs Ive tried as much as with 2C-C.  But unlike 2C-C, which is almost sedating, there was some stimulation with 2C-D.  However this stimulation was no more severe than perhaps five-milligrams of amphetamine.</p><p>And while 2C-C seemed laid back and could allow for one to go in any direction possible that is chosen, 2C-D definitely had a strong intellectual component to it.  It was specific, focused, and we talked and talked with such great spirits all night.  This intellectual component was definitely a part of the trip.  In response to Shulgins remark that 2C-D was pharmacological tofu, someone else said it was some heavy tofu.  And it was heavy stuff!  And thankfully the material was very easy on the body.  There was some nausea for me in the beginning, but none for J.  And the nausea was mild and very transitory. </p><p>There wasnt much resemblance to 2C-B, which I feel has a very different flavor.  Forty-milligrams of 2C-D was similar to perhaps fifteen-milligrams of 2C-B quantitatively, though the material is very different qualitatively.  These qualitative differences are difficult to describe.  Forgive me.  Perhaps I could say 2C-B is more punchy than 2C-D, it is not as laid back.</p><p>And 2C-B is much more of a sensual material compared to 2C-D in my experience.  The visuals between 2C-B and 2C-D were also fairly different, but again complex when trying to put them to words.  Both however are very strong.  I can say in a few words: 2C-B seems to focus more on sensory themes while 2C-D was a more intellectual material, and while the visuals of 2C-D are intense, they seemed to be more in the background compared to the way 2C-B is.  2C-D was simply a much more relaxed experience all around than they type of trip produced by 2C-B.  Sleep was easy at six-hours in.  Cant beat that!  I typically have problems sleeping after an entheogen, but not with this one.</p><p>Would I take more than forty-milligrams of 2C-D the next time?  I dont think so.  Forty-milligrams got me to where I wanted to be.  J also agreed the dosage was perfect.  I have a feeling that high dosages (maybe eighty-milligrams) could rival 2C-E in depth, but I dont think I will take 2C-D to those levels.  Ill take 2C-E for a really intense out-of-body trip.  2C-D will be for those gentle ones.</p><p>What more to say?  Excellent material and it makes the other 2Cs I have tried (except 2C-E, 2C-T-7, and maybe 2C-B) obsolete.  Great on the body!  2C-D was very mellow but still intense.  We both agreed we could not drive or answer the phone at forty-milligrams, but it was never forceful.  All in all it was a total winner and I feel so lucky to have the chance to try these materials.</p>",
 "year": "2004",
 "id": "31711",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-03-10T08:00:00.000Z",
 "views": "17722",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  }
 }
}
