{
 "title": "5 Years",
 "author": "Jbela",
 "citation": " Jbela. \"5 Years: experience with Paroxetine (Paxil CR), Cannabis & Topiramate (Topomax) (ID 31784)\". Erowid.org. Mar 4, 2011. erowid.org/exp/31784",
 "substance": "Paroxetine (Paxil CR), Cannabis & Topiramate (Topomax)",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "37.5 mg",
  "oral",
  "Pharms - Paroxetine",
  "(daily)",
  "",
  " repeated",
  "",
  "Cannabis",
  ""
 ],
 "report": "<p>They realized something was wrong when I turned 14 and suddenly became depressed. Like, 14, BAM. It's like someone turned on a switch for depression and I transformed into a completely different person. I wasn't a happy child anymore. It freaked me out and the worst part was that there was no reason for my constant sadness and suicidal dreams. Depression supposedly is genetic and since everyone in my family has it,  I should not have been surprised. Supposedly your body chemistry changes every 7 years, too...7+7=14....I don't know the reason. I really wish I did. Because 5 years later it's still here.</p><p>I started seeing a psychiatrist who I really didn't like and he put me on Prozac. Well, that did nothing but give me convulsions, literally make me jump out of my skin, and it just increased my desire for death. So they tried Paxil instead. I started on 10 mg, and it seemed okay, but not enough. It didn't have any real side effect besides making me really tired, so I took it at night instead. They upped it to 20mg and I stayed on that dose for a while. It worked, I guess. I mean, I didn't want to kill myself anymore, not usually anyway. The only time I really ever felt horrid again was if something external brought negativity to my life, like a bad breakup or something. Yeah I've had a few of those, so I needed to up the Paxil even more so that I wouldn't pull something stupid.  I ended up at 40mg when I was around 17 I think.....and it seemed okay. Every time that they upped it 10mgs, it seemed to do the trick. But now I'm wondering if it was the right drug.</p><p>Now I'm 19 and I've been on Paxil for 5 years. Lately, life just has not been doing it for me. I live alone at my college and try to force myself to function but its been harder and harder lateley. Over Holiday break my psych upped and changed my dose to Paxil Continued Release instead of the regular wham-bam-thank-you-maam stuff. And now it's at 37.5mgs, which is equivilent to 60mgs of regular Paxil. The bottom line is I still feel like killing myself and I think my body has built up a tolerance to the Paxil that has made it ineffective. My psych also put me on Topamax to 'stabilize my moods', which is crap because Topamax is an epilepsy medication and I don't have seizures, man, period. So now I'm on two medications that do jack for me, I'm addicted to marijuana, I'm still thouroughly depressed, I hate my life, have no motivation, I feel like my brain is deteriorating. But I can't get off the Paxil.</p><p>I can't not take it because if I don't, I'll shake constantly, I'll get wicked dizzy and lightheaded to the point of falling over, and it will just manifest into a panic attack. The only time I ever have a panic attack is if I have not taken the Paxil for a few days (anywhere between 2-6 days of missed doses). This happens more often than one might think, as I am more likely to forget to take my meds if I forgot to take them the day before that, and the day before that, and so on. So if I forget for a week, I am royally screwed. I forget to take them a lot. I forget things. I'm a forgetful person. It sucks. I had never had a panic attack before I took Paxil.</p><p>I can't not take this medication. Yet, it costs me money, and it doesn't fix my seratonin like it's supposed to. I'm not happy, am I? No. So it doesn't work, at least not anymore. I have been on Paxil for 5 years. It's an all-around crap situation, and I still don't know what to do. I've been trying to research online about SSRIs and other types of antidepressents just try and figure out what the hell is going on. The only thing that makes me feel better is weed. And weed's still illegal, and hella expensive, and it still makes me lethargic. No matter how much I love marijuana, I hate that I'm addicted to it, because it only makes me more depressed in the end, because nothing can mask unhappiness.</p><p>This experience is recorded not to prove anything but maybe to add some insight. Maybe I'm not the only one.</p>",
 "year": "2004",
 "id": "31784",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2011-03-04T08:00:00.000Z",
 "views": "5743",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "37.5 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
