{
 "title": "As Manageable as They Come",
 "author": "Shameless",
 "citation": " Shameless. \"As Manageable as They Come: experience with 2C-C (ID 31788)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31788",
 "substance": "2C-C",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "24 mg",
   "oral",
   "2C-C",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>In order to relieve some ongoing neck tension, and not unwilling to submit to a night of oddness, I took 24 mg of 2c-c and within an hour I was distinctly reminded of a 2c-i takeoff; noisy mind with a stimulated zaggy kinda feeling. Previous trials @ 20 mg did not show this rush effect, and I was taken by surprise. I just rode out any discomfort. This was a mere 20 minutes or so with occasional body temperature swings. Then the old familiar feelings began to flow back in.</p><p>Both my nostrils were open clear, suggesting a mild decongestant effect. Thought was largely normal with occasional bursts of excessive emotion. I was watching Bruce Almighty @ the time. It's got sad parts. My muscles were loose and comfy allowing good chilling time. Stretching my muscles and popping my old bones felt wonderful and my chronic jaw and neck tension finally subsided. This was like a small miracle in itself, as I deal with muscle tension almost continuously. The muscle relief effect lasted for three days following the experiment before returning over a few more days to their previous tension. During the experience, visual activity was minimal, but real. Shadows would conjure up numerous images, while things would move deceptively in the periphery. Sleep was easy some 4 maybe 4.5 hours later. I seemed to sleep okay and a normal amount of time(for me). I don't recall any significant effects on dreaming. There also seemed no problem with eating or with achieving erection. Only slight motor incoordination, mostly characterized by miscalculating distances.</p><p>The following day, my vision was exceptionally clear. I wear glasses normally, and today was no different in that respect, but the resulting picture I was seeing was crispy and sharply detailed. My body felt like it was on vacation, but fully functional. Comfy muscles and a nice loose neck. This feeling alone makes my entire venture into 2C-C time money and all totally worth it! Now I must mention that on previous trials with this material, the following day the experimenter feels cold symptoms. This has been verified by two other friends who've tried the material. However, on this day and on subsequent trials, this effect was not realized. It may turn out to be a first time use effect.</p><p>All in all 2C-C is a totally manageable experience with tremendous rewards in the relaxation department. I'd love to take it on a beach one afternoon! The above trial was the largest dose and on four other occasions, I took small nibble doses around 10mg and enjoyed the mildest of effects. These lower levels didn't produce as profound a muscle relaxant effect, but still give a smooth feeling with easy sleep and the clear vision property the next day. If anything is an entry level psychedelic, this has to be it. No threats whatsoever. Happy exploring.</p>",
 "year": "2004",
 "id": "31788",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-14T08:00:00.000Z",
 "views": "6971"
}
