{
 "title": "It was Really Nice",
 "author": "Narcannot",
 "citation": " Narcannot. \"It was Really Nice: experience with Morphine (ID 31817)\". Erowid.org. Feb 29, 2008. erowid.org/exp/31817",
 "substance": "Morphine",
 "bodyweight": "170 lb",
 "header": [
  "DOSE: T+ 0:00",
  "15 mg",
  "oral",
  "Morphine",
  "(pill / tablet)",
  " T+ 2:00",
  "30 mg",
  "oral",
  "Morphine",
  "(pill / tablet)",
  " T+ 3:00",
  "105 mg",
  "oral",
  "Morphine",
  "(pill / tablet)"
 ],
 "report": "<p>Just thought I'd share my morphine experience from when I was a narcotic addict... I bought two sixty milligram morphine sustained release tablets and two fifteen milligram morphine immediate release tablets for $25 on Christmas day in 1999. I had been addicted to painkillers for two years, so I was extremely stoked to get my hands on so much morphine.</p><p>I took one IR 15mg. tab, expecting to get floored...two hours later, nothing. I then broke up the SR 60mg, and took half. A slight buzz in an hour. I thought, 'what the hell, this isn't working,' and took the rest. Whoa, damn! That definitely did the trick! It came on stronger and stronger, and I thought I had unwittingly taken a lethal dose. It finally plateaued at around four hours, but by that point I could hardly move or speak. My family must have wondered what the hell was going on, as I took five minutes to lift each fork-full of Christmas dinner to my drooling, slurring mouth...Hell, I wasn't hungry at all, but, at the same time, a plateful of shit would have been the best meal I had ever eaten because I was so high.</p><p>So, I experienced that blissful feeling for a good two days, and I wished it would never end. I can honestly say that morphine is the best of the pure opiate agonists - the euphoria is better than cocaine, sex, or skydiving. I once tried Pediagoric (tincture of opium), and a half a bottle of it was very similar.</p><p>However, it is dangerous, and it is extremely unwise to ingest that much morphine at once, unless you have a serious tolerance (I'm not talking 5-6 Percocets a day; more like 50-60... and Lortabs are candy for schoolkids...), a death wish, or a sitter who has IV Narcan and knows how to use it when you stop breathing. It also helps to get a narcotic dosage conversion table, which can be found in The Merck Manual or The Physician's Desk Reference.</p><p>Just for the record, right before I took those pills, I injected IV, two bags of what a then- 'chipper' friend called 'really good heroin...' I felt absolutely nothing, and he passed out off of one bag (He later died of an O.D. in a Krystal restaurant bathroom near Georgia Tech - opiates can kill you!). So, I cannot say it enough -  just go burn a doob ... it is much safer and a lot more fun in the long run...</p>",
 "year": "1999",
 "id": "31817",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-29T08:00:00.000Z",
 "views": "36275",
 "dose": {}
}
