{
 "title": "Intense Lucid Sleep",
 "author": "Ttc",
 "citation": " Ttc. \"Intense Lucid Sleep: experience with Melatonin (ID 31813)\". Erowid.org. Jun 21, 2007. erowid.org/exp/31813",
 "substance": "Melatonin",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "600 ug",
   "oral",
   "Melatonin",
   "(pill / tablet)"
  ]
 ],
 "report": "</p>One evening on my way to bed I took the recommended dose of 2 300mcg pills.  I'd read that people took around 3-5 milligrams and was surprised that only .6mg was to be taken, and was even tempted to double the dose. </p><p>Thankfully I decided not to.  About 1.5 hours after taking the pills I began to feel sleepy.  It wasn't the artificial sleepiness I've experienced with benzos or antihistamines, it was more like natural sleepiness occurring from staying awake too long, except it had approaching much more rapidly than expected.</p><p>I went to bed and a couple times was cognizant of that feeling between sleep and awake.  I could feel, and see myself falling into slumber.  It was almost like hallucinating, except all the senses were dream-like and inside my head.  I saw things and heard things but their presence was extremely subtle.</p><p>After 8 hours of incredibly satisfying and uninterrupted sleep I awoke feeling slightly groggy.  I remember thinking that even at such a small dose I'd perhaps taken too much because the first 2 hours of my day I was groggy.</p><p>For the past 5 days, I have taken 600mcg about 1.5 to 2 hours before going to bed.  As I have adjusted to the dose, my dreams have been wildly intense, my sleep deep and satisfying, and waking up in the mornings has been a breeze.  I have no desire to hit the snooze button when my alarm goes off.</p><p>Taking melatonin has made me appreciate the complexity and creativity of the human brain.  This past week I have had dreams that span the spectrum of the universe.  They have been entertaining, analytical, exciting, and even at times a bit scary.  I have found myself looking forward to the next time I fall asleep.</p>",
 "year": "2004",
 "id": "31813",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "18549"
}
