{
 "title": "State of Mind Similar to Antidepressants",
 "author": "Spark5221",
 "citation": " Spark5221. \"State of Mind Similar to Antidepressants: experience with Salvia divinorum (15x extract) (ID 31885)\". Erowid.org. Mar 15, 2004. erowid.org/exp/31885",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "145 lb",
 "report": "<p>This Legal (check local laws) herb can be refined to several times normal strenght fairly easily, very neccesary for a noticable hallucinogenic effect. On a cool fall night, following a two week long extraction yielding 15 times strength salvia, I packed .2 grams into a waterpipe (with no water).  I had read that salvia only vaporizes under direct heat, so I kept the lighter lit for the entire hit.  I took two hits of .2 grams of salvia one after another, holding each hit in for a count of 20 seconds. </p><p>Approx. 1 minute after the second hit I began to disassociate from my surroundings.  My room became a cavern and the silence was deafaning.  My mind was reeling at an incredible speed, unable to make any comprehensible thoughts or feelings and I felt as if I were running as fast as I could, but still standing still, that is, my heart was thumping and i broke a sweat.  I soon came back to earth and experienced a state of mind similar to that brought on by antidepressants.  The clock showed about 10 minutes had passed. I stayed in this neutral state of mind for about 20 more minutes, and felt no effects whatsoever afterwards. </p><p>In Retrospect, the 15x NON standardized extract was very intense and I would recommend smaller doses for those not accustomed to tripping. But the good news is, the simple acetone extraction works wonders, and is very inexpensive for the enterprising individual.  Good luck and START WITH SMALL DOSES.</p>",
 "year": "2004",
 "id": "31885",
 "gender": "Male",
 "timestamp": "2004-03-15T08:00:00.000Z",
 "views": "6806",
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
