{
 "title": "Screaming Banshees",
 "author": "Mr. Bubblesman",
 "citation": " Mr. Bubblesman. \"Screaming Banshees: experience with Mushrooms (ID 31884)\". Erowid.org. Mar 5, 2007. erowid.org/exp/31884",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "3.5 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>The following is a non-fictional event as accuratley told as I can make it within my human limitations.</p><p>As my high school years progressed naturally so did the experiments with drugs. Early into my senior year, some friends and I got into going to the midnight movies in our town. I'd been trying to experience something more then the usual pot and alcohol and shrooms felt like the next step. After multiple failed attempts to get shrooms a friend of mine finally came through for me. With the shrooms decomposing as quickly as they do I was desperate to find an opportunity to use them. Ultimatley I decided that I would eat magic fungus at the next midnight movie, The Song Remains The Same, Led Zeppelin. The the three people I went with, one was my decent friend, the other was an aquantince, and finally there was a girl who I'd just met that night. No one else had ever done shrooms and none of them were up for it. It my blissful ignorance I decided that this just meant more fun for me, big mistake. I ate my shrooms at about 10:30, while my friends smoked a few bowls.</p><p>Looking back now, I could see that right from the get-go I was doing bad for myself. Wanting to make sure I didn't fall asleep for the movie, I started by drinking a red bull and eating some peanut chews. Don't get me wrong, peanut chews rock and red bull has its merits. But believe me, red bull and mushshrooms aren't a winning combination. The peanut chews although good sat heavy in my stomach and progressed my brewing stomach ache furtter.</p><p>25min later we were driving around killing time and my stomach ache was showing no remorse. I went into a convenience store and bought some ginger ale for my stomach. As I did so I noticed my legs felt like jello. Thankfully it stopped the pain within minutes. As we continued to waste time I noticed a serious increase in my mood. Like a little kid everything was exciting me and my heart was racing. At one point we off-roaded a little bit in this somewhat hidden consrtuction site.</p><p>Despite the 5inches of snow I was getting restless and so I got out of the car and played around a bit. My limbs had all become jelloish in nature and made movement and interaction with objects difficult. After this we went to go get pizza. I refrained from eating any as I feared my stomach ache would return. While I sat watching my friends eat I found myself constantly going through my pockets. Between my hat, gloves, cell phone, wallet, and keys I was in trying to find the perfect way to keep things organized.</p><p>Finally midnight arrived and we went into the theater. At this point I found that along with the jello sensation and high euphoria I began to move into a state of enlightenment. Right there sitting on a bench while two of our group went to go buy food I came to the realization that things like money and possesions were all trivial aspects of our lives. I asked if my friend would get me a water and when he came back with my 2 dollars in change I refused him.</p><p>As we waited for the movie to start a large gathering of people I knew from my school arrived. To be honest I didn't care for them but in my euphoria they became perfectly good companions. The movie started. Things were intense, the volume of the theater felt 10 levels higher then I would expect it to be and the movie's general wackyness didn't help me stay in control. My heart felt like it was going to burst from my chest and I was breathing hard. I couldn't seem to keep my temperature level and kept taking off and putting on my hat and gloves and jacket.</p><p>As the movie progressed things were too intense and my body was getting exhausted. I started to dose off in 1-2 minute intervals. Each time having to re-check myself and usually try and find my gloves and hat again. Interestingly when I woke up in this intervals without my hat and gloves by some means I was always able to locate them without any effort. Although I had no recollection of having put them in the seat in front of me, or under me, etc. I still some how knew that they were there. This became the marker of the trips decline.</p><p>For reasons unclear, the large group decided they were leaving, this didn't include my friends and I but, in my state I became confused and thought the movie was actually over. It seems laughable now but at the time this was a serious mind-blow. In reality we were actually only about half-way through the movie when I thought it was over. I went over to my friends and told them we should leave. At first they were confused and they just assumed that I was tired and asking them if we could leave.</p><p>Since they were also tired we did then decide to leave. The fact that the movie was, in reality, only half-way through greatly destorted my comprehension of time. As we walked out of the theater I suddenly became felt like throwing-up. With no regard for the fact that I wasn't in a bathroom I threw-up on the floor and on my leg. Thats when things got wacked.</p><p>Having no knowledge of shrooms and their effects my three companions immediatley assumed I was having a bad trip and needed help. Of course in reality throwing-up was a perfectly natural reaction to the shrooms that was not the big deal they made it out to be. Having now thrown-up I was a little upset because I had puke on my pants but, also happy that it immediatley relieved my nausea. Unfortunately, this is how my companions became both a blessing and a curse.</p><p>My friends began bombarding me with questions and comments that only made me feel more upset and fear that something truly bad was going to happen. At that moment a strange notion came over me. My mind had decided that to avoid further depression, it was tune-out. I leaned down on the bench and immediatley closed my eyes. My friends continued to talk and worry but their voices began to drift farther and farther away.</p><p>Somewhere in this trance I began believing that I was in complete control of everything that was going on. How I came to this conclusion is unlcear but I think it may have had to do with the way I was able to locate my glove and hat at will earlier. Regardless I what led me to this belief, it wasn't one that a teenager in the middle of a movie theater should be putting faith in.</p><p>It took my friends 10 minutes to rouse me from my sleep, which involved trying to pull me up and smacking me. The 100meters walk to the car confused and upset me. I couldn't understand why I needed to bother, I was sure that if I just closed my eyes I'd get home. Considering I was now in the middle of a very intense mind-blowing trip and I had puke on my pants you'd think I would have been worried but instead my belief that I was in control over-rid these fears and left me blissfully unafraid and unaware of the trouble I could be in.</p><p>The car ride home was a blur, I only remeber one or two buildings that I was used to seeing. Somewhere amongst all the crap going through my head I could hear my friends trying to think of excuses for why I was sick, something they could tell the police or my parents. Somewhere also in the car ride I remembered hearing my friend driving saying something about cops and us being pulled over. I can't remember enough quote him but when someone says that there is a cop on you, you generally worry.</p><p>I however, in my dream-state had no worries about such things. The only thing in my mind was my comfy bed sheets. After more blur I suddenly hear a voice move up behind me, it was one of my friends. The voice of my other friend joined in and told me to get out of the car. Failing to comprehend his words I sat there eyes still closed in my visionless trance. Their voices were getting progressivley louder and more exasperated. Before too long they were yelling at me. They threw snow on my face and tried to pull me out of the car and shake me.</p><p>This continued to upset me and the more they did it the more upset I got, I kept trying to just turn away and tune them out but their voices kept getting more urgent. Eventully out of anger they grabed me and half-threw me out of the car. All this succeded in doing was leaving me face-down in the snow. The snow was comforting and cool and the initial silence after being thrown gave me hope that perhaps I'd won and these horrible voices had given up.</p><p>Of course they came back just as angry as before. Suddenly after 20minutes in the snow I decided that the only way top get rid of what at that point I considered a pair of wailing banshees was to do what they asked. In the same instant I fluidly rose to me feet and began traunching towards my house in what I still consider a blurred trance. The next thing I remember is smacking my face into my plastic panel door. I could hear the banshees(my companions) let out a couple of both angering and at the same time relieving laughs. Again the reality fades and I'm back in my blur.</p><p>Next thing I know, I'm in my room in a comfortable pair of scrubs and a different tee-shirt. Then everything goes black again. I kept having relapses of the yelling in my ears. My friends voices felt burned into my memory. The only way to keep them out was to never let myself stay still for more then what felt like about 10 seconds. I tossed and turned for what was about 2 hours in a black void with only flashing visions of the things that I'd been yearning for most from the time I left the theater(my bed, my pillows, my room).</p><p>Towards the end of this trance this finally began to calm down. In my trance I found out through some tangent of thought that what has just happened to me was actually a break out of the binding universe. I felt that I had been re-born into a new liberated life, free of the stresses of my past life. I then awoke, it was 3:30a.m. I was in absolute black and at first had no idea were I was. After 20seconds of hard thought I began to touch my face and body to figure out who I was. Finally after a time I turned on my bed lamp and looked around.</p><p>I was in my room, it was peaceful but eerily motionless. I felt like being in my room should be comforting but instead it felt strange and un-familiar. I looked around a noticed that my friends were sleeping on the pull out bed next to mine. Like everything else in the room they were completley motionless. Unsure of the events that had transpired sicne the car-ride I went through the multiple scenarios that could've happened. Coming up with nothing I decided to get up and move around.</p><p>I looked around my room carefully making sure not to disturb anything. In conjunction with my thoughts of re-birth it crossed my mind that perhaps by some power all the activitey in the world had ceased aside from my own. To test this theory I first used my headphones to turn on music. As I heard the sounds project from the headphones I felt somewhat more relaxed but still suspicious. I went over to my door but hesitated to open it, a fear came over me.</p><p>As far as I can guess the door became my symbolic re-entry into the real world. As I swung the door opened one of my cats came walking along the hallway. The sign of life aside form my own was relieving. I continued to explore my house and just as my room had been strange to me my entire house seemed alien. Everything seemed just so slightly out of place. After half an hour of getting used to me house I finally went back to my room and went to sleep.</p><p>From reading the experiences of other shroom users and thinking back to the events of that night, I found that re-birth I had experienced was an event that had been identified as evidence of a heavy trip. If for nothing else I recorded the events so that any first-timers can understand. This experience is a prime example of things to be careful of while experimetning with shrooms or hallucinogen.</p><p>While reflecting on the incident I also came to the depressing realization that the way my friends acted during my bad trip were all clearly motivated not by my bad trip but really by the fact that they might get in trouble if we got cought. This may sound pressumptuous but, regardless I recommend making sure your first trip is one that occurs in the presence of an experienced and truly good friend.</p>",
 "year": "2003",
 "id": "31884",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-05T08:00:00.000Z",
 "views": "2756",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
