{
 "title": "Recreation At Its Finest",
 "author": "Kvlt",
 "citation": " Kvlt. \"Recreation At Its Finest: experience with 2C-I (ID 31924)\". Erowid.org. Jul 27, 2005. erowid.org/exp/31924",
 "substance": "2C-I",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  "22 mg",
  "oral",
  "2C-I",
  "(powder / crystals)"
 ],
 "report": "<p>Approximately a week ago a couple friends and myself ordered 200 mg of 2C-I. It arrived yesterday, and a friend, D, came over to split the stuff up. I decided that the next day hed come over again and wed experience the 2C-I. D told me hed arrive at 8 oclock in the morning, so a shade before 7 am I dumped what I estimate to be 22-25 mg of 2C-I into a cup of orange juice, mixed it in, and drank it down. Tasted like normal orange juice. I had to use my finger to thoroughly mix, and make sure I got all the 2C-I. So at 7 am, I had the 2C-I in my stomach and I came over to the computer to write this.</p><p>T+0:10 - I finish writing the intro and put on some Vital Remains to listen and pass the time.</p><p>T+0:22 Anxious, and cant stop smiling. Is it kicking in a little, or am I just having some anxiety? Probably a little of both. I cant wait till the real effects start hitting.</p><p>T+0:30 I lie down because of the nausea. After a minute Im fine and go to release my bowels before D arrives.</p><p>T+1:00 I puked about 5 minutes ago, walk out, and see D parked in the driveway. Im tripping very hard now, wondering if I puked early enough to affect the trips intensity.</p><p>T+1:08 D takes his dose of 2C-I.</p><p>T+1:42 D still not feeling anything, Im still climbing. Tripping so hard that the words on the page melt together but are still legible in a small circle of vision.</p><p>T+1:54 D still not feeling anything. Im ever higher, I was looking at my jeans and Indian-esque, Arizona mesa patterns appeared.</p><p>T+2:00 D is feeling it, rubbing his legs without even noticing it. Im having trouble writing this report now. Sabbatical.</p><p>T+2:50 Both of us are tripping heavily. Listening to techno, and the sound effects are assaulting me. Print out the trip report to give people an idea of what its like.</p><p>T+3:24 Hes watching Jay and Silent Bob Strike back and Im going to see what a shower feels like.</p><p>T+4:17 Coming down somewhat now, watching The Wiggles on TV. When white text flows across the screen, its not made of white, its made of a bunch of different colors. White no longer exists.</p><p>T+4:26 Listening to The Kovenant - Acid Theater, and contemplating what to do now.</p><p>T+5:49 We went for a cruise to get some drinks and my trip rounded off nicely with a bit of flurries coming down. After effects are there, and some hallucination when I stare at things, but mentally Im fine, and my pupils are still big, but not quite as monstrous.</p><p>In hindsight, this is a great trip. Side effects were nausea, for me, and pressure behind the ears for D. Definitely not too intense at the dosage I had. The hallucinations were good, body euphoria was more than present, and all while retaining my mental precision. I had some epiphanies that melted away in my mind like a solitary snowflake. I find that sort of thing very enjoyable. Definitely a philosophical drug. Easy to get, easy on your brain, and low on side effects! Im very, very happy with my experience.</p>",
 "year": "2004",
 "id": "31924",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-27T07:00:00.000Z",
 "views": "6191",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 }
}
