{
 "id": 3193,
 "title": "In Love With Them All",
 "date": {
  "submission": "2000-06-22T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Jon Taylor",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.6 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Wow. WOW. WOOOOOOOOOOW! Sorry... Had my first X experience this weekend, and I though I'd tell the net what it was like, and also ask a few questions about this stuff to the people that know more about it than I do.",
  "I was well-prepared for the evening even before I took the X. I had eaten a sixteenth of shrooms (shitty) and taken 2 or 3 hits off the 3.5 foot bong my friend has called Goliath (really good weed, too). By the time I got to the rave, I was so fucked up I was getting deep meaning from the music, free-associating with everything around me, and generally out of my skull. It actually wasn't very pleasant for about 40 minutes, untill my friends got back (they had a problem getting into the rave and had to go back home to get some different IDs). I hooked up with my source soon after that, took the little pill, and sat down in the UV room they had there to wait.",
  "By the time the X kicked in, the weed had worn off and I wasn't so out of it anymore. The first thing I noticed was a subtle alteration in my perceptions, followed by a slow but steady surge of energy throughout my whole body. It wasn't like caffeine or ephedrine, where you get really jittery, but rather it was very smooth and pleasant (VERY pleasant. I think this stuff could be addictive). While this was going on, I was just laying back in the UV room digging the cool sensations, and I noticed that little things like moving my hands across the foam mattress I was laying on gave *VERY* interesting sensations. I tried smoking a cigarette, and found it to be an incredibly sensual pleasure (I normally don't like smoking). My friend came in (sorry no first names, I'm a tad paranoid), and I was overcome with a rush of freindship-type feelings for him, and demanded a hug, which felt SO wonderful (I'm not gay, and it wasn't anything sexual, just a freindly-type thing). That was at about T+50 minutes. I exchanged several more hugs with other friends. Shook hands with another first-timer, and just generally grooved on the cool vibes I was feeling.",
  "About five minutes later, Friend #1 convinced me to get off my ass and gout out to the dance floor and dance. I had been surprised before at my ability to just lay there (I had though that the Amphetamine effects would have procluded any kind of sitting still, but apparently not). I got out and start dancing at about T+1 hour. I was really feeling it now, so while I was dacing my ass off I was spinning up to random people and asking them 'are you Xing'? I only found a couple of people who were, but I ended up dancing with this cute girl from a nearby town. We were slow-grind-dancing for a while, when things started to get REALLY weird.",
  "All of a sudden when I was staring into her eyes, and she was staring into mine (I normally have a hard time looking people in the eyes, but it was totally natural) when suddenly I found myself feeling that tightness in the chest you get when you are in love. *LOVE*. I had met this girl 15 minutes ago (we're at about T+1:45 here) and I was totally in love with her. This realization completely threw me, and I just reveled in it while we danced for a little while more, and then sat down in the UV room and smoked some more cigarettes (again, this was LOTS of fun). Also, One of my friends procured some 'toys': a peppermint nasal inhaler (makes your head feel like a peppermint patty), and a rainbow glo-stick (very cool looking).",
  "My friends came into the UV room again, and I suddenly realized I was in love with ALL of them, male and female. It wasn't really sexual, just pure love (something I don't think I've EVER experienced before). We got up and went to another room sat down in a crowd of people, and rolled a J and smoked up. Not too long after this, my friends decided to leave, but I was having too much fun to go, so I stayed and danced with this girl until the place closed a couple of hours later, and then walked about *THREE MILES* home, IN THE POURING RAIN. I even got totally lost, wandering around downtown SLC, and I didn't care because I had so much energy. I'm damn lucky I didn't get triple pneumonia. Got home about T+6 hours, fell into bed, and slept on and off for the entire rest of saturday and sunday until noon. When I woke up, I found out that I had been grinding the living shit out of my teeth the entire trip, and they were loose in my sockets for about 12 hours. I need to get a chew-toy next time.",
  "My conclusions? One, it's REALLY REALLY REALLY fun. Two, I can see how it could be addictive. Three, make sure you organize yourself *before* you do it, because you lose things really easily. Four, beware of unintentional emotional bonding!!! This drug opens you up SO much that you can easily form deep emotional attachments to someone you don't even know. It should be REAL interesting calling this girl I was dancing with tomorrow (she wasn't Xing and I was). I dunno if I'll be doing this very often (it's $20 a hit 'round here), and it racks your body up pretty hard.",
  "Questions: It's been ~36 hours, and I'm still feeling it. How long before it goes away? Also, any health advice anyone who is more experienced than I can give me will be much appreciated. All those stories about neural damage give me a bit of a pause.",
  "Sorry for rambling on so long, but this was one of the most intense experiences of my life, and I had to get it off my chest."
 ],
 "erowid": {
  "id": "2038",
  "citation": " Jon Taylor. \"In Love With Them All: experience with Ecstasy (ID 2038)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2038",
  "substance": "Ecstasy",
  "views": "63071"
 }
}
