{
 "title": "Nirvana Inside It",
 "author": "Lizard King",
 "citation": " Lizard King. \"Nirvana Inside It: experience with Heroin (ID 31955)\". Erowid.org. Dec 31, 2006. erowid.org/exp/31955",
 "substance": "Heroin",
 "bodyweight": "60 kg",
 "report": "<p>Hi. My report is a weight Im trying to get rid off a for a long time now. I have had no great interest on drugs, as child. Instead I've always been a great athlete, and my physical health has been more than great (just before 3 years ago). I've been a swimmer. Anyway I won't take much of your time.</p><p>Three years I started smoking hashish, heavily. I've been smoking hashish heavily for 2 years, until I met a guy who used to hang out with guys that sniffed heroin. Only by seeing them sniffing the thing for me was just unacceptable. But after seeing them two or three times, I got curious. So I decided to try it.</p><p>So one day there four of us. We bought 1/2 of a gram, and sniffed it. I was really scared because I knew not much on that. Only that kills people. The quantity was too little for four guys. I looked at the brown dusty line, and I changed my mind. I said I wasn't going to do something like that, but under a lot of my friends pressure, which is the worst when doing drugs. I thought to myself 'fuck it I'll do it'. So I sniffed. It burned my nose a little.</p><p>A few seconds later I felt so relaxed and washed off of every little annoying thought I had. I sniffed three more times small quantities, until one day I bought 1/2 of a gram, but now there where only two of us. So I sniffed half of the line. I felt my eyes half-way closed, I felt nice. I sniffed the other half and so I begun for the big trip. You see, when I sniff heroine (or smoke, or shoot it up) I feel a feeling, like a huge wave of love, insurance, beauty, hugs me from behind. Heroin takes only a few seconds to take effect, and it is amazing. It is a feeling of absolute nirvana. I am washed off, of every sin, every bad thought, every problem. I simply exist in that moment and that all that matters.</p><p>After that I started sniffing heroin every day to fulfill my nirvana. So after sniffing heroine for four days in a row, the fifth day I found myself in my bed aching all over my body, vomiting, trembling, and not being able to sleep. I've been sniffing heroine for 3 months before I quit it. But when I quit it I went through the worst depression of my life, I wanted to kill myself, I though that nothing would be as before and a lot of different ugly thoughts.</p><p>I still don't think that things will be as before, but I feel better now.</p>",
 "year": "2003",
 "id": "31955",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-31T08:00:00.000Z",
 "views": "9777",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "(daily)"
  }
 }
}
