{
 "id": 32,
 "title": "Waiting for It to Happen",
 "date": {
  "submission": "2013-12-08T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "louse",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine "
  }
 ],
 "report": [
  "[Erowid Note: 150 mg of methoxetamine is considered an extremely high dose, see Methoxetamine Dose Chart]",
  "0:00. I go to purchase 50mg of what I was told was 98% pure MXE. He ended up putting 150mg on the table instead. I had one experience with MXE prior to this and knew the doses were 50mg and under. I had initially said I didn't feel safe doing all of it, but he assured me it was a safe dose.",
  "Immediately after snorting it I feel the intense alcohol buzz feeling I relate to Ketamine. Within minutes I am stuck to my couch.",
  "0:15. I'm realizing 150mg was too high of a dose for me to handle. I'm getting extremely hollow feeling, as well as feeling light but in a lot of discomfort.",
  "0:30. Time and space are irrelevant. I feel like I'm being ripped out of my body and it's very uncomfortable. I got extremely bad motion sickness. I had to lay flat on the floor face down just so I could feel like there was something nearby that was real.",
  "0:45. I am blacked out. I remember some of my experience but have no recollection of the events that actually occurred. The last thing I remember is being carried to my bedroom by a couple close friends of mine.",
  "But the entire time I had the most odd feeling, I felt like I had experienced all of it before, and that it wasn't just a party night, but it blurred my memories together and made me feel as if they were a collective experience. I had also felt a constant sense of deja vu. All I could do at this point was sit, try to stare, and wait for it to happen. Whenever I could feel my body or was aware of it it felt like it was churning or in constant motion, not as a whole but on a molecular level. My mind was tearing itself apart and there was nothing I could do to stop it, at this point. I was feeling tracers of everything but my vision, if that makes sense. Everything was the effect of a ripple and caused a ripple and that was the only feeling that was constant throughout the experience.",
  "6:00. I'm finally out of the pit. I feel extremely relieved to be out of it, even though I still feel outrageously nauseous. I'm still in an M-hole, but I am no longer blacked out. I had my friends help walk me back into my living room where the rest of my friends were. I kept trying to talk but my mouth could not form sentences. I sit on the couch and watch the sunrise through the main window, and at this point I can begin to find the experience somewhat enjoyable. I still felt very light, but I was able to get comfortable this time.",
  "8:00. I'm out of my M hole, left with nothing but an empty wallet, a severe headache, and a lot (and I mean a lot) of confusion. I'm thankful to be out of it. I'm definitely not sober from the MXE, but I'm getting there.",
  "When all is said and done I found that if someone sells a drug and is even a close friend or family, I need to research the dose myself. Personally I have experienced all the MXE I feel like I need to, and I don't plan on having it around me in the future. I don't know if it's possible to overdose on MXE, but I feel like I was very close to dying from this experience. All I can say is: be sure you know what you're taking, how much you're taking, and know your body before doing any sort of drug as powerful as this."
 ],
 "erowid": {
  "id": "100223",
  "citation": " louse. \"Waiting for It to Happen: experience with Methoxetamine (ID 100223)\". Erowid.org. Dec 8, 2013. erowid.org/exp/100223",
  "substance": "Methoxetamine",
  "views": "390"
 }
}
