{
 "title": "Relaxing and Refreshing",
 "author": "Topaz",
 "citation": " Topaz. \"Relaxing and Refreshing: experience with Tramadol (Ultram) (ID 32000)\". Erowid.org. Jun 24, 2007. erowid.org/exp/32000",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "210 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "Pharms - Tramadol",
  "(daily)"
 ],
 "report": "<p>Just a quick note to contribute my experience with this substance which spans over a year now.  I do not have an addiction and while I enjoy the pleasant effects of alcohol and other items, I never feel any withdrawal or cravings.</p><p>Here's what I have observed:</p><p>First effects: About T+20 minutes.</p><p>Full effects:  About T+60 minutes.</p><p>Daytime usage: OK.  Able to function just fine.</p><p>Evening usage: Very pleasant. Relaxed. Well-being. Comfortable. Great for web-surfing, reading, listening to music.</p><p>Night usage:   My most frequent usage.  I believe usage makes it more difficult to fall asleep. I do feel very relaxed and pleasant while Im trying though.  Once I fall asleep, I tend to wake often.  While this usually bothers the hell out of me, I feel absolutely wonderful when this happens on Ultram.  Euphoric, relaxed, slight fingertip numbness.</p><p>Aftereffects:  Even if I had trouble falling asleep or awoke several times during the night, I rise feeling great, relaxed, and well rested.</p><p>Side Effects:  Slight but noticeably increased itching.</p><p>Overall:      A really pleasant, relaxing experience with little or no downside and no withdrawal or addiction danger (at least with me).</p><p>Other:  I tried to experiment by adding a Soma to the mix and found the experience to be very satisfactory.  Helps reduce the tendency to lie awake when first retiring.</p>",
 "year": "2004",
 "id": "32000",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-24T07:00:00.000Z",
 "views": "5174",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(daily)"
  }
 }
}
