{
 "id": 3201,
 "title": "Frustrating and Exhausting",
 "date": {
  "submission": "2003-06-28T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "sara",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "I had taken ecstacy once before and had an amazing time so I decided to try it again.  I was in the perfect place to do it.  I was at my favorite outdoor concert venue, school had just ended, one of my favorite artists was performing, and I was with all my best friends.  We all took our pills before the show started, and within about a half hour we were feeling the effects kick in.",
  "My frineds seemed to be all having a good time and were excited for the effects to increase.  I on the other hand started to get a feeling of ambivilence and physical weakness.  I got kind of worried that I would not have the same roll that I did last time but I knew I had to keep a positive mindset.  Afterall, i have found that my mental set has a large impact on my experience with drugs.  Unfortunately, this did not help and I started to really get scared that something bad would happen to me.",
  "My best knew I wasn't enjoying myself so she took me to a less crowded area and sat me down under a tree.  All of a sudden something really bad happend to me.  I felt overwhelmed with physical weakness; I was so hot, sweaty, shaking like it was -20 degrees outside, and so tired.  Then I got really sad and the fact that I was missing the show made me even more upset. ",
  "Then I got very very frustrated. It seemed that my emotions would change every few minutes from sad to frustrated to scared.  I was being very safe by drinking water and resting but this did not help.  When i stood up I felt happy and I thought the bad part was over so I went back to the show, but two minutes later it went away.",
  "This was all very exhausting.  I do not know why this happened because 7 other people took the smae pill and had a great time.  This goes to show that no matter what the circumstances are, there is still a chance of having a bad experience.  Don't take the chance becaue even though rolls can be fun, it can be HORRIBLE!"
 ],
 "erowid": {
  "id": "20417",
  "citation": " sara. \"Frustrating and Exhausting: experience with Ecstasy (ID 20417)\". Erowid.org. Jun 28, 2003. erowid.org/exp/20417",
  "substance": "Ecstasy",
  "views": "6643"
 }
}
