{
 "title": "The Throes of the Lockbox",
 "author": "Anonymous",
 "citation": " Anonymous. \"The Throes of the Lockbox: experience with Clonzepam (ID 32060)\". Erowid.org. Aug 19, 2006. erowid.org/exp/32060",
 "substance": "Clonzepam",
 "bodyweight": "125 lb",
 "report": "<p>I have been addicted to Clonazepam for over a year now, and I'm still 'recovering'. </p><p>The first time I ever did Clonazepam was with my friend J.  He had a prescription for anxiety and he gave me 2 of his 2mg pills.  I took them and didn't feel much but mild confusion and dizziness.  It made me really tired and I just passed out.  I wasn't all that impressed at first.</p><p>Later I found out that I had very easy access to it.  I started taking a pill here and there.  I had a pattern.  I would take one every few days.  I started to save them up and take more at a time.  After I tried higher doses and liked them, I started taking 2 or 3 pills at a time.  I started to feel like I needed them.  I would think of things that I had planned and decide that I would function much better if I had a few Clonazepam in me.</p><p>What made it worse was that my boyfriend was prescribed Clonazepam also, shortly after I started liking them.  He would give me a few here and there, until he started to get worried about me.  He stopped getting refills so I wouldnt have an access to them, although I still did. </p><p>After a few months of this I started getting panic attacks (I hear now that it could be because of taking so much Clonazepam).  I would get them constantly and they were very intense, interfering with school and my life.  Now I had a reason, besides my wanting to get fucked up, for taking Clonazepam.  I started to really feel like I needed them. </p><p>I hadn't known it, but Clonazepam is also a depressant.  When I took large quantities of it...everything that I heard was depressing.  The only thing I wanted to do was cry and pop a few more Clonazepam. </p><p>When I finally realized I had a bit of a problem was when I found out I had taken over 40 pills in less than two weeks.  I told my 'supplier' about what was going on, and the pills were put in a safebox. </p><p>My life doesnt revolve around Clonazepam anymore, but every once in a while I look for the key to the lock.  Sometimes I'm successful.  But most of the time I'm not, and I'm glad. </p><p>Like 'they' say 'Once an addict, always an addict'.  I'm just glad I'm aware of what I'm doing to myself now.</p>",
 "year": "2004",
 "id": "32060",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-08-19T07:00:00.000Z",
 "views": "20188",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  }
 }
}
