{
 "title": "Long Easygoing Night of Interesting Talk",
 "author": "WickedMaistah",
 "citation": " WickedMaistah. \"Long Easygoing Night of Interesting Talk: experience with Cocaine & Alcohol (ID 32063)\". Erowid.org. Nov 15, 2007. erowid.org/exp/32063",
 "substance": "Cocaine & Alcohol",
 "bodyweight": "78 kg",
 "header": [
  "DOSE:",
  "750 mg",
  "insufflated",
  "Cocaine",
  "(powder / crystals)",
  "",
  " repeated",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>Where: Amsterdam, The Netherlands, Europe</p><p>When: 20th March 2004 (7PM-8AM)</p><p>What: 5 grams of pressed cocaine in lumps (EUR 250) and lots of beer (I'm not on any medication or smoke)</p><p>Who: 5 males, ages 21-30, mostly students, one is a good friend of mine (alles slecht?) and the rest are his friends whom I didn't know</p><p>Why: A friend's birthday, curious and 'You only live once'.</p><p>My personal drug history in a nutshell:</p><p>Absinthe: some but no hallucinogenic effects</p><p>Alcohol: quite extensive field experience</p><p>Caffeine: just tea (and see Red Bull!)</p><p>Cannabis: irregularly for the past 6 years</p><p>Ephedra: 7 times, double doses</p><p>Guarana: 20 times, one fat overdose</p><p>Mushrooms (Hawaiian and Mexican): 7 times</p><p>Nitrous: 2 times</p><p>Red-Bull Energy drink: had 14 in one night == strung out in the morning</p><p>2-ct-7: 2 times, pretty light, happy trip</p><p>As you can see I've only had 'soft' stimulating drugs and wasn't really planning on trying E, speed or Coke. I think those drugs are relatively straightforward drugs and not in anyway intellectually challenging for the mind as hallucinogens can be. But this friend of mine was going to have his birthday and I heard from quite a lot of people I know they took coke. I also witnessed friends of mine taking it, I refused a couple of times.</p><p>This time, I thought: what the heck, you only live once and how good can it be, cuz it's just simple and I like complex. My motivation wasn't (and still isn't) exactly clear to myself so I'll summarize it by saying I just felt like it. I dislike the possibility of me doing coke out of peer-pressure. So, there we were in the centre of Amsterdam, getting ready for an evening of beer and coke. Me and a friend were first-timers, the others probably did coke before (didn't ask). We were in this guys big room, couches, pc, big screen TV, lots of entertainment.</p><p>22.00h</p><p>The first lump of coke was grounded and put on a handy mirror, a cut McDonalds straw was used as method of insuction :P The coke was passed around, I took the straw and didn't glimpse into the deep end but just dived/snorted right in. The lines that were cut were pretty thin and small, as far as I can say. Maybe .05 grams or something. We did lines throughout the night irregularly once every 20 minutes.</p><p>Bitter taste, some numbness in the mouth, I read about that and it was there alright. But in spite of what I read, there was no sudden change in consciousness, no immediately elevated mood or energy. Maybe thats my inexperience with coke but according to the other first experiences I read, the first time is highly noticeable. Maybe I didn't snort enough. After about 20 mins we all did another line and basically this pattern repeated itself irregularly through the night. The lines we made were kept of the same size.</p><p>The physiological effects I felt were the following: increased body temperature, somewhat higher heartrate, some chills down my spine, bit of adrenalinesque feverish shudders sometimes. The more positive effects I felt were mostly indirect, I didn't get drunk although I drank beer in a reasonable rate from 7PM-7.30AM. I didn't get tired at all actually. When I got up to go for a piss I felt that my body was somewhat drunk and tired, but my mind wasn't and there's no democracy in my body! :D</p><p>The most positive effects I noticed was a slightly more analyzing perspective on stuff in general and a lot(!) of talking and less inhibition to talk. Especially considering I only knew one of these dudes before tonight. We had pretty cool conversations all through the night. That was actually the part of the evening I enjoyed most, just sharing our experiences and viewpoints, the time flew by during these talks. We played some mad tunes (mostly trance) and saw two movies muted, Resident Evil and Shrek, also some music-DVD's.</p><p>When I'm sober I've got all these wonderful characteristics already (analyzing, talkative, outgoing), so maybe that's why I didn't notice a lot. The rhythm of the whole evening was pretty laidback, no energy-peaks or something but somewhat intense conversations. No hostile intensity, just...intensity.</p><p>Conclusion:</p><p>It was less than I expected from it. IMO: if this is a hard drug then mushrooms are mega hard drugs, way heavier for the mind. I was hoping for a big energy/ego boost and feelings of bliss and so on but in the end I just had a pretty cool night with some dudes, the coke kept me relatively sober and awake. I think I should've done bigger lines, cause I think I wasn't as high as coke can make someone. The effects I did experience were okay but not worth the money. But I seriously doubt if I will do coke again, as I have said exhaustively in this report, in my opinion psychedelics are way more interesting.</p>",
 "year": "2004",
 "id": "32063",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-15T08:00:00.000Z",
 "views": "5607",
 "dose": {}
}
