{
 "id": 3207,
 "title": "My Deepest Thoughts Rescued by Ecstacy",
 "date": {
  "submission": "2000-06-22T07:00:00.000Z"
 },
 "author": {
  "name": "Nick",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "82"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I am usually the type of guy that gets nervous and worried when I try new things. I generally get scared and second guess everything I do. Once I took ecstacy, all worries and fear diminished, all stress and pain was eliminated, and this is where my story begins.",
  "A friend and I were hearing a lot about ecstacy at our school that year, how everyone has tried it and how everyone loves it, but you know me I turned it down several times before my encounter with complete bliss.",
  "Now I have smoked weed before, I didn't like it, it felt too much like a dream and I acted too spacy and I never laughed my head off like everyone else seemed to do. Weed just wasn't my thing, I have quit alcohol for various reasons. So at the time, I was not into any type of substance. I get straight a's and I have a girlfriend, I read books and I love to have fun with my friends. I am your respectable average middle class income kid.",
  "When people told me about their experiances with ecstacy I thought nothing of it and went on about my daily life. Until my best friend tried it with others one day, I was shocked that he would do such a thing, and terrified. But he changed my mind with his persuasive skills he always seems to bring about right when I am vulnerable and non-skeptical. So we sat home one day, it was a friday of our spring break and he slid a glass of water that he spent time preparing for me. I said to him 'are you sure this won't mess me up too bad?' and he replied by saying 'oh no way, I have done it 4 times now and I'm better than I have ever been before!' So I said alright and I quickly chugged the water down containing the exact measurement of 82 mg of ecsatcy. After a few minutes it felt like a marijuana buzz and I didn't like it at all, infact I hated it and I just wanted it to be over with.",
  "After about half and hour my mind tripped, everything in my vision got wide and it flobbelled back exactly how it did on The Matrix in the hallway near the end of the show. Anyways, yes everything went hazzy on me for a second, then I quickly regained control. It wasn't like weed, it was different, an unexplainable rush to my brain triggered every nerve in my body to thrust to my friend and grasp him in the tightest and most affectionate hug I have ever experienced. How I felt was so miraculous and joyful that I let the dogs inside, which I never do. I let the dogs up and i sat there and scatched and petted them, their fur felt so delicate and tingly that it caused me to have this sudden urge to feel so innocent and pure, I was born-again and no mistake plagued me because I was trapped in the halls of bliss that I could not recognize anything wrong at the time. I then shouted 'It's all good!' a few times as I laid on the floor next to the pets that I have been petting. The very sense of the carpet just corressing my back was enough to put a huge smile on my face let alone all the intricate details of the time.",
  "I called up my girlfriend, and I said that i would be coming over in a few minutes, she said for me to come in an hour because she had to take a shower because she was out tanning. So as that hour past, I was on top of the world just watching t.v. feeling a sense of connection with a girl every channel I turned it to. An hour past and I dropped off my friend at his house then I drove to my girlfriend's house. As soon as I arrived she was out on her porch and I ran to her and gave her the biggest hug and such a passionate kiss because I felt motivated from all the girls I fell in love with on t.v. So as I did this her friend that was over there goes 'awww' like that but neither one of them had the slightest clue that I am high on ecstacy. The feeling of warmth and sensations of touch kept rushing to my brain as we held hands on her porch. They had their music on inside and as I heard the music I could feel something click, I made a connection with Aaliya that day and I still have feelings for her to this day. The day grew long and I still felt as good as ever. My vision was distorted in that the rooftops across the street shined bright with reflections of the hot sun, the very sight of it made me drink glasses upon glasses of water.",
  "My high was coming down and I was nearly straight, but then my girlfriend started talking about where we are going with our relationship. She gave her thoughts as to what she wanted and what we are going through. When she was done I began my soapbox, I was so in touch with my thoughts things came out that I never knew before hand. I came around to defining what a relationship is and why we have relationships and what I wanted in ours. It's as if my deepest thoughts were rescued by little ecstacy guys and they came out of my mouth like it was a water slide, just shooting ideas and perspectives on issues in our relationship. I found it easy to express myself, maybe because I was immune to the world around me as I spoke, I just completely drowned out everything and put total concentration onto this topic. She was throroughly impressed and recommended that we talk more about problems facing us. By the time her mom was about to come home, I was down again and normal, I still felt a little funny but I acted straight. She came home and I greeted her with a hello and how was your day? We had a true friendly conversation and I have been like that ever since, I still second guess lots of things but for the most part my expericance is not regreted. My advice, if you think you have social problems and/or trouble expressing inner thoughts, take this once and you will be positively changed."
 ],
 "erowid": {
  "id": "2043",
  "citation": " Nick. \"My Deepest Thoughts Rescued by Ecstacy: experience with MDMA (ID 2043)\". Erowid.org. Jun 22, 2000. erowid.org/exp/2043",
  "substance": "MDMA",
  "views": "3649"
 }
}
