{
 "title": "I'm Having a Moment with the Sky",
 "author": "Dr. Grav",
 "citation": " Dr. Grav. \"I'm Having a Moment with the Sky: experience with Mushrooms (ID 32108)\". Erowid.org. Jun 9, 2007. erowid.org/exp/32108",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>On a Tuesday my roommate and I both bought an eigth of shrooms.  On Wednesday my roomy ate them and successfully tripped and endorsed the quality of the shrooms.  He smoked a lot throughout his experience and told me he had seen a lot of things and during his peak he wanted it to end.  After hearing this I decided not to smoke any during my trip.</p><p>I waited until Saturday.  At about 4:30pm I went to one of the cafeterias on campus and bought a cheeseburger.  I took it home and opened it up and put the eigth of shrooms inside it.  That was a horrible burger, it tasted so dry and dead but I didn't care since I knew they would taste awful.  I remember looking at the clock, when prep was done and I had finally eaten the entire burger it was 4:53pm.</p><p>'Have fun man.'  My roommate said to me as he put FIGHT CLUB in.  I knew I had between 5 minutes to an hour before they kicked in so I went upstairs to my girlfriend's room to grab my pillow.  I came back down and began watching the movie with my roomy.  By about 5:15pm I was feeling really weird.  I felt very anxious like something big was about to happen.  I wondered how this trip was going to be.  I couldn't concentrate on the movie, I just kept wondering how far out I was going to go.  I stood up and looked at my roomy's dresser.  It appeared to be moving toward me and I said 'cool.'  My stomach felt quesy but it wasn't anything that I couldn't happen.  I worried that if it became too much I would throw up and lose my $35 investment.</p><p>By about 5:25pm a friend came to the door (call him 'H') and asked if anyone wanted to play frisbee.  I jumped at the idea because I was feeling nervous and wanted to get out of my tiny dorm room.  When we got outside my entire body was feeling 'interesting' to say the least.  My entire body had every emotion rolling over every part of it.  If I thought a nervous thought for a second my entire body reacted.  It was good to be outside though.  I felt much happier and less nervous.  It was at this point that I told H that I had taken an eigth of shrooms and that I was starting to trip.</p><p>I didn't do too well at frisbee because I was feeling very detached from my body but yet a part of everything else.  I've never felt so close and connected to nature.  I felt so at ease when the breeze blew over me.  I wasn't halucinating yet but the colors were definetely brighter than ever and very very interesting.  I reacted emotionally to everything that happened.  Whenever we were in a good rythm with the frisbee and weren't dropping it I was so happy and warm but when we dropped it and lost that rythm I felt scared somehow like my trip was going to take me over.  I remember looking at all the trees to see if I could see anything.  I wasn't halucinating but the patterns on the bark of the tree held my interest for a good time.  H told me 'Dude, throw it back!'</p><p>At 5:50pm H told me he had to go to dinner and that he would come back and play with me after he ate.  I didn't want to be alone so I went back inside with reluctance and said to my roomy 'dude, let's go outside.'  He wanted to watch FIGHT CLUB so he declined.  I sat down at my desk and felt confined so I thought about where I could go.  J came to the door and asked my roomy (call him W) to go to dinner at one of the dining halls way across campus.  W asked me to come because I could look at all the colors and watch the mountains and sunset from the dining hall.  NOTE: I go to college in Southern Virginia so I'm surrounded by the Shenandoah Mountains in a small town.  We began walking outside and I just couldn't ignor how lost I was.  I just felt completely lost.  I was myself but all the sensations of the trip were becomming intense and I knew I had to be peaking or at least close.  I looked at my watch: 6:05pm and I thought 'I still have a while to go.'  I wondered whether this was a good thing or a bad thing.  I wondered that if it got worse could I handle it?  I decided to go with it and live each moment of the trip as it came.</p><p>We walked to J's car and got in.  It was such a beautiful day and because Spring was coming all the trees were beginning to have buds on them.  I rolled the window down and J put on a Senses Lost CD.  I remember feeling like a hippy.  I kept feeling so connected to nature.  Whenever the car moved the breeze blew on my face and I felt so good with the music filling my body and making the sky dance in my head.</p><p>However, whenever we stopped the car at a stoplight I felt confined and very nervous.  Apparently I was farther out than I thought becuase my roomy told me I was dead quiet in the car and then when he asked me how I was doing I said 'I'm having a moment with the sky, I can't explain man.'  I guess I was a little more connected than I thought.  It was a great drive up to the top of the hill where the dining hall was because we could look at all the mountains. </p><p>Once inside I wasn't hungry but I was affraid to lose J and W so I stayed with them in the cafeteria.  Indeed it was very bright with lots of interesting colors to look at.  I did feel small and had the sense that the hall was massive so I pushed my back up against a coke machine and patiently waited for W and J to get their food.  They were getting something from a grille-type place so I was glad that I got to watch the fire.  W said that there was a moment where he thought I was freaking because he said I just stood completely still looking at the flame grilling a burger.  When W and J got their food I asked if we could sit by a window so I could look out.  We got the best view I've ever seen.  I sat on a comfortable brown leather chair looking out of a huge bay window over the Shenandoah Valley.</p><p>The sun was setting so I saw all the mixture of colors and how the light reflected off of the ground and all the clouds.  It was so beautiful, W asked me what it was like and all I could say was 'it's so beautiful.'  W told me at this point my pupils were the size of pennies.</p><p>The conversation at dinner was when things started getting interesting/scary.  At this point time was extremely slow.  I felt like we were sitting there forever.  I began feeling the nausea again except it was more intense.  I looked around for a bathroom in case I was going to throw up.  W and J kept talking about normal things and I couldn't pay attention to it.  I kept looking out the window at the sunset and feeling all the sensations in my body.  The nausea would rise and my heart would beat louder in a state of panic.  I told myself that it comes in waves and to just play it cool and wait it out.</p><p>Near the end of dinner J was asking me what it was like to trip on shrooms but I couldn't describe it to him.  I was feeling panicky and ready to leave.  I learned that he had tripped on LSD a year ago on a boat trip and that it was the scariest experience of his life.  I didn't want to converse with them because I was feeling so weird and somewhat panicky.  I began to feel a very strong sense of panic as my body tingled and I gripped the chair handles and looked down.  I began feeling so small and insignificant and that the room was moving.  I looked at the weird carpet which I cannot describe now since I've only been to that food place once and it was while tripping (knock on wood).  But the carpet seemed to be moving and raising up at me.  Out of the corner of my eye it looked like W's chair was moving backwards as if he was being dragged toward the corner of the wall.  I shut my eyes and opened them again.  W was where he was before, J was the same and the room wasn't moving. </p><p>I was feeling quite strange and I told W and J that I wanted to walk home.  W told me 'I don't think that's such a good idea' and laughed at me.  I agreed with him and was glad when he stood up to leave.  We walked back out to J's car and got in.  The wind at the top of the hill was cold but I still opened the window when I got in.  On the ride home we overlooked a large shopping center with a lot of lights.  W said 'how ill does that look dude?' and I just nodded back to him.  He laughed.  I was glad that W understood because he had tripped off of the same shrooms only 3 days ago.  He told me that during his peak he was thinking 'please god let it be over' so I laughed in my head.  I also found it quite funny that W and J were completely normal and I was tripping balls in the back seat of his car.</p><p>When we stopped at a light on campus the music disapeared and I began to hear a voice in my head.  I smoke a lot of pot so I'm used to hearing vivid music and crystal clear vioces in my head so I didn't mind it.  I looked at one of the buildings on campus and admired its architecture.  I can remember the voice telling me 'You're going to be ok, just relax and enjoy.'  At this point I was actually wondering if I was tripping.  I kept thinking 'What is a trip? What is tripping?'  Then I reached up and pinched myself because of course I was tripping.</p><p>When we got back I don't remember what time it was but I ran upstairs and grabbed H to come play frisbee with me.  Now it got interesting.  Becuase the sun was going down and the field was lit by several bright lights from the dorms.  The lights were so bright with long trails coming off of them.  I was feeling better and was excited to be playing outside in the dark.  Since all the daylight was gone I started to see things.  I saw rings of color around the clouds and when I dropped the frisbee I saw 'I LOVE YOU' on the ground in beems of light.  I said 'Hey cool!' to H and stopped the game for a minute to try to explain how I was feeling.  I couldn't find the words to express myself and I managed something like this 'There's just so much going on inside my head man, I can't explain.'</p><p>When I was watching him the outline of a face appeared in front of my eyes.  Only the outline in rainbow colors.  I decided that I didn't mind it and didn't say anything.  I kept feeling as if the world wanted to talk to me.  I saw a face smiling in the clouds and asked H if the clouds did indeed look like a face.  He told me 'no' and laughed.  H told me he was interested in doing shrooms too and to tell him about my experience when I could.  We finished playing frisbee around 8pm and I was still frying pretty well so I asked him to take a walk with me.  The thought of being indoors worried me and I was affraid that I'd freak out and be confined.  We walked across the feild quietly to the on-campus convenience store.  I enjoyed all the colors inside.  All the labels were so bright and made me feel great.  I grabbed a Lipton Ice tea because of the bright yellow label.  When we left the store I was feeling incredibly detached and I tried to explain this unsuccessfully to H.  He nodded and told me that he understood.</p><p>H went inside and I walked upstairs to my girlfriend's room.  I walked in and immediately noticed the beautiful color arrangement of her bed.  Her comforter was a glowing purple and her pillow was a bright green.  Her desk lamp cast down light over an assortment of trash on her desk and I thought it would look great as a painting.  I didn't tell her this since she was mad hungover from the night before and doesn't endorse my drug habit.  The highlights in her hair were so bright and pleasing and I crawled into bed beside her.  She and her roommate L were watching TV.  I tried to watch but couldn't focus on it so I turned my attention to her room.  I began feeling confined again so I asked my girlfriend if she wanted to go get some food.  She said 'No, but maybe later.'  After hearing this some panic arose in me.  I thought about leaving but I didn't have an excuse.  She's never tripped so she couldn't understand how I was feeling.</p><p>Her roommate L stood up and they started talking.  In the upper corner of the room beams of light raced around rapidly.  I just sat on her bed and watched this amusing display while laughing at myself.  My girlfriend finally decided to go with me to fet some food.  As we walked across the parking lot I kept my pace slow so I could look at all the pretty lights.  Once again I was at a dining hall tripping and enjoying the colors.  I could actually enjoy them now because I was feeling attached to myself again and the only effect left was a feeling of calm and pleasentness and I could still enjoy the amazing colors.</p><p>When we walked back toward our dorm I watched 2 yellow budding bushes that appeared to be on fire.  My girl asked me 'Are those lights really pretty?'  I said 'Yeah, they're beautiful, I wish you could see them.'  She nodded.</p><p>After that we just went upstairs and watched TV as I came back to normal over the next hour.  I felt very tired and out of it after the experience but since it was a Saturday night I began drinking at 9pm and partied the entire night with my friends.  I felt very pleasent the rest of the night and was glad that I tripped during such a nice day.  I will do shrooms again but only on a nice day when I can be outside with friends and enjoy the experience with someone else who's tripping.</p>",
 "year": "2004",
 "id": "32108",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-09T07:00:00.000Z",
 "views": "3129"
}
