{
 "id": 3212,
 "title": "Lost to the Wonder of Cactus",
 "date": {
  "submission": "2003-01-18T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Azrael",
  "gender": "Male",
  "weight": 55
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "ground/crushed"
  },
  {
   "time": "0:35",
   "amount": "600 ml",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "tea"
  },
  {
   "time": "1:00",
   "amount": "1 button",
   "administration": "oral",
   "substance": "Peyote",
   "form": "plant material"
  }
 ],
 "report": [
  "About eight friends and I were going out raving after having not raved for nearly 6 months expect for a month ago. Four of us were taking Syrian Rue plus san pedro but I was the only one taking peyote as well. Of the four of us there was Brain, Robert, Anthony and myself. Brain and I are the only ones who have taken cactus at a rave and Anthony was a cactus virgin.",
  "Before this I have consumed san pedro at least 10 times a peyote twice. Syrian rue is a wonderful tool that allows one to get the most out of cactus ingestion by increasing the effects by a factor of 2 1/2. CAUTION MUST BE TAKEN WHEN USING AN MAOI such as syrian rue as they can be very harmful or even fatal if miss used!!  ",
  "The four of us took the syrian rue at 9pm after not eating for the whole day (this is highly recommended as it greatly reduces nausea). At 9:30 in the car park outside the rave we started the task of drinking the san pedro juice. Normally I mix fresh lemon juice in with the san pedro to cover the bitter taste but tonight I just wanted to drink as much as I could stomach, so lemon juice was not added. The taste was horrid like always so we scold a glass at a time and this was quickly followed by a glass of juice. Anthony, Robert and I drank 3 glasses but all we all choked and brought the third glass back up.",
  "There was still more juice but we decided to leave it for next day. The four of us told the others we were going for a walk to get Quick Ease (also helps reduce nausea). On the way I chewed my peyote button and started to feel the pedro coming on. By the time we got back to the car park I was seeing tracers of everything. Cars and other metallic objects had shiny hazes around them when I moved my head. So far I had only the warmth buzz that I always get from pedro and some nice visuals but the cactus had not yet affected my thinking. Standing in the line up I started to space out, it was hard to take part in a group conversation as I tended to loose track of what was being said.",
  "Once we were in we headed for the back of the dance floor to meet our friends. I sat down and closed my eyes and like my previous experience I was lost in a world of clear soft and warmth patterns. After closing my eyes for about 2 minutes these patterns changed into vivid images. These images started to tell some type of story.",
  "One I remember clearly was seeing a clear sky turn cloudy then the clouds turned darker and cause a bolt of lighting to fall from the sky and strike a forest tree. This tree then burst into flames and started a fire that threatened to destroy the entire forest. Next it started to rain and the fire subsided. After the fire was completely diminished the clouds broke apart and the sun shone brightly upon the forest as smoke rose from the ground cleared by the fire. This just one of the many short stories that I experienced and I remember it clearly because of its simplicity. All these short stories as I will call them were experienced with a natural feeling of understanding no matter how abstract the visions were. I have found that acid visions of this magnitude are normally coupled with feelings of confusion and sometimes even fear and panic.             ",
  "After opening my eyes I realised that I was at the back of the dance floor something I have momentarily forgotten. I looked at my watch only to find that I had been at the back of the dance floor for 5 minutes. I told Anthony who looked surprised and said that had felt like about  hour. The two of us decided to go for a walk. As I walked along the dance floor it seemed as people I could not see properly and appeared to me as shadow like objects that were not living. By this time I was also experiencing warmth body tingles and strong feelings of euphoria. I spent the next  hour walking around talking to people I had not seen in a long time and lost Anthony is the process.",
  "Holding one-to-one conversation was normal while group conversation was still a bit of a lost cause. I run into my brother and his friends who were looking to get some E (they hadnt had rue or pedro). My friend and I went looking for some people we thought could help us out while my brother and the others did their own thing. The police presence at this event was a lot higher than one would normally expect for a rave of this size. As such getting on for E turned into a hit and miss affair on numerous occasions. I spent the most of the nite running around looking to get on for my friends but instead running into people and talking for most of the nite. I was able to dance but not for long periods of time without my legs feeling tired.",
  "During the nite I also revisited the places that were made accessible by closing my eyes and forgetting about what was taking place around me. Occasionally people would tap me on the shoulder and ask, Are you alright?. By now it was 3 am the cactus was feeling different now, I think the peyote had fully kicked causing the change. The physical sensations like tingles and rushes that I had felt earlier were not as pronounced but the overall experience felt like it had changed its path. This change was neither positive or negative it just something that happened. As the night came to an end I my brother and his friends headed off on the long drive home while brain and I started our trek to his sisters house. We farewelled everyone then walked to the train station.",
  "We walked past a group of people who had also just left the rave all of which were dreading the walk to the station where as Brian and I found the walk quite pleasant. We spent a couple of hours there not doing a great deal then we headed back home. Back at home my brother and the others were asleep. I made myself a sandwich and spoke to my neighbour who had missed out on the nite before then spent to bed about 4:30 pm and woke at about 10:00pm that nite and had dinner with my mum then went back to bed. I woke the next day at 9:30 with very peaceful afterglow sensation that stayed with me for most of the day."
 ],
 "erowid": {
  "id": "20443",
  "citation": " Azrael. \"Lost to the Wonder of Cactus: experience with Syrian Rue, San perdo  & Peyote (ID 20443)\". Erowid.org. Jan 18, 2003. erowid.org/exp/20443",
  "substance": "Syrian Rue, San perdo  & Peyote",
  "views": "31677"
 }
}
