{
 "title": "It's In The Eyes",
 "author": "JLeigh",
 "citation": " JLeigh. \"It's In The Eyes: experience with Methamphetamine (ID 32196)\". Erowid.org. Mar 12, 2007. erowid.org/exp/32196",
 "substance": "Methamphetamine",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Methamphetamine",
  "(powder / crystals)"
 ],
 "report": "<p>I have encountered the most vibrant of people, those with such life and purity of soul shining through their eyes. I don't care what anybody says, the eyes are the true window to the soul, and there is no 'ideal' eye color, the beauty doesn't lie within the color of the eye, the beauty DOES lie in what radiates from them.</p><p>I have also seen horrible tragedy befall these wonderful souls. I have seen the life and beauty slowly drain away from the once vibrant eyes.</p><p>Don't think this is a 'drugs are evil, lets be straight edge' sermon, its not, and I don't believe that drugs are evil. Some drugs make me feel impervious to anything life can throw at me, others can relax me to the point that I just don't care. I've personally dealt with both of those. There are many more types, but I don't like to talk about things I have no experience with.</p><p>Things like cocaine and methamphetamine are of the type that makes me feel like a god, unstoppable, invincible and overall great, at least for awhile but nothing is free, I payed the price for it. These drugs can consume a person, take over their personality, don't tell me it only happens to the weak, I've witnessed it in what used to be some of the sturdiest people I know. They have the potential to devour the very fiber of one's being! I know, from watching it happen, and having it almost swallow me up.</p><p>I've used methamphetamine many, many times and at this point in my life, I regret each time now that I see what it has done to people. If whoever reads this couldn't gather from the above writings, I no longer use this dangerous substance I thought I fell in love with. It causes the speechless to become eloquent, the meek outgoing and confident and the weak become strong while under its influence.</p><p>Looking into the eyes of Nicole, someone I met at the beginning of this school year (2003-04 CGUHS, my junior year) I see nothing but blankness, blankness and the anticipation of the few lines of meth her mother prepares for her in the morning in place of breakfast, because the mother is too strung out on heroin to cook. The lack of life in Nicole's eyes has scared me away from methamphetamine forever, although I was addicted and still consider myself an addict, because everyday I get horrible cravings for it.</p><p>Nicole's once gorgeous green eyes, the most beautiful eyes I have EVER or most likely will ever encounter again, are lifeless, soulless and gone. Killed along with what made her who she once was. Now she is a shell, a human zombie. A dead mind with a barely living body. In the six or so months I have known her, she has slowly become a sickly, frail mindless human being, if you can even call her that, because my definition of human, is the purity of soul that we all share.</p><p>All she lives for is the hope that her mother will be generous again in the morning, she has pruned the serotonin receptors in her brain so far back, enormous amounts of serotonin and dopamine are required to generate even the faintest smile. A similar thing has happened in my brain, only not nearly as severe although, I will never be able to be as happy as I used to be.</p><p>I pity anyone who suffers such an existence, and her and I know very well that she is suffering. If I progressed to the point of death of the soul, I would rather end my existence than suffer along as a dead husk of a human.</p><p>In a way, I have to thank Nicole for helping me to realize, before it was too late, what this chemical can do.</p><p>Yours in humanity,</p><p>Leighton, methamphetamine addict.</p>",
 "year": "2004",
 "id": "32196",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-12T07:00:00.000Z",
 "views": "12431",
 "dose": {}
}
