{
 "title": "A Great Adventure!",
 "author": "Catfish Rivers",
 "citation": " Catfish Rivers. \"A Great Adventure!: experience with 2C-T-7 (ID 3220)\". Erowid.org. Oct 8, 2000. erowid.org/exp/3220",
 "substance": "2C-T-7",
 "bodyweight": "275 lb",
 "report": "<p>About a month ago I had a very fun day taking 2C-T-7 and going to Six Flags Great Adventure theme park in NJ. I am a social worker who works with mentally ill people. On this day, I was accompanying them to the theme park for the day. Now, I realize many would think this a very irresponsible thing to do, and that is fine if that is your opinion. What happened to me that day was wonderful though. I took the gelcap aprox. 1 hour before we were due to arrive at the park. I noticed the first alert of activity as we were driving through the Safari section. The monkies were out of control! They did $200+ worth of damage to our van. Anyhow, the day in the park was a very connective experience, in that my emotional tie to my clients (the patients) seemed to be strengthened by the openess that I was feeling towards them. I felt very understanding of their problems and free to disclose my own problems in comparison. Now, I already got along great with the clients (they affectionately refer to me as 'The Head Client'). The 2C-T-7 just shed some light on the fact that people are people, irregardless if they are nutz or not. We're all nutz in some way.</p><p>Anyhow, no one was able to tell that I was high. In fact, when I disclosed this to a co-worker, she was astounded. For some, 25 mg would have produced a heavy experience. I find however that 25-30 mg produces a moderate experience. I need 50-60 mg oral to get the visual soup. All in all, I really believe that this drug would work well in lower doses as a therapuetic aid. I see a therapist myself, but have been too timid to suggest the idea of my taking 2C-T-7 for an extended session. I wish there was some sort of masonic hand signal that I could give that would alert a therapist of this nature to my willingness to work with psychoactive compounds in conjunction with therapy. Besides all the bonding, the roller coasters were amazing! I wholeheartedly suggest those comfortable with being in public on 2C-T-7, that they go to the local theme park and get on some rides. What a blast!</p>",
 "year": "2000",
 "id": "3220",
 "gender": "Male",
 "timestamp": "2000-10-08T07:00:00.000Z",
 "views": "9262",
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(capsule)"
  }
 ]
}
