{
 "id": 3224,
 "title": "Brownie Stoned Intensity",
 "date": {
  "submission": "2005-11-13T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cathy",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "cookie / food"
  }
 ],
 "report": [
  "My sister, this guy and I decided to make brownies (for the first time), so we had him come over with 0.5ounce bag of weed (pretty good weed too). After they were finished baking, everyone took a brownie. The brownies tasted exactly like weed, but with a dark chocolate flavour added and were hard to swallow... sooo chocolatey and weedy... mmm...anyways, I ended up eating one brownie, the guy had two and my sister ate three.",
  "I'm a lightweight, and I have a very low tolerance to pretty much everything (for example 2 shots of vodka is enough to get me drunk). We all knew that when ingesting marijuana, you feel it a lot later than when smoking. After about an hour, none of us felt anything, which sucked because my mom was gonna be home soon. So we all went and began listening to music at our computer.",
  "I think it might have been half an hour, but I have no idea... they just kicked in... one second I was completely normal, the next second the music was all around me and it was GREAT! It was just like being stoned, only 10x as intense.  I felt like I was watching myself and everyone around me from a screen, but I was also part of the show and had complete control over my actions. My thoughts were going so damn fast! If someone said a sentence, I had a whole argument thought out and it all made perfect sense! I just never had the opportunity to say it (or the ability) because I was so concentrated on those thoughts. Usually when we smoke up, I am always the 'sensible, controlled' individual, if we have to talk to anyone or go anywhere, I always do all the talking. I see it as an adventure and it's always fun!",
  "My mom got home a bit later and obviously I have to be the one that 'gets to' go grocery shopping with her (while trying to convince her to buy as much munchy food as possible.  Even on brownies, we were hungry). So we both left and went to the store.",
  "The whole trip was so exilerating! I felt the cold from outside, but it didn't matter...as if there was nothing out there that could possibly hurt me in any way. All the colours were so bright! It seemed that I was very controlled and actually had a conversation with her! At the store I fetched all the food and was very helpful (which she must have found weird because I rarely help with anything) and managed to get her to buy us a lasagna, 2 bags of chips, 3 chocolate bars, ice cream, pop and macaroni and cheese....",
  "When we got home, I helped unpack and went downstairs to tell them that everything was fine and we'd be eating soon.  My sis was sitting there, carefully examining her hands as if she'd never seen them before and the guy told me to try breathing cuz it was so fun! They were both giving me weird looks. It turns out that I was rocking (while standing) the whole time and didn't have the ability to walk straight.  My complex thoughts and analogies about every situation didn't sound like that when I tried to talk...I only said about 1/2 of the things that I was thinking...which wasnt very good since that meant that I had a lot of incomprehensable sentences that I thought were excellent. :S",
  "Falling asleep was just like the high...at first I didn't feel tired at all and then suddenly I just fell asleep. I am so glad that I don't get hangovers with weed! I had a better night's sleep than usual :D LEGALISE IT!"
 ],
 "erowid": {
  "id": "20478",
  "citation": " Cathy. \"Brownie Stoned Intensity: experience with Cannabis (Oral) (ID 20478)\". Erowid.org. Nov 13, 2005. erowid.org/exp/20478",
  "substance": "Cannabis (Oral)",
  "views": "17294"
 }
}
