{
 "title": "Fear and Loathing in Brixton",
 "author": "Sam",
 "citation": " Sam. \"Fear and Loathing in Brixton: experience with Ecstasy & Mushrooms (ID 32245)\". Erowid.org. Mar 26, 2004. erowid.org/exp/32245",
 "substance": "Ecstasy & Mushrooms",
 "bodyweight": "70 kg",
 "report": "<p>On taking E and enjoying it a lot a few weeks ago I didn't hesitate in trying it again at another rave. They were also selling nitrous which didn't make me laugh, just gave me a head rush.</p><p>Ecstasy takes the longest of all the drugs I've taken to sink in, so I thought I would buy some shrooms to help get me started. A big mistake. People were snorting pure MDMA and coke off the tables, and every other person was smoking a joint, with still more on E. It had a mad atmosphere but it didn't matter. My thoughts were racing, and as I result I became depressed. I also experienced another thing - paranoia. I've thought of myself as quite a level headed guy. I've never been paranoid like that. I knew there was nothing to be afraid of, but my brain would turn my head to look at anyone that moved or turned their head slightly.</p><p>I sat down and thought stuff over, feeling guilty that I was dragging down my friends night. When my friends came back from dancing to sit down two pricks who I think were high on coke started being aggressive. I was itching for a fight, very unusual for me, but we moved tables. A strange effect I had never experienced was green auras/light around peoples faces, especially peoples eyes, noses and hairline. Lights were also very bright.</p><p>I've learnt my lesson from that night and never plan to eat shrooms on a night out - for me, at least, they are not a social drug.</p>",
 "year": "2004",
 "id": "32245",
 "gender": "Male",
 "timestamp": "2004-03-26T08:00:00.000Z",
 "views": "10300",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": ""
  }
 ]
}
