{
 "title": "The Right Place, The Right Time",
 "author": "Thor",
 "citation": " Thor. \"The Right Place, The Right Time: experience with 5-MeO-DMT (ID 32246)\". Erowid.org. Mar 26, 2004. erowid.org/exp/32246",
 "substance": "5-MeO-DMT",
 "bodyweight": "185 lb",
 "report": "<p>SCENE/SETTING:</p><p>After reading Breaking Open The Head in 2002, a good friend and myself have become increasingly interested in what I'll term the more 'esoteric' or profoundly internal drug experiences to be had. A few months ago, my friend aquired 200mg of 5MEO-DMT. He tried it right after he got it and has been bugging me to try it ever since. I've been resisting, 'cuz I've been feeling like my life was in a bit of disarray -- I just moved, my girlfriend and I are trying to get our lives in order a little bit, been going to therapy, etc. -- and I really didn't want to try a new psychedelic until everything was settled.</p><p>In addition, I had researched the drug well (accounts on websites, newsgroups, etc.), and was famliar with the potential for overwhelming experiences on 5MEO-DMT, especially from doing too much. I was not anxious to have such an experience.</p><p>But last week my friend came over with another friend of ours and the four of us were hanging out in the living room, listening to good chill music (Brian Eno's Music For Airports). Even though my girlfriend and I moved just six weeks ago, at this point the living room is pretty well put together -- nice soft lighting, images of Buddha, Zen paintings, a picture of my girlfriend in a weird landscape in Iceland, comfortable furniture -- and my friend decides to smoke some of the 5MEO-DMT. No problem, we all agree we'll be silent and watch him go through it.</p><p>So he gets a tiny crystal of the stuff, relaxes on the couch and I light the glass pipe for him. He takes a hit, exhales, closes his eyes and sinks back into the couch. The smell of the smoke is weird and plastic-y. Then he gets a look of pretty intense concentration and brings his hands up to his mouth. He puts his index fingers together, and taps them lightly in front of his mouth. He starts making small sounds, almost like small laughs of unbelief.</p><p>After about ten minutes, he opens his eyes and says 'whoa.' He starts telling us about how this was a much better experience than his first time. How we shouldn't be worried, to just do a small hit if we're nervous. That it's a pretty indescribable experience.</p><p>So my interest is well piqued. And it's a great vibe in the room, and the music's sounding good, and I'm feeling right, and everything seems like 'go for it.' Also, the fact that our fourth friend is there is adding something. She's a friend from high school that I lived with for a bit (platonically) and now rarely see -- she's getting a PhD and has a new husband who has a 10 year old, so she's pretty busy. Hanging with her happens so rarely that it's giving a nice surreal slant on the evening anyway. And the fact that she's in my house, and hanging with us while we do these esoteric drugs -- it's great. It seems like the right time to do it. So I do.</p><p>EXPERIENCE/TIMING:</p><p>It's wild. I took one small crystal in the pipe. my friend lit it, it smoked, and I took a relatively small hit. I felt it coming on almost immediately. Very physical. I felt like my conscious mind was relatively unaffected. I could still think coherent thoughts about the trip, about how each sensation felt, reminding myself to breathe deeply, to listen to the music, to really feel what I was going through.</p><p>There is no real way to explain what happened from one moment to the next as the experience as a whole seemed very complete, yet simultaneously comprised of many moments.</p><p>It definately felt like I was transported somewhere. Like I was physically moving somehow. Like my body was made of a floating, pulsating crystal. Like those strange geometric luminescent patterns I see on acid. I felt like my body was composed of those. Moving the same, evolving the way they do, transforming.</p><p>As I read in another account, there was a profound sense of time (or lack of), of being in the moment, of just being.</p><p>I also felt that every instant was its own experience to be had, savored, individually, completely different from every other experience -- but that there was another, more complex effect happening as these moments moved from one to another. The way a film can be analyzed by looking at each shot unto itself but another effect happens when you study how the shots work moving from one to the next.</p><p>And of course, while it was happening, I was thinking 'Oh! This will be so easy to explain to people! It's so wild!' and as I got further and further from the center of the experience, it began to slip further and further away, like these experiences always do.</p><p>The only rocky moment I had was in the middle. At a certain point, I began to feel some uncomfortable sensations in my stomach. A stomach-ache pretty much. I hoped it would go away, and when it didn't, I got a bit nervous. But I was reassured by the fact that I knew the trip would only last about ten minutes, and at least five had gone by. As soon as I was reassured, I stopped worrying about the stomach-ache. It didn't go away, but I stopped worrying about it.</p><p>I later realized that it was probably because I had just finished having a burger and a couple of beers at a bar (I didn't know I'd be doing DMT!), and when I do it next time I'm going to have an empty stomach for sure. That being said, I have read about the nauseau sometimes associated with DMT, so maybe that played a part too.</p><p>AFTER:</p><p>The trip came to a bit of an end, I opened my eyes, feeling like ages had passed, even though it also felt like only ten minutes had passed. I was super relaxed, very chill, and my muscles felt a bit sore. My girlfriend did it after me, and the first thing she said when she opened her eyes was 'That was beautiful.'</p><p>Then we all smoked a little pot, put on some good downbeat music, put on sunglasses, danced very slowly for a couple of hours (!) and went to bed.</p><p>The next day I felt like I had been beaten up with a lead pipe, but this might have been due to playing raquetball before doing the DMT (another friend of ours tried it later in the week and reported no ill effects the next day). It was pretty incredible, and I can see why people wouldn't need to do it all the time, but it definitely seems like an experience well worth having. I have since become the same type of convert as my friend, and have tried to spread the word about this fantastic experience.</p><p>But I firmly believe that 5MEO-DMT is a 'right place, right time' type of experience. You will know when the time is right.</p>",
 "year": "2004",
 "id": "32246",
 "gender": "Male",
 "timestamp": "2004-03-26T08:00:00.000Z",
 "views": "20323",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
