{
 "id": 3227,
 "title": "Free Will & Our Purpose",
 "date": {
  "submission": "2005-11-07T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A Visionary",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "I recently had the most profound, cathartic experience of my life.",
  "Two weeks ago, at the beginning of my holiday vacation from college and back home, I embarked on a solo level 4 or 5 mushroom trip, ingesting 5 grams dried.  This is the highest level trip I have ever done of any substance.  I am male, 19, in good physical and mental health, and weigh 170 pounds.  I was lying on my bed in the dark the whole time, intermittently looking out the window at the night sky.  I felt this setting would foster a very analytical, metaphysical journey.  I am the most logical, rational person I know, and always seek the truth.  I was not afraid of what the alien state of mind might reveal to my consciousness; in fact my goal was enlightenment.  I initially anticipated only a level 2 or 3 trip because I thought the mushrooms had lost a considerable amount of potency, but I was aware that they could have possibly retained their strength.",
  "I will skip over the beginning and end of the trip and focus on the peak of it.  For several hours during the trip, I found myself stuck in a loop of circular logic, a sort of infinite recursive process.  I was caught in a frame of mind that repeatedly held conflicting ideas simultaneously.  I could not decide what my next actions would be, both immediately and for the rest of my life.  Who put me here and what is my purpose?  I felt very afraid not knowing.  Suicide crossed my mind, but I retained my usual reasonability and abandoned that idea quickly.",
  "When I asked myself what my purpose of life was, I realized every human being wonders the same thing.  Most believe whatever their parents tell them when they are children, or whatever they hear when attending religious services.  But what their parents know and what religious texts say are just others opinions and feelings of why we are here.  Essentially, nobody knows why the universe is here and what purpose our lives have.  Many pious men and women forget that fact and unconsciously take what their parents, religion, or society says about the matter as universal truths, when in fact it is anything but the case.",
  "The most profound realization I experienced during the trip was that free will is an illusion.  I feel the capacity to understand this was due to the psilocybin-induced information-integration state of mind.  I saw how everything we think, feel, and do is completely a result of the interplay between our genes and our environment.  The interaction between the two is completely determined by fundamental laws of the universe.  I still believe this today, in my sober state of mind.  Comprehending that my life is pre-determined has paradoxically granted me a new sense of freedom.  I have less fear of death.",
  "The point I am trying to make, and what I concluded toward the end of my metaphysical journey, is that we have no control over anything.  I did not choose to be born, and I am going to die eventually, at some time I cannot control (unless I desired to commit suicide).  Also, I did not choose my genes or my type of organism, and I did not choose my environment.  I dont really know why Im here either.  I am insignificant, as we all are.  I do not even choose my actions.  The fact that I am writing this sentence was predetermined by nature.  All I can do is just be, live, exist.  All I can do is just go along with the process of my life and see what happens, as we all should, and strive to enjoy it.",
  "I feel that the purpose of existence may soon be realized.  The evolution of the universe, earth, and life has been speeding up exponentially.  Roughly, it took billions of years for the earth to form, hundreds of millions of years for the first life form, several million years for humans to evolve, and tens of thousands of years for human civilization to develop.  Now, humanity is evolving at an amazing pace.  News and scientific discoveries are quickly spread across the internet in the blink of an eye.",
  "We are at the dawn of the age of the genetic revolution, the nanotechnological revolution, and arguably have passed the computer revolution.  I believe that with the advent of cloning, humanity will have to reconsider the value and meaning of human life and all life; I believe a paradigm shift in belief systems will occur.  Our world is developing at an ever-increasing rate of speed.  It seems like humanity is building toward something, some purpose, and that pinnacle of achievement is nearer than ever.  I feel it will be reached before the end of the twenty-first century.",
  "I should note that some of my ideas may be biased toward or acquired from reading the book The Psilocybin Solution over the course of the month before this trip.  Nevertheless, I believe vehemently in what I experienced and what I have expressed here, independent from my reading.  Mushrooms and other psychedelic drugs have the ability to open our minds to new ways of thinking, and I believe they should be central to the development of any respectful belief system.",
  "Some of the ideas I have expressed here may sound quite banal, but I am happier than I was before the trip.  I am more accepting of myself and others, and of the way the universe is.  Thank you for reading.",
  "Peace & Love"
 ],
 "erowid": {
  "id": "20488",
  "citation": " A Visionary. \"Free Will & Our Purpose: experience with Mushrooms (ID 20488)\". Erowid.org. Nov 7, 2005. erowid.org/exp/20488",
  "substance": "Mushrooms",
  "views": "3219"
 }
}
