{
 "title": "Watering Plants",
 "author": "Murple",
 "citation": " Murple. \"Watering Plants: experience with DPT Freebase (ID 3231)\". Erowid.org. Nov 20, 2000. erowid.org/exp/3231",
 "substance": "DPT Freebase",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "smoked",
   "DPT"
  ]
 ],
 "report": "<p>I has been many months since I've partaken of any tryptamine psychedelics. For a few days I had been tossing around the idea, and then tonight, after a busy day, I spontaneously pulled out my DPT pipe and filled its bowl with some parsley soaked in DPT free base. I didn't measure how much I used, but enough for two good puffs... perhaps 20mg. A moderately low dose.</p><p>I put on one of my favorite CD's, 'Ichi On Buttsu' by Ronnie Nyogetsu Seldin, a recording of Zen shakuhachi (bamboo flute) music. I light a coal in my brazier, and cover it in copal, frankincense, myrrh and wormwood. I ceremonially pass my pipe through the pungent smoke in three clockwise circles, then offer it to the Buddha which overlooks my livingroom. I sit down and do some relaxing breathing excersizes for a minute. I am somewhat nervous, not having had any drugs of this class in 6 months, but the nervousness is largely ignored, being only a background chatter in my mind. I put the pipe to my lips and inhale once, twice, the harsh chemical tasting smoke, holding each hit in my lungs for about 20-30 seconds.</p><p>Almost instantly, the old familiar gentle rush envelops me. Anxious thoughts suddenly strike, forcing my eyes open. Suddenly, I behold in front of me a golden barrel cactus, and a large aloe, sitting in the corner of my living room. Plants of all descriptions sit before me: stately columnar cacti, shaggy thorned opuntias, emerald salvias, silky</p><p>argentate artemisia. It occurs to me that they live without dwelling upon the past, or in fear of what may yet be. Air, water, and light are for these mighty beings the only requirements for happiness.</p><p>I'm tripping quite lightly. No visuals, though my awareness of colors and detail is greatly heightened. A warm pulsing energy bathes my body. The atmosphere breathes me, the splendor of respiration brings me life. I decide to water my plants. I fill a pitcher of water, and go from plant to plant, sharing breath and giving water, the elixir of life which binds us all. Drink pipiltzintzintli, drink chacruna, drink philodendron, drink jasmine. I pause for a moment as I water my miracle berry and reflect on how aptly named this plant is... early this spring, all its leaves fell off, and the trunk dried and snapped off. I left the plant for dead, forgotten on my balcony, until one day in September I saw leaves bursting forth from the inch of remaining stump. Drink miracle berry, phoenix! I pick some dead leaves from a datura plant.</p><p>About 30 minutes after smoking the DPT, I notice that I'm no longer tripping, though I have a pleasant afterglow. I continue to water plants and listen to the sound of the bamboo flute vining its way to satori, as seedlings bursting forth in spring from a fire ravaged field, reaching, straining towards the sun, giver of life. Being thirsty, I drink some juice.</p><p>This is what psychedelics are all about - watering your plants. Time to go sweep the kitchen floor before making some hot Earl Grey tea, with cream and sugar - good stuff.</p>",
 "year": "2000",
 "id": "3231",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-11-20T08:00:00.000Z",
 "views": "10307",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "smoked",
   "substance": "DPT"
  }
 ]
}
