{
 "title": "Psychedelic Sneak Attack",
 "author": "Catfish Rivers",
 "citation": " Catfish Rivers. \"Psychedelic Sneak Attack: experience with 2C-T-7 & 1,4-Butanediol (ID 3233)\". Erowid.org. Oct 8, 2000. erowid.org/exp/3233",
 "substance": "2C-T-7 & 1,4-Butanediol",
 "bodyweight": "275 lb",
 "report": "<p>Not sure how much of a tolerance would remain after a 2C-T-7 session, and having taken 34 mg two nights ago, I weighed out 50 mg for my initial dose. I had also been hitting my 1,4B pretty heavily throughout the day. Two hours passed and I felt a slight head change, but barely noticable. At this point a decided to take an 18 mg booster of 2C-T-7 and smoked some MJ, which increased the slight head change somewhat. Aprox., 1.5 hours later I was growing impatient, as it was now nearing 2 am and I was growing tired, so I decided to snort another 8 mg in a last ditch attempt to launch the trip before my body gave up and went off to sleep.</p><p>This was my first day ever trying 1,4B and I believe the novelty of it possessed me to take way to much. The 1,4B was really knocking me on my rear, as I was actually struggling to remain awake. The insufflated dose was taken in two 4 mg bumps, in 15 minute intervals to reduce the burning. I soon felt a ketamine like mind state wrap itself around me, but still nothing too intense. I started to think that it was not possible to take 2C-T-7 several nights in a row. It was nearing 3:30 am and I started to feel a mounting pressure in my stomach, accompanied by a dizzyness not unlike the vertigo produced from too much alcohol. I attributed this to the 1,4B. Soon enough I was puking my face out. I don't know if this happens to anyone else, but often when I vomit, the trip is intensified, and often times very much so. This was no exception, I felt the meth type rush hit my chest, my heart skipping beats, sweat rushing from pores. Atari video game like colors shot forth from every angle, while the nausea grew more painful. More puking ensued for about 2.5 hours, off and on.</p><p>Some soft drumming music was helping me keep focused, as I was dreadfully tired, and afraid to drop off just now due to all the vomitting. I smoked some MJ, which calmed my stomach and woke me up a bit. A few more hours past and I finally started to come down from the uncomfortable overdose feeling. The rest of the trip was enjoyable. What did I learn? That perhaps 2C-T-7 doesn't have as strong a tolerance build up as, say LSD or shrooms. This drug is so strong that PATIENCE is a must when waiting for it to kick in. I never thought I was in any danger, but I could see someone else freak out and call 911 from it. Next time I will lay off the 1,4B as that probably had something to do with my inability to judge the onset of the drug's action, thus leading to a slight over dosing.</p>",
 "year": "2000",
 "id": "3233",
 "gender": "Male",
 "timestamp": "2000-10-08T07:00:00.000Z",
 "views": "13758",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(capsule)"
  },
  "2": {
   "time": " T+ 2:00",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(capsule)"
  },
  "3": {
   "time": " T+ 3:30",
   "amount": "4.0 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  },
  "4": {
   "time": " T+ 3:45",
   "amount": "4.0 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 }
}
