{
 "title": "Unexpected and Positive Results",
 "author": "VapourBoy",
 "citation": " VapourBoy. \"Unexpected and Positive Results: experience with H.B. Woodrose (ID 32352)\". Erowid.org. Feb 15, 2005. erowid.org/exp/32352",
 "substance": "H.B. Woodrose",
 "bodyweight": "71 kg",
 "header": [
  "DOSE:",
  "6 seeds",
  "oral",
  "H.B. Woodrose"
 ],
 "report": "<p>Two previous experiments with LSA via morning glory seeds (about 1.5 and 3g respectively) resulted in noticeable effects that lacked a true identity. There was certain nausea and pupil dilation, but the other classically psychedelic effects were missing; the relatively short-lived experiences lacked insight and any perceptual changes. I was a bit disenchanted with this supposedly potent and powerful tryptamine.</p><p>Nonetheless, I acquire 50 hawaiian baby woodrose seeds and decided to give them a try as well as cultivating them in my entheogenic garden.</p><p>An early afternoon, along with R, my longtime co-psychonaut and L, a female friend of mine, I ingested six of the seeds. R also took six and L two. Instead of an extraction process which I had tried in the past with the morning glory seeds, we merely crushed the seeds and washed them down with water. The taste wasnt too disagreeable.</p><p>However, within 20 minutes, we were all feeling the first effects, the telltale nausea associated with the consumption of these seeds. It was quite uncomfortable and I immediately had second thoughts about eating the seeds. Marijuana did little to help. I can cope with extremely intense mental effects on psychedelics but dont do so well with body loads. Ls severe nausea lasted for about one and a half hours, but my nausea came in waves during that time frame and eventually left altogether. We all noticed that as the effects on the body lessened, those of the mental realm increased. I finally had success with LSA, much to my surprise.</p><p>The effects lasted a good four hours and were comprised of personal insight, enhanced interpersonal bonding and communication, sedation and increased confidence, not unlike LSD. Strangely enough, this experience lacked the self-loathing I have become so familiar with through my use of many other psychedelics. Vision, hearing and tactile sensations were all noticeably enhanced, although no visual distortions were noted during our experience together.</p><p>For myself, the comedown was quite easy, dictated only by extreme lethargy and a tendency to catch myself becoming too intensely interested in the mundane. R and L, however, were experiencing the familiar feeling of just wanting the substance to metabolize and release its grip on their minds.</p><p>Although sleep wasnt possible for several hours, the experience left me very tired. It was in bed that the visual distortions finally appeared. The folding effects on textured walls were quite similar to those I experience on psilocybin. Although fleeting, these visuals rounded off a worthwhile, if not somewhat unexpected, experience.</p><p>The severe nausea lasted only briefly, and enduring that discomfort was well worth the experience the seeds yielded. Ingestion of these seeds can result in a true psychedelic experience and as such they should be respected as any other entheogen is.</p>",
 "year": "2004",
 "id": "32352",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-02-15T08:00:00.000Z",
 "views": "15064",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 }
}
