{
 "title": "Captain's Log",
 "author": "Benteye",
 "citation": " Benteye. \"Captain's Log: experience with Cacti - T. pachanoi (ID 32384)\". Erowid.org. Aug 19, 2004. erowid.org/exp/32384",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "12 in",
  "oral",
  "Cacti - T. pachanoi",
  "(extract)"
 ],
 "report": "<p>After weeks of internet research, I tested the effect of San Pedro against my body's chemistry. Before I begin the description of my experience, I will first give a brief overview of the path I have taken which led to eating a cactus. Second, I will explain the preparation I performed to consume the cactus. Next, I will provide you with a best description of the trip. Lastly, I will give you my thoughts on changes I will perform the next time I meet Saint Peter.  I know this may all seem long winded, but I want to do my best to share as those before me.</p><p>The Path:</p><p>The path to San Pedro has been a good one. I have never been the type of person to be peer pressured. Consistently, I have made choices for the way that I want to live and experience my life. I have a very high opinion of myself. Often I believe that I am one of the smartest people I know. I also have a friendship with death. This is not a morbid friendship as most reflex. Instead, I have always felt that life is brief and must be experienced. I have been an entrepreneur throughout my life but still decided to work at every type of employment I find interesting for the experience. I do not smoke cigarettes. I tried Mary Jane once when I was 20. That was my first high. Unfortunately, the buzz made me feel dizzy and gave me the spins. I wouldn't try it again until much later in life. Still to this day, I cannot smoke it alone or nausea and dizzy spells are destined. I did not drink alcohol until about one month after my 21st birthday. Again, I did not enjoy the buzz. I felt a loss of control.  To me, beer tastes bad. An alcohol buzz seems to change people for the worse, in my opinion. As I have become older, I have been an occasional drinker at parties and such, but not much.</p><p>My real introduction to drugs came when I moved to Florida from Pennsylvania. I was working for a skating rink that often rented itself for all night raves. Fascinated by the atmosphere and energy, I began researching online the drugs ravers consume. After some time talking to my wife about my research and intention to try it, we agreed on the experiment. I purchased a MDMA test kit and some pills. The experience was incredible. However, it also seemed very easily abused so I spaced future experiences out to be sure that I did not get caught in an MDMA web. I will be 30 years old this year. Since my experience with MDMA, I changed my perception about drugs. Even though my brain is programmed to believe that drugs are bad and will destroy your life, my analytical mind assures me that this is government hypnosis. I will not get into my views of how the war on drugs is nothing more then a secondary USA tax system. I tried a very weak hit of acid once at a Woodstock like party.</p><p>Honestly, this behavior is outside my normal line of first researching a drug before trying it. I assumed that testing acid was very difficult or impossible. I took the acid along with MDMA for a great time. I felt cheated since I waited until the last day of the festival to do this since the high was so much more pleasant then MDMA alone.</p><p>My new mission was to research psychedelics. Since I live in Florida, all I have to do is visit a cow pasture during the right time and pick mushrooms. Yes, this sounds easy, but it isn't. Imagine walking around huge cow beasts in the dark. One must remain quite as possible since some farmers will chase pickers off the land using rock salt shot guns. The cows get scared and begin calling a low moo in unison. The sound of mooing seems so loud and I am convinced that the farmer will be alerted by this. Paranoia of a police car watching as I approach my awaiting car with a big bag of shrooms is in my mind. I decide to look for a better way. This led me to online documents describing how one can cultivate shrooms. After a long time, I succeeded at growing my own. These shrooms were very powerful. The strain was called 'Thai.'  I ate just 4 and it was unlike any drug before. Instead of the usual druggy, body high I have been accustomed, this was different. I began to see the world differently. It changed my perception. I felt close to god. I understood the universe. I could feel my wife's soul. Music was incredible.</p><p>Unfortunately, growing mushrooms was not the best idea. It takes a long time. The process demands everything be very sterile. Also, I have children that are inclined to ask questions about mason jars of mycelium. I tried ordering shrooms from the UK. The law forces the seller to ship them fresh, so that after a week and a half trip to Florida, the mushrooms are rancid. This is where my journey ended with google groups search on 'buy peyote' led to san pedro.  During this time, my only ideas of mescaline effects came from an episode of Beavis and Butthead, The Matrix, and Fear and Loathing. I was a little concerned that this was too powerful for my own good. Research proved that this was false.</p><p>The Preparation:</p><p>After exhaustive reading, I purchased the Panchoi version of San Pedro.  Research told me that this was a weaker version and, in my mind, safer. I first tried boiling a tea down to a tar and then letting it dry to put into caps. This didn't work. The tar was very oily and thick. I was also concerned that the chemical may have been somehow destroyed, or altered in the process. I tried extracting the mescaline from the tar using the extraction primers, but without a separatory funnel, it is a pain. Instead, I put the tar in a jar and decided to just eat it.</p><p>I prepared the cactus using a combination of San Pedro primers I thought best. I cut a 12 inch section, scored each valley as described in the Steve Barton primer. It took me about 2 hours to finish this. I was intent on finding the easy method by using every type of blade, tool, or scissors that may speed up the process for the next time. The extra time paid off. I found the ultimate tool for working with San Pedro, cuticle nippers. They look like scissors but the tip is oddly shaped in a way that makes it very easy to remove the spines. I would apply some pressure while inserting the thinly open cuticle nippers and close them when under the spine. I would do this action with 2 passes consisting of one pass down, then flip the cactus perform a second pass. My fingers worked best for removing the skin. It was difficult at first adjusting my hand tension to be equal with the skin so that it did not break. Removing the skin reminded me of removing old purple tint from a car. I would remove as much skin as possible without digging into the cactus. After I finished, I would use the cuticle nippers to either remove remaining skin or create a skin flap so that my fingers could complete the job. The process seemed was pleasurable and fast after I mastered this.</p><p>After completing the skin removal, I removed only the darkest green material. I retained the excess cactus for later extraction.  Since I had previously tried to cook the cactus down to a paste, I knew the bad smell and equally nauseating view involved if I tried cooking it. Instead, I froze the cactus overnight for the morning when I planned on trying it. The next day, I thawed the cactus strips and blended them with some orange juice. I tested the PH of the brew to see if I needed to neutralize. The PH tested 5. I added some baking soda.  I considered all the recipes to make the drink taste better and concluded that the bitter taste was inevitable. I tested this by chewing a piece and was correct. Brainstorming, I decided that instead of making the drink taste better, I would make my mouth taste less. Using liquid over the counter toothache medicine, I created a gargle and also a spoon of the medication. First gargling, and then applying the spoon to my tongue, I numbed my tasted buds. I held my nose and started to drink. The numbing worked.</p><p>I did find that drinking from a cup was difficult, so I moved the liquid to a bowl. Drinking too fast forced a gagging reflex so I took smaller gulps with success. Half the brew was consumed less then 10 minutes. I took a small break and rinsed my mouth with orange juice, reapplied the toothache medication, and setup a vitamin C chewable upon completion of the remainder of the drink. Again, this was pretty easy to do since my mouth was numb. The frothy consistency was the only difficult part of the experience.</p><p>The Experience:</p><p>I compare the drug to the beginning of a Sunday drive, taking time to get there, enjoying the view while on the way. I finished drinking at 1:40pm. I could feel a slight body buzz about 30 minutes later. It was very subtle. An hour later I began wondering if I had taken enough. I was feeling better gradually. As with other San Pedro experiences I have read, the music sounded better and the world seemed to become more real. The connection to my spirit approached. I did not feel drugged. I felt like I was able to have a clear conversation with anyone. I felt like my real self. I spent some time analyzing my hand for its beauty. I imagined hand sculpture. I spent some time painting seagrass on a block of wood. Since I have spent so much time reading other user's experiences and ideas, I decided that I would do my first posting on my experience. This was my plan from the beginning. This idea prompted me to write my experience in a small notebook which is now called my 'Captain's Log.'</p><p>Here are the contents of my log verbatim:</p><p>Page 1.</p><p>Have you ever tried to stare yourself down?</p><p>Look hard.</p><p>See through him.</p><p>Remembering your face.</p><p>Imagine you are the singer.</p><p>Did your reflection look away?</p><p>Did you stare yourself down?</p><p>Page 2.</p><p>Can you slow time?</p><p>Slow it until...</p><p>The memory of your last thought.</p><p>Before the memory was created?</p><p>Slow it to true present.</p><p>Page 3.</p><p>Feels like a funky perfume.</p><p>'A narcotic perfume.'</p><p>Who is Nick talking on the phone to all the time?</p><p>Page 4.</p><p>(on describing visuals)</p><p>To slow down and describe is depriving yourself.</p><p>What did I just see?</p><p>How do I describe it?</p><p>Heh! (on trippy effects)</p><p>-very gradual increase-</p><p>The smooth yet bitterey taste of San Pedro.</p><p>Page 5.</p><p>Knowing the time is coming when you won't feel like this anymore.</p><p>Trying to slow time and stay here.</p><p>In the fleeting present.</p><p>At the moment before I realize guaranteed pleasure.</p><p>Page 6.</p><p>(describing visuals)</p><p>Imagine looking into a kaleidoscope.</p><p>You see baby legs dancing rhythmic to the beat.</p><p>The legs are mirrored.</p><p>This is what you see reflecting in the kaleidoscope.</p><p>It is moving.</p><p>- dancing baby legs</p><p>Page 7.</p><p>Statue:</p><p>Super man logo</p><p>3-d facing skyward but angled up slightly</p><p>Large</p><p>Like 12 feet across.</p><p>Logo has giant crack in it all the way through so one can see the other side</p><p>of the background</p><p>Like -> (I drew a picture here)</p><p>jagged crack and jagged as it goes through</p><p>Like -> (I drew a picture here )</p><p>ex: take cards of deck.</p><p>Page 8.</p><p>How long does this last?</p><p>How long have I been sitting here?</p><p>Page 9.</p><p>Stealing angel food cake.</p><p>Feeling sneaky.</p><p>Like doing something bad, but it feels too good to stop.</p><p>Page 10.</p><p>On Internet Knowledge</p><p>Like a giant hole where all knowledge is stacked everyday.</p><p>The pile is so high that the weight is forcing the files on the bottom to compress so that the pile is shrinking under its own weight.</p><p>Page 11.</p><p>Still, there are too many new files.</p><p>The pile grows larger, higher, and compresses by its tremendous weight.</p><p>Page 12.</p><p>How far can a disk be defragged?</p><p>I think a hard drive can be defragged to hmm..</p><p>Memory line-?</p><p>Could a disk be defragged</p><p>Page 13.</p><p>so that the outer ring is free if the fragmentation is equal if only a single free line separates the two files of equal size??</p><p>Page 14.</p><p>New Offspring song is a good mescaline song and Blink182 song 'wish you were here?'</p><p>-> Damn!!! Bad ASS!! Crystal Method -- Born to Slow</p><p>Page 15.</p><p>More then just me</p><p>Told me wife it would be a good drug for friends to hang out.</p><p>She apologizes and says she'll finish her dishes in a sec then hang out.</p><p>(my wife isn't on the drug)</p><p>I respond, 'I didn't ask you to do a trick for me.'</p><p>I wonder if she takes it the wrong way.</p><p>I continue, 'It's not like that, it's like an experience I would like to share.'</p><p>Again, I visualize her eager intensions of entertaining me with silly magic tricks.</p><p>Guilty Humor.</p><p>Page 16.</p><p>I visualize the experience as an Angel's Whisper.</p><p>----------------------------------------------------------------------</p><p>If you wanted to give everything you had to someone, what is that everything?</p><p>----------------------------------------------------------------------</p><p>Radio advertising is so ridiculous. Who are these idiots buying theses products? 'sucker born every minute'</p><p>Page 17.</p><p>Sculpture</p><p>3-d S's</p><p>Thousands stacked up but very thin.</p><p>Each is shift a fraction of a degree clockwise.</p><p>Sexy.</p><p>Page 18.</p><p>Laughing with my wife -- called these notes my 'Captain's Log' for the questions my friends will ask.</p><p>I label the outside 'Captain's Log'</p><p>Page 19.</p><p>My wife is a sweetheart.</p><p>----------------------------------------------------------------------</p><p>Being a radio DJ must suck.</p><p>Talking to yourself?!</p><p>What kind of personality can imagine an interested audience all the time? I mean JUST IMAGINE a group of people in front of you and that they care about your stupid ramblings.</p><p>Page 20.</p><p>New DJs must practice for hours inside a closet before real airtime.</p><p>That is how radio DJ school works, just a bunch of dark closets.</p><p>They MUST practice somehow for this. How else could one practice to be a new solo radio DJ?</p><p>crap -- no more paper... bye</p><p>Cardboard Back Cover.</p><p>The perfect fuel must yield exactly the same as it can build.</p><p>(Watching flaming candle turned over gushing fresh wax extinguish itself by the wax overflow.)</p><p>----------------------------------------------------------------------</p><p>Decadence Spoon -- a spoon with a wide, deep mouth that is too large to be fed by one's self.</p><p>----------------------------------------------------------------------</p><p>San Pedro 'the gentle giant'</p><p>The log ends here.</p><p>This notepad demonstrates the ability to think and be creative while on mescaline. The way the drug is portrayed in media is completely false. At no time was I scared or paranoid. I did not see any major open eye visuals. The closed eye visuals were great. At one point, I heard a line of a song that said, 'We'll have Halloween on Christmas.' This lyric interested me as I thought about what it would be like to knock on doors in a Halloween costume Christmas day. I then looked at a photo of my brother in his Halloween costume.  He was dressed as a 70's pimp guy. He had this look on his face like he was grooving. I wanted to feel like that so I proceeded to my room and put on my tuxedo and looked in the mirror. I looked pretty good wearing a tuxedo and bedroom slippers.</p><p>That was a good time. Now that I have found San Pedro, my search is complete. It is a perfect drug in my opinion. I took the drug at 1:40pm and was ready for sleep at 11:30. I fasted per recommendation. It is perfect. Once can grow it if full view without any problem. The drug will replenish itself. Only one drawback and that is because it is a drug. Throughout time these drugs were considered sacred and holy. The United States is such a young country to believe that it knows better then the ancients. Before my first mushroom experience I did not understand or appreciate the connection we have with each other and the earth. San Pedro is not a solution, in my mind, but it is a definitely a treasured tool for one to strengthen that connection.</p><p>Changes next time.</p><p>I will use the extraction method using the separatory funnel recommended. If needed, I will resort to using a juice extractor. If this is the case, I will use the liquid toothache medication. I would also setup a party with my closest friends to they can try. I will also keep another Captain's log. It was fun to read back my earlier forgotten thoughts during the trip.</p>",
 "year": "2004",
 "id": "32384",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-19T07:00:00.000Z",
 "views": "12817",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "12 in",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(extract)"
  }
 }
}
