{
 "title": "Reasons For and Against the Use of LSD",
 "author": "Aussie Tripper",
 "citation": " Aussie Tripper. \"Reasons For and Against the Use of LSD: experience with LSD (ID 324)\". Erowid.org. Aug 20, 2001. erowid.org/exp/324",
 "substance": "LSD",
 "bodyweight": "70 kg",
 "report": "<p>I have tripped about 9 times total in my life, and have also combined LSD with ecstasy, marijuana, and amphetamines at various times. I have found that LSD can be a misleading and deceptive drug to some extent, and I believe that accurate reports relating to the clinical effects of LSD should be read by the possible user before dosing.</p><p>My first trip took place over a whole day. Me and 3 other close friends, two of which had taken LSD before, dropped our acid at about 9:00 in the morning and set off for a trip to the beach. I could not feel the acid kick in until about one and a half hours after we had dropped it. I went swimming while waiting for the acid to hit, and it was a fairly exhilarating experience. In retrospect, it was also incredibly dangerous.</p><p>That first trip left little side effects (so it appeared) and I did not feel changed or altered to a noticeable level.</p><p>After taking progressively larger doses of LSD (up to 2 T's) brain alteration became significant.</p><p>At a rave (dance party) I dropped 2 tabs of the strongest acid I have ever touched, and this completely changed my life. The LSD was obviously in control of both my body & my mind, and this was quite a disconcerting experience. I can remember talking to people I did not know, and being looked at with mystified looks because they could not understand my unraveled chain of thought. The loud techno seemed to work its way into my head, and took control of my soul.</p><p>I started dancing after the second tab of acid hit me, and I was actually quite scared by the realization that a man-made chemical could be so in control of my entire existence. I can still remember the rush as I melted and merged with the music, as I danced harder and harder in an attempt to work off the endless reserves of energy I seemed to possess. While I was dancing, a girl I did not know walked up to me and calmly stated, 'I believe you have lost this', and handed me a small piece of paper. On this piece of paper was printed, in capital letters 'THE PLOT'. This freaked me out so badly that I could feel my brain and inner consciousness balancing on the brink of insanity.</p><p>The next day the post acid depression was so acute it was close to an acutely tiring head pain, and I was physically sick from my experience. I did not take acid for close to twelve months after this trip, and have only tripped once since then. I am not going to take LSD any more simply because my body can no longer handle it without suffering horrible after effects.</p>",
 "year": "2000",
 "id": "324",
 "timestamp": "2001-08-20T07:00:00.000Z",
 "views": "8117",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
