{
 "title": "92 Octane for the Brain",
 "author": "Indigo",
 "citation": " Indigo. \"92 Octane for the Brain: experience with Vinpocetine (ID 32400)\". Erowid.org. Mar 31, 2004. erowid.org/exp/32400",
 "substance": "Vinpocetine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Vinpocetine",
   "(daily)",
   "",
   " ",
   "oral",
   "Vitamins / Supplements",
   "(daily)"
  ]
 ],
 "report": "<p>Vinpocetine has proven to be very much beneficial as the first neuro-nutrient Ive tried. I was considering Piracetam initially, but something about taking up to a gram or more of a chemical for effects just kind of turned me off, especially when the dosage for vinpocetine is usually between 5-30 or so milligrams.</p><p>No attack dose whatsoever was needed, I could tell something was going on the first few times I took it. It seems to primarily work on memory and a little on certain color enhancement type of things. Initially short term memory was a little better, but taking it every day for about a month or two now seems to help long term memory as well. I currently have a 93% in an advanced algebra class I thought I was going to drop the week I started taking it (the vinpocetine).</p><p>My dosing pattern is usually 5-10 mgs plus one super multi-vitamin 3 times a day, usually 10-15 mgs total on a regular day, 20-25 on school days, and 30 or so on days that I've had exams. I found I had headaches when I first started taking it a few hours after eating a capsule or two (worsened the more I took, although they were never really bad at all). I have found a way around the subtle headaches however; Ive learned to moderate dosages and collaborate vinpocetine + vitamins (containing 11 mg choline, which some say cures headaches associated with Piracetam), and my body probably just got used to it.</p><p>One of the best things about Vinpocetine Ive found is its ability that when taken at night, it does not give me jittery energy, make me a little confused, like a lot of caffeine can. On the contrary, I find my mind to be a little intellectually stimulated, and although it gives me no energy, I just forget that I was tired earlier in the day and Im able to stay up later comfortably. This would be great for cramming for a test or even just hanging out with friends late on the weekend after a particularly tiring week.</p><p>Calling for more experimentation was the night I pre-loaded for the evening with a vitamin, 50 mg 5-htp, and 5 mg vinpocetine taken every 30-45 minutes three times. I felt like I was almost rolling before even taking any MDMA. I did end up going overboard that night, and the MDMA experience would be pointless to cross-reference with vinpocetine. On the other hand, I am very eager to try it again at a later date, and also to try vinpocetine with a psychedelic.</p>",
 "year": "2004",
 "id": "32400",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-03-31T08:00:00.000Z",
 "views": "23203",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Vinpocetine",
   "form": "(daily)"
  }
 ]
}
