{
 "title": "We Were Doing Fine Until the Pot Came Along",
 "author": "Wilhelm S.",
 "citation": " Wilhelm S.. \"We Were Doing Fine Until the Pot Came Along: experience with Methylone & Cannabis (ID 32408)\". Erowid.org. Mar 31, 2004. erowid.org/exp/32408",
 "substance": "Methylone & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  "DOSE: T+ 0:00",
  "130 mg",
  "oral",
  "Methylone",
  "(powder / crystals)",
  " T+ 1:00",
  "50 mg",
  "",
  "Methylone",
  "(powder / crystals)",
  " T+ 4:00",
  "30 mg",
  "",
  "Methylone",
  "(powder / crystals)",
  " T+ 5:00",
  "0.5 bowls",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>A fascinating substance -- sort of like surgically removing the empathy and energy from MDMA and enjoying the rest.</p><p>Consumed: 130mg, followed by 50mg, followed by 30mg. Cannabis (1/2 bowl).</p><p>t:0.0 -- Consumed 130mg Methylone carefully weighed. This is less than the general 150mg dose I've seen in trip reports but safety first. Another individual, M (female) took the same dose.</p><p>t:0.25 -- Whoa! Phenethylamine alert! Head feels very light. Like helium in the skull pushing at the sides. M makes comment, 'Is this E? 'Cause it feels like coming up on E.'</p><p>t:1.0 -- Proceed with 50mg bump. We are very talkative. Music is ok. No desire to dance at all. Mouth is REALLY DRY. This persists the whole night.</p><p>t:2.0 -- Now things are great. Good euphoria. Body waves (rolling). NO empathy. NO energy (lethargic, even). Those parts are missing. Solid +++ but this drug could not have a ++++. It's not part of its nature.</p><p>t:4.0 -- Proceed with 30mg bump. It's impossible to dance. We tried. The substance doesn't lend itself to activity. Communication is very liquid. Mouth is still dry as the desert! Interesting thought -- MDMA seems to force abject honesty (empathy?) while Methylone is missing that component and just allows communication to occur naturally.</p><p>t:5.0 -- M notices NO effect from bump. I notice slight effect if that. M and I split a bowl. Body load ensues. M feels very very very queasy and eventually needs a benzo to go to sleep. Not so bad for me but remember I have 60 lbs on her by body weight (and she consumed a bit more herb). In general the experience went downhill after the consumption of cannabis from a body load perspective.</p><p>t:6.0 -- Examining the downward descent: mentally it was OK, I guess, but I would have skipped the cannabis in hindsight.</p>",
 "year": "2004",
 "id": "32408",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-03-31T08:00:00.000Z",
 "views": "26064",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "130 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "50 mg",
   "administration": "",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 4:00",
   "amount": "30 mg",
   "administration": "",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 5:00",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
