{
 "id": 3247,
 "title": "Hip-Hop Orbital Space Party from the Future",
 "date": {
  "submission": "2005-02-05T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bplus",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "tea"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "My friend Jesse* and I were on a weekly tripping adventure that started a few days after Christmas, 2002. The first trip was a mild trip through a snowy forest with our friend Doug, a relative newcomer to magic mushrooms. A week later after Doug left town Jesse and I upped the dose to four grams each and took advantage of the mild, snow-melting, street-clearing weather to go on an all-night bike ride around town. After these two trips Jesse and I rode a bus to Victoria, BC and waited for our tolerance to drop a bit so we could squeeze in one more trip together. We planned something neither of us had done in a long time: five grams with our eyes closed in the dark.",
  "Ten grams of my homegrown Orrissa Indian cubensis were broken up and added to a coffee mug along with warm water, a few dashes of lemon juice, and a peppermint tea bag. This was the most concentrated I'd ever made mushroom tea, and I speculated that there was not enough liquid to hold 10 grams worth of psilocybin (I was wrong). Jesse's girlfriend Cheeba (nickname) watched us drink it before she went to watch a movie and leave us to ourselves. Their roommate Joel was studying quietly in his room.",
  "Our trip space was Jesse and Cheeba's bedroom. There's a small cubby in their room traditionally used for hotboxing, and that was where we planned on starting the trip. It's an odd space 4 feet from the floor embedded in their wall, probably used by most tennents as a storage space. About 15 minutes after ingestion I started feeling a little woozy, and jumped out of the cubby onto the carpet where I could stretch out and get comfortable.",
  "Words were bouncing around in my head. The English language was subject to brownian motion, and in a few minutes I was watching my thoughts form of their own accord. I sank into the carpet and began the descent into a trance. Soon I couldn't see the back of my closed eyelids unless I wanted to. Fantastic towers made of cubes and studded with diamonds and crystals grew and teetered and toppled and stretched into new scenes. Characters started appearing. Everyone was a cool black hipster. They were strutting around as though in a pop hip-hop music video. A group of them kept coming right up to me and examining my brain. They weren't speaking audibly but I could understand what was going on because I was recieving strong impressions from them. They were there to irritate me, and they thought maybe I was having a bad trip. Another character came onto the scene and pushed the irritating people aside. I was thankful to get a little space. This helper was also black and cool like everyone else. He stood away from me and said 'actually, I'm with them.' and then they all jumped up and flew together like a comet towards the earth below, landing with an explosion.",
  "This was typical of this phase in the trip. The story was that I was at a party in outer space with a bunch of really cool guys, and it just kept twisting and twisting into something else. At times there were hundreds of plot twists within a few seconds.",
  "As the trip picked up, I left the party scene and was being shown a 'device' by an invisible character. The device was like an accordian. The entity stretched it out and showed me one of the images held within it -- well-rounded female buttocks. When I saw the image I felt what it was like to have sex for the first time again. I understood that this device held every feeling one could ever have, and with it a human could pick out any feelings and experience them as many times as he wanted. My foot moved and touched Jesse's. He was lying down beside me. We looked at each other and then rolled our heads back to where we were before. I'm not sure if this action brought me out of the trance or if it was coming to an end anyway, but I knew right away I was in the final seconds of contact. I saw long arms stretching trying to hand me little white calling cards. The owners of the arms were desperate, but I had no way of grabbing the cards, so I communicated to them to leave them inside my head between my brain and skull. They slipped them inside and the visions abruptly stopped.",
  "I rolled over and looked at Jesse. He was lying on his back looking at me, and may have said something like 'hmmm.'  'Well,' I sarcastically asked, 'want to, ah, go out to some clubs or something?' We laughed a little for the first time that night. Normally our trips are spent insanely bantering back and forth for hours, but we were both feeling a little ill. I sat up and found that despite my stomach feeling quite sensitive I had a lot of energy in my limbs. Jesse tried to sit up but felt on the brink of puking so he lay back down. Jesse had gone to pee a few times already, and I was feeling the urge coming on so I left to the bathroom. I was sitting on the toilet feeling my gums and pondering my relationship with the light switch when Jesse came to the open bathroom door jumping up and down gesticulating that he had to go pee. Although I wasn't peeing or pooing I didn't make any move to get up and instead suggested he pee in the sink. After he left I remained on the toilet thinking only about how I wasn't thinking of anything. I felt mindless.",
  "When I returned to the bedroom Jesse was petting and examining his cat Kaly. I told him how nothing was going on in my brain at all. He looked at me and said 'Yeah, I am a cat.' It was pretty true. I sat down with him and checked out his sleepy cat. Jesse has two young cats, and we entertained ourselves for a while by harrassing them and comparing the subtle differences in the texture of their fur. We also started tossing around the idea of going outside. After getting sidetracked for something like an hour, we made it to the front door. We said goodbye to Cheeba and ventured out into the soccer field by their house. Neither of us really had any energy. My stomach was a clenched fist, and I could taste it in my mouth. What I needed was water, but I didn't make the connection until later. We lethargically wandered about, avoiding the few people (it was close to three AM by now). We imagined only being able to see trees, including their roots, and we talked a bit about our visions from earlier in the evening. Jesse told me about being trapped in plastic bags outside the 7-11 and 3D spider webs.",
  "Our conversation followed a simple pattern. One of us would say something like 'I've felt pretty sick this whole trip' and then the other would respond 'yeah me too' and then we'd both say 'well actually not really' mathematically our conversation was 1 + -1 = 0. This lead us to conclude that conversation was nothing.",
  "'Conversation is nothing eh?'",
  "'Yeah totally.'",
  "'Well actually, is it?'",
  "'Hmmm, I guess not.' On our way back home Jesse came up with a pretty funny idea. He suggested we do a non-violent home invasion where we sneak into someone's living room, and start watching a movie. When they came in they'd find two guys standing on surfboards eating popcorn in front of their TV. This lead us to discuss why a prank like this isn't plausible in a violent, fearful society. Oh well. When we arrived home, we drank some water and smoked some weed. After we were freshly intoxicated we found ourselves full of conversation until about 6:30 AM, when we were too tired to continue discussing and picturing 3 dimensional music theories.",
  "The moral of the story? I don't know, drink water I guess. Oh, and in a standard coffee mug of water and lemon juice you can fit at least TEN GRAMS worth of psilocybe cubensis, so geez, I bet you could take five in a shot glass! AWOOO!",
  "*Names have been altered"
 ],
 "erowid": {
  "id": "20534",
  "citation": " Bplus. \"Hip-Hop Orbital Space Party from the Future: experience with Mushrooms - P. cubensis & Cannabis (ID 20534)\". Erowid.org. Feb 5, 2005. erowid.org/exp/20534",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "8855"
 }
}
