{
 "id": 3248,
 "title": "The Way Things Are",
 "date": {
  "submission": "2007-08-31T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Richard",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>One fortnight or so ago, I decided to experiment with hallucinogens; all that was available with the dealer was shrooms, though I would have much preferred LSD.  The location of the trip, was in my basement, alone, at approximately 6:00 a.m in the morning.  I felt mild nervousness due to fear of discovery by my grandmother, who was upstairs most of the episode.",
  "Immediately upon ingestion of three grams of shrooms, I became aware of an exquisite pain in my chest; though it was, of course, wholly unrelated to the drug, I began playing the 'what if' game.  Would it trigger an allergic reaction?  Will I wake up to find myself in a hospital, or worse yet, an asylum?  After half an hour, however, I became much mellower.  The familiar warmness in my stomach, generally concomitant with alcohol use, showed itself; and I felt an immense rise in humor as I stupidly stared at my computer screen with a huge grin.  This was exceedingly pleasant, and my enjoyment only increased when I began hearing a most canorous, dreamy melody - but it was unreal.",
  "I wonder - could this be indicative of some mental disorder?  I have never heard of auditory hallucinations accompanying shroom use.  Shortly after this I realized the hallucination, which I could later absterge at will, had somewhat abated of its own course; and it was then that I became cognizant of pleasing visual changes.  Looking at my monitor, the characters assumed dimensions; white objects appeared runny with tar, and others appeared to be immersed in a pool gently moved by a soft breeze. The room itself appeared familiar yet alien; it appeared lengthened and widened, and had an ineffable quality I can only describe as 'pristine'.",
  "Worth mentioning, also, was the vastly increased sense of touch.  Swallowed food could be felt moving down my throat, and a warm shower was quite sublime; not to mention other forms of tactile sensation that were very much improved. ;)  Sound, too, seemed very much louder; whispering on the phone, I felt as though I was yelling, and could hear my voice echoing off two walls.  It was at this stage that I decided to phone a close friend to describe my experience.  Oddly, I could not speak when he answered, I began laughing without reason which continued for several minutes.  Tears were strewn all over my face and hands, and the fellow judiciously decided to hang up.  I would have done the same thing, myself.",
  "Worth mentioning was my attention span and short term memory; for much of the trip, it was almost nonexistent.  I could not so much as apply myself to read a list of names longer than four or five without becoming forgetful or allowing my mind to wander.  At a repast consisting of two slices of buttered bread, I found myself leave the table three times, during which my grandmother always made a comment of one variety or another that would bring me to my attention.  Luckily, being a reasonably accomplished conversationalist while unintoxicated, I was able to speak in such a way as not to bring undue attention to myself.  To err on the side of caution, however, I did restrict myself to but a few words at a time, and to explain my restlessness, I mentioned a stomach ailment.",
  "It was after lunch that the trip began its downward spiral, and I can currently perceive there having been two triggers.  Firstly, my grandmother coming downstairs to do the laundry, and secondly, researching shrooms on the internet.  As for the latter: despite my jocund mood, I did want reassurance; I wished to read about the subject, so as to find solace in the knowledge that I would not harm my body or brain.  Next thing I knew, however, I was reading a webpage geared towards primary students, warning them of the dangers including 'burst blood vessels, brain damage' etc.  My faculty of reason was diminished and I, despite all my previous research, believed it to be true; I became awfully afraid, thinking that my life, and all its academic ambitions, were now wasted - that even if I were to never experiment again, my intelligence would have dropped so significantly that I would cease to be regarded as an intellectual, and instead become an outcast pariah.  Silly, the absurd anxieties shrooms can produce, isn't it?",
  "The other trigger, and one I find particularly shameful, is my grandmother coming downstairs, which led to concerns about becoming insane or violent.  I would reason with myself; 'Am I quite in control?  Is it not possible that I could now do something awful, without my consent?  How could you stop myself?'  Though the risk was never there, I believe, the questions made me incredibly fearful.  It was, quite probably, one of the most frightening experiences of my life.  At one stage,  I felt it necessary to run from the house so as not to pose a danger - to be quite honest, such thoughts I find embarrassing and even writing them makes me quite ashamed.",
  "The 'bad trip' I was experiencing, though doubtless far less intense than what I would have undergone on LSD, began declining with my trip in the early hours of the afternoon.  To illustrate its severity, I would like to mention that I was rubbing my face quite vigorously without my knowledge due to the stress; and after I had resumed my normal consciousness, I found there to be blood on my hands and face come of sores I had created.",
  "After the trip, I was left with a mild, and admittedly, worrying, headache and felt my speaking and writing skills to have declined, though that seems to have been temporary.  Two days were needed to return to normal.",
  "On the mention of the word normal, and with the fact in mind that I have created this brief report to record my thoughts and experiences, not necessarily well ordered and arranged, I would like to mention my disconcertion upon realizing the subjective nature of reality.  Though I have always known this to be the case, it was not until my trip that I could accept it; and, in some way, I wish I could trade places with those who have not had the insight.  For previously, I considered my sober consciousness to be 'normal' and everything else an aberration of some degree or another - now I realize this is not true at all.  None are necessarily 'the way things are', and sobriety not necessarily a frame of reference, and though this knowledge seem menial, it really has quite shaken me, though I cannot quite explain why.",
  "It has been suggested to me that I may be depressed - and this view would be quite consistent with depression, and it is true that of late - that is, about two or three years - I have felt an absence of real joy, a certain hollow and lovelessness, not to mention severe memory impairments.  Perhaps the problem was exacerbated by the shrooms, or maybe the psychedelics merely brought the illness to my attention.</p>"
 ],
 "erowid": {
  "id": "20540",
  "citation": " Richard. \"The Way Things Are: experience with Mushrooms (ID 20540)\". Erowid.org. Aug 31, 2007. erowid.org/exp/20540",
  "substance": "Mushrooms",
  "views": "2689"
 }
}
