{
 "title": "Post Trip Recurrence with OCD Diagnosis",
 "author": "John",
 "citation": " John. \"Post Trip Recurrence with OCD Diagnosis: experience with Mushrooms (ID 32509)\". Erowid.org. Apr 23, 2004. erowid.org/exp/32509",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>This was my third time tripping. The other two times I had only done half of an eighth. I had never had a bad trip. This trip was the best of all because I went to a friends house who I had never been to before while I was peaking. I had no idea what was real. His house was four stories so when I arrived I freaked out cuz they all looked the same so I thought they werent real. He has a deck all around each floor which are identical and that was pretty crazy. Inside I opened doors which had stairs and more doors and more stairs, it seemed like it never ended. In his room he had a record player and we listened to Dark Side of the Moon. There were 4 frog statues outside which all started dancing around and playing the guitar solos of the music. His Pink Floyd poster was singing to me. I went up into his parents bathroom which has a walk-in closet. The closet was pitch black but as soon as I stepped inside a vampire sparked a lighter and took a drag from his cigarrette. When he blew the smoke out he looked at me and said, 'We've been waiting for you John.'</p><p>This wasnt scary at all, I couldnt wait to show my friend. He of course couldnt see or hear him but I soon forgot about that anyways. His walls are all made of wood and stained. The stains on the wall all looked like Jesus with a goatee and long hair. He has a stained glass window with a deer couple and a river and two trees. I looked at it and immediately knew the story of the deer. I told him their names and why one was mad at the other. I started playing piano but soon all the keys formed into one big one. So I picked up a guitar and started playing Kansas, Dust in the Wind. Soon after I couldnt see the strings, so I played a xylophone for awhile. It was a good ass time. I could go on for hours. Basically, it was the best time of my life. As I was coming down from peaking we smoked about 3 bowls of weed.</p><p>But, because I have OCD (Obsessive Compulsive Disorder) my brain always wants consistency. If things arent always the same I get very agitated. Its difficult to explain but if you have the disorder you know what Im talking about. Anyways, every time since then when I smoke weed the effects of shrooms are brought back fully, including the dilated pupils, and even the length of the trip. It has been about 3 months now and it still happens fully. This is because the OCD brings it back everytime because thats what it thinks it is supposed to do. Its quite nice actually. But, after about 30 times I had a bad experience so I have quit.</p>",
 "year": "2004",
 "id": "32509",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-04-23T07:00:00.000Z",
 "views": "9357",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
