{
 "title": "The Girl From Ipanema",
 "author": "Onion Flags",
 "citation": " Onion Flags. \"The Girl From Ipanema: experience with Salvia divinorum (Leaves) (ID 32552)\". Erowid.org. Jun 21, 2007. erowid.org/exp/32552",
 "substance": "Salvia divinorum (Leaves)",
 "bodyweight": "185 lb",
 "report": "<p>I have experience with the usual suspects, but after reading about Salvia as much as I could, I ordered an ounce of leaf. We were moving at the time, so two weeks went by before I found a free evening to try it, which was last night around 9:30. I asked my wife to be my sitter. Lit candles and fireplace, put on Getz and Gilberto. I reconstituted two dried leaves in water, chewed them for ten minutes, spit them out. Then I crushed 3 leaves into the bong bowl, reclined on the couch, torched it hard with the lighter and took the whole chamber in  -- it looked really strange burning and it almost seemed the effects started by watching the incineration. I held the smoke as long as I could, then exhaled, set down the bong, and folded my hands across my stomach.</p><p>First thing was the music seemed to be taking place outside of time, as if I was hearing the whole song ('The Girl from Ipanema') at once, yet it sounded slow, too, like I was 'viewing' the music from many angles at once. Then I felt a strong, rotating tug down to my left. My legs felt as if they were being pulled and twisted away from me to the left, off the couch -- in fact I felt as if I were almost about to fall off the couch somehow. Then a vortex of swirling peacock feathers opened up down beyond my feet and a little to the left that seemed to be definitely dancing to the music. I felt that I could go into this vortex, that I was being invited to do so, to succumb to it, but being new to the feeling, I resisted and fought the tugging, which wasn't difficult.</p><p>For some reason I felt as if I were on a boat dock when I was a kid, and that people were off to my left, watching me. And that was pretty much it. The spiraling feathers faded gradually. Before 'Ipanema' was even over (3 minutes), I said out loud, 'That's it. I'm back.' And then proceeded to describe to my wife what happened. I considered it amazing and told her I'd never felt anything like that before. Funny thing, I had meant to close my eyes, but I forgot all about that, so these were open-eye visuals.</p><p>She looked at me and said she wanted to do it. So she did the same thing, chewed leaves for 10 minutes, then lay back on the couch with her head in the other direction, took as much bong as possible (3 leaves), and I replayed 'Ipanema.' I noticed she closed her eyes. I watched her breathing deeply through her nose for about three minutes while I petted our dog, then she raised her eyebrows, smiled, and laughed. She opened her eyes and pointed. 'I was using those candles. I was hanging onto them, so I didn't get pulled into it.' She said 'it' had her right arm and was pulling and twisting it, pulling her off to the right. Said it was like a big machine was chugging and grinding away right beside her, pulling her toward it, but the candles held her though her eyes were closed.</p><p>I asked why she laughed, and she said it was because she felt she had to acknowledge, 'Okay, you've got my arm, gotta give you that!' And also because her visuals were like cheesy Florida pink flamingo 50s hotel-type imagery. She suggested that was because of the music, which sounds like something you'd hear at a beach bar in Florida. She also said she had a gross feeling at one point because she felt like she had become a plant -- specifically a twisting vine. She suggested we test the music > imagery hypothesis by trying it to different songs and taking notes.</p><p>Aftermath of 15 minutes felt similar to MJ for both of us, then totally normal. We got up and proceeded to eat dinner. Next time I'm not fighting the vortex. I want to see where all this leads. I would characterize the experience as both subtle and powerful, like a shy but very strong woman pushing me on a merry-go-round. I note that we both felt the tug of gravity or some force coming from the same direction, facing as we did in opposite directions on the couch. It grabbed her arm and my legs, but from the same place apparently. One more note: I woke up with powerful headache, but aspirin fixed it and it hasn't come back. Both of us today feel rather bright-eyed and cheery, with good energy.</p><p>I can see why some would consider it dangerous, because it's so abruptly disorienting that the 'fight or flight' instinct kicks in, and I imagine some people would try to get up and reorient. But used as we did it, it was totally safe and pleasant and very, very interesting.</p>",
 "year": "2004",
 "id": "32552",
 "gender": "Male",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "3492",
 "dose": [
  {
   "time": "0",
   "amount": "2 leaves",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  {
   "time": " T+ 0:10",
   "amount": "3 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ]
}
