{
 "title": "Getting in Touch With My Human Side",
 "author": "Dragon Shaman",
 "citation": " Dragon Shaman. \"Getting in Touch With My Human Side: experience with Morning Glory (Heavenly Blue) (ID 32560)\". Erowid.org. Nov 16, 2007. erowid.org/exp/32560",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "240 lb",
 "header": [
  "DOSE:",
  "488 seeds",
  "oral",
  "Morning Glory",
  "(capsule)"
 ],
 "report": "<p>There is something in the morning glory seeds that allows one to reach a state of pure humanity.</p><p>I've been reading up and studying various books about shamanism. I am a skeptic and I suggest to others to make up their own mind before experimenting. Previous experiences include alcohol and cannabis. 1st experiment was based on readings in the vault. Ground up seeds soaking in water. First I tried 100 seeds in water. Nothing happened. Then 300 seeds in water, no dice. I decided to move on to eating untreated seeds bought from an online vendor.</p><p>I did this on Saturday since I was off work. I wanted to start with 500 but I only had 488. 488 ground up in a coffee grinder, small coffee grinder was just over $12. I slowly ground up the seeds to a fine pulp. Next I emptied some echinacea capsules (26 total). I filled each one as much as I could and ended up with 26 pills. Yes it's alot but over a period of time (while eating breakfast) it's not so bad. I made me two tacos for breakfast. 6 pills while cooking breakfast, 8am on an empty stomach. I finished one taco and took 6 more pills 3 at a time. Washed it down with lemonade. 6 pills every 5-10 minutes. By 8:30 am breakfast was eaten and all the pills had been taken.</p><p>10am I started to feel sedated. That's right, I felt sleepy. 10:30am I started to feel restless, gas pressure and lots of burping. Burp Burp and Burp. Keep burping.</p><p>11am I started to feel a little sick, gas pains prior to vomiting. I had to go outside. I went to a vending machine and got me some sprite, helps to burp.</p><p>11:45am-12pm I had to take a crap, diarrhea, no biggie, part of the cleansing process. Sometime after 12-12:30 I went back outside trying to hold the urge to vomit, but that only makes it worse. The sedation passed, then the restlessness then after I vomited it, I went and laid down in the shade and just relaxed. I began to feel good and very mellow. I felt as though nothing could anger me. I felt very kind and peaceful. Kind of euphoric. But that was just the beginning. I felt very much at peace with the world. My heart was opening up and my feelings of love were amplified. My good natured self was amplified 10 fold. I've never taken ecstasy but I know people who have and their descriptions seem similar to mine. I went home and put 'Luminous Visions by The Mind's Eye' and it was amazing. My sense of touch was amplified as well, I ended up naked while watching the dvd. I felt so in touch with my human side nakedness was natural. I didn't hallucinate, but when I closed my eyes, I saw all kinds of shapes and psychedelic colors.</p><p>These feelings lasted all day, no anger, no sadness; just a super happy mellow trip filled with a very natural form of love. I went outside several times and enjoyed the breeze and sunshine. I was like wow, these morning glory seeds aren't bullshit. I was very skeptical at first but, I think 488 was a bit much to start off by eating. I tried eating 112 seeds later to no effect. I will go with 300 and see how intense the trip is. The only side effects were the vomiting, only once. My food was digested only fluids came out. Diarrhea wasn't that bad. Considering how I felt the next 10 hours it was worth the discomfort.</p>",
 "year": "2004",
 "id": "32560",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-11-16T08:00:00.000Z",
 "views": "3408",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "488 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(capsule)"
  }
 }
}
