{
 "title": "Riding with Daddy Mushroom",
 "author": "Skinny",
 "citation": " Skinny. \"Riding with Daddy Mushroom: experience with Mushrooms (ID 32578)\". Erowid.org. Nov 16, 2007. erowid.org/exp/32578",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>My brother was home on leave from the military and was staying with my boyfriend and me at our house.  Because psilo. is not detectable in urine tests after a few days, my brother and my boyfriend and I all decided to trip.  We lived in the perfect house for using psychedelics, it was isolated and full of weird paintings, drawings, clip-art and such, with a huge backyard and a separate garage.  We bought a bag of beautiful long-stemmed mushrooms with brown caps and white gills.  We'd fasted and stocked the house with orange juice and fun toys beforehand, and the ringer/answering machine was shut off.  We'd also resolved not to answer the door if anyone dropped by.</p><p>I ate an eighth of the 'shrooms while my brother and boyfriend, both much larger than I, ate about a quarter each.  We saved the rest in case we wanted to boost our doses later on.  About thirty minutes after dosing, I started to come up.  We were listening to Squarepusher, loud breakbeat ambient music with an upbeat feel, and I was beginning to 'see' the music drift out of the speakers.  As soon as I noticed this, beautifully brilliant lights began to appear and disappear in all corners of the room.  It was as though stage-lights were being flipped on and off throughout the house.  My brother was leaning back against the couch, eyes closed, moving slightly to the music.  At one point he turned to me and asked me, 'Am I real?'  I assured him he was and he began to laugh happily like a child.  When he opened his eyes, though, I could tell he was freaking out.  I didn't worry because he seemed to be enjoying himself.</p><p>Meanwhile my boyfriend was across the living room, walking around and examining the weird tapestries and such on the walls.  He'd put on some enormous aviator glasses with yellow lenses, which I thought was hilarious.  None of us could stop laughing, and that's when the visuals really kicked in.  The walls were throbbing and pulsating with color; I waved my hands in front of my face and saw colored trails.  The ceiling was sparkling with light, even though I knew it was painted a matte white.  My cat ran through the room and I was certain he stopped and winked at me before running right back out.  Musical notes and little red and blue and purple polka dots were dancing around the stereo.  The phone rang and I answered it, not remembering that the ringer was off and I sat listening to the dial tone for a few minutes, fascinated.  I'd hallucinated the ringing phone, but apparently my boyfriend heard it too because later he asked me who had called.</p><p>I'd underestimated the potency of these mushrooms, though, because suddenly (about T+1:15) I started peaking hard.  Nausea set in along with a little bit of panic.  I breathed deeply and told myself to just go with it and relax, but my body was responding in a very alarming way.  I began to sweat and suddenly felt the strong urge to be by myself in a darkened room.  I went to our bedroom and sort of knelt on the bed.  My boyfriend and brother were understanding and after I reassured them that I was okay, they left me alone.  I could still hear the music through the walls but it wasn't a comforting sound.  The normally upbeat songs sounded like funeral dirges, and I began to wonder if I was dying.</p><p>The thought didn't frighten me, but I began to pray to an entity I called Daddy Mushroom.  I ended up lying down on my side, and from this angle I could see the curtains swaying in the breeze from the open window.  The curtains were actually Pakistani tapestries, very intricate designs in deep shades of maroon and dark blue.  They appeared to be breathing, and the sight increased my nausea.  I closed my eyes, and Daddy Mushroom took over.  I felt as though I was lying on soft dirt, with living things, plants and mushrooms - growing, dying, rotting into the earth, and then growing again - all around me.  Daddy Mushroom was showing me the cycle of life, and I was terrified.  I became convinced that I was dead, that I was rotting in a grave, and that I would be in this realm for eternity.  Daddy Mushroom wanted me to understand his power.  He seemed to be telling me that mushrooms are not just for recreation.  I distinctly heard a deep male voice say, 'Now do you know what I am?'</p><p>And then it was over.  I reached my plateau and with a start I sat up.  I felt at peace with the world and I knew I was okay.  I went back into the living room where my boyfriend and my brother were laughing hysterically while they played with the cat.  The music (Stereolab, I think) was soothing and cheerful, and the visuals were stunning.  We went outside where the moon was full and danced around in the backyard like lunatics.  I kept saying 'He's got mushroom fevah!' in an Eddie Murphy voice, and we couldn't stop laughing.  Finally, after about 5 hours of a beautiful trip, I began to come down.</p><p>It was one of the most powerful trips of my life, and I learned a lot from my sojourn into death.  Daddy Mushroom showed me that while psilocybin can be fun, it is also easily underestimated.  Every trip I've had on mushrooms has been different, but this time was an epiphany.  No matter how many times you trip, you never really know what to expect when Daddy Mushroom takes you by the hand.</p>",
 "year": "2004",
 "id": "32578",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-11-16T08:00:00.000Z",
 "views": "2948",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
