{
 "title": "A Calm, Relaxing Night of Enjoyment at Home",
 "author": "ComputerNerd",
 "citation": " ComputerNerd. \"A Calm, Relaxing Night of Enjoyment at Home: experience with MDMA (ID 32586)\". Erowid.org. May 6, 2007. erowid.org/exp/32586",
 "substance": "MDMA",
 "bodyweight": "140 lb",
 "report": "<p>First let me give a brief history of what drugs I have experimented with. Everything I have done has been purely recreational in nature. Over the last year, I have taken mushrooms twice. Over the last year and a half I have taken vicodin and oxycotin approximately 5 times each. I have smoked marajuana 4 times. I have taken valium once. I tried nutmeg once but did not take enough to have any notible effect aside from a slight stomach discomfort. I have taken Ecstasy 3 time before, all three times were at raves, and as such with many many other people (only one pill). I have never had a bad trip/experience with any of the above, except the first time I took Ecstasy and didn't drink enough water. I didn't experience any problems other than a bit of an overheated feeling until I splashed some ice water on my face and drank a good ammount of water, but it was luckily the only 'negative' experience I have had with drugs. I am currently writing this at the trailing end of my experience, as to best capture the mood of the eveing.</p><p>The setting:</p><p>A Sunday night, by myself (well, my cat is here too), in my apartment. I spent the duration of the evening, night, and now morning in my bedroom, including bathroom of course.</p><p>Timeline of events:</p><p>8:00PM</p><p>I had just arrived home from dinner.</p><p>10:30PM</p><p>**1 pill Ecstasy (Blue Dolphin) taken [10:30PM]**</p><p>At this point, I took a single Blue Dolphin (Tested as 100% MDMA) pill, with a glass of water. Given the time, and that it is a Sunday night (meaning I have obligations Monday at ~ 10:00, logic would dictate that I had better just plan on not sleeping, with, of course, the help of my friend MDMA. In my bedroom I have a about a 350 watt audio setup, a tv/dvd player, and my laptop, luckily with my newly installed cable internet, for entertainment. Unfortunately, I do not have a fog machine, strobe light, photons or other visual / lighting effects, but Windows Media Player and WinAmp visualizations have taken their place adequitely. Also, during the night I had about 10 or 12 glasses of cold water, but I didnt feel it was necessary to note the individual glasses on the timeline :P</p><p>10:30PM - 11:00PM Sunday</p><p>I spent this first 30 minutes chatting with some friends via AIM. The fact that I usually don't listen to loud music at 10:30PM on Sunday nights, coupled with that this is my first time taking Ecstasy away from a rave, it did not occur to me to put on any music just yet.</p><p>11:00PM - 11:30pm Sunday</p><p>I am now definately noticing that I am starting to come up, and feeling dandy. I put on the 'hard house' mp3 stream from digitallyimported.com, and turned up the music a fair bit. Loud enough that I can feel the bass a bit, but not too much as to get my neighbors knocking on my door lol. At this point I turned on a WinAmp strobe-effect visualization which turned out to be pretty neat and gave a hint of the familiar rave lighting environment. Toward 11:30 I am now feeling the overall body 'high' and warm, tingly feeling in my stomach. Also, I am definately paying much more attention to the music, and find myself looking intently at my laptop from time to time as I am coming up more and more on the Ecstasy.</p><p>11:30PM - 12:00AM Sunday-Monday</p><p>My cat woke up at this point, and wandered in from the living room. He is a very energetic and playful cat, so immediately came over and batted at me a bit. I spent this next half an hour or so playing with my cat. I got luckly and came out with only a couple scratches =). I it was much fun playing with him in while I was rolling! He plays rather aggressively and rough; although he's only 5 months old so he's still small.</p><p>12:00AM - 12:30AM Monday</p><p>I'm up to the superb feeling of being at the peak of my current Ecstasy experience. I decide to take a nice warm shower now. I read in a form a while ago, that it is really fun to shower with the lights off, and have a strobe light in the bathroom. Now, as I don't have an actual strobe light, I set my computer on the bathroom counter, facing the mirror, and the effect was incredibe. It was completely sensory pleasing experience with the hot water, washing my hair, hearing the music, and seeing the strobe light effect. It was of equal enjoyment to getting a salp massage and a light show simultaneously at a rave, to put it in perspective.</p><p>12:30AM - 1:30AM Monday</p><p>After I got out of the shower and had dried off a bit, I began to wach the 'making of' featurette from XXX (The action movie w/Vin Diesel and Samuel L Jackson, not a porno lol) DVD, and turned down the music enough so that I would be able to hear what is going on. This was a very relaxing hour or so. I was lying on my bed, with my cat sleeping beside me, thoroughly enjoying both the DVD and the music.</p><p>1:30AM - 2:00AM Monday</p><p>I decided to turn the music up back nice and loud now. I wasn't restless, persay, but I new that some movement would defiantely be enjoyed. So, I stuck in this Beginners Yoga DVD I have and did about 30 minutes of Yoga, a couple minutes of meditation, and then a long segment of different stretches. For those of you who have never tried Yoga, it is very rewarding first thing in the morning to start off your day getting centered and stretching and warming up, etc. Well, doing so at 1:30AM while rolling on a Blue Dolphin is 1000 times better! After all the stretching, my body high was stepped up a level, which was definately satisfying.</p><p>2:00AM - 2:15AM Monday</p><p>I decided that I wanted just a little more exercise, so I spent about 15 minutes doing push-ups and curl-ups on the floor. While doing the curl-ups on the carpeted floor, the carpet against my bare back felt great, kind of like a moderate back massage after enough curl-ups.</p><p>2:15AM - 4:00AM Monday</p><p>After all my exercise, I decide to turn the music back down a bit and watch the acual movie XXX. I discovered a bottle of the clear Purell hand sanitizer, which turned out to be pretty cool. As the hand sanitizer is 62% ether alcohol, it feels Very cold and refreshing when you rub some anywhere on yourself, and while it evaporates. It also smells alost like eucalyptus, which was very nice. So, between the movie, music, and that hand sanitizer, I was completely content and satisfied, and having one damn nice time.</p><p>4:00AM - 4:30AM Monday</p><p>**1/2 pill Ecstasy (Blue Dolphin) taken [4:00AM]**</p><p>At this time, I took half of a Blue Dolphin pill with a glass of water. I remembered that a couple days ago I had opted for a 7-day free trial of Napster's paid music service, so I spent about half an hour working out a kick ass playlist to carry me through the moring, and of course cranked the music a bit more as it is approaching moring. By the time I had my new playlist setup I was definately feeling that half a pill kick in about the point I believe I would have otherwise began to come down.</p><p>4:30AM - 5:00AM Monday</p><p>**1/2 pill Ecstasy (Blue Dolphin) taken [4:30AM]**</p><p>First, I took the other half of the second pill with a glass of water, then I decided to go and take another shower with the same strobe setup as the previous shower I took earlier in the night. Again, taking a shower, while on Ecstasy, with really good music on and a strobe in the bathroom is damned cool.</p><p>5:00AM - 5:30AM Monday</p><p>I spent this next half an hour dancing to some really good progressive house. I would say that dancing for at least some period of time to really good music is a definite must when you take Ecstasy. By now the second pill that I had taken in the two halves had kicked in it's full effect, and I am still flying right along nicely :)</p><p>5:30AM - 7:00AM Monday</p><p>Now I decided to turn the music back down a bit and put in the Office Space DVD (one of my favorite movies). I again amused myself during this movie with the hand sanitizer which is great stuff when you are rolling!</p><p>7:00AM - 8:30AM Monday</p><p>I then spent an hour and a half or so checking up on the news headlines online, lounging around, and playing with my cat some more. Everything I did, no matter how normal or standard, was an incredible happening :)</p><p>8:30AM - 9:00AM Monday</p><p>It's now getting nicely into Monday morning, so I took a half an hour to leasurely get dressed, and have a couple bowls of cereal and a banana and my vitamins for breakfast.</p><p>9:00AM - 9:30AM Monday</p><p>Well, that's where we are at right now :) It looks like it took me about half an hour to type out my night's experiences. I am off to work now, but I will append this tommorow morning hopefully with some degree of retrospect!</p><p>The Next Day:</p><p>9:00AM</p><p>It is now about 24 hours since I declared the bulk of my trip overwith, and I feel great. I got a good 8 hours of sleep last night, took my vitamins this morning, and have had no adverse effects from Sunday night, Moday morning :) I declare it a success!</p><p>Initially, I was a bit skeptical about taking Ecstasy at Home, by Myself, but it turned out to be every bit as enjoyable as at a rave, and I would even go as far as to say it was overall better than a rave. Well, there you have it, and I hope that somebody will be able to get some ideas or otherwise benefit from reading about my experience!</p>",
 "year": "2004",
 "id": "32586",
 "gender": "Male",
 "timestamp": "2007-05-06T07:00:00.000Z",
 "views": "18001",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 5:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 6:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
