{
 "id": 3260,
 "title": "Trance Trip",
 "date": {
  "submission": "2006-09-01T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Human",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Woke up at 2pm.",
  "3pm: Ate 2 ham and turkey sandwiches for lunch.",
  "(With 4 of my friends)",
  "9pm: We took Foxy pill, along with 2 tabs of PepmoBismal.",
  "smoker/ foxy Female: 120-lbs",
  "only foxy Female: 135-lbs",
  "only foxy Female: 100-lbs",
  "smoker/ foxy Male: 165-lbs",
  "9:45pm: Setting: Room with candles. 2 big beds on the floor and a kitty cat chilling with us.",
  "Played some Tool on the stereo. We three smoked 5 bowls of regs. only foxy female 100-lbs started tripping, pretty much overwhelmed.",
  "I felt nothing.",
  "10pm: Completely stoned and zoned out.",
  "Starting to feel jittery and very happy. Not with energy, just in my mood. Everyone (but *only foxy female 100-lbs) is feeling pretty good right now.",
  "Switched music to trance and turned it up. Killed the candles and turned on the blacklight with glow in the dark paint on ceiling.",
  "11pm: I feel like I weigh 5 times more than I do. Im laying sunken on my bed, like a big blob. My body feels excellent. Pretty numb and twitchy. My jaw feels really tired.",
  "Visually blurred out, glowing green paint on ceiling is moving. Visuals of rich texture and bright glow to certain things in the room.",
  "*Being high as the 5-MeO-DiPT worked into my system was great because it creped up on me nicely while I was stoned.",
  "12am: The foxy is flowing like waves off and on. Everyone is still planted into the bed. Some small talk every once in a while, mostly people checking up each other. Giggles all over the room spreading from one person to another like dropping dominos.",
  "The trance was very soothing and rideable as we flowed through our frozen dreams.",
  "Closed eye visuals were incredible. Kaleidoscope of craziness, mostly unimaginable or indescribable.",
  "only foxy female 100-lbs is feeling good now.",
  "Stomach discomfort is beginning to be noticeable.",
  "4am: Coming down nicely. Only a little bit agitated and with some stomach growling.",
  "5am: Finally my mind has stopped spinning and thinking. Sleep.",
  "My overall experience was wonderful. As a psychedelic experience and mind journey I would say I didnt travel that far. The up and down of foxy and the lack of focus, made my thoughts start to develop but never finish. Mentally I ended right were I started. Now I just feel fresh and motivated. During the night I pretty much indulged in my body more than my mind. Focusing on relaxing and feeling things."
 ],
 "erowid": {
  "id": "20571",
  "citation": " Human. \"Trance Trip: experience with 5-MeO-DiPT (ID 20571)\". Erowid.org. Sep 1, 2006. erowid.org/exp/20571",
  "substance": "5-MeO-DiPT",
  "views": "4093"
 }
}
