{
 "title": "And Then I Passed Out",
 "author": "Midwest Hoss",
 "citation": " Midwest Hoss. \"And Then I Passed Out: experience with Amanitas - A. muscaria & Anadenanthera peregrina (Yopo) (ID 32627)\". Erowid.org. Jul 17, 2013. erowid.org/exp/32627",
 "substance": "Amanitas - A. muscaria & Anadenanthera peregrina (Yopo)",
 "bodyweight": "300 lb",
 "report": "<p>It was a Monday when I decided to fast for a day, before I began a trip with Fly Agaric mushrooms.  I have taken this mushrooms before with only small effects.  This time I wanted to be sure and aware of their effects. My day began at 10:00 and I decided to take them at 10:25.</p><p>10:25 - I ate a good portion of a half ounce of these mushrooms.  I tried to chew as little as possible, as I heard this was the main reason for stomach pains.</p><p>10:45 - I decide that time is passing by too slow, and I want to go for a walk.  I figured that a good walk would speed up digestion, and take up some time.  I head for a near by nature path, and on my way down the path I can tell that thing's are a little off.  All the tree leaves and grass are just a little bit greener.  I feel a little different, but I couldn't put my finger on it.</p><p>11:20 - I return home from my walk with a definite calm.  I feel a little strange, and my vision is not quite normal.  It feels almost like the buzz I get from smoking just a small amount of pot.</p><p>12:00 - Okay, I know things are definitely different, but I get impatient with the Amanitas, and proceed to prepare some Yopo.  I back a little bit of weed in my steamroller, and then put the Yopo on top (about 1-2 seeds worth).  I smoke the entire bowl, and then another bowl of just weed to settle things in a little.  I knew the weed wasn't that great, and I'm a big guy, so that shouldn't affect me too much.</p><p>12:30 - Things are getting a little crazier now.  I feel as if my body is being contorted.  It feels like a giant hand is twisting my upper body one way, and another is twisting my lower body the other way.  It wasn't too intense, it just made me realize how messed up I was.</p><p>1:00 - Having enjoyed my little ride of the giant hands, and playing some piano ( I don't know why, I just felt like doing it ) I decided I would wander around my house.  That got boring quick and I laid down on the floor of my living room.  At this point I felt incredibly stoned.  I didn't smoke enough for that to happen, so I figured it was the Yopo.</p><p>BLACKED OUT</p><p>3:30 - I came too, feeling extremely groggy.  I felt like I just wanted to sleep forever.  I woke up in my living room with the TV on, and remember just wanting to go back to my room and sleep.</p><p>The rest of the night I felt so lazy, and still a little bit stoned.  I decided that next time I will try the Yopo alone to smoke,  but it is my opinion that I need too much Fly Agaric for it too be of any real value to me.</p>",
 "year": "2004",
 "id": "32627",
 "gender": "Male",
 "timestamp": "2013-07-17T07:00:00.000Z",
 "views": "550",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "8 oz",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 1:35",
   "amount": "2 seeds",
   "administration": "smoked",
   "substance": "Anadenanthera peregrina",
   "form": "(seeds)"
  },
  "2": {
   "time": " T+ 1:35",
   "amount": "1.5 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
