{
 "id": 3264,
 "title": "Ah, The Glory",
 "date": {
  "submission": "2000-06-24T07:00:00.000Z"
 },
 "author": {
  "name": "Tom Biggs",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "48 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "seeds"
  }
 ],
 "report": [
  "A FOAF stopped on the way home from work where he had noticed some wonderful blue flowers growing on the edge of a cornfield. As he had suspected, they were Morning Glories, presumably the coveted Heavenly Blue variety. He wanted to get an idea of what the plants, and especially the seed pods, looked like so he could go back and harvest them at the end of the season. He picked a few pods to take home and examine, even though they weren't really mature.",
  "On the way home, on impulse, he popped about 6 seed pods into his mouth, chewed them thoroughly, and swallowed them. That would be about 48 seeds because they seemed to have about 8 seeds per pod. It suggests 200 or so seeds in the MG FAQ, so he probably got about a 1/4 hit type dose.",
  "And that is what happened! The heightened senses, the sense of an impending trip, a slight tendency to laugh, and sleeplessness later that night, all suggested that he had taken about 1/4 hit; he had experimented with 1/4 hit doses before. Not a trip, really. He remembered what Graeme Carl had written about 'thresholds', where it takes a certain amount to jump between levels of tripping, or to trip at all. He also wondered whatever happened to Graeme, perhaps he had an account at university and has no access to the Net now.",
  "The FOAF was delighted by the results of this impromptu experiment and now is impatient for the end of the growing season so that he can go harvest those seeds. Of course, he is going to order more from the seed catalogs as well, but it is always fun to get a trip out of the local environment. He has read the MG FAQ and is ready to extract and enjoy."
 ],
 "erowid": {
  "id": "2059",
  "citation": " Tom Biggs. \"Ah, The Glory: experience with Morning Glory Seeds (ID 2059)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2059",
  "substance": "Morning Glory Seeds",
  "views": "104892"
 }
}
