{
 "title": "Overdose, Asleep for Two Days",
 "author": "Jerry",
 "citation": " Jerry. \"Overdose, Asleep for Two Days: experience with Olanzapine (ID 32669)\". Erowid.org. Jan 3, 2005. erowid.org/exp/32669",
 "substance": "Olanzapine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Olanzapine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Olanzapine has no ascertainable benefits in terms of recreation. That's not really what I was shooting for, actually I attempted suicide by consuming, (somewhere in the neighborhood of..) 200 mg, possibly a bit more. Now that I understand this drug better, I know it wasn't nearly enough to kill me.</p><p>After consuming the medication, I felt overcome with dizziness and exhaustion shortly after. Possibly within the hour proceeding the overdose. Peak concentrations are typically reached within six hours. I fell asleep before then, and awoke about two days later. Extremely dizzy and confused, my legs felt like lead for several days after I awoke. No one noticed what had happened, I did not go to the hospital.</p><p>As I started to move around in the next few hours, I experienced a strong metallic taste, dry mouth, difficulty urinating, constipation and tremor (EPS possibly). These are all consistent with side effects of the drug in therapeutic doses, though of a much more severe intensity.</p><p>I have heard of a few cases of deaths related to olanzapine overdose. 'Eli Lilly and Company has received reports of fatality in association with overdose of olanzapine alone. In one case of death, the amount of acutely ingested olanzapine was reported to be possibly as low as 450 mg; however, in another case, a patient was reported to survive an acute olanzapine ingestion of 1500mg.' - Rxlist.com... not really sure of what else those people had taken at the time, or of their body weight. It's still useful to know. </p><p>In conclusion, trying to kill myself was in no way glamorous, or fun. It was a very stupid thing to do. In hindsiht, I don't believe I took enough olanzapine to seriously harm myself permenantly. Though my liver and kidneys surely took a beating. I've fully recovered today, one year later. I do NOT recommend taking this drug unless it is medically necessary.</p>",
 "year": "2003",
 "id": "32669",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-01-03T08:00:00.000Z",
 "views": "22648"
}
