{
 "title": "Pure White Universe",
 "author": "BongFish",
 "citation": " BongFish. \"Pure White Universe: experience with Mushrooms, Cannabis & Alcohol (ID 32696)\". Erowid.org. Jun 21, 2007. erowid.org/exp/32696",
 "substance": "Mushrooms, Cannabis & Alcohol",
 "bodyweight": "65 kg",
 "header": [
  "DOSE:",
  "0.5 joints/cigs",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "1 shot",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  "",
  "20 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(fresh)"
 ],
 "report": "<p>A good friend and me had been planning on taking mushrooms for a while. It would be my first ever experience with hallucinogenics and his second. We got hold of 40g of fresh Columbian cubes, chopped them up and put them in yoghurt and ate them. I figured 20g each would be a fairly mild, pleasant trip. How wrong I was!</p><p>We were both very excited to be shrooming finally and we were in a great mood however I was fairly nervous. A couple of vodkas and a spliff sorted that out though. We ate the shrooms at about 8PM, unfortunately I can't really give accurate times of events from now on. We went into my basement to come up, it's a really great place to trip because of bright colours and artwork everywhere. Before long we were feeling fairly silly and we chatted and laughed about how we were feeling. Lead on the sofa I felt like I was drifting down a stream, the carpet was breaking up into squares and everything seemed very beautiful. By this time I was fairly high and really enjoying myself. The specks on my green carpet made it look like a huge field of mushrooms!</p><p>I would have been very happy for this to be the peak but I kept on getting higher and higher - I started to get a bit worried but I tried my best to keep calm. I was very restless and somehow both our trips seemed to be focused around me, usually my friend is very much centre of attention. We both seemed to be picking up on certain things and connecting in a weird sort of way, I'm not sure if he felt the same. By now the hairs on my arm were 100's of wriggling worms, but not in an unpleasant way, and the bare trees outside were waving to me! We decided to make a joint and go for a walk, but it never quite happened. We both went exploring upstairs, everything was beautiful and captivating. I felt like a kid who's just discovering stuff for the first time. My friend appeared very child-like to me as he played with stuff in the bathroom. Our trips were very separate from now on.</p><p>I put on 'Legends' by Bob Marley and started to make my way upstairs but everything was getting too much for me and I collapsed at the bottom of the stairs. At this moment I felt very alone and shit scared. I found it very hard to keep my eyes open and I was worried that I would stop breathing. I was now in quite obvious bad trip territory, I felt like I was covered in bugs and my face felt like liquid. I managed to calm myself down as beautiful bright landscapes unfolded behind my eyes. Suddenly almost all the bad feelings disappeared and I slipped into a completely different universe. I was comforted that I could still hear Bob Marley and my friend arsing about upstairs.</p><p>Everything I saw during this part of the trip was really mind blowing and after the CD stopped I had continuous psytrance style music going on in my head. I no longer existed as me, there was nothing except what I was experiencing at the time and varying immensely powerful emotions. I would go through stages of feeling intense contentment to fear to happiness and everything in-between, sometimes at the same time. Each emotion had it's own colour and smell that I would experience. Time warped, sped up and sometimes completely stopped. When I opened my eyes there was an aboriginal man at the end of the corridor with a drum. He had a floating flower in his hand and was offering it to me. It was although he were looking out for me.</p><p>I then went upstairs and collapsed on the stairs again next to my friend. More of the same continued as I slowly slipped down the stairs, my friend was looking out for me and called my name, he was worried because I was very cold and shivering. I could only reply with the odd groan. When I opened my eyes the bathroom light looked like god. I felt like I had the option to slip into a completely white, pure universe but I chose not to. This was enough for me now.</p><p>We then went into my room, I'd finished peaking but I was now getting weird thoughts. Visuals were much less now but each thought would spring off 100's of others. The best way I can describe it is like a factual image that goes on forever but with thoughts. Very mentally tiring. I was sit in front of a massive clock on my wall and it's only then that I realised how much time was dilated. An hour seemed like days. At 1am we decided to go to sleep. I lay in bed for a while thinking then eventually went to sleep.</p><p>I woke at about 8:30 the next morning with a headache but apart from that I couldn't complain. I was still in awe of what happened and I discussed it a bit with my friend. We both decided it was a positive experience but too intense.</p><p>Overall I'm really glad I did it and will probably do it again sometime but with a lower dosage. I'm quite proud of myself to have kept it together in such a weird situation that I wasn't really expecting. I was also surprised that my friend and me did very little interacting after we'd fully come up.</p>",
 "year": "2004",
 "id": "32696",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "2702",
 "dose": {}
}
