{
 "id": 327,
 "title": "Morning Glory...Interesting Experience",
 "date": {
  "submission": "2007-02-25T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Newman",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "6.0",
    "quantity": "6.0"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "seeds"
  }
 ],
 "report": [
  "This turned out to be one of the most interesting expierences of my life.  It was the night of summer slam so me and about 7 other guys went out to BW3 to watch it on paper view.  The place was packed and filled with drunk guys. Looked like fun.  Me and one of my friends got tired of waitng for our food to come so we walked down the plaza to buy ciggerettes.  One of my friends that had come along to buy them since I am 17.  He went in to pay and me and my other friend waited outside.",
  "Out of boredom I happened to look in one of these giant bins they had outside their store.  It was filled with plant and flower seeds.  Not having any recreational drugs or alcohal we decided to steal every package they have.  All in all we got about 12 packages, each containing 1.5 grams of seeds.  My friend is alot bigger then me so he took 8 packages or 12 grams and I took 4 packages or 6 grams.  Now for those of you who don't know much about morning glory it produces LSA, which is a cousin to the infamous LSD.  I had never tripped before so I figured what the hell.\r[Erowid Note: Stealing is harmful to others. Don't do it!]",
  "After we returned to BW3 we showed our friends what we had and commenced taking them. First of All I have NEVER tasted any seeds that were that disgusting. My friend managed to get his all down and I choked mine down after about 20 minutes.  In each bag there are at least a hundred seeds (I dont remember the exact number) and they are small and black and disgusting.  So I took mine and 30 minutes went by and I felt nothing.  My friend took his earlier than me and reported feeling a little quesy but nothing too bad.  I was kinda let down so I went outside to smoke.",
  "I brought out the last 2 or 3 seeds that I had missed and ate them out side.  For some reason I felt like I had one of them stuck in the back of my mouth.  I couldn't get away from that sick taste.  It was over whelming.  I gave up on smoking and went back inside and downed a few cokes. Nothing helped so finally I just accepted it.  The taste wore off after another half hour but then the sickness came.",
  "My stomach felt like it had been stuffed past its limit.  Everything was tight and I thought for sure I would puke my brains out.  Anyway, This got worse and worse for the 3 hours we were there.  For the last 2 hours I felt like I couldn't move. I had the sensation of being at the bottom of a dark tunnel where I could only see out of a little box.  I have been in holes from K before but not like this.",
  "Every now and then a friend would stick his head over the well and ask how I was doing.  I felt dettached from real life.  It finally wore off a little bit and I commenced to drive home somehow.  Me and a buddy drove back to my house which is about 30 minutes away. By the end of the drive I couldn't feel my foot and he had to push on my leg so that we would keep moving. I dont reccomend driving like that.  \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "When I got home I had calmed down and the quesy feeling subsided.  I called a girl I met at a rave and talked with her most of the night.   I was sitting on the counter in my bathroom when I noticed the walls were breathing.  Thats right...breathing...in and out.  I have a picture where the frame was rotating around the picture.  The patters in my carpet and walls were moving all different ways.  I would definatly classify that as the COOL part of the experience. This lasted for almost 7 hours.  All in all a fun expiernce at the end but the first 3-4 hours were HELL. I shit you not, HELL. So I leave the call up to you."
 ],
 "erowid": {
  "id": "10496",
  "citation": " Newman. \"Morning Glory...Interesting Experience: experience with Morning Glory (ID 10496)\". Erowid.org. Feb 25, 2007. erowid.org/exp/10496",
  "substance": "Morning Glory",
  "views": "3955"
 }
}
