{
 "title": "Peaceful -- Nothing Psychedelic, but Peaceful",
 "author": "Riemann Zeta",
 "citation": " Riemann Zeta. \"Peaceful -- Nothing Psychedelic, but Peaceful: experience with 2C-I, Cannabis, Amphetamines & Salvia divinorum (5x extract) (ID 32701)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32701",
 "substance": "2C-I, Cannabis, Amphetamines & Salvia divinorum (5x extract)",
 "bodyweight": "75 kg",
 "report": [
  "<p>I had a particularly interesting experience with 2C-I, amphetamine, cannabinoids and salvia divinorum.  It was a Friday evening, around 20:00 and I was in the mood to chill.  I had some 2C-I that I made earlier in the week, checked with IR spec and proton NMR, relatively confident that it was indeed 2C-I, and a few tablets containing mixed amphetamine salts (generic Adderall, which is 75% d-amphetamine and 25% l-amphetamine--why they put the l-amphetamine in, I will never know).  My girlfriend and I each took ~20 mg of 2C-I at 20:10 and shared a bowl of cannabis.  The cannabinoids took effect nearly instantly, as they usually do, especially notable were the appetite potentiating effects.  Hence, we went to eat dinner and started eating around 21:30.  When we were waiting to be seated, there were no effects, other a lingering post-cannabinoid hunger.",
  "By 21:50, we both started to comment that the lights in the restaurant were far brighter than usual, not the ambient light level, but the lights themselves.  The lights had coronas (shimmering coloured halos).  Also, the individuals around us seemed to be moving very quickly, it was almost as if we experienced relativistic time around our table, that is, we were moving in real time, but far slower than everything around us.  The effects were not overpoweringly psychedelic (no tracers, patterns, hallucinations, etc...), they were, however, quite 'chill' or peaceful.  In fact, the effect was quite similar to 3,4-dimethoxy-substituted amphetamines (MDA, MDMA, MDE), but perhaps not as sentimental and less physical.  2C-I seems like an ideal compound to take when one desires a very mild, laid-back intimate experience.",
  "We soon left for a friend's flat.  We arrived at approximately 23:15 and each took 10 mg of mixed amphetamine salts.  The amphetamines kicked in rather quickly, however, in general, amphetamines do not have a tremendous effect on me, due to my daily antidepressant regiment, which includes Effexor and Wellbutrin, durgs that block the noradrenalin and dopamine transporters, likely attenuating the amphetamine-mediated release of dopamine and NA.  At around 01:00 in the morning, we tried some Salvia Divinorum.  I had tried Salvia once before with absolutely no effect.  My friends had 5x extract, which is what I had tried years before.  I ingested an entire bowl and experience nothing, save the truly heinous taste and acrid taste of salvia smoke.  My friends claimed to experience a sensation of falling backwards, or being 'sucked into the floor.'  One friend started laughing uncontrollably for about 5 minutes, which seems like an uncommon reaction to Salvia.",
  "Overall, it was interesting experience.  The 2C-I was certainly the highlight.  The next morning, there are no ill effects, unlike MDMA (even with fluoxetine/5-hydroxytryptophan neurotoxicity-attenuation treatment) or dextromethorphan (which leaves a bloody intense hangover).  Salvia has once again disappointed me.  Perhaps I simply do not have the right isozyme of Kappa-Opioid receptor (perhaps a point mutation or something?)</p>"
 ],
 "year": "2004",
 "id": "32701",
 "gender": "Male",
 "views": "4722",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 3:05",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 4:50",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "submissionDate": "2007-11-17T08:00:00.000Z"
}
