{
 "id": 3270,
 "title": "Acid is Only $2 a Hit",
 "date": {
  "submission": "2000-06-24T07:00:00.000Z"
 },
 "author": {
  "name": "M. Chase",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "8.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "seeds"
  }
 ],
 "report": [
  "I was out looking for a nice pussy willow to plant in the back yard when I saw them - Heavenly Blue MG seeds, $1.00/2gm pack. What the hell. I bought 6.",
  "I looked up prior postings and decided that 8gm would be a decent dose. I washed the seeds (they look like elongated peppercorns) in a bowl with warm water and a tiny bit of dish soap, then rinsed them well in a strainer. I ate a couple and waited a half hour, to see if there were any surprises - there weren't - so I ground the seeds real fine in a coffee grinder, mixed them with water in a glass, and let is soak for another 1/2 half hour or so.",
  "I drank the liquid, refilled the glass, and waited some more...",
  "Mild effects, minor visuals, mild nausea...",
  "Drank the liquid again. Tasted much stronger this time, sort of like peanuts, sort of like magic mushrooms...",
  "Got progressively more nauseous. Finally used my finger to puke, and puked and puked and puked and lay down on the floor and puked and puked. Awful. Tripping now, too, great fun... I could see how a novice could TOTALLY lose it under these conditions. Nausea didn't feel like nausea anymore, it felt like twitchy anxiety and impending panic, then I'd puke and be totally fine for 5 minutes. (My life became a phrase: PUKE = GOOD).",
  "The trip that followed was actually nice, though - no visuals, but nice emotional experience and a zoomy head. Hardly worth it, however...",
  "An interesting point - an unusual aspect of this was that stimulation was generally unpleasant - I wanted to be in a dark, quite place, with my woman around talking but not touching me. I felt twitchy, and I didn't want to move my head at all. I did the whole trip in bed...",
  "Moral of the story: Acid is only $2.00 a hit."
 ],
 "erowid": {
  "id": "2061",
  "citation": " M. Chase. \"Acid is Only $2 a Hit: experience with Morning Glory Seeds (ID 2061)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2061",
  "substance": "Morning Glory Seeds",
  "views": "14898"
 }
}
