{
 "title": "Mood Elevater My Aunt Fannie",
 "author": "RedJack",
 "citation": " RedJack. \"Mood Elevater My Aunt Fannie: experience with Amitriptyline (ID 32761)\". Erowid.org. Aug 21, 2007. erowid.org/exp/32761",
 "substance": "Amitriptyline",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "oral",
  "Pharms - Amitriptyline",
  "(daily)"
 ],
 "report": "<p>I had been suffering migraines for about a month when my mother finally managed to convince me to go to a doctor. He found nothing that he could determine would cause these attacks and sent me to  neruolgist. This yutz never bothered noticing that I came into regular contact with methyl chloroform at work and decided I was depressed and prescribed these horrid little monsters for my depression.</p><p>Being relatively obedient, I went home to my parents house as my flat was having the bathroom replaced by the landlord. It was a *very* good thing I did go home. I really don't remember much of the next week. About 30 minutes or so after my first dose, I was in my bedroom and the walls and ceiling were 'breathing' like on a low dose acid trip. I heard most sounds as muffled or at a distance. I slept like a rock, and was still drifty the next morning when I took my next dose. This dose made me feel like I was totally encased in a soft glue, I could feel nothing, I could hear very little, and everything was seen as if through an aquarium. I really do not remember the next 4 or 5 days. my mother tells me that she would wake me up every few hours and make me eat or drink something, and lead me to the bathroom. After 6 days of this, she finally called the doctor who said this was *normal* and to double the dosage.</p><p>At this point in time, I wasn't a stranger to certain drugs, I used marijuana socially, would go out drinking with friends from work and had tried acid and mushrooms. I still don't understand how this would help someone who was already depressed. All it seemed to do to me was make me emulate someone in a *serious* depression.</p><p>I might recommend this to someone who was seriously up and agitated from some stimulant if they really needed to ground out fast, but for the casual play I really wouldn't. Until my prescription ran out, I would use 5 mg as a sleeping pill!</p>",
 "year": "1984",
 "id": "32761",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-08-21T07:00:00.000Z",
 "views": "28199",
 "dose": {}
}
