{
 "title": "Driving On A Sphere",
 "author": "newtronSHELL",
 "citation": " newtronSHELL. \"Driving On A Sphere: experience with Salvia divinorum (ID 3277)\". Erowid.org. Dec 24, 2001. erowid.org/exp/3277",
 "substance": "Salvia divinorum",
 "bodyweight": "235 lb",
 "report": "<p>   My friend and I have been into metaphysics and various metasciences for a while now.   I am an avid self explorationist, as is my friend, and use various hallucinogens/dissociatives to achieve higher or altered states of conciousness.   I am an experienced tripper and drug user.  I have taken acid too many times to count, shrooms the same.  Basically, from pharmaceuticals to street drugs, I've done my share.  My friend however has primarily only smoked cannabis, and drank, and has only in the past year really started to show an interest in psychedelics. </p><p> We have been doing a lot of research here, at erowid, when we came across salvia divinorum, and were very intrigued by the information and experiences.  My friend, (we'll call him R,)  decided to order some salvia and see for himself what the hype (if it was indeed hype) was all about.  I myself had read a short paragraph about salvia divinorum on a site which sells herbal alternatives/highs ect, about a year and a half ago, but never paid it any attention.   R found a site selling high potency salvia divinorum from mexico, said to one of the most, if not THE most potent strain (unaltered by chemists that is).  We waited about 2 weeks, conversing periodically on our expectations and new information we'd gathered to share w/ eachother ..   Then, the great powerful Salvia arrived ..  we had no IDEA what we were in for.</p><p> R tried SD b4 me, the day he got it, by chewing the leaves.  His exp lasted roughly 60 minutes and consisted of mild to moderate visual hallucinations, accompanied by audible disstortions....  also, when he closed his eyes, R said he saw things as if he was dreaming them, in full color.   The next day, I went to his house to try it.  R chopped up about 0.5 grams of dried leaves, and put them in my glass handpipe.  We both live w/ our parents and its hard to do much at our homes, and were forced to have my wife drive us around, which pretty much prevented the use of my glass bong.</p><p>R handed me the packed bowl, and I took a few deep breaths, and contemplated roads ahead.....  I lit the bowl, torched it actually, as saliva needs to be heated thouroughly to release the alkaloids.   I sucked and sucked and sucked until I could not fill my lungs with anymore smoke..... almost the entire bowl....  the smoke of SD is very smooth, and I was able to hold it in, in excess of 30 seconds...  I kept holding and holding, wondering if it was going to hit me, when BOOM!!!!  It hit me..  The initial 2-5 seconds were a complete blackout...  after that, I felt as though someone had grabbed my shoulders and pulled backward to the ground...   yet I was sitting straight up in my passenger seat of my car.  I felt as if we were driving on a sphere, always going down, sort of rolling forward in strange summersaults..  terribly large goosebumps developed all over my body as a HOT sensation riddled me.   I felt as if I was attached to my seat by these goosebumps... like tiny harneses.   I also felt a strange but familiar feeling, as if I'd been 'here' b4,  'here' being in the salvia realm.   This state continuted for another 30 seconds tops, then slowly subsided..</p><p>As the main peak left, another, totaly new high immersed me.  I felt as thouygh I had eaten about 1.7 grams of shrooms... you know... not enough to feel a whole lot, but just enough to feel silly, w/ moderate visuals.   I felt really stoned , and everything was weird looking, and color saturated.    The entire exp lasted only 5-10 minutes tops, but was a very strage exp indeed.  On our drive home, I smoked a bowl of cannabis, and noticed that I could still feel the salvia over the cannabis.. In addition, as I looked toward the sky, it appeared very round, dome like (as it really is-- an inverted dome)..  Clouds were bent around this inverted dome.    R and I definately plan to use a LOT more of this wonderful plant.</p>",
 "year": "2000",
 "id": "3277",
 "gender": "Male",
 "timestamp": "2001-12-24T08:00:00.000Z",
 "views": "5730",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.5 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 }
}
