{
 "id": 328,
 "title": "On Random and Chaotic Drug Use",
 "date": {
  "submission": "2000-10-09T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Q.Public"
 },
 "dose": [],
 "report": [
  "I would like to submit this report as an inverse to many... 'I can't get enough' type reports...",
  "I'm 28 years old and I've been using various drugs since about the age of 17.",
  "I started on hash and due to the huge popularity of LSD and E a little while later I tried both and found LSD to be far more interesting and fun...",
  "...for about 4 years from then I was either tripping or E'ing at least once a week from then on. I was smoking hash and grass every day. I also kept down a job in the computer trade for most of this time and only once were drug issues resulting in my leaving employment, (I resigned, I was in London (not my home town) and I was doing a fair bit of acid and at that point I just couldn't put up with the city anymore...)",
  "I must say that drugs have played a part in all of my long-term relationships with the opposite sex and none of these relationships have been very successful and ended badly... however I'm on ok terms with my ex's...",
  "Since about 95 (aged 24) I've been reasonably off of drugs, I don't take acid anymore (I finished it... before it finished me) and I don't do E... they are nothing like they used to be... I do smoke weed but never hash, I take a little cocaine ... very rarely ... and that's about it...",
  "The down side...? Well I'm on anti-depressants now and I believe this is due to a failed romance rather than anything else but I must admit I think I would be a little less susseptible had I not taken LSD, but... well I learned alot from LSD and I think perhaps I still have much to learn that I'd not even be aware of before I took it.",
  "I have tried Heroin a couple of times... once it had no effect perhaps because I was on mushrooms and 'shitloads' of freebased coke and the other time it was, well just fucking horrible. So maybe if you like feeling sick as fuck then its for you... it's not for me.",
  "Before I was 17 I started drinking at 12-13 and by the time I was 17 I was an alcoholic... and I quit when I started smoking hash... the grip of everything since the alchol has been minor...I smoked cigarettes since the age of 9 and now I smoke only in a joint and thats maybe two or three times a day...",
  "Finance...? I have never stolen to buy drugs, never have I had to choose between food or drugs, I have always been able to afford both.",
  "Violence...? I've had mildly violent relationships with my 'ex girlfriends due more to occasional drunkeness than drugs... although I'm not sure if this is me or drugs...",
  "I have mellowed now and this is certainly drug related !",
  "I've had very few violent incidents in my life and as I have only been attacked a couple of times, and none were drug related. Unless being mugged while stoned counts?",
  "I just want to make an account of a fairly normal life while taking various drugs with no major hassles. I may be even thought of as fairly dull... whatever.",
  "The ever present legal situation has led to much thought on the subject and has led me to simply think... who's business is it if I take drugs."
 ],
 "erowid": {
  "id": "105",
  "citation": " Q.Public. \"On Random and Chaotic Drug Use: experience with Various (ID 105)\". Erowid.org. Oct 9, 2000. erowid.org/exp/105",
  "substance": "Various",
  "views": "9541"
 }
}
