{
 "id": 3282,
 "title": "Gloire du Matin (Blue Ciel)",
 "date": {
  "submission": "2000-06-24T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Istvan",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 seeds",
   "administration": "rectal",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  {
   "time": "0",
   "amount": "500 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "<p>Part I",
  "Well after all of the recent talk about Morning Glory, I tried it for the first time. In fact this is really, my first experience with psychedelics, other than grass.",
  "Very Strange. First off, I decided that an appropriate dose would be about 100 seeds. I guess that this would correspond to approximately 100ug LSA. I took the seeds and ground them very fine with my coffee grinder. I remembered that some posts mentioned that nausea, is a common side effect, so I decided to use an enema. Big mistake. I mixed the ground powder with water, and poured the solution into the bag. Something in the seeds swelled up unbelievably, clogging the tube. What a mess. Eventually, I got most of the liquid inside of me, and I will omit the gory details.",
  "Within maybe, five minutes, the tiles in the bathroom began to swim, almost as though my vision didn't like the hard edged lines of the grout. Circular objects didn't present as much of a problem, only anything with a corner. I decided to have a warm bath. I drew the bath and soaked for maybe fifteen minutes.",
  "When I closed my eyes, I found that I was perfectly calm and centered, as if nothing was going on. Then I'd open them up, and everything would look O.K. for a couple of seconds, and then would start to swim. Closing my eyes, would bring me back together again. I lost sense of time, though, and I started to feel very tired. I don't know if it was the MG or the bath, that was making me feel that way.",
  "I lay down on the couch, and sleep rapidly came over me. It was almost as if I couldn't keep my eyes open. I don't remember much after this, except for a small part of the dream which I had.",
  "Towards the end, when I was getting up or preparing to wake up, I was in some type of garden. It was somewhat tropical, but it didn't quite feel natural. Almost as though it was cultivated. All of the normal elements, which I associate with nature were absent. There were no sounds, no feeling of sunlight, no winds. And yet this garden was very dense with plants. It wasn't even as though I was in the garden, I was watching myself in the garden. (It's strange, as I try to write about this, it becomes hazy.) Because, I WAS in the garden?!?!",
  "All in all, a very strange experience, although I only remember a few minutes at the start, and those split seconds before I woke from the dream. The hours in between are gone. Definitely, interesting, though. I felt strange for the rest of the day, and since then have had a couple of days, where I just felt 'right'.",
  "Now for the questions, How can I eliminate whatever material swells up? I've got some of the information on extraction, but chemistry is not my field. Is Robonsol lighter fluid a substitute for ether? I'm not sure if Robonsol is like Zippo or not. (And I'll be damned, if I can figure out what 'ether' is.) or anything about solvents. (If I can't even do a MG extraction, what on earth am I going to do with canary seed.)",
  "Second, is the extraction into ethanol, only to deal with nausea? I guess that an enema eliminates this or am I wrong.",
  "Then as far as the experience itself goes:",
  "Does MG, have a sedating effect. This stuff knocked me out.",
  "Second, what is this entity that's spoken of. Somehow, I could say that there was a definite presence there with me, but I couldn't identify it. Although it did seem that we were communing.",
  "This experience was definitely interesting. Nothing at all like my yoga experiences. And definitely worth repeating.\rPart II",
  "Well, I finally did the morning glory trip. The first time I tried it, I ended up falling asleep, and didn't get the whole expereince. But it left me feeling alive and happy for days afterwards. Now there's any emptiness in my soul. But it's not an emptyness, from using the potion. No, quite the opposite. It's an emptiness, because of what it is that isn't here right now. (Semantics of dubious distinction.)",
  "Let me just say, that I have never had an experience like this. Sure, I've smoked a couple of joints, and tried one or two substances, but this is beyond all description. I took 500 Heavenly blue seeds, ground them up into a fine powder; and did a bit of an extraction. I dried the seed powder, mixed it in a glass with a Jolt and a shot of Vodka. And tried to down as much of it as I could. This stuff is awful tasting.",
  "I drank the potion at 10:00 last night. What a night I've had. it's beyond words. I've practiced yoga for many years now, and I think it really helped me for this experience. By 11:00, I felt strange, but in an unquantifiable way. I'm posting from Canada, and we had our big birthday celebration here yesterday, so I wanted to go out and enjoy myself. I tried to have a bath, but I had forgotten how to. Or more precisely, I just wasn't washing parts of my body by rote. I had to think, of what I was doing. At 12:00, I finally made it out the door.",
  "And then the adventure began...",
  "What an adventure. Bars are an absolutely fascinating place. Who needs a rave. It isn't a time or a space, it's a frame of reference. This was indescribable. I finally understood, Warhol's, statement about everyone's 15 minutes. And I understood about everyone's game. It's amazing how all of the pretence, all of the falsehood melts away. And it's great how you can take someone's energy and build it, or take it and leave it behind. A feeling of sadness can just flood you, and then in a moment it's gone, because you realize it's just a feeling, but ecstasy is different. THAT stays. Call it a real world, where all of the nonsense just disappears.",
  "On the dance floor, the energy was fantastic. The crowd was all up and together because of the Canada day celebration. And the music and the sounds and the lights. (This is all beyond words.) But I heard the sounds of the natives, a chant, but it wasn't; more like a click sound, the sound of everyone who has taken it before. (This is all beyond words.) But I bought, things, and then just left them. It's amazing, that you can just go and give someone money, and then they'll give you something. THIS WAS A REVELATION. Dancing to a remix of the Village People's YMCA, and doing the bump and grind, and chattanooga with everyone on the dance floor. Stripping off my shirt, and having people read my T-Shirt, and having them just get a great smile over their face. 'Life's Short, stay hard,' it said. People would read it, and then look up at me, (I'm very tall), and then they would just get this beautiful smile. Having people dance, is incredible. Especially natives. It's just beyond words.",
  "I got tired after a while, and went and bought some chicken wings. Not to actually eat, mind you. (That would have made me ill.) But just the actual experience. But I did ask the bartender for a couple pieces of lime. The fruit was far more nourishing than anything else. And from there the experience began.",
  "I'll leave out the part about going to the other bar, and seeing more games of a different type. And of the two people who were screwing in their motor home, parked outside of a funeral parlour which was just being built, and of the Masonic temple, with the two dead tree stumps guarding the front entrance. And get to the garden. The garden in the middle of the city. I realized that the key to a garden are the spirits who live there. And how important it is to make a place for them. I stayed in the garden till dawn, feeling the soft earth, give under my every step, the magnetic draw of fallow ground, the dancing of water over the rocks, and the waterfalls. This garden is in the middle of the city, with soaring skyscrapers all around. This little piece of paradise in the middle of the city.",
  "The only thing I can say is wow. Total amazement. I know this all sounds very disjointed, but it's beyond all words.",
  "This post is getting far too long. There is so much to say, And yet words can't possibly do it any justice. If there is any such thing as a cathartic experience, this is it. It's been enough for me to think of reevaluating my entire life.",
  "Do I recommend it to anyone? Well, yes, and no. I think if the time and the mood is right, it will happen. There's no need to go searching for it somewhere else, because happiness, and bliss isn't anywhere else. It's all right here, right under our noses, if we would only stop the nonsense, and listen. 'Stop Making Sense', indeed, 'True Stories' from the twilight zone. And a foro.</p>"
 ],
 "erowid": {
  "id": "2064",
  "citation": " Istvan. \"Gloire du Matin (Blue Ciel): experience with Morning Glory Seeds (ID 2064)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2064",
  "substance": "Morning Glory Seeds",
  "views": "6552"
 }
}
