{
 "title": "Too Much Too Soon",
 "author": "Alex",
 "citation": " Alex. \"Too Much Too Soon: experience with Cannabis (ID 32830)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32830",
 "substance": "Cannabis",
 "bodyweight": "140 lb",
 "report": [
  "<p>Ok so this starts out as a normal night that I'm out with my friends, we are at a condo owned by one of my friend's dad. Me and my other friend, (we'll call him Brandon), had earlier in the night picked up the remnants of an eighth of what I think was skunk. Anyways, it was really potent. So we set up the hooka and started smoking. I was last in line to take hits, so I only managed to get about 5 hits in before everyone was too messed up to remember to hand it to me. So now I'm just sitting in a lawn chair pretty much ok, when my friend does something to make me laugh.",
  "I start to crack up, my mouth is open and I can't stop trying to breathe in. Before I start to really laugh hard my friends tell me to go inside before I make too much noise. This is when the fun goes downhill. As I attempt to stand up, I completely lose my train of thought and presence, and step outside of my mind. All of a sudden I'm standing up, and trying to walk forward without any control or impulse from my mind whatsoever. My body begins to feel this cool tingly sensation all over, and my vision begins to warp. I finally begin to control my body again when I notice that the doorhandle is already in my hand. This scares me and I ask my more experienced friend what was going on. He tells me to shut the hell up cause I was being too loud.",
  "My vision at this point is slowly spiraling around my main focal point and I cannot distinguish between reality or this surreal dream that I am in. I start to ask my friends if I am dreaming, to which they only respond that I'm acting hella stupid and that I need to shut up. I start to get scared that this feeling will not go away so I curl into a little ball and start to cry that I'm stuck like this, in this state of mind where I don't know if I'm really smoking, or really outside, or even really high. My friends manage to get me inside where this really bad trip takes an ok turn. Brandon and I start to have some fun and run around the house randomly.",
  "Once I get back downstairs I start to go down a bad road with this trip. I notice that I cannot feel pain when I number one, run into a wall, number two, fall into the carpet only to notice a slight burning sensation of my face getting a huge rug burn. The feeling of my whole body being drenched in a cooling fluid is now gone, and is replaced by my whole body feeling like I'm swimming. This scares me as I am still unable to distinguish between reality and dreaming.",
  "We all go upstairs where things get even worse. According to one of my friends I was holding something that they wanted so when I refused to give it to them the started to hit me. I went through a little process of logic at this point, as I sat there getting beat up, I thought to myself, 'If I respond with hitting him back, the whole room will blow up with fighting cause these guys are all high, and they might kill me without knowing it.' So I basically sat there getting hit. Generally for the rest of the night I sat there getting hit and made fun of, for not being able to control myself. They kept trying to trick me into thinking there was no air in the room, and that they were talking about me.",
  "Overall, the experience was not a good one. I got beat up, made fun of, found out things about my friends I didn't want to know, and tripped into thinking that I wasn't really there and that I was dreaming. To this very day, I still don't really trust what I am seeing or the memories that I have of that night. To me it seemed just like one large dream, rather a nightmare.</p>"
 ],
 "year": "2004",
 "id": "32830",
 "gender": "Male",
 "views": "2741",
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2007-11-17T08:00:00.000Z"
}
