{
 "title": "Don't Smoke It!",
 "author": "Jason",
 "citation": " Jason. \"Don't Smoke It!: experience with Valerian (ID 32854)\". Erowid.org. Apr 22, 2004. erowid.org/exp/32854",
 "substance": "Valerian",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Valerian",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>Last night, I decided to try smoking valerian root based on the relatively small number of reports I have read about using this method of intake.  The valerian root I used was in powdered form and was emptied out of a 1,600 mg capsule.  The bottle indicated that the capsules contained absolutely no additives whatsoever, just pure valerian.</p><p>I filled a small bowl with the valerian powder (which smelled rather pungent) and sat down, ready for experimentation.  As I drew the flame through the powder, my lungs were filled with a very harsh and bad-tasting smoke, which I couldnt hold in for more than 5 seconds.  I instantly coughed out the hit, despite the fact that I smoke marijuana habitually (just about every day).</p><p>Just to warn you, the smoke smells terrible and one hit can almost instantly stink up an entire room.  I took another hit, this time noticing that the valerian pretty much smoldered instead of burning cleanly.  This hit was smaller and I was able to hold it in for a while.  The bowl was finished and after 5 minutes I was feeling nothing, so I decided to smoke another bowl.</p><p>The second bowl was bigger (even though I never finished it), and I was able to hold in two more good-sized hits.  After finishing the last hit I became slightly lightheaded (probably from the inhalation of such harsh smoke), and decided to stop smoking the nasty substance.  I felt a very slight amount of relaxation, but I have decided that this was probably a placebo-type effect.  I fell asleep about 30 minutes later, at my usual bedtime.</p><p>Overall, I do not suggest smoking valerian root.  In my opinion, valerian is best taken orally, as it is intended to be.  I have achieved great results by orally taking one or two of the 1,600 mg capsules used in this experiment and suggest this to anyone looking to achieve mild relaxation/sedation or a better nights sleep.</p>",
 "year": "2004",
 "id": "32854",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-04-22T07:00:00.000Z",
 "views": "61022",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Valerian",
   "form": "(ground / crushed)"
  }
 ]
}
