{
 "title": "Seeing the Ice Maiden",
 "author": "Blikgoffinix",
 "citation": " Blikgoffinix. \"Seeing the Ice Maiden: experience with Nutmeg (ID 32889)\". Erowid.org. Mar 17, 2007. erowid.org/exp/32889",
 "substance": "Nutmeg",
 "bodyweight": "68 kg",
 "report": "<p>My first nutmeg experience.</p><p>After reading up on nutmeg, I realized that most of the bad experiences have people taking around 20grams in one go or more. Even though it usually takes many a cone to put me on the floor, I decided to play it safe and take only 10 grams (I weigh 68kg). The following is the timeline of my nutmeg experience.</p><p>Wednesday 5pm  Girlfriends mum was away for the week so we decided that trying nutmeg then would be the best time due to its long lasting effects. I ground a pack of 20g whole nutmeg really finely into mortar and pestle. Then I split them into roughly half.</p><p>6pm  I ate 10g of nutmeg. Surprisingly, I didnt find it that hard to stomach. I had the 10 grams without any water. My girlfriend found it disgusting but ate it without much trouble either. We didnt feel sick, so far so good.</p><p>7pm  I had read that nutmeg reduces you incapable of doing anything so I made sure we had everything prepared. Hired out movies, spread out matresses and cushions in the living room and prepared for a quiet night in.</p><p>9:30 pm  I start to feel a slight warm feeling in my head and I slight buzz. Like Ive just had a glass or two of wine. The movie is underway and I suddenly find the tv is very bright.</p><p>10:00 pm  My girlfriend starts getting really quiet so I think its affecting her too. We have the light off and the TV is suddenly very bright. The large living room window faces onto the street and I keep seeing shadows creeping outside. Despite this, they arent scary shadows, they made me feel safe by being inside.</p><p>10:30 pm  Nutmeg hit is in earnest now. I can honestly say, it feels like Ive smoked a lot of strong weed, Im very high. I start to drift off into little day dreams. I see funny cartoons everytime I close my eyes. By now the movie is finished and music is a MUST. I was listening to my stoner compilation and I found out I had the ability to pick out single instruments in the songs and listen to them alone  say just the bass in Spinning Plates by Radiohead (trippy as song). Music is bliss.</p><p>11:30  By now Im so high Im hallucinating and it usually takes something strong to make me hallucinate. My girlfriend changes into an ice statue before my eyes. And then, her eyes glow, like Galadriel from the lord of the rings movie, they glow with an inner light and completely light up the darkened room. I have auditory hallucinations like the sound of phones ringing, but I know its not real.</p><p>Then I have sensory hallucinations  while snuggling, my lass turns into a doll, I feel her become all toy-like and her clothes turn into something furry, like teddy bear fur. The greatest thing was this  I could control my hallucinations. When I was patting her dog, I imagined it to be a lion and then suddenly I was in a forest and I was patting a lion in 14th century england. </p><p>When we were watching Half-baked, during the scene when the guys start floating, I feel like Im on a swinging boat carnival ride. It was then I decided I was in total bliss from nutmeg. I am seeing whatever I imagine, listening to crazy music and hugging a giant teddy toy.</p><p>12:00 am  I suddenly start laughing and drag her upto the computer where we watch weebls-stuff.com. That site with the crazy drugged up cartoons. I laugh like an idiot for hours.</p><p>1:30 am  We go back downstairs and I change the cd. I have chocolate ice cream and have never tasted anything better. I'm still totally high. Everytime I close my eyes, I can see stuff. I can control what I see. My friend calls up and I gibber to him for ages. Then sit back down and just trip out to music. I think it rivals even weed for listening to music, because I dont have to worry about lighting up. I just sit there for ages, tripping.</p><p>By about sometime around 2 or 3 I must drift off to the song Swing Life Away by Rise Against.</p><p>I wake up at 4 in the afternoon, with the worst taste in my mouth. My day has disappeared. I feel like Im really dizzy and my girlfriend will have her friends over for me to meet. First impression lasts and I look like I just got up out of the gutter. But it was worth it. Overall, I enjoyed my nutmeg experience, though I was pissed off cos I just lost a day afterwards.</p>",
 "year": "2004",
 "id": "32889",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-17T07:00:00.000Z",
 "views": "10754",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 }
}
