{
 "title": "Cosmic Joke on Me",
 "author": "Yrm0m",
 "citation": " Yrm0m. \"Cosmic Joke on Me: experience with Syrian Rue (ID 32905)\". Erowid.org. Mar 12, 2008. erowid.org/exp/32905",
 "substance": "Syrian Rue",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "11 g",
  "oral",
  "Syrian Rue",
  "(tea)"
 ],
 "report": "<p>This little journey started out simply enough.  I walked to my friends house, because he said i could take some ayahuasca while he was out of town.  One of his roomates is there, bored, and wants to take some as well.  I grab the bag labeled syrian rue, and another bag labeled mimosa hostilis.  We take these to my apartment, weigh out 6 grams of rue seeds and 17 grams of what was in the mimosa bag *wink*.  I cook it up with water and lemon juice and it takes a long time like always. Three cycles of extracting, straining and re extracting.</p><p>Once its done and steamed down to a drinkable amount, we down the stuff, and it tastes HORRIBLE.  We both nearly vomit taking the last drink.  I feel a bit nauseous just typing about it.  He leaves, as we both like to trip alone, and i smoke a one hit.  The phone rings, and its the friend who owned all of this stuff.  I told him i took some and left him $5 in his room.  He says 'what?...i don't have any mimosa left...'.  But what about the stuff in the mimosa bag?  It is ground up syrian rue.  Joy.</p><p>I called the friend i took it with and told him what was up, and that we weren't going to trip, and to bring me my five bucks.  Before this i was not aware that harmala was active on its own.  By the time he gets here, we are both rather high, looking like drunkards trying to walk around.  The body buzz is the most intense i have ever encountered, and i was blown away by the tracers.  He left and i laid down on the floor, because walking around was making me sick.  Music was awesome, not much in the was of cev's, but massive amounts of chakra energy.  After a while i feel better and stand up, fall down, and stand up again.  Every time i move my head white outlines of everything trail behind and sway around.  I feel 50 lbs heavier and extremely tired, so i go to sleep.</p><p>I have some of the crazies dreams ever, and wake up completely drained of energy.  It has taken all day and some caffiene to get any amount of energy back, and 14 hours after dosing i am just now feeling semi normal.</p><p>The experience was not bad overall, but i will never repeat it, the nausea is overpowering.</p>",
 "year": "2004",
 "id": "32905",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-12T07:00:00.000Z",
 "views": "3353",
 "dose": {}
}
