{
 "title": "Better than E? MaybE",
 "author": "Trancer",
 "citation": " Trancer. \"Better than E? MaybE: experience with 5-MeO-DiPT & 5-MeO-AMT (ID 32915)\". Erowid.org. Nov 27, 2005. erowid.org/exp/32915",
 "substance": "5-MeO-DiPT & 5-MeO-AMT",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "7.0 mg",
  "insufflated",
  "5-MeO-DiPT",
  "(powder / crystals)",
  "",
  "3.0 mg",
  "insufflated",
  "5-MeO-AMT",
  "(powder / crystals)"
 ],
 "report": "<p>I am writing this mostly because I have seen few or no reports of the Foxy and 5 MEO AMT combination which I have found to be excellent. The idea came from the fact that the mental and body feelings from 5 MEO DIPT were incredible but there was no connection to music, but there was with 5 MEO AMT. So I decided to combine the 2 and see what came out of it. This is more a summary of the trips I have had on these substances rather than just one. I have tried this combination in various settings (meditation, trance parties, at home etc...) and found it to be beneficial in all.</p><p>The first time was at an outdoor party. 7mg 5 MEO DIPT  and 3mg 5 MEO AMT insuffulated (note I would NEVER take any more than this, I have split this amount in half and had one of the most intense experiences of my life dancing for 9 hours).  The onset was extremely quick and uncomfortable, about 10 minutes. I immediately had to vomit (which I always do with this combo) and the high was increased dramatically afterwards and became very pleasant. The vomiting I believe comes from a build of up energy in my stomach which leads to the discomfort and is helped in the purging, I think if I can work with the energy without vomiting it can be very beneficial.</p><p>The overall feeling of these substances is very hard to describe but is different from each by itself. During my first experience I danced for 5 hours non stop with incredible energy, as did 3 of my friends who took it. It was as if the music was not good enough, no matter how hard or loud we wanted more. Needless to say everyone else at the party was on E and they could not keep up with us even when they were peaking and long after they had come down and chilled out we were still on the floor. The body feeling was similar to MDMA (due to the Foxy) but the overall experience was much more intense. It is something that can only be experienced. Visually I was getting geometric patterns from the wall and mountains twisting and turning and sometimes flying at me. A superhuman ability to drink everything including alcohol (I am not a drinker though) was bestowed upon me. By sunrise we were still going strong not to mention the fact that we had been laughing and smiling all night long and it was only us that could truly understand why. There was an overwhelming feeling of wellbeing and that everything was right. I also liked it because I could interact with everyone in an intellectual and sober manner (no one knew I was altered) unlike E where I act like a child and everything is pretty and everybody's my best friend until I am not high anymore.</p><p>Sunrise was incredible and I didnt want the party to end, but it did and I went home and listened to music until after about 15 hours since the dose I feel asleep and woke up the next day feeling great and positive. Afterwards everyone felt that this was better than E and certainly lasted longer with no hangover the next day (just sore legs from dancing). Since then it has been tried all over the world by various races and nationalities most of whom say it is one of the best substances they have ever tried.</p><p>But as a warning I must say this combo is VERY strong the two substances multiply each other, the less I take the better off I are. I once danced for 7 hours at a party in GOA (3.5 grams foxy, 1.5 5 MEO AMT) and didnt want to stop, it was only that I realized it was unhealthy so I took a break only to come back and dance for 2 more hours!</p>",
 "year": "2004",
 "id": "32915",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-27T08:00:00.000Z",
 "views": "7229",
 "dose": {}
}
