{
 "title": "Worth it in the End",
 "author": "Morning glory",
 "citation": " Morning glory. \"Worth it in the End: experience with Morning Glory & Cannabis (ID 32920)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32920",
 "substance": "Morning Glory & Cannabis",
 "bodyweight": "100 lb",
 "report": "<p>A friend of mine informed me of the trip he took last week on morning glory seeds.  It didn't sound too great, bloating, pain, nausea, but I decided to try it anyway.  We dosed about 9:30 pm.  I was nervous at first.  We rinsed the seeds, and then just chewed them up really well.  They tasted like water.  When I was chewing the last few, they started to take on a bitter taste, but nothing unbearable.  We also drank some ginger tea to aid with digestive side affects.  I believe it helped because I never got bloated or abdominal pains. I was warned of the onset of nausea and told smoking a bowl would help.  But I couldn't get there quick enough.</p><p>After 20 minutes, I could feel the seeds start to digest and felt the nausea.  I grabbed some Led Zeppelin and a pipe and headed for my bedroom.  But I puked on the way there.  However, I instantly felt better.  I smoked and felt even better as I waited to see if I would trip. In about an hour, I was feeling glorious.  I never hallucinated, but I did hear some knocking occasionally.  The friend I tripped with held his seeds and did hallucinate. </p><p>As my trip started rolling, I felt like hanging out with only one or two people.  My roommates were drinking loudly upstairs, in an undesirable atmosphere.  As I sat in my room (below the living room) I decided I didn't care what was going on upstairs, because I was content in my own world.  Looking at some wood paneling, I did see a bit of shape shifting, but nothing like a mushroom or LSD trip.  My trip was more of  a mind trip.  Content in my world, but welcome to (drunk) visitors.  After about 2-3 hours, I was getting rather lethargic.  Leaning against the wall, and eventually finding most comfort in my bed.  I was still aware and able to hold conversations. </p><p>Around 2am, I decided I couldn't keep my eyes open any longer.  So I kicked my tripping friend out, who went to see if anything is on PBS at 2am, and got comfy.  I drifted in and out of conciousness for many hours, not really sleeping at all. but I still felt great. It just felt really good to lay there thinking/dreaming with my eyes closed in the dark.  I looked at my watch about 7:30am and finally slept.</p><p>I had to get up at 8:30 for work.  It wasn't too hard to get motivated to ride my bike to work.  Around noon, my lack of sleep really caught up with me. After work, I slept for three hours and felt great.  I am a cig smoker, but it never appealed to me until I went to work.  I didn't eat during the trip, but right before I did.  I don't know how to avert the nausea and puking, but pot did it for my friend. It definitely helps, or at least doesn't make it worse. all in all, It was worth it. I may try it again in a couple of months, but better prepared, like smoking a bowl right after I take the seeds.</p>",
 "year": "2004",
 "id": "32920",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-11-17T08:00:00.000Z",
 "views": "2920",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "190 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  "1": {
   "time": " T+ 0:20",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
