{
 "title": "Mellow",
 "author": "4-FMP",
 "citation": " 4-FMP. \"Mellow: experience with 4-Fluoroamphetamine (ID 33005)\". Erowid.org. Apr 23, 2004. erowid.org/exp/33005",
 "substance": "4-Fluoroamphetamine",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "",
   "125 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I was alone in the basement in northern Scandinavia. It was mid-winter and I was coming to terms with being single again. Fairly lonely, I suppose, but not miserable and just bored for something to do. The nearest neighbour was half a mile down the road, the snow was almost 3 feet deep and the sky crystal clear with sparkling stars though snow forecast. As always, I took a few notes and write down what I had taken (just in case).</p><p>After a several glasses of red wine, I decided to take the stuff (orally). It was from a good supplier and had a not unpleasant lemony-chemical taste that dissolved easily on the tongue. It was just after 7:00 PM.</p><p>I could detect something within 10 minutes but it took 1 hour for the full effects to come on. Very alert and happy with mild grinding of teeth. With more red wine, a very pleasant euphoria developed and I chatted online for hours. I never felt as edgy as with speed and it felt almost like mild MDMA. It started snowing slightly in bone dry air, and I spent hours watching the beautiful flakes land and then evaporate.</p><p>I didn't feel at all sleepy or washed out, as I do after speed or E and carried on all night. Went to get my hair cut the next afternoon and felt very positive and fine - was chatting with everyone, didn't seem to look odd in the mirror. Next evening, early night and slept like a log. No comedown the next day, even felt better than normal.</p><p>Summary</p><p>Seems milder and longer lasting than speed. I got no unpleasant come-down afterwards. Will certainly try again, if I get the chance. I didn't have my blood pressure meter with me, but didn't seem to go particularly high.</p><p>------</p><p>Clovis</p>",
 "year": "2004",
 "id": "33005",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-04-23T07:00:00.000Z",
 "views": "24046",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ]
}
