{
 "title": "Holy & Blissful",
 "author": "'Popgirl' 23",
 "citation": " 'Popgirl' 23. \"Holy & Blissful: experience with Mushrooms - P. cubensis (ID 33000)\". Erowid.org. Nov 17, 2007. erowid.org/exp/33000",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "report": "<p>I have always been a bit leary of the mushroom trip. After 12+ years of exploring the inner territories utilising all sorts of natural and man-made enthoegens, P. Cubensis has always shown me my most difficult times, even more so than many of the rougher-feeling chemicals, including 5meo-dmt & DOM. Not so much any physical side-effects, more like issues accepting the realities that mushrooms presented. Some examples might be that I would have a hard time tripping with my male friends due to feeling a great need to mate (hahahaha) and not wanting to create akward scenarios, or always doing this in party situations that led to stiffled trips, or being with attention grabbers which just annoy me. This past weekend however was nothing but positive. A very good friend of mine spent the winter months perfecting his home cultivating technique. In very short time he had grown a considerable amount of fresh Cubensis for distribution amongst his friends, including myself. So, last sunday night I decided to give this substance another try.</p><p>Over the past year I had acquired a morning coffee habit and has been drinking alcohol a bit excessively. I had been weaning myself off these nasty things for the previous month or so and had just finished a week of raw foods, juices, herbs and internal cleanings. I had also been more involved with my yoga and was re-attaining some of the higher levels I had reached in my youth. Things were looking up. So Sunday night about 9pm I had walked to the grocery store for some breakfast granola. As I was standing in the parking lot I decided right then and there was a good time to trip. I had the next day free, it was finally warm outside (it was april) and my energy level was up. Walking across the parking lot I consumed about 1 and a half to 2 grams of fresh P. Cubensis. Yum yum.</p><p>Across the street, there is a small bay called simply 'Back Bay' and there is a 3-4 mile walking path around it thats used during the day by joggers and families. Being sunday night it was deserted. Perfect! This walkway has mile markers marked off in increments of 1/4 mile. By the first 1/4 mile marker I was already feeling a bit 'sparkly'. Mind you, this is not even 10 minutes into the walk. My friend told me this stuff was good but this is very promising! By the 3/4 mile marker I was definitely tripping. Amazing. I sat down on a bench and as soon as I did I felt the body waves that I always associated with mushrooms. The city was across the bay all lit up and the clouds were beginning to glow. The sound of cars driving by had an echo and I knew the real deal was starting to hit me.</p><p>My mind had been wrapped around my detox for several weeks and a lot of the trip's head stuff seemed to be about concluding the experience. I felt wide open to the energy of the universe and was very happy to enjoy the visuals I was seeing. The clouds were pulsing with light. The city was alive. The water at my feet was alive. The trees were budding. It was spring and everything was happy and alive. I thought about shamans and ancient people who ate mushrooms and started seeing closed eye visuals reminiscient of ancient aztec civilization.</p><p>I decided it would be better for me to keep walking or else I would just get stuck sitting there all night. Only the first 30 seconds of getting up did I have any negative feelings. When I stood up and took a few steps, my equilibrium was way off. I felt as if I would fall over backwards. For a few moments I second guessed my decision to eat the mushrooms and became worried that I would become 'that girl', the girl who gets fucked up, runs through the street naked or something and winds up in the hospital or worse. Fuck it, whats done is done, this is what I wanted so I should be grateful. That seemed to work and the bad feeling were quickly replaced by what I have called 'Holy & Blissful'.</p><p>Those two words became my mantra for the rest of the trip. The rest of that path was a magikal adventure. The weather had become more intense from strong winds and only added to the drama already going on in my head. I imagined that I could feel my DNA talking to my consciousness via the buzz-saw sound in my ears. That I was tapping into my human collective memories via my visions. That I was re-charging my cells from all the damage I had done over the years via walking and breathing heavy. I was filled with total joy and amazed at how high I was, yet actually enjoying mushrooms. I felt I had crossed a big hurdle and was proud.</p><p>Near the end of the path, it joins a second path that runs along the water near my place. Here, the weather was more calm and a sudden quiet overcame me. I felt like I was deflating and relaxing after my adventure. I sat near a graffitti wall and drank some water. The wall was so cool. There was fresh paint and some beautiful artwork done by the local kids. I spent a good deal of time staring at the wall allowing myself to get sucked into it. I used to do some graffitti as a youngin and I just love to see it when I'm tripping. At this point I was probably about an hour and a half after ingesting the shrooms. Nearby, there is a shrine dedicated to some kids who had died in a tragic car accident. I spent a moment reading the poems and reflecting on the nature of death. Just recently a previous acquaintance died so this was an appropriate moment to think of him and send a prayer into the winds. A shame for young lives to leave us so soon. Again, I was grateful to all beings for being allowed this time to experience the universal bliss.</p><p>A mile or so later, closer to my place I climbed the hill to my street and laid on the grass in the dark behind a statue. I needed a few moments longer still to get my shit together before navigating neighborhood streets and potential run-ins with random people. After the past several hours on my own (my prefered method of tripping) I spent some time thanking various people in my life, praying for peace, and generally giving myself an attitude check. For me, this is my reason for doing this. Its a chance to reset the switches and recharge the spirit. Its such a shame that the powers in charge are not able to see and understand the potential for allowing human kind to have psychedelic experiences. To think what we could accomplish if there was a sanctioned means to experience this!</p><p>Warm thoughts of my friends at home finally get me to my feet and back safe to my place. There they are sitting on a bed doing tarot cards. They all knew I was high and cracked jokes making me smile. As I changed into warm PJ's, made some tea and enjoyed the last of the undulating carpet patterns. I was grateful for being who I am, for having the friends that I do, and for seeing the next steps to take in the path of life. No weirdness, no bad feelings, all good. I can now say that the mushroom is an ally.</p>",
 "year": "2004",
 "id": "33000",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-11-17T08:00:00.000Z",
 "views": "2630"
}
