{
 "title": "In The Depths of an Ether Binge",
 "author": "FlowGnome",
 "citation": " FlowGnome. \"In The Depths of an Ether Binge: experience with Diethyl Ether (ID 3302)\". Erowid.org. Oct 20, 2000. erowid.org/exp/3302",
 "substance": "Diethyl Ether",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  " ",
  "inhaled",
  "Ether",
  "(gas)"
 ],
 "report": "<p></p><p>'There is nothing in the world more helpless and irresponsible and depraved than a man in the depths of an ether binge.'</p><p>                 -Hunter S. Thompson</p><p></p><p>I never quite understood that quote until tonight.  I type this with great difficulty and continuous spelling corrections, because I am still somewhat under the influence of the devil ether.  Also note while reading this report that I am a person who prefers psychedelics over alcohol and other drugs:</p><p>The binge started at a party at around 11:00.  2 others joined me, and we inhaled from a rag for about 5 minutes.  We returned to the normal drunken crowd of the party and were greeted with cheers of 'My god what the fuck is that smell, it smells like ammonia!'.  I decided it would be a GoodThing(tm) to leave the general crowd and chill outside for a while.  I went outside and one person came with and we hit the ether for about another 15 minutes straight.  Next, a few friends saw what was available and joined us.  The next thing I knew (literally), a circle of 10 had formed and was taking turns with the stuff. </p><p>I continued with them for the whole time, 2 hours total, and was proclaimed a hero by many, and became progressively more intoxicated as the night went on. </p><p>I understand the quote now, because the only urges to stop came at the beginning, and were replaced by stronger urges to do more.  There was no thought at all the rest of the night that I was doing something stupid or that I should stop.  VERY dangerous and addictive stuff, and not something I'd like to have around me very often.  I believe the large circle prevented me from doing too much more than anything, and that I probably would have fully anethesized myself if given the chance.  A total loss of inhibitions was noted as well, and an extreme amount of energy considering the nature of the substance. </p><p>Will I do it again?  Probably, but then again I am still feeling it and wanting more, so this opinion will likely change in the morning.</p><p>Be careful with ether...</p>",
 "year": "2000",
 "id": "3302",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-20T07:00:00.000Z",
 "views": "66813",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(gas)"
  }
 }
}
