{
 "title": "'2C-AMT', Physically Taxing",
 "author": "shimmer",
 "citation": " shimmer. \"'2C-AMT', Physically Taxing: experience with 2C-P & Cannabis (ID 33047)\". Erowid.org. Apr 23, 2004. erowid.org/exp/33047",
 "substance": "2C-P & Cannabis",
 "bodyweight": "63 kg",
 "header": [
  [
   "DOSE:",
   "7.0 mg",
   "oral",
   "2C-P",
   "(liquid)"
  ]
 ],
 "report": "<p>I had the opportunity to sample some 2C-P my friend had obtained a while ago.</p><p>I won't bother to list here all the drugs I've tried, but from the 2C-family I've sampled 2C-B, 2C-C, 2C-D (which is the best in my opinion), 2C-E, 2C-I, 2C-T-4, 2C-T-7, 2C-T-21 and now also 2C-P.</p><p>100mg of 2C-P was diluted in 100ml of distilled water. I had read that 2C-P comes on very gradually and lasts a long time, so I decided to ingest 7ml of the nearly tasteless liquid early at about 4pm, hoping that it wouldn't ruin my night's sleep. My stomach was empty at the time, and I ate immediately after downing the dose.</p><p>I was on a good mood, well rested and fed. My friend and I had planned to go to a park to hang out with other people and smoke some pot etc.</p><p>The 2C-P took a really long time to develop its effects. The early sensations consisted mainly of tenseness and confusion, but the coming on was still very bearable...or at least it felt like it about 2 hours after taking the dose.</p><p>My teeth were grinding, and there seemed to be a constant vibration inside me. I was literally trembling. Most 2C-chemicals also cause this effect but this was the mother of them all. There was no severe nausea, I didn't throw up or anything, but the trembling made me feel quite uncomfortable. The psychedelic effects had started, and the trees at the park were swirling quite beautifully. However, I also felt confused and the tenseness made my head ache a bit. The physical symptoms also made me feel a bit helpless. No appetite.</p><p>When T+5h had been achieved, I felt like I had probably plateau'd. I was amazed how long lived and gradual this substance was. The visual anomalies felt quite identical to most other 2C-chemicals I've tried. Hard to describe though, 'swirly, dotty, detailed circuit patterns'. Nothing extremely fancy though, at least not this time. The body load was still there, I was trembling and feeling very tense, my muscles felt very tired, jaw clench made talking difficult, and I had some cardiovascular effects (my limbs seemed to get numb every now and then). No appetite.</p><p>At T+10h, I felt very worn out. This drug is physically very taxing, at least it was for me. Though it may be attributed to the lack of food intake during the experience, because I simply felt no appetite at all, and my stomach was too tense to even think about eating. I also had to urinate very frequently during the experience, but I drank enough water to avoid dehydration.</p><p>I finally went to sleep at T+12h, after eating a bowl of rice and taking a magnesium pill, and slept quite poorly because my body ached all over.</p><p>In conclusion, I would say that 2C-P reminds me very much of AMT. Its duration is quite similar, and I consider AMT to be equally rough on the body, though AMT might be more rewarding on behalf of the psychedelic effects. This was an interesting substance to try out, but I doubt that I will take it again.</p><p>Peace.</p>",
 "year": "2004",
 "id": "33047",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-04-23T07:00:00.000Z",
 "views": "16783",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7.0 mg",
   "administration": "oral",
   "substance": "2C-P",
   "form": "(liquid)"
  }
 ]
}
