{
 "title": "Mediochre",
 "author": "Nutcracker",
 "citation": " Nutcracker. \"Mediochre: experience with Nutmeg (ID 33055)\". Erowid.org. Nov 7, 2007. erowid.org/exp/33055",
 "substance": "Nutmeg",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "14 g",
   "oral",
   "Nutmeg",
   "(liquid)"
  ]
 ],
 "report": "<p>I heard about nutmeg and thought I'd give it a whirl alongside a few trusted companions. We had read up extensively on it and I think the most notable thing we took away from our research was that it has an atrocious taste and highly oily nature. Before we embarked on the experience we chatted with several people about what we'd be doing and someone suggested we try incorporating lemons into our preparation, as the acid in lemons would go a long way toward cutting the oil in the nutmeg. It was a great suggestion. We bought fresh nuts and then threw them into the blender along with fresh lemons and sugar.</p><p>We had heard a 'full' dosage was about 1 gram per 10 lbs of body weight. Being the first time and all, and knowing some of the very powerful and potentially unpleasant effects of myristic acid, we chilled and did about a 2/3 dosage or so. Anyway, blending the nuts with the lemons and sugar was fantastic, considering the alternatives. I think the oily quality of the nutmeg (especially the fresh nut) is what keeps that shit taste in your mouth and starts you on your trip feeling like shit, which of course is never good. But the lemons really killed the oil and it was like lemonade but kinda shitty, but tolerable.</p><p>We drank it down and within a few hours was real messed up but in a good way. Several hours later got real spaced and tripped out to medeski martin and wood. Only complaint is real bad shits and stomach problems for several days, and also that I felt real high, burnt out and generally stupid for 2-3 days after the bulk of the 'trip.' Also felt very paranoid and anxious for those days. It was fucked. Good experience overall, not entirely sure if I'd really do it again, since there are better and less unpleasant things out there to do. I would however try maybe 1/4 dosage, I think that'd probably leave me feeling kind of giddy and high but probably without most of the long lasting effects.</p>",
 "year": "2003",
 "id": "33055",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-07T08:00:00.000Z",
 "views": "8666",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(liquid)"
  }
 ]
}
