{
 "title": "Entering the Dream Realm",
 "author": "Treefingers",
 "citation": " Treefingers. \"Entering the Dream Realm: experience with 4-Ho-DiPT (ID 33098)\". Erowid.org. Jun 4, 2004. erowid.org/exp/33098",
 "substance": "4-Ho-DiPT",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "20 mg",
  "oral",
  "4-HO-DiPT",
  "(powder / crystals)"
 ],
 "report": "<p>It was Spring Break and I was eager to try yet another one of Shulgins creations.  Iprocin, also known as 4-HO-DiPT, has interested me or quite a while now, and I was excited about the nights trip. </p><p>I decided upon 20mg for my dose.  Its the highest dose listed in TiHKAL, but many people have been using it in much higher doses, and since I was in the mood for a rather intense trip I thought that 20mg would be a good starter dose for this evening.  I was going to be tripping by myself in my room.  I set up a music playlist on my computer consisting of Portishead, and then mentally prepared myself with a few minutes of meditation.  I tried to clear my head of any anxieties that may have been lingering from my last grueling quarter of school and prepare to take the most out of this trip as possible.</p><p>I measured out my dose and mixed it with some coke.  The taste was noticeable but not nearly as bitter as some of the phenethylamines that I have tried recently.  Amazingly enough, within fifteen minutes I was already beginning to feel the Iprocin take effect.  It felt very similar to my first few mushroom trips.  It began with a pleasant and euphoric body sensation.  I began to laugh as I realized that I was beginning to trip, something that I had not done for a couple years now.  When I first began using psychedelics it was always a pleasant surprise to begin feeling the drugs, but this has diminished in recent times, and I was very pleased that this new chemical was making me feel like a kid again. </p><p>I set my preset music on a loop, turned down the lights, and lay in bed.  I thought that this environment would provide the best experience, and as the trip progressed this proved to be right.</p><p>At the 45 minute point I was tripping very hard, but it was strange as the experience felt very gentle at the same time.  It was still very shroom-like, but without the harsh edge that accompany my stronger mushroom journeys.  I knew inherently that this was a powerful chemical, but it was devoid of any anxiety.  It also felt more in the body than mushrooms usually do, and while mushrooms have a very organic feel, Iprocin seemed to have a technical and mechanical edge to it.</p><p>I lay back in by bed, admiring the visuals.  OEVs were present but not very impressive.  They consisted of mainly colorful blobs that would morph in a very lava-lamp kind of way along with some visual distortions.  CEVs on the other hand, were quite impressive.  With my eyes closed I was awash within colorful fractals that seemed to surround me.  An interesting note, I also noticed profound visions, something that had only happened to me on higher dose mushroom trips.  I would suddenly see incredible images in my mind, they were rather interesting, and took up much of my attention.</p><p>Portisheads music seemed to be taking over my consciousness.  The singers beautiful lines seemed to be guiding me on a journey.  I had the distinct impression that I was in the womb, and I have taken with me the sadness of the world.  I must carry this burden.  Slowly I am released. </p><p>The fact that I had taken a drug had left me at this point.  I was lost within my bed, tossing within the confines of my mind.  Suddenly, I realize where I am.  My visions have now overcome my senses, and I am within my dreams.  I have recurring dreams, and over time they have gotten to seem more and more real.  In these dreams I am always within the same place, it is somewhere in the future.  I know that I am a visitor in this strange realm, and while it seems to be normal on the surface, I know that there is a hidden menacing quality to this domain, and I am now there.  The same fear that consumes my dreams is upon me, and I try and cast it off.  I know that there is something that I must gain from this experience.  I know that I am running from something, but from what I dont know. </p><p>I study the landscape.  There are apartment buildings surrounding me.  Theres a park across the street.  This all reminds me very much of my childhood growing up in Tokyo, but something is very wrong.  The entire city seems to be devoid of people, but not only people, it seems to be devoid of all life.  But everything looks so clean and well-kept...I know...when I close my eyes, there is an instant between the time that my eyes are closed and open, and it is in the instant that I can see the environment as it really is.  The buildings are demolished, the ground is covered in rubble and a stench fills the air.</p><p>This is too much.  I open my eyes, this realitys eyes, and wrench myself from the experience.  I am back within my room, but upon closing my eyes again I realize that I can return to the same dream realm that I ran from.  I feel as though I am in limbo, and can travel between these two separate existences.  My dreams are real.  Somewhere my dream reality is not just a dream reality.  It is as real as this one that I live in now.  And not only is this dream realm real, something important is happening in it, and theres something that I must do.  This knowledge bowls me over, and I am much too frightened to visit my dreams again.  I instead try and ground myself by watching Family Guy DVDs.  How can this be true?  There is no rational explanation for this all, but deep down I know that my dreams are just another wavelength that Im usually not tuned in to.  I know that it exists simultaneously with this one, and I know that with work I will probably be able to visit this new realm at will.</p><p>I am strongly reminded of the Shamans power to visit the spirit realm, and I wonder if this is what I have discovered.  Three hours after ingesting the Iprocin, the experience is largely over, and I am left with much to ponder.  Iprocin seems to be a powerful tool, and I believe that I will come to gain a great relationship with this sacrament.  Could it be a portal to the Dream Realm?</p>",
 "year": "2004",
 "id": "33098",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-06-04T07:00:00.000Z",
 "views": "11473",
 "dose": {}
}
