{
 "title": "Corrosion of Coricidin",
 "author": "DisqoDolly",
 "citation": " DisqoDolly. \"Corrosion of Coricidin: experience with DXM (with CPM) (ID 3310)\". Erowid.org. Dec 24, 2001. erowid.org/exp/3310",
 "substance": "DXM (with CPM)",
 "bodyweight": "103 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "DXM",
   "(pill / tablet)",
   "",
   " ",
   "oral",
   "Chlorpheniramine Maleate",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]</p><p>I took dex (1/2 a box of Coricidin) last night at a friday the thirteenth party with a friend.  Everyone said that it was an ok drug and so I thought it would be ok.  And I didnt think it could be so bad cause it was cough and cold medicine.  I had never robotripped or anything before. </p><p>Well I took it and at first I was fine, I had a margarita before I took the pills but I didnt worry about it, stupid me.  I got so confused and I just knew I would die.  I could feel my body deteriorating.  It was horrible.  And to make it worse I knew about my best friend taking it too and I couldnt find her.  Some guy had taken her to her car and made sure she was ok.  I was with a guy, a really good friend, and I like him a lot.  He tried to take care of me for a little while.  I was so confused and I couldnt breathe.  I caught myself so many times not breathing.  My blood was freezing and I could feel it thru my skin.  I could not keep warm.  Then I would get this overwhelming sense of hot.  It was like I kept going in and out of this trip, but it wasnt good at all.  I only wanted it to leave me alone. </p><p>I kept crying and going crazy so I went and lied down in a bedroom and I felt I had to go to the bathroom really bad.  I went and it was horrible.  Everything that came out was like a boiling liquid.  I was so scared. My stomach hurt so bad.  I locked the door and took a bath, I felt a little better but I was so nauseous I couldnt see straight.  Literally.  I had no sense of direction and I felt I was away from myself like when I went in and out of the trip when I was out I felt fine and I could think but I still knew I would die.  When I went back into it I went to the bathroom and let myself do what my body had to do which was shit out a lot of liquid nasty stuff.  It was kind of like vomiting out of your ass but the stuff was so hot.  I had a very high fever and I couldnt take it. </p><p>I decided to try to sleep and I tried but I kept coming in and out of this trip.  I kept falling into sleep but I would catch myself not breathing so I woke up and made myself breath.  I was also on prescription depression drugs and no one told me about it...I thought I was going crazy. I was so out of control I had lost it.  I knew I wouldnt wake up, so I let myself go.  I knew I wouldnt live no matter what so I just let it go... I cried and cried, but I finally fell asleep and I woke up early this morning and had my friend bring me home and I am babysitting while I am writing this...I will never do that shit again. And I am thankful for my life.  And my best friends... Well I scared myself and everyone else last night.</p>",
 "year": "2000",
 "id": "3310",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-12-24T08:00:00.000Z",
 "views": "39097",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ]
}
