{
 "title": "Three Eyes",
 "author": "Deadalus",
 "citation": " Deadalus. \"Three Eyes: experience with Mushrooms (ID 33111)\". Erowid.org. Jun 21, 2007. erowid.org/exp/33111",
 "substance": "Mushrooms",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "6.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>Let me set the stage, with regards to the storytellers. I am in my 40's, and have been an avid psychonaut since the early 70's. LSD was always my favorite psychedelic, and I have taken many heroic doses over the years. I always considered mushrooms a lightweight substance compared to acid. I don't trip as much as I used to for a couple of reasons. First off, as I get older, the sources for these substances are fewer, I just don't run with a druggie crowd anymore. And second, as I get older, the opportunity to trip in an ideal setting just doesn't happen much, between family, kids and work.</p><p>Recently, I had an opportunity to get some 'shrooms, and decided to try and take a good sized dose at a music festival, where I had my own camping spot. Taking larger does of mushrooms has always been difficult because of the grossness of eating the darn things. It's torture for me to down one 1/8 ounce, not to mention 2 of them, so I tried a simple method: put them in a coffee grinder, which reduced them instantly to a fine powder, which I mixed with some chocolate milk, and drank the mix in seconds. Piece of cake! Right after I drank it, I went out and about and chatted with various friends, who did not know I had dosed.</p><p>They started coming on in minutes. Within 15 minutes it was coming on pretty strong, but since it was after dark, I hung around a little longer until the headrushes became so strong I knew I needed some time to myself, so I wandered on back to my tent. Once I got in there, I could see how hard I was tripping. There were patterns everywhere, breathing, moving, etc., and the closed eye visuals involved extremely complex multicolored visions. 'Ah, this is very nice', I thought and settled back.</p><p>But I kept getting higher, and higher. The visions became stronger and stronger, and I remember muttering 'Oh man, oh man,' and then I was brought into a psychedelic place I had NEVER been before. I was somehow out of my head, although still in my tent, and I could see myself, partially. I say partially, because I had three separate views or vantage points going on, as if I had three sets of eyes, each with its own trip. Occasionally, one set would get a glimpse of me, and sometimes another set of eyes would, and so on.</p><p>This was an outrageously intense feeling, and I was holding my head, and kneeling, thinking I may have finally overdone and blown my mind. I wondered seriously if I could take any more of this, and wondered what that meant, exactly. Can anybody handle being spaced three times at once? What would I do? Should I run out of the tent screaming? Should I take all off my clothes and dance around?</p><p>My hands clenched and unclenched, my mouth yawned so hard it seemed my head would split in two. I opened my eyes so wide it seemed my eyeballs would pop out of my head. Sounds coming into the tent from outside seemed to swirl around my head. Intensely kinetic multicolored visuals rushed all around me at a frenetic pace, from every direction, from within and from without. There was no distinction between closed-eye or open-eye visuals. It simply didn't matter whether my eyes were open or closed.</p><p>I had to make an executive decision, and that was to ride it out and NOT go insane. Nobody out in the campground would be able to help me. I decided I didnt need help, and gradually I beat back the fear that had threatened to overwhelm me. I regained a sense of wonder and happiness, and, when things seemed quiet enough outside the tent that I could get out without having to talk to someone, I did.</p><p>Every little lantern in every campsite seemed as bright as the sun. Looking around, the world seemed squished down, or flattened. Horizontal distances seemed lengthened, even as the trees and sky seemed to be too close. I wandered around the edge of the campground, staggered is a better word, and let my mind fly in a million directions as I walked around. I still had an urge to get naked, and had to remind myself several times that it would be a bad idea. I didn't really want to talk with anyone, and the sounds of talking and laughter had a bizarre zooming or swooshing quality. It was impossible to tell where ANY sounds were coming from, so I made my way back to my tent after a while, and stayed there through the night.</p><p>One good thing about 'shrooms, when the trip's over, it's really over, so by morning I was unbelievably tired, but done tripping. There was a bit of a body-load to the trip too, I had terrible heartburn, and was sore from laying on the hard ground all night. It was the first time, after tripping hundreds of times over dozens of years that I even got a hint of what 'bad trip' is. I'm glad I was able to regroup, but if I hadn't been so experienced, it would have been a terrifying ordeal. As it turned out, it was one of the most profound (if not THE most profound) psychedelic experience I've ever had.</p><p>You know what the weirdest thing is? I can't WAIT to try this again. I think I'd like to do it somewhere where I wouldn't know anybody. I like talking with strangers while tripping.</p>",
 "year": "2004",
 "id": "33111",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "2444"
}
