{
 "title": "Definitely addictive!",
 "author": "Elizabeth",
 "citation": " Elizabeth. \"Definitely addictive!: experience with 1,4-Butanediol (ID 3317)\". Erowid.org. Jun 24, 2001. erowid.org/exp/3317",
 "substance": "1,4-Butanediol",
 "bodyweight": "150 lb",
 "header": [],
 "report": "<p>I was given a small bottle of GHB and was absolutly thrilled with the effects.  It's a very decadent drug, it makes me want to eat, have sex and sleep.  What's not to love!  After I got through with the bottle I went on a mission to find more of the stuff.  I was extremly successful and bought a small case of 1,4-Butanediol, which is closely related to GHB.</p><p>I started by doing it only on weekends and then just on dates or with friends.  Soon, I did it every evening after work to relax.  I started to perfer the way I felt on it then not on it.  I started doing it in the morning before work.  I found that it had a effect similar to exctacy in that it made my feeling more intense.  I cared more about my job and was able to focus better.  I was much more confident.  I started doing it at work and soon I was _always_ on it. </p><p>What started happening was this:  I started gaining weight.  I don't know if this is because I was eating more (well yes, obviously) but it also must be because it bulks you up somehow...  it used to be sold for body builders.</p><p>And this:  while it used to make me horny, now I couldn't even have an orgasm.  I lost my sex drive.</p><p>Besides these very negative and upsetting effects I found when I decided to cut down and not do it 3 times a day, i felt withdrawl symptoms:  shaky, antsy, uneasy, body aches, muscle cramps and inabillity to think about anything else but the damn drug.  I decided that i had gone way too far and needed to kick it completely.  I woke up one morning and gave all my stuff away.  The severe withdrawal only lasted one day, but I was miserable.  My body felt heavy and achey and I felt _very_ depressed.  I cried all day, but all in all it didn't last long and I got over it. </p><p>I feel a lot better now although not totally normal.  I am still feeling mighty depressed and the only thing that helps is excersise.  And yes, I got my sex drive back and am loosing weight.</p><p>1,4 Butanediol can be a fun drug if only done on special occasions.  But if you want to do it more, I would reccomend *no more than once a week*!</p>",
 "year": "2000",
 "id": "3317",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-06-24T07:00:00.000Z",
 "views": "20407",
 "dose": []
}
