{
 "title": "It's Hard Being Your Own Shaman",
 "author": "TS",
 "citation": " TS. \"It's Hard Being Your Own Shaman: experience with Amanitas - A. muscaria & Smoking Blend (ID 33193)\". Erowid.org. Jul 18, 2013. erowid.org/exp/33193",
 "substance": "Amanitas - A. muscaria & Smoking Blend",
 "bodyweight": "150 lb",
 "header": [
  "DOSE: T+ 0:00",
  "1 hit",
  "smoked",
  "Products - Smoking Blends - Cannabis-Like",
  "(plant material)",
  " T+ 0:20",
  "1.5 caps",
  "oral",
  "Amanitas - A. muscaria",
  "(tea)"
 ],
 "report": "<p>Finally My shrooms are here! Time to visit alice in wonderland.</p><p>Note: I've never done shrooms b4! Done weed, drank, salvia, kratom, pain killers, amphetamines, tried to do dramamine but that was hell, but nothing major like an out of body experience.</p><p>Its about 5:00pm I got the shrooms on boil and I am gonna go drink the tea and then eat what is left of the mushrooms.  About 5mins ago I had a hit of 'Vision Quest', (I got it free with the shrooms for Herbal Smoke).  The tea is made with about 200ml of water, a 2 1/2' cap, and half of a 1 1/2' cap. Took one motion sickness pill in case of nausea.</p><p>5:20 The tea is browish, doesnt smell to bad, the caps are no longer red, I will still eat them.  I spilt a lil tea on the stove, stupid me.  I am slowly drinking tea (HOT) and will eat the shrooms after I'm done.</p><p>5:30 This barely has a taste, maybe its not a strong enough dose but I drank it all</p><p>5:35 Ate the shrooms. ALL DONE! I hope I'm not getting in over my head.  I am depressed a lot so if I kill myself lets hope someone gets on here and submits this report anyway. Ill probably smoke some of this free herb: Vision Quest, Merlins Blend, Spirit Walk, Smells like shit but the one hit of vision quest did something to me so I dont know. I already feel a little nausea coming on.  But I have been called the steel stomach before so who knows. I just was staring at the tv for about 2 mins without blinking.  Its hard being your own shaman, ha.</p><p>5:45 I feel very loose and tingly, like of muscle relaxers, I feel like sleeping.</p><p>5:50 I'm not totally out there yet, but I know what they mean by mental distortion now, I'm hungry as hell but not sure I should eat. Its now 6pm and I am wondering if the trip has peaked yet, if it has then either this stuff sucks or I had a small dose.</p><p>6:12 I think this is over, the only thing I felt was a budge of reality and I cant feel it anymore.  I will try to take more next time so I am making pasta now :)</p>",
 "year": "2004",
 "id": "33193",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2013-07-18T07:00:00.000Z",
 "views": "650",
 "dose": {}
}
