{
 "title": "Where Did Reality Go?",
 "author": "Devil Weed",
 "citation": " Devil Weed. \"Where Did Reality Go?: experience with Salvia divinorum (5x extract) (ID 3319)\". Erowid.org. Nov 24, 2001. erowid.org/exp/3319",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "155 lb",
 "report": "<p>First listen, then I will explain...</p><p>-----------------</p><p>The pain is ravaging me, and yet my determination is unwavering. My eyes are open but I am shrouded in darkness.  I summon strength from the knowledge that my anguish will be dispelled once I have completely severed my ties to the mortal world.  In order to be free, I know that I must willfully forget the memories that I have acquired for the past eighteen years. </p><p>The more I fight the pain, the more it intensifies.  However, the infinite enlightenment that I stand to gain from my struggle propels me forward.  The darkness is dissipating now and I find myself torn between the mortal world and the after life.  A vivid array of human emotion floods my being.  My thoughts are tormented by the memories of the people I loved in my past.  But my memory is disappearing faster than I can recount it.  Intense fear has begun to erupt within me.  Much of what I know myself to have been is now erased.  Fleeting thoughts of my family torture me and then vanish forever.  I have forgotten nearly everything of human life.  I feel an emptiness growing inside me and yet there is an overwhelming sensation of infinite freedom.  I contemplate my own finality, and in doing so a cavernous pain surges through me so that I am held captive by an unfathomable terror.  If I succumb to the fright, then my ambition to break my bodily chains will be forever lost.  In desperation I try to run, but I find that I am stuck.  My confusion is channeled as I glance upon the landscape emerging beneath me. </p><p>I no longer have eyes, but rather clarity of being which is so infinite that nothing is beyond my sight.  Knowledge and lucid sensations have replaced my vision.  I am in the presence of a vast plane.  There is constant motion along the surface that produces a consciousness of life so strong that I cannot fully appreciate it.  I too feel the motion of the plane, but my sensation is still grounded in the mortal world.  The body that I have not completely transcended is being pulled to the left.  I realize that I am still bound to what I now conceive as the mortal plane.</p><p>The simplicity and beauty of the plane in which I am both entrapped and privy to comprehension, has done little to calm my surmounting terror.  I am desperate to escape the fear that is consuming me.  I yell into the emptiness of my own being, I am ready, I want to go! </p><p>A response to my plea is issued immediately.  A very calm voice says to me, You are not ready.  Its not your time.  Go back down.  Go back down.  I instantly discerned the voice to be that of God.  Furthermore, I was made to understand that God is the force behind, and responsible for the motion of the plane.</p><p>-----------------</p><p>At this moment, my eyes opened and I expelled the potent Salvia smoke from my lungs.  A mere 30 seconds had passed since I had inhaled it.  During the course of my trip, I was convinced that I was actually letting go of my family, friends, and even life.  At no time did I have any recollection of being under the influence of a drug.  It was completely real to me.  The feeling of terror that swept over my mind and body when I was forced to relinquish all the memories of my family, stayed with me for several days.  It is worth noting that after I exhaled the smoke, I continued to trip for approximately 10 more minutes.  These 10 minutes also involved intense emotions and sensations, but not nearly as humbling.  On another note, by the end of the trip I noticed that I was sweating rather heavily along my calf muscles.  Additionally, there was a period of about 30 minutes after the trip ended were I had a very difficult time assimilating myself with reality.  In all honesty, I believed that my trip was more real than life itself.</p><p>Overall, the experience was by far the most intense trip I have ever had.  I cant say that it was all together enjoyable, but it was certainly different.  All in all, I have no regrets about having tried Salvia.</p>",
 "year": "2000",
 "id": "3319",
 "gender": "Male",
 "timestamp": "2001-11-24T08:00:00.000Z",
 "views": "6578",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
