{
 "id": 332,
 "title": "Total Eclipse of the Brain",
 "date": {
  "submission": "2004-09-10T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tryptakid",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "500",
    "grams": 0.5
   },
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "powder/crystals"
  },
  {
   "time": "3:00",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Perhaps taking into account the source of this product could explain part of the negative experience, but here it is as I can relate.",
  "Around 11pm, a friend of mine and I purchased a few grams of 'ketachloride', a street name for synthetically produced ketamine (the truth of this is unknown).  We began shortly thereafter, (11:30ca) by doing decent sized lines each, most of us have a fairly high tolerance to the substance.  At first, this seemed like somewhat normal K, tasting chemically/medically, however w/o much of a drip at all.  This perplexed us, but being the lovers of K that we are, we continued on.  Soon thereafter, I began experiencing severe physical symptoms.  I felt my heart racing, difficulty moving etc.  Severe dissociation began to take place, not nearly enough for the amount we did.  Though I listed 1/2 a gram as my dose, that was over the course of about 1 1/2 or 2 hours.  Soon, these physical symptoms got much much worse, severe severe lightheadedness, dizziness, nauseau etc.  Now, we're fairly experienced K users so effects like these are uncommon.  My friends began throwing up excessively in the bathroom, however I did not feel quite as bad.  I, however, was having extreme difficulty functioning whatsoever. ",
  "Eventually, I began to ressociate, but not much.  I was able to get up and walk around, however, I still could not talk or function to any degree of normalcy, especially considering the small amount we did.  Around 2am, I was still feeling very unpleasant, so the suggestion of some nice herb was made.  I took one normal bong hit and laid back to watch the family guy, (the one where brian becomes a cokehead).  I noticed an EXTREME reaction to the drugs.  I was seeing purple and blue all throughout my vision, the only clear thing was the computer monitor that we were watching the show on.  I suddenly experienced visual, audial and somatic hallucinations, all acting in the same manner.  I was unable to do much more than silently fall deeper and deeper into a spiral of dissociation.  It came to the point that I thought i was entering the gap between this demension and the 'dissociation' demension. ",
  "Finally at around 4am, I had returned to about a +1 state, that +1 state would only be signified by the physical symptoms I felt, the uneasiness etc.  My friends and I agreed that this definately was one of the worst Ketamine experiences any of us have ever had.  Now, I could take into mind the mindset and setting of this experience, bute they were no different than any other time we have done K.  My mindset was calm and normal for a friday night, and my setting was my apartment, a place where I can always find comfort in.  Perhaps it was some strange version of the K, perhaps it was an adulterant?  Is there any possibility of any other substance producing these effects.  I stress that I am a very experienced Ketamine user, and this was very very different than the dissociation I normally experience.  Whereas K generally produces a mystical, pleasant and often manageable dissociation, even at high doses, for me, this produced an exteremely physically oriented, difficult reaction.",
  "Perhaps it is time to search inward?"
 ],
 "erowid": {
  "id": "10512",
  "citation": " Tryptakid. \"Total Eclipse of the Brain: experience with Ketamine & Cannabis (ID 10512)\". Erowid.org. Sep 10, 2004. erowid.org/exp/10512",
  "substance": "Ketamine & Cannabis",
  "views": "16120"
 }
}
