{
 "title": "A Day of Pure Drowziness",
 "author": "Carpet Head",
 "citation": " Carpet Head. \"A Day of Pure Drowziness: experience with Olanzapine (Zyprexa) (ID 33203)\". Erowid.org. Feb 21, 2010. erowid.org/exp/33203",
 "substance": "Olanzapine (Zyprexa)",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "oral",
  "Pharms - Olanzapine",
  "(pill / tablet)"
 ],
 "report": "<p>This is a report of my less than interesting experience of being on olaznapine. I recently had an experience with significant DP/DR where I checked myself into the hospital. I suffer from pretty severe HPPD and am diagnosed borderline personality disorder. The psychiatrists prescribed me olanzapine to help with hallucinations DP/DR and anxiety they said to use only for 'extreme agitation'. This brings me to my experience.</p><p>The time was early in the morning. I was attending group psychotherapy and feeling very anxious. I was begining by shake so I figured that constitutes extreme agitation. I injested a 10 mg wafer of zydis(olanzapine) it took effect within a few minutes leaving me feeling much more relaxed although far from comfertable. The relaxation was acompanied by a slight dizzyness, heavy body sensation and clearing of my mind. After 20 or so minutes I felt quite sedated but not in a pleasant benzo type way it was more of a feeling of exuastion. This is where I pretty much blacked out. All I remember from the rest of this day is reapetedly falling asleep in akward positions and feeling completely floored by the drug. I some how managed to get home after which I imediatly crashed for like 14 hours.</p><p>This drug has no real potential for recreation because it is unpleasant at best. It only has usefullness for treating psychosis or going to sleep for long periods of time. Olanzapine didn't realy help the visuals from my HPPD at all and only helps DP/DR because it renders me unconcious.</p>",
 "year": "2004",
 "id": "33203",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-02-21T08:00:00.000Z",
 "views": "9341",
 "dose": {}
}
