{
 "title": "Time in Purgatory",
 "author": "Lestat",
 "citation": " Lestat. \"Time in Purgatory: experience with Morning Glory (ID 33227)\". Erowid.org. Apr 28, 2007. erowid.org/exp/33227",
 "substance": "Morning Glory",
 "bodyweight": "126 lb",
 "header": [
  [
   "DOSE:",
   "250 seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "report": "<p>Having read about the effects of taking morning glory seeds, I went to the local garden center and purchased eight packets of fifty heavenly blue seeds each.</p><p>Feeling glad to have something to trip off,</p><p>I washed the seeds in detergent to remove any toxins on the seeds, then dried, chewed and swallowed 250 seeds. Almost within ten minutes I feel a floaty, trippy sort of mental buzz.</p><p>T-30 minutes:</p><p>Feels very introspective, kind of like a light dose of shrooms, no visuals yet, I feel fairly sick, so I go and lie down on my bed in the dark.</p><p>T-50 minutes:</p><p>Feel a sense of extreme dizziness, and nausea, so I try to make myself puke. I cant seem to do this, no matter how much I put my fingers down my throat (sorry for the detail), so I go back and try to ride it out.</p><p>T-80 minutes:</p><p>I dont see it physically, but more with my mind, I can feel my face being cut into with knives by unknown people. I am absolutely terrified out of my mind. I can feel the pain and feeling of my flesh tearing. I try again to make myself throw up. Again, I can't. I didn't know I was in for many hours of this living, breathing nightmare at the time</p><p>T-No idea what time, though it seems like a lifetime, I go and sit down by the fire, having stopped seeing and feeling like I am a piece of meat on a butcher's slab, but I still feel the sickest I have ever been.</p><p>Even sitting right by the fire, I feel incredibly cold, I am shivering and sweating and feeling like my stomach just got off of a white knuckle ride at the fairground.</p><p>I decide to take a hot bath for an hour or so. I feel a little better now. I go down and sit by the fire again, start to feel sick and dizzy again so I try to drag my sorry-feeling ass up the stairs to my room and lie down, but as I reached the top of the stairs, I'm suddenly seized with extremely violent projectile vomiting. I have never puked so forcefully in my life before, and the puking just kept on and on, for ages, by which point my parents ask me if I was alright, my only response being a very pained effort at an upraised middle finger before collapsing unconscious on the landing for about five-ten minutes.</p><p>I came round, and began cleaning up the huge pool of brownish red vomit, I noticed there was no food in it, just particles of undigested seeds and mucus. Cleaning it all up takes about two hours with me feeling tired and drained like this, so I finish cleaning and go to lie down in my room again. I later blame my ilness to my parents on some dodgy peanuts I ate earlier.</p><p>I think I slept about a day, maybe two, I can't be sure as my sense of time was completely fucked up.</p>",
 "year": "2004",
 "id": "33227",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-28T07:00:00.000Z",
 "views": "9148"
}
