{
 "title": "Is This DMT or Something Else?",
 "author": "shadowmancer",
 "citation": " shadowmancer. \"Is This DMT or Something Else?: experience with Diplopterys cabrerana & Syrian Rue (Ayahuasca) (ID 33234)\". Erowid.org. Jan 4, 2005. erowid.org/exp/33234",
 "substance": "Diplopterys cabrerana & Syrian Rue (Ayahuasca)",
 "bodyweight": "140 lb",
 "report": "<p>Having read many reports of Ayahuasca using various combinations of plants, I decided to try a combination of syrian rue and diplopterys only. A combination which I have not heard of before. I had no experience with dmt or harmala before, however I had in the past experimented with 5-meo-dmt and any other psychedelics I could get my hands on.</p><p>30 grams of diplopterys was put into a mixture of a liter of water with the juice of 2 lemons and 1000mg of asorbic acid (vitamin C). The mixture was brought to a low boil and stirred regularly for 40 minutes.</p><p>5 grams of syrian rue (almost 2 teaspoons) were ground up and put into capsules.</p><p>T+0:00 The syrian rue capsules were taken with water on an empty stomach. Ground up the powder fit into 9 pills, not very pleasant to swallow. Having heard of the negative effects (ie vomiting) of taking ayahuasca with food I had decided to refrain from eating.</p><p>T+0:45 My stomach was feeling most unpleasant, since two of my friends were over making food, I decided to have some french fries with them. I ended up eating most of them.</p><p>T+1:30 Having sat down to watch a movie with my friend T, I realized I was starting to feel a strong pulsing sensation through my body. I hadn't expected to feel anything significant untill ingesting the diplopterys cabrerana brew, so I proceeded to the kitchen and drank what I can only aproximate to be somewhere between 25 and 75ml of the brew, which was about 1/10 of the filtered and boiled down solution.</p><p>T+1:45 I started to experience strong visuals in the form of trails along with a strong sense of disorientation. I felt a sort of non-locality, as if my inner being was being swung around while my physical body remained monitionless. This sensation would intensify when I'd close my eyes.</p><p>T+2:00 No increased visual effects, but the sensation of inner motion had become so strong I was starting to feel motion sickness and had to ask my friend T, who was on dxm to leave as I could no longer act as a host. While he is a good friend, I did not want him in my house while I was tripping this strongly. I bid him farewell and retreated to the bathroom as I knew I was going to be ill.</p><p>T+2:10 I had heard of extreme vomiting from taking ayahuasca, and was relieved to find that after minor vomiting my stomach was much relieved. I was glad to have eated the french fries so I did not have to vomit bile. When I flushed the toilet, the usually familiar sound it makes had turned into a mechanical vibrating noise. Running tap water also made a sound which I can only describe as alien to my normal perception. I started to experience visual hallucinations in the form of vivid colors and patterns emerging from ordinary objects. A blue rug became a brilliant emerald and ruby colored matrix of shapes that were both prismic and organic. I felt as if this image was a gateway to another world. I began to enter and was sudenly jolted back and the rug has returned to its normal blue self.</p><p>T+2:40 I had returned to my room where I lay with my girlfriend who was surfing the net. She asked me how I was doing and all I could respond was that I was fine. I did not have the vocabulary or the concentration required to explain this vivid, alien and disorienting world I was experiencing. I was not having fun, but I was enjoying the odd dimensions my curiosity was taking me too. I felt as if the thoughts I was having were not entirely mine. I wanted to take dmt and gain inner knowledge and strength, but I was experiencing a world in which those things were insignificant. I recall a conversation I had, with what I do not know, but I know something was telling me my desires were insignificant. I argued that unless there was a greater meaning to life of which I was not privied, that those things made me happy and that was all that mattered in life.</p><p>By T+4:00 the strong trip had either mellowed or I had become used to its effects.</p><p>At T+7:00 (3am) I was finally able to get to sleep.</p><p>The experience was not something I would repeat for at least a week, it was not fun, but it did give me some very interesting perspectives. I remember desperately forcing myself to recall one single insight I had received above all else, and that is that we all must learn to sit back and relax. Contrary to how most people would interpret this, I meant it in the sense that in dealing with life and most importantly people, one should observe from a detached but not disinterested stance. Listening to what people say instead of filtering things that are said through our own impressions and beliefs.</p><p>Oh and for those of you who are undoubtably curious, for males, unless you happen to have some viagra, in my experience, sex on dmt will not work.</p><p>I have also come to the realisation that syrian rue on its own is a potent psychedelic as I was experiencing strong effects before ever taking the cabrerana. I isolated the syrian rue effects as an intense vibration and a sensation of my body feeling smaller and out of proportion, the same thing I experience with high fevers.</p>",
 "year": "2004",
 "id": "33234",
 "gender": "Male",
 "timestamp": "2005-01-04T08:00:00.000Z",
 "views": "25432",
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(capsule)"
  },
  {
   "time": " T+ 1:30",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Diplopterys cabrerana",
   "form": "(extract)"
  }
 ]
}
