{
 "id": 3327,
 "title": "Primordial Fire",
 "date": {
  "submission": "2000-06-24T07:00:00.000Z",
  "experience": "1995-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nipo",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material",
   "specific": "P. semilanceata"
  }
 ],
 "report": [
  "Time: Around seven pm till 2 am on 20th of May 1995.\rOccasion: Smoking of several grams (4-6 g) of skunk-weed and ingestion of 8 large Psilocybe semilanceatas for recreational purposes.\rSetting: This experience took place in my apartment in comfy bed while different very enjoyable ambient was beingplayed. A friend was present also enjoying little relaxatory doses of these substances.\rMind Set: I had not ingested any psychedelic substance since 4.11.95 (about 5 months pause). Have felt good for last weeks, and during previous week studied ethnobotany and anthropology quite intensively. During saturday first slept till 2 pm, and then went to a festival (alone though - was unable to reach any friends, which caused a very slight depression); 'Worlds Meet' - all kinds of people there and lots of different musics/arts/thoughts etc. Nice atmosphere.",
  "After that went to Botanical Gardens of Helsinki University for a long stroll. Very nice, and I felt very peaceful and calm after leaving the gardens. Went home and a friend came at 6 when he said he'd come. We started with a chat and a few small bonghits...",
  "These skunk bonghits were always very subtle but powerful, I felt. One thinks one is very sober and normal, but when trying to do something or even thinking something complex reveals the true nature of things.. Fun, I've always felt.",
  "We smoked couple of small bongfuls of these (maybe 2 grams per head), and then decided to take a little time to listen to FSOL's ISDN and Isaku Sakaros Ohm.. Nice.. Both very nice for this ultralight-paragliding of the conciousness. Both are of very high fidelity with large hall and space-echoes even when sober, and my stereos are also very HiFi, so almost immediately I was swept along into the spaces and places in the music - every detail and overall perception of music was of very hig resolution. I was on the verge of literally tripping - nice visuals.",
  "After about half an hour we drank some mushroom tea. Taste was as icky as it had been 5+ months ago and before that, and all effects felt somehow very familiar. Though quite diluted, in spite of the very long pause. While stoned, the tenseness of the jaws was not felt coming on, and legs felt quite feeble already, so only coming on-effects were introduction of extra reverb into each sound, and very slow deepening of all thoughtpatterns... Visuals also came quite colorful, but the patterns I usually see on the retina (small dots, waves and squares of different color) were absent. Some Thursday Afternoon was being played, and we both decided that it w as bit too lame, as we both listen to it very much while reading and such.. So on came Terry Rileys Shri Camel.",
  "This was probably about 45 minutes after ingestion. I felt very sober, could speak very clearly and still knew I was quite inebriated. My friend put on Flasher to about 15 Hz and white, and I decided to take a dive to the deep...",
  "To some extent all this was spontaneous, and yet I did think every now and then parts of the hallucinations, for instance the tunnels... ... I thought, 'I'll go towards the light, white light,' and these beginnings of caverns were forming in front of my eyes, of blue, and pink and orange color.. I searched for the white light, and found it.. I dove in and the caven changed into tunnel made of turquose rings of light, I sped through them, towards the white light, rings grew quickly paler and suddenly I felt very weird - awed sort of, bit scared if I should do this, or jus t open my eyes - I had lost the feel of my body and was completely away in the spiritworld.. I hesitated for a microsecond and then continued while thinking 'Don't think. Think nothing. Thinki pinki.' [ =) ] - and suddenly was there -",
  "In the _Primordial_Fire_, it burned me away, cleansed me of everything, parts of me beginning to melt and turn into dust blow away by the horrible force of this pure white light - I opened my eyes, as I felt a tingles in my body where the parts had begun melting - everything was back to quite normal. 'Oh, don't fight it,' I thought, 'let go. Let go. LET GO,' I said to myself, and closed eyes, stopped fighting it, the fire returning in the form of a volcano, volcano the size of the Himalayas, I was the volcano. I burned and oozed and was being purified - and this was not an unpleasant feeling, more like bittersweet, and I also felt very powerful... I was unable to completely let go, so this little doubt dwelt in the back of my mind, whether I should stop, for the intensity of everything was rapidly escalating.",
  "I the volcano turned from pale red to pure white, pressure building up along the temperature, and suddenly I let go. Just relaxed myself physically and mentally, and the volcano erupted into the skies, throught the skies to the space, towards all stars in the form of quark-sized million-kelvin particles.",
  "My friend asked me whether I wanted to have a few hits off the bong.. I took some, and changed Riley to something else (can't remember). And then I lay down again, saying I'll take another dive. As I closed my eyes for a short time my thoughts and visions were very chaotic, but then I saw a woman. I don't know exactly what she looked like, and so on, but I stepped closer to her thinking I would began to have these visions of wild orgies I've sometimes had - in the Psychedelic Experience it is mentioned as some bardo of some level.. But no.",
  "She was Mother Earth. For a moment I was bewildered. Then I placed my hand on her vaginal lips, and first one, then two fingers slipped in.. Then my hand, and my arm.. And all the time I grew smaller, or she grew bigger, for I went inside her womb, which was a passageway.. I felt very warm.. very secure and she showed me things I had done wrong, things I should do... Very quickly after this the visions began to fade, totaling in about 3 hours.. My friend had taken a couple more shrms and he came out of it about half an hour later.. So we listened to weird and wonderful ambient-music and smoked and talked about what we had experienced...",
  "What was very weird is that we smoked at least 3 grams of nice weed during these hours between 11 pm and 2 am, and either didn't feel very stoned. Maybe the rest of the bag was not as good as the top, or then our tolerance (psychological) had increased after the voyage.\rSummary (sort of): Very nice experience of much greater strength than I had expected, even after 5 months pause. However I was quite in control, being able to return to normal levels of conciousness by opening my eyes. The effects of the setting, I feel, were very pro- nounced (primordial fire, purification, symbolic death and mother earth are all elements of shamanic traditions). I liked very much the softening effects of the marijuana on the phase where ef- fects are coming on. But had I ingested larger dose (eg. 40 mushrooms), the result wouldn't probably had been as nice. Even though the preparation period was very short (couple of hours in the Botanical Gardens) experience was quite divine. So I arrive to this conclusion: The Divinity or Quality is not connected to the Dosage. More is not necessarily Better."
 ],
 "erowid": {
  "id": "2079",
  "citation": " Nipo. \"Primordial Fire: experience with Mushrooms (ID 2079)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2079",
  "substance": "Mushrooms",
  "views": "50349"
 }
}
