{
 "id": 3337,
 "title": "Trip Through The Woods",
 "date": {
  "submission": "2007-03-14T07:00:00.000Z",
  "experience": "1981"
 },
 "author": {
  "name": "Hiker",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "sublingual",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": ""
  },
  {
   "time": " T+ 14:00",
   "amount": "5 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>I had been studying in Freiburg, Germany for my Junior year of college. In between semesters, a friend from high school visited for a week. He had snuck a 4-way windowpane tab of acid in his luggage and had presented it to me just before he left as a 'thank you' gift for showing him around the area. I had never taken LSD before, so he advised me to split the 4-way tab with a friend. I was sharing an apartment with one other guy, with two friends living across the hall, one of whom said he'd like to try it with me.",
  "He had done acid before and advised me to get mentally prepared by making sure I was in a good mood and 'psyching myself up' in the days before we were to take the hits. We decided to try the acid on a late-winter Saturday morning and spend the day hiking the many logging trails in the Black Forest near the city. My friend advised me that acid can make you very 'racy' as he put it, so he suggested that we smoke hash before we took the tabs and during the experience as that would help slow down our heartbeats, calm our stomachs and cut the constant nervous sensation he described as being part of the experience.",
  "We started out at about 9:00 AM by smoking a bit of hash. My friend instructed me to place the two tabs under my tongue and leave them there until the paper was nothing but mush. We then boarded the trolley across town to the forest edge. Just after we got off the trolley, I spit out the paper. About a half hour into our walk, I noticed that my stomach was knotting up a bit and that I had an extremely irritating tinny taste in my mouth. I was starting to feel more anxious, but seemed much more aware of everything going on around me. I looked over at my friend and immediately saw that his pupils were extremely dialated and that his face appeared splotchy red. He gave me a stick of gum to chew, as he noticed that I was starting to clench my jaw. This seemed to take care of the tinny taste, somewhat.",
  "As we gained elevation on our hike, it started to snow. I was beginning to notice odd movement in the trees, almost as if they were swaying in the wind, yet there was no wind. The snowflakes also started to take on rainbow colors. It must have been about an hour into the trip, but I had lost all sense of time and found myself starting to glance repeatedly at my watch but not being able to make any sense of what it was telling me. My friend was laughing at something and suddenly stopped walking, stating it was absolutely 100% necessary that we stop and smoke some more hash. He crumpled some hash into a couple of roll-your-own cigarettes. He was talking a mile a minute about multiple topics, but he kept coming back to something about men in three piece suits. As we smoked the hash-laced cigarettes, an overwhelming sense of happiness came over me that stayed with me the rest of the day.",
  "The hash seemed to calm my friend down as well. I checked my watch again, it said 11:10 but this still didn't make any sense to me. The hallucinations were by now starting to intensify rapidly. The falling snow was a swirling tunnel before us, the trees were moving along with us, the color patterns in the clouds were intense. My friend was waving his hands around whispering about color trails. I then noticed that trails of color were indeed following his hands. I again looked at my watch and decided that since it wasn't making sense I better throw it away, which I promptly did.",
  "My mind was racing with thoughts by now. Nothing seemed to matter, but everything mattered. My friend stopped talking, he was just walking beside me with his mouth hanging open, looking around in wonder. Suddenly I felt a tap on my shoulder, I spun around and two gentlemen in three-piece suits were standing there. One excused himself for bothering us and handed me a watch, stating that I dropped it. I suddenly realized what my friend was talking about earlier, men in three piece suits were following us down the trail. They had apparently gotten off the trolley with us and were walking up to a tavern nestled in the woods along the trail we were following. I took the watch from him, handed it to my friend telling him it was extremely important that he hold the watch as if I did, time would be lost. We let the men pass and promptly turned up a trail heading further up the mountain and away from the tavern. The second we got away from the men, we both started laughing uncontrollably about men in three-piece suits.",
  "The color trails, tunnel of snow and dancing, walking tree affects must have continued to a good three hours, although as time went on I noticed that my brain was racing so much and I was beginning to just occasionally get a sense of time again. At one point, we had stopped to urinate. I became incredibly focused on my friend's penis and once he stopped urinating I gently grabbed it, undid his pants and started to fondle him. He just stood there repeating 'wow' over and over and eventually he became erect and ejaculated all over my jacket. I had never done anything like that before, but at that time it just seemed very necessary that I do it. We laughed about it later, chalking it up to the LSD and not me having any sexual feelings for my friend.",
  "About five hours in, the intensity of the hallucinations had subsided to all but color trails and moving patterns in the trees. I had regained sense of time and could now focus my thoughts, one of the first being how cold it was, how wet I was, and how late it had gotten. Without realizing it, the trail we had taken had circled up and around the mountain and we were directly above Freiburg looking down on the city.",
  "Once we got back to the apartments, it was about seven hours into the trip and extremely obvious neither one of us was going to get to sleep anytime soon. Our minds had by now stopped racing all together, although both of us commented on feeling somewhat 'out of body'. I continued to experience brief moments of hallucination and was still seeing color trails. I found if I concentrated my eyes on a fixed point on the wall or floor, it would appear to swell and subside and develope movements in patterns.",
  "Finally around two in the morning after smoking more hash and downing a bottle of wine, I was able to sleep, although I did wake up repeatedly during the night. For the next few days I had a hard time concentrating on anything and found myself seeing things in my periphial vision, such as stationary objects moving or flashes of light. Four days later everything seemed normal again.</p>"
 ],
 "erowid": {
  "id": "20820",
  "citation": " Hiker. \"Trip Through The Woods: experience with LSD & Cannabis - Hash (ID 20820)\". Erowid.org. Mar 14, 2007. erowid.org/exp/20820",
  "substance": "LSD & Cannabis - Hash",
  "views": "5741"
 }
}
