{
 "title": "Great Synergy",
 "author": "Taylor the Pi-Bond",
 "citation": " Taylor the Pi-Bond. \"Great Synergy: experience with Absinthe & Cannabis (ID 33376)\". Erowid.org. Dec 5, 2006. erowid.org/exp/33376",
 "substance": "Absinthe & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "8 oz",
   "oral",
   "Absinthe",
   "(liquid)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Good absinthe is hard to come by, but when you drink some, you can instantly recognize the quality.  I had finally found a wonderful brand of absinthe, and after many times drinking it, I became quite familiar with its effects.  The high is very subtle, and in some people it is hard to disinguish from the buz of alcohol.  But, I notice that my thoughts are clearer and more pronounced than normal at the equivalent level of straight alcohol intoxication.  Lights will appear to be brighter and supprisingly more pleasant to look at.  I get a faint halo around lights against a contrasting background.  The high, intensifies with the more you drink, but of course the effect of alcohol starts to outweigh the 'thujone effect.'</p><p>This crossing over of effect occurs for me at about 7 - 9 shots, and it is dependent on numerous factors including but not limited to hydration level, stomach fullness, vitamin and mineral levels, and such; just like different days alcohol will 'hit' you sooner than later.  The next day, if you drank a signifigant amount of absinthe, there should be a point in the eveneing when you just cannot remember anything after it.  You will feel like you are somewhat still high, and your high-level thinking will be greatly impaired.</p><p>So one night after binging on absinthe, 8oz in one hour, and after breifly enjoying the high, I decided to smoke weed.  Oh wow!  I had known that thujone and THC are slightly chemically related.  This has the posibility for them to interact with the same receptors on in your nerve cells.  What I experienced was a whole new level of high.  It was like being high on weed, plus the thujone, but the weed had some multiplying effect on the thujone.  It was a pleasant bonus. </p><p>I was stoned out of my mind, but I could still think very very clearly and still speak coherently.  Three others took the same doses as well, and we all couldnt stop talking about how amazing this new high was.  What was the most noticable was the hallucinating.  I like to say that THC makes you hallucinate internally, like seeing your thoughts in your mind and indirectly applying them to the outside world.  THC plus thujone was stepping into the realms of hallucinating externally.  At one point, I looked up to my wall, where I had previously had my final exam schedules stapled, to see little peices of paper on the wall.  Also at this time all three of my high power black lights were on, so the small torn peices of paper still clung to their staples were glowing beautifully.</p><p>At the time, I could not tell what these mysterious glowing entities were.  With the help of thujone and THC, I quickly asserted that they were aliens floating on my wall.  Then once I had seemingly idenified them, they began to streak across my field of vision with the turning of my head and appeared to be moving to the music when I was stationary.  This was something that never happened from using absinthe and marijuana seperatly.  The others in the room thought I was crazy, as they were to busy being locked in trances to spanish guitar music. </p><p>Later on in the night, I passed out after exiting the shower.  Lying naked in my common room I was found by my girlfriend who was still high.  We had sex, and it was the best sex of my life.  The colors of my room and the black lights made me feel like I was in a pyschedelic porn with super high-mind thinking.  We continued to have sex for 2 hours, until we passed out on top of eachother.</p><p>I woke up the next morning with a condom still on, my girlfriend ontop of me, my room a disaster, and many empty absinthe bottles.  I fully enjoyed the effects of the mixture.</p>",
 "year": "2004",
 "id": "33376",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-05T08:00:00.000Z",
 "views": "14593",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "8 oz",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ]
}
