{
 "id": 3338,
 "title": "Collapse from Overdose",
 "date": {
  "submission": "2003-06-04T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Female",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]",
  "Last year (2002) I followed a young 17 year old female who used Coricidin Cough and Cold recreationally for the period of roughly 2 months, despite my numerous warnings about the danger of the drug DXM and my uncertainty about the other drug it contained, Chlorpheniramine Maleate. Usually the subject admninistered roughly 3-15 pills daily sometime in the morning, usually with an hour or so onset, continuing dosing throughout the day to maintain the high she got from it.  Symptoms she experienced were light-headedness, euphoria, dizziness, and loss of cognitive and coordinative skills.  Towards the end of the 2 month period she began to experience bleeding with urination, a sign of kidney failure due to the Chlorpheniramine Maleate I'm assuming, though I am unfamiliar with this substance.",
  "One morning I saw her midday, and she claimed to have taken 20 pills earlier in the morning (approximately 1.5-2 hours previous?), and was extremely confused, hallucinating, and stumbling.  I warned that this was probably very dangerous, but I was unsure of the overdose for Chlorpheniramine Maleate and the amount of DXM (600 mg) for an overdose was less than she had taken.  We parted and a few hours later I had learned she had collapsed and was taken to a local hospital, treated overnight and released.  She later claimed that this was a possible suicide attempt.  She took Coricidin recreationally a few more times before quitting habitual usage.",
  "I know there a probably a few reports on this drug already, but reinforcement could not hurt for something potentially life threatening.  I do not believe I can give many more details because this individual has resumed a semi-stable, normal life and would wish to remain anonymous.  It still also seems like, despite warnings, Coricidin is still being used recreationally in a number of circles, especially teenagers without enough money/connections to obtain other mind altering substances.  This past summer I met many teenage individuals who were using Coricidin carelessly and without well calculated dosages, and it seems to be the preferred method of recreational DXM for many.",
  "So, in conclusion, this is a very dangerous combination of substances and should most likely be avoided at high, recreational dosages.  Also note that the 20 pill overdose was for a highly experienced, tolerant user, so it would not likely help to be used for a dosage guideline.  There are also many other types of Coricidin who most likely have very dissimilar effects to Coricidin Cough and Cold.</p>"
 ],
 "erowid": {
  "id": "20821",
  "citation": " Anonymous. \"Collapse from Overdose: experience with DXM (with CPM) (ID 20821)\". Erowid.org. Jun 4, 2003. erowid.org/exp/20821",
  "substance": "DXM (with CPM)",
  "views": "47006"
 }
}
