{
 "title": "Massive Overdose",
 "author": "Gideon Stargrave",
 "citation": " Gideon Stargrave. \"Massive Overdose: experience with 2C-E (ID 33380)\". Erowid.org. May 6, 2004. erowid.org/exp/33380",
 "substance": "2C-E",
 "bodyweight": "180 lb",
 "header": [
  "DOSE: T+ 0:00",
  "180 mg",
  "oral",
  "2C-E",
  "(powder / crystals)",
  " T+ 1:00",
  "30 mg",
  "oral",
  "2C-E",
  "(powder / crystals)"
 ],
 "report": "<p>[Erowid Note: 210 mgs of 2C-E is considered an extremely high dose, see 2C-E Dose Chart]</p><p>By a set of unfortunate circumstances a substance which was mistakenly thought to be MDBD was in fact 99% likely 2C-E. This substance was ingested at the 180mg level and then followed up at the hour point with another 30mg.</p><p>I was a relatively experienced phenethylamine user but not with this substance. Most people find it too much to handle at 18mg (esp. first time). It goes without saying that it was rediculous at 10 times this level.</p><p>Didn't notice any effects aside from phenethylamine alerts and a mild stoning effect at ALL until about 2:30 hours -- the cause of the second dosing. This substance can kick in slowly. Even then it only kicked in after I was in a dark room just trying to get some sleep.</p><p>This is an excerpt from an email I was typing to a friend as it kicked in. The email started off rationally (spelling errors left in):</p><p>...</p><p>strange waves of radio nylon crashes down and constricting before reality bursts through the seems everything shows potential mvement my showercurtain waves in the way it could if I brushed it or it would if some other guy brushed your curtains and its all potential mocmeent</p><p>its gettgng harder to type sort of like trying to orgasm on E it is one of the things keeping me from breakikng me out keeping me from oing start stark ravin mad</p><p>20 minutes ago I wouldn't have given madnesss much of a chance but look now I;m seeing th whole room go fuckin crazy so maybeb but its a bit serene not the stuff bad trips come from althouh I understand the grounds from which they come and its just somethin you set aside with a hug to show that you stand toether aainst this mad crazy world.</p><p>...</p><p>Aside from the slow comeup of this substance some other points to note:</p><p>The full out trip experience was weird. Grounded in reality one moment completely out of our existance the next. The trip comes in 'waves' and is waaay beyond colors or visuals. You start thinking in metaphor and can believe anything or anyone. Kiss reality good bye. I was able to talk about problems or show sexual feelings for someone by manipulating pictures and sounds in my head which came out to my babysitter's perspective as rational statements like, 'You're a good friend.'</p><p>The hardest part of the trip was when reality came back (t+10.00) but there were still OEV's everywhere.</p><p>I needed a friend to babysit, at 4am -- I wasn't self destructive I was just completely out of my mind.</p><p>True to these sort of substances I don't think I was in any physical danger from the overdose but I would never recommend this level to any individual -- EVER. The same could be accomplished with a much lower toll on the body.</p><p>I hope this report serves as evidence to the relative safety of this substance from a toxicity point of view and a firm warning to always have friends who can rescue you as you explore your mind.</p>",
 "year": "2004",
 "id": "33380",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-06T07:00:00.000Z",
 "views": "16864",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 }
}
