{
 "title": "Defeated Shadow, Utah Punx Victory",
 "author": "Punk Rock Mark",
 "citation": " Punk Rock Mark. \"Defeated Shadow, Utah Punx Victory: experience with Salvia divinorum (10x extract) (ID 33393)\". Erowid.org. Nov 18, 2007. erowid.org/exp/33393",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "125 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>I am a Utah Punk Rocker named Mark T. I have done a large amount of salvia in the past, and had had a bad confrontation with my shadow. Today I did another large dose, and this is how is went down.</p><p>It loaded to be 2 big bowls in a water bong, and I got em down in 1 hitter bowls. With my eyes open, I saw nothing, but felt confused and in complete disoray. I closed my eye only to meet a full in closed eye hullicination. The fuzzy light of my closed eyes manipulated and duplicated, I was in complete darkness in another deminsion and in a cell of a firey square as it was all around. A fire being came and grabbed my and threw me down, forced me back into this dimension, I open my eyes and still see darkness, and my sitter outlined in fire. I told him that my lungs hurt. I was sprirling in a bad trip. Trying to get out of my trip but that pain was a firey chain connected to my soul, squeezing and confining it. I was completely out the top of my head connected with the cosmic consiosness, thats all there was. I felt disturbed thinking that everything was an illusion, that I was a slave to the darkness and everyone was a boring dream.</p><p>I realized that this was my shadow again. So I pushed it away, I denied the lies that it put in me. I told myself the concept of reality, while physically forcing the firey chain around my soul off, reaching towards the lady that it was that forced me down. After reality hit I was hit with feeling of boredom and disconnection with the family that I was with that I was so close to in the past. Then the darkness came flashing back and I was confined back into my firey cell. I finally told the shadow that what I felt towards them was not boredom, but a strong bond and longing towards.</p><p>The lady came back and took my hand, she pulled off the pain in my lungs and took the chain from me and carried me back into reality. I reassured myself of where I was and grasped back the concept that I was not really alone, I could feel the aura of the others upstairs and there I went, I came down and back into my body that somehow I became disassociated with and back to reality that I had so been longing. And most of all, I had defeated my long troubling shadow. Before I had a trip where my shadow took over my body and suppressed my in the painfull was as now. Before it threw me back as I could feel the dark cloud overtake me, then I came to.</p><p>I don't think that I will do anymore salvia, because I feel that I have done what I had been wanting to.</p>",
 "year": "2004",
 "id": "33393",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-18T08:00:00.000Z",
 "views": "3101",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "125 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
