{
 "id": 3346,
 "title": "Low-Dose Brings Interesting Visuals",
 "date": {
  "submission": "2007-09-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Explorer",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Trying Benadryl was on my list of curious experiments that sounded interesting, but weren't really worth the trouble. I knew this would not be any fun; however, I was motivated to try it by the promise of interesting visuals and altered states of consciousness. At my young age of 14, I have very little experience with drugs. Recently, I have tried DXM, used marijuana once, and drunk alcohol lightly. I was unprepared for the dramatic change in perception afforded by the Benadryl.",
  "I knew I wanted to start with a low dose of Benadryl, considering all the horror stories I had heard about being fucked up beyond belief. Having only a few hours to myself, I would have to remain sober enough to communicate with family members and move around the house in a normal manner. Reflecting upon all this, I took only six Benadryl capsules, enough to just barely get me to a different place.",
  "For a while, I killed time, waiting for the drug to come on. After about 45 minutes, I began to feel the sedating effects of the antihistimine. Since I knew how tired Benadryl makes me, I decided to lie down. Soon, I noticed a few changes in perception. Solid lines seemed to waver, and the walls started to breathe slightly. As I closed my eyes, I was confronted with the most startling visual vista I had ever seen.",
  "With my eyes closed, colors seemed to swirl all around. When I turned towards a light source, my vision suddenly brightened, even with my eyes shut. Greens, oranges, reds, and blues all danced in my brain. The colors were simple, but I noticed some patterns. Dots and stripes appeared in my visual field, and everything seem as if it were spinnning. This whole visual scene captivated my attention; I literally could not get enough of it. Everything was so bright and intense; I had never experienced anything like this before. Such colors are usually not seen without the aid of chemicals. However, even more fascinating than the colors were the thought loops I went thorugh.",
  "My normal method of thinking changed drastically in the world of Benadryl. I got caught in one abstract thought after another, and I could not stop this process. As one thought faded, a different idea would enter my brain and take it over. Strangely enough, I had almost no recall of previous thoughts. Everything was in the moment, I lost all perception of a past or future. Often, I would see hallucinations corresponding to the increasingly abstract ideas flowing through my consciousness. For example, I remember seeing a chair, but I cannot recall what thought brought on this visualization. The hallucinations were pretty abstract and unreal; in no way did I believe they were part of reality. However, they did connect to the unusual 'reality' I was experiencing.",
  "I had been exposed to the idea of thought loops and random assoication through past use of DXM. While high on dextromethorphan, I would get caught in these patterns of thought. Unlike the Benadryl, the DXM did not provide corresponding visuals, and that experience was much weaker. However, the associations made on DXM were almost identical to the trains of thought I had on Benadryl. Totally unrelated thoughts suddenly seemed to progress in a logical and sensible order.",
  "The Benadryl almost did not affect me when I opened my eyes. I could move around quite normally, except for a very heavy and tired feeling. There was no high apparent on this stuff; I experienced no euphoria nor any philosophical revelations.",
  "Next time, I will try a substantially higher does of diphenhydramine. I will probably take around 12 capsules. This drug does not make me feel good or have any 'nice' effects. It is simply very interesting and unusual."
 ],
 "erowid": {
  "id": "20845",
  "citation": " Explorer. \"Low-Dose Brings Interesting Visuals: experience with Benadryl (Diphenhydramine) (ID 20845)\". Erowid.org. Sep 2, 2007. erowid.org/exp/20845",
  "substance": "Benadryl (Diphenhydramine)",
  "views": "69403"
 }
}
