{
 "title": "Unexpectedly Visual",
 "author": "Endologik",
 "citation": " Endologik. \"Unexpectedly Visual: experience with 2C-I & Carisoprodol (ID 33466)\". Erowid.org. Jan 25, 2008. erowid.org/exp/33466",
 "substance": "2C-I & Carisoprodol",
 "bodyweight": "147 lb",
 "report": "<p>I finally recieved my new order of 2C-I on friday and hurried to weight out 18mg. I'd previously started at 10mg, then 12, then 15, and now I decided to take it a bit further. I'd always been pleased with my 2C-I experiances but this episode would prove to be unexpectedly visual. I prepared 2 tablets one at 18mg as I mentioned and one at 12 mg for a friend on a set of .00mg scales. I then hurried over to the friends house anxious to test out the higher dosage. My friend had used 2C-I once before at 10mg and was pleased to have the opportunity to try it again.</p><p>I previously discontinued my 1mg prescription or Risperdal three days prior, as well was regurally taking 2-4mg of Alprozalom. Both of these were given for Anxiety and Panic attacks which I've suffered from for over 5-6 months. Note: I find psychedelics don't interfer at all or very little with my Anxiety issues, where as Caffeine, or Tobacco sends me into hell. Go figure?!</p><p>At any rate we ate a light dinner of 1 hotdog and a small portion of Baked beans. I was cautious as to this interfering with the trip, though in the end I experianced no discomfort.</p><p>We dosed at 6:30 PM and spent the next hour or so in friendly conversation. Calmy sitting on my friends porch enjoying the spring evening.</p><p>At 7:20 Pm I felt the first waves of the Phenethylamine trip building. I became very anxious, (in a good way) that the trip was starting so early for me. My friend didn't feel effects for another hour.</p><p>By 8:00 PM I was hurtling into a full blown trip. It seemed as if the visuals were never going to peek. I was amazed since the lower dosages I'm used to never produced such vivid colorful visuals. I was actually secretly questioning whether or not I'd recieved the correct product, even though everything gave evidence of the 2C-I effects, just so much more visual.</p><p>With this higher dose I didn't notice the normal body buzz on the come up that I ussally get and was a bit dissappointed. If I remember correctly at around 10:30 PM I felt as if I peaked, and was on a rough yet pleasuable ride. Not satisfied with the body buzz I took 3 350mg tablets of Soma (Carisprodol).</p><p>I felt the Soma's kick in about 40 minutes later, 11:10 PM, and became a bit wobbly to put it best. It synergized well with the 2C-I, and the only drawback was a slight 'numbing' of the visuals, yet not to a point of let down. It made the 2C-I buzz and body vibrations 50% more pleasuable. However I wouldn't condone mixing the substances, even though I've never had any issues myself.</p><p>I rode this wonderful carpet ride well into 3:30 AM or 4:30 AM. I am still in awe at how visual the trip was, as I didn't previously believe 2C-I was caple of such beauty, not at an 18 mg dose anyhow. My best memories were talking to myself in the bathroom and hearing my voice echo, as well as the shiftin vibrant patterns. Also CEV's were very similar to LSD or Mescaline. I could close my eyes and see wonderful swirling patterns, prisms, etc, and then slowly open my eyes and the patterns would feel the outside field of vision. It was magical.</p><p>Around 4:15 AM I ingested 2mg of Xanax to calm my comedown, and it worked nicely, the Soma's carried me close to the 4:15 Am mark, and the Xanax carried me into a deep nice, hard sleep. I ended up finally waking up around 3:00 PM. So I drained myself further than I thought I had. There were no side effects except for a general feeling of fatigue which tapered by 5:00 PM.</p><p>So all in all a positive, clear headed, surprisingly visual experiance.</p><p>Happy trails!</p>",
 "year": "2004",
 "id": "33466",
 "gender": "Male",
 "timestamp": "2008-01-25T08:00:00.000Z",
 "views": "8399",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 4:00",
   "amount": "1050 mg",
   "administration": "oral",
   "substance": "Pharms - Carisoprodol",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 9:45",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  }
 }
}
