{
 "title": "Hacking Up a Very Scary Mix",
 "author": "adam k",
 "citation": " adam k. \"Hacking Up a Very Scary Mix: experience with Kratom, Salvia divinorum (5x extract), Alcohol & Cannabis (ID 33463)\". Erowid.org. Aug 23, 2004. erowid.org/exp/33463",
 "substance": "Kratom, Salvia divinorum (5x extract), Alcohol & Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>I've been purchasing a lot of ethnobotanicals recently and have been keeping a stock of kratom for the weekends. Usually when I do the drug I use it as a replacement for alcohol, as I recently had a DUI and have been trying to cut back. Well, last night I was in party mode and before going out a friend and I smoked some salvia 5x extract and drank a glass each of kratom tea (made with 2 Tbl kratom powder in a espresso machine). We had a drink each before going. Something that night reacted very badly with the kratom.</p><p>We went to a club and met up with some friends. We had smoked the salvia and 1 bowl mid-grade mj at 7:00pm or so, drank the kratom tea at 8:00, and got to the club at 8:30. Over the next four hours we drank maybe 4 drinks apiece (we are both drunks and can drink 10 or more drinks without adverse effects). We smoked a bowl of very high grade mj and after that I went to the restroom and was violently sick. I was extremely pale and my head was swimming, and later returned and puked again. This second time there were no drinks remaining in my stomach, but I ended up hacking up very scary mix of what looked like wet black charcoal and grey fluid.</p><p>I went back to the table and tried to pull my head together and let my body settle, but I still felt very ill. My friend who had shared the kratom all of the sudden had to puke 10 minutes after I had returned the second time. He was also suffering adverse effects after purging his stomach and we decided to leave (about 12:30). He dropped me off at my house and I crashed hard and slept for 12 hrs, waking feeling alright but still having the kratom hangover.</p>",
 "year": "2004",
 "id": "33463",
 "gender": "Male",
 "timestamp": "2004-08-23T07:00:00.000Z",
 "views": "19191",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  "3": {
   "time": " T+ 1:30",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  "4": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
