{
 "id": 3350,
 "title": "Blue Moon Glory",
 "date": {
  "submission": "2004-10-06T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "riverwoman",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "While traveling in seattle I found a book shop, and in the back of the book shop I found an interesting book on ritualistic herbs published in the late 70's.  I read it cover to cover and was interested most in the morning glory.  I had heard it had effects, but never knew the dosage. It was a blue moon, and summer, and how could I not take a chance to try it? Despite protests from some of my friends I decided to whip up a batch according to a recipe in the book.  I found my seeds at a local flower shop.  They did not say they were sprayed, but after some reading, they may have been.  When I arrived at the store there was a wide variety.  I stood there a long time wonding what kind was a good idea, and chose a package of the blue variety. ",
  "First I ground my seeds into a fine powder. I began doing this by hand, and after me and my roommate's hands cramped up we went and borrowed our unknowing neighbors coffee grinder, which worked wonders.  Then I soaked it in water over night.  I filtered out the sludge and put that in a ginger milkshake.  The milkshake was to help get it into my body faster.  At this point I had been fasting for about 12 hours, so it worked.  The ginger was to help stop the nausea, which it didn't, but that comes later. ",
  "It began slowly about an hour later.  Did I mention that this was my first experience with drugs other then weed?  Well, the onset was slow, and I was unsure that it was real, so I decided to go to an independent college play.  I would highly discourage others from attempting to watch independent theatre while on morning glories.  In the hot black box theatre I tried to follow the story line (my roommate later told me that she couldn't follow it sober, so I was ok) and mosty have memories of blurs of red and blue and gold.  When it began to run over 2 hours I gave my roommate a pleading look and we left.  I had been feeling very nauseated this whole time and was very foggy, which was frustrating, since I was hoping for something more spiritual. ",
  "I arrived home and was feeling very introspective, and was enjoying the mild visuals that a poster of a lush waterfall was providing.  I also noticed that the trees were gently swaying and reaching out towards me.  Then I was thinking and I wanted to watch some people.  I asked my roommate to invite over another friend of ours who normally talks like tomorrow he will have his mouth sewn shut.  He is smart, and funny, and someone I thought I could watch talk for a long time.  Unfortunatly he brought another person, whom I am not comfortable with.  I am convinced to this day (as he knew I was tripping) that he was attempting to drive me insane.  I have no proof however, so we shall move on.",
  "Next my trip got darker, and much more unpleasant.  The nausea had gone away, or I had forgotten it.  Another person came over, and the lights went out, and there was a movie infront of us.  It was a war movie.  It was jungle and flashbacks and scary sad story line.  It was not good for me.  I decided that to retreat to my room would be a good idea.  I had cleaned it and my altar before proceeding with the drink, and I was hoping it would be peaceful.  I was also very tired.  However, no sleep came.  There was a bending of the walls and ceiling and fevered attemps at shutting my eyes and telling my body to calm itself and sleep.  Eventually I woke up the next day, but this was the worst part. ",
  "I was hungover in a bad way.  Everything was loud, and bright, and I had to attend classes.  The effects grew steadily less over the next two days, but I remeber repeating to myself over and over agian, 'why did no one ever mention a hangover after this drug?' ",
  "This was my first experience with morning glories, and with any hallucinogen.  I am thinking of trying it again, especially after finding  a more reliable prep method then my 70's text.  All and all, it was at least an intriguing first look, and I am determined to try again and again on various things until I get the journey my soul is seeking."
 ],
 "erowid": {
  "id": "20854",
  "citation": " riverwoman. \"Blue Moon Glory: experience with Morning Glory (ID 20854)\". Erowid.org. Oct 6, 2004. erowid.org/exp/20854",
  "substance": "Morning Glory",
  "views": "53236"
 }
}
