{
 "title": "The One I Can't Quit Even after OD",
 "author": "Anonymous",
 "citation": " Anonymous. \"The One I Can't Quit Even after OD: experience with Tramadol (ID 33515)\". Erowid.org. Jun 25, 2007. erowid.org/exp/33515",
 "substance": "Tramadol",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "Pharms - Tramadol",
  "(daily)"
 ],
 "report": "<p>[Erowid Note: see  Tramadol Dosage]</p><p>I have been taking trammies every day for a few months now.  6 pills at a time, a few times a day.  They are so easily accessible over the net, this is my downfall.  I still get a decent buzz, but it wears off very quickly now (1-2 hours).  I have ran out a couple of times and quit for a week once, and the withdrawal is to be feared.  Very sore muscles, very lazy and shaky, but the worst is not being able to get good sleep.  The symptoms get worse when I try to sleep, and I wake up very early and tend to stay up when all I want to do is rest.  Every bottle I get I swear will be my last, but it never is. </p><p>One time I had taken about 1200 mg throughout one day, and the next day could still feel lingering effects. I was at work as always, I took another 6 pills (300mg) and didnt feel much.  About 2 hours later, I took another 6.  Whoops.  After about an hour as I was talking to customers, I felt outside of my body, very spacey.  The next conscious thing I remember was laying on the floor in the back room with my boss staring at me asking if I was ok.  He said he just watched me have a seizure.  There was water all over the floor, I guess I had dropped my cup and fell into a wall when I had blacked out.  Needless to say I went home and was scared to death to fall asleep, not knowing if I would wake up... ever.  Anyway, I slept it off and felt alright the next day.</p><p>So far I have kept it a secret to everybody, except the person I had discovered them with, who now has his own share of addictions.  I must quit soon because I'm moving out with my girlfriend and that wouldnt fly for 100 different reasons.  I must wean myself off, I hope soon.</p>",
 "year": "2004",
 "id": "33515",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "6925",
 "dose": {}
}
