{
 "title": "Being in a Painting",
 "author": "Salvia Plath",
 "citation": " Salvia Plath. \"Being in a Painting: experience with Calea zacatechichi, Salvia divinorum, Leonotis leonurus, Cannabis & Alcohol (ID 33556)\". Erowid.org. Nov 15, 2004. erowid.org/exp/33556",
 "substance": "Calea zacatechichi, Salvia divinorum, Leonotis leonurus, Cannabis & Alcohol",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Leonotis leonurus",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "",
   "1 bowl",
   "smoked",
   "Calea zacatechichi",
   "",
   "2 shots",
   "oral",
   "Alcohol - Hard",
   "",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "",
   "2 leaves",
   "smoked",
   "Salvia divinorum",
   "",
   " ",
   "smoked",
   "Calea zacatechichi"
  ]
 ],
 "report": "<p>I received an ounce of dried Calea z. foliage in the mail yesterday, and as evening came on I decided I'd try it.  This was after I had smoked two small hits of my MJ/Wild dagga mix and drank two Coronas.  I simply packed a mid-sized bowl of the Calea and fired up the water pipe.  I had heard the smoke was intensely bitter, but I thought it tasted fine -- interesting, like lemon and MJ.  Finished the bowl.  And frankly felt nothing.</p><p>As evening became night, I took more drags of MJ/dagga, had two shots of tequila (Hornitos), and one more beer.  My wife and I ate dinner, then about 2 hours after I had smoked the Calea, we went up to bed to watch a movie, a documentary about Wille Brown's reelection in 1999.  For the movie, I packed the bong again -- this time (and in this order) with a pinch of Calea z., 2 leaves of Salvia, some dagga, and a large pinch of MJ.  As the movie rolled, we took occasional turns with the bong.  By the time the film was over, the bong was empty, and it was then that I noticed things were not okay.  I was nervous and in the grip of something quite strong.  I glance in alarm at the bong.</p><p>The room was glowing and everywhere I looked I could tell I was staring wide-eyed.  We turned off the TV and picked up books.  I found I was staring at the first page of The Turn of the Screw for about ten minutes because it looked odd.  It looked like a book would look in a very well-done surreal painting, and beyond it, the walls and everything also looked like a painting.  Everything was very detailed, but had an otherwordly quality to it, and the quality of light seemed to have been cranked up a few notches in various unexplainable ways, to reveal a level of detail and yet flatness in everything.  The book was an old one, and in my hand it appeared two-dimensional, though very sharp and crisp, and with a strange red/yellow quality of light about it.  I could see the grain in the paper, the worn spots, the imperfections of the page were all very pronounced.</p><p>I was very pleased by this, but the feeling kept getting stronger, and I put away the bong in case either of us reached for it again.  I just didn't know what was going to happen.  It was a feeling I have never had before, and things looked different in a way that I couldn't explain, but I am very experienced with many states of mind, and this was definitely new.  That's when I remembered the Calea.  I asked my wife if she felt anything strange, but she said she only felt high, and then I thought of the Calea I had smoked earlier, as well as in the bong recently, with the other stuff, and laughed with excitement at this new feeling, and after realizing that reading made no sense to me, I put down the book, shut off my light, and closed my eyes.</p><p>I had definite CEVs, mostly colorful patterns flickering and throbbing, that occasionally morphed into organic shapes, faces, creatures, landscapes.  It was free-flowing, and not particularly intense, but I found it hard to believe I was actually tripping based on the amount and kind of substances I had smoked and drunk that evening.  I remember giggling as I snuggled in deeper next to my still-reading wife.  It was a cocktail, for sure, but without question there was something striking and glaring there that I had definitely never felt before -- and the only thing I had never tried before was the Calea.</p><p>Only thing is, I believe the alcohol and MJ snuffed out my memory of dreaming.  I remember the fact of dreaming all night, and I woke up a couple times, but the content is gone.  I am so excited about this unexpected 'painting' quality of Calea that tonight I'm doing it again by itself.  I am very optimistic about this mysterious dream herb, which seemed to do something remarkable before I even went to sleep!</p>",
 "year": "2004",
 "id": "33556",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-11-15T08:00:00.000Z",
 "views": "13262",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": ""
  }
 ]
}
