{
 "id": 3356,
 "title": "24 Hours of Insanity",
 "date": {
  "submission": "2004-02-16T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "fireal",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Zolpidem",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "Carisoprodol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "5 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "It was a pretty normal night in my apartment.  I was having trouble sleeping, so I took one 10 mg ambien pill and 2 somas but for some reason I could not get any sleep so I started drinking some beers.  After a couple hours of buzzing I decided that sleep was impossible that night and I should just give up and take a trip.  In my inebriated state I pulled out a vial of 5-MeO-AMT, a substance I have never tried and poured out about the same amount that I would ingest of 5-MeO-DiPT, about 12-15mg. ",
  "Unfortunately I didn't know that 5-MeO-AMT is considerably more potent than 5-MeO-DiPT and I certainly paid for my own stupidity.  After a couple hours of coming up I finally passed out.  I woke up at about 7 am finally realizing that I had made a huge mistake.  I had ingested about 3 times the amount recommended in TIHKAL and I was suddenly tripping harder than I ever have in my life.  The only hallucinogens I have ever taken are mushrooms and 5-MeO-DiPT so I was very freaked out by the effects of this substance.  The whole room was swirling and dissolving before my eyes and everything I saw seemed to shift and breathe.  There was no way I was getting back to sleep so I just lay in bed and stared at the ceiling for hours trying to keep the trip under control.  I was still having massive visuals until about 2pm, and minor visuals until 10pm that night, about the same time I took the substance the previous night.  Everyone I looked at seemed to morph and distort so I just stayed in my room all day.  I had an irrational fear that I would get HPPD and never stop tripping but finally the effects started to wear off and that night a big slug of nyquil knocked me out. ",
  "I definitely learned a lot from this experience.  Never take a new chemical when you are drunk or high on something, and never underestimate the power of 5-MeO-AMT.  It could be the LSD of the next generation but must be used with extreme caution.  Just because something is temporarily legal does not mean that it is safe or healthy.  I probably will take this again in the future but I will definitely take it sober and ready for 24 hours of solid insanity."
 ],
 "erowid": {
  "id": "20869",
  "citation": " fireal. \"24 Hours of Insanity: experience with 5-MeO-AMT, Alcohol, Zolpidem & Carisoprodol (ID 20869)\". Erowid.org. Feb 16, 2004. erowid.org/exp/20869",
  "substance": "5-MeO-AMT, Alcohol, Zolpidem & Carisoprodol",
  "views": "12290"
 }
}
