{
 "id": 3359,
 "title": "Surreal to Sublime",
 "date": {
  "submission": "2007-09-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Sailor",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "<p>I first heard about Salvia on the web while looking for information on ayahuasca and possible legal highs.  It was described as an extremely potent hallucinogen and completely legal.  I was definitely intrigued and ordered a small supply of untreated leaves.  I wanted to try this first before venturing into the 5X, etc. that are also available.  My first experience was pleasant but not at all hallucinogenic.  I carefully took a small hit from a pipe and felt a sense of relaxation over my body and a slight feeling of being stoned, somewhat like marijuana lasted for maybe 30  45 minutes.  I tried this small amount later on again and it lead to an intensified sexual experience with my partner.",
  "As I experimented with slightly larger hits I began to experience visionary, trance-like states.  One time while sitting in my car I sucked in two good hits and experienced a swirling, undulating world of colors that resembled house paint.  The interesting thing is that the swirling tentacles of patterned color seem to move in and through the body as well.  There is a definite sensation of being part of that strange reality in a physical way. Unfortunately the setting that I had chosen for this experience was not the best and I became fearful that someone would find me in an obviously intoxicated state.  Fortunately the experience did not last long  maybe fifteen minutes -  before I was back to the consensus world.  However, It all seemed a little dream-like for awhile.",
  "Recently I had an evening alone (my partner is not into psychedelic experimentation) and I decided to try some of the 5X salvia that I had ordered several weeks before.  I had had a little brandy to drink which may have helped my courage.  It may have also effected the experience.  I filled a waterpipe bowl and and was able to get two good hits before sitting back on the couch with my eyes closed.  The swirling world came on very quickly and before I knew it I was in a weird cartoon-like world in which I was part of the landscape.  I was struggling to get up as I came to the realization that I was becoming more and more of an inanimate thing.",
  "Then I experienced myself as part of an enormous slow moving wheel as it rolled around toward the ground.  I became afraid as I experienced myself rolling down into the earth.  However, I was able to relax into the experienced although I was feeling myself being crushed into the ground.  It wasnt unpleasant however, just very weird.  What happened next is harder to remember or describe.  I lost all sense of a physical body or location and went into a state like deep sleep or emptiness.",
  "When I emerged from this state I found myself on the floor clinging to the couch.  The Deuter CD I had been playing had some ocean waves on it and I felt like I was clinging to a life raft after having been lost at sea.  I felt like I had witnessed something overwhelmingly beautiful or magnificent and kept repeating What a blessing!  Although I dont remember exactly what it was.  I stayed there on the floor for a few minutes longer and began to feel back in contact with the world.  I dont know how I got from the couch to the floor but my dog was looking at me funny.",
  "I have tried several other herbal highs, which have been fun but nothing compared to the intensity of salvia divinorum.  I plan to try it again after awhile when I am brave enough.  No alcohol this time though.</p>"
 ],
 "erowid": {
  "id": "20886",
  "citation": " Sailor. \"Surreal to Sublime: experience with Salvia divinorum (leaves & 5x extract) & Alcohol (ID 20886)\". Erowid.org. Sep 2, 2007. erowid.org/exp/20886",
  "substance": "Salvia divinorum (leaves & 5x extract) & Alcohol",
  "views": "2521"
 }
}
