{
 "title": "Postive Trance",
 "author": "I, Claudius",
 "citation": " I, Claudius. \"Postive Trance: experience with 2-CT-7 (ID 33616)\". Erowid.org. May 26, 2006. erowid.org/exp/33616",
 "substance": "2-CT-7",
 "bodyweight": "170 lb",
 "report": "<p>I took approximately 12 mg of 2-CT-7 orally at around 10:30 P.M.  I am a 32-year-old male who has had some experience with mushrooms, LSD, ecstasy, psilocybin, and synthetic mescaline.  I had not taken any other illegal drugs other than marijuana in nine months.  I was with three other peopleone of which took 12 mg of 2-CT-7.  The other two people were sober.  In addition to the 2-CT-7 my friend and I had about three hits of marijuana directly after injesting the 2 CT-7.</p><p>I obtained the 2-CT-7 from a pharmaceutical source.  The substance had been kept at 80 oC for two years and then at 20 oC for approximately two months.  The powder was an off-white color with a granular appearance.  The weight of the 2 CT-7 was 72 mg.  I divided the 72 mg of 2-CT-7 into three roughly identical amounts (24 mg.)  I placed this 24 mg of 2 CT-7 in 10 oz (~220 ml) of 4 oC unsweetened grapefruit juice.  I mixed the powder thoroughly in the grapefruit juice for about two minutes.  My friend and I split the portion of grapefruit juice evenly.  Thus, the total amount of 2-CT-7 ingested was equal to (24/2) 12 mg of 2 CT-7.</p><p>DRUG EFFECTS</p><p>There was no immediate physiological response directly after taking the grapefruit juice containing the 2-CT-7.  I couldnt detect the taste of the 2-CT-7 in the grapefruit juice.  I did not have any initial nausea or any kind of gastrointestinal discomfort upon taking the juice.  My friend also could not taste the 2-CT-7 in the grapefruit juice and, likewise, did not feel any initial effects from the drug.</p><p>After approximately 30 minutes we went out to a club to see a well-known DJ at a club close to the house.  We had to wait almost an hour to get into the club and it was frustrating to get into the club as I had purchased tickets beforehand and wanted to get inside because it was cold and damp outside.  During this time I felt the first effects of the druga + experience at around 1.5 hours.  My attitude towards the drug was probably amplified by having to wait out in the cold for an hour so I wasnt a very happy person.  I felt a subtle kind of intoxicationnot hallucinogenic but I just knew I was under the influence.</p><p>My friend who had taken the drug with me also began to feel the drug at this time.  She was much happier and I could tell that she was under the influence.  We got into the club finally and I danced a little bit.  With MDMA I am much more into dancing and the physical pleasure associated with moving is nice.  With 2-CT-7 I didnt get that pleasure from moving that I did with MDMA, but also I didnt mind things that would normally irritate me.  The club was so crowded and I got jostled about quite a bit, but didnt really seem to care about that or the fact that it was so hot.  The 2-CT-7 didnt necessarily make the music sound any better and I really dont think that 2-CT-7 is a particularly great club drug.  It wasnt hallucinogenic and didnt enhance the feelings of dancing like MDMA does.  Still, the 2-CT-7 seemed to put me in a good mood and it wasnt at all unpleasant to be in a club environment.</p><p>The DJ stopped spinning at 1:30 a.m and I was disappointed that things were ending so early.  I never got the flights of fancy that I get from MDMA or the intense empathy that I get from that drug.  Still, the 2-CT-7 was nice and it was good to be with good friends and I found that conversation and relating to my close friends was effortless.  The drug is completely grounding and never at all wiggy.  I felt completely in control the whole night even though I was at a definite ++ and approached a +++ </p><p>We went back to my friends house and hung out for about an hour.  I started to notice here, when things had chilled out a bit, the hallucinogenic qualities of the drug and the lights on the wall at my friends apartment took on a three-dimensional quality.  I left my friends house after a great night.  My friend who took the drug said that she had a great time and expressed an interest in doing it again [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] I drove hometotally without incident.  I felt very much in control of the car and didnt really have any problems driving.  I noticed here that the drug definitely kept me awake and had a stimulant quality to it. </p><p>I got back at 3:00 and tried to go to bed, but couldnt because of the stimulating quality of the drug.  Very cool hallucinations hereeven at this low of a dose.  The hallucinations compared favorably with the ones I had gotten on LSD or mushrooms.  There never was a sense of threat from the hallucinations and other than a brief moment I had very positive hallucinations all night.  I went for a walk at 4:00 a.m to work off energy and to get my CD player that I had left over at my apartment because I wanted to listen to music before I went to bed.  When I got back to the house I again tried to go to bed and couldnt. </p><p>I should say here that I have an exceedingly low tolerance for drugs and it is usual for me to have very, very long tripsespecially on hallucinogens.  I didnt mind (much) the fact that I couldnt sleep because the hallucinations and the music were so nice, in-control and interesting.  Normally on mushrooms or mescaline I have more muddled hallucinations that arefor lack of a better wordkind of gooey.  The hallucinations I got on 2 CT-7 (and on LSD) were the ones I likesolid, bright, and sharp.  Lots of lines and graphs and math and Mondrian-esque visuals.  Very cool.</p><p>Finally, I found it harder to hallucinate and gradually got to the point where I found the comfortable darkness that ends a hallucinogenic trip.  It was approximately 6:30 am when this happened.  So the total length of my drug trip at 12 mg was 8 hours from ingestion to sleep.  It was a very favorable experience. </p><p>My friend also related to me in a personal email that she enjoyed the experience and wanted to try it again. </p><p>SUMMARY</p><p>All in all a very good drug experience at a low dose.  Very much in control the whole night with no sense of threat at all.  Good hallucinations when I got into a quiet place and I would recommend it for a night of getting together with good friends. It didnt enhance the music and the hallucinations that I got were inversely proportional to the level of aural and visual stimulation that I received.  I found 2 CT-7 to be a good drug for introspection and allowed me to look at myself with insight and without judgment.</p><p>My friend who took the drug basically confirmed my experiences on the drug.</p><p>SECOND TIME</p><p>I did 2 CT-7 again at a dose of 20 mg and ingested the drug in the same manner as above with grapefruit juice.  Again I went out dancingthis time to an underground dance party here in Seattle.  I had a much more negative experience that the above experience.  There was no sense of threat or any kind of physical toxicity.  I just had a feeling of wasted energy in the midst of a wasted life.  The introspection that had been friendly during my first experience became much harsher in judgment.  Again I never felt any kind of threat at allmore annoyance than anything.  At the end of the night I had had such a fundamentally bad night that my sense of humor kicked in and I began to laugh at myself at getting myself into such a predicament.  By 5:00 am I was pretty much back down to a ++ experience and left the venue.  I went home and had, again, some fantastic hallucinationscrystalline and linear.</p><p>I should mention that the night that I took this drug was my birthday so I probably was not in a very good mood.</p>",
 "year": "2004",
 "id": "33616",
 "gender": "Male",
 "timestamp": "2006-05-26T07:00:00.000Z",
 "views": "13478",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(liquid)"
  }
 ]
}
