{
 "title": "A Glass to Hell",
 "author": "Russ",
 "citation": " Russ. \"A Glass to Hell: experience with Datura (ID 33612)\". Erowid.org. Jul 18, 2004. erowid.org/exp/33612",
 "substance": "Datura",
 "bodyweight": "70 kg",
 "report": "<p>Young and adventerious, willing to go the whole nine yards at the drop of a pin, I caught a glimps of something I wish I never saw. Standing proud in the garden of a complete stranger, a plant that was to change my mental state forever. The worst thing I've ever done.</p><p>I waited until night to make my move, raping the beast of the flowers that made it so recognizable. Boiling them up in a little water, I made a potion that would make me anything but the person that was born from my mothers womb. Drinking the muddy looking water was far from pleasant, and so were the affects. about 15 minutes rolled by and I was sitting scratching my head waiting, and BANG.All of a sudden I was locked in an extremily uncomfortable rushing sort of feeling. This lasted for roughly 5 minutes, and was followed by blured vision. I could not read anything small. I was looking at my watch trying to read the time, but no matter how close or how far I held it from my face it was a blur. It was'nt long before I was totally removed from the real world, and placed into a world of pleasure,fear,and discomfort. If there is a hell,I was on a day trip.</p><p>Walking around the house in an attempt to find myself, I was switching between fun times and bad bad times. I walked into my bedroom and as I past my wall mirror, I saw a stranger in my room. Standing to the side of the mirror, I was thinking, WHO THE FUCK IS THAT! It was about 5 minutes before I realized that it was my own reflection, and stood there laughing at my own stupidity.</p><p>Time seemed to just slip by, and before I knew it the next day had arrived. Smoking imaginary cigerates, walking outside completely nakid, and talking to people who would disappear into thin air, I started wondering if this was going to end at all. It did end after time, but it was not nice. I was out of it for 2 days, and comming down from it was very scary. It was a very evil feeling.I felt like I had sold my soul to the devil. I can't really explain it but it is not something that I can ever forget.</p><p>If I could find a time machine, I would go back and undo the terrible mistake that I made when I collected evil from someones garden.</p>",
 "year": "2004",
 "id": "33612",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-18T07:00:00.000Z",
 "views": "32650",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 }
}
