{
 "title": "Bold, Brave, & Strange - 1st time Shroom Trip",
 "author": "Howard",
 "citation": " Howard. \"Bold, Brave, & Strange - 1st time Shroom Trip: experience with Mushrooms & Cannabis (ID 3361)\". Erowid.org. Dec 13, 2001. erowid.org/exp/3361",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "230 lb",
 "header": [
  "DOSE: T+ 0:00",
  "2 caps",
  "oral",
  "Mushrooms",
  "(fresh)",
  " T+ 1:30",
  "3 caps",
  "oral",
  "Mushrooms",
  "(fresh)",
  " T+ 1:30",
  "1 cig.",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I just started using chemical substances this summer, at age 25.  I'd been doing ecstasy regularly, and I wanted to try mushrooms.  This would be my first time trying a psychedelic substance...and on top of that, alone.</p><p>I got home from work on a Monday night, and wound up having a fight on the phone with my younger brother.  I just got hold of 5 fresh average sized shrooms.  I was very eager to try them and did a lot of reading up on trip reports and effects.  So, I felt confident I could handle it (thinking I'd take a small dose the first time).  After I got back from the video store with a movie to watch while tripping, I blended up my shroom concoction.  I blended two mushrooms with a vitamin C tablet and a glass of orange juice.  I drank this mixture down around 8:00 pm.  I started watching tv.  I found a Tom & Jerry cartoon and I was laughing my ass off.  After an hour of not really feeling much, I decided to go out for a walk in my neighborhood. </p><p>I started walking around the block, and I started to feel a little bit of the mushrooms kicking it.  My legs felt a little weak and tingly.  I noticed the beauty in the trees and everything around me seemed really clear.  Sounds and smells were very intense. </p><p>I came back in after a half an hour, and decided to eat two more mushrooms...seeing that I really wasn't feeling much (after 1.5 hours).   I had some deep trance playing in the background (really cool when I'm on E).  I decided to smoke a joint, after hearing others' reports that weed will boost your trip.  After the joint, I ate one more shroom (for a total of 5). </p><p>Fifteen minutes after smoking, it hit me!  I had an intense body buzz.  So, I went to the washroom and saw that my pupils were pretty dilated.  I stared at the bathroom light, and then down at the mirror.  I saw what appeared to be the bathroom light, and watched it morph into a colorful circle that started to fly around on the mirror like a spaceship. </p><p>At this time, I laid down on the couch, as the weed was making me a little tired.  So, I closed my eyes and started to let my imagination run wild.  I was seeing all kinds of weird shapes and objects.  The minute I tried to concentrate on something and focus, everything changed...kind of like one of those crazy computer screen savers.  It was almost like flipping to a different tv channel every 3 seconds.</p><p>I then kinda lost track of time as I was lost in my imagination.  I started looking around the room...and I felt like a little boy scared in his bedroom, afraid of monsters.  The door handle on my closet door looked as if it was some man's face (all white) peeking out at me.  I kept glancing around the room and things looked scary.  I then said to myself that I'm tripping, and I was ok then.  I then started to concentrate on the trance music I was playing.  I had a really intense body buzz, which I believe was peaking.  I curled up into a little ball on the couch with a blanket covering me.  The strange thing was that I was having these slight convulsions, kinda like when you get the chills...but it wasn't painful.  When they were over, I smiled and started giggling.</p><p>I started to come down and decided to go to bed...around 12:30-1:00 am.  It was hard to get to sleep.  The comforter that I threw over myself was giving me this intense feeling against my body (like when someone touches you on E).</p><p>I eventually got to sleep...and felt wonderful in the morning.  I want to try shrooms again...probably go for like 5 or 6 shrooms all at once.</p>",
 "year": "2000",
 "id": "3361",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-13T08:00:00.000Z",
 "views": "54279",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  },
  "1": {
   "time": " T+ 1:30",
   "amount": "3 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  },
  "2": {
   "time": " T+ 1:30",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
