{
 "id": 3363,
 "title": "Playing the Game of Me",
 "date": {
  "submission": "2000-06-24T07:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "Co-Occupant",
  "gender": "Female",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>On September 23rd my husband and I had our first real Psilocybin experience. Having previously done fairly large quantities of LSD, I thought I would be well-prepared for new psychedelics. At around 10:30 we ingested about 2 grams each of powdered cubensis mushrooms, followed by an additional gram each about half an hour later. Eating the mushrooms was somewhat unpleasant, and shortly after the second dose my husband vomited. I was just beginning to feel the effects at that point and was overcome with sympathy for him. Vomiting on psychedelics is colorful but not exactly fun. I experienced mild nausea from 10:30 to about 11:30, but laying down seemed to alleviate it somewhat. I reclined on the floor and began watching the carpet shift and form moving patterns. The trip started a lot more quickly than I had expected, and I had a momentary fear that I had taken too large a dose. The lights became an annoyance, and we turned most of them off.",
  "One of the first things I noticed (aside from the crawling carpet) was how tense I was, especially in my neck and back. I then began to realize how anxious and tense I had been for some time. Almost immediately I began to hear another voice in my head...I wondered why my body felt so shitty, and the voice explained a number of factors in my life that had contributed to that. I felt sleepy, dreamy, and I succumbed to the urge to close my eyes. I began to enter a trance state. At first I hallucinated glowing 3-D molecules, strings of neon light and layers of iridescent, netlike fabric- but these soon gave way to heavier shit.",
  "I started receiving what I can best describe as genetic memory of the mushroom- its long history with humans, and I gained some insight into the shamanic possibilities it possessed. I was shown a number of paths I could follow, from reliving someone else's mushroom trip to experiencing death to performing acts of magic. It reminded me of the final scenes in Hesse's Steppenwolf.",
  "The voice was joined by other voices, which I thought to be earth elementals or vegetation spirits. All of the voices were friendly, helpful, and they helped me decide on a path for the trip- it was to be a metaprogramming sort of thing. A friend of ours spoke and I slowly came out of the trance and sat up.",
  "The hallucinations did not intensify in the same way that LSD does as you begin to peak, and the side effects were much less severe. I felt relaxed, comfortable, and mellow. I sensed that the mushroom was alive and with me, but I felt detached from the world and everything but my consciousness. Everything seemed unreal and unimportant. It was at about this point that our friend suggested we try some Nitrous.",
  "My husband did the first balloon. He sat with his eyes closed, smiling, for about 30 seconds, and came out of it laughing. He tried to explain what it had done to him but words seemed inadequate. He then joined our friend in trying to convince me to try it, but I didn't want to. A voice explained to me, 'That's not what this trip is about.' My husband did two more balloons, and seemed, for lack of better words, blown away by them.",
  "I began to slip back into a trance, and the serious work of my trip was begun in silence. Our friend put on some music, and I occasionally drifted out of the trance to ponder the strangeness of the lyrics. My consciousness was shown to me as a 3-dimensional board game with amazing multicolored passageways and columns. Together with the other entities, I began to play the game of Me. I started examining my interpersonal relationships and saw some large mistakes I had been making- the voices showed me, in a kindly way, that I had been selfish, neurotic, and guilty of perpetuating bad karma. My bitterness, resentment and anger were shown to me as a parasite I needed to let go of, and I did. I was overwhelmed with inner peace and joy. My ego slowly faded away and I felt like I was part of the Vibration of the All.",
  "As the peak ended, I started reconstructing my personality, and I was shown further work that needed to be done. Our friend went home, and my husband and I discussed what we had experienced as best we could. We smoked some marijuana, and the trip came to an end. I decided that the trip, although scary at times, was definitely a highly positive experience, and I felt a strong urge to thoroughly explore the strange world of psilocybin.</p>"
 ],
 "erowid": {
  "id": "2090",
  "citation": " Co-Occupant. \"Playing the Game of Me: experience with Mushrooms (ID 2090)\". Erowid.org. Jun 24, 2000. erowid.org/exp/2090",
  "substance": "Mushrooms",
  "views": "8046"
 }
}
