{
 "title": "Hell",
 "author": "Norm",
 "citation": " Norm. \"Hell: experience with Ephedrine & Cannabis (ID 33646)\". Erowid.org. Oct 31, 2006. erowid.org/exp/33646",
 "substance": "Ephedrine & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>I had never even tried more than once substance at once, so I decided, Ephedrine couldn't be dangerous, and I smoked weed alot with only 1 bad experience. I took about 60 mg Ephedrine, and decided to smoke the weed. I had just gotten some White Rhino, and this shit is one-hit-wonder weed. I went upstairs to my room and smoked 4 bowls of it. I was seriously fucked.</p><p>I could feel the effects after the first puff, but the ephedrine had started to take its effect, and making my heart pound faster and harder. I thought I was going to die. The blood was rushing through my body way too fast, and it was getting hotter with each pump. Sometimes when I smoke weed, I get kind of anxious, and my blood pressure gets to the point where my hands are shaking. This was one of those times. The ephedrine only made it worse, and I felt like my chest was on fire, the blood was pumping way too fast. I leaned back and it went up to my neck. My jaw locked and I was scared as hell that I was having a heart attack or something. I don't know to this day whether I had a heart attack or not. I thought I was in hell. I remembered back to something I had read when I used to go to church. I was thinking I was gonna be in that amount of pain for 1000 years or something. I thought I was in hell. When you're in that position, you feel like anything is possible.</p><p>I calmed down after about half an hour, and realized I wasn't in hell. I'm not saying anything is wrong with weed OR ephedrine. Fuck, I love weed. Just don't over do it with ephedrine. It fucked with me.</p>",
 "year": "2004",
 "id": "33646",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-10-31T08:00:00.000Z",
 "views": "15319",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Ephedrine"
  },
  "1": {
   "time": "",
   "amount": "4 bowls",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
