{
 "title": "Fibromyalgia Syndrome",
 "author": "APE DICK",
 "citation": " APE DICK. \"Fibromyalgia Syndrome: experience with Clonazepam, Venlafaxine (Effexor XR) & Cannabis (ID 33661)\". Erowid.org. Jun 9, 2007. erowid.org/exp/33661",
 "substance": "Clonazepam, Venlafaxine (Effexor XR) & Cannabis",
 "bodyweight": "110 lb",
 "report": "<p>My junior year in highschool I was experiencing chronic pain and poor sleep. I saw about 4 or 5 different specialists before I was diagnosed with Fibromyalgia Syndrome (FMS). FMS is a chronic pain disorder, mostly associated with middle aged or older women. Lucky me! I was diagnosed at 16. The most successful way of treating FMS is to move the patient into a normal and functional sleeping pattern. So what does the doctor do? She gives me Clonazepam, .25 mgs. I didn't really know anything about this medicine when I was younger, except that it made me sleep, and that my friends were willing to pay money for them.</p><p>I quickly gained a tolerance for Clonazepam and began sleeping poorly again. Of course, my doctor prescribed the simplest solution: take more. I eventually ended up taking 1mg a night for sleep; the bad part- if i didn't take it, I could not sleep at all. Also, the next day every muscle in my body felt like it had been pounded with a meat tenderizer, then tied in small knots. When I moved to college some two years after my FMS prognosis, I decided that I did not want to be addicted to a sleeping pill. So I slowly weened myself off of it. I went to a doctor specializing in FMS treatment and he agreed that weening myself off was a wise idea. I told him that occasionally I had bouts of depression and he immediately suggested that I take Effexor XR. I started on  35.7mg per day for the first week, them moved to 75mg. I really like my medicine at first. I slept better-- which ultimately meant I felt better.</p><p>However, after a few months of taking it, I started to notice some problems. I'm in college. Therefore, I do not have the most regular sleeping pattern. I am supposed to take my medicine immediately after my first meal of the day. Sometimes, I stay up til 7am and don't wake up to start my day until 3 or 4 at night. However, if I take Effexor that late, it keeps me up at night. Decisions, decisions. On these days I usually decide to skip a dose rather than not sleep.</p><p>After one night of missing the dose, I woke up with that spacy, day after an acid trip feeling in my head. I felt like my head was on a balloon disconnected from my body. Within 30 minutes of popping a pill, I felt better. I told my Dr. about all of this, and he told me that I was having seretonin withdrawals and that I should never ever miss a dose of Effexor. (He didn't mention all of this when first giving me this monster drug). And guess what? He moved me up to 150mg per day.</p><p>Though the balloon head feeling was annoying, it didn't seem like a big deal as long as I took my meds. However, just a few months ago, I was hit with some terrible stomach problem. I couldn't even keep water down for 4 days. Four whole days without Effexor practically ruined my life. I lost control of who I was, and what was rational. Everything anybody said to me, I presumed to be a personal attack. I was throwing myself around like a five year old having a temper tantrum, and all my friends became slightly afraid of me.</p><p>Let me clarify that before taking effexor, I had minor anxiety and depression problems. MINOR being the keyword there. I was never so out of my element that I couldn't quickly be the one in control. With effexor, I am not in control, it is. After the episode while I was sick, it seems to take less and less time for the withdrawal symptoms to hit me.</p><p>My friends never know when I will totally lose my shit because I forgot to take my once dubbed 'happy pill.' Now, it's my crazy pill. One day without this drug and I am a totally different person. My boyfriend, who is totally understand and caring about my medical problems, is fearful that one day I just won't come back from my little 'trip.'</p><p>My solution? Just smoke pot. When the funny feeling comes to my head, the only thing that levels me is to get real real real high. There is nothing, I mean nothing good about taking something that brings you so far away from reality (unless that's its only purpose). Pot does not fuck me up so much that my friends can't even recognize me.</p><p>I'm currently working on weening myself off of Effexor, and I will never ever again take any prescription drug for sleep or depression. People lived on this earth and dealth with their problems with out meds before, so I can do it now most likely with less side effects. Good luck to everyone.</p>",
 "year": "2004",
 "id": "33661",
 "gender": "Female",
 "timestamp": "2007-06-09T07:00:00.000Z",
 "views": "42336",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(daily)"
  }
 }
}
