{
 "title": "Not Thrilling, But Nice",
 "author": "Spicerack-F",
 "citation": " Spicerack-F. \"Not Thrilling, But Nice: experience with Diphenhydramine (ID 33729)\". Erowid.org. Nov 14, 2006. erowid.org/exp/33729",
 "substance": "Diphenhydramine",
 "bodyweight": "300 lb",
 "report": "<p>For the past two days I have spent the better part of my waking hours on diphenhydramine, and I enjoyed almost every minute of it.  The more I read about its dangers, the more that worries me.</p><p>I had never used diphenhydramine before except as a sleep aid in the recommended dose.  I wasn't using any other drug at the time, except caffeinated soft drinks with meals, and my usual quota of cigarettes.</p><p>What follows is adapted from the notes I took at the time:</p><p>Tuesday</p><p>4:00 a.m.</p><p>Took 5 Maximum Strength Sominex -- at 50mg diphenhydramine to a caplet, that's 250mg in all.  I may take more in an hour.  I'm going to go out for a smoke.</p><p>4:33</p><p>I'm watching a movie on TV.  No noticeable effects yet.</p><p>4:55</p><p>Slight loss of balance (I may be imagining it):  I stood up and found myself lurching sideways.</p><p>5:00</p><p>I've taken another 250mg.</p><p>5:06</p><p>A slight, almost imperceptible sensation of warmth in my abdomen; I also feel definitely light-headed.</p><p>5:40</p><p>Light-headedness is more pronounced.  I am only slightly drowsy. The experience so far is comparable to a 1st-plateau DXM trip or a mild drunk.</p><p>5:46</p><p>My pulse is normal, but weak.  I feel slightly warm.</p><p>6:04</p><p>The drowsiness is delicious.  Only, I keep *almost* falling asleep, then snapping out of it with a start.</p><p>I just heard three computer-like beeps, one long and two short.  I think it is an hallucination; there isn't anything in this room that normally beeps.</p><p>I know I should not by lying down, but I am anyway.  I'm trying not to fall asleep, though.</p><p>My legs feel as though they were about to cramp up.</p><p>6:53</p><p>It's getting harder and harder to stay awake.</p><p>My stomach is uncomfortable.  Not painful, and not exactly nauseous, but *uncomfortable*.  The rest of my body feels the same way, though not as bad; still, I can't find a comfortable postion to lie in.</p><p>5:18 p.m.</p><p>And sure enough, I let myself sleep -- a long, dead, heavy sleep, but surprisingly refreshing.</p><p>10:15</p><p>I'm trying this again:  5 left-over Sominex and 8 store-brand softgels of the same potency, 750mg in all.</p><p>11:16</p><p>No noticeable effects yet.</p><p>Wednesday</p><p>12:15 a.m.</p><p>Still no noticeable effects.  Perhaps I should have taken it on an empty stomach.</p><p>12:38</p><p>I'm feeling *something* now -- a kind of wooziness.  I'm going to take one more softgel.</p><p>1:41</p><p>I've taken yet another softgel, bringing the total to 750mg. Effects are obvious now, but disappointingly mild.</p><p>1:51</p><p>This has been happening for a while:  any sudden noise makes me tense up.  *Any* sudden noise, from the elevator bell to people laughing on TV.</p><p>1:57</p><p>I keep hearing little tapping and clicking noises.  I do not know if they are real or not, but they still make me shudder involuntarily.</p><p>2:43</p><p>My hands are *light*.  It's rather the same sensation you get when you pick up a cup you think is full, only to jerk it two feet in the air because it was empty, after all.</p><p>4:43</p><p>About an hour ago I was sitting, smoking, out in front of the dorm and suddenly I smelled pot.  It was only for a moment, though, and there was nobody around and no apparent source for the smell.</p><p>I decided to walk to the computer lab.  As I was walking, I saw several people standing in the distance.  (It occured to me that they might be the pot smokers.)  As I came closer, they disappeared, leaving only one.  He was standing behind some shrubbery, so I could only see his head and shoulders.</p><p>As I came closer still, the man's head disappeared and in its place there was a white folding chair standing on top of an outdoor table.</p><p>I'm back in my room now.  The effects have largely worn off, though cottonmouth, and a kind of tired feeling in my muscles, persist.</p><p>5:01</p><p>One thing I forgot to mention, but probably should:  this stuff has been playing havoc with my memory.  I'd be in the middle of a train of thought, and suddenly my mind would go blank -- leaving me wondering what I had been thinking about only a few seconds before.</p><p>4:18 p.m.</p><p>I fell asleep shortly after that last entry, and woke up about half an hour ago. I have 300mg left, which I've decided to go ahead and take.</p><p>5:36</p><p>It kicked in while I was eating supper about 15 minutes ago.</p><p>For 'only' 300mg, this is surprisingly strong -- it almost feels stronger than the 750mg last night.  My head and limbs feel light, as they did before, and I have the sensation of something thick and heavy wrapped around the top of my head.</p><p>My memory is going again, too.</p><p>8:23</p><p>Effects held steady, neither increasing nor decreasing, until shortly before 8.  Then they tapered off very quickly, and now I feel no more than the slightest intoxication.</p><p>Of course, I frittered the experience away watching TV.  When will I learn?</p>",
 "year": "2004",
 "id": "33729",
 "gender": "Female",
 "timestamp": "2006-11-14T08:00:00.000Z",
 "views": "23336",
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 16:15",
   "amount": "650 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 18:38",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 19:41",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 36:18",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ]
}
