{
 "title": "Worth Exploring",
 "author": "Catfish Rivers",
 "citation": " Catfish Rivers. \"Worth Exploring: experience with TFMPP & 5-MeO-DMT (ID 3381)\". Erowid.org. Oct 19, 2000. erowid.org/exp/3381",
 "substance": "TFMPP & 5-MeO-DMT",
 "bodyweight": "275 lb",
 "header": [
  "DOSE: T+ 0:00",
  "100 mg",
  "oral",
  "Piperazines - TFMPP",
  "(capsule)",
  " T+ 3:00",
  "5.0 mg",
  "smoked",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>Chemical Contentedness, with a side order of perma grin. That's the best way I can think of to describe TFMPP. Most accounts that I've read before seem to indicate that the reporter was left somewhat unimpressed by this compound. Though often compared to MDMA, it felt more to me like a clean lsd-25 tab sans visuals (although I would get an occasional flash image of a person standing in the periphery of my vision, which always turned out to be some object like the vacuum or my drums).</p><p>After about 2 hours into it, and having been toking throughout, I was in a good place. Not happy per se, certainly not that drunken state of chemicaly induced amor of xtc, but definitely wearing a smirk (my cheeks hurt from too much smiling). I stared into the concrete walls, breathing ever so lightly, in my basement. Gestaults connect and fade away from the nooks and crannies in the cement blocks. At this point I feel confident that the experience has leveled off at a comfortable peak. It is about 3 hours into the experience now. I sprinkle an ever so small amount of 5-MeO-DMT on some Shiva Haze bud. Certainly less than 5 mg was used. Something was a bit off beforehand, like an impossibly crooked picture frame on the wall. Something was askew somewhere. The addition of the 5-MeO-DMT however seemed to even things out.</p><p>The latest Modest Mouse cd was sqeaking out of my crappy computer speakers and it suddenly sounded amazing. Very much like MDMA now! Movement is enjoyable. 5MEO always gives me a rush feeling in my chest and a sense of tactile pleasure to my limbs. This coupled with the contentedness of the TFMPP is rather close to MDMA in my experience. I was able to drone into intuitive states while playing guitar. Definitely enables my creative side, without overhwelming my body to the point of not being able to play straight. Slight jaw clenching throughout. Not a problem. After 9 hours and a little bit of 1,4 butanediol and sleep comes easily. This definitely merits further studies.</p>",
 "year": "2000",
 "id": "3381",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-19T07:00:00.000Z",
 "views": "10706",
 "dose": {}
}
