{
 "title": "Interesting Experience",
 "author": "Flezz Durjis",
 "citation": " Flezz Durjis. \"Interesting Experience: experience with Salvia divinorum (20x Extract) & Cannabis (ID 33824)\". Erowid.org. May 23, 2007. erowid.org/exp/33824",
 "substance": "Salvia divinorum (20x Extract) & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I was led into a room when I arrived at a party where I could do my smoking. It consisted of four wooden chairs surrounding a small white table. The room was almost bare with nothing but a fan, window and white walls. I packed a bubbler bowl and passed it around a couple other guys hitting it twice myself. Then they left and I decided to hit the bong on the table. I hit it really big and was done after the first one. I felt incredibly high almost immediately.</p><p>Then I decided to smoke some salvia. I decided to once again venture into the realms of salvia after a somewhat uncomfortable experience or 2 a while back. I had a bag of 20x which is the second most potent blend of extract I know of, the highest being 40x(I'm fuckin scared of that shit!). So I prepared a tinfoil screen in my bubbler and poured about .25g of it in and burned it all in one hit, then held and held. I held it and gradually let it seeps out of my lungs as I began to feel it.</p><p>The scene of 3 empty chairs in a small cubical room with plain white walls and a small closet to the left of me froze in a picture frame in front of me. I could hear the yelling and wrestling drunken teenagers in the living room; I was a little organism - sack of skin - filled red stuff - thing. The feeling in the rest of my body seemed to leave my brain because I was able to keep still. It felt as though my brain was now the only part of my body except my eyes and ears attached by a fleshy cord to the base of my brain. I imagined myself in a transparent cylindrical tube of liquid.</p><p>I turned my head and observed textures and colors around me. Everything seemed to waver and 'breath' relative to its unique color and texture. I sat like this for about 7 minutes in awe of the way my body reacted to the salvia. I then decided to increase the dosage and try again - eager to try pushing the limits. The last hit being a cautiously small amount. The next hit I packed was about twice as big, but still quite small (~.5g). I lit it up as soon as I packed it and once again took a big hit and held.</p><p>The feeling from the last hit was still very strong but after inhaling, the intensity went up, about 30 seconds after hitting the 'breathing' had turned into 'bleeding.' The door in front of me had an amazing wooden texture. Like none I have ever seen. The 'bleeding' of this particular substance was amazing to see. This particular substance was amazing to see. These visual hallucinations are very comparable to those I have seen while on mushrooms. Once again I sat still in awe for a time. I moved my arms out in front of me. They felt like they were being pulled down by some kind of force. My butt and legs could feel the force pushing them into the chair and floor. I waved my hands side-to-side feeling as though I was petting some invisible object. It was incredible. The bleeding was still very strong after about 10 minutes from hitting the 2nd time. Time after the first 30 minutes of this experience was too indistinguishable.</p><p>But I had sat in the room for about an hour. In conclusion I thought this was the most enjoyable Salvia experience I have ever had. Other previous ones were sometimes dominated more by uncomfortable sensations like stabbing, poking, itching, and hotness. This was also the most visually stimulating experience. I feel that salvia is very unpredictable and random in the way it affects each individual. I know that some people can take hit after hit and not feel a thing while some feel it as soon as it exits their oral cavity.</p><p>As for smoking weed and salvia together, I think its best to smoke salvia straight in very small amounts. This yields the unique effects caused by salvia. When smoked in the same bowl as weed, I still get really fucked up, but I feel more of the weed interfering with the pure salvia-state. Smoking weed before however did help calm the experience and make me a bit more comfortable. Comfort is the most important thing when doing salvia. I also want to try experimenting with salvia and dreaming. I hear that it can help induce lucid dreams. Havent been able to do it myself, but I have felt a different kind of sleep state the night I smoked it. Peace then, hope this could help.</p>",
 "year": "2004",
 "id": "33824",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-23T07:00:00.000Z",
 "views": "2834"
}
