{
 "title": "Rhythmic Force of Salvia",
 "author": "Mr. Green",
 "citation": " Mr. Green. \"Rhythmic Force of Salvia: experience with Salvia divinorum (ID 3383)\". Erowid.org. Oct 20, 2000. erowid.org/exp/3383",
 "substance": "Salvia divinorum",
 "bodyweight": "125 lb",
 "report": "<p>I took two hits right after each other of Salvia, and I held each of them in for as long as I could. (aprox. 25 secs.) I was in a room by myself at a friends house, where I felt secure and relax. At first I began to see auras brighter and more defined as if I instantaniously was put into a deep meditative state. My mindset opened to a larger picture than what was previously obvious to myself. Although I felt fine, I began to have a flashback that I knew it was something that I had already invisioned. It was of myself at the same persepctive in the room I was in, and my friend coming into the room and asking if I already smoked it... then that same thing really happened the same way. And from that point on as I was calmly feeling the need to follow the force that was pulling and pushing me to go somewhere. I knew I needed to go outside and out of my synthetic environment. I lived the sequence of me doing this only a moment before it really happened. It was known to me exactly what was going to be said and how and what I was going to be looking at before I could really see and hear it. I realized that I was remembering this from a salvia vision that I expierienced on the strongest dose that I have taken.</p><p>I have experienced Salvia on a several occasions at various doeses, and each time I have felt the same rhythmic force that seems to pull in the same type of direction. The most intense experience with Salvia that I have had was when I smoked about 1/2 gram in one hit of 8x extract. I held the smoke in until I couldn't remember blowing it out. This particular experience was quite dificult to remember as far as the begining, but in the middle of it all my sitter went after me and coaxed me back into my appartment. I don't remember leaving, I just remember everything I was looking at repeating, as far as the structure of the building and the walkway, and I was on my way to do something extreamely important. My sitter told me that I said, 'I have to let everyone know', and I went with the direction of the force. I wasn't going to tell them about Salvia, I was going to tell them about the earth and the universe. If only the words didn't have to be so different from person to person, and who would believe, I was in an 'altered state.' This experience was very spiritual and although i couldn't remember leaving or the begining, I had an insight of the simplistic order of chaos as an on going perception. I have had these types of visions and wisdoms come one to me on various substances (shooms/marijuana/lsd/mdma/5MeoDIPT/salvia/glass), and even with no substances; only meditation techniques (silenced mind/breathing/feeling). Salvia showed me one of the most unique perspectives of this same type of thing that I have become enlightened to.</p><p>Although I don't fully understand the pulsing force that I feel on Salvia, I am familiar with it in a way. I don't know if it is something to with the energy fields of everything, and/or the chakra, but there is more to it.</p><p>One insight that I had when I finally made my way through my friend's apartment complex (which repeated in the same way as my apartment complex's structure seemed to - while I was on the extract) was a feeling that the force was of the earth and beyond, and that is a force that the earth vibrates on all the time, and that force is what gives it it's polarity, and the movement of the plates.... The vibration we all coexist on. I felt like other life normally feels that, and humans have gone against it until it is no longer obvious. I felt the earth cry at the solidification of it's developed land, and the waste of it's life, resources, and atmosphere. I saw a vision of this force erupting the land in a great scale, engulfing the surface from the mouths under the moutains in a magma rebirth.</p><p>I looked over at the tree that I made my way too away from the apartment building, and I saw trees far in the future as too valuable to materialistic people to allow to grow freely. It was more complex than that, but I don't have the words. By this time I started to come down and the movement was still pumping inside of me, but it was loosing intensity...and once again, I felt the Earth was my true mother, and existance was my father...forming an Oracle.</p>",
 "year": "2000",
 "id": "3383",
 "gender": "Male",
 "timestamp": "2000-10-20T07:00:00.000Z",
 "views": "10460",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 }
}
