{
 "title": "Indescribable beauty",
 "author": "Nicolai",
 "citation": " Nicolai. \"Indescribable beauty: experience with 2C-T-2 (ID 33840)\". Erowid.org. Nov 7, 2007. erowid.org/exp/33840",
 "substance": "2C-T-2",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "2C-T-2",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>A lifelong friend and I were camping last week in the Porcupine Mountains of the Michigan upper peninsula.  We had loads of cannabis and hash, and he brought two of these pills along.  He'd been lobbying for weeks to get me to try it, and I said I wouldn't on account of an idiosyncratic retinal disease that has robbed me of a lot of vision.  I didn't feel comfortable with a drug I hadn't heard of.  The second day was beautiful weather.  Glorious day on the rocks on Lake Superior.  At sunset, he took his pill and then stood around begging me to do the same.  I finally relented, just to shut him up.</p><p>Nothing happened for 45 minutes or so, when I became giggly and experience a nice body high with a little nausea.  He had taken his about an hour before, so he was already on his hands and knees staring at the grass, and staring at the sky.  The stars were brilliant.  We sat around the fire and he kept asking how I was feeling, and I kept answering 'Fine.'  Then he said 'Look at the grass' and shined his light there.  There were diamonds rising off the grass and it was all wavering.  I realized the seriousness of the drug and felt a little paranoia, as the Porcupine mountains are thick with black bear.  The paranoia soon passed.</p><p>I looked at the trees and they were dancing to the Oakenfold CD we were listening to.  The stars traced everywhere, objects wavered(his face melted when I looked it), and through these visuals I felt absolutely lucid.  I could speak/hear clearly and we described what was going on.  Deep conversation ensued.  In the cinders of the fire I saw faces, some I recognized from my past.  These were not just patterns.  I saw my own face, including a mirror like effect of seeing myself talk as I talked.  I saw animated paintings with cherubs flying, and lots more faces, most of which I couldn't recognize.  A feeling of well-being flowed through all of this, along with a great body high.  The experience opened up doors, I've never seen such indescribable beauty or felt so wonderfully in tune with nature.</p>",
 "year": "2004",
 "id": "33840",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-07T08:00:00.000Z",
 "views": "4784",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(pill / tablet)"
  }
 ]
}
