{
 "title": "Calming, Visual, Peaceful and Beautiful",
 "author": "CCCfunky",
 "citation": " CCCfunky. \"Calming, Visual, Peaceful and Beautiful: experience with DPT (ID 33862)\". Erowid.org. Jan 16, 2007. erowid.org/exp/33862",
 "substance": "DPT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)",
   "",
   "1 repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Background Info</p><p>I would consider myself kinda experienced with drugs - I've done a lot of K, MDMA and Mushrooms, and have dabbled around with LSD,2ct7,AMT and Mescaline, and have never had a bad experience, even at large doses (I have had several uncomfortable trips, but nothing bad in retrospect).</p><p>My Triphead friend has more experience with me, again mostly with K, MDMA and Mushrooms - and has had no previous BAD trips. We both have no mental issues, and are in good mindsets. Oh yeah, and were british. hehe.</p><p>The Setting</p><p>The setting is our student house, 4 of us live in a pretty pokey little house, made of spare parts. This house is great for trippng, the rooms are so small and random, that they all have separate atmospheres... mix in colored lights and trippy little things and there u have it.</p><p>It was a saturday night, in may. One of our housemates and 2 of his friends had were tripping tonight on mushrooms (Copelandia/hawaian). We had all recently finished the our exams (perfect excuse).</p><p>The Report</p><p>A few days before the trip, some DPT arrived. It was almost surreal, Id been talking about getting some for so long, and now it was actually going to happen. I remembered some good reports on the net, so the night before I was due to take it, i had a look so I knew what I was getting into.</p><p>For some reason I chose to focus mainly on the Bad trips report section - of which there seemed to be quite a lot. A thought occured to me that it was probably a bad idea to remember all these reports as it was likely to affect my trip - the second I thought that I knew it would be impossible NOT to think it, as I was trying now to avoid it (I hope that makes sense, the more I want to forget something the more my mind reminds me of it) - which worried me slightly, but I went to sleep.  To clarify at this point, this worry was pointless -  a lot of the bad trips I read are misleading - many people seem unaware of the realities that Ego Death brings. For example I have heard so many people say they hated K-holing, which I put down to them not being ready at all for that kind of consciousness shift. I believe this is also the case with a lot of experiences of DPT.</p><p>Anyway, at about 9.00 Pm our friends ate the magic mushrooms, we talked to them for a bit. and started to film the video of the night on my camcorder. We left our friends downstairs for a few hours and went back upstairs to smoke up and play some sonic the hedgehog. We waited till about 11:30 Pm, before we measured out 100mg of DPT, and dropped it on the carpetted floor.</p><p>Damn.</p><p>Well, we measured out a second 100mg's over another spliff, set the video camera up and sniffed. Sniffed a bit ambitiously and coated the back of my throat with DPT crystals. Which slowly numbed my throat and generated realllly nasty phlegm. eiiu.</p><p>The next 30 minutes were, strange - I had got a bit nervous before taking the DPT, that I wouldn't enjoy it. This, combined with the DPT state seemed to give me a lot of adrenaline rushes, to the point I was shaking - but I was still very much enjoying myself. I puked to psychologically sort out my stomach, but hardly at all, and by this point, Id started to come up quite a lot ( +20 mins ). I felt like Id just done about 100mg's of Ketamine, but I was also starting to trip, hard.</p><p>At +40 mins I was a clear +3. I couldnt speak, the drug had pushed me onto the floor, making me very sleepy - this was to con me into closing my eyes to the most amazing CEV's, which all semmed to be viewed through my camcorders screen ( this was quite interesting ). It was at about +50 minutes when I realised the extent of the OEV's - much more intense than high doses of mushrooms or AMT. Its hard to describe how beautiful they were. Better Visuals than LSD?? Still cant decide. Seemed different at the same time as being very simlar, I dont know.</p><p>As for my mental state, I felt mentally relaxed for the entire trip after puking. I also felt physcially relaxed, and in a very blissful, amazing state. In my head I would get a regular thought/inpulse and then experience it several 'layers' down represented visually and by also random gestures and words.I didnt talk much at the peak (+45mins - + 1hr 15  mins) - just lay on the bed laughing occasionally, grinning, and staring at things. A few minutes later, I felt in complete mental control, and the visuals began to decrease.</p><p>At this point my Triphead friend was enjoying an almost K-hole state with very vivid, amazng CEV's. I believe I was noticing strong effects after 10 mins past insuffulation, but he took 30 mins to come up.  After this it was a very pleasant return to baseline, by about +3:00.</p><p>I have to say, after the trip I felt good, really good. DPT welcomed me to its realm with some of the most beatiful visuals I have ever seen, along with a fantastic sense of cosmic well being. I am definately going to experiment with higher doses to try and explore the more extreme peaks that lie as its reward, hoping to learn a lot more, and murder my ego with this drug.</p><p>:D At the moment, im keeping by my bedside.</p>",
 "year": "2004",
 "id": "33862",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-16T08:00:00.000Z",
 "views": "10736"
}
