{
 "title": "It Was a Seizure",
 "author": "Anonymous",
 "citation": " Anonymous. \"It Was a Seizure: experience with Alprazolam (Xanax) (ID 33880)\". Erowid.org. Sep 1, 2006. erowid.org/exp/33880",
 "substance": "Alprazolam (Xanax)",
 "bodyweight": "166 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Pharms - Alprazolam",
   "(daily)"
  ]
 ],
 "report": "<p>I started taking Xanax occasionally for recreational uses about 6 months ago, just every once in a while. Wed get 50 and take them then not try to get more,  just take them when more came. Then I started to realize that Xanax was making me feel better about myself, I wasnt as anxious, (obviously) and I felt good when I took a milligram or two a day. I began taking them every day. When my dealer couldnt get me them anymore, I went to my doctor. I said hey, these really help me out; I can be myself with them. I had a great relationship with Xanax, I started taking them legally. I had a prescription, and I was taking exactly how many I was supposed to. That was 3 months ago.</p><p>My dosage has gone from one milligram a day to taking two to four, 2milligram bars a day. I was content with taking my Xanax everyday I was happy, and could do what I wanted to do in life. Then I ran out of pills. It was 3 days till my next refill, so I was like Ill just wait it out. On the second night I didnt sleep, I had this feeling of crawling out of my skin and I was jittery. The third morning after that restless night, I couldnt stop chattering my teeth. I was freaking out. I was like ok, ok Ill take a shower, and get my refill. I ended up taking a one and a half hour shower without even noticing it. I didnt feel alive. I was dead. I had no emotion feeling, energy, anything, I was a conscious corpse. Then I was ready to get my refill, I went upstairs to go out, then I collapsed. I had a grandma seizure. Every muscle in my body cramped up at the e same time and I stopped breathing.</p><p>Luckily there were relatives upstairs who called 911. I came to about 5 minutes later sore as hell and wondering why all these people have this petrified look on their faces looking at me, I was combative with the EMTs, cause I didnt know what happened, I said I fell. I was convinced I didnt have a seizure, but they took me to the hospital anyways despite the fact that I was sure I didnt have a seizure. Then on the way to the hospital, I started puking and shaking again. I got to the hospital, and was given 2mg of Ativan to calm me down and some phenegram to stop the nausea. The ER doctor told me I had a seizure and reduced my threshold for seizure by not taking my Xanax for those three days. I got my refill, and realized I was completely controlled by this little white bar. I HAD to take it everyday, or I knew the consequences. Xanax still made me feel ok, but I despised the fact that my life was under the control of a pill.</p><p>I am now trying to get off of it, and it will take over 6 months to totally wean myself off. I have to reduce my dosage .25 milligrams every two weeks. The point of all of this is that Xanax is great for shot term use of anxiety disorders, but it can grab hold and never let go. I am still tapering off of it. I am in a treatment program for a dug that I was prescribed and took exactly the way I was supposed to. Now I have an extreme hatred for Xanax in my life. I am controlled by it, I hate it. Its so addictive, I had no idea. The withdrawals are hell.</p>",
 "year": "2004",
 "id": "33880",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-09-01T07:00:00.000Z",
 "views": "30535",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(daily)"
  }
 ]
}
