{
 "id": 339,
 "title": "Sipping the Test",
 "date": {
  "submission": "2006-04-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Catmint",
  "gender": "Male",
  "weight": 11
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  }
 ],
 "report": [
  "In my curious quest for trying things new, I ventured into a local petshop and bought a 1 Oz loose of catnip.",
  "This all emptied in a pan with 1 pt water and brought to boil for 5 mins and then steep high temp for a further 15 mins, then drained and the water was mixed with sugar and peppermint tea bag to drown out the foulest tasting stuff since (Strong)magic mushroom tea.3/4 of the yuck was drunk. This has more than likely put me off taking it again. Too much :)",
  "My state of mind before taking catnip tea was stoned on hash to a fiar level, which is the norm for me.",
  "After about 15-20 mins I started feeling the effects of the tea, quite relaxed definately noticable and enhanced feeling of almost wanting to burst into a mild trip, this never happened , but I did think quite stragely, made me think of things I havnt thought of before, some memories of tripping which I never remembered, this was quite nice. I went to bed and had no problems sleeping, I never really do.",
  "The next day at work i felt vagely trippy all day, but nothing unpleasent, rather pleasent really. About 6 at night after being it for a couple of hour from work, I had a few pipes of hash, I started feeling quite wierd and trippy, this passed soon but was slightly unnearving (felt like it could be a bad sign,i knew it wasnt, therefore I guessed that i was a little bit jittery from the catnip, and to just get over it), but odd. The next day i still felt the effects but were very sutble.the day after I was normal."
 ],
 "erowid": {
  "id": "10530",
  "citation": " Catmint. \"Sipping the Test: experience with Catnip (ID 10530)\". Erowid.org. Apr 12, 2006. erowid.org/exp/10530",
  "substance": "Catnip",
  "views": "15784"
 }
}
