{
 "title": "Becoming the Machine: A Comparison",
 "author": "Zoink",
 "citation": " Zoink. \"Becoming the Machine: A Comparison: experience with Methylphenidate & Ampheramines (ID 33927)\". Erowid.org. Nov 10, 2007. erowid.org/exp/33927",
 "substance": "Methylphenidate & Ampheramines",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "",
   "Amphetamines",
   "",
   "108 mg",
   "",
   "Pharms - Methylphenidate"
  ]
 ],
 "report": "<p>After taking Adderall for ACT's, I decided taking Concerta (Methylphenidate) might help me out, too. I got 2 54 mg Concerta's from my freind. After cutting them open, removing the shell and the inner membrane, I cut off the push compartment. I proceeded to crush up the remaining methylphenidate, and put it in a bag for the next day. After studying the night before, I was tired. Around 7:30 am, I went to the bathroom, and consumed half of the 108 mg bag. The shit made my snot very, very sticky. I began to notice that I was more awake, and more aware. I could focus extremely well of my studying. After an hour, I took in the remaining 54 mg.</p><p>My mind began to focus heavily on school. I had to do a presentation, and did a good job. After that I studied for my math final, which was next. I almost seemed obsessive toward my work. Anything else did not interest me. My creativity had been sucked away, and any strong emotions dissappeared as I entered a drone-like mentality. Unlike Adderall, Concerta helps me study by clearing my mind of everything else, and making me want to do nothing except work. I am left devoid of most feelings that make me who I am, and become a mindless automaton.</p><p>With adderall, I felt great, and wanted to do my school work because it just seemed so damn fun at the time. I loved everything, and wanted to jump 18 feet in the air. I was full of energy, and could not stop talking, be it to myself or someone else. I rocked out like never before listening to Metallica, and had the greatest time taking the ACT while feeling great.</p><p>Methylphenidate makes me the perfect working machine. Adderall makes things I hate suddenly become bearable, if not more so, and enjoy life for what its worth. Do beware, the potential for addiction is VERY high. Not a day goes by that I haven't thought about it.</p>",
 "year": "2004",
 "id": "33927",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-10T08:00:00.000Z",
 "views": "13836",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "Amphetamines",
   "form": ""
  }
 ]
}
