{
 "title": "Relaxing Without Being Distorting",
 "author": "Jennifer",
 "citation": " Jennifer. \"Relaxing Without Being Distorting: experience with Hops (ID 33931)\". Erowid.org. Aug 25, 2005. erowid.org/exp/33931",
 "substance": "Hops",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Hops",
   "(dried)"
  ]
 ],
 "report": "</p>\nI have been using hops almost daily and it has become my favorite herb of all time. Hops is related to cannabis and I have noticed some cannabis-like effects from it. I normally use hops in a cigarette with tobacco. It gives a nice relaxing effect and heavy eyes. In many respects it's like smoking pot minus the head change. I really enjoy the relaxing effect without having my thoughts distorted like when using cannabis.</p><p>I also find that vaporizing hops give a stronger effect. When I vaporise I just do it in my pipe with a lighter flame above the bowl. Hops won't set me back like cannabis does but I notice it. Another thing I really like about it is that because it's used in brewing beer the chances of it becoming illegal are virtually 0. Additionally, although hops is related to cannabis it is not likely to show up on a drug test.</p><p>After having vaporised a bowl: I mentioned that it didn't give me a head change. What I mean my that is that my thoughts are pretty clear on hops. But hops does what I call 'selective stupidity'. Basically hops can make me a little stupid if I allow it to, but if I need to do something my thought process is not significantly impaired. Also as far as visuals go, it gives my vision a kinda 'hazy' effect kinda like cannabis does. Even though I am an almost daily user I don't vaporise that often and I forgot how strong an herb it actually is. Dispite its legality hops can be set me back pretty good if vaporised. Vaporising in a pipe with a lighter flame works really well.</p>",
 "year": "2004",
 "id": "33931",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-08-25T07:00:00.000Z",
 "views": "23547"
}
