{
 "title": "The Craziest Thing Ever to Happen to Me",
 "author": "Antface10k",
 "citation": " Antface10k. \"The Craziest Thing Ever to Happen to Me: experience with Salvia divinorum (6x extract) (ID 33948)\". Erowid.org. Dec 7, 2007. erowid.org/exp/33948",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "145 lb",
 "report": "<p>I've heard so much about salvia divinorum. My friend 'Will' is very gung-ho about this plant and its crazy psychoactive effects. After trying it once at a party, (I know, completely wrong circumstances) I was quick to call 'bullshit' on it. I thought 'How can a drug that depends entirely on mindset really have any effect? Why can't it just take effect regardless?'</p><p>A few days ago, I went to visit my friend 'Jerome'. When I opened the door to his apartment, Will and Jerome were lounging about in comfortable chairs. The room was only lit by candlelight, and Radiohead's 'Hail to the Theif' was playing. I knew something was up. Apparently, they had been tripping on salvia. I had interrupted their little voyages, and I felt kind of bad, for that had happened to me the only time I tried it.</p><p>I decided to do it. They left me alone in the living room and they went outside to smoke some cigarettes. I calmed myself and laid on the floor and began to take hits of the 6x extract Will had. About the third hit, I felt this weird wave of heaviness, it was familiar. The first time I attempted to do it, I literally got stuck to a wall. With my body. After the bowl was finished, I noticed I felt pulled down. I closed my eyes. Strange geometric patterns appeared. On the backdrop of my closed eyelids, a line bisected my visual field. The line turned out to be two edges angled towards me, meeting at the line. It also felt as if my head and body were being bisected, I was being split according to my bilateral symmetry.</p><p>After that, I thought 'Woah' and decided to reach over and pack another bowl. I was having a hard time walking, my limbs were heavy and slow. I walked over to the jar of the extract and packed another bowl in the glass pipe and sat down in the chair. I started to take hits. All of a sudden, things got really crazy. It was about the third, fourth hit, I don't know, that I my arms just dropped and I closed my eyes. I began to see the bisecting pattern again, but this time the two surfaces joining at the center were layered, textured almost. At first the layers were comprised of little guys who resembled smurfs. I called them the 'pez smurfs' because like a piece of PEZ candy, they had an intented center.</p><p>Then these pez smurfs turned into massed of people, looking up with their arms outstretched. I don't know why they were doing that. I felt like I was supposed to be going somewhere, taking a ride. The feeling was strange, I knew I was supposed to take this ride and I was mentally dragging my feet to try to figure out what the hell was going on first. Eventually I thought 'fuck it' and let whatever was wanting to take me somewhere whisk me away.</p><p>I started to spiral downwards and I remember hearing myself cracking up in laughter as I spun through what seemed to be myself. As I continued to spiral through myself, parts of the ride seemed familiar, like a very surprising deja vu. The ride seemed to exit through my feet. After that happened, I saw a dartboard like shape, but the various sized rings were made out of people of different colors. It was like a giant mosaic made out of a crowd of people. The whole shape seemed to radiate outwards, like a ripple expanding across a pond.</p><p>Soon I found myself in my head. However, the textures of the walls inside of my head were comprised of the same people who had been recurring over the course of this trip. I could look side to side in my head and the people would move depended on if I looked their direction or not. I began to feel the parts of my brain that I had never used begin to work. I felt almost like an energy racing through various parts of my brain.</p><p>Soon after, I came down and was completely dumbfounded by what had just happened to me. They say salvia provides you with insight and/or answers to your life, but I was filled with more questions than answers. In fact, I felt like I NEEDED to figure out what had just gone on, why the recurring theme of crowds of people, why parts of my consciousness felt familiar. I was just completely perplexed and blown away by the experience.</p><p>I walked outside and Will and Jerome were standing there. We went back inside and sat around and drank some Kool-Aid and watched Jerome play Tiger Woods golf on his PS2. I was vividly describing my trip to Will and drawing out pictures. He was continuously interjecting personal experience along with bits he has read off the internet and other various ideas. It kind of irritated me. For the hour or so after the trip, I felt profoundly curious, if not a bit insane.</p><p>Salvia has to be truly the craziest drug I've ever experienced. I have experience with a number of substances, first and foremost weed, and I've never even thought this type of stuff could happen. I'm still completely freaked out that the salvia actually worked after my bad initial experience. I feel now that I am prepared for almost any sort of tripping that might come my way. I haven't heard of any other hallucinagen that takes you on such an insane introspective journey.</p>",
 "year": "2004",
 "id": "33948",
 "gender": "Male",
 "timestamp": "2007-12-07T08:00:00.000Z",
 "views": "2900",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  }
 }
}
