{
 "title": "Inside of Time",
 "author": "BL3ND3RH3AD",
 "citation": " BL3ND3RH3AD. \"Inside of Time: experience with Ether & Cannabis (ID 33945)\". Erowid.org. Nov 29, 2007. erowid.org/exp/33945",
 "substance": "Ether & Cannabis",
 "bodyweight": "130 lb",
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>It was spring break of my sophmore year in high school and at this point in my life I had been using any chemical that came my way for about 6 months and I had been quite experienced in the use of DXM and cannabis among other random pills and inhalants, but this for me was not enough. I wanted something new, I wanted something more. This is when me and a friend of mind had learned about ether from the movie 'Fear and Loathing in Las Vegas' so my friend and I had looked up how to find ether and how to extract it from its source, which in our case was starting fluid. We soon found out that the extraction of the ether was quite simple, so we went to a wooded area by my house, loaded up a few rags, and huffed away.</p><p>We loved it, the high was great and unfortunatly I loved it a bit too much. The day after my friend went home and I decided to get another can of starting fluid. I got home, smoked a bowl of some fine marijuana and grabbed my big fat bottle of ether and started huffing. After about a half an hour I went into my own head, I was watching time move. I was no longer on the earth, I was in fact inside of time, And my brain had told me that I was going to simply dissappear from the earth and beacome part of the constant perpetuation of time.</p><p>My brain was showing me inside of my mind exactly how time moves and I found out that it moves in a square pattern in which when one gets to a corner of the square one would become a number. So I was the number 1, then 2, then 3, and so on and by the time I got to 5 or 6 I realized that my physical body was walking in a square pattern around my room. I found out about my movement pattern because when I would walk into a wall and hit my head I would tempoarily snap back into conciousness and then go right back into my 'head trip'. I use the phrase 'head trip' beacuse I was not actually seeing anything but rather I was inside of my own mind basically imagining all of this, but the thoughts were so concrete and real that I thought I was actually there, inside of time.</p><p>After the trip was over (about a 15 minutes long) I was absolutely freaked out by what had happened to me and I thought I was going insane. But then I realized 'it's only chemicals'. I have used ether everyday for my spring break and then had stopped my use because I had fried myself and became a bit stupid for about a week. I have used ether occasionally after that week and had alot of cool experiences, but none as heavy or psychologically damaging as that one fateful afternoon in my room. I still think about this experience to this day and I will never forget it.</p>",
 "year": "2002",
 "id": "33945",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-29T08:00:00.000Z",
 "views": "10094",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "10 oz",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(liquid)"
  }
 }
}
