{
 "title": "A Strange Memorial",
 "author": "Andrew",
 "citation": " Andrew. \"A Strange Memorial: experience with Amphetamines (Adderall) & Cannabis (ID 33942)\". Erowid.org. Jul 1, 2007. erowid.org/exp/33942",
 "substance": "Amphetamines (Adderall) & Cannabis",
 "bodyweight": "185 lb",
 "report": "<p>In April, my favorite grandmother, one of my favorite relatives, passed away in the hospital. I never got to see her while she was sick, and took for granted that she would get out okay. I still often feel bad about much of this, but my experience one April night helped me out quite a bit.</p><p>A few nights after she died, some friends and I were hanging out in the college dorm. One such friend was selling some of his prescription Adderall at the time, and I wasn't terribly interested. However, I received a call from my mother, who said she had found an unsent letter from my grandmother when she was in her house. I figured it wouldn't have much to do with the situation, but I had a strong urge to go read it. However, I was starting to get tired, and it was very late. I could have waited until the next day, as I had no class, but I decided to act upon my impulses instead. I bought a 20 mg pill from my friend, and decided to drive back home.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>It was time released, and I didn't start feeling it until about 10 minutes into the drive(the total drive was about an hour). I had tried alcohol and marijuana before, but this was nothing like them. There was no 'high' at all, and the effects were much less noticable to me. However, I was a bit more nervous than usual about the other cars on the road, and I was no longer sleepy. I simply felt as I usually do in the middle of the day.</p><p>When I got home, I noticed that my mother didn't seem to detect anything different about me either. I realized I had been severely misinformed about many drugs in school. Anyway, I opened up the letter, and it was a get well note from a few years ago. I noticed that she also added an antecdote about a couple birds near her house. I thought about how this reflected on her personality. The Adderall wasn't particularly making me feel as though I were concentrating harder, but it was much easier to avoid being distracted. Afterward, I decided to drive back to campus and see what people were doing.</p><p>On the way, I decided to break into the music building, get out my saxophone, and play 'Amazing Grace' in tribute to her. I got a couple other similar ideas, both of which I acted upon. Basically, I got a bunch of ideas that I would usually never act upon, but I did so, presumably because of the adderall. After this tribute, I went back to the dorm where my friends and I talked about some lost relatives of ours, and I felt a lot better.</p><p>Near the end of the night, when only those of us on Adderall were still awake, we got some marijuana out and smoked it. I was a little nervous about it at first, but I decided to try anyway. Where I usually get a pretty giggly high from marijuana, this time it was more as though everything was very fascinating. I would notice a thing or event that would usually seem commonplace, and I would reflect upon it as though it were completely new to me.</p><p>My friends seemed jealous - apparently they were crashing, so I decided to leave while they fell asleep. I was pretty nervous about how I would feel when the drug wore off, since I had heard stories that made it seem very uncomfortable. However, after I had been up for about 24+ hours total, I simply went to bed and fell asleep. I felt completely fine, though this might be attributed to the fact that I usually have trouble getting to sleep.</p><p>All in all, I was happy that I was able to give a nice tribute to my grandmother, and I discovered that I like the feeling of a marijuana high on speed. However, I try to do it very rarely so I don't feel the need to be on speed every time I get high.</p>",
 "year": "2004",
 "id": "33942",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-01T07:00:00.000Z",
 "views": "6406",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
