{
 "title": "The Nihilism of the Clear-Eyed",
 "author": "Jikkle",
 "citation": " Jikkle. \"The Nihilism of the Clear-Eyed: experience with Mushrooms (Psilocybe) (ID 33956)\". Erowid.org. Jun 2, 2004. erowid.org/exp/33956",
 "substance": "Mushrooms (Psilocybe)",
 "bodyweight": "130 lb",
 "report": "<p>Last night I went over to my girlfriend L's. She wasn't in her room, so I decided to go visit G1 until I could track her down. I sat down and talked with him about our plans for the Summer, and we smoked a spliff of tobacco and really beautiful marijuana - it was spiky, resin-covered, strongly smelling, and looked like a tangle of tentacles. The spliff was extremely harsh, given its lack of a filter and the fact that I don't smoke marijuana or tobacco very regularly, so I couldn't smoke it very aggressively. I did feel somewhat stoned.</p><p>B came in for a while, and we gave the suite's cats catnip and played with them. Eventually they decided to go to the supermarket and get some food, so I went back to L's room, where I found her.</p><p>We went downstairs to see our friends M and W. They wanted to know if we were interested in buying some mushrooms and perhaps going to see a movie at the Omnimax theater nearby. It sounded like a good idea to us, so after some consultation with another friend, we ended up acquiring 3 small bundles, each containing an eighth of an ounce of one or another Psilocybe species. [Based on my description of the experience, a friend suggests that the mushrooms were probably P. cubensis.] After remarking on the interesting way that the mushrooms were prepared - ground up and poured into melted chocolate, such that each eighth looked sort of like a large Reese's peanut butter cup - we each took 3/32 of an ounce.</p><p>My set was extremely good, between the calming effects of the marijuana and my happiness at getting to spend some time with L and some close friends. The setting while we were coming up was the lounge of M's suite, where we listened to random music and started chatting about different subjects. Soon enough I began to feel an extremely heavy body load - I felt replete with a sort of dull grossness. M was also hit pretty hard - even the mention of food made him more nauseated. This general grossness led us to discard the possibility of going to see a movie.</p><p>We proceeded to have a discussion about children's literature and memory. W remarks: 'I think that it started from you mentioning that you have heard many things expressed to you that happened to you and you remember them based on their recounting and not the actual events. Then there was a long time spent discussing various instances of that. We then got into talking about how it's odd that we remember some things and not others and that was instantiated a bunch.'</p><p>My recollection is as follows: For whatever reason, we began to discuss children's literature. I noted that, as far as I can remember, I never read any of the classics of children's literature when I was small. We talked about how a lot of children's literature is very complicated and interesting - it attempts to teach children about real relationships and the mystery of life without resorting to condescension. This makes a lot of children's books interesting to adults as well. It occurred to me that the fact that I don't remember having read any of this literature might result from my learning to read at a very early age (around 3 years old). I've basically read to myself for my entire life, and at some point I simply jumped from books for very young readers to those for adults - I didn't spend much time mucking around in books for preteens and so on.</p><p>This led into discussion of how memory works, because I realized that a lot of my memories are extremely sketchy - not just those of my early childhood, but even up to a few years ago (I turn 22 soon). Memory in general seems to be constructed in some ways [this report would be a good example of such a construction, since the memory of the experience is being combined with analysis of the experience]: stories about you are recounted to you, and they are slowly integrated into your memory as you tell them to people, sometimes embellished with the way you think you may have felt at the time, etc. In other words, much of what happens to you is off in your brain somewhere, but the things that are clearly remembered tend to be those things that are constantly referred to: major life experiences that are kept in short term memory because of their richness of meaning, which demands constant reflection and attention.</p><p>Although I really enjoyed this conversation about the subjective workings of memory, and I felt like I was connecting with my friends on fundamental ideas about life, I was troubled by the vagueness of my memories. I realized that I felt like I didn't even really have an identity - some necessary level of self-awareness that I have now - until I was maybe 16. I had a strong feeling that I've just *been around* for a lot of my life without being an active participant, and that maybe this was indicative of a dissociative disorder. The counterargument that we posited is simply that some people's formative years last longer than others, and that part of that formation is the coalescence of the self out of one's experiences and gut reactions and inclinations.</p><p>In other words, it would be impossible for me to have had an identity any sooner than I felt it really came into its own simply because there wasn't enough life lived. This seemed reasonable to me. L noted, though, that she sometimes feels a disengagement from her life and that she's simply a passive observer. M also recounted an experience he had around age 12: he was in a car with his mother, and he suddenly forgot who he was. He slowly realized that he was one of the creatures in the car, and that he was the young male one rather than the old female one. Interesting!</p><p>We talked a little bit more about memory in the context of language - I've learned and forgotten 3 languages to various extents - before we decided to go out into the courtyard for a while (M said that the conversation was making him feel dumb). I sat down in a hammock on one side of the courtyard with L and swayed back and forth; M began tire-swinging while W sat nearby and talked to him. After a few minutes I heard a distinctive laugh from the fifth floor balcony - it belongs to my acquaintance K, whom I always really enjoy talking to. He has interesting opinions about all sorts of things, interesting life experiences, and a no-bullshit candor that I really appreciate. I took my leave of L, M, and W to go talk to him; they were enjoying themselves and said they'd meet me later.</p><p>I went up to find K sitting on the balcony with a friend. We talked a little bit about a phone call K had just received from a pseudo-girlfriend whose superficiality and consuming concerns with meaningless things - her worship of pundits and so on - makes him miserable. He decided to walk away from his relationship with her because of this. His friend left, and soon we found ourselves in the middle of an absolutely fascinating conversation. I can't recount it in any other way than as a sketchy summary, since it explored many nooks and crannies, and I can't recount it absolutely chronologically since I can't remember the exact order in which we discussed things. I will instead lay out the two major conceptual hubs of our (cheerfully conducted but extremely bleak) discussion.</p><p>A constant theme was the overwhelming negativity of the world. Earth overflows with life - there is an amazing superabundance of living things everywhere you go, more so in places like India and China. As an example, K told me about his dog, which (he is sure) committed suicide. He feels as though the way his parents projected the pain of their divorce onto the dog eventually drove it to run into traffic. It seemed to us that people and animals on the whole exist in a state of abject misery. The poor, the sick, the dying, the emotionally abused, the self-deceiving, the hopeless, the unfulfilled: they overflow from all of the world's nooks and crannies.</p><p>We talked a little bit about the Darwinian idea of nature as being 'red in tooth and claw' - the absence of pity as an essential aspect of existence. And this reminded me of an excellent book: The Temple of Dawn, by Yukio Mishima. One of the setpieces of the book is the main character's visit to Benares, a city of central importance to Hinduism (especially the worship of Kali, the goddess of death, destruction, fertility, and so on). For temple attendants in Benares, to sacrifice, kill, and skin dozens of animals a day during festivals is simply a fact of life. The city acts as a symbol of absolute, cosmic nihilism: the nihilism of the clear-eyed, who see the world as it really is. If the world is as it is and will always be as it must be, then there is nothing to do but accept it. There is evil in the world, and that's just the way it is.</p><p>I extended this concept a bit further: there are places all over the world which are hells on earth, even if in different ways. The two which really trouble me are New York City - a metropolis in which total alienation is the default state of life - and Auschwitz. Auschwitz is emblematic of the way in which human evil lives long after the people involved disappear from the world: the way that man's evil can pollute and blast his surroundings. Then there are places like Borneo and Madagascar, where man lives only in active battle with nature. Over all, those spots in the world that are truly indifferent or idyllic seem few and far between, and evil is everywhere.</p><p>This led us to discuss the failures of idealism - the ways in which people allow their hopes and beliefs to deceive them, and the evils they carry out in the name of those same ideals. This is maybe best exemplified by the Christo ethic, as K put it, which is the sort of militant, missionary attitude that the United States has held in recent years and used in service of war. Idealism in some ways leads inevitably to antagonism: people's convictions overwhelm their good nature and force them to victimize others in the name of concepts. We agreed on the point that people need to stop deluding themselves about reality, be pragmatic. Furthermore, on the negativistic line we were following, people should accept misery as a fact of life. When this line of thought is arrived at - the world is a hell, I might die tomorrow, and I accept that nothing matters - then it is finally possible to get on with living life. But there's one final proviso: at least don't hurt me. Don't hurry me to my end.</p><p>[Having examined the discussion above in the company of my friend P turned out to be pretty useful, but I haven't altered the narrative above. P suggests the idea of 'the evil earth' is as bankrupt as that of 'the good earth' - that pain and pleasure are both essential aspects of existence. I clarified to him that the gist of the discussion was that the world is indifferent - that I was simply noting the negativity of the world, not bemoaning it. He also noted that to ascribe a quality of indifference to the world is anthrocentric. After some more discussion and hashing out, we arrived at the following conclusions: this discussion was in some ways a manifestation of my desire to fit the world to my worldview and is limited in that sense. The world does lack anthrocentrism, but this will necessarily be construed as indifference when attempting to ascribe human value to the world. I think this is a necessary aspect of being alive unless one is simply to be agnostic about the whole issue. But, regardless, the world just *is as it is*. One has to accept this.]</p><p>This last desire not to hurt others seemed to us almost impossible, given the idealist foundation of so many of our systems (even the Constitution, which is supposedly a bastion of pragmatism). Systems almost invariably breed antagonism, since *someone* will disagree with part of any given system. But at the same time, the way people are educated today often leads them to use their belief in different systems of thought, government, etc. to lash out at others. Many well-educated people never want to actually discuss ideas and interact with people on a basic level. Instead, they use their training to tear away others' beliefs - not in order to actually say anything about those beliefs or to suggest more tenable ones, but simply to degrade others' sense of worth. This fundamental failure in communication, we decided, was probably the source of the problems in idealism. [Note that this isn't to say that either of us felt totally immune to this sort of behavior, but that we actively try to avoid it.]</p><p>We decided that maybe part of the problem is that education itself is a system, with its own fundamental beliefs and ideals. I recalled how the best teachers I've had have served as resources, presenting facts and information, encouraging me to make my own opinions, and helping me to gain the sophistication to analyze other views. But they were also the most scrupulous to maintain a strict separation from the lives of their students outside of academics and also to be critical of the ways my schools have been run - they felt that there was always too much potential for abuse of the students, either through imposition of their own ideas or through unhealthy aspects of the formal teacher-student relationship. This is really a shame.</p><p>Through discussions of systems as antagonistic, we wound our way to discussing the way people allow themselves to be dominated by their fears. The best example I could come up with was the way that people have been obsessed with the notion of safety since the September 11th attacks. Disregarding the fact that airplane travel is still safer than driving a car even without stringent safety precautions, people have sacrificed their convenience and their privacy in the name of making their lives safer. Gone are the days of getting on a plane and buying a ticket once it has taken off. How are we any safer now than before? We've simply sacrificed our privacy - allowing the government to have greater hold on us and our freedoms, which certainly makes us *less* safe - without having gained anything for it. This self-deception is tantamount to madness.</p><p>Another example we came up with is situations in which people live in extreme isolation, without technological links to the rest of the world. In these situations people live with contradictory feelings: on the one hand, they have great privacy and freedom to pursue whatever mode of living they desire. On the other hand, there's a feeling of extreme vulnerability, since one can easily be caught unaware by hostile situations. And so isolation can breed xenophobia, once again from lack of acceptance of one's lot. [Although a tendency toward privacy and freedom might be construed as an argument for a return to tribalism, the infeasibility of returning genuinely to tribal belief without some sacrifice of modern intellect and learning (which is extremely valuable) speaks against it. Note also that, sure, there are a few small tribes here and there that live in absolute peace without hurting anyone. But half the time they're busy being wiped out by the hordes of surrounding tribes that are in a xenophobic furor.]</p><p>Curiously enough, I realized that, to me, cities in some ways exemplify this sort of behavior. Although there are huge crushes of people, dense technology, and so on, people are fundamentally afraid of those around them. Any stranger is assumed to be hostile, and so one attempts to avoid them. [Take, for example, people's embarrassment about and fear of the homeless - it's a good example. The way we treat the homeless and think about them generally also speaks volumes about how uncommunicative, prejudiced, and critical of others' worth people tend to be.] To me, cities are fundamentally alienating places.</p><p>One of the hallmarks to K and I of folk and indigenous culture is how it's founded on acceptance of the way things are rather than the way one wants them to be; we talked about how modern industrialization has destroyed a lot of this culture. This has led to alienation, as there's been a growing disjunction between the beliefs and fantasies people have adopted (like the American Dream) and the realities of their lives. [Note that I'm not a Marxist in any sense. I do, however, think Marx is right about the alienating nature of the capitalist system, and I think his understanding of how markets work is very astute. I just don't buy his apocalyptic, ersatz religious drivel.]</p><p>In some ways, industrialization has led to a death of culture leading to an age of equals: both the upper classes and the lower classes are equally impoverished, mentally and spiritually. But why? We arrived at a sort of synthesis of Walter Benjamin's ideas about mechanical reproduction and aura and of Clement Greenberg's ideas about the difference between avant-garde and kitsch.</p><p>When industrialization began, people began to abandon traditional crafts in favor of working with machines, and they moved to the cities. In doing so, they not only removed themselves from a real, clear-eyed connection with reality - with the materials they used and the techniques they applied to them - but they removed themselves from their previous folk culture. How could a newly minted factory worker - pushing buttons or inspecting products or greasing gears - find satisfaction in cultural reflections of his old way of life? The old songs and stories became irrelevant.</p><p>But machine work is repetitive; each worker's task is reduced to its logical limit, an 'atom of production,' and the worker himself is just another piece of the assembly line. And with the fatigue and numbness this caused, the worker lost his ability to handle another aspect of folk culture (and high culture as well): mystery. Folk culture and high culture share a common trait in that respect: it is almost entirely a catalyst or a cause [a characteristic that they share with drugs, funny enough]. When you look at an ikon or a Picasso, there is a mysterious element to it which drives you to reflection; it sets balls rolling. Understanding this is key to realizing how mass culture after industrialization has led to the marginalization of high and folk culture alike.</p><p>The best way to satisfy the exhausted worker is to bypass cause, reflection, and mystery. Whereas folk and high culture gain much of their richness of meaning from the ways that they are fundamentally unfamiliar to their viewers, mass culture is constructed such that a viewer can instantly identify himself in it, experience its emotional undercurrents, and draw satisfaction from the emotional payoff. This is what has led to the marginalization of culture, but it has had a far worse effect: people no longer accept mystery as fundamental. What seems mysterious to them must be wrong, and since everything is imbued with mystery, everything is frightening. Alienation has compounded itself, and self-deception is its byproduct. [The change in American Christianity from a more irascible, inhuman, Puritanical or Old Testament conception of God to a personal, loving Jesus is emblematic to me of this sort of change.]</p><p>K wanted to head to bed, so we wrapped up our discussion. I don't know if I've had a better feeling of being on the same bandwidth as someone in a while. It's a feeling I've experienced very rarely, except one-on-one with L and some of my very closest friends. The time I spent with K was easily the heart of the experience for me, but it lasted for a long while after that (it lasted for about 5-6 hours all told). The rest of this report will be somewhat more condensed... To continue: When I went downstairs again, I found L and W sitting around watching M play pinball. During my absence, they had gone to a newly-opened building on campus and played with rolling chairs in a giant lounge.</p><p>We talked a little bit about my discussion with K, since I felt it to be so overwhelmingly rich. I noted the concept that, given that nothing matters, people should at least not hurt each other. W countered by saying that, as far as he's concerned, everything matters. I stated that the two situations are basically equivalent to me since they accord everything equal worth. L objected to this equivalence entirely, but we felt no particular desire to pursue our disagreement further. We simply accepted the difference of opinion.</p><p>L and I decide to go back into M's suite; M and W joined us shortly afterward. We had begun to feel a little fanciful, so we talked about some amusing subjects. M brought up his fear of zombies (even if they are fictional). He had gone into his older brother's room when he was around 6 years old. His brother was watching Night of the Living Dead, and M walked in just as a zombie was devouring somebody's brain. Thanks to his brother's testimony to people at their school that he'd wet himself (not so), M has been bothered by the experience ever since. This led into discussion of where zombies come from - viruses, the supernatural, and so on - and what exactly the mechanism of zombification might be. For some reason this got us talking about hairiness, and how awesome it would be if one had projectile hair follicles (like a porcupine's quills).</p><p>Then L and I went back upstairs to L's suite while M and W played more pinball. We decided to sit in the lounge with G2, D, A, and B. Some interesting ritual music was playing, and we talked about modern art and Roman functionaries (praetors, tribunes, etc.) since G2 and D were making bracelets with such titles on them. D and I talked a little bit about Marcel Duchamp. Then, as M and W joined us, we talked with B about various previous drug experiences [it always amazes me how much discussion while on drugs consists of these sorts of reminiscences]. All of us have had fairly extreme drug experiences - both positive and negative - but all of us agree that they've been to our benefit at least to some extent. We discussed how the year's big party had gone and M's plan for next year: to dissolve some extremely desirable substance in hot dog juice and to let people decide for themselves whether drinking some is really worth it. This was met with amusement on all sides.</p><p>Eventually we all decided to split up. M and W wanted to go to their respective homes (they live nearby and aren't staying on campus for the summer), and L and I wanted to go upstairs to her room. We ate some pizza and popcorn, drank some lemonade, and cuddled a bit before going to bed. We made love, which was interesting but not materially different from making love when sober (mostly because we were essentially down at this point). I felt tired and weighted down, but generally amazing - there was something really cathartic about this trip. And I woke up the next morning feeling great.</p><p>To sum up:</p><p>This was my first time ever trying mushrooms, and I was extremely impressed. The experience is easily on the level of some of my best and most meaningful. They acted as an extremely good catalyst toward discussion and analysis, at least for me; L, M, and W seemed less inclined to pursue a similar level of abstraction, as evidenced by their more physical adventures. I would definitely try mushrooms again, since they are probably the best tool I've found for encouraging and sustaining close examination of how I feel about myself and the world.</p><p>Another especially remarkable part of the experience was the way in which I felt absolutely accepting and unthreatened by everything I thought, felt, and discussed over the course of the evening. This is really unusual considering the general negativity in what I was discussing, and the closest cognate I've experienced in terms of mindset was when I took MDMA and DOM, although I was more actively pleased with everything on those occasions. This accepting attitude seems to have contributed to the lack of argument over the things we discussed.</p><p>The reason, then, that I've said basically nothing about visual effects or psychedelic mental effects is that I really didn't experience any: there were strong color enhancements and body load, but there was a total absence of visuals, feelings of stonedness, disorientation, and so on. One of my friends says that this is utterly unlike his experiences with mushrooms - any mental effects for him are usually paranoia and confusion, and mild visuals - but I rather liked it.</p><p>People have remarked to me before that it would be ridiculous to eat mushrooms in any other setting than a forest or a large park: they strongly associate the mushroom experience with a need to be close to nature. Although being outside on the balcony and in the courtyard was very relaxing, I didn't feel any particular need to be among living things. I felt instead an affinity and closeness to all the life in the world without any particular desire to have contact with it.</p><p>I'll close with further information from my compatriots [who contributed materially to filling in some of the gaps in my recollections of the experience]: L and W were also taking mushrooms for the first time; M, however, had taken them before. L says that 'the stuff yesterday was fun, but it didn't affect me all that much. Hardly any body load, no visuals that I noticed, (but the colors were really pretty).' W reports that 'nothing particularly special happened, but it was very enjoyable overall. I found colors to be particularly vivid. There was also a quiet stillness to my mind that was rather pleasant.'</p>",
 "year": "2004",
 "id": "33956",
 "gender": "Male",
 "timestamp": "2004-06-02T07:00:00.000Z",
 "views": "6720",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.09 oz",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
