{
 "id": 3404,
 "title": "Opened a Doorway? Doubtful...",
 "date": {
  "submission": "2003-02-04T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ReD-DoG",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "1:00",
   "amount": {
    "number": "19",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Right before NYE 2k3 LSD came into town for the first time in nearly two years.  The market got flooded with three different type of blotter paper and the rave scene and everything else was frying hard.  I managed to get my hands on a few hits and for myself and as did some of my friends.  So about three weeks ago we all went over to one persons house and decided we were going to fry, after all it had been a few years and frying at parties had lost its luster.  So I took my hits of LSD around 11 PM and then about an hour later was feeling some mild effects, (not what I had expected) other people were frying pretty good so my friend offered to break out some 5-MEO-DiPT and everyone said sure.  My friend gave me a dose of 19 MG's (I took that orally) and within about five minutes I was frying hard (I do not think the 5-MEO could have absorbed through the lining of my stomach that quickly): Long story short I felt like I was on a candy flip all night long, (Rolling on Extasy and LSD both at the same time).",
  "I experienced some of the most intense hallucinations that I have had in a great many years as well as heard very strange auditory hallucinations in which peoples voices were fluxuating with the melting and changing of their physical form.  It was very clear to me that what was on was far more than just the LSD. I also had nothing on my mind except for sex and an extreme want to get off.  As far as side effects I did have the often spoken about diarreah but I found it to be nothing worse than the diareah that I get from tripping on Mushrooms.  I simply feel like hallucinogens help rid my body of caffeine and other such impurities that I put into my body for I have found that the less bad things I intake before doing mushrooms the less severe the diarreah and cramping are.",
  "After this night I went home at 10 AM and could not get the trip to go away so I decided to take an anti Psychotic that my friend gave me and laid down and was sleeping within fifteen minutes. ",
  "That night/day I had the most horrific dream I have ever had and the strange thing about this situation is that they have not stopped in that three week period that has followed.  Everything from being shot with a gun by Jesus standing in a robe and slippers and him telling me stories of how when he was a kid he would mess with other kids and make them blind or various other things for pissing him off, to going to a backstreet boys concert with my entire family including my grandparents and having a strange man come up from behind me and strangle me while no one notices and then my parents inviting him back to our house for dinner and not understanding why im upset, to actually downing a half vial of LSD and running around my dream having a bad trip. as well as having a dream in whch i fell asleep and 'Woke up' in the middle of an already happening dream in which I had no idea as to where I was or why I was there am being punched in the face by my best friend and he says Come on we are fighting and i say okay, and he hits me again and I have two teeth knocked out and they are both canine teeth.  The list goes on as the above dramas clearly do not cover the span of three weeks.",
  "I guess what I am wondering is this, is it possible that the designer drug 5-MEO-DiPT has somehow done something to my brain to fuck it up so that I might not ever be able to have a peaceful night's rest again?",
  "I have spoken to others who say that they have had equally intense dreams either while directly on or shortly after doing 5-MEO-DiPT but never having it expand anything neyond a day.. maybe two."
 ],
 "erowid": {
  "id": "21018",
  "citation": " ReD-DoG. \"Opened a Doorway? Doubtful...: experience with 5-MEO-DiPT & LSD (ID 21018)\". Erowid.org. Feb 4, 2003. erowid.org/exp/21018",
  "substance": "5-MEO-DiPT & LSD",
  "views": "11883"
 }
}
