{
 "title": "A One Hour Minute",
 "author": "Cosmonaut_Roger",
 "citation": " Cosmonaut_Roger. \"A One Hour Minute: experience with Salvia divinorum (ID 34052)\". Erowid.org. Feb 18, 2008. erowid.org/exp/34052",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "report": "<p>This is a small description of the first time I have ever smoked or ingested in any way Salvia.  I will try to keep it short and to the point, but I must say the experience was like nothing else I have ever experienced.  I have experienced Cannabis, LSD, mushrooms, all manner of stimulants, etc.</p><p>At around 10:30 PM, 2 friends and I decided to head to a head shop about 45 minutes away to check out buying a new pipe.  Upon arriving, we found they sold Salvia 6x extract.  My friend being ignorant of the substance took my word that it was a mind altering substance and that we should purchase some.  We arrived back at their apartment at around 2AM where we decided to try it out.  I had heard from reports online that smoking from some type of bong works best so we got out a small sized bong and I loaded a tiny bowl of the dark crushed looking leaves into the bottom of the bowl.  I took a big hit, allowed the chamber to fill with smoke, and then held it in my lungs for about 30 seconds.  The smoke did not burn or hurt much at all, quite pleasant actually. </p><p>As soon as the smoke began to exit my lungs, I felt a rushing feeling similar to a marijuana high but then everything changed.  My body began to feel...strange, that was the only way I could describe it to my 2 friends.  It felt as though some force was pulling upwards and downwards at the same time on my skin, forcing me to remain planted in my seat.  As I spent a few seconds in awe of this feeling and repeatedly saying how bizarre I felt, I realized that I had no sense of time or space around me.  I could not tell how long I had been saying I felt bizarre and when my friend asked me to help him take a pie out of the freezer, I found movement discomforting and nearly impossible.  About 3 or 4 minutes after the hit, I began to laugh at everything that was said, and words took on a different meaning, their original base meaning became worthless and their new, funny meaning was all that mattered to my mind.  I laughed for a few more minutes and then calmed down and felt normal.  My 2 friends tried it each and felt nothing except a mild high.</p><p>1 hr later, I decide to try it again, this time packing a larger bowl and taking 2 hits as big as I could, to see if the effects would be different.  My friend was playing a playstation game and complaining about the lack of effects achieved by the salvia.  This is where my experience begins to go bad.  I load the bowl and proceed to take a rather large hit of the creamy white smoke.  I held it in, exhaled, and took another large hit, holding this one in about 30 seconds again. </p><p>Upon exhaling the smoke, I felt the familiar pulling sensation but it began to overpower me.  My vision began to shutter and sounds around me became extrememly vivid.  I hunched over in the chair and remember mumbling 'I think I fucked myself up this time, man'.  I became entranced with the scenes on the television and felt completely disconnected with my concious thought.  My mouth seemed to be working independently of my mind, muttering meaningless words to my friend as my poor mind struggled to understand what was happening around me.  I remember my friend mentioning his car briefly and for a minute I remember clearly thinking I was in control of a car, and that our lives depended on me controling it successfully. </p><p>At this point I lost all touch with reality and picked up a beer and just fumbled with the cap, hearing sounds and seeing my friend a mile away, even though he was sitting next to me.  I remember sweat pouring down my face and trying, so so hard, to make sense of my surroundings but I could not.  There was no thought about escaping this feeling or trying to control it, just the thought to attempting to understand what was going on around me.  After what seemed an hr my mind began to make sense of the noises and scenes around me and I began to associate better with my friend. </p><p>It was unfortunate I experienced that last incident with a person uneffected by the substance.  It was frustrating for me to be ... gone, while he remained unchanged.  It truly was in interesting experience, one I can only classify as unique and bizarre, so hard to describe.  I want to attempt it again, this time in a completely comfortable setting where I can sit back and take in the effects on my mind.</p>",
 "year": "2004",
 "id": "34052",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-18T08:00:00.000Z",
 "views": "3011",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  }
 }
}
