{
 "title": "Alternative Use",
 "author": "BlindWillie",
 "citation": " BlindWillie. \"Alternative Use: experience with Wormwood (ID 34063)\". Erowid.org. Aug 3, 2007. erowid.org/exp/34063",
 "substance": "Wormwood",
 "bodyweight": "150 lb",
 "report": "<p>A friend of mine (A) left for the airforce, and was unable to bring the collection of drugs he had fermenting at his house.  Because of his air-force ties, he had loads and loads of legal drugs.  Strange ones.  A left me all he had when he left for the Air Force for good, and I found ground-up Acetophinimin and Benadryl tabs, bags of Periwinkle and lots of Robitussin.  And, strangely enough, a bottle of Wormwood.  I know a lot about Absinthe, but I had never seen the essential oil or wormwood.  I asked my friend how it felt when he drank it.  His answer 'Like weed.'  But he says that about everything.  Anyways, inspired by a story I had heard of very stupid people dipping cigarettes in Ammonia and smoking them, I dripped about 3 drops onto a cigarette.  I set it on my dashboard while I picked up a friend (B) from his house.  While driving somewhere, we smoked it, and waited.  At first, I felt a head rush, inhalant-like, and didn't think much of it.  The friend and I sat, figuring the silly hippie chemical wouldn't work.  I turned to him and said 'I feel something creeping in.'  He smiled and agreed. </p><p>We began smiling and laughing, everything was clear and vivid.  The muscles on the side of my face were pulling my lips into a smile.  I couldn't even control it.  When most people think of Absinthe and thujone, they think of 'tripping', but I find it more akin to cocaine or crystal meth.  I feel as if I can do anything.  I made more of those cigarettes to smoke with other friends, and now everyone is all over them.  I've been getting 50 cents per cig.  The only drawback I can see (although there is possible unseen harm.  It is a toxic essential oil) is that there is a tolerance.  It has never been the same as the first time.  I still recommend it.</p><p>About a week after discovering the smoking method, the same friend from before (B) and I came upon a bottle of Sprite and Everclear, a weird spur-of-the-moment thing.  I dropped 40 drops of Wormwood Oil, which of course sat atop the liquid, and we sucked it down.  I knew that the amount of liquor I had just had should've left me substantially drunk, but I wasn't.  I felt the freedom and frivolity of drunkenness, and the smiley joy and top-of-the-world feeling from thujone.  It leaves me energized.  It was a really fantastic feeling, but about three hours after drinking, I was dead tired.  More so than I ever have been after drinking before.  I feel asleep in my car in a parking lot for five hours, then went home and slept again.</p><p>Overall, I really enjoy thujone, more so than most illegal drugs, but I don't know the harms that I'm sure it is enacting on my body.</p>",
 "year": "2004",
 "id": "34063",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-03T07:00:00.000Z",
 "views": "10680",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 drops",
   "administration": "smoked",
   "substance": "Wormwood",
   "form": "(extract)"
  }
 }
}
