{
 "title": "Night Wanderer",
 "author": "The Mushy Man",
 "citation": " The Mushy Man. \"Night Wanderer: experience with Mushrooms (ID 34086)\". Erowid.org. Sep 24, 2007. erowid.org/exp/34086",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "0.125 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>This is a report of my first experience with the magical mushrooms. It started just like any other day. I wasn't intending on tripping that day, and didn't even know mushrooms were around.</p><p>I was at a friend of mine's house waiting for a half ounce to be dropped off for another friend of mine. We'll call him B.  B lives about 5 miles away, and I'm going to have to walk there to drop off his weed.</p><p>So I'm waiting around, and was smoking some gravity bongs in the mean time. My dealer pulls up and my friend and I get in. He hands me back my nugs, as well as a second baggie. I asked what it was and my friend told me they were shrooms. I inquired about the price and determined that I could afford it. I was wanting to try shrooms for a long time before this, so as you can imagine, I was very excited. We got dropped back off where we got picked up and I took the shrooms out of the bag so I could look at them a little. The caps were dark red in the center, then they went on to orange, green, blue, and finally a white ring around the outside. The stems were blue and white, they had a little caramel color to them near the tops. I then ate the shrooms around 6pm or so. By now it's almost sun-set and will be dark in about 2 hours.</p><p>After about 30 minutes I started seeing little spots and interlocking red and black banded rings. They would appear for a while, then disappear. I kept saying 'Guys, here they come... they're coming.' A while later I start seeing them more consistantly, and am starting to yawn quite frequently. We smoked a few more gravity bongs, and then I realized it. I still had a 5 mile walk ahead of me to drop off B's weed, and  by now it's getting dark. I tried to talk someone in to coming with me so I wouldn't get lost or hit by a car or something. One guy was almost persuaded (I told him B would let him blaze if he came), but decided not to seeing as how it was such a far walk.</p><p>After everyone refused to come with me I got really nervous, but I figured I'd just be really careful and I'd be fine. I realized I was in over my head by the time I made it to the first intersection (no more than 2 minutes down the road). I kept forgetting which way I was coming from and which way I needed to turn. I tried reading the sign, but couldn't. The patterns and colors kept getting in the way. I finally made up my mind to go a certain direction. So I continued on my journey. After about a half hour I noticed myself talking to and answering myself quite a bit. I'd be like 'Man, you're messed up! Why am I messed up? 'Cause you ate those funny shroomies and now you can't see!' Stuff like that. Anyways, by now the road is liquid form and changing all kinds of amazing colors. I only exist from the waist up, but I can still feel myself walking. Every step I take makes a *wump wump* sound. Meanwhile there's this high-pitched shreaking sound going in the background. Cars were just hovering lights, and people were just misty shadows that floated around.</p><p>This keeps going for a while, and gets more and more intense the further I go. I often see a little bundle of shrooms down by the horizon. They start off really tiny, but start spinning faster and faster as they get closer and closer to my face. As they pass through my face, my face turns into a cartoon character face and starts chasing after them. When it finally catches and eats the mushrooms its pupil's get huge and it slaps back on to my normal face. By now I'm thinking I ate poisonous mushrooms and I'm going to die. It's the only way I can explain why I was tripping so hard. This was just some paranoia seeing as how I never really tripped before that (not hard anyway) and it was kinda scary having that intense of a trip.</p><p>On my trip I found myself constantly touching things just to make sure they were really there. I finally got to B's house and his first reacting was 'Man, you look fucked up! What the hell are you on?' I told him I was shroomin face and he just laughed at me and called me an idiot. He invited me in and he proceeded to tell everyone I was whached out of my mind. Even his mom (she's cool and didn't care). The time is now almost midnight. It took me over 3 and a half hours to walk 5 miles. I don't know why, or where I went. I just know I eventually made it there. This was the only time I was so messed up that I turned down weed. B and his friends who were there (who were also my friends, although, not as good as they were B'), and me all went into B's room. They smoked one of the fattest rolled blunts I've ever seen, and I just layed on the bed in his tiny room. The room was so baked that I was coughing from just breathing the air. All the while I'm staring at his wall tripping my face off, and thinking that I'm going to die from eating poisonous mushrooms.</p><p>Then some more bad news. I had to walk home. It took me another 3 hours to find my way back home, but I was coming down by then so it was a little easier to find my way. I got home, finally, and very releaved that the mushrooms weren't toxic (I was a bit paranoid as I said earlier). The comedown kept me awake for a while afterwards. I was all antsy and couldn't sleep, but the visuals were gone for the most part. I finally fell asleep around 6 in the morning, and slept the sleep of the dead.</p><p>This was my first shroom experience. I have had several since, but this was by far the most intense. Hope you all enjoyed the story.</p>",
 "year": "2002",
 "id": "34086",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-24T07:00:00.000Z",
 "views": "2737",
 "dose": {}
}
