{
 "title": "Snow White Blotter and the 7 Dwarfs",
 "author": "Dopy",
 "citation": " Dopy. \"Snow White Blotter and the 7 Dwarfs: experience with LSD (ID 34097)\". Erowid.org. Mar 8, 2007. erowid.org/exp/34097",
 "substance": "LSD",
 "bodyweight": "160 lb",
 "report": "<p>I saw something about Snow White the other day and it got me to thinking about my first acid trip. I was 16, and had recently just begun my venture into the world of drugs. Of course it all started with that horrible 'gateway' drug, marijuana. I always scoff any time I hear someone say that, but that's pretty much how it went down for me. I'd been smoking the dope for awhile and was ready to try something new.</p><p>My friend Kevin and I were getting ready to go to a Cavs basketball game with my dad, and he had a couple hits in his pocket, and suggested I try one. This was in the days before pyramids and geltabs, microdots and every other kind of acid technology would later come up with. Those forms were supposed to be 'cleaner' but never seemed to pack the punch that I got from paper. Good ol' fashioned white blotters. Best 5 bucks you'd ever spend. And to think, all these kids are going crazy today over X, spending as much as $30 a hit to get one tenth the buzz.</p><p>I didn't know much about acid or what to expect. That was probably for the best. Kevin just said it would make me laugh and I would see some cool stuff. Sounded good to me. What could possibly go wrong? He said it would take about 30 minutes to an hour to kick in. It was about a 40 minute ride to the arena, so I figured we'd arrive, find our seats with my dad and then Kevin and I could wander around the arena just as it was kicking in. No big deal, right? I had no idea what was in store.</p><p>Much to my surprise, my dad decided to stop off on the way for dinner at a local restaurant. Unexpected. This meant I was going to be sitting at a table right across from my unsuspecting father right as this awful drug was kicking in. We rode to the restaurant in complete silence, my dad driving and myself in the passenger seat. About half way there I began feeling cold and my leg started to shake. This overwhelming feeling of 'I know something you don't know' came over me. I dared not turn around and look at Kevin in the back seat. Just try and stay focused. Finally we arrived at the restaurant. We got out of the car. I looked at Kevin and he looked at me, at which point the silence was broken when Kevin said with a straight face 'pretty fuckin' funny, huh?' We both broke out into hysterical laughter.</p><p>We somehow managed to make it through dinner, trying as best as we could to conceal that fact that our brains were tainted by psychotropic hallucinogens. Not an easy thing to do. Ever seen Fear and Loathing in Las Vegas when Johnny Depp tries to act normal while talking to the desk clerk in the hotel lobby? I can only imagine what my dad was thinking. We arrived at the game to see the sloppiest first quarter of basketball I've ever seen. The Cavs were playing the Orlando Magic, and it was like watching the Washington Generals vs the Washington Generals.</p><p>Several minutes went by without either team even getting a shot off. Turning the ball over, players falling down and tripping over each other, throwing the ball out of bounds. This was pure torture. I wanted to laugh so bad tears were coming down my face but seeing as there was nothing that a normal person would consider funny about the situation I had to hold back. My dad kept asking me if I was all right. I could only hunch over and pretend to have a stomachache. This was simply too much. It was time for Kevin and I to get out of there before my dad started to think something was up.</p><p>We began to walk around the concourse. As we walked we both saw a strange boy, probably a few years older than us. Not sure if he was tripping too or if he had before and could tell we were under the influence and wanted to mess with our heads, but he stared directly at us with his beady little eyes and stuck his tongue out. Now what we saw was one of those big lizard kinds with the forked tongue. That was the first part of this experience that really freaked me out. I can only assume that he actually existed since we both saw him. A bit stunned, we continued on our way.</p><p>We decided to stop and get some ice cream cones. The ice cream at the arena is soft serve, so we decided to get 2 large cones, chocolate and vanilla swirl. The cones were always fairly large, but on this particular day, who knows, maybe it was the drugs, but they seemed to be about 2 feet tall. We walked down the concourse with our ridiculously large ice cream cones, when suddenly we hear a voice from above - 'STOP!'</p><p>We froze dead in our tracks. Had someone somehow found us out??? We awaited our fate breathlessly. Then the voice spoke again. 'Everybody Limbo!!!' Suddenly we realized it was the public address announcer and limbo music began playing throughout the arena. Here we were, doing the limbo on acid while carrying 2 feet tall ice cream cones. Once again we broke into hysterical laughter. We decided to saunter upstairs and see what the world was like up there.</p><p>As we got to the top of the escalator, I noticed a balding fat man wearing a trench coat. This character was suspicious to say the least. He headed straight for us. He inched our way until he was standing about a couple feet away from me against the wall. He slowly turned his head and said 'pssssssst' Now this time I thought surely someone has found us out for real. This guy knows what we're up to and he wants to either expose us or join in the fun. Now I'm not sure if this guy was just slow but what he said next left me momentarily speechless. In an eerie whisper he leaned over and said 'where'd you guys get the icecream cones?' Not sure what the big secret was, or why he felt that he needed to whisper, but once again we broke into hysterical laughter.</p><p>We got back to our seats just in time for the half time show. It was the Cavs wheel chair basketball team. Now there is nothing funny about disabled people, but under the circumstances this was almost too much. Just when I thought I couldn't take any more and was about to lose it another voice came over the loudspeaker. It was an advertisement for Disney on Ice and a tiny sounding Disney voice said at what seemed like a million miles an hour 'sleepyhappydopeygrumpysneezybashfuldoc!!!!' What I heard was more like 'stumpy lumpy dumpy grumpy wheezy trash-ho cock' I choked back my laughter. My dad turned and looked at me and again asked if I was ok. I again hunched over and pretended to moan in pain. The rest of the game/trip was more of the same.</p><p>All in all it was fairly pleasant for a first trip. Probably best that I didn't know too much about the drug going in. Otherwise I might have been a bit paranoid. My second trip did not go nearly as well. Not knowing much about acid I of course didn't know about acid hang over either, and I was able to parlay it into a sick day from school the following morning. I slept like a baby.</p>",
 "year": "2004",
 "id": "34097",
 "gender": "Male",
 "timestamp": "2007-03-08T08:00:00.000Z",
 "views": "4393",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
