{
 "title": "Ecstacyagainony",
 "author": "Psilly",
 "citation": " Psilly. \"Ecstacyagainony: experience with Ayahuasca (B. caapi/Acacia) (ID 34116)\". Erowid.org. Jun 4, 2004. erowid.org/exp/34116",
 "substance": "Ayahuasca (B. caapi/Acacia)",
 "bodyweight": "60 kg",
 "report": "<p>23/05/04</p><p>Staring into freshly risen Sun</p><p>My thoughts turn to the dear ones</p><p>I am leaving behind</p><p>Now I travel to find</p><p>Another friend in a foreign land</p><p>A brewer of potions, his name is Pan.</p><p>26/05/04</p><p>As trees seem to materialize out of the air, rather than grow into it - I find myself in this situation. Able to feel what's coming up by what's going down.</p><p>The Acacia Bark brew is mixing with White Caapi vine in my stomach - I am unsure how long I can keep it down. Tho before it gushes from my mouth it rushes to my head - The rise brings familiar patterns before my eyes, a kind that are always there.</p><p>The vine has been present a while, I sway, I can't help but smile: Now time is stretching as mind expands.</p><p>Helping hands transmit good vibes from belly to spine, thru crown to Sky.</p><p>I finish my cup and soon after get up, walking toward the feint white of the rushing River - I fold in half over my fists as my stomach twists releasing gushes that tasted better on the way down.</p><p>Tho it feels good! The brew pumping my gut is some kind of agony made beautiful as it pushes me out of me: The exit! True Ecstacy!!!</p><p>I finish just after beginning to think I would not BE, and then I AM, feeling it strong.</p><p>Stars & crescent Moon ghost close surroundings into view. Nature bursts into song - The River hums along with the revelation that even in the absence of showers & Sun you can cast rainbows with your eyes -</p><p>I myself am cast from rainbow light: One vibration perceived as a spectrum, I am the point of perception. Somewhere outside my body as it stumbles back to its sheepskin mat.</p><p>I am floored - The River roars - its vibration a powerful engine driven by a billion dynamos, an accelerating chorus of pure existence...</p><p>So intense! So insistent as to over-ride all control: As I knew I would, I hafta let myself go.</p><p>I am outside the audience and this is no performance - The raw energy of reality beyond the bounds of being in it.</p><p>Shivering legs run me back into my body, a multitude of mischevous operators flood my pipes with warmth at the spin of a hatch - we watch as I am filled with Love unattached, Love that flows from me into the Earth as I retch, hunched on all fours...</p><p>Incredible creatures lofted on thin stalks, glowing green even in this stuff we call dark, their tricksy feathered geometries tickle my face. Giggling energy pumps from my center and I silently roar.</p><p>She asks for more like lungs require a yawn, then I'm (on my) back on the floor feeling pleasure like non-other, my body a solid liquid sensation in constant fluctuation...</p><p>The Stars.</p><p>The spirits of the place racing boats that leave creation in their wake, singing songs that are their journeys, pulling plants out of space, sailing seeds on the breeze, dancing different dense cities of mineral and stone...</p><p>Going with the flow...</p><p>Eternity peeps thru, another failed puke, a Love yawn to Mother:</p><p>I am released back into you:</p><p>Myself.</p><p>Subsubconscious oceans of connection make me free, as well as bound to Destiny.</p><p>Some initial confusion raises the question of who I am - The answer for sure: The shining light at the core of myself: The deepest, most felt 'I am'. The highest, hugest, most humbling affirmation of myself, and also the only way beyond myself: Deep down inside & O U T...</p><p>I find myself ejected from hyperspace & lying on the ground even quicker than I found myself inside.</p><p>There is a pure Happiness and true Thankfulness manifest on my face - A huge grin under a thin canopy of silhouette leaves, fractal branches, webs of Stars... I am we are OurZzz...</p><p>Life is Light is Love & I am We are Prisms not prisons.</p><p>29/05/04</p><p>kNOw Return</p><p>I left my body lying like a pile of steaming puke</p><p>in a Forest on a Spanish Mountain side,</p><p>like the steam that rises</p><p>I breathe myself into the night...</p><p>Pay special attention to the wind.</p><p>In its dance my life still spins.</p><p>In its whistles, moans & howls</p><p>Hums the voice of my Soul.</p><p>I am old, I am everywhere.</p>",
 "year": "2004",
 "id": "34116",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-06-04T07:00:00.000Z",
 "views": "26242",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 g",
   "administration": "oral",
   "substance": "Banisteriopsis caapi",
   "form": "(tea)"
  },
  "1": {
   "time": "",
   "amount": "30 g",
   "administration": "oral",
   "substance": "Acacia",
   "form": "(tea)"
  }
 }
}
