{
 "title": "Stimulant for Intense Activity",
 "author": "Tony Trick",
 "citation": " Tony Trick. \"Stimulant for Intense Activity: experience with Guarana & Ginseng (ID 34138)\". Erowid.org. Nov 28, 2006. erowid.org/exp/34138",
 "substance": "Guarana & Ginseng",
 "bodyweight": "75 kg",
 "report": "<p>I am a push bike courier in Sydney Australia working 8 hour days 5 days a week. Physically this is very hard work and by lunch time I am often buggered. So to keep me going for the rest of the day I would often take some kind of stimulant (nothing too hard due to a heart condition). I used to take energy drinks with high levels of caffeine (80mg) in them these were fine for one or two hours but after that my body would crash and I would feel really tired and lethargic. After doing this routine for months on end I also found that it was running my body and immune system down and I would often get colds and coughs I couldnt shake while I was drinking the energy drinks and I when I stopped the coughs and cold went away. So looked for another alternative and bought a packet of guarana and ginseng pills.</p><p>I have had guarana before in these energy drinks and in different pills often to keep me charging on a big night out and noticed no increase in energy levels, but my physical activity was fairly low and was nothing like sprinting around the city on my bicycle.</p><p>I took two pills with 2000mg of guarana and 500mg of Ginseng at around 1pm. They took around an Hour to work and by 2pm I felt I could ride harder, sprint faster and last longer. By 3pm my mood was slightly elevated and I was enjoying my job alot more. I also noticed a mild buzz and my state of consciousness was different almost like as if I had snorted some weak speed. This lasted until 6pm and by 5pm I was noticing the effects were wearing off. Unlike the energy drinks I didnt experience any lethargy in my muscles and they didnt affect my health.</p><p>I came to the conclusion they when exercising the effects of guarana really stand out, giving me alot more stamina and energy when riding. But when I am just chilling at home or going out for a few beers I dont feel any major changes in my energy levels.</p>",
 "year": "2004",
 "id": "34138",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-11-28T08:00:00.000Z",
 "views": "30158",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4000 mg",
   "administration": "oral",
   "substance": "Guarana",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "1000 mg",
   "administration": "oral",
   "substance": "Ginseng",
   "form": "(pill / tablet)"
  }
 }
}
