{
 "id": 3418,
 "title": "Unable to Cope with Consensus Reality",
 "date": {
  "submission": "2000-06-26T07:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "Anonymous",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "report": [
  "Following the discovery of McKenna et al., the shrooms + rue combination has become a popular technique in the arsenal of the modern entheogenic explorer/guerrilla. Accordingly, I resolved to try this combination for the first time -- my first experience with any harmine preparation.",
  "Boiling water (~2 cups) was poured over 1 tsp Syrian Rue (P. harmala). A splash (~1 Tsp) white vinegar was added and the mixture was stirred and allowed to steep for ~10 minutes, acquiring a pale red-brown color. The mixture was blended, brought to a boil again, and removed from the heat. The solids were allowed to settle and the liquids poured off. To this mixture was added a pinch of rue extract,* which gave the solution a much darker red-brown color. This preparation was split two ways (my companion combined his with 2C-B) and consumed on a fairly full stomach. The taste was bitter and alkaloid-y but not too bad (hold my nose definitely helped) and did not linger (unlike a certain revolting slimy cactus brew I can still feel sliding down my throat).",
  "About 30 minutes later, ~1.75 g (dry) of USDA Prime S. cubensis were ingested straight and chewed and held in the mouth as long as possible. I wanted to start with a low dose to establish a baseline for the shrooms + rue combination.",
  "As the effects were coming on, we went for a nice, rambling walk around the neighborhood, paying close attention to the trees and flowers and the beautiful summer sky. The intricate stained glass windows in a small church in a nearby park were particularly captivating. The anticipatory, pre-level 1 effects provided a wonderful enhancement to the little expedition that was as much due to my sense of expectation as to the sensory alterations themselves. I seemed to spend much more time 'experiencing' rather than 'thinking' as my subject-object barrier began to break down.",
  "Harmine is often reputed to be a telepathic agent, and this aspect was very much in my mind as we were returning home. There did seem to be some enhancement in my ability to anticipate what people were about to say and to resolve unexpected conversational and conceptual leaps (for which one of my companions is well-known) without having to ask for an explanation.",
  "Once we arrived back at the house, my trip rapidly settled into a mellow, level 2 experience -- about what might be expected for that dosage of mushrooms *without* the addition of rue. In fact, my experience did not seem substantially different from a straight shroom trip. My tendency towards introspection and self-contemplation was familiar enough. There did seem to be a slight sensory signature of *something* superimposed upon the mushroom effects, but nothing that made me sit up and take notice. Predominant colors tended toward pinks, purples, and blues, which are typically said to be characteristic of harmine combinations but could just as well be attributed to environment, which consisted of watching a gorgeous sunset and hanging out in a fairly dimly lit room.",
  "But when I had settled comfortably into an enjoyable level 2 experience and had just reached what I assumed was the end of the peak, my trip rapidly accelerated to level 3 in a manner that left me unprepared and unable to cope with consensus reality -- which is not a bad thing necessarily, but I was unable to properly appreciate it and make use of it as it has advanced upon me so suddenly. I thus settled (somewhat involuntarily) into an attitude of 'lets get it over with' rather than exploring the possibilities of the mental state I was in. I developed a very upleasant sensation in my mouth, like nausea without the visceral sensations, the residual effects of which later made a snack I ate tasteless and unnatural-feeling. This triggered what seems to have been a synesthetic effect and resulted in what were probably the most disgusting visuals I have ever experienced. I saw an endless progression of figures in a perpetual state of decay -- vomiting, decomposing, bleeding, generally falling to pieces. This was unsettling, but I was strangely more bemused than frightened or repulsed.",
  "After some time spent like this (I've no idea how much precisely), I dropped fairly rapidly to the afterglow stage, which seemed uncharacteristically 'dull.' I was not filled with the usual sense of clumsy contentment, and residual relaxing visual effects were nonexistent, even with the addition of a few tokes of kind bud.",
  "What seems to have happened is that my half-full stomach slowed the metabolism of the harmine much more than it did the shrooms, with the result that the much appreciated synergism manifested suddenly quite late in the trip, with the result that I *didn't* appreciate it, making the trip as a whole unfortunately rather unproductive. I'm not sure how enthusiastic I am about this combination. I'd like to try it again in hopes of obtaining a more characteristic (and enjoyable) effect, but I am in no hurry to do so -- plain ol' shrooms are *just*fine*. I would probably be more interested in trying to *smoke* rue on top of mushrooms, as McKenna does with B. caapi in _True_Hallucinations_. His description of the delicate ayahuasca visuals dancing over the mushroom baseline is quite enticing.",
  "*The extract was prepared by a friend who will remain anonymous. I remain ignorant of his method, but the extract was a beautiful deep red-brown color and consisted of sticky, flat crystals. Dosage used was specified for one person."
 ],
 "erowid": {
  "id": "2106",
  "citation": " Anonymous. \"Unable to Cope with Consensus Reality: experience with Mushrooms & P. harmala (Syrian Rue) (ID 2106)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2106",
  "substance": "Mushrooms & P. harmala (Syrian Rue)",
  "views": "5660"
 }
}
