{
 "title": "Strong Finish",
 "author": "Gaucho",
 "citation": " Gaucho. \"Strong Finish: experience with 2C-I, Hydrocodone & Cannabis (ID 34202)\". Erowid.org. Apr 5, 2005. erowid.org/exp/34202",
 "substance": "2C-I, Hydrocodone & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "17 mg",
  "oral",
  "2C-I"
 ],
 "report": "<p>I am a fairly experienced psychonaut and I have experimented with 2ci on 4 occasions.  My method of measuring doses is to take the known amount and half it again and again with a razor blade until I have a dose between 15 and 23 mg.   I realize this is not the safest method but I can not afford a scale accurate to the mg (they tend to run in the 500 mg range).  I did, however, always err on the side of caution while 'eyeballing' my halfing.  I did this in several ways.</p><p>1) Every time I halfed the amount I chose the 'half' that seemed the smallest.  </p><p>2) I have a scale that is accurate to the tenth of a gram.  I weighed the 2ci when it arrived from the chemical company and it seemed to be approx. the 500 mg the company claimed it to be.  Still,  I made an assumption that they had sent me 600 mg.  This allowed me to err on the side of caution in case they had delivered slightly more than the labeled bottle implied.</p><p>Since all my experiences with 2ci were similar I will just describe the last experiment (where I took appox. 20 mg).   I have been in a fairly good mood lately (career and love life going well). I took the dose spur of the moment with my roommate, a 30 year old woman whose entire psychedelic career consists of a single 3.5 gram dose of Mushrooms.  We took it at my home in the Hollywood hills, went for a dog walk and then returned home and went to our respective beds. </p><p>0-60 minutes.  I felt the pre-onset willies I feel when I take any pychedelic.  Body load minimal but some intestinal distress.</p><p>60- 120 minutes.   I felt talkative, slight visuals (persian carpet variety.).  I feel very analytical.  My roomie and I went for a dog walk and enjoyed a night time view of LA.   Lights were brighter than normal (similar to XTC).  A slightly annoying, ever present 'chemical' feel to the experience.  Unlike shrooms or ayhuoasca I did NOT feel like this stuff was meant to be in my body.   This is not to say it feels like poison.  I'm just trying to say  shrooms is an 'acoustic' experience for me where my body seems to NATURALLY vibrate in the shrooom plane of the universe.  2ci, on the other hand, does not feel 'acoustic'.   My body seems to vibrate on a very chemical, analytical plane. A place worth visting but I wouldn't want to live there.     </p><p>Hour 2 -hour 6  OK, fellow journeyers, here is where things get interesting.  Most descriptions I've read of the 2ci experience describe a peak at approximately 2 hours.  EVERYTIME I have taken 2ci I would say it peaks at about 3.5 to 4 HOURS.   Do NOT boost this drug unless you are very experienced with it.  The onset of this drug is VERY gentle.   I could find yourself napping at hour 2 and tripping my brains out at hour 4. My roomie agrees with this accessment of 2ci's strong 'finish' as does my girlfriend. </p><p>Anyway, after the dog walk my roomie and I returned home and went into our seperate rooms and turned off the lights thinking we'd be able to go to sleep.  Neither of us could.  I lay awake feeling a wierd combination of a shroom like experience where I was seeing and contemplating patterns of existence while SIMULTANEOUSLY having an annoying over analytical  experience.  Picture something like a smallish dose of shrooms combined with an ADD drug like Ritalin and that might begin to describe the feeling. The body load was a fairly consistant, low grade intestinal distress.  Nothing unbearable, just unpleasant.   I found the finish interesting because it was beginning to access other planes of the universe which I always love about psychedelics. </p><p>At about the same time the trip was becoming interesting for me,  my roomie was having a tough time of it.  She described being in a negative thought loop about how messy her room was.   She described the feeling as being surrounded by 'Wet Mice.'   During an earlier trip, I had some closed eyes visuals of creepy crawly cartoony creatures that could conceivably be categorized in the same 'wet mice' category she was experiencing.  So maybe this is a 2ci thing in the same way snakes are an ayhousca thing.  </p><p>In conclusion, I have a strong suspicion that I need to up the dosage to get to a more spirtual plane with this drug.   But I am loath to do that until i can afford a mg scale.  </p><p>OK, fellow psychonauts, let's review: </p><p>1)  the start of this drug is like a VERY chemical feeling XTC.  Imagine XTC WITHOUT empathy and you will have a good idea of what I'm talking about.  Very analytical, strong body energy, I'm talkative but I am not at one with my fellow man.</p><p>2) The 'finish' of this drug (which was by far the most powerful part of the trip) had a true 'psychedelic feel.'  It was introspective and seemed to access other realms of the universe.     That being said, it remained chemical in feel. </p><p>Conclusion:   2ci is like a champion psychedelic boxer.  A bit brutal but with a lot of stamina.  I don't count it out until I'm in hour 6 at least.   There's probably a lot to learn from this 'boxer' but I'm probably going to experience some chemical SMACKS along the way.  Beware.  Be safe.</p>",
 "year": "2004",
 "id": "34202",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-04-05T07:00:00.000Z",
 "views": "5861",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "17 mg",
   "administration": "oral",
   "substance": "2C-I"
  }
 }
}
