{
 "title": "It's a Jungle Out There",
 "author": "Cassius",
 "citation": " Cassius. \"It's a Jungle Out There: experience with Mushrooms & Cannabis (ID 34203)\". Erowid.org. Jul 24, 2007. erowid.org/exp/34203",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "200 lb",
 "report": [
  "<p>Now let me start by saying that I had always thought myself to be a pretty controlled person while under the influence of psychedelics, but nothing could prepare me for what I was about to experience one night a few months ago.",
  "My friend (let's call him Duke) and I had purchased an 8th of mushrooms each from our usual connection. We'd tripped together several times before and were both fully aware of the effects of mushrooms, or so we thought. At around 10 PM we both took our dose of shrooms and started playing some Halo on Xbox. The shrooms seemed to come on quicker than usual, within 30 minutes we were both seeing significant visual distortions and decided to turn the game off. We just sat and talked for 10 or so minutes about what we were seeing/feeling etc. and then decided to go in the Jacuzzi outside, something we often did but I wouldn't recommend to anyone unfamiliar with mushrooms.",
  "We both changed into our swim suits and got towels from his bathroom and started to head outside. On the way out of his room I knocked over a glass of orange juice I had been drinking. Duke knelt down and began to clean the OJ off the floor with his towel. As I'm standing there waiting for him to finish cleaning up he screams in horror and starts swatting at his arm violently. I start to freak out too, we're both screaming, only I don't know why. Then I see it.",
  "He had knocked a spider off of his arm, (it wasn't a figment of our imaginations, it was real) onto the floor and we both watched it skitter away under the couch. Now I'm no fan of spiders but I can usually tolerate them enough to just kill them with my hand or let them run off without much of a bother, but the fact that we were tripping on hallucinogenic drugs and the fact that this spider was about three inches in diameter made us both QUITE uncomfortable.",
  "Then in an instant the spider came back out from beneath the couch. Duke slammed his fist against the floor trying to kill the spider, screaming in horror. He succeeded, but also managed to sprain his thumb in the process. He moaned in agony for a bit and then we both sat on the couch trying to relax from the bad scare for a few minutes. Considering that we'd done this before, we tried not to let the incident get to us, but anyone who has done mushrooms before knows that one bad moment in the trip can turn the whole night bad.",
  "Well anyway, we were determined to not let this incident ruin our night, so we continued with our plan to relax in the warm water of the jacuzzi, perhaps it would help his thumb. On our way out to the Jacuzzi, Duke stopped in the kitchen to get us each a Gatorade, while I stood in the darkened living room looking around at objects to see what effect the mushrooms had on them. I stared at my backpack, which was lying on the ground, and it transformed into a big black beetle, with tenticles extending from its body and creeping up the walls. It didn't bother me much, I was actually amused, I still had my grip on reality. We walked out to the jacuzzi and relaxed in the hot water for probably about 15 minutes amusing ourselves with the way the light reflected off of the water and the bodily sensations the water provided.",
  "Now let me take this time to make a quick sidenote. I've had experiences in the past after taking in large amounts of alcohol and pot where upon stepping out of the jacuzzi, I'm hit with an incredibly intense, almost overwhelming headrush. Sometimes so intense I almost fall down. Then for sometime after getting out the effects of whatever substance we were on would be amplified at least two fold. It was a puzzling phenomena but it could often provide to be a good thing. I believe it has something to do with the temperature change from getting out of the water. Duke had also had the same thing happen before and so had a few other people we knew. Now back to the story.",
  "We smoked a couple joints in the jacuzzi and decided to get out, both of us completely stoned and tripping balls. It was cold out that night, maybe only 30-40 degrees ferenheit with snow covering the ground. So imagine the shock my body felt after stepping out of 104 degree water into the freezing cold winter night. It was overpowering. I only made it a few steps before I made a controlled collapse and layed down on the porch. Duke managed to sit down in a chair.",
  "I layed there for about 15 minutes tripping harder than I ever had before. When I closed my eyes, it wasn't like closing my eyes at all. I mean, I've had CEVs before, but nothing had even come close to this. As soon as my eyelids closed I was hit with an almost blinding array of neon lights. Mostly orange, red and yellow. The lights began to spawn destinct shapes, most notably an enormous praying mantis that rocked its head back and fourth seemingly dancing to the movement of the colors.",
  "My mind zoomed in 1000x onto the praying mantis and I saw that it was made up of earth and soil, protruding from body were flowers and lush plantlife. But integrated into the body of the mantis were also cogs and gears, spinning and gyrating in different directions. The insect was an organic-mechanical mixture. I was startled back to reality by Duke was calling my name. He said we needed to get inside and get dry before we freeze to death. When I opened my eyes I could still see the CEVs, they had become OEVs, seemingly painted onto the front of my eye, I was unable to get them out of my vision.",
  "Compared to where we would be in 10 minutes we hadn't even started tripping yet. We started walking through the house towards Duke's room, he was stumbling around corners and bumping into things. He had to brace himself on doorways and tables, to keep from falling down, heh, guess's he's feeling it too I thought. We reached his room and he collapsed on his bed, I sat upright on the couch. Duke layed on his bed still soaking wet, hyperventilating, with his eyes closed. I asked if he was alright and he assured me he was. I knew how he felt it was the temp. shock from leaving the water. He was in the state I had been in outside when I was laying on the ground, it just hit him later I guess.",
  "I felt like I was sobering up and started to get depressed. I sat there watching him on the bed, just making sure he was okay and whatnot, and then out of nowhere it crept up on me. I began to laugh uncontrollably, hysterical insane laughter brought on by nothing. Slowly but surely the silence of the room was replaced by the sounds of the a jungle. I could hear insects and birds chirping, monkies screaming from afar. Then from the floor vines, and foliage began to creep up the wall until the entire room was covered with them.",
  "Duke, finally regaining some composure sat up and looked at me. In the middle of his head, clear as day, was a slightly larger third eye, which blinked independently from the other two. I looked at the hair on my arm and it waived back and fourth and floated like it was underwater. Then I looked at my legs, which were now completely covered in alienlike insect creatures which crawled all over my body. By this point I was one with nature. These creatures were part of me, and I was part of them. Coming through the walls I could distinctly hear the heartbeat of mother nature.",
  "I was completely enlightened, still laughing hysterically. I looked at the light, illuminating the room and could hear its tone, like a calming humm, it eminated from the light I was sure of it, I was hearing color. Any given object I looked at would seem to cool to me, whisper to me, sing to me. By now Duke was experiencing the same thing or something similar because he was across the room with a smile of amazment on his face. We stayed in this state for maybe only 10 minutes in total, a complete and unimaginable climax that we had never thought we would ever reach. We spent the rest of the night talking and smoking pot. We only got about an hour of sleep before we both had to wake up at 6 am the next morning. After all, it was a school night.</p>"
 ],
 "year": "2004",
 "id": "34203",
 "gender": "Male",
 "views": "2550",
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2007-07-24T07:00:00.000Z"
}
