{
 "title": "They sang songs of knowledge",
 "author": "eggbert",
 "citation": " eggbert. \"They sang songs of knowledge: experience with Salvia Divinorum (dried leaves) (ID 34224)\". Erowid.org. Jun 19, 2004. erowid.org/exp/34224",
 "substance": "Salvia Divinorum (dried leaves)",
 "bodyweight": "155 lb",
 "report": "<p>I have had my hands on four ounces of salvia for a couple of months now, and have used it in smoked form a few times, but last night was my first experience with having it administered sublingually.</p><p>Meds: 200mg Zoloft nightly (taken T -02:00 in this case)</p><p>I soaked a few leaves in water for about 6 minutes, then made a quid out of some of the soaked leaves (I intend to try different solvents as the water seems to have drained a lot of the salvinorin) and chewed roughly every 15 seconds, placing it under my tongue in-between chews.</p><p>The taste was quite bitter, and I intend on using honey or sugar to counter this during future experiences. Despite its taste, the quid was not that bad, and after about 20 minutes of putting up with it i spat it out and drank a few sips of ginger ale to balance my palette.</p><p>Immediately after I took two strong rips from a bowl tightly packed with salvia, and lay down.</p><p>My bed is right next to my window, so I placed my pillow so that it was half on the bed and half on the window sill. I lay down (with primarily Radiohead and Jethro Tull playing on my MP3 player) and placed my head on the pillow, and then opened the window.</p><p>I soon heard the birds chirping and singing outside, and I quickly moved my headphones down to my neck. The birds seemed to overpower the music, and I remember there being a length of time during which I could only hear them, and everything they were singing enveloped me and I felt as if I could understand the truths behind their mystical song. Time began to stretch, and the walls of the room got bigger and the room quickly expanded. The song of the birds created vibrant CEVs (closed eye visuals) of things I have never seen an cannot describe other than beautiful.</p><p>After a long period of living through the sounds I was hearing from outside, I remember Radiohead - Idioteque coming onto my headphones and I began to move my hands. My hands began to dance and play out the music and the waves of the sounds, and it all felt beautiful. As the songs rhythym changed, so did my hand motions, and the became jerky but somehow so blissfully smooth. This lasted another few songs, and then I began to doze off, so I quickly shifted myself so that I was at the head of my bed and I fell into a peaceful sleep.</p><p>Dreams in the sense of being enactments of real life events were nonexistant, instead my mind was filled with soft flowing and glowing colours set against a black background.</p><p>I woke up refreshed, but tired (most likely because the session must have ended around 1:30), and moved on with my day. Everything seemed looser today... My body was calmer than normal, I was relaxed and collected, and I felt as if I had gained knowledge of things unknown - knowledge of peace and beauty's existance in this world. This feeling has lasted all throughout the day, and I still am in a good mindset as I go off now to try at another similar experience, however hopefully more powerful.</p>",
 "year": "2004",
 "id": "34224",
 "gender": "Male",
 "timestamp": "2004-06-19T07:00:00.000Z",
 "views": "7541",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "2.0 g",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  {
   "time": " T+ 0:20",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ]
}
