{
 "title": "Interesting, Terrifying, First Time",
 "author": "JohnBoy",
 "citation": " JohnBoy. \"Interesting, Terrifying, First Time: experience with Salvia divinorum (leaves) (ID 34337)\". Erowid.org. Dec 13, 2007. erowid.org/exp/34337",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "180 lb",
 "report": "<p>I tried Salvia last night (June 12 2004) for the first time. The experience was at once intriguing, scary and unique. After reading up on the substance I decided that I should have a sitter present.</p><p>= = = Smoking = = =</p><p>I used a micro torch device (the kind you find at gas stations) with a regular bong that had been cleaned out. I filled the bong with chilled water and as many small ice cubes that I could fit in it. After letting the water and ice chill for a bit I began the process of smoking by taking a few leaves of salvia and putting it in my herb grinder. I took the ground up results and then placed them in the bowl of the bong.</p><p>Then, using the micro torch, I took a hit of the substance. Very quickly the bong filled up with smoke, which I proceeded to inhale with speed. Probably due to the fact that I used a micro torch, the bowl was pretty much cashed at the end of 1-1.5 hits. With marijuana and ordinary butane lighter, the bowl usually lasts about 3 hits. I probably did not hold the smoke in my lungs for very long as I was trying to load another bowl. I would estimate maybe 10-15 seconds of holding. The second bowl I did not grind.</p><p>Probably shortly after I exhaled I was starting to feel something happening, it was an experience I had before, much like taking a very large hit of marijuana, or the very tip (beginning) edge of a mushroom experience. But quickly something changed and I the thought I shouldnt do this pierced through my mind. I, however, quickly dismissed this advice and smoked most of the second bowl. I did not hold it in very long.</p><p>= = = Experience = = =</p><p>Very quickly I felt a strong tug on the right side of my body. Strangely I know I have felt the feeling before  but I am still not sure when. The tug was on the right and slightly to the back of me. The weird part was that it was almost exclusively on my right side, as if the tug was trying to slowly tear me apart. Before I knew it, I was sweating profusely and I felt extremely hot. The sweat came out throughout my body.</p><p>At this point I lied down, but I did not feel any better. I sat back up and decided to look ahead and to the left  strangely, this tug actually moved my head very slowly, and without me thinking, towards to the back. I was not out of it so I realized exactly what I was doing, seeing that my head was slowly and steadily (it felt very slow, almost inhumanly slow) moving towards what I could only assume as the source of the tug.</p><p>At this point the tug started to diminish and I started to talk to my friend (the sitter). Total experience time - 5 minutes.</p><p>= = = After Thoughts = = =</p><p>At first I really wanted to experience the dream state of this substance, but after trying even this mild experience I am not too sure that this would be good idea. Apparently the leaf I was using was not too potent, alternatively, it could have been it was just that this is the first time I have used, or, a quite likely alternative, is that I did not hold the salvia smoke in too long.</p><p>The tug I described was both vaguely familiar and very unique. I have never used anything that had this type of tug, the strangest thing was that unlike other tug type experiences with mushrooms or very potent marijuana, the source of the tug was stationary throughout the experience. The sweating was something I was prepared for after reading about it in some of the experiences but the degree of the sweating was a bit more than I expected.</p>",
 "year": "2004",
 "id": "34337",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-13T08:00:00.000Z",
 "views": "2742",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
