{
 "title": "Reality Surfaces from Beneath the Veil",
 "author": "gEo_tehaD",
 "citation": " gEo_tehaD. \"Reality Surfaces from Beneath the Veil: experience with Salvia divinorum (10x extract) (ID 34381)\". Erowid.org. Dec 13, 2007. erowid.org/exp/34381",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>Salvia Divinorum was my first (and only thus far) experience with a psychedelic substance.  Numerous attempts made by friends and I to obtain such substances have all failed miserably in the past, so we were forced to settle for more marijuana.  Having been through the salvia trip, I am glad that our early cravings to have a first trip were not satisfied.  I believe that frequent use of marijuana is the only thing that saved me from having a truly bad trip with Salvia.</p><p>I first met lady Salvia in the woods.  A lucky friend of mine (lets call him Pedro for the sake of anonymity) had been lucky enough to procure some 10x Salvia extract.  Pedro led me through the woods to a spot with a small log.  I was disappointed to hear that my trip would take place here.  The log was only a few inches in diameter, so sitting on it brought my knees uncomfortably close to my chest, and I had to hold myself upright.  I told Pedro that the spot sucked, and demanded that he find me another.  He refused. </p><p>'Fuck it then' I said.  I took the coke can pipe from him.  The lady was spread on top of it, beckoning to be smoked.  I flicked the lighter and inhaled what would be equal to a casual hit of Marijuana.  'That wont do anything man, you have to take a bigger hit than that' Pedro said.  I tried to fit a little more smoke into my lungs, then let it out quickly.  Upon seeing this, Pedro told me that I had let out the smoke too quickly. . . That I wouldn't feel anything unless I took another hit right away.  I told him to fuck off, as I could already feel the effects of the Salvia playing with my brain.</p><p>I made Pedro take the can from me so I would not drop it.  At first I felt the same way I did with my first use of Marijuana.  I felt like everything, including myself, was expanding.  I have no memory of anything that occurred for about 10 minutes after this.  When I became 'conscious' again, I had no memory of taking a drug.  In fact, I had no memory of any previous existence.  I was looking away from Pedro, so his presence was also completely forgotten.  I was alone, in a place where only I existed.  A tree branch (though I didn't understand that it was a tree branch in this state) was piercing my throat and holding my mouth open.  It was extremely difficult to breathe.  In order to do so, I had to breathe in a certain pattern.  This was very frightening, but what really threw me into the fear was the feeling that this was the way things truly were.  Even though I felt as though this was reality, and had been so all along, I was truly understanding it now.  The feeling was terrible, but I could do nothing.  This simply was existence, what could I possibly do?</p><p>Eventually, I moved.  I turned my head slightly, and I was fairly sure I knew where I was.  'We're in the WOODS, aren't we?!' I said.  I began to laugh hysterically.  Nothing was the least bit humorous.  It was extremely hard to move my body.  To talk, as with breathing, I had to speak in patterns.  I decided I must tell Pedro about what had just happened. Though I don't remember exactly what I said, it was similar to this:</p><p>'Holy shit man I just went to another world with a branch through my throat and it felt like I was so scared, I was alone the only person can't breathe right, what I just said had nothing to do with what I just said, did it?'</p><p>At that point, I gave up on communication. I was still very afraid, and couldn't make my body respond to my commands well.  This condition made it a very inopportune time for Pedro to inform me it was time to leave.  Walking sounded incredibly difficult, and it was.  I stumbled after Pedro until he stopped, turned, and said 'bye!'.  He then ran away from me.  I knew he was fucking with me, but being alone in the woods like this was not something I wanted.  I walked in circles while I waited for him to come back.</p><p>Then I heard a shout.  I walked quickly but carefully towards the sound to find Pedro hopping on one foot.  The jackass had stepped on a nail.  I followed as he limped out of the woods.  I was very fearful again.  In my state of mind, I believed Pedro would need medical attention, and that we would be caught for sure.  By the time we reached Pedro's house my fear had subsided.  I felt very relaxed and happy, but for the most part I was sober.  I knew the salvia was still affecting me though when I could not follow Pedro's voice.  I would call out to ask where he was, and I could hear his answer clearly, yet I could not tell where it came from.  I stayed at his house awhile to sober up, then drove home and smoked a very large volume of weed.</p><p>Though the experience was terrifying, I can't wait to meet Salvia again.  I am agnostic - I don't claim anything as truth, but I believe salvia can open one's mind to possible truths of existence.</p>",
 "year": "2004",
 "id": "34381",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-13T08:00:00.000Z",
 "views": "2469"
}
