{
 "id": 3438,
 "title": "The Magical Rock Pool",
 "date": {
  "submission": "2000-06-26T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Jimmy Slickshoes",
  "gender": "Male",
  "weight": 23
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gel tab)"
  }
 ],
 "report": [
  "Recently some friends and i had the pleasure of experiencing the spoils of nitrous. After coming down from a trip, we decided to finish our night with some whippets at a friends house.",
  "After filling three balloons, the lights were turned off and the music (techno) was turned on as we all prepared to enter the intense world of nitrous.",
  "After inhaling the first balloon, i started to feel the effects of the gas, my vision began to blur and my voice deepened. As i finished the third balloon, i closed me eyes and envisioned the surface of crystal clear liquid as if i was looking from underneath it. Calm ripples could be seen flowing across the surface. As the music began to quicken, a cloud of glitter fell onto the surface, changing colour and forming intricate patterns. As the music got more intense, the glittered liquid began to be manipulated, as if a pair of hands were just touching the surface and the fingers moved in random patterns. As the music got even more intense, rain drops began to fall onto the surface, making the surface ripple even more. As the music reached its peak the hands that had moved so delicately before began to move furiously, slapping the glitterly water violently as if someone was drowning, producing an awesome visual from my perspective, under the water. For some reason, the cd started to skip and as it did, the glitter suddenly flew upwards, out of the water and grouped to form a tunnel that bended, rotated and changed colours. i suddenly flew out of the now calm water and flew into the tunnel spinning around and following the bends. suddenly the tunnel stopped and i was on a flat plane of glitter and someone was yelling, 'turn the light on!!'.",
  "As i awoke the others in the room rose with me and the only thing on my lips were the words that were on everybody else's, 'WE HAVE TO GET MORE BULBS (Whippets)!!!!'"
 ],
 "erowid": {
  "id": "2111",
  "citation": " Jimmy Slickshoes. \"The Magical Rock Pool: experience with Nitrous Oxide (ID 2111)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2111",
  "substance": "Nitrous Oxide",
  "views": "7072"
 }
}
