{
 "title": "Two Meetings with Lady Sage",
 "author": "Ranna",
 "citation": " Ranna. \"Two Meetings with Lady Sage: experience with Salvia divinorum (5x extract) (ID 34401)\". Erowid.org. Jun 16, 2004. erowid.org/exp/34401",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "170 lb",
 "report": "<p>The First Experience: I'd smoked some plain (non-extracted) Salvia previously and the only thing that ever came of that was that the patterns on the tiles of my bathroom floor flowed about for a few seconds (and that might've just been hypoxia).  So, when I decided to smoke some of my free 5x sample of Salvia, I wasn't very sure what to expect.  Of course, I read up on it an awful lot, but the experiences were so conflicting, that I wasn't quite sure what to expect.</p><p>I loaded my little pipe with corpus Deae Salviae and applied the fire of my trusty purple lighter to the plant material and sucked up smoke.  I have a hard time with smoke, and that of Our Lady Sage is no different.  I took a huge lungfull and held it as long as I could to try and avoid a second toke, and lo, I do not remember exhaling.  While holding, I thought, 'Man, this is gonna be a bummer.  I'll be one of the immune ones, no doubt.'  Next thing I knew, my room was trying to eat me.  The far wall had stretched out and curved around above me and was snapping it's jaws a few times a second at me (/bird-tongues lapping at the mind/).  Being a sane and rational person, I freaked and scrambled to get out of the room, rescuing my pipe and bag o' tricks just in time to save it from my deranged room.  I spent the next hour lying in bed thinking about it.</p><p>The best I can come up with is, exhaling, I fell over onto my side when Salvia Gravity struck.  I have problems with Gravity as it is, so this was no big problem, except that, being on my side and against a wall, I felt as if I was on my back, and thus the far wall was above me.  The mouth of that beast was only the baseboard heater.  With my fears thus explained away, I started to really get thinking about what this meant.  I pondered just why I felt that I needed someone like Salvia and all sorts of nifty other things.</p><p>The Second Experience: about a month later, I had prepared a simple and roughly-eyeballed 2x extraction with the remainder of my unextracted leaf via acetone and some spare time.  With school having been out for a bit, I decided to take advantage of my joblessness and my mom's jobfulness (?) to get some exploring done.  I purchased myself a premium glass tobacco water pipe (read: bong) from a local head-shop and decorated it with a sticker from my supplier. I also worked on a resin extraction of Calea by boiling it in water (quite a wonderful smell, despite the taste; boiling Calea could be a type of inscense!  Or not..).</p><p>Feeling a sense of accomplishment and contentment, I sat myself in bed with my water-pipe and a bowl of 2x.  Down the windpipe that went in a toke and a half, leaving my thoughts restless and a slight pressing on my left side.  Still feeling happy and confident that that was enough to keep the terror away, I put in a toke's worth of 5x in the bowl (no small accomplishment) and got'er done.  This time, I remember laying down, and vaguely remember exhaling before I turned to a giant stone statue in an autumnal sylvan setting.  Yellow leaves blew in a figure eight along my length and a kindly old woman offered me cookies and bad advice.  Figuring that couldn't be our Numinous lady, I sent her away and sought Her.</p><p>When I found the face of Her in some still-green leaves, she told me that I really wasn't that ready for Her advice, and that I should just come up with answers for my own damn self.  Leaves swirled through my face in a counter-clockwise motion (entering through my left cheek, for those of you keeping track; I should note that in both these experiences so far, a sour 'taste' emanates from my left cheek, as does the source of the Salvia Gravity) and I set about thinking.  I had to work on my own, but Salvia helped, and all the correct thoughts seemed to fall into place when I needed them.  I worked out some issues with a current obses--er.. crush I have, as well as some other things.</p><p>Perhaps after I get another few experiences under my belt, I can try a combination of Salvia with other herbs.  Particularly Salvia and Blue Lotus, or the Diviner's Three: Salvia, Blue Lotus and Dagga.  Also, I'd like to see how the Lady Sage interacts with the Master Yage (I'm a pronunciation heathen, I like the word 'yage', rhyming with sage), though I'll need to try the aya alone first.</p><p>Note that, despite the light-hearted wording of this report, I can't really help but think of Salvia in a ceremonial, almost reverential manner.  Despite my meager two experiences, I still feel Her lurking back there, not just in the plant, but in me and all around.  I'm not going to deify Salvia (despite my joking attempts throughout this article), but I will give her credit for being kind, firm, wise, and all around helpful.</p>",
 "year": "2004",
 "id": "34401",
 "gender": "Male",
 "timestamp": "2004-06-16T07:00:00.000Z",
 "views": "9401",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
