{
 "title": "Calm, Relaxed and Great",
 "author": "Plumface",
 "citation": " Plumface. \"Calm, Relaxed and Great: experience with Damiana (ID 34416)\". Erowid.org. Oct 28, 2009. erowid.org/exp/34416",
 "substance": "Damiana",
 "bodyweight": "150 lb",
 "report": "<p>Me and some of my friends had been reading alot about a so-called 'legal high'. We were very interested, so we decided to order some damiana off the internet. It was also very cheap, for about 5 dollars we got 3 ounces of the stuff. It was a light brown, greenish sort of color. Made up mainly of stems and small chopped up leaves. So me and 3 other friends finally got around to smoking it. It has a very smooth plesant smoke, very easy on the lungs and good to just relax and have a smoke.</p><p>Anyway, after smoking the joints, which took about 10-15 I would say, we began to notice definate effects. The results varried from person to person. For me I began to get very jumpy, sort of like after I have alot of caffine. Also my cordination was thrown off by quite a bit. I remember trying to pick stuff up and completely missing the object, but then I still tried to use the object as if I had acually picked it up.</p><p>After about 20 minutes I no longer felt hyper at all, so we flicked off the lights and just sat and relaxed on my bed. We turned on some music and you just kind of had a plesant feeling all over. Also your senses were enhanced to some degree. I remember food tasting better then normally, not much unlike the munchies. Also physical, when someone or something brushed against you it kind of tickled your whole body.</p><p>The one thing that caught my attention the most was my perception of time. After the effects started to wear off we decided to go to sleep. We had video taped the whole night, so me and another friends decided to watch the video. We expected it to be about half an hour since had started smoking. We were very suprised though that we had almost 3 hours of footage! We looked at the clock and sure enough, time had passed very quickly. If someone who had not been there watched the video, they would almost certiantly assume that we had been smoking cannabis. Alot of the things we said were completely random and just weird. One of my friends talked for about 20 minutes on how much he wanted to have sex with a green christmas light :).</p><p>Overall, I enjoyed it. The effects were enhanced more when the lights were off. It reminded me alot of cannabis, although not nearly as strong. But hey, for it being both legal and cheap I would say it was pretty decent.</p>",
 "year": "2004",
 "id": "34416",
 "gender": "Male",
 "timestamp": "2009-10-28T07:00:00.000Z",
 "views": "10517",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 joints/cigs",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(plant material)"
  }
 ]
}
