{
 "title": "Full Moon Night at a Festival",
 "author": "J. Blaze",
 "citation": " J. Blaze. \"Full Moon Night at a Festival: experience with Mushrooms, LSD, Alcohol & Cannabis (ID 34421)\". Erowid.org. Nov 3, 2007. erowid.org/exp/34421",
 "substance": "Mushrooms, LSD, Alcohol & Cannabis",
 "bodyweight": "",
 "header": [
  "DOSE: T+ 0:00",
  "6 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  " T+ 0:00",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 0:00",
  "2.0 g",
  "oral",
  "Mushrooms",
  "(dried)",
  " T+ 1:30",
  "1 hit",
  "oral",
  "LSD",
  "(blotter / tab)"
 ],
 "report": "<p>My friend M and I were at a music festival for one week during the summer of 2003, around the end of June.  We took with us a quarter of boom booms (shrooms), a couple extaordinarily strong tabs (THE strongest acid me of any of my friends had ever had), a half of smoke, and a couple cases of good beer.  It was a crazy festival in a campground that was made for a little trippy hippy community.  It had a great lake and beach, and tons of crazy woods and paths for camping.  I have no idea how many people attended this fest, probably about at least 6,000.</p><p>Anyways, I had been smoking weed 24/7 this summer, and eating a lot of shrooms, about once or twice a week, and dropped a few times too.  I was in a very surrealistic/partying mindstate as this is how I tend to live my life, still to this day.  My total drug experiences have been lsd 40-60 times, mush 30-40 times, mescaline 2 times, dxm ~4 times, crystal meth ~8 times, cocaine 30-40 times, heroin 10-20 times, ecstasy 5-10 times, all kinds of upper/downer/tranq/whatever pharm pills, and of course I lived my life in a haze of MJ, with some good hash/keef/brownies here and there too.</p><p>Back to the festival.  M and I had been taking shrooms without a care that summer, along with some of our other friends and it had become no big deal.  It became a spur of the moment thing, and we liked that.  We would get drunk and stoned and munch mad caps like they were nothing.  We loved just unknowingly hurling ourselves into a whirlwind of trippy states.  Well, the second night we were there, we got hammered and smoked a few blunts while partying at our campsite with some other nearby campsites.  So naturally we jumped all over the bag of scibady-dibadies and kept on partying after we ate them. </p><p>As always when I'm drunk, it takes a while longer to feel the trip kicking in. For me it kind of mixes in with the alcohol and provides a light-hearted care free base for the trip.  It's almost like a different kind of trip.  Well, at about t+1h we were all fucked up.  I was on my decidely last beer, and we were about to gear up and take a walk around all the campsite areas and trip out and interact with nature and people camping.  I was getting so messed up that I was talking out my ass like I do when I'm drunk and coked up.  I was laughing so hard at everything and the people around M and I were just awed at how screwed up we liked to get.</p><p>At approximately t+1.5h, we were still fucking around and hadn't left yet.  Yes it took us a half an hour to get our shit together, which consisted of a bowl, some weed, water, and some hoodies cause it was gettin a little chilly out.  The stars were so visible from this area, they sparkled so bright and scoobed all around and faded in and out.  We got not even ten feet from our site to go on our journey when M had an even better idea.  We hopped in the tent and he quickly sliced off some tablature.  If I had to estimate how much fry we each ate, I would say ~200 ug each.  Around the strength of two nice doses each even though the pieces of tab we ate were slightly less than the size of one tab, this shit was so good.  It was supposedly L-25 the almighty government altered lsd, who knows though, all I know is that one tab of that stuff feels like a strong ass five strip.</p><p>So then we embarked on our walk trippin balls on shrooms already.  We proceeded to smoke a few bowls, and about a half an hour into the walk, I began to feel different in my trip.  The cid was kickin in strong, and M agreed that this was going to get crazy.   This was the first time we have ever tried mixing LSD and mushrooms, as we had wanted to a couple of months ago, but decided against cause we each ate two tabs of this same crazy acid and once we peaked decided against it cause it would have been too much. </p><p>These two trips began to meld together and it was insane.  Everything seemed to be outlined in a halo and seemed to look like jello-ish.  People seemed to gravitate towards us as we walked by their camp sites, and we had a hard time reading their intentions.  Conversations with others were kept short and we kept on moving because people seemed like they were out to bust us or hurt us.  Of course that was a ridiculous idea, as they were probably just drunk and or stoned fucking around as people walked by.  At one point some punker girl ran out and swung an axe at me, now I swear it was less than an inch from my head, but my depth perception was non existent.  M and I both ran off into the night blood curdling screams trailing behind us.  M informed the girl that she was in need of crazy pills as we bolted. </p><p>So then the best part of the trip took us by surprise.  We smoke a bowl while walking up this totally dark winding path trough the woods and it came out to this plateau where all the people with campers instead of tents were staying.  There was not a single person out, mind you it was about 2 in the morning now, but it seemed so alive.  The way that this combination made colors and shapes, and the crazy jello movement, it seemed teeming with activity.  I would hear and feel buzzing sounds and see sparks of light trailing out of thin air.  The patterns in the pathway were way more intricate and mobile than on just shrooms or cid.  There were all these cheesy different colored hanging bulbs of lights which morphed color and shape and swayed and buzzed out loud.</p><p>Then, the moment happened.  M and I were both stopped in our tracks when we caught sight of the full moon gleaming through this huge dead tree.  A dead tree in the middle of summer didn't even strike us as strange.  But the way the moon shone through the tree and the way the branches twisted and grew was nuts.  The branches would create growing and flashing light patterns with the moon beams.  Pure insanity.  We were physically and mentally paralyzed with awe.  We must have stood there and watched this light show for what seemed like hours, but really for about 45 minutes.  That was ~t+5h for the shrooms and ~t+3.5h for the cid.  After this we proceeded back to camp.</p><p>We made it back to camp around 4 in the morning and there was few people left awake around us.  We smoke ourselves stupid with a nearby camper that wandered over to our site.  We just sat and talked around our campsite listenening to some good mellow trippy trance cds and smoking much ganja and finally went to bed around 7 am.</p><p>What a great night.  Mixed LSD and mushrooms for the first time, and it was at a great place to do it.  It was very intense in the body, mind, and visual realms.  However, it was very light hearted in the spiritual realm of how it affects my soul.  Possibly because I was drunk and stoned first, but that had to of worn off by the time the wicked peak was hit.  I'll never really know I guess, cause I will not repeat this, not cause it was scary, just because I am done with tripping, maybe acid a few more times, but not anytime soon and in small doses.</p>",
 "year": "2004",
 "id": "34421",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-11-03T07:00:00.000Z",
 "views": "5996",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "6 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "3": {
   "time": " T+ 1:30",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
