{
 "title": "Ego Loss and Identity Switching",
 "author": "Paul",
 "citation": " Paul. \"Ego Loss and Identity Switching: experience with Mushrooms - P. cubensis & Cannabis (ID 34420)\". Erowid.org. Jul 17, 2005. erowid.org/exp/34420",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "",
 "report": "<p>This was my first drug experience in the psychedelic realm. Previously I have only smoked marajuana. I made a good friend who knew a great deal about psilocybin, so I asked if he could find/prepare and trip with me. I wanted someone knowledgeable in the psychedelic realm. We made some tea with honey to deal with the flavor and drank about a gallon of Orange Juice for the vitamin C that is said to increase/calm the trips on psychoactives. Then went to a forest because we wanted a good, quiet and peaceful enviroment to trip in. We laid out a blanket and drank the tea, quietly and concentrated our minds on having a powerful experience. Then we smoked 2 bowls of marajuana. After this we both were sufficiently high, and laid down to stare at the trees. After about 20 minutes the trees were swaying in the most beautiful and peculiar way. The green of the leaves were a colour unheard of in all my previous life experiences. I felt euphoric; like I might transcend into some greater nature at that very moment. After a while I realized this probably wouldnt happen and sat up to look at a nearby stream. The water that ran on the rocks was of indescribable beauty; as if it were water's true form. I saw down the stream a spot that had a spiritual radiance. I felt drawn to it and I went and meditated there for sometime. My friend had left to go pick some berries....</p><p>After meditation which was extremely peaceful and short (only 15 minutes) I got up and charged headlong into the forest, unconcerned where I was going. I was a galant man with a sword on a quest to find a princess. This was odd... I think it might be because I have read many fantasy novels in the past... I ran through the woods, following patches of light that breached the canopy and met the ground... It was as if these patches of light were defining my trip, defining the path I must follow. After a time I came to clearing where I felt my 'normal self' (Paul) completely gone, in fact I had become Jim Morrison (yes lead singer of the doors)... My mind told me that All my life as Paul was actually a trip Jim Morrison had one time. That all of Paul's existence was just a trip brought about by LSD.</p><p>Shortly after I regained my ego with no fear and no desperation and became my ex-girlfriend. I became...as in...I felt...I looked I sounded and acted exactly like my memories of her... I realized I had been abandoned by Paul (my true self) and that I was out in the middle of the woods lost and near child-birth. I laid down and had a child... It was by far the most painful and odd experience ive ever had in my life.  I cant explain it much better... Then I became Paul again... And sat down to meditate due to the extreme reality of the experience I just had... After a bit I lost consciousness and blacked out... Occasionaly I will unlock a memory from this black out, where there is a hypnotic stir of colours and lines in my vision field...but no reaction to them...</p><p>When I awoke I was in the woods still, but it was all different... The leaves looked like a sap or mucus hanging from the branches. The branches themselves looked like vines from a great tropical rainforest... It was not at all the same forest I was in before (though somehow I realized it was an hallucination)... After a bit I had another ego twist where I became Bob Dylan (yes the scratchy voiced artist) and bob dylan's thoughts went something like this: I had been trapped on this deserted island for a couple years and I was yearning for some type of drug hook-up and looking for my ex wife (who happens to have the same name as my exgirlfriend that I had a child as)... After this I became Paul again and permenately and ran around the forest completely lost until I ran into my friend who had been looking for me... Apparently I had shouted out for him at some point in the trip... Luckily there were no other people around...As we drove away from the woods in the car I asked my friend to stop the car... I got out and sat down on the gravel in Full lotus position and felt the whole world within me, I felt a peace that has lasted so far about a year. Overall it was the greatest spiritual experience of my life.</p>",
 "year": "2004",
 "id": "34420",
 "gender": "Male",
 "timestamp": "2005-07-17T07:00:00.000Z",
 "views": "5310",
 "dose": [
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
