{
 "title": "Bad Reaction to IV",
 "author": "persistent",
 "citation": " persistent. \"Bad Reaction to IV: experience with Clonazepam, Heroin, & 2C-T-21 (ID 34445)\". Erowid.org. Jun 18, 2004. erowid.org/exp/34445",
 "substance": "Clonazepam, Heroin, & 2C-T-21",
 "bodyweight": "70 kg",
 "report": "<p> Last night I had a hellish experience with iv 2c-t-21.</p><p> A little background: I had been suffering minor methadone withdrawals all day, but had been softening the discomfort by taking 2 mg clonazepam once in the morning and one about 6:00 pm.</p><p>By about 7 pm I was suffering withdrawals to an uncomfortable degree despite the clonazepam. I intended on getting some much needed cannabis, but then my disease reared its ugly head and before I knew it I had scored and fixed some heroin. I felt ok if a little spacey from the clonazepam. In retrospect I was much more intoxicated than I felt I was at the time. For some reason I can not fathom, I injected 4 mg 2c-t-21 iv. BIG MISTAKE. I immediately felt like I had injected some terrible toxin. I was vomiting terribly, but it did nothing to alleviate the horrid nausea and poisoned feeling. Surprisingly I felt no fear, indeed my emotions seemed to have been turned off. I was very confused and felt drugged, like a wierd sort of drunkeness or an anti-psychotic zombie type feeling.</p><p> I couldn't decide what to do, so I drove to a nearby freinds house on deserted back roads. By this time the nausea and toxic feelings were fading, but I still felt very confused and drugged. There were absolutely no visuals or sensory effects, and I was able to drive surprisingly well.</p><p> Upon arriving at friends house I took a hit of cannabis and started to clear. Amazingly it had been over 2 hrs since injection though it felt like 20 min. It took a couple more hrs to repair. At no time did I notice any real psychedelic effects. Now that I was finally mending, I drove home, fixed some heroin and immediately fell asleep for about 10 hrs.</p><p> This experience is in stark contrast to my recent iv 2c-c experiment, in which 20 mg produced incredible visuals, and though i did vomit, I did not get any of the confusion and severe toxic feeling that I got from 21. This was almost certainly my last iv phenethylamine experiment. Some day I may iv DMT or DPT or something of that nature, but 2c's I will only do orally from now on.</p>",
 "year": "2004",
 "id": "34445",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-06-18T07:00:00.000Z",
 "views": "47059",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 8:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 10:00",
   "amount": " ",
   "administration": "IV",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 10:30",
   "amount": "4.0 mg",
   "administration": "IV",
   "substance": "2C-T-21",
   "form": "(powder / crystals)"
  }
 }
}
