{
 "title": "When Reality Drips Away",
 "author": "Shroomy",
 "citation": " Shroomy. \"When Reality Drips Away: experience with Sweating (ID 34466)\". Erowid.org. Jul 7, 2006. erowid.org/exp/34466",
 "substance": "Sweating",
 "bodyweight": "200 lb",
 "report": "<p>So, Im getting ready for Basic Training, and Im trying to get the THC out of my system. So I went for a light jog and returned home sweating. I have a plastic bag on underneath my shirt so that I sweat a lot more than usual. I go outside to my backyard, and its about 99 degrees outside, but it feels like 110. Its Smoldering, and the hottest place I can think of is a Plastic Shed in my backyard right in the middle of the sun. It was ideal for a sweathouse. So I go inside and find a towel and wrap myself in it, and sit inside the Shed (sweathouse). There is a dot of light on the ground, and this is where I began to notice myself hallucinating.</p><p>After about 10 mins, I have worked up a sweat to where I can wipe it off and not 5 seconds later I am sweating in the same area. So I began to watch this dot of light on the ground, and I am watching it slowly move. Sort of like a sun dial. It entrances me, and I began staring into its light, and I began having strange thoughts. I look around the shed at some product labels, which are by now extremely warped. It feels a little like when Shrooms begins to kick in, a strange bewildered feeling.</p><p>I had about 2 large cups of water while I attended this session. So after about 40 mins inside, and being completely soaked in my own sweat, I began saying things that made no sense. And I knew I wasnt making sense, but my mind kept telling me to say these things. I also prayed while I was inside the chamber, and had deep thoughts about just about everything. I closed my eyes, and I opened them, and the Light Dot had crawled almost halfway across the room. What seemed like seconds was actually around 20 mins.</p>",
 "year": "2004",
 "id": "34466",
 "gender": "Male",
 "timestamp": "2006-07-07T07:00:00.000Z",
 "views": "7835",
 "dose": []
}
