{
 "id": 3448,
 "title": "Losing and Finding Myself at the Dentists",
 "date": {
  "submission": "2000-06-26T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Marc",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "report": [
  "<p>On my last visit to my dentist, I took a photograph of the drop ceiling above my regular chair. It is this image of curly dots and lines that serve as a point of focus while entering a heightened state of consciousness from the administered nitrous oxide.",
  "I have done straight nitrous in the form of balloons, whippets and whipped cream canisters but the dentist office experiences are far superior due to the extended length of time and the 'safe' dosage created from mixing oxygen with the nitrous. I often use music to help insulate against the dentist's conversations with his assistant more than for the sounds and content of the music.",
  "These N20 experiences in the dentist chairs are the most expansive states of consciousness that I have ever known. The gas seems to open a path to the immediate present. Nitrous opens the door to thoughts of the ultimate joy of life in the ever present, NOW. I believe that people find such enjoyment by realizing how good the present is, they appear to be laughing from this simple realization of joy.",
  "The one problem I have with the gas is at times I think I may never return to a normal state of consciousness. This paranoid fear has moved me to have the dentist reduce the amount of nitrous being administered. I have also experienced a small amount of ringing in my ears after a lengthy session. Other than these mild set backs, Nitrous is amazingly fast in its onset and in its recovery time.",
  "I have some periodontal work coming up next week. They want to charge me an additional $45.00 for administering nitrous during my treatment. Although my insurance has run out, you can bet that I will splurge and treat myself to yet another mind expanding state of consciousness.</p>"
 ],
 "erowid": {
  "id": "2114",
  "citation": " Marc. \"Losing and Finding Myself at the Dentists: experience with Nitrous Oxide (ID 2114)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2114",
  "substance": "Nitrous Oxide",
  "views": "8663"
 }
}
