{
 "title": "King Hit",
 "author": "Olanzapine",
 "citation": " Olanzapine. \"King Hit: experience with Olanzapine (Zyprexa) & Lithium (Eskalith) (ID 34505)\". Erowid.org. Feb 21, 2010. erowid.org/exp/34505",
 "substance": "Olanzapine (Zyprexa) & Lithium (Eskalith)",
 "bodyweight": "65 kg",
 "report": [
  "<p>For the treatment of 'Bi-Polar' disorder I was prescribed Olanzapine (Zyprexa) and Lithium carbonate. I was 'suffering' (actually it was very enlightening) from a 'psychotic episode'. From my experience this drug will bring me down, make me feel 'normal' if I'm a bit loopy or make me feel run-down, lethargic, basically like shit if I'm not loopy.",
  "After my release (AWOL) I was prescribed;",
  "10-20mg Olanzapine daily (1 tablet = 10mg) One in the morning after food; more if needed throughout the day. I reduced this dosage to half a tablet in the morn and the other half mid afternoon if needed. I had to reduce the dosage due to the potency of the drug. Too much even if I'm loopy has adverse affects.",
  "750mg Lithium twice daily (250mg tablets) Side Affects = weight gain, 'flat' moods, headaches (dehydration)",
  "Olanzapine changed my moods and state from being motivated, accellerated thinking, constant flow of ideas, elated, basically feeling complete and confident (very simmiliar to the report on ADD complied by a student located on this site) to feeling depressed, disintrested, bland, ect. Combined with lithium, olanzapine is like the king hit or knockout blow. Lithium dulls me (the jab) and olanzapine floors me.",
  "After 6 weeks of this combination of drugs I stopped the lithium intake but still used olazapine occasionally to supress possible psychosis'. The affects were more noticeable without lithium. Olanzapine would take me from states of 'raving' (copious ideas verbalised) to a 'Zombie' like state. This from a 10mg dose.",
  "These drugs were prescribed to me with little knowledge of the person I am. I was a bit crazy but not certifiable. I ceased the intake of these drugs mainly because the potency, olanzapine packs a punch! A few yrs later and I'm fine although I do use amphetamines occasionally to combat depression. I actually find the base I get better than most antidepressants I have used.",
  "*Editor Note*",
  "Upon arrival at the mental institution I was given",
  "Acuphase 150mg IMI",
  "Midazolam 15mg IMI",
  "Injected into my ass cheek (thanks guys!)",
  "Effective within 15 or so minutes",
  "Heavy sedation lasting for 2-3 days",
  "Paitents appear like they are high on herion for 2-3 days",
  "Bloodshot eyes",
  "I was in the institution for 4 days before I came down. I asked how long I'd been there, it felt like I only slept once, like I had the drugs the night before, but I'd been wandering around in zombie state for 3 days. I wet the bed, unable to attain an erection, they are two things I remember...the rest is very hazy.",
  "I hope this helps in any way, just thought I'd pop a message on my experiences with the 'prexa'. I obtained all my medical reports to see what they were doing to me, scary places mental institutions, very scary! Room full of weird psycho active drugs that they can force into your body and 'observe' the reactions. A reason why I treated the nurses with respect and clued them about what they where giving me, I was scared they where goin to fill me full of drugs that weren't goin to wear off.</p>"
 ],
 "year": "1999",
 "id": "34505",
 "gender": "Male",
 "views": "8653",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Olanzapine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "750 mg",
   "administration": "oral",
   "substance": "Pharms - Lithium",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2010-02-21T08:00:00.000Z"
}
