{
 "title": "It All Left me so Instantly",
 "author": "Tom",
 "citation": " Tom. \"It All Left me so Instantly: experience with 2C-I (ID 34524)\". Erowid.org. Mar 6, 2007. erowid.org/exp/34524",
 "substance": "2C-I",
 "bodyweight": "165 lb",
 "report": "<p>The night began when I called my friend J up too see whats goin on. He said he had some 2C-I that I ended up buying from him later when I went over there. We smoked some pot and they had to goto the store so they dropped me back off at my house, where the real fun began. At around 10:00pm I swallowed the 20mg of 2C-I, nothing really happend till about 11:30pm when I knowticed some trails develop behind my hands.</p><p>At around 12:00pm things started to get interesting. I lit up some incense which I then took the stick and waved it around in the dark making beutiful trailous patterns that seems to just float in the air. This entertained me for about an hour or so, by the time I looked at the clock it was about 1:12am. I walked over to my dresser which had a black light on it so I turned it on a preceded to draw on the dresser. The marker on the surface would shift and turn as I looked at it, like an orange bliss.</p><p>After about 30 minutes of drawing and 2 more incense sticks later I started to have a head ache. I decided to lay down and relax, seeing the ceilling shift and turn. The beutiful night began to end at around 3:50am. I began to grow tired of the headache and decided to sleep. I layed there and enjoyed the remains on my trip and around 4:12am it all left me so intantly. No more visuals, no more distortion, and rarely even any trails. I ended the night by going to bed whith a 2C-I expirence under my belt.</p>",
 "year": "2004",
 "id": "34524",
 "gender": "Male",
 "timestamp": "2007-03-06T08:00:00.000Z",
 "views": "2360",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
