{
 "title": "A Doctor's Account",
 "author": "Free_Thinker",
 "citation": " Free_Thinker. \"A Doctor's Account: experience with Cannabis (ID 34533)\". Erowid.org. Apr 25, 2007. erowid.org/exp/34533",
 "substance": "Cannabis",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis"
  ]
 ],
 "report": "<p>I am a 31 year old medical doctor, and would like to share my views based on personal use of Marijuana.</p><p>I started out smoking only with friends, and when they had some - I never had any stuff of my own for almost 10 years. I only smoked when in a good mood and in a nice place, like beaches or mountains, so I used it once every 2 or 3 months at the most. It was nice when it happened, but I didn't crave for it in between 'sessions'. I was already in medical school and aware of the dangers by then, but I didn't worry too much because of the extremely unfrequent use.</p><p>After I graduated and moved to a new city to do my second residency, I finally bought all the gear and some pot, since now I was living alone for the first time. I started smoking almost every night, since I was so relaxed and the workload was a lot lighter than my first residency, which was in Internal Medicine. I started gaining weight because of the munchies, and falling asleep on the couch repeatedly, which was terrible because of the bad quality sleep.</p><p>Eventually I started forgetting names of medications when prescribing to patients, because of the well-known effects of marijuana on memory, and that bothered me a lot. My thinking was also slowing down, and I felt like I was always having a mild hangover. Thank god no one was harmed, since I didn't have to deal with critical patients or emergency situations anymore, but I kept thinking what could happen to a doctor who DID have to manage these situations. And we're only talking about marijuana - let alone those on heavier drugs.</p><p>I suddenly realized I was positively addicted to marijuana, not physically dependent upon it, put psychologically without any doubts. I could and did stop smoking for several days if needed, but the longing for it was ever present on my mind. I was lazy to let it go, although I knew it was time to do so. Finally, when I was about to move out again to get married, then I gave all my stuff away to a friend, and said goodbye to smoking pot.</p><p>It's been almost two years now, and I haven't smoked ever since. My life is so fullfilling now, that I really don't feel the need to get high anymore. Music will suffice for me nowadays. My wife knew I used to smoke, but she never asked about it or tried to forbid it - and that was the best thing she could have done for me. She let me choose, and won with her gentleness.</p><p>About other drugs, I only tried cocaine once, but didn't see a point to it; besides, the risks are too high. I was curious to try LSD, but I know about the flashback risks, which are unacceptable in my profession, and I know it can have lasting effects still poorly understood, so I never did it. Other drugs never interested me before, and don't interest me now, for various reasons, but mainly because of unnacceptable health risks.</p><p>I don't regret my previous use of marijuana. I had some wonderful times WITH it, but surely not BECAUSE of it; I realize now that being with my friends was what made it really special. I don't condemn anyome who uses it; I would just advise everyone to research as much as they can about every aspect of drug use in general, so they can make better decisions of what, when and how much to use.</p><p>Free_Thinker</p>",
 "year": "2001",
 "id": "34533",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-25T07:00:00.000Z",
 "views": "5942"
}
