{
 "title": "Diet Weed",
 "author": "Jonah",
 "citation": " Jonah. \"Diet Weed: experience with Sceletium tortuosum (Kanna) (ID 34543)\". Erowid.org. Nov 7, 2007. erowid.org/exp/34543",
 "substance": "Sceletium tortuosum (Kanna)",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Sceletium tortuosum",
   "(leaves)"
  ]
 ],
 "report": "<p>I was digging through the fridge late one night recently, and came across a little manilla envelope. Inside of it was a gram of kana leaves. I think I got it as a little gift from a supplier when I last ordered mimosa hostilis root bark. I had never had this herb before, and was curious as to what the effects would be, especially in contrast to what I had read online. Some of the stuff I read looked a lot like typical vendor hype. I figured I may as well evaluate this one for the good of all mankind. Oh yeah, and lots of good it'll do, I'm sure. Heh.</p><p>Anyway, me and my gf rolled up a joint, about half a gram of the stuff, and proceed to give it the get go. The taste was mild, and the smoke was pretty easy on the lungs. After smoking about 3/4 of it, we put it down and decided to just hang out for a bit and see if anything came up. We were not experiencing any effects at this time.</p><p>Then, about two minutes later, the effects came on. It was like the clean feeling I get whenever I roll, and a little bit of a positive push, like weed has. No particularly strong mental effects, lots of grinning. Bit of a head in the clouds without a care kind of feeling. Pretty nice. but not stoning in the least. Clear headed, and the whole ordeal had what I'd call a 'moderate' effect. A lot like how I would imagine diet weed would effect a person. If, of course, they marketed such a thing. The effects tapered off to a pleasant afterglow within I'd say 45 minutes. Also, we were both hankering for chinese, and our appetites were both totally gone by the time we finished smoking. A pleasant effect.</p><p>All in all, it isnt too shabby. I wouldnt mind having a little around just to brighten my days here and there, without the lasting lazy stone of weed. And the taste was nice as well.</p>",
 "year": "2004",
 "id": "34543",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-07T08:00:00.000Z",
 "views": "27276",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "(leaves)"
  }
 ]
}
