{
 "title": "Drinking the Green",
 "author": "Hassan",
 "citation": " Hassan. \"Drinking the Green: experience with Absinthe (ID 3457)\". Erowid.org. Oct 24, 2000. erowid.org/exp/3457",
 "substance": "Absinthe",
 "bodyweight": "200 lb",
 "report": "<p>I have been fascinated with Absinthe and the culture that surrounded it for several years.  Having read the excellent and informative Absinthe: History in a Bottle by Barnaby Conrad III and having come across the recipe that Dale Pendell reprinted in Pharmako:poia, I decided to try making my own.  I built a still, went to a local herb store got a bottle of good vodka and I was ready.  The first time I followed the recipe fairly to the letter, with the exception that I did not do the second maceration which is mostly for color anyway.  The result was a delicious liquor that was reminiscent of ouzo or sambucca.  There were however far too many people drinking from the bottle to really give more than just an impression.  It was delicious but had little effect with the amount consumed.  Keep in mind also that this first bottle had a fraction of the alcohol content of the traditional beverage.  I used 80 proof vodka which was diluted before distilation.  The second time I made a 'double batch' starting with a bottle of Everclear 1 litre (95 % alcohol) and a bottle of good cognac 750ml (60 % alcohol) resulting in an 80% alcohol content.  I increased the amount of wormwood by 150% as well as the calamus by 150%.  I also was able to find slightly better star anise. Once again, I did not perform the second maceration.  The resulting two bottles were so good that I had a bar tell me that they would be interested in purchasing bottles were I to continue to make the substance.  I was offered upwards of 100-150$ per bottle.  I never did take them up on the offer as it was a complex and time consuming precedure that was also not so inexpensive.  My return would not have been huge when factoring in cost of material, labor and danger of the still exploding in my small urban apartment.  I did however distill several more bottles after that. </p><p>That is how it was made.  Let me describe the effects briefly.  When several (one-two) glasses are consumed with cold water and sugar cubes there is a definite mellowing effect.  There is a very subtle widening feeling as if suddenly there is a little more room in the world.  It has very cursory canabis like feelings around the periferal vision and in the finger tips. although I am allergic to pot and have violent and unpleasant ecperiences with it  I do not have an analagous experience with Absinthe.  With three or four glasses there is a definite zoning out.  Not in any entheogenic or out of body sort of way, but in something that feels more like a high dose Kava Kava experience;  A warm sense of well being acompanied by a desire to sit and perhaps do nothing more than smile.  One important thing to remember is that it has a very high alcohol content and that is also effecting the experience.   If you are putting wormwood oil in vodka or soaking wormwood in something else, you are not drinking absinthe.  Absinthe is a beverage with a culture and a history.  I went so far as to design and print several different faux period labels as well as design my own absinthe spoons. I have had Hills from the Czech Republic (yuch)  Min was much, much better.</p><p> It is a delectable drink if prepared properly.   I encourage readers of this account to try it properly.  You are not going to trip or freak out and kill the neighbors.  But you might slip back around 100 or so years in history.  :)</p><p>Just a note from the vantage of Alamut</p>",
 "year": "97",
 "id": "3457",
 "gender": "Male",
 "timestamp": "2000-10-24T07:00:00.000Z",
 "views": "28034",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ]
}
