{
 "title": "Earthgasms and Telepathy",
 "author": "Zach",
 "citation": " Zach. \"Earthgasms and Telepathy: experience with Cannabis (ID 34579)\". Erowid.org. Jan 7, 2007. erowid.org/exp/34579",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>My day started off with a class scuba trip to Hornby Island, British Columbia, home of the world's greatest bud.  Anyways, I went there knowing I'd get some bud, and about 4 days in to the eight day trip a guy on the beach sold me a paperbag with two ounces for 100 bucks.  This blew my mind, as where I live, we pay up to 30 a gram and 400 an oz, so needless to say, I was incredibly impressed.  So anyways, I take this bag back to my room, pull it out and just gasp when I see the bud.  The plant itself is actually white, and the crystals are just, everywhere, a thick covering.  The smell could've knocked you on your ass.  I can't wait so i roll a quick gram joint.  My roomate, who we'll call Andrew decided to come with me.  He's very spiritual, and normally against drugs, but apparently part of going to hornby island is smoking bud, so we go for a walk. </p><p>It's about a 5 minute walk into thick forest, so we light up there, smoking the joint entirely, a half gram each.  It didn't seem to hit me until after we finished, but when it did, it was actually a powerful rushing, comparable to a low DMT dose (REALLY!).  We both sorta fell flat onto the soft mossy ground and laid back, looking up through the thick leaves at the bright blue sky below.  My hands and legs are spread out, and I just feel almost like electricity flowing from my finger tips, down my arms, up to my head and down to my nether-regions.</p><p>This is the best feeling I've ever experienced (including MDMA, demerol, heroin, morphine, 2-ci.. ANYTHING).  I just lie there, twitching with the flowing of the electricity of bliss. At this point, my amazing state of mind is interrupted as my collegue begins to moan, obviously in the same state of mind as myself, although through meditation combined with this feeling, he actually appears to have achieved climax - without physical contact. Gross lol.  So, he gets up, sorta pull his pants out from where they are stuck to him and starts going on about what an amazing earthgasm he had.  I'm grossed, but far too happy to say anything.</p><p>I've actually got long trailers as I walk.  From weed!  We walk to the beach and the sun is going down.  I turn to Andrew and say 'the sun will set in exactly 4 minutes, 26 seconds.  He flips the timer on his watch on and I'm EXACTLY right. The sun ducks just out of sight EXACTLY as I say it would. This is now maybe 20 minutes after smoking.  We go find a comfortable rock to sit on on the beach and I just sit there.  My vision gets more and more messed up somehow.  It continues to get more and more messed up and things take on a green tinge.  A yellow FLASH takes over my field of vision.  Everything goes bright yellow and I really can't make much out.</p><p>I fall back on the rock and see all sorts of visuals.  YES, VISUALS, OFF WEED!  Sort of like miniature movies, they last maybe 3 seconds and then switch to the next one.  I decide to open my eyes, but it makes no difference, I've lost total contact with the real world.  A minute or two later, I hurl a green putrid vomit.  Its clear, but green.  Very odd lol.  Slowly after that I began to come down. </p><p>Convinced the dealer sold me weed laced with 'something' (I knew it wasnt PCP) I went to him (he was still on the beach).  He laughed his ass off and brought me to his green house (which was very secured btw, dogs, lotsa locks etc. and clipped a teeny little bit of a bud off.  It was still on the plant and still had that THICK coating.  He told me to go dry that then smoke it, as proof that it wasn't laced.  I did just that (it was completely dry two days later) and had a very similar experience.</p><p>So, there you have it.  This experience completely changed my perception on MJ.  After I brought it back to town I sold a little bit of it but decided against selling more after getting my ass kicked for 'lacing it'.</p>",
 "year": "2004",
 "id": "34579",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-07T08:00:00.000Z",
 "views": "5169",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
