{
 "title": "The Joys of Absinthism",
 "author": "Ixodic",
 "citation": " Ixodic. \"The Joys of Absinthism: experience with Absinthe (ID 34589)\". Erowid.org. Apr 25, 2007. erowid.org/exp/34589",
 "substance": "Absinthe",
 "bodyweight": "135 lb",
 "report": "<p>Ahh Absinthe..</p><p>I first drank Absinthe about a year and a half ago I believe. I've tried many imported brands though this was a very expensive adventure - if you've looked at the prices from internet suppliers you know what I mean. I have since found a concentrated mixure that works excellently and tastes very similar to an expensive brand at a very nice price (about 26$ a liter for the finished product).</p><p>Since I've found this way of doing things I've been drinking no less than 3 glasses a day (going rate a liter a week currently).</p><p>*I'm working on my 4th glass of the day as I type this*</p><p>Absinthe is like no other alcohol - every alcohol has its own feel to it and Absinthe is my favorite 'feel'. The initial feelings of Absinthe are similar to taking pain killers and not at all like being flat drunk. I always keep a clear mind about things and it actually inspires thought on things you normally wouldn't give the time to. It gives a very pleasant mood but unlike some say, most certainly - not even in high doses, will cause hallucinations.</p><p>Nowadays, The effects aren't as strong as they were when I started since my body is well used to the Thujone but I still love it. I never quite gained a serious liking for the effects of regular alcohol - being in a drunken stupor never seemed too appealing though I've been there on many occasions. Absinthe is quite the different substance and it grew on me almost instantly. At this point I'm not so sure if I'm able, let alone willing to give it up. Absinthism proves to be real and separate from alcoholism, though this is one of the habits I've got into that I don't regret nor wish to quit.</p><p>In conclusion - Absinthe is a wonderous drink.. I say Cheers! and let the green fairy lead your way!, yet be aware that once she gets ahold of you you may not want to let go.</p><p>~Good luck on your adventures and enjoy!</p><p>~Ixodic~</p>",
 "year": "2004",
 "id": "34589",
 "gender": "Male",
 "timestamp": "2007-04-25T07:00:00.000Z",
 "views": "12458",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(daily)"
  }
 ]
}
