{
 "title": "Whirling Heads",
 "author": "Waus",
 "citation": " Waus. \"Whirling Heads: experience with Mushrooms & Cannabis (ID 34617)\". Erowid.org. Jul 6, 2007. erowid.org/exp/34617",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "6.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>We were out at a summerhouse of one of my friends with whom I was going to be tripping, we all had have previous experiences with mushrooms and had been living op to this moment. We woke up around 8am and started preparing our journey together, we knew very little about how to create perfect set and setting at the time, which proved to be disastrous, as some would call it, I on the other hand am very glad to have been part of this experience. As I told before we knew very little of set and setting, we just assumed music we normally liked would be perfect for tripping, so we prepared a cd with very diverse music we liked listening to under normal circumstances. This done, we started preparing the mushrooms, I cant remember the exact amount we all took, but I believe it to be 6-7 grams. We grinded and ingested it and started waiting for the mushrooms to come on.</p><p>The mushrooms came on surprisingly quick, in less than 10 minutes I was starting to experience light visuals and the 'mushroom state of mind'. We decided to go for a walk in the nearby forest, and started smoking cannabis while walking. Now everyone was starting to feel the effects of the mushrooms. We accidentally came by a road, suddenly everywhere there seemed to be big trucks, the noise became overwhelming and we tried to get out of there as quickly as we could.</p><p>Once we reached the forest, about twenty minutes after we ingested the shrooms we became aware of the damp and dead atmosfere that surrounding us. Everywhere I looked I saw dead trees and swamps, doing everything I could to avoid looking at my surroundings I was able to keep the situation in hand and it even seemed like I was in for an extremely joyous trip. One of my friends started humming the super mario bros. tune and suddenly it seemed like everything around me was changing in a videogame, everywhere around me there seemed to be those typical mario bros. mountains. But very slowly and at first without even noticing it, the thought that I was starting to go crazy came to me. The trip was still intensifying and my brain just couldnt grasp anymore that something as intense as this could be caused by the mushrooms I ate.</p><p>After about 45 minutes after ingesting I was starting to lose my grip on reality, the colours around me were slowly changing from dull greenish to purple and red colours, and I was getting more and more convinced that I was starting to go crazy and that I would never get out of this. Because we all found the surroundings to be extremely depressing we decided to return to the house.</p><p>I was quite relieved when we came back to the house, as I thought that now I would surely regain my sanity. We sat down on a bench and installed the stereo so we could listen to the music we prepared. Because we all had huge problems operating the stereo we accidentally set the first number of the cd on repeat, which happened to be firestarter by the prodigy. I dont know if you all know what kind of music this is, but it is extremely chaotic, somewhat mixing hardrock with techno beats. Even though I felt the music was wrong from the start I was too self absorbed to ask anyone to put something else on, the thought of doing it myself didnt even occur to me at the time being.</p><p>At this time everywhere I looked I saw purple colours and patterns I didnt understand. I slowly started to drift off into my own world and lost track of my friends, I simply forgot they were there. I was just sitting on the bench, trying to get a hold of myself. All I could hear was the tune of firestarter, driving me crazy. I was losing track of reality extremely fast by this time. I was slowly forgetting everything elementary in life, I couldnt grasp what it was like to be alive and the meaning of the words memory and loved ones were unclear. About 1.5 hours after the trip started I suddenly felt the urge to vommit, so I stumbled over to the bushes, unable to walk straight. Standing there I tried to vommit, but I wasnt really vommiting, it was more like the vommit was dripping out of my mouth.</p><p>Some time later I started feeling the need of sleeping this off, hoping that if I woke up it would all be over and that nothing of this would be permanent. I started walking towards the house to go to bed and suddenly became aware of my friends again, they all seemed to stare at me very awkwardly as if I was some freak of nature, so I mumbled that I was going to bed and tried to quicken my pace, when I got to the house I realised my friends had followed me and started to take place in the chairs in the living room, I made my way up the stairs to my sleeping bag and got in. This is where it started to go really bad.</p><p>Once I lay in my sleeping bag I tried to relax and sleep it off, but that seemed about the hardest thing in the world, it suddenly became extremely hard to breethe, my body stopped breething on its own and I had to take my own breaths. From time to time I forgot to breathe and became extremely dizzy. Slowly the room around me was changing in a world of its own and I started to see the friends I had downstairs as councillors of mine in this world, some of them telling me to just give up, stop breathing and die right there, for what was the use of continuing this life? But then the others would say to me (they were not actually saying all this, It was just the shrooms playing with my head) that my friends and family would be really upset to find me dead.</p><p>With this discussion going on in my head I quickly lost the last pieces of reality I had preserved in my brain. Suddenly I realised that I couldnt think of a reason to go on living, my mind couldnt grasp the fact of living, I couldnt understand how one would grow as a person, enjoy life and accumulate memories, nor could I understand why anyone would mind if I died right there that instant, the whole concept of caring for one another was erased from my brain altogether.</p><p>I decided to just give up the struggle to keep breathing and fall asleep, never to wake up again. This proved easier said than done, as everytime I closed my eyes, I would see these enormous heads whirling around me and laughing at me, as can be seen in cartoons when a character is going crazy. Opening my eyes I couldnt shake off the image of those heads and they didnt disappear. In agony I cried out to my friends, asking them to explain everything, because I didnt understand even the most elementary of things, so they checked up on me and tried to comfort me. Unable to help me they returned downstairs.</p><p>Still lying in my sleeping bag, I heard the voices of my friends coming from downstairs, I couldnt make out what they said anymore, but I had to much going on in my head to care about it. The room I was lying in was transforming into a prison before my very eyes, complete with bars in front of the little window I could see in front of me, periodically my friends would check up on me, trying to reach me, and as I was trying to talk to them I would sometimes see a flash of how the room looked like in real life, but unable to preserve that flash I relapsed and tried sleeping again.</p><p>This time I was actually able to fall asleep, I could feel myself slowly drift away into nothingness, I could feel my lungs stopping, my heartbeat slowing and my conscious drifting away. Suddenly I became aware of myself lying on the floor, I could see myself lying down there, dying, while I was watching myself lie there, I could actually feel my body giving up on the struggle to go on living and slowly letting me fall into deep nothingness. When I was convinced it wouldnt take more than seconds before all would be over, one of my friends came up and woke me up by striking up a conversation.</p><p>Waking up very disoriented I started breathing again and felt my body rejuvenating, trying to get things under control again I let this friend persuade to come down and join the others again. The moment I got up and made my way down, I felt the depression lifting, making way for an overwhelming feeling of ecstasy. At once all purple and red colours had lifted, making place for brown, gold and yellow colours. Sitting downstairs I started talking to my friends about how amazing I felt, released from the traumatic experience I just had. feeling the exact opposite of moments before, I was overwhelmed with joy and was struck by the beauty of life. Talking to my friends in that living room I had the time of my life, laughing and smiling all the time.</p><p>Somewhat later I suddenly felt myself coming down, and me and my friends started talking about the experience we just had, smoking some cannabis, we just kept being amazed by the intensity of the experience I just had, fortunately nothing worth noting happened during our period of coming down and smoking cannabis. I had a very intense experience, learning very much about myself and life itself. I really learned how important it is to enjoy life and keep your loved ones close.</p>",
 "year": "2004",
 "id": "34617",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-06T07:00:00.000Z",
 "views": "2781",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
