{
 "id": 3461,
 "title": "A Positive Experience",
 "date": {
  "submission": "2000-06-26T07:00:00.000Z"
 },
 "author": {
  "name": "Anonymous"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "Tbsp",
    "quantity": "3.75"
   },
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "The Natural Highs FAQ made Nutmeg sound like a substance definitely worth avoiding, but after talking to a friend of mine, I decided to give it a try. It didn't do much, but I was extremely groggy for the remainder of the following day (something I didn't relate to the Nutmeg for quite some time)...",
  "I didn't give up, however, and I decided that I had a neat alternative to watching the Super Bowl... I kept a little account of what happened - it reads as follows:",
  "January 31, 1993 -\r",
  "4:35 P.M. : I toss enough nutmeg in my mouth to make closing it difficult (due to a snap of the wrist that was a bit more zealous than I'd planned). Ice water as a chaser (that -has- to be relatively safe).",
  "5:05 P.M. : Another 3/4 tbsp or so, and water.",
  "5:20 P.M. : Felt like about a tablespoon this time. I've been eating quite a few itty bitty rice cakes, due to hunger.",
  "5:35 P.M. : Effectively finished off my bottle of nutmeg... I barely coaxed down 2 more mouthfuls of about 1/2 tbsp each. Let's assume about 3.75 tbsp over the past hour.",
  "6:13 P.M. : Mild headache",
  "8:00 P.M. : Slightly dizzy, especially when walking.",
  "8:51 P.M. : Unbelievably dizzy, and my hearing is indefinate. I feel soooo heavy. I am sinking constantly, and my vision is slowed. Neat. Pleasant. Relaxed.",
  "9:08 P.M. : Same as above, but I am spinning, also. This is still very relaxing and peaceful. My head is swimming especially, and my motions feel much different than I am used to - sort of as if the motions are dragging behind the limbs that are moving.",
  "9:20 P.M. : Just got off telephone - my short-term memory is virtually nonexistant - I couldn't repeat something I'd said 10 seconds ago. I had been watching Acidwarp, and - wow. It was unbelievable. Somehow my vision seems amplified. I noticed patterns I'd never seen before, and I felt like I was 'in' many of them. I am spinning in 10 ways at once, slowly. On my way to bed.",
  "February 1, 1993 -\r",
  "6:05 A.M. : I wake up, with a bit of a headache, and a mild spinning sensation. I'm a bit tipsy, a little less balance than I'd like, but I'm not moving inefficiently.",
  "6:06 P.M. : Almost all the effects are gone, I had cottonmouth pretty bad all day, and I was weak - not tired, but weak, and my head was never quite still. Not at all unpleasant, just a bit of an inconvenience.",
  "I went back and edited that a tad, because a few of the errors I made were embarassing - I dropped some punctuation, spelling, even a word or two...",
  "Anyhow, I really enjoyed this. I used pre-ground nutmeg, bought relatively recently... It's not something I plan to use regularly, but I have some whole nutmeg I plan try try freshly-ground... I've also heard good things about mixing it with mace. I never felt sick, apart from certain times during the hangover on Monday (I had P.E. that day at school - somewhat nasty, I'll admit.)",
  "For those of you that missed it, 'Acidwarp' (which I referred to) is this wonderful PC VGA kaleidescope program written by Noah Spurrier. I always liked it, but I am definitely glad I thought to watch it while I was on the nutmeg. Also - I went to sleep listening to music (Skinny Puppy, actually..) That was nifty, as I heard things differently. Most of the new things I heard were in the higher ranges, which made the entire CD sound different. I noticed some spoken words I'd never heard before and can't find again - either they're not meant to be heard consciously, or I was putting it there myself.",
  "The only unpleasant part of this at all was the hangover, and that was even kind of nice - it was refreshing to have something to do at school... I found that I felt as if I was falling, most of the time. If I leaned to the side, I kept going that way for quite some time. If I leaned to the left, and then the right, I kept falling in both directions for quite some time. I would have to say that this was, all together, a positive experience. Anyone else have a story to share?"
 ],
 "erowid": {
  "id": "2118",
  "citation": " Anonymous. \"A Positive Experience: experience with Nutmeg (ID 2118)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2118",
  "substance": "Nutmeg",
  "views": "120006"
 }
}
