{
 "id": 3464,
 "title": "Out of Desparation",
 "date": {
  "submission": "2007-07-23T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pope",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "ground/crushed"
  },
  {
   "time": "0:45",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "ground/crushed"
  },
  {
   "time": "2:00",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "ground/crushed"
  },
  {
   "time": "5:00",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Got my hands on some free Ritalin, and being watched carefully after being warned by the Dean that my excessive pot-smoking habits have not gone unnoticed.  In response to this, I decided to check out Ritalin and its effects on me in various doses.  Low dosage attempts made concentrating and riting papers or studying almost too easy... seemed like a wonderdrug, but I still wasn't getting any sort of intense euphoria, so I decided on finding my limits.",
  "The pills that were acquired were 'time-released', and orally did not seem to achieve any desired effects.  The pills were therefore crushed using a knife and credit card, seperated into anywhere between 10-25mg per line, and ingested nasally.",
  "T + 0:00 (8:00pm) 25mg nasally",
  "Ingested with the purpose of writing a couple papers and doing philosophy readings.  Got coaxed swiftly into playing a whole lot of Goldeneye.",
  "T + 0:45 25mg nasally",
  "45 minutes passed quickly, I was feeling the normal attentive-but-not-euphoric feeling, and my roommate suggested another pill.  This was as much as I'd taken before, and I started to feel my heart speed up some, along with a general sense of well-being and energy.  Mild euphoria, quite enjoyable.  Reality, for the next 3 hours to come, was seen through a bubble, blurred but stimulating.  No hallucinations of any sort, but none were expected.",
  "T + 2:00 20mg nasally",
  "Was starting to feel somewhat down, and despite suggestions/warnings from other accounts, I decided on more Ritalin.  Took almost all of a pill, gave a small amount to my roommate who'd been taking as much as me so far.  After this, I accompanied a female-friend.  I got excessively shaky, though, and my heart was racing fairly fast.  I found that I couldn't carry on a normal concentration, and so I drew, and tried to let my mind 'calm' some.  This went on for awhile, and three more cups of coffee later, she was asleep and I was coming down.",
  "T + 5:00 (11:00pm) 25mg nasally",
  "Doing nothing but sitting idly at my computer, trying to keep my heart from racing and to stop shaking, my roommate decided to crush us both up our last pills before I could decline.  I didn't quite feel like letting him take both, and so I snorted the last.  It seemed to help the shakes quite a bit, but didn't give me any sort of energy.  I entered into the state I'm still in now.",
  "(T + 8:00) Completely out of it, heart finally not beating excessively.",
  "Overall, I'd say it was enjoyable and a change from the normal (demerol, codeine, and pot).  The small doses stopped helping me concentrate as intently as they did at first as I used it every day.  I'm not sure if this is a tolerance, or a counter-balancing effect.  Having read quite a bit about the addictive nature of the drug, and not having enjoyed it enough to want to do it again any time soon, I thoroughly plan to stop using for some indefinite amount of time.  Only benefits over another upper like cocaine, I'd say, would be its ease of being acquired and relative inexpensiveness."
 ],
 "erowid": {
  "id": "21183",
  "citation": " Pope. \"Out of Desparation: experience with Methylphenidate (Ritalin) (ID 21183)\". Erowid.org. Jul 23, 2007. erowid.org/exp/21183",
  "substance": "Methylphenidate (Ritalin)",
  "views": "14947"
 }
}
