{
 "id": 3470,
 "title": "A Nice Lifting of Mood",
 "date": {
  "submission": "2003-02-10T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hooway",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "plant material"
  },
  {
   "time": "1:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "plant material"
  },
  {
   "time": "3:00",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  }
 ],
 "report": [
  "Participants, time, setting:",
  "My girlfriend (J, early 20s) and I, Hooway (early 30s) were bored one evening 3 weeks ago, watching TV in my San Francisco apartment around 8. ",
  "I just got 10g of dried Kougoed (Sceletium) from a legal source on the web.  Cost: $47 after shipping.  A worthy experiment for the dull wintertime.",
  "Deposited 200mg (?) of Sceletium in a standard glass pipe.  At 2 hits for her and 4 for me, we were laying on the futon...our moods were brightened a bit.  This seemed to wear off in an hour.  Felt like the long long end of a easy foxy trip, or the first comings on of an MDMA trip.  Mild, nice.",
  "Second time, two hours ago put 200mg in a water bong, after smoking some pot.   Emotions are brightened, and I feel very little problems with logical thought.  It's like being told very good news, then going out to hang out with friends and smoke a little pot or have a couple beers.   Slightly off and buzzed, but happier than just what the pot/beer buzz would bring.",
  "One hour ago - 200mg - two hits in a water bong, no pot +1 hour.  The effects (brightened vision, feeling emotionally uplifted) have come again.  Almost has a little salvia edge to it, it's hard to quantify but feels nice.  ",
  "Now: Nothing but cigarettes.  Scelectium effects are fading, but still felt like it lifted my mood from the deep, after a day and night of emotional tension.  No side effects except slight visual (brightened surroundings, slightly...)",
  "I can somehow tell it's working on the Serotonin side of things and not Norepinephrine vs. Dopamine vs. Opioid vs. the other myriad receptors.  A short acting SSRI, or possibly short mild acting Serotonin agonist like MDMA? ",
  "If it is like MDMA, should we be worried about the same mechanisms that cause neurodegenerative effects (dopamine flowing into sertonergic neurons, serotonin depletion?).   If so, would a MAO-B inhibitor be good with this - Nicotine, Deprenyl/Selegiline?",
  "Possibly Alpha-Lipoic to prevent heavy than normal oxidation problems? (it seems to lessen problems with Ecstasy in Rats)",
  "Research on it is limited at this point.",
  "Hello and peace from San Francisco, on the left coast."
 ],
 "erowid": {
  "id": "21213",
  "citation": " Hooway. \"A Nice Lifting of Mood: experience with Sceletium Tortuosum (ID 21213)\". Erowid.org. Feb 10, 2003. erowid.org/exp/21213",
  "substance": "Sceletium Tortuosum",
  "views": "48040"
 }
}
