{
 "id": 3471,
 "title": "Reconfirmed Experiences",
 "date": {
  "submission": "2003-10-26T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "K. J.Buzz",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Leonurus sibiricus",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(flowers)"
  }
 ],
 "report": [
  "I have been assaying the 'wild daggas' now for the last six months.  I personally believe it takes several experiences with any substance before one can truely validate the effects.",
  "I have experimented with smoking both Leonurus sibiricus (marahuanilla) and Leonotis leonurus (Lions Tail). Of the latter I used mostly pure flower tops. I have had now close to twenty experiences  smoking one large cigarette of one or the other plant. I always do this in the same setting to keep the variables of the experience down to a minimum. This is my own personal system of 'control'.  The setting is a quiet house, without any chance of distraction.  A clean consciousness, free from any other external substances. Most important though is the clarity of the intent for using such a medicine.",
  "On my experiences; The fist time I tried these plants (I group them together with also Mother Wort for they all contain the same active component leonurine) I thought I surely felt a mild cannabis-like effect that seemed to last for less than one hour.  Being aware of the 'placebo effect' I did not want to draw a conclusion from my first experience.  Although after several repeated experiments in the same setting using the same dosage I have confirmed/validated (at least for myself) the effects of these plants, and yes they are effective. I would put them in the catagory of a mild euphoric sedatives.  Very simular to a low grade marijuana (shade leaf) with shorter duration to the experience (up to 1 hour). Using my dose (1 fat J) I experienced very little negative after effects aside from a mild drowsy feeling that seemed to pass quickly.",
  "I do feel that these plants have a potential for application.  Although they are simular to Marijuana they are by no means a substitute for 'killer green buds', but they might be nice to keep around for when times get dry."
 ],
 "erowid": {
  "id": "21214",
  "citation": " K. J.Buzz. \"Reconfirmed Experiences: experience with Leonurus sibiricus & Leonotis leonurus (ID 21214)\". Erowid.org. Oct 26, 2003. erowid.org/exp/21214",
  "substance": "Leonurus sibiricus & Leonotis leonurus",
  "views": "32462"
 }
}
