{
 "title": "In a People's Palace",
 "author": "Augustus",
 "citation": " Augustus. \"In a People's Palace: experience with Mushrooms (in Chocolate) (ID 34721)\". Erowid.org. Oct 14, 2004. erowid.org/exp/34721",
 "substance": "Mushrooms (in Chocolate)",
 "bodyweight": "165 lb",
 "report": "<p>I live in Kansas City, which is quickly embracing alternative culture, so there is a flood of mind-altering substances available. I have always wanted to try mushrooms, and when one of my really experienced friends came back from college, she told me we had to try it. I will call her T. I called my friend who sold us both 3 grams of shrooms inside a chocolate sucker. The next day we planned to go to this beautiful classical museum called the Nelson. Forward to the next day... We picked up our Swedish friend and ate the shrooms (they didn't taste that bad in the chocolate). On the drive down to the plaza  the shrooms started to kick in and I got very nervous as the clouds started to turn purple. We arrived at the museum and I was struck by the beauty of the manicured gardens with the avant-garde sculptures all around me. The visuals kicked in when I looked at these granite stepping stones that started to silently glide across the glass. I lost my balance and wanted to lay down. The front lawn of the museum has these marble platforms made for people to lay down on. Laying down and looking up into the sky, the cirrus clouds took on the form of a sand in water sculpture.</p><p>We were getting bored of looking at the sky, so we decided to go to into the museum. We stepped into a history of religious art exhibit, and going backwards, saw the catastrophe of christian art. A painting of a thorn crowned Jesus sent chills down my spine, and the blood began to drip down the paintings face. I had to leave. We stepped into the Pagan art of the Roman Empire which possessed some of the most beautiful art i have ever seen. The marble busts of the Patrician artistocracy heritage evoked a deep understanding of the legacy civilization has left. Going to the Greek art exhibit reaffirmed this notion. The athletic men of the clay vases began to throw the javelins thrown 2200 years ago. Moving to the Eqyptian exhibit came the disturbing statue of a standing, perfected man. The was a scarily real-life vibe of this figure sculpted 4000 years ago. Moving on, we came upon a stone tablet from Sumeria. The intricate carving began to move as on a chain all over the tablet. We came to the exhibits end. There was an Impressionist painting from Monet, that with it vibrant color, began to ripple like an ocean wave. I looked at the painting for an hour.</p><p>We moved back onto the front lawn, where other people were playing frisbee which began to glow as it streaked through the air. Laying down on the lawn, I looked at the classical building, and the opening to Rob Zombie's Ratfink? began to play in my head as the the progression of human civilization and achievement washed over me. The true meaning of it became too much to bear, and my mind went clear. We decided to leave and went to a cafe to have Espresso and Cigarettes. The people watching and the environment evoked the daily life in Paris or Rome. I had a banquet to attend to as did my college friend. We left and on the way I threw up mushrooms and Orange Juice and the trip ended. I felt miserable, but thought that this sickness was worth it. A day later I think the same thing, and will be trying shrooms again within the next two weeks in the exact same place.</p>",
 "year": "2004",
 "id": "34721",
 "gender": "Male",
 "timestamp": "2004-10-14T07:00:00.000Z",
 "views": "6694",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(cookie / food)"
  }
 }
}
