{
 "title": "From Psychonaut to Temporary Schizophrenic",
 "author": "ChronicRod",
 "citation": " ChronicRod. \"From Psychonaut to Temporary Schizophrenic: experience with Morning Glory (Heavenly Blue) (ID 34743)\". Erowid.org. Feb 13, 2007. erowid.org/exp/34743",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "140 lb",
 "report": "<p>Before getting into the details of this experience, I'd like to point out that I have a rather low tolerance for a lot of substances. For example, pot has often given me hallucinations at low doses and initially a pin-joint would suffice to do it.</p><p>That morning, my roommate showed up with some pot and we smoked a modest joint together. I don't remember exactly how much I smoked, but it was enough to keep me in an altered state for most of the day. While I was just noticing a return to baseline, I was having a conversation with a friend who had some morning glory seeds. Having gotten the itch to try LSD and the like, I'd decided to settle for this, for now, and he agreed to come over and make an event of it.</p><p>By the time we started, it was roughly 10PM. We didn't have the materials for any kind of extraction, so we just ground up the seeds and drank them down with water, knowing we'd probably get sick. I'd taken approximately 400 seeds this way (one pile of exactly 100, plus one pile of 100 by sight, plus one pile of 200 by sight.)</p><p>While we were debating about whether or not it was a good idea, I was chewing on one seed at a time, eating about 10 or 20 of them in this way. I did it in jest (I'm normally very timid about drugs due to low tolerance, so I was pretending to be daring) but after about 10 minutes or so, I started to feel funny. I thought it was psychosomatic, but I later found out that it was a mild version of what I felt at the onset. I should have taken this into account before deciding to go with a full 400, but my friends were telling me that 400 was threshold for fun, despite what I'd read to the the contrary, and I had assumed that what I'd felt from the few seeds was not really a drug effect. For some reason, I felt no hesitation about downing the whole dose, and I finished if off absentmindedly.</p><p>There's a lot of toxic stuff in morning glory seeds. We went for a walk, but I started to vomit, and decided I needed to get some water, mostly to wash the taste out of my mouth. I had noticed, though, when I vomitted, that I had no visual perceptions, or that I was visually in darkness and I had briefly felt like I had sunken into some sub-sensory environment. It came out orange and frothy, and I immediately felt better until the next wave of nausea.</p><p>Light was a bit strange, saturated colors, foggy light, and I started feeling really weird again. My roommate, who had eaten 800 seeds and apparently vomitted most of them, had locked himself in his room, and the friend who brought the seeds didn't partake had decided to go home. So, I was alone in my room with no one for company, except the people on IRC that I was chatting with. I began to feel uncomfortably nauseous, but not bad enough to vomit, so I decided to lay down for a bit, contemplating whether I should induce vomitting, or just let it sit. Soon enough the decision was made for me, I was tripping heavily, and though thoroughly nauseated, it was no longer a discomfort in the least.</p><p>I was euphoric. More than that, everything was SO TRUE, and I was SO GREAT. I remember getting caught in feedback loops of thought about how completely true something was, and how true it was that it was true. tThen after a bit of this, realizing that what I was thinking was utter bullshit, I'd catch myself in a loop about how bullshit it was, and how true it was that it was bullshit, and how amazing it was that I'd tricked myself, and so on.</p><p>The effects continued to get stronger and stronger. I felt some very weird things, and saw weird things, all very difficult to describe. Two things, though, stand out. The first is the fact that I noticed what facts were immediately made available to me from memory whenever I'd think about something or someone. I could tell which ones I would normally be conscious of, they were very strong, and still others that I wouldn't normally be conscious of. I can't remember any examples, but I do remember being amazed at how the information came to me and spending a lot of time thinking about what it might signify in terms of neurochemistry.</p><p>The second thing is probably the basis for hallucinations. I noticed that normally incompatible stimuli were being paired or grouped; 'that tastes like my foot is sore,' would be a fairly tame example. Incoherent concepts were perfectly fair game. I could think and feel in this way. Further, the thoughts I was thinking were reflected upon as visual stimulus. Usually, a thought had a shape, though most of it was invisible, or perhaps the color of 'clear', and color, the edges were sharp with a band of many colors.</p><p>Finally, I got out of the 'I'm so great' and 'that's so true' phase, and entered something of the opposite. It became 'I'm so full of myself', which was true at the time, I thought I was the center of the universe, so I lay down and tried to relax. I found at this point that I could focus my eyes independantly, and one eye was focussed on something on my pillow, just an inch away from my eye, while my other eye was focussed on the door to my room, about 2 or 3 meters away. I don't know about others, but that's not possible for me while baseline.</p><p>For much of the time I spent in bed, I was completely inside my head. My memory of the extreme peak has waned quite a bit, but I remember some time when my visuals were completely imaginary. At one point I started looking at those little red dots that are omnipresent in my vision (this is a baseline phenomenon) and they were joined by bluish dots of a colour that isn't in the spectrum. Behind these dots were bright yellows and greens and every other color in a majestic network of perfect gradients.</p><p>Some time during the peak, I fell asleep, and woke when my roommate came home. I felt a bit weird upon waking. After a few minutes, I felt very paranoid, and asked to be alone. I couldn't take the quietness of my roommate, who later told me that the experience had made him feel very antisocial. I had problems thinking clearly, and anything I thought about would cause me to get lost in some detail. I felt schizophrenic, very schizophrenic. Further, I couldn't maintain a proper stream of consciousness. Actually, this phenomenon had lasted the whole trip, but it didn't bother me until I woke up.</p><p>I grew very worried that this state would never end. This is because I'd sat there for about 8 hours or so, thinking that only 30 minutes had passed. I freaked out when I looked at the clock and realized that not only should all of the major effects from the trip have been over, but I should've been baseline by this time, the evening of the following day.</p><p>I'd read that LSD can advance latent schizophrenia, and I was worried that this had happened, and that I'd be in that state forever. It maddened me, which just made the experience worse. Out of paranoia, I resigned myself to that fate and instantly grief hit me, which I reflexively fought. It was the worst experience of my entire life. Thankfully, I managed to eat and sleep and I even made it to work that night.</p><p>I still noticed drug effects up to 36 hours after the experience, and some psychological changes have been permenant. The drug effects were essentially a kind of detachment that allowed me to think very clearly, but less intuitively. Emotion was difficult to muster, and then only weakly -- 'love' was impossible to feel. I was concerned about this, but it wasn't distressing. I missed the way I used to be, though, and realized nothing would ever be the same again. Through the lament, I realized that I would eventually reintegrate and reattach to the world, whether it be drug wearing off, or new experience causing me to readjust. Thankfully, it was the former. I remember feeling pity for someone. At that moment I realized that I was 'normal' again. Mostly.</p><p>The permenant changes are very subtle, and beneficial so far as I can tell. The biggest change is a massive reduction in anxiety. Qualia is more pleasing to me, and my mind is a lot calmer than usual. I'm very pleased about the whole experience, despite the fact that half of it was the worst expierience of my life. That said, I'll never eat seeds again. I'm still game to try LSD, and I'd be willing to try extracted LSA without the presence of those nasty toxins.</p>",
 "year": "2004",
 "id": "34743",
 "gender": "Male",
 "timestamp": "2007-02-13T08:00:00.000Z",
 "views": "36662",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "400 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 }
}
