{
 "title": "Persistent Misery",
 "author": "Phthalo",
 "citation": " Phthalo. \"Persistent Misery: experience with Chloroform (ID 34744)\". Erowid.org. Jul 9, 2006. erowid.org/exp/34744",
 "substance": "Chloroform",
 "bodyweight": "132 lb",
 "header": [
  "DOSE:",
  " repeated",
  "inhaled",
  "Chloroform",
  "(gas)"
 ],
 "report": "<p>I recently took a little bit of chloroform from the lab where I work to try it out. At night, I put a few milliliters on a tissue and put the tissue into a plastic bag, which I then breathed out of (I didn't want to put the chloroform soaked tissue directly against my skin in case I had an allergic reaction to it).</p><p>I used it when I was lying in bed, ready to sleep. The vapour smells very, very sweet. It's like sugar gas. If I get too much in a single breath, I tend to gag quite badly (my throat just won't let it down) but breathing in some air with it helps it. I took several breathes of it but didn't get much effect from it until I started actually holding the gas in my lungs for a while. I gradually became kind of relaxed and spaced out, and it was quite a nice feeling - I was quite happy with it in the way that I get happy with most depressants.</p><p>As I breathed more and more, I started to get a whining sound in my ears followed by a numbness in my hands and then other limbs. I could keep my eyes open if I put a bit of effort into it, but wanted to see where this would go, so kept breathing it. The last thing I can remember is sealing the plastic bag and putting it down beside the bed before I must've drifted off to sleep.</p><p>I woke quite easily the next morning feeling ok. The soporific effects of the chloroform had left me by this stage (it was probably 9 or 10 hours later) but I found I couldn't really be arsed to do anything. Eventually my bladder convinced me that it really did need emptying, so I went to the toilet and came back totally exhausted. Anything I did for the rest of the day left me totally run down and worn out like that, and it was *not* pleasent.</p><p>I spent most of the day in bed, feeling too knackered to get up (although mostly too awake to sleep)... It was such a depressing experience that I think the chloroform may have been directly effecting my mood by this stage. I was so miserable that, during the afternoon, I fell asleep again (and it was even sunny outside but I had my curtains closed and was still in my pajamas) and had a dream about how terrible my life was and in the dream I tried to drown myself with the help of a young child. No I've suffered from depression for quite some time, and am on Venlafaxine for it at the moment, but I have rarely been so miserable as I was that day... my heart really goes out to people with chronic fatigue syndrome, who have to put up with this all the time.</p><p>I've now tried chloroform three times in this way and can confirm that I definitely leaves me feeling totally exhausted and miserable the next day. The last time I did it was the day before yesterday, and I am grateful that I am that I'm not feeling like that now! The extent of the exhaustion seems to be related to how much chloroform I use, rather than how deep I go with it. I've also tried mixing codeine with it, but it's basically a waste of good codeine (which is essentially a very friendly, albeit addictive drug) - I can't really feel its warmth when I've used even just a little chloroform.</p><p>I'm certainly never going to do chloroform again. I've thrown out any supplies that I had left of it, and don't ever want to smell its sickly sweet intoxication again.</p>",
 "year": "2004",
 "id": "34744",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-09T07:00:00.000Z",
 "views": "17528",
 "dose": {}
}
