{
 "title": "New Method",
 "author": "Soulbrother",
 "citation": " Soulbrother. \"New Method: experience with Oxycodone (ID 34791)\". Erowid.org. Sep 7, 2007. erowid.org/exp/34791",
 "substance": "Oxycodone",
 "bodyweight": "150 lb",
 "report": "<p>I guess I'll start with the preparations.  Mindset and setting are not so much a factor, as after smoking OC you will be euphoric and high as hell.  The only thing to keep in mind is that the smell is pretty distinct and pungent, so its probably a good idea to be somewhere 'cool', but that goes without saying.</p><p>Instructions for smoking:</p><p>1. Get a small square sheet of tinfoil, and place a chunk of a broken up pill towards the edge of it. It is important to keep the pill in fairly large chunks as powder vaporizes much too quickly.</p><p>2. Run a flame under the pill until it sizzles a little and sticks to the foil.</p><p>3. Hold the foil at an angle and put the flame under the pill. It will begin to smoke and run down the tinfoil, leaving a black trail.</p><p>4. Follow the pill closely with a tube (i.e. a straw, hollow pen, etc.) while inhaling the smoke.</p><p>5. Hold the smoke in for as long as possible.</p><p>6. Exhale and feel your body completely relax.</p><p>The effects will come on in 5 minutes or less, and are almost indentical to oral or nasal administration, except I have found them to be more powerful, and less addicting.  In prior experiences with insufflation the next days I would have an insane desire to just keep buying and putting the stuff up my nose.  With smoking however, the next day the thoughts about doing it are far less intense.  I would highly recommend at least trying this method if you are someone who has access to OC.</p>",
 "year": "2004",
 "id": "34791",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-07T07:00:00.000Z",
 "views": "47102",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 }
}
