{
 "title": "A General State of Happiness",
 "author": "Gulliver",
 "citation": " Gulliver. \"A General State of Happiness: experience with AMT (ID 348)\". Erowid.org. Sep 8, 2000. erowid.org/exp/348",
 "substance": "AMT",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "35 mg",
  "oral",
  "AMT",
  "(powder / crystals)"
 ],
 "report": "<p>Mental and physical state entering experience :</p><p>Mentally I was in a familiar environment with people I have known for years, people I am familiar with and one person that I had never met before.  This included ground control and one whiskey bottle bearing drunk.  Not having had anything overly stressful happen to me lately my mind was clear and ready for a positive experience.</p><p>Physically I was up on 4 hours of sleep.  My consumption of solids consisted of a hand full of chips, some excellent bean dip and sesame tofu from my favorite chinese restaurant about five hours prior to dos time.  My consumption of liquids consisted of 3 beers and two shots of whiskey.</p><p>Times are likely to be off by up to 4 hours.</p><p>11:30 PM - AMT was ingested by A 75mg, B35mg? and C 35mg (myself.) and D (8-10 ounces of whiskey and a couple of beers.)  I and not all but several of the others also had 100mg of 5-htp at the same time.</p><p>11:45 PM - I feel definite effects even thought he capsule hasnt even had time to dissolve let alone the 30-60 minutes for the come up period.  After some contemplation I attribute this to a psycho somatic effect.</p><p>12:00 AM - The second wave shows up and proceeds to consume AMT, E 45mg?, F 35mg, G 35mg.</p><p>1:00 AM - Effects are a definite, vomiting is occurring for A, E and G, most everyone has cramps to varying degrees.  Sudden movement had been blamed for the vomiting.</p><p>2:00 AM\t- Everyone reports a general state of happiness except for B who has fallen asleep.  We are left with no choice but to cuddle, I am feeling emphatic towards everyone and unlike MDMA I am not feeling emphatic towards inanimate objects or people who have wronged me in the past.</p><p>Comments made between 2 and 6 am (peak/plateau) - </p><p>Where is my depth perception?</p><p>Whos arm is this?</p><p>Eep, eep, oooggth.</p><p>Is that happy writhing or grumpy writhing?</p><p>I wish I had a trampoline.</p><p>Are you Sancho?</p><p>I lost my frame of reference.</p><p>6:00 AM\t- Somebody mentions the time, looks of shock sprout up in the room.  B wakes up and shortly there after goes home.  The rest of us are amazed and suspect that he will have a difficult time getting through his planned morning activity of going to church with his girlfriends family.  E by far had the most intense experience.  Since my stomach cramps were mild earlier I am paying for it now with slightly more intense cramps, pacing seems to help.</p><p>7:00 AM\t- I mistakenly think that sleep is possible and the trip is over.  Sleep results in brief 30 second dreams followed by waking in a panic.  The increase in light makes me aware that my eyes will not stay put, attempts at focusing take up to 10 seconds and sometimes fail all together., life is however still blissful.</p><p>10:00 AM - D wakes up and asks me to drive him to work.  I agree since the world seems normal from my prone position, 15 minutes later in an upright position is becomes blatantly obvious that not only am I unable to drive but that I am unable to stand with out holding onto something solid.  Breakfast is discussed at length, nobody is ready yet.  E starts to drink Gin and Tonics, claims they help. </p><p>12:00 PM - F also has to go and brave the world, the bus is decided upon as no one is able to drive still.  I become sad as I imagine my self riding the bus for 2 hours, I wish that F didnt have to go.  The sadness was replaced by a happy euphoria within minutes.</p><p>2:00 PM\t- It is decided that the rest of the day needs to be written off as a loss.  Movies are put in the VCR and food is cautiously eaten.  In an attempt to get some peace I start drinking beer, E was right, it did help.</p><p>8:00 PM\t- 21 hours after ingesting AMT my eyes stop bouncing around as much and thoughts of sleep creep in.</p><p>10:30 PM - Sleep occurs.</p><p>7:00 AM\t- After almost exactly eight hours of sleep I and everyone else awakens.  The predominate topic of conversation is how impressive it is that we dont all feel like hell.  Showers are taken breakfast is eaten and we part ways.  Driving home I sneezed as the sun catches my eye.  A shudder of pleasure follows and I am reminded that all is still not right in my world.</p><p>Points of interest</p><p>Alcohol and AMT mixed with no noticeable side effects.</p><p>With the exception of the four hours between 2 and 6 AM I felt as if I could have dealt with any situation that did not involve heavy machinery.</p><p>Everyone wished to take more next time.  I assume this means they were satisfied with this time and felt that more would be safe.</p><p>To reiterate, after only four hours of sleep the night before and a 20 plus hour trip I feel great after a mere 8 hours of sleep.</p>",
 "year": "2000",
 "id": "348",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-08T07:00:00.000Z",
 "views": "6704",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  }
 }
}
