{
 "title": "A Dissapointment",
 "author": "m-piker",
 "citation": " m-piker. \"A Dissapointment: experience with Mushrooms (ID 34818)\". Erowid.org. Aug 19, 2004. erowid.org/exp/34818",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "report": "<p>After reading all about the effects of shrooms, I felt I was ready to try them. I was ready to experience somthing more intense than weed, more insightful and more trippy. This in mind, I purchased 3 grams dryed from a dealer. I took them at 7:30pm at a quiet school. The taste was fine! More than fine! Tasted like popcorn, I thought. After ingesting them, me and my friends (2 of which were also on shrooms for the first time) sat down and waited for the effects to occur. At around 8:00 or 8:15, I felt mild effects. A strange body feel, a sort of heavyness... overall an odd body feel. These effects increased gradually, but at about 8:45, I stopped going up. I kept expecting to have more intense effects take place, but my state stayed pretty much level. Things moved slightly when I looked at them, but I had to concentrate on them really hard. Colors seemed the same; I never really had any visual aspects. My thought patterns stayed the same as well. I was expecting to have interesting, erratic thoughts, but this did not happen.</p><p>I mean, they call shrooms a psychadelic, but I felt less high, less creative and less inspired than I have been before off high doses of marijuana. Later on that night, at about 10:30, I smoked two bowls of marijuana. After doing so, I became very stoned, but it was more the weed than anything else. I wonder if it was just bad shrooms, too low of a dosage, or maybe my expectations were just too high. Why shouldn't they have been though? The medium dosage effects of shrooms (.75-2.5 grams) reportedly includes 'lights gain auras, star-pattern effects, rainbowing around lighting, lights seem brighter, often 'more beautiful' 'closed eye 'visuals': normal closed eye 'blobs' take on patterns, shapes, distinct forms, increased ability to visualize creatively, spontaneous detailed images'. I experienced none of the above.</p><p>Next time, I guess I'll try 6 grams or so, but I really dont think I should need to take that much. My first shroomage was in one word, dissapointing. It made me think, 'is this as far as my mind can stretch?'</p>",
 "year": "2004",
 "id": "34818",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-19T07:00:00.000Z",
 "views": "6788",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
