{
 "title": "I Forgot the Rules of Reality",
 "author": "The Hyaena Swine",
 "citation": " The Hyaena Swine. \"I Forgot the Rules of Reality: experience with Salvia divinorum (ID 34869)\". Erowid.org. Sep 3, 2004. erowid.org/exp/34869",
 "substance": "Salvia divinorum",
 "bodyweight": "152 lb",
 "header": [
  [
   "DOSE:",
   "0.2 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34869",
   "Male",
   "",
   "Not Given",
   "Sep 3, 2004",
   "7422",
   " "
  ]
 ],
 "report": "<p>I had tried smoking Salvia leaves previously on 2 occasions and had subtle effects but no kind of breakthrough. I ordered some 10x extract and today my friend came over to sit for me while i smoked it. Before I tried Salvia divinorum I read hundreds of trip reports online, but nothing prepared me for how utterly strange and powerful the experience would be! Writing this report is so difficult !</p><p>I sat on the grass in the garden and put a very small amount of the 10x extract in my pipe and smoked it with my butane lighter. I felt sensations in my legs and a sense of being led somewhere, so I packed a larger pinch of the stuff (really not very much) into the pipe, lit and inhaled. I got a good hit and held it in, i remember my mate saying 'there's another hit left after that one' and that is the last thing i remember before it HIT me. I don't recall exhaling. </p><p>Everything was black and there was the sensation of falling backwards. The only way I can describe it is my consciouness felt like it was falling backwards and I had the thought 'OH MY GOD!!! THIS IS WHAT IT IS LIKE!!!' I felt the sensation of spiralling downwards and being hit on every side possibly by a spiral of multiple hands, but as i had completely just left my body it didn't seem to matter as i didn't interpret the sensations as pain or indeed as touch at all. </p><p>According to my friend, as it hit me I fell backwards into some stuff in my garage (hence the feeling of falling and things hitting me) and ended up laying on the floor. This would correspond to what I was experiencing as I can vaguely remember having a sense of the wheel of my bike and the carpet being all around.</p><p>It was as if I had forgotten everything! The weirdest feeling! I could sense my friend asking me if I was OK but it didn't make sense because although I felt I should respond to him I didn't know how to. There was the distinct sense that I had done something 'naughty', like I had been shown a secret that I wasn't supposed to know.</p><p>I felt like there was a set of rules for this reality and I had forgotten them. I had forgotten the rules of reality. I was just a consciousness separated from my body. I had the sense that there was a secret that I had forgotten and I was trying hard to remember what it was. I eventually realised... I am a person and I have a life! </p><p>There was a feeling of 'OH WHAT HAS HE DONE ?!' . I couldn't remember my life and I had the weird feeling that maybe I would be like this forever because I didn't remember I had smoked a drug. Now, I had read about others experiencing that but never thought it could happen to me.  It felt like what it would be like to be insane.</p><p>I then reconnected with my body, I saw my life and it was like a suit that I slipped into. I had a feeling of something to do with my childhood.</p><p>Being disconnected from my body was the peak of the trip and if I had smoked more I think that state would have lasted longer and perhaps I would have been shown more. I got up and this point, probably no more than 5 minutes after smoking and sat on the grass talking to my friend, I still felt as if what constitutes 'me' was in my head and I had nothing to do with the body that I was attached to.</p><p>Slowly over the next 20-30 minutes I remembered bit-by-bit who I was and the life I live. It was very comforting!  While I was on the grass I laid back and looked at the clouds, they moved in geometric patterns, like cogs in a machine and seemed very much like whisps of gas. </p><p>When I first came to I was aware that I had a body but couldn't remember the rules of reality properly, I remembered I had smoked Salvia which helped. It was kind of scary although I didn't freak out and kept reminding myself that the experience would be over in ten minutes or so. I kept repeating 'THIS IS SO WEIRD !'</p><p>I have no memory of falling over and apparently I told my friend to leave me alone but I don't remember.</p><p>The experience was like being reborn in a way because it was like rebuilding my life and piecing together what constitutes 'me' from the bottom up.</p><p>Words cannot really come close to describing how strange this was. It was not what I would call a fun experience. However, it was certainly amazing. After I had smoked I told myself I will never do this again, but upon reflection I think that I may. However, I will approach the experience with much meditation beforehand and treat the Salvia with the enormous respect that it deserves.</p><p>Use a sitter.</p>"
}
