{
 "title": "Quid & Tea",
 "author": "m7w",
 "citation": " m7w. \"Quid & Tea: experience with Opium (tea), Kratom, Cannabis & Coca  (tea) (ID 34875)\". Erowid.org. Aug 23, 2004. erowid.org/exp/34875",
 "substance": "Opium (tea), Kratom, Cannabis & Coca  (tea)",
 "bodyweight": "",
 "report": "<p>I was fortunate enough to have a very interesting experience this evening.  I smoked a hefty bowl of herb before I left to go downtown in the city in which I live with my Djembe and good company.  I drummed for a while, smoked some cigarettes and sought out honest conversation between the people I had the pleasure to communicate with this fine night.  The wind was full of rhythm a very electric atmosphere was around my perception, energies were channeling to a point in understanding (or so it seemed to me). </p><p>Three recent made friends showed up after an hour or so.  We broke instantly into theological and mythological discussion.  My friend J has a family history of healers in his Mexican/Indian heritage  the Curanderos: healers of many Mexican Indian tribes such as the Mixe of Oaxaca.  After this we left to go back to Js flat to talk and hang out. After showing me his adorned shrines, with emphasized a Cambodian sect of Buddhism, he offered me some Opium Tea.  He had mixed a pot with about 5 cups of water and 15-20 large opium poppies (Papavera somniferum), 2 tea spoons of generic brand lime concentrate, some fresh chamomile and mint.  The pot had then been simmered for 3-4 hours with occasional water refills.  And then had sat over night.  He poured me a standard tea sized cup to start with.  The taste was delicious and distinct.</p><p>As we continued to talk about various things he offered me a quid of kratom (Mitragyna speciosa).  The taste was not particularly pleasant, not that bad though.  About 50 times better tasting than San Pedro syrup.  I held it underneath my tongue for about 40 minutes then chewed it up and ate it.</p><p>T+00:35 Minutes:  Delightfully warm feeling of comfort with my surroundings.  Perhaps a psedo-empathetic attachment going on.  All ideas are very interesting and the flow of conversation is very smooth within the group. By this point I believe I was experiencing the come on stages of the opium tea.  A very defined opiate experience much more mellow than Hydrocodone, Oxycodone or any synthesized med. </p><p>T+01:20 Minutes:  Im beginning to feel extremely high. </p><p>On top of the herb that we had been smoking the kratom was beginning to have a very strong physically sedated affect along with heightened mental alertness.  The room began to linger in a surreal dimension of superlative communication.  We verbally spun a megalomaniac web that some how mapped society in a ridiculous satire involving a broom and Ted Dansons skeleton  something about Bob hope too.  In all actuality Id say we made little to no sense in the aspect of an outside observer.  But, at the time, clarity was prime and number one.</p><p>T+02:30 Minutes:  I am still feeling excessively blasted!  Cant stop staring at random objects and thinking about them for way longer then any person should.  The euphoria is very strong  a more natural soothing combination with effects quite similar to a dose of MDA.  Feeling very empathetic, inebriated from inhibitions beyond belief.  At this point in time I had also been experiencing some heavy pressure in my stomach.  Wasnt outweighing the good though.  We continued to smoke herb and the high became placid without sound or external stimulation.  To simplify, I felt very smacked out.</p><p>T+4:00 Minutes:  The opium teas lingering effects are still clinging to my spine.  The kratom seems to be tapering off but the herb is still very obviously making me extremely high.  Its about 4:00am in the morning now so I think Ill go to sleep. Sleep was extremely easy to achieve.  I slept soundly for about 9 hours with some extremely lucid dreams.  An effect that opiates have on me.  Im not sure if the kratom had anything to do with it.  Though the effects while I was awake had a very dreamy quality.</p><p>I woke up the next day feeling a bit drained.  I chewed some more kratom about 30 minutes after I woke up because I wanted to experiment with it without any other drugs.  This idea only lasted about another 30 minutes when I made some coca tea and drank about 5 cups worth.  My day was very energetic with a mellow comfy edge.  I believe kratom has the potential to be very addicting.  It makes the world seem inflated with kindness along with a very distinct euphoria.  The coca as always made me pleasantly stimulated, equivalent to about 3-4 cups of coffee.</p><p>It seems this combination of drugs that I pursued in the first part of my evening could potentially have some positive therapeutic effects in counseling sessions or what not.  Our mode of communication was extremely sincere and patient.  Our egos were displaced by empathy.  I plan on experimenting with kratom a couple more times before I make my final decision.  I can say though, its effects are extremely pleasant and noticeable from this trial experience.</p>",
 "year": "2004",
 "id": "34875",
 "timestamp": "2004-08-23T07:00:00.000Z",
 "views": "23223",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "buccal",
   "substance": "Kratom",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "amount": "7 bowls",
   "administration": "oral",
   "substance": "Opium",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "5 cups",
   "administration": "oral",
   "substance": "Coca",
   "form": "(tea)"
  }
 ]
}
