{
 "id": 3490,
 "title": "Don't Do What I Did",
 "date": {
  "submission": "2003-02-15T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Matt",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "AMT"
  }
 ],
 "report": [
  "One night I was with a group of friends and they had some AMT the kind that smells like mothballs, I insisted that one friend front me 2 capsules which had 50mg each in them.  He did so I opened them up and emptied them out onto the table, everyone in the room told me dont snort that much because I will not like it.  I said dont worry about it I have tripped my brains out before, this was the second time I took AMT.  The first time I didnt have any visuals just the feeling like I was on MDMA, (the reason it didnt hit me was because of the cross tolerance the night before I took 1 roll) so I figured 100mg wouldnt do much more than the 50mg I took the first time.",
  "So after I did it the burn was crazy for about 10min then everyone kept saying man you should get home before it hits you.  I said I am fine, finally after about 30min I decided to go home it didnt kick in yet, so I took my friend home and while I was driving home the AMT hit me, the visuals started.  I was so lucky to have made it home that night.  As soon as I came home I went downstairs and just was like oh man.  The visions I saw were like nothing I had experienced before it was stronger than taking 13hits of acid seriously.  I just sat there and my body was in euphoria and I closed my eyes and could swim with the dolphins in the ocean.  It was that great.",
  "Then the jaw clenching and the shivering started so I went and got some water and kept drinking water the rest of the time I was tripping.  I just stayed in my basement the whole time because I couldnt let my mom see me like this so after the whole night of tripping my face off I went upstairs when the visuals were gone but the rolling feeling was still there.  I went to my mom and told her what I did and she wasnt mad because of the fact it is legal.  I opened up to her for the first time in my life, I am 19 years old and never talked to my mom like I did on AMT, it is great for people who need to open up and talk.",
  "I talked to her for about an hour and told her how I felt and all she sat there and talked to me about life and everything.  I wouldnt recommend anyone taking 100mg their first time.  It's very intense VERY INTENSE.  Also make sure you drink plenty of water, as your body will appreciate that.  I didnt throw up nor have any diarrhea as some people reported."
 ],
 "erowid": {
  "id": "21264",
  "citation": " Matt. \"Don't Do What I Did: experience with AMT (ID 21264)\". Erowid.org. Feb 15, 2003. erowid.org/exp/21264",
  "substance": "AMT",
  "views": "12260"
 }
}
