{
 "title": "Short and Comfy, with Noticeable Body Load",
 "author": "Z.",
 "citation": " Z.. \"Short and Comfy, with Noticeable Body Load: experience with 5-MeO-MiPT (ID 34956)\". Erowid.org. Aug 19, 2004. erowid.org/exp/34956",
 "substance": "5-MeO-MiPT",
 "bodyweight": "290 lb",
 "header": [
  "DOSE:",
  "17.5 mg",
  "oral",
  "5-MeO-MIPT",
  "(liquid)"
 ],
 "report": "<p>All times 24-hour clock</p><p>(5-MeO-MiPT @ 25mg/ml @ 67% Ethanol)</p><p>This is a log of all food, and etc.</p><p>14:30 2 homemade tacos - rice, beef, corn shells, soy cheese</p><p>600mg d-alpha lipoic acid in powder capsules (antioxidant/dietary)</p><p>750ml tap water</p><p>18:00 rough time estimate of giant chocolate chip cookie</p><p>20:00 rough time estimate of another giant chocolate chip cookie</p><p>22:14 0.5ml for Maho at 250lbs in about 100 ml of water</p><p>22:16 0.7ml for me at 290lbs in about 180ml of water</p><p>Observations - 5-MeO-MiPT drops out of solution and re-dissolves</p><p>Both of us were ravenously HUNGRY. Maho is hesitant but still wants to do it. Maho is a little paranoid because it's been 10+ years since anything, he has 2 kids, and his wife would disapprove.</p><p>22:25 first log entry of amounts taken, delayed by idle banter. Minor giddiness that may be anticipatory pre-effects</p><p>22:34 I feel the first tingles, sort of like early X-tingles</p><p>22:40 Maho feels the first tingles - this sets a pattern. He is about 5 mins behind me for all effects.</p><p>22:42 I feel the effects ramping up quickly. A bit of robo walk, a little giddiness. Maho feels like he's a little drunk.</p><p>23:01 Very strong body load, very dissociative, fast onset. Some sleepiness in both subjects, but we were both up early. I felt lots of tingles. The best association is a cross between plateau 2.5 - 3 DXM and 1-2 tabs of X (I'm big, so 1.5 tabs is about a normal dose). Tracking time, typing, etc became very difficult after that.</p><p>23:30 I would guess that peak was no later than this. Peak was a spike, then things dropped down to a cozy, managable level for a slow let-down. Body chills, echoes, air felt overwhelming. All sensory input was amplified, though tactile was most noticable. I think some of this was the vibraty body load, and some of it was the ceiling fan. Lots of tracers and afterimages. Conversation was OK after the peak, but Maho never got to that high of a level. I steered his mindset a bit because he was heading negative, but was very receptive to power of mind over mindset type statement and was easily directed into conversation. He had alot on his mind due to recent work changes, and various life issues related to that and much of the trip for me  was being his confidante. It was OK after the strongest effects subsided. During peak, we somehow managed to cook and eat boiled veggie hotdogs. It was a feat, but it worked ok. There was some stomach irritation which was largely abated by this. Maho focused on it longer and he said it felt like a cross between need to throw up and a need to eat.</p><p>Distraction made this go away mostly and so I explained such and sent him into other topics so he wouldn't remind me. We discussed alot of typical mental focus and ability of sentient humans versus sheep humans. No hallucinations, but there were noticable aftereffects. Auditory, visual, thought, etc were moderately dissociated, but generally normal. Tactile vibrations and shutters periodically would become slightly sexual in nature, but easily abated due to the lack of suitable people for exploration of that. Maho never got past feeling pretty strongly drunk, and giddy, and silly, though. His dose was proportionally and absolutely lower than mine.</p><p>02:00, all formal effects were gone. No hangover, no discomfort, no tiredness.</p><p>06:15 sleep finally began to overcome me despite herculean efforts to stay in conversation. Sleep was a interrupted, but I think it was due to lack of proper setting for sleep (sofa, high armrests, chilly ceiling fan). Today is happy and good and conversation/thought is clear and copious.</p><p>14:00-1500 driving home was normal and clear and responsive.</p><p>18:00 today I find that I am very tired and irritable because I am short on sleep and have not been allowed to have more than a couple of cat naps at home. Thought is still clear and good.</p><p>Overall feeling. This is nice, short and comfy. The body load is very noticable and requires sufficient distraction/interaction to override. This could be a very intimate drug in the right setting. Mental processes are not overtly enhanced or altered like with LSD. A certain relaxation and dissociation is present, but not a problem. Definitely not for a newbie, but OK for a short trip (about 4 hours) with a few close friends. Larger doses have a longer taper off at the end and more pronounced effect. 12mg for Maho at 150 pound person was a little low but perhaps good for a newbie. 18mg was good moderate-strong dose for me at 290 pounds. I think an overall range would be 10-20 for some people.</p>",
 "year": "2004",
 "id": "34956",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-19T07:00:00.000Z",
 "views": "14487",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "17.5 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(liquid)"
  }
 }
}
