{
 "title": "Confused and Heavy",
 "author": "Neuroactive",
 "citation": " Neuroactive. \"Confused and Heavy: experience with Metaxalone (Skelaxin) & Cannabis (ID 34960)\". Erowid.org. Jan 7, 2007. erowid.org/exp/34960",
 "substance": "Metaxalone (Skelaxin) & Cannabis",
 "bodyweight": "175 lb",
 "report": "<p>I've been using Skelaxin sparingly to help with chronic leg and muscle pains. My previous use of Skelaxin had been generally uneventful and untherapeutic, even when used in conjunction with a small amount of alcohol (which seems to totally relax the painful muscle contractions).</p><p>Under extreme discomfort and multiple regions of pain, (a very sore arm and the reoccurring leg pains) I decided to take four 800mg pills. Dosages previously had been between two or three of the pills with very limited effects.</p><p>After squirming around for a couple hours, I finally got to sleep. The Skelaxin only seemed to produce its usual subtle sedation for the two hours I remained awake that night. The next morning I awoke feeling extremely hungover and dehydrated. I was very hot and uncomfortable, even when I returned to bed.</p><p>My apetite was destroyed by the uneasy stomach and lack of energy I had. I thought a bit of Cannabis would help me get back to a comfortable level of sedation. Instead, the anxiety and irritability of the Skelaxin increased dramatically. Some of the bodily discomfort was relieved, but confusion and delirium set in. I had an extremely hard time reading simple text - I couldn't keep my attention on anything.</p><p>I decided that a warm bath might help, so I smoked the rest of the Cannabis and slipped into the bath. My muscles became wildly relaxed, but I was still in a great deal of discomfort. My head felt warm and my breathing was somewhat erratic, fading in rhythm and returning in anxious waves.</p><p>While in the bathtub, I was overcome with a great deal of irritability and anxiety. I felt like I was stuck under a great rock, unable to move without great effort and discomfort. The mild OEVs that marijuana usually produces in my relaxed state became greatly exaggerated - resembling patterns seen while under the effects of psilocybin; minus the heavy distortion of perspective.</p><p>After some rest and some stretching, I began to regain my strength over the day. I can definitely say that the unpleasant effects lasted until around 9 P.M. the night after I took the dose. This put me at approximately the T+ 20hr mark.</p><p>In some ways, this reminded me of my awful experiences with amitryptaline - feeling like a zombie all the next day after dosing.</p><p>I must say, the effects of Cannabis have never been so wildly pronounced without interference from other, stronger psychedelics.  I'm glad to be at a point now where I don't feel like collapsing! Not a recommended experience by any means.</p>",
 "year": "2004",
 "id": "34960",
 "gender": "Male",
 "timestamp": "2007-01-07T08:00:00.000Z",
 "views": "29365",
 "dose": [
  {
   "time": "0",
   "amount": "3.2 g",
   "administration": "oral",
   "substance": "Pharms - Metaxalone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
