{
 "title": "The Day After... And the Whole Month",
 "author": "r3d1",
 "citation": " r3d1. \"The Day After... And the Whole Month: experience with MDMA (ID 34997)\". Erowid.org. Jul 9, 2004. erowid.org/exp/34997",
 "substance": "MDMA",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "34997",
   "Male",
   "",
   "Not Given",
   "Jul 9, 2004",
   "14369",
   " "
  ]
 ],
 "report": "<p>This was definitely my worst hangover, and the longest one too. On June 10th, together with a couple of friends, we took Ecstasy (probably contaminated by some strong psychoactive, of which we were unaware). The trip was different, much weaker than normal, and had one bonus: after 6 hours, when the effects were wearing off, we smoked some pot and then... puff, something new happened, extremely strong feeling of disorientation, inability to focus on own thoughts, close to losing consciousnes, slightly similar to strong LSD trip. It never happened before, although we mixed E with MJ pretty often. This lasted for about 4 hours, until we went to sleep. Now, the worst part begins. The day after, when we woke up, the effects were still there... Weaker, but noticable - short term memory loss (even when talking to each other, we weren't able to focus on sentences spoken, because at the end of the sentence the beginning was already forgotten), mild depression, slight diziness and complete inability to focus on anything. Our minds, our thoughts were like shining confetti, flashing with many lights, but not creating any coherent image. Well, the day after always is unpleasant, but when we woke up the next day - the effects weren't gone at all... And the same in the following week. We got seriously concerned about it and considered medical help, afraid of some brain damage that could have occured to us. The inability to focus on anything, from shopping (we used to go to a shop five times in a row, being able to memorize only one thing to buy at a time) to working (some of us are writers and journalists, and we couldn't put a sentence together, let alone a paragraph). Even preparing a dinner became a problem, because we often went to kitchen and.. forgot what we were there for, or did something else (like coffee instead of chili con carne). A week passed, then another... and the inability to focus on anything, and forgetting things became a serious threat to our professional lives, as well as daily activities: it is not a pleasant feeling, when one drives a car and suddenly becomes wondering where he is actually heading. Finally, at D+20, our minds started to clear, but it was a very slow process, disorientation and amnesia still happened to us, but it wasn't a constant state of mind at least, only short flashes. Only now, at D+27 i can say i returned to normal, but the flashes still happen from time to time: i catch myself sitting with a completely blank mind staring at the wall, or reading a book without understanding a word. Fortunately, this is so infrequent that it does not concern me too much. Still, i don't think i will take a pill soon, if ever. A month of hangover is much too much for a few hours of euphoria. I think the drug was contaminated. I must add that we weren't heavy users; actually, we used Ecstasy like once in a month for less than half a year, never exceeding two pills (three for those heavyweighted). And we suffered only mild hangovers, lasting 2-4 days. Until this nasty one...</p>"
}
