{
 "title": "Part of My Life Forever",
 "author": "AmyBlue",
 "citation": " AmyBlue. \"Part of My Life Forever: experience with Methamphetamine (ID 350)\". Erowid.org. Aug 19, 2001. erowid.org/exp/350",
 "substance": "Methamphetamine",
 "bodyweight": "115 lb",
 "report": "<p>It all started when I was 14. My friend came over to my house one day, tweeking, and she had some with her, I had never done it before, but I really wanted to try it. She carved out a tiny little line for me, and I snorted it quickly. I can't quite describe the feeling, all I can say is, no other drug that I've ever done has kicked in that quickly. It's a euphoric rush that went through my entire body, making me feel exhilarated, happy, and hyper too, of course.</p><p>To be honest I can't remember much of that whole day, or night, but I know we just kept doing more, and before I knew it, I was hooked. For a year and a half of my life I was completely and utterly under its spell, I was going through half an 8 ball a day. And then one day, my then current boyfriend (whom I had been dating for about a year and who was also a tweeker) turned to crack, then heroin, and slowly turned into a completely different person. The same thing happened with all my friends, the drugs slowly devoured the people I once knew, and turned them into mean, uncaring drug addicts, and it all started with meth (at least in my circle of friends) So, I decided to quit.</p><p>Honestly, it wasn't that hard, well...for the first month or two. I still wanted it, but I left the people who still did it, and found new people who didn't. It's been almost 2 years now, but last week I fucked up, and I did some. I only did about a dime, but that was enough. I don't regret that I did it, because I think of what I went through, and to go through that when you're only 14-15 is hard enough, but when you're turning 18 soon, and you're starting your own life, you don't want that shit holding you back. It really isn't worth it at all, I can honestly say, 'no, I don't want to do it', but deep down inside, I really do. And that feeling will probably always be there. I will try my damndest never to do it again, because it is a horrible, EXTREMELY addictive drug for me.</p><p>I would say, if you ever have the chance to do it, DON'T! It will fuck you up for the rest of you life. I'm at a point right now, where I'm almost positive I will never do it again, but I will always want to, and that's almost as bad.</p>",
 "year": "2000",
 "id": "350",
 "gender": "Female",
 "timestamp": "2001-08-19T07:00:00.000Z",
 "views": "17514",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ]
}
