{
 "title": "A Wonderful Evening",
 "author": "Ben",
 "citation": " Ben. \"A Wonderful Evening: experience with  Zolpidem (Ambien) (ID 35008)\". Erowid.org. Mar 29, 2006. erowid.org/exp/35008",
 "substance": " Zolpidem (Ambien)",
 "bodyweight": "175 lb",
 "report": [
  "<p>One of my friends had a sleeping disorder and received a prescription to ambien. She would tell me of the wonderful experiences that she had on it so I decided to take 2 5mg tablets one evening not expecting very much, after all it was just a sleeping pill. At around midnight I took both of the pills and just chilled smoking a cigarette with my buddy chris, who was taking some oxycodone that night.",
  "About 15 minutes later while I was on the couch talking with my girlfriend on the phone the effects began to kick in. A rush of cold went through my body along with a feeling of euphoria. What my girlfriend was saying just went in one ear and out the other and I told her that 'some crazy shit is goin on in my head and I have to let you go'. Soon after that patterns began to appear on the walls of his den. I really wanted to get up and see if my motor skills were impaired, but for the most part I could walk straight. After that most of my memories are kinda foggy, but it was like I was dreaming, yet awake. I had double vision for 30 min or so, but it was not annnoying, but very amusing. I went outside of chris's house and he was outside fooling with a ladder against his wall so I decided I would try to climb it. The whole time I was telling him to stop swaying it and he kept telling me that he wasnt touching it because he was like 10 feet away. We then went back inside to watch some T.V. by then my motor skills were very impaired making it hard to walk in any normal manner. I was feeling his wall insisting that there was a trap door somewhere in it and all we had to do was press the right panel.",
  "Soon after that I laid down and fell asleep on the floor. The experience lasted about four hours, and I loved every minute of it. It is a very powerful substance.</p>"
 ],
 "year": "2004",
 "id": "35008",
 "gender": "Male",
 "views": "17596",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "submissionDate": "2006-03-29T08:00:00.000Z"
}
