{
 "title": "A Little Bit of Everything",
 "author": "Josh Singh",
 "citation": " Josh Singh. \"A Little Bit of Everything: experience with Oxycodone & Cannabis (ID 35023)\". Erowid.org. Jul 11, 2007. erowid.org/exp/35023",
 "substance": "Oxycodone & Cannabis",
 "bodyweight": "110 lb",
 "report": "<p>Oxycontin (Oxycodone) Experience Report</p><p>Thu 7/8/04</p><p>Cannabis joint smoked about 7pm</p><p>10 mg Oxycontin crushed about 8 pm</p><p>Ive done many psychoactives, and wanted to report on some.  So I finally got the initiative to write something honest and conclusive about such an amazing drug, from a responsible, rational point of view (Im very into these personal ethics).</p><p>On Thursday, July 8th I contacted my pot connection and some of the best bud in town.  I rolled a joint, took a shower, and marveled at my last Oxycontin tablet.  To my outstanding joy, it was the stronger 20 mg pill that I was occasionally treated to by my Oxycontin contact.  I usually crush up the average 10 mg pill that I get and it produces an amazing experience.  But this was 20 mg, so I cut it in half, which was very hard due to the small size of the pill and the coating.  I went out at about 7 pm and smoked most of the joint, keeping about a quarter of the end.  I then ingested the 10 mg of crushed Oxycontin at about 8 pm, reveling in its effects until about 11:30 pm.  At about 12:30 I smoked the remainder of the joint, bringing back some of the effects of the Oxycontin.  At about 2:20 am, I wrote the following, needing to remember the magic of the day.</p><p>Oxycodone is an amazing drug.  Maybe my favorite.  It can be so dopey or not.  I can have friendliness and humanitarian-like feelings comparable if not surpassing that of MDMA.  I can have full body warmth and tingle and happiness.  I felt like I was floating on water when I lie down on my bed.  I then could feel like I was floating in space (on the universe).  I can control mental states from MDMA like circumstances or to the philosophical properties of mushrooms.  I feel like because I can control my mood, in a shroomy way, I can control my destiny.</p><p>Project a location onto my head and live it, feel it, by happiness and meditation.  There is no such thing as a bad trip.  Ive never had a bad experience.  It is true that both bad location and mental state can diminish the pleasure of a situation, it is never enough to horrify, hurt, or harm me.  For me, lying on my bed on my back with my legs hanging off the bed and also alone, free from no distractions (take off TV and computer) and free from negativity or otherwise unfavorable interference, is the best setting.</p><p>That was an awesome day!  I also recount four or five leg muscle spasms, although they didnt hurt at all, but its important to note.  Oxycontin is an amazing drug, and it is so variable.  One experience is never the same for me.  Definitely worth it.</p>",
 "year": "2004",
 "id": "35023",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-11T07:00:00.000Z",
 "views": "14992",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": "",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
