{
 "title": "Festival Experience of an Invisible Crowd",
 "author": "Mushroom",
 "citation": " Mushroom. \"Festival Experience of an Invisible Crowd: experience with Mushrooms - P. cubensis & Cannabis (ID 35042)\". Erowid.org. Dec 14, 2007. erowid.org/exp/35042",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "13 kg",
 "report": "<p>The setting was a large festival in England June 2004, mushrooms are openly on sale there so I bought 15 g of fresh Thai cubensis. About a year earlier I had grown a lot of cubensis and one night did a very large dose of fried mushrooms, probably about 10 grams of dried mushrooms. During the experience, most of which I still cant remember, I 'saw' my life/self explained in the world around me in a way that was staggering, it was truth. I tell you this because this latest trip builds on that experience.</p><p>At the festival I had taken the fresh mushrooms and wandered off to see a band. As I sat awaiting the performance to start I smoked some bud in a pipe and by the time the band came on I was grinning like a loon and really getting into the music. Then all of a sudden I found myself wandering amongst the crowds shuffling between the various acts and market places, no memory of getting there. I wasnt sure if I was awake or dreaming and was treating it like a lucid dream, but somehow knowing that it wasnt. I began to play with the dream, and as I wandered about I found that I could manipulate it and make anything I wanted to happen, happen.</p><p>Then I noticed that in the direction I was going that it was getting much nastier looking and the thick stormy clouds lay ahead. I continued and had visions of accidents, medics stabbings, and general chaos. I also noticed a distinct unrest from a large group of people (or beings) that were watching my exploits. I could not see these beings, but was intimately connected with them and like I said sensed there unease about the current path I was on. I then realised that it was up to me which direction I went and when I did this I got a few helpful cheers and claps from the unseen crowd.</p><p>As I turned around the sky was clear and the moon hung brilliantly in the sky, the crowd cheered. I turned again to the stormy sky, the crowd began to boo and become restless again. I turned this way and that and as I did so I 'saw' my life layed out before me, then endless possiblities, and I walked them. I explored them all, listening to my heart as I went, eliminating all the crap until I finally saw what I wanted out of it, as I did so the crowd roared and cheered and clapped and I began to tread that path and the sky cleared up and I was on my way home, I knew what was important to me and what I must do to make it be.</p><p>The festival site is huge and I covered most of it that night, but the great thing was I knew I was on my way home (to my tent) during the last leg of the trip. I found myself standing looking at some hills in the distance. The visuals where very minimal during both this and the last trip I had. Having just thought about the guys I went with, whom I had left before I took the mushrooms, when I turned around and they popped out of the endless crowds where pleased to see me and took me back to the camp which was only 50 yards away.</p>",
 "year": "2004",
 "id": "35042",
 "timestamp": "2007-12-14T08:00:00.000Z",
 "views": "2676",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(fresh)"
  }
 }
}
