{
 "title": "Those People Created Triangles...",
 "author": "j.hen",
 "citation": " j.hen. \"Those People Created Triangles...: experience with Salvia divinorum (21x extract) (ID 35059)\". Erowid.org. Aug 30, 2004. erowid.org/exp/35059",
 "substance": "Salvia divinorum (21x extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "report": "<p>First hit. Quiet porch. Jazz music in background. Salvia in my forward direction. Light the torch. Watching orange glow; inhale my friend. Steady, strong inhale. Ah, clear that bottle. Grasp, savor the taste (smoked lungs like a tasty trance.) Lay back now. Exhale. Mmmm. Is this now a cave? The body is forced. All muscles to the left please. Face of stone; weight of the moon. Begin the laughter now. Coming back. Ah, relaxation.</p><p>Second hit. Same porch. Same jazz. Same Salvia. Light. Orange. In/Exhale now. No motions. Plants begin their own journey. Are you dancing? Leaves begin to inhale, exhale. Musical beats. Heart beats. Plant beats to all. Own self now dancing too. Smile. Ah, come back.</p><p>Last hit. House construction site. Silence the crickets. This is the one sir. Light. Inhale? Yes. Exhale. No, I am not here anymore. Blackness aroused. Warmth shot. Are they closed? Able to see? Doesn't matter. They're open now. Three. Three. Three. Three of them. Hands, feet together. Multiples; in a wooven cotten sheet. Millions. Triangles. A life span together; creating, destroying, lying, deceiving, cheating. Spinning. Trying to get out. Damnit. Force from the right burdens the left. Try again. No. Wait. This is the trip. Asking fellow infront, 'Are you in this dimension?' Quick laughter from outside. Beginning to retreat home. Closing eyes brings them back; stay open. Let's go. Fast walk. 10? 15? 20 steps? What is this 'reality'? What is this? No. This is it. We're back. Bit of panic. Gone. Calm. Fun is over. Goodnight.</p>",
 "year": "2004",
 "id": "35059",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-30T07:00:00.000Z",
 "views": "8498"
}
