{
 "title": "Subtle Feelings of Euphoria",
 "author": "Cid",
 "citation": " Cid. \"Subtle Feelings of Euphoria: experience with Red Rock Opium & Cannabis (ID 3506)\". Erowid.org. Oct 27, 2000. erowid.org/exp/3506",
 "substance": "Red Rock Opium & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "0.3 g",
  "smoked",
  "Red Rock",
  "(powder / crystals)"
 ],
 "report": "<p>Note: It is important to know that material sold as 'Red Rock Opium' is NOT opium.  It is generally Dragon's Blood Incense sold at an incredible markup.  See The Red Rock Opium Myth for more information.</p><p>Recently a friend and i had come across some Red Rock opium in our area.  Since Red Rock is a red powder, my initial reaction was that of apprehension.  Being crushed up into a powder, the pure opium could easily be cut with another substance, where as if it were to still be in its dried paste form, impurities due to cutting would be very unlikely.  However, i had noticed no adverse or toxic reactions in anyone who had started smoking it, so my apprehension had quickly dissipated.</p><p>Another problem was the method of ingestion--the people i was with INSISTED on sprinkling the opium upon some buds and hitting it with a direct flame.  Why these morons wouldn't pack the powder in my glass pipe i will never know.  None the less, it was still free, so i didn't oppose too much.</p><p>2 grams were smoked in all that evening between everyone.  I had about 4 or 5 hits of the opium/marijuana mix.  The opium high was subtle, but definitely there.  A positive mood lift was one of the most defining factors of the experience--it was entirely too strong and forcing to be attributed to the marijuana.  The only other affects that could be attributed fully and only to the opium was a noticable, yet subtle, feeling of euphoria.  It was quite different from a marijuana euphoria--it kicked in about 20 minutes after ingestion and plateaued for about 2 hours.  The opium also gave me a feeling that seemed familar to me when on opioids--my interest in anything and everything but myself and my friend had started to dwindle, seemingly replaced with a warm feeling all about me and in me.  However, not enough of the substance was ingested to feel any pin point numbness.  Other affects I noticed were intoxication (giddyness, a light headed feeling, mental cloudiness) and poor short term memory.  Both of which could be credited to either the ganj, opium, or a mixture of both.</p><p>The conclusion i made was that my opium experience was fun, but perhaps not enough was ingested.  I plan to buy a few more grams in the future and further experiment with this substance.</p>",
 "year": "2000",
 "id": "3506",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-27T07:00:00.000Z",
 "views": "45923",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.3 g",
   "administration": "smoked",
   "substance": "Red Rock",
   "form": "(powder / crystals)"
  }
 }
}
