{
 "title": "Hyperspace is Problematic",
 "author": "EG",
 "citation": " EG. \"Hyperspace is Problematic: experience with Mushrooms - P. cubensis & Alcohol (ID 35082)\". Erowid.org. Aug 23, 2007. erowid.org/exp/35082",
 "substance": "Mushrooms - P. cubensis & Alcohol",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "",
   "3 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "report": "<p>This is a cautionary tale of surprise.</p><p>Myself and some longtime acquaintances had gathered together in my gf's basement (a 'safe party zone') for an experience with mushrooms. We had all experienced LSD and mushrooms in college, to varying degrees. At this point we had all been out of college for 5-7 years, and most of us hadn't done anything more psychedelic than cannabis in that time. I myself had not tripped since 1995. I had never gotten much from mushrooms, though I had plenty of fun with my several LSD experiences, including a few 'mescaline microdot' adventures. I never went for major mind-melting doses, and usually felt, at peak, that 'I should have done more.' The couple of times that the LSD was much stronger than predicted, I had done just fine. There was no reason to expect an adverse reaction.</p><p>Mushrooms, as a natural product, can vary in potency greatly. After years of hearing that 'you need at least an eighth (3.5g), but a quarter (7g) is better,' we all figured that a nice mellow time for the five of us could be had with the half-ounce bag of mushrooms J had acquired for us. These had that evil aspect to them; much of the fungal matter was darkened by a moldy-looking purplish coloring, that upon inspection was part of the 'shroom. I personally had never seen such crazy-looking shrooms. We opened beers and began our 'snack,' dividing the bag equally.</p><p>I hate the taste of these things, so I began using the pill-popping method of squashing the stuff into small blobs and washing them down with beer. I think this was my error. I went trhough three beers this way, and still ate a bit slower than the others. Thirty minutes go by and folks are getting giggly. I have that 'way stoned' feeling, but nothing much else. My standard ''shrooms as pot squared' sort of disappointing experience. I prefer acid.</p><p>We all sit down to watch 'Yellow Submarine.' It's cool. Way cool. VERY yellow. I got outside for a cigarette and the trees in the backyard fade in and out of the mist. Everyone is tripping hard, but I'm just kinda trippy, like half a dose of acid. Nothing much. I unsuccessfully try to get my bump-on-log companions to go for a walk. They're having a gigglefest and saying 'I can't beleive how hard I'm tripping!' I'm still barely tripping.</p><p>We watch 'Willie Wonka and the Chocolate Factory.' The sinister undercurrents of that film are plainer to me than usual. It's great, a sick, twisted, homicidal nightmare dressed up as a wholesome children's movie. The coming remake can't possibly measure up to the orignal. Anyway, all goes smooth through the film. The others are slowly coming down from their peak. I'm very nearly baseline-straight. I say, 'I'll probably head out in a few minutes.' I head for the bathroom to urinate.</p><p>I enter the bathroom, and look at my image in the mirror. I briefly recall how LSD used to give me pimples. In the mirror, I see my face, horribly pasty white, every pore a large blackhead, a nasty acne mess bound to end in disfigurement and misery. I mumble, 'Shit, I just destroyed my complexion.' I recall that I am still sort of on mushrooms. I feel a rush akin to a panic attack begin. I mumble, 'I'm gonna deal with this tomorrow.' I turn to the toilet and begin to urinate.</p><p>The force of gravity suddenly increased. I began sinking into the floor as I pissed. I said, 'Oh, shit.' I zipped up, pulled my legs out of the floor and staggered out the door back into the room were we were all hanging out. Walking like a drunken robot, suddenly in the grip of the strongest body load of any type I've ever felt, I announced, Christopher Walken-like. 'I'm freaking out-- I'm, freaking out.' I turned my head to the right and leaped into hyperspace.</p><p>Hyperspace was dark and empty, a cool, quiet void I was floating in, waving my arms and legs as a means of locomotion. My mission: Keep moving. Vague forces tried to impede my arms and legs, but they were like eddies in a pool of corn syrup. I felt their tugging, but broke free of them with little effort. I had to keep moving.</p><p>Suddenly all is bright, and what I see is vaguely like the room I had recently left, if it were spinning. Voices cried, 'Sit down! Sit down!' My vision swam as if I had drank a fifth of vodka. I sort of saw a chair before me. 'Sit down!' cried the voices. 'That's a good idea,' I said. I had heartburn. I sat down. I asked for a Tums. Someone brought me a bucket instead. 'Hey, that's not a Tums,' I said. I looked at the bucket, behind me and to my left, about two feet away. Then I effortlessy projectile-vomited into it, before I realized what I was doing. Every vomitous molecule landed in the bucket. My friends were suitably impressed.</p><p>I was now nicely high and coming off of a peak, so it felt. The rest of the night was uneventful. My friends informed me of what happened while I was in hyperspace and my body was at my gf's house:</p><p>I turned my head to the left and leaped towards a plate-glass sliding door. J, thinking quickly, leaped at me to intercept. He tackled me to the floor. I flailed and got up, ran again toward the glass door, bounced off of it, and proceeded to get tangled in the vertical blinds. I battled the blinds for a moment, and J and others dragged me away from the door and the blinds. I staggered out of their grip, I saw the chair, announced 'That's a good idea,' and sat down.</p><p>I easily could have been slashed to ribbons had I gone through the door. I was going full speed when J tackled me. I was entirely uninjured by the experience. I scared everyone else. And, worse, I never had any visuals (my brain resists hallucination strongly--I barely get tracers when most people are seeing all sort of stuff--but when it gives in, BOY does it give in).</p><p>I had never had a trip remotely like that. I suspect that the way I 'ate' the shrooms prevent them from being properly digested for hours, until all of a sudden the entire dose of what were, by consensus, strong-ass shrooms hit me all at once, fast and furious, and left nearly as quickly, but only after wrenching me suddenly and utterly unexpectedly out of my body and into a whole other dimension. And it happened at the 'end of my comedown' from what had been the weakest of trips.</p><p>Everyone was surprised; I've never heard of anyone having such an experience with shrooms. Even knowing as I did that 'shrooms/tryptamines have a natural up-down-up-down action, I never expected my trip to progress in a blah-blah-blah-cool-blah-lame-weak-SUPERMOTHERFUCKINGSTRONG-cool-weak-blah sort of pattern.</p><p>I don't care how experienced and cocky you are, always have respect for psychedelics, and know that they can take control at any time. I don't do them anymore.</p>",
 "year": "2002",
 "id": "35082",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-23T07:00:00.000Z",
 "views": "2765",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ]
}
