{
 "title": "Residential Neighborhood or Rock Concert?",
 "author": "Bobby Van Zimmerman",
 "citation": " Bobby Van Zimmerman. \"Residential Neighborhood or Rock Concert?: experience with LSD (ID 35108)\". Erowid.org. Jun 9, 2007. erowid.org/exp/35108",
 "substance": "LSD",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(gel tab)"
  ]
 ],
 "report": "<p>After Tripping a handful of times on Mushrooms, I had become increasingly curious as to what exactly an LSD trip was like, and when I stumbled across some potent gel caps through a friend of a friend, I almost had no choice but to buy them. The night after buying them, I got off of work and headed directly to my buddy Bonzi's house. We had tripped off of shrooms together many times prior, and had near identical experiences each time, so we both knew our levels of tolerance were virtually the same. We didnt end up dropping the cid until 9:15 PM. We sat in his gazebo for a good half-hour, waiting for his 'rents to go to sleep and for the trip to kick in.</p><p>By 10, we found ourselves slightly giggly and abnormally amused by sources of light (lighters, cell phones, street lamps), but nothing too intense. We headed inside to watch the idiot box. It is at this moment that we realize the futility of watching TV in a plain, unadorned room while tripping, and we both declare ourselves nearly stone-cold sober 2 hours into it. After 2-and-a-half, we declare the LSD bunk as hell. Both of us are dry on herbs, and after unsucessfully trying to mooch off of friends, we resort to the ultimate act of stoner desperation; we grab the dirtiest piece we can find and head out for a bowl cruise of straight res hits.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>By the time we're on our way it's Midnight. As I torch the living hell out of Bonzi's bowl for the third time, it becomes apparent that I am very unsober indeed, and I'm not just buzzing off of the very familiar THC coursing through my veins. The world outside of Bonzi's truck becomes growingly multi-dimesnional, and Disc 2 of the Gratfeul Dead's 'Without A Net', an album which I've listened to hundreds of times, gains a new potency. We crank the music up, melt into the instrumental interplay, and finally become aware of the magic of LSD. Next comes the night's biggest lapse of judgement.</p><p>On our way back to Bonzi's we notice a jeep is keeping perfect pace with us the entire time. When we glance back we notice it's two pretty-damn-cute girls. We slow down a notch, and they acellerate in front of us. When we notice the phish stickers on the back of their ride, we safely assume they're stoners like us, so we catch up. Before we know it, we're in the next town, and just as fast we're in the next county, only a few good miles out from getting into bumblefuck nowhere territory at the pace we're going. We find ourselves confused over whether it's us keeping pace with them or them keeping up with us. By the time we think of something cheesy to say, they veer off, and we it dawns on us that we have just followed two girls we didn't even know into the next county without even realizing it, and we conclude that we are in fact tripping.</p><p>We start to peak by the time we get back to Bonzi's. We're now listening to Disc 2 of Melon Collie and The Infinite Sadness by the Smashing Pumpkins in his driveway. I notice that when I stare at my reflection in the rearview mirror, The outside world begins to gradually dim, and then get increasingly lighter, just like when the clouds momentarily block the sun during the daytime, only it's about 1 in the morning now. I stare at the trees, and the tiny gaps between leaves and braches form faces, some of which turn blue and begin to fly away. The treelines in the distance begin to radiate a bright gold light, and the horizon slowly changes colors in a manner that seems almost completely natural. I look down at my knees, and an odd pattern of light, almost like real-life pixellation, follows as I slowly move my head.</p><p>Feeling almost confined, we decide to take a walk around Bonzi's extremely suburban, American-dream, upper-middle class neighborhood. We both decide that we could just as easily be roaming the Amazon rainforest, the Hidalayan mountains, or the surface of Jupiter. We find ourselves enamored with things as ordinary as bug zappers and streetlights. I get a sudden urge to learn the formula for LSD, and hand it out door to door. This is the peak of the trip, and therefore the most memorable moment.</p><p>We watch the twisted anti-meth film 'Spun', which officially becomes the most hilarious movie-watching experience of my life, and it isn't a comedy. We smoke some more res hits as the sun rises, and the daylight adds a completely new element to the trip, which is now beginning to lessen. We take a morning drive, and find ourselves captivated by a large family of geese, camped by a pond. Even as I become sober, I have an increased awareness and appreciation of every precious breathe I take, and every thing around me, good or bad, trivial or significant, beautiful or ugly. LSD, unlike so many other drugs, is not a social lubricant, or even a way to escape harsh realities. It's a full-blown confrontation of those realities, only with a brand-new, previously hidden light casted onto them.</p>",
 "year": "2004",
 "id": "35108",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-09T07:00:00.000Z",
 "views": "3513"
}
