{
 "title": "Zoom Travel on an Unfamiliar Planet",
 "author": "DICK Publius",
 "citation": " DICK Publius. \"Zoom Travel on an Unfamiliar Planet: experience with 2C-E (ID 35150)\". Erowid.org. Jul 14, 2004. erowid.org/exp/35150",
 "substance": "2C-E",
 "bodyweight": "115 lb",
 "header": [
  "DOSE: T+ 0:00",
  "6.0 mg",
  "oral",
  "2C-E",
  " T+ 0:20",
  "6.0 mg",
  "oral",
  "2C-E",
  "",
  " ",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>Zoom Travel on an Unfamiliar Planet</p><p>July 13, 2004</p><p>Drug: 2C-E</p><p>Dosage: 12mg, oral ingestion\t</p><p>Ive never written my own experiences down anywhere. But since Ive been lucky enough to have the opportunity of trying 2C-E I feel obliged to do so.</p><p>\tAs far as time is concerned, I remember ingesting 12mg around 8:45pm or so. I actually took about 6mg at that point, and another 6mg probably about 20 minutes later.  I was with a close friend and we had been preparing for such an occasion. We ended up going to a friends apartment where the atmosphere was to be calm and controllable.</p><p>\tAfter about 45 minutes, the feeling I was getting was extremely questionable. The nausea was certainly present. I smoked a little bit off of a blunt that was being passed around, and that seemed to have calmed my nerves for the time being. The marijuana seemed to have brought on the 2C-E rather quickly. Very suddenly my vision was becoming distorted, and I could feel my body load increasing.</p><p>\tThe beginning of my visual journey included heavy tracers of things that didnt even seem to be there. Just looking around the room I would see small rainbow streaks as if left behind by a small bug or a dust particle. These streaks were everywhere, and they were shooting across the room. At this point I was already amazed, and knowing the drug still had much potential, I mentally prepared for the worst.</p><p>\tThe environment I was in was still very controlled and tolerable. My good friend and three other comfortable companions include all that was present. I felt comfortable knowing that as the drug inevitable got more intense, I would still be in a safe place.  The trip was most definitely in its vision stage. I had read beforehand that 2C-E hits with strong hallucinations for the first half, and the second half is the more reflective, intuitive half of the trip. This is definitely how my night ended up working out.</p><p>\tOnce the drug had brought me to a stage I had never been before, I felt it was necessary to get out of the apartment and see how much things have really changed. My good friend and me walked down to this park that is behind the apartments which sits on the lake. This turned out to be a great idea. The setting was perfect. It felt like I was walking on a planet I had never been before. The setting is in Texas, where it is mainly plains with a few forested areas here and there. But to me, on this particular night, this park seemed like a rain forest to me. Trees were droopier than I had ever imagined. It seemed as if everything I was looking at was trying so hard to say something to me, but it just couldnt get it out in words. The grass looked like a gigantic rug that was attached to a conveyor belt. At this point, my good friend asked me about the things I was seeing. I was thinking of a way to explain to him my visuals with hand motions. At this time, I realized that when I twisted my hand, it actually twisted that part of vision. It was as if I could mold and smear anything I wanted to, just by twisting it the right way with my hand. I knew at this point that I was at the peak of my visual trip. We walked around and talked a little more, before heading back into the apartment.</p><p>Once we got back, we saw that many more people had arrived. Suddenly the whole environment changed. I knew everyone that had showed up, but I also knew that they would not understand the state of mind I was in. When they hear tripping, they want to get up in my face and try to make me freak out. Its not that I cant handle such a situation, but having to deal with such nave behavior is very annoying. The people that had showed up had also brought a whole lot of zanbar. I started getting paranoid because of the large amount of drugs present in the apartment, and also because of the fact of the people who were handling them. The majority of them were drunk and on bars themselves, so our minds were on the opposite sides of the spectrum. Here I am, with my mind blown and thought process logistically wired, faced with the problem of having to reason with barred out drunken nobodies. The situation was frustrating, and I was in a mind block because I felt like I couldnt act how I wanted to without someone questioning my behavior.</p><p>\tFrustrated, my friend and me went back outside to the lake. There was a dock that led out to the water, and we eagerly ventured to this point. The setting became almost eerie to me and I was paranoid that something was going to jump out of the water suddenly and harm me. This feeling quickly subsided with a little reasoning, however. We plopped down on the dock and looked at the stars. WOW! I had never seen a more clear night it seemed, or a more breathtaking sky. All the stars never ceased to move, and it was as if someone had been playing connect-the-dots with them. There was one particularly bright star that caught both of ours attention. We were trying to figure out what we were looking at, when my friend suggested, Why dont we just zoom into it. I thought this was a great idea! I focused as hard as I could on this star, and it almost seemed as if I was getting lifted off the ground and taken into the cosmos. To me it looked like the planet Saturn, and I could almost envision the rings around the giant gas planet. After about 30 minutes of stargazing, we went back to the apartment to gather our things and say our goodbyes.</p><p>\tWhen we got back, the drunkards were even more drunk and barred out. The scene was really hostile. There was a lot of trash talking and angry faces. This one character was exasperated with my friend and told him to look at his pinky knuckles. He was trying to show us that he had punched something, some kind of gesture to show us how serious he was? And then he said,  Yea, thats right, I punched someone in the jaw, thats what happens when Im fucked up.(Very shitty)</p><p>\tObviously at this point we left. My friend had to be home, and I figured I would head home myself. I drove my friend home and then proceeded to take myself home. At this point, I thought that my visuals were dying down, and that I would go to my room to start the reflective stage. But once I got into my bathroom to take out my contacts, brush my teeth, etc., I found that my visuals had definitely not gone away. I stepped back to stare at myself in the mirror, and it looked to me as if I was a wooden boy standing in my bathroom. This was all very funny to me, and I couldnt help but laugh at myself. Comparing myself to the wood grain cabinets that were behind me, I found that it was as if I was a chameleon, there was no difference between the texture of my skin, and that of the wood grain.</p><p>\tKnowing I still had pretty good visuals, I was eager to get back to my room and play some games on my computer. As fun as it was, I wasnt doing to well due to the fact that I was seeing things that werent actually happening. Its a lot easier to have pop-up visuals while playing a video game than in the real world. Finally I decided I wanted to just lie in my bed and let my mind take me somewhere. Closing my eyes I felt like I was in a sea of patterns, flying through all of them at extremely high speeds and leaving energy waves in my wake as I sailed through this amazing mindscape. I journeyed through my mind a long time it seems. One thing I remember vividly is being in a place where I had a sort of tour guide that was dressed like a super hero. He would say things to me very stoutly, but I would never hear any words, and then he would grab my hand and we would fly off into the clouds.</p><p>\tIt was after this journey through my mind that my mental trip began to come into effect. Throughout this portion however, I was not alone with my thoughts. It seems as though right when it began, a friend from college called me to catch up on old times. I was on the phone with him for about an hour and half, mainly just bullshitting it seems, but he could tell by the way I was talking that I was tripping, so I would imagine I was saying some bizarre things.</p><p>\tAfter this phone call was over, I sat with my eyes closed, while I reflected on the night. I came to the conclusion that my experience at its peak was borderline ++/+++ experience. The visuals were very intense, although I never had the feeling I was losing touch with reality, or unable to control myself if a pressure situation was to come into play. This is definitely not a party drug under any circumstance. I wish my experience environment could have been even more controlled than it was, so any unpredictability while on this drug would more than likely have very negative effects.</p><p>\tAll in all, I very much enjoyed my trip. It was without a doubt the hardest I had ever tripped, and therefore the most mind-boggling. As I write this report, it is now T+17 hours after I took my dose, and I can still feel the drug tingling my limbs and massaging my mind. The come down was not at all unfavorable, other than the fact I got to bed at 5am, only to wake up at 8am for my summer school class. However, Im sure that most would have no problem sacrificing a day of class.</p>",
 "year": "2004",
 "id": "35150",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-14T07:00:00.000Z",
 "views": "7927",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "2C-E"
  },
  "1": {
   "time": " T+ 0:20",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "2C-E"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
