{
 "title": "Warm Waves",
 "author": "Goofy",
 "citation": " Goofy. \"Warm Waves: experience with 2C-C (ID 35174)\". Erowid.org. Jul 15, 2004. erowid.org/exp/35174",
 "substance": "2C-C",
 "bodyweight": "96 kg",
 "report": "<p>Curiosity about 2C-C being a gentle introduction to the phenethylamine class of drugs led to me choosing it as a suitable drug to take with a friend of mine with no psychedelic experience. He, known as T, is much smaller than me, weighing about 60 or so kgs.</p><p>After he arrived at my appartment I explained everything I knew about the substance we were going to be trying. T is Japanese so it took some slow explaining, but he seemed happy with my explanation.</p><p>Previously we have taken dxm together and he has enjoyed it very much, though takes a much smaller dose than me.</p><p>With the 2C-C, I divided 100mg into 2 roughly equal piles and poured it into 2 shot glasses full of water. We mixed it up and I downed mine, T drank half of his at first, but after 45 minutes or so he decided to take the rest.</p><p>After about half an hour we began to feel more chatty and noticed a marked mood lift. After an intense period of conversation, this feeling subsided and we both felt baseline again. About 10 minutes or so later, the waves of happiness returned and our conversation became animated once again.</p><p>This process of waves of mild euphoria coming and going continued for the whole length of the trip and was the only interesting feature. Neither of us experienced any visual effects, though T reported being distracted by things in the corner of his vision at times.</p><p>In conclusion, it's not very exciting, but has no negative effects, even at a 50mg dose. the waves of mild euphoria made for an interesting evening and a sense of having made the right choice of drug, though neither of use are particularly interested in taking it again.</p><p>ps. I am on 10mg of olanzapine daily. T is not on any medication</p>",
 "year": "2004",
 "id": "35174",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-15T07:00:00.000Z",
 "views": "11835",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "2C-C"
  }
 }
}
