{
 "title": "Nights of Trials",
 "author": "Vegas",
 "citation": " Vegas. \"Nights of Trials: experience with Valerian, B-6 & Melatonin (ID 352)\". Erowid.org. Mar 3, 2001. erowid.org/exp/352",
 "substance": "Valerian, B-6 & Melatonin",
 "bodyweight": "",
 "report": "<p>*All doses taken 1/2 hour prior to sleep on empty stomach</p><p>Night 1: 500mg Valerian root, 50mg B-6, 6mg melatonin</p><p>Nice dreams, situations in dreams were quick to change as I couldn't stay focused in one dream or another for very long.</p><p>Night 2: 500mg Valerian root, 1g B-6, 6mg melatonin</p><p>The increased B-6 helped to realize I was in a dream, but outside influences (namely my baby sister) kept me up and awake most the night.</p><p>Night 3: 2g Valerian root, 1.5g B-6, 6mg melatonin</p><p>By far the best experience yet, I actually dreamed I was up and walking around my house getting ready for the day when I got into my car I heard a ringing noise, looked to my left and then realized I was starring at bed side table with my alarm clock ringing loudly. The dream was very real and accurate. The best part was realizing everything I had just seen was just a dream and not reality. I heard my foot steps, I saw and heard the tv on, I heard outside noises, everything was in it's place like normal, and it seemed too real until I woke up and then jumped for joy realizing I was just dreaming.</p><p>I will continue large amounts of all Valerian root, B-6, and melatonin to see what happens. I want to get to that reality point in my dream again and see what I can control or manipulate. I also want to see how many of my senses I can affect at once. I will keep you all informed.</p>",
 "year": "2000",
 "id": "352",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-03-03T08:00:00.000Z",
 "views": "23632",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Valerian"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Vitamin B-6"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Melatonin"
  }
 }
}
