{
 "title": "Dreamy",
 "author": "Anonymous",
 "citation": " Anonymous. \"Dreamy: experience with Cannabis (ID 35234)\". Erowid.org. Aug 9, 2007. erowid.org/exp/35234",
 "substance": "Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I am one of those people who definitely has 'his head on straight.' I get good grades in school, I have many friends, and I really do enjoy my life. I am not planning on trying any other kinds of drugs in the future, but who knows. Entering my junior year in high school, I had only smoked two cigarettes and drank alcohol but never been intoxicated. I had smoked marijuana several times in the past and never particularly enjoyed it. I had been high but never quite understood what was so great about it. In fact, I still don't. However, I am trying to fully understand the life of an authentic 'stoner,' so I have been smoking until I really achieve a great high.</p><p>My most recent time was one of the most intense. I had rolled a joint using a page from a 365 page-a-day calendar and tape; not the best joint. Nevertheless, it worked. I rolled one gram up and went out, telling my mom I was going out with some friends. I went for a walk to find a good place to smoke. Being that I had a joint, I knew it would be much less sketch to smoke in public, so I found a nice long street in a wooded area, struck a match, lit the end of the joint, and took in a nice big hit. I took several huge hits, but then I saw someone leave their house and start walking behind me. I quickly finished up the joint then stuffed the roach in an empty water bottle I was carrying. I continued to walk aimlessly, looking for a place to throw away my bottle because of the roach in it.</p><p>That is when it began to kick in. Just one brief moment later. It is hard to truly describe what it is like being high. It cannot truly be described through words. It is a feeling, nothing more but certainly nothing less. Telling it through words is doing the experience a disservice, but is the best way to convey the feeling accurately.</p><p>All of a sudden, I felt different. It felt as if I was starting anew; I hadn't just walked down the street, I hadn't just smoked a joint, I hadn't been at home earlier that evening. I felt like I was in a dream, too. It was as if I wasn't actually there. No hallucinations, no heightened senses. I just felt as if I was in a new time. My body was tingly. I heard my heart pounding in my head really loud, and my footsteps were rhythmic, as if I was walking to a beat. Everything looked so unfamiliar, and I had to concentrate really hard to know what I was doing. Time was distorted; the seconds felt like minutes, yet the hours passed by so quickly.</p><p>As I continued to walk, I felt like I was not actually there. It was so incredibly strange. In my head, I knew I was just stoned and that it would wear off eventually. However, the rest of my body was in a completely different state. It felt like my mind was detached from my body, like my body knew what it was doing and I didn't have to control it. I looked up at a street sign, then down at my feet. I looked back up at the street sign, and it looked like I hadn't moved at all. I kept doing it, and it kept working until all of a sudden, I was right in front of the sign.</p><p>I crossed the street because I remembered that there had been a dumpster across the street where I could throw my bottle away. Suddenly, I forgot why I was approaching the dumpster. I arrived at it, threw my bottle away, then had no idea where I was at all. This was one of the instances where my body took over. I felt like my body knew what it was doing, so my mind decided to trust it and I let myself walk back to my destination: a local hangout where all my friends were.</p><p>I arrived at this place; we will call it the Commons. When I got to the Commons, I was very disoriented. I still had that feeling that my mind and body were two different entities, but that I was stuck inside my body and it had control over what I was physically doing. I felt very free though when I was around people, and I was perfectly fine with this.</p><p>I was thinking to myself that, since I was stoned, I looked like one of the 'cool kids' and anything that I did was excusable because of this. With this in mind, I felt okay with the fact that I had no idea what was going on. A friend would come up to me and say hi, and I found it hard to talk to them. I could hear them perfectly fine, but my mind couldn't quite comprehend the situation. For example, someone would say 'Hey, what's up' to me. I heard the words 'hey what's up' but I didn't know at all how to respond to it.</p><p>I found my friend Warren and hung out with him the rest of the night. Everything that was happening, I didn't understand the reality of it. I would cross the street, oblivious to the chance that a car may hit me. I walked by a creepy-looking homeless man, unaware of my great fear that a homeless man will try to mug me one day. I walked along the busiest street in my city, not knowing that cars were zooming past me 50 miles per hour. I was very unattentive, but I decided to trust my body and let it do whatever it pleased.</p><p>I continued to go about the rest of the night, not fully understanding anything. I went into a well deep in a forest with my friend to drink. I took one sip of rum and everything looked a bit shaky. Then I told myself that being drunk and high just would not work, because I had to be home soon. I looked around the area. Last time I had been here, it looked simply like a small clearing in a forest. This time, I saw the well, the stone path leading from it, everything. I had a great fear that someone would come up from behind us and kidnap us, but I felt like this was simply my marijuana-infected body telling me this, not my knowledgeable mind. So I ignored it.</p><p>The rest of the night went by in a strange manner. Later that night, my drunk friend started messing around with some scary punk kids, and he got his skateboard and shoes stolen. I didn't find this situation dangerous at all. I just watched the whole thing and snickered. His brother got the crap beaten out of him later that night, but the whole thing seemed so fake. It wasn't like it actually happened.</p><p>I got picked up later that night, and all of a sudden I snapped out of this mindset. I felt normal now, but the night felt like a dream. Looking back on it, I remember the whole night clearly. At times, though, it all seems like it never happened. It is very strange.</p><p>Marijuana is a great drug to use, I must say, if it is used in moderation. It is a great escape from reality, something to get your mind off of things. When things are troubling me, I like to buy a gram or two, and the next couple days are spent contemplating when and where to smoke. I smoke up, and the next couple hours are a competely different world.</p>",
 "year": "2004",
 "id": "35234",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-09T07:00:00.000Z",
 "views": "4113",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
