{
 "title": "A Dissapointing Waste",
 "author": "Egg",
 "citation": " Egg. \"A Dissapointing Waste: experience with Salvia divinorum & Codeine (ID 35247)\". Erowid.org. Jan 17, 2007. erowid.org/exp/35247",
 "substance": "Salvia divinorum & Codeine",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "",
   "5 lines",
   "insufflated",
   "Codeine",
   "(ground / crushed)",
   "",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   ""
  ]
 ],
 "footer": [
  [
   "2004",
   "35247",
   "Male",
   "",
   "Not Given",
   "Jan 17, 2007",
   "4388",
   " "
  ]
 ],
 "report": "<p>My friend and I were feeling adventerous and decided to do something different.  I had read many reports on Salvia Divinorium before, and was extrememly fascinated by its potency.  So me and my friend gathered some money and bought a gram of 7x Salvia at the local headshop.  My friend brought his glass waterpipe, and I brought my butan mini-torch lighter.  I had invited my friend, T, over to be our sitter for the day, as I heard sitters are a must if you're on Salvia.  </p><p>We sat out in my backyard, sitting quietly on my large picnic cover, packing up our first bong load.  I had lost paper-rock-scissors to my friend, so he got to go first.  After he took a huge hit and held it in, he started to giggle.  I was excited about what I was about to do, so I packed myself a bong load.  I stared at the crimson burn of the flaming salvia, and sucked in as hard as possible.  The smoke tasted like shit, I hated it.  I held in the hit for about 20 seconds and exhaled.  Immediately I could tell a difference in the way I felt, as if I felt somewhat heavy and dizzy.  My body heat started to rise, and so did my friends.  Nothing else happened-so we decided to take one more toke each.  After we smoked our bit, I closed my eyes to see what would happen.  Nothing.  Nothing except the dizziness/heaviness that my friend was experiencing, too.  </p><p>My friend walked inside to lay on the couch, and the sitter and I stayed outside for about 5 minutes.  When I got inside, my friend told me that the Sage spoke to him, telling him 'Just do what you want', then vanished.  I was slightly jealous, knowing that I sure as hell didn't hear any damn Sage!  </p><p>The night rolled along, and we still had about two hits left of our salvia in my pocket.  We met up with my friend, N, and he brought Codeine pills with him.  He crushed two pills with a knife and made a few lines out of them.  I snorted about 5 lines in total.  The Codeine somehow didn't affect me at all, but my friend was feelin it.  I went outside and smoked a cigarette, totally bummed out.  </p><p>I tried 13x Salvia a few weeks after that, but it still didn't do anything.  I don't really get it, and I probably will try Salvia at least once more so I can finally feel the wisdom and power of the Sage.</p>"
}
