{
 "title": "Set and Setting",
 "author": "dude",
 "citation": " dude. \"Set and Setting: experience with Kava (ID 35248)\". Erowid.org. Feb 2, 2005. erowid.org/exp/35248",
 "substance": "Kava",
 "bodyweight": "230 lb",
 "header": [
  "DOSE:",
  " ",
  "",
  "Kava",
  "(tea)"
 ],
 "report": "<p>I've had some varied experiences with kava over the last 4-6 months.  Most have been good, but some negatives.  My first experiences were good, using dried, powdered root ordered directly from Hawaii (I've heard this is the way to go) and doing cold infusions.  Very mild and calming, slightly mood elevating, similar to popular anti anxiety meds such as Xanax.  Also notice a pretty strong sense of desire to talk to people.  These effects have been pretty consistent throughout my use.</p><p>One discovery I've had is that the setting plays a huge role in the enjoyment of this root.  A week ago I was in Colorado on a fishing trip and mixed up a Kava brew at days end and enjoyed it intensely, more so than my usual home surroundings.  Being in the mountains, near a stream with a campfire really added to the experience - it's pretty obvious that it would but the effects were so much better that I thought it worth mentioning.  Upon returning home, a friend and I took out the boat on a local lake, shut off the engines and I enjoyed some then and we had a great conversation.  I found that the conversations I had in Colorado were similarly deep and enjoyable - no wonder they use this stuff prior to meetings etc. in the South Pacific.  I guess the best way to describe it is a lowering of social inhibitions but I don't lose your mental capacity like with alcohol.  </p><p>The only negative for me has been that I like the effects so much that I tend to use it too often and get stomach discomfort.  I also tend to eat poorly and erratically as Kava is taken best on an empty stomach for full effects. </p><p>In summary, I think it's a viable recreational/medicinal herb but requires some moderation effort (for me anyway).</p>",
 "year": "2004",
 "id": "35248",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-02-02T08:00:00.000Z",
 "views": "26951",
 "dose": {}
}
