{
 "id": 3525,
 "title": "Our Muscles Stopped Working",
 "date": {
  "submission": "2003-02-15T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "bobby d",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material"
  }
 ],
 "report": [
  "My wife and I recently had an experience with psilocybin which I thought should be shared.",
  "We took a quarter of an ounce of 'shrooms' with us on a trip to the Oregon coast.  The first day we each did about a gram, and as the effects seemed somewhat minimal, we decided to eat the rest the next day - about two-and-a-half grams apiece.",
  "The effects started off as those of a typical mushroom experience - the vivid colors, etc.  After a few hours, though, my wife noticed that she was unable to complete the act of opening a bottle.  Later when we were laughing, we noticed that the muscles in our faces which would normally allow us to smile, weren't working.   We also had problems chewing.  And I was unable to swish water in my mouth -the muscles which would normally allow me to hold it in were not working.",
  "And the scariest part was when we decided to take a stroll.  After walking up a slight hill about two hundred yards or so, my wife's legs gave out, and she had to sit for about five minutes before she could make it over to where I was sitting, my legs having given out as well.  And when I tried to get up again, my legs simply collapsed under me once more.  When two fishermen came up the path toward us, the only way I could get my legs out of the way was by pulling them with my hands. ",
  "Finally, after resting awhile, we were able to make it down to a place by the rocks where we could sit and watch the sea.  After an hour or so, we headed back to our room - a walk of a few hundred yards, which we were just barely able to accomplish. ",
  "A few hours later, we decided to go to a restaurant to pick up some food.  We figured our muscles must have regained their strength.  But again, we barely made it there - another couple hundred yards at most.",
  "The most frightening thought was whether or not we would ever recover from this condition.  I'm writing this a few days later, and I'm happy to say, everything seems fine. ",
  "But it was quite a frightening experience.  What would have happened if we had walked to somewhere where the tide was about to come in, and not been able to move then?  Or what if the seeming paralysis, or muscle fatigue - whatever it was, had overtaken us while crossing the road?  Of if it had never gotten better?",
  "Though we're in our late thirties/early forties (we're both in quite good shape, physically), we've ingested psilocybin numerous times in the past, and never experienced anything similar.",
  "Personally, my 'shrooming' days are over.   I post this in the hope that someone who has the capability and desire will be able to follow up on it, so that something similar or worse, for somebody else, can be prevented in the future."
 ],
 "erowid": {
  "id": "21359",
  "citation": " bobby d. \"Our Muscles Stopped Working: experience with Mushrooms (ID 21359)\". Erowid.org. Feb 15, 2003. erowid.org/exp/21359",
  "substance": "Mushrooms",
  "views": "17730"
 }
}
