{
 "title": "Life Never Felt More Beautiful...........",
 "author": "In too Deep",
 "citation": " In too Deep. \"Life Never Felt More Beautiful...........: experience with 2C-I & Cannabis (ID 35267)\". Erowid.org. Jul 20, 2004. erowid.org/exp/35267",
 "substance": "2C-I & Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>I have been hearing about the 2C's for sometime now but did not know whether I should give it a shot or not. I had heard nothing but good things about them from several reliable sources that I trust very dearly, So I said 'Why not?' I was fortunate enough to be given one 20 Mg cap for free and decided to head out to the beach and set up camp early in the morning for a pleasant 'day trip'. Daytripping is wonderful in taking a hallucagenic drug because you are able to see the enhancement in colors a lot more clearly, unless your at a rave or something, where lazers and other eye-candy are readily available for your visual pleasure. But the beach.....how could I go wrong?</p><p>12:30--Me and a friend of mine ingest one 20 mg capsule and head out into the ocean to float around in the water boogie boarding, catching waves and just forgot about the drug to avoid the classic pychadelic anticipation. We spent about 45 minutes and the water and all so suddenly I began to feel a little bit queezy, so I headed back to shore to go and try to releive myself of this irritable feeling in my stomach.</p><p>1:15--As soon as I stepped out of the water I could tell that the colors in the sand and the sea shells began to take on that LSD like color enhancement, everything around me began appearing bright, and I could see a shifting in the clouds. The visuals were sure enough coming into my mind to play. I walked to the tent and decided to smoke a little weed to attempt to relieve myself of this discomforting nausea. My friend made his way out of the water and was feeling very sick to his stomach so he decided to go behind some sand dunes to relieve himself.</p><p>2:00--My friend came back and was upset to his stomach, his agitation had caused him not even pay attention to the effects that the drug was bringing on. I had already been studying the onset of the drug while I set in the tent for those 45 minutes that he was gone. The clouds and ground were both shifting in a manor that is unlike LSD or Psylocybin. I could tell that the hallucinations were defenitly 'designer' so-to-speak. I could not manipulte the formations in the clouds much less anything else I was seeing into what I wanted, like the way I am able to do on LSD or Psylocybin (i.e. when feeling dark hallucinations seem a little morbid, when feeling positive hallucinations take on a pleasant form).</p><p>3:00--Heavy hallucinations began setting in, I could not even tell how many seagulls and pelicans were flying in the sky. It seemed as though the sky was full with birds all around us. I began to get the body high that one experiences while on MDMA only that it came in spurts rather a full blown, overwhelming roll. I noticed I began to open up to my friend discussing things that we have gone through together in the past. The empathy was there but was not forced. My ego was still intact so I did not experience much of the disassocative aspect of LSD (ego-loss).</p><p>4:00--Peaking hard! very thirsty. I drank alot of water but noticed that there was a heavy build up of saliva in my mouth, but soon discovered that water and a little bit of weed would cure that for a while, the cannabis causing 'cotton-mouth' kind of drying up all the mucus build up in my throat and tounge. I hopped back in the water, the sand under my feet and water coaring through my body was really a wonderful feeling. I stayed in the water for another hour, riding waves and apprecating all the animals of the sea.</p><p>5:00--All the swimming really tired me and my friend out. I began to experience a mild headache possibly from being out in the sun or possibly a side effect from 2C-I. The hallucinations were still riding hard, so I just kicked back in my tent and enjoyed them for as long as I could. I smoked a couple of other joints and just spoke with my friend a little bit more. The only way that I could describe this drug was really srong LSD without the edge that the drug is prone to bring on.</p><p>6:00--Something (Sun, or 2C-I) has taken a heavy toll on my body I felt really tired at this point so I just waited in the tent for the sun to go down. I began to feel extremely hungry, being that I had not eaten a thing all day because I was told not to eat before taking the drug. I just sat around and talked more and more, damn this a really talkative drug! From here on out we took it easy admiring the beauties of the world discussing issues pertaing to our lives and actually came to a few epiphany's while doing so. Life never felt so beautiful despite the fatigue and headache I was experiencing.</p><p>7:00--Time to go home, It was a one hour drive home so we broke down to the tent and hit the road. Driving home was not so bad but I still do not recommend it to the unexperienced tripper. The road seemed to be bending in--VERY DISTRACTING!</p><p>Summary: 2C-I is an excellent drug for the psychadelic veteran. Overall it is a brand new drug of choice in my book, and I look forward to dabble a bit more with it in the future.</p>",
 "year": "2004",
 "id": "35267",
 "gender": "Male",
 "timestamp": "2004-07-20T07:00:00.000Z",
 "views": "6816",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 }
}
