{
 "title": "Bridging the Chasm - An Unexpected +++",
 "author": "nanobrain",
 "citation": " nanobrain. \"Bridging the Chasm - An Unexpected +++: experience with Piracetam & Cannabis (ID 35283)\". Erowid.org. Aug 19, 2004. erowid.org/exp/35283",
 "substance": "Piracetam & Cannabis",
 "bodyweight": "70 kg",
 "header": [
  "DOSE: T+ 0:00",
  "2.0 g",
  "oral",
  "Piracetam",
  "(powder / crystals)",
  " T+ 4:40",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 10:00",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>The other day I had a very unexpected and a rather interesting +++ on the Shulgin scale...from 2 grams of Piracetam powder. Now I am a nootropics User of some 20 years standing, using Piracetam in the form of Nootropil on and off through that time for its cognition-enhancing properties, finding its effects to be for the most part as described in literature and certainly nothing spectacular, especially on a one-off attack dose. This particular morning being in the middle of a nootropics course, the standard regimen was:</p><p>5mg l-deprenyl</p><p>5mg Hydergine</p><p>1,000 mg l-phenylalanine</p><p>500 mg centrophenoxine</p><p>2 caps of ginseng extract</p><p>Couple cups of strong coffee</p><p>Mind you, I had run out of Nootropil about a month ago, so off to work I went to be pleasantly surprised to hear that the expected package had arrived. After taking possession of the customs-cleared package from the smiling global express delivery unit, I proceeded to weigh out 2 grams (my standard dose of Nootropil is 2x800 mg tabs or 1,600 mg) of the most brilliant white, almost piezoluminescent and somewhat hygroscopic powder</p><p>T 0:00 2:00 P.M. and down it went...uggghhh, the straight up utterly ugly bitterness that borders on sweetness (always have to taste new chems), chased down w/a bit of Breakfast Juice; I went on with my workday expecting nothing really, maybe some improvement in clarity of thinking.</p><p>T 2:00 with no notice of it, engaged in 3 simultaneous conversations, one of them in a different language, 2 LCD screens flashing various data, um, somewhat too slowly for my liking, no urge at all for the de rigeur afternoon coffee, which um, I won't be having till tomorrow as it appears the workday is over.</p><p>T 4:00 the drive home, colours of the oncoming sunset delegate a certain import, weight to the texture of the sky, the wind-rippled water on the lake reflecting golden-lined clouds, visual aspect is razor sharp, in contrast to normal end of workday tiredness, wicked psytrance amped through the 8-speaker high fidelity system sounding crisp yet oh so space-dirty and the standard irritation at the nimrods who havent taught their cars how to drive is strangely absent.</p><p>T 4:40 back at home, put on Shulmans in Search of a Meaningful Moment (highly recommended for Shpongle / Entheogenic fans) and as the first song builds, indulge in a stress relieving cone or two of some fine Australian indisat hybrid. This particular strain normally proves light on the head, energetic, yet with a solid backbone and minimal paranoia, yes, a cultivated vice, I admit, forgive me gentle reader. Exhaling, I feel an almost immediate dumbing-down if you will, the soft cloud enveloping and my thoughts becoming muuuch slooower (not at all the normal fx when I praise Jah), but this lasts for about 5 minutes after which time I am actually questioning whether it was Piracetam that I ingested, without warning I am at a solid +++ but a hard to define place, and crikety, I mean after all, internet white powder is just that without an HPLC / GCMS spectra to confirm...</p><p>Powered by the evolving music, this is certainly no THC effects, I make sure by sampling a couple more cones, try to sit back and enjoy the experience but sitting down is hard as for some reason I feel the urge to do something creative, like write Crowleys interpretation of the Tao on a transparent Moebius strip then decode through a yet to be found algorithm based on a 4-part fugue structure and pumped to a bitchin sound unit, yyeh... Abandon this task in favour of something more practical like, um, getting online to download some esoteric chemistry articles that actually make sense when speed-read. </p><p>T 6:00 the chasm known as the corpus callosum, across it communication between the brains hemispheres takes place. I am acutely aware of this communication process taking place. Eyes closed, I can see thoughtfields and trace them back to the actual spatial locations within the brain where particular thought 'units' originate. There is no push for higher symbolic processing, the thoughts do not fragment into fractals, but rather seem to be well contained within their fractal parameters. On the other hand there is no obsessive self-analytical digging which is a sign of being off baseline.</p><p>It becomes clear why this stuff is indicated for such things as cerebrovascular trauma and alcohol addiction (DT stage). I feel, for lack of better words, as if the old synaptic pathways clogged with debris and are being flushed clean, from the microcapillary down to actual neuronal conductance levels, and there is a feeling of damage being repaired. This is not the cathartic psychedelic soul repair that is the result of hard psychological work, this is much more physical, the awareness of the physical, specifically, cerebro-physical. Memories of minute events become clear but only those I choose to focus on, no distortion or unwanted directions.</p><p>There are no physical symptoms although I should certainly be hungry by this point (still empty stomach from morning), BP is normal, pulse normal, some pushups take to get the heart rate going and the blood flowing.</p><p>T 7:00 the Soulmate comes home, are you secret-dosing 2C-T-21 again? - is her first question. Takes a bit to convince her otherwise, but shes familiar with Nootropil and highly sensitive to it, we take advantage of my state to discuss matters which she hopes I may remember, grin. Make a meal which actually tastes wonderful with a couple Stellas, appetite comes while you eat, as the saying goes.</p><p>T 10:00 the residual effects are still present, tiredness has yet to set in, couple more cones, turn on the TV  ugh, off it goes, a mutual massage to the background of Silence (FAX Records) time for bed, pesky thoughts folding in on themselves, slowly fading into darkness of a somewhat fitful sleep filled with dreams of chases and snowy mountains.</p><p>Summary: placebo-shmasebo, a definite +++ in absolute number terms, although not in your classical psychedelic sense. At no point did I feel spatio-temporally challenged or pushed into consciousness expansion as with most psychs, and the visuals were, um, self-limiting. I am certain this level experience will not be repeated with this substance, although a useful nootropic and prophylactic ally Piracetam shall remain.</p>",
 "year": "2004",
 "id": "35283",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-19T07:00:00.000Z",
 "views": "66321",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 4:40",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 10:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
