{
 "title": "Somewhat of a Breakthrough - Quid Style",
 "author": "UndeadWario",
 "citation": " UndeadWario. \"Somewhat of a Breakthrough - Quid Style: experience with Salvia divinorum (ID 35298)\". Erowid.org. Jan 16, 2007. erowid.org/exp/35298",
 "substance": "Salvia divinorum",
 "bodyweight": "13 kg",
 "header": [
  [
   "DOSE:",
   "12 leaves",
   "sublingual",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "report": "<p>I've never really had much success with salvia quids before, but when my torch lighter ran out of gas last week it was my only alternative. After reading a report from a fellow tripper I was inclined to try the quid method again with some new preperation tactics.</p><p>Preperation: I brushed my teeth, used lots of mouth wash and finally brushed my teeth with chilli sauce. (I filled the head of my brush with Econa West Indian Pepper Sauce, scrubbing under my tongue and the inside of my cheeks) Apparently the chilli sauce improves blood circulation. Finally I washed my face and hands, kind of a cleansing thing I guess.</p><p>Setting: A darkened room with a pillow propped up against the wall in a completely empty house.</p><p>The Quid: I rehydrated 10 or 12 dried salvia leaves in warm tap water for 5 minutes and rolled them into a ball.</p><p>[T:0:00] I put the quid in my mouth and sat crosslegged. Feeling everything was right I began to chew. Its quite nasty to start with, but I've chewed a few paracetamols in my time - its not so bad.</p><p>[T:0:05] Nothing yet, I was now very aware that I had a mouth full of bitter plant material and spit.</p><p>[T0:07] I strained the plant material with my teeth and swallowed most of the liquid. I continued to chew and make an effort to push some material under my tongue. I could hear a very faint rushing beat in my hears, too fast to be a heart beat - more like the waves breaking on the sea shore (this is something I experience in varying degrees everytime I try salvia)</p><p>[T0:10] At the lack of further effect, I began using some medative breathing and slit my eyes. I built my breathing up to what I believe is known as a 'Grand Tour'; basically this is holding your breath until you feel the need to breathe out and then not breathing in again until you need to.</p><p>[T0:14] I closed my eyes and began to rock gently back and forth whilst continuing the 'Grand Tour'. After a minute or two of this I opened my eyes.</p><p>[T0:16] I slowly opened my eyes, sat upright now. I could initially see purple shapes, much like every day closed eye visuals but there was something quite different about these. I kept my eyes open to slits for a time, thinking that perhaps if I open my eyes fully the visions would disappear if I showed interest.</p><p>(Tense switch!)</p><p>A Bright Purple being, that has no depth occupies the left side of my vision. I can only see it side on and it gesticulates emotionlessly with its elongated arms and fingers. It has no defined nose of any kind just a rounded bump. I now notice that I feel very warm and comfortable, as if I were wrapped in cotton wool. I believe the being is female, the eye that I can see is large and quite feminine.</p><p>The being creates less well formed shapes in the air next to it. At first it showed me squares and triangles. They all have a dark purple colour to them, while the being itself was brighter and more well defined. I felt quite unimpressed however, I cannot explain why - as if I was watching a tv show I had seen before. The being sensed this and made more complex creations, a bird a dog. The creations floated for moments, before being sucked off the the right into a kind of invisible triangle (I can't really explain this, imagine if pac-man was invisible and opaque things were flying into his mouth).</p><p>The animals struggled a little before being sucked away. I was still unimpressed (I find this as strange as you do, I'm not sure why I felt this way at the time). The final creation was two male figures.</p><p>The figures fought each other, pushing and shoving in vain to decide who would be dragged away first. But it was no use, they were both sucked away together. I was finally amazed.</p><p>[T0:23] After the figures were sucked away, I suddenly realized that I could no longer hear the rushing wave-like beat in my ears, I glanced at my clock briefly and the spell was broken. I was left in a dark room with my angry flashing red LED clock and a mouth full of spit and salvia.</p><p>All in all, this was a very worthwhile trip. Whilst not being as world shatteringly intense as a smoked dose, the quid showed me something quite different. I got to explore the quieter more medative side of salvia.</p><p>(This was the first time I have seen what I believe to be a 'salvia being')</p>",
 "year": "2004",
 "id": "35298",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-16T08:00:00.000Z",
 "views": "5187"
}
