{
 "title": "Entering the Spiritual Realm",
 "author": "Shaman Swa",
 "citation": " Shaman Swa. \"Entering the Spiritual Realm: experience with Amanitas, Mushrooms (P. cubensis) & P. harmala (Syrian Rue) (ID 353)\". Erowid.org. Sep 8, 2000. erowid.org/exp/353",
 "substance": "Amanitas, Mushrooms (P. cubensis) & P. harmala (Syrian Rue)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "8.0 g",
   "oral",
   "Amanitas",
   "(dried)",
   " T+ 2:00",
   "2.0 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   " T+ 2:20",
   "2.0 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   " T+ 2:45",
   "3.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "report": "<p>I would like to start off by saying this was a planned spritual event and turned out to be so.  I have never heard of anyone taking syrian rue with amanitas and this was an experitment.  I fasted all day aside from a cup of yogurt, as to decrease nausea.  Interesting enough, I had no nausea and did not vomit.  The most physically distressing part is on your stomach when you are passing from your subconsciousness into your supraconsiousness.  As long as you keep yourself reassured that you are alright, you should be fine. :)</p><p>T:  8 grams of dried amanitas were eaten with a couple cups of water.</p><p>T+1 hour:  I definitely started noticed an enhacement of my auditory sensitivty.  While riding in a car with my friend I could hear every sound outside of the car.  The sould of every car's engine seemed amplified.</p><p>T+2 hours:  2 grams of powdered syrian rue was ingested with a chaser of gatorade, followed by 2 grams 20 minutes later along with a friend. My friend had not taken the amanitas.</p><p>T+2:45:  about 6 grams of dried P. cubensis mushrooms were divided equally between my friend and I (3 grams each).</p><p>T+3:15:  I definitely started to feel the effects of the mushrooms now.  Colors are enhanced and the sizes of objects start to seem a little distorted.  At this point I have a mild case of diarrhea and gas, I assume from the amanitas.  It wasn't bad at all, it felt kind of good, even though I'm starting to trip a little.</p><p>T+3:30:  I start to feel extremely relaxed with an great feeling of euphoria coming on.  Visuals are getting stronger and when I close my eyes I can see in 3D, like I'm staring into a darkness but it looks like a black hallway with doors on the walls of the hallway.</p><p>T+?:  This is when it starts to get really strange and I mean REALLY strange.  Time seems to be slowing down.  Visuals are getting extremely weird.  The texture of wood seems really interesting.  I can see into the wood, like through it, and the visuals aren't the same as with just psilocybin.  I start to feel an extreme heaviness in my whole body like I'm tired but not physically tired.  At this point I lay down on the bed and feel really relaxed.  I lay there for a minute or too with my eyes closed have closed eye visuals, and whoa, I jump up, it felt like I was falling into the bed, but I fell too heavy to get up and just lay down and go with it.  It starts to get more and more intense.  The falling feeling accelerates and I notice myself starting to have REM's which accompany an intense visuals and energy flows.  The strangest thing was when I was having the REM's my friend laying down next to me was like 'whooa', and it was like he could feel what was happening to me. </p><p>I don't know how long I was in this state but I seemed like 45 min.  While I was in this state I was aware of everything that was going on in the room, but it seemed like in a far off place.  At the end I felt an extreme emptiness in my stomach and thought I had forgoten to eat or drink water or something and I asked my friend if I was dying and he said 'no'.  In the back of my mind I knew I wasn't and I remembered reading that this was going to happen.  The next thing I knew I just got up and started walking around the room.</p><p>T+4:  As soon as I got up I was like 'whoooa'.  I felt GREAT, as if I had been asleep for a thousand years and just woke up. I felt godly. I was extremely calm.  My thought-speed was greatly accelerated.  The visuals were extremely intense and very earth bound, not like colors patterns associated with traditional psychedelics but with distortions in size and color of objects.  Time goes by very slowly and there is an enormous amount of internal dialogue.  The experience wasn't focused on the hallucinations though.  It was focused on my interactions with others.  Many people don't believe me but I had the most intense psychic experiences I have ever had at this point.  There was an intense energy and psychic exchange between me and my friend.  I could read his mind, and he could tell me what I was feeling and thinking. It was very strange.  My friend and I pretty much sat around for 3 hours just talking about things and talking about our experience between each other.  There are a couple strange things I noticed about the amanitas.  They pretty much diminished my emotions.  I could think regardless of emotions and I could judge the difference between everything good and evil.  I wanted anyone to ask me questions and I felt I could answer them all.  There was also a separation of the body and the mind, like they were in two different places, and it felt like I was not in my body at the time.  The rest of the experience seemed pretty much was the same after I came out of my subconscious state.</p><p>T+8:30:  I'm pretty much down now and it is a little difficult to sleep.  I'm still having interesting revalations about life and religion.</p><p>This was one of the most intense experiences I've ever had.  There was a definite religious and telepathic note to the whole experience.  The visuals were incredibly awesome and nothing like LSD.  I would definitly try this again in the forest when camping.  For those of you wanting to try this, I strongly urge you to have a sitter with you and you can communicate much better with people of mushrooms.  It seems the P. cubensis and syrian rue opens up your psychic conections and the amanitas just blows them to a whole other level.  Also getting along with drunk people will be very difficult in this combination.</p>",
 "year": "2000",
 "id": "353",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-08T07:00:00.000Z",
 "views": "15775",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "8.0 g",
   "administration": "oral",
   "substance": "Amanitas",
   "form": "(dried)"
  }
 ]
}
