{
 "title": "Berserk",
 "author": "Hoo Haa",
 "citation": " Hoo Haa. \"Berserk: experience with Mushrooms (ID 35331)\". Erowid.org. Dec 16, 2007. erowid.org/exp/35331",
 "substance": "Mushrooms",
 "bodyweight": "280 lb",
 "header": [
  [
   "DOSE:",
   "8.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>This was the fifth time I've tripped on shrooms. The setting was my apartment about 2 am. and I was alone except for my 2 cats. I ate all 8 grams with half a jar of peanut butter within 10 minutes. I was feeling very anxious and excited to be doing shrooms again. I decided to watch a movie to pass the time. So I layed on my bed with the lights off and my floor fan on low, watching a movie waiting for the first light trails or anything strange to begin.</p><p>After an hour, I hadn't felt anything. I got tired of waiting and decided to jump start my trip. I turned off the t.v. and starred at the blackness that was my room. I began focusing on my breathing and realized it was strange. Then I felt a little nausea and my body was warm all over. I began listening to my floor fan and it started to make the strangest sounds. I kept listening and then it all changed. It was like my hearing came into focus and I was hearing stuff coming from behind me. I soon saw strange shapes and lines and things exploding but they were all in time with what I was hearing.</p><p>Then the shapes and colors began to form and took the shape of a sphere. Have you ever seen an active graphic equilizer? The lines that move at different wavelengths and stuff? Well I could see all the wavelengths that my fan was producing. The lines were coming out of the center of the sphere and reached to the edges of the sphere so I wanted to see what was at the center. Ever look at a t.v. up close? You see the pixals that make up the big picture. That is exactly was I saw. The pixaltion of sound.</p><p>So after watching all this unfold in front of me for about an hour, it began to drift away and soon the fan was making it's normal noise. I sat up in bed since I hadn't moved one muscle since it began, and had the urge to talk. What happened was utterly insane. I said 'Jing Jong Parvey' and began to speak but I was not talking in words. It was just a jumbled mess of letters and all the different sounds that my human voice could make. Not only that, but I was flailing my arms and legs about. It was like I was going complete nuts. But it was fun.</p><p>So that went on for about 30 minutes. After I stopped, I started giggling uncontrollably. It was very funny. I really had to take a piss so I stood up and was stood there looking at my bedroom door which was less than 10 feet away. After what seemed like forever I made it over to the door and walked out. Took a piss, tripped out on myself in the mirror (very cool feeling) and decided to look outside through the blinds. The world seemed huge. I began to pet my cats and my hands just melted into them. I picked one of them up and held her in my arms. Ridiculas feeling. I had tons of energy and wanted to do something cool. I thought 'Ooh... Ill get on the internet.' This is when the trip goes bad.</p><p>I turn on my comp and after it starts up, I looked at the screen and felt very confused. I started to feel hot and the nausea started to come back. I looked at the screen more and decided not get online cause what if my girlfriend called and found out Im online at like 5 in the morning? She wouldnt have called but she was very bad for me. I started to feel more sick and feeling flushed. 'Ill puke em out. That'll make me feel better.' Little to my knowledge that it wouldn't have done anything anyway. I tried to puke and felt worse and worse. I then had feelings of dying or being perma fucked and I was afraid. So afraid that I was going to lose everything. I would lose my girlfriend, my job, my apartment, my parents. My world came crashing down in a big hurry. I was crying uncontrolably. I thought that if I went to sleep I'd wake up and be ok. That sure didnt work. I couldnt decide whether to call my girlfriend and tell her or my parents or 911. I was totally flippin out.</p><p>So I decided to call the guy in which I got the shrooms. Lets just say his name is Matt. I try calling his cell but he's not in range. He is a good 30 minutes off the freeway from where I was. So I continued to call his cell, leaving desparate messages to no avail. Finally he picks up. 'Hey man. Dude. Isnt this crazy?' I said 'I am not ok. Im flippin out Im gonna die I dont know whats goin on.' He proceeded to tell me that I was ok and to just calm down and that they were on their way to come and get me. So we hung up the phone and I started to think. Wait, did I actually talk to him? Or was I just trippin. So I tried callin again. No answer.</p><p>Shit hit the fan. Going hysterical was I. I was feeling all the emotions that I've ever felt in my life all at the same time. And every memory I ever had was fast forwarding and rewinding in my head. My memories were pushing and pulling on and against each other as if my brain were being ripped apart. By this time I had lost all sense of time and sense of self. I looked around my room and didnt recognize anything. Then the phone rang. They really were on their way and after 10 minutes of trying to tell them where I live, they were almost there. We hung up the phone again and I knew everything was going to be ok. I was still jumpy and crying but, a calmness came over me. I started to reflect on myself and the things I took for granted. And realized what was truly important to me.</p><p>The phone rang again and Matt told me that they were outside my complex. I said, 'Ok, I gotta put some clothes on.' Matt replied, 'Youre fucking naked? Fuck yeah man!!! How many did you take?' 'All of them.' I replied. 'Holy shit man. Fuck yeah.' So I put some clothes on not thinking about the shirt I grabbed to put on and walked outside. A bunch of people were waiting for me and I just busted up in laughter as well as them. We all started hugging and talking and I felt so incredibly satisfied and happy.</p><p>Then another person that was there (all people who came to my rescue were trippin too) pointed out that my shirt read 'From out of the depths'. How true. Looking back at that trip, it was by far the most amazing experience I've ever had. Even though the paranoia was incredibly frightening, all in all, it was amazing. I looked at everything differently. The trees and cars and birds. But especially, myself. I am a much happier person now. I also realized what in my life was holding me back and what I had to cut out of my life. I totally have plans to do shrooms again in the future. Just not near as many and never again alone.</p>",
 "year": "2004",
 "id": "35331",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-16T08:00:00.000Z",
 "views": "2578",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "8.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
