{
 "title": "Addiction?...Not Me...",
 "author": "Neutopia",
 "citation": " Neutopia. \"Addiction?...Not Me...: experience with Opioids (ID 35349)\". Erowid.org. May 11, 2006. erowid.org/exp/35349",
 "substance": "Opioids",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Opioids",
   "(daily)"
  ]
 ],
 "report": "<p>So it's happened... I am addicted to opiates.  Not the physical addiction that is normally thought of when opiate addiction is mentioned.  Well, actually, yeah I'm addicted that way too; but that's not what scares me. </p><p>About four years back, A friend of mine had stolen me a full bottle of compounding morphine sulphate.  At one point, when there was about half of the bottle left, I realized that I was addicted.  Not that I couldn't bring myself to stop, that part was easy.  But when I stopped I got ill, VERY ILL.  The idea of being addicted to something repulsed me so I stopped it immediately and got sick, I took what I had coming to me like a man, then I gave the other half of the bottle away.  That was neat and tidy.</p><p>This summer, I started taking hydrocodone for my chronic back problems.  This is nothing new.  But I had also found sources for some other opiates and have been doing them basically every day.  I found myself physically addicted twice so far and stopped for a few days to break the dependence.  That's not the part that I find scary. Physical dependence to opiates isn't like addiction to benzodiazapines or alcohol, it can't hurt me permanantly and it definately can't kill me.  The physical dependance isn't much of a threat.  It's the mental addiction that's got it's hands around me.  I love opiates.  Love'm.  I am a happy and rather well adjusted person.  I'm a college student, I'm going for cognitive neuropsych and my grades are great.  I have healthy social networks.  I am active in politics and music, the list goes on.  But this time the pills found some backdoor into a weakness that I didn't know that I had.  You know the opium addicts that you learn about in school who just lay on the ground and smoke opium until it wears off then sit up to smoke some more?  I can actually see how that could feel like a fulfilling lifestyle.  scary.  Opiates make me feel like the person that I want to be,  decisive, outgoing, very talkative, quick witted and on point.</p><p>Although, from an outside perspective, it probably just looks like I became lazy and irritable.  It's not the first thing I think about when I get out of bed, but that warm, comfy, itchy feeling is one of my only goals by 11:00 in the morning.  I'm starting to think like an addict, calculating where I will get more when I run out, how long the ones I have left will last, going to the doctor when its unnessessary.  I suppose one might call this a problem. </p><p>I've always heard that admitting that you have a problem is the first step to recovery... I know I have a problem, and that problem is that I want to have nothing to do with recovery.  Everybody has something that feels very right with their particular chemistry, for me it's oxy and hydro, and perhaps anything else that acts on my endorphan receptors.  I feel like I was built to be augmented by pain killers.  I bought 120, 50mg codiene pills, I figured they'd last a month and a half... gone in 2 weeks.  I had a blast, but that's still ridiculous.</p><p>Morale here is basically to be careful.  There is a huge difference between mental and physical addiction.  Mental addiction is the bitch.  If I'm not careful, a bunch of little pills might be all I look foward to in my day.  And it happened to me, well trained in pharmacology, yes it can happen to you.  and if it does, I'm sorry to hear it but I'm sure you'll enjoy the ride down.</p>",
 "year": "2004",
 "id": "35349",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-11T07:00:00.000Z",
 "views": "5398",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Opioids",
   "form": "(daily)"
  }
 ]
}
