{
 "title": "Stupidly Tripping On Diphenhydramine",
 "author": "Nervous_twitch",
 "citation": " Nervous_twitch. \"Stupidly Tripping On Diphenhydramine: experience with Diphenhydramine (ID 35358)\". Erowid.org. Mar 6, 2007. erowid.org/exp/35358",
 "substance": "Diphenhydramine",
 "bodyweight": "162 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "450 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   " T+ 4:30",
   "750 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Back in 03', I quit smoking pot entirely. However, after various extreme circumstances, I became very stressed and wanted to lose myself in a different world. I didn't have much money at the time, but I knew about Diphenhydramine and decided to try it. Going to the store to pick up some cigarettes, I also picked up two boxes of Sleep-Eze D Extra Strength, containing 20 pills in each, 50mg of Diphenhydramine per.</p><p>When I got home, I told my mom I was going to be painting in my room, which I then did after popping the pills. At first, I only took 9 50mg pills at 8:00pm. I painted a fairly good portrait at first as the buzz came on. Looking around the room, I could see strange shapes and patterns forming in the wallpaper. In the corner of my eye, I would also see what looked like a flashing light, spinning in circles as if it were a siren.</p><p>Realizing I was just freaking myself out, I decided to go downstairs on the computer, which was right next to my mother, at 9:30. Sitting down, I felt sober all of a sudden, which to me was a good thing. My mother and I were having normal conversations, and everything seemed fine. But out of the corner of my eye, I saw a mouse crawl under a pillow. I could see it move under the pillow. I told my mother, but then the mouse magically ran to the crawlspace, which was nearby. This continued to happen, until I ignored it.</p><p>Everything seemed perfectly fine from then on, but apparently I was muttering to myself, which I do not remember. I went to my room soon after, and I felt a very lucid, heavy feeling overcome me, and noticed my emotions swung from one polar extreme to the other in bursts.</p><p>After this, I remember sitting in my room painting, when a dragon fly came in and perched itself on my hand. This, of course, was a hallucination. When I went to go touch it, it disappeared. At this point, I again felt as thought I were coming down. I felt as though the trip was ending, and so in my unbeknownst stoned state, proceeded to eat 15 more pills somewhere around 12:30am. However, this may be wrong, since the boxes were empty when they were found, and I don't know if I ate them all later on or did something else with them.</p><p>Most of my memory is blacked out from that point on, with short bursts. I remember trying to light a paintbrush on fire thinking it was really a cigarette, as well as painting my teeth black. This drug made me completely out of my head. I had absolutely no control over reality and couldn't distinguish it from fantasy. It seemed to induce psychosis, causing completely irratic, schizophrenic-like behaviours.</p><p>I didn't sleep at all that night, and was found covered in paint, screaming in the bedroom hallway for a telephone call to someone named Shawn at 6:00am. My mom, who knows I am bipolar with tendancies, thought I had entered in a psychosis, and took me to the hospital.</p><p>On the way there I thought it was still night, since the clock said 8:49, and asked why it was so bright out, only to find out its the morning. I tried not to talk after that, but my mind couldn't retain any information. I kept talking to people who weren't there, or continuing a conversation in the middle of it with no one at all, all the while with my mother in the front seat.</p><p>At the hospital, I was counselled by a nurse in a small room. I remember thinking that my cousin was just outside the window and he was banging on the window and telling me to come out.</p><p>I had to get blood tests to see what it was I was on, even though I gave them the technical name, and so I went to a different section of the hospital. There, I was given a small room to see the doctor in. I sat up on the tall bed covered in paper, and looking to the cubbords, I saw two small Mexican children shutting it and hiding. I then saw another run through the room and climb into the cubbord. And yes, it was a hallucination. Soon after that, my friend Julia came in, and hid where the mattress of the bed rose at the end. We had a conversation together, but then someone walked in and put a box on the bed next to me and she was gone. This time, though, it wasn't a hallucination; the doctor was about to take blood from me.</p><p>Later on, still somewhat psychotic, I was taken to the Adolescent Psychiatric Ward in the hospital. I felt the effects of the drug, and continued to see visual hallucinations at a more sober state until about 7:00pm the next day. I ended up staying there for two months to go through psychological evaluation and substance abuse treatment and counselling.</p><p>This may sound like a 'Reefer Madness' segment, but it actually happened and it was scary as fuck. This drug offers no control, especially at high doses. The hallucinations aren't cartoonish but very realistic to the point where I didn't know the difference.</p><p>This is a dangerous drug, even if it can be bought at a drugstore, and I wouldn't want anyone but very experienced psychedelics users to try it, but overall if anyone does try it, be sure to have a sitter. It's important with this drug. I urge any would-be new users to this to think strongly before they even consider it.</p>",
 "year": "2003",
 "id": "35358",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-06T08:00:00.000Z",
 "views": "48337",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "450 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ]
}
