{
 "title": "Happy, Dizzy",
 "author": "Koshh",
 "citation": " Koshh. \"Happy, Dizzy: experience with Crack & Cocaine (ID 35363)\". Erowid.org. Dec 17, 2007. erowid.org/exp/35363",
 "substance": "Crack & Cocaine",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Cocaine",
  "(powder / crystals)",
  "",
  " repeated",
  "smoked",
  "Crack",
  "(freebase)"
 ],
 "report": "<p>I've been blowing my money recently for something to do on blow. One of my dealers keeps trying to get me to smoke crack with him. He's always on about how much better it is.  I've banged coke before, so I figured that I had a pretty good idea of how great it is.  I know that I get much higher when I shoot.  But I dont care. I love 'the drip', and I love to snort the shit.  It's as simple as that.</p><p>Last night though, I caved into my desire to try out this 'crack' and see what all the fuss is about.  Addiction was not a concern for me, since I'm probably addicted to coke anyways, and I can't see my body being biased about how it gets it's precious drug.  I started out the night blasting abnormally large rails to get truly high on the stuff, instead of just talkative.  Eventually IT came up in conversation. Crack.  Everyone present knew how to make it except me. So I let them at it while I checked out if they were doing it right online.  We ended up with some gross looking yellow paste.  For some reason we filled the bowl of the pipe with cigarette ash and threw the crack on top. I was feeling a little bit too high to hit the pipe immediately, although I was talked into it anyways.</p><p>I could feel my chest pulsating with what I can only describe as an orgasmic feeling after the first hit, and considered stopping.  With the second hit my brain also seemed to pulsate with this weird energy.  The third hit did nothing extra so I stopped and passed the pipe.  I became extremely disoriented and couldnt focus on the words that people were saying. I managed 'Whoa, I'm fucked!' or something like that, and kinda swayed in my chair for some time waiting for additional effects to kick in.  The ambient feeling of well being of my coke high seemed to increase by quite a bit, and stayed like that even after the weird pulsing ended.</p><p>I sustained this feeling the best I could by doing more rails.  Unfortunately I ran out of coke.  So obviously I didn't get a chance to experience the infamous and immediate crack burnout. In fact, it seems I experienced the opposite.  Although I've been out of coke for hours now, I am still feeling quite happy albeit dizzy. My desire for more of the stuff is stronger than usual, which is no problem to ignore while I write this. At some point in time after I ran out I also had a vomiting fit. This is abnormal for me, but I'm not used to the low quality of cocaine that I had this night. It was undoubtedly something in the cut that caused this, since people who had the very same stuff, who didnt turn it into crack also suffered from this vomiting when they ran out.</p><p>My experience with crack is, therefore, a good one. I won't do it again however. Like I said, I prefer to snort it.</p>",
 "year": "2004",
 "id": "35363",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-17T08:00:00.000Z",
 "views": "8413",
 "dose": {}
}
