{
 "title": "Nothing but Darkness",
 "author": "Overtripped",
 "citation": " Overtripped. \"Nothing but Darkness: experience with Zolpidem (Ambien) (ID 35411)\". Erowid.org. Jan 9, 2007. erowid.org/exp/35411",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "135 lb",
 "report": "<p>My first year in high school. That's when life really started taking a toll on me. I was struggling with depression, and prescribed antidepressants such as effexor and welbutrin. I was also prescribed Ambien. At the time it was just a harmless sleeping pill to keep me sane. Eventually I attempted not going to sleep after taking the pill, and that is when I first experienced the trip. Over time I abused Ambien more and more, thinking how crazy it was to feel like this from a prescribed medicine. At this point, there wasn't really any problems with my abusing the drug.</p><p>Eventually my depression worsened. I had one of those plastic containers where you keep your pills for every day of the week. I saved up god knows how many pills in that thing. I came into school one day. I felt like a zombie. I couldn't think, couldn't talk. All I wanted to do was die. And here is where my journey began...</p><p>At lunch I took out my pills. And started popping them one at a time. I started with ambien, I took maybe 5 or more of the 10 or 15mg pills. Then I took effexor, welbutrin, concerta, and advil. The Ambien kicked in, I found myself out of control of my body. I kept taking pills and didn't even know it. Finally, one of my friends took away my pills and knew something wasn't right.</p><p>It was time to leave the cafeteria and I was gone. My friend told me I started singing a song that another friend of mine made up. I got into the hallway, I couldn't walk. Two guys were holding me, keeping me standing. They wanted to bring me to the nurse because they knew I was freaking out. But all I would say is 'I'm fine, I'm fine! Just let me go to class' So they led me to the stairs, I took one step and fell flat on my face. It became more evident to them that this wasn't just some ordinary trip.</p><p>The next thing I remember is being in a small closed off room. All I saw was darkness. I saw one of my friends faces, staring in at me. It scared me. Then in the darkness I saw the face of my nurse, she asked me what I had taken. I tried to make out the words through my mumbling. I then remember walking outside my school into an ambulence. The workers in the ambulence didn't think anything was too bad cuz I could walk, and I was sitting upright. So they were smiling. But no one had any idea what was going on in my head. It seemed like the word 'suicide' was surrounding me. I heard it, I saw it, it was in me.</p><p>I don't remember entering the hospital, I just remember being in a bed in a small room. Out of my right hand was a tube connected to an IV. By now my parents were with me, or maybe just my mom. Quite honestly I don't remember. They kept saying they loved me. After laying in that bed for what felt like hours, two psychiatrists entered my room. I don't remember everything I told them. But I think I let out my drug use patterns. They started making me feel like shit about myself. Thinking I was one of those girls depressed about my body image or some shit.</p><p>I don't remember going home, but I remember being home. I layed on the couch. I can't even explain how I felt. I puked, but all that came out was a little water, I hadn't eaten anything.</p><p>Until this day, I cannot think about Ambien, or that experience without shaking. I became so addicted to the drug that I just thought would help me sleep. I honestly only have flashes of what happened that day, the Ambien caused some pretty bad amnesia. Most of what I know was told to me by my two friends that helped me survive. I miss Ambien, I guess that's why I've moved onto harder drugs.</p>",
 "year": "2004",
 "id": "35411",
 "gender": "Female",
 "timestamp": "2007-01-09T08:00:00.000Z",
 "views": "33509",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ]
}
