{
 "title": "Trip to the Hospital",
 "author": "j3NNa",
 "citation": " j3NNa. \"Trip to the Hospital: experience with Alcohol (ID 35419)\". Erowid.org. Sep 16, 2005. erowid.org/exp/35419",
 "substance": "Alcohol",
 "bodyweight": "120 lb",
 "report": "<p>I'll try to make this report as short as possible, mainly because I don't enjoy writing too much. It started out on a Friday night, and I was visiting my hometown on vacation. I was with my best friend Chelsea, and made plans to go to our 'friend' Jason's house to drink. We told her parents we were simply going to go shopping at the mall and be back by nine, for her parents are quit strict, and by this time it was already around 6.</p><p>We waited for Jason at the mall to pick us up, which consumed enough of our short time. We finally arrived to his place, and he poured us some drinks of straight whiskey. Then, I had never had a hangover or felt sick after drinking. I proceeded to drink, rather fast, consuming about 3 tall glasses of the whiskey. By then, I was pretty out of it. The last moment I remember was when I grabbed a bottle of red wine from Jason and had a few swigs from it. It all went down hill from there...</p><p>Apparently I stumbled my way to Jason's room, and fell immediately to his bed. He came to see how I was doing, and I told him I was going to puke. He quickly ran to the bathroom to get a garbage, but I had already thrown up all over his 600 dollar bed, which was actually his grandpa's. Furiously, he brought me to the bathroom. By then I had passed out, and was laying on the cold floor. I could hear Chelsea crying and telling to me get up, but I simply couldn't, I just couldn't move! She proceeded in attempting to pick me up, but I came crashing head first onto the bathtub. I was covered in throwup, as well as the bathroom floor and carpet. By then my 'friend' Jason was fed up, and started screaming horrible things to Chelsea, and finally kicking us out of his house. He realized there was no way Chelsea could carry me, so he helped carry me and got a cab (which he payed for with the money he stole from my purse, around $70).</p><p>While in the cab, Chelsea struggled putting my filthy clothes back on. We arrived back at the mall, where Chelsea called her parents and told them to pick us up (I was still passed out). They finally arrived, and freaked out when they saw me. They rushed home and immediately called an ambulance (which I thought was totally unnecessary when I first was told). Chelsea was still crying haaard; my lips by then had turned blue, my face completely white, she thought I was dying, or even dead! The paramedics placed me on the floor, and squeezed verrrry hard somewhere on my shoulder, which for a split second brought me back screaming and telling them to stop, then I was gone again. As I opened my eyes, I realized I was in a hospital, laying on a bed. I looked around the room to find Chelsea, her parents, and my brothers staring at me, in disappointment. I was still rather drunk then, and very confused. I was crying hysterically, laying in my own vomit, asking myself soo many questions. I continuously kept crying out my oldest brother's name, I didn't want to be alone. I looked at the clock, it read 3am. Shiit, I passed out for 6 hours.</p><p>There's no feeling I could describe the way I felt about myself. I was ashamed of myself. I never thought shit like this could happen to me, I'd never had any problems drinking. I was very anxious to leave this damn hospital, but I was told to take a piss test. Apparently when I was still passed out, Chelsea freaked and told them some bullshit story which made it sound like I was drugged. I came clean and told the truth though.</p><p>Well that night I learned alot. I remember constantly telling myself that I'd NEVER drink again. A couple weeks later there I  was, getting shit-faced at a party. But I never touched whiskey again! It scares me though, knowing I could have easily died, my BAC was .44 ! I felt hung over for the next 2 days too, throwing up bile because I had nothing left in my stomach, which messed up my throat for a while. I drank waaaaay too fast that night and learnt the hard way. </p><p>Have fun but be careful!!</p><p>Ooh yeah, the ambulance ride costed me $500 :S</p>",
 "year": "2002",
 "id": "35419",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-09-16T07:00:00.000Z",
 "views": "8010",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 }
}
