{
 "title": "Five-year User",
 "author": "JaneDope",
 "citation": " JaneDope. \"Five-year User: experience with Methadone (ID 35432)\". Erowid.org. Jan 16, 2007. erowid.org/exp/35432",
 "substance": "Methadone",
 "bodyweight": "225 lb",
 "report": "<p>I began taking Methadone about 5 years ago after becoming addicted to the other usual opiates out there, i.e Vicoden, OC's etc. I had a back problem, so it wasn't hard to get any of the aforementioned drugs, and I did them in copius quantities. My family doctor them prescribed me Methadone. I must interject and say that despite what other ppl have written on here concerning the dosages, Methadone only comes in 3 strengths: 5mg tabs, 10mg tabs or 40 Mg tabs. Liquid Methadone is only given in a clinic setting.</p><p>I started out w/10mg, 2 x day (that's what I was prescribed anyhow) The first few days I followed that to the letter, since I was new to Methadone and was afraid to do more. All I felt was tired, and it pissed me off, so I did a little reading up on the stuff, and after a couple of weeks, decided to up my dose to 30mg. I agree w/the writer who said it is a nice, floaty, dreamy high. It doesn't hit fast like heroin does (I've never done H, but from what I read, it hits fast if you inject it), but it lasts a LONG time. At the end of my active addiction, I was taking 300mg at a pop and getting loaded and staying loaded all day. The good and bad thing about Methadone is that is has a very long half-life, so I can go 3 days without any before getting dopesick. The bad part of this is that the withdrawals from Methadone are something that I cannot even begin to describe. I would rather DIE than go thru it again. All I could do was sit on the bathroom floor and rock and rock and rock, I was sweating buckets, throwing up, my skin felt like I had bathed in Icy Hot. It was freeking AWFUL, and that was when I kicked off of only 50 mg/day.</p><p>I went to rehab in March and they now use Buprenex/Buprenorphine for detox, and it sucks ass. It really does not help much, other than preventing seizures. The rest of the shit I felt. So, now I go to a Clinic and my dose is 100 mg/day, and this amount, even though I have been on it for a long time still gives me a very slight buzz. Nothing to write home about, but a slight buzz is better than no buzz. When I get my take-homes, I will take 2 doses, and that's enough for me. I would not recommend using Methadone recreationally for anyone, unless they're a hard-core heroin user and even then, starting REALLLLLLYYY Slowly. I've heard of ppl being sensitive to methadone and having to be rushed to the hospital for an OD on as little as 30 mg. Especially if they are thin and have a low tolerance for anything. After having developed a toleranceI could kick the buzz up a notch, by taking a very small quantity of Xanax or Valium. For whatever reason, that intensifies the high and believe it or not, so does the antibiotic Biaxin.</p>",
 "year": "2004",
 "id": "35432",
 "gender": "Female",
 "timestamp": "2007-01-16T08:00:00.000Z",
 "views": "12926",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Methadone",
   "form": "(daily)"
  }
 }
}
