{
 "title": "Runner's Ally",
 "author": "Galen",
 "citation": " Galen. \"Runner's Ally: experience with Datura (ID 35431)\". Erowid.org. Jul 27, 2004. erowid.org/exp/35431",
 "substance": "Datura",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1.5 leaves",
   "oral",
   "Datura",
   "(leaves)"
  ]
 ],
 "report": "<p>I have had a large Datura plant for several years and although the plant came close to dying from various 'plagues', such as spider mites, leaf fungus, dehydration, overhydration, etc., she is very strong, simply revives herself and refuses to die.</p><p>Well, I had read some of the experiences and warnings regarding this plant, but the temptation to experiment with her was too strong to resist.</p><p>I try to run every day, as it is the cheapest and fastest way to stay in shape, but do get a little fatigued, especially after working a full day and getting up around 4:30 am every morning.</p><p>I had heard that Datura had a 'woman' hidden inside of it, just waiting for a worthy opponent to compete with, for the run to the death. Reputation has it that 'If she wins, you die; if you win, you gain knowledge and power'.</p><p>Well, I was very conservative and decided to chew only 2 small leaves, which I chewed very slowly (around 10 min) to let the juices penetrate the area under the tongue. I then washed the rest of it down with a bottle of Ice Beer. I figured the alcohol would act as an extract and give the chemicals a boost (like a catalyst).</p><p>The effect was perfect; not only could I run effortlessly, but my vision also improved and I could see like an Eagle. Also, one time during the past winter, after chewing a medium leave (not too big), I was able to sprint so fast, that even though the snow was soft and at least a foot deep, I did not fall through, but managed to run over the top of a large field until I reached the back woods (about 1/2 mile).</p><p>I am not sure what the runs would be like after chewing some of the more potent seeds, but by using the leaves in moderation, my runs have definitely become much easier and interesting...</p>",
 "year": "2004",
 "id": "35431",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-07-27T07:00:00.000Z",
 "views": "19321"
}
