{
 "title": "What a Long, Strange Trip ... Indeed",
 "author": "Enigma0100",
 "citation": " Enigma0100. \"What a Long, Strange Trip ... Indeed: experience with 5-MeO-AMT (ID 35448)\". Erowid.org. May 1, 2009. erowid.org/exp/35448",
 "substance": "5-MeO-AMT",
 "bodyweight": "258 lb",
 "report": "<p>I woke up bright and early that Friday morning, around 8:30.  It was my day off and I had nothing to do but prepare physically and mentally for the evening.  I'd eaten nothing for about twelve hours, and I was energized from a slight DXM afterglow from the evening before.  I passed the morning by focusing on my mental state and the events that were going to occur in the evening - myself and two good buddies were going to the Dead concert, and we would all be on different substances.  My long time friend, M, had a good 150 mg of DPT waiting for him, and my other buddy, J, was going to injest some 4-HO-DET.  Myself, I was going to test-drive my order of 5-MeO-AMT.  I had read about the pitfalls and potential dangers, and I was ready.  Around noon, I prepared my dose by dumping the 100 mg powder I had into 100 ml of Bacardi Limon.  Now, I had a 1mg/1ml solution, and with the help of a Robitussin dosage cap, I could meter out my desired dose.</p><p>At 4:20 pm, I swallowed 15ml of rum and headed to J's place, not 5 miles away.  By the time I parked, I could already feel a slight buzz, not unlike my past tryptamine adventures.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] Unfortunately, this buzz was accompanied by a queasiness in my stomach.  Now, in the past, I had been able to quell tryptamine nausea with my mind, but after a few minutes, I knew I would have to head to the bathroom.  Sure enough, As soon as I got to the bathroom, I violently hurled into the toilet.  Immediately, I felt somewhat better, but as I began walking out of the bathroom, I instantly needed to vomit again.  At this time, I began to worry slightly, but I reassured myself after my second puking episode by thinking, well, it sometimes happens, but it's all downhill from here.  Sure enough, I could 'feel' the substance overtake my serotonin receptors, and I couldn't help but begin to grin stupidly.</p><p>Fast forward thirty minutes.  Both M and J have dosed, and M is not handling the oncoming DPT experience very well.  Sure enough, when we join the line to enter the concert venue, he turns to me and says, 'Dude, I think I'm freaking out... I think-', and suddenly vomits.  Just as two cops are passing by.  Now, I could tell vaguely what his next two hours were going to be like, as I have had high-dose DPT trips before.  I told J and his lady friend that M and I were going to lay on the grass for awhile, and we would meet them inside.  I laid there while I watched over my friend, who could say nothing but, 'Dude.... duuuude?  I am tripping out.... dude...'  over and over for an hour and a half.  Well, obviously, this got me a bit anxious and worried about my friend's welfare.  Many people came by and said, 'Is he OK?'  I did my best to quell their fears and try to guide my friend at the same time, 'try' being the operative word.  Eventually, he fished out the Dead ticket from his pocket and said, 'Dead?'  Thinking he said 'THE Dead', as in, we're going to see the Dead?, I said, 'Yeah, man.'  Now, I only found this out after he came down:  Apparently at this time, he thought that he had died, and my words confirmed his delusion.  Woops, my bad.  Not a good way to calm your tripping buddy down.  Soon after this, security came by and told us we had to enter the venue or leave.  Finally, M was able to think and talk somewhat coherently, so I herded him and myself through the gates, neither of us talking to any of the gate security.  We found our buddy and his woman and sat down.</p><p>Now at this point, my memory begins to get a little fuzzy.  I remember laying on the grass and watching the clouds do a 3-dimensional dance above me, to the rhythm of the music.  I remember talking to two girls with lighted Koosh balls.  I remember getting lost in the middle of a large group of dancing hippies.  I remember laughing my ass off with J, who was still tripping hard by the intermission (unlike M, who was more or less baseline at that time).  Throughout the whole concert, I had a persistent feeling of peace and total communion, due in part to the setting (Dead fans are quite cool and peace-loving), and this feeling made the grin on my face even bigger.  When I conversed with people, talking and forming thoughts was surprisingly easy, unlike my past experiences with DPT and 4-HO-DET.  I ordered a frozen strawberry lemonade, and found that money transaction were rather easy as well.  Bonus!</p><p>Long story short, we left the concert early, much to my chagrin.  Returning to J's place, we ate some jalapeno poppers (my first food in 24+ hours) and watched Cowboy Bebop: the Movie.  After the movie, M left, and J retired to his room to copulate with his girl.  Thinking I may still have some 'up time', I did a quick time check.  It was 2 am (T+9h) and I was still feeling the effects quite strongly!  Thankfully, I had nothing to do the next day, so I entertained myself by watching a Dave Matthews concert, Kill Bill Vol. 1, and most of the Tenacious D DVD Disc 1.  By the end of the D, it was a little after 6 am, and I was able to begin to fall asleep.  But this sleep was no normal slumber.  As I drifted, my thoughts began to manifest themselves in auditory and visual distortions, not unlike my dreams after taking 6 mg of melatonin.  I did eventually fall into a shallow sleep for 4 hours, after which I drove home and slept for another 3.  When I woke up at 3:30 pm, I felt nothing out of the ordinary, but my vision still strobed a wee bit.</p><p>All in all, I am quite impressed with this substance.  The only downside was the nausea, but it was very slight and was gone by the 2 hour mark.  I experienced none of the headaches that others have complained about.  My hypothesis is that those headaches are induced by dehydration, so I drank a LOT of water between the 10 and 14 hour mark.  I have no real idea if that is a fact or not, but I know this: I drank a ton of water and experienced no head pain.  I am looking forward to more experiences with my little bottle of electric rum in the near future.</p>",
 "year": "2004",
 "id": "35448",
 "gender": "Male",
 "timestamp": "2009-05-01T07:00:00.000Z",
 "views": "4646",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "(liquid)"
  }
 ]
}
