{
 "title": "Nicotine's Slave No More Thanks to a Trip",
 "author": "Damien",
 "citation": " Damien. \"Nicotine's Slave No More Thanks to a Trip: experience with Tobacco, Mushrooms, LSD & Cannabis (ID 35459)\". Erowid.org. Jan 16, 2007. erowid.org/exp/35459",
 "substance": "Tobacco, Mushrooms, LSD & Cannabis",
 "bodyweight": "160 lb",
 "report": "<p>I've been smoking cigs for about 3 years now, and it started out as something that was secret and hidden, something i enjoyed in a park. I used to get a huge buzz, but never told anyone about it.  As a matter of fact, i basically broke up with my girlfriend because she smoked.</p><p>Skip ahead 2 years to my sophomore year at college.  I was living in an apartment like dorm, with a fire escape I could smoke on whenever I so desired.  My consumption went way up in the fall and winter, up to around maybe a third of a pack a day.  I really enjoyed it, and it became part of what I did.  A cigarette and coffee to start the day. </p><p>This same year I had been smoking a lot of pot and doing mushrooms not infrequently (something i still greatly enjoy).  Well, due to my living situation, I smoked pot in my room often, eventually getting busted by the University Police, which ultimately resulted in my getting kicked out of housing.  My smoking consumption shot up, to at the very least half a pack a day, if not more. The stress I was under was intense.  It was around then that i first became aware of being completely physically dependent on them, getting headaches, and crankiness when I didn't have a cig. </p><p>On my friends birthday (skipping ahead a few months, after I had moved out of housing and back home), we went up to the ocean to play drums and guitars on the beach.  I literally couldn't smell the ocean.  After that day, I didn't have a cigarette for 2 months, until I started court ordered community service.  The university had pressed charges against me, and I wound up with 120 hours to complete.  On the way to the first session, the intensity of what I was doing hit me, and I had to pull over into the first gas station to buy a pack. </p><p>This then led to a 3 month stretch where I would quit intermittently, say 'This is my last pack, I swear', and then the next day buy one.  I kept making deadlines for myself, then not keeping them.</p><p>This gets us up to the point I was at when I tried acid for the first time. Going through nearly a whole pack of cigarettes that day I enjoyed intensely, craving them quite frequently throughout the day.  This experience was not the end of my weekend however, for the next day would yield something quite different.</p><p>I woke up at dawn at my friend S's house, and we proceeded to eat a whole pile of mushrooms, at least 4 grams each.  That morning has changed my life forever.  I lost myself in emotion, nature, and love.  The experience I will eventually chronicle, but it is still too soon afterwards to fully explain.  For the rest of the day I was tripping, almost a full 9 hours.  Afterwards, I went canoeing and drank a few beers.  Still smoking cigarettes.</p><p>The next morning, I woke up, saw the pack in my pocket, and quite simply, had absolutely no feeling about them either way.  I did not want to smoke them, I didn't really care about them at all.  Throwing them out, I realized that my life changing experience had sunk in overnight, and that cigarettes were not something my life needed. </p><p>I share this story in the hopes that other people trying to quit tobacco can similarly use psychedelics to realize what truly matters to them, and can jettison habits that have dogged them for a long time.  Mushrooms have changed my life irrevocably over the years, always for the best.</p><p>Paz.</p>",
 "year": "2004",
 "id": "35459",
 "gender": "Male",
 "timestamp": "2007-01-16T08:00:00.000Z",
 "views": "19924",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  },
  {
   "time": "",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ]
}
