{
 "title": "Have A Nice Day",
 "author": "Nice Guy",
 "citation": " Nice Guy. \"Have A Nice Day: experience with MDMA (Ecstacy) (ID 35464)\". Erowid.org. Jan 14, 2007. erowid.org/exp/35464",
 "substance": "MDMA (Ecstacy)",
 "bodyweight": "155 lb",
 "report": "<p>My experiance with drugs is limited to Marijuana and a variation of over the counter pills.  I used to smoke pot on a regular basis to the extent of retardedness, but after time I realised that it was time to move on, to enter the 'gateway' so to speak and try new drugs.  My girlfriend 'R' and I, went raving on a Friday night in Hartford, we prepared beforehand by eating fruit and drinking gatorade.</p><p>We asked about 30 people or so before we managed to find only 1 pill from a guy who was rolling balls at around 12 midnight.  So I split the tab of E with my teeth and gave the other half to my girlfriend.  Half an hour later there was really not much of an effect and I honestly thought we got gipped, so we sat down on a couch to rest from dancing and another guy sat down next to us, I asked him if he had a tab and he said  yes.  So I split that one as well with 'R'.  Both tabs we ate were about the size of birth control, about half a centimeter in diameter and plain white. </p><p>Twenty minutes later or so I suddenly felt a strong urge to move my body, so I took 'R' by the hand and stood up and started dancing to DJ Pleasurehead.  By this time I couldn't stop moving and let me tell you, I am far from a dancer.  In fact I've never really danced openly like this in my life.  All my fears and pressure that I had felt earlier while dancing, e.g. noticing how goofy I looked dancing to this techno, melted away.  I couldn't have given a rats ass if I was dancing like this in front of 1,000 people.  I was all over the place and the bass from the music went right thru me, it was greatly intensified and actually beautified.  The music was beautiful.  It was an audio-orgasm in my mind.  After a solid 45 minutes of dancing I realized that we needed water, so I bought a bottle for $2 and we drank from that (I kept refilling it).  Needing a break from this ecstatic dancing, we sat on the couches.</p><p>I observed my surroundings to notice that the majority of the people had passifiers in their mouths.  Everyone on the couches was rubbing each other, giving massages, rubbing each other's hair, making out, dry humping.  It was really cool, and I was part of the experiance.  'R' kept running away from the couch to sit in this old fashioned telephone booth in the corner of the room because the cold walls felt wonderful on her exposed back and arms.  I was instantly making friends with everyone, I would go up to people and people would come up to me and hug me and introduce themselves with a handshake and a smile.  I got engaged with 'R' in a 'pass the balloon around' circle which lasted a good 20 minutes or so.  It was real fun, it was a wonderful social bond with complete strangers.</p><p>We got up to dance again and I noticed a guy with a pacifier in his mouth and a different color glowstick on each finger, he was waving them around and it was an unbelievable site.  The colors left trails and were intensified beautifully.  Another guy came up to me with a big rubber thing:  he put it in my mouth and I bit down on it.  The bass from the techno vibrated thru the rubber item into my teeth.  If this wasn't ecstacy I don't know what is.  On top of that he blew Vicks Nasal Spray into my eyes.  Now most sober, normal people would view this as odd, but it was a wonderful feeling.  Feeling is intensified so greatly it is actually unexplainable, so I am doing the best I can to tell you how it really was.</p><p>Touching was an experiance in itself.  'R' was wearing a silk skirt and the feeling of the soft silk on my hands was a shock, it was the softest thing I've ever felt.  I also had a water bottle that I kept in my hands at all time, because when I re-filled it with the cold water, the cold plastic might have been the best thing I've ever felt.  In fact a lot of the ravers did the same thing and due to the constant squeezing and rolling in your hands of the water bottle, everyones bottles were crushed beyond recognition!</p><p>Later we went upstairs to another room with another DJ in it and there was a gigantic fan, I'm talking 5 feet in diameter gigantic.  With the sweat dripping down my face, dancing in front of this fan was an experiance in itself.  It was like dancing in a wonderful cold wet shower of wind after a excruciating workout.  'R' and I danced to a 'White Wedding' remix by Billy Idol next to the fan. </p><p>At one point, I was starting to come down REAL hard, I was getting depression and feelings of exhaustion.  I felt terrible.  So I went into the bathroom and splashed cold water on my face.  Then put menthol chapstick on my lips.  This brought my high right back up to the top again. And I felt great, and even started dancing again!</p><p>At around 4:00 in the morning, 4 hours after we took the pills, we were still rolling hard.  'R' and I were taking a breather in the hallway next to the guys restroom on these dirty wet stairs.  Normally people would be kinda grossed out by the condition of this area but it had a wonderful beautiful glow so we didn't care.  Guys were constantly coming in to go pee and when they saw us they'd give us the biggest smiles I've ever seen and wave.  Some guys even came over and sat with us and talked to us.  Let me tell you- there are NO limits when it comes to conversation.  People are pouring their hearts out about anything and everything to you.  And we did the same.  Everyone that came up to us gave us a hug and we gave everyone hugs too.  Some people even kissed us! </p><p>At around 4:30, near closing time these two gay guys came into the bathroom and then walked over to where we were sitting.  Now I'll be honest, I really DIDN'T like gay people, but with my opinions of everything and everyone down the drain I thought they were the coolest people I've ever met!  We talked for a while about how long they'd been together, then how long 'R' and I have been together like we were best friends, we talked till 5 in the morning then the place was closing so we had to leave.</p><p>At the end, everyone started exchanging numbers so I got about 3 people's numbers who I had hung out with thruout the night.  Then the gay couple asked us if we'd like to go get coffee with them!  Normally I would be like, that's enough, go away now.  But instead I insisted we did go!  So we drove a bit to a nice diner that was open at that time.  And we talked for a good hour and a half about EVERYTHING.  They have to be some of the coolest people I've ever met.  We decided to walk back to 'R's house from the diner and it was a very nice walk.  By then we had come down from the extreme rolling part but everything we looked at had a wonderful nice optimistic glow to it.  We were in heaven still.</p><p>I still contact 3 of the 4 people I met at that rave including the gay couple and raving is something I will DEFINITELY do again.  I'll admit it, it was the best experiance of my life.  Nothing can top it, ever.</p><p>There were a few bad things though, associated with this drug.  I overexerted myself so much from dancing that I had massive trouble walking for 4 days after because my legs were SO sore.  I had trouble sleeping for about 3 days after the rave.  I crave it ridiculously even a week and a half later.  Which is why I'm kinda glad I can't find it. IT IS ADDICTING.  And somehow I spent about $100 when I had only planned on spending about $70.</p><p>The good things associated with this drug are:</p><p>1. The emotional bonding I had with 'R' has made me fallen in love with her even more, and I can now understand some things about her I didn't previously.</p><p>2. Sex has actually gotten better.</p><p>3. I made excellent friends.</p><p>4. It's dissolved my hatred towards homosexuals.</p><p>5. Overall I think it's made me a better person.</p>",
 "year": "2004",
 "id": "35464",
 "gender": "Male",
 "timestamp": "2007-01-14T08:00:00.000Z",
 "views": "31247",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
