{
 "title": "Mild Body Trip, No Visuals",
 "author": "F",
 "citation": " F. \"Mild Body Trip, No Visuals: experience with Venlafaxine (Effexor) & LSD (ID 35488)\". Erowid.org. Oct 6, 2004. erowid.org/exp/35488",
 "substance": "Venlafaxine (Effexor) & LSD",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "112.5 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)",
   "",
   " ",
   "oral",
   "LSD",
   ""
  ]
 ],
 "report": "<p>I've been taking Effexor extended release (Venlafaxine) for almost a year now for treatment of depression, currently 112.5mg/day.  Prior to being on effexor, I had tripped many times with LSD and with mushrooms (psilocybes).  Since starting on effexor, I have found that the effects of shrooms, and especially acid, are greatly diminished in comparison to similar doses when not on effexor.  Friends who I regularly tripped with were having a great time, saying this was the best acid that had come around in a while, and I was barely feeling anything.  The best way I can describe it is this: the trips started, but never got off the ground.  About an hour or so after eating a few hits, i started to get the typical body energy thing that usually escalated into full-on trip, but the trip never came.  I basically had a mild body trip for a few hours but there were no visuals (other than maybe some mild peripheral tracers) and worst of all, there was no head trip whatsoever.  So I felt like i was tripping physically for a few hours and couldn't sleep, but my state of mind was absolutely sober. </p><p>This has been my experience each time I have tried acid or mushrooms since being on effexor.  Not necessarily a reason to go off of an anti-depressant, but certainly a very unfortunate side-effect.  I've seen some other similar accounts with effexor and other ssri's and psychedelics, but I just thought I'd add mine.</p><p>-Be safe, Be wise.  Know yourself, Know your drugs.</p>",
 "year": "2004",
 "id": "35488",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-10-06T07:00:00.000Z",
 "views": "15358",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "112.5 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 ]
}
