{
 "title": "Careful With That, Eugene",
 "author": "PillBoxHat",
 "citation": " PillBoxHat. \"Careful With That, Eugene: experience with 2C-E (ID 35535)\". Erowid.org. Jul 31, 2004. erowid.org/exp/35535",
 "substance": "2C-E",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  "15 mg",
  "oral",
  "2C-E",
  "(liquid)"
 ],
 "report": "<p>My previous experience with psychedelics has been fairly broad but in recent years infrequent: LSD, mushrooms, San Pedro, morning glory seeds. Additionally I am a fairly regular cannabis user. I became interested in trying 2C-E after reading reports about its effects and obtained a half gram. I decided to start with the dosage recommended by other users, and estimated the amount by using a dividing method from the entire quantity, and added the quantity to a bottle of water. I decided to drink the mixture the next morning.</p><p>I thought that the most essential preparation was making sure that I had nothing to do that day. After waking up, I drank a cup of coffee and no breakfast, then drank the mixture at around 11 am. Looking back, I probably should have skipped the coffee and instead had something light to eat.</p><p>About 30 minutes later I began to feel some signs that the substance was coming on. I began to feel some discomfort and nausea, which I was prepared for. Over the next 15 minutes, the discomfort intensified and I began to get hot and sweaty (it was a very hot day, also, which didn't help). After 45 minutes, I was sitting by the bathroom, ready to vomit, and vomit I did. It was akin to food poisoning sickness. Afterward I felt some relief, but not for long. I tried to drink some juice, which came back up in another 15 minutes. I continued to feel sick for another 30 minutes or so. However, while feeling sick I was acutely aware of tripping harder than I had in a long time. After getting over the primary physical discomfort, I tried to hang out outside with my girlfriend and take in the scenery. Having someone to talk with helped immensely. Although I felt very high, I was fairly clear-headed and more or less articulate. The substance was surprisingly visual. Many of my LSD and mushroom trips are completely without visuals, more in the head. This was the opposite.</p><p>During the first few hours, I was extremely wiry and twitchy, like amphetamines, but pushed slightly over the edge, and my girlfriend told me that I looked like I was in the throes of a battle with Tourettes. I could control my gross motor functions if I concentrated, but if I wasn't, i would make broad, involuntary movements with my legs and arms.</p><p>We came inside and watched some TV. She turned on old episodes of Resue 911. It was horrifying! I wasn't in a state of fear, but rather shocked by how grotesque the people on the show looked. Their faces were distorted and simian. After this, we played a game of Scrabble. This was wonderful: I was enthralled by the way the woodgrain of the playing pieces glowed and vibrated. Also, I was happy to find that my ability to put words together and find connections in the serendipitous coincidence of words that had been made was intact: it was like a poetic machine turning out beautiful phrases.</p><p>After about 6 hours, I felt normal again, though still a bit wiry and with other trace effects. The next morning, I felt normal: no hangover to speak of.</p><p>All in all, this was fun after the initial puke-fest. I would consider trying this again, taking better precautions, and would advise any considering taking 2C-E to do the same.</p>",
 "year": "2004",
 "id": "35535",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-31T07:00:00.000Z",
 "views": "8877",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(liquid)"
  }
 }
}
