{
 "id": 3553,
 "title": "Let's See",
 "date": {
  "submission": "2003-02-19T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FlowGnome",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "17",
    "grams": 0.017
   },
   "administration": "oral",
   "substance": "2C-I"
  }
 ],
 "report": [
  "I recently received a package of 2C-I. ",
  "10:15PM - Ingested 17mg of 2C-I dissolved in orange juice on an empty stomach with a friend, A.  She took the same amount.  Conversation is carrying on between us about views on various things, as we haven't talked a whole lot before. ",
  "10:45PM - First alert.  A sort of weird feeling in the jaw and some minor visual disturbances. ",
  "11:00PM - Visual distortions have increased greatly, and finishing a sentence seems about impossible.  We try to draw, but find no desire to do much but watch the color.  Somewhat relaxing at this point. ",
  "12:00PM - Decided to talk a walk.  I was having trouble identifying ice on the ground because of strong visuals.  It was very cold and windy out, and visuals would almost blind me when wind blew directly at my face.  It almost seemed as though the wind had become solid.  The body buzz at this point felt very nice, sort of a warm, friendly feeling. ",
  "12:30PM - Return home, put music on, and warm up.  Sit around listening to music and smoking for a while.  Neither of us really has much to say.",
  "2:00PM - Sudden drop in intensity, and conversation resumes.   This substance is very smooth compared to most everything else I've tried.  None of the drawn out comedowns of 2C-T-2 or 7, and none of the side effects I associate with those or acid.  Just good clean fun for exactly the right amount of time.  Talked for a good 2 hours, then finally decided it was time to find some alcohol.  We ended up at a nice hippy gathering and had a few beers, then finally went home and crashed. ",
  "All in all a wonderful substance.  The closed eye visuals were some of the most amazing I've had, with complicated rainbow colored gear-like patterns dominating, as well as some of the persian carpet pattering referred to.  (ah, the power of suggestion)  Open eye visuals got fairly intense, comparable to 5 hits of acid or so for me, at least, but with a stronger distortion of objects and visual perception.  Although I don't really trip much anymore, this one is definitely a keeper."
 ],
 "erowid": {
  "id": "21438",
  "citation": " Flow Gnome. \"Let's See: experience with 2C-I (ID 21438)\". Erowid.org. Feb 19, 2003. erowid.org/exp/21438",
  "substance": "2C-I",
  "views": "11081"
 }
}
