{
 "title": "Cityscape of a Dreamland",
 "author": "Christ Sinister",
 "citation": " Christ Sinister. \"Cityscape of a Dreamland: experience with Melatonin (ID 35576)\". Erowid.org. Jun 21, 2007. erowid.org/exp/35576",
 "substance": "Melatonin",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>The beginning of my experimentation with melatonin began one night after visiting a friend who was already taking it.  After hearing about his wild escapades he enthusiastically dumped about six 5mg pills in my hand, laughed, then dumped out another two.  I gulped them down went home and went to bed. </p><p>Sure enough later that night the melatonin struck.  I was standing on the rooftop of some building staring out over this animated looking cityscape under this ominous sky.  The color of the sky was fading from black to orangish, reddish, turquoise looking sunset type setting.  The vividness of this scene foreshadowed what came next. </p><p>All of a sudden this multidimensional object came barreling over the horizon, it was ablaze in all its technicolor mutational strangeness, lights shooting out of it, with all the detail of a rapidly changing ivory carving.  The type of thing I basically see on DMT.  Needless to say I went bonkers, I started jumping up and down screaming in excitement to the guy next to me, 'holy shit this is the melatonin dream, this is the melatonin dream' like he's going to remind me of it after I'm awake failing to make the connection that he's also in the dream.  I woke up after this and couldn't believe it, I also couldn't believe that I could walk into any store and just buy a bottle, which is exactly what I did.</p><p>Melatonin dreams would happen somewhat inconsistently, maybe a few times a week, as far as I know anyway. Amazingly I caught on to the fact when its happening and even began to experiment around in my dreams and test the waters.  I've never had reoccurring dreams before in my life until taking melatonin.  One theme that continued to pop up was height and water, in one strange form or another I would always end up falling/flying off of one and end up in the other.  Lots of flying and astral projecting within these realms, really amazing shit. </p><p>And the other part was nightmares, not just any nightmares but really freaky other dimensional stuff, but I found that if I stuck with it I started to confront my fears in these realms and actually get quite cocky at times with the way that I handled these situations.</p>",
 "year": "2004",
 "id": "35576",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "15576",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 ]
}
