{
 "title": "Theory & Experience",
 "author": "Marcious",
 "citation": " Marcious. \"Theory & Experience: experience with Salvia divinorum (leaves & extract) (ID 35592)\". Erowid.org. Jun 1, 2007. erowid.org/exp/35592",
 "substance": "Salvia divinorum (leaves & extract)",
 "bodyweight": "295 lb",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Salvia divinorum",
  "(leaves)",
  "",
  " repeated",
  "smoked",
  "Salvia divinorum",
  "(extract)"
 ],
 "report": "<p>Preface</p><p>I am a male 295lbs, currently taking Zyprexa, Zoloft, & Zanex.  When Salvia Divinorum is used, the human perception is opened up to one or more alternate dimensions. More than likely these dimensions occupy the same space. This theory has been discussed by many people. This is what I have picked up. This theory is dependent on the existence of a fourth dimension, geometrically speaking, for lack of a better term.</p><p>Look at your own shadow on a wall. Imagine the surface of the wall is a 2-dimensional world. Remember Flatland? Now place your hand in front of your body. In the 2-dimensional world (the surface of the wall) it would appear that two separate objects (your body and your hand) are occupying the same space. Clearly, in our 3-dimensional world, they are not occupying the same space, a 3rd dimension is added and an infinite number of body parts could be placed one in front of the other on a 3 dimensional plane. But in the 2-dimensional world all of the objects would appear to be occupying the same space.</p><p>So if a 2-dimensional world cannot grasp the addition of a third dimension, than doesn't it make sense that our 3-dimensional world cannot grasp the addition of a fourth dimension? And it is almost certain that a fourth dimension exists. And in a similar way to that mentioned before, an infinite number of three dimensional worlds could appear to occupy the same space, when in reality the are merely added to a four dimensional plane.</p><p>One might think to travel to these other dimensions would be impossible, and in a physical sense it sort of is. But if an infinite number of alternate dimensions are occupying the same 3-dimensional space, physical travel is unnecessary, we are already there. The only thing left to separate us from these alternate dimensions is our perception. Our human brains natively only perceive the dimension that we are perceptually occupying.</p><p>That is where Salvia Divinorum comes in. It is possible to perceive alternate, initially entry, dimensions with the help of Salvinorin A (C23H28O8).</p><p>The length of time out of your dimension and into another, and the depth traveled into an alternate dimension, are both dependent on the amount smoked.</p><p>The Journey Begins</p><p>First experience - Leaves, dried and smoked, 2 bowls, pipe</p><p>I physically felt myself being pulled back by my skull. By whom I did, and do not know. I felt strongly disassociated from reality.</p><p>Second experience - Leaves, dried and smoked, 1 bowl, bong</p><p>I put down the bong (a three footer), it turned into a fantastic musical instrument the likes of which I have never seen or been able to imagine. The sight gave me a scare, the object, once normal, had turned into an object I could hardly fathom. I sat back, anxiety turned into a physical fire that spread throughout my body. Pulled back into flames. Felt a strong female presence, and a male, possibly her right hand man. She said nothing. He only laughed at my ignorance and inexperience. This was my first encounter w/ lady Saliva, and the strong presence of entities gave me a strong impression that I was literally somewhere else. Not like on a shroom trip, or an acid spin, but actually a different reality.</p><p>Third experience - Extract 5x, dried and smoked, 1 bowl, pipe</p><p>First time with extract. Very unprepared. All I heard were numerous people laughing at me. There was no contact with the lady, but a man asked me why I went into this so unprepared.</p><p>Fourth experience - Extract 5x, dried and smoked, 1 bowl, pipe</p><p>Very prepared at this point. I had read everything I could get my hands on about Saliva and peoples experience with it. It seems some people actually hinted at the fact that this was a gateway to an alternate dimension. It sounds weird, but paper after paper, all uncanny similarities.</p><p>I felt my physical self as a series of connected unzipped zippers. A Lady (initially presumed it was lady Saliva again) began to zip up my body, zipper by zipper, starting with the legs. Slowly moving up the body. She was communicating with me telepathically, I could say or think nothing, only listen. She told me I could learn some of the things I wanted to, but I would have to trust her. She got closer and closer to my head. My claustrophobia kicked in and it occurred to me she could be a ruse, sent to seduce and capture my mind. I somehow pulled myself out of the experience. I was immediately disappointed in myself for not trusting her. 'What could I have learned, what could I have seen?'</p><p>Fifth experience - extract 10x, dried and smoked, 1 bowl, pipe</p><p>Before I even exhaled, I was hurled deep into the entry dimension of Saliva. My reality was a slice in an infinite series of vertical slices. Each slice was a different reality, all were spinning in circles, I too was spinning. No encounters with lady Saliva or her men. The spinning stopped and falling started. Down, down, felt like forever. No sense of my physical self.</p><p>My journey through the entry dimension and beyond is far from over. I share this report incomplete, for the purpose of information. The true explorers out there will love the journey brought about by my ally Saliva. And a warning to those who are still ignorant, tread not on these grounds, for ignorance is not a welcome in the depths of said dimension. There are many other things to do out there that will get you a good time, if thats what you are looking for. This however is just a tinge more profound, intensely profound.</p>",
 "year": "2004",
 "id": "35592",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-01T07:00:00.000Z",
 "views": "3367",
 "dose": {}
}
