{
 "title": "Not the Tastiest of Placebos",
 "author": "eG",
 "citation": " eG. \"Not the Tastiest of Placebos: experience with Leonotis leonurus (ID 356)\". Erowid.org. Sep 11, 2000. erowid.org/exp/356",
 "substance": "Leonotis leonurus",
 "bodyweight": "77 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Leonotis leonurus"
  ]
 ],
 "report": "<p>I just got an ounce of dried Leonotis leonurus.</p><p>Some net research has told me that the active principle is leonurine, the same alkaloid that is mildly psychoactive in the similar Leonurus sibiricus (marihuanilla). Addictive on the order of nicotine with regular usage, according to Gottleib. Alleged to produce a MJ-type euphoria.  [Also, the plant contains marrubiin, a bitter principle good at increasing secretion flows (such as bile), and has expectorant properties. For headache, cough, etc, prepare dried foliage as a tea infusion. I'm unsure of the dosage.]</p><p>Smoking this plant produced MJ-like effects, only milder, and a somewhat larger amount must be taken. I just had about two joints worth, and got a buzz roughly equivalent to smoking half a bowl of average commercial grass (or sharing a pinner with a pal). Beware of the small thorns!!</p><p>I have read that the foliage is used by the Zulu as a medicinal tea, and that only the flowers + flowering tops of the plant are smoked. I'm going to try alcohol extraction to make 'wild dagga hash oil' and see how that works.</p><p>--later--</p><p>Tried smoking a joint or so of the plant with no effect. I read that the African specimens are stronger, so I'll definitely make the extraction.</p><p>--later--</p><p>Well, I made a 5x extract of the plant matter using pharmacy-grade 91% isopropyl. If I wasn't enthralled with the smoke's flavor before, it sure revolts me now. Extremely 'planty' in flavor; made me gag and nearly vomit. Let's put this down for now.</p><p>--later--</p><p>Tastes just as bad as previously. This is not even worthwhile as a drug for a desperation high. Ever since that first attempt, I have gotten no effects from this plant. I'll chalk the first experience up to the placebo effect.</p><p>Final opinion: Don't waste your time with this 'drug'.</p>",
 "year": "2000",
 "id": "356",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-11T07:00:00.000Z",
 "views": "26199",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Leonotis leonurus"
  }
 ]
}
