{
 "title": "Being the Rollladenschaft",
 "author": "Hampton",
 "citation": " Hampton. \"Being the Rollladenschaft: experience with Salvia divinorum (12x extract) & Cannabis (ID 35607)\". Erowid.org. Jan 18, 2007. erowid.org/exp/35607",
 "substance": "Salvia divinorum (12x extract) & Cannabis",
 "bodyweight": "58 kg",
 "header": [
  "DOSE:",
  "75 mg",
  "smoked",
  "Salvia divinorum",
  "(extract)"
 ],
 "report": "<p>Together with my best friend I ordered 1 g of Salvia 12x extract. We planned to smoke it in a bong while my parents were away over a weekend in April 2003. It should be our first experiment with psychedelics.</p><p>I had a slight imagination of what I might experience because I had already read much about the effects. Through Salvia I hoped I could learn something about myself and our universe. Many philosophical questions whizzed through my head and I was searching for some spiritistic enlightenment.</p><p>Each of us smoked three bowls during the evening. Between our experiences we smoked each time some cannabis. We thought of ourselves as well informed about dosage, effects and dangers. Unfortunately we had no scales and could only measure the approximate quantity by dividing the extract into more or less same-sized amounts.</p><p>EXPERIENCE #1:</p><p>I was first to test Salvia. We chose the bathroom for our first experiment to avoid the danger of the carpet being inflamed, etc. My friend heated the Salvia while I inhalated the smoke and kept it in my lungs for about 20 seconds. The dosage of approximately 50 mg 12x extract was good for the first time.</p><p>After exhaling the smoke I was waiting for the effects, wondering why everything was as normal as ever until I realized after a short time that I had already forgotten of having smoked Salvia before, although the bong stood in front of my nose. Then I thought of being some strange kind of pet which is unable to do anything and with which everyone can talk and play. I asked my friend to give me my glass from the window sill to drink something. I could easily have reached it with my own hands but the wall seemed to be incredibly high while I felt like a small tiny pet.</p><p>Then another interesting effect came up: The room seemed more deep than normal. It was as if I were in a computer game because the room seemed more three-dimensional and plastic. The objects in the room somehow stood out and were movable which I tried out with my slippers lying on the floor. Startled, I said to my friend: 'Wow, you can move them!' That, of course, arose his loud laughter with me joining in after realizing my 'incredible discovery'. With that my first experience was nearly over. For a few minutes I somehow stood beside of me and was a bit confused. We went on the terrace before my friend smoked his bowl of Salvia.</p><p>EXPERIENCE #2:</p><p>For our second experience we increased the dose to about 100 mg and changed the setting to my room after we had seen that the danger of putting something on fire is very low with a tripsitter. This time the trip would be much stronger. Unfortunately I can hardly remember it. After exhaling the smoke everything immediately disappeared in a whirl and I was somehow turning around, feeling like a cell in my brain. Then I looked around a corner to another corner where my friend stood. We both looked around the corners at the same time with me everytime saying 'What?', then the scene repeated. I hung in that loop for probably two minutes until I came back to our reality. I got a feeling for the strange experiences one can have with Salvia.</p><p>EXPERIENCE #3:</p><p>Setting and dose stayed the same for our third experience which should become a decisive event in my life. After exhaling the smoke once again everything began to disappear in a whirl and a new reality opened. It was the reality of the 'Rollladenschaft' which I was now. My old life had completely disappeared and I panicked to get it back but there wasn't anymore than a slight memory that I have some time been someone else. Everything had completely vanished and had been replaced by the Rolladenschaft. I was rolling in a huge band, in front and beside of me were other bands rolling continuously. These bands were full with thousands of my faces staring at me in panic. I was one of these faces.</p><p>The whole time a complete song was playing which went like this: 'Denn du bist ja nur 1, 2, 3, 4, 5, 6, 7 mal die Rollladenschaft, die Rollladenschaft, die Rollladenschaft' ('Because you're only 1, 2, 3, 4, 5, 6, 7 times the shuttership, the shuttership, the shuttership'). The word Rolladenschaft isn't really translatable because it doesn't even exist in German, it is somehow a new word creation. But Rollladen means shutter, so I translate Rollladenschaft with shuttership. Interestingly the sequence of numbers in the song stopped with 7 but I somehow knew that it was infinite.</p><p>I thought of that Rollladenschaft being the reality and my former life only having been a nice dream. Everytime the song started again I was somehow pushed from behind by a big stamp into the Rolladenschaft as if I was an atom in a conveyor belt in a factory. Sometimes I could even taste the Rollladenschaft. The Rollladenschaft constantly kept on rolling. I was in a loop once again. The same song and melody over and over again. Everything seemed absolutely hopeless and terrible.</p><p>I tried to get me out of this but I succeeded only after about 3 minutes to come back to our reality for the first time. But to my horror the Rollladenschaft came back after a few seconds. For the next 20 minutes I stayed switching between our reality and the reality of the Rollladenschaft. I panicked that I might keep hanging on my trip. Luckily after some time the Rollladenschaft didn't come back.</p><p>AFTEREFFECTS:</p><p>After this deep horror experience I was in a bad mood and stood beside me for at least a week. Everything seemed unreal. The leafs, the flowers, just everything. Thus I at first regretted of having done the Salvia experiment but with the time I could overcome the horror more and more. The experience has changed my entire life. I've become even more interested in the great questions of life. I learned that there exist other realities behind the one we know and that everything is possible, things that our limited human brains can never think of.</p>",
 "year": "2003",
 "id": "35607",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-18T08:00:00.000Z",
 "views": "2059",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "75 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
