{
 "title": "What Amsterdam Has To Offer",
 "author": "Imapolygon",
 "citation": " Imapolygon. \"What Amsterdam Has To Offer: experience with Mushrooms (P. Cubensis) (ID 35627)\". Erowid.org. Jan 29, 2007. erowid.org/exp/35627",
 "substance": "Mushrooms (P. Cubensis)",
 "bodyweight": "115 lb",
 "report": "<p>Every year I go to a small town outside of Amsterdam to attend a string music festival with some other kids my age, and every year we have a tradition of smoking a lot of the pot and eating a lot of the shrooms. This year was different however, only 2 people (me and 'Jim') wanted to try the shrooms. We went into a smartshop by the flower district in Amsterdam and asked the guy what we should take. He suggested splitting a box of P Cubensis from Medellin, Colombia (my birthplace actually). A box of shrooms there contains 8 mushrooms of roughly the same size, although I am still not sure how many grams it is all together.</p><p>Anyway, that night we ate the mushrooms plain. I ate 3 (my stomach already felt slightly uncomfortable) and Jim ate 4, leaving one medium-sized one left. we had eaten some beef jerky and teddy grams an hour earlier. Again, I have no idea how many grams this was, but judging from the fact one mushroom definitely weighed more than a dollar bill (.999 grams), we ate about 5 grams each. this was Jim's first time tripping shrooms, and my 6th.</p><p>THE EXPERIENCE</p><p>T-0:15--We run downstairs to find 'Ally' who was going to smoke a joint with us. We find her and she says she can't. For some reason, the fact she couldn't join us was very funny. Me and Jim looked at each other and walk quickly out of the hotel onto the back grounds near the woods, and crack up. We laugh and laugh for about 10 minutes. I remember shouting '45 minutes my ass!' (in reference to the effects setting in).</p><p>T-0:30--We trot further back into the woods and everything becomes more and more funny. I already begin to get the lightness in the chest and that intangible tingle along my shoulders. My hands feel as if they are only attached by strings to my shoulders, and my head sort of lulls. At this point I start to feel slightly nauseous, but I can easily ignore it. We also find that our hand-eye coordination is greatly improved. We can throw the hacky sack we have as high up as we want and catch it no matter where it goes. Weird.</p><p>T-0:45--We decide to sit down on a bench that gave us a slight view of the hotel. When we sit down, we notice that the ground starts to shift. We amuse ourselves and continue to laugh at the patterns and shapes we see. Typical shrooms stuff: trees melt, the ground flows, the air breathes and faces look very scary. We had trouble looking up at the sky though, becuase all the leaves were moving cuz of wind and it totally blew our minds. I feel more and more nauseous and at this point my skin starts to feel like it might fall off. But Jim happens to be a chatterbox when he trips, so I just listen to him and don't think about my body.</p><p>T-1:00--At this point I realize this is the hardest peaking I've ever experienced (except on DXM). I start to get worried as my nausea increases and things begin to look so fucked up I can't even imagine why they exist. I light my lighter and we stare at the flame for at least 5 minutes. It gives us a great sense of well-being and joy. We stare and the earth and feel grounded. We still have trouble looking at the sky. At one point I try and my eyes hurt (it's dusk); a little leaf-man is running around and cackling. When we look at water we feel like we're floating, or at least I do. So basically we discover the 4 basic elements. I have a sensation of being 'the first man on earth.' Everything is complicated to understand, and the question 'why' zooms thru my mind constantly.</p><p>T-1:30--We were probably still peaking at this point. Cold, sweaty, hard to walk at first. We finally hit what feels like the top, then we drop a little. Jim stands up (we've been sitting staring for about 45 minutes) and exclaims 'Woah! We can DO things!' so we walk about, still tripping VERY hard. We were at the tip of the peak for at least 10 minutes, which was hard to handle. We were walking in a straight line, and could talk with each other very well. In fact, if the passerby overheard us they would probably think nothing was wrong with us.</p><p>T-2:00 to 3:00--Theres a town about 10 minutes walking from the hotel, and we decide to go there for no reason. Now we have started having a very deep discussion. We talk about everything. The main topic was HOW everything existed...we didn't touch on the WHY. We talked about how the mind worked, how we interacted with other people, why humans had drive to do what we did, why we wore clothes, how our brains are arranged, a lot of stuff. The whole time I'm noticing that my throat feels dusty and odd, and my mouth feels like its about a foot back from where it should be. My thoughts are endless and everything still looks very weird. We walk to town and then come back and sit down on a different bench.</p><p>T-3:00--We talk about how similar we are and how odd it is we met. We have the same interests (psych and people) and are at the camp for the same reason (to chill and learn some new tricks on cello). We discuss why everyone else is there (to major in music and make it their life) and how we could never do that and why. Talked about girls and love and life and about what I wanted to do. A very good deep honest and insightful convo. At this point I'm just chilly (it's now about 12 midnight and it gets cold at night in holland). I basically get to know Jim up and down in a matter of a few hours. I also remembered this thing I only remember when I'm on shrooms ... shroom de ja vu.</p><p>T-4:00--The whole time we thought about going inside to see people. I could have, but I didn't want to, and Jim was still wild-eyed and pale, so I avoided the idea as much as I could. But we decided to go in. We went up to my room, at this point really comming down but still realizing how fucked up we were. Throughout the whole time I kept forgetting I had eaten the mushrooms. Everything felt truly like a dream now, and I felt a heaviness in my stomach.</p><p>T-4:30--We listened to music, I discovered I was hungry and ate an apple. The music sounded fantastic. We took notes on our expeirence, which is what I'm writting this from (hey, we're psych nerds). Then something REALLY weird happened. We were looking at each other and then started to say the exact same things for a really long time it went something like 'Dude. No way! Woah. Stop. Hehehe! No seriously, stop.' exactly at the right intervals we jinxed for about 20 seconds. And I can safely say that after that, my skin felt normal, my mouth went back into place, and my arms existed again.</p><p>The rest of the night we felt very gassy and stoned. Jim didn't like it but I was used to it. We toyed with the idea of smoking pot but we ended up not. I didn't feel like rolling a joint. All in all, I'd say it was the best and most intense shroom trip I've had, as well as the most memorable. I found out a lot about the way I think and the way I view other people. Me and Jim are going to remain close, and remained close the rest of our time there.</p>",
 "year": "2004",
 "id": "35627",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-01-29T08:00:00.000Z",
 "views": "8184",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 caps",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(plant material)"
  }
 }
}
