{
 "title": "Disconnected from the Human Machine",
 "author": "GJR",
 "citation": " GJR. \"Disconnected from the Human Machine: experience with Atomoxetine (ID 35622)\". Erowid.org. Feb 16, 2005. erowid.org/exp/35622",
 "substance": "Atomoxetine",
 "bodyweight": "250 lb",
 "header": [
  "DOSE:",
  "120 mg",
  "oral",
  "Pharms - Atomoxetine",
  "(pill / tablet)",
  " T+ 0:50",
  "120 mg",
  "oral",
  "Pharms - Atomoxetine",
  "(pill / tablet)"
 ],
 "report": "<p>I managed to get 30 of these pills about a month ago.  These pills are supposedly for ADHD or depression, but can be used for certain types of dementia as well. This is the only SNRI that the FDA has approved as of yet. </p><p>t+0min: Took 2 x 60mg with no prior mood modifiers</p><p>t+30min: Disconnected from reality  feel like Im floating</p><p>t:45min: Feel spaced out - I can focus on only one thing at a time</p><p>t:50min: Took another two 60mg doses</p><p>t+60min: Remembering things long forgotten, voices seem distant, random things seem pleasantly mellow.  Cant read anymore as I see words dancing on pages.</p><p>t+120min:  Effects actually strengthening.  I hear random voices, one of which is my own, saying phrases that I did not directly think of.  The words I hear make me think.  One such phrase was 'You will find your answers on the road to Egypt.'  My mind revels in mysteries as I look for significance to the things that I hear.  I start thinking in at higher plane (or i should say i feel like i do..).  The world makes complete sense now.  I feel extremely content, almost euphoric.</p><p>t+130min: Visual hallucinations now.  Different scenes pass slowly before me, I cant tell whether my eyes are opened or closed.  I absorb the details of places that I've never seen before.  I look at myself in a passing mirror and I do not recognize myself until I wave my hands in front of it.  It all seems right somehow.</p><p>t+200min:  For whatever reason I find myself in HP Lovecrafts' dream world.  I'm talking to Randolph Carter about the Dholes and how best to avoid them.  He has a silver key tied to a string around his neck.  I attribute much importance to that key.</p><p>~t:240min:  I see Pickman, the artist turned goul, in his own realm. The zoogs have led me here for some unknown reason.  Pickman asks how East Boston is doing.</p><p>t:260:  The world seems fragmented.  Like I'm falling 'asleep' though I'm fully awake.</p><p>t:300:  I wake up and find that though I felt a great time has passed (months to years), only a few hours have.</p><p>t+320:  I feel somewhat groggy and low.  It's 3:00am now and I'm wide awake.  I cant sleep at all, though I'm not restless about it.  I get up and start working on my website.</p><p>Rest of the day:  I feel that I can do/work on anything, though I now have a rather short temper, and that isn't usually the case.  I find that interruptions bother me immensely, though after the interruptions are over, I feel pleasantly mellow.  </p><p>In retrospect I think that 240mg was too much to start off with.  Overall Id say it was worth doing. </p><p>-gjr</p>",
 "year": "2004",
 "id": "35622",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-02-16T08:00:00.000Z",
 "views": "35599",
 "dose": {}
}
