{
 "title": "Little Buzz, Not Amazing",
 "author": "Don",
 "citation": " Don. \"Little Buzz, Not Amazing: experience with Ephedra (ID 35671)\". Erowid.org. Nov 7, 2007. erowid.org/exp/35671",
 "substance": "Ephedra",
 "bodyweight": "65 kg",
 "header": [
  "DOSE:",
  "8 in",
  "oral",
  "Ephedra sinica",
  "(plant material)"
 ],
 "report": "<p>So one boring day when there was no homework to complete before the end of lunch I decided to see what the botanic gardens kept in their freely passed gates. I strolled down there and sure enough I found a bush labeled 'ephedra major'. As there were many tourists taking photos of near by Wollemi pine I simply pointed out the thing to a friend and left.</p><p>The next day, him and another mate came running into the gates with an excited look on their faces, showing me a shamefully large bundle of stems. So sure enough I wanted a go. Chewing the shit tasting stem of about 20cm in length, I felt a five minute kick and had the urge to run. When swallowed, 5 mins later I began to really feel hyperactive and found myself clapping my hands like an idiot. It was about 35-40 minutes after first chewing that I felt the peak of the 'jumping aroundness' and then settled into a shaky sit with mild euphoria. At this stage I found myself laughing a fair bit at nothing. At around an hour after I felt a sudden dreamy slump with a dramatic end to the energy. I did, however, feel like I could run a 400m race faster than anyone on earth for alot of the previous hour.</p><p>It was disappointing though. There was then a headache for most of the following evening. There was little significant change to thought patterns (take into account I had only tried pot and nitrous at the time) except for a bit of jumble while attempting to do all ten maths questions at one time. Not enough enjoyment for the health risks involved. It was a bit dicey to rack plant foliage from the botanic garden even if it was free. The taste wasnt good either.</p><p>Being personally interested in conifers and having read about a strange genus called ephedra I thought it would be quite a simple task to abuse the pubic hair shaped plant. My sister had also muttered at one point that it had its stimulating aspects. I would turn out to be right. So if you want to tick it off your list then go ahead but it has its potential health risks and could be quite boring for an experienced drug user.</p>",
 "year": "2004",
 "id": "35671",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-07T08:00:00.000Z",
 "views": "13896",
 "dose": {}
}
