{
 "id": 3582,
 "title": "And They Say Time Travel Isn't Possible",
 "date": {
  "submission": "2003-02-22T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Big Poppa J",
  "gender": "Male",
  "weight": "250 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "0:30",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "5:52",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  },
  {
   "time": "6:20",
   "amount": "2 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  }
 ],
 "report": [
  "10:00 - Injested 20mg mixed in a bottle of water",
  "10:28 - cold chills, goose bumps, feeling of anticipation",
  "10:30 - injested another 20mg mixed in a bottle of water",
  "I'm interested to find out exactly what is going to happen to me, at first I was unsure about taking 40mg but I have nothing better to do tonight, and nothing to do at all tomorrow. So I figured what the heck might as well. Obtained a pure sample from what I consider a reliable source. Hopefully everything will go as planned and my head will be spinning like a top in barrage of psychedelic colors.",
  "10:50 Mild hallucinations present, not sure if its just me being excited or the drugs kicking in. Creepy crawling feeling on my skin, somewhat similar to the affects present before taking acid.+",
  "11:33 ok there is definitly somehting going on here, im having mild hallucinations and my head feels like about 3 hits of acid. Got a strong urge to make a bm, better do it before i lose my mind.",
  "12:50 - I'm totally gone now, serious clenching in my jaw, completely vivid distortions, having problems typing but otherise arlight, seems to have somewhat of a time warping effect, been laying on my bed for 50 min but what seemed more like 50 hours. Not sure if I'm hungry or if its just the drug. This is great I could compare this to a 10 strip of acid at this point. Watching requiem for a dream, not sure whats going on, wow, im spent. eating triscuits.",
  "1:21 Totally fried beyond recognition, its a wonder that i can type this as I am staring at my fingers as if they are gnomes dancing upon my keyobrd of light, everything sparkles and dances my eyes are completely dialated",
  "2:00  I think my initial peak has subsided, although I am still completely disoriented.",
  "3:23  turned off the blacklight, still having wild visual distortions almost more intense as i shut the blacklight off.",
  "3:52 Brain still feels fuzzled. Visuals have subsided. Just took a shot of whiskey to try and take this edge off, for the most part it seems my journey into the next dimension has ceased.  Although my brain is still quite distorted. I believe the whiskey is going to bring me out of that quite nicely.",
  "4:20 I'll end up my experiance now for I am going to bed shortly, couple more shots of jim beam, and the end of this movie 'Fresh' and I'll be in the sack. Good luck psychonautical astronauts. Have fun and be safe."
 ],
 "erowid": {
  "id": "21523",
  "citation": " Big Poppa J. \"And They Say Time Travel Isn't Possible: experience with 2C-I & Alcohol (ID 21523)\". Erowid.org. Feb 22, 2003. erowid.org/exp/21523",
  "substance": "2C-I & Alcohol",
  "views": "7392"
 }
}
