{
 "title": "My Horrible Experience",
 "author": "mellogreen",
 "citation": " mellogreen. \"My Horrible Experience: experience with Leonotis leonurus (homemade resin) (ID 35863)\". Erowid.org. Nov 23, 2004. erowid.org/exp/35863",
 "substance": "Leonotis leonurus (homemade resin)",
 "bodyweight": "161 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Tobacco - Cigarettes",
  "(daily)",
  "",
  "1.5 g",
  "smoked",
  "Leonotis leonurus",
  "(tar / resin)"
 ],
 "report": "<p>I recently bought a lb of wild dagga leaves from a well known vendor. I was looking for a cannabis like high that they promise. I tried smoking the leaves but they were horrible tasting like molasses and rubber. Smoking the leaves didn't give me any effects, except a gross green dagga phlem, and a sore throat.</p><p>So I decided that I would put the leaves in a bowl and let them soak for a day. I strained the leaves out and boiled the water down till it was resin/tar on the bottom of the pan. I was excited, and was looking forward to a buzz. I smoke cigarettes daily, and had smoked cannabis (4 hits) about 3 hours prior to trying out my dagga resin. I was in a positive mood and upbeat about the experience to come. I had sampled dagga resin from an online vendor before and liked the experience. So I anticipated a nice high.</p><p>I collected all the sticky resin and ended up with about 5 or 6 grams. I packed about 2 to 3 bowls of this dagga resin (about a gram each) and smoked it with my girlfriend 'Daisy'. It seemed to come on very slow, every thing seemed a little off-kilter, I was watching tv and everything seemed stranger than normal reality. About 20 minutes after smoking a strong sedation started taking effect. 10 minutes later I felt dizzy and my stomach was starting to be upset. I tried falling asleep, but I was so nauseated I couldn't, I started getting chills although I was under a heavy blanket. I jumped in a hot shower, I felt very disorientated, and couldn't focus on anything. I attempted sleep a second time, and every thing I thought about made me sick to my stomach literally. Every thought made me want to puke. Well I puked about an hour and a half after the initial smoking.</p><p>This was definitely not fun, not recreational and not something I ever wanted to experience again. I never want to hear the word dagga again. The following morning I felt almost normal, and the first thing I did was throw the resin away.</p><p>I do not know what caused this horrible reaction. Maybe it was the large amount I smoked. Maybe it was how I prepared it. Maybe it was the amount of tar that my lungs endured. What I do know is that it was one of the worst experiences I have ever had.</p>",
 "year": "2004",
 "id": "35863",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-11-23T08:00:00.000Z",
 "views": "23948",
 "dose": {}
}
