{
 "id": 3587,
 "title": "Clarity for Too Long",
 "date": {
  "submission": "2000-06-26T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Toad",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "smoked",
   "substance": "4-Methylaminorex",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Experimenting with 4methylaminorex... 20mg vaporized (not sure if I caught all the vapors with my glass straw). the smoking route (choke choke) is really losing its appeal with me... Really nice clarity to this drug, I can see how people would use this for work enhancement and brainstorming purposes. I actually feel much calmer and more relaxed than usual, perhaps my baseline functions at an attention deficit type norm. At the current dosage there isn't any striking u4ea, but I can see how it could develop into that at a higher range. So far high marks from the likky toad on this one for clarity, function, verbal command, and writing ability. The down side to this compound is that it lasts a very long time. Too long in fact (14-16 hours). I dosed around 10am and was wired up all day and evening until 3am the next morning, at which time I finally fell asleap for a few unrestful hours, then tossed and turned for another hour, which finally gave way to a full 3 hour deep sleep cycle. I was surprizingly not tired the following day, and was certainly in very high spirits. It's too bad this womper stomp of a stimulant keeps on truckin thru the night, I rarely have utility for such an effect, and I prefer to keep my sleeping cycle in synch unless I'm going for a gonzo trip or other such major event.",
  "I'm pretty much a stimulant virgin, and have only explored and experienced a few of them. Caffeine has never appealed to me much, and ephedrine makes me feel way too jittery and annoyed. From what I have observed in others the potent stimulants require a fair bit of self control to moderate thier consumption. I've seen one clear example of meth psychosis in a person I was once close to, and its certainly not an optimal state of being.",
  "Rotate and integrate! (my mantra)"
 ],
 "erowid": {
  "id": "2154",
  "citation": " Toad. \"Clarity for Too Long: experience with 4-methylaminorex (ID 2154)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2154",
  "substance": "4-methylaminorex",
  "views": "28895"
 }
}
