{
 "title": "Social and Compotent",
 "author": "Will. A.",
 "citation": " Will. A.. \"Social and Compotent: experience with Amphetamines (Adderall) (ID 35921)\". Erowid.org. Jul 28, 2007. erowid.org/exp/35921",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "175 lb",
 "header": [
  "DOSE: T+ 0:00",
  "45 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)",
  " T+ 2:00",
  "15 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)"
 ],
 "report": "<p>For reference, the drugs I've tried are this one, marijuana, alcohol, nitrous, vicodin and valium.</p><p>Last night, I acquired 60 mg of Adderall pills (15 mg. tablets, the pinkish circle kind that say 1|5 on them) from someone I know.  I research most anything I take ahead of time, so I know what to expect.  After reading the drug information and a few experiences, I decided that I would take them in the next morning, since I didn't have to work on that day.  That day is today.  I awoke at about 12 pm, ate a banana, and since I was in a good mindset, I took 45 mg at about 1:00 pm.</p><p>Some friends picked me up at this time, and after being at my friends house for around an hour and a half, I noticed some strange sensations began.  I was talking online on my friends computer, and I was very very social.  I wanted to talk to everyone on my buddylist.  I juggled 4 conversations, whereas I usually don't have more than 2. I was typing incredibly fast.  I definitely felt different physically, too.  My heart rate rose, and I sort of felt light to moderate euphoria. </p><p>I took 15 more mg at around 3 o clock, wanting to get rid of the rest of the Adderall without wasting it, and ate another banana.  My friends and I ran some errands, and eventually ended up at where I work.  I was very talkative to coworkers, and noticed I was sort of jittery, and I talked very fast if I didn't control my verbal speed.  Having been under influences in front of people many times before, I'm pretty confident that they didn't notice, so I guess this influence is relatively easy to hide without too much trouble.</p><p>After leaving my work, we went to the local mall.  I was talkative there too.  I sometimes felt like I was talking more than all of three of my friends put together.  I bought a jamba juice there.  While riding in my friend's car a while later, probably 7:00 pm, I noticed that my armhair felt tingly, and this sensation grew with time.  Like someone else on an experience I read, I felt sort of flattered that other people were talking to me, that they found me interesting and wanted to communicate with me.</p><p>At 9 pm I was dropped off at my house.  I worked on my car for a couple hours, cleaning it, and finishing up some other work I'd been doing on it.  It was pretty satisfying cleaning my car, way more than usual, and I noticed that I felt sort of meticulous attention to detail.  I vacuumed everywhere the vacuum hose would access, and picked out peices of lint from my carpet. </p><p>At about 12 am, after my car was pretty clean, I talked to my uncle for a while.  I was still very social and pretty energetic at this time.  I started thinking to myself that I should be prepared to crash, since it should happen soon.  I didn't crash then.  I did, however, go into my room.</p><p>I sat down at my computer, glanced over the drug info again, and talked to more people.  After a few minutes, I noticed I was having minor chest pain, specifically in my heart.  I told myself that it was probably because my heart was beating hard the whole time I was on this trip, and my heart wasn't used to that, so it was alright.  I talked to my friend Mike about it, and he agreed to hang out with me so that I wouldn't be alone while this happened.  I read on another experience that eating can help with the 'coming down' of an amphetamine high, so I made some macaroni and cheese.  Usually, I can down an entire box by myself, but I ate roughly 1/10th of the box.  I threw the rest out.</p><p>1:30 am I didn't feel I'd be able to sleep, so I went cruising around a bit more with a friend (I wasn't driving) which was pretty uneventful, except I noticed I had to take deep breaths once in a while to stave off the heart discomfort.  I also bought some beef jerky, at one point.  My euphoria died down at around 2ish, and so at 3 I told him he could drop me off because I would probably be able to sleep now.</p><p>He dropped me off at 3:30 am. I took a shower and here I am now.  I feel like I've come off the trip, and I will probably be able to sleep.  The heart discomfort has dissipated.  In retrospect, all I had to eat today was two bananas, a jamba juice, and a bag of beef jerky.  I drank a good amount of water the whole time, so I had a very low calorie intake today.  I'm going to bed now and I'll probably wake up hungrier than a mofo.</p>",
 "year": "2004",
 "id": "35921",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-28T07:00:00.000Z",
 "views": "10952",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 }
}
