{
 "title": "More Than I Bargained For...",
 "author": "Matt",
 "citation": " Matt. \"More Than I Bargained For...: experience with Nitrous Oxide (ID 35983)\". Erowid.org. Aug 18, 2004. erowid.org/exp/35983",
 "substance": "Nitrous Oxide",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  " repeated",
  "inhaled",
  "Nitrous Oxide",
  "(gas)"
 ],
 "report": "<p>A little background info, I had a hernia for a long while but was always too busy to take it out, doing something or other that being put out of commision for days or weeks would hurt. It never really hurt so I figured I'd just wait till summer winds down and whatnot. I've had experience with marijuana but nothing else, but lately I've been interested in hallucinogens and such. In fact the other day I discovered whippits, but since my surgery was so soon I was skeptical to try N2O out. Imagine my delight when the doctor told me they'd be giving me the gas before the anestaesia! At very first after the mask was put over me, I felt like I couldn't breathe, which probably started this whole chain reaction. Seconds later, the auditory helicopter senestion that I've read about began, with the doctor telling me, 'You're going to feel giggly, and might want to laugh...that is alright.' </p><p>What happened next was totally unexpected. He starts repeating, 'You're doing fine Matt...', and this statement stuck in my mind, and repeated over and over faster and faster and higher pitched after every repetition. It began to scare me which is I'm sure why this 'trip' took a turn for the worse. Finally, when his voice couldn't get any faster or higher, suddenly I was in outer space, and being told that I was coming home, by an alien or something. It doesn't seem so scary on paper but believe me I have never gone through anything like that in my life. Just before they gave me the anestaesia I shot up in bed and let out the worst scream ever, it was by far worse than any movie nightmare scene.  All day I've been trying to piece together the scariest part, but I still can't get to it. The craziest part of that all is that the entire thing took about 12 seconds. Before today I'd been pretty interested in shroomin or doin acid, but now I can say without a doubt that there's no way I'd be able to handle 12 HOURS of a bad trip.</p>",
 "year": "2004",
 "id": "35983",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-18T07:00:00.000Z",
 "views": "22229",
 "dose": {}
}
