{
 "title": "Broke into Analytical Tears",
 "author": "Zacaz",
 "citation": " Zacaz. \"Broke into Analytical Tears: experience with Trazodone (ID 35998)\". Erowid.org. Jun 16, 2006. erowid.org/exp/35998",
 "substance": "Trazodone",
 "bodyweight": "185 lb",
 "report": "<p>Before the tablets were taken, I had eaten a Wendys Bacon Cheddar Melt with a Biggie size fry and a Biggie size drink.  The directions on the bottle say to take this medication with food.</p><p>All of the four 50MG tablets (200MG all together) were taken orally at 1:40 PM EST on Monday, August 16, 2004. </p><p>The tablets were white, with one side blank and the other inscribed.  They were shaped in a perfect, beveled, circle.  The inscription was the numbers 93 followed by a  underneath that and the numbers 637 underneath that.</p><p>The tablets were broken in half on the line that separated the numbers.  This was in effort to decrease the time it took for the effects of the drug to be produced.</p><p>===Experience===</p><p>As of right now, it has taken 27 minutes for me to feel anything.  My mind is starting to feel fuzzy.  It feels much the same way as that of Hydrocodone.  In fact, the tingles in my skin that I am feeling right now also feel like Hydrocodone.</p><p>It has been 10 minutes and my legs feel very heavy.  I almost feel as if I have been drugged.  The drowsiness is similar to that of a Roofie.  It is very hard to move my hands fast enough to keep up with my brain while typing this.  Things seem very slow and heavy.</p><p>My eyes are also doing this very peculiar thing in regards to focusing.  It seems that the center of vision is clear, while the outside of it is distorted.  For example, when I make my mouse the center of my view, I can see it clearly.  However, the images around the mouse in the rest of my field of view are hazy and distorted, almost blurry.</p><p>It has been 43 minutes since I wrote the paragraph above.  I feel very tired and I have been nodding in and out.  My entire body feels numb; some areas (as my arms, legs, hands, and feet) are number than others (head, body cavity).</p><p>My mind has also been running in circles about various subjects.  I find while on this drug, that I am not having any negative thoughts.  It is like someone shut off the television and gave me some piece and quiet.</p><p>I may have spoke too soon.  I just got off the phone with my girlfriend.  We have been fighting and this has caused me great stress.  While fighting about 10 minutes ago, I just burst out crying.  I am normally not like this.  I also had a deep and uncontrollable whine and felt as if I was on the brink of crying several times.</p><p>I feel very sad and tired.  I am going to go to bed.</p><p>It has been 6 hours and 54 minutes since I last wrote.  I still feel a bit groggy and I can feel the last and lingering effects of the drug.  The hangover feels quite light compared to other drugs.  I dont feel high but I dont feel normal either.</p><p>Since I have taken these tablets, I have not been able to eat.  The smell of food is making my stomach go into knots.  My mouth is also very dry, and has been since I had taken the drug.</p><p>It is now the next morning and I feel pretty good.  I cannot feel any effects of the drug.  I went to bed last night early and woke up today, early.  This surprised me since I had been sleeping for a good part of the following day, due to the Trazodone.  I am wondering if this drugged sleep lacks the R.E.M. components needed for rest.  I will say that I did feel better when I was not on the drugs and just went to sleep normally.</p>",
 "year": "2004",
 "id": "35998",
 "gender": "Male",
 "timestamp": "2006-06-16T07:00:00.000Z",
 "views": "63182",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Trazodone",
   "form": "(pill / tablet)"
  }
 ]
}
