{
 "title": "Kick the Coffee",
 "author": "Eulachon",
 "citation": " Eulachon. \"Kick the Coffee: experience with Yerba Mate & Caffeine (ID 36002)\". Erowid.org. Mar 7, 2007. erowid.org/exp/36002",
 "substance": "Yerba Mate & Caffeine",
 "bodyweight": "125 lb",
 "report": "<p>Most experiences here seem to center around caffeine pills or extreme caffeine use, and not the daily use of caffeine - so here's a review of my first experience with Yerba Mate and replacing that old vice, coffee, with it.</p><p>After being a coffee addict for years I recently heard about Yerba Mate, a caffeine-containing herbal tea that is supposed to have less of the side-effects of caffeine due to the synergistic effect of the other compounds.</p><p>My caffeine tolerance is relatively low - perhaps I am sensitive to it. When drinking coffee my hands get shaky, my mind feels spacey for awhile at first and I always suffer a bad 'crash' as the effects wear off. I don't like the experience, however I need it to wake up in the morning.</p><p>I bought a 1/2lb of GUAYAKI Yerba Mate tea for $12 at a local headshop. Recommended dose as a coffee replacement was 1 tsp in 1 cup of tea. I decided to try it half strength due to my low tolerance. I tried it in the morning after half a week of bad insomnia, while barely able to open my eyes.</p><p>8:30AM - Drank 1 cup Yerba Mate tea, 1/2 tsp powder steeped 3min, drank straight up. A pleasant taste not unlike most teas. Also ate a bowl of honey nut cheerios.</p><p>+5min - no caffeine 'rush' as coffee has.</p><p>+10min - increased alertness, kind of creeping up on me as opposed to coffee.</p><p>+15min - talkative/energetic/alert, vision crisp and clear. Very awake. No side effects (jitters, spacey feeling) as from coffee. Slight exhilaration.</p><p>+30min - plateau, no feeling of excess energy anymore but still alert and awake. Got to work and did some work that I'd been putting off for awhile. General mood elevation.</p><p>10:30 (+2h) - very slight drowsiness creeping back in but still clarity of vision and thought, concentration fading a little.</p><p>11:00 (+2.5hr) Getting kind of drowsy but still capable of doing work well. Hungry</p><p>11:30 (+3hr) - Approaching baseline. No 'crash' but more of a gradual fading.</p><p>12:00 (+3.5hr) - More awake than I would be with a cup of coffee in the morning, about the same as if I skip the coffee.</p><p>14:00 (+5.5hr) - This is when I would normally be devastated by coffee crash and need to drink more. Instead I'm just kind of drowsy.</p><p>Overall I was very happy with the experience as a coffee replacement and would recommend it to anyone who wants to break the hold of coffee. I found it pleasant and enjoyable as opposed to the daily ritual of coffee and will continue using it in the mornings.</p><p>I will try increasing the strength next time to see if it will last longer, or perhaps I will just drink another one later in the day to top up. I recommend purchasing a gourd and bombillo to drink from, or a press-type coffee maker to use as the little bits of leaf tend to end up in your mouth, a teaball cannot strain them all out, yuck. Luckily they sink to the bottom, so it is possible to brew with a teaball.</p>",
 "year": "2004",
 "id": "36002",
 "gender": "Male",
 "timestamp": "2007-03-07T08:00:00.000Z",
 "views": "37164",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 tsp",
   "administration": "oral",
   "substance": "Yerba Mate",
   "form": "(tea)"
  }
 }
}
