{
 "id": 3601,
 "title": "It Killed My Brother?",
 "date": {
  "submission": "2003-12-01T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jason",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I came across erowid while trying to find out about cases of death caused by the drug Adderall. I am not submitting this report to scare anybody but rather make people think twice before abusing this medication. It is very hard for me to write this because I am still getting over the lose of my brother Tim. Adderall is the answer to a lot of people who struggle with learning or have behavior or attention problems. It is for the most part safe and effective if used properly. If not used properly you may end up like my dear brother. I will make my statement as quick as I can. Tim was supposed to graduate this year (2003) but an event changed that forever on a day I will never forget. Tim had been prescribed 40 mg of Adderall daily. He was in the process of increasing his does because he felt as though he was getting tolerant to it.",
  "He made a terrible decision of increasing the dose on his own.",
  "Having been sick for a week he had to make up 2 hard tests after school and then hurry to football practice. While nobody knows what he was thinking we know by toxicology reports and counting the bottle of Adderall that Tim had taken between 100-120 mg of Adderall. He proceeded to football practice and collapsed during the beginning work out. Tim never woke up. His cause of death was a massive heart attack. There are three theories to this heart attack. Heat, over dosage of adderall, or a combination of both.",
  "Thats all I need to say. Think twice before messing around with the stuff. I only wish that Tim had read a report like the one I am submitting."
 ],
 "erowid": {
  "id": "21585",
  "citation": " Jason. \"It Killed My Brother?: experience with Amphetamines (Adderall) (ID 21585)\". Erowid.org. Dec 1, 2003. erowid.org/exp/21585",
  "substance": "Amphetamines (Adderall)",
  "views": "52460"
 }
}
