{
 "title": "Smoking the Seed",
 "author": "Goathead",
 "citation": " Goathead. \"Smoking the Seed: experience with Argemone spp. (Prickly Poppy) (ID 36028)\". Erowid.org. Dec 30, 2009. erowid.org/exp/36028",
 "substance": "Argemone spp. (Prickly Poppy)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.5 bowls",
   "smoked",
   "Argemone spp. ",
   "(plant material)"
  ]
 ],
 "report": "<p>I gathered the seeds of a white flowered, blue and green variegated leaf prickly poppy near a wash in southern arizona (elevation~4000 ft.) in late july. This is the only species I've seen in the state, but I haven't keyed it out. I've noticed them flowering from in locations ranging from Tucson down to Patagonia from june all the way to the present mid-august. I'm under the impression that all of the argemone species in the southwest have similar chemical constituents.</p><p>After drying the seed in the shade, I ran it through a clean coffee grinder, and turned it into a fine powder. It would have been easier to smoke if I had left it a courser texture. In the section on Prickly Poppy in one of his medicinal plant guides to the southwest, the herbalist Michael Moore recommends breaking up the seeds before smoking them, to prevent them from popping in your face.</p><p>One evening at home with nothing to do, a friend and I loaded my chillum (pipe) with less than a teaspoon, and put the flame to it. It smoked smooth, didn't hurt the throat, but we didn't feel anything for a while. We loaded up 2 more bowls and smoked them before the effects were pronounced. This was a period of maybe 25 minutes. The effects we noticed and were able to articulate were: a mild stoned feeling, similar to marijuana; a feeling of a slight headache which was only in one distinct part of the head, and was not painful or even really annoying (I noticed this, my friend didn't get a headache); a feeling in the lungs of having smoked too much- just a general harshness I guess. The effects were noticeable for at least an hour, maybe more, I didn't keep track. I did get the feeling that smoking this stuff isn't good for you, but I don't think its much worse than pot or tobacco.</p><p>While some effects were pleasurable, they were pretty mild. I don't get the impression that this is a visionary medicine (entheogen), and for that reason I lost interest. I'll probably try it again, but not for a little while. It is quite common in some areas and does have an effect on the conscious mind.</p>",
 "year": "2004",
 "id": "36028",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-12-30T08:00:00.000Z",
 "views": "8959"
}
