{
 "id": 3604,
 "title": "Overload",
 "date": {
  "submission": "2004-07-13T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.25 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "2:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "powder / crystals"
  },
  {
   "time": "3:00",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": ""
  },
  {
   "time": "3:05",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "pill / tablet"
  }
 ],
 "report": [
  ".25g Cannabis, 10mg 5-MeO-DiPT (T+02:00) + 10mg (T+03:05), 1.5g mushrooms (T+03:00), 6mg melatonin",
  "T+00:05  Mellow cannabis buzz begins, which will later blur into other chemicals' effects.",
  "T+03:00 Immediately after ingestion of shrooms, effects from DIPT begin.",
  "T+03:30 Psilocybin effects increasingly augment anxiety side effects.",
  "T+04:00 While watching Fear and Loathing in Las Vegas w/ surround sound speakers in an overstimulating environment, effects compound into an experience roughly comparable to consumption of many hits of acid, including full blown open-eyed visuals, audio distortions, and inability to maintain mental control noted.",
  "T+13:00 Only residual tryptamine visual effects remain. No sleep until T+18:00 despite melatonin @ T+08:00",
  "Conclusion:",
  "This experience was incredibly overwhelming and unexpected. The steepness of foxy's dose-to-response curve was underestimated. Partner that took same dose w/ very similar spacing experienced severely disturbing death-related experiences while peaking yet remained emotionally okay after coming down. When scope of trip was realized, an attempt to take tranquilizers resulted in inability to physically achieve administration. Trip would have been most comfortable with much less drug intake, something like 15mg foxy without any other additives or combinations. Mental coherence post experience was only possible due to cooperative co-therapy during experience with the help of others in the group on similar doses.",
  "Notes: No crosstolerance or past use of tryptamines or MDMA/MDA/PMA. High tolerance/habituation with frequent cannabis use. Over 30 days since previous psilocybin experience. Environment was changed at T+08:00 to attempt reduction of panic feelings and anxiety; dark room with soft light and no background noise was used. During tryptamine visual stages, green and red color distinction patterns were especially noted.",
  "Negative side effects: Slight nauseau from T+06:30 to T+07:20; Partially controllable muscle clenching/twitching, especially in jaw and arms. Slight unconscious grinding of teeth."
 ],
 "erowid": {
  "id": "21592",
  "citation": " Anonymous. \"Overload: experience with Cannabis, 5-MeO-DiPT, Mushrooms & Melatonin (ID 21592)\". Erowid.org. Jul 13, 2004. erowid.org/exp/21592",
  "substance": "Cannabis, 5-MeO-DiPT, Mushrooms & Melatonin",
  "views": "10893"
 }
}
