{
 "title": "Bearing the Burden",
 "author": "In6games",
 "citation": " In6games. \"Bearing the Burden: experience with Valerian (ID 36058)\". Erowid.org. Oct 28, 2009. erowid.org/exp/36058",
 "substance": "Valerian",
 "bodyweight": "230 lb",
 "report": "<p>I'm a deeply religious person, and I exert energy of great intensity and effort into the care of my soul. I realize that most people might feel that church/synagogue/mosque/temple is the last stop to being institutionalized, but for me, struggle in the spiritual life fumigates my life with a great deal of profundity.</p><p>I'm at a crossroads in life right now (worrying about how to continue financing college, moving to a new town, everyday stress and strain, I guess) and I have found that Valerian root quiets my anxieties and calms me so that my mind moves slow enough for me to hold onto thoughts and figure out where I am going with my life (or, rather, where life is taking ME). Don't know about the rest of you folks, but I love my solitude...my room is definitely my sanctuary. I usually take Valerian caps either when I'm feeling a panic attack coming on or when I want to deliberately change my stream of consciousness.</p><p>For me, Valerian is extremely psychoactive. A strong and immediate come on, sometimes too strong if for some reason I forgot I've just taken it (if you knew me you'd know I forget why I walked across a room sometimes) it hits me so hard reality stops for a second and just sort of 'hangs there' for a minute until I adjust. Then a creeping kind of mellow feeling (euphoric, really) that lasts for a good long time and leaves me with a nice afterglow. The body slows down, but the mind releases thoughts at a much slower rate so I can get control of my mind and meditate. Sometimes it's so intense that I gotta just lay on my bed in a kind of coma/cocoon/shell until it wears off. The label says 'Use caution when operating machinery or driving'. Yeah, but I can't even MOVE right now. I guess we humans really do need constant stimulation, cause even back in the day when I was blunted off some mad crazy Indica (college classes keep the wheels in motion, but everyone knows the 'Bis is the ultimate 'higher' education) I always found time to break into my spirit and take stock of the theological.</p><p>Anxiety just melts away. Side note - I did try 2 Xanny tabs one time chillin' in my dorm and it emptied not only my brain of all thought, but my head of my brain as well. Nothing in there but air, dude! Then it all went to my feet and I was like, 'I think I like this' - until I had to crash on the couch cause my feet were just bouncing all over the place.</p><p>Anyway, Valerian is the ultimate in stress relief and at least for me, really soul cleansing. Safely relives anxiety cause I usually have to lay down and just sort of levitate there on the bed till it wears off. And yo, I like that it has anti-spasmodic properties, cause I probably need an anti-spasmodic ;-).</p><p>Like I said, maybe because I'm so spiritually inclined drugs hit me harder than most. As for me, I follow the Nazarene, but I give props to all the seekers out there. All I know is, Valerian is my new herbal of choice cause I don't rock the ganj anymore (too expensive).</p>",
 "year": "2004",
 "id": "36058",
 "gender": "Male",
 "timestamp": "2009-10-28T07:00:00.000Z",
 "views": "11671",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  }
 }
}
