{
 "title": "Absinthe Experiment",
 "author": "Aseem",
 "citation": " Aseem. \"Absinthe Experiment: experience with Wormwood Extract (ID 361)\". Erowid.org. Jun 11, 2000. erowid.org/exp/361",
 "substance": "Wormwood Extract",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Wormwood",
   "(liquid)"
  ]
 ],
 "report": "<p>Ok, I ordered a fluid ounce of wormwood extract from an ethnobotanical company. The bottle was marked with poison symbols, which made me a bit apprehensive. I read somewhere that the proper proportions to make the fabled Absinthe was 1 cup of Pernod to 1 teaspoon of wormwood. I didn't feel like buying Pernod, so I cracked open the wormwood bottle and added a teaspoon to a cup of Absolut vodka. The wormwood was very dark and had a very strong odor, kinda minty but with a distinctive edge to it. The oil was very hard to wash off the spoon, it stained it green, and the spoon smelled like wormwood for a while. This worried me, considering I planned to pour it down my esophagus.</p><p>I mixed it vigorously, covered the cup in Saran wrap, and placed it in a refrigerator for two days. After the wait, I stirred it up and strained it through a rag, removing a resiny layer that had separated from the mixture. The resultant mixture was a cloudy green, it looked a little like bong water, and smelled even worse. The white plastic spoon I used to mix it was colored green, and wouldn't wash easily. I was getting apprehensive about the stuff, and the smell was making me queasy.</p><p>I mixed a shot of the mixture with lots of water and sugar. It did not turn opaque white, as I read it should. Summing my courage, I started drinking the 16 oz concoction. It had a strong taste much like the smell of wormwood, and made my stomach very queasy. Every sip I took made me gag and make sour faces. I don't know if my reaction was psychological because I was afraid of the stuff, or if I just didn't like the taste, or if the stuff really was bad for me and my body was complaining. I put red Kool-Aid crystals in it to make it more palatable, but it didn't help. I gave up after a quarter of the cup.</p><p>I think I got a buzz off it, there was a drone in my head and I felt like I was on painkillers, but I think I need to drink more. I ate alot of food and drank water afterwards, but the horrible taste was hard to get out of my mouth, I think it coated my alimentary canal like it did the spoon. This thought was not pleasant.</p><p>I think I am going to just try and down a shot of the wormwood and vodka without diluting it, and hope I don't vomit it out. That will take some courage, though.</p><p>Does anyone have any experience with this, did I do anything wrong? Any suggestions or dire warnings? If I don't get any negative feedback, I'm just gonna down the shot and hope for the best, and then post the results.</p><p>I'm open to ideas and suggestions. Wish me luck!</p>",
 "year": "1995",
 "id": "361",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-11T07:00:00.000Z",
 "views": "187005",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "(liquid)"
  }
 ]
}
