{
 "title": "Horse Killer Might be Good for Horses",
 "author": "John R",
 "citation": " John R. \"Horse Killer Might be Good for Horses: experience with Salvia divinorum (ID 36314)\". Erowid.org. Apr 14, 2006. erowid.org/exp/36314",
 "substance": "Salvia divinorum",
 "bodyweight": "220 lb",
 "report": [
  "<p>This may not be helpful as a record of an experience, but it might be of some comfort to people in the same position as me.",
  "Well, it has to be said that I don't think there is any street drug I haven't tried, so moving into the world of legal psychoactive substances was a new thing for me.",
  "(Before I write about my experience of Salvia, a bit of background might be helpful).",
  "I'm nearly twenty years old, and those short years have been a rough time for sure, and I have used drugs (mostly Cocaine) as a form of escapism for the last three years. I've suffered from quite bad depression, coupled with some manic episodes, and a severe case of alcoholosm. I say 'for the last three years' - the only drug I take on any sort of regular basis now is Cannabis, in the form of Skunk, because I know that when I do I'm gonna be absolutely on top of the world for about six to eight hours.",
  "Still - having made progress, in the form of getting off (nearly all) drugs and alcohol, escaping the depression and the manic episodes and generally clearing my life up, I am feeling pretty damned happy generally at this point in time. I smoke a fair bit of tobacco - it keeps me calm, which I find is of benefit to me and others around me, and rather than drinking two bottles of Vodka a night, I'm in the happy position of having on average two cans of beer a week. This isn't through forcing myself not to drink, it's just happened that way through circumstance.",
  "Of course, all of the above had to have a cause, and there are many - but the most recent was a very difficult relationship with a girl I met at university.",
  "Still - enough background - onto the experience.",
  "I guess I wanted to try Salvia, after a friend recommended it to me, and I did some reading on it. Initially, I thought 'I've never heard of this - so it can't be that good', but after reading some other peoples experiences, there was one thing that really interested me: that people have reported being able to gain a sense of understanding of the situations they have been in recently, during or after taking Salvia.",
  "Of course - women are hard enough to understand at any time, but the situation I've been in with the particular girl mentioned above could be described in understated form only, as 'completely incomprehensible'.",
  "So off I went, searching round the internet for some of the extract my friend had recommended to me, and ordered a gram of 20x extract, and a gram of 40x extract. Of course, I can hear the cries of 'you idiot!' of starting out on something that strong, though what comes below may quieten them a little.",
  "Now - I'm doing a four year course at university in chemistry at the moment, so I am gaining a pretty good (general) understanding of how drugs work through my studies, and with my more dangerous forays into the world of narcotics, I have a fairly good understanding of what they do from that point of view as well. I've also learnt how to use them safely.",
  "Still, a few days after the order, a couple of small brown packets turn up in my mail, and I open them excitedly. Inside are the extracts: I'd been looking forward to trying Salvia ever since I hit that 'Submit Order' button on the websites I bought it from. I'd allready planned how I was going to take it, arranged a watcher/sitter, decided what atmosphere would work best, and made my room safe for taking a trip.",
  "I sit down and eat some lunch, counting the seconds till my friend arrives - and EVENTUALLY, he does.",
  "We go up to my room, and I show him the information about the drug, so he can know what to expect, and set up a bong.",
  "Erring very much on the side of caution, I put probably less than 0.05g of the 20x extract into the bowl, smoke it, holding the smoke in for thirty or forty seconds, and exhaling slowly, and lie down on my bed with my friend sitting next to me, having asked him to let me be quiet and close my eyes for 15 minutes or so.",
  "After about half an hour has passed, I open my eyes, and see my friend looking at me. 'Was it fun?' he asks expectantly.",
  "The simple answer was no - what I'd smoked was too little to have any effect whatsoever. I had retained full consciousness of the room around me, and had wasted thirty minutes listening to him breathing.",
  "Undeterred, I decide to try another hit. Having read that some people find joints a suitable way to smoke Salvia, we agree that it might be worth a try in combination with the bong, and use the same amount (perhaps a little more), twice over - one lot going in the bong, and one rolled into a joint. Following the same process of inhaling deeply and holding it for half a minute or so for both the bong, and the drags on the joint, I lie down again, expectantly, and hope to find myself somewhere on the edge of oblivion.",
  "After twenty minutes, it is quite clear that doses of the size I was trying were not having the required effect. After getting a drink, and taking a break for half an hour to listen to some relaxing music, I rolled another, larger (probably 0.2g 20x extract or there abouts) joint, and put about the same again into the bong. Deciding to go for the bong first, I smoke it, and follow the same process of inhaling deeply, holding, and exhaling slowly, and again lie on my bed.",
  "After fifteen minutes, the result is negligible. I felt a little warmer than I was before, and was perspiring a little - but the effects couldn't even be considered as strong as weed or hashish. There was no altered perception, and if anything, I felt more aware than I was before I smoked the bong. It became evident that even this dose was not sufficient, and I smoked the joint, followed by another of the same size. Again, no effect.",
  "By this point, both my friend and I were wondering whether we might have been ripped off, and sold something that looked and (apparently) smelled like Salvia, but that in fact wasn't. I pointed out to him that the 40x pack lay unopened, and that that might be worth a try.",
  "Doing some simple sums (both extracts were standardised, so we agreed that this was possible) we calculated how much of the 40x would be a safe start, given that nearly half a gram of 20x had failed to produce any of the desired effects. Working on the assumption that I had been ripped off, we recalculated an initial dose of 40x extract, that would theoretically be simillar to the 20x extract, put it in the bong, and again I smoked it, and laid down.",
  "Having made the room as silent as possible, I shut my eyes, and tried to clear my mind of all thoughts bar one: the image of the girl I'd been having difficulty with recently. It wasn't difficult to get an image there: I love her dearly, and probably will till the day I die, though circumstance and past histories have unfortunately prevented us having a future together.",
  "Eventually, my watch beeps for the hour, breaking the silence, and telling me that 25 minutes have passed, during which time I have again noticed no alteration in perception, and no physiological effects whatsoever.",
  "I sit up, turn to my friend and shake my head. He laughs at me, and reminds me that 'it's all about the mission', and why don't I give the big one a try?",
  "I think about it for a few minutes, and discuss with him what a much larger dose might do to me. We agree that as I've had acid trips before, and that he has kept me safe on those, and can physically restrain me if he needs to, that it might be worth an all or nothing effort.",
  "So, with slightly shaking hands, I divide what remains of the 40x extract into two, and put one pile into the bong. I take the rest of the 20x extract remaining, and roll it into a smallish, but strong joint - exchange all the usual 'if anything bad happens' things, and light them up.",
  "It should be mentioned here that I had had a couple of cans of beer, and a couple of shots of vodka on one of our breaks, so by this point, the alcohol would have been in my system.",
  "I manage to get four or five hits off the bong - good ones anyway - full lung fulls of smoke held for 45 seconds a time, counted out on my friends stopwatch. I then move immediately onto the joint, using a lighter under the end every time I take a drag, again holding for 30 seconds on each painfully large intake of smoke, and fall back on my pillow.",
  "I don't know what it is about me that makes me immune to Salvia Divinorum - but that dose also did absolutely nothing for me.",
  "I fell back on my pillow, not for the effects of the drug, but simply for the pain in my throat at the harsh smoke, and the long holds I took. I stayed there for ten to fifteen minutes, feeling depressingly sober, and unaltered.",
  "After a few minutes cursing myself, my friend and I sat down, and tried to look objectively at what could have gone wrong.",
  "We knew that in principle, joints were not as good as bongs, but having tried both, and found no effect, we couldn't see that there was a problem there.",
  "We also knew that Salvinorin-A has a high boiling point - but that having tried dragging off the joints with a lit lighter under the end, and having inhaled slowly and deeply from the bong, also with the lighter there the whole time, it was unlikely to be the case that I wasn't vapourising the compound.",
  "We considered too that the chemicals in tobacco in the joints might be interfering with the Salvinorin-A, but that my having smoked bongs without tobacco ruled this out.",
  "We considered also the possibility that I had been ripped off by two separate internet stores - the products smelt, appeared, tasted and burnt the same after all - instead of both being genuine, they could both be fake - but this, though possible would seem to be highly unlikely, given the information I had read about the appearance/taste/smell etc, and unlikely for the sheer probability of this happening anyway.",
  "In the end I guess it comes down to one thing. Immunity. I don't know whether it's that I havent smoked enough, or whether I've made some catastrophic mistake in how I was smoking it, or indeed whether I've miscalculated the doses wildly - but the drug had no psychological effect on me whatsoever.",
  "I have about half a gram of the 40x extract left, which I'm going to ask the friend who first told me about Salvia to try, to see whether it really is immunity, or a problem in the method, or that I've been ripped off. For the record, he normally smokes no more than 0.25g of 10x extract, and this is enough to send him into a full blown alternate reality trip.",
  "I tried one more bong before I started writing this, again with no effect, and I'm inclined to say that I think there's something about my physiology that prevents me from feeling the effects.",
  "All in all, it's been a pretty dissappointing day. My sitter has gone home, its half one in the morning, I'm thinking far too much about the girl, and I still don't have any of the answers I'm looking for.",
  "I suppose I'll console myself with something I just saw elsewhere on the internet: 'They did a head count in heaven last night, and one Angel was missing. Give them a call and let them know you're ok...' That's the one thing I do know that was true.",
  "If you're reading this having had a simillar experience (or lack thereof), you have my sympathy - I feel pretty gutted that I've spent fifty quid trying something that would have been great if it had worked, but that apparently does nothing for me. I could have got a quarter of skunk for that, and had a fantastic party with my friends.</p>"
 ],
 "year": "2004",
 "id": "36314",
 "gender": "Male",
 "views": "5326",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2006-04-14T07:00:00.000Z"
}
