{
 "id": 3631,
 "title": "Transformative and Cleansing",
 "date": {
  "submission": "2007-01-12T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Satyr OZ",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "tea"
  },
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Yesterday, on a whim, I decided that I would drink a cup of wormwood tea after work. It was easily obtainable from the local pagan herbcraft shop. When I got home I set the water to a boil and then took a toke of marijuanna, afterwards the strange brew was quickly prepared, but ingested slowly due to the extreme bitterness of the herb. I said a prayer to the plant spirit and asked to be guided on my communion with it. My friend whom I shared the experience with did likewise.",
  "For awhile I felt fine. I wrote a poem, as a clarity begin to seep across me. Then I decided I would play music for a little bit, until the hunger overcame me. By this time I had finished the drink, and felt that it would be good to eat something, so I made some spicy Thai noodles, with vegetables and tuna cooked in curried cocanut milk.",
  "It was very enjoyable until about ten minutes after I had eaten and taken the second toke off the bowl of weed. I begin to feel an anxiety that was overwhelming. I know longer had any direction as to what to do with myself and started pacing back and forth, drinking water. The high was very spatial. I felt that I was very alone. It had induced a sense of the fragility of life.",
  "I had to go for a walk. It was cold outside, around 35-40 degrees faranheit. My right underarm begin to sweat profuesly (later I smelled the shirt at armpit level and it smelled of wormwood) Walking calmed down the initial anxiety, and I was able to talk with my friend about what I was experiencing. It did not have the same anxious effect on him, and he was able to act as a guide. It had opened up my chakras, and I felt a 'KNOWING'. My third eye buzzed heavily, and I felt energy coming into my body from the crown.",
  "When we got back to my house my body was shaking. I drank more water. My friend did some Reiki on me, and this helped me to integrate the energies in my body that I was experiencing. I then took a bath, and was extremely relaxed. During the bath I received further insights into various aspects of my personal transformation. Overall it felt as if the wormwood had helped me purge repressed feelings and emotions that surfaced in the anxiety stage. This was tremendously useful. It helped me to clear out emotions that I had held in my body. The anxiety stemmed from the emptying out of those negativities. With Higher guidance I was able to fill those areas with light instead, and fortify the Light Body.",
  "It was definitely a shamanic experience, and I feel it has helped me on path of self healing, which will in turn help me help others with their transformative processes."
 ],
 "erowid": {
  "id": "21675",
  "citation": " Satyr OZ. \"Transformative and Cleansing: experience with Wormwood  & Cannabis (ID 21675)\". Erowid.org. Jan 12, 2007. erowid.org/exp/21675",
  "substance": "Wormwood  & Cannabis",
  "views": "29131"
 }
}
