{
 "title": "Fun With Too Much Nausea",
 "author": "Hoppinmadd1",
 "citation": " Hoppinmadd1. \"Fun With Too Much Nausea: experience with  Morning Glory (Heavenly Blue) (ID 36312)\". Erowid.org. Jan 6, 2008. erowid.org/exp/36312",
 "substance": " Morning Glory (Heavenly Blue)",
 "bodyweight": "150 lb",
 "report": "<p>I had been wanting to try morning seeds for a few years but never had purchased any from the store to try because of the warning of the poison coating causing nausea. Recently I finally went to a popular website and purchased an ounce of untreated heavenly blue morning glory seeds. I read several experiences and decided to not make a tea or extract the LSA but just to eat the seeds and hope for the best. I made 6 piles of 50 seeds each and chewed each pile extremely throughly. Contrary to other experiences that I have read the seeds did not taste that terrible. By the time I got to the last pile of 50 I could felt some mild dizziness and my legs felt a little funny.</p><p>Around 1 hour later I started experiencing some pretty bad stomach cramps. I was expecting these from eating the seeds but thought that I could deal with it. I was wrong. I was beginning to feel slightly stoned but it was unpleasant due to the nausea. I went to the bathroom and forced myself to vomit. I did this at least 5 different times. I never could empty my stomach it seemed and my mouth was very dry. I drank some water and this made the nausea even worse but then is when I vomited almost all my stomach contents up. This was about 3 hours or so after I ate the seeds and around 1 a.m. in the morning.</p><p>I was still feeling lightly stoned but it was an unpleasent feeling. Somewhat like having had way too much caffeine and having stayed awake for too long. I decided to try and go to sleep because the nausea was way to intense for anything to be fun. I went quietly upstairs and laid in my bed. After about 30 minutes of laying in the dark with my eyes closed and the cool air conditioning blowing on my I began to feel really really good and extremely stoned. This was nearly 4 hours into the trip.</p><p>I saw intense colors with my eyes closed and I had a very light body buzz. The house was creaking and settling and when one of these pops occured I could just think of the sound it had made and I actually heard it in my ears again. My thoughts were not very clear and I started to have hallucinations similar to daydreams or when you go to sleep for just a moment and start to see images in your mind. I was feeling very high and can't really remember any of these except the fact they occured. Same as daydreaming, you hardly remember them afterwards.</p><p>I laid in bed for about an hour in the dark in quiet with the cool air blowing on me and it has to be one of the most pleasent hours I have ever experienced in my life. The overall good feeling I had cannot even be explained with words was overwhelming. I could touch one part of my body and the feeling of my touch would seem to carry out similar to throwing a rock in a pond. </p><p>I decided to get up and listen to some music to liven up the trip and came to my computer and put on headphones and put on some pink floyd. Not even 10 minutes after getting out of bed I began to feel nausea again. I was sick a few more times and then my trip began to subside and I had a strange washed out feeling over me.</p><p>The overall experience with this was unpleasant except for that one brief period while I was in bed. I don't have that much experience with hallucinogens so it is new to me. It seems to me that this drug was at its peak about halfway into the experience. If I had it to do over I would make a tea from the seeds. The substance causing nausea is supposedly in the shell of the seed. Also I highly suggest being in a sensory deprived area because it seems to intensify the effects. I don't know if the over stimulation had an effect on the nausea or not.</p>",
 "year": "2004",
 "id": "36312",
 "gender": "Male",
 "timestamp": "2008-01-06T08:00:00.000Z",
 "views": "4282",
 "dose": [
  {
   "time": "0",
   "amount": "300 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ]
}
