{
 "title": "A Cheerful and Productive Day",
 "author": "bevz",
 "citation": " bevz. \"A Cheerful and Productive Day: experience with 4-Methylaminorex (ID 36337)\". Erowid.org. Oct 15, 2004. erowid.org/exp/36337",
 "substance": "4-Methylaminorex",
 "bodyweight": "128 lb",
 "report": "<p>4-methylaminorex experiment:  let's clean the house!</p><p>Time:  10:20 a.m. on a Saturday</p><p>My household just left for Burning Man, so I want to start off my week of blissful solitude by getting the entire house clean.  Seems like a reasonable excuse to use that 4-Methylaminorex we've been holding on to for a while now!</p><p>Capsule said 18mg, but I measured anyway.  Came out 10-14, so call it 12.  Insufflated in two snorts.  Initially seemed smooth but burned after a few minutes.  Glad I only used one nostril.</p><p>T+10 min - The post-nasal drip starts.  Very unpleasant.  Drank some soy milk and then ate a little yogurt to coat my throat.  Seems OK now.  I'm experiencing some mild warm flushing all over, and am feeling a wee bit speedy.</p><p>T+20 min - All burning is gone, feeling pleasantly energized and focused.  May set new speed record for cleaning the house unless I get caught up in micro-cleaning and tidying.</p><p>T+40 min - House cleaning is fun!  Whee!  But perhaps it isn't necessary to vacuum the front doormat.</p><p>T+60 min - Feeling warm and pretty amped, though not in a jangly way.  I seem to be not getting much higher at this point.</p><p>T+120 min - I feel pretty 'normal' - no particularly strong speediness other than a little shaking in my hands, and a lot of energy.  No jaw clenching, but I do find myself chewing my tongue, which is typical for me on stimulants.  Not a lot of hunger, though I am going to make myself eat something.  Off to go shopping now - we'll see how this is out in public.</p><p>T+7 hours - Just got back home after an afternoon of driving around and shopping.  My companion indicated that I didn't seem off-baseline at all, just energetic and happy.  This feels similar to modafinil in that I feel awake but sort of...smooth.  No edginess, and in fact a mildly calm and cheerful feeling.  I feel a bit physically tired from all the walking around, but am still quite alert mentally.  The only time I felt slow was when I realized I hadn't eaten much - there's definitely appetite suppression going on.  Got a piroshky from a sidewalk stand and felt immediately fine again.</p><p>T+9 hours - Went to a casual dinner party. Food looked good but I didn't have an overwhelming desire to eat it.  Ate lightly, had two small gin and tonics.</p><p>T+13 hours - Off to a late-night play that some friends are in.  My energy is starting to flag at this point - lots of yawning.  Very gentle come-down, but I definitely feel like I've been moving at high-speed all day and am ready to rest.</p><p>T+15 hours - Home from the play; thought I was ready to sleep but another snack revived me enough to go over to my friends' house for a while.  Still feeling a bit tired but not as much as I should be for having done so much today.</p><p>T+16 hours - And now to bed.  I actually feel like I could stay up later, but am feeling overstimulated from my day and am ready for quiet. </p><p>Next day:  I was able to fall asleep pretty easily after reading for a few minutes.  No Xanax or other sleeping aids necessary.  Woke up after about 5 hours when the cats demanded breakfast, then went back to sleep for 3 more hours.  Now am feeling a little groggy but otherwise great.</p><p>Bottom line:  I had a productive, cheerful, enjoyable day on 4-methylaminorex and would definitely do it again if I could find more - next time probably for a creative project rather than such a physical day, just to compare the effects.  I would also try taking it orally to see how that affects the timetable.  The one thing I would advise is to remember to eat in order to fully benefit from the stimulant effects - twice I thought I was coming down, and eating a substantial snack brought me right back.</p>",
 "year": "2004",
 "id": "36337",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-10-15T07:00:00.000Z",
 "views": "16723",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "12 mg",
   "administration": "insufflated",
   "substance": "4-Methylaminorex",
   "form": "(powder / crystals)"
  }
 }
}
