{
 "title": "Riding the Neon Carousel",
 "author": "James",
 "citation": " James. \"Riding the Neon Carousel: experience with Salvia divinorum (10x extract) (ID 36374)\". Erowid.org. Jan 6, 2008. erowid.org/exp/36374",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>Mind set: Over the past year I had been studying Salvia online for a while. I made sure I knew the plant enough before I wanted to try it. The night finally came where I was going to try salvia. I drove to my friends house. I was a little bit nervous to try it. Also I was extreamly excited. I tried to block out anything negative in my head becuase I knew I definitly did not want a bad trip.</p><p>Setting: My friends basement. Mr. Bungle is playing from the playstation. The room is brightly lit. I am sitting on a couch. The room has punching bags and holes in the walls from when we used to throw knives at them. The place looks like a Chinies dojo. With me on my trip are my friends 'R' and 'M.' We had no sitter. My friend R breaks off a marajuana stem to use as a platform in his glass pipe so the Extract does not fall out. R took his hit and passed the pipe to me. I put the pipe to my mouth.</p><p>The Experience: I inhaled the smoked and held it deep in my lungs for about 10 seconds. I blew the smoke out and started to buzz. M took his hit. I began to stare at the wall in front of me. A hallway then appeared in front of me going all the way to the wall. This hallway spun around on its axis. I then noticed that there was an increase in gravity. Neon colors raced by.</p><p>That's when the most messed up thing I have ever experianced happened. I reached out toward the wall. A trail of hands we left behind my hand as it moved around. I then ripped open the wall. Right then and there I had ripped open the very fabric of the universe. Behind the rip in the wall there was only blackness.</p><p>That subsided quickly. His wall then turned from white to blue. I looked up to M to explain what I was feeling but I said 'Check out these tunnels.' I don't know why I said that but as soon as I said that I began moving my hands towards the wall and scooping out the air creating tunnels. These tunnels transformed into a monorail system like the one in Orlando Florida. I rode the monorails and then noticed that the pillow resting on my stomach felt like it weighed about 300 pounds. I soon forgot about the pillow and looked over to M. he was staring at my foot.</p><p>'James, please man, James you can't move your shoe...James please don't move your shoe...if you move your shoe it could take over.'</p><p>I laughed after that for a long time at the stupidity of that sentence. My high was still going strong at this point. I looked over to the digital clock on the TV and it read 1046PM. (NOTE: This is the only sence of time I had through the whole experience.) I then leaned back again and started looking at the holes in the walls. They began to move around all over the wall. I couldn't understand how this was happening. My heart was racing at this point. I leaned back to check the clock because watching the holes move around felt like an eternity. To my surprise it was still 1046. I relaxed once again and looked back to the wall. Then out of the holes came huge red cliffs. That is the best I can describe it. The cliffs were so tall and so vibrant. it reminded me of the grand canyon. I then looked down to the electrical sockets and they seemed to be popping out of the wall.</p><p>That is when all the visuals ended. I now felt very high. Like smoking a few bowls of KB. I took some deep breaths and looked around. I had just realized that when I was under the influance I was completely out of my body. It was like nothing existed but those neon lights. M and R were at the same stage as me by this point. We started to discuss what we had just felt. R told me half way through I began talking about riding a carosel. I don't remember talking about a carosel. Also they told me that I was saying I could rip the wall away, which I do remember experiencing, however I didn't think I told anyone.</p><p>Through out the high themes of birth and death were abundant. I can not explain to you how they tied into my trip but I know that birth and death were a huge part of it. I also felt fear and uncertainty during the trip. Dispite this I absolutely loved what had just happened. It was unlike anything I had ever experienced. Simply put it was a mind fuck. I felt feelings of euphoria for an hour or so after the smoking. I would say the intense effects only lasted about 10 minutes.</p><p>Now I am a salvia beliver and will be smoking it a lot in the future.</p>",
 "year": "2004",
 "id": "36374",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-06T08:00:00.000Z",
 "views": "3166",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
