{
 "title": "Dance or Die!",
 "author": "drhoody",
 "citation": " drhoody. \"Dance or Die!: experience with AMT (ID 3638)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3638",
 "substance": "AMT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "insufflated",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>\nMy one and only experience with AMT was intense. I had gone to a party the night before and had ingested approximately 180 mg of MDMA. I do not know if this affected my trip at all.</p><p>We ingested the AMT intranasally as opposed to swallowing it. The stuff smelled like the nastiest Detroit warehouse I have ever partied in (like bumping something off the floor of the back of the Packard Plant).</p><p>Right after bumping, we went to an ancient Indian Burial site which set the trip off, way off. I felt like I had eaten half a ten strip and an eighth of mushrooms. I had the overwhelming feeling that we had all been to this place before, even though I had never even been in that state before. Visuals kicked in, everything looking colorful and fuzzy. There was a dark archaic feeling hanging over me. The overwhelming feeling was that of the ancient alien DMT experience.</p><p>The later it became, the harder I started tripping. About three hours after ingesting, I felt as though I had taken a ten strip and a quarter of mushrooms. I kept fading in and out of reality, losing time, and having difficulty in communicating with those NOT on the drug. I do not recall a problem communicating with those also tripping.</p><p>We headed back to my friend's apartment and sweet, pounding techno delivered me from the self-colored Hell into which I was descending. I started dancing. I discovered that if I was up and moving that I felt very speedy, not as trippy, like I was methed out. If I sat down, I felt myself being pulled back to that alien nether-space. I danced and danced and danced.</p><p>Eventually everyone went to bed. I could not (as usual, I am ALWAYS the last one to bed). I paced and paced, and thought and thought. It once again felt more trippy than methy. Eventually, I tried laying down. I realized I could not go to sleep because my brain was physically shaking, MAKING A LOUD RATTLING SOUND!!! I know hallucinations, and this was no hallucination. I did not end up going to sleep until 4 am the following night. That was an entire weekend of no sleep. I would say the effects lasted a total of . . . hmmm, at least 16-18 hours.</p><p>While I probably will not take AMT again (well maybe orally, just to see). Just one more vehicle of neurochemicalmetareprogramming to drive our people over the edge.</p>",
 "year": "1999",
 "id": "3638",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-25T08:00:00.000Z",
 "views": "5940"
}
