{
 "title": "Liquified",
 "author": "Spiraline",
 "citation": " Spiraline. \"Liquified: experience with 2C-E (ID 36380)\". Erowid.org. Oct 12, 2005. erowid.org/exp/36380",
 "substance": "2C-E",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-E",
   "(liquid)"
  ]
 ],
 "report": "<p>I have been a kind of entheogenic aficionado for the past few years since an initial encounter with a large dose of fresh psilocybin mushrooms on the shores of Bali.  Since then, I have experimented with perhaps a dozen phenethylamine and tryptamine cousins as well as LSD and various organic sources.  For me, 2C-E is in a class by itself, and presents a real opportunity to explore oneself spiritually.</p><p>I had taken 2C-E twice orally at 20mg, and this yielded a mixture of powerful LSD-like visuals, a beautiful sense of spiritual awe and dread (what I describe as apocalicious  akin to 2CT7), and a clear thought process.  This is not a party drug for me as it is mostly devoid of empathogenic qualities. </p><p>Recently, I upped the dosage to 25mg  refreshingly tasteless in a glass of orange juice.  The response curve apparently rises dramatically.  I had only experienced real ego death (+4) with mushrooms and smoked DPT.  This was an organic type of ego death where I could shamanically morph into whatever happened into my head.  Even six hits of strong LSD, though profound in its own way, did not quite get there. </p><p>With 2C-E, ego death occurred at the peak of the experience  for approximately a half hour - when I decided to quietly meditate on a kneeling stool inside.  I first became engrossed in traveling through the usual fractal imagery behind my closed eyes.  (A student of physics once told me that those who study mathematical fractals see them in both brain and lung structures, as they are a fine way of maximizing surface area.)  As I explored the incomprehensible labyrinth, I witnessed myself split into four or five rotating monoliths (see Kubriks 2001).  Eyes still closed, I (the monoliths) then appeared to be liquefied into some kind of fluid  I think it was bright green  traversing through a capillary vein web.  This was VERY sensual, amoebic, and above all, what I will call pre-ethical.  That is, it was just a process that felt right, what I imagine a plant might feel at the simple joy of moving fluids and living.  The fluids (me) started to move quickly and cycle through, plunging to lower chakras and rising ethereally to higher chakras, only to blissfully plunge again. </p><p>At a certain point, I truly lost my sense of the outer world, but I imagine my body was gliding in slow orgasmic spasms.  I remember thinking, Has someone given me another drug?  Have I been seduced into this world with some kind of music designed to precisely guide the visions of myself?  I am melting into these gorgeous tones.  Have I jacked in to some kind of secret networld, zipping along like a character in a William Gibson novel?  Above all, I was thankful to the person(s) or being(s) who had arranged it  that I could experience a plant consciousness firsthand.  After what I take to be a half hour, I returned to my body and felt the overwhelming need to bow and give thanks to a world that would converge in this way.</p><p>I would very much recommend 2C-E to those who are interested in the spiritual nature of the mind-body, the limits of language, cognition, identity.  Music is quite good at lower levels.  It has got a visual component that rivals LSD.  The body load is light, though there is some tension on the way down.  I want to put a final plug in for the responsible use of these kinds of entheogens.  Plan ahead.  Make for yourself a sacred place.  Do it with gratitude, and pay your respects to life and the planet.  As in most Buddhist thought, the point of one's travels should not be oneself, but to gain insight into how the world can be made a compassionate place (and no, not GWBs brand of compassion).</p>",
 "year": "2004",
 "id": "36380",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-10-12T07:00:00.000Z",
 "views": "7073",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(liquid)"
  }
 ]
}
