{
 "id": 3642,
 "title": "Floatiness and Vivid Imagination",
 "date": {
  "submission": "2006-04-10T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pointless",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "ground/crushed"
  },
  {
   "time": "1:45",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "An hour before the experience, I ate a small meal.",
  "5:30 - I crushed two 150 mg pills of Wellbutrin SR on a glass cutting board and used a fork to scrape them into a cup of cranberry juice. It didn't dissolve well because it was cold, so I had to kind of coax it out of the cup. It left a disgusting taste in my mouth.",
  "6:15 - First effects were noticed. My foot was kind of tingling, but it could've just been falling asleep.",
  "6:48 - I felt kind of hot, and I took my pulse quickly. My heart was beating quickly, and it was pumping really hard.",
  "7:15 - I figured I wasn't going to feel anything else, so I crushed up another 300 mg of pills in a spoon and put them in my mouth. I washed it down with Sprite and water and whatever else I could find.",
  "7:20 - I noticed local anaesthesia on my tongue that lasted for about 30 minutes.",
  "8:21 - Time started to slow down. Maybe I was just anxious or bored, but the music I was listening to seemed to take forever. Time was crawling.",
  "8:32 - Slight headache. I never get headaches.",
  "9:11 - Sitting in my chair listening to music and playing Mario, parts of my body started to go numb. I had no urge to move or do anything but space out. Parts like my feet and forearms seemed to lose feeling.",
  "Around this time, I hopped into bed and turned on Winamp. The room was completely dark, and my playlist was made up of mostly floaty, experimental rock bands like Do Make Say Think, Sigur Ros, and Godspeed You Black Emperor!. The sound and texture of the music were effective in making me float around. I lost equilibrium, and 'down' was a fleeting concept and hard to identify. My imagination was extremely vivid, and I could almost see things I was thinking about. Dreamy images passed through my vision. At one point, I imagined a red and yellow snake coiled up, and it slithered away. The music was especially powerful, and I had no problem listening to it without getting restless for over an hour.",
  "11:40 - I went to bed. I fell asleep quickly. No effects were noticed the next morning at 6:00 AM, and there weren't any significant dreams.",
  "In conclusion, the whole experience was boring, and it pretty much sucked. I wouldn't repeat it, and I blame my liver for the minimal effects."
 ],
 "erowid": {
  "id": "21704",
  "citation": " Pointless. \"Floatiness and Vivid Imagination: experience with Bupropion (ID 21704)\". Erowid.org. Apr 10, 2006. erowid.org/exp/21704",
  "substance": "Bupropion",
  "views": "17441"
 }
}
