{
 "title": "Mushrooms in the Morning",
 "author": "Silas",
 "citation": " Silas. \"Mushrooms in the Morning: experience with Mushrooms & Cannabis (ID 36494)\". Erowid.org. Jan 8, 2008. erowid.org/exp/36494",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I had been considering trying mushrooms for some time. It was to be my first foray into the realm of psychedelics; until then I only had experience with alcohol and marijuana. I read practically everything the net had to say on the subject of mushrooms and psychedelics in general. I decided upon a day to do them with a friend of mine who had previous mushroom experience. I purchased my bag from someone another friend claims was a reputable source; he grew them himself. Armed with a bag of allegedly an 1/8 of an ounce of mushrooms, I threw them in my fridge and waited until the day; I was on no other medications at the time.</p><p>There is a day, chosen randomly, in the spring when all classes are cancelled and the entire campus convenes in the quad from 5am on for a dance party / festival / mudpit brawl. This might not sound like an ideal setting for tripping consider the large number of people around, but having experienced the holiday the previous year, I felt comfortable and was sure the vibe would be good.</p><p>I was waken up that day around 5am and immediately sought my tripping buddy. I was slightly tired as I didn't get much sleep the previous night, but I was full of buzzing energy in anticipation of the day ahead. My friend showed up with a bottle of unsweetened tea. He claimed it made the mushrooms palatable; it did not have this effect for me. I managed to choke about half the bag down, but had trouble swallowing them, until another friend suggest I try some of the cheddar pretzel bits he had. This worked much better; the strong cheese flavor overpowered the mushroom taste and I consumed the rest of the bag without further incident.</p><p>After standing around for a while, a group decided to head to the store to buy liquor, and I was heading out with them, but right as I got to the vehicle I felt a buzzing going through my legs and travelling upwards, and decided I'd better sit still for a while. I sought my pretzel-bearing friend, who provided me with a sofa to sit/lie on. I grabbed his coat, and feeling an incredible need to chew on it, I did so. He replaced the coat with a red blanket that had a fuzzy but cold texture to it, and I found it very appealing. This is probably between 15 minutes and a half-hour after eating the mushrooms, but from here on I stopped paying much attention to time, so my guesses could be off.</p><p>Enclosed by my blanket/chew-toy, I observed that a lan cable on the floor was beginning to wave and undulate, a little heatwave like but slower. It stuck me that it looked like a snake, and I said so out loud, even though I didn't really believe it was a snake. This wave travelled to other objects, including a large set of scuff marks on the floor that I imagined were worms crawling to get me. I started to get worried, but I managed to convince myself I was only tripping and I was safe. Quickly the buzz progressed to my whole field of vision, such that everything appeared slightly washed out, and red took on greater predominance. My friend was playing the Radiohead song Kid A on his stereo, at this point I had a brief closed-eyed visual of a vaguely evil-looking clown or jester. I asked my friend if 'Clowns were engrained in the human psyche?' He grunted some reply and my thoughts moved on.</p><p>Several people came into the room, and I could see a few seconds of them walking, and then it seemed to skip several frames and they were sitting down now, or something like that. Very music-video-esque. It was then my friend returned from the store, and he asked if I was peaking yet. I wasn't, so he left to play outside and I waited on the couch, sweating like pig. After some period of time, my mind could no longer keep my stomach down, and I ran in seek of a trashcan, but to no avail. I resolved to go outside; the indoors felt like it was crushing me.</p><p>It was chilly outside, so I grabbed a hoodie from my room, when I felt a strong desire to vomit then, and did so. It was the most fastastic throwing-up of my life; even as I crouched on my knees heaving into the trashcan, I couldn't help but laugh, feeling how great life was. I jumped up and ran outside towards the quad. The air seemed so fresh, the grass so green, and I was full of energy. I ran about half the way alternating with walking. At some points I wanted to scream at the top of my lungs in jubilation but I restrained myself. There was some difficulty at crossing a road: In retrospect I was probably fine, but I convinced myself I wasn't capable of telling how close cars were, so I surreptitiously waited for another group of students to reach the street and I crossed with them, reaching the quad with no further problems. It was probably around 7am at this point.</p><p>The gathered crowd, blaring music, and paired mud and foam pits struck me as the best party ever, even something of an archetype of 'Party'. Everyone appeared to be following a precise flow-plan of actions in perfect unity with everything around it. I was standing slack-jawed in awe and the scene in front of me when a friend grabbed my wrist and made a throwing motion; I did a martial arts breakfall out of habit into the mudpit, but I got up and went in search of my tripping companion. Finding him I hugged him as a brother and we babbled at each other for a few minutes about the incredibleness of everything.</p><p>The music was the perfect music; it sounded like I was hearing for the first time. Everything I sensed seemed aethetically perfect. I began to feel that we had all reached some archetypal pinacle of perfection. However, rather than dwelling on the mental gymnastics, I tended to concentrate more on the physical effects, touching the hair and clothes of everyone I remotely knew, but not in a sexual fashion at all. I felt this same sense of archetype picking up a random blade of grass. Every now and then, a gust of wind would pick up a stream of bubbles and blow them above our heads, creating an infinite shimmering rainbow cascade of color and light. There weren't any real visual hallucinations, except when my tripping buddy asked if I had any visuals, and a cloud I looked up at appeared to have the shape of a dragon.</p><p>After perhaps two hours of this, the euphoria faded for the most part and I grew confused as to my surroundings, but I wasn't panicking, just going with the flow. At some point I splashed a bottle of water in someone's face. I also remember lying on the grass staring at a guy breakdancing for a while, but I'm not sure how I got from individual events to others. At some point I lost my tripping buddy and another friend wanted to head back to borrow my shampoo. I was confused as to what he was asking about my shampoo, so I started talking about its flavor; it took a few tries to get the idea into my head.</p><p>We walked back and I got the shampoo, but I continued talking at him in the bathroom until he told me to leave. I tried to take a nap, but was still coming down, and couldn't fall asleep. My thoughts started spiralling down, I felt like my consciousness had left the normal world and was residing on this higher plane, and I couldn't escape. I kept drifting back to the words someone had told me, 'mushrooms change you.' I felt I was irrevocably different from everyone else now and so might as well die. I though of ways I might die, but it was too upsetting so I whimpered in silence for a while until my head cleared enough to get up and walk around. I was having trouble adjusting back to reality, so I went to find my tripping buddy to talk to; fortunately he had also come back so we talked about the experience for a while, and I reassociated myself with reality and felt really positive about my experience.</p><p>At this point there was a mild euphoria along with apathy over me. I felt nothing could bother me that day. We returned to the quad to eat, stopping to smoke a large joint on the way between three of us. The marijuana made the trip come back to some extent, making it seem as though my field of vision were much wide, as if my eyes suddenly become more panoramic. Everything also seemed slightly more 3D. This faded in a few hours, and I was completely back to baseline.</p><p>All in all, a very satisfying, and seemingly almost stereotypical, first shrooming experience. I'd certainly like to try them again in the future.</p>",
 "year": "2004",
 "id": "36494",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-08T08:00:00.000Z",
 "views": "3140",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
