{
 "title": "Withdrawl Effex(or)",
 "author": "TMB",
 "citation": " TMB. \"Withdrawl Effex(or): experience with Venlafaxine (Effexor) (ID 36502)\". Erowid.org. Nov 25, 2004. erowid.org/exp/36502",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "170 lb",
 "report": "<p>In 2000- after years of horrible anxiety, depression, and realizing that alcohol and denial wouldn't fix my problems-I began seeing a Psychiatrist at a hospital/university clinic.  Although the therapy and prescription drugs literally saved my life, I will never take any antidepressants again, and I try to give honest information to friends and family who may be considering it. </p><p>When I first went to therapy I was put on Zoloft up to 100mg a day and remained at that dosage for a year. Around that time I found that my symptoms were returning despite weekly therapy with the ZOLOFT.  So my new doctor informed me that the Zoloft had 'pooped out' which I found is the actual term used in pharmocology to describe the meds not helping anymore.  I was switched to Effexor(Venlafaxine HCI) and my dosage was increased up to 300mgs.</p><p>Missing the meds is not a good mistake to make.  When taking Zoloft I noticed that if I had forgotten to take my meds I wouldn't even notice any withdrawl since the half-life is much longer than Effexor.  However on this new medication, I couldn't go a hour longer than a full day! Initially I experienced horrible shock sensations, transient dizziness and disorientation known as brain shivers.  Many doctors hadn't even heard of it at the time, most likely because those above them in the industry had neglected to tell them because they would refuse to prescribe as freely I'm sure. </p><p>Further withdrawl effects included migrane, muscle spasms, twitches, eyes rolling back, spontaneous crying, mood swings, and inability to speak in any coherent manner.  Many people also describe a full return of psychological symptoms, I was too consumed with and scared by my inability to function at ANYTHING to notice this.  I must note however that after smoking a bowl of marijuana, all but the dizziness subsided.  It helped until I was able to take the Effexor and have it take effect again.</p><p>After over a year of 300mgs, I decided to get off of this medication.  In two weeks I rapidly but steadily decreased my dosage on my own.  My doctor had agreed to the decrease but did not know that I would take it upon myself to get down to 37.5mgs in only a couple weeks.  During that time I had NO withdrawl, as long as I took the meds.  Lowered dosage alone didn't cause that. However, even after 6 months of 37.5mg-which is the lowest preparation of the capsule form-I still experience the same withdrawl after only a hour or so of missing my administration of Effexor. </p><p>Realizing that only waiting and Marijuana will help through the withdrawl period, I find myself now setting aside 3 days on my calendar to stay home, have lots of food and plenty of pot. </p><p>To anyone planning on therapy: Research the drugs, and weigh facts out.  Therapy alone will help just as well, it may take a little longer but antidepressant drugs are not the cure, they DO cut out symptoms. However in the long run it is the talking that makes you better.  If you decide to take Antidepressants that's ok, I don't really regret taking them, but I wasn't prepared for the horrible withdrawl, and though I did my research-I was depressed and anything that sounds good is hope in that state.</p><p>To those wanting to discontinue: Talk with your doctor. He/She will help you in the best way possible.  Since you can experience a return in symptoms you need his/her help in getting through any hurdles or experiences.  Remember that you can be in control, and if you are at the point in getting off medications you can get through it.  Also, not everyone experiences all symptoms.  What I described is only what I experience with withdrawl.</p>",
 "year": "2004",
 "id": "36502",
 "gender": "Male",
 "timestamp": "2004-11-25T08:00:00.000Z",
 "views": "18500",
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 ]
}
