{
 "title": "Drunk, Then Stoned",
 "author": "LadyOfTheNutmeg",
 "citation": " LadyOfTheNutmeg. \"Drunk, Then Stoned: experience with Nutmeg & Alcohol (ID 36572)\". Erowid.org. Jan 9, 2008. erowid.org/exp/36572",
 "substance": "Nutmeg & Alcohol",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "",
   "0.5 ",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "report": "<p>Well after coming across reports over the internet about the possible effects of nutmeg I decided to try it for myself. The best approach (apparently) is by using fresh whole nutmeg and grinding it up yourself and comsuming it. I went down to the local herb/natural health food store and was easily able to locate some whole nuts, it cost be AUD$3.60 for 12 whole nuts.</p><p>- Dosage -</p><p>Using a the fine grate on a cheese grater, I was able to reduce the whole nuts to a fine power. I took orange juice and placed three tablespooons into approximately 250mls of orange juice, the texture created being of a thick, fibre drink. Finding the taste strong (but not entirely unpleasant) I split the drink into thirds and drank two glasses (about 2 tablespoons) of the mixture. I found while the taste is almost pleasant when mixed with orange juice (nothing compared to the horrible taste other users describe) the texture was irritating and as I had an empty stomach made me queasy. I did not drink the last glass.</p><p>- Effects -</p><p>FRIDAY</p><p>7:40pm - I drank the two glasses of the nutmeg mixture. I was also drinking canadian club at the time. To really experience the effects impartially, I would reccomend NOT drinking alchohol.</p><p>8:30pm - I was feeling slightly nauseated, not chroically but enough to feel discomfort. I had slight stomach pains and so I decided to do a little self-induced vomiting to quell my nausea (always works). Hardly brought anything up but felt fine and happy afterwards, most likely a mental thing.</p><p>11:00pm - I am considerably drunk and therefore really cannot distinguish the difference between the effects of alchohol or nutmeg. My speech is slurred, I am extremely emotional, sexually charged and feeling quite sleepy. Normally this amount of alcohol (Approx 1/2 a Bottle) Only gets me tipsy, and then I still keep my motor functions quite well.</p><p>1:00pm - I am finding myself extremely dizzy and can hardly stand, so I lie down and fall asleep in the bed. Apparently I was still carrying on conversations that I have no recollection of.</p><p>SATURDAY</p><p>10:00am - I awake after a deep and refreshing sleep. I can feel an unusual lump under my eye that is causing me pain every time I blink, It feels (I even ran my finger over it) like I have a huge mole under my left eye. Upon inspection from my companions and looking in the mirror my eye looks perfectly normal, yet my eye still feels like it has this huge lump. I am finding everything amusing and a delayed reaction to everything I hear, my wits aren't particuarly about me and I am feeling exceptionally hungry. Actually I feel stoned.</p><p>The entire remaining saturday the feeling of being stoned stayed with me, and later in the afternoon I had the feeling that it was a few hours after I had smoked a bowl and the effects were still ingering, lethargic and sleepy. Vivid dreams and a increased sex drive still apparent.</p><p>During Sunday & Monday I had a light, happier outlook on life, 'Mellow' Feelings accompanied by light consitpation, occasional sharp stomach pains and cramps similar to period pain and a loss of concentration. I also had during saturday a severe muscle pain in my stomach, every time I tensed my muscles it hurt like shit. I have a feeling my stomach might have been cramping in my sleep and therefore caused muscle pain.</p><p>I am planning on taking nutmeg again in a high dosage and will most likely report on my experience.</p><p>- SUMMARY -</p><p>Dosage: 2 Tablespoons with Orange Juice</p><p>Effects (Mentally): Happiness, Affected Motor Functions, Giggles, 'Stoned' Feeling that lasted approx. 15 Hours.</p><p>Effects (Physically): Bloodshot Eyes, Mild Cottonmouth, Stomach Cramps (Sharp Pains coming from my stomach), Mild Nausea.</p><p>Lasting Effects (2-5 Days Afterwards): Loss of concentration, Mild Constipation, Heartburn (Feeling of swallowing a corn chip whole...unpleasant), Stomach Pains & Cramps.</p>",
 "year": "2004",
 "id": "36572",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-01-09T08:00:00.000Z",
 "views": "6848"
}
