{
 "title": "Batrachian Dreams",
 "author": "Czernobog aka Mr. We",
 "citation": " Czernobog aka Mr. We. \"Batrachian Dreams: experience with Toad Venom & Cannabis (ID 36584)\". Erowid.org. Mar 13, 2007. erowid.org/exp/36584",
 "substance": "Toad Venom & Cannabis",
 "bodyweight": "215 lb",
 "report": "<p>This was the second time I smoked Toad Venom, and I had known by now it contained some kind of DMT derivative. This time I increased my dose threefold.</p><p>I had extracted the venom an hour ago and had two yellowish chunks of the stuff each about the size of a pencil eraser. By this time I had contructed a better venom smoker, a 20oz soada bottle sawd in half with a wire coathanger bent into a circle. The coat hanger had tinfoil suspended in the cicular wire part of it. I put the first chunk of dried venom on the foil, positioned the bottle directly over the foil, about a centimeter above it, emptied my lungs, and lit the foil from underneath.</p><p>The venom crackled and blackened, and smoldered even without a constant flame. I have even been told a constant flame wil burn it out too quick. I let the bottle 'white-out' with smoke then lifted it away from the foil gently so as not to lose any smoke, and took it all in a short hard inhale. As the first piece was burning I dropped the second hit on the foil and heated both. The smoke in the bottle this time was so thick it looked like you could swim in it. Again, short hard inahle.</p><p>I had hardly used all my lung capacity and had already done more bufotenin than ever before, I was already feeling the trademark heat in my neck and scalp. My dappled area rug looked like it was moving, like duckweed on a turbulent pond. One more big hit, and I exhaled, almost passing out with the combination of dizziness and hallucination. The body effect was more like psilocybin this time, but the visuals were beyond anything I've encountered before. I later found out that the amount of venom I smoked was a heroic overdose. The fellow who supplied it was almost concerned for me. He thoght what he gave me was for 2 or three people.</p><p>About a minute after I exhaled I had the feeling of a being surrounded by large invisible things, studying me. I was a little scared but I've been in worse narcotic purgatories. I smoked a bowl of sticky hydro, which both intensified and calmed the experience.</p><p>Walking around the house I encountred my cat, who is a trip when you're sober. He was letting out deep, guttural meows which he does all the time but they now sounded like the death moans of some alien beast. His fur was like silk, and he seemed to perceive the state I was in and became playful. I couldn't look into his eyes without becoming thoruoghly intimidated. I gave him some fesh catnip so he could enjoy the ride with me, on some level, at least.</p><p>He looked like a picture that was cut out and superimposed onto a picture of the inside of my house. I put on some good music and sat down, smoking the tasty hydro. For a half hour I chatted with myself in a whisper about some idea for a science fiction story I cannot for the life of me remember. During this time, the whole world did not exist. Then the feeling of something, or someone behind me made me run across the room and put my back to the wall.</p><p>My cat, now rolling on the floor with his 'nip, looked up at me and his eyes were like glowing orbs of uranium. I looked around my room and everything seemed filthy. Imagine the effect a blacklight has, when it makes every little bit of dust on your face show up. Imagine that without the blacklight. The most intersting thing I saw was a beam of light hitting the dust in the air, it looke like a solid glittering rod of crystal. I tired to grab it and swear that for a second I felt something solid in my hand.</p><p>I sat down and finished the bowl of weed. At this point my trip began to wind down, the dust specks everywhere became as mundane as before, and Oreo was just a regular cat again. The ivisible giants seemed to stick around, on the edge of my senses for a day or so. This was definitely one of the top three psychidelic experiences of my life. Since then my supply of Toad Venom had vanished. I would very much like to go back to that place again, though.</p>",
 "year": "2004",
 "id": "36584",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-13T07:00:00.000Z",
 "views": "14198",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Toad Venom",
   "form": "(tar / resin)"
  },
  "1": {
   "time": "",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
