{
 "id": 3658,
 "title": "Trials with a Novel GHB Analogue",
 "date": {
  "submission": "2003-09-04T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Renwick",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "GABOB"
  }
 ],
 "report": [
  "Yesterday I decided to try taking the GHB analogue GABOB (gamma-amino-beta-hydroxy-butyric acid ) again. I had tried it previously while I was experimenting with massive amounts of GHB, GBL, 4-Methyl-GHB, GVL, etc. without much success. While taking GBL semi-regularly I experimented with this compound at dosage levels of up to 1 gram without much effect. While it was better than GVL, it still was less potent than Valium or a small glass of alcohol.",
  "I was in for a shock however. I took 200mg of the chemical last night to see if it may help me sleep at all. I waited for it to do something for about 20 minutes then I went to go take a shower. Half way through the shower I started to feel my leg muscles become weaker. By the time I was done showering I thought half an hour had passed but when I got out I saw",
  "it was only 10 minutes.",
  "The effects were almost exactly like Valium, maybe a little weaker. It was definitely more noticeable than with previous trials. I also noticed that it felt like my heart rate was slowed down or altered in some way, it was hard to tell because I had no way of measuring it handy. I wonder if previous GBL cross-tolerance had blocked me from feeling its effects before. The only other things I had in my system where a humus sandwich, some wheat grass juice, and a multi-fiber tablet (which does contain licorice root which may be a mild MAOI). I will have to try a higher dose next time and see if it is comparable to GBL/GHB at those doses, although I would guess that it probably won't be that much more psychoactive."
 ],
 "erowid": {
  "id": "21749",
  "citation": " Renwick. \"Trials with a Novel GHB Analogue: experience with GABOB (ID 21749)\". Erowid.org. Sep 4, 2003. erowid.org/exp/21749",
  "substance": "GABOB",
  "views": "15936"
 }
}
