{
 "title": "Death Experience, Very Negative",
 "author": "shin",
 "citation": " shin. \"Death Experience, Very Negative: experience with DXM (ID 3659)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3659",
 "substance": "DXM",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "210 mg",
  "oral",
  "DXM",
  "(pill / tablet)"
 ],
 "report": "<p>The experience that I had on a relatively small dose of DM was after careful study of the DXM faq by William White. I had done about ten other trips on DM using different doses usually regulated with marijuana.</p><p>It was about nine at night when my roommate and I took about seven or eight pills containing 30 mg each. I smoked some pot about an hour and a half later and was beginning to feel the usual effects. The set and setting were planned and we usually just listened to ambient type music and drifted in space.</p><p>The strangeness came over me in waves and it felt as though I had just climbed onto some kind of a vehicle that I knew was going to crash. I am involved with other energy type training such as chi gong and what I experienced can be described somewhat under that paradigm. Waves of energy came up my spine from my groin and exploded out the top of my head and I then had to go out side to somehow ground myself. I went outside and energy pulsed through my entire body, blew out my hands and head in two huge waves and it felt as though I had died and been reborn. That was not the case. I was then somehow relieved and went back into my basement.</p><p>This is where it got weird. I sat down and at the exact second that I did, I stood up and started to walk up the stairs to go outside again. This time, totally against my own will. I remember talking to myself inside my head saying 'this is from space'. I could not control what my body was doing and it scared me. I continued to be freaked out inside myself and went outside, did the pulse thing again and on the way back downstairs I realized what had happened. Or so I thought. I had died, my body was still in the basement and I was going to do this loop of going outside and exploding into the universe, again, and again and again. This is when it wasn't so liberating. I thought of the paramedics finding me, my fiance getting the call that I had overdosed etc. All of these thoughts went through my mind and it was only my second trip up the stairs.</p><p>I went back downstairs and sat on the bed waiting for it to happen again. I stood up and was trying to do all that I could to not walk up that staircase again. I stood up and started spinning around in circles and this is when my roommate asked what was wrong. I was so fucking glad that I wasn't walking up the stairs again I couldn't talk. I did a lot of stuff repeatedly to convince myself that I was back and alive, like turn the light on and off to prove that I could act on the world and it would react.</p><p>I then spent the next month or so trying to figure out what happened. I didn't know if I was lying there the whole time or if I had been in my body that was walking around and couldn't control it. Still don't know but it made me really glad that I was alive. I have since done more meditation and martial arts than DXM and taken the experience to heart. It is sometimes not so good when something more powerful than me can generate slowly in my body, surges through it instantly. It may have been that aliens came and got me if I was in another frame of mind. At the time there were not these kinds of places to read about this stuff so I submit this to try and give someone freaked out some peace of mind.</p>",
 "year": "1997",
 "id": "3659",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-25T08:00:00.000Z",
 "views": "8303",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "210 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 }
}
