{
 "id": 3660,
 "title": "Fantastically Visual",
 "date": {
  "submission": "2008-01-22T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Backspace",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "55",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "AMT",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "repeated"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Me and a friend had our first AMT experience at a concert last summer.  It was of an unknown dose but was absolutly amazing.  Everyting was moving, patterns were everywhere, and it lasted an amazingly long time.  Eventually, we acquired our own gram of the substance for some experiments.  After trying 40 mg each with positive results, we didnt quite have the same experience we did with the dose we took at the concert. ",
  "This time, we decided to up the dose to 55, with much success.  Popped the gelcap at about 4 o'clock in the afternoon and awaited the results.  In about an hour i started noticing a change and shortly after this i began to get a little bit of nausea which i had experienced before when taking AMT.  The nausea had never made me vomit, but this time it got to me.  At about the hour and a half point i couldnt hold it any longer and threw up in the garbage can.  Immediately after throwing up a few times i felt the AMT surging through my veins.  I popped up, rinsed my mouth out, and was tripping my balls off. ",
  "This time, as opposed to a 30 or 40 mg pill, everything was in motion.  The carpet was shifting and turning, posters and desks would shift and melt, and i felt like a million bucks.  We left our dorm room and headed into a room in the basement and shut off the lights.  In total darkness, intensly intricate patterns appearded anywhere we looked.  Sometimes, the pattens were filled with any and every color, other times they were simply black and white. ",
  "A good way to describe the visuals would be to look into a kaleidascope. When we could focus on the dark wall in the basement, it would go completly blurry and eventually you couldnt see it anymore.  We also had a glow in the dark ball which left sickening trails everywhere it moved.  After tripping out down there a while the lights were turned on and everything flashed and blurred for about 15 seconds until out pupils adjusted to the light change, it was pretty cool. ",
  "We headed back upstaris and listened to some kick ass Beatles tunes and tripped out some more.  The visuals would take over the entire room and everyting was oozing in psychedelic imagery.  Closing eyes i would become lost in patterns and images of anything i could think of.  Music sounded extremly crisp and clear and i loved every minute of it.  Next, we took a walk to a friends house and burned a couple bowls of some quality nuggets. ",
  "While smoking didnt really seem to make us high, it definatly enhanced the trip.  Visuals seemed to become more dominant and I couldnt help but sit and think to myself that I was tripping my balls off.  The visuals and tracers lasted for a healthy 6 or 7 hours before we notcied a decline but they still lasted another good 2 or 3 hours before i finally fell asleep in my bed. ",
  "I didnt get alot of sleep that night, maybe 4 hours, but awoke the next day with a mushy head.  However, the next day or two i felt great and definatly had a mood lift.  Compared to the trips at 30 and 40 mg, this 55 mg trip blew them out of the water.  We've got some 65 mg doses weighed out and im sure theyll be a blast. Peace."
 ],
 "erowid": {
  "id": "21750",
  "citation": " Backspace. \"Fantastically Visual: experience with AMT (ID 21750)\". Erowid.org. Jan 22, 2008. erowid.org/exp/21750",
  "substance": "AMT",
  "views": "5261"
 }
}
