{
 "title": "Three Drug Daze",
 "author": "Andy",
 "citation": " Andy. \"Three Drug Daze: experience with DXM with CPM, Crack & Cannabis (ID 36613)\". Erowid.org. Jan 9, 2008. erowid.org/exp/36613",
 "substance": "DXM with CPM, Crack & Cannabis",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "16 tablets",
   "oral",
   "DXM",
   "(pill / tablet)",
   " T+ 2:30",
   "4 hits",
   "smoked",
   "Crack",
   "(freebase)",
   " T+ 5:00",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] </p><p>This was proberbly the 10th time I tripped off of coricidin, the fourth time I used crack, and the hundredth time I smoked pot. Yet it was the first time I did the combination of all 3 drugs at the same time. I started off by taking 16 coricidin pills at a friends house at around 3pm. I was tripping at around 4pm I felt like I was walking on air and all colors I seen seemed intense and beautiful.</p><p>At about 5:30pm me and the person I was taking the coricidin with were visited by a friend who just bought some crack and offered to smoke with us, we accepted. I had about 4 hits of crack. I was still tripping hard when I smoked the crack. The crack made everthing speed up when I was still tripping. The hardest I tried I couldn't focus on one thing.</p><p>At around 8pm I felt tired and a little burnt out, so me and my friend rolled up a blunt of some pretty good weed and started to smoke. About 5 minutes after I finished smoking I felt my body go totally numb and my coricidin trip started to intensify to a level I never previously experienced. The weed must have also reinvigourated my crack high because I felt like time and space started to speed up. At about this time I started to panic for a short time because I thought I was going to overdose.</p><p>I went outside to get some freash air and try to compose myself. By now it was pretty dark out and I started to stare at my friends house, the house started to change colors and shapes, I was in a dream like haze. I started to feel at rest. After about a half an hour my trip ended very suddenly at around 9pm and I fell right to sleep. This was the most intense drug induced spiritual experince of my life.</p>",
 "year": "2004",
 "id": "36613",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-09T08:00:00.000Z",
 "views": "7011"
}
