{
 "id": 3664,
 "title": "Over and Over",
 "date": {
  "submission": "2007-06-11T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lisa",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "I am always looking for ways to expand my mind and sprituality.  I quite enjoy mushrooms and marijuana, and I try and meditate on a regular basis.  I figure most natural drugs are a decent jumping off point for some really incredible spiritual experiences.  I had heard alot about Salvia, so I decided to give it a go.",
  "So, I ordered some online about a week ago.  28g of dried leaves and 3g of 5x extract.  When I got it, I packed a bowl with a little of both and smoked away.  Nothing.  Not to be discouraged, I headed over to a friend's house.  He and I constructed a gravity bong using a 2 liter.  I filled the bowl up w/leaves and a generous sprinkle of the 5x.",
  "Hit #1:",
  "My first hit out of a gravity bong ever.  I looked at my friend and said 'Wow, that really puts it right in your lungs doesn't it.'  I had barely gotten the sentence out of my mouth when it hit me.  I felt and INCREDIBLE amount of pressure over my whole body.  I was going to fall if I didn't sit.  I stumbled out of the kitchen and sat on a chair.  I could feel something pressing on the whole right side of my body, very hard and very uncomfortable.  It went in sharp waves, like VERY heavy boxes falling down on me and sliding down my skin.  I stood up and turned the other way, hoping it would press on the other side of my body and give my right side some relief.  Where the hell this reasoning came from, I have no idea.  My friend B took a hit and didn't feel a whole lot, a little dizzy, but nothing spectacular.",
  "Hit #2:",
  "After a few minutes, we had calmed down a bit and decided to hit it again, this time a little more prepared.  I filled the bowl with mostly 5x extract and filled up the bong.  B took a hit, and froze.  After a few seconds he told me he could see his pulse in his eyes.  He stumbled into the living room to smoke a bowl of weed.",
  "It was my turn at the bong.  I took 2 full hits off of it, hoping to get as much into my lungs as possible before I fell over.  The first one hit me hard, but I managed to stay standing and fill up the bong again.  But as soon as I took the second hit, it was like I hit a brick wall.  I couldn't stand.  My legs started to buckle underneath me.  I stumbled as quickly as I could into the living room and collapsed on the couch.  B was smoking his bowl, and asked if I wanted some.  I couldn't even think to answer him at that point.  I just kind of looked at him, dumfounded, for a second before my head fell to the pillow.",
  "I laid on the couch and tried to listen to the music we had on and concentrate on my thoughts and not the incredible pressure I felt on my body, but it was impossible.  I wanted to get as close to the ground as I could, to try and get away from the pressure.  Again, I have no idea where this reasoning came from.  I scooted my head over till it was hanging off the side of the couch.",
  "Suddenly time stopped.  Well, it didn't stop.  It started skipping, like a record or a CD with a knick in it.  I could only see what was in front of my face (the carpet), but for some reason, I had the impression that there were hundreds of creatures jumping off an orange cliff into a huge body of water.  OVER AND OVER AND OVER they jumped.  SO INCREDIBLY BIZARRE.  I could hear the music that was playing in the back of my head.  The same 2 seconds over and over and over.  'Do this, do this, do this, do this, do this.'  It seemed to go on like this for hours and hours, days, a lifetime maybe.  I lost any sense of who or where or when I was.  I didn't even realize I was human anymore.",
  "Suddenly, I caught a glimpse of reality, which I clung to as long as I could.  'HELP', I managed to gasp, before getting sucked back into my time warp.  Back I fell, the same music, the same strange vision for what seemed like an eternity.  It couldn't have been any more than a few seconds, judging by the music.  My friend rushed over and grabbed my arm, which managed to pull me out of my trance.  'B?' I asked.  I stared as hard as I could at my friend, overcome with relief.  Reality still existed.  I was still alive, still human.  I started to relax a little, feeling secure in the real world again.  I started to get sucked back in and I felt time start to skip again here and there, but B's hand on my arm managed to hold reality long enough for me to shake the trance off.  This all happened within about 10 minutes.",
  "I was definitely scared shitless though, and so was B.  As soon as I felt well enough to walk, we stumbled up the stairs and went to sleep.  And I think that my experience that night may very well put an end to most of my drug use.  It was an incredibly scary experience for me.  I reccommend DEFINITELY having a sitter around if you're going to try this drug."
 ],
 "erowid": {
  "id": "21757",
  "citation": " Lisa. \"Over and Over: experience with Salvia divinorum (5x extract) (ID 21757)\". Erowid.org. Jun 11, 2007. erowid.org/exp/21757",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2599"
 }
}
