{
 "title": "Controling the Energy Fields",
 "author": "Kenny",
 "citation": " Kenny. \"Controling the Energy Fields: experience with Amphetamines (Adderall), Breathwork/Hyperventilation & Meditation (ID 36727)\". Erowid.org. Jan 11, 2008. erowid.org/exp/36727",
 "substance": "Amphetamines (Adderall), Breathwork/Hyperventilation & Meditation",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>The first and only time I've ever done Adderall was an incredible experience. My cuzz gave me 60mg  of Adderall and I ate it. I felt very happy, talkative,strong, and full of energy.</p><p>Later I went home and I couldn't go to sleep. I started to watch the shadows in my room. They look like small globbs that tend to float around just out of the corner of your eye. I've seen them for years ever since I was little and have thought nothing of them. Since I couldn't go to sleep at the time I thought I would have a little experiment. I focused my sight, breathing and sense of feeling for about 30 min. After I had been hyperventilating and focusing I could see how big these shadows really were. 10 min later I started to feel electricity flowing through my legs and I could feel the blood flowing through my veins.I then focused with all my mind and could see these shadows as 'waves', and they were vibrating.</p><p>I put my hand out towards a large one and started to feel the blood flowing back through my arm. Soon I was controlling my bloodflow and could draw the electricity or vibrations into my body! later I found I could manipulate these waves into small fields between my hands, push them to the other side of the room, and block out light coming from my stereo clock. I stayed up all night and felt energized in the morning. 2 days later I was home alone at around 8oclock and I experimented again (didn't do any drugs this time). I meditated and got my breath up. I started to feel tingling sensations on my face hands and feet. I was forcing the fields around in the living room and about 30 min later I felt very drained. I looked out the window and I could see large energy fields out in the yard coming towards the house. So I stopped very quickly and tried to pushed everything outside.</p><p>I sat down on the couch and I got a very bad pressure headache. I tried to help it by putting my hands in front of my face but it only made it worse. I turned on the big ceiling fan light and it flickered like CRAZY! It didn't stop until the morning after. For the next day and a half all I did was sleep. I had headaches and was very drained.</p><p>The speed really helped me get over the concentration and hyperventilation part, and I had learned to do what some probably have not done for centuries. Typing this has given me bad flashbacks and a little bit of wooziness. I can already see steamlike waves flowing up from the computer outlet. For those of you who have done or are considering doing speed I suggest staying up and playing video games instead of practicing how to be a monk. It is much safer and will most likely keep you out of a mental institution cause people get frightened. I will never forget it.</p>",
 "year": "2004",
 "id": "36727",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-11T08:00:00.000Z",
 "views": "11058",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ]
}
