{
 "id": 3673,
 "title": "Seed Empathology and Dreams",
 "date": {
  "submission": "2000-06-26T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Rev. MeO",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 seeds",
   "administration": "oral",
   "substance": "Voacanga africana",
   "form": "(seeds)"
  }
 ],
 "report": [
  "The Ingestion/The Flavor",
  "~50 Voacanga africana seeds were chewed up a little bit, then swallowed with some ginger ale (taste ain't that bad). My mouth was already dry and I wasn't in the mood for any flavor at all. The flavor of V. africana seeds is mild, and ranges from that of tea and pecans, to nastiness.",
  "The hollow seeds are the worst tasting, but the disgust doesn't linger, a sip of any soda or milk will erase the >blechThe Onset",
  "About 20 minutes later, an emotional charge is felt. Not energetic, but an emotional release. It would be extremely easy to delve deep into my subconscious at ths moment, and/or spill my guts to someone I care for. Crying is extremely easy whereas normally it in non-existant.",
  "Over an hour after consumption, visiual distortions and a moderate 'trip' feeling is noticed. Eyes are light red with mild gloss (could be from possible tearing). Everything is different, and with eyes closed, it seems like visuals are right around the bend. I never get to them, though.",
  "I lay down with the intent of watching some TV and waiting a few hours so as to talk with a friend, but then I sleep. My glasses are found to the left of my pillow - so I must have just slipped away. I was tired this day already, but the stimulant effect that my friend boasted with these seeds, is not. Aphrodesiac, indeed, though.\rThe Dreaming",
  "8 hours of lovely sleep follow, as do MANY vivid dreams (in no specific order):",
  "At my dad's house and his old girlfriend is there (he has since had one other girlfriend), and the neighbor across the street, is there - as well as some 30 of her family members. I notice his computer and online connect is in the bathroom. It is my first day back at his house and I tell him that I need to sleep - but there's a party and tons of people, no place to sleep. So he says 'then why don't you just leave?' I do.",
  "At Wal-Mart, near the front door, this frumpy looking 16-17 year old girl comes running through the doors and bumps into me - keeps running. Then she turns around and comes over to me and asks 'Do you know where the condoms are?' I do not know where they are in Wal-Mart (or if they even sell them) and I tell her this, then she begins to walk away, then I jog back towards her and tell her to check near the tampons.",
  "Somehow, somewhere talking with my mother, she says something about how she now realizes that hallucinogens are potent tools for self-exploration, and doesn't mind me using them. Mentions something about me freaking out on mushrooms, as a shifting point in her opinion.",
  "In a car, I somehow end up in a garage with a half-dozen people or so. I notice one female - she is the female from the sketch comedy troupe, the Upright Citizen's Brigade, and I talk to her about that show and the fact that she is a writer and actor on Late Night with Conan O'Brien. She says that the other people in the UCB are just funny people she knows, they are not writers for Conan O'Brien.\rThe Morning After",
  "Wake up the next morning, disappointed that I fell asleep and missed my friend. Ego very strong. I want to change things. The ego-enhancement is perhaps as powerful as that of ketamine use - however, seemingly not as long lasting.\rThe Day After",
  "All day - from 8 am through to 6 pm, I feel very strange. Even though I got sufficient sleep last night, my body feels somehow ill (breathing feels different) and I sleep very easy again. In retrospect I wonder if the 'dreams' mentioned above were actually dreams, or if I just slipped into a world like that of dreams, while laying down. When I initially woke up after several 'dream-like' thoughts, it felt much like waking after passing out from a high mushroom dose. The 'dreams' were much like those that occur while slipping in and out of this world. I will definitely sleep well tonight. More to come with this species!"
 ],
 "erowid": {
  "id": "2178",
  "citation": " Rev. MeO. \"Seed Empathology and Dreams: experience with Voacanga africana (ID 2178)\". Erowid.org. Jun 26, 2000. erowid.org/exp/2178",
  "substance": "Voacanga africana",
  "views": "53473"
 }
}
