{
 "title": "DXM and Brain Wave Generator",
 "author": "nibs",
 "citation": " nibs. \"DXM and Brain Wave Generator: experience with DXM, Cannabis & Sound and Light Machine (ID 3675)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3675",
 "substance": "DXM, Cannabis & Sound and Light Machine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "350 mg",
   "oral",
   "DXM",
   "",
   " ",
   "smoked",
   "Cannabis"
  ]
 ],
 "report": "<p>\nDXM and Brain wave machine (altered deep meditation pre-set to include visuals):  I had just smoked cannabis (which changes the DXM trip entirely) and decided to see what effect my new Brain Wave Generator program would have.  The creators had warned against its use with psychoactive substances so I knew the combination would be effective. </p><p>I put on the headphones and started the program.  The sounds emanating from the headphones made me laugh because they were so strange.  After about five minutes of meditation assistance, the effects of the program were in full swing.  Suddenly, under me appeared an ancient city of pulsing light.  A wall of energy passed through me, melting my body away.  I was a mass of liquid static.  I felt like a god.  Like I had entered the essence of an ancient deity.  My thoughts were screaming in my head, blaring.  It was as if they were so intense they could not be contained, they spilled out of their realm to include all others, and in my mind became physical.  I felt I could shatter the minds and bodies of the citys inhabitants at will.  I took off the headphones because I was enjoying the perverse sensation. </p><p>This combination for me, was incredible.  Must drugs are ego destroying, while this sensation was one of transference (into deity consciousness) and massive ego inflation, to a perverse level.  It offered a way to explore consciousness in the other direction.  I do not consider myself an egocentric person either; in fact I try to objectively analyze myself in order to prevent this regularly.  I believe it was the colors of the flashes I chose which created the experience (yellow and white).  Using different colors has given me entirely different experiences, but none as unique from the traditional direction of psychedelics as that first time.</p>",
 "year": "2000",
 "id": "3675",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-25T08:00:00.000Z",
 "views": "13196"
}
