{
 "id": 3675,
 "title": "Experiencing True Reality",
 "date": {
  "submission": "2007-09-24T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Falkor",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowls",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "I just experienced the beauty of Salvia again. This is the 6th time I tried it, after the 5th last night. I was alone for the trip, which is very unwise, but I don't tend to move around much so I was all right. I chose to smoke the Salvia during the day for the first time, though I did it inside. I took about 3 bowls of the 5x extract in my bong, one after another. After I inhaled, I lay down, and the breaths of Salvia sent me to another world.",
  "This other world was only slightly related to this one. I undertook the experience in my room at home with the window open and incense burning, and Atmosphere + Laurie Spiegel's music playing. The music became a solid force as I went on the trip. I could FEEL each pulse of the rap beat or the tingles of the ambient music, as each sound wave moved across the room from my speakers. It is very hard to explain the experience, but it is unlike any other feeling that music has inspired either sober or stoned. The universe it sent me to gave me a feeling of being in another dimension UNDERNEATH this one, where everything is connected. Matter and energy fuse together in this other universe, and everything flows together in a soothing harmony.",
  "Usually I go into laughing fits, however this time and the last time I did not. The place it sent me to seemed like a completely selfless place, where I was experiencing everything but it wasn't ME experiencing it all. I forgot the being I was and became something of pure spirit. While in this state, I was of the feeling that I was riding a wave of existence, the room around me melted together and became a sort of surfboard for my trip to another world. This other world felt somehow more real than the world we normally live in, as if I were given a chance to glimpse the true nature of reality. My body is only a tool with which I can experience certain aspects of reality, through sight sound touch taste and smell. Salvia brought me away from this tool and healed my perception so that I was able to know the true reality without being hampered by this crude matter.",
  "The whole trip went with a slight feeling of anxiety, however. An anxiety that something wasn't quite right, that I was not quite at peace with myself. I would say that it enhanced the slight feelings of social anxiety I have been feeling of late, but converted them from an external anxiety to an internal one. It wasn't entirely unpleasant, just extremely revealing. I feel that meditating before I went on this trip would have put me more at peace with myself and would make me more capable of exploring the depths of the Salvia universe without being tied to this one.",
  "I am now firmly of the belief that Salvia should be experienced either outside or with another person or both. When I had experienced Salvia one other time with a friend and woman whom I'd just met, the already-present vibes that I felt with this new woman became enhanced to the level that I felt as though I were at one with them, a feeling that I can relate to nothing else outside of sex. I really want to experience that feeling in a totally natural environment where I can be at one with the ground, the grass, the trees, the sky. This is the most spiritual substance I've ever partaken, and I feel that one should go to nature to experience spirituality to its fullest extent.",
  "Shortly after the trip I tried to drink soda out of a can, and I choked on it and spewed it all over my desk and keyboard. Plus, my motor skills were extremely uncoordinated. So don't drink or move around or do anything else, just take it easy and stay put after the trip. This is why a sitter is extremely important. I felt an incredible desire to be DOING something after the trip, though I can't explain what it was that I felt I should be doing. My body feels tingly all over now, and my mind feels as though it could easily break through to another dimension again. Each time I trip with Salvia I gain a newfound respect for the sheer power of this psychedelic, and a desire to experience it again, but not for a while."
 ],
 "erowid": {
  "id": "21792",
  "citation": " Falkor. \"Experiencing True Reality: experience with Salvia divinorum (5x extract) (ID 21792)\". Erowid.org. Sep 24, 2007. erowid.org/exp/21792",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2943"
 }
}
