{
 "id": 3676,
 "title": "A Night of Relaxation",
 "date": {
  "submission": "2003-03-04T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zen",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Last Monday, I prepared everything just pefect.  I had showered, layed out my cloths for the the next day (it was a school night), done my homework.  I cleared up my night's schedule to ensure that I could enjoy my high, buzz-or whatever would come from my experience with the Xanax pills that I had been given earlier that day. ",
  "I had tirelessly researched, and learned of Xanax's soothing effects, so it was with much anticipation that I anticipated the events of that evening.  1.5 mg seemed like a pretty low dosage, but that is all I had been given.",
  "I had been told that it would hit me harder if I ground the pills into a powder, then put the powder in a gelcap, but there were none to be found-so I split the pills in half, thinking that this might speed up the absorption just slightly (can't hurt, right)?",
  "I down the pills with a smirk on my face, and a glass of water in hand.  30 Minutes later, I feel something coming on, I can't tell exactly what it is.  About an hour lately -- something is definitely up.  I am buzzed, but not completely wasted.  I feel tired, and a 'melting sensation' ensues.  I feel like just sitting down and enjoying myself  (luckily, as I said before, all work had been tended to and I had nothing else to do for the night).  I sit back in my chair, and mellow out.  The mellowing effects last for about 45 minutes, at which point I wanted to enjoy my buzz, but I also had the intense urge to get some rest. ",
  "The night before I had gone to bed around 2 AM, and without the xanax I probably would have done the same.  Instead, I laid down to rest at 9:15, I do not think I've ever gone to bed this early. ",
  "I work up the next morning, happy, rested and a slight buzz.  It wore off quickly though. ",
  "Xanax is something I'd like to try again, possibly at a higher dosage.  I wouldn't kill a man to obtain a couple of the pills but I do understand how a significant portion of the drug-using community appreciates it's effects."
 ],
 "erowid": {
  "id": "21794",
  "citation": " Zen. \"A Night of Relaxation: experience with Alprazolam (ID 21794)\". Erowid.org. Mar 4, 2003. erowid.org/exp/21794",
  "substance": "Alprazolam",
  "views": "99694"
 }
}
