{
 "title": "Columbia Had Nothing on Me",
 "author": "Cade Dakmor",
 "citation": " Cade Dakmor. \"Columbia Had Nothing on Me: experience with Caffeine (ID 36769)\". Erowid.org. Jun 13, 2007. erowid.org/exp/36769",
 "substance": "Caffeine",
 "bodyweight": "180 lb",
 "report": "<p>I suppose I should toss in some background first. </p><p>Cade Dakmor is a preferred name but it is not my actual name.  I suppose I use it for a variety of reasons.  One being that in a fair amount of time, it will become my new name, and another being that until then I can deny anything associated with that name.  While an alias has little purpose in the case of legal substances, should I submit another report in the future in relation to questionable substances it would only be wise to use it.</p><p>I'm typically an intelligent person.  I can get on quirks or the sort but I usually take things in stride.  I know my limits, I do try and push them a bit now and then, and I'm usually more intelligent than I was this time around.</p><p>Grong is a friend of mine.  Obviously not his real name but its what I've come to call him when talking to other people.  Anything new that I do is typically done with him.  He is probably my most trusted friend.  Since he is hardly mentioned I suppose that is all you need to know about him for now. I just wanted to clear up what a 'Grong' is.</p><p>I suppose that is enough background.</p><p>Sometime last night/early this morning (9/14-15/2004) I probably ended up taking well over 1500-2000mg of caffeine.</p><p>When I first took a few, I knew they were extra strength and I just didn't really care. I wasn't going to go over 1k. 1000mg is a typical dose for me.</p><p>I probably took about 600mg to start. Somewhere along the lines I ended up forgetting they were extra strength and I concluded I wasn't feeling anything so I popped a few more. Probably more than I realized.</p><p>It wasn't too long before I started feeling pepped. It wasn't much longer before I started feeling like something was terribly wrong. I had an odd amount of pressure in my left side.</p><p>I also couldn't seem to stay hydrated. I drank water until I concluded that another glass might make me throw up. It was stupid of me not to, but at the time I didn't think about inducing vomiting.  I would later wish that I had.</p><p>I killed time talking to Grong and trying not to take this too seriously. I didn't want to stress myself out and end up feeling worse. When I was motionless and not freaking out was when I felt most comfortable.</p><p>After a little while I tried to sleep. I ended up returning to the computer to talk to Grong. Only to leave yet again though. This time I didn't think about sleep. I just knew that laying down, sleep or not, would be best. When all your body wants to do is shake or twitch, laying down becomes difficult though. Every few minutes I'd head to the bathroom... sadly I couldn't will myself to do anything.</p><p>Hours had gone by and I finally just drank enough water to force myself to pop. Doing so didn't prove to help much. My stomach was empty and the pills had dissolved. The taste of bile helped even less.</p><p>I eventually drank some more water after killing the last of the mouthwash. I went to lay down one last time and while I was trying to sleep, I felt my left arm go numb. From the shoulder to the wrist, I had a generally cold feeling. In the armpit itself I felt like a nerve or vein had been pinched shut. That could have been the reason for the rest of the arm feeling the way it did but I wasn't thinking clearly enough to figure that. My only thought was 'Well fuck... I'm having a heart attack.'</p><p>It is now nearly 24 hours later (12:19AM 9/16/2004) and I wish I'd given in to my thought of dialing 911 for an EMS unit. It was too late to pump my stomach but I'm sure I could have still had my blood filtered. I'm sure it is too late for even that now though and I'm going to have to deal with this pain for however long it lasts.</p><p>I suppose this all sounds terribly negative.  To be honest I like caffeine and it does give me a bit of pep.</p>",
 "year": "2004",
 "id": "36769",
 "gender": "Male",
 "timestamp": "2007-06-13T07:00:00.000Z",
 "views": "6289",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 ]
}
