{
 "title": "Withdrawal Effects and the Whole Self",
 "author": "Darksunnymeadow",
 "citation": " Darksunnymeadow. \"Withdrawal Effects and the Whole Self: experience with Fentanyl (ID 36775)\". Erowid.org. Feb 6, 2007. erowid.org/exp/36775",
 "substance": "Fentanyl",
 "bodyweight": "110 lb",
 "header": [
  "DOSE:",
  " ",
  "",
  "Pharms - Fentanyl",
  "(patch)"
 ],
 "report": "<p>I have some experience with the fentanyl duragesic patches that I would like to share.  Here's my two cents.</p><p>I started taking fentanyl patches 2 years ago for control of post surgical pain.  I have chronic pain anyway, so after I was well my doctor recommended that I stay on the patch since it was doing such a great job contolling my pain levels.  She was very happy with the results.  I was happy not to be in pain.  This is a good medication for pain control. </p><p>At first I didn't notice any particular side effects apart from constipation.  I didn't notice being particularly high.  For once in my life this was JUST FINE as I had had quite enough of opiates during my extended surgical stays at the hospital.</p><p>My first indication that this is not a drug to take lightly was when perhaps 4 months after starting the drug, I got careless and ran out of patches before I had time to refill my perscription.  Withdrawl hit me full force about 3 hours after my patch was due to be changed.  Anxiety like I have never felt before smashed into me.  It was for me an anxiety that sits in my body.  I couldn't sit or stand.  I was climbing the walls.  Aches and pains wracked me in addition to the normal kidney pain I often experience.  Withdrawl from this substance is seriously not a fun time.  This of course is a normal and expected result. </p><p>It took about a year to finally recover from my surgeries and thier aftermath.  It was at this time that I began to notice the other effects that this drug had on my body/psyche.  Something felt missing.  I realized that I had almost no emotions.  I was numb EVERYWHERE.  I usually have a fair amount of intuition that I have learned to consult in life situations, but then I felt no stirrings whatsoever.  I am a very spiritual person in general.  I felt no connection to the Source anymore. </p><p>After about 6 more months of this all encompassing numbness I had had quite enough.  I was now needing to change to my patch every 2 days instead of every three to combat the terrible anxiety I endured as the patch began to decrease in potency and my tolerance increased.  I knew I had to try to get off of it.</p><p>I insisted that my MD start to perscibe lower doseges.  She was very reluctant but eventually respected my wishes and I began to decrease the dose very slowly while I was carefully monitered.</p><p>I noticed my pain levels shot up for the first 2 weeks after using the lower doses.  (I went down by 25 mcg/hr) I experienced some withdrawl symptoms during that time but it soon leveled out afterward.  Amazingly, my usual chronic pain kept going back to almost zero consistently after that initial two weeks.  I was convinced that I no longer needed this kind of pain management.</p><p>It wasn't long before I was feeling some emotions again.  By the time I stabilized on a 50 patch I was starting to dream. I was hit by waves of empathic emotions as I passed strangers on the streets.  My intuition began to return.</p><p>It took me 7 months to comfortably reduce my dose to nothing. I have been off completely for 2 weeks now. The last bit was the hardest to get off.  My spiritual life is once again a rich tapestry.  It is overwhelming at times.  My pain levels have still not stabilized but I am controlling it with a combination of white willow bark tea, ibuprophen and lots of pot. </p><p>I think the shock of returning to this comparably open psychic state has been a bit much for me.  I am using LOTs of marijuana right now. I think I am trying to mediate the flow of psychic sensations as well as the strictly physical.</p><p>Of course, everyone's experience is going to be different especially on a spiritual level.  My experiences however, are that this drug dampens my emotional, mental and psychic experiences as well as the strictly physical.  My understanding of wellness is that one must balance all of oneself before true wellness can be achieved.  Although fentanyl treats the symptoms of pain, it makes it difficult to approach healing holistically.</p><p>I am now healing on all levels.  It's challenging to say the least but I feel fulfilled again even when it's difficult.</p><p>So for what it's worth.... these are my experiences. </p><p>Good journey to you all.</p>",
 "year": "2004",
 "id": "36775",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-02-06T08:00:00.000Z",
 "views": "22026",
 "dose": {}
}
