{
 "title": "LSD as a supplement to daily life",
 "author": "BoxBoy",
 "citation": " BoxBoy. \"LSD as a supplement to daily life: experience with LSD (ID 3677)\". Erowid.org. Nov 20, 2000. erowid.org/exp/3677",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>\ni woke up at 6:40 am on a friday and promptly ate three blue blotter. at approximately 7:25 i was walking to a coffee shop in my home town when i began to notice how exceptionally speedy this dose was. i have tripped several times and never before or again have i had such a strong amphetamine feel.</p><p>i went to my high school and started band at 7:50. a pleasant body buzz came over me about half way through the period as i was marching outside, and everything gained a very ironic feel. several people asked my why i was wearing sunglasses, but that was the least of my concerns. i noticed that a member of the band's head was a flag, and i began to wonder what was going on until i realized that i was on drugs. this puzzled me.</p><p>at 8:40 i left the high school in a friend's car (he was driving) and remarked at how incredibly beautiful the fall leaves on all the trees were, and how amazing it was that my legs were at rest, yet we were obviously moving. i then went home and called a friend, asking him to meet me at the library while admiring my insanely dilated pupils. i went upstairs to my computer and wrote the following:</p><p>'I have saucereyes shining back at me from every reflective surface.</p><p>my hands move with their own consciousness.</p><p>my mind is filled with a dim green golw of benevolence, washing forward and backward through my suddenly open consciousness.</p><p>waking.  Everything is moving quickly with that speedy shimmery trainride feel, sweeping and lifting me, funnelling through a spiral of forgotten thoughts and fragments, transcending this state of smiling idiosynchrisies and uncoordinated floating chaos. In this sea of collisions and orderly creation and destruction I have made my home beyond words. This is bliss.</p><p>screams and quieted notions greet me from the seas and mists of forgotten lores and empty passages unbeknownst to me now. Sssstirring from the cabin of this vessel has infringed upon my trainride awareness.</p><p>Someone has lost this place.  Laughing and bursting and climbing through the walls and opening their lives back and forth in a cycle quick and precise,  we're all running back and forth through the fire searching for order in frantic wide-eyed notions of mobility and so we break down into pieces.</p><p>Incoherent warblings and buzzing eminate from the semiconscious subconscious subhuman followers of an outdated order of life. This is a cycle of things. A feeling of familiarity. family. liars.</p><p>And a bright white climax of fire and emotion, a shower of lights, a dawn of perception, an awakening, and then it passes back into this disconnected bunch of insanity. It's funny that i'm prompting this schizophrenia in my own mind and looking to it for so much support. irony. blindness. We hide from ourselves we run and run and hide from ourselves.</p><p>the words on this page have gained a sentience.  I'm going to go soon.'</p><p>After having written that, i went to pick up my paycheck. It was close to ten o'clock, and i was peaking.  It should be noted that at nine o'clock I experienced a psychological peak, which plateaued for about two hours. At about ten I experienced a body peak, and around ten thirty  I experienced a visual peak. This was highly unusual.</p><p>After a lengthy conversation with my employer, i went to the local bank to cash my paycheck. While waiting in line, I noticed a large mirror on the wall and admired the reflection of a young lady in it. At that point i had some confusion over my identity, and whether i was in fact me, or the girl in the reflection. I thought to myself, 'what's going on here? is this some kind of plot? good god man, get a hold of yourself!'</p><p>I nonchalantly reached down and put my sunglasses back on, and pondered the idea of using lsd as a supplement to everyday life.</p><p>At about eleven, I waited at the library and noticed a fog appearing from around the corner of a nearby building. I then wrote the following in my sketchbook:</p><p>'The calm cool mist of impending destruction has taken a centre stage in today's glorius activities.\nand i feel okay.\nstill.\nthere are a lot of crazy things going on here. i wonder whose plot this is.</p><p>cement mixer.\nthe trees sing!\nepiphanies!\nall is right with the world for a brief moment.\nT+4h20min\nand the clocktower chimes.\nten city blocks from ground zero and the world goes crazy.\nwaiting for the aftershocks.'</p><p>By eleven thirty I had met up with two friends and made my way to the city park along with two bottles of orange juice purchased in a nearby carry out. We were contemplating the nature of our hometown, seeming like a post-industrial wasteland in the middle of a life-sucking suburban community. When we reached the swing set, I downed a bottle of orange juice and decided it would be an appropriate time to contemplate the many questions i had set aside to ask myself during this trip, all relating back to the nature of a closer connection between my subconscious and conscious mind.</p><p>I looked down at my obscenely long hair, the fallen leaves, trees like veins in the empty skies, and the people I surrounded myself with and felt an immense security. The beauty of the breathing ground and ancient collective consciousness of the nature around me infringed upon my perception in a sensory onslaught, leaving me immersed in a million thoughts moving too quickly for my brain to grasp.</p><p>Being overly satisfied with this situation, my friends and I departed, walking downtown to see that the trees had all been cut down months before, and the pavement ripped from the earth, leaving gaping holes and dust in the air (the fog of impending destruction). We picked up a hammer on the way, thinking of it as a valuable companion and tool in the journeys that lay ahead of us. Soon afterward, things became far less surreal. I was beginning to come down.</p><p>My two friends and i walked to the local dairy queen in search of food, and we left the hammer outside.  After we ordered, we went and sat down, and one of the dairy queen employees went outside and picked up the hammer. A few minutes later, he brought us our food and began to walk away when I stopped him.</p><p>'hey,' i said, 'just what the hell do you think you're doing? did you steal my friend's hammer?'</p><p>'uhmmm... yeah, it's in the back... i'll... uh, go-'</p><p>'Oh, that won't be neccessary. you can have it. just take good care of it. i'm sure you'll take it to where it belongs.'</p><p>'right. i have to go now.'</p><p>And so he left and i began to eat my ice cream.</p><p>I quickly noticed that my body had no intention of eating this ice cream. whenever i put my body on autopilot, trusting it to continue consuming the ice cream, it would stop, holding the ice cream in front of me. Finally, I coaxed myself into finishing it.</p><p>At that point i went home and listened to a lovely album by a perfect circle on my still relatively new stereo system. It was incredible. the third track has a distorted bow bassline that made me feel very light, and like i was riding some sort of twisted roller coaster, bounding from side to side. I often wonder what effects of lsd are psychosomatic, because the nature of the drug lends itself to giving you complete control of the trip with a little practice.</p><p>It should also be noted that the body buzz associated with lsd is a 'light' one. Alchohol and marijuana are slightly heavier than one's own body weight, dextromethorphan is like having a house on top of you, and lsd and mdma are like floating.</p><p>At around 5 o'clock, there was a marching band practice for the football game at 7:30 that evening. a friend of mine informed me that my pupils were still noticably dilated. This particular football game was band senior parent's night, and being that I was a senior, I got to walk down the fifty yard line escorted by my parents.  I informed them that i was feeling just fine. They never suspected a thing.</p><p>One final note is that the next day i had the worst amphetamine comedown i have ever experienced. The whole day before i had felt speedy, but saturday morning i worked for six hours, and it sucked. a lot. One rule I think most people should follow and that i almost never break is to set aside a day after tripping to recap your days activites and to recover from excessive walking/moving.</p>",
 "year": "2000",
 "id": "3677",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-11-20T08:00:00.000Z",
 "views": "8421"
}
