{
 "title": "Visionary Consciousness",
 "author": "Samabudhi",
 "citation": " Samabudhi. \"Visionary Consciousness: experience with Salvia divinorum (ID 36796)\". Erowid.org. Oct 24, 2006. erowid.org/exp/36796",
 "substance": "Salvia divinorum",
 "bodyweight": "62 kg",
 "header": [
  "DOSE:",
  "3 hits",
  "smoked",
  "Salvia divinorum",
  "(extract - 5x)",
  "",
  "3 hits",
  "smoked",
  "Salvia divinorum",
  "(leaves)"
 ],
 "report": "<p>It was an average Saturday night. I was at my friend (M)'s house after we'd been to a braai (barbeque) and I decided to extend the mild experience of Salvia which I had the Thursday before.</p><p>I told M that I'd like to try Salvia again, so I went up to her room and settled myself in; closing windows, turning the lighting down, hiding sharp objects.</p><p>I began with supplication/invocations to the Buddha, Tara and Padmasambhava. Asking for protection is important in my mind when charting new ground. A bit of samatha meditation and I was ready.</p><p>I was to take one plain leaf hit, one half plain half 5x, and then one 5x extract from a double water bong my friend had. My friend returned to her room and we began.</p><p>I sucked up the first hit and held it for about 30 seconds. The hits were already packed into a six shooter for rapid consumption. I took to the second hit. I don't smoke, so despite Salvia's smooth smoke I still had trouble keeping it down. 10 seconds was the best I could do. After a few quick, deep breaths I took to the third and final hit.</p><p>I closed my eyes and cringed as I struggled to keep the smoke in. Thoughts were coursing through my head as normal, but they began to magnify and expand to fill my entire range of consciousness. The idea of me watching my thoughts slowly shifted to 'I am these thoughts.'</p><p>The logical progression of these thoughts was being infiltrated by a certain paranoia as to their veridity. By this stage, which seemed like a matter of seconds after closing my eyes, my entire range of consciousness, i.e. visual, audial, olfactory, gustatory, tactile, mental and conception of self (ahamkara) seemed to be fused into one superconsciousness (alaya-vijnana).</p><p>The most remarkable of which was the fusion of ahamkara which seemed like the highest and final end of all states of being. There was nothing left to fuse. The essence of the Upanishads: 'Thou art that,' was apparent to me now as I recall the experience. With my eyes closed, it was primarily thoughts which were at the front of my awareness. Later (a matter of seconds which felt like eternities), when I had apparently (according to my memory) opened my eyes, it was equally about my field of vision.</p><p>There were no 'conventional' hallucinations during the entire trip. Reality was as it had ever been, it was I that was changing, or more correctly, the relationship between reality and whatever else...itself I suppose. This in a way made it more confusing and disturbing. Im OK I'm not OK.</p><p>The peak of the trip however was at the beginning, probably 3 seconds after I closed my eyes. As each thought manifested in the continuum of cause and effect, I felt compelled to resolve them. Each time I resolved one, another would manifest like an infinite cycle of recursion, which, in retrospect, was resulting in greater levels of fear. I felt hopelessly conditioned to this cyclic existence of resolving my own thoughts while trying as hard as I could to escape from the sequence of thoughts which had become all-pervasive within my consciousness.</p><p>Examples of the thoughts I was experiencing were 'hope', a bent elbow, ultimate fear - which I imagine was brought about by the act of holding my breath, 'there is wet on my face', 'stuck' (after hope had been proven a fallacy since I was getting nowhere with my thoughts) etc. Each was flowing under my right armpit which is the direction my head was hunched in. The angle which I was able to perceive these thoughts, though I was utterly one with them, was in the form of the lower right quarter of concentric rings whose colours were cycling outward from one to the other with each passing thought, not unlike a fractal. Each thought gave rise to a set of other thoughts which were all bottle-necking at my central consciousness.</p><p>I slowly felt I was making progress as I urged myself into action, starting off with opening my eyes and releasing the smoke. Awareness of the outside world...I hesitate to use the word 'returned'...let's just say it was in my field of consciousness. I saw M looking at me and reclining into her lowered bed. I reached for her glass of water which was on the floor and asked permission to drink (I was entirely concerned with being polite and keeping her informed, though I was unable to do either). By this stage I was out of the hell of infinite recursion which couldn't have lasted more than 10 seconds. Just as a parent will pull an amusing face, making bubble noises and trying to attract the attention of a troubled baby, I actively sought sensory engagement, starting from when I opened my eyes and continuing as I reached for the water, continuing to search for sensory phenomena which my starved consciousness could devour.</p><p>I really started to enjoy the trip by this stage. Everything I saw or thought was interchangeable. There was differentiation between phenomena within and without, but at the same time absolute union. The perceiver and the perceived were one. This was the hallmark of the experience for me, and I was, to my astonishment, able to continue this attitude of thought, not just as a thought but as a reality, for a good 2 hours after I first fell off my trolley. I was certainly trying to retain that reality, but slowly, my memories were returning, and so my Self was returning to normal.</p><p>Reality, following the water glass apocalypse, was still immersed in the initial transcendental wisdom, and it was never really clear to me when the trip had actually ended.</p><p>Days after the trip, I am still able to vaguely relive the experience of oneness in meditation, just as a certain song or taste will bring back certain memories.</p><p>What happened next is, comparatively, mundane, and I won't go into the details. Suffice to say that I circled the room questioning and forcing out suggestions of what had just happened and what was still happening, often returning to hair-pulling, eye-bulging splutterings of 'Good grief God golly gosh.'</p><p>Here ends my best attempt at objectivity with regard to an experience where the very of concept of a subject-object relationship has no place.</p><p>Further interpretation:</p><p>I have only ever before experienced this class of consciousness in a powerful mushroom trip I had once where I was, as with this, completely removed from conventional reality.</p><p>This one, however, came to be in a matter of seconds and peaked off in a few more. There was no time for fear and anxiety to build up upon itself psycho-physically to reach the thermo-nuclear proportions of dukha (suffering) which bad psychedelic trips are known for. The experience was entirely psycho-spiritual.</p><p>Though I am still very new to Salvia Divinorum, and so too is much of the world, the idea that it is in a class of it's own has grown on me. The difference, it seems, is in the extent to which it distorts consciousness. Perhaps this is where the line is drawn between psychedelic and visionary experience. In that one hellish mushroom trip, sensory perception was no longer of any relevance as it had returned to the undifferentiated consciousness which I had no choice but to view reality through. Reality was so far removed in both experiences that it no longer exhibited the marks of 'tripping', ie distortions of reality, but rather a deeper side of reality that is left unturned during normal dualistic awareness.</p><p>The level of consciousness had left a subject-object psychedelic experience, where qualities and attributes, though they may seem more vast and profound, nevertheless still have some meaning, and had moved to an absolute visionary experience where infinity and zero are one and the same. Thoughts were as tangible as my hands. The idea of something having a quality, ie, of adjectives, was inappropriate. As soon as any attempt was made to label the objects of my awareness, the very labels came to life and required more labeling. Nothing was free of this fundamental phenomena of conditioning. If I had realised emptiness, I presume it too would have been subject to it's very own nature, as a mirror mirrors a mirror.</p><p>In my experience, weak and moderate psychedelic and Salvia trips are a world apart from ones where that visionary threshold, or event horizon, is crossed.</p><p>It is also my experience that people have an almost unanimous aversion for what I consider a visionary experience, where their fanciful sense of self is violated to the core. If any ultimate good is to come from such episodes, then they would surely issue, not from psychedelia, where mentation and sensory illusion (which engender further barriers to true realisations) are tolerated (since the principle of selfhood is yet coherent), but from a visionary state where all dualisms are resolved and one's perception of self is shown for what it is, ie, impermanent, non-dualistic, and most pertinently, pure suffering.</p><p>How perfectly that experience of being stuck circling in one's thoughts is compared to the insanity of samsara, where birth and death of phenomena follow ad infinitum. If we do not know what true happiness is, then wouldn't it follow that we have not an inkling of true suffering? Earthly death is having loved and lost, and in hell, one at least has the luxury of resentment and the right to be contrary (which is why people end up there!), but to live a life without choice and die a thousand deaths, realising, though ignorantly, that this is eternity; what greater suffering is there?</p><p>And if a measure of reality is it's profundity, then have we not seen that essential truth which Buddha made his first and most eminent - that this reality is suffering?</p><p>If the unenlightened mind were to fathom reality as it is, then surely this would be it?</p><p>Q: Is there not contradiction in that suffering and it's cessation are both truths?</p><p>A: Why are they called 'Noble' truths?</p><p>Because they are possibilities, there is no real-ity.</p><p>The insanity of an endless stream of thoughts brings to mind Milarepa's words: 'To bring one's thoughts to the point of their exhaustion; Is this not Buddhahood gained in a single life?'</p><p>Using thoughts to overcome thoughts may work on the most basic level, but as was clear from this experience, they only become the source of more problems.</p><p>As keen on philosophy and intellectual inquiry as I am, they pale in comparison to the effects of practical experience. A word is but a word, a picture may be a thousand, but a vision is the totality of experience which cannot be reduced to abstractions anymore than a single-byte file could be successfully compressed.</p><p>Ludwig Klages wrote: 'the act of spiritual vision transforms the seer; which obviously demonstrates the extreme opposite to the act of perception, which differentiates the perceiver from the object of perception and thus makes him conscious of his narrow separateness.'</p><p>They say anything I can imagine is possible. After two visionary experiences, I feel the same cannot be said about anything possible being imagined, for most. Perhaps this is partly the aim of meditative visualisations, to develop the qualities of profundity and vastness where profoundity can be likened to intensity and vastness with scope. If one examines the nature of consciousness, these two qualities seem to be it's range, the horizontal and vertical.</p><p>With one's consciousness habituated to such extraordinary awareness, no illusion could remain and the cause of one's problems would wither under the intuitive eye of transcendental wisdom (prajna), karmic traces (samskara) would be released from their cages without actively seeking them out through intellectual games, and enlightenment would dawn as sure and as the sun.</p><p>Epilogue.</p><p>'To take a finger in illustration of a finger not being itself is not so good as to take something which is not a finger to illustrate that a finger is not itself.</p><p>To take a horse in illustration of a horse not being itself is not so good as to take something which is not a horse to illustrate that a horse is not itself.</p><p>So with the universe which is but a finger, but a horse.'</p><p> - Chuang Tzu, On leveling all things</p>",
 "year": "2004",
 "id": "36796",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-10-24T07:00:00.000Z",
 "views": "18282",
 "dose": {}
}
