{
 "title": "A Vision of the Other World(s)",
 "author": "Brian",
 "citation": " Brian. \"A Vision of the Other World(s): experience with Salvia divinorum (leaves & 10x extract) (ID 36806)\". Erowid.org. Jan 12, 2008. erowid.org/exp/36806",
 "substance": "Salvia divinorum (leaves & 10x extract)",
 "bodyweight": "150 lb",
 "report": "<p>I am a very curious person to say the least.  I am a rational, pre-med student at an Ivy League university, with no belief in spiritual or divine realms.  I bought a beginner's package of Salvia from a reputable site to just try it out and see what happens.  This is not to say that I don't have respect for the effects!  Quite the contrary, I am a very spiritual person with atheist beliefs.  I thought Salvia might be an interesting experience given the historical and cultural lore surrounding the wonderful herb.</p><p>My first experience with Salvia came on a quiet summer night.  I was alone in my room at 1 a.m. when I decided to venture into the Salvia world.  I turned the lights down low, lit a few tea light candles and packed a tobacco pipe about 3/4 full with leaves and sprinkled some 10x extract on for good measure.  My first series of inhalations produced only minor effects that were probably a result of smoking something really fast.  However, when I re-packed the pipe and went for round 2, I could never have expected what would be in store for me.</p><p>Like so many others, I felt instantly boxed in. The best way to describe it is like I was wearing a suit of lead armor.  I could move but a severe gravitational force made me realize my efforts were futile.  I did not see the spirals or flashes of color that have been described here before.</p><p>I placed my pipe down and buried my face into my pillow to releave the force of gravity.  Immediately I was lost in another realm.  I saw how everything worked.  It sounds so cliche and nonsensical, but I was privy to knowledge of how reality functioned.  It would be like if right this very second someone lifted the curtains and revealed the stage crew of life. </p><p>I went on several 'trips' to unfamiliar and completely new surroundings.  It reminded me of the movie 'It's a Wonderful Life' where the main character observes the world but cannot be seen or heard.  I watched a Brooklyn family pack for their summer vacation.  I met two invisible beings, but not human or even alien in shape.  I could not see them but I knew they were there with me.  They became my tour guides throughout the trip.  I remember floating through my bedroom door and hovering over my own body and watching myself trip on Salvia.  This was definitely the highlight of any Salvia trip I have been on!  It was so fascinating and emotional to see myself.  I cannot adequately explain the beauty of an out-of-body experience, it is something to be desired.</p><p>The second most inspiring event took place after the out-of-body experience.  I was laying on my side with my face buried in my pillow when I lost the distinction between the fabric and my skin.  I felt like I was a part of the pillow and my arteries, veins, capillaries etc were all connected to the cotton fibers of the pillow case.  All of a sudden, the pillow morphed into a beautiful old oak tree with amazing knotty roots.  I became one of the roots and felt very warm and connected to the 'everything'. </p><p>I have smoked Salvia several times after this experience and have always seen similar effects.  I notice that there are elvish type creatures in my trips.  They remind me of the elves that some people experience when taking Ayahuasca vine...maybe they are related in some respect?</p><p>The length of my trip from start to finish was nearly 15 minutes.  I reach climax very early on and sober up very quickly.  For me, there is no down time on the trip, I go from max to min with little in between.  I feel completely sober about 20min after the trip ends.  There is a def. afterglow that must feel like prozac x10!  Some of this sounds like stupid rambling and may come across as false or immature, but Salvia is one eye-opening and powerful plant.  I smoke infrequently, not because I don't enjoy it, but because it cheapens the ritual aspect.  Lady Salvia is a beautiful creature!</p>",
 "year": "2004",
 "id": "36806",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-12T08:00:00.000Z",
 "views": "3022",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 }
}
