{
 "id": 3680,
 "title": "Sailing to Chicago",
 "date": {
  "submission": "2003-03-07T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sinjun",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "43",
    "grams": 0.043
   },
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "capsule"
  },
  {
   "time": "9:00",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  }
 ],
 "report": [
  "I had been in the desert for maybe 5 hours.  Max.  And already Dr. Satan was leading me down the road to trouble.  And when Dr. Satan leads one down a road it is likely to be measured in milligrams.  And most usually quite a few of them. Id arrived at my camp, up north somewhere.  Set up the tent.  Said hi to my campmates, and while, dear friends that they are, I felt the draw of Dr. Satan and his evil influences.",
  "Dr. Satan is neither Doctor nor actually Satan.  The Doctor part comes from his, um, predilection for things that come in pill form.  And the Satan part, well thats a long story.",
  "My camp is up and running, and Im off and running.  I walk down south, wandering through the madness that is Wednesday at burningman.  The waves of techno wash across me on the dusty wind.  The sun was setting and the extreme silliness that would be the night was spinning up to speed and the governors were all broken. Dr. S. and his lovely fiancee Jezebel were camped far south near the center camp with some other suspect folks that Id met the year before and looked forward to seeing again.  Upon arrival I became quickly re-acquainted with those Id met, Astrogator Elric, and Dr. Fish, as well as meeting a dryad named Pollux and a flurry of naiads who moved so fast that they were one beautiful streaming multi-hued goddess.",
  "For the evenings entertainment there would be a coterie of 2C variants that we would be imbibing. Dr. S. and I would be venturing into the depths of 2ct-7, in my case 43mg.  Others would be on 20something of 2CI and some 2Cbers to round out the party.",
  "So la voila.  Im in the desert, and Im streaking towards very high.",
  "Now Id done the 7 before, in a more urban setting, a bar, a cab, a party, some videos etc.  And had thought it a lovely lovely thing, a favorite if youd like.  Definitely a 2C substance but with a very dissociative loss of personal edge that I really found endearing. I believe this is the bit that sucks some people into the abyss but to each her own, eh?  At  43mg I was definitely heading towards the big wall of the mind and at some serious velocity.  But heck, it was burningman, I was with true friends and new ones and I was rather sure the sun would be up to sear anything left in my head come morning so Id be fine. As I am wont to do I had swathed myself in leather to assure lack of burning, cutting or otherwise damaging myself as I wandered, toppled, staggered and otherwise crashed my way around the Playa in the night to come.",
  "Here I should mention one of my personal problems with the 2ct-7.  It makes me puke.  With certainty and force.  Bothering to eat is a waste of food and heck, it takes longer then.  So I was reasonably sure Id spend at least a few minutes on my knees coughing up dinner. So again, leather is good, and wipes clean easily.",
  "We imbibe.  We sit, we talk, we hang, we chat, we discuss the fact that the 2C-ers are feeling that crispy Im high feeling without full on trip and how itll come and boosting is not recommended. Finally we feel the energy begin to build.  The slight buzz in the body (as in electrical, not drunk) that maybe its time to venture out into the wildness that has begun to rage and see the world, stagger through it, and maybe bump into it in an alley and have a talk about the way its been treating me.",
  "Saddle up we do, water thingies are filled, bullhorns tested out, radios converged and confirmed and into the darkness we go. Ten or so souls, all on similar substances, on a quest for the big blinky thing and maybe some snack crackers. We walk out, we walk straight out.  Sort of orbiting counterclockwise around the man in a spiral that will eventually take us to him but not by a straight line, but an arc.  And as we walk we see things.  Strange things, but so far they are pretty real things. At first there was little suggestion of the impending chemical warfare that I had waged upon my brain.  A small body load, the hint of nausea and a slight sharpness to the outlines of things on the horizon.  We were walking a long way and I was feeling very very tired.  People we talk to are normal, the lights are only beginning to get sharp and Im basically not that much above baseline.",
  "I have not yet mentioned that at the time of ingestion I had not slept in 36 hours and was feeling it.  Tired but upbeat I was hoping for some energy here and it wasnt coming on.  But Ive seen others lured into the folly of boosting by this sneaky substance and its friends and was not to be had.  I would be patient and.and there it hit me.  Wild nausea, crazy spinning reality.  I quickly handed away my bullhorn, staggered away from the crowd and at probably 45 minutes out, la voila I vomited my guts out.  Thatll teach me to eat before I drug.",
  "We see a pirate ship.  We walk towards it.  We lose people, we find them (bullhorns are useful for this), we lose the pirate ship. We get way out on the far horn and see things then head back in towards center camp.  And by now Im good and high.  Flicking my hands sends sparks flying, I dont try to keep up with people and cant but my bodys muscle memory does a good job and keeps me with the group.  Talking is to me seen through layers of disjointed time dilation and light, Im starting to become confused who this me is and why Im walking with him.  My body still responds to commands but more like a butler than a body.  It thinks do this and a bit later it does it but Im definitely not controlling it actively.  An example is at some point while in a puddle on the playa (as if I was poured), Dr. Fish attempts to purloin my bullhorn, setting off its alarm. The siren screams and I tell my body, sombody turn off that god damn claxon and sure enough a flick later I flop over and my hand finds the switch and quiet reigns.  Note Im still not sure at this time that the hand flicking the switch is mine, but it answered my command and is wearing my thumb ring (a good indication I figure) so I assume so.",
  "Were up and moving again, or at least the group of people that was we and now is us/them, and we start to wander into this amazing thing.  Someone has made a three-d hologram of floating lily pads on the playa, and among them are weird little animated fish and things.  My brain discusses the complexity of this with my other brain and we decide that its pretty damn cool because we didnt know such holograms existed and ouch.hey wait.I just bumped my shin on the hologram.  Heydouble waitits real.theyre little metal lily pads and the fish is looking at me. By now the us/them group is moving on and I managed to word my vote, or was that before on the ground after the alarm.  Anyway I/me/we/it wants fruit juice and Jezebel (or at least the cloud of sparks and fire that is/was Jezebel) says that Dr. S and her have some in the van and also some of that lovely nitrous I like.  Or at least did like before when I was me rather than now.",
  "Again the body follows the pack.  Pausing some to chatter into radios, deal with water etc.  But the mind is along for the ride and not in direct control.  That is some other bit. This brings up one facet of the 2C group that I particularly like.  While it puts a severe and distracting filter on my senses, eventually incorporating wild and distracting auditory hallucinations too, with echoing and voices, somewhat like nitrous at times, my body is still fully functional and can follow simple commands on its own. For example on the way back across the playa I had begun to lose touch with my hands, finding the camelback nipple thing took great attention and while talking I would lose my train of thought and find it again all before the person I was talking to could notice.  But at the same time I could walk along with the group and as long as someone prompted me I could even interact with strangers. Note, somewhere in here I vomited some more but this time could care less as I was watching sparks shoot from my hands and the lights of the esplanade were brilliant and sparkling.",
  "Eventually we made it back to the dome of our refuge and found that its owners, geniuses and scholars, had brought a kerosene heater. Here we lost some cohesion, some went to the RVs, some the dome, some wandered off.  And me, well I started to lose my mind.",
  "Now Im lying on my back in a dome, a comfy warm dome with friends I like and trust and others wandering in and out, fully expecting 225 pounds of hallucinating boy so this is by definition a good place. Oh, and they had fruit juice boxes. Various conversations ensued but the one I felt best personified the height of my trip was one of the domes owners (and Im not sure which one) asked where I was from.  This is normally an easy one, Im from Chicago, I live on the SW side etc.  But as I lay there trying to say this, a) I didnt know this in words, I could not conceive of describing Chicago, and b) I had no real idea where Chicago was.  But what I could do, staring up at the ceiling was visualize exactly how Id sail a boat there.  And when I say how Id sail a boat there I mean how Id rig it for the wind from that direction, how itd roll in the waves, how the wind would feel, how the spray would taste.  The whole deal.  As I processed that question I visualized an entire trip of many days in seconds and compiled it into my memories as fact. ",
  "For the rest of my life my sailing from Black Rock city to Chicago will be part of my reality as real as sailing from my familys house in Provincetown up to the city for lunch that I did dozens of times in my youth. Oh, and the ceiling of the dome opened up and the waterfalls of the ocean pouring over the edge of the flat earth deluged me, but thats just par for the course. I can conceive of Chicago again and almost who I am, but not quite so I dont worry and go back to looking at visitors to the dome.",
  "Eventually I got my reality back, determined that I was indeed myself and finally the massive hallucinations began to back off a bit and all I had was strobing and some movement of patterns (including annoyingly enough the playa dust footprints etc).",
  "Now others are starting to go to sleep.  Somewhere in here they did nitrous but I avoided it, as I feel quite high enough and trying to be mildly one-chemd for the evening.  We are losing people and my narrative is lost also as things get blurry and sparkly and fiery.  Someone provides heat. And reality is coming back now.  I am more me than I was and I can almost talk as myself with myself.",
  "The sun came up and at about plus 9 hours I we began drinking vodka and Gatorade to take the edge off and as the camp started to wake slowly from their happy slumber they would be greeted by Dr. Satan and me with our shiny happy faces, sitting in their tent getting rapidly drunk and waiting for Bricklayer to make us pancakes. We drink more and more.  We are the enemies of sobriety.  It is now noon.  I am approaching baseline thank gods.  I head home.  I pass out.  I have been up 53 hours, have moved into my new apartment, drove to an el to a plane to a car to a desert to 43mg of 2c-t-7 to now.",
  "I am very happy.  And its not yet even Sunday and I havent eyeballed 50mg of 7 for that fun fun evening of light.  But that will come as all things do to those who weigh a lot."
 ],
 "erowid": {
  "id": "21803",
  "citation": " Sinjun. \"Sailing to Chicago: experience with 2C-T-7 (ID 21803)\". Erowid.org. Mar 7, 2003. erowid.org/exp/21803",
  "substance": "2C-T-7",
  "views": "14366"
 }
}
