{
 "title": "Indoors or Outdoors?",
 "author": "Mister Hipbone",
 "citation": " Mister Hipbone. \"Indoors or Outdoors?: experience with Salvia divinorum (10x extract) & Cannabis (ID 36820)\". Erowid.org. Jan 12, 2008. erowid.org/exp/36820",
 "substance": "Salvia divinorum (10x extract) & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I found out my friends were going to smoke Salvia.  They'd known of that certain head shop selling quantities of it, and so I pitched in and we purchased a small container of salvia 10x extract.  It looked to me like something a witch doctor would put on a burn with some goat urine and milk.  It didn't smell like marijuana, but it looked like bits and pieces could've been mistaken for it.  Thankfully my inhibitions were altered by a rather fat doobie long before the salvia was purchased, so by the time we arrived at our smoking place, I was already stoned enough to try anything.</p><p>We purchased a clean metal pipe to smoke the salvia through.  A bowl was loaded.  There were two other people in the room apart from me, and the more experienced user suggested darkness and no sound would set our trip.  Killing the lights, my other compadre sparked up the salvia.  Immediately he groaned and then settled into his own hands in an uncontrollable fit of laughter.  Tears streamed down his face.  I was next on the pipe, and as I blew out my smoke, his waves of demented laughter passed through my body and pulled me into a slant.  I, too, fell victim to the echoes and throws of crying laughter.  I blew snot on myself and everything.  Our third compadre hit the pipe and we all just burst out joyously in unison.  I honestly have never laughed harder or wilder than I did that day.  A small silence would trigger yet another fit, even when someone walked in the room, we would burst out laughing.</p><p>The slant I mentioned is rather uncomfortable.  As I blew out my hit, it made me sweat profusely.  Even in the direct stream of a fan and A/C, I was popping out in little sweat blobs everywhere.  That feeling passed but the slant did not.  Those of us who like disassociative experiences are used to the crazy visuals, but these were more than even a DXM fry.  My head was pulling in one direction, my torso in another, and my feet just kind of flopped around.  Everything turned into cosmic rays of multicolored lights and noise.  It was very intense, but not completely uncontrollable.  I could move and control my body, but it took a lot of concentration to walk and talk.  DXM does something similar to my body, only more reptilian.  A tripsetter wouldn't have done much.  The entire experience, through our four or five bowls and some more marijuana, lasted around half an hour.  Being indoors almost ruined me of a good salvia experience because of the physical effect it had on me.  I almost didn't want to do it again.</p><p>The second time, with the same two other guys and the same exact purchase, we decided to spark it up on the drive home.  We were cruising down an oceanside boulevard on a beautiful summer day.  After the initial puff, the sweating and uncontrollable slant seemed much less harsh.  The sea breeze and having the windows down REALLY enhanced the trip.  However I must stress that the driver did not participate in the salvia until we reached our predesignated smoking place.</p><p>All of the palm trees and houses looked like they came straight from an old Super Mario game.  The trees danced and the houses seemed to wiggle.  The cars that passed us looked like giant whales and groupers and sharks against the sunlit harbor and water.  The sailboats turned into battleships and started shooting rainbows from their masts.  Street signs read nothing but jibberish.  Once again, our pleasurable laughter spilled out in wet fits.  Everything became so astonishing.  It was like our hometown became Disneyland and we were wide-eyed three year olds.    That drive home was the most fun we'd ever had on that road.  Alas it only lasted about fifteen minutes, but there was more salvia and a place to smoke it coming up.  I sat out on the rest of it and smoked only marijuana.</p><p>So, indoors or outdoors, its up to how comfortable you are.  Myself, I never plan on smoking it indoors again.  I'll be on that same oceanside boulevard, laughing and pointing like a retarded fool at all the fishies and trees.  Its a connection I will never regret.</p>",
 "year": "2004",
 "id": "36820",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-12T08:00:00.000Z",
 "views": "2695",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
