{
 "title": "My Trip to Hell and Back",
 "author": "Bb",
 "citation": " Bb. \"My Trip to Hell and Back: experience with Opium & Morphine (ID 36851)\". Erowid.org. Feb 15, 2007. erowid.org/exp/36851",
 "substance": "Opium & Morphine",
 "bodyweight": "200 lb",
 "report": [
  "<p>Fun With Morphine: My Trip to Hell and Back",
  "In the Beginning:  At age 19, I tried opium for the first time on vacation in Switzerland.  Taken orally, the first dose produced little more than an unusual stiffness in the neck and arms, heavy drowsiness, and some very wild dreams.  However, the following four days of opium use produced pronounced and incomparable euphoria, a dissolution of worry, pain, and aggravation of any sort, and at night a pseudo-sleep state of waking dreams.  A year and a half later, I cant think of Switzerland without a longing for what I felt those days.",
  "Several days after leaving Switzerland, I found myself unusually restless, irritable, and weak.  I took it for a mild case of the flu.",
  "Insanity:  Several weeks after my return to the US, I learned how to could acquire opium poppies (and eventually pillsMS Contin and Dilaudid) in tremendous bulk.  My first poppy tea experiment was a vomit fest; I couldnt turn my head to the side without losing all sense of equilibrium.  Also, I was sure that if I was to close my eyes that I would fall asleep and not wake up.  So I made strong coffee and snuffed tobacco until I knew my ticker wouldnt decide to fall asleep with me.",
  "Naturally, I had to try this again!  After about three poppy tea nausea disasters, the unpleasant effects began to wane, leaving only the bliss I had known in Switzerland.  Though the waking experience of opium was heavenly, sleeping under the influence was beyond compare.  The brain was reeling with pleasure, spinning a thousand mile an hour, weaving dreams together into reality, like the perfect psychedelic.  I had found my thing. ",
  "A weekly experiment became a before-work experiment, and soon twice a day a couple times a week.  Why not feel this grand?  I literally never once considered addiction.  I was above it, I felt too good, too healthy, too right.  And damn it, if anyone should have known better.",
  "Hell..:  School started, and I moved out of the parents house and into Berkeley.  In short, the semester was an exercise in misery.  Unable to acquire opiates for every day of the week, I spent weekends at home feeling perfectly wonderful, and most weekdays yawning, aching, drenching my bed in sweat, screaming into my pillow, and suffering emotional and physical meltdowns on a regular basis.  There is nothing more terrifying, more maggots-in-your-mind painful, or more desperate than withdrawals.  Very few friends had any idea what was happening to me, and I felt so trapped, by school, by responsibility, by shame, and by denial, that I couldnt tell my parents, who watched as I stumbled towards the edge of suicidal depression.",
  "..Sweet comfort of mankind, plant of joy, DeQuinceys keys to paradise..",
  "..And Back:  I withdrew from the University and moved home with the naive notion of quitting on my own.  Instead, my addiction became sustainable.  Every day.  Almost never for the next six months did a day pass where I didnt have morphine.  Once, I recall, I thought that five Vicodin would give me a temporary fix --they didnt even put a dent in withdrawals.  The most fascinating part of this time was that I convinced myself I could maintain this, that I was fine, and healthy, and that 'next time, withdrawal wont be so bad.'  But as my job ended and school approached a second time, I broke.",
  "Not sure why I figured it out.  Broke down, told someone.  Stated very clearly and humbly to my parents I was in over my head, that I was a morphine addict, and that it was not humanly possible to stop on my own.  And the next day I went to a detox center.  Lovely doctors made me wait till I was in the grips of withdrawals (that is, another six hours in a waiting room with my mother), then administered buprenorphine, an opiate agonist-antagonist that helps with withdrawals, but by no stretch of the mind eliminates them.  After this treatment, under constant supervision I spent the next three weeks in withdrawals from buprenorphine.  Lovely time that was, crying at the drop of a hat, not sleeping a moment passed one hour each night for a month, finding relief only in hope.",
  "And here the story picks up a bit with an exciting return to sanity, a rebuilding of relationships, health, life, bank account, etc.  You know, the things I lost.  Been about 50 days now without it, and still some very sick part of me wonders, What it would feel like to try it again?</p>"
 ],
 "year": "2003",
 "id": "36851",
 "gender": "Male",
 "views": "50104",
 "dose": [
  {
   "time": "0",
   "amount": " caps",
   "administration": "",
   "substance": "Opium"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Opium"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Morphine"
  }
 ],
 "submissionDate": "2007-02-15T08:00:00.000Z"
}
