{
 "title": "Personality Change",
 "author": "Pascal Moss",
 "citation": " Pascal Moss. \"Personality Change: experience with Mushrooms & Cannabis (ID 36881)\". Erowid.org. Jul 31, 2007. erowid.org/exp/36881",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "130 lb",
 "report": "<p>This was my fifth experience with magic mushrooms. While the past experiences were interesting, they certainly did not reach the level I experienced in this trip.</p><p>I was going camping with some people who I did not know very well, besides one, who had been one of my best friends since we were kids. They seemed like decent enough people, so I came to the conclusion that they would not negatively affect the trip.</p><p>On the third day there, we decided the ingest the mushrooms. Unfortunately for me, I was mildly hung over. I refused to do them at first, saying that it would be too unpleasant due to my hangover. But after smoking some cannabis, I felt right as rain, the perfect mindset for enjoying a mushroom trip. We each ate 5 grams of dried mushrooms then proceeded to lay back in our campsite, which happened to be the overflow, a big open field. About 20 mins after ingestion, I started to feel the signs of intoxication. My whole mindset began to take on a strange, perplexing alteration. I felt, for lack of a better word, strange. Movement began to appear in the trees across the field, I could distinguish what looked to be faces, slowing shifting and moving in a mellow fashion.</p><p>Someone suggested we go for a walk, which I thought was a good idea. Me and 2 others decided to leave for the stroll, this was about 1-1.5 hours after ingestion. This is when I began to come up to my peak. I felt like the body I was in was not my own, but rather I had never experienced living in a biological body. Everything about me seemed foreign: my heavy arms, moist mouth, and soft hair. Not only this, but I had begun to hallucinate to a degree that I thought not attainable by mushrooms. With eyes closed, I could see elaborate 'fractal' style designs, as well as what looked to be people made out of neon light. With eyes open, things would pulse and breathe. A log I was viewing began to lift away from the ground and spin slowly, almost like it was dancing. I could see what looked like small eyes, hundreds of them, etched into the very surface of objects such as rocks or trees. They would stare out, not looking at me, but merely staring out into space. This image, for whatever reason, seemed profound to me and has stuck in my head ever since.</p><p>After getting lost on the walk, we managed our way back to the campsite (3 hours after ingestion? not really sure). Everyone was on the beach, but I was feeling rather rotten. For whatever reason, I couldn't seem to get comfortable. Every position was too awkward, I wanted to lie down, but it was a rocky beach. This was strange to me because I usually can sit and be happy anywhere. Frustrated, I left for the tent by myself.</p><p>Everything at that point took on a negative tone. Still tripping heavily, I went to lie down in the tent, but all I could focus on was how much of a mess it was. Cloths, backpacks and empty liquor bottles were scattered around in a haphazard mess. This was very depressing to me, so much so that I almost felt like crying. When all seemed down, out of nowhere, as if awakening from some past life or dream, I felt refreshed and reborn. It hit me like a tidal wave of euphoria. I received a confidence that I had never had before; I felt I could openly talk to anyone. My entire personality began to shift. Usually I am a rather introverted person, but now I was completely extraverted. I wanted to go embrace life to its fullest.</p><p>Soon after, the rest of our party arrived at our campsite. I felt it so easy to talk to them. I realized that we were all humans, all going through the same problems and pleasures, there was no need to be secretive. It was like breaking down a wall that had always existed between me and the world. Needless to say, we had many philosophical discussions throughout the rest of the day and night. When the next day hit, the feeling was gone. I was back to my old self, which I found was not a bad thing at all. Never the less, I feel the whole experience helped me grow a little as an individual; helping me see things from a different perspective than usual.</p>",
 "year": "2004",
 "id": "36881",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-31T07:00:00.000Z",
 "views": "4464",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  }
 }
}
