{
 "id": 369,
 "title": "'Waves' Rushing Through My Body",
 "date": {
  "submission": "2004-06-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Basil",
  "gender": "Male",
  "weight": 9
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Mushrooms - C. cyanescens",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I am 26 years old and so far the only illegal drug I had taken was cannabis; so this was going to be my first time tripping. I just came back from Amsterdam yesterday (two friends [Fred & Andrew] and I went for 4 nights) - I had the shrooms 3 days ago. We were staying in a 5 star hotel away from the centre of the city.  Our room was really luxurious with pillows all around the place, a TV, a radio, sofas, a kettle and a massive mirror suspended on the wall facing the beds.  There were 3 of us so we bought 15g of Hawaiian mushrooms (Copelandia cyanescens).",
  "A primitive tea (consisting of 2.5g of mushrooms and hot water in a cup) was prepared.  Consumption of the mushrooms was a long laborious exercise for Andrew and I, whilst Fred just wolfed them down.",
  "Andrew and I drank about half of the tea, ate a mushroom each and sat back waiting for the fun to begin.",
  "Within 30 minutes Fred started acting the way he was on his first shroom trip.  He described to us how the beds were breathing.  He started saying '...I can't even begin to describe what is happening!'",
  "At this point Andrew and I were getting very irritated that nothing was happening to us.  I was now determined to get these to work on me, so I poured my remaining 2.5g into the cup, stirred, and put the wet mushrooms on top of some potato chips and ate them.  Andrew and I decided that we divide Freds remaining mushrooms between us and have those too.  We did this then we drank the tea as well.",
  "Fifty minutes had now passed since we had our first helping of shrooms; then I started to feel it coming on.",
  "Apart from feeling really chilled out, the first sign for me was the feeling that I want to clench my jaw tight and there was a tingling feeling coming from INSIDE my teeth.  I moved from the sofa to the bed.  I can remember being extremely excited that I had just taken shrooms and I was finally going to be tripping.",
  "Before I took the shrooms, I had several misconceptions about them and that influenced my trip.  My misconceptions were:",
  "1.  When mushrooms are done in a group, everyone sees the same thing (like a telepathic link) - this can happen but it's not a standard effect",
  "2.  You become excessively paranoid",
  "3.  Hallucinations are really extreme (like lemons flying at you, or surroundings completely changing into something else).  Although the hallucinations were really mad, they were also much more subtle than what I had expected.",
  "My main reason for doing shrooms was to see hallucinations and I was really looking forward to it (also the fact that it doesn't cause long term health problems pushed me to doing it).",
  "On Freds insistence I lay on the bed (because he was extremely chilled out and he kept politely asking Andrew and I to shut up and sit down).",
  "I lay on the bed next to Fred and I found myself suddenly fascinated by the TV and just lay there and stared at it.  At one point, I thought the lining of the jacket some actor was wearing was multi-colored, but it was black.  I also noticed a face morph into another face; this happened twice.",
  "Then the shrooms began toying with my mind.  I developed what I found out later was major short-term memory loss.",
  "A porn documentary started on the TV and it had interviews with the stars all through it.  Now every time I looked at the TV, I would see the same *hardcore* porn scene followed by one of the stars of it talking.  Once this happened a few times, I asked my two psychonauts 'can you guys see porn on the TV as well?'  They said they could, and I asked them to describe what was on TV.  They accurately described what I was seeing.  And I couldn't believe it!  Everyone was seeing the same thing!  We were all having the same hallucinations.",
  "I thought that we were all projecting the same sort of vibes - I concluded that as we were three young males in Amsterdam sitting in a hotel room together, our hormones were making us think about porn, and therefore we were all seeing the same thing.  Of course this was not the case, the porn thing actually was a fucked up documentary.",
  "The other thing that convinced me that we were all having the same hallucinations was the fact that the women looked fucked up.  They had inflated boobs (unreal!), inflated lips, obvious facelifts, big hair and bright lipstick.  These already fucked up looking women looked even more fucked up to me, because their features were exaggerated.  Lips looked bigger and brighter; smiling made people look like the Joker in the Batman films.  I asked '...do these women look really fucked up?' to which I was given a positive response.  Now I was totally convinced that we were all seeing the same thing.  And the more convinced I got the harder I laughed.",
  "I kept uttering '...look at the shit on TV!  I can't believe we're seeing porn on the TV! We are so deprived! HAHAHAHAH!'  I was in hysterics, laughing SO hard.  My eyes, nose and mouth were watering like crazy.  [I think I was tripping quite hard, which together with my already excited mindset distracted my friends from their trip - which I would stop from happening next time.]",
  "I could feel, what I can only describe as 'waves' rushing through my body, starting mainly in my stomach and coming up to my head.",
  "I forgot to mention - we brought along a video camera and a digital camera.  We recorded ourselves for about 1 to 2 hours.",
  "I picked up the camera and was looking at Fred through the screen.  As he moved his arm, hundreds of tiny lights of many colors flew off his arm, followed a tiny spiral pattern and then disappeared. It was also possible to film yourself and see it at the same time.  So I filmed my face, and made recordings of lots of lots of weird expressions.  Looking at myself in the camera screen, the picture seemed to be made from water.  It was rippling. The mirror however was endlessly fascinating - looking through the mirror everything was distorted (like in the Spectral Realm in Soul Reaver).  Coining Fred, I can't even begin to describe what I saw!  All I can say is, if you ever get a chance to do mushrooms, have a mirror handy.",
  "All throughout we were smoking our endless supply of cannabis.  With every hit, the feeling the shrooms produced was enhanced.  Making a joint was really fun.  I looked at the cannabis I was rolling into a joint, and it seemed like the marijuana was made from many bright green balls all connected like beads on a string.  They formed a helix structure (like DNA).  They seemed to be breathing, and with every breath they became bigger.  They got so big I thought they were going to spill out of the side of the joint I was making.",
  "Gradually the 'waves' reduced in frequency and intensity and I realised that I was starting to come down.  I looked at the clock, and it was 1.30am (we drank the tea at 8pm).  My peak had lasted at least 2 hours.",
  "I saw a lot more than I have described here (for example how Fred looked like Mr Spock from Star Trek; or what my fingers looked like).  On my come down, I remember thinking that I don't ever want this to end.  We all agreed that it would've been cool to have more mushrooms, and next time we'll go for an intense dose of 10g of Hawaiians each.",
  "Basically, I think mushrooms alter the way things are perceived by my mind (I reach conclusions which seem valid at the time), they also caused severe short-term memory loss.  I think the level I reached was between 3 and 4 on the shroomery rate of intensity scale.",
  "Amsterdam is such an amazing place.  Both cannabis and mushrooms are sold legally (technically it's not legal, but they are both decriminalized).  And provided you buy from the right shop, you know what you're getting. We are planning another trip to Amsterdam in a few months time.  This time there will be 5 people.",
  "When I do them again, I want to close my eyes and go wherever the mushroom takes me."
 ],
 "erowid": {
  "id": "10633",
  "citation": " Basil. \"'Waves' Rushing Through My Body: experience with Copelandia cyanescens & Cannabis (ID 10633)\". Erowid.org. Jun 15, 2004. erowid.org/exp/10633",
  "substance": "Copelandia cyanescens & Cannabis",
  "views": "6684"
 }
}
