{
 "title": "A Psychedelic Way of Life",
 "author": "Smiling Sound",
 "citation": " Smiling Sound. \"A Psychedelic Way of Life: experience with LSD (ID 3690)\". Erowid.org. Mar 3, 2001. erowid.org/exp/3690",
 "substance": "LSD",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "3 hits",
  "oral",
  "LSD",
  "(liquid)"
 ],
 "report": "<p>not long ago i was handed a couple of sugar cubes of dubious strength.  they were a little old, so anything could happen, really.  or nothing.  i like a good experiment, so my psychadelic partner and i gave it a shot.  and there wasn't much there, really.  so we smoked a good amount of pot and tried to get over the disappointment. and that's when it became a good experience.</p><p>i've been taking psychedelic drugs for ten years, and i feel like i have a pretty good relationship with them.  i got over a bad trip.  i've never lost control.  but i've always taken quite a lot.  at least a couple of hits.  this was different.  it was more like regular consciousness.  i made drawings and they were actually good.  i recorded some music and it was recognizable as such later on.  conversations made total sense.  but it was all psychedelic.  just not so perfectly removed from the regular everyday brain state.  it has enabled me, since then, to reconcile the two ways of thinking, and to adopt a more psychedelic aproach to life.</p><p>and that's the point, really.  to change your life and the way you see reality.  to expand.  not just for one insane evening, but for the rest of your life.  so i would recommend giving it a shot.  try a couple of subtle trips.  meditate, if you're so inclined.  slowly it will seep into your daily life and you'll be capable of that kind of thought all the time.  good luck.</p>",
 "year": "2000",
 "id": "3690",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-03-03T08:00:00.000Z",
 "views": "27795",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 }
}
