{
 "title": "There and Back",
 "author": "Psytranceuniverse",
 "citation": " Psytranceuniverse. \"There and Back: experience with 5-MeO-DMT (ID 36917)\". Erowid.org. Mar 13, 2008. erowid.org/exp/36917",
 "substance": "5-MeO-DMT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I recieved my first 100mg of 5-meO-dmt from good chem lab today. I had never tried 5-meo or dmt before but used to trip alot on lsd with the dead back in the 80's & have taken large doses of ecstasy. Nothing could have prepared me for this though.</p><p>I attempted to cut 100mg 5 ways & futher eyeball to strong enough dose(15-20mg) which may have proved my end.\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]</p><p>First time was good.I smoked over a tiny bit of weed in a small pipe.Rush was instant at exhale, I put the pipe on the floor & had the feeling of 'oh no what did you just do'. I was looking at pictures on the wall of a trance festival I attended in morocco years ago with my wife.The pictures came to life.I dont mean just moving around or melting like acid but they played as if they were movies.Then I noticed my cat(& this is trippy)is staring me down & looking freaked.I have to try not to see him as a demon.He starts running around & trying to attack me, senses the energy & is afraid.Was proof to me that I was really in another dimension. Anyway I try to calm him down & this eats up most of my trip(30minutes), unfortunately.</p><p>So # 2- hour after first, cat in the other room.Approx same dose, not exact but couldn't have been more than 15mg. I have music(1200 mics)perfect to bring me in.This time same intense rush, moment of regret & instant hallucinations. I concentrate directly at these same photos as they come to life again.I am struck with a remarkable feeling that I am reliving the experience & embrace it. Somehow through the music I am feeling connected to a cosmic energy & I see people at this festival dancing.I feel connected to them,like taking acid with alot of people at a concert.All of a sudden I have the feeling that I am there, It is real & I get scared a little.Start to think I went to far, but I am able to tell myself to just go with it,even say this out loud, I think.</p><p>I had a profound feeling of taping into a never ending, always present world of trips & music.I am convinced now the this place is real & exists for sure.I was not always sure on acid & that was more of an internal thing for me.This was in your face different dimension.</p><p>LAST ONE> came down & waited another hour.For my next experiment I decided to take a hit(larger dose maybe 20mg)& go outside to sit on the porch.I took a huge hit, all I could take & went out sat down & exhaled.INSTANTLY as before I launched.I noticed right away everything changed.Everything alive like acid,geometric patterns.Very strong.I feel my body change as if transforming into this 'new' world & things got BAD.First I noticed the sky change,everything around me is swirling & shifting & becomes uncomfortable.I hear strange noises & one becomes louder & louder as if coming closer>it was a 'large' mechanical sound& humming.</p><p>I really feel like I am coming fully into this other dimension,It gets weird.I hear music in the distance, though I'm not playing any now.I look down at my arms & have the sensation I'm being pulled in to it.I get up & go inside & right away I know somethings really wrong.All of a sudden I am sure I went to far & I'm not going to come back.My computers on & it starts going crazy & flashing through my files as if deleting them.I look at some photos on the wall & they seem to be erasing.I look at a clock & it's racing backwards out of control & it hits me like a ton of bricks I'm DYING.</p><p>I have the unmistakable feeling that I'm dying & my life is being erased.I'm going no,no this can't be happening, yet I'm convinced it is.I feel like I've reached a purgatory,gone insane& It's going to be my fate to wander the house in panic.I think about my wife & family & how they will react to my death.I completely lost it. I grabbed the phone to call 911 but didn't.Still had the Idea of being gone & stuck in the void,felt really evil.At this point I'm down on my knees pleading to be taken back.It gets more intense & I'm sure I'm done for,I was terrified...completely.</p><p>I pleaded & begged God to take me back.That I had to go back, please,please.Then just at it's most intense, it starts to leave, slowly at first & it takes awhile before I'm certain, I may be coming out of it.I'm totally shattered,laying on the floor saying THANK YOU GOD over&over.Now, I'm not that religious but I felt a power different than the void & I could feel it helping me back to sanity.This was not a good trip & I have decided to flush the rest & stick to weed for now.</p><p>To anyone planning to use this drug at any dose,should use extreme caution.5-meO-dmt can bring me to a place I don't want to be in.As far as I'm concerned these other places are very real,they exist in the universe & I can be trapped & not return.........</p>",
 "year": "2004",
 "id": "36917",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-13T07:00:00.000Z",
 "views": "6072"
}
