{
 "title": "Stronger Than Expected, Great If Done Right",
 "author": "elgr",
 "citation": " elgr. \"Stronger Than Expected, Great If Done Right: experience with Anadenanthera colubrina (ID 36938)\". Erowid.org. Oct 5, 2004. erowid.org/exp/36938",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "",
 "report": "<p>I had my round 2 with yopo today. My friends and I agreed that this would be our last attempt smoking the seed, and that next time we will get some lime and see the difference in snorting it.</p><p>The group was me and one person from the first time we tried, who had minimal effects last time, and another girl who was new to it. The person who had tried before got some pretty good effects, like my first time. The other got some body effects that soon wore off. They didn't really smoke it properly. Didn't hold their hits in, took a long time, and didn't really torch the bowl. So, this time I took 3.5 seeds, as did everyone else. We peeled off the shell, and cut them up into as tiny pieces as we could, with knives, like previous attempts. We went one at a time, I went first. I've noticed that it takes a little bit of dedication to smoking this seed. The smoke can be harsh and it will taste awful.</p><p>I packed the bowl full of the yellow mini-cubes of seed. I then put the torch lighter right up next to the bowl and held it so it stayed lit throughout the whole hit, torching it. It was a very strong hit and suprised me, i held it in for 5 or ten seconds, forgetting to do it for longer. After another hit I remembered, and begain to hold it in longer. I started getting that feeling of disorientation again, so I took another hit. Then I got the feeling of pressure throughout my body, indicating that the trip was soon to begin, I felt heavy. So, I took one more hit, as big as I could, and safely put the now empty bowl down.</p><p>I noticed it came on much faster this time. Pressure and heaviness is the best way I can think of describing it. I started getting a little shakey, and began to feel weird. All of a sudden I felt very hot, inside and out. I began to feel like I was sweating a lot, but I wasn't.. not much anyway. So I began to stare off again, not looking at anything in particular. Everything once again became very vibrant. This backyard was full of trees and flowers so it looked amazing, more so than last time too. All sound seemed very sharp and I heard things from all over the block, just in a very strange way. The amount of body high and numbness was much stronger this time, I couldn't walk at this point if I tried.. probably.</p><p>So, I remembered, I can close my eyes! I often forget while tripping on anything about that... So I close them, and like last time the sun was illuminating my eyelids. So my background, so to say, was again red. However, at this dose it wasn't enough to kill the visuals... if anything it enhanced them. I saw incredible red and orange waves of color, flowing and moving together. I then saw a ball moving toward me, getting incredibly close again. Same color. There were other patterns going on in front of, or behind all this red/orange too. Sort of dotted lines making wonderful 3d spiraling shapes. Slightly different from things I've seen on other drugs.</p><p>I was narrarating all this to the person who got little effects. I must've sounded real out of it, but I was pretty into the visuals :) I must've leaned my head back because I think I rubbed/scraped it on a brick wall behind my chair. So, I open my eyes again, and I see the back yard, and garage door across the alley, cast in shadows by the trees. All of a sudden everything that's shadow seemed to flip with everything that wasn't. It's very hard to explain, but they seemed to switch places. Without taking my eyes off it, I began to examine it, and as I did it began to look more normal. Then the shape of the flowers (which there really were a lot of) seemed to be all over the yard. Everything then turned a shade of green. I think this might be somehow related to the fact that last time I put on a pair of yellow sunglasses, causing this effect. Actually, I think a cloud just blocked the sun.</p><p>I again closed my eyes, and saw the really neat spirally 3d broken lines. This time on a black background. Opened my eyes and saw lots of 'eye worms' in the sky, some very far, some close up. Blue, spinning around. More than normal. The clouds also looked surreal. Not sure if they looked different or I was must more amazed. But I probably would've commented on them if I wasn't tripping. I managed to walk around to see other parts of the sky, nothing too interesting. I closed my eyes again, and the visuals were practically gone. I was coming down.</p><p>And thats about it. The trip felt quite hard, but quite short. I'm suprised I could get that big an effect out of smoking it. It sort of felt like a rocket ship ride. The begining was hot and shakey, making it through the atmosphere. After that it was smooth sailing. The peak was probably around 10 minutes, 25 for the whole experience. I wasn't disappointed the first time, but I'm glad to see more of what this seed has to offer.</p>",
 "year": "2004",
 "id": "36938",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-10-05T07:00:00.000Z",
 "views": "11931",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.5 seeds",
   "administration": "smoked",
   "substance": "Anadenanthera colubrina"
  }
 }
}
