{
 "title": "Pushing the Cloud of Consciousness",
 "author": "Lunafisk",
 "citation": " Lunafisk. \"Pushing the Cloud of Consciousness: experience with Meditation (ID 36933)\". Erowid.org. Oct 3, 2004. erowid.org/exp/36933",
 "substance": "Meditation",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2002",
   "36933",
   "Female",
   "",
   "Not Given",
   "Oct 3, 2004",
   "18913",
   " "
  ]
 ],
 "report": "</p>After a very intense and terrifying experience with cannabis cookies [Report], I started to suffer flashback-like panic attacks, in which I felt like I was getting uncontrollably high for no reason.  Ive used relaxation techniques for years because I occasionally suffer from insomnia, so I tried these same techniques when I felt panicky. </p><p>The feeling would start with a pressure building in the front of my head.  With controlled breathing and emptying my mind of thoughts about being high or scared, I could lessen the panic a bit, but the pressure would stay for an hour, or maybe the rest of the day.  I tried relaxing further, settling into a slightly deeper, more meditative state, about the level where my body feels very heavy and warm.  I realised that in this state I could pull the pressure from the front of my head into the back or down my spine into my chest (this was very much like an experience with a cloud in my head that Id had on cookies once before).  Moving the pressure into the back of my head brought on an intense pleasurable high.  It was a two-tiered feeling of high buzzing ecstasy, and low, content bliss that pervaded everything.  I moved it back to the front of my head and realised that I could control it there too; although it was an edgier and less pleasant high, it was also more action-packed, more mushroom-like.  I experimented with lots of meditation techniques over the next few months.  None of these are things I imagined or convinced myself I was feeling.  The high was instant and as real as any drug. </p><p>The first feeling, the bliss & ecstasy, is my favourite.  I now use it automatically when Im in a stressful situation, or bored.  Ive never taken ecstasy and dont plan to, but descriptions of that sound a lot like this feeling.  The feeling has a very strong sensual element to it that is enhanced if I concentrate on it.  If I push this feeling past a point, I reach a state best described as a lasting orgasm (half an hour or more), but it is far more a mental feeling than a physical one.</p><p>Pushing the cloud to the front of my head changes the feeling a lot, lending it a nervous energy.  Concentrating it forwards, almost to the bridge of my nose, I get visuals when I look at things.  Nothing very extreme: clocks elongating or rotating, things breathing, patterns moving, things glowing and pulsating.  There is also a very drugged mental feeling, a whee-this-is-high-up kind of buzz, which I dont like.  This is a fun state.  There is nothing spiritual about it and it doesnt really lead anywhere.</p><p>Different combinations of these two states, and moving the cloud around my head, down my spine, and elsewhere, lead to lots of other variations.  Theres a cokey one, a feeling like a clear high note and a deep sense of strength and clarity.  That one I reach from the first feeling by doing a meditation practice that involves listening for a ringing in my head and then following it upward as the note gets higher.  Then theres different ways to experience the orgasmic state, whether its entirely mental, or physical as well, at different levels of intensity.  And there are the very deep states of meditation that normally take forever to get to; for those the first state works as a shortcut.  In about twenty minutes I can reach a deeply relaxed state with a rapidly fading ego and no consciousness of my physical self, just by concentrating on the bliss and channeling the extra ecstasy energy into relaxation.</p><p>There are a few grounding methods and states that I use.  Pulling pressure down from my head into my chest makes the bliss feeling more of a love feeling.  I also discovered an interesting experiment recentlystanding still, increase the pressure in your head, then drain it down into your arms and body.  Feel your skin getting more tingly and full of blood.  Let your arms move and try to enter a trance-like state where you are half-dancing, waving your arms around in twirly patterns but without actually concentrating on doing it yourself.  When I did this the first time I was a little scared, as my arm seemed to be twisting further than was natural.  But its easy to stop and leaves me feeling as if Ive had a massage.  Again this is fun, not spiritual.  But it is a lot of fun, and I feel more connected to my body, more real and athletic, after doing it.</p><p>There are many other variations, and things I havent tried yet, but these are the ones I find most interesting and the ones I do most often.  I realise that much of this sounds bollocksy, but there isnt much of a vocabulary for talking about meditation, and I dont like the connotations of words like chakra. </p><p>These arent all entirely positive experiences.  The states I induced did help me cope with panic attacks and I could end the high at any time, but I often had some problems feeling disconnected from the world and myself, and also saw bugs for a while after an intense experience.  It is also hard to do what seems good for me, rather than just explore, and see how high I can get.  I have quite frequently actually induced panic attacks that border on psychotic episodes through over-meditation.  I am not going to meditate hard for a long while after a bad experience I had the other day.  I was feeling a bit edgy from meditating too much and then had an argument with someone; I began to hallucinate smoke curls and animals and thought that he had set fire to the house, although I never lost touch with the fact that I was panicking and paranoid.  So maybe these experiences are just a slightly controlled onset of schizophrenia, or maybe being able to switch between mental states at will is just a dangerous tool.  But I do think that the state of contentment and bliss is one worth pursuing, and that a lot of people could reach through meditation alone.</p>"
}
