{
 "id": 3694,
 "title": "2C-B Insights",
 "date": {
  "submission": "2000-06-27T07:00:00.000Z"
 },
 "author": {
  "name": "Ord",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "25",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-B"
  }
 ],
 "report": [
  "Last night I took 25 mg of 2C-B. Having only done 15 mg one previous time nothing could have prepared me for what I was going to see, hear, think, and feel. The climb up was nothing special, the usual disorientation and mild euphoria. All I keep thinking is 'please show me something special'. I kept getting higher and higher and at one point my fear reflex kicked in. How far am I going to go? I closed my eyes and began to see some of the most beautiful patterns morph into living organism.",
  "At first they seemed to have an insect aspect to them, often mutating into butterflies. I'd open my eyes and see lights fractal around the edges. Music once again became multidirectional -- not being able to distinguish where it was coming from I had to just close my eyes and feel it inside of me. Walking became specially difficult as I kept losing my balance. At one point I had to just sit down, close my eyes, put my hands over my face and just experience life to its fullest. My teeth began clenching up very much like with 2C-B's cousin MDMA. I felt a rush of energy that went from my torso to my lower extremeties and out of my body all together. I felt unusually dichotomous -- a part of everything and at the same time detached from everybody else. Besides all the physiological effects I was experiencing, my mind was on overdrive:",
  "ANTHROPOCENTRISM : I looked at a picture with some dead pigs in it and vegetarianism became unprecedentedly obvious. I often read deep ecology literature that talks about the danger of anthropocentrism and the need to adopt an ecocentric approach to Mother Earth. I went beyond all the rhetoric and actually felt like I was the dead pigs on the wall. All of the sudden I understood why vegetarianism is so important and why eating other animals is morally bankrupt. It seems that all that literature that I have filled my brain with became alive. It felt that eating other animals is like eating negative energy. A disrespect to other life forms and an all around bad idea.",
  "DEATH : Energy seems to be a constant theme during my trip. I began thinking about energy and how it can transform and carry on. I began to think of myself as energy and that when I die I too will transform and continue *existing*. This wansn't reincarnation but rather a transfer of sort where my energy will continue on some physical level even if I'm not alive. I found great comfort in this thought and all of the sudden death did not worry me anymore. I was living for a change!!!",
  "GOD/DESS : I was on my back near a lake looking up at the sky. I felt a part of everything and it seemed to me that I could sense energy all around me. Trees, flowers, grass, the water -- they all seem to have an entity of their own. I kept thinking about a supreme being and the entire hierarchical nature of it all. I all of the sudden became filled with a sense of peace and had a realization: God/dess is merely an energy that people can be a part of and become in tune with out the traditional 'I'm not worthy worship mentality'.",
  "ENTHEOGENS : I think that they have already shown me the path and it is now up to me to follow it. I think I got the message and it is not time to hang up the phone.",
  "I was quite wired for at least 7 hours and towards the end of the trip my mind felt a bit confused. I couln't focus on any one though and it was all a bit of an abstract blur."
 ],
 "erowid": {
  "id": "2184",
  "citation": " Ord. \"2C-B Insights: experience with 2C-B (ID 2184)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2184",
  "substance": "2C-B",
  "views": "5195"
 }
}
