{
 "title": "Just Tried It Yesterday",
 "author": "Confident",
 "citation": " Confident. \"Just Tried It Yesterday: experience with Amphetamines (ID 36941)\". Erowid.org. Nov 10, 2007. erowid.org/exp/36941",
 "substance": "Amphetamines",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "Amphetamines",
   "(capsule)"
  ]
 ],
 "report": "<p>Got some Adderall from a friend a few weeks ago, just planning to move it on to someone else who wanted it. Never got rid of it, and yesterday I was like, oh what the hell I'll try it. I didn't do much research on it before hand. I took (2) 30mg pills, opening up the capsules, and pouring the small balls into my mouth, I really didn't expect too much.</p><p>I was doing my homework enjoyingly within about 20 minutes. I was on a roll, everything was good. I had to go outside to get something, and found myself sprinting there. My friend came over and we played some poker. Won both games, w/o a problem. I was on top of everything. I also smoked a lot of ciggarettes very fast, more that I would sober. I was ahead of everything that was happening, I had the first move. My girlfriend then came over, and I was in a unusual great mood with her, not having any conflicts with her at all. I began to talk with her, or I began to just keep talking. I had everything and anything to say, and I really enjoyed what I was talking about. I was in the best mood ever. I then stayed up all night doing homework, something I have never done before. Making sure everything was perfect in my homework. The drug had surpassed all of my expectations, me thinking it was nothing big going into it. My friend told me it would last about 5 hours, but it went far, far beyond that.</p><p>This was my best experience with any type of drug. I have not done much (weed, opium, xanex, vicodin) but this was much more than I had expected. I have ate about 1 snacksworth in the past 30 hours, I have gotten 3 hours of sleep in the past 41 hours. I thought all day today about getting more. Researching today on this website, and reading others stories, I see this is a very addictive drug, so I don't want to do it anymore, since I am the addictive type of person. After reading dosages on here, I believe I took a rather high dose for my first time (60 mg, 145lbs.). I had a great time on this and am still trying to get my sleep back. I feel confident though that I will be able to resist this drug any time in the future.</p>",
 "year": "2004",
 "id": "36941",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-10T08:00:00.000Z",
 "views": "6491"
}
