{
 "id": 3699,
 "title": "Still Feel Minor Effects After 6 Hours",
 "date": {
  "submission": "2004-11-13T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "smokey",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Earlier today I bought a gram (sativa-domintant strain) half/half with a friend, B. This was the start of one of the most intense cannabis experiences I have ever had it would be my first time hitting a gravity bong, i was very excited, and prepared to cough my lungs out...",
  "B stuffs a tiny snap into the bowl, and lights the bowl while pulling the bottle up. I push down on the bottle and feel my lungs fill up with the thick smoke",
  "* cough *",
  "I blow the huge hit out, not holding it in more than 2 seconds because it was so bigI sat back and waited for B to take his hitthe effects were already noticeable , and quite strongafter B took his hit he loaded a bowl for me, and I hit itthis time it took 2 hits to clear it, and I could hold it in a bit longer. I blew out the smoke.",
  "I see out of the corner of my eye that B is loading up his second hit, but I cant move. Some sort of emptiness came over my body, like my muscles werent there. I couldnt feel anything but empty space I kept saying to myself snap out of it, if I dont, I wont be able to moveit was really hard but I finally moved, and realized that I had to keep moving around or Id get stuck again. Keep in mind this was only 3 hits",
  "B loads my third (and final) bowl, and it takes me 3 big hits to clear it, holding each for about 5 seconds. I sit down, my lungs aching from all the smoke.",
  "Okeverythings ok here, Im finemy head is hollow, where did my brain go? There it is, behind my eyesare my eyes burning? Its because there are so many colors in this roomeverything keeps bending, and movingbetter stand up, I have to get homewait, I cant stand up, I cant movemy limbs are now a part of the surroundings, and I am a part of his bedroom. Wait, oh yeah, I just smoked some bud, Im just high, thats right, just high....",
  "I say bye to my friend and am on my way home.",
  "Half-way up the hill I feel my legs burning, like they are about to fall off. I try to just ignore it and keep walking. suddenly I am locked in a repeating motion, over and over againleft foot forward, right foot forward, arms swing, cant stop, im going too fast now The feeling of helplessness grows; I can do nothing but walk, faster and fasterI never slow down, I couldnt if I wanted toI cant feel my legs anymore, but I can feel my feetwhere did the ground go? Im floating now, nothing around me.",
  "Faster, faster, I kept walking till I was practically joggingI stop for a secondor was it 5 minutes, I dont know",
  "ok, time to walk again walkingits hard to keep up a steady pace; Ill walk fast then slow, then fast again, then nearly stop Finally I approach my house, but right as I get to the front yard, my mom is backing out of the garage she says she is going to the store and asks if I want to come. I somehow mumble the words no thanks and go inside. I lock my door behind me and sit down at the computer",
  "my vision is meltingthe computer screen is the only thing that is real, everything else is just a hologramthe computer screen is popping out, coming closer to my face Ok Ill lay down insteadsinking into bed? No wait, there is no bed, I am floating, higher and higher",
  "This goes on for an hour, very intense, before I start to come down a bit. By 2 hours later, I was in an average high, and 4 hours later, I was basically back to baseline however, some lingering effects stuck around. I am writing this 6 hours after I smoked, and I still feel minor effects.",
  "This has been by far the most high I have ever been off such a small amount of cannabis3 small bowls, and I felt like I was on acid or something.",
  "At some points you could say I was too high, though I usually dont think there is such a thing hehe",
  "I find gravity bongs are the best way to get really high off very little weed.",
  "Peace",
  "LEGALIZE"
 ],
 "erowid": {
  "id": "21851",
  "citation": " smokey. \"Still Feel Minor Effects After 6 Hours: experience with Cannabis (ID 21851)\". Erowid.org. Nov 13, 2004. erowid.org/exp/21851",
  "substance": "Cannabis",
  "views": "6350"
 }
}
