{
 "title": "Terror and Beauty",
 "author": "Billy",
 "citation": " Billy. \"Terror and Beauty: experience with Salvia divinorum (5x extract) (ID 36998)\". Erowid.org. Jan 16, 2008. erowid.org/exp/36998",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "report": "<p>I had been curious about salvia after reading about it. I ordered 1g of 5x and 1g of 10x salvia extract, and waited impatiently. When it did come, I felt apprehensive and yes, a little bit scared of the two tiny sacks. So I held off on smoking them.</p><p>I started with the 5x, dark room, late afternoon, out of a what I realize now was a clogged pipe, while talking over the internet with a friend who had done salvia before. I put in a pinch (eye-gauging it, I would say it was less than .1g) and smoked it. The effect was instant, and I crawled over to my bed. I laid there while static danced over my body, with little or no visuals, and no real 'experience' besides that. I had the very faint sensation of first being wrapped in a blanket, then falling through a tear in the blanket. But then I got back up, wondering if 'this was it'.</p><p>My friend told me to smoke more ('Yeah, just smoke the whole gram of 10x') so I decided to polish off the 5x. I put about .7-9g (from what's left in the bag) in, basically 10x what I smoked before, and just kept hitting the pipe over and over and over and over. No effect. The 'hit' came quick, just like the first time, but all I felt while I was sitting in my chair was this strange buzz to my surroundings - but nothing really changed.</p><p>A few days pass, and I smoke pot in between to pass the time. Even though nothing had happened, smoking the salvia left me with an *emotion* - something along the lines of 'Hey nice try but don't fuck with me like that'. So it wasn't until 3 days later that I went back to the salvia and looked at the two innocent baggies. Something told me not to smoke the 10x so I quit on the salvia idea for that moment. About 3 hours later (3am, dark room, open window, quiet and cool), I opened up what was left of the 5x bag, changed the screen in my pipe, and pinched in the salvia.</p><p>Right after I took the first hit, I knew it was coming. It was on me, much stronger than before. I took a second hit, and a third. By the third (no more than 10 seconds) I was completely out of my mind. I couldn't remember what I was doing, basically because my world had been sliced up and shelved, and I saw the progression of time through these slices on these shelves. In this ridiculous state, I noticed I had a pipe in my hand again, and took another hit. I fell back on my bed, and this time, the experience was very very different.</p><p>Again, I got swept up in a process. This time my skin was being pulled, starting from my feet and up towards my head. I could sense it being ripped from my body, but yet there was no pain. It felt curious until it reached my neck, and then I began to panic. What would happen if it reached my head? Was I going to die? Was this it for me? My surroundings had a ridiculous plastic feel, as if my skin (again) was being ripped off and shelved, so that all around me were pieces of plastic skin.</p><p>Well, the ripping finally reached my head, and that's when I got the first sense of another entity within the experience. I felt like I was seeing the world inside out, and that within my head were some of the characters in the reoccurring dreams that I've had in my life. No real words were spoken, but I had the strongest sensation that these were other souls that lived my life with me, some who had been there from the beginning and others that came along later. There was no real message, besides the fact that they were announcing their 'presence'.</p><p>I wanted to get to know them, but the effects began to wear off. I could revisit glimpses of this exposed world through a mental effort (like being able to close my eyes and sending a chill through my body), but it wasn't the same really. The effects were gone so quickly, but when I'm in the throes of salvia, it's so nearly impossible to get out. I got back up and shut off my computer, and went to bed for a night of pretty good sleep.</p><p>That said, I think changing the screen on my pipe made a big difference. Or maybe salvia just chose the time of the experience. While my skin was being ripped off my body, I was legitimately terrified by the thought that this would be death. But what happened afterwards, meeting other :people:, feeling that I wasn't alone was beautiful. I suspect the details of the experience are the different from user to user, but the emotion was very much like what I've read in other experiences.</p><p>I left the experience, however terrifying, feeling very very much at peace. In any case, I still have the 10x sack and a smokeable amount of the 5x left. I'm going to try again, because I think there's more to find in that other world. And maybe it won't be so terrifying to me this time around.</p>",
 "year": "2004",
 "id": "36998",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-16T08:00:00.000Z",
 "views": "2452"
}
