{
 "title": "Not Suicidal, I Told the Doctor",
 "author": "Vagabond",
 "citation": " Vagabond. \"Not Suicidal, I Told the Doctor: experience with Zolpidem (Ambien) (ID 36993)\". Erowid.org. Jun 15, 2007. erowid.org/exp/36993",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "140 lb",
 "report": "<p>I had been sleepless for some time. And slightly depressed. It would later be argued that I was cyclothymic: a milder form of bi-polar. I won't get into that only to say it was later shown to be untrue (proper psychotherapy less medication solved my problems). I mention this to give an idea of my mindset at the time of the occurrence.</p><p>I have had many negative effects and no longer use the drug.</p><p>As I was saying, I had been rather sleepless. Something I continue to struggle with. And I had been depressed. Not suicidal by any means, but normal indicators like increased sleep, change in diet/weight, fewer social outings, something was obviously bothering me. I was living at home with my parents. It was about 5 in the afternoon. I had yet to sleep in two days. I had obtained a bottle of pills from a quick stop health clinic near my house and quickly downed two to get me to sleep, one more than the bottle recommended (overdosing is something of a bad habit with me). After about 45 minutes, if I recall correctly, I was not asleep, but up watching tv. I was definitely not in my normal mindset.</p><p>I knew this because I had used the drug before. Normally I fall asleep a short while after taking the med, but on occasion I do not. And that is when trouble strikes. On a previous night in Hawaii I managed to mangle my right knee after falling down stairs outside my apartment, skinning my knee on the asphalt below. I didn't remember getting there, only falling at some point after going to bed. How I awoke in my own room was a god damned miracle.</p><p>In all accounts of times I took this medication and did not actually fall asleep, I can only explain my actions as the unintended actions of my most simple internal desires. In this account, my inner self wanted some sleep. Badly.</p><p>I remember going to the liquor cabinet and getting the scotch. I remember getting a tumbler of scotch. I remember wanting to fill up enough to get to sleep. I remember the tumbler was full. I remember sitting in front of the TV. I remember my father warning me that seemed like a lot of alcohol. I remember him leaving. I remember drinking the whole of the tumbler in a manner of seconds. Setting the glass down. Going to my room. Lying down.</p><p>Time passes I fall asleep... or pass out</p><p>I remember my mother waking me up. I remember I had wet my bed (I'm 22 at the time). I remember wanting to get up to go to the bathroom. I remember falling. I remember the ambulance. I don't remember being asked any questions. I don't remember being placed onto a stretcher. I don't remember the police asking my parents questions, or the ride to the hospital.</p><p>I remember a doctor. Mind you I am reiterating this exactly as I recall it. Not as I reviewed it later. I remember thinking the doctor was nice. So was the nurse. My parents loved me. They were concerned. There was a bright light over me. An actual light, nothing out of body or anything. And I remember being asked to drink from a cup. It tasted bad. Grey... gooey. (Some will recognize this as activated charcoal) Then nothing.</p><p>I woke up the next day. I felt fine. I was a little groggy, but nothing too terrible. Certainly nothing that would compare to what I had endured. But it had all seemed like a dream. Then my parents came in, talked to me. I remembered it all at that point as I have described it. There were gaps, but I had essentially taken the rest of the bottle of Ambien after the first two pills. All I can figure out is that once I took the two pills and the medication started, and I had not fallen asleep I began, uninhibited, to try to fall asleep as my mind figured I would do it. First the Ambien...all the Ambien... then some alcohol... anything to finally sleep.</p><p>My will, less my control (due to the Ambien) caused a set of events that should have killed me. And the psychiatrist I went to after the event naturally wondered if I had tried to kill myself.</p><p>Certainly not, things weren't that bad. And I would never kill myself. But without normal restrictions of common sense and will, my ID did what it thought would put me to sleep. I'm just lucky I didn't do so permanently.</p><p>And for the record, I definitely was not suicidal. Just tired.</p>",
 "year": "2002",
 "id": "36993",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-15T07:00:00.000Z",
 "views": "7261",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "10 tablets",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 }
}
