{
 "id": 3701,
 "title": "The World as I See It",
 "date": {
  "submission": "2005-12-27T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "marc",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "1 bowl",
   "substance": "smoked"
  }
 ],
 "report": [
  "The following is an account of a glowing salvia experience I had a few evenings ago.  I apologize for the length but I feel it is necessary to completely describe the complexity of my trip.",
  "-BEFORE, PREFACE-",
  "It was just after 7:00 on Wednesday.  My buddy and I had just gotten back from eating some dinner.  We found my roommate and immediately retreated to my room to smoke.  We smoked about .5gm or so in a sitting.  I put on some music (the music for the evening was: Phish - Live Phish Volume 2, Guster - Parachute, Greyboy Allstars - A Town Called Earth, Jimi Hendrix - Axis Bold as Love, and Phish - Live @ the Pepsi Center '03) and we relaxed for a while.  We talked about this and that; our conversation drifted from topic to topic as it usually does when we are high.  People would come and go but we were permanent fixtures in my room.  Two hours or so passed, we smoked again (another .5g or so) and started to play some chess.  Three games took about 2 hours -- everyone who had come and gone in the past 4 hours had all returned to their respective homes; my roommate and I were all that remained of the evening.  One more game -- we passed midnight just as it ended.  I packed one more bowl for good measure and we smoked. ",
  "(As a sidenote:  when I smoke over the course of a prolonged period of time I tend to become more and more detached from reality, not in a 'tripping' sense: I just become much more introverted and thoughtful and these thoughts dwell on personal issues and tend to be very philosophical in nature.  Drug use for me is a personal thing, not a party thing.) ",
  "I enjoyed the act of smoking this bowl very much and something about it, maybe the experience, maybe the day in general and my review of past events, was enough to put me into a very positive mood.  I felt at home, comfortable in my spot on the chair; things were good.",
  "-READY.... AIM..... FIRE!-",
  "We talked for a while and I packed a bowl about the size of a dime of 10x salvia extract.  I offered my roommate the bong.  He declined, so I sat in my favorite chair and took the bowl right to the dome.  During my last few seconds of 'consciousness' I put the bong down and got as comfortable as I could in my chair.",
  "I felt the usual 'coming up effects' quickly; my heart raced, I felt little gravity fields in odd places around my body, I saw the trip engulfing my room.  5... 4... 3... exhale... 1... liftoff.  The room  the colors, the shapes, and the sizes -- smeared and was sent into warp speed while I remained perfectly still.  It was as if my eyes had been shot out of my head.  Verbalizing what followed is next to impossible, as many salvia smokers know, but I will do my best to be thorough.",
  "-THE TRIP, CLIMAX-",
  "As usual, I was sent off into space and my spiritual existence left my physical body.  I reached the boundaries of the universe as myself.  Without regard for the constant laws of the universe, my spiritual existence was destroyed and everything stored in the vast expanse of my mind was nullified.  I was nothing once again; an entity with no known experiences, no familiarities, no life.  A newborn baby, minutes from the womb, had more understanding of the world than I (or what I considered to be I) did.",
  "After a lengthy (yet time has not real meaning in this world) period of complete nirvana, complete nothingness, a world was created before my eyes and 'I' was grateful to be able to experience, and actually be part of, such a rare event.  Prominent colors, shapes, and objects that filled my field of vision, or what 'I' was allowed to see, and formed 'M. C. Escher-esque' designs, 'I' was pleased but very confused.  'I,' however, did not know exactly what caused this confusion or what exactly was going on, but it was pleasing nevertheless.  The music, even thought it made no sense and had no real purpose, led my trip.  The emotions and feelings that erupted uncontrollably were incredible and I had never experienced such freedom from physical and mental existence on Earth.  Slowly, very slowly, as the world began to take shape, 'I' remembered I and remembered that I was tripping.  Instantly I was engulfed; 'I' and I existed in one place at one time.  I learned from I.  I explained to I the ways of the world and began to explain what was taking shape before 'Is' eyes. ",
  "I learned from I as well.  I could never perceive beauty in its purest form yet I had no trouble doing this at all as he had never lived on earth and had not been exposed to the way of people who do live on earth, I didnt need language or movement, I was beyond all of that, far beyond.  We sat together and watched as what once was a shifting, multi-dimensional object, free of description and any sort of preconception, became my denim comforter laid out thoughtfully on my bed.  The spots of yellow, green, and red that drew my eyes from above and below, perfect in every way, 'I' learned, were posters and paintings on my wall.  I showed I that it was possible to see things from different angles when sitting in my favorite chair.  I was not really sure which way I was sitting or whether I was sitting upside down, sideways, right side up - was I standing?  I helped I settle on the fact that nothing had to be any certain way and accept that I did not know which way I was or which way things should be.  We remained together for some time, and all the while I was helping 'I' discover the world for the first time again and I helped I discover what I had been missing every single day of my entire life. ",
  "Still 'I' was confused about much of the place where 'I' was and I embraced the feelings of complete wonder, excitement, and anticipation that 'I' expressed and let flow into I's conception of existence.  Slowly 'I' understood music and recognized Trey's voice but did not recognize the song.  Soon after, I took control of this double existence for a moment and did its duty to respond to my roommate (as a courtesy).  While 'I' did not know that he had said anything, I did, understood, and responded: 'Yeah, I am fine, don't worry, I am tripping really hard right now.  I'll be back in a minute or so.'  Instantly, the dam of experience, information, and understanding broke between the existences of 'I' and I.  'I' was inundated with visual information which, with a small lag as I and I worked to process this information, transformed into perceptual information, and eventually became my room.  I, again, began to dominate my existence and thoughts and the entity that I knew as 'I' melted back into the realm of the infinite.  For a minute I sat in my chair reliving the 'coming down' experience, overwhelmed by the intensity.  5 minutes had passed.  My journey with 'I' had been far more intense than ever before and I was very pleased.  I took a moment to relax and breathe and began to enjoy the 'post-trip.'",
  "-THE WORLD AS I SEE IT, CONCLUSION-",
  "With a smile on my face I enjoyed the dance of life that was all around me.  I noticed a pattern: it took shape, looked at me, and waved.  On my carpet I found a turtle swimming through seaweed filled water, grabbing onto the plants to propel itself under my bed.  I found more and I watched in interest and wondered where they were going and why there were turtles on my carpet.  Their colors shifted back and forth and I, in awe, gasped at their beauty.  Instead of my eyes feeling like the world was entering through them, I felt pressure coming from within and concluded that this is how I see the world, not how the world presents itself to me.  Everywhere around me I found patterns, on my wall, in the carpet, on my sheets, in wood grain...  Each thing I focused on, depending on the complexity, in time was blessed with life and went about its business as if it has its own agenda.  I can parallel this part of my experience to a mushroom trip, but there are small differences: everything that 'lives' remains in the confines of its parent object.  The turtles in my carpet do not have depth unless I perceive the carpet to have depth; I did not. ",
  "An hour or so passed and I sat with my roommate.  With interspersed chat, I described to him in great detail the things I see and their actions -- whether or not he cared I do not know, but we both were in good spirits and, at the time, had not a care in the world.  I remember wishing that I could completely explain this to him because he does not have the same experiences but, unfortunately, I am forever limited to the realm of human expression.",
  "He told me he was going to bed and I asked him to flip the lights off as he left.  Time, in this state of mind, really has no meaning, and once my roommate goes to bed I know I will be left to my thoughts, completely detached from the confines of time which, trust me, is an incredible feeling.  As he left I turned on a dim reading light to assure more clarity in my hallucinations.  The lights go off, the door closes, and I am alone; a smile crept over my face as my entire room revealed its true self.  Absolutely no surface or object was left without life.  My mind was completely clear and I entered into a trance-like state of mind and, once again, lost sight of my orientation.  I let go of the concern that immediately followed and began to think.  This is my time to evaluate myself as a person and sort out any confusion about myself or my life that I feel needs attention.  I feel that this post-trip is some sort of connection between my subconscious and conscious mind.  What goes on I know is not real and I can 'turn it off' if I really concentrate.  I have a feeling of control allowed by my conscious mind and much more a feeling of being led contributed by my subconscious mind; it reveals my true self, my true intentions, and my true aspirations to me and takes me to places I don't dare approach during my real life. ",
  "I embrace every opportunity to look at my 'mind' laid out before me.  The hallucinations I have, the feelings and emotions I experience, everything intangible in this world, describe with ease the most taxing debates that most often take shape in the form of words.  There is no ambiguity in sight and the solutions are right in front of me to discover, all it takes is patience and time; I have an infinite amount of each.  I laid in bed thinking about my life, my friends, my family, and what is to come in the future for a long time.  I thought with complete clarity; interferences from emotion or concern and the randomness that I usually find myself dealing with had been completely eliminated.",
  "~",
  "I woke the next morning around 10:00 with an afterglow bright as the sun, half-stoned from the night before ready to face the world. Even now I feel a little different, a little more appreciative of the world, and a little more insightful into why things are as they are."
 ],
 "erowid": {
  "id": "21868",
  "citation": " marc. \"The World as I See It: experience with Salvia divinorum (10x extract) & Cannabis (ID 21868)\". Erowid.org. Dec 27, 2005. erowid.org/exp/21868",
  "substance": "Salvia divinorum (10x extract) & Cannabis",
  "views": "4127"
 }
}
