{
 "title": "Racing Heart and Anxiety",
 "author": "Tom",
 "citation": " Tom. \"Racing Heart and Anxiety: experience with Gotu Kola & Linden (ID 37026)\". Erowid.org. Oct 3, 2004. erowid.org/exp/37026",
 "substance": "Gotu Kola & Linden",
 "bodyweight": "150 lb",
 "report": "<p>I had been looking for a way to help me focus on my studies, but I didn't want to resort to Adderall, etc.  When a friend told me about his experiences with herbs, specifically Gotu Kola and Linden, I thought it would be worth a try.  Both of those herbs are supposed to help improve, among other things, brain function.</p><p>We bought some of each herb at a local apothecary and went back home to smoke it.  I rolled a small leaf of Linden and several Gotu Kola leaves (they looked more like pine needles).  I smoked only a few drags (no more than 3 or 4) and didn't feel anything right away.  My friend smoked the rest of it.</p><p>At this point I'd like to say that aside from alcohol, the only other drugs I've used are marijuana and hash - each of which, in moderate doses were enough to get me exceedingly high (trippy highs, not chilled-out, relaxed highs).  So I've come to assume that I have a fairly low tolerance for inhaled drugs.</p><p>A few minutes after smoking the Linden and Gotu Kola joint, I became extremely nervous and my heart began racing.  I have been extremely high before (to the point where I've thought I was seeing God), but I have never felt anxiousness as intense as what I felt after smoking these two herbs.  My heart was racing more quickly than I had ever thought would be physically possible.  Afterward, my friend confirmed that it was indeed racing at an incredible pace.  After about 5 minutes, I began to calm down - my  heart rate lessened.  A few minutes later, however, it started again, although not nearly as intensely as the first time.  This cycle of anxiousness and heart racing followed by a calmness continued for maybe an hour.  After the cycling had pretty much subsided, I found that I was becoming winded after walking only a few blocks.  I smoke cigarettes and do not work out, so I am not in particularly good shape, but I never get winded from simply walking - so I feel that this was in part due to my reaction to the herbs.</p><p>I was unable to sleep that night due to a combination of anxiousness and nervousness (some of which may have been in my head).   The following day was marked by a low-grade but unrelenting nervousness/anxiousness and slight nausea that kept me from eating all but a small bowl of soup at dinner.</p>",
 "year": "2004",
 "id": "37026",
 "gender": "Male",
 "timestamp": "2004-10-03T07:00:00.000Z",
 "views": "20157",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Gotu Kola",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Various",
   "form": "(plant material)"
  }
 ]
}
