{
 "id": 3703,
 "title": "He Told a Cop to Suck His Cock",
 "date": {
  "submission": "2006-08-01T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.5",
    "quantity": "3.5"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cyanescens"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Now let me start with the basics. I am 15 along with my friend (A), but my other friend (S) is 16. Now this was mine and As 5th trip and Ss 20+ trip (he cant keep count). But it started out with a night of Natural Born Killers a very badass movie if I might say so myself, and than after the movie we waited about an hour to eat the mushrooms(10:30 pm). The mushrooms tasted like serious shit and were difficult for us to eat, but the motivation of a good trip led us to eating them anyway.",
  "1 hour into is I was feeling very sick and was not having a good time at all, I was fully aware of the sweet ass hallucinations however my bad stomach ache was getting to me. Being so sick I threw up about twenty minutes later. After the sickness went away after having threw up things went great! I couldnt even explain the euphoria that was felt but my friends and I. Now my friend S was tripping the hardest because A had tripped the night before so didnt get much as a result and I had thrown up. For a while we were having a great time, everything in the world was perfect, actually no, it would have been better if I got some of the visuals, but I only got the body high.",
  "At around 12:00 I was coming down and A was done. Although S was still tripping hard. So A and I decided that Fight Club would be a very badass movie to watch ( bad idea). Things were still going good and all was great. We had smoked a few bowls about 25 minutes into Fight Club and got the munchies, so like any normal person we got food. The only real good ting we had were rolls with honey. So A and I started eating them and asked S if he wanted any, he responded with a yeaahaha wuaahahaha arrrhhh ggghhggaga which we just took as a yes, so we handed him a roll. We thought it was kind of funny that he was tripping so hard and we just watched him very amusingly. But after 5 minutes of giving him the roll we noticed that he chewed the roll but didnt swallow.",
  "There was a huge lump of chewed up bread in his mouth. Hahaha. But after a while it was getting a little scary and A and I were getting concerned. By now it was 1:30 pm and we were very tired from the weed. So we decided that we would go to sleep and let S be by himself (which was a bad idea and I am sorry to this day that we did this) but we closed my door and watched the end of the movie. But at that moment S came back into my room and just sat on my bed post. Arent you gonna sleep on the couch I asked?",
  "But got no response so I figured that he could stay in my room as long as he didnt do anything crazy. He sat down in my chair and we turned out the lights. 10 minutes later A heard a gargling sound and thought he threw up so we turned on the lights. He was stuck in between my bed and dresser (he had fell out of the chair). He started getting antsy and then this is when it all  happened. In a fit of rage he flipped up and started spinning out of control! He took one kick and broke my guitar neck and flipped my chair over and started yelling. And when I say this every part of it is true , he was up on his neck and his whole body was facing vertically like he was possessed and was swirling and kicking all around like a whirlwind. It was horrifying.",
  "A and I ran down to the house and got my mom who was already on her way from all the noise. We couldnt say anything but S has taken mushrooms and gone out of control. At this point you could hear him  MOTHER FUCKERS!!! AHHH OHH MY FUCKING GOD, OH GOD WHY WHY!!!! OHH MY FUCKING GOD!!! OHH MY GOD!!!! At this point I though he was hurt very badly it sounded like he was dying. My mom went to my room and opened the door and looked in and saw him flipping all around screaming S are you okay, can you calm down? No response to my mom, it was out of control. My mom called his dad and got him over there immediately. His dad could not restrain his violence and we had to call the paramedics. It was so scary its indescribable. FUCK MOTHER FUCKER OH MY GOD FUCKER ASS COCK MOTHER FUCK FUCK FUCK!!!!! HAHAHAHHAHAHA OOOOOHHHHHH MMMMMMYYYY GGGGGOOOOODDDDD!!!!!!! it was insane. This was not my friend it was something else.",
  "The cops arrived along with the EMS, unfortunately I had to giver my mom the remaining shrooms, my weed stash, my pipe, but not my bong hahahha! This way I would not get into trouble legally by the police. It was intense and horrible and as my mom A and I waited in the living room while the cops got him, we were shocked at scared shitless (all of us even my mom). They had gotten him in the stretcher and had him cuffed up. COCK COCK COCK SUCK MY COCK YOU DIRTY MOTHER FUCKING COPS. YOU MOTHER FUCKER GET YOUR FUCKING HANDS OFFFF OF ME!!!!!!!!!!!!!!",
  "They took him off and the nightmare had ended. The only thing that I heard of in the room besides what I saw was that he tried to hit his dad with a lamp and punched a cop in the face. It was horrifying."
 ],
 "erowid": {
  "id": "21873",
  "citation": " Anonymous. \"He Told a Cop to Suck His Cock: experience with Mushrooms - P. cubensis (ID 21873)\". Erowid.org. Aug 1, 2006. erowid.org/exp/21873",
  "substance": "Mushrooms - P. cubensis",
  "views": "12841"
 }
}
