{
 "title": "Confusing European Kava Situation",
 "author": "Gita dasi",
 "citation": " Gita dasi. \"Confusing European Kava Situation: experience with Kava (ID 37119)\". Erowid.org. Oct 1, 2004. erowid.org/exp/37119",
 "substance": "Kava",
 "bodyweight": "",
 "report": "<p>Concerning the availability of Kava Kava in Europe, it is all quite confusing. I discovered that it was illegal where I was living in the Netherlands(most of Europe is like this), although one can buy pot and mushrooms in any cafe, and get herione from the government if they're a junkie there. My mom tried to ship me a big box w/ X-mas presents, including a bottle of St. John's Wart caps and 1 bottle of Kava caps, but the Dutch customs agents ripped into it, took off the wrapping paper, and confiscated my little bottle of Kava. Then they held onto the package for 2 weeks, before I had to come to their office, and pay 15 Euros fee.</p><p>I found several documents on the web stating that one could get it w/ a Dr.'s Rx in Germany. So I had him write me one, but the pharmacy there just said that it was illegal, and they could'nt fill my Rx. But I heard it IS still legal in Wales, and thought about asking a friend from there to bring some, but I wouldn't want her to get in trouble for me. Then one day I saw a single bottle being sold in a new agey shop in A'dam so I grabbed it. It turns out those capsules have a very small amount of kavatones in them, so it would be quite expensive to take enough to get the desired results. Now I see that particular shop only keeps one bottle on the shelf at a time. The laws in Europe DO give SOME small leeway for buying/selling/possessing it, but most stores are just to nervous to find out exactly what the laws are, w/ the recent noise in the press about liver failure deaths related to Kava ABUSE.</p>",
 "year": "2004",
 "id": "37119",
 "gender": "Male",
 "timestamp": "2004-10-01T07:00:00.000Z",
 "views": "18973",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Kava"
  }
 }
}
