{
 "title": "Weak Warm Well-drawing Water",
 "author": "corngod",
 "citation": " corngod. \"Weak Warm Well-drawing Water: experience with Amanita muscaria & Wild Lettuce (L. canadensis) (ID 37123)\". Erowid.org. Oct 3, 2004. erowid.org/exp/37123",
 "substance": "Amanita muscaria & Wild Lettuce (L. canadensis)",
 "bodyweight": "190 lb",
 "report": "<p>A friend and I awoke at about ten in the morning eager to begin our journey with Fly Agaric.  We both had expectations of an extremely intense spiritual cracking.  Though we received much milder experiences, we were quite happy with the day's experiences in the end.</p><p>I simmered a small pot of water, 1 oz. lactuca virosa, a small amount of kratom dust, and about 1/4 oz. mint for 25 minutes before straining and attempting to drink the thick black liquid.  The taste was not unbearable but far from pleasant.  My thought had been that it would be good to have a mild opiate along on our amanita trip to calm our stomachs and/or anxieties.  Anyway, I drank about 3/4 of a cup of my brew before flushing it down the toilet.  I believe I only experienced mild effect from this tea throughout the rest of the day.</p><p>My friend and I had purchased 1/2 oz. of dried A. muscaria harvested locally in n. amerika.  I've heard reports that the n. amerikan variety is less entheogenically potent than its european counterpart.  Even so, we ground up the mushrooms in a coffee grinder and began a twenty minute boil.  We strained the tea which now seemed to be more of a broth.  I thought it might make good soup... something to keep in mind actually...  Then we put the grounds through a second boil.</p><p>The idea was that we should each ingest about 3.5 grams of dried amanita.  This meant drinking 1/4 of the total amount of tea we made each.  We both probably ended up drinking 4 grams, which proved to work just fine.</p><p>About one hour after I'd begun drinking I noticed a very mild buoyancy.  I use the term 'buoyancy' but would not compare it to the 'buoyancy' wrought from psilocin by any means.  It was more of an opiate buoyancy, but with a subtle undercurrent of friendly agitation.  This continued to grow over the next six hours and was complimented by an enhanced appreciation of color. My friend and I agreed that the most overwhelming feeling of the trip was 'good'.  We just felt really really good.  I found that I felt even better if I went outside.  At the peak of my trip I wandered around my friend's pasture, spoke with his horse, and sat in a tree smoking cigarettes and watching the wind stroke the pines.</p><p>It has now been eleven hours since ingestion and the only remaining feeling I have is a sense inspiration and capability. I would strongly recommend that anyone interested in getting to know Amanitas begin with 'tonic' level doses.  I plan to try an increased dosage in about one week and if all goes well, discover what more profound insights this particular mycelial web has to offer. Good luck and remember that unless you poison yourself, you are in control of your experience, even if 'you' is no longer who you think 'you' is.</p>",
 "year": "2004",
 "id": "37123",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2004-10-03T07:00:00.000Z",
 "views": "19167",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.75 cups",
   "administration": "oral",
   "substance": "Lactuca - L. canadensis",
   "form": "(tea)"
  },
  "1": {
   "time": "",
   "amount": "4 ",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  "2": {
   "time": "",
   "amount": "45 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(tea)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
