{
 "id": 3713,
 "title": "An Enjoyable Combination",
 "date": {
  "submission": "2008-01-29T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ChickaChicka",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "substance": "5-MeO-DiPT"
  },
  {
   "time": "0",
   "amount": {
    "unit": "0:50",
    "quantity": "T+"
   },
   "administration": "5 hits",
   "substance": "oral"
  },
  {
   "time": "LSD",
   "amount": "(blotter / tab)",
   "administration": "T+ 4:30",
   "substance": "1 repeated"
  },
  {
   "time": "smoked",
   "amount": "Cannabis",
   "substance": "T+ 8:00"
  },
  {
   "time": "1 hit",
   "amount": "oral",
   "administration": "LSD",
   "substance": "(blotter / tab)"
  },
  {
   "time": "9:00",
   "amount": {
    "unit": "repeated",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": {
    "unit": "9:00",
    "quantity": "T+"
   },
   "administration": "1 repeated",
   "substance": "smoked"
  },
  {
   "time": "Cannabis",
   "administration": "T+ 10:30",
   "substance": "200 mg"
  },
  {
   "time": "oral",
   "amount": "Kava",
   "substance": "T+ 11:30"
  },
  {
   "time": "4.0 mg",
   "amount": "oral",
   "administration": "Pharms - Lorazepam"
  }
 ],
 "report": [
  " The other day after some effort I managed to get my hands on some chemicals with character. I picked up 20mg of 5-Meo-Dipt which I had been trying to get for a while, as well as some high quality blotter hits. Me and my four friends R, K, G, and J decided to make a night of it. I have tried a variety of substances such as Lsd, Lsa, Mushrooms, Ecstacy, Dextromethorphan, Cannabis, Cocaine, Nirous, Ketamine, 5-Meo-Dipt, a wide variety of benzodiazepines and opiates, and also a bunch of herbal highs.",
  "3:30- Me and my four friends are sitting at my house waiting for our trip sitter and driver for the evening. I decide to pre-dose with the foxy, we are planning on eating the acid at 4:20 so i figured i would be coming up on the acid while i was peaking on the foxy.",
  " 4:20- Sitting in my house we dose on the acid (I dose with 5 hits).  still waiting on or sitter for the evening(I am very much starting to fell the Foxy now it's oddly similar to rush's I get when on mushroooms and ecstacy. R drives to the store to pick up M to drive all us to the local nature preserve.",
  " 5:00- We get to the nature preserve, I am starting to feel the acid now. At this time the snow on the ground was making the body load quite noticeable. The walk to the beach was difficult fighting the intoxification the whole way.",
  " 5:30- Once I got to the beach I was glad we took the trip, our plan was to watch sunset but it was cloudy. The overcast sky created an erie tone at the beach, at this point everything in my field of vision began to pulsate and morph. The low tide left pools of water that seemed to breath with life, sitting on a large rock the swan looked huge next to my friend. As i stare into the distance clear plasma like patterns scroll arcoss my vision. Some of the amazing visuals of the trip dring this time.",
  " 6:30- It is getting dark now, walking through the woods was more difficult this time not being able to see much. When we get back to the car we decide get some weed for the trip. Being in my car and not driving was alittle nerve-racking but the visuals where a good distraction.",
  " 7:00- After finally finding a way to get herb we go to pick up, the next hour was spent coming down from the foxy and waiting for bud. The visuals seemed to decrease with the foxy at this time the only memorable moment is when the dirt on the snow started to pump through it like blood through veins.",
  " 8:00- We go back to my house and smoke some herb which really helps my visuals. I also start to sip some beers which makes my memory of the the trip more hazy, but i know that between the hours of eight and eleven I had some very creative visuals. My clothing pile began crawling and moving around like snakes which kind of left me shaken, and the nozzles controling the water in the shower above my room started trailing down towards me.",
  " 11:30- G,J, and M all leave so me K and R decide to take another hit. At ths point we were alot less intoxicated than before and wanted to get back to where we were before.",
  " 12:30- K falls asleep after taking some Lorazepam leaving me and R drinking more heavily feeling the the one hit a little bit. Over the next few hours me and R smoke some weed and wish we could be tripping as hard as before.",
  "2:00- We decide to take some kava kava extract to see if anything happens, with nothing to speak of. So we decide to take some lorazepam and pass out.",
  " This trip was something speacial I really enjoyed this combination. For some reason when I combine hallucinogens I manage to take more away for trips. The only thing is that I think a phenethylamine needs to be added to this combinaton maybe Mda might be good except for the added bodyload may be a problem, o'well."
 ],
 "erowid": {
  "id": "21915",
  "citation": " ChickaChicka. \"An Enjoyable Combination: experience with 5-MeO-DiPT & LSD (ID 21915)\". Erowid.org. Jan 29, 2008. erowid.org/exp/21915",
  "substance": "5-MeO-DiPT & LSD",
  "views": "2838"
 }
}
