{
 "title": "A Great Journey...",
 "author": "tss",
 "citation": " tss. \"A Great Journey...: experience with 2C-T-7 (ID 3718)\". Erowid.org. Mar 8, 2001. erowid.org/exp/3718",
 "substance": "2C-T-7",
 "bodyweight": "190 lb",
 "report": "<p>I have tried 2ct7 a few times with various results.  The first time I ingested approximately 30 milligrams on an empty stomach, and followed it with some water.  The taste was similar to a tab of MDMA but less strong because of the smaller dose size.  At about 3 hours a mild trippiness was achieved, similar to perhaps one hit of weak acid but nothing more, and it lasted for only an hour or so. </p><p>A second time I smoked approximately 25mg from a bong and got much more from it.  Mild visuals hit after 20 minutes or so and lasted for approximately 3 hours, as did a very introspective, lonely mindset.  At about 2.5 hours in, I began to get MDMA-like qualities, wanting to stretch and touch things, and the body roll lasted for perhaps 90 minutes.  All in all, it was a semi-decent experience, but nothing like the next one I had.</p><p>After having two weak tries with this drug which I have heard such amazing things about, I decided to give it one more try and hope for the best.  I had been having a bad time lately with a lot of things, including my job which was worrying me, my inability to relax when with friends, and generally feeling like crap.  So at approximately 6:15pm, I loaded my pipe with about 40-50mg of 2ct7 and smoked it alone in my apartment.  I held it in as long as I could, and got three good long puffs from the amount.  As I exhaled the third hit, the entire world went into a state of nuttiness.  I suddenly felt semi-lightheaded, and my vision started becoming very trippy.</p><p>I was getting insane tracers and I knew that this was going to be an intense trip.  For about an hour I was in a very very strong trip, very similar to strong acid.  I sat with a favorite cd of mine by dido and laid on my couch enjoying the light show I was getting and the music.  I was getting closed eye visuals at this point, flashes of light splashing through my vision, and when I opened my eyes, things would melt as well as brighten/dim over and over again.  I was very detatched from reality for this hour or so, and was very focused on the things that had been bothering me as of late.  I worked through mental issues I have worked on for months and couldn't solve, and in this hour or so I came to alot of answers. </p><p>At about an hour in, I was becoming very happy, like the onset of a strong MDMA ride, and very tingly body vibes were kicking in.  Tracers were not happening as much anymore, and had been replaced with swirling geometric patterns on top of anything.  The body feeling at this point was similar to two strong hits of MDMA and I was still getting very strong visuals.  At about 3.5 hours in, the visuals pretty much came to a cease and the body roll started to come down. It was all over by about 5 hours from the initial dose. </p><p>This last experience definitely changed my mind as to 2ct7 and what it can do.  In the space of a few hours it helped me work through alot of personal things that I had tried to for months, gave me a great time with lots of visuals and increased audio perception, and a strong body roll to boot.  Very very fun stuff, if you take enough of it.</p>",
 "year": "2000",
 "id": "3718",
 "gender": "Male",
 "timestamp": "2001-03-08T08:00:00.000Z",
 "views": "6213",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "smoked",
   "substance": "2C-T-7"
  }
 ]
}
