{
 "title": "Mild, but Definitely Not Poisonous",
 "author": "Activist",
 "citation": " Activist. \"Mild, but Definitely Not Poisonous: experience with Amanita muscaria (ID 372)\". Erowid.org. Jun 11, 2000. erowid.org/exp/372",
 "substance": "Amanita muscaria",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)"
  ]
 ],
 "report": "<p>I have been steadily developing an interest in entheogenic and psychoactive matter growing 'wildly' within my country (New Zealand), so I was most happy to find that Fly Agaric (Amanita Muscaria var. Muscaria) mushrooms were in fact endowed with hallucinogenic properties. I had been told as a child that they were deadly poisonous, and I think most people here have heard the same, the result being a generous proliferation of unpicked specimens.</p><p>A friend and I went to the local reserve and picked about 10 or 11 generous sized caps, wanting to start with a small dosage, and then increase it dependent on results. We cut out the gills, and dried the mushrooms in an oven, pouring the juice back over the 'shrooms (as recommended by Petri?). We ended up with around 11 grams of dried mushroom, which we added to the top of a small pesto/pasta meal we cooked to prepare our stomachs. I think the meal may have been a bad idea.</p><p>At 6:30pm we had approximately 3.5g of mushroom each (three people), and settled back, waiting for effects, aware they were likely to be minor. An hour later we hadn't felt a thing, and were skeptical of anything happening. 2 hours later and more of the same. We decided that we'd smoke a J since we were getting bored, and we did notice that we felt a little 'more than stoned'. At around 10:45pm I felt a very fleeting, yet distinct, 'size distortion' while standing in the kitchen, and one of my friends commented that she did aswell. We had another smoke, still feeling 'more than stoned', or perhaps just an augmented stone, and planned our next foray into the park.</p><p>I've gathered more now, and I'm going to try the next dosage at 6gms with no meal. I'm unsure whether we dried the mushrooms too much, whether we are at a late point in the season, or whether it was just a combination of low dosage and too much food - but at least we know they aren't 'deadly poisonous'. I'll keep you informed.</p>",
 "year": "",
 "id": "372",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-11T07:00:00.000Z",
 "views": "95646",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  }
 ]
}
