{
 "title": "Gelatin CokeShots",
 "author": "DeKrim",
 "citation": " DeKrim. \"Gelatin CokeShots: experience with Cocaine & Alcohol - Hard (ID 37212)\". Erowid.org. Dec 19, 2007. erowid.org/exp/37212",
 "substance": "Cocaine & Alcohol - Hard",
 "bodyweight": "155 lb",
 "report": [
  "<p>It wasn't too long ago but I was fucked up enough to know that it works quite well. It was another party night with friends, six of us to start. I had pre prepped Jello shots as recommended on the box (one cup boiling water to a box as well as a cup of cold water then refrigerate). I simply replaced the cold water with cold vodka and added a gram and a half of coke to the hot mixture before adding my vodka. One can prepare it as one sees fit but in adding my coke to the still hot water and jello mix I am sure to have a very dissolved mixture.  I made the mixture and poured them into 1 oz. (liquid) paper cups it made about 15 filled pretty much to the top. I'm messy so I did spill a paper cup worth or so. Really its quite simple to make.",
  "The experience was great. At any rate the jello shots do hit pretty good. They take like a dose of anything consumed but they hit pretty smooth to start. I cant really taste the coke but it makes my mouth and esophagus numb pretty much as it should. The alcohol hits first of course because it leaks through your membrane on its way to the belly. This concoction really gets me going. I had a drunk feeling at first for like 15 minutes after scarfing down two 1 oz cups right away. Not wasted but buzzed, then after about 15 or so minutes I felt this adreneline-like rush and my stomach went south. I felt really light headed then just high for a good 15 minutes then I ate one more and maintained that high I think the coke and alcohol mixture prolong the effects of each other.",
  "Some folks like just being high or just drunk because they can't deal with the back and forth of having both at once but jello shots are a way of easing myself into a nice buzz. The more the merrier you know what I mean. I can adjust the ratio to my liking but its the first time I made Jello Coca shots but it was good. There were enough to share with my 5 peeps and I still had some left the next day (in case a jones set in). Whatever though some people dont have the energy and money to get busy with this idea but if you just copped a ball and you hate the stigma of snorting smoking or what have you  you may wanna get creative..... surprise your friends with your vast knowledge of culinary pharmacology!</p>"
 ],
 "year": "2004",
 "id": "37212",
 "gender": "Male",
 "views": "18657",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cocaine"
  }
 ],
 "submissionDate": "2007-12-19T08:00:00.000Z"
}
