{
 "title": "Where is my Mind?",
 "author": "Bert",
 "citation": " Bert. \"Where is my Mind?: experience with Cacti - T. pachanoi (ID 37280)\". Erowid.org. Aug 8, 2005. erowid.org/exp/37280",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "176 kg",
 "header": [
  [
   "DOSE:",
   "12 in",
   "oral",
   "Cacti",
   "(plant material)"
  ]
 ],
 "report": "<p>Introduction</p><p>Well Id previously tried San Pedro cactus with little effect (probably due to my drying in the oven method) so I decided Id give mescaline one last try before giving up. I had pretty much decided I was just unlucky and it wasnt going to work for me, but thought Id give it one last chance.</p><p>Preparation</p><p>I had ordered a cutting from a reputable online seller and was surprised and happy to find a nice package waiting for me when I got home on a Friday afternoon, after having worked eight days straight. I decided to at least prepare the cactus for consumption even if I didnt actually eat it that day, so I spent the next two or so hours de-spinning and removing the skin of it (which is a bastard of a job to do). I was left with a good amount of dark greenish flesh.</p><p>Consumption - 5:00 pm</p><p>I cut the flesh I had into strips of about 4 - 5 cm in length, and proceeded to eat one strip every couple of minutes for about half an hour to 45 minutes. The only beverage I had was water unfortunately, though I found the most easiest way to eat the cactus was to put each strip in my mouth, then fill with water and swallow it down whole. A few times I gagged, from the legendary strong bitter and slimy cactus taste, but managed to get pretty much all of my Pedro eaten.</p><p>The Experience</p><p>6:00 pm: My flatmate T had previously asked me if I wanted to come to dinner with him and a few of his workmates at a strip club. I decided, what the hell, might as well (Id never been to a strip club before) so I got ready, ate a couple of No-Doz tablets to give me some energy and we left.</p><p>6:45 pm: The bus drops us off in the city and we walk a few blocks to the club. By this time the No-Doz is working its magic and I feel pretty energetic, while at the same time noticing something slightly odd, I could feel the beginnings of a trip - which was unexpected. I really didnt think it would work at all. By the time we got to the strip club I was feeling rather odd, but we met T's workmates there and sat down for our meal. I decided I didn't want a meal as my stomach wasn't feeling that great, so I said I'd eat T's entre instead. I found I could only get through about half the entre mainly because I was feeling slightly nauseous from the cactus (though really not too bad) and also because for just some reason I didnt feel like eating at all.</p><p>8:00 pm: By now I was pretty screwed, the mescaline was taking hold and I was starting to get some odd effects. A strip club is a surreal place to be when on mescaline, there were women walking around completely naked, standing at the bar or sitting at tables with rich old men. I was somewhat reminded of the scene in Fear and Loathing where they are at the bar, just before he sees the people turn into the reptiles. I wasnt completely sure what was going on and seemed to be overcome by waves of happy confusion. I would liken it to a mixture of a very low dose of E and quite a bit of alcohol, at least thats how it felt at that point - another similarity to E was the niceness felt when someone hugged me slightly. There appeared to be fine lines around everything, similar to fingerprints but surrounding and encompassing everyday objects. I would look at T and watch the lines around his eyes and face - they appeared to be moving a little as well.</p><p>9:00 pm: When the floor show started I was less interested in the naked and semi naked women than at the visual effects I was getting. One of the strippers danced her way onto our table and started to gyrate and move right in front of me - inches from my face. I was still in a state of confusion and found her pretty amusing but I really just wasnt interested - instead staring at the flashing lights of the club that would flash, then seem to take forever to fade out slowly. One of the strippers went behind a curtain type thing to do one of those shadow shows, and as she danced behind it I watched with amazement the trails her shadow was leaving as it moved.</p><p>10:30 pm: At this point I am acting and feeling quite drunk though I havent touched a drop. I look around at the pictures of naked women on the walls and they look like they are moving. A strange decorative object on the wall catches my eye, it is like a sort of a sun with a spiral pattern in the middle of it, surrounded by squiggly triangles pointing outwards. I decided I really couldnt look at this object as the spiral seemed to be moving, as well as the squiggly triangles - it was hypnotic. I am drawn back to this object many times as the night progresses.</p><p>11:30 pm: I am still screwed and the drug doesnt appear to be wearing off as yet. I stare at my arms and hands and they appear misshapen, my right arm in particular seems quite a lot longer than my left arm, which appears deformed. My hand grows and contracts, my fingers are fatter then thinner. I decide I should probably stop looking at my body parts before everyone thinks Im insane.</p><p>12:30 pm: The nausea or heavy feeling in my stomach is a bit stronger now, I suppose I wouldnt class it as nausea more as just a heavy slightly sick feeling - kind of like when youve drunk too much beer. Im still seeing some pretty odd stuff, the visual effects are quite strong still but my energy has dissipated. By about 1 am we decide to catch a taxi, as there is no one else we know out and Im not really in the mood for partying anymore.</p><p>I knew getting to sleep wouldnt be easy, Ive had trouble on E before and I would class this as pretty much the same difficulty, plus my stomach wasnt feeling very good, and it was made all the more noticeable by lying down in the dark. Fortunately I had some interesting visuals to look at, like the previously mentioned lines in the air, as well as diamond and series of dot shapes moving around in the dark. I did see some other weird patterns and shapes in the dark of my room, but I couldnt explain them to you unless youve seen something similar yourself. I tried to sleep for about half an hour, but realised this was just not going to work so I grabbed my MP3 player and put on some Simon and Garfunkel, which made me feel instantly better. After that was finished I was feeling slightly better, though I also felt like listening to a particular few songs, one in particular Where is my Mind (you know the one, its at the end of Fight Club) which was incredibly trippy to listen to. Id never really listened to the lyrics before but my god they are weird to hear on mescaline, especially when hes singing about swimming in the Caribbean.</p><p>The song finished and I finally felt like sleeping. When I woke up in the morning there was still some slight after effects on my vision, the fuzz or what I like to call static I normally see over everything was slightly more pronounced. My stomach felt fine.</p><p>Conclusion</p><p>All in all a very rewarding and interesting experience. I would have liked to have maybe gone around to a few places or even go for a walk in nature rather than sit in a strip club the entire time, though that was fun also. The nausea was not really too much of an issue, even though it did get a bit worse later on its nothing compared to HBW seeds.</p>",
 "year": "2004",
 "id": "37280",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-08T07:00:00.000Z",
 "views": "5437"
}
