{
 "id": 3729,
 "title": "Lucky Seven Indeed!",
 "date": {
  "submission": "2000-06-27T07:00:00.000Z",
  "experience": "1997-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Trey",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "2C-T-7"
  }
 ],
 "report": [
  "I was recently blessed with the opportunity to sample a material that I feared I might never encounter outside of the pages of PIHKAL, 2C-T-7. What follows is a transcription of my notes from the experience. I was originally somewhat hesitant to submit this, since it's not particularly dramatic. However, the literature is notably lacking in reports on this compound; PIHKAL and a paper by Myron Stolaroff and Charles Wm. Wells are the only ones I've been able to find, so I thought I'd add my impressions to the consensus...",
  "1:15 - Ingest 20 mg. 2C-T-7 in water on an empty stomach. The material is in the form of a white powder with quite a bit of an unknown, chalky filler. The solution has a slightly 'mediciney' taste, but is considerably less bitter or acrid than MDMA or 2C-B. I suspect dilution by the filler to be responsible for this.",
  "1:55 - Off baseline for sure, but in a very subtle, smooth, gentle way. It feels as though a reservoir of energy -- a chakra, if you will -- located at my solar plexus is slowly opening. This stuff feels *friendly*!",
  "2:20 - Notice slight energy tremor and neck and shoulder tension.",
  "2:45 - First O(pen) E(ye) V(isual)s: light patterns are becoming apparent on textured surfaces, similar to low-dose LSD.",
  "2:50 - Try to eat something out of a sense of obligation since I haven't all day. After doing this, I have a short bout of minor nausea, but thankfully, this passes quickly.",
  "3:10 - Physical tension is still present, but nystagmus/jaw clenching are happily nowhere to be found. This material is definitely enhancing my cognitive and expressive abilities. The feeling tone is happy, contented, and calm, not as agressively blissed-out as MDMA.",
  "3:20 - OEV patterns are becoming clearer and more distinct. Remarkably similar to those produced by ~100 mcg. LSD, but with the unmistakable lucidity and feeling-tone of the 2C's . Nice...",
  "3:30 - I can clearly see the insight enhancing capability of this compound now. I feel lucid, comfortable, happy, and confident, not at all 'messed up' or confused, as I find it easy to become on higher doses of the 'traditional psychedelics'. The mindspace is rather like what I experience on 20 mgs. of 2C-B, but without the erotic thrust. I expect that this could change with a partner, however...",
  "4:45 - Plateau still going strong, though somehow I know that it's not going to intensify any more. I would accept a supplement at this point if offered. I could also have easily taken a larger initial dose. If I'm blessed with the opportunity, I'd love to experience it at 25 and 30 milligrams. I just noticed that the muscle tension has not been present for quite some time. This is a pleasant turn of events.",
  "5:30 - I suspect that I may be near the end of the plateau and close to beginning the slow spiral back to baseline that the literature says I have waiting for me. CEVs have been noticeably absent all day; just color washes, increased sensitivity to ambient light behind closed eyes, and very vague fractal forms superimposed if I concentrate really hard. I wonder if this changes at higher doses a la 2C-B? I have a feeling it does...",
  "5:40 - OEVs still present. God, I'm still glowing inside when I become still and focus inward. I feel very *open*...as if I've found a powerful beacon within myself that's ecstatically pumping out positive energy..as if a flowerbud at my solar plexus has blossomed into a radiating hyperspatial rose. Not a lot of ego inflation with this stuff; another plus in my book. No paradigm-shattering expansion or dissolution of boundaries; just enhanced lucidity, inner peace, contentment, acceptance. This material is incredibly clear and subtle; quite remarkably so. If MDMA is Sasha's 'low calorie martini', then 2C-T-7 is more like a very fine, light white wine. I could handle just about any real world responsibility easily at this point.",
  "6:30 - Gradually coming down, but not unpleasantly so. No particular craving for more, thankfully, although I wouldn't refuse a supplement if offered.",
  "7:30 - Traces still linger beautifully. OEVs still barely there.",
  "8:30 - Almost completely down, although the afterglow is nice. I'll have no trouble sleeping tonight. Noticing return of neck and shoulder tension, along with a slight headache.",
  "Well, there it is. I slept well that evening. The next day wasn't too bad, just slightly low energy levels. I have a feeling that this could be a very useful material for enhancing creativity; the mindspace is novel and open enough to be quite inspiring, without impairing one's ability to express the results of such inspiration. I find 2C-B to be very effective in this regard as well. 2C-T-7, however, gives you considerably more time in the state (nearly twice). I also believe that it could be an extremely helpful ally for the shamanically oriented psychotherapist, allowing the patient an incredibly lucid, positive, comfortable mindspace in which to reflect without the marked physical side effects of MDMA or the sometimes threatening intensity of an ego-dissolving LSD session. "
 ],
 "erowid": {
  "id": "2198",
  "citation": " Trey. \"Lucky Seven Indeed!: experience with 2C-T-7 (ID 2198)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2198",
  "substance": "2C-T-7",
  "views": "34733"
 }
}
