{
 "title": "Dancing With The White Girl",
 "author": "Corleone",
 "citation": " Corleone. \"Dancing With The White Girl: experience with Cocaine Powder (ID 3730)\". Erowid.org. Mar 8, 2001. erowid.org/exp/3730",
 "substance": "Cocaine Powder",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  " ",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>It all started when me and my best friend got tired of the usual drugs available in our town. We were bored and eager to try something new. I always told myself growing up that I would stay away from the hard stuff (coke, heroin, speed) but boredom and peer pressure are a bitch and I gave in. Knowing that we could get absolutely any drug we wanted in a neighboring city, we got in my car and proceeded to make the trip. I knew what part of the city to go to, and once you make it there, buying was a piece of cake. I was told that an 8-ball (3.5 grams) is supposed to sell for $80 to $150, so I told the guy I had $120 and he handed me a boulder of cocaine in a sandwich baggie.</p><p>We waited till we got home to dip in to it because I wasn't sure of the effects, which is funny because after we started all I wanted to do was drive! We started out small, taking little bumps. It took me about three bumps to start feeling it and I loved it. I felt like I could wage a one-man war against the world. I felt as though nothing around me mattered except that little white mountain of powder on the mirror. I remember being so scared that my friend was going to blow the whole pile off the mirror. We talked and talked for hours. We each went through about two packs of cigarettes and realized that we were down to our last lines and that sucks. Anyone who has done cocaine knows that feeling.</p><p>When we were done, the mood in the room totally changed. We were quiet, edgy, and sweating like pigs. In my own personal opinion, the high from cocaine is not worth the comedown. It's one of the worst feelings in the world to need something physically. I try to stay away from drugs that make me feel this way and I urge all you people to as well. This one afternoon set off a 5-month-long affair with cocaine in which I got arrested, stole from family and friends, and had to move 800 miles away to get away from it, but that's another story all together....</p>",
 "year": "3",
 "id": "3730",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-03-08T08:00:00.000Z",
 "views": "30365",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
