{
 "title": "The Groovy Glide",
 "author": "Merry & Winter",
 "citation": " Merry & Winter. \"The Groovy Glide: experience with Tramadol (Ultracet) & Cannabis (ID 37323)\". Erowid.org. Jun 25, 2007. erowid.org/exp/37323",
 "substance": "Tramadol (Ultracet) & Cannabis",
 "bodyweight": "150 lb",
 "report": [
  "<p>Today I acquired a few ultracet pills. I did a little research on the net and decided on an dose of two pills. This yields a total dose of 75 mg tramadol/650 mg acetaminophen. The cannabis I had was a very high grade hydro. I'm unsure of the exact strain, but it is very good. Like you haven't heard that before.",
  "T-1:30",
  "I ate a full dinner.",
  "T+0:00             ",
  "I took both ultracets orally.",
  "T+0:15       ",
  "Smoked approx. .5 grams of high grade bud.",
  "T+45 mins       ",
  "I think I start to feel something other than the weed. A little bit opiate in nature but definitely something else to it. I feel quite alert.",
  "T+1 hr 15 min   ",
  "Not quite sure I've hit the plateau because it keeps getting hard to type. Excellent euphoric body sensations. The torso feels so light.",
  "T+1 hr 40 min   ",
  "Good friend called conversation was fluid and warm. Conversations with this particular friend usually go this way but it was better this time.",
  "T+2 hr 25 min   ",
  "Past peak still going strong more weed or another ultracet will spike me back up.",
  "Weed definately amplifies the action of this drug. I did not feel any of the nausea that others have reported with this drug. I also feel 'speedy' as others have reported but I have noticed this with opiates antagonist drugs ( oxycoden, hydracoden, codine, etc. ). B+ combo. A little short lived for my taste, but to be expected considering the ingredients.</p>"
 ],
 "year": "2004",
 "id": "37323",
 "gender": "Male",
 "views": "12517",
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "650 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:15",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2007-06-25T07:00:00.000Z"
}
