{
 "title": "Mind Confusion",
 "author": "Dan",
 "citation": " Dan. \"Mind Confusion: experience with LSD (ID 3736)\". Erowid.org. Mar 14, 2001. erowid.org/exp/3736",
 "substance": "LSD",
 "bodyweight": "145 lb",
 "report": [
  "<p>I had recently been reading about LSD in books and on the internet and whatnot and I had been really thinking about doing it. During the week at school, my friends had told me that they were getting some sugar cubes for the weekend so they could candy-flip. I had done ecstasy before and had a good experience, but I didn't feel the need to candy flip, I just wanted to purely experience the acid. Friday came around, my friend's parents were gone on vacation in Mexico for the week so we had an open house for about the six of us to just chill. It was a good setting to be at and I was in a good relaxed mood.",
  "I decided to take my cube at 8 p.m. I just sat around watching television and talking to friends, waiting anxiously for it to kick in. It was my first time with LSD so I wasn't really sure what to expect. I had read many things about people having bad trips so I was a bit scared of that, but I had to just sit back and wait. Once 9 o'clock came around, things began feeling different. Colors seemed brighter and so did lights and especially bright neon colors just seemed to stick out more and amuse me. I sat at my friend's table in his kitchen, just staring at it, looking at the woodgrain which seemed to stick out alot. At times the woodgrain even seemed to wave a little and I was moving my hands over the grain, wiggling them very fast, amused with them.",
  "At about an hour and a half into it, we went in his basement and turned off the lights and put a Winamp visualization on the computer screen. It created all kinds of colors on there which we looked upon, telling each other what we saw. As my friend began mentioning Simpsons characters, I could just look into the screen and see the character he mentioned. I sat on a couch across from the computer and just stared at the ceiling for a while which was very entertaining, the patterning of it, the colors from the computer screen hitting it was unbelieveable at the time. After staring at the ceiling for quite some time, I went upstairs and looked out the window. It was a full moon that night and I was staring at his patio furniture which was reflecting the moonlight on it. I started to see the snow outside. It looked like his whole backyard was immersed in a light sheet of snow, and even the trees and his pool cover looked like a shiny sheet of ice with snow all around it. After seeing this, it really set into me that indeed I am on acid and that it is working.",
  "For a while after I sat and watched TV. I was so amused with it. A few friends who weren't tripping or on a drug were also with me watching it. I felt compelled to explain to them how great the TV was because you can watch it and on each station you flip to there are so many things to look at and enjoy, especially the stations with nice colors. As it approached 12, a few of my friends left who needed to be home and my friend's sister, whose house we were at, came home. She told him that their uncle was coming here to sleep and this totally freaked him out and the majority of us sleeping there. To avoid having to see his uncle, we all went down to the basement to sleep.",
  "While in the basement we just turned on some music and left all the lights off. I had brought my portable cd player with me and I decided I wanted to listen to some of my classic rock cd's I had with me. I put the headphones on and played the song Voodoo Child by Jimi Hendrix and then Darkside of the Moon by Pink Floyd. While in his dark basement, I just closed my eyes and immersed into the music. I let my mind wander to the furthest depths. Its really hard to explain and understand, but I was so far out of my mind while doing this, it was very strange. After the songs, I would have to do a reality check to bring myself back to the real world. This was probably the most interesting part of the acid experience for me. After doing that for a while, my friends who were all candy flipping and me, we stared at the lights on his cd player that seemed to form different shapes and wiggle around.",
  "We spent the rest of the night down there in the basement, listening and enjoying all sorts of music and looking at lights on his cd player and computer. Overall I enjoyed the experience, but I don't think it was a high dose of acid judging by the other stories I've read about people seeing walls and objects breathing, patterning of all kinds of objects, and the intense open eye visuals. But the mind confusion and 'out-there'ness of the experience leads me to believe I indeed experienced something. Also I'm really interested if anyone else has had an experience like this, possibly with a sugar cube too. Every story I have read on here has been with blotter or geltabs. Or if someone had a real intense trip with a sugar cube.",
  "[erowid note: sugar cubes of LSD are simply standard sugar cubes with a drop of 'liquid LSD' (LSD in solution, usually alcohol) on the cube.  Sugar cubes can vary from extremely strong to mild and there's no way to know what strength it is without knowing how strong the drops were that were used on it.]</p>"
 ],
 "year": "2000",
 "id": "3736",
 "gender": "Male",
 "views": "10955",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD"
  }
 ],
 "submissionDate": "2001-03-14T08:00:00.000Z"
}
