{
 "title": "My Make-Over",
 "author": "Joe",
 "citation": " Joe. \"My Make-Over: experience with Cannabis (ID 37380)\". Erowid.org. Mar 4, 2008. erowid.org/exp/37380",
 "substance": "Cannabis",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "37380",
   "Male",
   "",
   "Not Given",
   "Mar 4, 2008",
   "4104",
   " "
  ]
 ],
 "report": "<p>First of all I would like to state that I am an amazing light weight when it comes to pot, 2 joints of good pot and ill be at the puking stage.</p><p>I brought 1/8oz of pot off my dealer and I was told it was 'very trippy stuff'. I smoked 1 joint and a couple of bowls of this stuff with my mate R and got very high, my girlfriend then called up to tell me that a bloke called J had a free house and if we brought pot we could stay round his. On the way to his house I kept hearing arguments and fights on the streets I was walking past, I also heard my family calling me and got very paranoid. I kept repeating 'You're just tripping, it's not real, if it was someone  they would have come over to you, voices can't hurt.' </p><p>After this first experience I realized the awesome power of this particular strain, it seemed to be something like white rhino. The next night I went to bed early and smoked about 1/4 of a bowl full. I put on the chillies on my headphones and examined the artwork on the green day 'insomniac' album. I then began to stare at a psychedelics poster I have on my door, this is where it started to get really strange.</p><p>The poster grew to fill my entire vision and became black and white. The pattern then began to circle itself and make smaller more detailed patterns, I laid back and shut my eyes. The pattern faded to blackness but this blackness seemed to morph in some kind of way to the music, it was as if I was aware of it morphing but could not see it. After thinking about this for a long time (15 seconds?) I realised that I must be moving around a shape so I perceived it to be morphing. As soon as I realised this I began moving in empty 3D space to the music. This has happened to me when tripping before. I then tried to move myself in this 3D space. This was the turning point in the trip.</p><p>I managed to move myself but I also moved to the music so that every point of myself that I was aware of became a line (Kinda hard to explain but I basicly stretched every part of me) I then panicked slightly but realised I could undo it. For the next 10 seconds or so I played with this new trick (Stretching arms - legs - penis etc) The bizare thing is that I could actually feel these things changing. I then realised that if I can do this with my perceived physical body then I can do it with my mental self. The first thing that occurred to me is how much of a huge cock I could have if I played with this kind of auto hypnosis (is it?). I then told my head to make some kind of backup of my old self which I could go back to. I have no idea if this worked or not. I then tried to mess with my personality and make myself nicer. I actually felt the change and a kind of warm feeling in my chest, I also suddenly thought of all the loop holes in this change and how I could get walked all over etc. I then spent a while thinking and then realised the best thing to do was to repeat 'I wish everything and everyone was great and I was great to my self and to everyone else' I must have repeated this loads of times and I definatly felt my self change.</p><p>I then have a blank spot and I can't remember what personality attributes I assumed. But I seem to remember that what I was repeating changed to 'I wish me and L (my girlfriend) will be happy for ever.' Since I can't influence what L thinks I believe that I must have thought I had formed some kind of psychics link or had a transcendental moment in which those kind of things were within my grasp(!).</p><p>The music then changed to the next track which didn't feel so great so I opened my eyes and had one of those moments I often have on mushrooms or sometimes acid where the ceiling seems layered and doesn't make any sense, I then turned off my music and drifted off to sleep. The whole experience seemed to last anywhere between 5 and 15 mins, although I have a huge blank spot.</p><p>Since this trip I think I have noticed some subtle changes in my personality (mostly positive). I have also noticed that now if I trip alone I get very conscious of and paranoid about my own body and have thoughts like 'Have I cracked my teath?' or 'Have I pissed my self?' etc.</p>"
}
