{
 "title": "Religion Surrogate",
 "author": "PartofGod",
 "citation": " PartofGod. \"Religion Surrogate: experience with 4-Acetoxy-DET, 2C-T-2 , Mushrooms, Salvia divinorum & Opium (ID 37385)\". Erowid.org. Apr 4, 2005. erowid.org/exp/37385",
 "substance": "4-Acetoxy-DET, 2C-T-2 , Mushrooms, Salvia divinorum & Opium",
 "bodyweight": "145 lb",
 "report": "<p>I have done a wide range of drugs and psychedelics.  I smoke Pot regularily, and indulge in opiates frequently, but almost never drink (that is how I justify my use for better or worse).  However, while I still used various substances recreationally, my energies were beginning to focus more sharply and spiritual implications of various substances both organic and sythetic.</p><p>I found myself with one last chance to engage in a visionary expierence in Indiana, before I moved off to new lands.  It was a beautiful July day.  I awoke from Bed at 11am and immediately decided that this day I would dose.  I did not realize how this one day would change my life. </p><p>Now one word to the wise.  My tolerance to all these substances has been greatly increased in the years I have been using.  I have worked with each substance individually and in combination with each other many many times before and at different doses.  It would be insane, reckless, and irresponsible to take what I took that day without significant expierence and people on hand to help.  I like to be alone when I voyage, so I always have numbers on speed dial I can call on my cell at moments notice.  Some say this is foolish, but it has never failed me and when I am alone I am less prone to paranoia and focus on meditation.</p><p>I prepared a foul tasting mushroom tea and laced it with the t2 and the DET.  I quickly forced it down.  After smoking several bowls of high quality herb the spirit of the universe consumed.  Patterning began accompanied by auditory and nasal distortion.  All around me I could clicking, much like an orchestra of crickets and the air smelled rich, almost like a grape smelling incense. I became aware of the counterpoint of my sense in this instant.  How  my sense of touch effected my sense of smell for example.  But this was merely the sensory aspect of the voyage.</p><p>Normally, during this point in psychedelic journey, I become detached and removed from reality. I retreat within myself and let myself be consumed by the force of the experience.  I associate the feeling with become dissassociated and feel small and at the mercy of the universe.  It is humbling. </p><p>This time though, I confronted the power.  I felt as though the spirit of all reality and all time was speaking to me through this religion surrogate that I had prepared and consumed.  It felt as though humankind was destined to find and produce substance that could act in such a way on the psyche.  That these receptors in our mind's were developed to communicate to us the nature of reality. </p><p>I saw the scientific method as it's own religious instituation.  with it's own moral code.  Then I realized, science was just one of many viable ways to find truth.  Science was merely one more mode of spiritual understanding and its success lied in the law of large numbers.  Most religious institutions have ancient texts and tradition that have been honored thousands of years, but science keeps questioning, keeps guessing and keeps changing.  Probability is on the side of science to find truth about reality and existence, but it is not the sole route to enlightenment</p><p>I saw all reality as one whole spiritual entity.  All that was around me was one great entity and that I was merely an appendage of this spiritual apparatus.  Then like being hit in the face, I felt a clarity I have never felt before and I doubt I will ever feel again.  I realized,  if I took what I saw to be true, then everything is potentially spiritual and potentialy sacred. In short I saw Everything that existed was part of God not seperate from it.</p><p>While all this was going on in my mind, I did not fully realize I had shut my eyes.  Suddenly I opened them and found myself in my room again.  I looked up to see the most amazing and beautiful image I have seen in my life.  In a ring around the ceiling was a choir of angels, not traditional Catholic angels, but somehow I knew them to be aztec angels, I don't really understand why, but that is what my mind projected.</p><p>I felt blessed and incredibly lucky to have seen what I have seen and just to be a live.  I stared at this celestrial choir above my head for what seemed like days.</p><p>At some point I decided to pack a bowl of salvia.  Normally, this is the high point of my expierences.  But I wasn't able to get my bearings during the brief expierence and before I knew what was happening the salvia had passed through me.</p><p>So, as I began to reassociate with day to day reality, I prepared some opium from 10 pods to relax and to help me sleep.  I smoked some weed and continued to meditate and give thanks for what I was given to me.</p>",
 "year": "2004",
 "id": "37385",
 "gender": "Male",
 "timestamp": "2005-04-04T07:00:00.000Z",
 "views": "11117",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DET"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": "20 mg",
   "substance": "oral"
  },
  "2": {
   "time": "2C-T-2",
   "amount": "",
   "administration": "",
   "substance": "3.5 g"
  },
  "3": {
   "time": "oral",
   "amount": "Mushrooms",
   "administration": "(tea)",
   "substance": ""
  },
  "4": {
   "time": "1 bowl",
   "amount": "smoked",
   "administration": "Salvia divinorum",
   "substance": ""
  },
  "5": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Opium"
  }
 }
}
