{
 "title": "Temporary Wisdom and Temporary Insanity",
 "author": "Hot Milk",
 "citation": " Hot Milk. \"Temporary Wisdom and Temporary Insanity: experience with Mushrooms (ID 37390)\". Erowid.org. Mar 12, 2007. erowid.org/exp/37390",
 "substance": "Mushrooms",
 "bodyweight": "63 kg",
 "report": "<p>Prior to taking mushrooms I had a reasonable amount of experience with hallucinogenic substances. I had recently dabbled with fairly large quantities of LSD and had frequently used DXM, Cannabis and Ecstasy, which can have fantastic mind-altering affects when large quantities are taken followed by a few joints. This, I felt, would stand me in good stead with regards to mushrooms as I was led to believe these were far less potent than other hallucinogens. Now I realise just how wrong I was.</p><p>Myself and a group of about six other people had gathered at a friends house in South London to ingest a large quantity of mushrooms between us, in excess of 150-200gs. The house itself was small with intricate patterns on the furniture and the ceiling. It was a place we often used for drug related activities so we all felt comfortable there, the intricate details in the room provided an excellent source of amusement for tripping.</p><p>As it was my first time I decided to be cautious. Previous experiences with DXM had taught me to be weary of large doses as on one occassion, in a well known London park, I was incredibly ill as a result of taking too much, this then threw me into an introspective nightmare for at least four hours. I ate all my mushrooms (16g) at around 8pm, the others did the same except for a few who chose to make tea with theirs.</p><p>I felt a little ill for about half an hour because of the taste of the mushrooms, but nothing out of the ordinary. Then I began to feel a sense of fear, I felt that at any moment I would be violently sick. This was only partly because of the drug. Some of my other friends were in conversation making private jokes to one another, this gave me a mild sense of paranoia and a strong desire to get away from them. I managed to calm myself down by realising that this was just a drug, that reality wasn't changing, just my perceptions.</p><p>This is one of the most noticeable differences between LSD and Mushrooms. With acid there is a general feeling that the drug is in control, but with shrooms I was able to choose whether I wanted to trip visually or allow the drug to merely affect the way I was thinking - this lead to some of the most in depth conversations that I've ever had. However, I still couldn't face the others. Instead I chose to sit in another room. This was at about 8.45pm (45mins into the experience). I lay on a couch with the light turned off and my head buried under a pillow.</p><p>I did this as the floral pattern on the furniture was too much to look at. Watching flowers and vines grow out of an arm chair and up the living room walls can be a little hard to handle at times. I constantly had thoughts rushing through my brain. The general theme seemed to be how out of place I was here. I could hear my friends in the next room making a lot of noise and it made me feel that I was too mature for them as all I wanted was peace and quiet to adjust to this drug.</p><p>Over the next three hours my friends would come into the room, one at a time, to see how I was and to take a break from the commotion next door. It was during these periods that I would uncover my head and talk with them about life. I felt like a superior being. I had a mental image of myself as an old, wise, druid-like man, sat on top of a giant mushroom.</p><p>They talked of how the scene in the other room was too much to handle at times. I was able to finish off their sentences for them when they were unable to describe how they felt. After numerous consultations with my friends a small group of them decided to relocate permanently to the room I was in. They seemed to gather around the couch that I occupied and we began to talk about life. What exactly we spoke of I'm not sure but I do recall talking at length with one friend about music: mainly Pink Floyd, The Who and Jefferson Airplane. This began at around midnight.</p><p>A short while after this began another first time mushroom taker who I had not seen since the start of the evening appeared. She was a small girl and had drank some mushroom tea made of approximately 40gs (wet weight) of mushrooms. Upon entering the room she immediately found the nearest corner to cower in. There was silence. Then she began talking to herself, loud enough for us all to clearly hear, 'Mum? Do I have a mother? Do I have parents? Who am I?'. This confused me at first, then one of the others approached her to comfort her.</p><p>They took her to the next room. When she left I had asked what that was all about. Her boyfriend had explained to me how she had gone mad. The dosage she took was the same as he had taken, however, he was about twice her size. She had spent the evening in a state of detachment. It was only a few days later that she was able to tell us what she felt. She was on the verge of hurting herself, maybe even contemplating suicide, as a result of the massive affect the drug had on her. She had spent a lot of time repeating what others were saying to her believing that she was saying it first and they were repeating her.</p><p>We spent several hours talking in the living room. For most of the evening I felt relatively calm, until now. Mid-conversation I felt that I was being ignored by one of my friends as he continued to talk whilst I was trying to. Without thinking I leaned over him with a clenched fist and an menacing look on my face. There was a moment's silence, broken by us all simultaneously breaking into laughter at the absurdity of this action considering his crime and my placid mood.</p><p>The night proceeded like this until about 2.30pm, almost five hours after it started. The drug had largely gone. Now all that was left was the fact that our minds were still wide awake. This would make sleeping very difficult for the next two or three hours. Some of my friends decided to smoke some weed, I decided to pass on this as I saw no need to. Instead I went to the bathroom to clean myself up as I had been sweating perfusely for several hours, a nasty side effect I have with most drugs, especially with hallucinogens.</p><p>When I returned to my trusty couch I felt that the entire atmosphere of the room had changed. It felt cold and there was a general sense of tiredness about it. At this point I realised that we had returned to normality. During the peak of the trip, when I felt like a druid atop a giant mushroom, the general consensus was that I was a wise man, well respected, a figure of some authority. This feeling had disappeared and any respect the others had gained for me was lost, I had returned to my natural place in our mini-social hierarchy - I had returned to being the butt of many a joke, but it was all in jest, no insult was sincere, just harmless fun.</p><p>Looking back on this I think it had something to do with the idea that my movement had 'shaken' everything up. I feel that over the course of the trip the atmoshpere is given a chance to settle within your setting, in this case a living room. By moving around the atmosphere is disturbed. Imagine having a jar filled with water, you then pour sand into it and allow it to settle, this is the current atmosphere of the scene. Then imagine that by moving around you are shaking this jar. It is impossible for every grain of sand to return to it's original place, just as it is impossible for the atmosphere of the room to return to it's original state. I mention this because every time that I've used mushrooms I have found that whenever I get up and move around after settling in a nice area, things start to go wrong and rarely return to the way they were.</p><p>Mushrooms, in my opinion, are equally as good as LSD, so long as you know your dosages. The effects mushrooms have on you are easier to control, as are dosages (it's often difficult to know how strong acid is until you've taken it). However, if, like me, you feel the need to experiment with a little bit of everything, then acid is a must. I find that the experience of taking large doses of acid to be far more intense than that of mushrooms and it lasts longer, as do the after-effects, generally my mind feels as though it is out of focus for the next day, it feels as though something isn't quite right.</p>",
 "year": "2004",
 "id": "37390",
 "gender": "Male",
 "timestamp": "2007-03-12T07:00:00.000Z",
 "views": "2883",
 "dose": [
  {
   "time": "0",
   "amount": "16 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  }
 ]
}
