{
 "id": 3742,
 "title": "My 18th Birthday",
 "date": {
  "submission": "2005-10-18T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Mimi",
  "gender": "Female",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 oz",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "<p>Well, it was my birthday, April 8th.  I had started off the day doing volunteer work, let it be known my best friend had just gotten into a big car accident and was in the hospital, and my sister had told me she had a present for me.  After 5 hours of dodging cars and getting sunburnt, I went home.  There was a package, a square tin, filled with tiny mushrooms. ",
  "I had eaten shrooms before, but they were a lot bigger and in smaller quantity. She had told me to share them with someone bacause it was too much for me to handle, BUT did I listen? No!  I had no one else, my other friends were with their men at hotels.  So I just jumped in the shower real fast, then I downed them.  I only drink water when I eat shrooms, so as not to hurt the buzz.   I got the urge to walk up to the store for suckers.  Don't ask me why.  When I got 3 bags of suckers and headed for the cashier, I felt it.  I went in a giggle frenzy.  I walked the block home wiggin outta my mind.",
  "When I got home, I bolted past my dad into my room.  I kept getting these phone calls from my friends, but I didn't know who they were, they didn't know what I had done.  They were scared more then me at the time.  I have a rainbow light in my room, so I turned it on and watched the room swirl together in an array of colour.  I have clown posters, ICP, and the started laughing at me.  I couldn't smoke a cigarette cuz it kept melting.  After 1.5 hours later, 3 guys stopped by to hang out.  They were idiots, but I had no one else.  They kept making me change the music, but I was disoriented, I didnt know my name. ",
  "We left in a car.  I made it to the gas station, that was it. It feels like I was going fast, but looked like I was moving real slow.  Almost like if I was in a tilt-a-whirl, but more colorful and less nauseous.",
  "I puked.",
  "All over the back of this guys car, I puked on myself.  I jumped out of the car and ran through a busy street, but I didn't know.  I ran through an alley and hid by a fence.  I couldn't see anything.  It was swirling together and melting.  The guys drove back around to get me, but I wouldn't go with them.  I eventually made it back to my house, where I hid in the backyard, lay in a fetal position, thinking I was going to the hospital.  I realized I had to face my dad, who so happenly thought I was drinking.  I told him the truth and started crying,  he put me in the shower.  My mom flipped out on me, grabbed my face and started yelling, then punched my sister for trying to break it up. ",
  "I tripped for a good 6 hours after that, but it was real mellow.  I started to just see trails and rainbows.  I almost thought I was gonna quit all the smoking and  hallucinogenics I do, but hell no.  I'm a trooper, I know better now.</p>"
 ],
 "erowid": {
  "id": "22013",
  "citation": " Mimi. \"My 18th Birthday: experience with Mushrooms (ID 22013)\". Erowid.org. Oct 18, 2005. erowid.org/exp/22013",
  "substance": "Mushrooms",
  "views": "3699"
 }
}
