{
 "title": "True Purpose is Love",
 "author": "blinded seer",
 "citation": " blinded seer. \"True Purpose is Love: experience with Meditation, 5-MeO-DMT & Cannabis (ID 37444)\". Erowid.org. Oct 20, 2004. erowid.org/exp/37444",
 "substance": "Meditation, 5-MeO-DMT & Cannabis",
 "bodyweight": "110 lb",
 "report": "<p>A beatiful glass hooka was loaded with some beautiful buds (chronic cannabis sativa), and some pretty yellow crystals were sprinkled on top. It was 3 of us, we lit it up, and smoked it down. The others laid down, and didn't have any sort of experience as I did, I was sitting alone in the room, with a glowing awareness of something all around me.</p><p>------------</p><p>Very altered my consiousness is feeling, what to do, I know.</p><p>Sat on a fold out couch bed in the middle of the small crummy apartment, I put myself in a half lotus position, straightened my back, and slowly started breathing in my nose, and out my nose.</p><p>My method of clearing my thoughts is to dwell on the sensations of the air going in, and out of my body, and this is what I was feeling when a voice entered my ear, no it was my mind. . . .</p><p>'the truth is love, and love is what was there first, when your were born all you knew was love, your experiences are what affect your love, your truth, in losing love, you'll lose yourself, it has always been this way, and always will. . . '</p><p>----</p><p>Just think about it, what would be your reaction if the voice of seeing started speaking your mind about the truth of existence. My initial thoughts were, I am hearing a voice, but I heard no sounds, I heard the words, but I couldn't say that they were in english, I felt the meaning, but there were no words, who was speaking? All these thoughts abrupted the voice, and as quickly as he came, he faded away.</p><p>I sat meditating on this thought for a few minutes, my eyes have no yet opened since I sat down, something hit me in the face, I opened my eyes to someone laughing at me sitting all buddhist looking on the corner of his sofa bed.</p><p>I tried explaining what happened to a few people, but it didn't help. I believe now while sitting here, the voice hasn't came back to me since that day.</p><p>Just two days ago I started reading Carlos Castaneda's The Fire From Within, a supposed seeress in some chat room told me the stories were fiction, but in the book they speak of the voice of seeing, which is what I believe I have heard.</p>",
 "year": "2003",
 "id": "37444",
 "gender": "Male",
 "timestamp": "2004-10-20T07:00:00.000Z",
 "views": "10117",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ]
}
