{
 "title": "Even Better Than Before",
 "author": "Aire",
 "citation": " Aire. \"Even Better Than Before: experience with 5-MeO-DALT & Cannabis (ID 37456)\". Erowid.org. Oct 18, 2004. erowid.org/exp/37456",
 "substance": "5-MeO-DALT & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  "DOSE: T+ 0:00",
  "50 mg",
  "oral",
  "5-MeO-DALT",
  "(powder / crystals)",
  " T+ 2:00",
  "2 hits",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>This was my third experience with this substance and by far and wide the best yet. A friend and I each took 50mg of 5-MeO-DALT and awaited its very pleasant effects. My friend had never tried this material before but is very experienced with conventional and 'research' psychactive substances as am I.</p><p>About thirty minutes after ingestion in capsule form that I had prepared, we both remarked feeling much more of an 'awareness' of our surroundings and how we we're definately coming up to this wonderful substance's peak.</p><p>Fourty-five minutes after ingestion and I am definately at a peak where just as in past experiences my body is filled with pleasant waves of pleasure and my mind is in a very 'psychedelic' state. Over the next 30 minutes it would become even more intense and with every new minute my friend and I both remarked at enjoying the experience even more and more as the peak kept getting higher.</p><p>The height of the peak brought about a very psychedelic mindframe/mindstate all the meanwhile coexisting with strong feelings of pleasure and joy. Conversation flowed easilly and we both remarked alot of visual activity.</p><p>We were both getting lots of distortions at things we were focused in on as well as other things still in our field of vision, though our eyes were not focused onto them directly. Along with the very obvious and ever-changing constant distortions we were both experiencing an effect where anything off and into the right or left of our field of vision was having its color or the color/light coming off of it fading in and out (some call it a 'breathing' effect) and even changing. To add to all of this visual activity, we both also experienced a whole lot of 'tracers' at anything and everything we looked at. Everything was moving in slow motion and our eyesight seemed to be running at a low frame-rate.</p><p>It was hard to keep a smile off our faces and we laughed uncotrollably at anything even remotely funny and/or comical. The peak is definately one that initially comes on quick but seems to have different stages or maybe it was just this higher dosage since it just kept getting stronger and stronger and we loved every minute of it. These peak effects sadly only lasted about 3 hours though every minute was thoroughly enjoyed.</p><p>Closing in on the 2 hour peak point my friend and I each had two pretty large 'hits' of some good-grade marijuana. This is the first time this substance has been documented to my knowledge (5-MeO-DALT) in combination with marijuana. Just as smoking marijuana will do to my experience on say 'MDMA' it was very much the same for 5-MeO-DALT. It took the peak to an even higher level and made the last hour of the effects at least 50% more pronounced than they were before (and believe me, they were already VERY pronounced to that point).</p><p>All in all my friend and I both thoroughly enjoyed ourselves. Just as previous experiments with 5-MeO-DALT, I experienced no 'hangover' whatsoever. Just a very mild headache (probably from the marijuana) and other than that we were both totally back at feeling 100% normal/sober or aka being back to 'baseline.'</p><p>Even had we not smoked any marijuana at all, I still believe that this was the best experience on this material I had had. I can say this because I was already at that point before having smoked it in the first place. The previous two experiences were very pleasant and all-around thoroughly enjoyable though this was definately even better. I do believe that smoking marijuana while on this substance does make it even 'that' much more enjoyable, however, so if you smoke marijuana I suppose you could say that's good news for you. At any rate - no regrets; had a blast of a time; this substance impresses me more and more with every experience.</p><p>To anyone reading, be safe! Although I believe this substance to be very much enjoyable it shouldn't be abused and should be approached with extreme caution as it really is the epitome of what a 'research chemical' is (with it still being relatively 'brand new' and such).</p>",
 "year": "2004",
 "id": "37456",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-10-18T07:00:00.000Z",
 "views": "21926",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
