{
 "title": "Odd Aftereffects",
 "author": "another 'kid'",
 "citation": " another 'kid'. \"Odd Aftereffects: experience with Amphetamines (Adderall) (ID 37452)\". Erowid.org. Mar 7, 2007. erowid.org/exp/37452",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "report": "<p>Well Im writing this now not really knowing what to actually think about it.  As of now and for about a couple of months before I've been off adderall. I took it regularly (sort of) since 1998 I believe (20-30mg a day). It was my senior year in high school. Now Im 24 and should have graduated college this past semester. Needless to say ive had some big events in my life to cause my delay in school (ie: moved to a new state, mother breaking down with depression, brother in depression, father not giving a f*ck about much of anything.) but none seem to be a bigger factor then myself. I've always been a deep thinker but didnt really stray too far from what I was always supposed to do, work, go to school, and have a life. Now I have found myself with no friends, no family, no life and worst, no reason to live a shitty life any longer. Not saying Im going to commit suicide tonight but I have to say that I've thought about it alot.</p><p>Anyway the point for this is that I can't seem to get my shit together when Im not on adderall. Before I even took this drug I was always just a little behind in school (procrastination) but I could do extremely well when I had to. When I started Adderall I did extremely well all the time and felt good about myself and what I was doing. I've taken it so long now that I cant motavate myself to do anything anymore without it. In fact I just got off the phone with my mother telling her to get me back on the prescription of Adderall just so I could try to get back into school and graduate college. I'm not sure if it was Adderall that has messed me up so horribly but it helps soooo much when Im on it that I've come to be dependent on it rather then work through lifes tough times. I dont know what Im looking for by writing this other then finding others that have had similar experiences with their young lives and maybe an alternative to get through things other then turning back to drugs. Thanks.</p>",
 "year": "2004",
 "id": "37452",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-07T08:00:00.000Z",
 "views": "3511"
}
