{
 "title": "The Crying Trip",
 "author": "Simon",
 "citation": " Simon. \"The Crying Trip: experience with Mushrooms (ID 3748)\". Erowid.org. Mar 14, 2001. erowid.org/exp/3748",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "report": "<p>This was probably one of the worst days of my life.  Me and my friend scored some shrooms, and we were going to do them for the first time. But the night we were going to do them, my girlfriend (now ex) told me not to take them so I didn't. So the next morning I decided to take them. I wrapped all of them up in some bread and proceeded to munch on them. Everyone told me a quarter was way too much, but what the hell, I wanted to trip.  I was the only one tripping too, and I was told not to do that either, but again I disobeyed. </p><p>After about half an hour, I started to se some tracers. I thought it was cool but I was unaware of the following horrors.  All five of us were sitting around watching TV when I started to feel myself turn into liquid. I didn't notice it for awhile, but then I melted down onto the floor and my friends all started to laugh at me. I started yelling for them to pick me up, and they did and put me back onto the couch. I was back to normal form and my trip stopped for a second. Then I looked at my friend Jake, and he had black lines all over his face and I started screaming. They all told me to shut up because they were watching TV.</p><p>I felt so alone being the only one tripping, and secretly I started to cry. Then Jake saw that I was crying and started to make fun of me. I cried harder. I ran to the bathroom because my nose started running, not the normal cold running, I mean gushing mucous. I soon had a booger about 3 feet long. It was disgusting. So I washed myself up and my friends told me to take a shower. Big mistake. I got in and the water seemed to absorb into my skin. I could hear every bead as it hit my skull and then it stopped suddenly. After about 2 minutes, I could hear a voice in my head. It was my friend. He started saying how much of a loser I was, and how I am worthless. I cried some more and then decided to get out, the voice was making me depressed.</p><p>So as I stepped out, I looked to the corner of my bathroom and I saw a little green man. You could call him a leprechaun. I was scared shitless. He started hissing at me and then he froze. Then the shadows that his eyebrows cast on his face suddenly took over his body in a deep blackness and it sunk into the wall. I cried some more. I came out of the bathroom stark naked and crying, and my friends took me downstairs to my room and told me to get dressed. I stood in the middle of the room crying for about a half hour. Then I finally got myself together and put some underwear on. When I reached out for a knob on my closet drawer, I saw my hand melt into the drawer. Again, I cried at the loss of my right hand.</p><p>I laid on my bed and cried very hard until all my friends came down and calmed me down. They took me back upstairs and I looked into the bathroom mirror and the tiny hairs on my face grew very long and took over my head. More crying. This is about 4 hours after I ate the shrooms (the shower was roughly about an hour long, I cut it down because not much happened). I then decided I should sleep. That was the only good thing that happened. My dream was total darkness and I felt as though I was flying through space, seeing stars and planets, and then quickly falling towards the earth, then when I hit, I awoke. I laid there on my bed for a good 2 hours thinking about the earth and how my life is meaningless and I cried some more, I mean very hard crying, you can't even imagine. After the hour cry I began to come down very quickly and my life was back to normal. I was very happy it was over, and I was hesitant to do it the next time. Maybe I'll write about that one sometime.</p>",
 "year": "2000",
 "id": "3748",
 "gender": "Male",
 "timestamp": "2001-03-14T08:00:00.000Z",
 "views": "12179",
 "dose": [
  {
   "time": "0",
   "amount": "0.25 oz",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
