{
 "id": 3750,
 "title": "Playful Experience",
 "date": {
  "submission": "2007-03-04T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "A Humble Acolyte",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>My girlfriend, we'll call her A, her aunt, we'll call her L, and I were enjoying each other's company by candlelight in a secluded house. A and I were pleasantly high, having smoked 3-4 bowls of hash mixed with high quality Cannabis. Due to some draconian drug testing at her place of business, L couldn't join us in smoking and was drunk instead. None of us had experienced hallucinogens, but were all familiar with pot.",
  "We were all in high spirits, so I decided to experiment with some salvia I had recently bought from a head shop. I told the ladies everything I had learned from the vaults and a few things friends had told me. I told them to expect an intense but short-lived trip and assured them that the Salvia sacrament was safe and legal. I also recommended taking the biggest hits they could handle and holding it for as long as they could.",
  "We eagerly used a makeshift water pipe fashioned from a plastic bottle and some bic pen tubes. I held each hit for at least 30 seconds before exhaling and A and L held theirs for comparable times. I repacked the bowl half way through, keeping a steady smoking rhythm. On my final hit, (I had lost count, I suspect it was around 4-6) I held the smoke for what had to be at least 2 minutes. I paced around the room, trying not to think about breathing and feeling my lungs burning. I finally let the smoke out and suddenly felt much, much, much higher than the pot had made me.",
  "My companions were clearly feeling it as well and this made us start laughing. Our laughter got more and more intense until we were flailing our arms and starting to tear. I suddenly felt higher than I had ever possibly been and had to sit down. As soon as I was down we blinked into another dimension. Abruptly I realized that everything was dark except for the 3 of us, who were glowing, and that the fringes of reality were spider webs of lightning. My mind felt as if it was lucid dreaming, but I intuitively knew that both A and L were in this space with me. Still laughing, I closed my eyes and took a deep breath, very very excited at being in this strange place.",
  "A delusion came over me; I began telling A and L that I was an ice cream sundae. With my eyes closed I looked at myself and saw the silver bowl I was sitting in and felt sprinkles being dropped all over my head. As the vision became more and more detailed I explained everything I was seeing out loud. It felt as if I was speaking in a language no one not in our private dimension would understand. I remained outside of my ice cream body looking at the colorful sprinkles. They started inching around my head like inch worms and tickling. This made us laugh even harder. All of a sudden they started burrowing into my brain! I rolled around on the ground rubbing my head wildly and cackling like a man possessed. I felt as if nothing in my life had ever been funnier than this moment and in truth, Ive never laughed so hard at anything.",
  "5 seconds later reality shifted and we were back in the room together. We all felt as if we had come back at the same time and there was a moment of weirded out silence. I broke it by asking 'What the *fuck* just happened!?' and we all laughed some more, fervently trying to explain what we had seen. We all described shifting to the strangely small and dusky dimension the same. We also all knew we were all there together and knew it was a positive experience. We had all had different visions however.",
  "I had obviously been the most deeply touched with my vivid visuals. L had seen two serpents coming out of my head 'like devil horns' and seen them curling around my head together. A had seen things all over my head but had been telling us while she was tripping 'Dont worry guys, they're just Tetris pieces' We stayed up talking about our communal visions and visions in general for another 15 minutes before all going to bed to experience a night of very vivid dreams.",
  "In retrospect:",
  "My spirituality consists in a belief of animism and shamanism. Having read a number of works on shamanic experience and shamanistic cultures I felt as if I should have had special insight as to what happened to us. Beyond the three of us glowing, which is common in shamanic states of consciousness, I was pretty stumped. I had felt at times as if the spirit of an old woman was quietly observing us. This, I think, was probably lady salvia herself watching on in amusement. In Carlos Castaneda's book 'the Teachings of Don Juan' he describes his first experience with Peyote as a nonsensical romp with an electric dog. The experienced shamans around him took this as a good omen because Mescalito was playful with him. I can't attest to Carlos' accuracy in his books, but if this concept is genuine I could easily see our initiary experience as Salvia playing with us to show her good will and affection.",
  "My advice to would-be salvia users: It helps to have a reverent mindset and not to have any preconceived notions of what you're in for. In my limited experience with this wonderful plant it seems as if I get better results when Im stoned. Maybe lower levels of inhibition help you shed your every day reality a little more completely? Or maybe the important ingredient is relaxation.</p>"
 ],
 "erowid": {
  "id": "22030",
  "citation": " A Humble Acolyte. \"Playful Experience: experience with Salvia divinorum & Cannabis (ID 22030)\". Erowid.org. Mar 4, 2007. erowid.org/exp/22030",
  "substance": "Salvia divinorum & Cannabis",
  "views": "4278"
 }
}
