{
 "title": "Walls Moving, Patterns Scrolling",
 "author": "exmormon",
 "citation": " exmormon. \"Walls Moving, Patterns Scrolling: experience with Zolpidem (ID 37529)\". Erowid.org. Nov 6, 2007. erowid.org/exp/37529",
 "substance": "Zolpidem",
 "bodyweight": "195 lb",
 "report": [
  "<p>I was perscribed ambien to help me sleep.  Frankly, I think that Ambien can be very scary sometimes, so I make sure not to take it if I am leaving the house.  Sometimes I cant fall asleep or I get distracted and forget to fall asleep on it. this can be caused by the ambien, as I will explain.  The disconnected feeling comes on QUICK.  Were talking 10-15 minutes.  I certainly dont chew them because they taste like shit and the effect does not change.  I just swallow them.  The effect is like watching a slow motion movie that can switch to fast forward instantly.  I loose my inhibitions.  I cry a great deal easier.  I end up bearing my soul to my wife, saying things that are in my heart that I normally wouldnt say.  I told her things that I really needed to say to her so in a way I am so glad for this drug.  Its like a truth serum. ",
  "It can also get me into a lot of fucking trouble.  My friends called me once after 2-3 hours after I took 10 Mg and I was babbling like a lunatic.  Keep in mind that I had fallen asleep, which I have noticed severely alters my conscienceness.  They knew I was out of my fucking gourd, and this was bad because I was a very strong Mormon at the time.  They reminded me of it later and I was like 'What the hell are you guys talking about'?  I had forgotten all about it, then I remembered  details. Soon I remembered almost everything.  This is one part I dont like about Ambien.",
  "Ambien also has some really strange visual effects.  If I stare at a wall long enough and I am in the right frame of mind, the wall begins to move and crawl.  Looking down at the linoleum tile in my bathroom I watched the pattern march from top left to bottom right in flowing fashion.  almost any pattern or even a textured surface can move and 'flow'.  In short, its a usefull drug but BE FUCKING CAREFULL!</p>"
 ],
 "year": "2004",
 "id": "37529",
 "gender": "Male",
 "views": "7018",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2007-11-06T08:00:00.000Z"
}
