{
 "id": 3752,
 "title": "Not Worth the Trouble",
 "date": {
  "submission": "2006-08-07T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Marko",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Risperidone",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Pharms - Divalproex",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I was previously diagnosed with a serious mood disorder and medicated accordingly.  These medications were not right at all.  One depressed night I decided I would try to end my life again.  So I looked at the bottles of pills on my dresser and grabbed a huge glass of water.  I swallowed 25 Risperdol pills along with 20 Paxils and 20 Depakote pills.  I proceeded to lay down and try to go to sleep one last time.  I fell asleep and was woken up the next morning by my mom.  Obviously, there wasn't any success.  But I felt very groggy.",
  "I went up to take a shower and when I got out and went back down to my room I saw my mom packing up clothes and she said there was an ambulance on the way.  I got strapped down to the bed in the ambulance and taken to the emergency room.  They pumped my stomach which was useless since everything was already digested.  I became incontinent on the bed and was fading in and out of consciousness.",
  "They gave me a stomach full of charcoal and sent me to the psyche ward at(my new home at that time of my life).  I slept for nearly a week only waKing up once or twice a day for meals.  Day by day I was feeling a little less sedated.  I ended up being there for 9 days.  They released me with no prescriptions, their reasoning being my system needed to clear out."
 ],
 "erowid": {
  "id": "22034",
  "citation": " Marko. \"Not Worth the Trouble: experience with Divalproex, Paroxetine & Risperidone (ID 22034)\". Erowid.org. Aug 7, 2006. erowid.org/exp/22034",
  "substance": "Divalproex, Paroxetine & Risperidone",
  "views": "12615"
 }
}
