{
 "title": "The 'I' is for Insane",
 "author": "GottaHugeWeenis",
 "citation": " GottaHugeWeenis. \"The 'I' is for Insane: experience with 2C-I (ID 37532)\". Erowid.org. Jan 12, 2009. erowid.org/exp/37532",
 "substance": "2C-I",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-I",
   "",
   "20 mg",
   "insufflated",
   "2C-I",
   "",
   "20 mg",
   "oral",
   "2C-I"
  ]
 ],
 "footer": [
  [
   "2004",
   "37532",
   "Male",
   "",
   "Not Given",
   "Jan 12, 2009",
   "3360",
   " "
  ]
 ],
 "report": "<p>A friend of mine and I ordered 3g of 2c-I online, and couldn't wait to get it in the mail.  We ended up getting it last thursday, so i went and picked it up from the University mail room.  My friend C dropped me off on campus, so i could go take a test, then went to measure the 2c-I out on his friends scale.  I failed the hell outa my test and went back to the dorm and waited for friends to start arriving.  Me, my roomates P & B, my gf J, and other friends L, R, and C were gonna trip tonight.  C got back with the measured out gelcaps, and i took a 25mg one with C, while everyone else took 20s.  I had put off eating most of the day so that it would kick in faster, and boy was it worth it.</p><p>In about an hour, my vision had changed.  All the colors i saw were much brighter, much like my experiences with shrooms.  Everything had also become hilarious, much like shrooms, and much more intense than pot.  The permagrin was on everyone's face, and everyone was loving it.  We had the room dark, except for one lamp with holes in the top.  The holes projected a grid pattern of light on the ceiling, which at this point i noticed was starting to wave.  This type of hallucination was new to me, and although i am more experienced with DXM than anyone i know (it takes 1.3 grams to get an ok trip these days) the visuals were amazing.  With DXM, my vision is so fucked up as a whole, that the visuals just seem like part of it.  With 2c-I, I can still function fine, but if I focus on things, patterns and rippling emerge hard-core.  This was amazing.  </p><p>The grid pattern of light on the ceiling would wave in and out, shake, go blurry in and out, and move around in general.  The ceiling appeared to have sectional scales, some would break off in unison, spaced apart, and move around with a group attached to it.  Other times, the pattern on the ceiling would swirl in and out of itself, like a kaliedascope.  Inbetween laugter, i would notice everyone would be staring at either the floor or the ceiling, which told me we were in similar states.</p><p>We went down to the local chicken place, Wing Nuts, to pick up some food.  The colors of the food were rediculous.  My friend R's chicken wrap looked fake.  The lettuce was so neon green he was afraid to eat it.  The floor had a neat pattern on it, and when i would stare, textures would pop up from the floor, resembling a mini-gold course with bumps and turns.  I also noticed coke cans breathing on the table, as well as the sauce for my chicken morphing around on the plate.  Its a good thing not many people were there, as we were constantly laughing and probably appeared very fucked up.  The food was beyond orgasmic.  I thought that munchies tasted good after smoking, but it was nothing compared to this.  Every bite i took was like sex, probably half because i was so hungry, and partly from the drug's effect on me.  After eating, we went outside and sat on some stairs next to a busy street.  Watching the trees and traffic was amazing, as well as seeing the interesting characters who were out.  I also had a vivid hallucination of a cop car's lights curling up on the outsides and growling at me.  It was funny as hell to watch, but i didnt want to bring attention to myself.</p><p>We went back upstairs to find B, P, and L laughing very loudly in the dorm, and just goofing around in general.  They were playing some techno in P's room while playing with glow sticks and black lights, which both looked very cool.  Anyway, C and J were talking about redosing with Me and R.. even tho we were all still pretty fucked up.  C and J took 10mg gelcaps while me and R measured out more by hand.  We got doses down to about 15 or 20mg, and decided to snort them in order to get them to kick in faster.  I had never really snorted before, but the fast kick-in sounded nice.  So i did it.  The next 10 minutes were horrible... but after the pain, and feeling that the inside of my head was melting away and i was swallowing it, i was ok.  Before the pain was even over, i was seeing a whole lotta shit.  The ceiling and walls were patterning and rippling all over the place.  A blacklight poster i have looked to be spinning in and out.  At this point, we decided to go out infront of the dorm building and play some hacky sack.</p><p>Me, C, P, B, J, L, and some others all came out.  It was raining, and the wet pavement looked amazing.  The light and dark spots on the ground appeared to swirl around eachother, almost like thye ground we were on was a foot underwater.  Upon studying some wet footprints, they would dry up, swirl around eachother, and form back again in a matter of seconds.  This is when i realized how amazingly fucked up i was.  I could see the other hacky players feet looked normal, with the ground swirling around like crazy behind them.  It was a nice change from DXM to be this wasted and still be able to function if i needed to.  We played for a couple hours, then headed back in due to it being pretty cold.</p><p>Once back inside, we went into P's room to continue the rave setting they had going on before.  Winamp visualizations, glow sticks, and blacklights 'a plenty.  Staring at peoples' faces was interesting.  Every once in a while, i would see a bubble under someone's skin move around on their face, or other things distort in plain view, such as eyes changing shape or size.  My friend B wasnt getting hit hard yet, so he snorted a good 15mg.  He was immediately wasted.  We would turn the lights off, and immediately start making our own techno noises and music with our mouths, and would stop the instant he turned them back on.  We did this probably 20 times, and he was getting freaked out so we stopped.</p><p>At this point, i noticed the X-like body high i had heard about.  I was still seeing the rippling on the ceiling, but the body high was in full buzz now.  I felt completely happy and content just sitting there with J between my legs holding her.  It felt so amazing to feel the warmth of her skin against mine, and for some reason, i kept having the urge to mouth her.  Not bite her or anything, but just feel her skin against my open mouth and tongue.  It felt so good.  J decided to go to bed at this point, as it was almost 4am.  So me, C, R, and P went outside for more hacky sack.  R wanted to dose again, and go to his friday classes tripping, so at 5:20 or so we took another 20mg orally.  This time it didnt hit me hard at all, but apperently it did for him.  We stayed up and watched the sun come up over the city, which was amazing.  Seeing the cityscape of Atlanta at night tripping, as well as in the morning, is very cool.</p><p>Around 7am, R left to go to class, and i was feeling pretty exhausted, so i went to bed.  Laying next to J's warmth was amazing, although it took a long time to fall asleep.  All night, i hadn't noticed any Closed Eye stuff, only open.  But when i tried to go to sleep, it was like my brain was a Super Nintendo emulator.  I kept inventing games and playing them in my head without even trying, they would just be there when i closed my eyes, like a newer version of bomber man or DDR.  I finally fell asleep at around 10 or so, and slept till 5:30.  Woke up still tired, but thats something i'm used to from long nights of video games.</p><p>Overall, my first real experience with 2c-I was amazing.  I sorta missed the 'im so wasted i cant move' of dxm, but this was much more fun in a social environment.  Especially with the large group we had, it was more than a blast.  I will definately be doing this drug again, as i think the limits of it are more than i experienced.  I never felt overwhelmed by the drug, as some people had, which may be from my intense experiences with dxm and other things.  Even with a total of 65mg over the night, i never felt like it was too much... just extremely fun, funny, and so cool looking.  Another difference between this and DXM was that i didn't really feel any sort of religious or spiritual insight, as i had experienced often with dxm.  I didnt come out of it learning anything, but i did have an amazing night.</p>"
}
