{
 "title": "Bitter Brew with a High",
 "author": "User",
 "citation": " User. \"Bitter Brew with a High: experience with Alcohol - Beer (with Wormwood) & Cannabis (ID 37550)\". Erowid.org. Mar 7, 2007. erowid.org/exp/37550",
 "substance": "Alcohol - Beer (with Wormwood) & Cannabis",
 "bodyweight": "66 kg",
 "header": [
  "DOSE:",
  "2 joints/cigs",
  "smoked",
  "Cannabis",
  "",
  "660 ml",
  "oral",
  "Alcohol - Beer/Wine",
  "",
  " ",
  "",
  "Wormwood"
 ],
 "report": "<p>I'm male, 40 years old, 1.70 meter tall, regular MJ smoker for over 20 years, former heavy cigarettes smoker. In good health.</p><p>size of a bottle : 0.66 liter. alcohol content : around 5 % vol (estimated).</p><p>I grew hops in my garden. Every autumn, I'm brewing beer from the female flowers.</p><p>This year, I brewed a little amount of beer adding some fresh wormwood to the mix. I have reduced the amount of hops by half. I never weigh amounts. The volume of fresh wormwood was something like 1/2 of the hops, boiled for 1 hour. I tried drinking it last night for the first time, 5 weeks after having started the process. The beer was a bit more bitter than regular one, with a wormwood taste. I like bitter tastes very much, but it was the max I could drink with some pleasure. After having drunk 1/3 of the bottle, the wormwood taste seemed to be weaker. I drank the bottle in 3H approx.</p><p>I had smoked a MJ joint when starting to drink.</p><p>There was a specific effect which wasnt from alcohol, hops or pot. I was much more awake that I would have been with just the pot and a regular beer in the same time. I was more 'high' than 'stoned'. Visual perception was a little bit more 'tridimensional', things had more relief, just like in a very mild Salvia trip. All this was light but I'm sure it wasn't placebo.</p><p>The effect peaked when I had drunk 2/3 of the bottle, approx. 1 H 30 after the start. The high lasted for 1 H and wore off very quickly. 3 Hours after the start, I smoked MJ again. This time I was half asleep and very relaxed.  In the late evening, and today's morning, my intestines were a little bit irritated. It's the only side effect I had noticed. I got 5 more bottles of my wormwood beer... Next time, I'll try with a lower amount of wormwood in the brew.</p><p>The taste is interesting, but once should be light-handed when adding wormwood in order to get something drinkable. I plan to try the 'thujone extract experiment' and I'm wondering if the thujone which seems to be also present in Salvia officinalis could work too... I dont plan to distillate absinthe.</p>",
 "year": "2004",
 "id": "37550",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-07T08:00:00.000Z",
 "views": "11117",
 "dose": {}
}
