{
 "title": "Overdosed in School",
 "author": "Morgan",
 "citation": " Morgan. \"Overdosed in School: experience with DXM (ID 37593)\". Erowid.org. Jan 26, 2010. erowid.org/exp/37593",
 "substance": "DXM",
 "bodyweight": "115 lb",
 "report": "<p>I've done coriciden many times before and I only had one bad trip on 20 pills. It felt like I was seriously dieing and I thought I was too cool. I did it for about 2 months straight and started gettin really bored of it so I thought I would do a little suntin stronger.</p><p>I found this person who sells DXM and they get it straight from the Government so it was my second time doing it and I was in in school suspension with no work so I thought I might do it so I wouldn't be so bored and not have anything to do. So I put it down my throat and about 45 minutes later I started trippin and feelin really good like yeah can't get any better than this. So it was lunch time and I tried to eat but I could only get down 2 fries and threw my lunch away.</p><p>That's when I started feeling really pukey and I layed my head down on my desk and that's when I started puking all over the floor and all over my desk. The teacher had sent someone to come and get me to the nurses office and I can only remember a little bit about what happened. I remember teachers asking me what did you take Morgan? And what are you on and I only told them I was real sick and next thing I know I'm in the ambulance.</p><p>I remember laying in the ambulance and them asking me why I'm crying and are you in pain. I couldn't even talk I was so fucked up. They Had to strap me down because I was shaking so bad and I felt like I was dying or something cus it felt like I was going into these warp zones or different worlds. I remember getting lifted off the stretcher and onto a hospital bed when we had arrived there. I remember screaming Daddy I love you and daddy don't leave me I'm so sorry daddy and flipped out when he tried to leave the room. My stomache was almost pumped and the doctor said I had almost went into a coma.</p><p>I don't think I have ever been any scared in my hole Life. To this day I won't ever touch any drug cept for weed and I know that won't kill me. I'm too young to die. I'm only 16 and have my whole life in front of me.</p><p>The person I had got the DXm from must have laced it because when the doctor had come back with my piss tests he said I was tested positive for PCP. And I don't know how becasue I never tried it before. After about 6 hours in the hospital I finally started to come around and the doctor said I was alright to go home. And this is the story about how I over dosed in school.</p>",
 "year": "2004",
 "id": "37593",
 "gender": "Female",
 "timestamp": "2010-01-26T08:00:00.000Z",
 "views": "7912",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "DXM"
  }
 ]
}
