{
 "title": "Interesting Effects",
 "author": "Lissi",
 "citation": " Lissi. \"Interesting Effects: experience with 2C-I (ID 37601)\". Erowid.org. Sep 22, 2008. erowid.org/exp/37601",
 "substance": "2C-I",
 "bodyweight": "144 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-I"
  ]
 ],
 "report": "<p>I have tried 2c-i twice now. My first experience with phens was 2c-d and I loved how sharp I felt. I did not expect to trip as hard as I did off of 2c-i. I took about 10mg the first time before I went to the mall with my daughter and my friends to buy costumes. I felt very much in control and I enjoyed being with my daughter and my friends.</p><p>So the next day I went to a day long concert and took about 20 mgs. Once again I felt incredibly happy to be with people, my friends my family. I felt at ease around police officers, even though we got kicked off of the subway and I was barefoot because of giving my sister my shoes. Everything was wonderfully hilarious and oh so typical of my life. My paranoia wasn't that high considering how hard I was tripping. Morphing, feeling like someone is behind me, trails, these were pretty intense. I never really had these type of effects unless I took at least three hits of acid. Oh and I am a very experienced tripper that's why I am so amazed at these effects.</p><p>But what was weird was that I wanted every guy I saw. Not want to have sex with them, but want them to want me. This pertained to both experiences. It has been said that I am very sexy and attractive so I often get alot of stares. This time I would stare back, and stare guys down and they would have to drop down first. I felt very beautiful, sexy and lustful. I was also surprisingly hungry. Starving in fact I spent about $80 at Red Lobster. The best part was the lack of hangover or 'chemical-ly' after effects. After taking LSD I always feel like I got ran over by a train loaded with chemical supplies.</p><p>I like 2c-i, even though I didn't have any huge revelations, I have found that I am more comfortable with myself and I feel more joyful and understanding of others. I noticed myself thinking about how other people acted and kind of became an amatuer sociologist. It gave me new perspective on several people. I benefited from it and I will do it again. I can handle trippier stuff because of my schizophrenia. Contrary to popular belief, I find psychedelics beneficial to my disease, but cannabis makes me absolutely out of control. I hate Pot.</p><p>Thank you for your time.</p><p>Lissi</p>",
 "year": "2004",
 "id": "37601",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-09-22T07:00:00.000Z",
 "views": "2641"
}
