{
 "title": "Summary of 3 Salvia Experiences",
 "author": "Itsuoda",
 "citation": " Itsuoda. \"Summary of 3 Salvia Experiences: experience with Salvia divinorum (ID 3762)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3762",
 "substance": "Salvia divinorum",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Salvia divinorum"
  ]
 ],
 "report": "<p>I have tried salvia divinorum a number of times. Here is a summary of the first three times that it actually worked, in order:</p><p>1st time- in combo with 2c-t-7. Salvia leaf 2x extract. Broke through into what I can only call hyperspace on third inhalation. It was as if I was looking upon this dimension from outside it. I notices that my room (with my eyes closed) was all bent in places, and got the intuitive feel that I was witnessing warps in space/time. Lasted about 10 minutes</p><p>2nd time- in combo with cannabis. Salvia leaf 10x extract. Broke through into same hyperspacial reality while staying in a hotel room. Felt I made contact with the spirit of the town I was visiting (Amsterdam), the waterways, the old streets, etc... lasted about 15-20minutes</p><p>3rd time- no other substances in combo. Salvia leaf 10x extract. Same setting as 2nd time. Same as 2nd time in intensity, duration, slightly different content to the trip, but still the basic breaking through space/time, or slipping to another side of some diaphanous membrane that separates this reality from ??? . A bit scary at times. It helped to realized that it would be over within a few minutes, no matter how disturbing the rupture from normality was.</p><p>Looking back, I think that combining salvia with another drug is good for hard heads that can't achieve effects with salvia alone. I think that the first drug acts as an initial lubricant, preparing the way for salvia. However, this said, doing salvia on its own naturally gives a better feel for its nature.</p><p>I have come upon a technique that I use for this plant. I like to ask it a question. In other words, I will formulate a question and hold it in my mind steadfastly as I break through into the realm made available by the plant. I usually smoke 2 to 3 hits, and hold the last hit for quite a while, while I feel my world start to turn upside down, all the while focusing very hard on my question. Then I let go of my breath, and ride the trip to where it takes me.</p><p>Two last things. I highly recommend sitters, especially for first time users or those likely to panic and try to run away (literally). Second, I find that darkness and silence help, and can make the difference between a trip and a dud. This is definitively not a party drug, loud music and lots of ambient activity would probably detract from the experience.</p>",
 "year": "2000",
 "id": "3762",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-25T08:00:00.000Z",
 "views": "14034",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Salvia divinorum"
  }
 ]
}
