{
 "title": "The 'Sun Opened' On Me",
 "author": "demarksman",
 "citation": " demarksman. \"The 'Sun Opened' On Me: experience with Heimia salicifolia (ID 37638)\". Erowid.org. Oct 22, 2004. erowid.org/exp/37638",
 "substance": "Heimia salicifolia",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Heimia salicifolia",
   "(tea)"
  ]
 ],
 "report": "<p>I've tried sinicuichi several times before, but it was only the other night that I met the ally face to face. Like many, I've underestimated this ethnobotanical, and have never quite understood why it appears with the likes of mushrooms and morning glory seeds on Xochipili's statue. I now realize how blind I was.</p><p>The ounce of sinicuichi that had just arrived looked very green and pungent-smelling. I attempted something similiar to the traditional preparation that involves fermenting the leaves for 24 hours under the sun. About five grams of dried herb were placed with two cups cold water in an ovenproof dish. The dish was left for 3.5 hours in the oven at 'warm' (around 140 F) temperature. Finally, the liquid was microwaved on 'high' until it began boiling, after which it was strained through a fine wire mesh (to separate the leaves) and drunk.</p><p>My old sinicuichi from was yellowish-green and made a pleasant-tasting tea. This brew (from a different vendor) was a far cry from my previous batch. I was shocked. The tea was almost as bitter as calea and smelled even more disgusting! I mixed in a tablespoon of sugar and pinched my nose as I drank the vile fluid in a one or two draughts.</p><p>My patience was well rewarded. In half an hour I realized that this sinicuichi session would be very different from my previous ones. The first hint was provided by a peculiar altered perception of colors, as if empty space were darker than usual and objects were emitting some faint radiance. Then it happened: for the first time, the 'sun opened' on me! [Sinicuichi is often called the 'sun opener' although reports of yellow vision are rare.] Everything was bathed in a soft, wondrous sunshine. I went into a dark room, and put the headphones on with some favorite music. Eyes closed, I experienced a euphoria that can only be described as overwhelming--certainly as strong, if not stronger than anything I've felt with kratom or even the Plant of Joy. There was a definite bodily sensation of flowing into the music, almost like morphing into a musical note. Incredible! A truly entheogenic experience if there ever was one!</p><p>The major disadvantage of sinicuichi is its short duration. The intense euphoria lasted for only a few minutes. I was back to baseline, except for some residual relaxation, in about two hours.</p><p>Still, the experiment was most encouraging. It's possible to have a true sinicuichi experience with commercial leaf with just under four hours of preparation. The brief but extremely refreshing experience is worth all that work. One might be amazed at how powerful this often-ignored ally really is!</p>",
 "year": "2004",
 "id": "37638",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-10-22T07:00:00.000Z",
 "views": "47557"
}
