{
 "id": 3765,
 "title": "Daring to be Stupid",
 "date": {
  "submission": "2000-06-27T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Flotsam",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "DOB",
   "form": "powder / crystals"
  },
  {
   "time": "2:00",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "DOB",
   "form": "powder / crystals"
  },
  {
   "time": "19:10",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "powder / crystals"
  },
  {
   "time": "20:30",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "powder / crystals"
  },
  {
   "time": "22:15",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "It was going to be a long weekend and I wanted to wring every last drop out of it. Had worked hard all week; minimal sleep, but enough.",
  "Friday evening, 11pm, 3mg DOB. Felt the zing a little after midnight; at 1am decided to boost another 1mg. The 'all-weekender' was underway. I find DOB to be a Groovy space -- fully energized, but without tension; no visuals, but a 'friend love' vibe that goes great with friends and music. Cruised thru Friday night and Saturday morning with lots of coffee and lots of bouncing and lots of talking.",
  "Spent some contemplative time around sunrise while others slept. Drove out to the store and aquired massive breakfast supplies... returned and cut fruit for an hour and made a pile of chocolate chip and blueberry pancakes.",
  "Ran some errands midday... by the time we returned I was sagging. Popped an Adderall to avoid missing anything during a nap. This was probably a mistake (#1). Had I gotten 3 or 4 hours of sleep the rest of this story might have been a lot lighter and more energetic.",
  "Spent the afternoon kind of unsettled, unable to find anything to get into for more than 10 or 15 minutes at a time.",
  "Sunset (6:10pm) found me holding 20mg of 2ct7 and I was excited as I popped it. This was my first time to try it. I'd been around others on it and had read what I could, so I felt pretty prepared. I wasn't. It came only very gradually. At one hour, I could definitely feel its effects -- very heady. At approximately 7:30, I took another 10mg as a boost. I was feeling it pretty strongly when I boosted, but I thought that was about as far as it would go and it just wasn't compelling/intense/psychedelic enough for me. I'm don't think this step was a mistake, but some might wanna call it Mistake #1a.",
  "Things continued to build gradually over the next hour. None of the music being played was turning me on. In fact, I kept having the sensation that the music was dragging everyone down. We were all just sitting there with minimal interaction (in the room I was in... there *were* people interacting elsewere). I had the distinct sensation that I was dreaming. People and things were ethereal. My head was lost in space. My body was exhausted and it was seriously impacting my energy level.",
  "When the idea of adding 2cb to the mix was presented, I was probably too enthusiastic. Now, my logic seemed rational enough at the time, mind you, but looking back on it, this was probably the real turning point. My thinking was, 'hey, this'll boost my energy level, which I definitely need, and 2cb is the world's greatest potentiator and I wouldn't mind taking this ct7 a notch higher.' MISTAKE #2. I didn't hesitate as I tossed back 20mg 2cb orally at ~9:15pm.",
  "The ct7 continued to build. Hmmm...",
  "Just before 10pm I felt the first energy boosts from the 2cb. Shortly after 10, I was surging. We changed the music and Jetsam and I danced. I played DJ for awhile trying to keep the music varying and upbeat. By 11, it was getting difficult to keep track of music and what disc I was going to play next and I gave it up to wander.",
  "Some background at this point might be helpful. I had been in a kind of a funk for the last several months, pondering who I am and what that means. While I had some of my closest and dearest friends around me that night, things seemed tense (mostly a figment of my imagination) and I couldn't seem to get in and connect with anyone for more than just a few minutes (again, mostly my own doing).",
  "Over the next hour or so, my world pretty much crumbled. Several scenes of interactions between and with others were twisted by me into myriads of fantasized possibilities that terrified, disgusted, diminished, threatened, and crushed me. I felt horribly alone amongst a crowd of friends. I flashed on how little I knew of everyone around me, even my beloved. I was imprisoned in my own skull. I pled with Jetsam to stay close to me for awhile. I puked at the mere mention of candy corn.",
  "Sometime around 1am I started to settle into a space where all my senses were screwed up. Sometimes they would just not work right -- I couldn't feel what I was touching or make out what I was seeing. Other times, and this was the ultimate experience for me, it was a synethesia (?) -- I would touch something and my vision would be awash with a particular color; I would open my eyes and I could smell things, close them and I couldn't; I was hearing the things I was seeing, with voices and sounds from the music eminating from whatever objects I was gazing at. This sensation was fascinating and I played with it awhile.",
  "At some point I became aware that it wasn't voluntary.",
  "Now, I've zoomed hundreds of times on a wide variety of substances. I know extremely well about looping on a negative and the consequences of doing so. I know lots of techniques for breaking out of such loops.",
  "I forgot.",
  "The feeling that I may very well have permanently damaged my sensory perception in some way became overwhelming. I'd lost control of the way I perceive the world around me. I knew full well that I was on a drug and that I would come down. But I wasn't at all sure I'd be OK.",
  "I was unable to hold much of a conversation, but I continued to try to make the most out of the experience and the evening.",
  "Sometime after 2:30am I went horizontal. I slept, tho intermittantly I was awoken by various people and each time felt as though I hadn't really fallen asleep. At 6am, Jetsam and I retreated to the unoccupied back bedroom and spent every last drop of energy we had on each other in pretty dreamy sex. Sex was heady for me: physical contact was good but thinking and talking was what took me over the top. No serious erection problems as I've had on other substances. All in all, a fine way to close the night.",
  "Slept unmovingly for 6 hours. Awoke groggy. Spent the day in low gear and a kind of blah headspace. Much of my time was spent considering what I'd experienced the night before. In ways, my brain still felt broken. It took several days for that feeling to completely subside. I found myself adamantly stating toggly kinda things that I knew to be incorrect (like 'Mississippi *is* east of the Mississippi, damnit!'). Someone would point out my mistake and it would hit me how seriously I was wrong and how much I believed I was right. It was an intriguing little side effect that I am glad has gone away.",
  "In closing, I do not recommend the above combinations to anyone but the most intrepid, and even then, make sure you have good, close friends around, preferably at least one of which is substance-minimal. While I got a tremendous amount out of the experience, it was very humbling and *could* have been a potentially dangerous place had I not had friends around to keep it from becoming so."
 ],
 "erowid": {
  "id": "2207",
  "citation": " Flotsam. \"Daring to be Stupid: experience with DOB, 2C-T-7 & 2C-B (ID 2207)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2207",
  "substance": "DOB, 2C-T-7 & 2C-B",
  "views": "19909"
 }
}
