{
 "id": 3767,
 "title": "The Duration of MAOI Properties",
 "date": {
  "submission": "2007-10-14T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Greg'sCortex",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "AMT"
  },
  {
   "time": "48:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "AMT"
  },
  {
   "time": "96:00",
   "amount": "8 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  {
   "time": "96:00",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  }
 ],
 "report": [
  "This is a report of my experience with AMT and its ability to potentiate the effects of alcohol(and the resulting sickness), and how I use this data to form a crude timeline of the possible MAOI effects of AMT.  It would be a ridiculous notion to use one topical case study to make broad generalizations on anything, but I strongly suggest that people experimenting with the drug do pay attention to this warning.",
  "Last weekend I took AMT twice.  I took 25mgs on Friday night, and 30mgs on Sunday.  Both times I very much enjoyed my trips. The effects were a little different in each experience, but aside from the set and setting being different, I would also imagine that there would be a form of tolerance (at least to some of the effects).",
  "On the following Tuesday night, just two days later, I had a Band practice at my friends place across campus and I decided to drink a bit.  I am usually very resistant to the effects of alcohol.  Even my closest friends usually can't tell when I'm quite drunk, and getting to that point usually takes quite a bit of drinkin'.  For a gauge, I am usually a little buzzed after a flask of Jose Quervo and a twelve pack of beer rarely has more than a medium effect on my judgement, rational, motor skills, reaction time, or overall cognition.  Also, in the majority of cases, I wake up early feelng fine.",
  "But on this particular Tuesday night, I drank 8 beers and a shot of whiskey over the course of 5 hours, not so much by my standards, but I ended up quite sorry.  I was very, very ill.  I vomited alot (which I rarely do), and ended up trying to dismiss the spins as I attempted to pass out.  There was one factor of this that definately didn't sit right, I was capable of some deep and coherent intelligent thought, but it was so unpleasant to be awake that I'd sooner be hit in the head with a tire-iron. In this state, I was still able to do internet searches on MAOIs and on AMT.  Despite my level of ethenol intoxication, I was a bit scared. I awoke the next morning very early and very ill.  I vomited some more and over the course of the next day, I slowly emerged from my hangover and the accompanying viscious headache.",
  "It is very unusual for alcohol to affect me in this way, particularly at this dose.  The only causal variable that I can think of is the AMT.  I'm not sure exactly how long two closely placed dosages would have effect, but I do recall a passage of TIHKAL in which four days of anti-depressant effects were noted after a single administration.  Whether the Tyramine in the beer was reacting with lingering inhibition of monoamine breakdown in my brain is not completely certain.",
  "However, the next day (Thursday, the day I am writing this) I woke up feeling fine and proceeded to drink a protien shake and large cup of coffee along with my multi-vitamin, 5-HTP, and fish body oil (sounds rather gross I know, but Omega 3s are important).  This is my normal morning routine, but it was the first time this week that I had ingested it in observance of the AMT.  About an hour later, in my Biopsych class, I got excessively jittery and experienced a little generalized anxiety with very minor hand tremors.  This is rare for me and it's nothing that I couldn't deal with, But I feel that it might still stem from a contraindication.  This lasted about 4 hours.",
  "Now I can't say for sure whether either of these reactions were caused by the MAOi effects of the AMT, but I don't want to find out for sure via the hard way.  If they were indeed caused by this, I was lucky.  From what I've read, strokes, blood clots, and death are very realistic outcomes of conflicting reactions of this sort.  I am writing this so that maybe others might be careful on the days following a trip, when it might not be the first thing on one's mind.  I will still use AMT, it is a wonderful substance, but I am going to instill a week long pot/clonopin-only rule following my experiences."
 ],
 "erowid": {
  "id": "22082",
  "citation": " Greg'sCortex. \"The Duration of MAOI Properties: experience with AMT & Alcohol (ID 22082)\". Erowid.org. Oct 14, 2007. erowid.org/exp/22082",
  "substance": "AMT & Alcohol",
  "views": "9581"
 }
}
