{
 "id": 3768,
 "title": "Isn't Life Grand",
 "date": {
  "submission": "2003-04-23T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sunchaser",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "powder/crystals"
  },
  {
   "time": "1:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "powder/crystals"
  },
  {
   "time": "4:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "The setting was with a close friend at his country cottage. I wanted to try 2CT-7 for the first time and intended to take 35mg. However, thinkin this was a bit high for a first time we took 25mg each and set out on a walk while we waited to come up. Pretty much nothing had happened when we returned to base an hour later so we took the extra 10mg and very little happened besides feeling pleasantly langourous.",
  "So at the four hour point we each took 20mg 2C-T-2. 45 minutes later I felt a burst of energy as it kicked in. I kept getting highter throughout the next hour. Dancing was wonderful, superb connection with music and the CEVs were detailed and brilliantly coloured. At times I was gasping in rapture - this stuff is great! Connection with my feelings was good and I felt that issues were being cleared by expressing my emotions and some of the inner visions. We were both back to base-line between 4-5 hours and I particularly like short acting psychedelics.",
  "Neither of us had any physical disturbances. The CEVs were up there with LSD, the good body vibe with 2CB. However, whilst feeling close to my friend, the body energy distracted from the introspection in a way that it didn't with 2-CI. It could be that 20mg of 2C-T-2 is a bigger dose than 15mg of 2CI which is the dose that I am familiar with.",
  "To conclude, I think 2C-T-2 is amazing and next time I am going to try 25mg on its own. 2C-T-7 is history and next time I try 2-CI it will be at the 22.5mg level."
 ],
 "erowid": {
  "id": "22084",
  "citation": " Sunchaser. \"Isn't Life Grand: experience with 2C-T-7 & 2C-T-2 (ID 22084)\". Erowid.org. Apr 23, 2003. erowid.org/exp/22084",
  "substance": "2C-T-7 & 2C-T-2",
  "views": "12115"
 }
}
