{
 "title": "Time to Bond",
 "author": "Vicodin",
 "citation": " Vicodin. \"Time to Bond: experience with Hydrocodone with Acetaminophen & Alcohol (ID 37699)\". Erowid.org. Nov 7, 2007. erowid.org/exp/37699",
 "substance": "Hydrocodone with Acetaminophen & Alcohol",
 "bodyweight": "185 lb",
 "header": [
  "DOSE: T+ 0:00",
  "5.0 mg",
  "oral",
  "Hydrocodone",
  "(pill / tablet)",
  " T+ 0:00",
  " repeated",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  " T+ 0:10",
  "10 mg",
  "oral",
  "Hydrocodone",
  "(pill / tablet)",
  " T+ 0:20",
  "10 mg",
  "oral",
  "Hydrocodone",
  "(pill / tablet)",
  " T+ 0:55",
  "15 mg",
  "oral",
  "Hydrocodone",
  "(pill / tablet)"
 ],
 "report": "<p>[Erowid Note: this person took 3.5 grams of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]</p><p>Well about a month ago a friend and I came across 20 - 5/500mg Watson(Generic Vicodin) tabs. We planned on selling them but that night we got bored.</p><p>9:30 - Get off work and head over to C's house. His parents are gone for the weekend. His uncle J is there.</p><p>9:35 - 5mg down. Wash it down with some Vodka.</p><p>9:45 - Read online that 5mg won't do a thing. Take 10mg more. Start to feel a bit 'floaty'.</p><p>9:55 - Happy as shit and we take 10mg more. I feel like superman and a warm blanket wrapped together.</p><p>10:05 - Still happy and very talkative. We pop in a movie and keep talking.</p><p>10:30 - Keeps going up and finish it off with 15mg more.</p><p>10:30~1:30 - This is where I lose track of time. Basically I'm happy and floaty as shit. Us 3 just sit on the couch and talk for 3 hours straight about everything. I can't remember the specific topics but we talk like crazy and it's sooo fun.</p><p>Sleep - Almost the best part is the sleep. Its the best night of sleep in my life.</p><p>Summary: This is, to date, the funnest trip I have ever had. Just talked about life for 3 hours and it was awesome. I felt great all night. The others felt 'itchy' about an hour into it and said they felt it all night. I take Allegra(anti-histamine) so no worries. And right at the end of the trip both of them threw up, probobly cuz of the Vodka but I'm not sure. The only downside is that I can tell this drug is very addictive.</p>",
 "year": "2004",
 "id": "37699",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-07T08:00:00.000Z",
 "views": "16907",
 "dose": {}
}
