{
 "id": 3773,
 "title": "Physical and Introspective",
 "date": {
  "submission": "2000-06-27T07:00:00.000Z"
 },
 "author": {
  "name": "Splash",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "capsule"
  }
 ],
 "report": [
  "I found myself in possession of 100 mg of 4-acetoxy-DiPT. Apparently, not many trials have been conducted with it and I was to be on the leading edge. The substance is reportedly metabolised into 4-hydroxy-diisopropyltryptamine in the same or similar manner that psilocybin is metabolized to psilocin. (more info about this has been since discovered, commented later) The reports in TIHKAL of the latter substance is quite positive indeed. I had to believe that 4-acetoxy-DiPT then is very similar, maybe a tad longer in duration. I settled on 20mg for my first trial.",
  "The substance itself was a greyish, clumpy powder with a distinct acetone/acetic acid smell. Think vinegar or fingernail polish remover and you wouldn't be too far off. I placed the powder onto a clean mirror and chopped it up to a fine powder with a clean sharp razor. I then carefully weighed out 20mg and placed it in a gelcap that once contained powdered ginseng. In fact, I left most of the ginseng in the capsule. At 8:30 pm on a Saturday evening and with a relatively empty stomach, I had eaten lunch but skipped supper for this purpose, I swallowed my capsule and washed it down with a bit of cola. I settled back with a computer game and waited for the first alerts.",
  "The first alerts came in about 50 minutes and felt remarkably similar to the onset of LSD. I typically get a uneasy feeling under my skin and deep in my bones during the onset of even the smoothest of LSD, and this 4-acetoxy-DiPT was no different. Other tryptamines do not typically come on in the same manner, they tend to come on with a sedation, complete with the yawns. Sweaty palms were also noticed, something else very typical of the LSD onset, in fact typical of the complete LSD experience for me. This is another feature that is lacking for me in other tryptamines except higher dose DMT and 5MeO-DMT.",
  "But that is where the uneasy feeling ends in the case of 4-acetoxy-DiPT. Within 10 minutes of that first alert, a very smooth and floating intoxication developed. This is a very physical substance, not in any negative manner, but the substance is definately *felt* in the body. In this manner it reminded me very much of 5-MeO-DiPT. A sensual, flying, floating sensation and a definate sense of physical well-being is dominant. Then came some changes to the visual feild. Not overwhelming in any sense, but some sparkly patterning akin to DPT. Luminous yet transparent geometries, not organic and round like mushroom visuals, but sharp edges and lines, feilds of small silver transulent pyramids and such. The mental process was not affected very much, another aspect that reminds me of 5-MeO-DiPT. Thinking remained clear and intact. The intoxication developed over 30 minutes or so and by 1.5 hours after ingestion, I believe the peak was reached. This peak lasted for about 1.5 more hours and then faded over about a 30 minute period to just an excellent afterglow, typical of tryptamines. Very nice substance.",
  "After the first trial with 20mg, I decided that my wife would appreciate this substance so I asked her if she felt like tasting a new one. She smiled with that gleam in her eyes that told me she was game. For this one, I felt maybe 30mg each would be the proper thing to do. I wanted to make sure it wasn't going to be too much for her or I so I decided to prepare each a capsule of 20mg and a booster of 10mg if we so decide. This time I had a light supper, and around 2 hours later, at 8pm, we took our initial 20mg each. The supper may have been a mistake, because the first alerts did not come until about 65 minutes. This time, the intoxication was not developing very rapidly and at 75 minutes, I was feeling like not much would happen. Time for the boosters. Well, remarkably, immediately after swallowing the booster and sitting down, the initial 20mg reared it's head and the smooth floaty feelings of 4-acetoxy-DiPT came washing in. Not much of the antsy onset like the original trial was there, although it was there to a certain degree. The intoxication kept building for about an hour, probably due to the spaced dosage and some food in the stomach. This time was very similar to the first, albeit more pronounced visuals of the same nature. Also, the duration was extended for about an hour, giving about 3-3.5 hours of total intoxication time. Since I was with the wife this time, there was a lot of energy building up that led to a wonderfully erotic and explosive sex session. Both of us thorougly enjoyed that part. There was some differences from the first trial on the comedown of this substance. When the intoxication was wearing off, I found myself in a very introspective mood. In fact, sleep did not come so easy this night. The intoxication was pretty much gone in the midnight hour, but my thoughts were racing and even though I thought I might sleep, this lasted only 5 minutes. Laying there in the dark was just not working. I got up and started thinking about a lot of things, mostly the Big Picture of where we are heading as a race and myself as an individual. After I had worked many concepts through in my mind, I realized I was still wide awake, my pupils still showed quite a bit of dialation, so I jumped online and passed about an hour away chatting in a familiar room with other like-minded peoples. Sleep finally came a little after 3 am. All in all, the second trial showed that this is not just a mere plaything, which it seemed to be on the first trial, but had some serious potential as a true psychedelic, complete with insights."
 ],
 "erowid": {
  "id": "2210",
  "citation": " Splash. \"Physical and Introspective: experience with 4-Acetoxy-DiPT (ID 2210)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2210",
  "substance": "4-Acetoxy-DiPT",
  "views": "22943"
 }
}
