{
 "id": 3774,
 "title": "The Republic of Ninja Assassins",
 "date": {
  "submission": "2007-10-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "BlackNinja",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I will begin by saying I am relatively new to the drug scene.  I remember a time when I used to disagree with drug-use; in truth I was thoroughly oblivious to its (rampant) presence in my highschool until somewhere around September of last year.  Some friends of mine introduced me to cannabis last November, and since I have been a regular (though moderate) user, smoking roughly once a week. My father knows and doesn't care; regardless, I still feel that openly displaying my use of the substance around him is largely awkward, and so usually prefer to smoke only at times when my night is open, I can crash at somebody else's house, and am worriless.",
  "Moderation is everything. I will never stop maintaining this belief when it comes to drugs. I will never in my life go anywhere beyond weed and shrooms. This is not because I've experienced some sort of bad trip; this is because I'd particularly like to avoid experiencing some sort of bad trip. I am not denouncing more severe drugs; I am merely proclaiming my caution. I have a terrible fear of illness, especially vomiting.  After hearing a great deal about mushrooms and researching their effects and so forth, I decided they were practically as harmless as weed, and that I, having a love for visualizations as I do, would give them a shot.",
  "Mushrooms are not particularly difficult to obtain in my area. Two of my friends know a dealer who is reliable and inexpensive.  My first dose of mushrooms would be in liquid form.  My friend, who I will herein call CP, told me that my price was $25. This was not a difficult demand to satisfy. I paid quickly and in full.  I was told that what I just bought was half a bottle of cranberry juice with spores and mushroom chunks mixed into it. Thinking this would probably taste better than plain mushrooms (despite my dislike for cranberries in general) I accepted the deal with indifference. My friends and I made plans for a specific night to gather at CP's house and drink our potion. My other two friends, MV and MF, were also trying the mushrooms. It was MF's first time as well. MV was already a veteran. CP would be our babysitter for the night, remaining sober.",
  "The drink was horrid. The juice itself was not bad; it tasted simply like a bitter cranberry juice. It was the chunks that disturbed the hell out of me. They looked like rotting flesh and had the texture of dried cottage cheese. They didn't taste horrible, but the concept of putting those things in my mouth was not pleasant. I choked down what of my glass I could manage and, after a while, decided that I could not stand to eat what little chunks were left and gave them to MV.",
  "We sat in CP's basement for about twenty minutes. His parents got home at that time, but his mother shrooms and smokes herself, so it wasn't something we were worried about. MF and myself were not feeling much. MV said he started to feel something, but it could have been a placebo. We decided to go for a terribly chilly walk. When we started walking around outside in the snow, I began to feel goofy and buzzed, but otherwise mostly sober. The walk was cold and uneventful; MV took off running at one point, later claiming that he was 'trying to race his shadow.'",
  "We got back to CP's house. Roughly fourty minutes had passed, and MF and myself still didn't feel much. We decided to drive around (CP, the sober one, being the driver, of course) for a couple hours and smoke, telling CP's mom that we were going to see a movie. MV packed his pipe and we shared a bowl. I don't even remember what happened in between when we first started smoking and when the mushrooms hit me, so I am forced to assume that that period of time was regularly silly and uneventful.",
  "The mushrooms hit me when we were stopped at a red light. I had not previously realized that we were at a red light; it dawned on me in one instant, and I was suddenly overwhelmed by how colorful everything had become. It made me very happy. We kept driving, and smoking, and driving, and smoking some more. I don't even remember how much we smoked, but it was more than I had ever done before, for I am a terrible lightweight when it comes to weed.",
  "Prior to ingestion I had told CP that I didn't want to be screaming or anything in front of his parents. He told me that I wouldn't, that it was practically impossible to freak out like that on shrooms. This information, of course, was entirely dependent on his experiences; CP NEVER freaks out. He just sits there, no matter what he's on or how much he's done. It's all mental for him. I, on the other hand, freak out.",
  "I remember screaming a lot in the car, and admiring how animated everything had become. Everything was so colorful and animated. All my friends radiated an ominous glow; they were all cartoons. I was in the middle, sharing the back seats with two other people; reflecting on it now I realize that even though it must have been thoroughly cramped, I felt no such restrictions at the time. I looked over at MV, who was sitting to my right, his head was gigantic and curving inward, toward me, and his legs were extremely small and distorted, as though I were looking down at him through a fish-eye lense.",
  "Sound became a solid, visual entity. We were playing music that sounded incredible, and I couldn't help but flail my arms in what must have been a horrible attempt at air-drumming. I tried to say something, but whatever it was came out of my mouth VISUALLY instead of as audio. I giggled at it and kept air-drumming.",
  "Suddenly it occured to me that we weren't driving FORWARD, but UPWARD, and everything outside the car was actually a flat, vertical plane fixed somewhere in front of use. I invented many theories about reality, as is common; I recall yelling something about how 'reality is slanted' at some point, though I don't seem to recall exactly what that was about. At one point I felt as though reality was in planes, with one person being in one plane, another in a second, the car in a third, and so forth.",
  "When we were smoking, the lighter looked thoroughly incredible; each time I lit it, I saw the produced flame in multiple places at the same time. I realized, then, that reality was built in frames of time, and that, somehow, I was seeing more than one of these 'frames' at once. At one point, after much frustration from my friends, who were waiting impatiently for their hits, as I was delaying the passing a bit, when I activated the lighter the warmth of the flame seemed to engulf my face, lighting my head aflame. This was not at all frightening. I giggled at my imagined flaming head.",
  "Eventually I felt as though I wasn't actually a person, just a severed entity of consciousness. I could look around at other people, myself, everything inside and outside the car, but I wasn't actually there - I was in a second reality, as a seperate consciousness, observing everything outside of my existence. I've read reports before which have described very similar sensations. It was a strangely pleasurable experience.",
  "We decided to go to get sub sandwiches. This is not a decision I would have made on my own, but CP, who was still thoroughly sober, seemed unconflicted, so I just went along with it. We entered the restaurant, which was fortunately vacant, and lo and behold - our friend Dan was working there. Which was probably a good thing considering the state we were in. I was very hungry at this point, but could not even begin to comprehend the menu, and so sat down quietly in the back. MV slurred out some order, which Dan laughed at and prepared. MF ordered a sub, saying 'I'd like some ninja with that please.'",
  "The resturant was a very colorful place. We sat immediately beneath a neon sign, which lit my friend aglow. Our feasting was relatively uneventful, save a fish-like face that CP made that freaked us all out. I recall staring at CP for some time, who stared back at me entirely motionless before swiftly throwing a straw at my face. The throw seemed inhuman and instant; for this reason I thought he had turned into a demon. I laughed at him.",
  "Our friend Dan came and told us a cop comes regularly around that time, so we left. I could feel everyone staring at us as we walked out. They all knew. We weren't exactly less than obvious. I don't even remember what happened on the drive all the way back to CP's house. Apparently two hours had indeed passed; I felt like it had been five minutes. We returned to his house, I stumbled inside, and we entered his basement, where there was a drum set and two guitars. MF is an extraordinarily excellent drummer, so he bolted for the drums. CP started playing the guitar, and MF started playing a really fast beat.",
  "I sat down in between the two, and, deciding to allow my mind to lace between the music, closed my eyes, covered my face with my hands, and began rocking my body back and forth to the song. This was the most incredible, mind-blowing, and happiest moment of my life. The guitar seemed to mix perfectly with the drumming, more perfectly than is possible, and thousands of images - images which I cannot even begin to remember but can say were most certainly beautiful - flashed through my head at a pace too fast for me to keep up. I remember a couple of these images vaguely, but one of them remains EXTREMELY vivid in my mind, and I drew it the next day.",
  "If I were to describe it in words, I would say that it was a flat horizon, save the ground was the sky and the sky was the ground. The sky (which was actually on the bottom) was a clear, saturated blue, and the ground (which was actually on top) was a lush green. Upside-down mountains sprouted from this upside-down ground, each cartoonish and identicle to each other in size and shape, each peaked with snow and each bearing its own identicle cloud at its tip.",
  "After the playing ended I proceded to scream at Matt for a while about the amazing experience I just had, and eventually we all went into a different part of the basement. MF has this particularly strong obsession with ninjas, so he began yelling something about how we were all members of RoN-A, the Republic of Ninja Assassins. We decided that MF was Gray Ninja, I was Black Ninja, MV was Critical Ninja, CP was Fish Ninja, and AD (who had arrived during the music-playing) was Russian Ninja.",
  "CP left with his brother and MV to smoke some apparently high-quality weed they had scored, leaving MF, AD and myself alone in their basement. We decided to make a ninja mask for MF, which was constructed from duct tape, and it looked pretty hilarious when it was completedm though I assure you he was in pain when he had to take it all off.",
  "MF realized he had to call his parents to tell them he was sleeping over, barely managed to do so, and then AD left. MF and I were starting to get pretty tired at that point, so we just sat there until CP got back. We did invent a song though, which included a single line of lyrics: 'Hiding in space with all the other ninjas and we dance and sing a song', and were singing it in unison as CP returned. He walked in, heard our song, looked at MF's ninja mask, and started laughing hysterically.",
  "Eventually we all went upstairs and passed out. I fell asleep in a reclining chair. It was, without a doubt, the most fun I've ever had in a single night, and I do indeed plan to get (and have already paid for) mushrooms again in the future. I found they were greatly more entertaining than weed, although regardless of this fact they're not something I'll be doing every week (or every other week, for that matter). I'd rather not build a tolerance to nature's most magical gift."
 ],
 "erowid": {
  "id": "22100",
  "citation": " BlackNinja. \"The Republic of Ninja Assassins: experience with Mushrooms & Cannabis (ID 22100)\". Erowid.org. Oct 2, 2007. erowid.org/exp/22100",
  "substance": "Mushrooms & Cannabis",
  "views": "2684"
 }
}
