{
 "title": "God Had Mercy",
 "author": "Scrandol",
 "citation": " Scrandol. \"God Had Mercy: experience with Mushrooms - P. cyanescens & Hash (ID 37756)\". Erowid.org. Oct 27, 2004. erowid.org/exp/37756",
 "substance": "Mushrooms - P. cyanescens & Hash",
 "bodyweight": "140 lb",
 "report": "<p>There was a bag of shrooms, It had been 2 and a half years since my death trip on P. stunzi, I never imagined I'd be visiting that terrible place this morning when I called up my buddy to pay him the 10 dollars I owed him for a fronted dime a few weeks earlier.</p><p>+0:00 - I had the mushrooms in my hand before I asked if it was ok, and had them in my mouth before I realized I had them in my hand, and then there was this echo of 'I can't believe I just did that' between me and we'll call him E. Mr. E proceeded to load hash and we got stoned over social politics.</p><p>+0:15 - It's that feeling again, of my head filling with warm water and my sinuses and throat secreting a radioactive toned mucous. Its time for my friend to leave because im about to freak out, I only ate a few and I did not intend to trip, merely chill out and enjoy some boards of canada. I seem to get off on less psilocybin each time I dose.</p><p>+0:30 - Im receiving +2 on the visual scale, I'm disoriented and my short term memory is shot, I badly needed some fresh air and to walk off nervous energy before it became irresponsible to leave the security of my house. I ask E. to leave and let him know that I'm out of my mind and need to ground myself by taking a walk, I hear the faint wish you wells as my ability to comprehend them goes to shit as well. I head out the door.</p><p>+0:45 - I've finaly gatherd my shoes and sweater and gathered my nerve to take a brisk walk in hopes of walking out some of the overkill, I almost immediately stumble into seemingly fresh dropped Lucky Strike brand cigarette laying on the ground, I am a serious addict to nicotine and I had not had a cigerete this morning, I was confused at the strange luck, so much that on my way home I was considering that it could be poisoned and I thought who would do such a thing, and I thought, I might. Got home, and smoked half of it.</p><p>+1:15 Im completely freaking out now, I seriously did not ever intend to trip like this again, the visuals are overwhelming, DNA patterns, Triangle patterns, the tracers completely washed out by the scramble of twisting seething reverbateing phi rubix cubed and anagrammed to the infinite power, in the shower, hiding, trying to pull my attention away from my head and into the skin.  My molars felt very awkward, I'm now freaking out that there's something wrong with my teeth. I find myself in a tangled confussion of floss, but I'm too scared to try and use it on my teeth because they might crack or break or come loose, that's how it feels.</p><p>+2:00 Out of the shower, clean as a whistle, the peak has plateaued and as I reenter my bedroom there is reggae music, I'M CLEAN! I'm so disco, but this only lasts as long as it takes me to get dressed and throw away my old favorite sweater that I still owed someone 5 bucks for, out with the old! I recognize that the feeling that made my mouth close unevenly must of been chewed mushroom bits, problem solved. Terror not solved.</p><p>+2:25 smoke the last bit of the lucky and give it a go to lay down and guage how high I am by testing my CEV's which I hid from previously, there was mainly triangle patterns, with holes of white light trying to burn through, I'd see the dots of white, and have a very great fantastical feeling about them, then they would grow and frankly they scare the crap out of me, so the eyes stay open, and I begin shrooming my house clean.</p><p>+3:00 Ive started and half finished 20 or so different projects, cleaning, laundry, dishes, cat feeding, reorganizeing, throwing away trash, general house cleaning, at warp speed, as the only logical method for shedding my terror, and turning the trip into something good.</p><p>My conclusion is that unwarrented high dose/intensity trips are counterproductive and can induce natural aversion to ego-loss and the benifits that go with it, be safe, trip smooth and know when to move up.</p>",
 "year": "2004",
 "id": "37756",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-10-27T07:00:00.000Z",
 "views": "6851",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": ""
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
