{
 "title": "Carnival Ride Lost in Time",
 "author": "Salvia Aquaintance",
 "citation": " Salvia Aquaintance. \"Carnival Ride Lost in Time: experience with Salvia divinorum (10x extract) (ID 37769)\". Erowid.org. May 7, 2007. erowid.org/exp/37769",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "138 lb",
 "report": "<p>The setting was my friend's, John's, apartment. The time was about 5:00am. All of us, that is, John, JL, Dave, and I were all on a mild comedown from an all night MDMA hang out and I had brought over the salvia when I had come over yesterday. We had yet to open the bag, but Dave stood up and exclaimed, 'Let's try that salvia!'</p><p>I had my first visit with the Green Lady a week before, having full hallucinations at JL's house. JL was the sitter for me, and I sat for him just after my trip ended. I could barely recall what I had seen, much less explain it, but my nerves were ultra-sensitive and I was unable to get comfortable after I came back into reality. JL's first time had scared him out of doing it anymore, as it seemed 'too powerful'. My first time had scared me a bit too, but it hadn't turned me away.</p><p>Anyway, JL and I had explained what salvia did to us the first time to Dave and John, and Dave seemed excited to try it out. John, on the other hand, decided to wait out and get Dave's opinion. I took a small pinch from the bag of 10x extract I had ordered and put it into JL's small metal pipe. Then I explained to Dave that he should try to take in and hold as much, for as long as he can. He coughed just a bit at the first harsh taste of it but held it in for a good 25 to 30 seconds. The last thing he said when he exhaled was, 'It's not hitting me.'</p><p>I shrugged and said 'On erowid some people say that their first hit does nothing either.' As I was tapping the ash in the trashcan, I looked back to Dave, who had a distant look on his wide opened eyes. I couldn't help but smile, and glanced at JL as we both said at the same time, 'He's feeling it.' John's head poked up from the couch to see what was going on, and what his trip might be like.</p><p>Dave stood up off the chair he was on, standing in the middle of the living room. We all watched him put his hand to his chin, looking around with an odd expression, just barely hearing him mumble, 'what the fuck is this?' At this time I decided to visit the Green Lady once again, so I pinched some more salvia into the pipe. We continued to watch Dave shuffle around in a small circle, mumbling inaudibly for about 10 minutes until he came back into reality. 'I can't believe you let me smoke that stuff!' Dave was staring at me and I burst into laughing. 'I'd keep that stuff around just to get people to smoke it for a practical joke,' Dave continued, glancing down at the bowl I had made for myself, 'Why didn't you smoke it?'</p><p>'I was waiting for you, I didn't want you to freak out while I was in the middle of a trip.' I had explained earlier how we'd watch him for safety precautions. Dave began explaining what he saw: 'Dude, it was like the room was splitting, like and my mouth was splitting too, it felt like words were coming down like in the credits from a movie and scraping against my sides, and I could only see your(JL's) head poking from a void.' I kept a grin on my face listening to him recall his experience, as I readied the pipe. 'Okay, here I go.' I said as I lit the salvia and took it all in. This was probably around 5:30am.</p><p>As I held it in, I walked around the counter and tapped off the ash in the trashcan. I thought I could hold it in until I felt the rush crawl up my face like my first time, but the rush didn't come. I put the pipe down on the counter as I exhaled, noticing that there wasn't much smoke, and I got worried that maybe I didn't take enough smoke in. Looking around the room I suddenly felt like either a tunnel was pulling me in, or I was getting fatigue and my eyelids got heavy. I remind you at this time I was on an ecstacy come down, (2 MDMA pills, one at 8:00pm last night, the second at 12:00am).</p><p>I remember saying casually, just before I lost track of my friends 'Oh, It hit me.' Suddenly I began to see in cross sections, like everything was from an anatomy supply warehouse, I saw diagonal slides of the world around me, I could see inner workings of appliances, the walls, I even saw behind the door and the staircase and plants outside. All the slides had fit in place, rotating around me as if I was in a rolidex. One worry came to mind: Would reality stay this way? What if I couldn't get out and nothing went back to the way it should be. If all these sections continued to go around me, how would I adapt?</p><p>I turned around slowly, keeping my head low of the slides that wouldn't stop, only to see JL talking to me. I held a conversation with him for some time, but the conversation went no where. I couldn't make out the words audibly, but my mind seemed to know what we were talking about. JL was asking the same question over and over again, and I was answering it the same way. Was I stuck in time? I decided to get off this carousel, only to find it impossible to get off. I'll have to wait it out, I thought. I vaguely remembered my first trip, and it helped me calm any worries I may have had of being stuck in this new reality. After another minute or so, the reality I was familiar to came back into focus; I was out.</p><p>I looked at JL and asked, 'Did you say anything to me while I was trippin out?' JL shook his head, 'No, I was here just watching you the whole time.' I told him how I had conversed with him while I was tripping, but he said I only mumbled a little and he had said nothing. Dave seemed to be thinking about his trip the whole time, and finally said, 'I'm ready to try it again!' Laughing, I packed him another bowl, amazed that he wanted to try it again.</p><p>He took the hit much better now, setting the pipe down and didn't say a word until his trip started back up again. He was sitting on a stool near the kitchen counter, staring down. In the middle of his trip we clearly heard him say, 'what the hell, there are chairs coming out of me.' We all bursted into laughing, while he looked around. We all figured he would be just fine even if we left him alone, so I went over to John and asked him if he wanted to try it. I suppose he didn't like the way Dave looked while he was tripping, and decided not to try it. I can't blame him, even I was kinda creeped out when Dave was staring off into space with a shocked look on his face, hand on his chin, shuffling around while mumbling.</p><p>I decided against going in again and decided that was enough of the salvia for one visit.</p><p>Well that's about all I can say for now. Have a happy and safe tripping!</p>",
 "year": "2004",
 "id": "37769",
 "gender": "Male",
 "timestamp": "2007-05-07T07:00:00.000Z",
 "views": "2625",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
