{
 "id": 3777,
 "title": "Going for the Crash",
 "date": {
  "submission": "2006-06-03T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Darren",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Zopiclone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I'd been using stimulants for over a year before I decided I had a problem. Rather than seeking professional help however, I tried the self help method of taking different pills!",
  "It started out as taking a gravol or two to help me come down when I wanted to sleep, it eventually grew, however, into going out and finding prescriptions to put me to sleep instead!",
  "I went out and I got my first prescription to Zopiclone (or Imovane as it was labeled on the bottle). The little ovoid green pills have 7.5 milligrams of zopiclone each. At just over 15 dollars Canadian for a bottle of twenty, its pretty damned cheap too.",
  "Anyways, it was late one night, and I had some sort of engagement the next day (school, possibly work), and I decided that I'd had too much Dexedrine and I needed to sleep. I reached for the bottle. I took one at first. 30 minutes later, I felt very little effects, just a pleasant Drunkenness on top of my Amphetamine high. I then went ahead and took another one.",
  "I laid down in my bed with the lights off and tried to sleep, but to no avail. 30 minutes after taking the second one, I started to hallucinate. I thought to myself Oh, great, a flashback, just what I need when Im trying to sleep'. Those thoughts passed after about 45 minutes when I realized the two drugs where pushing against each other and really fucking with my head.",
  "I decided to get up and use the washroom, maybe have some tea or something. Walking was not overly difficult, but still pretty tricky.",
  "I reached the bathroom after what seemed like an eternity (actually only about 12 steps), and things began to seem like they had water coming out of them, not in a frightening way, it was actually rather pleasant. The flooring looked like it was on an old computer with 256 color resolution with major gamut problems, and on top of that, it appeared to be liquid as well.",
  "I finished in the bathroom and headed to the kitchen,two flights of stairs later I reached the kettle and turned it on.",
  "Things seemed to really start to go crazy at this point, everything looked like it had a steam like texture, almost melty, but not quite. After I finished my tea (licorice spice, my personal favorite), I headed up to my room, and more or less passed out.",
  "That was only the first time.",
  "Other times I had done this intentionally and it was much more enjoyable.",
  "One of the times there was a painting of a tree hanging in my ex-girlfriends grandmothers house, it looked as though it was turning away, running even, it was crying... I refused to believe that the painting wasnt actually a canvas mould of something, but it was a two dimensional image.",
  "Another time I was walking home...",
  "I thought Id seen an experimental fighter jet, the northern lights, AND a meteor shower, all in one go.",
  "I had a rather nasty experience with this combonation.",
  "After an entire night of being awake and watching colors change, things spin, and shadows move about, I began to think there was something in my mattress.",
  "At first I thought it was just bugs of some sort, no big deal, take the sheets off, mattress goes outside for a while.",
  "The hallucination escalated to mice, to some sort of small primate...",
  "Either way, it resulted in my cutting open my mattress, spraying a fire extinguisher in, using up an entire can of raid, and wasting paint thinner to kill non-existent things I had removed from the mattress."
 ],
 "erowid": {
  "id": "22109",
  "citation": " Darren. \"Going for the Crash: experience with Zopiclone (Imovane) & Amphetamines (Dexedrine) (ID 22109)\". Erowid.org. Jun 3, 2006. erowid.org/exp/22109",
  "substance": "Zopiclone (Imovane) & Amphetamines (Dexedrine)",
  "views": "17318"
 }
}
