{
 "title": "Music and Time",
 "author": "Adrian",
 "citation": " Adrian. \"Music and Time: experience with Nutmeg (ID 37789)\". Erowid.org. Mar 4, 2008. erowid.org/exp/37789",
 "substance": "Nutmeg",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "5.5 tsp",
   "oral",
   "Nutmeg",
   "(cookie / food)"
  ]
 ],
 "report": "<p>I've been looking for legal highs as I'm 17, still live with my parents, and don't want to fuck up my future by getting in trouble with the law. Before this, all I'd done was Dramamine (dimenhydrinate) and hydrocodone left over from a prescription after surgery.</p><p>I'd researched this so I knew to expect 4 to 6 hours to onset. A few days before, I'd ground up a few whole nutmegs and baked between 5 and 6 teaspoons into 3 cookies. I figured it wouldn't taste so bad this way. I was WRONG. A lot of cinnamon and sugar did help mask the taste, though. I ate all 3 around 5:30, then went to a Kaballah class that started at 8 and ended at 9. I came home, finished my homework, and went online. Around 10:30, my mouth started getting really dry, so I got a bottle of water but no amount of water helped. I wasn't thirsty, and it wasn't helping, so I stopped drinking after finishing half the bottle. I noticed no other effects, so I decided to go to sleep. I turned the lights out and was lying in bed when I had an impulse to turn the radio on. This is when I first noticed the nutmeg actually taking effect.</p><p>This stuff fucks with music and time. The song 'Miserable' by Lit was on and I've heard it many times, but this time it sounded different. It sounded 3-D, for lack of a better word. I could feel the vibrations of the song and when I closed my eyes, I saw and felt the tail of an alien, whipping around to the music and vibrating with it. It's like this tail was the personification of the song and I was seeing, feeling, and hearing it at the same time. I also noticed that the gaps between music, lyrics, and verses were much longer than they should've been. There were periods of silence in which what should've been less than a second felt and sounded like a minute. After the song finished, I turned off the radio and went to sleep.</p><p>The next morning when I woke up, I could hardly stand and walking was impossible. I had to hold on to the wall when I left the room to tell my mom I wasn't going to school. Before my dad left to take my brother, he came into my room to see what was going on. He asked me some questions and it was really hard to answer. The words weren't coming out right. It seemed like he'd say something, then I'd answer a few minutes later, then he'd reply a few minutes later. I asked him, 'Are we talking very slow?' He laughed and said, 'We weren't even talking.' Then he left, and I slept hard for 9 hours. I told my parents it was probably dehydration, which they believed.</p><p>It definitely wasn't worth it. If I had a lot of time and nothing better to do, I might do it again, just to further explore the effect it had on time and music, but it wasn't a very enjoyable trip and the only interesting part was the music. I probably didn't take enough of it and I definitely didn't drink enough.</p>",
 "year": "2004",
 "id": "37789",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-04T08:00:00.000Z",
 "views": "5601"
}
