{
 "title": "What Happened For The Last Three Days?",
 "author": "Benzoman",
 "citation": " Benzoman. \"What Happened For The Last Three Days?: experience with Lorazepam, Clonazepam, Alprazolam & Alcohol (ID 37784)\". Erowid.org. Jun 22, 2007. erowid.org/exp/37784",
 "substance": "Lorazepam, Clonazepam, Alprazolam & Alcohol",
 "bodyweight": "170 lb",
 "header": [
  "DOSE: T+ 0:00",
  " ",
  "smoked",
  "Cannabis",
  "",
  " T+ 0:00",
  "2.0 mg",
  "oral",
  "Pharms - Clonazepam",
  "(pill / tablet)",
  " T+ 0:00",
  "1.0 mg",
  "oral",
  "Pharms - Alprazolam",
  "(pill / tablet)",
  " T+ 0:40",
  "4.0 mg",
  "oral",
  "Pharms - Lorazepam",
  "(pill / tablet)",
  " T+ 2:00",
  "1 cup",
  "oral",
  "Alcohol",
  "(liquid)"
 ],
 "report": "<p>The night started and I had just picked up my presciptions for Klonopins, and Xanax a few hours before.  I hadn't taken any benzos in about a month and a half because of withdrawl symptoms I was getting (back spasms, vomiting, fever, etc...).  So I decided to take 'some' pills tonight...and so the night begins.</p><p>(8:00)  I get to my friends apartment, we roll up a blunt and I decided to take a Klonopin and a Xanax to relax.</p><p>(8:30)  I now remember why I like benzos so fucking much in the past...feeling of total relaxation.</p><p>(8:40)  My other friend arrives and gives me three 2 mg Ativans for a few Klonopins, I then take two (that was my mistake right there).</p><p>--------At this point it is what I am told happened-------------</p><p>(9:15)  At this point I have no idea what is going on...I repeatedly ask the same questions over and over, steal food from my friends kitchen, then tell them to fuck themselves because they have no good food, so I go to the mexican restaurant</p><p>(9:45)  I return with food, along with no memory of going to get the food...I then proceed to put the steak quesadia (sp?) in my pocket where I find it 3 days later.</p><p>(10:00)  I find some alcohol (or so I am told) and drink a cup of some kind of punch (which doesn't make sence to me because I hate vodka punches and that what was at my friends place). </p><p>(10:15)  I decided that I wanted to go back to my friends house about 20 minutes away, so my friend J (who also had taken pills) somehow lets me drive.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>(10:45)  We arrive at my other friends house, some people are there and they see that I am completely wasted, and start asking me what I took...I told them some gibberish about Ativan and trailed off. </p><p>(11:10)  Decent size blunt I'm told, but for some reason I threw up all over the place and started mumbling incoherently.  My friends started asking me questions and the only question I answered with real words was 'what time is it?' all I said was 'morning time'.....I don't get it either.</p><p>(11:15)  I pass the fuck out for and hour and a half until my friend J wants to go home.</p><p>(7:30 AM)  Next morning, my mom corners me and asks me what I did the night before, because I am just walking in circles around the house looking for everything.</p><p>I was like that for the next 2 days...I do not remember anything from those 3 days.  I've had many pill experiances, hell, I've been prescribed Klonopins, and Xanax for 1 1/2 years...but this was by far my worst.</p>",
 "year": "2004",
 "id": "37784",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-22T07:00:00.000Z",
 "views": "32388",
 "dose": {}
}
