{
 "title": "Is a Seizure Fun?",
 "author": "Fred",
 "citation": " Fred. \"Is a Seizure Fun?: experience with Diphenhydramine (ID 37819)\". Erowid.org. Mar 3, 2008. erowid.org/exp/37819",
 "substance": "Diphenhydramine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "900 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "37819",
   "Male",
   "",
   "Not Given",
   "Mar 3, 2008",
   "16675",
   " "
  ]
 ],
 "report": "<p>On august 3, 2004 my friend told me about a drug called dramanine. he said that if you took a whole bottle of them you would trip out, so i decided to check it out. i head over to my local grocery store and took a trip to the pill section. i found the drug and noticed that it cost 5 bucks. so i was like fuck that an i stole 2 bottels. i headed back to my grandma's house where i was staying for the summer and popped all of the pills within seconds of eachother. Washing it down with a little poweraid and then i waited. </p><p>About ohh say 45 minutes later i started to trip out. like hardcore, my couzin was with me, he hadnt taken any of the drug. he told me not to go around my grandma because i was so fucked up. about 5 minutes later he went inside and i continued what i was doing outside. i remember sitting there and talking because i thought one of my friends was next to me, i would just talk and then look over and notice that nothing was there. i kept getting mad at myself for talking to nothing but i kept forgetting that i was doing it. the trip lasted for about an hour and then it was done. i went over to my friends house and bragged about it and they seemed mildley interested. </p><p>Well here is where the shit started to happen. the next day august 4, 2004 i persuaded 4 other people to take them with me and we went to the grocery store again and proceeded to purchase about 10 bottels of dramanine. we went back to the car sat down and took all of them. i myself took 36 (900 mg) and drove back to my friends house and started to wait.</p><p>I remember it being hard to read anything, an affect i had been expirencing since the day before, but things got worse. i went inside my friends house and i remember sitting down and i couldnt stop looking at my hands. they appeared to abnormal in some way, but i couldnt figure out what. then i thought i was my fingers turn blue and there was all sorts of weird shit on my arms and legs and even feet. i remember being terrified that i was going to die. i decided to stop looking at my hands and go use the bathroom. it hurt like hell when i started to piss it burned so fucking bad i almost started to cry. </p><p>Then i went downstairs cause thats where everybody was. i only remember a few things from this point. my girlfriend was throwing up from taking the pills, which proceeded to make her friend throw up from watching her throw up. i asked her if she was ok and went into the other room. i sat down for a little while and when i tried to stand back up i remember feeling really drunk. i tried to walk into the other room and i tripped over a cooler hit my head on the ground and i remember feeling the worste pain i had ever felt from hitting my head on solid concrete with nothing stopping it. i remember trying to lift myself back up and i started shaking uncontrollably. 5 seconds later, i collapsed.</p><p>from what my friends told me i had a seizure for about 3 minutes and then stopped but i was breathing really hard. well in this time they had called 911 and the next thing i remember is hearing my name. well i felt better waking up cause i knew i was alive, but when i opened my eyes i saw a FUCKING COP hovering over me. he asked me about a billion questions including could i walk, i said yes and tried to get up but they made me lay back odwn. well about a minute later the paramedics got there, and 2 cops helped me up and walked me out to the ambulance.</p><p>the ride to the hospital was fun, i found out that my heart rate was 3 times above normal and my blood pressure was as well. the lady asked me what i took and how much and i told her. i remember going to the hospital and waiting in the room upstairs for my mom to get there. she had to drive 45 minutes to get to the hospital because i was visiting with my grandparents. i had to do the whole routiene and drink 2 cups of charcoal (the worse tasting stuff in the fucking world.) i stayed in the hospital for the next 2 hours where they monitored me and the cops came and talked to me once again. they let me go after things seemed to be normal and i had to hear it all the way home from my mom. </p><p>about a week later i got a call from a police officer informing me that they were pressing charges and i was like FUCK. well what happened after that is about 3 weeks later i went to court, the judge was nice he gave me 60 days of unsupervised probation (your partents are your probation officers,) a 75$ fine 4 hours of community service and i have to attend rehab once a week for an hour for at least 4 weeks. </p><p>my expirence with this drug sucked, if you want to try this i do agree that it can be safe but in smaller doses, but remember that you take the chance of having happen to you happen to me. of you decide after reading this that you want to try it, my only advice is dont take more than 24.</p>"
}
