{
 "title": "De-virginized to X",
 "author": "Achegro",
 "citation": " Achegro. \"De-virginized to X: experience with MDMA  (Ecstasy) (ID 37845)\". Erowid.org. Feb 28, 2008. erowid.org/exp/37845",
 "substance": "MDMA  (Ecstasy)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>To start off, I had never ever before in my 20yrs of life done ecstacy. I'm a fairly avid weedsmoker and have done shrooms and obviously drank, but never tried ecstasy.  This was mostly due to the fact that I am a health major and have learned a great deal about various drugs and before now had considered ecstasy to be one to avoid.  This all changed though about a week ago when a friend of mine told me he was going to a rave the following saturday and asked if my roomate (kyle) and I would like to go.  For some reason, which I still don't know exactly why, I rushed to capitalize on this opportunity to give ecstasy a try.  What would happen that following saturday's was one of the most fun and interesting nights I have had in quite a while.</p><p>Prior to taking ecstasy I made sure to research the drug so I would know just what I am getting myself into.  In addition to reading about the drug I also asked several friends of mine what their experiance was like, and each one of them assured me that it would be great and to make sure to drink plenty of water.  So by the time saturday rolled around I was more than ready to go. </p><p>Kyle and I spent most of saturday just chilling and drinking plenty of water in order to be more hydrated for the night.  We left to meet up with our friends Andrew, Craig and Leanne.  Since Craig was the one who told us about the rave he had the ecstasy.  When I looked at them I was surprised to see just how small they are and the thought crossed my mind as to whether or not they would actually work.  Kyle and I were a little skeptical about them, but decided we had to continue on and hope everything works out as it should.  We all took one car to make the 40min drive to where the rave was gonna be held, and on the way down Craig, Andrew and Leanne told Kyle and I about what the rave was gonna be like, since neither one of us had gone to one before or even done ecstasy.  When we got to the place we all dropped our first tablets and proceeded to head inside.  As we walked from the parking area to the place we would pass other rave-goers and I quickly noticed that everyone had various lights and glow sticks which I would later stare at in amazement. </p><p>Once we got inside, I was begining to get somewhat restless waiting for them to kick in. We began to walk around and explore a little when I began to feel something.  It first felt like the front of my brain was tingling.  I told this to Leanne and she was quick to smile at me and say that I would definitly begin to feel more.  As i stood around talking to her and taking in the atmosphere I began to feel rather sluggish and Kyle commented that I looked extremely wasted.  At one point then I felt that I had to sit down and just relax for a bit since I knew this feeling would pass.  While I was walking to the benches to sit down, people that would pass by me walking in the other direction seemed to be flat, almost 2-dimensional, drawings against a background. </p><p>I went and sat down next to two other friends we met up with at the rave (Justin and Lewis) and didnt talk much just nodded my head to all their questions.  Since it was pretty much halloween, people at the rave were in costume and Justin had decided to dress up as Jesus.  While I was sitting down he slid up next to me to hear me better and I began to laugh to myself as the thought crossed my mind that I was indeed talking with Jesus himself.  I explained this to Justin at which he laughed and patted my back which felt different.  After that I felt that I needed to talk to my good friend back home, who's also my ex-gf.  While I listened to her talk to me I found her voice humerous and pleasant to listen to and didnt want to hang up the phone.  We had a good 45min convo in which she kept stressing to me to drink water as she had done ecstasy before.  I reassured her that I would and got off the phone. </p><p>I was feeling very comfortable sitting down, when Kyle, Craig and Andrew returned from going on a walk.  I noticed almost immediatly that Kyle had a big smile on his face, huge pupils and was full of energy.  He had obviously peaked on the walk.  He came up to me and in the most excited way told me how great the walk was and basically forced me to go on one with him.  I reluctantly agreed since I knew he would not take no for an answer.  As we began walking he patted my shoulder and just began talking to me about random stuff.  We ended up walking all around the rave several times and even walked to the car and back.  Once we began to make our return back inside I no longer felt sluggish, but now had the same energy that Kyle had. </p><p>Both of us had peaked and decided to go inside the Rollerrink to poke around since that had just opened up as part of the rave.  We went inside and saw many people dancing and others watching people play with glow-sticks and such.  I ran into a person I had met earlier that night and asked him what was up with all the lights and such, to which he smiled at me and told me to sit down.  He then took out two glow-sticks and began to 'blow me up'.  He would move them around my head and eyes that it completely blew my mind like nothing I had seen before.  Every move he would make seemed more intense than the one before it and I had him do the same for Kyle. </p><p>We both began to feel very happy and I gave the guy a lollipop for performing for us.  After that we sat down on a couch and had a good conversation where we talked about many things that were going on for us and actually got to become even better friends.  Soon Craig, Andrew and Leanne met up with us and we went onto the rollerrink to listen to music and play with glow-sticks.  At that time I wasn't into the music just yet so I sat down and was soon watching more people screw with me using glow sticks.  I was even able to get several people to give me massages and scratch my head and such.  Kyle and I concluded that people at raves are generally very friendly and were especially excited that it was both our first times and did what they could to make us have a great time. </p><p>I ended up spending a great majority of time in the rollerrink talking to total strangers, yet I felt totally comfortable around them and asking them to scratch or massage me.  After a while of sitting I finally felt like dancing so I headed out to the dance floor to met up with everyone else.  I had such energy while dancing and playing with glow-sticks that I didnt care that it was already 4am.  I knew I was having a great time and didnt want it to end.  Finally around 745am they began to turn on the lights and the few people that were still around when we were all left.  Even though it was almost 8am and I had not slept, I still had lots of energy and was enjoying remembering what the previous night was like. Kyle and I returned back to our apartment around 845am but stayed awake just talking for a couple more hours. </p><p>Overall I would say I had a perfect experiance with ecstasy.  I plan to do it again, but not for a while and only if I go to another rave.</p>",
 "year": "2004",
 "id": "37845",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-28T08:00:00.000Z",
 "views": "2906",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 ]
}
