{
 "id": 3784,
 "title": "Intro to Psychosis",
 "date": {
  "submission": "2006-09-01T07:00:00.000Z",
  "experience": "1971"
 },
 "author": {
  "name": "Freefall",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "My teen years were a turbulent time. Race riots on campus and the Vietnam war on TV. The future seemed uncertain. I was intelligent and athletic, but I wasn't a tough kid.  I had known physical and emotional abuse.",
  "My only substance abuse experience had been alcohol, prior to a December night in 1971.  Hanging out with an older brother and several of his friends, I took a half dozen hits on a couple of joints that were going around.  I was 16 years of age.",
  "10 minutes in, I felt a pang of anxiety. My heart began to race. I felt hot and flushed.  My mouth was dry.  When I spoke, my voice seemed distant and detached.  The left side of my head grew cold and numb.  My limbs were not reporting in regularly.",
  "I had to move them to reassure myself that they were still connected.  I decided to take a walk to calm down. ",
  "Then the visual 'convulsions' began.  I would feel an increasing tension in my head, then receive a seizure like shock. When this happened, my visual perspective changed radically. Things would 'zoom' away, as if I were looking through the wrong end of a pair of binoculars.  The frequency of 'siezures' increased to every 4 seconds or so, at the height of my intoxication.",
  "I was overwhelmed with anxiety, fear and dread.  I could not be calmed or reasoned with.  I arrived at the local hospital ER within the hour.  My visual symptoms were beginning to subside.  I was diagnosed as hyperventilating.",
  "At home my mind could not disengage from the experience. I had residual symptoms of numbness on the left back of my head, visual disturbances, anxiety, and head tremor.  I could not sleep, and my thoughts began to race.  Finally, my mind sort of 'melted down'.",
  "I could not eat, or sleep, had no libido, and had feelings of guilt, shame, and overwhelming hopelessness.",
  "Over time, my symptoms lessened and changed to include recurrent migraine with aura, panic attacks, and major depression.",
  "I received no treatment or diagnosis for 20 years, despite several attempts. However, if psychotic illness is part genetic, part environmental, then cannabis has satisfied the environmental requirements for me.",
  "None of the others who smoked the same dope had any negative consequences.  Thinking that I might be able to over-write my bad experience and relieve my anxieties, I attempted cannabis several more times over the next 5 years.  At least once, the visual convulsions returned, and always the psychotic fear.  These events were not followed by a major depressive episode. (guilt/shame/racing thoughts/hopelessness).",
  "Psychoactive substance abuse has to be the rudest way of finding out that I am destined to be mentally ill."
 ],
 "erowid": {
  "id": "22148",
  "citation": " Freefall. \"Intro to Psychosis: experience with Cannabis (ID 22148)\". Erowid.org. Sep 1, 2006. erowid.org/exp/22148",
  "substance": "Cannabis",
  "views": "5056"
 }
}
