{
 "id": 3785,
 "title": "Erotic and Physically Euphoric",
 "date": {
  "submission": "2000-06-27T07:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "A & G",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Wow, I woke up to a cropduster buzzing the home at dawn. I decided to take advantage of the early time before the rest of the household awakes and ingested 8mg 5-MeO-DiPT. It was certainly interesting material from the reports that reached me.",
  "The cropduster woke up the nearly 3 year old boy. Oh well, I quietly get him out of his bed and took him outside to a nice porch under the oaks and mimosa's. It was a warm late spring early morning. The morning dew was still covering the ground and the plants everywhere were bursting with life. I noticed sounds were much clearer and the sights of nature simply more 'focused', lively. We watched the bi-plane do his fancy manuevers and I certainly became aware of his engine sounds becoming louder and more felt as vibrations. This was also true with all sounds. I came back into the home and my woman started to awake. I decided we would both benefit by me doing more and her tasting a dose. So I took another 12mg (this being nearly 2 hours after the 8mg) and gave her 10mg.",
  "I awaited the onset of this massive boost with a smile still going on from the rising tide of the first ingestion. The lady took care of settling the small child back down into the routine of watching his morning childrens shows, i.e. Sesame street. The buildup of this substance came on quickly, felt as a weight but nothing undesirable. The odd thing about this substance is that it is mostly a physical euphoria, but without much physical 'body load'. Sensorium was definitely enhanced in all manner. Eventually, finding the lady alone in the bedroom and listening to the sweet tunes of Medeski, Martin and Wood on the stereo, we found ourselves tumbling on the bed ripping each others clothes off and getting into some very primal sexual action. Much erotic sway to the material, although it doesn't necessarily push you in that direction. If chosen however, it is extremely delightful.",
  "The material wore off very smoothly and left me with the typical glow I normally get from most tryptamines. I ingested some ghb to enhance to coast down and was not dissappointed. After a visit from some family for the older boys birthday, I found myself enjoying the delights of my female companion once again. Oh boy! All I can say is this is really fun stuff for the entheogenically minded. It's lighthearted and more recreational than spiritual like most of it's tryptamine cousins. Wonder how it would mix with certain other materials? Hmmm... maybe next go around. It certainly deserves the nickname 'Foxy Methoxy'.",
  "Two thumbs up from this pyschedelic-minded couple."
 ],
 "erowid": {
  "id": "2215",
  "citation": " A & G. \"Erotic and Physically Euphoric: experience with 5-MeO-DiPT (ID 2215)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2215",
  "substance": "5-MeO-DiPT",
  "views": "35825"
 }
}
