{
 "title": "Into Rehab and Lessons",
 "author": "Persistent",
 "citation": " Persistent. \"Into Rehab and Lessons: experience with Opiates, Buprenorphine & AMT (ID 37884)\". Erowid.org. Mar 22, 2006. erowid.org/exp/37884",
 "substance": "Opiates, Buprenorphine & AMT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Methadone",
   "",
   " ",
   "",
   "Pharms - Tramadol",
   "",
   " ",
   "oral",
   "AMT",
   "",
   " ",
   "oral",
   "Pharms - Buprenorphine",
   "",
   " ",
   "",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "2004",
   "37884",
   "Not Specified",
   "",
   "Not Given",
   "Mar 22, 2006",
   "27345",
   " "
  ]
 ],
 "report": "</p>\nA few months ago, my journey through the world of psychoactive substances finally led me to an inpatient rehab. After years of responsible (well sort of) experimentation I finally fell into the hellish trap of opiate addiction. This was not brought on by recreational use. I was suffering from a severe dental abscess without recourse to expensive medical treatment. </p><p>I was living with my sister, who had been an opiate addict for some years. It was all too easy to slip into pain-killer addiction under such conditions. Having a heroin dealer living next door did not help. My sister constantly warned me of my dangerous position, but I was driven insane by pain and cared little for consequences, if the pain would just go away long enough for me to work and sleep.</p><p>After about 2 years of barely managing to survive with this monkey on my back growing into a baboon, then a chimp and finally a 500 lb gorilla, I was on the verge of total collapse. I was sick almost all the time, barely able to work to support my habit, and beginning to dabble in the typical male junky occupation of theft. I could tell that the end was approaching.</p><p>Luckily, one of the best rehabs in the country is located in my city and has a program allowing for free treatment if I survive the extended waiting period. During the week before being admitted, I was on 35 mg methadone plus $20 of heroin and 5-10 mg of a-MT per day. The day before admission I took my 35 mg methadone and 300 mg tramadol.</p><p>Now this rehab primarily uses buprenorphine for opiate withdrawal. Bupe is an unusual partial agonist opioid that can precipitate severe withdrawals if taken too soon after the last dose of a real opiate. So basically I had to wait until I was in full withdrawal to take the bupe. Generally this takes 6-12 hrs for heroin and 20-24 hrs for methadone. The tramadol, however, kept withdrawal at bay for over 36 hrs and I was able to make the transition to bupe without experiencing any withdrawals whatsoever.</p><p>In my opinion, buprenorphine is nothing short of a miracle drug. It completely eliminated my withdrawal symptoms, and due to its unique receptor binding profile and extremely long duration, there is no yo-yo effect typical of other opiates. By yo-yo effect, I mean the never ending cycle of high-sick-high-sick. I felt sober and stable, as if I were not even an opiate addict.</p><p>My month in rehab turned out to be one of the best in my life. The program was a balanced mix of spiritual and medical approaches. Weekly chi-gung classes and daily classes on a wide variety of recovery-related topics kept me busy and interested from 7 am to 9 pm. I met many fascinating people in rehab, and got to know some people I already knew better. Through meditation and chakra excercises, I was able to enter profound states of enhanced conciousness and had several very intense experiences of a transcendental/spiritual nature.</p><p>Unfortunately I was not able to stay as long as I needed to, and ended up walking out of there sick with no home, job or money. No follow-up meds, nothing, just see ya later if you survive. I managed to stay clean and sick until about the fifth or sixth day. The sickness and pain continued to increase until I just snapped and essentially just totally lost it. I entered a highly dissociated state in which I was barely aware of the pain, but was wandering the streets hallucinating, talking to hallucinatory friends and periodically losing conciousness entirely. Having no other choice, I opted to go back on methadone so I could function and work.</p><p>The first day back on methadone I took a 20mg dose of a-MT (a large dose for me) and met a similarly burnt-out, tripped-out temporarily clean junkie fresh out of jail and we hit it off. We went to an NA meeting, me tripping pretty good and that night we slept in a grove of trees on an empty field. Over the next couple months we lived together in a motel room provided by his PO, ate out of dumpsters and trash cans and slowly we both managed to get jobs and work our way towards a stable life. My new-found friend was a very bizarre and interesting person like myself and at first we seemed to share similar goals of achieving stability and going back to school. But opiate addiction is a tenacious disease, and before long we were both back in the thick of it. </p><p>My friend ended up having to flee the state because of his PO and I ended up living alternately with my sister and my mother. I now am working regularly and only shooting up occasionally and sporadically, so I guess I am somewhat better off than I was. I apologize for the rambling and brainless nature of this report but I hope it contains some info that may be useful or at least entertaining to someone.</p>"
}
