{
 "title": "Talented Drama",
 "author": "Jeremy",
 "citation": " Jeremy. \"Talented Drama: experience with Dimenhydrinate (ID 37896)\". Erowid.org. Aug 1, 2007. erowid.org/exp/37896",
 "substance": "Dimenhydrinate",
 "bodyweight": "230 lb",
 "report": [
  "<p>My friend at school told me about 'tripping' on dramamine. From his description of the trip, I thought he was bullshitting. He talked about how he had heard his name called numerous times as well as seeing spiders flying across the room that he was in during his trip. I enjoy tripping very very much so I decided to give it a shot.",
  "After I got out of school, I drove to my local wal mart to buy three packs of the stuff, one for me and the other two for my friends who planned on doing it with me as well. My classic rock band was to play at our high school's talent show later that night, not knowing how long the trip last.",
  "I took 12 pills, and proceeded to relax in my living room with my friends. About a half hour later I started to feel somewhat drowsy. This drowsiness continued on for about another half hour or so, then the visuals arrived. Still relaxing with my friends, I suddenly turned my head and watched my friend, sitting in the chair next to me, packing a bong which he had just bought. I was in a trance for about 5 minutes during this time and snapped out of it. I regained 'consciousness' and noticed my friend was gone. I asked the other two when we were going to go smoke the bong. They looked at me in confusion and replied 'What are you talking about?' I replied back 'The bowl that aaron was just packing, when are we going to smoke it?' I was surprised when they said back to me 'Aaron isn't even here'. I knew then that the stuff was really kicking in.",
  "An hour or so passed and my bandmates came to pick me up for rehearsal before the talent show. I ran into my room and grabbed my acoustic guitar and proceeded to walk out my door into their car. 10 minutes later I found myself sitting in the chair I had always been sitting in, with my bandmates around me chillin saying I should get my stuff together so we could go jam out before the show. Crazy. I then really packed up my stuff and headed out with everybody to our practice space. About two hours passed with no more hallucinations, just drowsiness.",
  "More time passed and we got our stuff together at our school the show was begginning. I watched a few acts before getting ready with my fellow bandmates to move our stuff onto the stage, still drowsy. Upon arrival on stage, we played our first notes as I watched about 50 people in the audience of 400 or so light up cigarettes and start smoking them. I found this odd, since smoking isn't alowwed inside the building. We played our ten minute jam medley, and it was the most eupohoric sounds I had ever experienced, playing everything myself, perfectly. The show ended and I went to bed fine that night, w/o any headache, naseau, or sleeplessness. All in all, this was about a 7 hour trip off of dramamine.",
  "The next day, my friends and I talked about our experiences. Some visuals my friends had included one of them thinking he was holding a shotgun when he was really just holding a guitar, and the other also seeing people around him smoking cigarettes while he was watching my band play at the show, as well as him watching the Boston Celtics play the Orlando Magic in a basketball game on a blank television screen while we were chilling in my living room earlier that day.",
  "Word got around the next day at school that I was tripping while I was playing at the show amongst my peers. My friends and others suddenly looked at me as an icon. Overall, my dramamine was a great experience. Not as fun as shrooms or acid, but very enjoyable. I strongly recommend it to anybody interested.</p>"
 ],
 "year": "2004",
 "id": "37896",
 "gender": "Male",
 "views": "5796",
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2007-08-01T07:00:00.000Z"
}
