{
 "title": "Schizo-lucid Dreams",
 "author": "stropharia",
 "citation": " stropharia. \"Schizo-lucid Dreams: experience with Mefloquine (Lariam) (ID 37948)\". Erowid.org. Feb 3, 2011. erowid.org/exp/37948",
 "substance": "Mefloquine (Lariam)",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Pharms - Mefloquine"
 ],
 "report": "<p>In late 2002 I got a chance to take a free two-week trip to Kenya.  As part of the medical preparations, I was prescribed an eight-week course of the anti-malarial drug Lariam, the generic name of which is mefloquine.  This is a preventative drug which must be taken once a week before, during, and after the possible malaria exposure.  I was warned by my doctor that it could cause 'neuropsychiatric symptoms', and he indicated that this meant different things for different people, ranging from nothing at all in the most common case to (rarely) psychosis.</p><p>The first four times I took the drug, I experienced very strange dreams the following night.  For example, I had a lucid dream in which I was in a dream-version of the actual hotel room.  It took a while before I knew it was a dream, even though I had full reflective consciousness.  I reached for my mobile phone, but the screen made no sense.  This was because I needed to download the phone's software into my brain through my skull, and just as this process began -- I could see the data streaming in -- I woke up feeling rather anxious at the frankly schizophrenic character of this delusion.</p><p>On another occasion I had nested lucid dreams -- I was dreaming that I was dreaming; in each case the dream was a lucid one of me being in my bed, and I had to cry for help to get my friend to release me from this state (in reality I was silent).  This carried on repeatedly all night -- most confusing and disturbing to sleep.</p><p>The experiences diminished as the course of mefloquine carried on, and did not occur at all on the six nights of the week that I didn't take it.  There were no perceptible effects during the day.</p><p>Several substances are sold online as oneirogenics, but this is the only thing that has actually worked for me.  At least it proved that it's possible for drugs to induce dreams.  Trouble is, they're not the sort I want.</p><p>I did not catch malaria, and these experiences would not put me off from taking it again if necessary.</p><p>[Reported Dose: '250 mg/week']</p>",
 "year": "2002",
 "id": "37948",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-02-03T08:00:00.000Z",
 "views": "3187",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Mefloquine"
  }
 }
}
