{
 "title": "Lessons of 25 MDMA Experiences",
 "author": "Adam",
 "citation": " Adam. \"Lessons of 25 MDMA Experiences: experience with MDMA (ID 3798)\". Erowid.org. Nov 18, 2000. erowid.org/exp/3798",
 "substance": "MDMA",
 "bodyweight": "160 lb",
 "report": "<p>SETTING:  I did the majority of my ecstacy trips either in the party environment (raves) or at home, with 1-4 select close friends.  If we were at a rave, it was always dark with loud music (of course) and we spent most of our time walking around talking to people, or dancing (spent little time in the well lit areas, or just sitting).  If we were at home, we were usually in a spacious room, dimly lit (blacklights or glowsticks only) with house or ambient techno music playing in the background, but not too loud.</p><p>MINDSET:  We almost always made sure our mindset was that of being happy and jovial and in a generally good mood, or we would not take the pills to start with (we were under the impression that if you were in an ill mood it would decrease the euphoric effects). </p><p>PREPARATIONS:  As far as preparations for the experience, we made sure we drank plenty of water, and were well rested prior to taking the drug, and we oftentimes ingested 1 or 2 vitamin C pills (we were told that helped increase the peak time) about an hour before taking the drug.</p><p>DOSAGE:  As for dosage, I couldn't tell you in milligrams or anything very specific, but rarely did we take more than 1 or 2 pills (1 for me, 2 for my friend, who was more of a frequent ecstacy user, and who hated the come down more than I did). </p><p>TIMING:  We experimented with taking our pill early in the night (11pm), all the way to taking it late (3am), and our general consensus was that the earlier we took it, the sooner it wore off of course, and so the greater the temptation to take another was.  After many raves I've decided that it's best to spend some time loosening up by dancing or walking around first, while you are sober, and to wait and take your pill until you have 'explored' the venue well enough and have danced for a while.  When I took my pill too early, I'd come down halfway through the party, and then I'd find I had a hard time enjoying the rest of the party, as it was nowhere near as 'euphoric' as the first half had been while I was on the drug.  Generally, I plan on the pill lasting 4 hours, and I plan to take it so that I come down right as the night would be ending, be it at someone's house, or at a rave.</p><p>WHAT I LEARNED FROM THE EXPERIENCE:  I learned that like most drugs, you can build a tolerance to ecstacy very quickly.  This only means more money you must spend to reach the level of pleasure you are seeking, and more harm to your body, and more exhaustion and hangover in the following days.  I find that any more than once a month seems too often, as it takes at least that long to let my body tolerance settle down some, and I don't think I have ever felt as good as I did the very first time, off the same dosage anyway.  I think the ecstacy experience varies widely with how clean the pills are, or if they are dirty, what other drugs they are cut with, and mindset.  If I spend too much time worrying about how hard the drug is or isn't hitting me, then I ruin it's effects.  I think the best thing you can do is limit the frequency and dose (try for only 1 or 2 pills, no more than once a month), and don't depend on the effects of the drug for a good time, but rather, just let them enhance your experience.</p><p>OTHER SUPPLEMENTS:  I was never on any form of medication, be it over the counter, or prescription, at the times I did this drug.</p>",
 "year": "1999",
 "id": "3798",
 "gender": "Male",
 "timestamp": "2000-11-18T08:00:00.000Z",
 "views": "36505",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
