{
 "title": "The Best School Day of My Life",
 "author": "Anonymous",
 "citation": " Anonymous. \"The Best School Day of My Life: experience with Phentermine (ID 37988)\". Erowid.org. May 8, 2006. erowid.org/exp/37988",
 "substance": "Phentermine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "Pharms - Phentermine",
   "(pill / tablet)",
   " T+ 0:30",
   "30 mg",
   "oral",
   "Pharms - Phentermine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Well I woke up one morning and got ready for school. Lately things have been going good but I want to make them better. So I dug through the med. trey. Had alot of stuff but Phentermine just stood out. And the do not consume with alchohal caught my attention. I looked on the internet and found it was a appitite surpresser. I like my weight but, I wanted a high. So I grabbed afew pills and went to school.</p><p>T:0:00 I arrived and took my first pill.</p><p>T:0:30 Feeling nothing I took another.</p><p>T:0:50 Woooo omg I feel like I'm on cocaine.(without the energy bursts) I'm sitting in my chair just enjoying everything and when some1 wanted me to talk I would take FEW moment and then speak because I didnt want to talk I wAnted to enjoy this awesome feeling. As the day Progressed I kept feeling better. Got to gym class......and what amistake. I felt like playing basketball so I started sweating alot.....I mean ALOT! I got tired withing minutes and had to sit down.(I now think that the phent. made me dehydrated) So I went to the water fountain to get rehydrated......ULGH!! Tastes so bad. I guess the appetite surpressing is working. But I managed to gulp quiet a bit down.Still feeling like I just got 50 free dodge vipers(cause thats what the feelings like is almost overwhelming)I went to lunch coudnt eat so I just went to go get some water cause at this time I had some serious cottonmouth.</p><p>Nearing the end of 7th period I was getting extremely tired.I got home safely(thank allah) I hit the bed and couldnt goto sleep.......Ahhhhhhhhh this sucks! But within 30 or so minutes I felt likeI had a whole nights sleep and felt normal again.</p><p>Next day eyes were a little dried out but doesnt mean I wont do it again.....a little cottonmouth and dry eyes isnt something to B**** about because same thing as If I would do weed.I LOVE IT!</p>",
 "year": "2003",
 "id": "37988",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-08T07:00:00.000Z",
 "views": "15622"
}
