{
 "id": 380,
 "title": "Irritability",
 "date": {
  "submission": "2004-05-26T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "dro-gato",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 drops",
   "administration": "oral",
   "substance": "GBL",
   "form": "liquid"
  }
 ],
 "report": [
  "I wanted a substance that was a mild mood enhance for a long time. I have read a lot about GHB and I thought that was the one for me. A replacement for alcohol without the hangover. I wasnt afraid of it being addictive, bc I just wanted it for some weekends, not for everyday.",
  "I finally got some GHB, in GBL form, that was sold as a solvent when it was legal.",
  "I took 30 and 40 drops a few times and I only got a mild buzz, roughly equivalent to two beers. It took me a while to increase dosage, because I know that the dosage curve can be unexpectedly steep. But yesterday I thought I'd do it, and I took 60 drops, mixed with water, which I drunk in a period of five minutes.",
  "I got a very pleasant buzz after 40 minutes, that I certainly enjoyed, not a problem with that, it made me keep a constant grin and feel a pretty pleasant physical sensation. The effect lasted for about one hour only. The downturn came two hours later (actually it happened every time I took it, even when I did 30 drops). I became very irritable and moody. I could actually clearly sense the pendulum effect that I get with most drugs, in which I have to pay my high with a low mood afterwards. This happened every time I took it. Furthermore, I get a weird mild pain in what I think is my kidneys the day after. That's scary because the kidneys are a major energy producer according to chinese medicine.",
  "This is my report. I bothered writing it because I never read this type of thing about GHB and I could clearly sense the irritability (specially to noises) and the pain in my kidney area.",
  "I regret this fact, because I would still love a mood enhancer for specific situations, like nights out, or for facing a creative project. Ill keep trying.",
  "Enjoy your trips and take care of yourself"
 ],
 "erowid": {
  "id": "10666",
  "citation": " dro-gato. \"Irritability: experience with GBL (ID 10666)\". Erowid.org. May 26, 2004. erowid.org/exp/10666",
  "substance": "GBL",
  "views": "13071"
 }
}
