{
 "id": 3800,
 "title": "Xaxax Dreams",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "m7w",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.25 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Recently I was prescribed a bottle of Xanax for anxiety by my psychiatrist (120 .25mg pills).  I knew they had recreational value, more so than the other benzodiazepines I had been prescribed in the past, so one night after a long day of smoking some very kind green bud on top of 1 Pink Medusa MDMA pill (approx. 6 hours prior), I decided to pop 9 of the little, white, oval pills (2.25 mg total) mainly to settle me down from the amphetine afterglow the E had produced and to help me get some rest.",
  "In addition to the xanax I took a large multi-vitamin (that had Ginko Biloba) in it, to hopefully improve the health of my mind after a day's roll on some very potent MDMA.",
  "After about 35 minutes I was feeling a definate buzz, comparable to 2-3 beers.  By the time I reached the hour mark I was completely obliterated.  I had trouble holding my head up and walking was basically out of the question.  I decided to call it a night and turn in.  I didn't have the slightest bit of trouble falling asleep.  I turned on some ambient Aphex Twin and don't remember much further than track 2, and I was completly passed out.",
  "I don't know whether or not one of the side effects of Xanax is vivid dreams (or the effect of the Ecstasy earlier) but I can definitely say I have never had a more lucid dream in my entire life.",
  "I was completely aware of the fact that I was dreaming.  I had the power to control every last color, dimension, action, and thought that occured.  I felt I was an omnicient benevolent god, yet at the same time I was fully aware I was dreaming.  What I found to be even more alarmins is the fact that even after waking up to get a drink of water, and then falling back asleep again, I was in the exact same state of mind (the same dream) as before.  In my dream I was capable of flying soley by the power of my mind.  I remember seeing very bizzare (alien) worlds and at one point I was a Playing Card (the Ace of Spades) who was some how able to joust (mid-evil style) on a mechanical horse in a completley pixelated dimension with telephone poles.  The dream was so lucid I found myself (or another part of myself) laughing at the obsurdity of what I was doing in my dream.",
  "The high Xanax produced for me wasn't the most profound aspect of the drug at all in this particular instance.  The dreams I feel it produced were the pinnacle I have come to appreciate.  I now take a couple of pills every night before sleep and have been experiencing some of the best dreams (most lucid - life changing even) that I have ever witnessed.\r[Erowid Note: Daily use of Alprazolam (Xanax), as with most benzodiazepines, causes physical and psychological dependence after only a few days of use.  Withdrawal from benzodiazepines can be extremely unpleasant and/or fatal if not managed carefully.]"
 ],
 "erowid": {
  "id": "22206",
  "citation": " m7w. \"Xaxax Dreams: experience with Alprazolam (Xanax) (ID 22206)\". Erowid.org. Feb 10, 2004. erowid.org/exp/22206",
  "substance": "Alprazolam (Xanax)",
  "views": "41483"
 }
}
