{
 "id": 3801,
 "title": "Snorted Foxy",
 "date": {
  "submission": "2000-06-27T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Windor",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "10"
   },
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  },
  {
   "time": "2:30",
   "amount": {
    "unit": "mg",
    "quantity": "5.0"
   },
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "A while ago, I had 15mg of foxy methoxy. I've found that 25mg is a good dose orally, so my assumption was that 15mg would result in 'not-high-enough' syndrome. What to do, what to do?",
  "I decided to snort it!",
  "I looked all over the net and asked various people (the kind of people who would know) if anyone had snorted it, and whether it worked. Nobody seemed to know!",
  "So, I figured the typical 1:2:4 (smoke:snort:eat) ratio would apply to Foxy, and snorted 10mg at around 9pm. I felt an alert almost immediately, and knew that it was going to work. I found myself at a ++ at about 20 minutes. It was very comfortable in the nasal region, comparable to ketamine. However, the drip out of the sinus (as I, as a good snorter, kept it there as long as possible) BURNED rather intensely. I got some apple cider to wash the taste out of my mouth and this helped the burn syndrome. Specifically, I kept the cider circulating and focused it on the back of my mouth where the foxy was dripping out. The burn didn't totally go away until I cleared my sinus aroudn T+30min. I rented 'A Fistful of Dollars' at about T+1 and had a very nice time watching it. I was high in the typical foxy way, some visual 'difference', interesting auditory enhancement but very lucid mindspace.",
  "Around T+2:30 I snorted the remaining 5mg. Same burn, etc., although the boosted effects seemed to come on faster. I was high quite late into the night. One thing I've noticed about foxy (any method) is that it tends to cause muscle tension for me. My sinus was a little bit odd the next day, but not significantly messed up.",
  "In conclusion, snorting foxy works. My assumption is that it will last shorter than oral dosing as long as you don't boost it like I did. I like foxy. "
 ],
 "erowid": {
  "id": "2221",
  "citation": " Windor. \"Snorted Foxy: experience with 5-MeO-DiPT (ID 2221)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2221",
  "substance": "5-MeO-DiPT",
  "views": "6857"
 }
}
