{
 "title": "Not a Waste of Time but Won't Do It Again",
 "author": "Anonymous",
 "citation": " Anonymous. \"Not a Waste of Time but Won't Do It Again: experience with 2C-C (ID 38078)\". Erowid.org. Dec 27, 2004. erowid.org/exp/38078",
 "substance": "2C-C",
 "bodyweight": "62 kg",
 "report": "<p>* Summary: I'm glad that I did it and I'm glad that its over and I am happy that I dont have to do it again.</p><p>Positive effects:</p><p>+ Time seem to slow down [quite alot] so perception seem better and higher. </p><p>+ Extreme sharpness and alert of all bodily senses, things feel like they did when you were a kid - [colors/feelings/time/texture/experience].</p><p>Negative:</p><p>-- intellectually disappointing, and boring [some benefits were made].</p><p>-- strong nausea and sickness especially for the VERY long first two hours.</p><p>-  pains in the lower body and internal organs [which I dont have normally].</p><p>-  generally uncomfortable throughout the expeirence both mentally and physically.</p><p>-  some body load</p><p>12:00 T+0: not white-grey powder 40-55 mg 2c-c down the hatch after being dissolved in water.</p><p>It was building up for two hours, two very nausiating hours.</p><p>And I felt terrible, not from the nausea alone, but from the aching effects it had on my lower body and internal organs [pains I dont have normally]. [Obviously the body doesnt like this substance, which might explain why people wake up somewhat happy the day after, that its mostly out of their system ...]</p><p>T+2: starts to settle, nausea subsides a bit, but some of it is stayed throughout. [nothing was eaten for some hours before the ingestion]</p><p>Vividing of colors and sounds is appreciated. Existance slows down and is waiting for me to establish a connection.  Strong stimulative effects and lack of intellectual properties and personal preparation denies me that.</p><p>T+4.5: Byebye colors and sharpness and minimal mental experience and time distortion. Stimulant aspects disappointingly remains.</p><p>T+6.5: Almost all gone STIMUALNT is still here. Hard to concentrate and remember.</p><p>Note: various herbal teas [camomile, green tea, etc.] helped reduce nausea, but was not taken only after two hours.</p><p>At the 3rd the refregerator was open and VARIOUS VERY COLORFUL AND VIVID vegtables were taken out, cut to a fullscale sensory salad.</p><p>A short walk in the open outdoor gave a spectacular view of greens and blues and reds and whites. Some strange happyness and reassurance was there, some things were easier to grasp and understand, others not at all.</p><p>--</p><p>I wouldnt recommend this substance to anyone at any state, unless there are no other possibilities in the universe available.</p><p>For me, the best thing mind-alterants can benefit is intellectual property:</p><p>1) that I change things in my life *AND MYSELF* to a positive direction and avoid negative paths.</p><p>2) that I may better understand who what where why etc.</p><p>3) stop from the flood of day-to-day confusions aka. 'Normal' modern life, and the ability to concentrate on what is right and benefitial.</p><p>And maybe the occasional tranquility and euphoria from our ever-angry surroundings but for me its not the major issue. If it doesnt give this, or if I can achieve it in other ways I would not take it or any other.</p>",
 "year": "2004",
 "id": "38078",
 "gender": "Male",
 "timestamp": "2004-12-27T08:00:00.000Z",
 "views": "12363",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  }
 }
}
