{
 "title": "Gosh I Love Phenethylamines.........",
 "author": "TeKtonik",
 "citation": " TeKtonik. \"Gosh I Love Phenethylamines.........: experience with Trichocereus Peruvianus (ID 38080)\". Erowid.org. Mar 1, 2008. erowid.org/exp/38080",
 "substance": "Trichocereus Peruvianus",
 "bodyweight": "160 lb",
 "report": "<p>I ordered an ounce of dried Trichocereus Pachanoi online, then came across some Peruvianus and ordered that as well, for comparison's sake.</p><p>I really screwed up the pachanoi, because i couldn't find a good way to ingest it. I ended up throwing away a sticky, 20 gram mess, and was pretty sad about it. The other 10 grams or so i ground and made a dough out of, then ate as a spread on cheese doritos, which actually wasn't all that bad. I didn't get any effects whatsoever, and cursed my stupidity for screwing it up.</p><p>The peruvianus arrived 2 days later. This batch was already more promisisng. Both types i had ordered were only the dark green part between the skin and core of the cactus, but the peruvianus was darker and had more of a smell to it. I decided that i wouldn't risk an extraction this time, and made a dough out of the entire lot of ground cactus.</p><p>I put a small amount on a dorito, as i had with the batch before, stuck it in my mouth, and began to chew. YUCK! I spit it in the garbage. The peruvianus was 10 times more bitter than the pachanoi i'd eaten 2 days earlier. This got me excited, knowing that it must have a higher alkaloid content.</p><p>Since i wasn't going to be chewing the nasty stuff, i decided that i'd make little balls of dough and swallow them, one by one.  While it seemed like a good idea at the time, i quickly learned this method wouldn't work either. In my less-smart days, i used to take cough pills in multiples of ten, and vomited a few times from them, which developed a strong aversion to swallowing anything. Coupling that with a VERY unpleasant syrian rue overdose (which i swallowed like pills), i now get queasy swallowing a pair of aspirin.</p><p>After about the first 3 balls, i started making smaller ones, then smaller ones still. I finally gagged on one that was about the size of a pea, and decided to give up after maybe 10 grams.  2 hours later, to my surprise,  after i had more or less forgotten about the cacti altogether, i experienced slight phenethylamine effects, which were dedinately not placebo. I'm not saying i tripped, i was far from it, but getting a result from that tiny bit energized me: the next day i was eating the rest, do or die.</p><p>I didn't get around to being able to eat it until 5pm the next day, so i was ready.  The little balls of cactus i'd made the day before looked exactly like buds of pot to me, and up close there were little sparkles, which really made me feel like this was potent cactus.</p><p>So, i added a little water to rehydrate, and made one large ball of cactus, which i then broke into 4 pieces. I took each one, stuck it in my mouth, chewed it to break it up a bit, swallowed with watering eyes, and chased with lemonade. I ate it all in under 2 minutes. Feeling proud of myself, and a pretty nauseated, i popped in a few pepto bismol tablets to settle my stomach down.</p><p>I noticed my first alerts about an hour and 15 minutes later, and after that it came on very, very slowly. It didn't seem that strong at all until i got up and walked to the video store with some friends. Mescaline really reminds me a lot of 2c-i (i'd say it the other way around now, 2c-i reminds me of mescaline), except it doesn't have the harsh push 2c-i does. The peruvianus, while slow and gentle was very intense. We rented the first Nightmare on Elm Street and Jacobs Ladder (both very good psychedelic movies) and it was the most fun i'd had in a long time. I went and helped a girl i was hanging out with do her laundry, and that was even a barrel of fun.</p><p>I was still very euphoric around 7 or 8 hours after ingestion, when i decided to smoke some pot. I'm not really that much of a marijuana fan, i mean i like it but i'm not crazy about it, but that night it was something else.  Instead of burning when it hit my lungs, it was like i couldn't get enough. It felt so good i wanted more, more. I ended up smoking 2 bowls of good bud by myself, and that's when i really took off.  I haven't been that high in a very very long time (not including ayahuasca).</p><p>When i got back to the room i'd watched the movies in, some people invited me along to a haunted insane asylum, in which i've had some very unnerving experiences previously. I'd never met these people, and i'm generally pretty shy, but i gladly accepted i was feeling so good.  I didn't even care that i was tripping with them, although i later found out they were potheads :) On the way to the asylum, i was able to sit there and take in the phenethyline visuals. No colors, but plenty of bending and flowing. We told stories about scary things on the way there, and i told about what had happened to me at the place we were going, and they almost wanted to turn back, but i begged to go. After watching the scary movies, this talk was scaring me a lot, but in a fun, crazy way. It felt like someone had turned on an adrenaline pump in my stomach, and forgotten to turn it off.  To make a long story short, we got the bejesus scared out of us, and i had a rush of adrenaline that makes amphetamines seem tame, lol.</p><p>I was finally able to sleep 14 hours after ingestion, after i finally calmed down and woke up everyone and told them what had happened.</p><p>I definately want to do trichocereus peruvianus again, as it was one of the most euphoric and fun drugs i've done in a long time. It is very pleasant on the body, although i felt a little weak at times, and it felt a lot like the 2c-i rush, but more in my legs, if that makes sense. It is very intense and long lasting, but my head was clear enough that it never got overwhelming or annoying. I just can't wait to try more, like 35 grams.......</p><p>Have fun,</p><p>stay safe</p>",
 "year": "2004",
 "id": "38080",
 "gender": "Male",
 "timestamp": "2008-03-01T08:00:00.000Z",
 "views": "8999",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Cacti",
   "form": "(dried)"
  }
 }
}
