{
 "title": "Cross-Tolerance Pretty Much Wasted It",
 "author": "MthylnMan",
 "citation": " MthylnMan. \"Cross-Tolerance Pretty Much Wasted It: experience with MDMA (ID 38091)\". Erowid.org. Dec 31, 2004. erowid.org/exp/38091",
 "substance": "MDMA",
 "bodyweight": "172 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1200 mg",
   "oral",
   "Piracetam",
   "",
   " T+ 2:00",
   "120 mg",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>The purpose of this experiment was to determine if there is cross-tolerance between methylone and MDMA.  The usual dose of 220mg methylone was ingested five days prior to the MDMA experience.  The methylone experience was quite pleasant, with a few new insights and much relaxation.  The MDMA tablets were left over from several years ago from an airtight container, and from previous use, I knew they were good.  I had not consumed any MDMA-related substances (except methylone) for well over a year.</p><p>I took 1200mg of Piracetam two hours prior to dosing, but other than that, I had no other drugs in my system.</p><p>T+0: I ingested one MDMA pill on an empty stomach.</p><p>T+30mins: I experienced very difficult come-up effects, such as being unable to think clearly, slight over-stimulation, racing heart, chills, and fatigue.</p><p>T+2hrs: I never really felt like I came up.  However, at least the terrible come-up effects had dissipated by this time.  Euphoria was almost completely absent, and I was surprised how difficult it was to think or keep perspective during the come up phase.</p><p>T+4hrs: The last two hours werent bad, but euphoria or feelings of love never developed.  I got some good pondering done, but I felt little physical energy other than my strongly-beating heart.  My eyes were closed almost the entire time.  My pupils were very, very dilated, but I did not experience the softness or sparkle around lights that is usually apparent with MDMA.  This is very unlike what these tablets did over a year ago.  I also did not experience any memory problems, but then again, I don't smoke pot.</p><p>Conclusion: Methylone may downregulate the receptors used for the MDMA high, or it may deplete similar neurotransmitters as MDMA.  Five days is not enough recovery time.  Overall, the MDMA experience was not worth it  it was pretty much wasted.  However, the whole point of the experiment was to determine if there was cross-tolerance with methylone, and it appears there is, to quite a large extent!  I hope this information will be passed on to those interested.</p>",
 "year": "2004",
 "id": "38091",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-31T08:00:00.000Z",
 "views": "9350",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1200 mg",
   "administration": "oral",
   "substance": "Piracetam",
   "form": ""
  }
 ]
}
