{
 "id": 381,
 "title": "Euphoric Relaxation Bliss",
 "date": {
  "submission": "2004-11-24T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "dgplexus",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": "144 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "0.25 tsp",
   "administration": "oral",
   "substance": "Damiana",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": ""
  }
 ],
 "report": [
  "Mindset and Setting:",
  "Working as a security guard in an office building, swing shift.  I was somewhat stressed out over being audited & summarily cheated by the state tax people.  So I was searching for a good combination for better relaxation.",
  "Preparation:",
  "I acquired 'DAMIANA 4:1 powder extract' (100 grams) and 'KAVA KAVA standardized extract. 55% kavalactones, 144mg, 90 caps.  I already had some megadose 'B vitamin complex' tablets.  (Each tablet has 100mg of many of the B vitamins, and less of others, in a balanced combination.  Pretty standard.)  I also had about 1oz of soy protein powder.",
  "Dosage and Timing:",
  "After most people left the building, I took the following together:",
  "- One large glass of water (about 16oz)",
  "- One 144mg softgel Kava extract (55% kavalactones)",
  "- 1/4tsp Damiana powder (4:1 extract) mixed with the water",
  "- About 1oz soy protein powder, mixed thoroughly with the water",
  "- One megadose 'B vitamin complex' tablet",
  "Results:",
  "After about 5 minutes, I started to feel a euphoria coming on.  I did not feel mentally impaired, in fact I felt more energized, alert and euphoric than I would without the Damiana in the mix.  I felt much more confident, patient, blissful, and in control.  This was a mild, pleasantly euphoric, and healthy feeling.  My sense of 'well being' was significantly increased.  The effect seemed to peak at about 20 or 30 minutes, and gradually diminished for about 4 or 5 hours.",
  "Notes:",
  "This combination could become habit-forming (psychologically addictive,) but was definitely not physically addictive for me.  After discovering it, I took this combination daily (once or twice a day) for several weeks, then abruptly stopped taking it to test the habit-forming potential of it.  After stopping, I missed the feeling I had while taking it, but I just felt the same as I did before, no worse.",
  "Comparing this combination to Damiana or Kava alone, I would give this combination a '10' (on a scale of 1 to 10,) while Damiana would be a '3' and Kava would be about a '6.'  I was happily surprised at the apparent synergy between the two herbs.",
  "Conveniently, all of its ingredients are legal in the U.S., and the substances are currently easily obtained from many sources.  :-)"
 ],
 "erowid": {
  "id": "10667",
  "citation": " dgplexus. \"Euphoric Relaxation Bliss: experience with Kava & Damiana (ID 10667)\". Erowid.org. Nov 24, 2004. erowid.org/exp/10667",
  "substance": "Kava & Damiana",
  "views": "42394"
 }
}
