{
 "id": 3810,
 "title": "Level 3 - Perfect",
 "date": {
  "submission": "2003-03-19T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "mindxplorer",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.3 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 ],
 "report": [
  "Date: Mar 17, 2003",
  "Substance: P. Cubensis Mushrooms (Tazmanian Strain)",
  "Time: Took the shrooms at 7:45pm",
  "Mindset: A bit nervous but excited to try mushrooms.",
  "Setting: Camping by the lake, under the moon and stars.",
  "Dose: 3.3g each",
  "6.61g of P. Cubensis Mushrooms were recently grown and dried. I recently tried a small dose of less than 1g to see if I was sensitive to mushrooms but I didnt feel much. I wanted to try a hallucinogen for the first time and this was my spring break. I needed this experience and it turned out perfect, utterly perfect.",
  "We arrived at the campsite around noon and setup camp. Our tent was 50feet from the lake and a few feet from our campfire. The weather was going to be 70F at noon and 55-60F at night. It was also cloudy outside at noon. We collected plenty of firewood and ate lunch and dinner.",
  "My friend, M, also took the prior batch of shrooms to see if he was sensitive to Mushrooms and he was not. We laid out the mushrooms on a dinner plate and divided the mushrooms, 3.3g each. I was quite nervous about taking the shrooms. I have always had a problem about taking the 'leap'. After 30min of preparing myself I was still too nervous. I thought the setting was horrible. The moon was coming out but it was blocked by the clouds. I thought it would be a gloomy setting as the tall pine trees looked scary. I got too nervous but the next day was supposed to rain. We planned this day for weeks and I didnt want to ruin the trip so I told M to randomly choose a time within the next 30 minutes to take the shrooms. I thought that in this way I would feel calm before I took the shrooms and it worked.",
  "+0:00. We ate the mushrooms with chocolate to mask the taste. I wanted to know the precise time of every moment I was feeling so I looked at my cell phone and it was 7:47pm. The taste was nasty but much better than morning glory seeds. We then started our fire and cleaned up a bit. The weather was very nice but still cloudy. We decide to sit and wait for the effects to kick in.",
  "+0:15 Looking out at the lake I see a dark object moving by the shore. I told M and we started to freak out. It looked like the geese was saw earlier that day but it somehow looked freaky and different. By this time we definitely noticed things becoming different. A few minutes later we saw flickers of lights in our vision. We saw the same flickers but wasnt sure if they were airplanes or not. There were about 5 flickers of light throughout the sky and I couldnt tell if it was the shrooms or if there were really there. We start discussing about how beautiful it was outside and it was.",
  "+0:30 The moon came from out of the clouds and casted a cool glow on the area. We decided to walk to the shore and I felt really drunk and walking was difficult. My vision was sharpened greatly. The shoreline looked so awesome as the moonlight struck the white rocks. The contrast is similar to a blacklight on a white t-shirt. It just stood out so beautifully. It was like paradise. We sat on the rocks by the shore and just looked out. The lights from the marinas and on the horizon was beautiful. So beautiful. Now the water looked like dark oil and was so calm. As the wind blew the dark water made wonderful looking ripples. They were so long and calm. Its indescribable. We both looked toward the bridge and saw a large dark hole in the water. It looked freaky and was moving. It was awesome we shared the same hallucination. We talked effortlessly about life and everything. Its quite hard to remember but it was awesome.",
  "We walked back to camp and talked for a while there. I looked at the fire and the logs had faces in it like a totem pole. The faces were Aztec looking and some with wolves. We decided to walk along the road. We walked along the road and bumped into each other. There were other campers and I was thinking they must think we are really drunk. But I didnt care at the same time. As we walked along the road cracks appeared and as we walked it made it look like cracks just spreading from our feet. This was cool and I described it as roots coming from our feet. We got kind of scared and turned back towards our camp. When we walked back we saw an object which looked like it was recently struck by lightning! It looked like a tree with glowing embers from a recent lightning strike! This was cool but when we walked closer and it was a piece of electronic equipment.",
  "+1:30 We arrive from the walk back to our campsite and then we see the park ranger. We got paranoid and decide to get in our tent to pretend we are sleeping in hopes of them not disturbing us. This was an unusual feeling. I decided to listen to music. As I was listening to music in the dark tent I saw some awesome closed eye visuals. It was awesome how things morph into something else. I saw a kaleidoscope of spiders morphing into aliens with awesome color. Everything looked like fractals in my eyes. The music sounded so wonderful. I cried. It felt so wonderful and I wasnt sure if I was really crying or hallucinating it. It was pure Euphoria. I didnt care if it was the smoke that caused my tears but I was happy for the first time in a long time. I had no worries and was just laughing at the thought. I was having mind loops of the same thought. I continued listening to music for another hour in pure bliss and ecstasy. I was grooving with the tunes. I was melting in my sleeping bag.",
  "My friend mentioned this wasnt even our peak and I laughed hard from that. I was so happy I took the shrooms at that time. The setting was perfect. It was like it chosen for this occasion. I felt one with nature. Looking out through the tent I saw the moon come out and I saw rainbows coming as halos from it. The stars were multicolored and beautiful. I had a pushbutton light that was dimming but there was some ash on it. I blew it off and it disappeared and reappeared. I looked closely at the ash and the dots were vibrating with color of red, green, blue and purple pulsating with energy. I call it my magical orb of light. It was so fun to look at. I looked at my cell phone and the green indiglo light looked so trippy. Time was almost meaningless and I couldnt calculate how many hours since we took the shrooms. Minutes seemed like hours.",
  "+3:00 (approx) We decide to get out of the tent and go for a walk along that same road. As we walked we some other campers with a huge fire going. The looked so funny. My friend swore that they were doing some kind of tribal dance around the fire. I noticed this also. It looked really cool like an ancient tribal dance because the orange hue of the fire luminated there bodies with some eerie shadows. The tall pine trees added to this effect. I commented on how it was awesome we shared the same hallucinations and thoughts. This was so fun. The road had the same cracks as we walked and spread. The cracks seemed so giant and they trailed on for a long time. The moon and stars looked so beautiful. We walked to the shore at the end of the road and we came by this giant cliff. It looked 300feet deep. (Later we found it only about 15feet deep) Looking from the top it looked like paradise. The rocks reflected white from the moonlight and the water was pitch black like thick motor oil.",
  "The lights on the horizon were emanating a rainbow. I was eating skittles and suddenly there were rainbows everywhere in the sky. The rainbows came from all the lights in the sky and were so beautiful. I threw a skittle in the air and said taste the rainbow. The Rainbows were probably the best hallucination I saw that night. We finally made it down the cliff and walked along the white rocky shore which looked like it was illuminated by a blacklight. Visuals were dying off but then I saw a grid like appearance on the water far into the horizon. The rainbows were still there but things seemed so peaceful now. I was scared of nothing. As I was thinking that a bird flew from the rocks which scared the shit out of us. It was funny how this happened so ironically.",
  "+4:00 (approx) we arrive to our campsite and talk intellectually by the dim glowing fire talking about lifes mysteries. This was an experience we would never forget we both said. We just chilled for another hour or so as the open eye visuals stopped. I could still see closed eye visuals when I listened to music. There were legs in my vision dancing and moving and grooving to the tunes. It was perfect. Everything was perfect. How everything was so perfect was awesome.",
  "As we fell asleep I woke feeling great. I returned home and everything is beautiful and I feel happy to be alive.",
  "I will probably never forget this experience but I decided to write this report as I may forget the details."
 ],
 "erowid": {
  "id": "22229",
  "citation": " mindxplorer. \"Level 3 - Perfect: experience with Mushrooms - P. cubensis (Tasmanian strain) (ID 22229)\". Erowid.org. Mar 19, 2003. erowid.org/exp/22229",
  "substance": "Mushrooms - P. cubensis (Tasmanian strain)",
  "views": "11296"
 }
}
