{
 "id": 3816,
 "title": "Visual and Physical",
 "date": {
  "submission": "2000-06-27T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Scotto",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I've had two experiences now with 5-meo-DIPT, once at the 20mg level, once at 25mg. 5-meo-DIPT is being touted as 'the foxy methoxy,' and while cynical bastards like me are well aware that this is a Clever Marketing Ploy, the fact remains that there certainly are people who are digging on the sensual aspects of foxy.",
  "My experiences with foxy have been rather enjoyable in both cases, though I never particularly felt too 'foxy' either time. Foxy to me is very much like LSD, except without the deep well of content that accompanies an acid trip. It's very visual, and very physical - my body vibrated with energy, and I was lucky on both occasions to be in environments which were good for hiking around and looking at interesting things. Sitting still or hanging out inside an apartment would, I imagine, be a drag on this substance, whereas going out dancing or hiking along a beach would be ideal activities. Intellectually I wasn't as stimulated as I am on something like LSD or 2C-B, but the pure physicality of the substance made up for it. The first time I took it, I found it extremely hard to communicate with my companion, but during the second experience, the same companion and I 'hit our stride' so to speak and were able to communicate a lot more fluidly.",
  "Foxy has what I would call a high body load. It leaves me feeling very taxed, and at the 25mg level, I was very nauseated for quite a while as I came on, having to stop several times in fact doubled over on the verge of vomiting. Eventually my stomach settled, though, and things moved wonderfully. At the dose level I was taking, foxy had an LSD-like arc in terms of duration and peak; it wasn't particularly easy to get to sleep afterwards.",
  "We managed to run a number of experiments at various dose levels with foxy, and found that about half the time people loved it, and half the time people were annoyed by it. One guinea pig described it as 'having all the annoying parts of acid without any of the good parts,' while other people were blown away by it and had a wonderful time. In general, the more of the substance people consumed (heading up toward 20mg and above), the better time they had, but as always, this is not a rule but a limited observation and caution is in order. We know of a few crazy people who have ramped it up safely and enjoyably to rather high dose levels, but body load is definitely an issue. We also heard of a couple guinea pigs who combined foxy with LSD, taking LSD at the tail end of the foxy, and apparently had a marvelous time.",
  "For me, I'm looking forward to trying it again at a slightly higher dose than before, and seeing if I get to a state with it where my intellect is as enraptured as I am told it can be on foxy. "
 ],
 "erowid": {
  "id": "2225",
  "citation": " Scotto. \"Visual and Physical: experience with 5-MeO-DiPT (ID 2225)\". Erowid.org. Jun 27, 2000. erowid.org/exp/2225",
  "substance": "5-MeO-DiPT",
  "views": "16352"
 }
}
