{
 "title": "Made Me Tired",
 "author": "Frylock",
 "citation": " Frylock. \"Made Me Tired: experience with Calea zacatechichi (ID 38175)\". Erowid.org. Nov 22, 2004. erowid.org/exp/38175",
 "substance": "Calea zacatechichi",
 "bodyweight": "175 lb",
 "report": "<p>Got a big sack of Calea.  Was quite amped to try it.  Didn't go so well:</p><p>Thursday:  made tea--simmered a handful (approx. 3gm) in water for 15 minutes at gentle boil.  Ended up with half a cup of tea.  Added milk and honey (like the Beck song.)  Tasted like pure ass.  Thought I'd be able to handle it even after reading reports of disgust, but could only get through half of my half-glass.  Smoked a bowl of calea before I slept.</p><p>Result: minor auditory hallucinations distinct enough to startle me out of falling asleep.  Woke up the next morning with no dream memory (I usually remember my dreams) and feeling quite tired (that 'didnt I just fall asleep?' feeling)</p><p>Friday: 1 gram orally (in capsules) an hour before sleep.  Smoked a calea bowl right before sleeping.</p><p>Result: felt like shit in morning.  Tired as balls.</p><p>Saturday: 2.3 grams orally hour before sleep.  Smoked calea bowl before sleep.</p><p>Result: tireder as balls.  Slept all day, woke up, still tired.</p><p>Basically, this shit made me quite tired.  Tea was the closest I got to making it work for me, but I didnt like the idea of force feeding gag-inducing sludge before bedtime. I'm quite disappointed--I had high hopes for this one.  I will continue experimenting.</p>",
 "year": "2004",
 "id": "38175",
 "gender": "Male",
 "timestamp": "2004-11-22T08:00:00.000Z",
 "views": "8542",
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(dried)"
  },
  {
   "time": " T+ 24:00",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(dried)"
  },
  {
   "time": " T+ 48:00",
   "amount": "2.3 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": ""
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(dried)"
  }
 ]
}
