{
 "id": 3820,
 "title": "Friend Overdoses On Bars",
 "date": {
  "submission": "2006-09-27T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Someone",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 tablets",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "(names have been changed)",
  "I never fucked with anything else except weed. But one day (Friday), me and a good friend of mine decided to walk to a mall that we live fairly close to (about a mile or so away). What makes this even shittier is that all this happened on his birthday.",
  "Anyway, he capped about 6 bars, and hes done them a lot of times before, but not in a long time. It was a good day, and at around 6:00, right before the long weekend. My friend Gail was celebrating his 17th birthday, and we decided to go this mall, and meet up with his girl and some of our friends. We rolled a fat as j full of some fine ass chronic, and on the way there smoked it. He took the bars before we left.",
  "I was fucked up. He was even more fucked up. The bars where kicking in for him, and it was pretty dark. We where walking down a busy street, so we decided to cut thru a 1-way area to be safe. This is where everything started to get fucked up.",
  "I noticed Gail was stumbling a hell of a lot, but I didnt think much of it. I dont know much about bars, but I just expected that thats what made him do that. We where almosed at the mall, and I was high as fuck. Then he was slowing down, and I look back to see why hes being a dumbass and going slow. Then he falls.",
  "Yo. Gail, are you ok?",
  "No answer",
  "GAIL!",
  "(Slurred) huh?im straightdont worry about me",
  "(Starts throwing up)",
  "O SHIT ayo, u want me to call a doctor?",
  "No, dogg, im fine. (Gets up)",
  "Then we started walking some more. After a few minutes, he starts stumbling again, and falls over again.",
  "g-d damnitGail, get your ass up.",
  "(slurred) shut the fuck up im fine..(throws up twice, then after about 2 minutes gets up)",
  "Seeing as how the bud impaired my judgment (like I care), I was just like, whatever, lets keep walking. Everything was going good after this, and I was starting to enjoy my weed high again. We finally made it to the mall, and he throws up again, (in the mall), but keeps walking this time. Then he finally says he feels like sitting down, so we walk to a restaurant, and he goes to the booth and passes out. Before that, he told me to get movie tickets (like hed be able to follow it) while we waited for his girl. Im waiting in line for like 10 minutes, then I turn around and see him sleeping at a bench in front of a movie theater.",
  "This is where things get even worse. I finally got out of the slow ass line and went to him to tell him a got the tickets and if he was ok. There were like 4 cops around him. Then one cop came up to me.",
  "(Cop) are you Sean?",
  "Yea, whats going on?",
  "(Cop) Im going to make this plain and simple, what is wrong with your friend?",
  "I dont know.",
  "(Cop) there is definently something wrong with this kid, so before we get into this, let me say iv been doing this for a long time, so I dont want any bullshit. Is your friend on ecstasy?",
  "Na, he isnt",
  "(cop) then what is he on? We're bringing in a DEA agent, he should be here in a few minutes.",
  "(Thinking) O SHIT!!",
  "Lying to him would just piss him off and only make things worse, even I knew that. So, I told him that he smoked and took bars. He said I was bulslhitting him. I looked over to Gail, and he was sitting Indian style, his head down. I tapped him and he looked over at me. It was the look of a dead man. His eyes where pinpoint, and his flesh tone was fucked up. Then the (fuckin asshole) DEA agent showed up, along with a few paramedics. And once it seems like shit couldnt get any more fucked up, Gail's girl (Rebecca) showed up. (Aint that some shit?) she came over and sat with us, not aware that there where cops everywhere(at least for us, anyway).",
  "(Rebecca) u ready to watch the movie?",
  "Uhh, I dont think now is a very good time.",
  "Then a cop got her attention",
  "Whats going on? She asked, looking nervous.",
  "Then the cop took her a few feet away and started talking to her. Then the fat ass dickhead DEA agent (not knowing I was high, what a dumbass) pulls me my the arm and starts asking me the same shit the cops been saying. He also thought I was lying.",
  "(Asshole dea agent) I'm sick of teenagers these days, such stupid kids. Anyway, what is wrong with your friend?",
  "I already fuckin told you",
  "(Asshole dea agent) shut up, I know your lying. If your going to tell me this kid isnt rolling, I might as well fuckin break you. (Yea, sure)",
  "Whatever, man. I told you, and its the truth.",
  "Then the paramedics started doing stuff to Gail, like blood pressure, and shit like that. The paramedics were the only ones that werent assholes. I looked over at Rebecca (who Im good friends with also) and she was crying. She looked very scared, and I can see why. I go over and start talking to her, and she was devastated. Out of nowhere, my parents show up(just great). Then I got even more nervous. They started talking to Rebecca and me, and I just hear the same fuckin questions I've been hearing. It was starting to piss me off. Then the paramedics came with a stretcher and put Gail on it, then left. My parents asked Rebecca if she needed a ride or something, but she said no and left. She was devastated. I was mad worried. I kept thinking, O shit is he going to be ok?",
  "My parents where driving me back home, and we stopped by Gails house and told them the bad news. It wasnt cool, because they started blaming me (??) for this, and saying it was partially my fault. (What the fuck?). Then I went home, and tried to sleep. It wasnt easy at all. I was talking to Rebecca for some of the time; we both knew he was going to be ok, but we where still nervous. But in other ways he was still fucked. Probably because he just got out of rehab when this happened.",
  "Some birthday he had"
 ],
 "erowid": {
  "id": "22263",
  "citation": " Someone. \"Friend Overdoses On Bars: experience with Cannabis & Alprazolam (ID 22263)\". Erowid.org. Sep 27, 2006. erowid.org/exp/22263",
  "substance": "Cannabis & Alprazolam",
  "views": "30069"
 }
}
