{
 "title": "An Accidental Near Death Experience",
 "author": "sepulfreak",
 "citation": " sepulfreak. \"An Accidental Near Death Experience: experience with 5-MeO-DMT & Leonotis leonurus (ID 38218)\". Erowid.org. Aug 2, 2005. erowid.org/exp/38218",
 "substance": "5-MeO-DMT & Leonotis leonurus",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  "5.0 mg",
  "smoked",
  "5-MeO-DMT",
  "",
  "",
  " ",
  "smoked",
  "Leonotis leonurus",
  "(tar / resin)"
 ],
 "report": "<p>Second time with 5-MeO-DMT. I also have experience with Mescaline, 2C-I, 2C-E, 2C-C, 2C-D, LSD, LSA, Mushrooms, Iprocin (4-HO-MiPT) Miprocin (4-HO-MiPT), 4-AcO-DiPT, 4-AcO-MiPT, Salvia, DXM, Ketamine, MDMA, MDA, Methylone, IAP and Cannabis as for the 'mind' drugs.</p><p>Mindset: Reasonable mood, though having mild to moderate Opiate/Opioid withdrawal</p><p>Method of Dosing: Smoked.</p><p>Trip Dose and Duration: 5-10mgs.</p><p>Medications: None.</p><p>Wow, was this a surprise.  I had been using OxyContin, Heroin, and other Opiates/Opioids on and off for the past couple weeks, and I had used the last of it on Sunday, the week of this report.  On Monday, I started getting some mild to somewhat moderate withdrawals which escalated on Tuesday.  I decided to stay home from class and rest, though I did agree to pick up my friend at school.  I took a Tranxene (a long-lasting Benzodiazepine) on the way, as I thought this would take away some of the anxiety. </p><p>Well, I picked him up, and we headed back to my house.  Once we got there, I decided to load up a bowl full of Wild Dagga flowers, as I thought this would also help with my withdrawals.  It just so happens that this was the same marble pipe that I had unsuccessfully tried smoking 5-MeO-DMT out of with foil on the screen.  That particular day, my friend had tried 5mgs, and I had tried the same.  All we got was a small, euphoric rush lasting but seconds.  I knew we had wasted it, so we decided to insufflate 8mgs together, and that is where my other 5-MeO-DMT trip report came from entitled 'Undefined, Life Changing'.</p><p>However, I started to smoke my Dagga, and I began to feel the subtle effects.  Once I got to the end of the pipe, I pushed the resin back towards the pipe hole so I could take one last hit.  I did, and then all of a sudden, my body started tingling all over and became numb.  My head felt as if I had not inhaled enough Oxygen, and I wondered if I had even breathed in between hits of the Wild Dagga.  I stood up to shake it off, and my heart started racing.  I felt the feeling of my mind fading, and I mean fast.  I thought I was dying.  The feeling reminded me of what I always pictured death to be like.  I mean, unless death happens immediately, there has to be some feeling in the body and mind.  I pictured it to be this fading away lasting but seconds to a minute, and that it would cause a profound feeling of fear.  Then, my body would just 'shut down.'  This is exactly how I felt.  I saw the infamous 'white light' that everyone speaks of when talking about 5-MeO-DMT experiences.  My room had just disappeared in front of my eyes, and my body felt as if it was nonexistent.  Then, all of a sudden, I remembered; 'Oh my God!  That 5-MeO-DMT must have still been in the pipe!'   </p><p>As soon as I realized what was going on I felt a feeling of relief, and I was able to enjoy the rest of the experience as if I had planned it.  As the feeling wore down, or should I say 'as God dropped me from the sky,' I began to feel a very profound feeling of being touched by God.  My eyes filled with tears, and I broke down.  It was the most beautiful experience I have ever had.  ..No visuals, no twisting of perception, just a straight connection to Absolute Beauty (God). </p><p>Overall, I believe this wasn't an accident, but I had not planned it nor expected it in any way.  The fact that we had ever tried to smoke 5-MeO-DMT from that pipe never crossed my mind.  However, I feel as if this was meant to happen.  In some way, this showed me something that I embrace that keeps me imprisoned in life.  My addiction to Opiates/Opioids.  It showed me that it needs to end, and it needs to end now before I end up surrendering my life to it like so many of my friends have.  I am very thankful for this experience, and indeed, I will never forget it.  The dose could have been anywhere between 1 to 10mgs, though I expect that it was at least 5mgs or more.</p>",
 "year": "2004",
 "id": "38218",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-02T07:00:00.000Z",
 "views": "14157",
 "dose": {}
}
