{
 "id": 3823,
 "title": "Not a Thing",
 "date": {
  "submission": "2004-07-05T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "anonymous",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "smoked",
   "substance": "Heimia salicifolia",
   "form": "dried"
  }
 ],
 "report": [
  "My friend and I had bought some of this at a local head shop earlier in the week along with some salvia divinorum. The night before we had both smoked the salvia and had very rewarding experiences, so we went into this with high hopes.",
  "Now, I know the recomended form of consumption of Sinicuichi is a tea but being a little lazy, we decided to just smoke it instead. I have, however, read of other instances of this being smoked and experiencing the same effects as the tea.",
  "We're staying at my parents' house for the time being, until we can get an apartment. They are very open minded people and they have no qualms about us doing this, so there was no concern about 'getting caught'. We went into my friend's room and proceeded to clean some Sinicuichi. I then rolled a joint and we lit up.",
  "The smoke wasn't as harsh as I thought (a little sweet) but it did leave a bad aftertaste. Midway through the joint, I went to get a glass of water to wash down the acrid aftertaste. After we finished the joint, we then smoked 4 more large bowls of the stuff in a pipe. My friend didn't feel a thing and I hardly felt anything myself. We had on some soft Pink Floyd and Beatles going, and on one song I thought I experienced some auditory hallucination (sounded like I was outside of a club listening to blaring music inside) but it might have just been a poor quality track.",
  "I was very dissapointed after reading mostly good reports (minus the cramps and nausea). I will try to brew some tea just to see if that does anything, but for a first time smoker of Sinicuichi, I feel it has let me down. :("
 ],
 "erowid": {
  "id": "26819",
  "citation": " anonymous. \"Not a Thing: experience with Heimia salicifolia (ID 26819)\". Erowid.org. Jul 5, 2004. erowid.org/exp/26819",
  "substance": "Heimia salicifolia",
  "views": "14144"
 }
}
