{
 "title": "When True and False Collide - An Ode to LSD",
 "author": "amittlmr",
 "citation": " amittlmr. \"When True and False Collide - An Ode to LSD: experience with LSD (ID 38273)\". Erowid.org. Dec 4, 2004. erowid.org/exp/38273",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>Many a time have I taken the plunge into Timothy Leary's magnificent pool.  The difference is that no matter how many times I dive into that same pond, I never know how deep it goes. </p><p>A while ago, a friend and I each had about 4 hits of high-powered blotter acid.  It was actually a birthday present from him to me.  So the day we decided to drop, we had called Matt over to babysit us.  We kept talking wonderful things about my birthday the next day, and it had put me in such a phenomenal mood.  Matt arrives and we each put our 1/2 inch by 1/2 inch square on our tongues, and wait.  Patiently we wait.  So patiently in fact that we had begun to think the worst about the expensive paper that rested firmly on our tongues.</p><p>Then it began.</p><p>I walked over to the sink and remembered thinking that the draining water looked more than a little funny.  I turned to Ben and at the same time, he turned to me.  We gave each other that look of intimate knowledge that this wait had not been for naught.  We smiled, walked outside, and smoked a cigarette.  The sun was setting, but that word is all too common.  The sun was no longer setting.  The sun was dancing, playing, and surrounding us with its mighty warmth.  It was embracing us with the colorful horizon.  All we could do was lie down on the porch and stare.  We stared for hours at the sky.  Stars were slowly brought into view on the backs of other constellations.  I saw Leo frolic with the hunter, Orion.  Scorpio left the big dipper in search of the next hapless soul to walk by. </p><p>I could see things move, patterns shift, and new shapes envelope the world around me.  However, this time I wasn't as interested in these beautiful visions as I normally was.  This time I wanted more, I was getting more, and wished that all could feel how happy I was, then and there.  Ben was the same way.  I thought for hours we had been having conversations and listening to the most beautiful music ever played by man.  Every word he said was in tune with mine.  Our words played off each other like instruments in an orchestra, the perfect accompaniment to each other.  Such peace, such blissful harmony.</p><p>Matt came outside to check on us relatively often, but he was never really worried.  He knew the better safe than sorry rule.  Just knowing that I had a friend who cared enough to be my babysitter was enough. </p><p>By the time the LSD had peaked, plateaued, peaked, and plateaued once more, I realized that my temporary bliss was finally coming to its halt.  The motion around me slowed to a lull.  The colors were no longer showing off their splendor, but had now wrapped themselves around me.  The music had dwindled to a muffled tune, but never quite went away.  Instead it kept repeating itself, as if searching for something yet undone, unheard.  I could hear the rhythm, and feel it's drumbeat. </p><p>I closed my eyes and thought.</p><p>Words began to offer themselves to me from the mouths of great poets of long times past.  Homer added his philosophy, Faulkner leant me his strength, and TS Eliot gave me his poetic grasp of our language.</p><p>I opened my eyes and found a notebook.  I began to write these words with the fervor of the great men.  They had become my muses.  They inspired me to put down all I could think to say, because otherwise it would've been lost.  An hour passes by going at D-Lysergic speeds and I read what I have written.  A smile spans the entirety of my face.  I race down the stairs and began to read aloud the poem that had just come forth:</p><p>Tonight, I walk the stars again.</p><p>Wander my way past heaven.</p><p>Throughout the skies and outerspace,</p><p>I step up to my lonely place.</p><p>Against the laws, and deep within,</p><p>I parlay into that wonderful sin.</p><p>Where truths are false,</p><p>And false is true.</p><p>And no one knows but you.</p><p>Where colors change and eyes will shift</p><p>and you can watch continents drift</p><p>I think, 'But is it real?'</p><p>I scream, 'It seems so real!'</p><p>My tongue burning from dots before,</p><p>But I cannot taste it anymore.</p><p>We think. We feel. We breathe.</p><p>We lie awake and seethe.</p><p>Can we feel it changing us?</p><p>Does it tear in half our minds' axis?</p><p>Then our mouth and minds dissolve,</p><p>Crying and flying and feelings resolve.</p><p>Purer thoughts and clean absolve.</p><p>Drive us to the point that we evolve.</p><p>And then faces change, one by one,</p><p>To the father, the spirit, his only son.</p><p>'It is a religion,' Timothy had said.</p><p>And now the sky turns red, and walls have bled.</p><p>Emily tells us, 'It is a cleaver of the mind,'</p><p>Something that excels beyond this grand design,</p><p>Through a dot, a plane, a space, then time.</p><p>Let me be the first to welcome you,</p><p>To a non-linear dimension, friend.</p><p>With this one tiny droplet I can send</p><p>A man to his furthest depths.</p><p>And he will come back again.</p><p>Through the fire sermon, a game of chess,</p><p>And a burial of the dead,</p><p>One can split in two halves, a thought in their own head.</p><p>'We should listen to what the thunder said,'</p><p>Thomas Stearns had told us.</p><p>So the spinning ends, the light is real once more.</p><p>We can no longer see our music as we could before.</p><p>And although we still may feel it, we still may know</p><p>We still may never discover how deep feelings can go.</p><p>I hear the approval come from the two members of my audience, and a deafening applaud by the poets who had offered me the means to say exactly how I had felt for so long.  I bowed to them; they ought not bow to me.</p><p>I slept hard that night with vivid, pleasant dreams, because I guess that LSD-25 is the stuff that dreams are made of.</p>",
 "year": "2004",
 "id": "38273",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-04T08:00:00.000Z",
 "views": "7233"
}
