{
 "title": "Smokable Ayahuasca",
 "author": "Da Numie",
 "citation": " Da Numie. \"Smokable Ayahuasca: experience with Anadenanthera peregrina (Yopo), Syrian Rue & Cannabis (ID 38281)\". Erowid.org. Feb 27, 2008. erowid.org/exp/38281",
 "substance": "Anadenanthera peregrina (Yopo), Syrian Rue & Cannabis",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Ginkgo biloba",
   "(daily)",
   "",
   "0.5 g",
   "smoked",
   "Anadenanthera peregrina",
   "(powder / crystals)",
   "",
   "0.5 g",
   "smoked",
   "Syrian Rue",
   "(powder / crystals)",
   "",
   "0.5 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "38281",
   "Male",
   "",
   "Not Given",
   "Feb 27, 2008",
   "11354",
   " "
  ]
 ],
 "report": "<p>A friend of mine I had not seen in a while approached me in the mall whilst I was eating my lunch. Long ago, he had spoken to me about a mysterious drug called DMT. His descriptions were vague, but he was persistent in urging me to find it, as I, at the time, was the person you came to when you needed something other than coke, speed, or pills.</p><p>I had never heard of it, but as years passed, I read several books on the subject, & one glorious trip to a festival in North Carolina, I met a gentleman that announced to me that he had DMT! I did not get to try it at the show, but before I left, he gave me several dose to take home. I & my friends tried it & loved it, but one hit remained, which brings us back to the gentleman that interrupted my lunch. 'How are you doing,' I asked, 'It's been a while. And ah, oh yeah, you remember that DynaMiTe drug we talked about years back? Well, I have some.'</p><p>He met me at my house soon after & I gave him the last hit. He was gracious. He offered me some yopo seeds in return. I gladly accepted, & he showed me how to prepare them. He warned me that when he smoked them alone, it did not do much, but when mixed with rue powder, it was very powerful. I took his advice & mixed half powdered rue & half powdered yopo & put them on top of some cannabis. It had a very Christmas-like flavor. After 3 hits, I felt my hands & chest tingle like with Mother Salvia. I noticed the walls were rippling in front of me, as if they were liquid. I smoked more. After 5 hits, I felt energy rushing all through my body. It made me sick to my stomache & I had to lay down.</p><p>When I closed my eyes, I saw steps leading into the ceiling. They opened up into doors, & I was pushed through. EVERYTHING was in there. It's hard to explain. It is not clear to me now. Checker boards warped & bent like an Escher drawing. There were large african-american women there that were teasing me. I prayed out to be healed of my ailments. Things became very holy. I saw the real world as a 3-D interactive curtain. I was now behind it. Reality had become a pop-up book I could open & close with my eyes.</p><p>As I came down, my bed felt like heaven, & when the visions were over, it was like they all just walked through a door & closed it behind them. All of the visions seemed to be predominantly red & morphed from image to image at such a speed that I was difficult to retain even a fraction of the experience. I was left feeling loving & saint-like. Still, I feel holy.</p>"
}
