{
 "title": "On Autopilot",
 "author": "orphencider",
 "citation": " orphencider. \"On Autopilot: experience with DXM (ID 3828)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3828",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Recently, after having used DXM several times, I decided to splurge and go for a bigger dose. I picked up 3 packets of sucrets extra strength cough lozenges that had 900mg of DXM between them. I took 600mg (36 tablets) and a friend of mine who'd never tried it before had 300mg (18 tablets). Unfortunately I couldn't find anything that had a higher concentration of DXM per tablet, but it was good enough and went down with reasonable ease.</p><p>I experienced the usual coming up effects; slight nausea and the sensation that my head was being compressed gently as if I was wearing a baseball cap. We drove around for a while then went to my friends house and listened to some really trippy music with a strobe light on. Eventually we got around popping in Fear and Loathing in Las Vegas (which I think was a mistake) The movie started and I began slowly losing my sense of where when and who I was. By the time we were a few minutes into the movie I was totally gone (about an hour after dosing up).  I seemed to get caught in a bit of a loop. My perception would change to something and then I would perceive that as being where I had always been. I would be sitting somewhere, for instance, then suddenly something in my mind would snap and I'd start over again and everything looked qualitatively different in an unexplainable way. Once I went to the bathroom because I thought I was going to be sick and when I was in the bathroom I had no idea when I had actually left and gone to the bathroom or how I had gotten there. Even though I was probably only in there for a few minutes, it felt like I had been there all night. When I went back to the room where my friends were watching the movie everything looked different, as if I was there on a different day at a different time in a different life. I guess the easiest way to explain it would be to say that my physical vision was intact (although rather stuttered and blurry) and the invisible elements - the where, when and why that were being seen through some hideous ever-changing kaleidoscope.</p><p>Somewhere along the way (probably about two hours in) I began losing larger and larger periods of time. I would snap to and wonder where I was and what was going on and how I got where I was (and bother my sober friend by repeatedly asking him these questions!) This was the first significant difference I noticed between 300mg and 600mg. Every time I noticed the movie that we were watching it would have advanced significantly (in the order of 10-15 minutes). I'm not sure what happened in between these portions but I can only assume I was staring off in a catatonic stupor or just plain vegging out. It was around this time too that I began to realize that I was going to die. I was afraid at first, well, terrified actually. It wasn't an urgent feeling, just a realization that I was going to die tonight because I had overdosed. I told my friends that I was going to die and they laughed at me. My entire life seemed to appear in a new light and a different philosophy of people unveiled itself to me. I thought of what my parents would think and my friends and everyone I knew and I realized that it wasn't really going to matter after all. It became apparent that I take life's pressures far to seriously and I endow too many people positions of superiority over me in my minds eye. I was satisfied with this, but still felt a bit overwhelmed by my impending destiny.</p><p>I didn't realize how much I'd gone under till we turned the lights on and went to get a drink. I was like an airliner pilot on a coffee break with my body on autopilot. My body seemed to walk itself (teetering all the way) down the curved staircase and into the kitchen as if some primitive subroutine was struggling at this new task of directing it. My own voice was far away from me as well. It felt as though my existence had been spliced and my higher mental functions resided far away from this now in control simpleton. Then (much to my amusement) my body jumped around in circles and laughed without my direction! I was witnessing this kind of behavior but was unable to control it at all.</p><p>It was around then that we decided to call it a night (although it was still fairly early) My sober friend and I got into his van and began to drive home (a 1/2 hour drive). My friend told me I talked to him all the way home, but on the way I remember only actually consciously talking several times. Every time I snapped to I'd start talking about things I'd already talked about (not having any recollection of the previous few minutes of conversation).</p><p>When I got in my house I had pronounced double vision (my pupils must have been the size of dimes) Light really hurt my eyes. I found it easier to navigate dark rooms than ones with the lights on. Time dilation increased to absurd proportions. The next ten minutes lasted hours. I</p><p>had to go to the bathroom, but wasn't able to coordinate myself to do so. I stumbled back and forth through my house forgetting where I was going and wondering where my friends had gone then realizing that they were 1/2 hour away then wondering where they went again. This kept on and even got worse. I couldn't sleep because my heart was racing insanely and I got the impression that I was going to die again. I tried to go on my computer but the screen was bulging and was way to intense for me to even look at. After a few more eternal hours I managed to go to sleep.</p><p>Overall it was an enjoyable experience. Neither the nausea at the beginning nor the delusion at the end was enough to dampen the enjoyable aspects in the middle. The 1-2 hour 'zone' in the middle of DXM trips truly rocks, it's like a mellowed out ecstasy drunkenness. Of course, it's not something worth dying for and I'm not sure I'd ever do 600mg again after the ride I went on.</p>",
 "year": "2000",
 "id": "3828",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-26T08:00:00.000Z",
 "views": "9000"
}
