{
 "title": "Strong Wakefulness",
 "author": "James",
 "citation": " James. \"Strong Wakefulness: experience with DMAE (ID 38328)\". Erowid.org. Jun 13, 2007. erowid.org/exp/38328",
 "substance": "DMAE",
 "bodyweight": "150 lb",
 "report": "<p>Several months ago, I became interested in 'smart drugs'.  I noticed that DMAE was cheaply available (10 cents for a 260 mg dose) at a nearby vitamin retailer.  I had read a range of information about the effects of DMAE, everything from memory and cognitive enhancing abilities to less of a need for sleep as well as increased vividness in dreaming.  I was especially intrigued by needing less sleep, as I have always needed a lot of sleep (too much for my rigorous schedule).  The increased dreaming vividness also interested me, as I am a lucid dreamer. </p><p>I decided on a dose of 130mg in the morning and 130mg in the afternoon.  The first day I used it, I noticed marked wakefulness. I was impressed, though I was wary of placebo effects.  I noticed no difference in dreaming this night.  The next day, the effects were even more powerful.  Five minutes after I had woken up, I felt as if I had been awake for hours, something that is extremely unusual for me.  I felt completely on top of things and ready to conquer the day.  As the day progressed, things got even better.  I felt extremely good.  I had an incredible amount of positive energy that made me want to dash up to everyone I liked and shake their hands. </p><p>Fortunately, I had complete control over my actions, so I only acted like a maniac around my friends, who all thought it was very entertaining.  When I had to sit down in class, I had no trouble decelerating myself and focusing on the material.  Needless to say, by this point I was sure the effects were not placebo and I was very impressed. </p><p>I should also mention that I definitely did have enhanced lucid dreaming, and I especially noticed that it was much easier to keep the dream from fading away (something I tend to have trouble with). </p><p>This energy reached a peak on the fourth or fifth day of taking the DMAE.  After that, the effects gradually wore off until they were more or less gone after about three weeks.  At this point, I wondered whether the initial effects had simply been placebo, and I stopped taking the DMAE.  Fortunately, I can say that I felt no crash. </p><p>Two weeks later, I had a big day ahead of me and I had not gotten much sleep at all.  I decided to give the DMAE another try; this time 260 mg in the morning.  Sure enough, it worked like magic.  I was incredibly awake through all my classes and felt really good the entire day.  I had some amazing lucid dreams that night for the first time in at least a month.  The increased energy actually continued to last throughout the next day, gradually tapering off as the day progressed. </p><p>Here are my conclusions:  DMAE definitely does work.  I can't say that it necessarily increased my cognitive abilities or focus, though it certainly made it very easy to stay awake and enhanced my mood.  It also definitely helped with lucid dreaming.  I will continue to use DMAE but only on occasion when I do not get much sleep and have a tough day ahead.</p>",
 "year": "2004",
 "id": "38328",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-13T07:00:00.000Z",
 "views": "11345",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "260 mg",
   "administration": "oral",
   "substance": "DMAE",
   "form": "(daily)"
  }
 }
}
