{
 "id": 3836,
 "title": "Trichohuasca",
 "date": {
  "submission": "2004-08-24T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Saper Vedere",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "6 in",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(extract)"
  }
 ],
 "report": [
  "The MAOI used was 3g Rue in tea form; the amount of cactus was 6' (3' dia).  The resultant trip was equal in intensity to perhaps 4 microdots and had a duration of no less than 12 hours.",
  "prep:",
  "3gm of Peganum Harmala were ground to powder in a coffee grinder and simmered for 10 minutes in a solution of 6gm ascorbic acid/100mL water.  The mixture was strained then honey was added, and finally it was left to chill in the refrigerator.",
  "6' of Trichocereus Pachanoi 3' in diameter was cleaned by removing the inner core and spines only (cuticle remained).  These chunks were frozen overnight and then chopped in a blender along with a little acidified water (~200mL,pH=3).  This was strained, the liquid collected and the solids returned to the blender for another round with more water.  This was done three times total and at the end the solid remains were of a surprisingly small size.  The liquid/froth was in the amount of 1000mL.  This was frozen and then thawed to break the bubbles.",
  "exp:",
  "11:50 - Drink rue tea.  Yuck!  This is much worse tasting than cactus juice.",
  "12:00 - Drink first of four 250mL cups of cactus juice.",
  "12:10 - Drink second cup.  Before I do this, I am already feeling the first cup.  Yeah! It's that quick.",
  "12:30 - Third cup.  Had to wait awhile on that one due to the bloated/full feeling.",
  "12:40 - Final cup.  I really only drank 3/4 of this one.",
  "12:50 -  *snap*  I was feeling it before, but I felt a major head change here, 10 minutes after my final cup.",
  " 1:00 - Pupil check and we have distinct dilation.",
  " 1:20 - Here my notes simply say 'BOOM.'  The ramp up was dramatic.  This is where the trip began and I stopped making notes.  The come-up was delightful yet short lived.  The plateau was broad, expansive and long lasting.  The quality of the experience was undeniable:  it was authentic, organic, intelligent.",
  "Sight and sound were equally seductive.  Bodily, I felt great, although I would not describe it as orgasmic or even ecstatic.  Many times I realized that my eyelids had fluttered closed and I was just wrapped up in a feeling.  We went to the beach for the sunset and everything was so true.  After 10+ years of psychedelic use, I have found a new favorite.  This stuff is very much like 2CB and 2CT7 only better.  Maybe I just allowed myself to enjoy it more due to the natural source.",
  "9:00 - This is where I realized that I had stepped down a notch.  The mirror showed that the dilation had diminished somewhat, but the effects were still pronounced.  In fact my notes reflect that at...",
  "12:00 - I wrote down 'STRONG' and at...",
  " 1:30 - I wrote down 'music'  The music had me all wound up (DI.fm: Chillout)",
  " 3:00 - Drift beautifully into sleep.",
  "I never felt nauseous although there was some intestinal gas, however.  Next time I will boil the liquid down to just one cup.  There were no high blood pressure or pulse problems.  I never felt emotionally or mentally out of balance, but my wife did (she took 6' without MAOI).  She 'couldn't get comfortable' and made remarks like, 'A person must need a really strong mind to enjoy this,' and 'I'm just not ready to face myself as totally as this cactus is asking me to.'  I am thankful that we tripped at different times on this because she was a lot more fun to be around when she was sober.  To be fair, I have considerable experience with a variety of psychedelics at high doses, while she has only used ecstasy and LSD at low doses.  Besides, I think if she had done the full dose things would have turned out great for her.",
  "In conclusion, Pedro + Rue works very well for me.  I cannot imagine ever wanting more out of a trip, but I know there is further to go.  9' or 12' would probably be ok, but 18' + MAOI would most certainly involve quite a bit of squirming.  6' + MAOI was _definitely plenty_ for my first time."
 ],
 "erowid": {
  "id": "26855",
  "citation": " Saper Vedere. \"Trichohuasca: experience with Cacti - T. pachanoi & Syrian Rue (ID 26855)\". Erowid.org. Aug 24, 2004. erowid.org/exp/26855",
  "substance": "Cacti - T. pachanoi & Syrian Rue",
  "views": "17221"
 }
}
