{
 "title": "A Good Mix!",
 "author": "Jamie",
 "citation": " Jamie. \"A Good Mix!: experience with Ecstasy & Cannabis (ID 384)\". Erowid.org. Jun 13, 2000. erowid.org/exp/384",
 "substance": "Ecstasy & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I normally wouldn't bother to submit a story to something like this, but after reading some of the experiences, i felt i had something to share. It was about a week ago, and i was going to do E with my boyfriend, who had done it before, and my friend who hadn't. I was generally used to the effects and new what to expect. About 35 minutes after ingesting 1 and 1/2 pills, the feeling hit me quicker than ever. The E was extremely good, and it felt almost like the first time. The only problem with me on Ecstacy is that when I come down, I crash. I'm extremely restless, and don't know what to do with myself. This time, when I began to come down, I smoked part of a joint to calm myself down. When the high began to hit me, I immediately felt better. I went down the hall with my friend (this was in my dorm) to go to the bathroom. Everything seemed normal, I was laughing and drying my hands. As I walked down the hallway towards my room, a sudden rush came over me. When I got to the room, suddenly my ears popped, I got lightheaded, and almost passed out. As I lay on the bed, I started to freak out, because I didn't know what was wrong - I felt so wierd. But then, as I looked at the ceiling, I realized I knew what was happening to me. I was tripping. It felt just like as if I had been doing shrooms, only the images weren't as vivid. However, it was different. Faces changed into thousands of different faces, and I found I could change something just by thinking about it. I am convinced that smoking marijuana while on ecstacy highly increases hallucinations and makes for a much better experience.</p>",
 "year": "2000",
 "id": "384",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2000-06-13T07:00:00.000Z",
 "views": "9060",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
