{
 "id": 3842,
 "title": "Cure to Brain Ailment",
 "date": {
  "submission": "2003-09-16T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dr. Experiment",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1200",
    "grams": 1.2
   },
   "administration": "oral",
   "substance": "Lecithin",
   "form": "daily"
  }
 ],
 "report": [
  "After smoking incredible amounts of cannabis with high THC levels, I have found my mind in a constant wonder and worry.  This caused me to get severly depressed and I soon became dellusional.  I felt like I forgot how to respond to anything said to me, this was a very frightning situation.  Looking for a solution I turned to many pills starting off with regular vitamins.  With no success I went on to DMAE pills which helped slightly with my fatigue, but without any sure cure I kept looking.  I soon began taking some 5-HTP pills which didn't really seem to help me all to much. I finally came to Lecithin, which is a precursor to acetylcholine. ",
  "After taking 1200 mg per day I began to see a huge difference.  My thoughts were more complete and my memory improved drastically.  After taking Lecithin you actually feel the effects, unlike vitamins were you never really know if it worked.  While I am on Lecithin my thoughts aren't so negative and judgemental.  I can shift my attention to multiple things and talking to poeple has gotten easier.",
  "Even though it has helped it wears off after about 5 hours and you kind of feel a buzz for about another 2 hours.  You can take it at any time but if you want to benifit from the mood enhancement I would take it in the morning.  Although it has helped I still feel something missing, but I can live without because it is no where close to what it once was.  I am now looking into Tyrosine which is supposed to be a precursor to dopamine.  It is ggod for quitting cocaine, or marijuana addiction.  Lecithin and Tyrosine can be found at a local drug store for the cheap price of about $10 for 100 pills"
 ],
 "erowid": {
  "id": "26876",
  "citation": " Dr. Experiment. \"Cure to Brain Ailment: experience with Lecithin (ID 26876)\". Erowid.org. Sep 16, 2003. erowid.org/exp/26876",
  "substance": "Lecithin",
  "views": "21824"
 }
}
