{
 "title": "Nearly Transcendental, But Not Quite",
 "author": "The Bush Doctor",
 "citation": " The Bush Doctor. \"Nearly Transcendental, But Not Quite: experience with Salvia divinorum (5x extract) & Cannabis (ID 38429)\". Erowid.org. Jun 22, 2007. erowid.org/exp/38429",
 "substance": "Salvia divinorum (5x extract) & Cannabis",
 "bodyweight": "195 lb",
 "report": "<p>I tried Salvia for the first time this evening. I will break this report down into three sections: Pre Salvia experience, salvia experience, post salvia experience.</p><p>PRE SALVIA</p><p>I'm 24 years old and I have used inebriants for the past seven years. I am in graduate school and I have smoked marijuana casually for five years. I started drinking when I was seventeen, I started smoking marijuana when I was 19 and I first tried mushrooms when I was 21. I drink once a week. I smoke MJ once a week. And I consume mushrooms (always with friends) about once every six months. I don't mind smoking pot by myself, but drinking alone is absolutely not cool. I also would not try mushrooms by myself either. I guess I'm a social, casual drug user.</p><p>I believe pre-state of mind is important when assessing affects of a substance. On a life happiness scale of 1=stranded on an island with Michael Jackson to a 10=Total Bliss, I'm about 8.5. Happy most of the time. The following is influenced, without a doubt, by my setting. It must be considered in the following context: I was alone, in my room, of stable mind, and fully prepared to use Salvia.</p><p>SALVIA EXPERIENCE</p><p>I bought a 1g bag from a local store, brought it home and placed a small pinch (eight of these doses would probably finish the bag) on top of some dry, mid grade MJ in a one hit, glass pipe.</p><p>T=0--I turned out the lights, lit a candle, put on some chill music (The Orb), and laid down on my bed and surrounded myself with pillows. I did not have a sitter and decided that on my first try I would do it by myself.</p><p>T+45 sec--First Hit: medium sized; dark and deep smoke; I waited to feel the effects. My body was the first to go. I felt a white, buzzing through my arms and legs, and I had an urge to twist my upper body in half arcs. I consciously tried to determine the first psychoactive effects but none were perceptible, and if so only mildly. I probably could have held a conversation and physically functioned at about 75% capacity. I could have walked to the kitchen, but I couldn't have driven a car; I might have been able to ride a bike. Whenever I would blink my eyes green tracers shot out from two black focal points. Noticeable closed eye visuals are vaguely geometric, tunnel-like.</p><p>T+4min--Second Hit: Immediately after the 2nd hit, body effects are pronounced. Now my body really feels like buzzing. Almost like sitting in a quiet, vibrating chair. At the same time I'm warm, heavy, sleepy, and rhythmic. I am perfectly comfortable. I am compelled to close my eyes and breath at a constant pace. Once my eyes are open, I still know that I am laying on a bed, I can look at everything in my room and understand what it is. It is much like MJ in this respect. When high, looking at a car can seem strange, but I still know I'm looking at a car. With mushrooms I might look at a car and not even understand what a car is, or what one does with a car. My hands are slightly sweating.</p><p>T+6min--I sit up and feel like blasting words onto a page. I am extremely concentrated on the pen in my hand. Because it's dark, I can't see what I'm writing. Physically, it is not difficult to write, and I notice increased spontaneity. My thoughts are going everywhere and I am extremely happy.</p><p>T+10min--It feels like I'm nearing my peak, more of a mound with Salvia. Rather than a rush up and down, say with Nitrous, it seems like a one minute ascension, one minute summit, and a longer descension. At the most intense feeling (again, about a minute) conversation would have been extremely difficult. Think about talking like Max Hedroom and you know what I mean. Standing or walking would have been almost impossible without help.</p><p>T+20min--Most immediate effects are receding. I am pretty close to normal both in physical sensation and mindstate. Any residual effects at this point could be from MJ. I start jotting things down on paper to write this report. Because I consciously tried during the experience to take note of all effects, the recall after the experience wasn't that difficult.</p><p>POST SALVIA</p><p>Salvia wouldn't seem to be a social psychoactive, from my brief experience. I would not smoke Salvia and head to a dance party or bar. The benefits of trying salvia in a group setting are debatable. Salvia made me: quiet, internally concentrated, centered, happy, warm, slow, dizzy, comfortable. Salvia would not have allowed to stand up in front of a crowd and tell a story. I also would not drive or do anything requiring a lot of concentration.</p><p>Finally, from my experience, I would offer that Salvia was not transcendent. That's okay. I wasn't looking for ego death or all that crazy jazz. However, I had only a 5x extract, and inhaled only twice. A more powerful extract and a more intake could radically alter the experience.</p>",
 "year": "2004",
 "id": "38429",
 "gender": "Male",
 "timestamp": "2007-06-22T07:00:00.000Z",
 "views": "2750",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  },
  "1": {
   "time": " T+ 4:00",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
