{
 "title": "A Waste of Time",
 "author": "Heruka",
 "citation": " Heruka. \"A Waste of Time: experience with 2C-I (ID 38462)\". Erowid.org. Apr 6, 2005. erowid.org/exp/38462",
 "substance": "2C-I",
 "bodyweight": "190 lb",
 "report": [
  "<p>In days long past, my wife and I spent many, many hours getting to know each other with the help of large doses of very clean and strong mdma. The ensuing 20 years haven't offered many  opportunities to investigate other compounds, but every so often something new will come our way and we'll give it a try.",
  "100 mg of 2C-I as a tan powder was added to 10 ml of sterile H2O in a sterile test tube. Heat was gently added and the mixture went into solution at about 150 degrees F. Using a graduated syringe, two 2ml doses of 20 mg each were drawn up and taken orally by each of us.",
  "T+ 75 min: first alert.",
  "T+ 90 min: strong +2 which quickly progressed to a manageable +3 with 'busy' open and closed-eye visuals and remained at this level for the next two hours.",
  "At the end, our assessment was that this substance wasn't worth the bother: though the body load was minimal and neither of us felt any particular physical or emotional discomfort, it felt shallow and lacked any particular 'hook' to draw us in and make it more interesting. The sensory/aesthetic dimension was not even slightly enhanced: Keith Jarrett's 'Koln Concert' sounded neutral and uninspiring. Thought processes were slightly speeded up, but without any special clarity or insight. Erotically, nothing much going on for either of us, though it felt nice to cuddle. In short, I felt as though my ego boundaries and consensus reality were intact throughout and that boosting the dose wouldn't take us any deeper, only add to the hallucinations and the feeling of having taken some strange chemical.",
  "T+6 hrs: At this point, most of the effects have worn off and we talk for a while, then watch 'Buffy' and drink a six-pack of beer. We fall asleep without difficulty and wake eight hours later feeling a bit ennervated and with only a mild hangover from the beer. Now, the following morning, neither of us feels the slightest desire either to repeat the experience or to recommend it to anyone else.</p>"
 ],
 "year": "2004",
 "id": "38462",
 "gender": "Male",
 "views": "6071",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(liquid)"
  },
  {
   "time": " T+ 6:00",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  }
 ],
 "submissionDate": "2005-04-06T07:00:00.000Z"
}
