{
 "title": "Am So Glad I Found You",
 "author": "trip2live",
 "citation": " trip2live. \"Am So Glad I Found You: experience with 2C-I & Cannabis (ID 38472)\". Erowid.org. Mar 25, 2005. erowid.org/exp/38472",
 "substance": "2C-I & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "22 mg",
  "oral",
  "2C-I",
  "",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Through the years I have had the privilege of experiencing many different types of substances.  They are all unique, have brought something new to the table, and can never really be compared.  Reading the reports on 2C-I I thought I was prepared for what would happen by constantly trying to draw comparisons with LSD and MDMA, but it was neither of the two and again I realized that it is what it is, which is 2C-I.  </p><p>I have experimented with 18-22mg on five different occasions.  I enjoy it alone as I love to hang out with myself, because part of my objective is self realization (once with 2 friends and once with girlfriend, who loved it on only 14mg). Contradictory to other hallucinogens, I recommend a full stomach.  I didnt on the first time and I got sick, but maybe it was because it was my bodys first encounter with it, but since I have eaten before the other 4 times I am not completely sure I just think it helps.  It also seems to make the come up smoother and longer.   This is longer than an hour on a little food and can easily be two hours before its full blown effects are taking place.  Cannabis has always been present, but that pretty much goes as a given around here. </p><p>I have only taken it at night and would like to try it in the day.  Experiences lasted until I feel asleep (between 6-8 hours), which was really easy, thoughts became dreams, there was no transition to speak of.  The experiences have been wonderful, the next day is great, no hangover to speak of really.  A night of drinking would put me in much worse shape.  Being outside is mysterious, the moon, not by any type of planning, has been full on four of my five experiences and was wonderful to look at and talk to.  I realize how thankful I am for being given this experience, it is truly a gift, and acknowledge every prior experience has led up to this, We have no other source than that which have been given the moon tells me as I smoke a cigarette and I feel my consciousness expand infinitely.  I close my eyes, feeling engulfed in the light being reflected from the sun, awaken minutes later with tears running down my face and I do everything I can to resist from falling to my knees. What a gift.</p><p>2CI is deep; it flows through the body differently than any other substance.  It affects the brain in only a way that 2C-I can.  Dont take it on a bad day, dont take it if you are not strong minded, dont take it to get fucked up, take it to grow, take it to gain knowledge and understanding.  Treat it as the teacher and yourself as the student.  It humbles time and time again. I love what 2CI has brought to my life.  Please treat it with respect.  It is gentle and respectful.  I think it would be wonderful as a combo with MDMA and hope to try this sometime.</p>",
 "year": "2004",
 "id": "38472",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-03-25T08:00:00.000Z",
 "views": "8138",
 "dose": {}
}
