{
 "id": 3849,
 "title": "Injecting Cocaine",
 "date": {
  "submission": "2001-08-26T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Snowdog26",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "0.25",
    "quantity": "0.25"
   },
   "administration": "IM",
   "substance": "Cocaine"
  }
 ],
 "report": [
  "I'd chipped around with coke, but until I'd injected some, I'd never known its complete effects.  Injecting coke is completely different than snorting.  I've heard that smoking crack is similar, the same tinnitus (ringing in the ears), but I've never gotten that high off smoking, nor trusted anyone who could score that urban trash, nor liked having to score the way crackheads score--one piece at a time.  I'd done time in prison for psilocybin, so my connections were good.  I prefered to score an ounce at at a time, sell off my cost plus a slight profit.  Then, I'd acquire a box of fresh needles, sterile cotton balls, distilled water, and a clean spoon.",
  "Shooting coke is a progressive vice.  When you're young, stupid, and the coke's good, a very little amount will send you over the edge.  As your tolerance builds, and your experience in the altered universe of coke dementia increases, one finds themselves able to quell the panic of immediate onset.  The rush of a fresh shot insights panic to the layman; but the experienced user wants to ride the cliff, to risk missteping into overdose.  To hear the 'train', the aluminum sound of the world being crushed--like the 'green room' of surfing, the sound of water on fire with the tap running slightly in the bathroom.  To look at death, to think that if I just stop concentrating, I might die; that's the buzz.  It's the urban shaman, the risk of death....stupid and exhilarating. ",
  "I don't recommend shooting ANYTHING...to anyone.  First, it's bad karma.  Secondly, I'd hate to condemn someone else to the craving nightmares and the sick game of wanting something SO EMPTY.  I know that, regardless, some will push the envelope and want to try 'The Forbidden'.  So, all those other little rich kids (you know who you are), at least follow these rules if you're going to do it:",
  "1.  Fresh needles.  One use and then bend the needle, recap and put in an empty liquid detergent container that will be duct-taped later so some poor guy, only doing his job, won't get a bad surprise.",
  "2.  If possible, try it with an experienced user. ",
  "3.  Try a test shot before trying to 'shoot the moon.' Why overdose when the second shot can be The Shit?",
  "4.  Don't turn anyone on.  The first 20 times you do it, you think you've found something great that the world should know about.  If there was ever a forbidden fruit that most people should avoid, it's this bullshit.  Don't turn Suzy Sorority girl on to it either; she'll get busted and narc, overdose and die, or whore herself for a hit....who needs the hassle?"
 ],
 "erowid": {
  "id": "269",
  "citation": " Snowdog26. \"Injecting Cocaine: experience with Cocaine (ID 269)\". Erowid.org. Aug 26, 2001. erowid.org/exp/269",
  "substance": "Cocaine",
  "views": "110393"
 }
}
