{
 "title": "Too Much Hype",
 "author": "Bengt",
 "citation": " Bengt. \"Too Much Hype: experience with Cocaine (ID 38512)\". Erowid.org. Jun 25, 2007. erowid.org/exp/38512",
 "substance": "Cocaine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>This was my third time trying coke. With my first experience I had bought a gram and a friend of mine cut some lines up. I snorted a very small line and within minutes was feeling very talkative and had warm body rushes, my throat was also completely numb, but nothing a cheaper pill wouldn't have done for longer (my friend also commented that this was the strongest coke he had ever had). That night I felt sick to my stomach and had no desire to try (or at least pay for) coke again.</p><p>A year later and I was at a friends house where a kid was cutting up lines for free. I resisted the offer for most of the night, sitting in a basement coked out with a bunch of guys just doesn't appeal to me very much. Just before I left to head to a party I accepted a couple lines. At the party I was very talkative and felt like I had a lot of caffeine in my system, also I was able to drink a lot of alcohol without any ill effects, which just decreased my inhibitions even more so. It definitely wasn't as strong as my first experience. It wore off, no ill effects and no desire for more.</p><p>A few days ago I got off work and met up with a friend of mine. I rode with him and his buddy to get a 'teener' (gram), and since they offered some to me for free, I accepted a small line. Again, same effects. It simply felt like I was over-caffeinated, although I was surprisingly relaxed. Normally I don't like rap music that much, but I was very appreciative of the creativity of the lyrics that were playing in the car. I know it's irresponsible to drive, but we finished the gram just driving around enjoying the music. Each time my friend would cut a line he would give me another small line at my request. Since it was free, and since I was feeling rather good, I accepted. I will admit that with this experience I was enjoying the coke, but again, it wasn't anything special, I was just enjoying the moment. Since we had coke in our possession, it was too hard to resist just doing another line.</p><p>Towards the end of the gram, I was actually irritated that I was getting cut a smaller line than my friends, and when that thought entered my head I was shocked and I had to mentally slow myself down and realize I was better than that. After that, I was fine... we finished the gram, and although my friends brought up the idea of getting more I had absolutely no desire to. We smoked some weed (which only gave me a strange head buzz) and that helped the comedown. I went home, ate some food, and fell asleep with no problems.</p><p>So I learned a few things about coke. First off, I think there's way too much hype surrounding it. The effects aren't that impressive, especially for the money I pay. In fact, I would never actually pay for coke again, but if someone offered it for free I would probably take it just for the hell of it, set/setting pending. With my latest experience, we just kept doing it just because it was there.  Each experience I had was inconsistent in terms of quality.</p><p>Overall, in my opinion, it's not that big of a deal.</p>",
 "year": "2004",
 "id": "38512",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "2129"
}
