{
 "title": "It Puts the 'T' in Trip",
 "author": "AdultsAndChildren",
 "citation": " AdultsAndChildren. \"It Puts the 'T' in Trip: experience with Salvia divinorum (15x extract) (ID 38567)\". Erowid.org. Feb 26, 2008. erowid.org/exp/38567",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "127 lb",
 "header": [
  [
   "DOSE:",
   "4 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "report": "<p>I had skipped out on flipping some burgers and went to my friends house for another mindless session of getting 'fucked' up. I passed on the nitrous and marijuana- went straight for the salvia. Sitting down now, taking in the first two hits. I feel more aware and alert. Also a new feeling of being able to learn alot of information in a very short amount of time, just a very pleasant familiar feeling. deja vu? Now about 30 seconds later I smoked the last two hits, which will do-me-in quite quickly.</p><p>With a table in front of me, three or four 2 dimensional figures dance and float on top and over, comming back again. I take note of their very cartoon like colors. All of this happened in about 15 seconds after the last hit. Then, not thinking logically, I want to join them in their 'dance'. As I get up, my head and eyes separate from my vision and I find my self seeing thru a third person perspective. I can see how stupid I look laughing and losing my balance.</p><p>By now I lost all logical thought and everything seems so playful and easy. In this very simple world with no depth and flat, 2 dimensional surroundings, no one could harm me. I won whatever prize there was to win, I conquered the frenzy of giants and basically I was 'it'. I was on-top of the world. Well, that was until an unknown being came to me. In the form of sound. I couldn't see anything at all. My vision cut out. It took my hand as we turned many corners. It felt like we were spinning, going around and around these sharp but turn-able corners made out of this noise, a very loud noise. This little event quickly drained off and like a little boy ripping shrink-wrapping off a brand new toy, I felt reality and all that I knew was real just rip away into this complete blank void of nothing.</p><p>Then, just like someone cutting a hole into a closed box, A red-ish liquid, breathable liquid, fills this void that is my world and everything I know, destroying my new found reality. Holding on to an unknown object I float about aimlessly until the object melts onto my body and weights me down, like gravity. Now I'm walking around in this world with a tint of red. I'm walking with a man whose telling/giving me, like a gift of some sort, knowledge. Knowledge that I feel that I shouldn't know. Now I'm trying to ignore him covering my ears and walking faster but there's no stopping him, he keeps up with me and his voice gets louder. Everything he speaks just keeps 'topping' the last, getting more and more interesting and intense, until it all builds up and he speaks of something so profound and forbidden that everything including me just collapses and fold into it's self.</p><p>I feel like I don't exist anymore, in-fact, at this point, nothing exists anymore. There is nothing at all. Not even a void or something that would be recognized as something. It had no name, because it can't. It was absolute nothing. That's as best as I can explain it. From then on, it faded out, getting less and less intense, like the end of a movie almost. I got back rational thought and my vision. I was still just sitting there, holding my pipe.</p><p>----------------------------------------------------------</p><p>This is probably the most intense and memorable salvia experience I've had. The whole thing clocked in at about 15 - 20 minutes. After that is another story because I was smoking cannabis and 5meo dmt, a little nitrous too. Anyway, all-in-all it was great and a very good way to kick everything off that day.</p>",
 "year": "2004",
 "id": "38567",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-26T08:00:00.000Z",
 "views": "3067"
}
