{
 "title": "Morning Glory at the Beach",
 "author": "jman",
 "citation": " jman. \"Morning Glory at the Beach: experience with LSA (ID 3856)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3856",
 "substance": "LSA",
 "bodyweight": "175 lb",
 "report": "<p>My friend and I wanted to try tripping on a Beautiful Sat. Morning. We launched off into town in search of the seeds. We had to go to a couple of stores before we found packets that were specifically marked untreated on the labels. There were several varieties of the glories to choose from. Having read the FAQ we decided on the heavenly blues. 3 packets each. The brand escapes me at this point but they came in a yellow packet and were from Holland. The lady at the shop gave us a strange look as we bought 8 packs. It was the off season for planting, but there was no problem buying them.</p><p>We took them home and used a mortar and pistil to grind up the seeds. Each pack contained about 50 seeds. We took three packs crushed them and put the crushed material into a glass of water. Repeated this procedure for my buddys dose. We let the material soak for about  and hour stirring occasionally. The majority of the gunk and seed debris separated and sunk to the bottom of the glass. The mixture was an off yellow cloudy liquid. It didnt smell unpleasant. We sipped at the stuff avoiding the sludge at the bottom. The taste was not at all bitter or unpleasant. It was actually kind of earthy. Almost like a very weak unsweetened tea. I noticed a slight tingle on the tip of my tongue shortly after drinking the stuff. The debris was discarded.</p><p>We left shortly after and picked up a sober friend and headed out to the beach. We took the seed mixture around 2 PM. We hit the beach around 4 or so.</p><p>Onset occurred in about 45-60 min. and started with an uncomfortable (but not unbearable) feeling in the stomach accompanied by a mushroomy drowsiness. We both had a bit of anxiety and mild discomfort for about 1/2 an hour. (note: later experiences have revealed that a small 10mg dosage of diphenhydramine negated the negative effects of onset).</p><p>Coming up and peak happened in waves. The dreamy quality fading into a strangely narcotic sort of state. We both felt pleasant. The emotional state was somewhat less intense but similar to mushrooms. The really strange thing about LSA is that neither of us had the really strange reeling thoughts that usually come with pot, acid and shrooms. Our judgment didnt seem impaired and our thought processes were for the most part fairly normal, and our emotions were fairly normal. There was a heavy body load, dreamy narcotic. Enhanced colors and edges, no movement or trails to speak of. It was like having the full body effect of a hallucinogen including reality separation with out loosing your noodle at all.</p><p>It came in increasing waves for about the next 4 hours. We went home and decided to eat more.</p><p>We crushed up and ate 2 more packs with out any water this time. The same effects occurred as with the water solution but came on stronger with more stomach discomfort. Pot increased the effects dramatically at the end of the night.</p><p>We both slept well and felt OK the next day. I had a headache, which could have been from not drinking enough water the previous day. All in all it was a pleasant experience. I have talked to other folks who have gotten the treated seeds and have had terrible effect form them so I am careful. It is also worth noting that I take 20 Mg. of Paxil a day for mood control. LSD and Mushrooms are dulled by this drug, however LSA didnt seem to be affected.</p>",
 "year": "2000",
 "id": "3856",
 "gender": "Male",
 "timestamp": "2001-12-26T08:00:00.000Z",
 "views": "46732",
 "dose": [
  {
   "time": "0",
   "amount": "150 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  },
  {
   "time": " T+ 4:00",
   "amount": "100 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  }
 ]
}
