{
 "title": "Bad Crazyness and Bad Gas!",
 "author": "Gauifenesin Hater",
 "citation": " Gauifenesin Hater. \"Bad Crazyness and Bad Gas!: experience with DXM with Guaifenesin & Pseudoephedrine (ID 38592)\". Erowid.org. Jan 30, 2008. erowid.org/exp/38592",
 "substance": "DXM with Guaifenesin & Pseudoephedrine",
 "bodyweight": "138 lb",
 "header": [
  "DOSE:",
  "260 ml",
  "oral",
  "DXM",
  "(liquid)"
 ],
 "report": "<p>I have robo tripped before and had some really wild times (good and bad) but this last trip was just plain stupid, irresponsible, and painful. I decided that I should take some tussin for my aching muscles that night, but the tussin had Gauifenesin in it (Robitussin CF I think).</p><p>The trip went great at first. Music sounded very soothing, body felt wonderful, etc etc. Then I went to bed. Well, before that, I went under the covers and looked into the darkness, catching glimpses of minor hallucinations. Then as I tried to drift off to sleep, my stomach expanded 3 times in size. The Gauifenesin had kicked in. The pain soon followed. I found that when I farted, I would deflate and feel better. So this made for a very disgusting, but yes I'll admit, funny night.</p><p>I looked at the clock and it said 4:30 as I went to the bathroom, which was a very interesting and disorientating journey in itself. When I returned to bed, I saw my body still sleeping. This was the dissociative effect in full swing. I thought, ha, look at that sack of farting crap just lying there. I couldn't stop laughing at this. After letting a huge one rip, my stomach deflated down to normal size, and I felt good again. Trying to ignore the smell, I looked at my clock, and it now read 12:30! All of this had taken place in one hour, but the clock had read 4:30 before. I drifted off to sleep. Next day I felt slightly buzzed and calm/spacey in church.</p>",
 "year": "2004",
 "id": "38592",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-30T08:00:00.000Z",
 "views": "8210",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "260 ml",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
