{
 "id": 3862,
 "title": "Not Very Potent, Until I Fell Asleep",
 "date": {
  "submission": "2001-11-13T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "slice",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "dried"
  }
 ],
 "report": [
  "I've tried salvia several times now after ordering several ounces from an online source. Unfortunately I think I've discovered that I'm not very susceptible to salvia's effects and will probably have to use an extract to go any further. What has happened as a result, however, is maybe more interesting than the full effects! The first few times I smoke the dried salvia leaves(1/2 - 3/4 gram) The effects were really a lot like marijuanna for the first bit, or so I thought. After a couple times I began to notice a definite pattern. My consciousness would always shift to a childhood mentality.",
  "Once, when I was in a dark room I felt like I did when I was four or five. I heard the names of my siblings and had an image of my kitchen; not vivid mind you, just a feeling that these were the only important things, or the only things in my life for that matter! I thought through things and truly felt like I was a small child with my whole life ahead of me!",
  "Another time I was outside sitting by a campfire (during the day though, I couldn't wait). After smoking the salvia I first observed a symmetry wherever I looked. Perfect divisions between objects in my visual field seemed evident. Everything looked like it was perfectly balanced. After that I felt like I was in a studio under lights spinning on a disc and that everything around me wasn't real. And of course I heard/imagined my mother telling me things and I would oblige her. This was all in my imagination, my visual field was technically intact, but it seemed very easy to slip into a daydreaming state. Both of these trips were very short lived maybe only 10-15 minutes.",
  "The most profound effect I had with salvia was one just recently when I took it off the dusty shelf and decided to give it another go with a different method. Knowing that I wasn't very susceptible to the effects I figured I'd smoke an entire gram of it before I went to sleep. Afterwards my room was full of smoke so I opened the window and it slowly mixed out. I was still choking on it as I slipped in a trance. About an hour later I realized I'd been tossing and turning constantly, no matter how I placed myself on my bed I still felt like I was on a dangerous angle and about to roll off. Eventually I fell asleep after learning to ignore the feeling.",
  "What happened next was totally mind boggling. It was exciting and fun and REAL. It was a vivid dream that was totally seamless. There were no breaks at all - I remembered the whole thing the next day from start to finish - the start being what I was thinking just before I dozed off! It started off with me being chased by the police (sort of a manifestation of my daily fears I suppose) but for the rest of the night I was being chased in cars, on foot through shopping malls (in which I stopped at an arcade and played a game... I won!) And jumping off bridges. I couple of times they actually caught me but I always managed to get away. It wasn't scary at all, it was completely real and exciting. I even remember once in it I said to myself 'there's no way this is a dream, it has to be real ... just look at all the detail' then I looked down [it was raining] and the ground was soggy. I heard my foot squish in the ground. Then a lightening bolt struck right beside me (well... guess I wasn't feeling too clever then.",
  "In retrospect, most of the detail seemed to come from conversations I had had over the past few days and things I had been thinking of before I fell asleep. I can only imagine what would happen if I had been deeply engrossed in a novel before I went to sleep - perhaps I'd be integrated into some kind of continuing plot generated by my mind?",
  "Excited after the first night, I tried it again the next two days with similar (but, alas, less pronounced) effects. The lesson seems to be that its use in this manner should be infrequent to maintain the novelty.",
  "If I had to decide between taking sitting around and observing some weird perceptual shifts or the dreams, I'd pick the dreams. I've never experienced anything so exciting and real (well, outside of real life!)."
 ],
 "erowid": {
  "id": "2694",
  "citation": " slice. \"Not Very Potent, Until I Fell Asleep: experience with Salvia divinorum (ID 2694)\". Erowid.org. Nov 13, 2001. erowid.org/exp/2694",
  "substance": "Salvia divinorum",
  "views": "7237"
 }
}
