{
 "title": "The Collapse",
 "author": "Sam",
 "citation": " Sam. \"The Collapse: experience with Zaleplon (Sonata) (ID 38673)\". Erowid.org. May 26, 2006. erowid.org/exp/38673",
 "substance": "Zaleplon (Sonata)",
 "bodyweight": "115 lb",
 "report": "<p>A few years ago, before the DEA jumped on it (It's now a controlled substance), I was given a handful of samples. At first, I didn't notice anything that could give it recreational uses, nor did I take the time to find out. (I was very into amphetamines and other stimulants at the time.)</p><p>Now, years later, I was put on a Sonata by a skittish psychologist, who has problems prescribing anything controlled. My drug tastes have changed entirely, and so I decided to check into it. It looked like it'd be worth a try, considering it was being compared to Ambien, another non-benzodiazepine sleep aid. So one night I emptied 10mg onto a CD case, and blew it. I remember just sitting there, not really noticing anything but a very subtle pleasure feeling, and I was using a card to gather up the remaining powder.</p><p>Then, it crept up on me. I was sitting there, and I noticed how much fun I was having scraping up the powder.. My vision was very enclosed, and I just felt like I was having a very good, but very strange time. But by far the weirdest (And probably my favorite) effect of this drug, is its effect on thought patterns. Through my heavy use of this substance, it's amazed me how much little control I'll have over your thoughts, our realization that they're even my thoughts.</p><p>Anyhow, these effects only lasted me around 20 or 30 minutes, after which I went to sleep. One night, I decided to empty a record 30mg, and blow it all that once. The effects were quite different than my low dose experiences, and lasted much longer. A moderate sense of intoxication, and inebriation followed, for a much longer period of time.</p>",
 "year": "2004",
 "id": "38673",
 "gender": "Male",
 "timestamp": "2006-05-26T07:00:00.000Z",
 "views": "9129",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Pharms - Zaleplon",
   "form": "(ground / crushed)"
  }
 ]
}
