{
 "id": 3870,
 "title": "Snorting Sucks",
 "date": {
  "submission": "2003-11-25T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Not that crazy",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "10"
   },
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I did this with a buddy.  He wieghed 155 lb.",
  "We had both been no strangers to 5.  Both of us had prior experiences with smoking this substance, and to both of us it was a powerful experience.",
  "We had heard a rumor that insuffulating 5-Meo-DMT was a stronger trip and decided to try it out.  After reading that insuffulation was a less intense high we were both a little discouraged, but we proceeded.  We had also read a testimony about another 'traveller's' experience with insuffulation, who had done a 25mg dose.  He said that it was very overwhelming, so we approached with caution.",
  "Let us call ourselves travellers X and Y",
  "We began with a 10mg dose each.  It BURNED.  Drips were SICK.  We both established that we were NOT feeling anything for at least 5 min. into the experience.  We decided to close our eyes and listen to the music.  X noticed stranger subtle and anxious 'lingerings of a high' in the background.  Y confirmed this.  We both agreed that closing our eyes was 'trippier'.  Bodily sensations and heavy headedness were felt, only in very small amount.  No alterations of perception.",
  "Both feeling that we needed more to break threshold, we agreed to insuffulate 20mg more each.  That should be enough to break threshold, right?  Well... let's just see.",
  "Summary of the entire trip was this.  We both felt very warm, sweating, but our skin was cold to the touch.  Sounds were definately more vivid, something to be expected from 5-Meo-DMT.  More of the wierd 'shadow of a high' in the background constantly.  Y exclaimed that his throat was 'melting'.  X too felt this horrible drip result.  VERY minor visuals which were consciously recognized as plays of light and shadow.",
  "In conclusion, X and Y both decree that 5-Meo-DMT is meant to be smoked, or ingested with an MAOI if desired (READ ABOUT COMBINATION OF 5-Meo-DMT AND MAOI's BEFORE ATTEMPTING THIS).  If you wish to explore the true strength a 5-Meo-DMT experience, we both personally recommend smoking a 10-25mg dose.  Do NOT torch the powder, as the heat will destroy the substance, only vaporize it.  Then sit back and enjoy the ride.",
  "Snorting is just wasting a rare and expensive drug."
 ],
 "erowid": {
  "id": "26976",
  "citation": " Not that crazy. \"Snorting Sucks: experience with 5-MeO-DMT (ID 26976)\". Erowid.org. Nov 25, 2003. erowid.org/exp/26976",
  "substance": "5-MeO-DMT",
  "views": "9909"
 }
}
