{
 "title": "I'm an Addict",
 "author": "Penguin420",
 "citation": " Penguin420. \"I'm an Addict: experience with Paroxetine (Paxil) & Various (ID 38754)\". Erowid.org. May 22, 2008. erowid.org/exp/38754",
 "substance": "Paroxetine (Paxil) & Various",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Pharms - Paroxetine",
   "(daily)"
  ]
 ],
 "report": "<p>I diagnosed myself with social anxiety about a yr ago. I also suffer from some depression. Who doesn't? I had my doc hook me up with some paxil starting at 12.5mg a day for 9 days. The only effects were it was harder to sleep sometimes, nothin too bad. Doc upped me to 25mg a day for 9 more days, I still wasn't getting the best sleep but I start waking up with a strange buzz, even after I hadn't done shit the nights before. Things were changin throughout the day. Usually I didn't leave my house without gettin cleaned up, but I was finding myself caring less about my appearance and actions both. I was really changing to not give a fuck what ppl might be thinkin and shit.</p><p>I went back to the doc. I told him I was only feelin it a tiny bit so he upped me again to 36.5 for 2 weeks. I was sleeping better and feelin the shit work hardcore day to day</p><p>I really don't give a fuck about the world too much at this point. I got a general sense of 'Everything's gonna be OK.' Well I'll tell ya my life is not ok. I'm lookin at prison right now yet somehow I keep wakin up happy. It's a crazy drug. It's like a mild cannabis buzz throughout the whole day.</p><p>I went back to the doc and somehow talked him into 50mg a day. Man this shit is addicting. I can tell I'm on too much but I don't wanna lose my high. 50mg is what I'm still at right now, I've tried takin 75mg but it just fucks wit my head. It is a total buzz all day long. I smoke buds daily too so I usually manage to stay buzzin all day.</p><p>Paxil makes me more outgoing, and talkative. It's really a fun drug but I know I'm gonna have to ween off it at some point.</p><p>Real quick on drug interactions:</p><p>Paxil and cannabis = stronger and longer lasting effects. Every variety of bud simply seems more potent.</p><p>Paxil and DXM = pretty much the same trip but my energy level seems up alot more than when I wasn't on paxil.</p><p>Paxil and Alcohol = Sometimes I talk too much. I feel more violent as well. I'm never afraid of shit even when I should be.</p><p>Paxil and Shrooms = no difference same old crazy ass intense trip.</p>",
 "year": "2004",
 "id": "38754",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-22T07:00:00.000Z",
 "views": "12308"
}
