{
 "title": "An Extensive Six Months",
 "author": "Mj12",
 "citation": " Mj12. \"An Extensive Six Months: experience with Tramadol (ID 38773)\". Erowid.org. Jun 26, 2007. erowid.org/exp/38773",
 "substance": "Tramadol",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I've used Tramadol recreationally for over six months. I can't help but compare it to Aldous Huxley's mythical 'Soma' in his novel, Brave New World. What it truly excels at, for me, however, is as a rapid-onset anti-depressant, a social condiment, or the catalyst to a memorable rainy day in which nothing really extraordinary happened at all.</p><p>Even at the highest doses, the main problems with real opiates in general don't rear their head. Sociableness instead of apathy, affection instead of smacked-out bliss, projects turn to gravy, thoughts and emotions flow freely, negative thoughts or emotions are relegated to the back-burner for a day.</p><p>Perhaps the most striking thing I've found is Tramadol cannot really be abused. If I take more than four 50mg tablets within a 24 hour period, I will simply experience flu-like nausea. Recreationally, I found Tramadol is ideally taken every 36 hours, and no higher than 150mg. I find 100mg to be fine, all around, as the mood-lift is ideal for working/social conditions. With this regime, withdrawal was avoided completely.</p><p>If taken repeatedly, say, every 15 hours, the law of diminishing returns sets in, as well as some of the side-effects, such as irritability and lethargy, when dosage is finally lowered. re-.</p><p>A friend took one 50mg tablet, and experienced heavy nausea and pressure in the back of his head.</p>",
 "year": "2004",
 "id": "38773",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-26T07:00:00.000Z",
 "views": "3215",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ]
}
