{
 "id": 3880,
 "title": "Feels Like What It Is: Anesthetic",
 "date": {
  "submission": "2004-02-06T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ams",
  "gender": "Female",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Ate dinner at 7:30.",
  "At 10pm I did 1 thick line, 2 inches long, then laid on the living room floor with mats and pillows. Initially felt a lot like nitrous.",
  "Disassociative to the extreme. I was nearly paralyzed, and totally out of my body. You could have pulled out teeth, cut off a leg, I wouldnt have known. Basically, it felt like what it was: an anesthesia.",
  "Visions were quite dark (literally, not figuratively) and dull. Had been advised to keep light low (so we had lights off) but the result was visions being of extremely limited color scope. Mostly just shades of orange (from the glow of distant streetlights) and black.",
  "Hearing was VERY affected and fucked up. Who EVER decided to take this into social/club/rave scene? This makes absolutely no sense to me. I was totally out of my body, totally unable to hear, and totally unsocial and removed from those around me.",
  "Visions had both left to right motion (probably from light coming from sliding glass door on right) and upward (trees growing, women with their arms raised, babies being tossed up). Again, though: visions were dulled and not especially interesting.",
  "Some very bland thoughts passed by in the distance: Friend's new cell phone, what happened at work that day, etc. As if conscious brain was still puttering around in the background. I was uninterested in these thoughts, but noticed them.",
  "As Id read might happen, brain slipped into weird word play: ketter, ketting. Ketter, ketting.",
  "As much as I thought watching Fierce Grace (very good documentary about Ram Dass, intentional spirituality, etc.) before tripping would be an excellent set/setting choice, and would give my brain some great material to chew on, I was totally unable to reference or even recall the movie. All I could really remember of it during my trip was old man thinking.",
  "Despite carefully following instructions (no eating for 2.5 hours before, no moving, etc.), I still had a few waves of dizziness, and then got sick. Luckily, Id taken the advice of the book and had a bucket nearby. I was thankful I was prepared, and not upset or surprised by being sick, although it was a very strange sensation to feel myself come back into my body to vomit.",
  "Tripping partner was remarkably cognizant. Was able to do additional portion of line while I was unable to move, dealt with me being sick, went to go blow nose, was talking to me (granted, just a bit) about what he was experiencing, etc. Reported later that he was having intense experience -- but was definitely more functional than me.",
  "After being sick, I put my arms up over my head as reclined on the floor, and then...fell asleep! Must have been unconscious for some time (30 minutes?), because when I awoke, my shoulders were a bit stiff from having my arms in that weird position.",
  "After waking, was sick again. Stomach seized up rather violently. Clearly, the bod was saying 'that was enough, thanks.'",
  "Lay down again. Partner went to bed, I slept in living room until 3, then went to bed.",
  "Woke up around 7:30 am, talked some about the experience (me: it felt like an anesthesia. He: I had an intense experience, felt like he tapped into information network). Then back to sleep until 10:30.",
  "Very interesting time. Despite the small amount, my illness clearly indicated my low threshold, although like I said: it wasn't bad getting sick. I was prepared and accepted it as part of the process.",
  "I found the trip interesting only in the most academic of ways. It reminded me of being under anesthetic when I had my wisdom teeth removed. Didn't really appeal to me much...I was anesthetized, and didn't have particularly interesting thoughts or visions."
 ],
 "erowid": {
  "id": "27008",
  "citation": " ams. \"Feels Like What It Is: Anesthetic: experience with Ketamine (ID 27008)\". Erowid.org. Feb 6, 2004. erowid.org/exp/27008",
  "substance": "Ketamine",
  "views": "15016"
 }
}
