{
 "id": 3881,
 "title": "I Shouldn't Have Taken It  All At Once",
 "date": {
  "submission": "2001-11-28T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rochelle J.",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Well, I heard about Dramamine from my friend, and she had read lots of stuff about it, so I said, why not try it? It was a bad mistake. I took all 12 at once while driving and thought that it would take 1-2 hours to start working. It literally took about 20 minutes.",
  "I felt like I was high while driving, so I decided to go straight home. I would zone out very easily and it was hard to concentrate. I had to talk to my dad, and it was only 25 minutes after I had taken it, but it was barely impossible to act normal. I kept on forgetting what I was saying and what he was asking me. Then I went into my room and saw the jelly stuff on the walls that I've heard everyone sees. I started feeling very weird, and although all these stories may seem to sound somewhat cool, it wasn't at all. I went to the bathroom, and I heard my friend (who was on it too, but was in the room) calling my name. Then I heard my dad say my nickname. It really sounded like him. I almost said 'what?' but then I told myself that it wasn't real. Then I heard the news or something similar. I got really scared and ran back into my room.",
  "I told my friend I already hated this and it was just the beginning of my trip. I got really paranoid, so I decided to throw everything up, I heard the voices again in the bathroom while throwing up, and I would see stuff in the toilet bowl that would keep me entertained while still frightened. Then my friend came over, and he made me feel better. I should always have someone sober with me when doing it, cuz I think it will make me feel more safe. I also saw the carpet moving, and the reflection of a hand, which I thought was mine, but when I moved mine, that one didn't move. It was pretty scary.",
  "I did this about a week ago. That day, I told myself I would never do it again, but I sort of want to again, since I realize that I had a bad trip. Maybe next time I'll take the pills one by one instead of ingesting 12 at once. I didn't see any spiders, though my friend did, and the whole thing about music sounding better, I think it is true. I guess I can only learn something by trying it out myself. I learned to just go easy on it, not get scared, it will all go away eventually."
 ],
 "erowid": {
  "id": "2701",
  "citation": " Rochelle J.. \"I Shouldn't Have Taken It  All At Once: experience with Dimenhydrinate (Dramamine) (ID 2701)\". Erowid.org. Nov 28, 2001. erowid.org/exp/2701",
  "substance": "Dimenhydrinate (Dramamine)",
  "views": "22917"
 }
}
