{
 "title": "Study Aid",
 "author": "Sunshine",
 "citation": " Sunshine. \"Study Aid: experience with AMT (ID 38822)\". Erowid.org. Dec 20, 2006. erowid.org/exp/38822",
 "substance": "AMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "AMT",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2002",
   "38822",
   "Male",
   "",
   "Not Given",
   "Dec 20, 2006",
   "4523",
   " "
  ]
 ],
 "report": "<p>So finals were rolling around, and my University gives us students the luxury of 2 study days.</p><p>I had organic chemistry I at the time and, lacking Adderall, I decided that I'd attempt to use AMT as a study aid. This was back in the good ole days when it was legal.... ah those were the times.</p><p>Seemed a good idea: the first 6-8 hour amphetamine-like energy I figured could be well spent processing the magic of organic chemistry, with the second wave of the experience for some light philosophical adventures.</p><p>I had previously made 40 mg capsules (visually), so I took a quarter of one of them. Both measurements were visual, so the dose was probably greater than the 10 mgs, because I'm usually generous.</p><p>So I remember dosing around 9 AM or so. I walked down to the local pharmacy to get some munchies for studying... this was a good 15 minute walk. While in there I notice my stomach is doing the whole AMT thing, so I grab a ginger ale, this was before I knew ginger ale, at least Canada dry's version, lacks any ginger. Also grabbed some Cheezits.</p><p>So I get back to my apartment, a good hour has passed. I put my nose in the books. </p><p>And my theory was correct! I was intent on the reading, I was jumping from figure to figure, taking it all in. I killed the box of cheezits, which led to some GI problems...</p><p>About 3-4 hours later is where I ran into some trouble. Basically, the way I recount it is that I got way too optimistic about my situation. I didn't see the need to study anymore... I convinced myself I had learned all I needed to. And the outside world just looked so intriguing. </p><p>So I went for a walk. On this walk my ex-girlfriend called me... she was checking out new apartments (we had very recently broken up, and we had been living together). So I went up to the place and amused myself as they used me as their measuring device, because they forget a tape-measure.</p><p>I'm not sure what happened the rest of the night, but I don't think I got back to studying.</p><p>The following semester I did get a hold of some Adderall for the study days and it was much more effective... something like 7 hours of straight studying.</p><p>So, long story short, this was effective for the first 3-5 hours of the experience. When the second wave of the drug starts to kick in, however, I became extremely and convincingly optimistic (which I attribute to the drug)... thus losing motivation to study. </p><p>I did get a B+ in the class though. Not too shabby.</p>"
}
