{
 "id": 3883,
 "title": "Super Sobriety",
 "date": {
  "submission": "2006-08-27T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Roscoepico",
  "gender": "Male",
  "weight": 128
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "I have had visual and auditory hallucinations all my life, from childhood. I was never afraid to try any hallucinogenic drug due to my normal state. I routinely hallucinate without the use of drugs. I do not suffer HPPD, it started before I ever tried drugs.",
  "When I tried Salvia Divinorum I was sober. I had not used any drugs for more than 2 weeks prior to my first experience. I tried 10X in a bong packed with ice. I packed the bowl and smoked it, taking care to hold my breath for a full 20 seconds each time I filled my lungs. I smoked 5 bowls total the first time.",
  "The first major effect was a 'head rush' or the feeling of 'light headedness'. The rush lasted a few minutes after each bowl. After the rush I felt sober. I walked around the room and noticed that I was NOT hallucinating for the first time in many hears. After the fifth bowl I gave up on the Salvia. I then used Nitrous, but the result was boring with little effect.",
  "The next day and for 16 days I noticed that I was not hallucinating. 17 days after my first use of Salvia I began to have minor hallucinations. One month after my first use my hallucinations were back, but quite mild.",
  "I do not perceive alternate realities but I feel calm and entirely 'real'.",
  "I have tried Salvia a second time, last night, and had the same result. I had a craving to get 'high' last night. I smoked the Salvia and now have no desire for intoxicants. It was not an unpleasant experience at all."
 ],
 "erowid": {
  "id": "27017",
  "citation": " Roscoepico. \"Super Sobriety: experience with Salvia divinorum (10x extract) (ID 27017)\". Erowid.org. Aug 27, 2006. erowid.org/exp/27017",
  "substance": "Salvia divinorum (10x extract)",
  "views": "11596"
 }
}
