{
 "title": "Mild, But Interested to Try Again",
 "author": "Cactushead",
 "citation": " Cactushead. \"Mild, But Interested to Try Again: experience with 5-MeO-DALT (ID 38868)\". Erowid.org. Dec 27, 2004. erowid.org/exp/38868",
 "substance": "5-MeO-DALT",
 "bodyweight": "125 lb",
 "report": "<p>9:35- 10-20 mgs. Probably under 20, but I was not able to measure it accurately.</p><p>10:15- Feeling some awareness of having taken a substance. Difficult at this point to determine what the feelings actually are. Noticed slight trails, however, this could also be due to having taken 4-HO-DiPT several days ago.</p><p>10:40- Well, something is different, however, I really cannot tell what. It is apparent to me though that I have more energy than earlier I have been having fun moving around the apartment and dancing. There seems to be some subtle energy permeating through the air around me. It is in this ether that Im also noticing slight trails and after-images. Again, ever since I took the Iprocin, Ive been seeing a lot of after-images, so it could be attributed to that. Music may be sounding better somehow too. Or Im just more into it. Physically I feel nothing except for slightly being warm. Mentally, nothing astounding other than a slight alertness. Emotionally, I am noticing a slightly elevated mood.</p><p>12:00- Well, I feel like Im basically back down. Im still having some trails, but my energy is not apparent anymore. My roommate says he feels a little like hes drunk. I think were both gonna get ready to call it a night. This was a good first experience, but Ill want to up the dosage next time (I wanted to start on a low dose first though, to avoid any unwanted reactions.) I think this drug has a lot of potential, although I doubt it gets very visual.</p>",
 "year": "2004",
 "id": "38868",
 "gender": "Male",
 "timestamp": "2004-12-27T08:00:00.000Z",
 "views": "17766",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT"
  }
 }
}
