{
 "id": 3886,
 "title": "Beautiful, Enough Said",
 "date": {
  "submission": "2007-01-22T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "FearedAndLoathing",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "<p>Alright, This is my recaliction of my first LSD Trip ever. My past drug history includes, marijuana, alcohol, dimenhydrinate, and hydrocodone.",
  "I had been reading about acid, and wanting to try it for about a year, until recently when I met a friend who is able to get ahold of acid really easily. Anyways, I was finally in possesion of what he called the most 'potent' blotter that he ever had, and he is a full-blown acid head, so I knew this must be good. He said it was made from Silver Crystal, which is said to be 90+% pure. So he knew this blotter was at least 150UG or more.\r[Erowid Note: Claims of measured microgram dosages for LSD are usually unsupported. Quantitative measurements for LSD are very difficult to do and cannot be done casually. Without further detailed information about how the measurements were derived, it is reasonable to assume that most statements of microgram dosages of LSD on blotter or in microdots are either misinformed or overstated.]",
  "The Following is my notes as it happened, well at least until it kicked in. Thats were I have to recall all of the things that happened.",
  "9:40 - Fly Paper Blotter Acid, Place on Tounge - 1 Hit",
  "9:48 - Of Course, No Effects Yet, Listening to Some Grateful Dead",
  "9:57 - Anixous Feeling Surroundeds Me, Feeling Great",
  "10:05 - Body Energy, Anticipation, Not Tripping",
  "10:16 - Same",
  "10:23 - Still Same",
  "10:31 - Life Is Good, Still No Visuals",
  "10:45 - Watching the Beatles Yellow Submarine. Getting Pissed off, It still hasn't",
  "kicked in. Anticipation is overwhelming.",
  "11:05 - I think I got taken, this stuff isn't working.",
  "11:06 - Laying Down, Watching Yellow Submarine Still.",
  "11:15 - As soon as I stood up, The outer world had completely changed. Nothing is the same as it used to be.",
  "11:16 - Painting of Flowers in a vase on my wall is swaying, from side to side. The Flowers blooming and unblooming. The Carpet is breathing, with waves flowing through it. Walls are breathing. Everything has life. This is truely beautiful.",
  "11:22 - Totally immersed in this new world. Everything is breathing together. Flowers on couch are spreading and reaching towards the ceiling, blooming with immense form. Amazing.",
  "11:30 - Time displacement is insane.",
  "11:31 - Tracers, lots of tracers.",
  "Ok After this point, I can only remember certain things. So Yea, In no real order did these things happen.",
  "Eventually after watching the ceiling move in waves as if it were an ocean while watching the insane tracers of my hands moving and things I threw in the air for about a half hour, I Decided to get up and walk around the room to see what new visions I could discover throughout my bedroom. I walked around and began a mental conversation with the floor. Not talking out loud at all, just thinking in it's direction, and it answered my questions with indentations in the carpet.",
  "Next I began looking at yet another painting, this one melted and swirled at an insane rate of speed. I couldn't believe it, everything I ever wanted to happen when I tried acid, happened. The carpet was now swaying as if it were tall grass in the wind. Then it began to swirl and melt. I then needed to go to the bathroom and take a crap. This was quite the adventure. Everything in the bathroom had life, the floor, the sink, the shower, the cabinets, the walls, the decor. I attemped to read a magazine while sitting on the toliet, but to no avail, I couldn't concentrate on anything but the outside world that was so beautiful.",
  "For the next half hour or so I basically layed on my bed just looking around the room at the intense visuals. This was at 1am. I got paranoid all of a sudden that my parents might get up and come in. So I turned off my light. Layed in bed, and put some Grateful Dead on in my CD Player so I could lay there, and not make any noise or wake anyone up. The Music was soooooo beautiful, the sounds meshed togethor and the stories were acted out right in from of my eyes.",
  "This is were the deep thoughts began. Not the scary deep thoughts that some people expeirence. Rather deep thoughts that make you realize how lucky you are and how proud you should be to have the chance to trip. I thought of everything, everything beautiful, nature, my girlfriend, and music. I began a mental conversation with myself on the possibility that there is a god (I am a pretty strict atheist). Then soon enough that idea was negated as I thought about the TRUE scientific reason how we got here, and everything.",
  "I had intense visuals. Now in my bedroom I had some lights on, the light on my monitor, my clock, these type of things. All of a sudden when I began thinking about the existence of man, the room became totally black, then it hit, the Big Bang Theory was re-enacted. I was part of the universe, I was floating with the rest of the planets, and eventually I became a small organism, a bacterial life-form on earth. As time progressed I had formed into a mushroom. I was a mushroom. I started thinking about my girlfriend. Now another mushroom was part of the scence. It was her. Our roots became intwined and we were unseperatable. Then we grew from the mushrooms into humans, locked into each others arms. This was truely amazing, and made me appreciate my life.",
  "At about 2:30 I just wanted the trip to end. Well not the trip to end, but I wanted to sleep. I layed there with my eyes closed for awhile, realizing I'm not going to be sleeping tonight. I opened my eyes and everything was shrinking. Then the room began swirling and melting into me, like a whirlpool type effect. Then I melted into my bed, and then all of a sudden I was back in my room, everything normal again. I looked at the clock and the numbers were switching places, and shadows were still changing and moving and changing shaped. I closed my eyes, and laid there, listening to Built to Spill CD's.",
  "3:30 - The comedown was intensely fast. The LSD world just stopped, and the old world came back. No visuals, nothing left. I feel really weird.",
  "After that I attemped to sleep, but to no avail. I ended up just getting out of bed and eating breakfast. Then I felt empty, tired, lifeless. This soon passed, but my body was physically worn out, yet my mental state was better than ever before. I hadn't slept in some 30 hours. The rest of my day went by really fast, I eventually went to bed at around midnight, It had been 42 hours since I slept. I slept like a baby.",
  "In the end, LSD really changed my life, I realize how lucky I am to have the people in my life that I have, and how life is good. I felt like I had the expierence of seeing the world as It really is, an expierence few will ever have. I feel like a better person now. Wait no, I know I'm a better person now.</p>"
 ],
 "erowid": {
  "id": "27027",
  "citation": " FearedAndLoathing. \"Beautiful, Enough Said: experience with LSD (ID 27027)\". Erowid.org. Jan 22, 2007. erowid.org/exp/27027",
  "substance": "LSD",
  "views": "5250"
 }
}
