{
 "title": "Mom's Fox-Tacular Birthday Extravaganza",
 "author": "Smak",
 "citation": " Smak. \"Mom's Fox-Tacular Birthday Extravaganza: experience with 5-MeO-DiPT (ID 38871)\". Erowid.org. Sep 3, 2006. erowid.org/exp/38871",
 "substance": "5-MeO-DiPT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "insufflated",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>While waiting for a friend of mine to pick up some bud, I looked through my closet for some weird reason. I had been sober for about 2 days and was fiending out.</p><p>About a year ago a friend of mine from out of town brought a lot of foxy over, it was 2 gel caps tightly packed full of foxy. This was in December '03, its now December '04.</p><p>Anyway, back to the story. While looking through my closet, I found a pill bottle. Inside was one gel cap, with a small amount of  the crystal goodness left,  there was a hole in the pill, so some  was in the bottle too.</p><p>8:30 pm </p><p>Id invited a friend over to try it out, he had never tried it, and I havent done it for about a year. I got about what SEEMED to be 7 separate 15-20 mg piles out of the pill, and the remains in the bottle. I snorted 3, he snorted 3, and my brother snorted 1.</p><p>8:35 </p><p>Burns nose quite bad. my left eye [snort through left nostril] turns red and starts to water. The dripping takes effect, its extremely bad.</p><p>8:40 </p><p>Throat starts to burn, lots of saliva and shit, we go downstairs for some water, but it doesnt help.</p><p>8:45 </p><p>I throw up in the bathroom, and few more times after that outside/in the bathroom.</p><p>So, I snorted about 45-60 mg and so did my friend, my brother did about 15-20 mg.</p><p>8:55 </p><p>Me and j leave, hes driving for some strange reason. We already feel the effects coming on, time has no meaning, increased energy, slight muscle tension, etc.</p><p>9:00 </p><p>Id picked up some cash from an ATM machine, which was quite a journey... Im at another friends house to pick up some bud, when the foxy really starts to hit me. We're waiting in the car for him, and we both agree that it feels ALOT like 2c-I. This is weird, because the previous times Ive done foxy, Ive never felt like this, but Ive never snorted it before, only eaten it.</p><p>9:15 </p><p>I get home, my moms home early, my bro tells me to go upstairs. Im tripping major balls by this point. I have no idea what to do, so I just put all of my weed and shit up and run into the shower... I kept getting that weird everything is funny kind of feeling I get from shrooms and 2c-I, also the sense of touch is fucked up the ass, times 3. the water feels... I cant even explain, but it kicks ass. Id been seeing very intense color changes for the past 20 minutes. The water seems like its... some weird new unique color.</p><p>9:45 </p><p>Smoke a bowl.</p><p>10:00-11:00 </p><p>Watching TV is the only thing that makes me seem slightly sober. Family guy is on. I cant stop laughing, neither can my brother. he says it feels like the upper version of mushrooms, but he took a third of what I did, and its his first time on foxy.</p><p>Its now midnight and. I feel really nice, not tired at all. No longer tripping, but nowhere near sober. The mind is still fucked up and shit, you know?</p>",
 "year": "2004",
 "id": "38871",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-09-03T07:00:00.000Z",
 "views": "3527",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
