{
 "id": 3889,
 "title": "Dissociative Time",
 "date": {
  "submission": "2004-12-03T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Thor",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Not long ago, my brother-in law scored a dime or two of good reefer from a guy at work.  I had come to visit, and he mentioned that he's like to try it (being less experianced than myself). Lacking rolling papers, the only smoking apparatus I had was an old 'zeppelin' on the floor of my car. after sharing a few hits each, we were feeling pretty good, starting to get a little buzzed, and the strangest thing happened...time slowed down!  I'm not talking about normal slow stoned, this was serious.  From what my sister reports (she was sober, watching us), a normal 5 minutes seemed like 4-6 hours to us.  Our thought processes seemed extremely fast, but breaks in the conversation were unusually long. Overall, we were probably high for the better part of 5 hours, but I can't begin to describe how long it felt.  I've never experianced this effect from Cannabis. ",
  "Fortunately, the high was rather smooth, and not at all uncomfortable, but there were some strange side-effects that went along with it.  My bro got some serious munchies as a result of the stuff, and ate a whole jar of peanut butter.  I on the other hand had a single bite of chocolate cake, followed by the sensation that my mouth was 'glued shut' (BTW, the cake was REALLY GOOD!) the strange part is that my mouth was actually wide open, and my face was completely paralyzed. I found that I could neither move my jaw, nor feel anything touching my face during this time (an hour or two after smoking up).  I also felt very much disconnected from my hands, and motor dexterity in my fingers became sluggish, and delayed almost to the point of uselessness. these effects took about 3 hours to subside, and the next morning, I still felt somewhat stoned.   I'm wondering if this has happened to anyone else."
 ],
 "erowid": {
  "id": "27061",
  "citation": " Thor. \"Dissociative Time: experience with Cannabis (ID 27061)\". Erowid.org. Dec 3, 2004. erowid.org/exp/27061",
  "substance": "Cannabis",
  "views": "5890"
 }
}
