{
 "title": "Giant Peaches with Faces",
 "author": "Doug the Delinquent",
 "citation": " Doug the Delinquent. \"Giant Peaches with Faces: experience with Mushrooms (ID 389)\". Erowid.org. Jun 18, 2000. erowid.org/exp/389",
 "substance": "Mushrooms",
 "bodyweight": "80 kg",
 "header": [
  "DOSE:",
  "7.0 g",
  "oral",
  "Mushrooms",
  "(plant material)"
 ],
 "report": "<p>It was the summer before gr 11 and i had just gotten my own car.  It was time for a road trip.  Me and 5 other friends went to peach fest (an annual festival in penticton, bc, canada).  Peach Fest involved 10,000 young people going camping (or hoteling for the weaker)to a small town of interior BC and losing all inhibitions.  Nothing was planned except for tents, sleeping bags, a little food and some water. </p><p>Before leaving one of my friends said he had some mushrooms to sell to me for $20.  He had had an incident a few months back on them that had him fighting a couple of friends, breaking down and crying like a little baby, and vowing to never eat mushrooms again.  I had smoked quite a bit of pot in my day, but mushrooms was something i'd always thought about trying and never did.  So I bought for $20 roughy 8 grams of muschrooms, one half of which had been crushed to powder sometime during that night he spoke of. </p><p>We arrived in Penticton a little later than expected and luckily found a place to camp on the front lawn of a campsite owner.  After setting up the tent it was already 8 at night and it was time for something to be happening.  So i popped 7 grams of the mushrooms with some beer and waited for the effects.  Mushrooms were a foreign idea to me at the time.  7 grams didn't mean anything.  My friends who had some experience but very little didn't tell me anything about them or how much to take.  They thought i'd just aten a small palmfull.  I knew they made you hallucinate a bit, but that was all.  With some rum and daquiri mix (without ice and don't ask me why we were drinking it)  we headed to the strip of downtown penticton.  The mushrooms had begun to take effect.</p><p>My stomach had been bothering me for about a half hour.  I thought it was just the terrible alchohalic mix i was drinking.  The first thing that hit me was confusion.  Where are we going? What are we doing? Why can't i find anything in my pockets?  I soon became very aware of the awkward materiel of the clothes that i was wearing.  What the hell is this shirt made of?  By the time we'd hit downtown (acually clock time had lost all meaning to me by now so i couldn't say exactly how long it was till i started peaking) i was beginning to peak. </p><p>We all had our own seperate missions to complete before the night could get going.  I myself was already on my mission.  Finding out what was really happening to me.  I followed one friend while the other 3 split to get more beer.  I would later find out that splitting up wasn't a really good idea. I lost my friend within minutes.  A family coming out of a restaraunt asked me the time.  I must have looked like a psychopath when i looked up at them, and tried to figure out who they were and how did i know them?  Of course i'd never seen them before, but in this state i almost couldn't recognize myself.  So i just blurted out some inchorent statement about nothing, laughed, and continued on my way.  The pavement was no longer pavement, but a patterns on top of patterns of dead leaves sand and rocks. </p><p>Suddenly i could hear the friend that i'd lost yelling for me.  So i started to yell for him because i couldn't for the life of me figure out what direction the yelling was coming from.  Later i learned that was becuase there was noone trying to call me.  Across the street something caught my eye that abruptly stopped my yelling.  A vided mural on the wall that was attemting to brithgten up the town was moving.  The technicolor trumpet player stepped away from the wall a bit and his trumpet was now pointed toward me.  Little people or something vaguely representing them in multicolors were flowing from the wall and crawling into the end of this mans trumpet.  I knew i was on mushrooms, but couldn't believe that it was just the drugs causing this surreal momment. </p><p>Luckily for me my friend came by an unknown amount of time later and shook me.  I turned at him and asked him why he couldn't see what i was seeing and then he asked me how much of the bag i'd eaten.  I told him and he let me in on the fact that i'd eaten quite a lot compared to the norm and that was why i was hallucinating so much.  Then i asked him 'didn't we just have this conversation'.  I learned then too the de ja vu effect was also from the mushrooms and that we hadn't.  I would experience this several times before the end of the night. </p><p>I soon lost my friend again and forgot where i was supposed to meet him and everyone else and at what time.  I soon found myself in what i thought was a graveyard (again don't ask me why) and fell down.  The sky had turned on me.  The clouds were forming words and scentences that i couldn't read against the starlit night sky.  Who was trying to speak to me, and what are they trying to say?  Then the biggest trip of all happened.</p><p>One of the friends i went on  the trip with was a little person.  Wicked guy but you can never understand shit from him when he gets drunk.  So here i was lying on the gound and my midget friend steps over me and starts babbling about what i thought was a prophecy.  i started yelling, but soon calmed myself and tried to understand what the hell was happening.  It turned out i was lying on the front lawn of the town police station and had been laughing quite loudly for sometime with nobody around me. </p><p>My bud lead me around the back of the cop station where some friends were drinking beer on a park bench.  I was sure the gig was up.  Cops had camera's on us and had just been collecting information.  Any minute swat teams were going to swing down from the trees.  Thankfully i was with a bunch of drunk but relativly sane people who set me straight.  All the police officers were out patrolling due to the usual problems they have with this festival every year. </p><p>We headed to the beach and soon we were surrounded by people, most of them drunk and having a good time.  Myself on the other hand was having a hard time trying to figure out who's face it was on this giant peach.  It was actually a giant orange (those stands that serve drinks that was all closed up)  and it looked like it had a face that was raising it's eyebrow at me.  The sudden huge numbers of people was suprisingly not that hard to deal with, most likely because i knew somehow that they were all fucked and wouldn't notice me tripping in my own little world. </p><p>The next few hours would be countless hallucinations and distortions that i kept having to clarify with my companions to make sure they weren't real.  It was definatly a night i will never forget.  Since i have tried many other varieties of mush rooms (in smaller dosages but still enough) although i still don't know what kind it was i did this paticular night.  I have also learned to research new drugs a little before doing them alhtough i must admit not knowing whats coming to you is a whole other trip.</p><p>peace all</p>",
 "year": "2000",
 "id": "389",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-18T07:00:00.000Z",
 "views": "7258",
 "dose": {}
}
