{
 "title": "Very Mild, Certainly Not Psychedelic",
 "author": "Cactushead",
 "citation": " Cactushead. \"Very Mild, Certainly Not Psychedelic: experience with 4-HO-DiPT (ID 38901)\". Erowid.org. Aug 27, 2006. erowid.org/exp/38901",
 "substance": "4-HO-DiPT",
 "bodyweight": "",
 "report": [
  "<p>12:00- Down the hatch for two of my friends. They took 10mgs each.",
  "1:00- Both of my friends report an alertness. One of them reports slight anxiety.",
  "1:30- My friend B is reporting the following: Warmness in his body. A positive mood push. No real visuals other than slight lighting effects with eyes closed.  My other friend J-man reports feeling a slight buzz, as though he was about to trip on mushrooms, but it doesnt seem to be going anywhere. He seems somewhat disappointed at this point.",
  "2:00- More of the same. Nothing fancy. People are reporting very neutral reactions.",
  "2:30- B says that he would try this again, although he would want a higher dose. He says that I should be sure to mention how bad it tasted. My friend J says that he would not try it again because the money could be spent on mushrooms or acid instead (which he seems to find more rewarding.) Both claim that without much visual stimulation, and without much change in ones state of mind, this substance is not a very psychedelic tryptamine. I found there to be much more closed-eye-visuals than they got (and cooler ones than acid or shrooms), but I agree that it is not mind-expanding.",
  "I should note that I took only 5mg the other night and definitely noticed effects; specifically a positive mood push and also very nice CEVs. The trip lasted about 3 hours and I had no problems falling asleep. The next day I drank a lot of beer though, and used one of my Sonatas to fall asleep. When I awoke (2 days after the trip), I felt like I always do and went to class to take a test.",
  "Afterward, I drank some coffee and began to feel slightly off. Soon, I was feeling somewhat nauseas and having a lot of trails and trippy headspace. I went home, and took a nap, only to wake up tripping pretty hard. I was getting visuals very similar to when I took the 4-HO-DiPT, but was also hearing some voices and feeling a little anxious. Ive had flashbacks before, but they never bothered me until this one. Granted, I have taken LSD several times recently, and mushrooms, salvia, etc.",
  "I think its possible that the 4-HO-DiPT might have interacted with my brain, the booze, sleeping pill, caffeine, in a very unexpected manner. I felt fine several hours later, but at the time I was unhappy and startled. I dont expect that this will happen to B and J as well (since they havent been taking as many drugs as myself), but Ill be sure to post immediately if they experience the same thing.</p>"
 ],
 "year": "2004",
 "id": "38901",
 "gender": "Male",
 "views": "6435",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2006-08-27T07:00:00.000Z"
}
