{
 "title": "A Helping Hand",
 "author": "jonny s",
 "citation": " jonny s. \"A Helping Hand: experience with DMAE (ID 3891)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3891",
 "substance": "DMAE",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2000",
   "3891",
   "Male",
   "",
   "Not Given",
   "Dec 26, 2001",
   "17635",
   " "
  ]
 ],
 "report": "</p>\nBeing a poorly motivated student on a difficult science degree course, it seemed to me that I needed a helping hand in passing my exams. My mindset previous to starting the medication was one of apathy, depression, lack of any form of get up and go, late starts, moderate-heavey drinking, regular cannabis use etc etc etc. This is a pretty average description of how I behave when under any kind of pressure. I was also going through short bursts of more agitated, stressed-out, crockery-at-walls kind of moody outbursts from time to time too. </p><p>I'd never thought of trying out smart drugs before, but for whatever reason I thought I'd give DMAE a go, since all the articles I'd read agreed that it produced mental clarity, a reduced need for sleep (I was sleeping about 11 hours a day) and elevated mood. After the first two days of 200mg a day, I started to feel like I'd taken a really pleasant stimulant. The effect was not really like a drug experience at all, except for the overwealming talkativeness and uncontrollable grin. What is different about DMAE from small doses of amphetamine or cocaine  is being completely in touch with the world around. Mental clarity is exactly what was achieved; unlike any recreational drug, on DMAE I was far more able to learn and understand difficult mathematical constructs, even if previously I'd found them too daunting and too boring even to attempt. My outlook turned around to complete positivity, and I was as sociable as I'd ever been in my life. My friends all noticed the incredible changes which had taken place and were basically unnerved as they assumed it would all end in a crash-landing. I slept about three hours a night for the next few days, and continued to study hard, socialise and generally feel rather pleased with myself. I couldn't believe that what I thought would be a subtle, useful substance, if anything had turned out to be a permanent high. And then to wake up feeling fighting fit and raring to go after just three hours sleep...? This stuff was amazing.</p><p>Of course, these effects were never going to last forever. I slowly returned to a more stable mindstate by about day 8 or 9, but was well above my baseline state of mental and physical tiredness. I was sleeping more, and I started using some GHB too in the evenings when I didn't do drinking, and sometimes in small doses in the morning; the latter had very positive effects of a subtle increase in lucidity and confidence. </p><p>My exams went very well and I stopped taking the DMAE when they were over. I noticed the positive effects (which after this time were barely noticable) disappearing over a period of a few days, and felt pleased that there was no 'comedown'. I did start to feel fairly depressed again after a while which was no surprise to anyone. All in all DMAE gave me exactly what I needed: energy, clarity, ability to learn, sociability and positive outlook. It doesn't last forever, and won't have such startling effects again, but for that period in my life it was exactly what the smart doctor ordered.</p>"
}
