{
 "title": "Not For Everyone",
 "author": "Ace",
 "citation": " Ace. \"Not For Everyone: experience with Cocaine (ID 38912)\". Erowid.org. Mar 5, 2008. erowid.org/exp/38912",
 "substance": "Cocaine",
 "bodyweight": "125 lb",
 "report": "<p>I just wanted to say a little bit about my very first experience with cocaine. Now, before I tried drugs, cocaine never appealed to me, even after I tried other stuff, coke still never appealed to me. I said to myself: 'That is one drug I will never touch.'. Did I honor my promise? No. Basically, one of my best friends who is a coke addict said he really wanted to quit and that he might do it once more and asked if I wanted to try it. I figured, 'You only live once, I may never get the chance again.' I talked myself into it and prepared.</p><p>A few minutes after doing it, I was insane! But it was strange, because it was not like anybody said it would be like. In fact, my friend said he never seen anybody react like that before. I was a bit confused myself until I thought about it more today. Basically, coke speeds me up. It is the opposite of pot because that only slows me down and makes me mellow, but coke, no, it makes me full of electrical energy! The mental effects were not so bad at first but I think it was the body effects that made me so scared. I always heard bad things about coke and was nervous to do it, but too late. I think it was just things like breathing, swallowing, etc, they were a bit hard to do because I was so sped up on energy, it was so weird! Keep in mind that I have ADHD and can be pretty damn hyper anyways so this made me a jolt of electricity!</p><p>The thing is, the body effects made me paranoid wondering if I would harm myself physically or become an addict. Then it was like a million thoughts at once, I was trying to analyze each one but it was an information overload! Unlike pot, coke doesn't make things appeal to me and be as artistic. I was trying to view things differently and it just ended up in a huge mess. I started forgetting everything and just racing from thought to thought. Each thought that came to my mind, I said it aloud and then repeated it nervously so I would not overwork myself. The hyperactivity created a paranoia effect that, even though I knew everything would be okay, I still had emotions of fear, but sometimes I feel as if I was going overboard on purpose, but maybe not!</p><p>I needed to calm myself down, I was getting way to worked up, I didn't wanna hurt myself! I tried thinking of things I enjoyed, such as girls, music, art, etc, but it just made me spit out nouns and such that sounded like utter nonsense. It was really freaking my friend out at this point! I was just in a daze, I was insane! Was this supposed to happen? Am I normal? I asked myself those questions.</p><p>Trying to focus on things like video games, I could only do so for a minute before I was distracted. It felt like a million thoughts charged at once, all me trying to speak at the same time. All I remember is going into the garage with Nirvana playing in the background and me going completely nuts. Eventually, I was calming down and then for the rest of the night, I became very calm, to the point where even if I wanted to speak, I didn't, I just looked around in a daze and thought, trying to take it all in.</p><p>All I say is, I don't think I had the normal reaction, I doubt I will ever do it again, and I have heard a few people with minor similar reactions, but man, coke is not the thing for me probably... >_></p>",
 "year": "2004",
 "id": "38912",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-05T08:00:00.000Z",
 "views": "6860",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
