{
 "title": "Mexican Meals and Alarms",
 "author": "Zach",
 "citation": " Zach. \"Mexican Meals and Alarms: experience with Cannabis (ID 38926)\". Erowid.org. Mar 5, 2008. erowid.org/exp/38926",
 "substance": "Cannabis",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>It was the second time I had ever smoked, and according to my brother and his friend it was really good stuff. The three of us had just smoked a bowl when my friend had decided to pack another one, my bro was out, and I only got half way through it before my thought tightened and I could not take another hit. I was sitting down and commenting that I wasnt 'feeling it' yet, but right as I was standing up I was watching the trees behind us and they seemed to move up with me as if they were not connected to the ground, and I found it funny and then said to both my brother and our friend that it had just hit me.</p><p>We walked back into the house and I was still talking fine so I decided to call my dad. I was only 13 and he would totally disapprove of me smoking pot at any age and would be very hard on me if he found out. Right as I said I was going to call him my brother went into a different room and was doing something on the computer, and our friend went to go to the bathroom, so I was alone, everything was going fine and I hadnt noticed anything different in my speech or any physical changes either. My dad picked up the phone and I said hey dad whats up, we talked for a minute or two, then I asked if he could pick up some taco bell on the way home. He asked me what I wanted and right as I began to say what the order was, it hit me.</p><p>It hit me like a smack in the face.</p><p>My vision began to get distorted and everything slowed down to almost a stand still, I could not think, or hear anything other than what my dad and I were saying on the phone. I knew I had to finish the order so I said Two, no three, wait three is right...yea three steak quesadillas, one no sorry two wait one for our friend to so three crunchy cheesy gordita crunhces(totally messed up the name) and umm ahh a drink. Hey dad can I call you back? My dad replied in a way that he sounded pissed off and upset about something, he said, 'Yea Zach, why dont you call me back when you get everything straightened out' then he abruptly hung up the phone.</p><p>'He knows...Oh FUCK!, he knows!' is what I said, I immediately yelled to my brother that my dad knew I was high, and my brother said What? How? Naw man he doesnt. How would he? and I asked him if he heard the convo, and he said he did and I said something about how I was slurring my words and talking slow, and he said it was fine. I knew it wasnt, then I told our friend what happened, he laughed and said it was ok and to calm down. I was buggin out at this point, everything was bad. I was too high, I was paranoid, I was sure my dad knew, I had to call him back soon, and everything was moving sooo slow.</p><p>My brother advised in taking a shower, saying it would help in killing my high, and to try and eat some food. I had to call my dad back soon. I couldnt even talk correctly to my brother or our friend, so I practiced the order about three times to our my friend, and then called my dad back. I gave him the order and said I love you to him, and he still sounded really annoyed with me, and then said ok, Ill be over in a while then hung up with out saying anything else.</p><p>I couldnt handle what was going on so I went downstairs to take a shower. I took the shower, and while in there I was contemplating if I should ever smoke again. I was thinking about what I had got myself into, and was thinking I had ruined my entire life, I was scared and upset about everything that was happening I had a mental breakdown in the shower. I decided I would never smoke again. I walked up stairs with my high still at a peak point, told my friend and my brother I was done with smoking and crawled under the covers and tried to go to sleep.</p><p>I was having closed eyed visuals of a green mosaic spiral with a blue outlined red square in the center of this spiral. I opened my eyes and saw my friend sitting at the computer next to the bed I was in, and gasped out loud at the fact he had suddenly appeared there. I asked him if my dad was home yet, and he said no, and to calm down. I looked out the window and didnt see any cars outside then layed back down. My friend put some music on and the subwoofer was right by where my head was, and the songs bass was intense and made it feel like it was keeping me high. Then the song ended and everything went quiet for a minute. I fell asleep only to awake to pink floyds song time, with all the clocks and ticking and alarms going off at once after a minute or two of silence. It had awoken me, and scared me out of my mind.</p><p>After it woke me up all those thoughts about my dad knowing I was high came back and I felt sick to my stomach. I kept falling asleep and waking up every five minutes. I kept looking out the window then lying back down. I layed down for a while and finally fell asleep I guess, because the next time I got back up I went downstairs and there was the food on the table. My dad wasnt home, he just dropped the food off. It was the best tasting food I had ever had in my life. all the tastes were intensified and filled my whole mouth with spit making the dry mouth go away that I had for the past two or three hours. the high had finally gone away, and I walked back upstairs and talked to my brother about everything, and then said I guess I would smoke again. Then it just ended, the whole day just ended.</p><p>Now when ever I hear that song time, I just shake my head and think about that day, I still have this unknown feeling inside me when I hear that song. Well lesson learned, dont talk to your parents while you are right after smoking a bowl and a half of good shit.</p>",
 "year": "2004",
 "id": "38926",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-05T08:00:00.000Z",
 "views": "2497",
 "dose": {}
}
