{
 "title": "Some Good, Some Bad, Some Ugly",
 "author": "an artist",
 "citation": " an artist. \"Some Good, Some Bad, Some Ugly: experience with Pharms - Venlafaxine (Effexor) (ID 38931)\". Erowid.org. Jul 26, 2005. erowid.org/exp/38931",
 "substance": "Pharms - Venlafaxine (Effexor)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "112.5 mg",
  "oral",
  "Pharms - Venlafaxine",
  "(daily)"
 ],
 "report": "<p>Since childhood I have experience mood problems, ranging from general unhappiness associated with self detachment all the way to extreme depression and hopelessness. Feelings of being isolated and incapable of experiencing a real emotionfeeling fake. This peaked in my early twenties when I attempted suicide. I evaded my familys desire for me to seek psychological help, saying that the experience on its own had put me off of wanting to kill myselfand indeed it has.</p><p>That said I have tried both Prozac and, most recently, Effexor combined with psychotherapy, in an attempt to reduce the role that depression has in my life. Prozac had little effect on my moods, only making me perhaps a little more clear headed and increasing my ability to remember. I discontinued using it a few months after starting, with no side effectsother than draining my bank account.</p><p>Its worth mentioning that I have had several very positive experiences with taking Ecstasy with friends, which helped me to admit to them and myself that I was, at that time, constantly afraid ofwellof everything. A state of being that led to my constantly second guessing myself, holding myself back and generally not feeling like a whole person. The gift of pleasure and reduction of inhibitions that came with my E trips helped me loosen up a great dealthough they didnt cure me.</p><p>Other drugs I have experimented with include THC, GHB, Diviners Sage and shrooms.  None of these have had any impact on my depressionthough the shrooms were not enjoyable at all.</p><p>Just over a year ago I encouraged my boyfriend to seek help with his chronic depression and he was prescribed Effexor by our doctor. Initially he had great success with it and this convinced me that I should also give it a try, despite its cost. (Im a freelance artist so I dont have a corporate drug plan to rely on.)</p><p>I began taking Effexor just over a year ago, starting at 37.5 mg and working up to 150 mg over the space of a month, combined with weekly visits to a psychotherapist. The side effects included dizziness, constipation, constant intense yawning, hunger, reduced libido and difficulty reaching orgasm. These more or less passed by the third monthall except the sexual side effects which never went away while I was taking itnot a big concern since my desire for sex has never been very strong. I decided to reduce my dosage to 112.5 mg since I was too drowsy on 150 mg. Once the initial side effects had passed I found the drug was very effective in controlling my depression.</p><p>Colours were brighter, my emotions were higher, I no longer had any even mild fantasies about ending my life. I began drawing and painting again and felt a much higher level of motivation both with my own projects and with working for my clients. The only negative side effect was how rapidly paying for my daily dosage was draining my bank account.</p><p>After a few months of psychotherapy I stopped seeing my therapistthere just wasnt anything to talk about, though he did help a little with pushing me to deal with my bisexuality.  My boyfriend, who is also bi, has continued to encourage me to explore that aspect of myself, though Ive not had the opportunity to do soyet</p><p>While I was doing well on Effexor my boyfriend found it becoming less and less effective for him, until eventually it was no long helping him at all. Our doctor prescribed Bupropion (Wellbutrin) along with the Effexor and that made things even worsehe soaked my shoulder several times as uncontrollable depression wracked him. After a few weeks of this he had enough and discontinued his use of both drugs, which was also quite difficult on him as the withdrawal symptoms played merry hell with his emotions.</p><p>I decided to continue my Effexor for a few more months and then to also get off of it, since it was costing me too much. Id also lost the initial boost to my emotions and motivation, though I still felt better than before. But my doctor convinced me to continue, saying that they based how long someone should be taking antidepressants on how long they had been experiencing the depressionwhich in my case is over thirty years. *ugh* Sodespite wanting to get off of the drug, I continued taking itbut I decided to reduce my dosage to 75 mg. To see if that would still be effective while saving me some money.</p><p>Sadly 112.5 mg seems to be the ideal dosage for me, and after a month on 75 mg I was again experiencing depression and mild suicidal fantasies. No real intent to do myself in, but if I stood on my apartment balcony Id speculate on what it would be like to end my life by jumping offalways concluding that it was a bad idea. But such fantasies were again becoming frequent.</p><p>After discussing it with our doctor he recommended going back up to a higher dosage and hinted that he might prescribe Wellbutrin as well. Yipe! Im not eager to try Wellbutrin after seeing what it did to my boyfriend. But, I went back up to 112.5 mg again and, yes, it did cure the depression that I was feelingbut the price of continuing continued to nag me.</p><p>So, once again, Ive decided to reduce my dosage and get off of Effexor. Not because I havent found it useful, but because I just cant afford it andwellI would like to enjoy certain recreation stimulants again. Perhaps thats a shallow reason, but its something that is important to meI rarely use recreational drugs, but I do enjoy them now and then. Anywayafter spending a week on 75 mg and then another week on 37.5 mg I was surprised at how little withdrawal symptoms I was feeling. A little dizziness when I first went to 37.5 mg but that was it.</p><p>Then I dropped to 0 mg and all heck has broken loose inside of my cranium. >.</p><p>Dizziness, lack of focus, inability to form sentences and worse of all a symptom that I call the jolties. It's as if my nervous system is a tense string that gets plucked, giving my the sensation that my entire body is being physically jolted. I think this is partly to blame for the sensation of dizziness. Just today I realized that the jolt sensation is tied to my eye movementsthat when my eyes make rapid or large motions horizontally or vertically I feel a jolt in my body. So it seems to be purely within my mind, rather than something that's affection my bodys nervous system at large. Very odd. But now that Ive noticed whats triggering the jolts I've been able to reduce them significantly just by keeping my eyes more stable.</p><p>Its been a week now that Ive been off of Effexor and theres no reduction in the joltiesthough all of the other withdrawal symptoms have more or less subsidedIm still having some problems with speaking now and then. Emotionally Im actually feeling better now than when I was at 112.5 mg a few weeks agomy libido is perking up and my motivation as an artist has returned again. Though that may have more to do with my recent socializing than anything else.</p><p>SoI guess I have to say that Effexor has been a useful tool for me in combating my long term depression and general moodiness, but, its too expensive and, in other ways, too costly a tool for long term use.</p><p>I just hope that these damn jolties will subside soon! >.</p>",
 "year": "2004",
 "id": "38931",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2005-07-26T07:00:00.000Z",
 "views": "16313",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "112.5 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 }
}
