{
 "title": "Divine Intervention",
 "author": "Mephistopheles",
 "citation": " Mephistopheles. \"Divine Intervention: experience with Alprazolam (Xanax), Alcohol & Escitalopram (Lexapro) (ID 38959)\". Erowid.org. Mar 20, 2008. erowid.org/exp/38959",
 "substance": "Alprazolam (Xanax), Alcohol & Escitalopram (Lexapro)",
 "bodyweight": "145 lb",
 "report": [
  "<p>I started using drugs at age 14.  I started with pot, then a few months later tried alcohol.  I was inexperienced and got caught getting WAY too drunk twice by my parents and they sent me to rehab.  After rehab I stayed sober for a year and a half, but I wanted to smoke pot again really badly.  So I was looking for ways to get high and still pass a piss test.  Rehab had not made me not want to do drugs, but, rather, had piqued my interest in all drugs.  While sober I learned about every drug I could. ",
  "Eventually I decided that I did not care about passing drug tests anymore and decided to start smoking pot again.  Shortly after trying it, I tried acid for the first time, and acid made me want to try EVERY drug.  I made a conscious decision to use every different drug I could.  I succeeded in trying every mainstream drug with the exception of PCP.  Anyway, my parents stopped drug testing me after I started smoking pot again and I began my journey of drug experience.  I used everything over the next four years.  From pot and mushrooms, to crack, meth and heroin.  I had a brief addiction to crack, and near the end of my drug days I was getting into heroin.",
  "Anyway, when I was 19 I got my own apartment with a friend of mine and our drug use skyrocketed.  I had a high tolerance for most everything and the question every night was not, what are we gonna do, but what are we gonna DO?  So on passover (a jewish holiday which my family celebrates, as we are jewish) my family was having a passover seder, which is a big ceremonial feast.  I do not remember this night.  According to my drug dealer I had purchased four zanbars from her earlier in the evening, and as the paramedics found nothing but a bit of pot on my person after the accident, I assume I took all four.  This is WAAAAAAAY too much zanax.  It's the equivalent of 16 regular zanax pills, which could not only put a horse to sleep, but kill a person of my size.  I was already fucked up and at the seder, according to my sister, I drank 6 glasses of wine, and I only needed 2 to get drunk, as I was on anti-depressants at the time (lexapro).  This was 6 glasses of wine on top of all the zanax.  Everybody at the meal had the suspicion I was fucked up but I wasn't stumbling drunk so nobody suspected that I couldn't drive.",
  "Unfortunately, they were wrong.  On the way home I must have passed out at the wheel.  I hit a cement wall at 65mph.  The seatbelt was the only thing that saved my life.  I hit my head on the roof of my car and cracked open my skull and killed part of my brain.  I was in a coma for 3 days and spent 2 months in the hospital, followed by a month and a half of brain rehabilitation and followed again by a month of drug rehabilitation (a GOOD drug rehab, and not a crappy one like the first time).",
  "I am sober going on 9 months now.  I have a fabulous girlfriend I am crazy about, a fantastic relationship with my parents, and I'm going to school and making A's.  I have permanent cognitive effects from the brain injury, but I can still live a normal life of achievement.  What happened that night was divine intervention.  God was trying to show me that I was fuckin up big time and He showed me in the only way I would listen to.  I don't expect to change the way anybody who reads this feels about drugs, but only to allow my story to be heard and pondered for those curious.</p>"
 ],
 "year": "2004",
 "id": "38959",
 "gender": "Male",
 "views": "14863",
 "dose": [
  {
   "time": "0",
   "amount": "4 tablets",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "6 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2008-03-20T07:00:00.000Z"
}
