{
 "title": "Why Did I Do That?",
 "author": "Wellbutrin",
 "citation": " Wellbutrin. \"Why Did I Do That?: experience with Bupropion, Alcohol & Cannabis (ID 38961)\". Erowid.org. Nov 30, 2007. erowid.org/exp/38961",
 "substance": "Bupropion, Alcohol & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "6000 mg",
  "oral",
  "Pharms - Bupropion",
  "(pill / tablet)"
 ],
 "report": "<p>[Erowid Note: 6,000 mgs of burpropion is considered an extremely high dose]</p><p>The night started off great, I was at a friends house getting drunk off my ass.  I was partying, drinking beer, and smoking a little weed, basically having a good time.  Let me back-track a little.  Prior to this night, about 3 weeks ago, I had been arrested, and not for the first time.  It was about the fifth time and it was alcohol related.  I was looking at jail, probation, and everything I thought I got away from.  I don't remember leaving the house I was at or getting home, but I do remember chasing the rest of my Wellbutrin, which was at least 40 150 mg pills, with a 12 oz. Bud Light bottle. </p><p>I don't remember much about the few hours after this, I just remember being in the living room talking to my mom.  She was asking me what I was on and I remember telling her I did PCP for some reason, I have never done PCP.  I remember being way way fucked up.  I was trying to read the guide on the satelite to see what was on TV but I couldn't read!  No matter how hard I tried I couldn't.  I couldn't think, I couldn't talk right.  I knew what I wanted to say but it was coming out all wrong.  I told my parents what I did finally and they freaked out, which is what they should have done. </p><p>They told me to make myself throw-up, which I did.  My dad had the phone in his hand and wanted to call 911 but I begged him not to because I did not want to be admitted to some psycho ward or something.  I threw up for about 2 hours until I had nothing more to throw up.  After this I went to my room and started to look at a poster, which was moving all over.  Next thing I know I was running to the bathroom every 5 minutes.  I puked for about 20 hours straight.  I would drink water and it would come back up in 10 seconds.  I was miserable.  It was still tripping out seeing shit, still couldn't read, and this was about 8 hours later.  I kept telling my parents 'What if I'm like this forever?' and they kept telling me it would end.  I went in the hot tub with my parents for a while, still fucked up, they thought it would help, and it did a little, basically all it did was relax me a little.  I was dizzy, sick as a dog, and still messed up until about 11:00 pm the next night.</p><p>I still to this day don't know why I took all those pills and don't know why I'm not dead right now.  Was I trying to kill myself? I don't know.  There is a lot more to the story that I don't remember, but I do know I will never touch another Wellbutrin pill again.</p>",
 "year": "2004",
 "id": "38961",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-30T08:00:00.000Z",
 "views": "10661",
 "dose": {}
}
