{
 "id": 390,
 "title": "Kavacrack",
 "date": {
  "submission": "2003-07-16T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Persistent",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Kava",
   "form": "extract"
  }
 ],
 "report": [
  "Just tried smoking some of my isopropyl extract of kava. My conspirator K and I purchased some 4.5 oz of fairly high quality kava and soaked it in warm 70% isopropyl for an hour or so with lots of shaking, filtered out the brown extract, rinsed the container and plant matter with h2o and added the aqueous rinse to the alcohol extract. The two extracts formed a milky emulsion. This milky fluid was then slowly evaporated to a tan paste. If I had known I would be smoking it I would have skipped the aqueous rinse, but I had originally planned on using it orally.",
  "Now that I've tried smoking it, I don't think I'll ever bother taking kava orally again. This stuff really works well when I smoke it, and seems to have a more mental effect rather than the primarily below the neck effects of oral kava. I am an extreme hardhead when it comes to kava, doses of 300 to 1500 mg kavalactones from standardized extracts have no effect or only slight bodily effects. In order to get a noticeable effect, I must consume 35 to 50 grams of relatively fresh kava extracted with alcohol. Smoking an extract of less than a gram of root has far exceeded the level of noticeable. The stuff tastes like a cross between crack and PCP, and is quite numbing, not really unpleasant to smoke at all. The effects are immediate, hard to really describe, numb-brained, tranquilized, euphoric are fitting adjectives. Reminds me vaguely of the effects of Ambien. Main drawback is the short duration. The buzz seems to dissipate considerably within only a few minutes, but each new lungful brings me right back up immediately.",
  "This stuff is definitely going to have its place in my pharmacopea from now on. Definitely inspired to try and make a more concentrated extract, possibly using acetone or supercritical butane."
 ],
 "erowid": {
  "id": "10691",
  "citation": " Persistent. \"Kavacrack: experience with Kava (ID 10691)\". Erowid.org. Jul 16, 2003. erowid.org/exp/10691",
  "substance": "Kava",
  "views": "32174"
 }
}
