{
 "title": "Unbelievable",
 "author": "Payge",
 "citation": " Payge. \"Unbelievable: experience with Mushrooms (ID 39007)\". Erowid.org. May 9, 2007. erowid.org/exp/39007",
 "substance": "Mushrooms",
 "bodyweight": "116 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "report": "<p>I know 4 g of mushrooms is alot for my first time, but on an extremely hot summer night when I was 17, it's how much I ended up taking.</p><p>It was 6 p.m. and my boyfriend had just brought a bag of fresh shrooms over to surprise me. He had told me about all his experiences while on them and I had expressed how much I really wanted to try them. We settled ourselves in a comfortable environment, which is now why I believe I had such a good trip, and put on some Neil Young in the background. As I started to eat them, I needed to frequently gulp water to wash down the taste, as eating mushrooms raw is not that pleasant.</p><p>After I finished eating my 4 grams, I started watching the clock. As it clicked into 6:30, I didn't feel much and was starting to be disappointed. It wasn't until I tried to flip over to talk to my boyfriend that I felt the shrooms kick in. I wanted to talk to him, (he was lying behind me) but the clock was so beautiful. I suddenly became extremely interested in watching the minutes tick by. I would get this great feeling of accomplishment everytime the clock changed. I had survived another minute of my life, and at that point it seemed like the most amazing thing anyone could ever do.</p><p>I finally turned over to see my boyfriend, who was staring fixedly at the ceiling. I wanted to see what was so interesting so I looked up too. To my surprise, the normally white ceiling was slowly changing black. It looked as though there was a storm blowing in, and the ceiling was clouding up. I felt the bed shift underneath me, so I thought my boyfriend was getting up. I looked over and he was lying completely still. Neither of us was moving, yet the bed swayed and gently bobbed like waves of an ocean. Suddenly, I remembered the clock. I hadn't looked at it since 6:30, so it must be much later by now, right? I turned over to look at the clock who's numbers were now very blurry, but in a gorgeous sparkly kind of way, and was shocked to see it was 6:31. Only one minute had passed yet it seemed like hours. I was ready to get up.</p><p>As I stepped off the bed, the floor seemed to sink in with me, like quicksand. I had the strange sensation that it was raining, but that was impossible because I was indoors. I got the strong urge to talk to my boyfriend, so I called his name.</p><p>'Scott..' I said. But in my head it echoed and sounded like 'Scott- ott- ott- ott' I found this very amusing and began laughing like I'd never laughed before. As I fell to the floor laughing, I was surprised to find that it had a strange texture, almost like grass. It still sunk as I moved, so I amused myself for a moment by crawling in circles. Scott was still on the bed, so I crawled to his side. He lept off the bed surprisingly fast, and left behind a trail of what looked like 5 more Scotts. He said something about my eyes, which led me to look at his. His eyes were wide and black, with almost no colour at all. One seemed to grow as the other shrunk, and this suddenly became too much for me to look at.</p><p>I loved this boy, how could I watch him change like that infront of my own eyes? My love for him suddenly became the most important thing in the world. I curled up on the floor which felt like grass, and hugged my knees. At the moment it was just too much for me to handle, being with him. He could be with anyone in the world, why was I so lucky? Was I even there with him? Was everything a dream? What if all the times I ever spent with him weren't real..what if it was all a drug induced dream? My mind was flooded with questions which were each too complicated to think of for more than a few seconds. This is when I reached my peak.</p><p>Grasping the edge of the bed for support I tried to get up, but the bed was covered in some sticky blue substance, that seemed to breathe in and out. I lay down in it, and everything was perfect. All the questions and insecurities I had ever had melted away, as if it was all sucked into the blue bed. There were no worries, and the world, my life, Scott's life..were all perfect. I layed there until I started to come down from my trip. Every once and a while I would see the walls squirm and twitch, but everything was calming down. Nothing was as extreme, and even the blue sticky bed returned to the white sheets it had started out as. The only thing that stayed with me was the feeling of complete bliss. With Scott beside me, nothing mattered.</p><p>This may have sounded more like a love story than a shroom trip report, but thats what effect the drug has on me. It makes me feel emotions 100 times stronger than I normally would. Which makes love almost unbearable. But overall, a very good experience. I encourage all of you to give them a shot.</p>",
 "year": "2004",
 "id": "39007",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-05-09T07:00:00.000Z",
 "views": "3264",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  }
 ]
}
