{
 "id": 3900,
 "title": "Welcome to the Party",
 "date": {
  "submission": "2008-01-15T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Delphizealot",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "<p>Age: 21",
  "Mood: excellent",
  "Duration: wait, it ended?",
  "I had an experience the other day; the day started like any other day, but was destined to be less than ordinary.  Its a Saturday, but I wake up at 8am nonetheless, eager to immerse myself in the music of my morning.  I plan that evening to ingest approximately 20mg of 2C-I and to go to the birthday party for one of my friends.  A good day is in the making, so I spend some time relaxing, waiting for the festivities to begin.  In retrospect, Im not entirely sure why I was waiting.",
  "The evening comes and I weigh out the magic powder; my scale is only accurate to 10mg, but Ive found 2C-I to be relatively innocuous in the past and havent minded the variations in dosage.  [Erowid Note: For substances active at such a small dose, this measuring technique is particularly unwise. See related article]",
  "A certain giddiness overtakes me as I swallow the gel cap, like the first touch before the foreplay begins.  I grab my MP3 playerI always need musicand make my way out the door.  Seems like Im always passing through doors.",
  "The thirty minute train ride to the party is relatively uneventful, as I find that this particular drug takes a while to come on.  Still, the sound of the train and the people on it, it reminds me of something.  Perhaps something Ive forgotten.  Soon, I arrive at the party.",
  "While at the party, I drank very little, but did smoke cannabis throughout the evening.  I find that the cannabis blends rather nicely with the 2C-I, as I almost start to forget that Im tripping.  Im surrounded by beautiful sounds and colors, even though very little has changed.  Pretty soon, I find myself drifting away from the younger people at the party and sitting with the older crowd.  I hardly move, save for my breathing, and I barely speak, but I listen.  I listen.",
  "'Third door on the right there.'",
  "'Yeah, you know, you just have to take out the trash.'",
  "'No, not that cake, the other cake.  Yeah, we sure dont want none of THAT cake.'",
  "'Dont you remember YOUR birthday?'",
  "These people at the party, they were speaking to each other, but they were also speaking to me, to you, to anyone who would listen.  Im listening.",
  "'I dunno if Im gonna show up for choir practice tomorrow.'",
  "Theyre still talking, in fact.  I speak a few words, now, and hear myself saying the same thing.  Im listening to myself.  Im sitting, silent, unmoving, listening to myself.  A friend of mine convinced me to go to the party and I owe him my gratitude.  There are a lot of great people there and it wouldve been a real shame to miss it.  Peace to you all.</p>"
 ],
 "erowid": {
  "id": "27088",
  "citation": " Delphizealot. \"Welcome to the Party: experience with 2C-I (ID 27088)\". Erowid.org. Jan 15, 2008. erowid.org/exp/27088",
  "substance": "2C-I",
  "views": "2687"
 }
}
