{
 "title": "8 hours in hell",
 "author": "Anonymous",
 "citation": " Anonymous. \"8 hours in hell: experience with DXM (with CPM) & Cannabis (ID 3901)\". Erowid.org. Mar 1, 2001. erowid.org/exp/3901",
 "substance": "DXM (with CPM) & Cannabis",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "8 tablets",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>After seeing one of my friends take DXM and him telling me how much he liked it the week before, i decided that I wanted to try this new drug.  I was at a friends house with a few friends and the house owners girlfriend when I took the 8 pills of Coricidin (with CPM) along with 'J'(my friend) and 'H'(the girlfriend) who had taken them before at about 11:00pm.  after about 15 minutes, I rolled a blunt filled with very good nugget and smoked it with everybody.  After the blunt was finished, about 12:00am, I started to feel a bit nausous but J and H reassured me that this was normal.  I believed them until about 12:30.</p><p>At 12:30 I walked outside and began to vomit. J and H were worried and came outside to talk to me.  When they asked me if I was alright, I could hardly mumble back to them 'no'.  I was taking very short breaths and shaking uncontrollably.  I continued to dry heave for about an hour and a half until I finally thought that I was seriously sick and had overdosed on the cough pills and asked one of my friends to call the poison control center.  The did not think that that was the best course of acton and reconsiled me and reassured me that I would be alright. </p><p>By about 2:45 I was feeling a little bit less neasous but was starting to get hot and cold flashes.  the night went on this way until about 4:00 when i Finally fell asleep.  when I woke up at mu friends house at 8:00am to go home, I was still feeling dizzy and my pupils were still somewhat dialated.  My recommendation to anyone that is thinking about taking any form of DXM is DON'T.  the risks, especially with coricidin, are to high.  Bye the way, J and H, who also took the pills, felt completely fine and have used DXM since then, but no longer do.</p>",
 "year": "2000",
 "id": "3901",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-03-01T08:00:00.000Z",
 "views": "38546",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "8 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ]
}
