{
 "title": "Just a Psychedelic Frothy Foam",
 "author": "eric",
 "citation": " eric. \"Just a Psychedelic Frothy Foam: experience with Ayahuasca (M. hostilis & Syrian Rue) (ID 39027)\". Erowid.org. Dec 28, 2004. erowid.org/exp/39027",
 "substance": "Ayahuasca (M. hostilis & Syrian Rue)",
 "bodyweight": "135 lb",
 "report": "<p>After many months of research, I decided to try making ayahuasca. I bought the materials online, with my final purchase consisting of 56 grams of mimosa hostilis root bark and 56 grams of syrian rue seeds. The materials were brought to my friend's house, where they were prepared as follows:</p><p>All 56 grams of mimosa were shredded in a coffee grinder, and then placed in stovetop pot to simmer in two cups of water and the juice from 5 lemons. Meanwhile, 25 grams of syrian rue seeds were ground and set inside another pot, with one cup of water and the juice of two lemons. The mimosa was lightly boiled for about half an hour, whereupon the liquid had turned a najestic purple color. The bark was sieved out of the liquid and reboiled, while the liquid in the pot was placed in a container to sit. After twenty minutes of further boiling, the plant material was sieved and thrown away. The liquid from the two pots was added together, boiled down to 500 ml, and then set aside to cool. The pot containing the syrian rue was boiled for twenty minutes, and then set aside to cool. The two liquids were then bottled up separately, and taken to another friends house for consumption.</p><p>At 10 pm, five of us consumed the syrian rue. After fifteen minutes, the five drank the mimosa hostilis. Both liquids had a foul taste, but went down without incident. Three of the psychonauts vomited within 20 minutes, and a fourth after 45 minutes. None of these four tripped. I never threw up, and began to see visuals after approximately an hour and half after ingestion. None of us could explain the length of the onset, or the lack of activation in the other trippers. All five of us followed the reccomended dietary precautions.</p><p>For me, things quickly became extremely intense. We were all watching Pink Floyd's The Wall, though as I began to see visuals, I lost interest in the movie.  I left the room to explore the ayahuasca visions. At an hour and 45 minutes after ingestion, visuals became overwhelming, and extreme nausea set in. My attemps at purging were unsuccessful. My visual field became extremely distorted because of the visuals, which attacked with merciless speed. I became convinced that I had taken too much, and that not throwing up the ayahuasca would spell my doom. I writhed on the floor of my friend's room, convinced that I was dying, feeling as though my soul was being slowly ripped apart by these visuals, all while everyone else calmly watched the movie in the other room.</p><p>At one point, my rational voice was completely dissolved, and I found myself completely absorbed in the visuals. They were of a dark, geometrical nature, infinitely complex and endlesslessly morphing. As my visual field dissapeared entirely, I was completely within an alien realm, an entire landscape built of things found nowhere on earth. Strangely enough, there was also a very strong auditory component, though of the same nature as the visuals; beautiful, but random and meaningless. No contact with 'entities' was felt or experienced. It was just a psychedelic frothy foam.</p><p>After twenty minutes of this, the peak passed and I found myself sober enough to go outside the room and explain my experience to everyone else. I found it strangely empty, and devoid of any deep meaning; this came as a very unwelcome surprise. I am an experienced user of psychedelics, and this was by far the most powerful experience I have ever had; yet, at the bottom of the rabbit hole, I found only scrambled visions and a strange, theramin-like musical soundtrack. The next day I had a awful headache, but accompanied by a very strange peace. Over all, and perhaps paradoxically, a very good experience.</p>",
 "year": "2004",
 "id": "39027",
 "gender": "Male",
 "timestamp": "2004-12-28T08:00:00.000Z",
 "views": "40335",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:15",
   "amount": "11 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(extract)"
  }
 ]
}
