{
 "title": "Follow Me Into The Fast Lane",
 "author": "lost soul",
 "citation": " lost soul. \"Follow Me Into The Fast Lane: experience with Methamphetamine (ID 39038)\". Erowid.org. Aug 22, 2005. erowid.org/exp/39038",
 "substance": "Methamphetamine",
 "bodyweight": "160 lb",
 "report": "<p>My name is Alan, and I am an 18 year old male.  I have been battling many different drug addictions for many years now, but my worst habit has been methamphetamine.</p><p>This will not be your typical trip report for two reasons.  Reason 1 is because I am not describing one perticular point in time.  Reason 2 is because I am showing everybody where the drugs have taken me to over time, and the battle I have endured climbing out of the well that at this point seems too far up to the top to want to continue climbing.</p><p>I had done many drugs between the ages of 13-15, and had a few small addictions during this period.  My ego was pretty high that I could conquer any drug.  Yeah.  I controlled THEM.  Life was goin' good.  My education in school was right on the ball.  But that ball rolled over and crushed me the moment methamphetamine smoke was introduced to my lungs.  It was like the drug had been waiting for me, and when it met me it slapped handcuffs on my arm and pulled me out of my world of success and patience, and brought me into life in the fast lane.</p><p>I LOVED this drug...actually I WORSHIPED this drug.  The same way a religious follower worships their higher power.  My number one goal at the beginning of each and every single day was to please my higher power.  'HOW CAN I GET HIGH?  WHEN ARE WE GONNA GET HIGH?  SO IF WE CALL JOHN DOE AND MEET SUZY Q HERE....WE CAN GET HIGH!!!!!!'  It sounds like a sad life, but when you view it from the fast lane, it is SOO wonderful! </p><p>But back in the real world I didn't care to listen to the bullshit that everyone had lined up for me.  It was like the fast lane was the priority world where I could get missions acommplished, and the real world was a seedy place that poked and nagged at me to do things I didn't want to do.  And then without my knowledge or consent, the real world began to crumble all around me.</p><p>This same pattern continued on and occasionally off over the next couple of years until one day in the middle of summer, when I got pissed at what these drugs were turning me into, and with my head lifted high, I gave the fast lane the middle finger and slammed the door on my way out.  I was free!  FREE!  FFFFFFRRRRRRRRREEEEEEEEEEE!!!!!!!!!!!!!!!!  The real world came back to me, and OHHHH!!!  It was WONDERFUL!!!!!!  And the true friend that brought me away from the fast lane was my one and  only trustworthy psychoactive friend, Mary Jane.  She showed me visions of the plethora I had been pulled into.  And thanks to her, she gave me the courage to say NO!</p><p>But even though she brought me happiness and sanity again, there was still the devil himself poking me with his staff, reminding me of how wonderful the fast lane was, and how the rest of the gang wanted to get together for a little reunion.  After four months of sobriety, I had made up my mind that I would go to the reunion. I mean, it couldn't hurt to just...drop by...could it?</p><p>Well, here i am at the time of this writing building up speed to merge.  I have been up for three days, I have copius amounts of crystal meth in me, and I can't sleep.  Oh yeah, I also took half of a percocet 5/325, half of a Vicodin 5/500, smoked about a gram of weed, and taken two 1mg Lorazepams, and smoked nearly a full pack of cigarettes within the last 12 hours.  These are not bragging words, I assure you.  I am dope-sick, coughing up blood and scared shitless that I will never make it out of the well.  All I have is God by my side, and if you were affected by this story I would like to believe you are on my side to and that I won't have to fight alone.  I can make it...I CAN DO IT... but until I have another epiphany, I will sorrowfully and ashamedly be over in the fast lane getting high. WELL! The pipe's in the other room waiting for me, so.........'STOP YELLING AT ME!  I said i'd be in there in a sec!' uuurrrggghhh...gotta go. Bye for now.\t</p><p>-Alan</p>",
 "year": "95",
 "id": "39038",
 "gender": "Male",
 "timestamp": "2005-08-22T07:00:00.000Z",
 "views": "8459",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ]
}
