{
 "title": "Totally Brain Dead",
 "author": "Planeteer",
 "citation": " Planeteer. \"Totally Brain Dead: experience with Tiagabine (Gabitril) (ID 39040)\". Erowid.org. Jan 2, 2005. erowid.org/exp/39040",
 "substance": "Tiagabine (Gabitril)",
 "bodyweight": "175 lb",
 "report": "<p>This happened to me not too long ago. Since I saw there weren't any reports on Tiagabine and it's dangers, I decided to submit this. Please be forewarned that this drug is not something you should even consider messing with.</p><p>I was perscribed Gabitril (Tiagabine HCl) as a mood stabilizer as I had recently attempted suicide on Klonopin (which is almost impossible but another story). For kicks, I decided to take an unusually large amount of this medication to test any recreational value. I knew that other drugs like benzodiazepines effect the gamma aminobutyric acid, I thought this was a smart idea. Unfortunately, it was not.</p><p>I swallowed fifteen 4mg pills at about 9:30 p.m. not caring that I had school the next day. I went about my usual nightly activities hoping that the gabitril would make things more interesting. After about an hour I became really tired and went to bed.</p><p>The next day I didn't wake up to my alarm. My mother was yelling at me to wake up but I didn't even respond. Apparently I was mumbling and such but I don't really remember. Eventually she got me to wake up. But as I awoke I could not, for the life of me, function in any normal way. My vision and coordination clarity were all there but I could not process simple tasks like choosing an outfit and putting it on. My mother knew something was up and was interrogating me (not suprising since I had overdosed on meds not too long before). I could not answer simple questions. Although I could think the answers in my head, they would not come out of my mouth correctly at all.  Any task I tried to accomplish was almost impossible.</p><p>She threatened to take me to the hospital but I was able to subsidize that from happening. Eventually she took me to school and dropped me off. I staggered to my first period class where they were showing a slide-show in history and I dozed off (not something I normally do). I slept the whole period, got up and staggered to my next class and repeated by briskly falling hard into sleep. None of my teachers seemed to care, thankfully. By about lunch time I was thinking clearly again and the effect were starting to wear off. By the time I got home I was clear-headed but I wasn't in the clear with my folks and had a shit-load of explaining to do.</p><p>In conclusion, this was an awful mistake. I might have just used too much and overdosed but the effects of this drug were in no way pleasing or something I would ever consider doing again. From now on I will stick to safer alternatives, there are pleanty out there.</p>",
 "year": "2003",
 "id": "39040",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-01-02T08:00:00.000Z",
 "views": "17176",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Pharms - Tiagabine",
   "form": "(pill / tablet)"
  }
 }
}
