{
 "id": 3907,
 "title": "Slightly Anesthetized, Pleasant",
 "date": {
  "submission": "2006-09-26T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Faure",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Lotus/Lily",
   "form": "dried",
   "specific": "Nymphaea nouchali var caerulea"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "dried"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "dried"
  },
  {
   "time": "0:30",
   "amount": {
    "number": "4.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Lotus/Lily",
   "form": "tea",
   "specific": "Nymphaea nouchali var caerulea"
  }
 ],
 "report": [
  "Around 11:30PM I decided to try my freshly ordered water lily and salvia. I started off by smoking around five bowls of salvia and lily with a bong. I then decided to take an almost miniscule amount of  weed and add it to a sixth bowl. The effects were mild but very pleasurable. The initial salvia high felt slightly clearer to me probably because of the water lily. Thirty minutes after the initial smoking session I threw several handfulls of water lily in a tea pot and brought it to a boil. After letting the mixture steep I added a slight bit of honey and drank it. Though the initial taste was bitter it wasn't totally undrinkable.",
  "Effects of the salvia wore off over time and I was left with just the water lily. The state I was left in was one of being slightly anaesthized from the world in a very pleasant manner. I remember looking at a 'trip out' poster we have in our living room and noticing how different it looked though it wasn't moving rapidly like it does on mushrooms, LSA or other similiar substances.  My head felt like it weighed more than it should have which is also something I noticed the one time I did heroin.",
  "I believe my experience from tonight was a pleasurable one with little side effects. Today is the morning after and I feel 95% normal which is much more normal than I usually feel after a night of smoking or drinking. For me, mixing salvia and lily was definetely a wortwhile experience."
 ],
 "erowid": {
  "id": "27108",
  "citation": " Faure. \"Slightly Anesthetized, Pleasant: experience with Blue Lotus, Salvia divinorum & Cannabis (ID 27108)\". Erowid.org. Sep 26, 2006. erowid.org/exp/27108",
  "substance": "Blue Lotus, Salvia divinorum & Cannabis",
  "views": "4813"
 }
}
