{
 "id": 3908,
 "title": "A Strategy to Relieve the Muscle Tension",
 "date": {
  "submission": "2004-01-20T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "neutopia",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I'm not going to go into the details of my trip, I had a wonderful night and I'll leave that to stand as the summary of the 12 hour experience.  My objective in writing this is to propose a little solution to the physical and sometimes mental tension that always seem to accompany the AMT experience.  This worked for me but I can't make any promises for others.",
  "This seems kind of obvious in rosy retrospect, but I see the tension as probably being caused by idle activation of efferent neurons that terminate in one's muscle fibers... the best way to dispel this energy?...use it.  I was rather tense and uncomfortable in both my mind and body after laying still for an hour trying to cleanly perceive the effects of the substance.  The truth is, however, this drug is more effectively perceived in conjunction with movement.  My two of my friends who had been accompanying me in the voyage had left my house for a bit to run an errand and upon their departure I felt less inhibition. Now alone, I decided to, well, basically writhe.  Alternately tensing and releasing all of my muscles in a strange twisting, bending/humping motion.  This increased the euphoria tenfold and escalated to an intense modified yoga session and changed the course of the whole night.  I used the tension, I burned it up, I used it as fuel for the ecstatic stretching and controlled tensing that my muscles underwent.  And as it would turn out, this change for the better was perfectly mirrored in my mind state as well.",
  "I have had many experiences with this substance in the past and each time I had felt this tension manifest as apprehension, uncertainty, and discomfort, and the experience always ended in a headache.  A half hour of pleasurable stretching dispelled all of that.  It's so simple, I'm embarrassed. I hope that this helps some of you out there who might experience the same negative effect on this drug as I have.  Live life and good vibes to you!"
 ],
 "erowid": {
  "id": "27112",
  "citation": " neutopia. \"A Strategy to Relieve the Muscle Tension: experience with AMT (ID 27112)\". Erowid.org. Jan 20, 2004. erowid.org/exp/27112",
  "substance": "AMT",
  "views": "13055"
 }
}
