{
 "id": 3910,
 "title": "Be Careful!",
 "date": {
  "submission": "2004-02-13T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Randy",
  "gender": "Male",
  "weight": "215 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 leaf",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>August 31, 2003",
  "I had clipped a small leaf (about 2 inches long, 1 inch across) from my Belladonna plant which at the time was in full-flower.  I set it on the desk to dry for a few weeks.  This was probably an unnecessary step, but most dosages are described in terms of the weight of dry leaf as the amount of water in a plant will vary.",
  "Weight as clipped from plant:  1.0g",
  "Weight after drying:  ~0.2g",
  "Over the course of the previous few days I had been experimenting with ripe belladonna berries.  I started with 3 drops from a ripe berry with no effect.  The following day I tried 5 drops, a few seeds, and a small piece of skin from the berry, also with no noticable effects.  I wanted to approach the threshold of effect slowly and cautiously, to avoid potentially lethal consequences.",
  "My mood at the time could be described as easygoing, with no real heavy thoughts or fears burdening me.",
  "I broke the leaf into pieces, and put it into about 1/2 cup of very hot water to let it steep for a few minutes.  I strained the leaf from the water and drank all the tea.  The water turned a very pale shade of green/yellow, and its taste could be described as somewhat 'grassy'",
  "45-60 minutes later I began to notice the first and most-noticable effect of this drug:  it causes a very dry mouth and throat.  Nothing you eat or drink can reverse this effect.  I ate a bunch of ice cream, but it didn't help at all.  My eyes also seemed to become dry, but my eyes did not dilate.",
  "About the same time, I began to get a half-buzzed type body feeling, similar to that which you would feel if you had smoked a small amount of marijuana, or had a few drinks, but it was a small effect, and not extraordinarily worthwhile.  Also, my fingertips seemed to feel swollen.",
  "(NOTE:  I don't know if this is related, but now, 3 weeks later, my fingers and hands are spotted with small, dry, painless blisters.  This may be due to a virus I had a few weeks before, or maybe I am slightly allergic to some part of the belladonna plant)",
  "I detected none of the other characteristic symptoms of the tropane alkaloids while on this particular trip which include dilated pupils, elevated body temperature, warm and dry skin, psychosis, delerium, and hallucinations, among others.",
  "I went to bed about 3 hours later and the symptoms were gone by the time I awoke, but I still felt a little tired the next day.  It would seem that 0.2g of dry leaf is insufficient to produce a significant effect, at least for my body weight (215 lb). ",
  "I think it's wise to start your dose very small and build up slowly, because there's no telling how potent that leaf is going to be, or how tolerant your body is of the tropane alkaloids.  From what I've read, the lethal dose is not that much more than the effective dose.</p>"
 ],
 "erowid": {
  "id": "27115",
  "citation": " Randy. \"Be Careful!: experience with Atropa belladonna (ID 27115)\". Erowid.org. Feb 13, 2004. erowid.org/exp/27115",
  "substance": "Atropa belladonna",
  "views": "67367"
 }
}
