{
 "title": "Finding the Meaning of Life",
 "author": "SpliffyHippy",
 "citation": " SpliffyHippy. \"Finding the Meaning of Life: experience with Mushrooms (ID 39105)\". Erowid.org. Dec 19, 2004. erowid.org/exp/39105",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "report": "<p>Mushrooms, Oral, 1/16oz (1.75g)</p><p>First of all, I am relatively experienced with several different</p><p>psychedelics (LSD, DXM, Shrooms, 5-MeO-DMT, salvia) as well as other</p><p>various drugs (cocaine, black tar opium, pot, adderall, concerta,</p><p>hydrocodone) and I am also currently on a perscription for 300mg of</p><p>Wellbutrin (Bupropion) a day, though I discontinued use before tripping to</p><p>ensure no conflicts occured.  Though I had tripped several times on</p><p>shrooms before, none of my previous trips would even compare to what I was</p><p>in store for.  This was by far the single greatest trip/experience of my</p><p>life.  I decided now, after a day full of adderall-binging, that this</p><p>would be the perfect time/state of mind to share our experience with the</p><p>world =)</p><p>A little over a week ago, me and DC, a good buddy of mine, decided that,</p><p>since it was exam week and we had nothing better to do, it would be a good</p><p>time to trip on some mushrooms that had been floating around campus.  I</p><p>got a half eighth (1.75g) from a friend of mine that had some, and my</p><p>friend DC got a full eighth (3.5g).  We decided to digest our blue-stemed</p><p>psilocybe buddies in a local pizza store... we went up to the balcony,</p><p>sprinkled the shrooms on a slice, and ate them.  I had heard from the guy</p><p>I got them from that they were exceptionally good shrooms, and that half</p><p>eighth was more than enough to really trip face... we knew that DC was in</p><p>for a crazy ride.  After we had finished our slices and gotten something</p><p>to drink, we left the pizza joint.  The mushrooms themselves were dried,</p><p>but very fresh-looking, with deep blue stems, and small closed caps, and</p><p>the insides of the stems were very fuzzy.  I could tell just by looking at</p><p>them that we were in for a treat.  After eating, we headed to DC's room to</p><p>prepare, and then we were on our way.</p><p>We decided that the perfect place to begin the journey was a small park</p><p>just outside of campus, so we walked there and sat on a nearby bench and</p><p>waited to see what we were in store for.  The timing of different events</p><p>is very very hard to discern, considering our states of minds throughout</p><p>the experience.  So I cant really give exact times for different events</p><p>that happened, but I can give a general outline of what went on.  Once we</p><p>started feeling the onset of the psilocybin coursing through our bodies,</p><p>we decided that we should take a walk and look around at our surroundings.</p><p>We ended up settling at a very chill tree where I had smoked pot several</p><p>times before.  It was just on the edge of a stream which fed into a nearby</p><p>pond.  That's when things really began to pick up.  Everything around us</p><p>just seemed different, not in any way I can describe, just different.  We</p><p>were noticing the trees around us, and the sun setting above us.  It was a</p><p>very peaceful, chill setting for us to begin our trip.  We noticed how</p><p>there was just a lone tree off by itself on one side of us, and a tree</p><p>which looked like it had a huge bite taken out of it, and yet another tree</p><p>which just resembled a gigantic smiley face.  We were chilling with</p><p>nature... communicating with our tree brethren, seeing what was goin on in</p><p>the nature side of the world.  After we decided we had had enough of the</p><p>tree, we got up and decided to go searching for the meaning of life. </p><p>From a previous shroom trip, I had a general idea of where it was hidden, so we used that as a base to start from.  However, due to our incresingly</p><p>psychedelic state, leaving the park prove to be a very difficult task.</p><p>While walking through the park, we stopped on a bridge over looking the</p><p>pond, and at the time, it was the most beautiful thing I had ever seen.  I</p><p>called it heaven just in time to look over and see DC spit in the water...</p><p>I told him he had just spit on heaven.  We laughed quite a bit.  After our</p><p>realization that we were, in fact, standing infront of heaven we looked</p><p>around and, sure enough, we saw Jesus standing in the distance, and the</p><p>Holy Ghost floating around in the sky.  Of course we knew none of this was</p><p>factual, we were just having a little fun with our state.  At this point,</p><p>I decided that wearing a hat wasnt natural enough, so I removed it and</p><p>placed it in my pocket.  After circling the park SEVERAL times, we finally</p><p>found an escape route, and headed for where the meaning of life was held -</p><p>a huge radio tower outside of a tv station next to campus, which (because</p><p>it was around Christmas time) happened to be covered from top to bottom in</p><p>very bright colorful Christmas lights.</p><p>On a little side note - up until this point in time, my entire goal for</p><p>tripping was to find some meaning to life, to find out what it's all</p><p>about, along with other eternal philosophical questions.  On a previous</p><p>shroom trip almost exactly a year before, a friend of mine told me that</p><p>the meaning of life was in that same tower (again, covered with lights)</p><p>however on that night, it was just too damn cold for me to walk out there</p><p>and look for it.</p><p>After what seemed like an eternity of walking and talking and explaining</p><p>and philosophizing (we decided that the human world is based on rules that</p><p>can be broken whereas the natural world is only based on the Laws of</p><p>Nature, which can never be broken; also we decided that money was silly</p><p>because all it is, is a big piece of nothing, which is split into several</p><p>different smaller portions of nothing, and then is traded for stuff), we</p><p>finally arrived at the tower, and proceded to search around for the</p><p>meaning of life.  Our search led us to a large open field with a large</p><p>azalea garden on the other side.  We wandered into the garden, and found a</p><p>bench, which my friend DC happened to have had sex on a couple days before</p><p>(just as I was about to sit down, he informed me that the bench contained</p><p>DCemen... again, we laughed quite a bit.)</p><p>While in that garden, we again started philosophizing, and we came to the conclusion that all humans were parasites bent on destruction of the earth.  However, we were comfortable with this because we had realized it and were very apologetic to the surrounding trees and azalea bushes.  We continued to seperate everything in the world to 'Nature' and 'Non-nature' and both came to the conclusion that, though it is destroying the earth, non-nature is very fun to look at.  We sat in that garden for what seemed like another eternity, until we decided that there was just too much non-nature around to really experience what we were looking for, so we grabbed the bark off one of the trees we were apologizing to (in order to spread the bark around campus so that the tree could be with all its tree brothers and sisters) and headed off towards campus, to another smoking spot we were both rather fond of.</p><p>Our next stop was a bridge on campus right outside of one of the dorms.</p><p>We realized that, though bridges are technically non-nature, they do occur</p><p>in nature, there just simply arent enough of them, so it is necessary for</p><p>us to build our own.  At this point we had walked probably a mile (I cant</p><p>tell if this is an over/under approximation or just about right... we were</p><p>trippin hard.)  We noticed that, even though the bridge was in a dark</p><p>scary-looking area, neither of us were scared, for we were with nature,</p><p>and that is what life is all about.  We again decided that there was</p><p>simply too much non-nature around for our comfort, and decided to continue</p><p>our journey, spreading bits of our tree brother every few steps.  We were</p><p>trying to wander across campus to a spot that I was very fond of... but on</p><p>the way we somehow ended up on the school's track and field area, and got</p><p>stuck in there for a while, and our increasing state of tripping was only</p><p>making things more difficult.</p><p>This still however was a very positive experience, cause we realized that fences were just rules telling us where we couldnt go, and that the world is filled with pointless rules that can all be broken, then only things you cant break are the LAWS of nature (such as law of gravity, thermodynamics, etc).  After finally breaking through the rules containing us on the track, we continued to wander through campus, constantly stopping to look at various pieces of non-nature that were fun to look at.  Half way to our desintaion, we found another lonely tree, stranded among many pieces of non-nature, and we decided to liberate some of its bark as well (we had already used up all the bark from our previous tree brother.)</p><p>After finally making it to my favorite spot on campus (where I frequently</p><p>go to lay in the grass and daydream, even when I'm sober) and we picked a</p><p>nice-looking spot in the grass, and layed back and watched the show.  What</p><p>I didnt realize until just now is that of all the places we stopped, this</p><p>one was surrounded by the most non-nature.  We were right in the middle of</p><p>a quad outside some classrooms, and it happened to be right about the time</p><p>everyone was getting out of their exams (we injested the shrooms around</p><p>4:30pm and at this point it was around 8 or 9:00pm).  However, at this</p><p>stage in the trip, we couldnt care less who was around and saw how crazy</p><p>we were acting. </p><p>Amazingly enough, this is where the trip really started</p><p>to get heavy.  Laying there in the grass we proceded to slip in to deeper</p><p>and deeper states of psilocybin-induced euphoria... everything we saw</p><p>became amazing, every where we looked we saw something new.  We realized</p><p>that everything you look at is just a bunch of points of infinity, and</p><p>that our trip also, was just a chain of singularities, each containing its</p><p>own version of infinity.  I layed back and watched the show in the clouds,</p><p>while DC proceded to get a pen out of his pocket and draw on his hands for</p><p>probably 45 minutes.  I was completely awe-stricken... I couldnt believe</p><p>what I was seeing.  DC on the other hand, was totally engrossed in the</p><p>markings he was making on his hands.</p><p>At one point, I recall him saying</p><p>'I'm tracing a feeling around my hand with my pen' to which I responded</p><p>'Are you sure that feeling isnt the pen?'  Again, we laughed quite a bit.</p><p>The trip continued to get more and more amazing while I continued to</p><p>become speechless and even more awe-stricken.  Once we could finally talk</p><p>again, we both came upon the agreement that tripping is indeed what</p><p>happens when you divide by zero.</p><p>After we finally had had enough of that</p><p>scenery, we got up (which was not easy) and proceded to walk in a</p><p>direction that happened to be back to where we started.  Throughout the</p><p>trip we had been discussing various logic-circles and spiral</p><p>representations of natural events (most of which was inspired by Tool's</p><p>Lateralus album... this is essentially what guided our entire trip, though</p><p>we didnt realize it at the time.)  On our walk back to the park from</p><p>whence we came, we continued to discuss the meaning of life, and decided</p><p>that Douglas Adams was close... but the answer to life, the universe, and</p><p>everything was in fact 42 DIVIDED BY ZERO, as opposed to just 42 as</p><p>mentioned in the Hitchhikker's Guide to the Galaxy series. </p><p>The patterns we had discovered throughout the trip had completely blown our minds...  As we headed back into the park, it was now pretty much pitch black dark and it was very hard to orient ourselves in the nature-packed park.  We wanted to go back to the bench where we started, to complete the cycle of the journey... we had found the meaning of life, and we wanted to take it back to where we began.  Once we entered the park, I bluntly stated that I needed to take a piss, to which DC responded 'THAT'S WHY I ATE THAT TREE!'</p><p>From here to the end of the trip I could not stop laughing.  Aparently</p><p>DC's thought process had led him to believe that if he ate the bark from</p><p>the tree we found in the middle of campus, he would be leaving pieces of</p><p>it everywhere we went afterwards.... he had decided to consume the bark</p><p>while I was laying in the grass and he was ingulfed in the pen drawings he</p><p>was creating on his hands.  After finally making it back to the bench, we</p><p>decided a good way to celebrate the arrival was to piss on the bench...</p><p>leaving a piece of our tree brother where the journey began.  After</p><p>sitting on the bench for a couple minutes (not stopping to think if we</p><p>were sitting where we had just pissed) we decided to go back to the chill</p><p>tree and say bye to the first of our tree friends.  The chill tree, the</p><p>lone tree, the poor tree with a bite out of his head, and the big huge</p><p>smiley tree.  At this point we were completely exhausted from our journey</p><p>and decided it was time to retire back to our non-natural habitats, cause,</p><p>though they may be non-nature, they contained comfortable furnature.  We</p><p>walked to campus, and parted ways, but not before taking pictures of the</p><p>crazy drawings DC had left all over his hands, including the back of his</p><p>right hand (DC is right handed) but not the palm of his right hand.  We</p><p>went back to our rooms, without much to say, still awe-stricken.</p><p>We got online and attempted to talk to each other, but it just seemed like no words could possibly explain anything that had happened during the</p><p>journey.  We did however discover that, amazingly enough, 42 divided by</p><p>zero just happens to be 42/0.... coincidence? who knows.  I laughed quite</p><p>a bit.</p><p>I'm very sorry for the long-windedness of this report... I couldnt really</p><p>help it in my current adderall-induced state.  I could probably continue</p><p>on for another several pages, and still not even describe all the</p><p>subtleties of the trip.  But I do hope people will read about our</p><p>experiences and maybe learn something about the nature of tripping... or</p><p>possibly just have a laugh.  We sure as hell did.  It was by far one of</p><p>the most amazing and enlightening experiences of my life, not to mention</p><p>the best trip EVER.</p><p>We became tree-huging hippies... in every sense of the term.  We communicated with nature, and got back to our natural roots... not to mention finding the meaning of life.  It was quite possibly everything I could've asked for from a trip.  The only disappointing part is that I dont know if any trip will compare from here on out, short of a high dose mescaline (which I've been dying to try) or peyote trip.  Everything just seemed to be all interconnected and all made sense, though later that night I didnt understand any of it.  It was a truly inspiring experience... by far a definite ++++ by the Shulgin scale.</p>",
 "year": "2004",
 "id": "39105",
 "gender": "Male",
 "timestamp": "2004-12-19T08:00:00.000Z",
 "views": "9005",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
