{
 "title": "Timeless Dream",
 "author": "High Priest",
 "citation": " High Priest. \"Timeless Dream: experience with Morphine & Cannabis - Hash (ID 39117)\". Erowid.org. Apr 11, 2007. erowid.org/exp/39117",
 "substance": "Morphine & Cannabis - Hash",
 "bodyweight": "182 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "insufflated",
   "Morphine",
   "(ground / crushed)",
   "",
   "60 mg",
   "smoked",
   "Morphine",
   "(ground / crushed)",
   "",
   "0.5 g",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)"
  ]
 ],
 "report": "<p>A little morphine recently fell into my possession - gel capsules each containing 60mg of sulphate, in grains. As I don't like shooting things up, My first inclination was to smoke them from foil, much like a heroin user, except in my nice warm flat with food, a little brandy and some great tunes, rather than the desperation- and piss-soaked squalor of a junky squat.</p><p>However, I suspected the medical-purity MS would simply burn and vaporise off the foil, with very little smoke to inhale. So I laid the shit down on my mirror and began chopping away with my gym membership card (oh the irony). This was a frustrating and thankless task, due to the tedency of the perfectly spherical MS grains to roll wildly in all directions. After a few minutes, I had a neat little pile of nearly-fine powder. This was seperated into four FAT lines which I hoovered up over a period of about forty minutes. This kept me nice for about four hours. In comparision with low-grade brown smack, it's less intense but much longer-lived.</p><p>Later on, I couldn't be bothered to fuck around chopping it up again, you dig, so I built a fat spliff with about half a gram of very nice double-zero Morrocan hashish - the kind of stuff the Morrocans don't like to see leave their country. I burned this one shortly before I went to bed. As you'd expect of a non-synthetic opiate, The odour is quite pungent, so I hit it in the bathroom w/the extractor fan on. The results were pretty special- a more intense high than the snorting, combined with a nice mid-level hash buzz. I don't smoke hash or weed too much any more because of the creeping paranoia I seem to get from it now, but of course the morphine blocked this right out. I fell asleep listening to Augustus Pablo's stone cold classic 'Original Rockers' LP, with beautiful visions trailing just past conscious recognition, lost in a timeless dream. I awoke the following morning, a Monday, refreshed and well-ready to go and play businessman at the office.</p>",
 "year": "2004",
 "id": "39117",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-11T07:00:00.000Z",
 "views": "14587",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "(ground / crushed)"
  }
 ]
}
