{
 "title": "A Group Trip",
 "author": "Alex",
 "citation": " Alex. \"A Group Trip: experience with Salvia divinorum (10x extract) (ID 39132)\". Erowid.org. Mar 31, 2008. erowid.org/exp/39132",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)"
 ],
 "report": "<p>The experience started with me and four friends up in their room.  The room was somewhat crowded with five people in it.  There was music playing quietly.  We had a gram of freshly purchased 10x Salvia.  I was quite excited to get our little adventure underway, having spent a little over an hour researching salvia divinorum after hearing about it from a friend.  I was really comfortable and looking forward to having a mind expanding experience.  I was not on any type of medication or herbs.</p><p>We took a small pinch out, about enough to cover the face of a dime, and loaded it in the bowl.  Our smoking device was a homemade bong.  My friend Eric took the first hit.  After about 10 seconds he had a slight smile on his face.  After minute he was laughing pretty hard and saying Dude I am really feeling it. At that time I took my own hit of Salvia.  I had the same amount as well as I can judge, we didnt have a scale and held it in for about 30 seconds. </p><p>I felt the effects within 10 seconds.  The first minute or so were like being very high on marijuana.  I was very happy, laughing a lot.  Everything had a sense of novelty to me.  Everything seemed different, and yet I could not exactly say what it was.  After that I became higher than I ever was on cannabis.  Things looked normal, but at the same time they were different.  I was talking to my friends a little bit, telling them how high I was.  My sense of space and time were distorted.  I did not have any visual hallucinations, which disappointed me.  Later, when thought about the sequence of events that happened, my trip only lasted 15 minutes.  Feeling of being high seemed to last an hour though.</p><p>I was sitting in a chair looking around the room.  Suddenly I noticed that I was sinking into the chair.  It felt like my body sunk all the way in until only my head was sitting on the chair.  When I looked down I could still see my body sitting there perfectly normal.  But at the same time I registered what I was seeing as a dark empty space.  It was very strange, like seeing, and living two different existences at once.  About 3 minutes after smoking I noticed Jimmy was on the phone with my friend Alex.  I asked to talk to him to try to explain what was going on.  I knew that my speech was very vague but could not help it.  I was laughing a lot.  The only thing I said coherently was Dude I am so high right now. </p><p>After five minutes I got up from my chair and walked over to have a look at the lava lamp.  I am sure that I was saying things and interacting with people before I got there, but the only solid memory I have was staring at the lamp for a couple of minutes.  I was very distracted.  I would turn my head to look at something then forget what caused me to look in the first place.  The lava lamp was only somewhat interesting, I would have had more fun watching it while high on marijuana.  Sometime during my trip I asked for the music to be turned off because it was annoying me.</p><p>I turned around to see what was going on the room.  My other two friends Clayton and Jimmy were loading up bowls for themselves.  I didnt want them to smoke because they were supposed to be babysitting me and Eric.  However I forgot about this almost as soon as I saw them doing it and didnt say anything.  A minute after smoking, Jimmy sat down cross-legged on the floor and put his head down.  He began drooling a lot, which I found to be very funny.  I tried to tell him what he was doing.  He acknowledged me with a grunt and began drooling again. </p><p>My next memory was Eric packing another bowl.  It must have been 10 minutes into the trip.  I walked over to watch him.  Ashton, the last sober person asked if he could take a hit next.  I told him he should wait because he needed to watch over us.  Our plan was to wait until Eric and I were down before anyone else lit up.  I soon forgot my inhibitions and was helping Aston load a bowl.  After he smoked I remembered that no one was watching us despite our plan to have sitters.  I found this extremely amusing and shared it with the group.  We all had a good laugh at this.  I would guess about three minutes after Ashton smoked his share, Clayton was acting very agitated.  He started mumbling, then got up and left the room.  Ashton and I got up to go get him.  We had to pull him back into the room; he really didnt want to be in their.</p><p>After about 15 minutes I was back to reality.  Everything still felt a little weird, but I was able to function normally.  Something that surprised me is that it took me about 2 hours to go back all the way to baseline.  While I was coming down I had a short attention span, distances still seemed distorted, my short term memory was suffering, and I had just a general feeling that everything still wasnt the same.  My friends agreed that things still felt weird for a long while after doing it.</p><p>My experience was very enjoyable.  Clayton and Ashton didnt have a good time.  Clayton told me that when I was pulling him back into the room if felt like my hands were needles in his skin.  Ashton started freaking out about 10 minutes into his trip and hit Eric, who was moaning in a weird way, trying to get him to shut up.  Jimmy had a good time.  He told us that when he was drooling he was in another world where he was a tree with a waterfall coming out of it.  Myself and my friends who read experience reports didnt have bad trips.  Clayton and Ashton werent as prepared as the rest of us.  They said they will never try salvia, or any other hallucinogen again.</p>",
 "year": "2004",
 "id": "39132",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-31T07:00:00.000Z",
 "views": "2563",
 "dose": {}
}
