{
 "title": "Opening a Portal",
 "author": "Silentwolfxvx",
 "citation": " Silentwolfxvx. \"Opening a Portal: experience with Salvia divinorum (leaves) & Tobacco (ID 39176)\". Erowid.org. Mar 24, 2008. erowid.org/exp/39176",
 "substance": "Salvia divinorum (leaves) & Tobacco",
 "bodyweight": "250 lb",
 "header": [
  "DOSE:",
  "500 mg",
  "smoked",
  "Salvia divinorum",
  "(leaves)",
  "",
  "1.0 g",
  "smoked",
  "Tobacco",
  "(leaves)"
 ],
 "report": "<p>This even took place between 11:00am and 11:30am on December 20, 2004.  I received a one ounce package of dried salvia divinorum foliage I had recently ordered in the mail via the internet.  Upon inspection of the goods, I decided to continue.</p><p>It should be noted that I do not use any chemicals or plants for recreational purposes, as I believe using anything to 'get high' for the sake of the high is both physically and spiritually destructive.  I do however, understand and condone usage of chemicals and the sacred plants for purposes of communion with one another and for gaining insight into the nature of things.  I practice a variation of qigong daily, and I have employed San Pedro and variations of the 'Drink of the Soul' on several occasions.</p><p>I began by preparing my pipe with a cleaning.  I built the pipe myself, and it has a 1.5 in depth on the bowl; the bottom tends to fill up with oil and tar from smoking, and it changes the taste and the way the pipe pulls when I inhale if I don't clean it out right.  When it is clean, I can fill my lungs to capacity (9.5 liter exhale on an asthma machine) within 3 seconds.</p><p>Next, I weighed out 1 gram of strength 2 pipe tobacco, and ground in my mortar and pestle.  My pipe smokes more readily when the bottom is cased.  After packing the tobacco into the bottom of the pipe and checking for obstruction, I weighed out another gram of Salvia.</p><p>The Salvia was not an extract; it came in dry, whole-leaf form.  I proceeded to pulverize it in the mortar and pestle, for more rapid and even burning.  After removing the stems, I determined that only .5 gram of the material would be able to fit into my pipe, so I packed it and once again checked for obstructions.</p><p>As I was doing all this, I kept asking myself, 'What goal will you fulfill when you commune with this plant-spirit?'  The only satisfactory explanation I could give myself was to gain understanding.  I kept questioning myself as I sat down on the foot of the bed and raised the pipe to my lips, then decided that I would have to let the questions wait until after I smoked the Salvia.</p><p>I struck the lighter and held it to the pipe, puffing twice to make certain it was burning; it's a habit from smoking tobacco.  I inhaled deeply, holding it in for a few moments before exhaling, and immediately repeating the above process.  As I exhaled the second lungful, I felt a strong force grabbing me and pulling me backwards, so I set the pipe down and laid back.</p><p>I hurt my shoulder pretty bad about a year ago, and I've already had surgery on it once; since that time, I've had a decreased energy flow through my entire right arm.  This is important, because as soon as I laid down, I felt a modulating wave hit me and keep vibrating through me~ I've never felt anyone or thing that could motivate energy like this.  This energy surged through all of me except for my right arm, and try as I might, I could not force it through the arm.  When I use San Pedro, I use it to increase the amount of Ether I'm able to manipulate; it looks like this WON'T be the case with Salvia.</p><p>I felt myself washed away from the Material Plane by these waves of energy, and I saw myself climb up out of my body, through the barrier between worlds and into one of the other Planes.  A tear formed in my right eye from the physical intensity of the experience.  I heard voices that were not distinct, of a man and a woman.  I could feel the irritation of the man, who seemed to be the servant or guardian of the woman, and the pain of the woman.  I stated distinctly several times, 'I am not here to get high, I came for knowledge.'  The man approached me, asking me 'Knowledge of what?'  My response was, 'All things.'  He found that amusing.  The woman said something, I'm not quite sure what, but it sounded like 'He needs to go back.'  At that point, the man made certain that I left.  I suddenly remember where I was physically, and sat up, with the waves of energy still knocking me physically around.</p><p>It took about ten minutes of dedicated centering and reinforcing that I am this moment before the energy stopped disturbing me; it literally pulled my Aura into another place.</p>",
 "year": "2004",
 "id": "39176",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-03-24T07:00:00.000Z",
 "views": "2592",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  "1": {
   "time": "",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(leaves)"
  }
 }
}
