{
 "title": "Agonizing Apathy",
 "author": "Karusanyoshi",
 "citation": " Karusanyoshi. \"Agonizing Apathy: experience with Mushrooms (ID 39188)\". Erowid.org. Jul 24, 2007. erowid.org/exp/39188",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>It started on a night in college. My friend had come back with an eighth of mushrooms, and I was going to try it with some of my good friends, A and L. We were all excited, as it was each of our first times, and we were too excited to wait until the weekend. We had heard reports of them tasting terrible, so we were all a little wary about eating them. I was going to suggest eating them with Triscuits before I had turned around and saw that L was already chewing them. A and I just looked at each other, then started eating them ourselves. For the first two hours, we felt incredibly strange. A and I noticed that we were disoriented, and our thoughts began to stream into many different paths. L went downstairs to play ping pong (she couldn't keep still), but A and I didn't want to move.</p><p>About two hours after our injestion, my roommate had returned from home. He was frustrated that we left the room messy, and that began to reflect on me. This was when the trip really started. I thought I had been living my roommate's life, and the psilocybin felt like it had made me experience fake events in his life. My mind began to fabricate details about my roommate's life -- horrible events that were overwhelming. I still can't remember what I saw, only that the sadness I felt from experiencing it was overwhelming. I began to cry uncontrollably. My roommate and A tried to call me back to reality, but I was gone. All I could hear was the echoes of their distant voices, somewhere in another world. I had to leave the room to get away from the environment that had triggered it.</p><p>I wandered the hallway. All the while, I had people give me strange looks. My neighbors looked at me like I was crazy, and I started groping the walls, not having any idea what to do. I escaped into someone else's room - - I had to hide from all stimulation and drugs. He allowed me to stay in his room until I pulled myself together, and I sat and cried in his room for about half an hour - trying to get over everything I saw. At this time, my mind began to wander. I began to see all my friends and their problems. They seemed so easy to me now, as though everything could be solved without any effort, yet they didn't seem worth fixing. I eventually had calmed down, and wandered back to my room.</p><p>I was surprised, but not in a good way, to see all my friends waiting for me. They all had wondered where I went, and were worried about me. I should have felt good about this, but it just triggered more of the same overwhelming emotion from before, and I crawled up to my bed and started sobbing again. I began to feel bad for things I had put myself through -- not just myself, but my friends and family as well.</p><p>I began to feel selfish, and began to hate myself. At this point, L came over to my bed, held my hand, and I could see tears swelling in her face as she looked at me. I somehow felt a connection - like ESP - to my friend. It was as though we were on the same thought train - it was amazing, we both just KNEW what the other was thinking. At this point, L left the room, presumably because she felt overwhelmed like I did earlier.</p><p>Then it was over. Without any warning, the crying stopped. I began to feel incredibly apathetic, yet I began to notice my surroundings more now. I looked at a poster, and saw it move in ripples, and I looked at the ceiling, which had formed into a sheet of skin, and could only think 'Sigh.. so what?'.</p><p>A was still in the room with me, and he began babbling about incoherent nonsense, and this began to make me very angry. All he could talk about was how awesome it was, and it made me so angry, for some reason. All I could think about was how to make him stop talking about it. Then, silence. We both stopped talking altogether. We decided to go outside to meet L and our other friends. I found L standing by herself, and with a tacit understanding, we walked by ourselves into the town surrounding our college.</p><p>I noticed everything was glowing bright green, but still, I didn't care. She began talking to me, and everything made perfect sense -- She really WAS thinking exactly like I was. 'Are we going to stop what we're doing? Are we going to change our lives? Are we going to feel this way forever??'</p><p>We eventually came back to campus, and I was outside my dorm. I told L I was going to get a shower, and she agreed, saying 'We'll both feel exactly the same no matter who we're with, or where we are.', and I knew this too.</p><p>I went back to my room. I didn't care about getting a shower anymore. My roommate was in our room, and he looked at me. All I could say was 'Are you OK?', because I was still under the effect of the mushrooms, and I still felt as though he really did experience everything I saw about him. I had forgotten what was real and what wasn't.</p><p>At this point, latent memories began to rise - painful memories from my past began eating away at my consciousness, and it began to actually cause me deep pain. Death of family, lonliness, depression all began to resurface from my past -- Emotions I had hidden away, because they were too painful to experience again. I threw one of my roommate's belongings across the room in rage, and he became angry at me, then calmed down, because he had done mushrooms before, and knew what I was going through.</p><p>My friend L had invited me to come over and smoke marijuana with her and my other friends, but I declined, because I was still worried about my roommate. All I could feel for the rest of the night was agonizing apathy - the thought that nothing could make me happy ever again. It was so painful, I had to leave school for a few days, but my mindset was that I didn't want to come back again. The mushrooms made me reflect on how I've been wasting my parents' money by not doing my work in school, and it almost made me want to drop out and start over. I didn't feel better until I talked to my parents about this.</p><p>All in all, it was a generally good experience, because it helped me solve issues that were bothering me, deep inside, under the surface of a seemingly incredibly happy person. It made me feel better in the long run, because now that original thing that was bothering me was no longer an issue.</p>",
 "year": "2004",
 "id": "39188",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-24T07:00:00.000Z",
 "views": "2758",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
