{
 "id": 3919,
 "title": "Definetly Uplifting",
 "date": {
  "submission": "2006-05-04T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Daytripper",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "lines",
    "quantity": "2"
   },
   "administration": "insufflated",
   "substance": "Bupropion",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "I was recently prescribed Wellbutrin 150mg Sr for depression/quitting smoking. After a few days of taking the prescribed dosage (150mg every 12hrs) plus a sufficient amount of reading up from my sources I decided Buproprion was worth further experimentation. The first experiment was to crush up one 150mg pill and snort as much as I felt necessary to achieve noticable effects.",
  "Judging from the size of the crushed up powder, I decided half would be plenty. After snorting 2 lines I immediately experienced a sharp burning and then a slow numbing effect which was expected as bupropion has an anisthetic effect on the mucous membranes. This numbing was followed by a 'stimulated' sense of euphoria, with an increasingly nasty drip to accompany it. The sensation of slight numbing in the face plus the slightly stimulated buzz proved what I have heard as a vauge similarity to cocaine.",
  "The second experiment was inspired with the sheer and sudden desire to catch a nice buzz, the last of my weed just having been recently smoked. I decided to sprinkle a small amount of crushed bupropion over a equally small bowl of tobacco. The smoke, as expected was really harsh with a bitter chemical taste. 5 minutes later I began to experience a mild, almost amphetamine quality buzz. I say amphetamine quality, because the body high reminds me of the familiar feeling of having just gotten out of a hot shower. That energized... warm glow is the closest way I can describe it.",
  "All 3 of these methods of ingestion proved to have varying effects, yet all methods produced a strong need to organize things, or be doing something stimulating, which I expected due to the fact that wellbutrin is also prescribed to treat the effects of ADD. In conclusion, Wellbutrin is a very different drug, and so far has been a really needed boost in my life and has helped me to feel like a normal person again."
 ],
 "erowid": {
  "id": "27141",
  "citation": " Daytripper. \"Definetly Uplifting: experience with Bupropion (Wellbutrin) (ID 27141)\". Erowid.org. May 4, 2006. erowid.org/exp/27141",
  "substance": "Bupropion (Wellbutrin)",
  "views": "23209"
 }
}
