{
 "title": "Intensive Care for Three Days",
 "author": "Dee",
 "citation": " Dee. \"Intensive Care for Three Days: experience with Morphine (ID 39208)\". Erowid.org. Sep 14, 2005. erowid.org/exp/39208",
 "substance": "Morphine",
 "bodyweight": "145 lb",
 "report": [
  "<p>My boyfriend used to do opiates a good bit (heroin, painkillers, ect.) He had been sober for about a month, when he decided to try morphine one time. He had access to three 75mg generic morphine patches. The first one he split open the patch and ate the medicine inside. He then immediately applied the second patch to his back. About 2 hours later he ate the third patch. At this point he was feeling a strong high, but decided three hours later to take the patch off his back and eat the medicine like he did with the other two. After he ate the third patch he was extremely high. He was feeling very nauseous, but could not throw up. It was hard for him to phrase full sentences, and he was very tired. About two hours after he ingested the last patch we laid down and he told me he had never been so messed up in his life. I started to worry because he has taken much higher doses of opiates before, and should not have felt so high, plus he was breathing heavily, and having trouble staying alert.",
  "Not more then 5 minutes after we laid down I looked over and noticed him passed out with his mouth wide open. He started breathing very heavily, and then he was making choking/gasping noises, trying to breathe but not getting enough air. I yelled for his brother who immediately called 911. I thought he might be choking so we sat him up and tried to wake him up. At this point his lips were blue, his body was totally limp, his eyes closed and he was not breathing despite his efforts. The 911 operator instructed us on performing CPR, and told us to check every 30 seconds for a pulse. About two minutes before the paramedics got to the house, we stopped being able to feel a pulse. When the paramedics arrived he went into cardiac arrest, and was given adrenaline to restart his heart, plus a drug to counteract the effects of the morphine. He woke up immediately after his heart restarted, but was not coherent or aware of his surroundings. He was in Intensive Care for three days, and was given Methadone, along with drugs to keep his kidneys from failing. We later found out the reason he had such a severe overdose was because each patch was a three-day dose of morphine. He remembers nothing from the time he took the third patch until he was in the hospital.",
  "He has changed a lot since this incident. If he had been more careful and informed about the drugs he was taking, all of this could have been avoided. I saw someone I love almost die because of careless drug abuse. Hopefully good can come of his experience and people hearing this story will realize they need to be extremely careful and informed when taking recreational drugs. Even when you think you are experienced, bad situations happen, so make sure the rewards are greater then the risks.</p>"
 ],
 "year": "2004",
 "id": "39208",
 "gender": "Male",
 "views": "25344",
 "dose": [
  {
   "time": "0",
   "amount": "225 mg",
   "administration": "oral",
   "substance": "Morphine",
   "form": "(patch)"
  }
 ],
 "submissionDate": "2005-09-14T07:00:00.000Z"
}
