{
 "title": "Ephedra With a Twist",
 "author": "The Lorax",
 "citation": " The Lorax. \"Ephedra With a Twist: experience with Yohimbe & Diphenhydramine (ID 39218)\". Erowid.org. Jun 21, 2007. erowid.org/exp/39218",
 "substance": "Yohimbe & Diphenhydramine",
 "bodyweight": "184 lb",
 "report": "<p>To start, let me give you my brief psychoactive history:</p><p>-Pot (All the time;  from mellowed out, to outer space)</p><p>-DXM (4 or 5 times; unenjoyable)</p><p>-Codeine/Perc/Vicodin (roughly 15 times; fun fun fun!)</p><p>-Mushrooms (3 times; completely changed my life for the better)</p><p>-Alcohol</p><p>-Tobacco (semi-regularly)</p><p>-Dimenhydrinate (with no hallucinations)</p><p>The night started with a trip to the grocery store.  I was originally there to pick up a few legit items (bread, milk, eggs), but made a quick detour to the 'natural lifestyle' section, coming across a bottle of 40 pills, each containing 400mg Yohimbe and 200mg Vitamin C.  I made the purchase, came home, and read more on Yohimbe.</p><p>As you probably know, Yohimbe is a stimulant, aphrodisiac, and sometimes used to treat cases of erectile dysfunction.  The aphrodisiac properties were what interested me, as my girlfriend L and I both enjoyed other forms of inebriated sex.  Mindset: curious, overall positive.</p><p>T=0:00 - Ingest two pills, orally, with plenty of water.</p><p>T=0:30 - Not feeling anything, drop one more.</p><p>T=1:30 - Increased heart rate, slight anxiety, over all a lot like a high dose of caffeine.</p><p>T=2:00 L gets off work, and we decide to go to a movie.  I tell her about the Yohimbe; she's very interested, and asks me how it feels.  I tell her I'm speedy, but find it to be more un-arousing than anything else.  I drop two more Yohimbe capsules, and 1 25mg Diphenhydramine pill to cut the edge.</p><p>T=2:30 I have a good balance of energy going.  The Yohimbe gives energy, and the Diphenhydramine takes away the unpleasant anxiety and heart-jumping.  I'll try not to be graphic, but for the sake of science, I was also harder (and maybe a little bit bigger) than I've ever been in my entire life.  L commented on this too, and LOVED it.  Oral sex felt INCREDIBLE (more than usual).</p><p>T=3:30 We arrive at the theater too late, and decide to bring a movie back home.  En route, we have sex.  Once again, very very very good.</p><p>T=7:30 It's about midnight, L goes home.  I don't think sleeping will be a problem.</p><p>T=9:00 Sleeping is a problem.  I lie in bed with racing thoughts, and although my heart rate is only slightly elevated, I can not sleep.</p><p>T=9:30 25mg Diphenhydramine ingested, my last one. </p><p>T=10:00 Shallow sleep for 6 hours.</p><p>SUMMARY:</p><p>Although the stimulant and aphrodisiac properties of Yohimbe were fun, I can only imagine what this is doing to damage my heart.  Not sleeping was no fun either; I'm writing this the morning after and I feel run-down.  Diphenhydramine worked perfectly for me, and I know I could have gotten to sleep if I had had 25-50mg more to take before going to bed.</p>",
 "year": "2004",
 "id": "39218",
 "gender": "Male",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "15547",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Vitamin C",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 0:30",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 0:30",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Vitamin C",
   "form": "(pill / tablet)"
  },
  "4": {
   "time": " T+ 2:00",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(pill / tablet)"
  },
  "5": {
   "time": " T+ 2:00",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Vitamin C",
   "form": "(pill / tablet)"
  },
  "6": {
   "time": " T+ 2:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  "7": {
   "time": " T+ 9:30",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 }
}
