{
 "title": "Unexpected Fear",
 "author": "pseudonym",
 "citation": " pseudonym. \"Unexpected Fear: experience with Cannabis (ID 39223)\". Erowid.org. Apr 11, 2005. erowid.org/exp/39223",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>I was at a concert with my girlfriend and our friend, and about half way through the concert my buddy pulled out a joint. I hadn't smoked weed for about 4 months (before that I did it almost everyday, but when I met my g/f she helped me quit) so I knew I would get pretty stoned. I began to toke and everything felt pretty normal. When the joint was done, I felt pretty high, the sounds on the speakers of the guitarist here tripping me out a bit. As I was standing there, I felt kind of dizzy, and my vision was getting a bit distorted. I felt the need to sit down or get some water, so I told my girlfriend I would be right back (not telling her I wasnt feeling too good). I went to the bar to get some water. There was about 3 people in front of me. After standing in line for a while, I began to get even more dizzy, at times as if I was going to collaps. I wasnt even sure if I even wanted water or if I wanted to just lean on the bar.</p><p>For some reason I thought I was at the bar and leaned forward falling into the person in front of me, I said sorry and gave up with the waiting. I sat with a group of people near the bar on the ground. I think some of them tried talking to me but I just didnt feel like talking because I was starting to feel better. I then started thinking about how my g/f would proberably start worrying about me, so I started back in the crowed to find her and my friend. On the way my vision went all white and I could hardly see anything, so I went out in the lobby where it was slightly cooler and sat down, after sitting for about 10 minutes I felt more 'really stoned' rather than sick anymore. So I went back to see them and I asked her to just sit with me for a while and she did, and I got better and continued watching the show after.</p><p>One thing to note is I usually have an anxiety problem in large crowds, but I dont usually get anxiety at concerts because I go to them so much. But since I hadnt smoked pot in a long time, I proberably wasnt used to the atmosphere, so that is what proberably made me sick. Im more used to relaxed atmosphere's from passed experiences with pot.</p>",
 "year": "2004",
 "id": "39223",
 "gender": "Male",
 "timestamp": "2005-04-11T07:00:00.000Z",
 "views": "4805",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
