{
 "id": 3923,
 "title": "Tunnels",
 "date": {
  "submission": "2007-05-30T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Mentalcapacity",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "Setting: My home with wife as sitter, late evening.",
  "Dose: 1 bowl 5X EXTRACT",
  "I wasn't going to submit my experiences because I feel people tend to be mislead or abuse such information. Yet, I strongly feel this should be read.",
  "I used to be very much into the use of legal or illegal substances for the high, but as I grew older, I wondered more about the potential of opening my mind to new ideas and places. I have somewhat of a backround in substances that are psychoactive and hallucinogens. That doesn't mean anything, and is really worthless knowledge when we are dealing with Salvia Divinorum. I wanted to make my journey with Salvia somewhat spiritual and educational one. I was interested to see what my brain has the power to do with a little help. Throughout the many reports I have read about Salvia I learned of its short onset and duration, the fear of its intensity and its disasociation of mind and body.",
  "I did as I always do with new substances, take it slow with a smaller dose than indicated throughout my research. Half a bowl, plain dried leaves, smoked....nothing. I can tell you that reading the reports made me more nervous than anything, but I kept going. Finally after quite a bit I felt a rush I cannot describe. It was almost a body high, but a bit like a seperation of ones' self. I found myself able to move about, although like I was intoxicated. Vision was a bit blurry, objects almost liquid, and music almost tangible. I decided earlier to play instrumental trance music by ATB, to help me stay calm and relaxed. I felt almost as a carefree child, playing, no cares in the world.",
  "My wife actually became startled by my actions and my giggling. I told here to keep me laying down and follow the rules of a sitter, I instructed I was okay, and that was it. I realized I was coming down, and something told me that I couldn't stay and play, and with this realization a rush of emotions. Happiness that I had been able to feel this way, saddness that I had to leave and may never return. So I bought more one week later. I have learned that I personally can smoke my smaller bowl to my waterpipe and stay at a 'just off baseline' level. No matter how much I smoked I couldn't go any further. Did I want it too bad? Did Madre'Salvia think I wasn't ready? Was I not ready?",
  "I loaded the bowl with 5X Extract. Lit the bowl and thought to myself that I may need another one. But it was already to late, she was pulling me. The Salvia had already taken hold, and I barely had time to turn the light off and lay down.",
  "I believe now that I was not ready. I had no idea just how strong and mind altering this was. Something spun me into a group of dimly colorful tunnels. My senses turned to fear, thinking to myself, 'I am not ready, Let me free, I am sorry I'm not ready.' As I look to these tunnels nowing that if I can make it to the top my wife is laying right by me and she can turn on the light, and bring me safely home. But I couldn't find her. No matter how hard I tried to work my way through these wholes, there would only be more. They would shift with me as though they were an unsolvable puzzle.",
  "Somehow I managed to physically turn on the room light, but they were still there, and then I saw her, lying besides me, my wife. That was all I needed to temporarily ground myself. But only to realize the Salvia would seem to roll me in and out of one place to another. I wiped the tears from my face, suprised at them in fact, for I remember being full of this intense fear, but not crying. My journey turned to stories and will stay with me.",
  "I cannot say that I won't visit Salvia again. But as a warning to all you who read this. I went into this with an open mind, trying to find answers and I did. You have no idea just how life changing Salvia can be. Or how intense fear itself can be.  Now on the Salvia Scale, I may have not been very far, but I know that it was far enough for me at that time.",
  "Be safe, have a sitter no matter what. Be open to what you see and learn. Stay calm, it will be over soon. But you will never forget it.  Respect the earth, its gifts, and one another.",
  "PLUR"
 ],
 "erowid": {
  "id": "27151",
  "citation": " Mentalcapacity. \"Tunnels: experience with Salvia divinorum (5x extract) (ID 27151)\". Erowid.org. May 30, 2007. erowid.org/exp/27151",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2511"
 }
}
