{
 "title": "The Best of Times. Worst of Times...",
 "author": "Don C.",
 "citation": " Don C.. \"The Best of Times. Worst of Times...: experience with Cocaine (ID 3924)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3924",
 "substance": "Cocaine",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>To make a long story short, I had alway been adamantly against coke.  I had tried acid in high school and decided that it wasn't for me.  I very much enjoyed shrooms and pot in college, and still do on occasion today.  I felt I had been ''round the block.'  Recently I discovered the dance culture and all things associated with it.  Ecstasy has been a lot of fun, though I think I have a handle on it - can't exactly afford to be 'slow' the next day when you're striving to make it in the New Economy and don't want to burn too many brain cells.  One night while partying, I was offered coke.</p><p>Despite the fact that I had been against it, I decided it was time to give it a go.  I could no longer tell my friends who were casual users not to partake if I had no idea what they were talking about.  Despite my fears of addiction, heart attack, and death, I had my first bump in a warehouse bathroom towards the end of a party.  Needless-to-say, I survived.</p><p>It's been mixed feelings ever since.  I've become a more regular user with a lot more friends giving it a go as well.  I never wake up in the morning after a night of partying feeling like I need a line to get things going and I don't crave it all the time.  Then again, I can't go out to a bar or party and not think, 'Hey, this scene would be a little bit better with some coke going around.'  It's just how it is.  Not to get religious, but reminds me of the Biblical story of Adam and Eve.  Once they tasted the fruit, they could never go back.</p><p>My experience is this.  I can now understand how a person can be pushed past better judgement seemingly against their will by a drug.  Use it only with friends in a fun atmosphere and only every so often.  I have had the experience of solo useage and it can make things unpleasant to say the least.  I can see how a person can lose control, and though it may seem a release at times, it can end up becoming quite frightening.</p><p>I've done a lot of things in my day, and coke is without a doubt the most addictive substance I've encountered (I've heard heroin is truly the most and I refuse to cross that line).  Use only with caution and care.  One slip and you can find yourself wondering what you've become.  I know.  I've been there and back.  If you find yourself doing lines on a Tuesday night, by yourself just because it's there, check yourself.</p><p>-Every time that wheel turn 'round, bound to cover just a little more ground-  The ever-Grateful Dead</p>",
 "year": "2000",
 "id": "3924",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-26T08:00:00.000Z",
 "views": "13286",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
