{
 "title": "I Understand What Makes Me Unique",
 "author": "Walviaor",
 "citation": " Walviaor. \"I Understand What Makes Me Unique: experience with Mushrooms - P. cubensis & Cannabis (ID 39248)\". Erowid.org. Aug 14, 2007. erowid.org/exp/39248",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "145 lb",
 "report": [
  "<p>[Erowid Note: The author of this report did not specify if the mushrooms in question were fresh or dried.  It should be noted that 10.5 grams of dried P. cubensus mushrooms is considered an extremely high dose, see mushrooms Dose Chart]",
  "I have tripped a fair number of times on various substances, at reasonably high doses, so I figured it was time to do some serious exploring.  It just so happened that I ended up at a friend's house on a Tuesday night, to pick up some pot.  At the friend's house, we weighed out an 1/8 ounze of pot and she pulled out a bag of mushrooms.  I was pleasantly surprised, and we weighed out a 1/2 ounze of mushrooms, and I went home with pot and mushrooms in hand.",
  "On examining the mushrooms, I noticed the stems had very slight blue bruising, and were covered with tiny little metallic-looking speckles, closely resembling fools gold.  I know from experience that golden speckled mushrooms are very potent.  Last night after work I smoked a joint with a friend and ate approximately 1/4 ounze of the mushrooms.  My friend left about 10 minutes later, to drive home.  Here's a summary of my experience and some of the things I learned.",
  "T+30 mins: Watching television, waiting for effects to kick in.  Feeling funny, slightly buzzed, thoughts seem faster. ",
  "T+45 Visuals start, with the carpet looking more 3D and the walls shimmering slightly.  Everything looks pastel, and more colorful.",
  "T+1hr Now laying on the couch, saying 'Oh my god' and 'Wow' because my body felt so good, the mushrooms were really kicking in.  The stripes on the couch were moving with energy and the shadows on the couch made it look like it was rippling.  I kept hearing music playing, when I knew that there was no music.  I roll a joint but have no energy to smoke it.",
  "T+1.5 hr  I receive a phonecall from my friend S in chicago.  Talking on the phone seems strange and the conversation is very strange with long quiet phases, followed by us saying things that made no sense. I believe from the way he was on the phone, that he was tripping as well.  I call a friend, M, and say 'Man you should come over and chill'.  He says 'Yeah, I'll come over a little later.'  I call my friend K and when she picks up the phone, she says 'Hello?'.  I say 'Hello.'  She says 'What's up?'.  At this point, I feel my phone melting into my hand, and it slides down the side of my hand and drops into my lap.  I pick up the phone again but it is so hard to hold onto because it keeps melting into me.  I get the phone back to my ear and K says 'Hello?'  I muble out 'Okay' and hang up the phone.",
  "T+2hr  I am unable to walk more than 10 steps around my apartment before my body feels so incredible that I have to sit down and exclaim 'Oh my god, this is so fucking good.'  I start to understand new things about myself, and how I relate to my surroundings.  I have reached a new plateau and I understand the correlation between things.  I look at my surroundings and see myself get sucked into a 2D plane, where everything is portrayed as a 2 dimensional image, all made of energy, and my body is trapped in this plane, moving with the will of the image.",
  "I understand what makes me unique.  And that is that I am experiencing something that is completely unique, and that no one else, at any time, has ever experienced exactly what I was experiencing.  And I realized that every moment of my life was like this.  I thought of who god was, and how god, being all knowing, and all present, was everywhere at every moment, understanding to the fullest, everything that everyone and everything is experiencing at every single moment of time, at the same time.  I started to think about time, and struggled to make the minutes pass.  It felt like hours would pass, and I would look at my watch and note that only 1 minute had passed since I looked last. ",
  "T+3.5 hours.  Once I have reached an understanding about these new things I am learning, I am able to function and walk around without getting overwhelmed at how amazing it all is.  I make an adventure to walk a block down the street to a seven eleven to buy a pack of cigarettes.  I smoked the joint I had rolled earlier to prepare for the outdoors, it was very cold outside.  I made it into the seven eleven, and packed my newly boughten cigarettes.  I chatted with the store clerk about the music that they were listening to (very trippy stuff as it is).  I went outside the store to smoke, then came back in and bought a strawberry soda.  Back to my apartment.",
  "T+4 hrs  I Measure out another 1/8 of mushrooms and consume.  I start to trip harder, but become unusually mellow and clever.",
  "T+5.5 hrs  I decide to embark on a new journey.  I embark on a one-mile walk through blistering cold to visit a friend.  I have been wearing my sunglasses the whole trip, to conceal my eyes, but I am looking over them on the walk over.  It is cold, but there is no snow.  Everything looks frosted over, and very, very blue, like I am part of a live action fantasy computer game.  I am feeling very cold, but I realize that when I look through my sunglasses, the world takes on an orange tint.  The warm colors pulse at me and I feel their heat, warming me up.  I feel the world getting sucked into a 2D plane again, and my surroundings stretch out, as if seen in extreme perspective.  I walk very quickly, but don't seem to cover any distance.  It feels like an eternity to walk 50 yards to cross a field.",
  "T+ 6 hrs  I vomited from over exerting myself and being so cold, though unable to feel it because of the warmth of the orange tones from the shades.  I arrive at friend's house, but he is not there.  I hang out with his new room mate and smoke a few bowls.  When I look up at the ceiling I can feel my eyes melting into my face and it feels odd and oh so good at the same time.",
  "T+7 hrs  I walk back home and fall asleep, waking to reflect on the trip.",
  "I feel like I have reached a new understanding of how to use drugs, and of how events relate to other events, and see more of a plan to the way things happen, and how our will can play a large part in circumstances around us, or at least how it can relate to them.  it was incredible to have the trip play with every single one of my senses, and various dimensions of vision, and most importantly, different layers of thought and understanding.</p>"
 ],
 "year": "2004",
 "id": "39248",
 "gender": "Male",
 "views": "2944",
 "dose": [
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 3:30",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 4:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  },
  {
   "time": " T+ 6:00",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "submissionDate": "2007-08-14T07:00:00.000Z"
}
