{
 "id": 3927,
 "title": "Definitely Not MDMA",
 "date": {
  "submission": "2003-10-17T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "DevilDoc",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "IAP",
   "form": "(capsule)"
  },
  {
   "time": "1:30",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "IAP",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:30",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I would like to begin by stating outright - in my opinion this substance is very different than mdma. For the first time I went into a first time trial run with a preconceived notion of what the experience should be like. What a grave mistake... next stop - disappointment.",
  "I read a few comments on IAP, a couple of experience reports, and one paper on experiments to discern why mdma (and other chemicals) can cause brain damage, and how that damage changes with different chemicals' modes of action. I believe it is this paper that caused the confusion revolving around the chemical's likeness to mdma. All the paper stated was the similarity of the two in terms of trained rats not distinguishing between the two and the absence of any noticeable brain damage (from IAP) when they dissected their brains.",
  "That said, now for the show. So at approx 2pm I weighed out 30mg from my newly acquired gram of IAP, put it into a gelcap, and downed it on an empty stomach with half-a-glass of water. Experience reports I read suggested that the compound should kick in within an hour, building steadily until around the 2 hour point. After an hour and a half I decided to up the dosage by 10mg (parachuted) when there wasn't even a first alert to speak of.",
  "About an hour later(t+2.5)I knew something was cooking, but didn't know why or how. There were no visual, aural, or headspace changes that I could detect at that time. Ok, time to watch some TV until this gets more interesting. An hour later there was still no noticeable difference, so I decided to see if I could augment the experience with some alcohol - the equivalent of 2 drinks (I prefer wine). The effects of the alcohol kicked in very quickly, and seemed to leave just as fast, leaving behind a new feeling... could it be the IAP???",
  "I went into the bathroom to look in the mirror to find my pupils completely contracted, strange when one is under the influence of alcohol, no? And shortly thereafter (t+3:15) I started to feel very different. A low level buzz (equivalent to maybe 30mg AMT) and a change in thinking were present, though I can't pinpoint that change in the least. It was just a general, 'hmmm, something's different.'",
  "While the body buzz came in waves, and eventually changed into a mind buzz (energy that seemed to just reside in my mind, not the jittery sensation of a body buzz), all I noticed were thoughts that came on and left quickly and abruptly. There were no abnormal thoughts, no introspection, and no empathogenic qualities to speak of. This started at about t+4 hours (where I was definitely at a +3) and went through the remaineder of the trip, which seemed to trail off from about t+6.5 until t+8, but I was not left at baseline. It seemed to leave me at like a + 1/2 (shulgin rating) for a very long time, in fact I was there for the next day and a half. Even now, 2 days later I still feel a tad off-baseline, but I can't pinpoint how.",
  "A couple of additions - from time to time as I would watch TV or stare at 2D objects they would appear to pop out... as in become 3-dimensional. Very strange. Also, toward the 5 hour mark, I looked in the mirror and my pupils were completely dilated (as tryptamines tend to do). There were no physical affects to speak of - no GI disturbances, no headache (usual for me when exploring the chemical world).",
  "To sum up - IAP is no mdma substitute, in my opinion. It was an interesting experience (aren't they all), but I don't know if it's one I will be repeating. Now I just need to figure out what to do with the rest! ;-)",
  "Be safe and have fun."
 ],
 "erowid": {
  "id": "27171",
  "citation": " DevilDoc. \"Definitely Not MDMA: experience with IAP & Alcohol (ID 27171)\". Erowid.org. Oct 17, 2003. erowid.org/exp/27171",
  "substance": "IAP & Alcohol",
  "views": "16683"
 }
}
