{
 "title": "Oneiric Potentiation & Experimentation",
 "author": "Faber",
 "citation": " Faber. \"Oneiric Potentiation & Experimentation: experience with Melatonin, Valerian, Vitamin B-6, Skullcap & Hops (ID 39327)\". Erowid.org. Apr 18, 2006. erowid.org/exp/39327",
 "substance": "Melatonin, Valerian, Vitamin B-6, Skullcap & Hops",
 "bodyweight": "245 lb",
 "header": [
  "DOSE:",
  "6.0 mg",
  "oral",
  "Melatonin",
  "(capsule)",
  "",
  "400 mg",
  "oral",
  "Valerian",
  "(pill / tablet)",
  "",
  "200 mg",
  "oral",
  "Vitamin B-6",
  "(pill / tablet)",
  "",
  "100 mg",
  "oral",
  "Skullcap",
  "(pill / tablet)",
  "",
  "50 mg",
  "oral",
  "Hops",
  "(pill / tablet)"
 ],
 "report": "<p>In December 2004, I had been reading quite a bit about the potentiation of extremely intense dreams through the use of Melatonin, Vitamin B-6, and Valerian Root.  This is an account of my first experience with those three chemicals.</p><p>For informational purposes, I am a 16 year-old male in high-school and living with my parents.  They don't like my experimentation, so I stick to soft and legal stuff like Melatonin and the like.</p><p>I first went to the drug store, and picked up some 'B-6 100mg Tablettes' and 'Herbal Nerve' tablettes.  Vitamin B-6 is said to aid in dream recall, dream lucidity, and dream intensity.  The Herbal Nerve formula contained a 1:4 extract of Valerian root, equivilant to 400mg of dried Valerian Root per tab.  The final product I picked up was Melatonin, which is used for resetting circadian rythm after a disruption (jet lag, for instance), and for getting a better night's sleep.  The pharmacist whom I asked to assist me in finding this item told me that they may soon be taking Melatonin off of the shelves, as there has been some research done that suggests it does: nothing.  I raised my eyebrow, and bought two bottles, just in case.</p><p>After getting the bottles home I decided on the following:</p><p>This meant taking two of each pill.  It should be noted that the Herbal Nerve Formula also contained Skullcap and Hops, but in smaller quantities (100mg and 50mg, respectively) whereas the Valerian Root extract (1:4) was at 50mg -- the equivilant of 200mg. </p><p>At 10:00pm exactly, I took all of the pills.  I had not eaten since about 5:00 or 6:00pm.  At 10:30pm, I went to bed. </p><p>What happened next was pretty interesting, and though the effects are hard to pin down, there was obviously SOMETHING happening.</p><p>I was dreaming of course, but everything was extremely vivid and hyper-real.  My dreams are usually quite fuzzy (but in colour, no less), but this time they were vivid and sharp.  At one point, I dreamt I woke up in my room to the fact that my parents had found out about my experimentation, and were very pissed for some reason.  I turned on my CD player, and started playing music.  After doing some stuff in my room, I suddenly woke up.  The dream had recreated my room down to EVERY detail.  It was most likely the most intense dreaming experience I've ever had, and I took a long time to realise that I wasn't dreaming anymore. </p><p>So at T+7hrs, I woke up.  I couldn't get back to sleep again for some reason (possibly the melatonin), but I felt quite awake and chipper regardless. </p><p>I intend on experimenting further with these chemicals, specifically playing witht the Vitamin B-6 dose, as it seems to be the most powerful ingredient according to other experience reports.</p>",
 "year": "2004",
 "id": "39327",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-18T07:00:00.000Z",
 "views": "16999",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": "",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Vitamin B-6",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": "",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Skullcap",
   "form": "(pill / tablet)"
  },
  "4": {
   "time": "",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Hops",
   "form": "(pill / tablet)"
  }
 }
}
