{
 "title": "Trails on Fast-Moving Objects",
 "author": "Brewha",
 "citation": " Brewha. \"Trails on Fast-Moving Objects: experience with LSD (ID 39324)\". Erowid.org. Dec 31, 2004. erowid.org/exp/39324",
 "substance": "LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   " T+ 3:00",
   "1 hit",
   "oral",
   "LSD"
  ]
 ],
 "report": "<p>I have been a fairly common user of almost every drug available for the past 2 years.  I have used mushrooms, ecstacy, dxm, cocaine, crystal meth, various uppers and downers all about 10 times apiece. I have also been a daily pot smoker for roughly 4 years.</p><p>LSD was never really available to me though it recently has.  I have only used it a few times and on my fourth use I took a single hit that was of moderate strength and then another approxamitely three hours later.  After tripping for a very long time and eventually coming down and passing out, I awoke to find that I still had visual 'trails'.  It is very similar to the effect that the mouse pointer is capable of doing.</p><p>It has been roughly 4 weeks and I have ceased all drug use in an attempt to see if it would cause the trails to dissipate.  It has seemed to have little effect as I still see them on any fast moving objects.</p><p>HPPD has not interfered with my living but it becomes very hard to look 'hand talkers' in the eye.  My focus tends to drift to the visuals that occur.</p><p>I previously have been prescribed to xanax (used for recreational purposes only) and I will be attempting to use it as a treatment as I've read that the benzo catagories may have an effect. I hope that the benzo will have a dampering effect or that this problem will go away with time. </p><p>Since the other visual-inducing drugs never caused this condition despite excessive dosing and use, I would warn that lsd was most certainly the drug that caused this and that one might consider using other psychedelics if one feels the need to use them.</p>",
 "year": "2004",
 "id": "39324",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-31T08:00:00.000Z",
 "views": "8545",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": " T+ 3:00"
  }
 ]
}
