{
 "title": "Reality Crystalized",
 "author": "FatFat",
 "citation": " FatFat. \"Reality Crystalized: experience with Cannabis (Crystals) (ID 39335)\". Erowid.org. Dec 29, 2007. erowid.org/exp/39335",
 "substance": "Cannabis (Crystals)",
 "bodyweight": "90.1 kg",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I, prior to this experience, had smoked pot 3 times, but they had not worked very well. I had not even a good introduction into the true nature of 'stoned.' My mindset at this point was a mixture of curiosity and unwillingness because of lack of understanding. My accomplice was a very good friend of mine and had gotten into marijuana in grade 7 (when he was 12), had nearly stopped in grade 8, then began again in grade 9. And at this time I was also in grade nine and 14. I was a very melancholic, self-isolating, and whiny being back then. I was very sensitive, and had no mental discipline and no fully formed concept of my spirituality. A very typical grade nine in many ways.</p><p>Back to the experience, me and my friend had gone to hang out on a Saturday, I had no intention of smoking. It was a very nice day out, sunny, not too wet or dry. It was a regular spring day. My friend was smoking a fair bit of pot then and had brought along a five piece that he'd pinched from his older brother which he termed 'B.C. shit'. He said that he was going to smoke whether I did or not, I didn't mind anyway, so we went to a large ravine near my area. He asked if I could help him roll the pot into the paper, and I said sure. At this point I said that I liked the ritual better than the actual smoking. He brought out the bag, which was filled with a very fine, yellow, and hairier looking pot then I had seen before. What I didn't know, and he did, was that it was actually crystals scraped out of his brother's coffee grinder that he put away separately. I asked him if it would get me 'high enough,' because of my previous disappointing experiences. He said 'maybe,' in a very laughing manner.</p><p>He didn't know how to roll except with lined paper and that is what he used. I helped do a 'cheater's roll', where one rolls the joint before putting in the pot and widens the opening with a pencil. We did that with two joints, and he lit it, and was going to smoke it all, and I couldn't resist, so I said 'Please pass that.'</p><p>After smoking, I coughed and burped and, like he said, it tasted like milk. I think anyone who has smoked pot knows the feeling afterward. We walked up the stairs out of the ravine and it hit me as we were crossing the street, a lady passed us by and she looked like a pop-up book character. Nothing made sense. My friend who is short and stocky seemed evil and troll-like. I could hardly walk. At first it seemed like a video game, then a cartoon then a dream, or all of them all at once. To go where we were going we had to go through another, smaller ravine in my area. I for some reason was visualising/feeling a bouncing mushroom. I exclaimed to my friend 'I never knew you could feel like this.'</p><p>He said he would give me directions, he just tripped me out, telling me to walk with my toes 'on the inside out.' After exiting the ravine, I felt like I was floating. As well, there is a parking lot to a grocery store and it was barren. I couldn't believe that I was real or that anything was real. It was the first time everything in my mind became an abstract concept in the universe. I said to my friend that 'I am pulsing in and out of reality.' He just laughed.</p><p>For some reason the nice day had turned gray, and there was a pervasive fog that was everywhere and hard to see through. I kept asking my friend To stop me before traffic came because I thought that my legs were turning into a wheel. After a while I got body heaviness and really felt what gravity was for the first time, I felt like a bowling pin being swung every which way. We tried to find our other friend's house, but couldn't.</p><p>This was a very good experience over all, though I put many details in it, there were some very profound changes my consciousness underwent after and during the experience. It opened a new perspective for me. Now, without pot or drugs I access these states easily, and I meditate quite a bit. I don't smoke pot because I find, while I learn from the experience, I only do the big learning once, the rest is all details, as well, I can only focus on pot itself as the controller while on it, not myself as the guide of my existence.</p>",
 "year": "2003",
 "id": "39335",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-29T08:00:00.000Z",
 "views": "5057"
}
