{
 "id": 3933,
 "title": "Coma Like State",
 "date": {
  "submission": "2007-10-17T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Tripper22",
  "gender": "Male",
  "weight": 63
 },
 "dose": [
  {
   "time": "0",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:30",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "3:15",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Let me start by saying that I have had a decent amount of exposure to drugs (weed, amphetamines, LSD, hydrocodone, morphine, methylphenidate, nitrous, DXM, opium, and ephedrine) and this is by far the worst experience I have ever had with drugs. I have experimented with Hydrocodone, Amphetamines, and Marijuana the most out of these drugs, so I can say I've been greatly experienced in the usage of the drugs in this report.",
  "A friend gave me a full bottle of Adderall (about 120 20mg pills) at school one day. I had taken Adderall XR earlier this year but I lost all tolerance. After 2 weeks of building up a tolerance to 160 MG (8 pills) I lost interest in the drug alone and decided to combine it with another drug. At the time the only other drugs I had was Ephedrine and Hydrocodone. Ephedrine for me is almost exactly like taking Adderall but with more hallucinogenic properties. Anyway I chose to combine Adderall with Hydrocodone.",
  "I have taken Hydrocodone for a long time but in increments to where my tolerance stayed around only 2 7.5 MG tablets. I started by taking 6 Adderall and after an hour of no effect I took 3 more and then I began to feel the effects. After getting into the speed high considerably (about 1 and a half hour after taking the extra 3) I decided to take 2 hydrocodones. After taking these I felt very slightly different from the regular speed high. 45 minutes later I took 1 more hydrocodone. Now after taking all these I felt extremely focused. Even more than the Adderall could do alone. It was the upmost feeling of being able to do anything. Time flew by as what seemed to be 2 minutes would be 20 minutes. I took all of the drugs at around 11:00 at night. I planned on staying up all night.",
  "I spent about 5 hours from there constructing a box type of thing to hold my audio wires and plugs. I had no idea why I put so much into this but to me it had to be perfect and I had no problem with it being perfect since I had the feeling of being able to achieve absolute perfection in everything. It was 4:12 AM when I finished the box. This is when the nightmare started.",
  "I began to feel extremely nauseated. The type of nausea I get when I take 7 hydrocodones with no tolerance. I began to make myself throw up because in my personal experience of taking hydrocodone it helps to throw up if the high turns bad. I did this and had no avail. I felt more and more sick with every minute going by. I decided to lay down and attempt to sleep. While laying there I felt my heart rate and began to become extremely terrified of my heart stopping. The heart beat I had was extremely irregular and it would at times seem to stop for as long as 5 seconds. Another effect this had on my heart rate was it would speed up to an extreme rate while breathing in. I tried my best to keep calm and keep a steady breathing rate. Then I fell asleep.",
  "I honestly think that after falling asleep I entered a coma like state. I had been listening to music and I had it on a playlist where it would play all night when I went to sleep. The night was extremely confusing. I layed there and heard every song at least 4 times and felt half way awake even though I felt deep in sleep. My brain was still functioning, still working, and still able to ponder thoughts on an awake level while being asleep. I seemed to gain abilities I never had such as laying there asleep and thinking 'I don't like this song.' then I would wake myself using my thoughts and change the song. I know it sounds rediculous but it is the only description I can give of the feeling.",
  "The next morning I woke up and had to go to school. Before I went I threw up 3 times and then 2 more times when I arrived at school. I slept through my first class and had the same effect I had the night before. For the rest of the day I felt the worst I had ever felt in my entire life, and that is saying a lot. I extremely disapprove of mixing any amphetamine-like drugs with any opioids. My experience was so bad that I have decided to never take any pills again. If I so much as look at the hydrocodones in my drawer I began to gag. The same goes for the Adderall pills.",
  "I was afraid I would die that night. I felt at times that I would never wake up or that I had died and I was still thinking in a spirit like state. It was extremely frightening."
 ],
 "erowid": {
  "id": "27193",
  "citation": " Tripper22. \"Coma Like State: experience with Amphetamines (Adderall) & Hydrocodone (ID 27193)\". Erowid.org. Oct 17, 2007. erowid.org/exp/27193",
  "substance": "Amphetamines (Adderall) & Hydrocodone",
  "views": "38323"
 }
}
