{
 "title": "Buzzy High",
 "author": "Jason",
 "citation": " Jason. \"Buzzy High: experience with Blue Lotus & Cannabis (ID 39346)\". Erowid.org. Nov 27, 2005. erowid.org/exp/39346",
 "substance": "Blue Lotus & Cannabis",
 "bodyweight": "58 kg",
 "report": "<p>Been a Buddhist and very interested in the relationship between plans and humans and the shape of flowers and mandalas I was very interested in Blue Lotus. Well it arrived in the mail about 1 hour ago. 50g of dried flower & leaf. I am a daily cannabis smoker but I decided to just have the lotus first to see what its like from baseline. Well all I can say is very interesting effects so far. I had a water Bong with a medium sized cone of the dried herb & then sat in front of tv and waited. I felt this was probably not the right thing to be doing but decided to just blob anyway. After about 5 minutes mild effects kicked in. After 10 minutes not much more, just a relaxed and pleasant feeling. Then I had another biggish cone approx 15 mins from first one...</p><p>now its about 45 minutes in total from the first hit and the effects seem to be steadily increasing as I type this. No apparent changes in pupil dilation although turning the light off and on in the bathroom while watching my pupils change was strangely fun! Definite buzzing in the head, crown area and cheeks/jaw feel strange. I would have to say the effect Im getting now is very similar to 1/2 a mdma pill! Seriously its really quite lovey and warm and tingly. Also noticed my neck feels kinda tingly and odd, like a pleasant warming sensation. Now noticing it in the chest area also. Seems to have a stimulating effect of the upper chakras. Also feel a little giddy, like off balance. Unsure at this stage if I should smoke more or try some weed as a combo... if this is the effect of just smoking it without wine then Im impressed so far! Decided to try another cone of lotus to ascertain what else may happen..back soon...</p><p>Well my dealer just turned up with some rather nice sticky weed so Ive now had a good hit on a pipe and the combination is (I paused here for half a minute because I just couldnt find the right word/s to really describe it effectively). Firstly without even the weed there are a number of subtle psychoactive effects which are quite hard to put a finger on, kinda hypnotic but also buzzy and trance like feelings. But now Ive had some mj its amplified the effects of the lotus but also created a very cerebral trippy stone too. I should mention that Im naturally fairly sensitive to most substances so I tend to be able to differentiate a number of subtle effects that may not be that strong. I tend to babble too sometimes when writing...hey thats strange when I said the word 'babble' I immediately thought of an remembered a connection with a cd called 'babble' and a whole stream of memories and so on were just triggered from that word, it resonated with that holographic memory and bade me to think of it.</p><p>Well thats all Im writing about this experience and I might end up writing 10x this much far too easily. The mix of the weed & lotus is very interesting I must say!! Effects now after 25mins from smoking the weed and about 1.25 hours from smoking lotus are great. I feel ?!!, I will really try and sum it up here; light & trance-like slightly trippy high. I feel some link with the other parts of me, some awareness of multidimensionality and less interest in the body...an activation of something in the upper back of the neck! like a pool of clear blue cooling something was moving through my neck and spine and arms...now Im laughing and shit...getting some kinda ecstatic buzz, it seems that just writing about the back of my neck and the feeling has made it wash over me totally like a wave of pleasure... this is way better than just weed, its so loving and warm and cool at the same time...thats all...Im off to explore music on this... this is like been on e without the wasted feeling... thats the best description I can give...</p>",
 "year": "2004",
 "id": "39346",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-27T08:00:00.000Z",
 "views": "8728",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 0:15",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(dried)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
