{
 "title": "Light Me Up",
 "author": "Demotriton",
 "citation": " Demotriton. \"Light Me Up: experience with 2C-I & Cannabis (with Salvia divinorum?) (ID 39356)\". Erowid.org. Jul 20, 2005. erowid.org/exp/39356",
 "substance": "2C-I & Cannabis (with Salvia divinorum?)",
 "bodyweight": "170 lb",
 "report": "<p>I had nothing to eat for 9 hours prior to ingestion. Found that sipping a coke helps with the nausea.</p><p>T:  0:00 Use the graph paper method and divided 100 mg of 2C-I into roughly e equal piles. I know this is not recommended, I tried dissolving a small amount in ethanol, but this stuff doesn't dissolve at all in ethanol and from other trip reports it sounds like this stuff doesn't dissolve well in water either so I took what looked like the smallest pile to be on the safe side.</p><p>T: 0:17 Experience very mild stomach discomfort.</p><p>T: 2:00 I've read that this stuff takes a long time to kick in, so after 2 hours I smoke a bowl of MJ. There must of been a little bit of Salvia divinorum in the bowl left over from when I used the waterpipe last cause I could feel the effects come on strong for a split second, think 2C-I greatly enhances Salvia. The 2C-I also kicked in the same time a smoked the MJ think MJ enhances 2C-I to some extent.</p><p>T: 2:37 I am feeling the full effects of 2C-I. Feels like my body has 'Lit' up. Feel surges of energy rushing through me sort of like a full body massage. Colors appear so brilliant at times it hurts my eyes, see rainbows, and 3-D skeletons coming out of the closet, see people out of the corner of my eyes and even feel like I am becoming different people that live in the apartment. Once in awhile it feels like laser beams are shooting through my body, at times this gets a little too intense and my heart rate greatly speeds up for short periods of time, think I took the perfect dose for this drug being I would not like the effects I am feeling to be any greater.</p><p>T: 5:00 I have come down quite a bit now can still feel the effects but am no longer peaking.</p><p>T: 12:30 STILL feeling the after effects.</p><p>Conclusion: This drug has a very synthetic feel to it and the after effects, although much more milder, seemed to last through the next week. Took some DMT the next day and that brought back some of the full blown effects of this drug. Also when I smoked MJ it brought back some of the effects. All in all this is one drug to be VERY careful with the dosage and is strong stuff. I couldn't pee while peaking on this stuff, and when I finally could the effects diminished quite rapidly. This drug is best to take with other people since the coolest thing to do on it was to talk to other people.</p>",
 "year": "2004",
 "id": "39356",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-20T07:00:00.000Z",
 "views": "4220",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
