{
 "title": "Deep, Divine, and Mystical Realization",
 "author": "Sensi",
 "citation": " Sensi. \"Deep, Divine, and Mystical Realization: experience with Mushrooms - P. cubensis (ID 39369)\". Erowid.org. Jun 20, 2007. erowid.org/exp/39369",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "4.2 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)",
  "",
  "4 hits",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>On this particular occasion, I was in a great mindset, very positive and looking forward to what I would soon experience. This occasion followed a few previous experiences with cubensis in the week before, but none of which were as overwhelming and high dosed as this. I kept no track of time whatsoever during this event, for if I had, I would have found time to be utterly senseless and would have been mentally unable to keep such a log. This was my third time using mushrooms.</p><p>It had been planned  my parents had left on vacation and I had the house to myself, so I brought my good friend cal along for another mushroom ride along with me. We had eaten very lightly, the sun was going down about this time, and it wasnt too badly cold. We separated my remaining bag (Cal took about 3.2), took some time to gather thought, prepare for the experience, get adjusted to our environments, and slowly munched down our dry shrooms.</p><p>We sat in my living room for a while, waiting for effects to come on and very speedily I began feeling the weightless mushroom effect, as if floating. My thoughts were surely scattered and I was growing increasingly anxious to reach the peak  which seemed to extend far beyond what Id imagined it would. Cal put in The Doors, Im unsure of which album. It would soon set the mood and theme for our trip. We went in and out, from my living room which played our music, to the porch in my backyard. My dog would sometimes come see what we were up to, and I remember turning to Cal and saying Look at my dog! His golden brown hair shimmered and rose straight up swaying in the wind. He looked absolutely gorgeous. It was after this sight that we determined that the mushrooms had completely set in, and it was glorious! Greens and blues became deep, rich, and bright.</p><p>The plants in my backward came alive, moving with vibrant life, swaying back and forth. I could clearly see the patterning and unified seamlessness that makes up our earth, the pattern in everything from the grass to the carpet inside. I looked off into the woods and saw what I thought to be some sort of tree monster with a clich scary face  but I just laughed at its sight. The lawn looked as if it was swaying back and forth in unison, and I remember turning to my side to see dozens of faces on the rough-looking bricks. My dog would sometimes come see what we were up to, and I remember turning to Cal and saying Look at my dog! His golden brown hair shimmered and rose straight up (as if gravity were reduced) and he looked absolutely gorgeous.</p><p>One woman smoked a cigarette and the smoke rose up and out of the reality of the wall past my face. Each person was different and doing different activities. That was when I realized that I was on a much higher level than Cal was, as he clearly wasnt seeing near as much as I was. The cold October air was soon too cold to bear outside, so we retreated inside after finishing a bowl of kind. Cannabis was nearly undesirable to me in my mushroom state. We were completely satisfied with what was felt, and didnt feel any yearning to smoke any more than a few puffs.</p><p>I was soon so immersed in the experience and my realization of the mushrooms power and awe inducing greatness that I was no longer able to speak anymore. I began over-analyzing everything I thought, every action I made. I would attempt to find words to explain what I was thinking and feeling, what was occurring within me and words became absolutely inadequate. I became caught up in thought loops and began self exploration. I broke down myself, and its certainly been said before my ego was shattered. But I always thought that people meant an ego to think too highly of ones self, or to boast about your achievements and riches. </p><p>It was then that I let go and fully immersed myself into my experience and any direction that it may go. We sat comfortably watching paintings come to life, wood floors swirl and twist, and all that had life was alive! At that point I felt the equal presence, life, and energy coming from the plant beside me as much as I felt from Cal. I accepted the plants and trees as having just as much worth, energy, and presence in my environment, in my surrounding as all the human beings on this planet. I saw us all equally and beautifully. I smiled endlessly and effortlessly as happiness flowed in and out of my being. I was genuinely happy to share such an experience with someone else, and I managed to thank Cal for being there with me, though the sentence was difficult to mutter and get through (my speech was most definitely impaired).</p><p>As hours passed by I was again caught up in the thought loops and repeating scenes, repeating everything! I stood and watched Cal say something to me but his words slurred together into an incomprehensible babble as he reached his hand out to me. This situation repeated over and over in my vision. I was stuck in the world of dj vu! Instead of completely freaking out, I decided to use this power to my advantage. As this scene occurred over and over again I evaluated the situation and could only conclude that I was a controller of time. Time had slowed so greatly  to such an in uncomprehending degree that I felt I had infinite time to think about anything at all that I could ever want to think about. I felt that I had infinite time now that there was no time. This feeling is very difficult to explain, and Im certain that its been attempted to be explained by many more than just I. Still stuck in the loop, I had beautiful multicolored visuals spiraling across the forefront of my vision. I was deeply entranced in a mental focus.</p><p>I cant say all that I thought through, and all I thought about, but it led me to the divine essence and true nature of the sacred mushroom, a spiritual enlightenment and genuine feeling of nirvana. I had acquired spiritual awareness, and awareness of my own potential.</p><p>My thoughts were directed into pure positive thinking. It led me to clear realizations, and a refreshed and cleansed mind and soul. Everything about the mushroom and its effects were a completely natural feeling to my mind, my body, and my soul. I felt true authentic peace with my world, myself, and everything in it.</p><p>After all this mental craziness Id worked my way through, I felt physically tired. By this time it began to grow dark and I told Cal I was going to lie down upstairs. He thought this to be particularly strange behavior at the time. Cal came up after awhile, and I was curled up for warmth in my bed after having fallen asleep. He asked me to go on a walk with him so I got myself together and we walked up and down my road with shroom effects greatly subdued. I felt I could drive fine by then so we went for a ride, smoking the rest of my kind bud and cigarettes out of town on country roads watching the stars and the dark silhouettes of trees that still held a very shroomy appearance.</p><p>This experience was one of the most memorable, spiritual, and fun times of my life.</p>",
 "year": "2004",
 "id": "39369",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-20T07:00:00.000Z",
 "views": "2409",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4.2 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
