{
 "title": "Less Nausea, Same Headache as Previously",
 "author": "five-",
 "citation": " five-. \"Less Nausea, Same Headache as Previously: experience with 5-MeO-DiPT (ID 39392)\". Erowid.org. Feb 2, 2005. erowid.org/exp/39392",
 "substance": "5-MeO-DiPT",
 "bodyweight": "150 lb",
 "report": "<p>I had tried 5-MeO-DiPT once before orally at 25mg and had an ok experience, vomitting once, getting quite the headache afterwards. Wanting to try something different, not having much else to do, and not being able to find any documented report of foxy used this way, I decided to try this New Years doing foxy rectally. I took approx 50mg of powder I recently aquired from a friend, mixed it in a small dish with some warm water. it was just a couple teaspoons of water, I then used a wierd plunger thing to suck up the water.  It was quite easy to insert the water rectally and didn't sting or anything. I felt something instantly, shapes sort of seeming to move in my vision, shadows shifting. </p><p>After a couple minutes passed I was amazed at how rapidly it was taking control. I could see a rainbow of colors patterned over everything, got the strong body high that is common among many tryptamines. I was sweating profusely, slightly nausiated there was remarkably less nausia then when I tried it orally. A lot of abstract thoughts seeming to come from nowhere during the trip.  It lasted about 4-5 hours till I started coming down and got the same headache as I had previously taking this substance. I am writing this 6 hours after dosing.  Still feeling headache and a light residual body high.  I feel suprisingly refreshed. I'm not really sure the proper term for using a substance this way, the best i can think of is 'rectally'.</p>",
 "year": "2005",
 "id": "39392",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-02-02T08:00:00.000Z",
 "views": "6546",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "rectal",
   "substance": "5-MeO-DiPT",
   "form": "(liquid)"
  }
 }
}
