{
 "title": "Unexpected Effects",
 "author": "Psychonaut",
 "citation": " Psychonaut. \"Unexpected Effects: experience with B. caapi & C. cyanescens (ID 39396)\". Erowid.org. Mar 29, 2005. erowid.org/exp/39396",
 "substance": "B. caapi & C. cyanescens",
 "bodyweight": "78 kg",
 "report": [
  "<p>I must say, I never expected this effect. On new years eve, yesterday, we went to a party. At home I still had an ayahuasca mix, 30 g Banisteropsis Caapi and 30 g psychotria viridis. At 20.00 I took a little tiny piece of Bani, as big as a toothpick. I chewed on it and felt the subtle effect. At around 00.20 I ate my hawaiian mushroom leftover: 3 sticks and 1 little head. The weekend before I ate 5 times more, and had little effect.",
  "After 15 minutes, the trip gradually came, but faster than usual (without MAO) it was lighter, easier to sustain and very energetic. Heat flowed through my body, I felt love for everyone and started dancing. Strained muscles came to the surface and I danced them loose...I feel my body, because when taking mushrooms it will give me signs of where it doesn't feel well. I didn't drink alcohol that night, it's not a good combination with Mao-inhibitor, neither with mushrooms. A very important thing, was that I saw more then I could observe sober... people's behaviour was so relative and funny/stupid at times, people evaded my energy because I think I emit my energy, my chi and most people subconsciously can't handle that. Some friends had a fight that night, and I felt the pain and frustration in my bones when looking at those people. Important to do is to let that feeling/energy loose, feel it, and let it go. I don't need negative energy. It's hard to conserve my positive!",
  "The feeling lasted for 3 hours! Didn't know what to think, thank god I had some enzymes left in the liver, to break down the psilocybine hahaha. It was a great experience, very subtle and energetic. And very mystical if it would be in nature, but now it wasn't...",
  "I never take more than 1 gr with MAO...build it up, but I don't need much...really...respect the ancient mushroom, used for decades by indian people. They know how to use it, in europe we don't...respect it and love it, but don't be too eager. It will give back its love and consciousness. If I love my own body, I will have good experiences.</p>"
 ],
 "year": "2004",
 "id": "39396",
 "gender": "Male",
 "views": "10116",
 "dose": [
  {
   "time": "0",
   "amount": "3 in",
   "administration": "buccal",
   "substance": "Banisteriopsis caapi",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms - C. cyanescens",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2005-03-29T08:00:00.000Z"
}
