{
 "title": "Affirmation",
 "author": "Ste Sinn",
 "citation": " Ste Sinn. \"Affirmation: experience with Ecstasy (ID 394)\". Erowid.org. Jun 21, 2000. erowid.org/exp/394",
 "substance": "Ecstasy",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>My wife & I had been married 18 months. This was our first year experimenting with MDMA/E, after our first 20 sessions we decided to slow down. We went on holiday for two weeks, chilled out and returned refreshed. A big change in our lives occurred when we returned from our holiday, we moved to the other end of the country, away from all our friends and the places where we had grown up.</p><p>The move was a very positive one, we settled in quickly and felt that since we knew almost nobody this would give us plenty of time alone. Pretty soon we began to require a nudge back to our spiritual path; for us the usage of psychoactives is a very spiritual experience.</p><p>We located a source from where to purchase our substances and one Friday night we settled down to undertake our first journey in some 3 months.</p><p>After approximately an hour, we were both pretty high, we then realised that we had run out of chewing gum; what followed next was to change my perception of so called reality for ever. We walked to the local shop, purchased our chewing gum without anything significant to report, then on the return journey back home, we were walking through the local park, when I was confronted by a vision, a simple vision, a man sat behind a desk in an office. It could have been anyone in a million people. Reasons, theories and explanations flooded my mind, why was this man here appearing to me? I wondered.</p><p>We walked on and more people appeared to me, the trees were speaking and the earth was communicating, I felt alive in the most wonderful sense; I was at one with the Otherworld of the spirits and at one with the Earth.</p><p>Realisation smashed my face, I understood the visions, the communications; I knew why I was witnessing these wonders. I had transcended the constraints imposed by thousands of years of dominator culture on my brain and was able to access the most basic of all human functions, spirituality. These people who appeared to me were simply people functioning, their thoughts were embedded in the space that I was walking through, and I could access this simply through letting go. I had not realised that I had 'let go' but I had.</p><p>I relayed this information to my wife, she seemed pleased that I had received affirmation of my faith in my beliefs. She then informed me that I had been conversing with someone other than her whilst we were stood in the silence of the early morning air. Who it was I have yet to find out, but I now know that I can access the sane part of my brain, that anybody can. I now have to learn to control it.</p><p>Thanks for listening.</p>",
 "year": "",
 "id": "394",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-21T07:00:00.000Z",
 "views": "16241",
 "dose": {}
}
