{
 "id": 3941,
 "title": "DPT Is Terrifying",
 "date": {
  "submission": "2003-10-01T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "nameless",
  "gender": "Female",
  "weight": 45
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "So today I decided I would try DPT. I had no previous experience with DPT, and my only other psychedelic experiences were with LSD, mushrooms, and 2CB. I expected a mind blowing experience, but I had no conception what was to come. What follows is my immediate reflection.",
  "I insufflated 50 mg at 5:42 PM. I had expected a horrible burning and drip based on what I had been told about this drug, but it was hardly as bad as I would have imagined, certainly not as bad as cocaine or ecstacy. I sipped on some pop to help. I sat down on my bed, and after about ten minutes, I noticed the familiar psychedlic distoritions and patterning coming on. My body felt somehow unpleasent, and the force of DPT came on strongly, strangely, and in a generally unfamiliar fashion. I began to realize I had grossly underestimated what I had done to myself, and I feared what was to come. All within the first 10 minutes.",
  "I laid down and let the experience take over. Music was extremely influential and seemingly directed the trip. I found myself physically grasping for anything, myself, my bed, any physical object, to keep from flying away as my mind was. The entire experience carried an urgent need for something to grasp on to, and I came to realize that humans are driven by their need to find stability in a chaotic world in which nothing is stable or recognizable. The visuals were amazingly overwheming and almost painful to be within, and the music was the only familiar to measure the intense foreigness of everything against.",
  "I completely lost myself, language, and any ego. I would occasionally have a word pop into my mind and trying to recall its arbitrary meaning was a long, difficult process. I was ripped away from everything I knew and I didn't even realize what was going on until my roommate walked in and turned off my music. I couldn't bring myself to speak; I knew no language, and I could not bring myself to vocally respond in anyway since I was so deeply immersed in the drug and removed from reality. I was without my guiding force and I decended deeper into the chaos. I feared the pain would never end, that I would never see the world the same way, that I would be permenantly damaged. I felt as though I had died.",
  "The entire experience was extremely humbling. I realized I had been abusing psychedelics for personal pleasure and had lost touch with their overwhelming power. I now carry the utmost respect for all psychedelics, especially DPT.",
  "By 9:00 PM, I had emerged from the terrifying part of the trip in which I lost my ego and my reality and had begun rapid reintegration and reflection of my experience. This drug rips one from reality and throws them back into it with the same abrupt force. The visuals were still overwhelming, but my head was clearer, and I enjoyed a more 'typical' come down in which I pondered life, humanity, and myself.",
  "I began writing this report to help myself reintegrate at 10 PM, and it is now 10:20. Visual distortions are absent, but I am still not quite yet myself.",
  "Do NOT fuck around with DPT unless you know what you are in for. I am glad that I experienced it, but I am in no hurry to try it again, and I don't know if I ever will."
 ],
 "erowid": {
  "id": "27242",
  "citation": " nameless. \"DPT Is Terrifying: experience with DPT HCL Salt (ID 27242)\". Erowid.org. Oct 1, 2003. erowid.org/exp/27242",
  "substance": "DPT HCL Salt",
  "views": "28347"
 }
}
