{
 "title": "As Sick As I've Ever Been",
 "author": "Eligh",
 "citation": " Eligh. \"As Sick As I've Ever Been: experience with Alcohol & Cannabis (ID 39431)\". Erowid.org. Mar 28, 2008. erowid.org/exp/39431",
 "substance": "Alcohol & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "7 shots",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  "",
  "1 bowl",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Let me start off by explaining my backround. I am a 17 year old senior in high school and an average kid. I drink about every 3 months, smoke weed about 3 times a week, and occasionally shroom. I have never had an adverse reaction to any of these drugs, though I seem to have a weak stomache when it comes to liquor (throwing up and whatnot).</p><p>It was New Years night and me and a few friends were waiting for a delivery of shrooms at 'M's' house. We were waiting for about an hour when the news came in that obtaining our mushies would be highly unlikely, and almost immediately after I got a call from another friend that there was a huge party only a few blocks away. I said my goodbye to my shrooming pals and drove those 2 blocks to the party. When I got inside it was pretty empty but I was surprised to see 3 of my good pals just hangin out. I was contemplating getting drunk for about an hour when people just started showing up. Eventually there were about 40 people in the house, and that's when I grabbed a bottle of vodka and just started chugging it down.</p><p>I was really low quality and tasted like rubbing alcohol, but I didn't care cause I really wanted to get smashed. After about half an hour I was feeling really good, perfectly drunk and no nausea or discomfort. I was chatting like crazy and laughing with everyone and overall having an absolute blast. My friend 'J' then came up to me and asked if I wanted to smoke a bowl, and, of course, I said yes. We walked out to his car and packed a bowl of some pretty high quality chronic. After smoking we walked back into the party and thats when things went wrong. I have smoked and drank before without any reactions, I would usually just have a good time and wake up with a hangover.</p><p>When we got back into the party I started to feel really REALLY messed up, about as intoxicated as I have ever felt. The room was shaking, I couldnt hold my balance, and everything was sooo loud. I kept saying, 'I'm so fucked up, Im so fucked up' but it sounded like 'Ilm shlo fa-uked ap, Iam shoooo faaaacked oop' I was sitting on a couch just feeling horrible when I felt it in my stomache. I ran to the bathroom and puked into the toilet about twice, then headed downstairs to lay in the guest bed. My friend 'E' gave me some water and kept asking if I was okay, I told her I was fine and just wanted to rest, so she left me alone.</p><p>I woke up about 2 hours later and the party was completely dead, everyone was asleep. Then I felt it in my stomache again so I ran to the bathroom and threw up about 3 times. I went back downstairs and then ran back upstairs and threw up some more. The room was still shaking and my legs felt weak, I also couldn't think straight. I would throw up every 5 min and nothing was coming out, just dry heaves. My mouth got dry from dehydration and I couldnt drink water because I would just throw it up. The vomit was sticking to the inside of my dry mouth and it tasted acidic. I spent the last 4 hours of the night resting next to the toilet and just puking my brains out. I woke up around 9 in the bathroom. I got up and talked to my friends telling them how sick I was, my fingers were blue and my face looked pale. I knew I had to get home and by a miracle I managed to drive across town to my house. I pulled over the car once and threw up on the street.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>At home I told my mom I caught the stomache flu and went to lay down. She got me a hot water bottle for my stomache and I continued to throw up every 5 min for about an hour. The next day I felt okay, just weak and tired. I stayed in bed until I felt better, ate some food and gradually recovered. It lasted for about 2 days.</p>",
 "year": "2005",
 "id": "39431",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-28T07:00:00.000Z",
 "views": "4585",
 "dose": {}
}
