{
 "title": "Heart Problems from the Combo",
 "author": "Ase",
 "citation": " Ase. \"Heart Problems from the Combo: experience with Dimenhydrinate & Datura (ID 39477)\". Erowid.org. Aug 21, 2006. erowid.org/exp/39477",
 "substance": "Dimenhydrinate & Datura",
 "bodyweight": "295 lb",
 "header": [
  [
   "DOSE:",
   "20 tablets",
   "oral",
   "Dimenhydrinate",
   "",
   "2.5 g",
   "oral",
   "Datura"
  ]
 ],
 "report": "<p>At around midnight, I took 20 Dramamine tabs and 2.5 grams of Datura, BIG MISTAKE WITH THE DATURA. After only about 30 min I started to feel how I do when the flu starts out, not like a trip at all. Eventually, how long this went on I cannot remember, I lost all contact with reality and thought more or less that I had died. In all reality, from what my mother has told me, I removed all of my clothing, ran through the house naked and screaming about leaves and tree branches growing out of my grandmothers head, then I went into the bathroom and took everything out of the cabinet and arranged it on the floor, after that my mom said she didnt know where I ran off to.  Well Im guessing I blacked out, because all I remember now and could remember then was that I thought I died and somehow managed to wake up in my bed.</p><p>When I woke up, I felt very heavy and tired still, and my chest hurt. I realised I had been sweating badly because everything was soaked with sweat. I got up to go to the bathroom and immediately fell down with extreme chest pains, after about 5 min of this I started to black out again, the next thing I knew I was waking up in the intensive care unit of the hospital here. They told me I had suffered a massive heart attack from atropine like poisoning and that I was extremely lucky to even be alive at all.</p><p>After a few days and many, many tests, it came to be known that I had suffered a mild heart attack while on the chemicals, then the next morning from all the stress and residual effects from the drugs, I suffered the major one.</p><p>Now, Im only 24 years old, and have to take medication the rest of my life to keep my heart beating normal and to keep it from not racing out of control. The datura / Dramamine combo caused damage to the av nodes / natural pacemaker in my heart by causing far too much stimulation, which in turn caused me to have a heart attack, damaging my heart completely.</p><p>The doctors tell me as long as I take the medications and dont do this ever again I should live a normal healthy life, even Im a big person (maybe a bit of a factor in the heart attack?).</p><p>But I suffer chest pains and high blood pressure now, which I truly believe to be caused from that experience. Ive done both chemicals separate, and had some wild and fully whacked out experiences from it, oh which I hope to never experience again.</p>",
 "year": "2004",
 "id": "39477",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-08-21T07:00:00.000Z",
 "views": "14572"
}
