{
 "id": 3950,
 "title": "Consistently Positive",
 "date": {
  "submission": "2006-03-09T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "$m0ker",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "T+ 1:00",
   "administration": "20 mg",
   "substance": "oral"
  }
 ],
 "report": [
  "I took 'E' a couple times in high school and never quite enjoyed it, probably because I never truly got real MDMA. Years later, after being on prescription paxil for a few months and then quitting, I decided to try MDMA in an attempt to get rid of the paxil withdrawals/side effects and deal with my anxiety (the main reason I was on paxil in the first place). Before I go on, I should mention that I was basing my experiment on a few scientific studies I had read analyzing the possible benefits of MDMA and MDMA+SSRI's in treating anxiety, and a study that mentioned that SSRI's might actually cancel out the negative side effects (specifically lack of serotonin production) of MDMA, so I was eager to see for myself.",
  "I took a green euro pill (supposedly tested at an est. 90%MDMA 10%meth mix) and approx. an hour later took 20mg of paxil. The person I was with took a e-pill of the same type, but did not take any paxil. Throughout the night we both rolled hard, but I rolled happier. My roll did not consist of ANY negative feelings, while the girl I was with got a mild headache when we began to come down. The next day she was exhausted and felt a little 'e-tarded', yet I felt refreshed like I had reached a new level of life. For the following weeks I also noticed that my anxiety was significantly reduced and everything seemed much happier in general.",
  "Since this little experiment I have combined MDMA with paxil several times, and now I do not EVER take paxil without E and never take E without paxil. So far, every time has been the same - EXCELLENT, with no negative side effects."
 ],
 "erowid": {
  "id": "27288",
  "citation": " $m0ker. \"Consistently Positive: experience with MDMA (Ecstasy) & Paroxetine (ID 27288)\". Erowid.org. Mar 9, 2006. erowid.org/exp/27288",
  "substance": "MDMA (Ecstasy) & Paroxetine",
  "views": "13598"
 }
}
