{
 "title": "This Plant is the Keeper of the Gate",
 "author": "Salvo",
 "citation": " Salvo. \"This Plant is the Keeper of the Gate: experience with Salvia Divinorum (5x Extract) (ID 39519)\". Erowid.org. Jan 20, 2008. erowid.org/exp/39519",
 "substance": "Salvia Divinorum (5x Extract)",
 "bodyweight": "",
 "report": "<p>I had been reading about Salvia D. for a while. I chalked it up to being a load of crap. There is no way anything this powerful could have remained legal especially as it was discovered in 1960, 10 years before the drug war began and everything under the sun became illegal. But being the chump that I am I decided to try it.</p><p>Personally I have had my fill with drugs, there is no spirit in that life and it is a dead end. I aim to live a spiritual life and find truth and meaning. Having read about this plant and how it was used by the natives interested me and also, there is no drug culture yet around this plant and it's not real negative. So I felt it would be cool and I could be comfortable using it. I don't have to buy it from people I don't trust.</p><p>Ok, first I tried some plain leaves. I paid a shit load for these leaves, didn't want to wait for them to come in the mail. I had to make a water pipe,  bongs have like increased in cost by 400% in the past years; as I don't smoke weed or use any drugs I don't have any paraphenalia and I'm not casting down $100 for a bong to smoke once out of.</p><p>The plain leaves didn't do a damn thing. Nada. Well, they made me real hot, tasted bad, gave me feelings of pins and needles and I got kinda high holding the smoke in for long but that was it. I figured as much so I threw 'em away figuring I'd been chumped yet again in life. A while later, reading more, I figured why not give it another chance. This time I got some 5x extract. I figured I might be one of these hard heads. I really wanted to have an entheogenic experience and divine with God or gods or just something. I was not approaching it like a drug addict seeking to get high, and I wasn't going to turn to illegal substances to do this (it would be bad karma to me to do this and I'm too paranoid these days).</p><p>I loaded up a pinch and hit it with a micro-torch. Big hit. I smoke so it wasn't a problem. Let it out. Felt kinda strange. Took another hit. And than it happened.</p><p>Suddenly my vision began to swirl around. Everything became trapped on this 2-dimensional but oddly 3-dimensional swirling plane in front of my eyes. Objects in my field of view got caught into the spirals. What was peculiar was it was rather pentagonal shaped, perfectly at least, and the objects were fixed equidistant about these points.  All I know was a giant tunnel was spinning rapidly around in front of my eyes in broad daylight, pulsating in red and smoke swirls, and it goes deep, looking like a wireframe rendering on a computer, or perhaps a water colored painting all at the same moment of time; and I hadn't a clue what was going to happen as it was blinking through these states fast, slow, rapid and non-existant all at once and nothing at all, like a foggy smoke descending from some other dimension of reality. I didn't feel doped up. I wasn't fucked up like on weed or other drugs. I just saw a massive wormhole spiraling away into infinity in front of my eyes. I figured either I was going real crazy or this was some crazy ass shit I just smoked.</p><p>Suddenly, a voice began to speak-sing to me. It sounded something like a chipmunk recording but also as I perceived it was ancient, like some music of some ancient persons in some ancient place, but it was thick like guitar chords and definitely creamy like the texture of a salad dressing and just as smooth, that sounds silly but it was liquid like that. It was definitely female. And soothing. It was speaking to me in a language I never heard before and I hadn't a clue what it was trying to say. I didn't feel like it was hostile. I just suddenly decided this was as far I wanted to go at this point. With pure will I terminated it and it disappeared. I was normal. This must have happened in about 2 minutes time. I wondered about this for a long while before trying again. I was pretty sure this extract had been spiked with some kinda designer drug or something.</p><p>Being the scientific type, I investigated further to get to an uncontaminated source that I had control over.</p><p>Since then I have done it more and gone down the tunnel more and more. But I proceed with caution. And if my heart isn't right it won't work. It isn't the place to speak of the things I have seen and heard there. It wouldn't be believable even if I did. After all many people before me have come with this vision too. Now I know where they found it. It's kinda cool being connected to the cosmic web of the Universe. I know the future is very bright for me. I am blessed in so many ways. My enemies are no longer my enemies. I feel at peace.</p><p>It would be a shame if this plant became illegal.  It is completely controllable. It can be terminated with a thought. It is not a drug. It is an alien being living in the plant. Even the mazatecs don't have a clue where it came from. It's chemical structure is just a mathematical expression of it's name and location somewhere in the universe, like a phone number tapped out in the energy force of the natural existence, that you dial up with your brain; what does anything really mean other than it has a number or a name to describe it? The big question that no one has been able to answer is why anything exists. It is just theories and ideas explaining how it works  and nobody has a clue why we exist or what anything really means at all. We are trapped in a swirling paradox, a conflict of opinions and a lack of understanding. It is not that science is wrong, they are just grappling with difficult questions and answers that lead to more questions. I have always been drawn to Goedel's logic and the final proof that nothing is truly knowable and there is no final answer to the existence of the Universe because we are all trapped in this state of reality and can not break free to see the Universe from the outside in.</p><p>Peace to you all</p>",
 "year": "2004",
 "id": "39519",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2008-01-20T08:00:00.000Z",
 "views": "2679",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
