{
 "title": "Weight Seems to Matter",
 "author": "Falafel",
 "citation": " Falafel. \"Weight Seems to Matter: experience with Tramadol (ID 39532)\". Erowid.org. Jun 26, 2007. erowid.org/exp/39532",
 "substance": "Tramadol",
 "bodyweight": "155 lb",
 "header": [
  "DOSE: T+ 0:00",
  "450 mg",
  "oral",
  "Pharms - Tramadol",
  "(pill / tablet)",
  " T+ 2:00",
  "150 mg",
  "oral",
  "Pharms - Tramadol",
  "(pill / tablet)"
 ],
 "report": "<p>I find tramadol a very enjoyable Pharmaceutical. I have been experimenting with it for a couple weeks now. I found a half full bottle of it in my parents medicine drawer and knew it was no longer used.</p><p>I started off with just 1 or 2, and then on to 3 or 4, 5 or 6, 7 or 8 and so on. I find I seem to have a natural tolerance to all drugs I take, and this is no exception. It is a very pleasant drug, similar to what I would expect opiates to feel like.</p><p>One thing I discovered today is weight seems to play a big role, and also effects and side effects vary with every person. I brought a large amount of 50 mg Tramadols and being somewhat experienced with it, I popped 7 during class (450 mg).</p><p>Within half an hour I started to feel it kicking in. Everything seemed pleasant and I felt very relaxed and tranquil. I felt nothing could bother me and I stopped caring what other people thought and became more social (similar to a low dose of alcohol). I was sitting in my chair grinning like I was baked and not caring about the large number of notes I had to take.</p><p>About an hour later I reached peak and stayed there for another hour. When I felt it starting to wear off, I popped another three. From what I read this seems to be a large dose and some disapprove of it but I find it very enjoyable. I also gave my friends in class three pills each. Close to an hour later they said they started to feel very relaxed and chill. I would also get up often because I found walking around a lot of fun. Unfortunately, about an hour after one of my friends took the Tramadols, he started to feel sick. He got very pale and started sweating and shaking and said he was going to throw up. I was pretty surprised because I was on 500 MG while he was only on 150 and I have never had unpleasant side effects from it.</p><p>I asked him his weight because I figured it might be a factor. He said he weighed only 120 while I weighed almost 160. I figured this was why he felt sick. Anyway I felt very happy, kind, relaxed and open for pretty much the whole day. I stopped taking any tramadols for three days prior to the experience because I hoped to lower my tolerance and I feared dependence to them. I always take a couple days of break after a couple days of dosing.</p><p>Increase the Peace...</p>",
 "year": "2004",
 "id": "39532",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-26T07:00:00.000Z",
 "views": "44117",
 "dose": {}
}
