{
 "title": "The Long Lost Key to God",
 "author": "Nick",
 "citation": " Nick. \"The Long Lost Key to God: experience with Mushrooms - P. cubensis (ID 39543)\". Erowid.org. Jun 20, 2007. erowid.org/exp/39543",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "120 lb",
 "report": [
  "<p>I'll start off by mentioning this happened about half a year ago and from the experience Im a changed person and have now found my destiny through Jesus Christ king of all things.",
  "Now that thats outta the way let me explain my breakthrough. Me and my friend who was raised Christian decided we'd like to mow these mushrooms and take a little trip into this huge forest behind another friends house. We'd seen the power of these shrooms before but this was like nothing Ive ever read or seen before ever. So we get the shrooms from a friend measured up as 3.7 g for me and 3.7 g for my friend who has at least 100 pounds on me. So we smoke a fat bowl of the chronic before our adventure and then we were off.",
  "We ate the shrooms at the entrance to the forest and in my head I was asking God to seriously show us something meaningful this time no bad trips no fucked up games I just wanted some answers met. So were walking through the forest feeling like a million bucks we got our water bottles and a back pack each with some paper and pencils just in case something had to be written down.",
  "After about 30 mins we had walked our way pretty damn deep into this forest and I had never come to the spot where we decided to chill before. So were sitting down and I start getting a little bit of a wavy feeling in my vision almost like it started getting windy and the trees started becoming very vibrant and a lot more colorful. We both sat down on the top of this valley looking down onto a beautiful river just basically in the heart of the forest. Let me assure u our trip has not nearly begun.",
  "I turned on my mp3 so we could chill out and listen with one ear each and while we were spacing out a bit waiting for the shrroms to take hold my music which was some rap song completely stopped and started playing backwards and as fucked as this may sound we both looked at each other in fucking amazement took the headphones out and started tripping balzzz. Like what just happened there man my mp3 players all fucked up I say. My friend looked pretty damn spooked so we stood up and started walking down towards this river, this is when the shrooms quickly started taking a hold of me.  Trees became very shiny like the bark was made of a very colorful reflective metal and the patterns on the trees looked extremely similar to hieroglyphics and I have never known how to read that shit before but it was there and quite stunning. This next part is where shit basically hit the fan.",
  "My friend whips out a huge joint and we havent even started peaking yet. So were walking along taking huge hits off this joint and I dont even think the thing was half done before we threw it out and literally collapsed on the side of this embankment overlooking the river. I could feel insanely large surges of energy overcoming my body almost like I was outside in the cold my skin was felt like static and my vision started looking like a tv set with red blue and green dots. I couldnt stand up for my life so I just laid back and asked God to take this time to seriously show me who I was and who he was. I was no longer in my body it was like I was hovering a couple feet over my body the forest was no longer an ordinary forest it was a tribal meeting of the Gods kingdom and I was right in the middle.",
  "If I could have said anything at the time I prolly wouldve told my friend that I was losing my fucking mind but I couldnt say anything to him inbfact I basically forgot all about him while I was gone. The trees were beautiful people moving in a way that looked like they were dancing for me. We spoke to each other only through thoughts no words because words were meaningless at that point we were communicating with our souls.",
  "One tree I remember pretty vividly was a wise looking women with long black hair holding what looked like a new born baby and when my friends cell phone rang and he started yapping on it about how he was sooooo fucked making a whole lotta noise the woman became very frustrated and I felt a tension that forced me to tell my friend to shut the hell up and it seemed like he knew why as soon as I said it.",
  "After this point I cant quite remember what happened but there was an eye floating around in my field of vision it looked like a normal eye except a lot more detailed and the iris the colored part of the eye was rainbow colors and looked brilliant. I thought to myself if this isnt God looking at me I dont know what is. If I could draw this thing out like I saw it I could make a fortune I thought to myself. There came a point where this became much to intense like imagine being in a forest and every single tree is its own identity like a different person.",
  "The entire fucking forest was alive. I was just laying there absolutely stunned outta my mind. I thought to myself how the fuck can ppl pass this by as just some 'drug'. This is the most amazing thing that exists on this planet. Nothing matters in life but this experience I was thinking. The hallucinations became to strong and I felt as though I was falling asleep like tears came over me and I just turned my head and saw the sun started to shine through the trees and as I looked at this brilliant light glowing with every color of the rainbow I felt myself being sucked into it. And thats when I believe I entered into eternity for a few minutes in reality time. Let me explain this. I lost myself plain and simply I was no longer Nick with a family and friends and playstation and skateboarding. Those things no longer had any relevance I was my soul and I was with my true family in heaven for a few minutes.",
  "When my friend woke me up I truly thought I was dead. I kept asking him where the fuck are we going man where are we and he would be like dude u know where we are. But the thing was I truly didnt know. It looked like we were approaching a roundabout of thrones with one large throne in the middle and I thought I was being led my throne I thought I had died with my friend and we were headed home to our true home. I was in fucking tears on my knees wondering how could this be did God really decide to take me today? I looked at my hands and saw small black balls of static looked like little electric balls coming in and out of my pores and I was scared as shit.",
  "Something was fucking happening to me and I couldnt understand it. My friend definitely didnt go nearly as deep as me seeing as how he lead us out while I was completely fucked. I looked at him and asked him dude what is this man? Why are we here? What the fuck is this game? And then I heard it in my head as if I had turned completely schizophrenic a voice which was my own was speaking to me. In my head I was listening to a voice which was my voice but it was speaking on its own accord. It was saying dont you bother worrying about this life your in right now it means nothing absolutely nothing. Compared to what u shall see when you truly die this world is nothing and thats when I started really crying cuz I thought I had lost my fucking mind I started saying to my friend that I needed serious help that I had some kind of condition lol.",
  "Now 7 months later after much research speculation and faith I have commended my soul to the lord for showing me the meaning of life and that is to do watever I want in this life because its mine but to remember that our true father is waiting for us in heaven and wants to see us enjoy his amazing world he has left for us. There is a place I will go when I die and I can see it on shrooms very easily.",
  "Amen</p>"
 ],
 "year": "2005",
 "id": "39543",
 "gender": "Male",
 "views": "2370",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "3.7 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2007-06-20T07:00:00.000Z"
}
