{
 "title": "Brain Numb",
 "author": "Oswald",
 "citation": " Oswald. \"Brain Numb: experience with Morning Glory Seeds (ID 396)\". Erowid.org. Jun 13, 2000. erowid.org/exp/396",
 "substance": "Morning Glory Seeds",
 "bodyweight": "130 lb",
 "report": "<p>I had been out of pot for several days and didn't have anyway of getting more in the near future. So I started brainstorming to figure out a substitute. Fortunately, I had some morning glory seeds which I had set aside for a rainy day. Remembering this, I immediately found them and began crushing them up with a hammer. This was difficult to do since they kept scattering everywhere. I gave up on this and just decided to eat them. On several previous occasion, I had tried morning glory seeds, but the only effects I experienced were some nausea and inexplicable flashes of light. Overall, nothing much happened. For that reason, I didn't expect much from this experience.</p><p>I went to our kitchen and made some of that oatmeal with strawberries in it. Then I took the partially mashed up seeds and mixed them in. Previous attempts had left me with a very strong aversion to the taste of the seeds, so I needed the oatmeal to mask it. I ate all of it, but I did not feel any nausea. I didn't really feel much of anything. But then I noticed that I started to feel somewhat light and feathery. That is the only way I can explain it. Then I would think about it and decide that it was just a placebo effect. I would then decide that was untrue and say that it was the seeds. This went on for about 20 minutes.</p><p>This was kind of boring, so I decided to drive around. I began to feel sort of disoriented, almost like being drunk. This, I decided, was a sign that I should stop driving around, so I stopped by a friend's house. By this time, I was feeling kind of sick and anxious. I was pretty disappointed because I wasn't experiencing anything even close to being psychedelic. When I tried to think, it felt like I had to put forth considerable effort in doing so. It just made me feel like my brain had been numbed and, for that reason, I couldn't use it to think. It turned out that my friend had some pot, so we smoked a few bowls. This made me feel much better, but there were still no psychedelic effects. And that was the way it would be for the rest of the night. No psychedelia. What a disappointment. And I really don't think it would be worth my time to try them again.</p><p>",
 "year": "2000",
 "id": "396",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-06-13T07:00:00.000Z",
 "views": "7568",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "250 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 }
}
