{
 "id": 3961,
 "title": "A Strange Family Reunion of Sorts...",
 "date": {
  "submission": "2003-12-23T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "john",
  "gender": "Male",
  "weight": "245 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>First of all I wrote this about 10 minutes after the intense part of the trip had ended, so I apologize for any errors in it. ",
  "First I packed a full bowl, and smoked it, and I dont know if this was at the present time, or it just seemed like it looking back, but it vaguely seemed like someone similar to a aunt figure was watching me, but not with dissapointment like you would think.  At first it was really subtle, I felt a little light headed and out of it...so I come inside.  After lying down once again to the soothing sounds of pink floyd I decide I want this to be stronger, so I pack another head out to the garage and smoke it...again similar feeling with the aunt figure watching me, only this time she was joined by what seemed like what would be my cousins...I coulnt fully see them, but rather bland outlines of them, similar to that of the apperance handicapped symbol.",
  "I went inside and I guess I hadnt fully accepted the fact that this had kicked in...so somewhat subconsciously I packed a third bowl and went out to the garage once again and smoked it. Again I was in the company of my outline family figures, but this time I remember afterwords doing a little dance into the house, and also having my arm around one of my cousin figures (I must have honestly looked like a madman walking with my arm around noone), we were all kind of giggling when entering the house, once I got into my room and put the smoke and bowl away, thats when I first started realizing that this was not real, and was part of the influence of a drug of some kind I had taken. It was so hard to believe, I acctually was talking (in reality) to these figures asking them, which ones were really out in the garage with me. I mean I was actually talking to these fantasy figures...in disbelief I tried to put my arm around my 'cousin' once more, but he then slowly faded away.",
  "Then I listened to more pink floyd staring at my wall hoping to see some visuals. Nothing really, besides objects not fully looking real, and thus I was confused on if this whole thing was reality or fantasy...then I decided mabee the music was distracting from the effect so I turned it off and lay in silence, but nothing special happend...then I decided to get up and write down my experiences...in total this was probably about 25 mins from first bowl till the time I started writing this. As of right now, I kind of have a groggy feeling similar to starting to come down off a pot high...I still am having to check with myself to see if this is reality or fantasy.",
  " This is a really powerful drug, and should not be underestimated.  I can't believe that it is still legal.  Also, since I was somewhat conscious throughout the trip, I dont think this was a really strong salvia experience, and there will probably be more powerful trips for me down the line.</p>"
 ],
 "erowid": {
  "id": "27314",
  "citation": " john. \"A Strange Family Reunion of Sorts...: experience with Salvia divinorum (ID 27314)\". Erowid.org. Dec 23, 2003. erowid.org/exp/27314",
  "substance": "Salvia divinorum",
  "views": "6533"
 }
}
