{
 "id": 3962,
 "title": "I Lost All Sense of Time and Space",
 "date": {
  "submission": "2007-06-02T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Delta Nine",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "Ok, first some background.  I am fairly experienced with psychedelics (DPT, Mushrooms, and LSD), but I've never gotten a full-blown psychedelic experience with ego loss and whatnot.  A friend told me about Salvia, he described it as 'a 5 minute acid trip'.  That description intrigued me, so I ordered some Salvia online.  When it arrived, I got a few friends together, got a nice bong, and a torch-style lighter, and walked out to a small duck pond.  I sat down on a wooden park bench.  My friends just wanted to watch my first experience without actually trying Salvia, so they smoked a few bowls of weed amongst themselves.",
  "I packed a fair amount of the Salvia into the bong and took it all in one hit.  As soon as the smoke hit my lungs, I got the feeling that *something* was happening, but I couldn't tell what that something was just yet.  After I finished taking my hit, I felt an extremly strong force pushing me back, almost as if some unseen entitiy was slowly and steadily pushing me in my chest, trying to get me to lay back.  I got the hint; I rolled off the bench and laid down on my back and closed my eyes. ",
  "Immediately, I felt like the world was spinning around very rapidly, but it didn't feel like the vertigo you get from alcohol (no nausea, for one).  I got extremely disoriented and lost in the spinning.  Not long after that, I lost all sense of time and space.  I could vaguely hear my friends talking to each other, but I could not understand what they were saying.  Their voices seemed very slow and garbled.  There were not that many visuals, just a few prismatic patterns dancing across my field of vision.  I did not pay attention to the visuals or the voices because sight and sound seemed unimportant, they had no bearing on my mindset.",
  "At that point, a strange thought started repeating itself over and over in my head, it didn't feel like my own thought.  Rather, it felt like someone was saying it in my ear:  'This is the path, don't despair, you will go past the door soon, but not today.'",
  "After that, I gradually regained my senses, and the world came back to me.  I sat up, still unable to feel or move my arms, looked around, and managed the only word I could at the time:  'Wow...Wow.' This was the closest I've ever gotten to completely losing touch with conventional reality, and I'm definately going to try this again (maybe 10X next time ;) )"
 ],
 "erowid": {
  "id": "27315",
  "citation": " Delta Nine. \"I Lost All Sense of Time and Space: experience with Salvia divinorum (5x extract) (ID 27315)\". Erowid.org. Jun 2, 2007. erowid.org/exp/27315",
  "substance": "Salvia divinorum (5x extract)",
  "views": "3903"
 }
}
