{
 "title": "The Highs and Lows",
 "author": "Anonymous",
 "citation": " Anonymous. \"The Highs and Lows: experience with Brabiturates (Fioricet) (ID 39635)\". Erowid.org. Nov 30, 2007. erowid.org/exp/39635",
 "substance": "Brabiturates (Fioricet)",
 "bodyweight": "115 lb",
 "report": "<p>Fioricet has been my pharmaceutical of choice for many years now. I was originally prescribed the drug for chronic migraines when I was a teenager. I quickly discovered that I got the most fantastic high from it by taking slightly over the dosage my Dr recommended. Fioricet (or generically Esgic) is a non-formulary pharmaceutical tablet that only comes in a tablet containing 50mg of Butalbital/acetaminophen 325mg/caffeine 40mg. The brand name is blue in colour and the generic versions are white. I have noticed some differences in the absorption rates of the generic vs. the brand name, the brand name absorbs quicker in my opinion, but both yield the same results ultimately.</p><p>In the beginning I take 3-4 pills. My tolerance built very quickly. It is a very fast acting and speedy high, but also has a nice smoothe happy feel to it. I will clean my room, run around the block, but be at peace doing it. I will find myself confident and productive and it will start me on a very nice weight loss program at the same time (thanks to the caffeine contained in the pharmacology). I have spent time doing anything and everything on this drug, working, cleaning, watching TV. It's a pretty safe drug as far as my general impairment in the first stages.</p><p>The downside of Fioricet is that when I crash, and I WILL crash, I crash hard and will sleep for lengths of time that I did not think possible. I can become anemic and notice myself bruising at the slightest touch of someone.</p><p>This is a very difficult drug to shake lose from and withdrawel is not a pretty picture. I loved and hated this drug for about 10 years and have only recently become free of it. I still dream about it. I still love it. When I stop cold turkey (which I should not, I should ween myself off it slowly-taking a lower dosage each day-but I think we all know that's VERY hard to do when I love a high) I experience night sweats, nightmares, muscle spasms, depression and I will sleep for about 2 days.</p>",
 "year": "",
 "id": "39635",
 "timestamp": "2007-11-30T08:00:00.000Z",
 "views": "46330",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "(pill / tablet)"
  }
 ]
}
