{
 "id": 3964,
 "title": "A Euphoric Sound Trip",
 "date": {
  "submission": "2004-07-05T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "sunnysinicuichi",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Heimia salicifolia",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Heimia salicifolia",
   "form": "tea"
  },
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Heimia salicifolia",
   "form": "dried"
  }
 ],
 "report": [
  "Dose: 2 g sinicuichi steeped twice as a tea + 2 g smoked.",
  "First, I smoke 1 g in a water pipe.",
  "Each puff elicits a kind of 'head rush'.",
  "Feel an immediate euphoria and relaxation,",
  "like a mild opium dose, without the endorphin hit.",
  "As I smoke, sounds seem to reverberate, but no visuals.",
  "Then I down the the tea. The taste isn't bad--surely delicious compared to Calea Zacatechichi. :-)",
  "I smoke another 1 g.",
  "About ten minutes after smoking, the tea kicks in. I listen to Pat Metheny's 'As Falls Wichita, So Falls Wichita Falls'. Music is a joy to listen to. Must say Sinicuichi is perfect with music. (Is this the 'auditory hallucinogen' part?) I slouch back in the armchair, feeling slightly sedated and quite euphoric. After about two hours, effects wear off. I go to bed and have a very sound sleep.",
  "Next morning, I feel rested and at ease. No hangover,  but some minor muscle aches all day.",
  "Sinicuichi's certainly one of the most 'recreational'  entheogens I've tried. This stuff's actually fun and physically soothing. However, a weekend would be a better time to have it--the bodily discomfort's mild, but distracting. (In contrast, mushrooms and Salvia are psychically demanding, and Calea is physically tiring due to sleep often being interrupted by dreams.)"
 ],
 "erowid": {
  "id": "27318",
  "citation": " sunnysinicuichi. \"A Euphoric Sound Trip: experience with Heimia salicifolia (ID 27318)\". Erowid.org. Jul 5, 2004. erowid.org/exp/27318",
  "substance": "Heimia salicifolia",
  "views": "27756"
 }
}
