{
 "title": "All-Encompassing Body of the Mind",
 "author": "grimly",
 "citation": " grimly. \"All-Encompassing Body of the Mind: experience with 5-MeO-DMT (ID 39640)\". Erowid.org. Nov 29, 2005. erowid.org/exp/39640",
 "substance": "5-MeO-DMT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>At 4:21 pm I took via insufflation approximately 20mg. Coming up is extremely difficult to describe, in fact the entire experience is extremely difficult to describe. I have a very hard time noticing the effects of the drug until I am well within its control. At approximately 4:30 pm I entered into the galatic conciousness of my own body, as if each cell in my body were communicating directly with my conciousness in a dialogue I could clearly understand. Every sensation and thought was unbridled unlike normal consciousness, where the brain will ignore signals that are not providing new information. Under the influence of this substance it is as if that is completely discarded. Every piece of information that my cells were relaying to my brain was being registered and felt.</p><p>I closed my eyes at around 4:30 and explored the inside of my head, going wherever the experience might lead me. While I had my eyes closed the sensations of my body were very strange, like I was moving, although I knew I was not. I was sitting in my chair and yet it felt as if I were laying flat out, floating in some non-existent place. No visuals at all, just felt experience. This state of mind is incredibly difficult for me to describe, my patterns of thought change ever so subtley, if at all, it's the incoming signals that feel drastically different.</p><p>At around 4:35 I opened my eyes and looked at the room around me. My sense of spacial orientation was drastically changed in a quirky way, things that were close seemed very very far away and things that were far seemed not so at all, almost as if depth perception were non-existent. I knew where things were because I was familiar with my surroundings, but had I been somewhere I was not comfortable and used to I suspect I may have been much more disoriented.</p><p>After opening my eyes and observing my surroundings I decided to shower. Untrusting of my ability to walk straight I crawled there, which felt normal and comfortable to do. I crawled into my room and sprawled out on my bed momentarily, grabbing my ipod while I was there and gathering the needed strength of will and body energy I would soon need to stand up to get the shower going and the music in the bathroom playing. I left the lights off in the bathroom, completely dark. My bodily sensations were still vastly distorted, sense of movement and where the boundaries were was.</p><p>very difficult to discern and 'off' but in a pleasant way. Sense of time was completely forgotten under the influence and looking back to the beginning of the experience felt like eternity. I can't stress enough this feeling, time had absolutely no meaning and each moment was forever, with forever to go until the next one.</p><p>The experience ended abruptly as soon as the album I was listening to, Dark Side of the Moon, finished. I felt able to stand and move about normally, with lingering traces of energy, body distortion, sense of time, and *very* slight visual distortion persisted. When I got out of the shower and dried off and made it back to my computer where the experience started, it was 5:21pm.. the whole experience lasting nearly exactly an hour.</p>",
 "year": "2005",
 "id": "39640",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-29T08:00:00.000Z",
 "views": "4195",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ]
}
