{
 "title": "Nature Squared",
 "author": "McIver",
 "citation": " McIver. \"Nature Squared: experience with Mushrooms (ID 39657)\". Erowid.org. Nov 16, 2005. erowid.org/exp/39657",
 "substance": "Mushrooms",
 "bodyweight": "184 lb",
 "header": [
  [
   "DOSE:",
   "2.2 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>Lately, I have experimented with low-dose mushroom consumption before my very intense (Hatha-based) power yoga class and I have found the benefits to be phenomenal.  I should note that my class is both crowded and heatednot to Bikram levels, but still hot.  I have experimented between once and twice a month for about six months for a total of ten experiments.</p><p>I would describe my pre-shroom yoga ability at somewhere between beginner and intermediate, but during a good yoga/shroom class I find that even expert-level poses are within my reach.  The shrooms work to improve my practice in the following ways:</p><p>I feel more centered, so my balance improves.\r My muscles relax, so my flexibility increases.  I have very tight hips and normally I struggle with poses like pigeon. But on an optimal shroom dose I am able to get deep into the stretch.  \r My breathing slows and deepens.  Without any conscious effort, I am able to do the deep yogic breathing instructors always encourageeven during the most strenuous parts of class.\r Lastly, I am able to reach deeper levels of meditation during the restorative portion of the class. Sometimes I have closed-eyed visuals of trippy, Alex Grey-like images of energy flowing through my body.  Sometimes I have no visuals at all, but I always feel that the healing aspect of my yoga practice has increased exponentially.I dont know whether these benefits are due to the fact that Im able to practice yoga at a much higher level (no pun intended) or whether the benefits result from a direct effect of the shrooms on my psyche.  Most likely they are a delicious combination of both factors. </p><p>What I find interesting is that most of the benefits are quantifiable.  A question skeptics often ask entheogen users is, How does tripping benefit your regular life?  This is always difficult to answer, because the benefits of entheogens are as complex and subjective as the human mind itself.  I may think tripping gives immediate and lasting benefits to my music/writing/art/love life, etc., but how do I prove that?  Now I have finally stumbled upon an easily quantifiable benefit: I know objectively that my yoga practice improves while I am under the influence of shrooms.  Should I ever be able to volunteer for a study of this phenomenon, a scientist would be able to measure improvements in my flexibility, as well as my more relaxed breathing, heart rate, etc.  Even without a doctor measuring physiology, anyone with a regular practice knows when they are able to stretch farther into a pose. </p><p>Now a word about dosageI started my experiments with about 1.5 grams of dried shrooms (Psilocybe cubensis) and slowly worked my way up to my ideal: 2.2 grams.  I consume the shrooms in a tea approximately 45 minutes before class begins (to avoid digestive discomfort).  I take an amount that is just shy of what would give me light open-eyed visuals of the Persian carpet variety.  Once the open-eyed visuals start, I find the coordination and balance aspects of my practice too difficult.  Conversely, I find there is very little wiggle room between an optimal dosage and too low of a dose that barely benefits my practice at all.  I have been patient in experimenting, and the benefits from an optimal dosage have astounded me.  A good yoga/shroom day can make a struggling beginner yogi like me feel like I have just received a class from the Buddha himself.</p><p>I fervently hope a researcher will one day conduct a study into this type of benefit.  In the meantime, more anecdotal trip reports may help establish a foundation for future research.</p>",
 "year": "2004",
 "id": "39657",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-16T08:00:00.000Z",
 "views": "26622"
}
