{
 "title": "Dreamy Experience",
 "author": "CptFarlow",
 "citation": " CptFarlow. \"Dreamy Experience: experience with Calea zacatechichi & Tobacco (ID 39680)\". Erowid.org. Jan 25, 2005. erowid.org/exp/39680",
 "substance": "Calea zacatechichi & Tobacco",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  "2 cups",
  "oral",
  "Calea zacatechichi",
  "(tea)",
  "",
  "1 bowl",
  "smoked",
  "Calea zacatechichi",
  "(plant material)",
  " T+ 0:05",
  " ",
  "smoked",
  "Tobacco",
  "(plant material)"
 ],
 "report": "<p>It was a normal night, I had come home from work, I ate dinner and was watching some TV when I remembered that I had been wanting to try the Calea Zacatechichi (also known as the 'Dream Herb') that I had purchased online a few weeks earlier. I looked online for the best way to prepare it, which was in a tea form. I was interested in having the vivid dreams that I had heard it induces.</p><p>I had two ounces of it, so I grabbed a handful and I simmered it (without letting it boil...) for about 15 minutes. I breathed in a lot of the steam from it while it was simmering. When I felt it was done I took it off the stove and I strained it into a bowl and then into a mug. It smelled fine, but I took a quick sip and found out soon why they said it was so bitter. The taste was so bitter I dashed to get some orange juice to get the taste out of my mouth. After that, I went onto the back porch where I was allowed to smoke. My girlfriend was in the kitchen and was nearby watching me.</p><p>I packed a bowl of the Calea and had it ready. I had read that the Indians that used Calea would smoke a bowl of it after drinking the tea to help deal with the bitter taste. I was a bit cold because the porch was an add-on to the house. I sat down and prepared myself for the taste. After counting down from five and realizing I should be on Fear Factor, I started gulping it down. After two gulps I wanted to stop, but I forced myself to keep going. It was a pretty big mug, but I got almost all of it down. As soon as I swallowed the last bit, I grabbed the bowl and lit it up. It really did help with the bitterness, not completely though. I started to feel somewhat sick. My mouth was very watery, like I was going to vomit. I opened the back door and sat on the steps to the snowy outside and kept spitting up the watery saliva. I continued to smoke the bowl and by the time it was done I began feeling a bit light-headed. It was a cannibus-like feeling without the burnt-out effects.</p><p>After about five minutes the sick feeling went away. I smoked a honey cigar for about three minutes and went inside the house. I got another drink of orange juice to clear the taste from my mouth. I watched some tv with my girlfriend for about an hour until I retired to my room. I lit some incense and lied down in bed. Another rumor was that you could hear your own heartbeat while the Calea is in effect, but that never happened. I finally went to sleep, and hour and a half after drinking it.</p><p>I awoke the next morning after sleeping about 9 hours. I did not have to work that day, so I lit some incense and lay in bed for about 10 minutes and thought about the dreams I had that night. There were a lot, and I remembered them all. Some were about work, family, friends, while others were about odd events or instances. I remember at one point I was in a field by myself. I felt a male presence. I believe that Calea has a male gender, not like Salvia or Cannibus which I have always felt has a female gender to them.</p><p>After brooding about my dreams for a little while, I got up and went on with my day, and now I am writing this. I feel that Calea is worth trying at least once. It was a pleasurable experience except for the taste and the sick feeling, but I think the nausea was from the taste. I will try Calea again for sure.</p>",
 "year": "2005",
 "id": "39680",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-01-25T08:00:00.000Z",
 "views": "15289",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  },
  "1": {
   "time": "",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 0:05",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  }
 }
}
