{
 "title": "A Single Bowl, Effects Profound and Beautiful",
 "author": "Nahli",
 "citation": " Nahli. \"A Single Bowl, Effects Profound and Beautiful: experience with Damiana (ID 39706)\". Erowid.org. Apr 25, 2005. erowid.org/exp/39706",
 "substance": "Damiana",
 "bodyweight": "165 lb",
 "report": "<p>I purchased a pound of damiana from a online health food store, at the time to use as a tea infusion in combination with hibiscus flowers (flor de jamica).  The effect of the dried foliage in tea was quite potent, mild sedation and slight euphoria.  After some consideration, I put a quarter ounce into my coffee grinder and powdered it.</p><p>The next day, my friends and I were driving back from classes, and I packed a bowl of damiana, letting everyone know what was in it.  Powdered damiana combusts quickly, I cleared the first bowl, about a half gram in one breath.  It was a bit harsh, but only because I wasn't expecting the quantity of smoke.  I had my friend repack it, because I noticed a sudden decrease in motor ability.  At T+5 minutes, streetlights started to blend together.  I had a sudden feeling of euphoria, like everything seemed beautiful.  It took me awhile to realize that we had all stopped talking... I knew that the effect was taking hold for all of us.  Effects became less pronounced after a half hour, and a within 45 minutes that had passed. The following day, I decided to hit a bowl by myself in between classes... when I arrived at my next class, I felt glued to my seat, unable to concentrate, but, unconcerned.  Trying to take notes, I realized my motor function was destroyed.</p><p>Overall, although it isn't as good as cannabis for relaxation, as the effects lasted no more than an hour, because of its price, I plan on using it more for destressing, and saving my pot for visionary excursions.</p>",
 "year": "2005",
 "id": "39706",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-04-25T07:00:00.000Z",
 "views": "47569",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(ground / crushed)"
  }
 }
}
