{
 "id": 3973,
 "title": "Chemical Joker",
 "date": {
  "submission": "2001-12-16T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Threed",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "In my circle, I was the first to try Salvia D. I wasn't expecting much, mainly because the reports all seemed so confused and varied over a wide space of effects.",
  "I sat down with two others who wanted to give it a go: my girlfriend and my older brother. I relayed as much information as I could without tainting the experience with high expectations. I emphasised the proper smoking technique and suggested we go one at a time.",
  "The pipe we used belonged to my brother. It was a fortunate choice, because this pipe seems to have a special affinity for Salvia D. It is a small ceramic fish-head with a long, thin metal stem. Apparently, this is the ideal Salvia smoking instrument, as it lets us burn the leaves at a very high temperature yet not burn our throats.",
  "The first hit went down like burning plastic. Nasty. The second was smoother. I burnt it as fast and hot as I could. As I was exhaling the second hit, the wierdness began.",
  "It's so difficult to describe... I felt like my entire being, my consciousness, was rolling like a TV with a screwed up vertical-hold knob. The thing was, I was rolling through a V shaped wedge of space, from the pointed end out to infinity. Each time through, I got a bigger 'slice' of reality, until I finally came back to 'consensus reality'. When I was starting to come back, the others asked me 'What's happening? Are you OK?' I replied 'No, I'm not OK. I want it to stop.' They played the perfect sitter role, 'You'll be OK in a minute. Relax.'",
  "All the while, it seemed like the entire exercise was some kind of game. Like reality was a game that my sitters knew the rules to, but I had forgotten them and had to figure them out, but I was doing so in a rather twisted space.",
  "It may be difficult to describe, but it's easy to explain. I believe I merged with my ceiling fan. Not the whole thing, just the cuff that spins around the axis. As I/we/it rotated around, my narrowed consciousness was expanding back to normal. Thus I felt like I was getting everything in stop-motion.",
  "The short version of my girlfriend's experience... She didn't get much out of it and didn't care for it.",
  "My brother, on the other hand, got very excited after the first hit. He leaped up and started capering around the room and going on about how 'that was the best! that kicked ass!' Once I got him to calm down a little, it became evident that his language processing facilities were shot. For a while he couldn't answer questions, and when he came to he didn't remember being asked any. He did, however, immediately place an order for a 1/4oz bag of his own.",
  "On another occasion with the same group, again with me as the lead-off man, with the same pipe and the same bag of Salvia D., I got to merge with a Papasan chair (a big bamboo bowl lined with a cushion, on a bamboo pedestal). Before smoking, I told the others to remain silent until I spoke first.",
  "I felt as if I was traversing a course around the room, intersecting with objects, my point of view narrowed to a pinpoint in time and space. Imagine a geometric plane formed by the circle of the rim of the papasan's bowl. Now imagine a spiral falling through that plane. Wherever the spiral intersected the plane, that's where my consciousness was.",
  "As I was making my circuit, I ran across three 'bumps' in the ride. I can't describe what they felt like, but they were rougher than the rest of the course. I started to speak after the first one, saying something like 'This is weird', to which my brother replied, strangely, 'the last one's the worst'. At that point, I ran over the second and then the third. The third was indeed the worst, but how did he know that?",
  "After the weirdness had faded, I asked where he came up with 'the last one's the worst'. He said he just blurted it out and couldn't remember why. Then I realized what the bumps were; decorative wrappings around the bamboo structure of the chair.",
  "Every time I've smoked Salvia, it has seemed like I was playing a game or a joke was being played on me, and I have always felt an urgent need to figure out the rules. Sometimes, I get glimpses of the game being played, and I get to bring that information back. Other times, I feel like I'm on the verge of uncovering the complete truth but am vaulted back into reality and I lose everything.",
  "One more strange effect... We tried putting on some music during a trip. I didn't go too far in this time, but was definitely in an altered state. The music sounded wrong, like it shouldn't have been on. In fact, if you've ever seen 'Stir of Echos', the scene where you get to watch the girl die from her point of view, that's what the music sounded like... Somewhat out of place, a bit remote, definitely not wanted or welcome.",
  "In closing... It's been said before: Salvia is not a fun drug. I'll add that it's not even enlightening most of the time. It's just a confusing trip. A trip without a high."
 ],
 "erowid": {
  "id": "2736",
  "citation": " Threed. \"Chemical Joker: experience with Salvia divinorum (ID 2736)\". Erowid.org. Dec 16, 2001. erowid.org/exp/2736",
  "substance": "Salvia divinorum",
  "views": "6823"
 }
}
