{
 "title": "Spoonful of Sugar Helps the Medicine Go Down",
 "author": "Eyepower",
 "citation": " Eyepower. \"Spoonful of Sugar Helps the Medicine Go Down: experience with Yerba Mate (ID 39734)\". Erowid.org. Dec 12, 2005. erowid.org/exp/39734",
 "substance": "Yerba Mate",
 "bodyweight": "",
 "report": [
  "<p>I've been a daily coffee drinker for years, but my recent discovery of the South American drink Yerba Mate has made me give it up entirely.  I had never even heard of Yerba Mate until, quite unexpectedly, my brother gave me a decorated gourd and 6 oz. bag of mate as a gift.",
  "The gourd is the traditional drinking vessel for this drink, which tastes like really strong, bitter green tea.  The  hollowed out gourd is filled about halfway with loose Yerba Mate then filled with hot, not boiling, water.  One drinks it through a 'bombilla' which is a stainless steel straw that is pinched closed at one end and has several small slits at the bottom.  This helps to filter the loose particles so you don't suck up too much leaf.  The same leaves can be used over and over (15-20 refills) in this fashion until the water comes out clear and flavorless.  This is by far the best method for obtaining the uplifting effects this drink has to offer.",
  "My first time drinking Yerba Mate I had few expectations.  I had read that the caffiene content is fairly high, especially when prepared traditionally in the gourd, so I figured it would be similar to drinking coffee and would energize me in the morning.  Upon the first sip, I cringed slightly.  Ugh, did this stuff taste bitter!  I kept drinking it anyway.  I finished off the first gourd and added a heap of sugar to the next one.  Ahh, now this I could handle.  After refilling 4 or 5 gourds full I realized I was really bored and needed to get out of my apartment.  Bear in mind this was the last week of december (cold), I was on break from school, and had no vehicle to get around.  I'm usually a pretty lazy person and content to sit around and play video games or surf the web.  After drinking some mate, however, being lazy was not an option. ",
  "I quickly did some research to find out which bus I would have to catch to get myself to the Galleria (mall) and the adjacent shopping centers.  I had been walking for only 5 minutes or so when I suddenly realized that I felt really good.  I mean REALLY good.  I hadn't been in such a good mood for quite some time.  A smile forced its way onto my face and the tempo of my walking increased a little.  At this point, maybe an hour after having my first sip, I had decided to replace my morning regimen of coffee and switch exclusively to Yerba Mate.  Several hours later I was thinking of how I still had a lot of energy and how coffee always wears off quickly, leaving only a headache.  It occurred to me then, I had not eaten a meal yet that day, and had not gotten even the slightest bit hungry.  I later read that Yerba Mate is known to have an apetite supressing effect.",
  "I started brewing the leaves in my coffeemaker when my fiance ran out of coffee.  The drink tastes MUCH better when brewed like this, but does not give me quite the same 'buzz' as when I prepare it in the gourd.  With enough honey or sugar it goes down pretty smoothly.  If you plan to drink this stuff with a gourd and bombilla I reccomend finding a brand that is not ground up too fine.  The larger bits of stem help to keep the bombilla from clogging and filter out the leaf bits.  </p>"
 ],
 "year": "2005",
 "id": "39734",
 "views": "9971",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Yerba Mate",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2005-12-12T08:00:00.000Z"
}
