{
 "id": 3975,
 "title": "Too Many Downers",
 "date": {
  "submission": "2006-04-30T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ryan",
  "gender": "Male",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "2.0",
    "grams": 0.002
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "oral",
   "substance": "Propoxyphene",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This was a very stupid move on my part on trying not to let my parents know that I did drugs. I had a bit of an addiction to where if I wasn't messed up I needed something to mess me up.  So I was out of pot, no money for Robotussin, so I went to my moms purse.  Shes bi-polar (manic depressive) t, and she had some good stuff in there.  I figured the more i took the better i would feel...WRONG! ",
  "So I dug out four .5 mg klonopins, and one 100mg Darvocet.  My friends came by, I popped em, and headed out... This is how it all happened;",
  "T+15:  Feeling good.",
  "T+30:  Oh boy, I forgot I took the Darvocet! It's kickin' my ass fast.",
  "T+35:  Can't move, friends describe me as my face melting off.",
  "T+40-60: Went home passed out in bedroom.",
  "Ok that wasn't fun at all...Being that I woke up 14 hours later! My parents were kickin and yellin at me, and almost took me to detox.  When I woke up they asked me why I had fallen asleep at 5, through the next morning (when I dont fall asleep until the wee hours of the morning, so I told them what any pothead would say...'I didnt feel good'. And a couple days later the school drug tested me and i got suspended for two weeks from that Darvocet."
 ],
 "erowid": {
  "id": "27377",
  "citation": " Ryan. \"Too Many Downers: experience with Propoxyphene (Darvocet) & Clonazepam (Klonopin) (ID 27377)\". Erowid.org. Apr 30, 2006. erowid.org/exp/27377",
  "substance": "Propoxyphene (Darvocet) & Clonazepam (Klonopin)",
  "views": "37413"
 }
}
