{
 "id": 3977,
 "title": "New found Happyness",
 "date": {
  "submission": "2007-05-03T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Floyd",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "It happened one Friday morning. All college classed had been cancelled because of the snow storm the hit the night before. I had stayed the night at my girlfriends dorm room. When we woke up at around 10:00, we looked outside to see how much snow we had gotten and was rewarded with see the most beautiful landscape ever. Ever thing was covered in a white blanket. The sun was shinning so bright it hurt your eyes to look for too long. We both sat by the window and looked out, daydreaming about the night before.",
  "Then I thought of how much more enjoyable this moment would be of we shared a joint and listened to Pink Floyd. So I rolled a joint while my girlfriend lit incense and put on Dark side of the moon. Now with the mood set, I took the first hit off this fat joint I was going to share with my beautiful girlfriend. The first buff was kind of harsh and I had a coughing fit, but I didnt mind. It would just get me higher and it made S release that great laugh of hers. After sharing the joint I felt so relaxed had happy I didnt want this moment to end. I dont mean the giggly, happy feeling the most people feel. I mean, I felt like nothing could get better then this I had reached my nirvana. I was so happy it hurt.",
  "Being so happy must of caused me to be grinning like an idiot, because S laughed and said, What.  All I could say was Wow you are so beautiful, and I dont mean just outside beauty which you have, but also internal beauty. And I meant it and even thought we are no longer seeing each other still do believe it. After saying that I was rewarded with a nice long passionate kiss. Ss lips were so soft and she tasted like the strawberry pop she was drinking.  After we snuggled and made out for a while the munchies hit us. So we decided to venture out for some food.",
  "The Cafeteria was all the way across the campus and you had to go outside to get there. When we stepped out side the cold air hit us like a Jack hammer and I tried to go back in but S pulled me by the hand out into the bright white snow. Once my eyes adjusted to the brightness I again had the huge feeling of happiness and was wowed about the beauty the surrounded me. I playfully started a snow fight and we were both laughing and smiling like love struck idiots by the time we got the cafeteria. We got our food laughing a giggling, picking on each other. I guided us to a table by a window so we could watch the snow fall. For it had started to snow again.",
  "After about and hour of sitting there talking and watching it snow. We both decided to go back to her dorm to smoke some more dope. After getting back to her dorm room, our high was almost gone, so I was in kind of a rush to get high again. We rolled two more joints and after sharing the first one. S decided that she was done and started to play a nirvana song on her acoustic guitar. It sounded so good and my whole body was so relaxed. That is when I notice that my body had this tingling feeling that would start and my toes and slowly go all the way to the tip of my skull and back down to my toes.",
  "I couldnt stop running my fingers thought my thick curly hair. I could feel the blood vessels letting more blood rush to my head and I thought to myself, This is going to make my hair grow longer and curler. The guitar music was flowing through out my body too. I closed my eyes and imaged that I was floating on the music and letting it bring my body and soul to new depths of understanding. I tried really hard to hear each and every note in hopes that it would bring me back down for now I was really fucked up. But S was playing to fast now so I just went back to the floating.",
  "Once I came down some I wanted to play the guitar. Since I had just started to learn how to play I didnt know any songs, just about 3 notes. I just practiced switching form one note to the next. A hard task to do being high as a kite. It was really cool though because when I played a note right I could really hear it, and when I played one wrong I knew it and could replace my fingers on the chords to make it right. Being so high was actually making me a better learner.",
  "It seemed like we had been playing fro hours but it was just an hour long jam. S packed her bong and we smoked a couple of bowls out of that. We were both ready for a nap so we decided to go to bed. And like John Cossack says, in one of my favorite movies High Fidelity, I wont tell you who did what to whom, but I can say we hade a geed time. I can say that."
 ],
 "erowid": {
  "id": "27379",
  "citation": " Floyd. \"New found Happyness: experience with Cannabis (ID 27379)\". Erowid.org. May 3, 2007. erowid.org/exp/27379",
  "substance": "Cannabis",
  "views": "2848"
 }
}
