{
 "title": "Doll-House",
 "author": "Callius",
 "citation": " Callius. \"Doll-House: experience with Wormwood (ID 39798)\". Erowid.org. Jan 12, 2007. erowid.org/exp/39798",
 "substance": "Wormwood",
 "bodyweight": "130 lb",
 "report": "<p>I have just completed consuming approximately 3 tsp of Wormwood in conjunction with chicory root, carob pod, anise, clove and several other tradition spices, brewed for roughly 6 minutes in very hot, but not near boiling water. 3 'equal' packets were added to taste, due to lack of honey. The tea itself was so pungent milk was added to dull the taste and smell. Despite the fact that it tasted incredibly bitter and discomforting, the single cup was completed in entirely and quickly effects set on.</p><p>Upon observation, 'reality' appears to have a near 'doll-house' effect, though this may be simply because of mental bias from trip reports. The effects could be described as a mild calming/stoning as well as definite visual distortion. Objects appear slightly slanted, sometimes moving, though clearly motionless.</p><p>Physical effects are very apparent and comparable to those of a fair amount of codeine or that of about 10 mg vicodin or vicoprofin and eyelids feel heavy. Overall, besides the slightly bitter aftertaste and full (stomach) feeling, it is a very pleasant trip, much stronger than smoked Wormwood. Lastly, senses feel fairly normal, yet touch is light and soft and audibly, noise level has seemed to increase. It is notably harder to perform a function such as typing which requires precision.</p><p>Effects occur within about 1-2 minutes of ingestion and peak within several (3-6) minutes, though seem to drop in extremity fairly quickly. Effects however have not been brief and I write this approximately 20-25 minutes after drinking the tea.</p>",
 "year": "2005",
 "id": "39798",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-01-12T08:00:00.000Z",
 "views": "10066",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 tsp",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "(tea)"
  }
 }
}
