{
 "title": "Field Notes of an Advance Scout",
 "author": "Sarah F.",
 "citation": " Sarah F.. \"Field Notes of an Advance Scout: experience with Cacti - T. peruvianus (ID 39801)\". Erowid.org. Jan 26, 2005. erowid.org/exp/39801",
 "substance": "Cacti - T. peruvianus",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "2 cups",
  "oral",
  "Caffeine",
  "(liquid)",
  "",
  "22 g",
  "oral",
  "Cacti - T. peruvianus",
  "(dried)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>FIELD NOTES OF AN ADVANCE SCOUT:</p><p>FEAST OF THE EPIPHANY</p><p>OR</p><p>THE DISCOVERY OF THE HORSE-MOUTH</p><p>**RECORDED IN MOTION**</p><p>I am about to consume almost one ounce of Peruvian Torch cactus. My dose came to me as boiled then dried cactus petals. This morning I ground the petals in a coffee grinder and filled 00 capsules with the powder. One ounce produces anywhere from 6075 capsules. This batch produced 63 capsules, of which I ate 50. I left 13 capsules as an offering to my husband, and a tablespoon or so of powder to offer to the gods. I am alone in my house. It is approximately 1:15 PM. This morning I ate a banana and drank approximately 12 oz of water, along with two cups of coffee. I have been extremely depressed, continuously for two weeks, moderately to severely depressed with occasions of mania, these episodes constituting a time when I have chosen not to take psychotropic medicines to treat my so-called mood disorder (bipolar type II, rapidly cycling). Previous to stopping medication, I was nevertheless depressed for several months.</p><p>I do not want to go back on this medication.</p><p>This is the fourth time I have eaten cactus. My eating career has spanned one year and four months. Im burning lavender incense and am boiling some eggs. I smudge myself, my surroundings, the capsules, with a cedar stick, and I will say the [Ramon Medina] Silva prayer now and begin:</p><p>May the gods bless me, help me, and give me power and understanding.</p><p>**</p><p>I have eaten maybe 20 capsules now.</p><p>I am afraid.</p><p>Im sitting on the floor in my living room.</p><p>Before me is a coffee table on which I have a live Peruvian torch cactus (trichocereus peruvianus), a small hand-held Tibetan drum, a bowl with incense (cedar and white sage and lavender), a glass of lemonade, a glass of water, several books, a notebook and pen, a bowl full of capsules, a candle. Below the table is an enormous water pitcher.</p><p>Having eaten 20 capsules, it feels uncomfortable to my stomach, my smell, and my taste.</p><p>I am afraid of the pain, the sickness, a headache; of giving up the time.</p><p>I am, in short, very afraid of letting go.</p><p>Letting go of the thoughts.</p><p>Constantly the thoughts.</p><p>How can I let them go on without me?</p><p>How can I become free?</p><p>Perhaps I do not know what my desires are?</p><p>What I seem to go for are always those things which cancel me:</p><p>I want to do everything so fast, to arrive where? (Impatience) To arrive in the void.</p><p>I am afraid of workat least thats how I interpret it, but it must be because of another thing.</p><p>What is it?</p><p>Where am I still wounded?</p><p>How can I accept my past?</p><p>How can I forgive myself?</p><p>How can I learn to work throughout the day with joy?</p><p>Be open to pleasure & love?</p><p>\t\t\t[Bashs toad plop = enlightenment]</p><p>Natives perform a ritual of confession, tying the confessions into knots on a rope which is then burned in the sacred fire, before consumption of peyote. Perhaps this [prefatory writing] is that. I am not paying attention to clock time which, scientifically speaking, may pose problems.</p><p>I just ate a second handful.</p><p>The time is 1:46.</p><p>I am feeling a little seasick, from walking over to the clock time.</p><p>Now I will eat more.</p><p>I beseech the gods to help me.</p><p>I will do good work on the earth if I can learn to be helped, to order my mind toward peace.</p><p>Thats my commitment.</p><p>I feel it is not made in vain.</p><p>I have almost finished eating.</p><p>It has been unpleasant.</p><p>I feel some waves of well-being.</p><p>Hints of joy.</p><p>I have not smoked any marijuana yet.</p><p>It does not feel right to do so yet, to make unclean the cactuss path through.</p><p>In time I will run out of paper and will need another notebook.</p><p>I also feel the foreshadow of a headache. I dread the headache.</p><p>Im frightened.</p><p>Im beginning to feel a little woozy.</p><p>My cat Eve crawls and rubs all over me.</p><p>I am done eating now.</p><p>Its probably 1:57.</p><p>I will not move, I think, for some time, to try to prevent too much sickness.</p><p>It is about PAYING ATTENTION.</p><p>PartlyI do not do it.</p><p>I rush through tasks.</p><p>I am afraid to surrender my attention.</p><p>To become lost; rapt. Free. Why?</p><p>\t\tLESSON: PAY ATTENTION</p><p>Habitual meditation will help me.</p><p>Doing the rattle/drumpercussion.</p><p>Meditative.</p><p>Listening now, on the stereo, to Dvorak/Hebrtcello concertos with Yo Yo Ma.</p><p>I feel good.</p><p>Not so sick.</p><p>I feel my impatience in wanting to eat the remaining 13 capsules I had left for Johnafraid the sensation, once it begins, will end (already fearing the end) (fearing impermanence), or wont be enoughwanting to eat food, smoke, do something.</p><p>Anything but pay attention.</p><p>When I really pay attention to, e.g., television, I cant stand it, I feel despair. So, when mostly I watch it, I must not be paying attention.</p><p>How to pray, how to loveAttention</p><p>So many things I havent been patient enough to learn: How to pay attention. How to be responsible with money, etc.</p><p>But this is speaking of myself negatively, which the thoughts constantly do. Enough.</p><p>I am The Fool and it is blissful/beautiful to have the process ahead of me.</p><p>Already I do feel a joy.</p><p>I have some trails watching my hand write.</p><p>Sitting still is good.</p><p>In some ways I wish I could travel the entire way alone. That John wouldnt be returning here until tomorrow. It would be frightening, but perhaps more spiritually deep.</p><p>Now Im afraid nothing at all will happen.</p><p>It will be what it will be.</p><p>The light fades though it is only early afternoon. Maybe it will snow.</p><p>The boiled eggs are cooling in tepid water in the sink.</p><p>I will make a lunch tomorrow for Johns parents: devilled eggs, polenta sandwiches with ham and tomatoes and cheeses and herbs, au gratin potatoes, spicy green beans. . .</p><p>Here I am not paying attention. I am looking at the future  which I cannot control. I can wish, I can make a plan, then I must put it aside.</p><p>\t\tLESSON: DONT IDLE ON THE FUTURE</p><p>I feel clear.</p><p>I feel good not to have smoked pot.</p><p>I am trying to pray/meditate.</p><p>When I put my pen down I sit in lotus with my eyes closed and my hands at my heart, in the praying position. I can feel my heart beating against my thumbs.</p><p>Praying before the live cactus on the table.</p><p>I am trying to be here now.</p><p>Sono qui ancora. I am still here. It is the most delicious thing to be, though I must let go of it, being here, too, someday. It doesnt scare me nearly as much as it used to: death. I do, however, anticipate a nothingness. Which must be in its way unimaginably beautiful, glorious.</p><p>Im beginning to get cactus fuzz on my tongue, just a little. A big flame is happening in the glass jar where the candle burns and so I know the cactus approaches. I suppose a stick fell in.</p><p>\t\tA new mantra: It Is Enough</p><p>I AM ALL THAT I AM</p><p>I await the effect of the cactus, now afraid there will be none, or finding myself in meditation, trying to ask for a specific experience and/or outcome. I must let it be.</p><p>ALL WILL BE WELL.</p><p>Idea of Torch Songs for a Cactus</p><p>Does [the person who sent me this cactus, grown organically in Peru] have photos?</p><p>Event/Cactus Song</p><p>1. Empty Vessel</p><p>2. Boiling Eggs</p><p>3. Little Fires</p><p>4. Much Swallowing</p><p>5. Silence, a Flapping</p><p>6. Head turns</p><p>7. Tree branching in the Head</p><p>Everyone suffers.</p><p>Reading Rothenbergs Technicians of the Sacred, p. 34, The Fragments</p><p>I am now beginning to feel very sick, as though certainly I will throw up soon. Reading aloud these poems</p><p>All lives, all dances, and all is loud.</p><p>How pleased I would feel if I wrote a poem.</p><p>My horse with a head made of mixed waters.</p><p>My horse is with me. I have finally acknowledged him.</p><p>He carries me.</p><p>Peaceful voice when he neighs.</p><p>I am everlasting and peaceful / I stand for my horse.</p><p>The music (Dvorak) stops.</p><p>It seems last time I ate (almost 3 months ago), the cactus joy stayed with me about a month. How can I make the most of the easy joy to keep me bolstered when it dims? To appreciate the wisdom which enters contemplating the Shadow?</p><p>To be useful, still?</p><p>To write.</p><p>To pay attention.</p><p>If only I could stay on track, be disciplined, be steady.</p><p>I must visualize my horse, and let my horse keep me on the track.</p><p>Perhaps today I will meet him.</p><p>Now it feels right to smoke.</p><p>See To the God of Fire as a Horse.</p><p>I am receiving tingling in my head.</p><p>A lightness coupled with the approaching storm.</p><p>It is coming now.</p><p>The inner breath is the horse of the bodhisattvas.</p><p>There is nothing I can do now as I have eaten the cactus.</p><p>Does my body have a secret?</p><p>My body is a holy body.</p><p>It rides its horse through the days.</p><p>The horse is enormous & fearless.</p><p>I am protected at all times by my horse.</p><p>My horse walks with me and carries me.</p><p>It seems that physical stillnessat least so faris the best way to stave off the sickness. Which is with me now, heavy in my stomach, my throat, my mouth.</p><p>The Natives say the cactus tastes like the taste of oneself. I am tasting myself.</p><p>Lately I have noticed a shame in me about my body, bodies, sex. Or when John speaks sexually to me, not in the act but in normal time, and I get an unfortunate feeling which is shame. Why?</p><p>Whipped by compassion it / rears it drives the old yak / from the path of madness.</p><p>Our heads always produce so much greater pain than the world could ever produce upon our bodies.</p><p>Every One Suffers.</p><p>I feel healing ambling down the path to meet me, nuzzle me, a gray/white soft & warm horse, compassion.</p><p>Coming for me.</p><p>I want to stay always with this horse.</p><p>(This particular horse-moment represents my mother)</p><p>Her soft mouth & nose, her soft sounds. A little dapple of pink.</p><p>I am starting to trip.</p><p>With my horse.</p><p>She is my mother compassion horse, not my warrior horse yet.</p><p>I am so hungry.</p><p>I stand for my horse.</p><p>I feel deep love for this gray horse.</p><p>I think we are on a path in Wales near a fence, part wood part stone, in a forest but an oak & meadow place, sun & daylight.</p><p>Something Robert Frost.</p><p>The horse so much reminds me of a child.</p><p>I feel I am beginning to trip a lot.</p><p>Breathing feels cold & burning inside my nostrils, but it also did this morning when I noticed my breathing.</p><p>I am tasting myself inside my mouth.</p><p>What does it feel like to trip a lot?</p><p>A spinning, an alteration in all the senses.</p><p>I can hear the cat moving towards me like a springing sound from far far away.</p><p>The sound also has color, particularly a pink color.</p><p>The color and sound make waves on the air  which I both see and hear and are behind me.</p><p>In me things melt away, the body and its borders in space.</p><p>Objects become sounds and become fluid.</p><p>The quiet room becomes a round liquid bubble and we (the objects and I) are all floating.</p><p>At the same time I can feel myself seated on the ground with the table and paper before me holding a pen which moves to create these symbols which are words, and which I can spell and shape with ease.</p><p>I am a cross-legged praying beaded woman with my horse.</p><p>I feel I am around a fire.</p><p>I feel a stillness with this one, a peace.</p><p>I am seeing myself as a sitting prayerful woman, full of grace, humility, cooking, a quiet, a woman who gives quiet.</p><p>Who is slender with good hands, a slender face and lines.</p><p>I am the woman I want to be already.</p><p>But I just got a vision of a man, an awful man, he seems to have characteristics of many men I have seen (who are not close to me, men I know in passing). There, near a green cupboard. My whole body feels bad at this mans presence. He is small. He has gray hair which is cut around his ears but long. He has dark gray moss eyes, yellowish skin. I am encountering him, asking him who he is, he is so familiar but from far back in unconsciousness. As if sucking on a piece of straw. He makes wet sucking sounds. He doesnt seem sexual, mostly slothful. I think Im losing him now. Perhaps he is the man who always stands behind me.</p><p>All is well. All was well.</p><p>I want the man to go away now, I want my horse back. Perhaps he is the man who always stands behind me, who stabs my stomach. He seems the type to prey on vulnerables, and that among other men he is weak, he pretends to be strong among those he thinks are physically weaker or emotionally kinder than him. He is slimy.</p><p>Alone, I am stronger and more courageous than him.</p><p>With my horse we can scare him forever away.</p><p>He is in a house.</p><p>Just standing there, so lazy.</p><p>I am coming with my horse.</p><p>We are the sun opening onto the earth, like a fan.</p><p>He is going to become a good man now.</p><p>He is, after all, a part of me.</p><p>He must be. And I cannot kill him so I must change him, and love him.</p><p>Why cant I kill him?</p><p>Each bad thing must only be turned to its good side.</p><p>Anything can transform.</p><p>Nothing really ever dies.</p><p>Everything is eternal.</p><p>Therefore, it is pointless to try to kill or remain afraid.</p><p>That thing will not die or go away, it can only be transformed.</p><p>I have a lot of activity happening in my mouth.</p><p>A mouth event.</p><p>So much craving.</p><p>Also, cactus lumps coming warmly up my throat.</p><p>While the man was there I felt so cold.</p><p>Now I am beginning to feel warm.</p><p>Like the warm and cold spots in a lake.</p><p>Perhaps it is a good opportunity to focus on my mouth & its cravings.</p><p>To pay attention and see how it feels just to leave my mouth alone.</p><p>What various pleasures might be found in the stillness of my mouth.</p><p>I sit here on the floor, I have not moved at all.</p><p>I dont know how long its been, perhaps only an hour.</p><p>I am not paying attention to my mouth. I can let go in there.</p><p>I am.</p><p>Soft and gentle like my horses mouth.</p><p>My mouth is a garden.</p><p>Things happen there without intervention. I can let it be.</p><p>\t\tLESSON: STILLNESS MUST COME WITHIN MY MOUTH</p><p>My mouth is a place of such turmoil and emptiness.</p><p>Alcohol wounded my mouth.</p><p>Cigarettes wounded my mouth.</p><p>I was not done nursing yet. I am not done nursing yet.</p><p>How can I finish?</p><p>(I am feeling this profoundly, not just analyzing its possibility within me, or abstracting the realization, in my mouth.)</p><p>My mouth is good.</p><p>My horse takes my mouth into her mouth.</p><p>My mouth deserves to be touched and kissed.</p><p>Babies mouths, nursing mouths, such clean mouths!</p><p>I was not finished nursing yet.</p><p>Did I finish nursing Nora?</p><p>I dont know.</p><p>I was not finished being an infant with my mother yet.</p><p>Something cold and sharp happened between us.</p><p>Between me and my mother.</p><p>A pain happened, a disappointment.</p><p>She was an adult, I was a baby.</p><p>It was not my fault.</p><p>It was not her fault.</p><p>Poor Mother.</p><p>Poor baby.</p><p>A pain came between them.</p><p>Something cold and sharp.</p><p>It is still there.</p><p>I stand by my horse.</p><p>Me and my horse.</p><p>We are enough.</p><p>It will be well.</p><p>It might be time to get up, go to the bathroom, check the clock time, eat something, check the phone, put away the eggs.</p><p>A warm, gentle woman.</p><p>Peacefulness above me.</p><p>Peacefulness below me.</p><p>Peacefulness before me.</p><p>Peacefulness behind me.</p><p>Peacefulness around me.</p><p>Not Emily Dickinson, imprisoned in her hard abyss.</p><p>That is not me.</p><p>I open onto the path.</p><p>I bring sun.</p><p>I stand by my horse.</p><p>I am going to get up now.</p><p>It is 3:40 P.M.</p><p>I crawled, rather glided, to the bathroom, like a horse but really it feels more like a bear.</p><p>I lumbered.</p><p>I went to the bathroom.</p><p>I did not look in the mirror.</p><p>I did not check the phone.</p><p>I did not go to the kitchen, or eat.</p><p>I paid attention.</p><p>To my horse.</p><p>When I do yoga, I am being with my horse, he is teaching me how to move my body through space, how to fall onto the corners of grace.</p><p>When I close, retreat, let the thoughts rule, I am being with that man. The man leaning on the cupboard. Something about him is so green. I do not like him Sam I am.</p><p>I did not throw up, nor will I, I am with my horse.</p><p>I am not a shaman.</p><p>I am too much a woman (mother) (sister) (daughter) (wife) to be a shaman.</p><p>I am soft, I am all woman.</p><p>I will need more paper just in time for John to get home.</p><p>My Beloved!</p><p>What a peaceful and warm and gentle life we have!</p><p>How beautiful to see it.</p><p>I am seeing my own life.</p><p>Look, Horse, you have given me a good life, look.</p><p>Thank you.</p><p>Such a gentle time.</p><p>So much stillness.</p><p>I feel a medicine man with me.</p><p>(My Salvia teacher: he encounters me often from across a river, he on a small island. Sometimes we are in the same vicinity.</p><p>Sometimes I cross over to him on the back of a turtle.</p><p>Sometimes he lets me rest my head in his lap, he comforts me.</p><p>He confronts me.</p><p>He seems always to be there to teach me about plants, and about death.</p><p>He is death but he is the safest place, his eyes and his island.)</p><p>My ears are cold and inside of them they have pain.</p><p>It makes them feel closed, like they cant hear.</p><p>I have a realization about hearing:</p><p>The pain in my ears feels like a loss of hearing, even though it is not a loss but a pain.</p><p>And then, I wonder, is this loss a numbness, a perceptive dulling, a disuse, an allowance for other white noise to block out the soft, round, moving noise?</p><p>Perhaps others words become too painful to hear, over time.</p><p>It seems more women than men become deaf with age.</p><p>My great-grandmother and grandmother and mother all became deaf with age.</p><p>This bracelet I wore because I thought the words would be comforting. (It is a silver bracelet with seven linked charms, each engraved with a word, as follows: PEACE, LOVE, JOY, HOPE, FAITH, TRUTH, LIFE.) Now I see the words are like signs, street signs, meaningless. But the bracelets shimmer, and the sound it makes on the table when I write, are lovely.</p><p>I feel good feelings in my body.</p><p>A little cold, but I feel myself beginning to open, let go, one and one and another.</p><p>I can keep letting go.</p><p>I do not have to hold on.</p><p>Fall all the way.</p><p>My horse will catch me. Will fall with me.</p><p>I can just decide to look at myself and see goodness and beauty.</p><p>I can decide that and do it.</p><p>It feels dark when people (mother, father) look over the rim of me with judgment,</p><p>do not see a dwelling for goodness and beauty.</p><p>Mother, father, me: characters in the book of brain.</p><p>Assuming the faces and postures of a hypertext for the narrative of thinking.</p><p>The badly written first novel with its thousands of drafts.</p><p>My poor horse dragging the load.</p><p>Navigating the narrative with all of its F sharps and B flats.</p><p>When I was young, the best part for me and the horse was being let into the field.</p><p>Then what the horse smelled was stronger than what my hands said and we only ran, I let the horse run, and the horse ran so fast that the only real thing left was his breath and our two heads rushing past the blur of nouns: all verb. Being.</p><p>I keep my heart round and warm.</p><p>It is good and beautiful.</p><p>My horse is tall and slender, with me.</p><p>Together we are white.</p><p>Together we are good and beautiful.</p><p>Eve sees the me who is soft and gentle and good, which is why shes always trying to be near me, but I dont see the me she sees and become frustrated, and act like a me Eve does not see, and together we become frustrated.</p><p>Something sharp and hard comes between us.</p><p>Between me and Eve.</p><p>It is my own perception of myself which has come between us: she sees the gentle me, I see a cruel me, this misconception has come between us. Eve loves me because I am soft and gentle, and despite of the anxieties that arise from me when I fail to perceive myself the way I really am. Eve thinks that I am wiser than her and I think that she is wiser than me and both of us end up resenting each other.</p><p>Why do I always want to be left alone?</p><p>Because I have believed that I am cruel and ugly.</p><p>Because cruel and ugly stands alone.</p><p>Cruel and ugly has no horse.</p><p>Wherever I go, my horse is with me.</p><p>He talks with me, gestures, does.</p><p>My horse is like Christ.</p><p>Some people have Christ.</p><p>I have my horse.</p><p>Together we are white and gentle.</p><p>We are here, in the middle.</p><p>We are a quiet kind.</p><p>We do not need to expect so much.</p><p>We are easily satisfied, here in the snow, in the middle.</p><p>Just the two of us.</p><p>We can be in this stillness.</p><p>There are so many horses but this is my horse.</p><p>My horse is gentle & powerful.</p><p>My horse has a clean mouth.</p><p>My horse has a soft, quiet mouth.</p><p>My horse is equally peaceful if I cry or laugh or yell or am silent.</p><p>If I am crazy or sane.</p><p>I had to crawl or stride again to the red shelf in the kitchen to get more paper.</p><p>I must crawl because my body is sick.</p><p>But if I stride fluidly it is well.</p><p>If nothing hard or sharp comes between my movements and space, all is well.</p><p>\t\tLESSON: LET NOTHING HARD OR SHARP COME BETWEEN</p><p>\t\tYOUR MOVEMENTS AND SPACE</p><p>Perhaps I needed to be alone to find my horse.</p><p>To allow myself to be gentle.</p><p>To be free and also to write.</p><p>My hand doesnt hurt.</p><p>Now I anticipate John coming homeI feel I could do most anything at all.</p><p>I am calm.</p><p>It seems I keep returning to the same faces:</p><p>(Many many people are here, evidence of the thoughts and how many people influence me and my thinking all the time. Many many faces keep coming.)</p><p>When I see me it is a silhouette.</p><p>My mother I try to get a sensation of before the hard and sharp thing, when she was still warm, when our gaze had nothing between it.</p><p>I dont know if I am a healer.</p><p>I can heal with the quiet I bring.</p><p>I like to listen to quiet thingsplants drinking water, pot leaves sizzling in the bowl.</p><p>I wrap my hands, I cup the bowl to my ear.</p><p>I just noticed that I had closed again.</p><p>My body was hard and sharp.</p><p>Maybe this writing keeps me from being all the way free, but it feels so good to write.</p><p>It is what I do and yet it is what I do least often.</p><p>But in here it happens all the time.</p><p>In here all I ever do is write.</p><p>In here sentences are abundant.</p><p>It is so hard to choose which strings to bring down.</p><p>Too many.</p><p>Not so fun to make a shape, the shapes already are flapping there, an enormous flock of shapes and sentences.</p><p>They are hard and sharp.</p><p>If I can remain quiet & still in myself then I do not have to get sick.</p><p>Everything that seems ugly can also seem beautiful if it is soft and round.</p><p>I dont think it is only about the breast.</p><p>The earth is soft and round.</p><p>Kindness is soft and round.</p><p>Kindness is right hereI can reach out and decide to have kindness right now.</p><p>I wish it could always feel so close to me.</p><p>My horse is soft & round & kind.</p><p>The pain making a headache does not have to be pain it can be color, it can be fuchsia.</p><p>John is home.</p><p>It is 4:40 P.M.</p><p>Even though my horse is silky & warm & beautiful I can have him. He can be mine.</p><p>John is also warm and soft.</p><p>I feel lucid.</p><p>He is here. He is like a horse.</p><p>John came and sat with me for [15 minutes], very calm, very generous.</p><p>He said I want you to know that I have great reverence for the state you are in now.</p><p>He sat with me, then he went away from me to let me have this to myself.</p><p>While John sat with me I felt the essence of John and it made me cry. I felt suddenly overwhelmed by what seems holy about him to me. Sometimes the fading light coming through the windows and jolting off the Christmas tree clung to his face and put a mask there which showed me his skeleton. I decide not to be afraid of this skeleton and to hold instead the holiness of his presence in my center. His skeleton is within him as mine is within me.  When we see the skeleton we no longer need to fear the skeleton.</p><p>I am both out of the world and more in it than Ive ever been before.</p><p>I know Im altered.</p><p>I can feel altered and experience the joy of being altered, but also I am lucid.</p><p>I am peaceful and quiet.</p><p>Together with these, with my horse, we can be in any world and among anything.</p><p>A scary, weird anxiety world just happened, crayon-drawing, like light blue, black crayon outlines of a chainlink fence, some pink. A dog. A scary world.</p><p>Can my horse and I withstand this world and still be peaceful and quiet?</p><p>A world like depression and anxiety.</p><p>A world where there isnt the safety of my horse.</p><p>A world where my horse has become lost among the rocks.</p><p>And stuck behind the metal, a hard and sharp thing, a fence.</p><p>Now Robert Frost returns.</p><p>There isnt any grass or sun here.</p><p>It is lunar & bleak.</p><p>I must call to my horse.</p><p>Together, we can open.</p><p>We make the sun happen upon the earth like a fan.</p><p>We are soft and warm.</p><p>I can realize how every sensation, every encounter, it changes one.</p><p>It decides.</p><p>A tree on the path.</p><p>A squirrel out the window.</p><p>A cat sleeping on the radiator.</p><p>A face arriving into thought.</p><p>A smell of garlic and olive oil from the kitchen, or coffee, or the smell of someones hair or coat or of smoke.</p><p>The color of a shirt.</p><p>The sound of a voice, its pitch and texture.</p><p>How the senses sense decides.</p><p>If you are open</p><p>or if you are shut</p><p>decides.</p><p>Often I am hard and sharp.</p><p>This is when I become closed.</p><p>Then joy cannot come in.</p><p>Perspective has shifted to the lunar side.</p><p>The light falls upon objects and senses in a darker way. Shading objects and senses.</p><p>There is no pasture for my horse, no meat in the grass.</p><p>Pebbles and chainlink.</p><p>What I wear and how I smell matters to how I decide I am.</p><p>It comes between my movements and space.</p><p>It is good to make a gentle noise and have warm colors when I move in a soft & round way among other living things, other living things like soft & round, and they like pleasant sounds and warm colors. I like even to enjoy how I sound and smell and move and look through space, when I bring the sun to open on me, when light rolls slowly open on the small screen of me and my horse.</p><p>I have a craving in my mouth and at the same time I almost become something hard & sharp between what I wrote and Johns attention and then I feel myself close and become everywhere hard and sharp.</p><p>My father is hard and sharp.</p><p>He does not have any softness or roundness left.</p><p>He must have some.</p><p>His eyes perhaps are still soft and round.</p><p>Such a pale green color. The color seems to fade and fade all the time.</p><p>I am so sad for my father and his bony horse.</p><p>His sharp, starving, dark horse.</p><p>Oh my poor father, how cold and sharp and gray it must be inside there: look at the soft warm brown skin on my hands, they want to come closer to this sad horse.</p><p>Now I feel closed and cold and afraid.</p><p>I am writing it all down so that I have help to remember how to find the place of joy and sun because it is where I want to live and also I can live there now I dont have to be in the cold sharp darkness anymore. Now nothing needs to come between me and my writing and my poems and the poetry that this mind in here can make when it is soft and round and warm.</p><p>Like the gentle sweet mouth of my horse.</p><p>LESSON: EATING THE CACTUS IS ALWAYS THE RIGHT THING TO DO</p><p>The physical feelings are like birth. The feelings of birth, of opening, shutting ,needing to stay open to be well. Only a few fundamental things I keep coming back to like the faceswell, round, soft, warm, horse. Open, horse. Open, woman. Open, peace. Open, sun.</p><p>I dont wantwell I do want just now to go back and read everything, but I wont.</p><p>I will be the process, not the obsessor.</p><p>I will be open and moving, nothing between my movements and space.</p><p>Amazing light is warm and sort of flashing between the spiral on the notebook and the pen and my bracelet. Melting, morphing, shocking light. Alive light.</p><p>John being home is something between movement and space, he himself is warm and good, but around him in me fears and cravings happen and I begin to close.</p><p>I am thinking now of the e. e. cummings poem, opening, like the rain, so many places beyondnothing not even the rain</p><p>I am really trippy now, lots of visual stuff is happening: light shows, everything seems to be melting. In a beautiful, awesome way. I am awe-filled when I stop to gaze around me. The lights from the Christmas tree reflected in the window stream out into the room and make the room seem filled with stars. My hand has become like something without bones.</p><p>But, I am trying to stay like a river, moving, in process, going, doing, being, moving.</p><p>Moving forward is important even if it is slow.</p><p>Me and my horse.</p><p>I might want not to write for awhile, to walk around and be, maybe to cook.</p><p>Maybe to just close my eyes and see what happens, can I feel my horse and know his name?</p><p>I just heard the phrase some people happen in here and I realize it happens all the time.</p><p>Shhhh</p><p>I am here, in the middle, with my horse.</p><p>I feel the manic notions come on, they feel good, but I dont need them.</p><p>We can move slowly.</p><p>We can be in the process of moving all the time, never arriving, always this soft chaos, these familiar strangers, these closings and openings, occasionally an apple falls from a tree.</p><p>Otherwise it is like this, me and my horse, me and my shadow, strolling. Just strolling. Expecting nothing.</p><p>When we open we are peaceful.</p><p>When we open we are quiet and slow and not manic.</p><p>I am having cool watercolor, silky Japanese-like painting images float through,</p><p>the Floating World, browns and salmons and orangeswarm.</p><p>Calligraphy and elegance and movement.</p><p>All of it is right here.</p><p>I am deciding now to reach out and have it.</p><p>Every single thing is, right here, so close and simple and ordinary and beautiful.</p><p>Being clean.</p><p>Being open.</p><p>Being quiet.</p><p>I can have.</p><p>Deep breaths, cleansing breaths, help dilute the mouth-cravings. Above me and this writing exist the idea of it and other peoples possible future consideration of it which in fact is huge and can be gotten rid of now.</p><p>Thank you. Goodbye.</p><p>This can be trippy, or it can be quiet, or nervous, or lucid and joyful. I believe I could do anything or talk to anyone right now in this state of being quiet and peaceful, tall slender woman with my horse, here.</p><p>If I just keep breathing, it is all calm.</p><p>It can be like birth.</p><p>An opening. A transformation.</p><p>A big change. In the body and around it.</p><p>All the cells have shifted.</p><p>My horse was there when I birthed Nora.</p><p>I myself try to go there now, can come back to this after.</p><p>My neck and hand hurt.</p><p>I may lean back into my horse now and remember something</p><p>Except that I wonder why the pages become so rounded after Ive written on them?</p><p>Page after page, it sounds like fragile bones, turning them, filling them.</p><p>Making the light and the clanging as I write.</p><p>The pages curl around the writing. They curl into scrolls.</p><p>They curl around my hand and arm, around the bracelet which clangs and glitters when I write.</p><p>Papyri.</p><p>Now I have Egyptian images, the scrawls on the page look hieroglyphic.</p><p>My horse is my animus and I deserve him.</p><p>A little bit of burning white sage fell into the glass bowl where the candle burns, fell onto the cactus powder I dropped there for the gods. It smells badly.</p><p>Maybe the cactus has your smell too.</p><p>My horse I think smells of sage.</p><p>I am seeing so many trails and luminescence that soon it might become impossible to write. Seeing symbols and stick letters and child writing above me here on the page.</p><p>The page stretches and morphs above this sentence almost up to the ceiling. It is so tall and rubbery. Like a big movie of child writing.</p><p>So much joy!</p><p>I stand by my horse.</p><p>Together we are strong and humble and brave.</p><p>We are warriors who can withstand but who refuse to fight.</p><p>I am a woman who refuses to fight.</p><p>This is true.</p><p>I dont like how the white sage and cooking sage smell when they sweat, they smell like cured meat, an oily smell, a manly horsy smell. I can stand by the fact that I am a woman who will refuse to fight.</p><p>Right now my body feels lithe and open, limber, having endurance. I feel a little bit of manic so now I slow down to me and my quiet soft horses mouth here.</p><p>Ah. Breath. Here. Joy.</p><p>Coming back around to Noras birth, do I want to go there?</p><p>And then try to find the hard sharp thing that came between me and Nora? Is it like what came between me and Eve?</p><p>It is such a sort of cruel awakening, to discover that what an Others painful behavior towards me might actually be is a misconception, a wall between movement and space, in perception: she sees tall slender, I think she sees weak incompetent and in between happens conflict. Pain. I see in her: tall slender. She thinks I see something else which she then becomes to fulfill her own fantasy.</p><p>Yes.</p><p>This is what comes between all of us when love stops moving softly through space, accepting.</p><p>And even to look back harshly on ones own behavior, to be critical, to judge, that is a way of stopping love from moving softly through space.</p><p>Love and Time can be the same.</p><p>They dont even matter.</p><p>Love, Time, Joy, Peace, all of it is the same, comes from the same expanse, all of it right here.</p><p>It is up to us to keep moving softly through space.</p><p>I can move and do: it can be for God, for my horse, for love.</p><p>It can be for the cactus.</p><p>It is enough.</p><p>It will be well.</p><p>I am getting orange and lavender Indian imagery now, Buddhist, Hindu, at once, in the sun, somewhere, when I thought I was going to remember Noras birth and as a craving happened in my mouth, I noticed a tightness, a closing, in response to this craving, in my mouth and it created these colors and images of India. A wall of a temple or even just a dwelling. Women hanging clothes on a line to dry. Orange and lavender images, idols, fabrics, smells which are also orange and lavender. There is even an accompanying sitar sound.</p><p>Things are trippy again and now John is here sitting near the window, on a chair? On a cloud?</p><p>Something is happening to me, to my body, that is like birth. It opens and shuts, it is painful and beautiful, like birth.</p><p>I did give birth to a child.</p><p>It is not a fairy tale it is an Event that happened to my Body and to Hers.</p><p>Then I guess I was more like a bear, but I know now that my horse was with me.</p><p>I can decide to see myself as I really am, or to see myself as grotesquely exaggerated.</p><p>It feels self-absorbed to go on with these proclamations, but it is what stands between myself and sanity.</p><p>That is what stands between me and my horse.</p><p>When I am soft and round with my horse in our movements through space, all is peaceful everywhere around me.</p><p>When I choose to distort myself and focus on maintaining that distortion, then cravings happen in my mouth and Ive lost my horse and there isnt goodness or peacefulness around me.</p><p>It is good to stay with my horse.</p><p>It is good for the world when I see me: tall, slender, gentle, kind.</p><p>Then I can stop seeing, I can accomplish the sight and let it go, because it is this seeing which stands between and is sharp and hard.</p><p>I wonder if really it is all somehow about sex, like the Indian legends from Labrador.</p><p>But then below that something else insensate.</p><p>The place below cravings, it is a scary place because it is Endlessness.</p><p>It is the vast allness that is movement through space forever, the ocean rocking, a baby sucking, a man fucking, people rubbing, eating, swallowing, moving forward through space.</p><p>Not like a carousel that goes around but stays stagnant.</p><p>We are fluid, sweating, muscly horses moving through space.</p><p>Yoga, sex, birth, talk, sleep, death.</p><p>It is all just about going forward, crossing over.</p><p>Constantly crossing over the thresholds.</p><p>Pushing through to each entirely novel world of sensation and thought,</p><p>of age and fear and hope.</p><p>Flag in Space.</p><p>I am a flag in space</p><p>One of the flags</p><p>I waver and move</p><p>It is cold or warm</p><p>I represent me</p><p>These are my colors</p><p>This is my limited set of circumstances</p><p>This is my only field of being</p><p>Here is the symbol for my father</p><p>You cannot see the way my</p><p>\tmother loved me because we</p><p>\tdont have symbols for that</p><p>\there which is why we all are</p><p>\twounded</p><p>My flag traveled from there</p><p>\tto here to arrive</p><p>I wonder if it is tattered</p><p>Then I choose to decide to see that</p><p>\tit is not</p><p>It is not an American flag,</p><p>nor any hard sharp thing</p><p>between something and freedom</p><p>My flag does not begin or end</p><p>Like this ink I can see it</p><p>\tsolid in time, or I can allow</p><p>\tthe silky soft altered</p><p>\tmovements to happen</p><p>My flag is silky and womanly</p><p>It stands alone in space</p><p>In this body I am a flag held</p><p>\thigh all alone in space</p><p>On my horse I am everything</p><p>I am rabbit, mountain, tree</p><p>**</p><p>I have felt over time as John came home and night fell, have felt sexual curiosity.</p><p>Having written it down now I feel the place of stabbing in my stomach, a closing, a shame.</p><p>It is not being open, fluid, moving forward through space.</p><p>Allowing myself to be touched.</p><p>To go away the men heads above this writing.</p><p>Allowing myself to open to pleasure.</p><p>Perhaps it is time now to listen to Father Joe (a Jesuit priest who is also a trained Iyengar yogi)</p><p>**</p><p>I cannot leave my writing behind.</p><p>I think it is like my horse.</p><p>I crawled, strode, to the den where the tape player and my yoga mat are.</p><p>Along the way I craved for my writing.</p><p>Im wrapped, like a shawl, in a blanket. The blanket covers me as I crawl.</p><p>I think my writing is like my horse.</p><p>As I came back to get it, crawling, striding, I passed the mirror.</p><p>I looked into the mirror, a spontaneous gesture.</p><p>I saw a beautiful woman there even before something hard and sharp came between me and that perception.</p><p>I suppose the hard and sharp thing is my father.</p><p>Of course I have known that all through time, but it takes a lot of scraping and softening to say it,</p><p>to make it a symbol</p><p>on a flag.</p><p>My father is the hard and sharp thing that came between me and my mother.</p><p>It is not my fault.</p><p>But I still have not forgiven him.</p><p>And my refusal to forgive my father is the hard and sharp thing that stands between a gentle love moving softly forward through space between my father and me.</p><p>This all tonight, me sitting here with my horse, or gliding through.</p><p>It feels so much like birth.</p><p>Breathing, lumbering, opening, transforming.</p><p>Straddling the cosmic threshold.</p><p>Straddling that threshold as it moves forward always below me through the floating  Now which is space.</p><p>The continuum of the present.</p><p>The continual leaping through.</p><p>So quiet and still.</p><p>I can choose to have trippy visuals or not,</p><p>it could be diverting or closingI dont know.</p><p>But today here on this threshold I am choosing to be awake.</p><p>AWAKE IN SPACE.</p><p>Lucid.</p><p>Intentional with every movement of my life through space.</p><p>Me and my horse.</p><p>He will keep me upright and steady and on track.</p><p>If I could just always remember that hes there.</p><p>Hes right here, his soft warm round mouth right here on my face.</p><p>It is not sexual.</p><p>Here is where it recalls the fundamental freedom and plainness of being a child.</p><p>Shapiro says Norman O. Brown says: We do not need humor in childhood to be happy.</p><p>In childhood, we need nothing but life to be happy.</p><p>We are alive and curious and safe.</p><p>Everything is wonder.</p><p>Perception has not been dulled by time, in this state I can remember the way of seeing things as a child, how bright and textured they were, all the colors, all the mystery of sight.</p><p>Children, still running in the fields with the horses it is not even a surprise to them.</p><p>They still have God right here, so available, to them and through them.</p><p>God moves through them so softly and roundly!</p><p>Nothing hard or sharp includes teeth and jaw in the mouth.</p><p>Bipedalism and its vantage sensations are very unappealingseem anti-horse.</p><p>(I stood up and walked. It felt unpleasant.)</p><p>What I want really deep downeven what my aesthetic yearns foris the simple rounded corners, the boundaries, of childhood.</p><p>The playpen.</p><p>Preferably wooden and rounded.</p><p>With this writing, am I letting the thoughts win or am I setting them free?</p><p>Am I paying attention, or is this record and my activity making it stealing my opportunity for real attentiveness?</p><p>Animal alertness.</p><p>It is because I am afraid.</p><p>The writing is the last breath of the thoughts.</p><p>Someone elses horse can take them away.</p><p>I must always remember to make enough room beside me for my horse.</p><p>It is not sentimental, it is just a matter of affection and respect.</p><p>Wallace Stevens & Emily Dickinson are not even nearly related.</p><p>He is closer to Whitman.</p><p>She, yes, to the Puritan.</p><p>He had such a free and beautiful and leaping mind.</p><p>The mind that revealed itself on the page.</p><p>On the page, it seems he had settled things well with his horse,</p><p>they were familiar and happy with one another.</p><p>And so he had all that freedom in there for his poems.</p><p>Emily Dickinson had so many hard, sharp things between herself and her horse.</p><p>Her poor horse was locked outside the bedroom.</p><p>She once did but then she stoppedriding her horse, being a child, being simplelike the clean white cotton of her dresses which gave her pleasure</p><p>Yes, she stopped.</p><p>Her mind was very strong and tenacious, its record helps us understand how hard & sharp things come between our movements and space.</p><p>Wallace Stevenss poems show us how round it is when nothing at all comes between movement and space.</p><p>**</p><p>To move forward through space also actually means to  even give up deciding.</p><p>To not stop to think before doing one thing or another.</p><p>To just keep moving forward through space, and then reaching the point (which moves) when preparing for, anticipating, expecting, a future dissipates, POOF, very child.</p><p>That is Freedom.</p><p>A body and its spontaneous sensations moving forward through space.</p><p>Even a headache is really an anticipation of future misery or future relief.</p><p>It is not an Event.</p><p>It could be if it were seen as not a headache, but an opportunity</p><p>To Open.</p><p>To stop writing now and become a fluid body moving through space, with my horse.</p><p>On my horse, as my horse, my horse is space.</p><p>\t\tLESSON: MY BODY IS MY HORSE</p><p>Wow.</p><p>I am riding it, I brand it and beautify it and scar it and modify it, it is my horse but it is not me.</p><p>Nothing sensate is me.</p><p>Now I am able to go deeper.</p><p>Because the cactus can take me to the deep boundless space where  I really am.</p><p>(At this point I unrolled my yoga mat on the floor, put in the tape of Father Joe called Guided Meditation, and lay down on the yoga mat. I was covered by many blankets because my body temperature was low and I was very cold and quivery. The body load of the cactus is considerable, the body becomes fragile and it becomes necessary to show it great compassion. An attempt at a narration of the Meditation Event follows. I did not write during it. The time was approximately 7:30 P.M.)</p><p>A MEDITATION EVENT</p><p>Father Joes voice emerges onto space as if from outer space.</p><p>Behind it, soft flute music can be heard, an Asian melody.</p><p>The music is almost undetectable.</p><p>At the beginning, he guides one through a relaxation.</p><p>He says offer your body to gravity. It is a lovely thing to say.</p><p>As I approached each joint and muscle, I felt them shift, a dramatic opening.</p><p>I felt my body fall dramatically away from me and to the floor, like a heap.</p><p>Father Joe begins to focus on breathing.</p><p>He says feel how the breath enters the nostrils, and how it leaves.</p><p>At this point my nose became the bottle in I Dream Of Jeannie.</p><p>It was full of satin and silk pillows.</p><p>I could sense the breath coming in and out like the magic steam of a geniis bottle.</p><p>I could feel the breath swirling through my body which was the body apart from the heap on the floor, but also the heap on the floor, both bodies.</p><p>In one sense, the swirling breath held me in levitation away from the body.</p><p>In another sense, the swirling breath kept me grounded in my aliveness.</p><p>I was able to experience the dichotomy without confusion.</p><p>The breath enters, cold and harsh, along an upper canal in the nostrils.</p><p>It departs warmly along a lower canal in the nostrils.</p><p>This experience was extremely consuming and blissful.</p><p>The apex of Father Joes narration through the meditation arrives.</p><p>Here he requests that the meditator acknowledge all aspects of a life and separate from them.</p><p>I am to imagine my most Beloved.</p><p>I am to see the face of this Beloved, and say to it You are so precious to me. But you are not my life. My life is separate from you, with its own destiny. Thank you. And goodbye.</p><p>At this time I saw my mother.</p><p>It was shocking to me that she appeared at this point in the meditation.</p><p>I felt shocked because I realized that I had not left my mother yet, since infancy.</p><p>And I felt deeply within me the hard and sharp thing between us, which kept me from experiencing how much I love her, which was/is more than anyone else.</p><p>I recognized how the love was stopped short before it got all the way to her, before it could transform back to me, and out to others.</p><p>And I realized that the hard and sharp thing was my weaning, on one level, and my father, on another, and that perhaps I had put the two into one.</p><p>And, that I had not forgiven him.</p><p>At that point in my meditation with Father Joe, as he moved forward into a request to see ones good name, reputation, and ones home and so on, all the things to separate from, I continued with this image of my mother and my father.</p><p>I felt like a presence in space pulling away from them, who loomed hugely.</p><p>I saw my fathers face on a Hieronymous Bosch canvas, a lunar, pained, crooked face. A detail from a painting, perhaps the face belongs to a soldier, I dont know. But in this vision, the face was my fathers. I saw so much about my father that is pain.</p><p>Then, I forgave my father.</p><p>I accepted that forgiving can be quiet and internal, it does not have to be loud or public to be true, to have effect.</p><p>I let my mother go.</p><p>I thanked them.</p><p>I said, You are not my life. Thank you. Goodbye.</p><p>It caused me grief, and then relief.</p><p>At the end of this series of goodbyes, Father Joe requests that we say goodbye to our own life.</p><p>I saw my horse, standing in a pasture.</p><p>Coincidentally, at the very moment when he said Now you must say goodbye to the most precious gift of all, to your very life, the candle which had been lit in that room, and which was placed in front of the tall mirror on its stand, went out. Very effective!</p><p>It was difficult to say goodbye to my horse, but I did do it.</p><p>Leaving my motheras if directly from the breast, being pulled away from a kind of suction in that outer space landscapeand beginning to accept how deeply I love her, may have been the most powerful experience of the entire journey.</p><p>The most visceral and surprising experience.</p><p>And, it reminded me that the very first time I ate cactus I had a minor anticipation of this.</p><p>I saw my mother in the sky and was asked by the Cactus in the guise of a Moon Goddess to let go of my mother. It was passing and didnt last, it was a minor event in that first experience.</p><p>This time perhaps I was ready for it.</p><p>In any event, obviously, it was all quite Freudian and possibly influenced by my reading of Norman O. Browns book Loves Body.</p><p>Then I got up and it was time to consider eating.</p><p>DINNER EVENT</p><p>John entered the dark room as I was attempting to rise up off the yoga mat.</p><p>We decided to make something to eat.</p><p>It was almost 9:00 P.M.</p><p>I decided to make John some guacamole, and he put into the oven a spinach & mushroom pizza.</p><p>Slicing the avocadoes felt very powerful.</p><p>I saw myself seeing them hallucinatorily, but also felt confident in my ability to slice them and make the guacamole.</p><p>Then I sliced a tomato.</p><p>I smelled the tomato deeply.</p><p>I touched its texture, its gelatin, the inside shaped like a heart.</p><p>The slippery seeds.</p><p>To me it smelled almost like a pumpkin, but younger.</p><p>Like a squash but younger.</p><p>The same secret smell of earth.</p><p>It is a feminine smell, it carries a secret forward from the earth.</p><p>I considered the cucumber.</p><p>The cucumber has only the faintest hint of that smell without any of the dark earthiness.</p><p>It is almost a eunuch, abandoned between genders in a sterile existence.</p><p>Clean and white and long and hard, almost sterile.</p><p>Some images of women who are like cucumberyoung models for example, I dont know why Im seeing this, so-called enviable women who seem very sterile and clean and thin.</p><p>Icons of beauty in our culture.</p><p>Secret smells and slop scare men?</p><p>He makes that something else?</p><p>The cucumber, to him, is more familiar?</p><p>Sterility, is that the beautiful ideal?</p><p>That happened while I made guacamole.</p><p>I sliced an onion and its smell climbed from the cutting board to my nose like two-by-fours.</p><p>Sort of golden slats climbing stairs from the board to my nose.</p><p>I saw them and smelled them.</p><p>In response tears fell out of my eyes, dripping down the slats which had created their own stairs.</p><p>Something Cinderella.</p><p>Not a stinging, but a reciprocity.</p><p>Mixing the guacamole seemed fascinating.</p><p>It went from hard, chunky to blended, smooth.</p><p>The instrument of Fork, a miraculous invention.</p><p>Fundamental and useful.</p><p>I would like to be as Fork in the world.</p><p>But truly I would rather be spoon.</p><p>I held the pipe to smoke for perhaps half an hour without smoking because John and I spoke as he ate the guacamole with chips and we ate the pizza though I could only eat one piece. I did not have my writing with me during this time. I cant recall what we spoke about.</p><p>Finally I did smoke.</p><p>Upon eating and smokingintroducing new elements to the cactuss journey through my bodythe headache I had foreshadowed at the beginning arrived dramatically.</p><p>Also, I had an anxiety attack.</p><p>The anxiety attack was in response to the headache which was so extravagant I feared my brain might be breaking open.</p><p>I also think I was anxious because John decided he would go to the Artists Quarter to hear Happy Apple, that he would leave.</p><p>I did want him to be able to go, but perhaps, without realizing it, I feared being alone as my journey wound down.</p><p>I also considered the possibility that not eating at all, and perhaps not drinking enough water and becoming slightly dehydrated due to the intensity of my experience, might have encouraged the headache.</p><p>It was time for me to lay down on the couch.</p><p>It was time to wind down.</p><p>I asked John to find a film for me to watch.</p><p>It was 10:20 P.M.</p><p>He brought in 4 films to choose from, one of them Hannah and Her Sisters.</p><p>I chose that one because it contains the e.e. cummings poem which had visited me earlier in the journey.</p><p>I lay on the couch covered with many blankets and tried to imagine all the joints in my head and neck and all of my brain opening opening opening and relaxing.</p><p>I was testing my ability to release the pain, or to transform it.</p><p>Occasionally, if I concentrated hard enough, I succeeded to a degree.</p><p>John left.</p><p>As I watched the film I picked up the notebook and began writing again.</p><p>**</p><p>Woody Allen, like Franois Truffaut, on film, really are Advance Scouts, out there narrating the inner journey, trying to spin forward into space but getting stopped short by thoughts.</p><p>When I stop and let the thoughts coil out and build their complex systems around each other, outwards and outwards, I am then like an enormous tree planted at a point in time, not moving forward through space.</p><p>The thoughts puff out around my head, coming between me (my core-trunk-heart-self) and sensation, touch, lovefrom husband, daughter, friends, sun, rain.</p><p>If I remember the vision I had in Walesof myself as pinemy spirit tree is a pineit would be helpful: more fluid, evergreen, sloped, room for the wind to come through, sweet-smelling.</p><p>The cactus gives one a physical foreshadowing of old age, the crookedness and tightness over all this time in the body. The body coiling inward, perhaps aligned with thought. Or, with yoga, the body opening, like birth, opening.</p><p>Opening at the joints, in the joints of thought.</p><p>To keep letting go.</p><p>It demands concentration, even yoga, which itself causes a tightening.</p><p>I can be in this dichotomy: concentration/letting go.</p><p>Poor Holden Caufield! The most advanced Advance Scout of them all.</p><p>If a body meets a body coming through the Ryeit is very mystical-sounding to me.</p><p>I realize that phrase, or a rooting after what the phrase is from as it works in that bookand the book takes the phrase from a traditional songhas been tracking in my mind for many days.</p><p>I have such a headache.</p><p>It is worth it, I dont mind having the headache.</p><p>I do not regret the headache.</p><p>It is, though, devastating in its scope.</p><p>So much painmore and more as I read and/or write.</p><p>And move about.</p><p>I am going to take a bath now.</p><p>MILAREPA EVENT</p><p>While I let the bathwater run, and put the kettle on for tea, I read The Quest of Milarepa</p><p>This may be the best poem I ever read.</p><p>I reflect little but persevere much (moving forward through space)</p><p>Knowing one thing I have experience of all things;/</p><p>knowing all things I comprehend them to be one.</p><p>I have no store of provisions for my livelihood. (moving forward through space)</p><p>I have little torment. . . little desire . . . little attachment. . . .</p><p>Little is still some.</p><p>Milarepa is human.</p><p>One can be free and still have a little attachment, a little suffering.</p><p>. . . on the sixth day of the month of the barking of the fox (awareness)</p><p>By Awareness, I am thinking before clock time there was a different perception.</p><p>Not so many layers of science and materialhard and sharp thingsbetween oneself and perception.</p><p>One knew to listen, knew to hear, the foxes barking, and when they barked.</p><p>Now I have no choice but to contemplate my name.</p><p>Contemplating my name, I come to realize that I have never believed that Sarah was actually my name to have. All along too I have thought I was expected to believe to want to have nothing.</p><p>Not want nothing.</p><p>But to not have anything.</p><p>i.e., I should not feel inspired to possess.</p><p>Even my name?</p><p>Going back and back, I try to find this source.</p><p>In the beginning, it was my childhood.</p><p>So many children below me, so much sharing.</p><p>Sharing my mother and father, sharing my space, sharing my time.</p><p>Being responsible for the children below me before myself.</p><p>It is the duty of the oldest child.</p><p>Later, in adulthood, reading Zen and Walden, and many other things during a pivotal moment in my late teens, transforming this concept to one of a spiritual ideal.</p><p>However, I see now that to possess, and to possess, they can be two things.</p><p>Very very different.</p><p>I can sit in that dichotomy.</p><p>I can yearn for unattachment, which itself (yearning) is a form of attachment.</p><p>I can simultaneously  have my name.</p><p>Sarah.</p><p>Inside now the sound of that name is mine.</p><p>Now I go to the barking foxes.</p><p>Now I feel it must be lucky to have a last name of Fox.</p><p>I also realize that the word Fox in fact has three syllables.</p><p>The letter X is three syllables to say.</p><p>Somehow I am getting Maya visions with the letter X now.</p><p>I see the complicated eggs and joints and bendings in a Maya drawing.</p><p>Simultaneously, I see Milarepa in the snow with his small cloth.</p><p>Milarepa is Tibetan, but in his thoughts, as I see him laying having thoughts, are Maya images.</p><p>I can find myself in the middle of the X,</p><p>at that crossroads,</p><p>the essence of the animal captured in an X.</p><p>Perhaps it is the best letter of all.</p><p>It is the zero.</p><p>It is the four corners and the center.</p><p>It negates and births.</p><p>It brings something forth from its negation, from its middle, a clarity.</p><p>It has a good sound to softly skid my name to a close.</p><p>That I am the singer of little songs, / proves that I have learned to read the world as a book.</p><p>I read this poem many many times. I cant quite believe how good it is.</p><p>BATH EVENT</p><p>Milarepa held the headache was held at bay.</p><p>I was so cold, cold all the way to the central part of me.</p><p>During my treatment with acupuncture and Chinese herbs, it was always acknowledged that I have excess fire, in my kidneys, but also that I have poor circulation of fluids.</p><p>Somewhere in this is a dichotomy, which now I sit with.</p><p>And, I can feel in my body this dichotomy: the fire is a surface fire that doesnt go deep enough.</p><p>I am not fire at the core.</p><p>In this realization I understand that physically I am like my father.</p><p>That the fire has almost gone from him, he is almost inside-out now, a cold strangling of his joints.</p><p>I have a cup of peppermint tea.</p><p>My headache is profound.</p><p>Emerging into the bath and its warmth feels so healing as to be almost unbearably good.</p><p>I lean back and decide to breathe the steam of the peppermint tea.</p><p>I surround my head and the tea with a wet washcloth, breathe in and breathe out the vapor of peppermint.</p><p>This is vastly healing.</p><p>I begin to fantasize about ways I could try to heal my father.</p><p>I fantasize about making him a bowl of peppermint tea when he has a migraine and helping him open and open inside his head until the pain disperses.</p><p>I breathe in this vapor for awhile.</p><p>When I finish breathing, and emerge from behind the washcloth-shroud, the headache returns.</p><p>I decide to attempt to completely open my body, to completely relax, and so I sit upwards.</p><p>I close my eyes and feel my body relax from head to toe.</p><p>I go downwards, and I imagine I am in a slump.</p><p>I open and open and open.</p><p>I feel I must look like a slumped sack.</p><p>When I open my eyes, however, I find myself in a perfect lotus position with my spine aligned against the tile.</p><p>I feel very surprised by this.</p><p>I am completely relaxed, yet I am in a perfect lotus position.</p><p>I decide it is an opportunity to learn something about my blocked energy, about the source of this headache and others like it, or an opportunity to discover some knowledge about my chakras.</p><p>I close my eyes and request to my body to show me which chakra experiences the most severe blockage.</p><p>Almost instantaneously, my neck and throat bulge with sensation.</p><p>My jaws and the joints of my jaw begin to burn.</p><p>I realize it is my throat chakra, although I do not know the significance of this, and make a note to look it up another time.</p><p>I sit in this position with an easy smile, relaxed, when I give up and surrender my body to gravity the headache is almost gone.</p><p>I sit until I am warmed.</p><p>Then I emerge from the tub, dress warmly, and lay back on the couch to watch the film.</p><p>Before watching the film I write a few more things down.</p><p>**</p><p>I can see why Michaux (Henr Michaux, in his book Mescaline: Miserable Miracle) feared green and yellow and red, or felt not sympathetic towards those colors. They are most unpleasant to feel. For a while in the bathtub when the headache was intense everything was green and yellow. It was like melting plastic. Putrid and rotting.</p><p>Better are warm pinks, browns, oranges, and any shade of blue at all even violet.</p><p>While I was in the bathtub before the chakras happened, I kept sensing a presence walking in the hallway.</p><p>I kept believing I saw the bottom sway of a white robe.</p><p>I had the briefest of sensations that a being like a wizard was walking in the hall.</p><p>Whenever I heard the swish of the robe, I almost became terrified.</p><p>I decided I definitely did not want there to be a wizard in the hallway.</p><p>I was not prepared to meet a character such as this at the end of my journey.</p><p>I was not prepared, being completely naked and with this headache, to receive some possibly destructive or at least completely alien character.</p><p>I was glad when the swish stopped and the character did not materialize.</p><p>I keep thinking of Stevenss blackbird.</p><p>A man and a woman are one.</p><p>A man and a woman and a blackbird are one.</p><p>A woman and a cactus are one.</p><p>A woman and a cactus and a blackbird are one.</p><p>The poem is like this experience.</p><p>Although the language to describe how it is like this experience does not exist, which is why the poem is a poem.</p><p>Although the poem itself is this records shadow.</p><p>This writing that Ive done, or maybe my writing is the shadow of that poem.</p><p>Also, the poem, effortlessly, is superior.</p><p>It shows how many ways there are to say the one thing.</p><p>The last cactus journey was joyful, ecstatic, and triggered mania.</p><p>This one is so much more calm and I think deeper, more lasting, very honest.</p><p>Quiet.</p><p>It coincides with the prominence of my interior monologue.</p><p>I did not dance or be loud.</p><p>The pain in my head does be very loud now though.</p><p>Now it is time to go into stillness, to come forth from the journey.</p><p>Oh my cactus, you are so very precious to me.</p><p>But, you are not my life.</p><p>I have a life and a destiny which is separate from you.</p><p>Thank you.</p><p>Good-bye.</p><p>",
 "year": "2004",
 "id": "39801",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-01-26T08:00:00.000Z",
 "views": "30690",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "22 g",
   "administration": "oral",
   "substance": "Cacti - T. peruvianus",
   "form": "(dried)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
