{
 "title": "Cross-Eyed As Hell",
 "author": "Syringe",
 "citation": " Syringe. \"Cross-Eyed As Hell: experience with Hydrocodone, Promethazine & Codeine (ID 39836)\". Erowid.org. Jun 12, 2006. erowid.org/exp/39836",
 "substance": "Hydrocodone, Promethazine & Codeine",
 "bodyweight": "125 lb",
 "report": "<p>I went to P's house with 2 other friends and I went to use her restroom and the bathroom cabinet was open and there was a bottle of promethazine and I had drank that shit before because it fucked me up nicely. But it had been so long since I had done that.  So I just open the bottle and not touching my lips to the container I just dumped good size gulp, and then took another nice size, which I think is about 6 of those nyquil cups maybe more because I was a little drunk.  </p><p>Then I found this bottle hidden behind Pepto-Bismol, and it was hydrocodone bitartrate / Acetaminophen so I take 3 of them.  I was up for about an hour and F woke me up after almost 2 hours.  We went home which was almost an hour drive, I passed out again, then when I came home I tried to text message my friend and I was like cross eyed or something, I thought I was making complete sentences that he could read, It thought I was typing fine on my phone but it was really fucking hard; what I really typed was nonsensical.</p><p>I don't know what my friend Q said, or if I even sent it.  But as I was trying to concentrate typing that I would slowly pass out enough to where I was dreaming, a hole scenario, or I don't know if I was sleeping because I was talking, and my bro came in and he's like dude who the fuck are you talking to, are you talking in your sleep? And I did this like 8 times, each in a different scenario.  This is when I decided I need to sleep, like whoa, and I just plopped on my bed.</p>",
 "year": "2005",
 "id": "39836",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-12T07:00:00.000Z",
 "views": "13454",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(liquid)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(liquid)"
  }
 }
}
