{
 "id": 3984,
 "title": "I Felt HER Love",
 "date": {
  "submission": "2003-10-08T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Smoky",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "At the time I was a Junior in high school.  My friend Dan had allready experimented with X and had reported several different experiences.  I had made a previous promise to myself that I wouldn't touch any other drug other than weed.  That promise was broken.",
  "The 4 of us (me, him, his girlfriend, and my girlfriend) gathered at his girlfriends house.  I had not planned on taking the drug at all, instead he had purchased it as an impulse, planning on later giving it to me to take.  It was a Friday night and we had school earlier in the day.  At about 4:30 PM he presented the X.  I immediately said 'no' and starting throwing those bullshit false facts you hear on TV and read about in your health book in the psycoactive drug section of the drug chapter.  Things like 'Ecstasy puts holes in your brain'.  He told me that those books and TV was full of shit and so was I.  He handed me the pill to examine.  It was very large white pill (I didn't realize what a 'big' X pill looked like at the time) with the versace symbol on it.  It also had very large, thick, brown swirls (not dots) all over it.  After his girlfriend (a non-drug user) helped him convince me to take it I did.",
  "[T-0:00]  I feel very paranoid.  My friend tells me it's going to be such a great thing and I'm going to be so glad I did this.  I feel a half scared half excited feeling with hardcore butterflies in my stomach.  I'm worried somthing is going to go wrong. ",
  "[T-0:45]  My friend is feeling the effects of the drug very hard, he reports that this particular pill is hitting him pretty quick and keeps asking me if I felt anything yet.  I told him no and that i still felt paranoid but not as much.  Looking back, I supposed that if the pill was poison and was going to kill me, it would have and I would be dead already.",
  "[T-1:00]  It starts to kick in but I don't realize it.  I wasn't educated on the effects of an 'upper' and certaintly wasn't tolerant at all.  I thought 'Holy shit, why am I talking so fast?'  At this point my friend has left the room and i was left alone with my girlfriend and his girlfriend who had just brought food.  The food looked very good and my girlfriend had brought me my favorite food item but I had no hunger for it.  I just sat on the couch talking to both of them as they ate their food, quietly listening to me blabber on about god knows what.  I sit talking and talking, wondering if they are listening to me.  It looks like they are, they both seem happy and tell me that I am talking alot but aren't upset with it.  They tell me to keep talking so I did as requested.",
  "[T-2:00]  My friend returns and asks if i am feeling anything yet.  I was SO happy to see him, at that instant I felt so much closer to him.  I went over and gave him a huge hug.  He presents a pack of Newports for me and brings out his own pack of Camel Wides.  We sat talking and chainsmoking, ciggarettes tasted SO good and felt like they were enhancing the high.  I sat smoking with my girlfriend, carressing her and telling her how beautiful she was.  I loved her so much, and felt for the first time she knew exactly how much I loved her, as I felt her love back.",
  "[T-3:00]  I am so happy with myself I don't know how I can handle it.  My jaw starts to clench and I ask if this is normal, of course as soon as I mentioned it my friends jaw did the same.  We went on a wonderous journey to the walgreens 3 blocks away.  We kept telling eachother how happy we had been to be blessed with eachother as friends.  We compliment eachother, and talk of good times and even better times yet to come.  I am filled with so much energy and positive emotion I feel like I'm going to explode.  We get pacifiers from the store and pop them in our mouths to prevent from damaging our teeth, mouth, or tounge.  I feel I am in a mental euphoria bliss, alive and in heaven at the same time.  I explain that the name ecstasy is a perfect name for the drug for obvious reasons.  We get back and I stop to stare at the boiling pot of water my friends' girlfriends mom had set on the stove to make dinner.  That boiling pot stopped me dead in my tracks.  I stare at it in curiosity and awe, the bubbles and the steam!  I'm not even wondering why it's interesting but just loving it because it's there.  She yells to my friend 'He's staring at a pot of boiling water!'",
  "[T-5:00]  I decide to take a shower with my girlfriend, it felt very comfortable and gave me a good and warm comfortable feeling.  I told her over and over 'Oh my god, you have to feel this.'  I continued to just hug and love her, embracing the feelings.",
  "[T-7:00]  I have finally calmed down a little bit but am still very excited and have the presence of the teeth clenching.  I lay with my girlfriend on the couch loving her, cooing and telling her how much I care about her.  I feel a radiant warmth and love coming off of her body as she lay inside my arms looking in my eyes. ",
  "The remainder of the trip was pretty plateau until...",
  "[T-9:30]  I walk my girlfriend home and hug and kiss her.  All at once, the X wears off.  In a span of about 10 minutes I experienced THE HARDEST CRASH IN THE WORLD!!!  I immediately fall to my knees and start balling in tears and yelling 'WHY?!!'  She asks me what's wrong and I deperately respond 'I don't know'.  After hugging me and telling me how much she cares about me and loves me she gets me to believe it will be ok.  I walk home, still sobbing a little bit but feeling better because I know I have her, and love her...and she loves me.  After walking about 9 blocks, I'm home.",
  "[T-12:30]  I sit at home by myself in wonder as I'm overwhelmed by OEV's.  (Keep in mind, I've never hallucinated before.)  Light colors and shapes gently sail across the room.  I sink back in the couch breathing deeply, loving every minute of it.  I watch the pale shapes fly around in the dark, and then grab the nearest thing to stare at and study for changes.  I turn on the light and grab the first thing I see, which happens to be the DVD cover to 'Next Friday'.  If you own this tape or DVD you know the art displayed on the front, it has the better part of the cast with Ice Cube holding a zippo lighter and a joint in one hand.  I stare at it waiting.  Suddenly the text (next friday) dissapears and then comes back down, in a slow step-by-step manner.  I open my eyes wider in pure amazement at what I'm seeing.  Suddenly I notice that Uncle Elroy is holding onto a rhino's horn and being pulled away, seeing this makes me laugh out loud.  Then the most realistic and devasting hallucination to date happend, Ice Cube winked at me, reached his hand with the lighter/joint in it back, and then tried to punch out of the box at me.  His fist left the box, but was then stopped by an invisible forcefield which bounced outwards in reaction waves (similar to what it looks like when you toss a stone into a completely stll pond) only way way slower than water.  The waves calmed and then stopped, Ice Cube winked again and then a small rocketship in the backround blasted off skew to the foregound and the hallucinations stopped.  How long had I been staring at the cover of Next Friday?!  I had no idea, it could have been 5 minutes or a few hours, to this day I'll never know. ",
  "[T-??:??]  I lay in my dark room trying to sleep, I can hear my friend inside my head calling my name over and over again, as if trying to get my attention.  I respond aloud but he won't stop.  I think to myself 'Are we communicating telepathically?  If so, why can't he hear me?'.  I then think that the voice is NOT inside my head but really there, but this is ridiculous.  I try to ignore this voice but it's very hard to tune out.  I find myself telling him to go away and be quiet.  Other strange thoughts go through my head, I finally drifted asleep.",
  "Just a few things I wanted to add.  Especially about my crash",
  "Ecstasy has changed my life forever and given me several very good times.  Although none was like the experience just described, I recommend it to anyone who has heard this story and wants similar results from a drug.  Since then, I have never achieved that same exact high, and usually take from 2.5 to 3 pills when I do take XTC.  At a time, I was taking it every weekend for a few months, and anyone that knows about drug tolerance will realize that after a while you won't get as high at the same dosage.  I can get into the lesson about the nerve synapse and receptors in your brain but that's all science.  It's been several months now, and I'm looking forward to my next roll.",
  "Another thing to add is that you must realize every X pill is different, you'll never have the same high twice, and there is an infinite number of variables that will affect the high that you will experience.  Always know your dealer and monitor the people that are high to avoid an accident.  Also note I have NEVER crashed that hard again, I've not even come close to that upset about coming down since.  Don't let my hard crash discourage you in the least, I know plenty of people who have rolled way more times than me, and never crashed like that before...probably never will.  Be careful, and stay safe. ",
  "Respect your drug, and it will respect you."
 ],
 "erowid": {
  "id": "27401",
  "citation": " Smoky. \"I Felt HER Love: experience with Ecstasy (ID 27401)\". Erowid.org. Oct 8, 2003. erowid.org/exp/27401",
  "substance": "Ecstasy",
  "views": "9049"
 }
}
