{
 "title": "A Gentle but Intriguing Introduction",
 "author": "Way",
 "citation": " Way. \"A Gentle but Intriguing Introduction: experience with DiPT & Cannabis (ID 39848)\". Erowid.org. Feb 4, 2005. erowid.org/exp/39848",
 "substance": "DiPT & Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>18:11</p><p>Substance: DiPT, Cannabis</p><p>Dose: \tDiPT - Unknown (filled the rounded bottom of a 00 veg-cap when gently tapped)</p><p>\tCannabis  3 or 4 bowls over the course of the evening</p><p>Set: From September 2003 until September 2004 I took a hiatus from psychedelics except cannabis. My return was my initial trial with 2c-e. Unfortunately I didnt quite get the trip I was looking for and just slept through much of it. About a month later at a party at my best friends I had the opportunity to do some 5-MeO-DMT, which is one of my favorite chemicals. I had a fairly good trip, but as always it fled too quickly. As of late Ive wanted another trip, and since my 3 month guideline had passed I decided to embark on yet another adventure and try out another novel substance. Ive had some tinges of depression lingering at the edges of my psyche, but overall Ive been fairly contented lately. At this time I am taking daily multi-vitamins, B-12 supplements (Im vegan) and Depakote (valproic acid).</p><p>Setting: I am at home with my wife T. Ive tidied up the major messes, but have left the everyday mess as it is. I forgot to unplug the phone, but it only rang towards the end of my trip. It has been fairly chilly lately, so I run the heater most of the night. This is my inaugural trip at this house and I am looking forward to it. Ive only eaten a small health cookie approximately 8 hours earlier.</p><p>Report: Earlier in the day I prepared my dose. Unfortunately I dont have access to a scale, so once again I was eyeballing despite my dislike for the practice. Ive aimed for 50  75 milligrams. In the 00 vegetable capsule the powder comes just to the top of the rounded bottom when gently tapped.</p><p>[T+0:00] I take my pill with some fruit juice. My throat half-heartedly attempts to prevent its passage, as it always does when I dose, but the pill glides down my esophagus in the torrent of apricot nectar. I put on some Simpsons to watch with the wifey while I wait. I used to think I should wait to smoke pot when Im trying a new compound until I was well on my way up, but Ive never had it not go well with a psychedelic and it helps me relax into the experience so nowadays I just dive in when the spirit hits me.</p><p>[T+0:31] The first ephemeral body buzz is detected. This manifests as a tryptamine buzz, slight tension in the head/neck area and general tingliness most similar to that of 4-AcO-DiPT, being less intense than that of 5-MeO-DiPT and 5-MeO-DMT. The body buzz continues to build in strength and constancy for about the next 30-45 minutes at which point the bodily sensations plateau.</p><p>[T+1:01] Marked time dilation is noted, as well as a loosening of conventional thought patterns. It seems like 2 hours have already passed. However, upon viewing the actual time I have no problem comprehending how much time has actually passed. In fact throughout this experience I remain markedly functional and grounded. I also note a significant euphoria, much more than marijuana by itself imparts. With my intensifying body sensations eroticism is becoming more prevalent and desired. At about this time I put on The White Album and Abbey Road by The Beatles since I am very familiar with them and wanted to listen for any alterations. Then I went to take a shower, as I adore hot water and often find bathrooms to be excellent trip spaces. Interestingly, my bathroom at this house has a strange energy for me and I often experience brief visual alterations upon going into the room even while sober. How that applies to this story is that the vast majority of my visuals during the trip were in this room. Other factors probably contributed to this however. The first was that the water was quite hot and probably raised my temperature somewhat as I was in there quite a while, about 1.5  2 hours.</p><p>The second, and probably greatest contributor, was that it was during this period that I peaked. The visuals were relatively minor. Some light breathing and 2D surface rearrangement. I commented to T on the lack of sound distortions for which this compound is famed. My stomach also behaved exceptionally well. Often I get nausea and feel like I will have diarrhea, and I had reports of this happening to others with this substance, but I only felt the slightest hint of such discomforts and then only briefly with no fruition.</p><p>[T+~2:05] During Blackbird I hear my first alterations. These intensify for about the next hour and 45 minutes before beginning to fade. For the most part it is easy to distinguish between the base sound and the parts which have psychedelicized  for instance guitar notes that sound like they are going in circular fractal pattern. The deepening of voices others have noted was observed. My own and my wifes voices we both lowered, making her sound like a man. The Beatles voices were also lowered, with John sounding like a Chicago blues man on several tracks.</p><p>[T+~3:00] I got out of the shower, had T braid my hair and then we hung out together on our bed, just listening to the music and conversing. Conversation was easy and enjoyable throughout the trip. T looked very beautiful, even more so than usual and we soon engaged in some very nice coitus. Lovemaking was found to be enhanced with additional energy, desire and staying power, although not being as good as 5-MeO-DiPT if sexual enhancement is the only criteria one values.</p><p>[T+~3:45] The sound alteration begins to fade.</p><p>[T+4:18] The sound alterations are essentially gone at this point. I am definitely starting to come down at this point, but am still above a simple cannabis high. A slight headache is noticed, but less than with many other substances and no analgesic is needed. T heads to bed as it is getting late. I go out to watch Kill Bill: Vol. 2 by myself since she did not want to see it anyways. The euphoric mood remains and the movie is engaging and followed without difficulty.</p><p>[T+7:19] I head to bed after some snacking. I find myself able to easily drift off to sleep. However, in the quiet of the late night I find my tinnitus to be louder than usual.</p><p>Summary: Its the next day and I have no after-effects to report on. I was pleased with my trip and from the amount of material I put in the cap, my personal tolerance for most drugs and gauging my experience against others' I would guess I got between 25 and 50 milligrams, but of course Ill never know for sure. I found it to be a great introduction, showing off some its unique flavor for sure. The aural effects were definitely distinct, even from other auditory hallucinations I have had say on mushrooms for instance. The visuals had more of the fuzzy feel phenethylamine visuals have for me than the crisper visuals Ive gotten with other tryptamines. Emotionally and logically I was pretty grounded the whole time. I felt like I was in the shallow end of the pool, but that the pool went further out. At some point I would like to go swim in DiPTs deep water.</p>",
 "year": "2004",
 "id": "39848",
 "gender": "Male",
 "timestamp": "2005-02-04T08:00:00.000Z",
 "views": "11172",
 "dose": [
  {
   "time": "0",
   "amount": "1500 mg",
   "administration": "oral",
   "substance": "Pharms - Divalproex",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "DiPT",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
