{
 "title": "Question Reality",
 "author": "AfroH",
 "citation": " AfroH. \"Question Reality: experience with Mushrooms - P. cubensis (Mexican) (ID 39860)\". Erowid.org. Apr 1, 2008. erowid.org/exp/39860",
 "substance": "Mushrooms - P. cubensis (Mexican)",
 "bodyweight": "180 lb",
 "report": [
  "<p>I started my psych/chem journey in early summer of 2002 when I acquired MDMA from my weed dealer in a club. After a lot of fun my journey progressed to Amphetamines and I moved to the faster lane. In early 2003 I started my psych journey with Magic Mushrooms and in early 2004 with Acid.",
  "The date is now around August/September 2004 and I felt quite an experienced wreckhead, a term thought as a description of myself. It was a Friday night, I had finished work and went to a best friends house as he had bought 1000g wet from the net on the previous weekend and had given 500g to me to dry out and sold the other half. We had decided from when he bought them that we would take a large amount and I halved the dry pile and then split one half into two equal parts. Since 500g wet is about 50g dry, that gave us piles of approximately 12.5g.",
  "We then ate our piles as quickly as possible, the taste made me reach a few times, I find it quite easy to reach when eating shrooms, and by about 20 - 30mins we had both finished. Ms parents were in his house at the time and we both felt a little uneasy with this situation and had planned an expedition to the beach previously, about a 30min journey on the Metro. Not long after we had finished I noticed the uneasy body state that you would feel coming up and thought to myself Fuck me I'm coming up and we havent even left yet! at this point M said the same thing to me as he re-entered the room from the toilet and we gathered the essentials (cigarettes, phone, weed, keys and a lighter) and left as quickly as we could.",
  "The journey to the metro station was intense, the Come up felt extremely uncontrollable. I felt myself bounce from one foot to the next and I the scenery around me was giving off a glow that turned the colours from grass green to turquoise and the sky blue was almost neon. Ms journey and my own journey are now separate. As we got on the metro I felt myself feel very uneasy as if I had got on a boat. I sat next to two clubbers and although we were only a few inches apart I could not make out anything they were saying. My vision drifted to two women opposite me and them over to M sitting on the chairs to my left with someone he knew and was in full conversation. There was a constant neon glow surging through the metro and I felt my self laugh every time I felt it go past.",
  "We eventually got off at the beach station and we started to make our way there. The route we took was through some narrow streets with typical British houses. The scenery was amazingly retro, with deep reds, yellows, oranges and browns. I had the thought in my head to hold on to the walls or I might fall from something and when we reached the end of that street we had come onto a park built with a kind of Chinese design to it. M and myself wandered the park for a while exploring",
  "T:2 hours, after much confusion we end up at the end of the park and the beginning of the beach and a fun fair, etc, We met another friend called T and proceeded to the pier. When we arrived at the beach my visuals were amazing, everything moved in an un-natural way, for example, the water twisted in a spiral motion that made me feel as if I was turning inside out. These types of feelings expanded into completely distorted vision, a small window of vision that repeated when I changed where my eyes pointed, and constant echoes of my friends voices and laughter & my own.",
  "T:3 hours, I cant remember much of the past hour in any detail but I am now lying down on the sand with my mind wandering many complex thoughts. At this moment I felt something move in my stomach, turned my head and threw up. As this occurs time is completely distorted and I feel myself stuck in a kind of Groundhog Day. I could see a constant flow of vomit coming from my mouth and I'm turning round and round in the sand. When I came to a stop my whole perception changed and I was on a bright beach with strong rainbow colours. This was now my purgatory as my mind was locked in this place alone. In my mind I had died and my new world was this beach. The time frame is unknown but an eternity or a second later my friend M pulled me onto my feet and I instantly broke out with TAKE ME TO A HOSPITAL.",
  "T:4 hours, Me, M, T & another friend who had met up with us when we were on the beach called A made our way from the beach to the town centre where another friend picked us up and took us to a near by friends flat where they managed to calm me down. Through out this period I am vomiting randomly and crossing between fine and tripping to panic stricken and vomiting.",
  "T:6 hours, At this point I had completely calmed down and was able to reflect on what had happened. The experience, although scary had opened new philosophical questions regarding reality. Although this has happened before with acid, it was never as strong or mind bending.</p>"
 ],
 "year": "2004",
 "id": "39860",
 "gender": "Male",
 "views": "2857",
 "dose": [
  {
   "time": "0",
   "amount": "12.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2008-04-01T07:00:00.000Z"
}
