{
 "title": "Interdimensional Game of Peak-A-Boo",
 "author": "Eridu",
 "citation": " Eridu. \"Interdimensional Game of Peak-A-Boo: experience with Mushrooms (ID 39966)\". Erowid.org. Aug 13, 2007. erowid.org/exp/39966",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "report": [
  "<p>I was fourteen when I had my first experience with magic mushrooms.  My older sister (A), who has always been more knowledgable about psychoactive substances than me, got about around 6 grams through her boyfriend (Z), which the three of us planned to take together as a group.  This was a little unnerving, as I didn't know what to expect from shrooms, much less what to expect from them in a group.  But after a short while my anxiety subsided, mostly because it was only going to be me, my sister, and her BF. ",
  "I should mention at this point a few things about my sister's room, where we were planning to trip, it is amazing.  Over the course of a decade, each bit of every wall has been covered with art, collages, random quotes, posters, portraits, postcards, and paint.  You can trip simply by sitting there.  It is beautiful.  A living collaboration of greens, blues, oranges, purples, and a thousand colors in between.  People who have never been inside before spend the first five minutes just staring.  Then they start to think she is crazy.  But I know the truth, she is just plain cool.  I knew it was going to blow me away on shrooms. ",
  "Then, two days before ingestion, a bombshell was dropped on me: Z's cousin, Y, wanted to join in.  I made my reservations known.  I was opposed to this change in plans for two reasons.  Firstly, with another person in the group my share of shrooms would be lessened.  Secondly, having a new person in the group, who I did not know very well and did not like very much, was unnerving.  I thought that, in the midst of the experience, she might have a bad reaction.  A & Z had both done shrooms before with no serious problems.  Myself and Y were the only newbies.  Selfishly, I did not want my first time to be ruined by someone else's first time.  My sister understood my fears and also recognized the risk of Y freaking out, but as Z was resposible for acquiring the shrooms, we could not reasonably refuse her entrance.",
  "The night came, Y & Z showed up on our doorstep semi-stoned and smiling.  My fears were immediately relaxed, Y looked happy and psyched, though maybe a little unserious.  As she walked in she told me they had already eaten a little and were feeling some minor effects.  I remember Y exclaiming a quiet 'Woah' as she walked into my sister's room.  As I was completely sober at the time, I could not imagine what the room looked like on shrooms.  As we sat down, Z cracked open a big plastic bag with a few rather large caps and many, many stems inside.  He took the caps for himself and my sister, which pissed me off.  Y and myself were left with the remainder, of which I got the lion's share, and in the end it was definately sufficient.   ",
  "Someone, possibly me, suggested putting on some music, but this was quickly dismissed through some relaxed group head-shaking.  I remember how the room slowly began to come alive with light and movement.  I saw small, peaceful geckos exploring the colors of the walls, and the mottled geometry of the desk.  The green carpet swayed like grasslands in the wind.  I was pleased as punch, and it was only the beginning. ",
  "My sister and I sat on the bed, Z sat propped up against the desk, while Y sat on the futon in the middle of the room.  After a short while, Z looked totally spaced out, a drooping smile on his face, I knew he was having a good time.  At one point my sister stood up rapidly, with a peaceful smile that told me everything was alright, and I saw as she turned towards me, golden light echoing from behind her strawberry blonde hair, and I was instantly reminded of so many images of Jesus.  She looked like an angel.  She gave me a warm smile and I smile backed.  On the other hand, I looked over to the slouching image of Z, and his black buzz cut blurred and formed horns.  He looked to me like a demon sent to Earth to cause mischief and mayhem.  He gave me a devilish grin that seemed to say: 'I know you know who I am.'",
  "Looking at his cousin Y, I saw nothing and felt nothing.  With her there was no golden aura or light shimmering, not even horns.  Just nothing.  I could not have been looking at her for more a few moments, although I suppose I could have been staring at her for an hour and not known it, when she said to me, in a voice that hinted fear, 'What are you looking at?'",
  "I was totally blissed out.  Simply sucking in the vibrant energies of the green jungle I was immersed in, I could think of nothing else.  Making eye contact with the cheerful little lizards and geckos, and occasionally watching a boa constrictor lazily swim across the walls, were all that concerned me.  Therefore I blissfully, but wrongly, answered her question.  With a sigh and a warm smile I said, 'Nothing..'  I may have only imagined it, but it seemed to me that a slightly mollified look came over her face at this.  Perhaps I made her fear that she was slipping into the void!  Considering the strange and wonderful thoughts that wandered into my head during the trip, I don't think it too unlikely.  Whether purposefully or not, I did not pay much attention to Y thereafter.  She seemed to have an anxiety that was very, very slowly rising.  I remember that once or perhaps twice, she quickly glanced at something on the edge of her vision.  She did not look pleased at what she saw. ",
  "Aside from Y, there was nothing but smiling faces.  Whenever I turned to look at my sister I got a glowing, warm, honest smile as a reward.  Z, in classic alpha male fashion, had taken more than anyone else.  He had barely said anything, which was how I preferred it.  Looking quite devilish while doing so, he did nothing but grin and stare at the walls.",
  "It was soon after that the most amazing thing happened to me.  I was sitting on the right side of my sister's bed.  Y, Z, and my sister formed a sort of triangle; with my sister of the left side of the bed, Z on the floor, and Y on the futon a few feet away from the bed.  The point being that I could look upon the wall to my right without seeing anyone.  I was watching a green murmur, which could have been a peaceful boa constrictor, float across the right wall.  As I turned my head to the left I felt as though I had pulled myself through some sort of invisible barrier.  I was completely alone. There was no one on the left side of the room.  I looked to the right, and as I turned my head I felt it passing through that same invisible barrier.  The room was split in two, and I was sitting directly along the divide.",
  "I felt as though I had entered an alternate universe, or found the entrance to one.  I turned my head to left, and passed through the same invisible force-field, to see nothing.  Where my sister, Y, and Z should have been, there was nothing but the empty room.  I felt a faint impression of Z propped against the desk, but nothing I could see with my eyes.  I quickly snapped my head right and snapped back to the left.  They had returned.  My sister was sitting quietly next to me as though nothing was wrong.  Z was still slouched over and grinning.  Y was still looking furtive and uncomfortable.  Exactly how I left them.",
  "I leaned over to my sister and said to her, grinning and giggling uncontrollably, 'I think I've found an alternate universe.'  Demonstrating, I looked over to the right side of the universe, and then swiftly looked over to the left, pulling my head through the invisible barrier.  I was like a parent who, hiding their face behind their hands, expects a baby to be suprised at their 'sudden appearence.'  It was really just an inter-dimensional game of 'Peek-A-Boo'.  My sister nodded and smiled knowingly, looking comforted, I think in retrospect, at the assurances that her brother was OK and having a peaceful, happy time.  I played with the invisible barrier for a long time.  I certainly never expected to encounter anything like it.",
  "After belaboring the details of the night for so long, I won't get into Y's silent freak out, although I should as a warning to the uniniated.  I was in my sister's room, a very familiar place to me.  Y was not familiar with the setting and that may have made her uncomfortable, contributing to her bad trip.  Y was mostly familiar with alcohol and to a lesser extent marjiuana.  Psilocybin has nothing in common with either of these drugs.  They are as different as apples and asteroids.  Z and my sister both percieved (far better than I) Y's nervousness and her oncoming panic, and suggested we go to bed.  Which bummed me out a little at the time because I was still tripping pretty hard.  I thought they had stopped tripping, I had no idea at the time that it was because of Y. ",
  "The trip abruptly ended, too abruptly for my tastes.  As soon as my door closed it was over.  After being in the green shade of my sister's jungle for so long, the grays, whites, and blacks of my room came down like a guillotine on my trip.  It was not a bad ending, but a very swift ending. ",
  "The next day, after Z & Y had left, my sister and I were discussing the experience.  It turns out that she saw the golden light behind my head just as I saw it behind her head.  I went on for awhile about the Rift and all the fun I had with it.  We talked about Y, who, as she left, still looked pretty shaken.  Apparently she couldn't sleep for a long while and was pretty scared through most of the night.",
  "The best memory I have of the experience didn't even happen during the night.  It was when my sister and I were talking about it the next day.  She told me that I was right to be have been worried about Y.  Best of All: she told me that she never had any worries about me.  She said she knew I would be fine, and she was right.</p>"
 ],
 "year": "2003",
 "id": "39966",
 "gender": "Male",
 "views": "2841",
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2007-08-13T07:00:00.000Z"
}
