{
 "title": "A Trip to Life Itself: The Tan Wall o Nothing",
 "author": "Nidman",
 "citation": " Nidman. \"A Trip to Life Itself: The Tan Wall o Nothing: experience with Salvia divinorum (extract) & Alcohol (ID 39981)\". Erowid.org. Jan 27, 2005. erowid.org/exp/39981",
 "substance": "Salvia divinorum (extract) & Alcohol",
 "bodyweight": "137 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Alcohol",
   "(liquid)",
   "",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "report": "<p>Recently, I had my eighteen year old friend take me to a store in Boston, MA to help me buy some salvia divinorum 17x extract. I have recently quit smoking weed, and this seemed to be in interesting thing to try. We bought the substance and I went home.</p><p>The next day a few friends and I tried it. We expected to feel very little because many people had told us that they felt nothing when smoking the substance. We tried it and were shocked. We all ended up falling across the floor laughing histerically in a haze of befuddled confusion. After wearing off we were surprised but more than a little dissapointed. That weekend I tried it many more times and each time feeling nothing more than a tumultuous buzz. The next weekend however I tried it again with my friend who had yet to try it. We did it at around six in the afternoon and I again just felt the somewhat uncomfortable buzz. Later that night however at around ten, after downing a few beers at a party at my house, a few of us decided to again try the salvia. We had a quarter of the extract left and felt that we should smoke the whole thing at once.</p><p>We used my friend Aliza's piece, and my friend Allison first smoked some weed out of it before we smoked our salvia. We packed an intimidating amount of the stuff in the bowl until it filled it to the brim with its little flakes. They told me I should take first hits because they are nice people, so I did. I took the biggest hit of my life. Weed or anything else, it was gigantic. When I let the smoke billow out of my mouth, I instantly ascended into a new dimension of high. I had done shrooms twice before, once eating 60 dollars worth, but nothing compared to the intensity of this trip.</p><p>I instantly forgot who I was, I became the universe. I was a bodiless entity of light, roaming existence. My vision was clouded. I couldn't see the real world. Instead of the snowy yard I should have been seeing, I saw a glorious tan wall, covered in a brilliant symbol closely representing a face. It was covered in Purple and cyan ridges. I felt like my bodiless entity of light entered the body of my friend, and when my friends began looking at me and panicking, I thought to myself 'Why isn't my friend doing anything? Why is he making them panic?'</p><p>I slowly realized that It was me, myself, tripping hard on salvia and I tried to speak, but only 'Uh... uh... eh... uh...' would come out of my mouth no matter how hard I tried. By now, the tan wall was receding to the right of my field of vision, and a sliver of reality was showing to my left. Whenever I muttered an 'Uh', the wall would fragment vertically into more and more slivers equal in size to the sliver of reality on my left. I could see my friends looking me in amazement, some were even laughing by this point. The tan wall began to blur in my vision as I struggled to be able to walk again and get inside my house. I slowly one step at a time remembered that I was a human with a social life, and friends, and obligations, and the ability to move...</p><p>Suddenly, I got zapped out of my other dimension of floating the universe on the tan wall and was able to walk. We all quickly walked inside and got back to the party. I still felt a serious buzz. I began having personal revelations. I had them because I felt that through my travels through the universe as a ball of light, I had learned what it was like to not be alive, to be an inanimate object, and I came to the realization that life itself is precious, and we, the living, are privileged to be able to live and think. Because of all the infinite things in the universe, only six billion get to be living, breathing, thinking humans, and I felt honored to be among them. I also realized that life is too precious to spend it being sad, so I somehow instantly rose from any bad feelings I was experiencing and became unhesitant to speak, and very happy with my life.</p><p>I left that trip a changed man I still feel, and very respectful of the power of salvia divinorum.</p>",
 "year": "2005",
 "id": "39981",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-01-27T08:00:00.000Z",
 "views": "12369"
}
