{
 "title": "What I Thought I Wanted",
 "author": "dopefiend",
 "citation": " dopefiend. \"What I Thought I Wanted: experience with Alcohol, Cannabis, Pain Killers, Cocaine, & Heroin (ID 39994)\". Erowid.org. Jul 25, 2005. erowid.org/exp/39994",
 "substance": "Alcohol, Cannabis, Pain Killers, Cocaine, & Heroin",
 "bodyweight": "140 lb",
 "report": "<p>This is my story. Never in a million years did I think I would end up here, but I did. I guess it started when I was 13. People at school would talk about getting high and how cool it was, and me, the loser, wanted to fit in. I didnt really understand what alcohol and drugs were, or what they did to you, I just knew that if you did them, you were cool. So at the age of 13 I was at my grandmas house and I stole some cigarettes from my mom to smoke, took a couple beers and drank them. At first I didnt really know what to expect, I just felt a little weird. I continued to smoke cigarettes and drink a little here and there.</p><p>Then one day, I was sleeping over at my friends house and his brother had some really good weed. I smoked for the first time that night. I got so high all I could do was laugh. It was amazing. So from then on I would come over every weekend to smoke weed with his brother. Now at this time, I am still a loser and I wanted to fit in. I told everyone at school I was doing heroin and ecstasy and every other drug under the sun and of course they didnt believe me, so I was even more of a loser. But, I didnt just say it to be cool, I really wanted to do all of these drugs, Heroin especially because it was the hardest of all. I couldnt ever find a connection to these drugs so I continued to smoke weed on the weekends and drink very occasionally.</p><p>Well, his brother started selling weed, and got caught with a pipe at school, so he gave me 3 1/2 ounces to sell for him. Now, I was the shit. I started to sell weed and everybody bought off of me. I thought I was so cool. Now I was smoking every night, every morning before school, and every day after school with my friends. I went through a period were I pretended to be suicidal and abused cough medicine for a high. After being hospitalized several times, I gave up. Then I sort of just stopped hanging out with people and doing drugs all together.</p><p>Then my mom sent me away to Christian summer camp. I met somebody with a car that wanted to hang out with me and she introduced me to a lot of people. I started dating a pot head and together we bought weed. My hook-up just so happened to be a female that was 4 years older than me, so I dumped my girlfriend for her. Me and her smoked weed every single day, and at least once a week I would party with her friends and get drunk while I smoked weed.</p><p>Well, eventually I wanted to do something else. I started stealing prescription pain killers from my grandma, from my girlfriends parents, or anybody else that had them. So I would still smoke weed everyday, drink more often, then I met someone who sold cocaine. The first couple times I bought it I got ripped off, but then I met someone who had some very strong coke cut with ether. This really kicked in my addiction. I was stealing jewelry from my mom, pawning everything I owned, stealing large amounts of money from people in my neighborhood, and ripping people off to get my coke every single day, while still smoking weed and popping pain pills. I stopped doing coke after being confronted about the missing jewelry, and then I began to drink every single night. My mom started calling the cops on me for coming home trashed to the point that I couldnt walk.</p><p>I accumulated 7 charges of Unlawful Consumption of Alcohol by a Minor in the end. I started hanging out with people when my girlfriend was at work and ended up hanging around some people that did heroin. I was very interested in this, so I took up the opportunity. I paid people to drive into the city to pick me up some dope. I only bought a few bags at a time, after realizing that my bags were being cut in half, I took it upon myself to get my dope. I met a girl who was an old user who had just started using again after rehab, and she would drive me up to the city and I bought a couple bags at a time and that was the first time I truly got high on heroin.</p><p>Now keep in mind this whole time I am drinking daily, smoking weed all day everyday, popping pain pills when I could get my hands on them, running away (for the night) with my moms best friend to go out drinking and ended up buying crack, hiding the heroin from my girlfriend, who only smoked pot (did not even drink, but used to use coke with me). Then one day I talked my girlfriend into doing heroin. She did it and liked it, so I talked her into it again. And again. I started out once a week (buying a few bags), then once a week buying a jab (14 bags or $100) then to buying a jab twice a week, then buying a jab every three days, then almost every other day.</p><p>I was always drunk when I wasnt high on heroin, still smoking weed constantly and popping Vicodin, Percocet, Oxycontin, MS contin, and dihydrocodeine. I went from sniffing my heroin to shooting it up. I would completely disregard anything my girlfriend said about quitting the heroin and drinking. And the whole time I didnt see a thing wrong with it. Now at this point I am just in a constant state of oblivion. My 7 charges of unlawful consumption caught up with me and I ended up on probation. My mom had suspected I was using heroin (my friend overdosed on it in my driveway and I called my stepdad, a recovering heroin addict, to ask him what to do, and we ended up driving him to the hospital) and part of my probation was to undergo a drug and alcohol evaluation.</p><p>Well, I was filling out paper work at the clinic and my nose started bleeding, I was urine tested and tested positive for heroin, and when the counselor told me I needed inpatient treatment, I screamed at her and walked out. Well, I continued to use heroin and alcohol until the day I was admitted into rehab. I spent 45 days in a treatment facility, and three days after being released I was getting high again. It started once a week, then on weekends, then everyday again. I failed 5 probation drug drops and was put in jail for 17 days, where the only way I could get out without going back in to treatment for 6 months was to agree to do the Drug Court Program.</p><p>If I fail one drop I am detained, put in jail, then transferred into rehab. I am completely miserable, I obsess everyday about getting my fix, I thought this lifestyle was so glamorous, and it is, until you get caught, and you will get caught. It might take years. Let me tell you, forced sobriety is the most horrible thing in the world. Sometimes I just want to give up, but I am doing this at least for 6 more months, if not more. I would stick with weed and occasional booze, because its not too hard to kick those, but once I touched the harder drugs (coke and heroin) I never forgot that wonderful euphoria, nothing in the whole world feels that good, I will never get that high naturally, only chemically, it will destroy me.</p><p>I know I will use cocaine and heroin again, because I love that feeling. It is incredible.</p><p>I cant believe this actually happened to me. I thought it was what I wanted, no, if I could go back, I would have never touched those drugs, so I would have never had to think about it, or obsess over it. I am so miserable today. But this is a consequence of my actions. Just remember, the lucky ones are the ones that OD and die, the ones who dont get to live miserably for the rest of their lives because they will never forget what they had.</p>",
 "year": "2004",
 "id": "39994",
 "gender": "Male",
 "timestamp": "2005-07-25T07:00:00.000Z",
 "views": "49706",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharmaceuticals"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Cocaine"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "IV",
   "substance": "Heroin"
  }
 ]
}
