{
 "title": "Purple Zippers and Crawling Vines",
 "author": "Adam",
 "citation": " Adam. \"Purple Zippers and Crawling Vines: experience with Salvia divinorum (13x extract) (ID 39993)\". Erowid.org. Apr 3, 2008. erowid.org/exp/39993",
 "substance": "Salvia divinorum (13x extract)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "report": "<p>It was Sunday night and my friend Alex called me and asked if I wanted to smoke some salvia. I had used the substance before, but without very impressive results. I had had quite a weekend, doing mushrooms on Friday and ecstacy the next night, but this didnt really stop me. So I went to pick up Alex and senor perc, our perculator, and went to my house. After some discussion, we decided the back yard would be the best place for the experience. We went out to the two chairs in the back of my yard. The chairs faced the lawn and a fence covered in vines was to the left and my house was to the right.</p><p>Alex decided he would take the first hit and that I would take the second. He filled the small bowl with about 1/10 of the gram we had. Using a compressed butane torch, he finished the bowl in 3 hits. After a few seconds he had this goofy look on his face and he told me that he was tripping. I waited for a few minutes before preparing mine to smoke. Our plan was to wait until he was tripping before I began my trip, but after seeing him, I could not wait and he told me to hit mine. I handed him my cigarette to hold, and he smoked it, which he never ever does, I knew for a fact that he was tripping pretty hard. I filled my bowl with the same amount he did and proceeded to smoke it. My bowl was finished after two hits. I told him that I needed another hit and as he was reaching in his pockets for it, it hit me. Salvia hit me harder than any drug I had ever done before.</p><p>All of the sudden the entire backyard jumped up and in a swooping motion flew into the air and came back down with a slam. Out of nowhere, what can only be described as purple and black zippers appeared on my lawn. They were perfectly straight lines, equally spaced apart. They were racing down my lawn away from Alex and I. I looked over at Alex and realized that my fence was covered in green vines. There are really only a few vines on the fence, but now there were hundreds of them and they were alive. They were crawling all over my fence. I looked back at the lawn to check on my zippers and saw that they were still there, moving extremely fast.</p><p>Alex then suggested to me that we move inside into my bedroom. I agreed. I stood up and the zippers on the lawn rose with me. At this point I think I realized how terrifying this was. Suddenly I felt this force pulling at my body, I don't think it wanted me to leave the back yard, I had a hard time walking. I was pretty scared at this point but I was laughing hysterically. We finally made it into the house and up the stairs to my bedroom. Once we got to my room, Alex told me to turn on some music. After messing with my computer, I realized that the music wouldn't play. I looked down at the carpet and realized that it had split into two lairs. One being the carpet and the other one was the lines in the carpet, hovering about a foot off the ground. We decided to turn the lights off.</p><p>I went over to the wall and flipped the switch and went to lay on my bed. At this point I became extremely frightend and told Alex to turn the lights back on. I then became very annoyed with Alex and I didnt think anything he did or say was right. He could have said hello and I would have thought it was wrong of him to say it. We then called our friend James. Alex handed me the phone. I don't really remember the conversation we had, all I know is that I made no sense. I handed Alex the phone and he finished the conversation.</p><p>I started to think that I would never snap out of it and got worried. I started pacing back and fourth across the room trying to calm myself down. I decided to go downstairs and grab some water. I did and then went and switched on the TV. There were two people talking and out of nowhere the woman turned into a zombie like creature and she started to move towards the man and he became frightened and then it appeared as though he was a decaying corpse. Then the clip ended and I realized that it was Americas Funniest Home Videos. I thought it was a little strange that they would be showing a horror clip. I quickly switched off the TV and ran upstairs, laughing again. I dont know why I was laughing, I wasn't having much fun.</p><p>The trip started to wear off but I was still very annoyed with Alex and the whole experience. I told him that I never wanted to do salvia again. I was pretty scared about everything that had just happened and I was shaking. Eventually I returned to normal, and was very glad to do so.</p><p>During the trip, I wasn't having a good time, but after reflecting upon it, I realized that salvia is very interesting and I would like to try it again sometime when my body is better relaxed and prepared for such a strong substance. Next time I plan to have one sober person with me and I want to stay in one spot. I think moving inside was the mistake we made, there was too much going on for my brain to handle.</p><p>All in all, I'd say that it was an extremely enlightening experience.</p>",
 "year": "2004",
 "id": "39993",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-03T07:00:00.000Z",
 "views": "3179"
}
