{
 "id": 40,
 "title": "Three-Day Dementia",
 "date": {
  "submission": "2013-05-30T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Mercury in Aries",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Phenazepam",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "As an avid research chemical user, I wanted to test out this phenazepam everyone was yapping about.  I assumed it would be similar to benzos and produce a mild sleepy feeling, so I took it after a stimulant binge to help me sleep.  Mistake #1. ",
  "I dipped my finger in the bag and proceeded to eyeball a very 'small' unknown dose.  Mistake #2.",
  "What happened for the next few days was a blur, but I'll summarize what I remember:",
  "*Went to the bank to try and open an account.  Was denied for some reason I couldn't recall later.  Ended up in an argument with my girlfriend over it. ",
  "*Ingested a whole gram of ethylphenidate over the course of a day.  (Or was it two days?)  I took it to combat the mental fog I was feeling, which I convinced myself was Mad Cow disease or another form of dementia.  I was not sleepy or drunk feeling like expected--I was completely delirious, trapped in a waking-dream state like a zombie.",
  "*Fell face-first into the bed after being told I shouldn't go check the mail alone at 3:00 a.m.  Went and checked the mail anyway.  Alone.",
  "*Accidentally ingested an unknown dose of 25i-NBOMe after handling some blotters.  Not sure if I got it in my eye, swallowed it or what.  Proceeded to have INTENSE open-eye visuals and the usual shitty feeling I get from psychedelics.  Knew I was tripping when 2Pac's lip began quivering suspiciously on my music player.  These were the most vivid, intense visuals I've gotten from any drug.  Managed to go to sleep at the first signs of psychedelia. ",
  "Overall, I lost about 3 full days of my working memory to a tiny dab of powder.  After reading up on MK-ULTRA mind control experiments, I believe phenazepam would've fit right in with the nightmarish drugs used in those tests.  (BZ and ditran come to mind).  It is nothing like other benzodiazepines.  I would fall asleep soundly for a few hours, but then wake up not knowing who or where I was.  Phenazepam is like those Men In Black sticks that erase your memory in a single flash.  It's on a very short list of drugs I'll never touch again.         ",
  "Phenazepam: Not Even Once."
 ],
 "erowid": {
  "id": "100260",
  "citation": " Mercury in Aries. \"Three-Day Dementia: experience with Phenazepam (ID 100260)\". Erowid.org. May 30, 2013. erowid.org/exp/100260",
  "substance": "Phenazepam",
  "views": "1460"
 }
}
