{
 "title": "Superpresence",
 "author": "Yggdrasil",
 "citation": " Yggdrasil. \"Superpresence: experience with Mushrooms - P. cyanescens (ID 40072)\". Erowid.org. Mar 23, 2005. erowid.org/exp/40072",
 "substance": "Mushrooms - P. cyanescens",
 "bodyweight": "160 lb",
 "report": "<p>As a student of neuroscience, I have long been interested in the effects of chemicals on the brain, but rarely get a chance to try any. In six months, I had smoked pot perhaps only a dozen times and had never tried anything else. Of course, when later that 6th month I was offered the opportunity to try some shrooms, I accepted. I can only imagine now what I was thinking when I agreed to split a whole ounce with my friend 'A' ($60 each) on my first purchase; over-eager I suppose, but that was what we did. A friend had gone away for vacation with his folks and had graciously left us his house to use. So, one day 'A' and I got together with our friends 'M', 'K' and 'E' at the house and set ourselves up for the day. We had music, games, computers, etc. Lots to keep us occupied. Shortly after we all got there, we smoked a few bowls from a pipe in the backyard, but I'm not writing about that, so let me just say that we were all chilling in the basement for a while and we started coming down from the high. 'A' and I figured it was about time to hit the shrooms before we got too sleepy from the weed.</p><p>Let me say here that earlier in the day I had been apprehensive about the shrooms. I had never tried them before, as I said, and having done my research, I was worried about doing them in an unfamiliar house with so many other people around. But, I realized that if I was going to do them at all, I had better get over my anxiety. Besides, it was a friend's house, I knew everyone who was there, got along with them well, we would effectively have 3 sitters with us and 'A' had done them before, with great results. So there was nothing to do, but to do it.</p><p>'A' broke out the bag. It was a lovely pile of very fragrant dried mushrooms. A good mix of caps, stems and shake, stained blue and still with many distinguishing marks. I was confident these were P. cyanesis, and not something crazy like Amanitas. Using a little hand-grinder, actually intended for weed, he ground up a few small caps and stirred each half of the quantity into a tall glass of orange juice. We took our juice downstairs and drank it slowly, chewing the little bits of mushroom and keeping it in our mouths as long as possible. I liked the taste. Not a great combo, but the shrooms had a pleasant, nutty taste. We played some games while we waited to come up, but 50 minutes later, we had both still not noticed anything. We decided to boost it a bit, so we headed back upstairs, got some corn syrup, and munched a stem each some of that. Shortly thereafter, we both started coming up. It was surprising how closely synched the first phases of the trip were for us. I felt a little jittery at first, but I didn't really realize I was tripping until I looked a a card on the ground and thought the picture on it was embossed from beneath. 'A' told me he was getting some mild visuals too. I leaned back and looked around, seeing if anything else would look different.</p><p>I looked up at a set of track-lighting, and saw beautiful patterns in the flares of the lights, like the rings and symbols enscribed within halos in medieval Christian paintings. I looked at the carpet and I saw pulses flowing through it and tiny hills rising and falling, as if it were rippling liquid. I don't know how long I was looking at the carpet, but I did not look up from it until someone said 'Yo, are you tripping?' I looked up and was totally shocked to find that I was seeing everything as if it were through 3-D glasses, but instead of red and blue, it was one whole set of colours and another set. I'm not sure how it worked as I write this, but I remember that that was the effect. 'Oh... whoa.' I replied, 'Yeah, I definitely am.' And then I started laughing. I immediately stopped though as I thought 'That's not funny. Actually, I might never laugh again.' I looked at the wall behind me, saw that strange circular patterns were sliding all over it, stood up and dropped into a huge head trip.</p><p>I wandered around the room for about half an hour, though I wouldn't have known that if I hadn't checked my watch. I thought about everything, and wrote my thoughts in a little book I brought as I did so. I wrote about a lot of things, but the main themes were firstly, that everything depended on context, that everything that happened anywhere only had its consequences because of where and when it happened, which I suppose is true. And secondly, that we only experience things when all the dimensions that affect us converge directly on us. That's why I was tripping, and those guys over there were playing Balderdash. If I lay down on the ground, for example, I might dodge the next lines of 'trippage' and they could hit the guys playing Balderdash, then they'd be tripping and I'd be sober. I didn't want the trip to end though, so I didn't do that. 'A' had dissappeared upstairs all this time and finally came back downstairs. I asked him 'Are you in a place where you could write in the journal?' He looked amazed and replied, 'Yeah! I think I am!' as if I had just solved a problem for him. He wrote, and I went upstairs for a bit. I splashed some water on the bathroom mirror, and watched it all drip down and cast spectra everywhere. I thought really introspectively for a while and realy tried to examine how I was acting at the moment.</p><p>Having done my research, I was prepared for the ego-destruction that people have reported shrooms can bring, but I found that the exact opposite was occuring. I felt that at that moment, I had absolute influence over people. I felt that I could persuade anyone to do anything, just on merit of my presence and attitude alone.</p><p>Anyways, the trip was winding down, and despite a period of annoyance when a person I really didn't want to talk to on MSN was clearly amplified by the shrooms, it went really well. I felt great the whole time and it lasted about 5 hours. I look forward to trying them again; we have a lot left. Maybe I'll try a large dose and see how that changes things.</p><p>Yggdrasil, out.</p>",
 "year": "2004",
 "id": "40072",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-03-23T08:00:00.000Z",
 "views": "5226",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  "2": {
   "time": " T+ 0:50",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  }
 }
}
