{
 "id": 4009,
 "title": "A Journey into the Land of Goblins",
 "date": {
  "submission": "2003-08-29T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Erica.Smerica",
  "gender": "Female",
  "weight": "115 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.08 oz",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>It has been quite some time since I have written so I may ramble a bit.  My boyfriend R and I took a trip to Lake Powell for fall break.  We headed down to try out the new kayak and the sail that he had spent several weeks planning and building.  We brought along some lovely blue mushrooms for the journey but didnt seem to fit them in until the very last day of our trip.  I had so desperately been wanting to trip with him because I hold a strong belief that one never really knows another until having the opportunity to explore their ego.",
  "The setting was Goblin Valley, Utah.  What an ominous name for such a gorgeous space.  We were surrounded by dulled shades of green plants and bright red sandstone that was painted with desert varnish.  The land was sculptured by centuries of wind and water.  It was 11:30 in the morning when we ate our mushrooms, 1/16 of an ounce for him and 1/12 for me.  Since he is rather inexperienced with psychedelics, and very sensitive to drugs in general, he wanted to keep it mellow.  I decided not to take a full dose so that we would be on the same level.",
  "Approximately 20 minutes after we ingested the material R began to notice slight effects.  It took about 30 minutes for me to notice, but once they came on things got stronger more quickly.  We began our journey by wandering through slot canyons, which were oftentimes so narrow that we could barely squeeze through.  R and I had trouble keeping our hands to ourselves so we rapidly began searching for a more secluded venue.",
  "As we were walking I could feel energy reverberating off of the ancient rocks, energy that seemed to be calling out to me.  I felt very connected to this place, and it felt so deep and profound.  I began reminiscing about recent past events that had occurred in my life.  The most prominent of these events was the breakup of my previous relationship.",
  "A laundry list of thoughts, both happy and sad, was racing through my mind. (e.g., why were we not right for each other when we both felt so connected, will I ever meet another human being who makes me feel so unique and do I really need that or is that just being insecure with myself, I am a happy and successful independent woman).   With the arising of each question seemed to come an answer, a subtle reminder of why.  Suddenly I began to cry.  I felt so overpowered by my surroundings and so thankful to be in that place at that very moment that I could not hold back my emotions.",
  "I felt so strong and independent and I had been lost in my own world when I noticed that R had gone ahead a bit, still searching for a place for us to wander off together.  On a side note, R has a background in physics and is a staunch philosophical materialist so my stories of energy seem foreign to him (I might even go so far as to say they are completely incomprehensible).  I dont think he can even begin to appreciate how profound and special it feels to be brought to tears by the forces of nature, although he certainly would not slough off my experience.  Still, I was reluctant to share my feelings with him until several hours later and even then he only learned fully about my experience by reading this report.",
  "We eventually found the perfect canyon to suit our needs, which was well off the main trail and out of sight, and it led to a bed of white sand surrounded by enormous walls of sandstone.  He has never made love while tripping and I failed to tell him that some men find it difficult to finish because I didnt want to bias his experience.  Anyway, with the one person whom I have previously had the pleasure of enjoying I never experienced much difficulty.  At first he seemed as if he wanted to make love simply for the sake of experiencing sex while tripping, which was alright with me (understandable in fact) but I wanted to make love for the pleasure of experiencing what it would be like for my energy to dance with his on our first journey, essence of myself intermingling with essence of him.  Some of the time our connection felt slightly awkward, although never uncomfortable.",
  "We both found ourselves lost in moments at various times, which made it somewhat difficult to remember the task at hand, but were both enjoying ourselves rather extensively.  I was enjoying an unselfish side of him, a side that was made happy by my happiness, which was a beautiful thing. We did eventually get back on track and managed to end our romp with great delight and satisfaction. ",
  "Afterwards we played in our bed of sand together like children in a sand box.  Our bodies were coated with grains of fine creamy colored powder and our mouths were full of it, as were our eyes, yet we both relished it.  I recalled licking his eyes while we were making love so that he could open them to look at me and so that I could look into them, which partially accounted for the gritty feeling and scratch sounds emerging from my mouth.  He looked especially happy and renewed to my eyes; his smile was like I have not before seen and his beautiful green and brown eyes sparkled and shined.  I found myself sorting through various emotions for our new relationship while also thinking about my recent loss.  It has been very difficult for me to open up to another being after having lost something so very special to me in the not so distant past.  I reminded myself that although some things go unexplained reasons exist for all events, and my experience today was a powerful yet gentle method of such an exploration of queries.",
  "My legs were blue from the lack of warmth and light that the sun so graciously bestows upon us so we ventured back down to the main canyon where we could enjoy the beautiful clear sky and the rest of our trip.  We were lying in the sun and R noticed I had a bit of sunburn from the prior weekend.  He is a bit of a fanatic about sunscreen, rightly so, and we took turns applying protection to each others faces.  His fingers felt wonderful as they swept over the skin on my face.  Every touch felt extraordinary, like having my face brushed with silk. ",
  "Fully prepared for whatever those UV rays might throw our way we continued our journey playing in the jungle gym for adults that the canyons provided us with.  Both feeling a bit hungry, we stopped in the theater for a bite to eat.  The setting was a large open partially shaded space where two narrow slot canyons opened up.  We played with echoes and made small talk of conspiracy theories and technology, happiness and depression, and I attempted to gain an understanding where he had come from and what he had gone through in life.  This trip provided me with a better understanding of my own independence and strength.  It is quite nice to be humbled and empowered in the same set of brief moments.  I also gained a better understanding of the workings of Rs mind, which was something I was very much hoping for.</p>"
 ],
 "erowid": {
  "id": "27492",
  "citation": " E.S. \"A Journey into the Land of Goblins: experience with Psilocybin Mushrooms (ID 27492)\". Erowid.org. Aug 29, 2003. erowid.org/exp/27492",
  "substance": "Psilocybin Mushrooms",
  "views": "16776"
 }
}
