{
 "id": 4011,
 "title": "Sleep Tight",
 "date": {
  "submission": "2007-10-17T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "B.L",
  "weight": "55 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:15",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Unable to fall asleep at night time and suspecting some sort of depression, I saw my general practitioner who pescribed me some Stilnox sleeping tablets. I had no preconceived expectations of what these tablets might bring but was warned by the doctor to only take one at a time.",
  "When I got the brown paper bag home I took out the box and removed the sheet of sealed tablets. The pescription told me to only take one of the tablets which were the size of a tic tac, so I pushed one out of its foil barrier and downed it with several mouthfuls of water.  Immediately after this I sat down at my computer to type an email and after about 15 mins still did not start to feel any effects. I pushed another small tablet out of its foil and swallowed it and sat down again and began to type. After about 5 minutes I began to feel really tired and when I went to lift my head to look at the clock my head felt four times heavier than usual.",
  "I tried to stand up but slumped back into the chair as my body felt too heavy for my legs to support. I giggled to myself in a woozy, heavy kind of way. I could no longer type any messages as I was in too much of a daze and I looked into the mirror only to find a stupid smile on my face along with half closed eyes. My phone rang and it was my friend wanting a to chat. I ended up asking him over to my house and when he arrived he had to carry me up the stairs to my room and I explained to him the tablets that I had taken.",
  "Everything after that is a bit of a blur. The next morning I woke up and there was a used condom on the floor next to my bed and a big puke stain on the carpet. Apparently my friend proceeded to have sex with me after he carried me to my room however I do not remember consenting as I do not remember the act itself. I felt very lethargic the next morning and cleaned up the puke which was presumably mine.",
  "I took the tablets once more after this incident when I was experiencing a particularly horrifying unrinry tract infection and was home alone. I thought I was going to die of pain and there was no one to take me to the hospital, further more I could not walk or crawl to get the phone to call the ambulance as I was curled up in a ball of the most terrifying pain of my life. I managed to get two stilnox into me as I hoped they would knock me out and dull the pain. All they successfully did was make me as dopy as I have previously described. Finally my flatmate returned home and rushed me off to the hospital where I remember nothing furthermore except sitting on the toilet trying to pee for at least an hour.",
  "It has been my experience that sleeping tablets when taken in moderation can be a useful tool in gaining sleep but when taken unwisely can cause blackouts in memory, which in turn can make you a vunerable target."
 ],
 "erowid": {
  "id": "27510",
  "citation": " B.L. \"Sleep Tight: experience with Zolpidem (ID 27510)\". Erowid.org. Oct 17, 2007. erowid.org/exp/27510",
  "substance": "Zolpidem",
  "views": "11236"
 }
}
