{
 "title": "I Saw The Birth of the Universe",
 "author": "KDO",
 "citation": " KDO. \"I Saw The Birth of the Universe: experience with Mushrooms, 2C-E & Nitrous Oxide (ID 40114)\". Erowid.org. Jul 21, 2005. erowid.org/exp/40114",
 "substance": "Mushrooms, 2C-E & Nitrous Oxide",
 "bodyweight": "145 lb",
 "report": "<p>Personal Drug History: I've done my fair share of drugs: lotta weed, lotta ethanol, lotta nitrous, ether once or twice, salvia couple times, 2C-I x3, 2C-E x2, I really like mushrooms, LSD twice, Ecstasy once, and DXM couple times. I kinda had a spiritual awakening before with acid once and I've been pretty turned on to drugs ever since.</p><p>Set and Setting Background: Just in time for New Years I happened to come across some more 2C-E (I've had it from the same source before so I knew it was good, from one of those now-extinct chemical websites). The mushrooms weren't particularly potent; I'd tripped on them before at this same amount and had a good time, but no crazy visuals or anything. New Year's eve: I proceed to get blasted in preparation for the new year with JD, beer, champagne, blunts, bowls, and whippets. I get so obliterated in fact that I black out and end up nearly getting into a fight with my friend's friend. My friend D (whose friend it was and whose house we're staying at) isn't real happy; he spent a large part of the night getting me out of trouble.</p><p>The Day of the Trip:</p><p>11:00 am. D rightly bitches me out and I promise him I won't drink tonight. We all wake up, eat breakfast, and wait for the alcohol to leave our systems. Breakfast eases the nausea a little. Drink plenty of water. Still feeling pretty sick.</p><p>4:15 pm. Myself and three of my other buddies each eat a quarter ounce of mushrooms. They taste pretty awful.</p><p>4:45 pm. We're all pretty nauseous but no one pukes. I get the shakes a little bit, too, but I think that might've been from last night's booze. </p><p>5:30 pm. We watch a movie for the next two hours or so and during the whole movie I'm starting to feel the walls and floor doing their shifting thing and the lights start dancing. You know, just fun stuff. Good body high at this point, too.</p><p>7:30 pm. The movie's over, I'm feeling pretty good and it seems my friend's are too. I take a few whippets just for fun. Pizza arrives, friends eat it, but I'm not feeling particularly hungry.</p><p>7:45 pm. The shrooms are pretty well into my system and I feel the time is right. I mentally thank my friends for coming with me so far on this psychedelic journey and get ready to take the 2C-E. I opened up the capsule and poured the white substance into my mouth under my tongue, and then washed it down with water. The taste is pretty bad but not unbearable. Feels like it's melting in my mouth.</p><p>8:15 pm. One of my friend's friends stops by because he heard we were all tripping and wanted to also. Unfortunately, I told him, these shrooms aren't very good, but I've got something else he might like (the 2C-E). He didn't want the research chemical, but we get to talking. He's made a lot of money in the drug business and probably loves doing drugs more than me.</p><p>9:30 pm. I start to feel the 2C-E. No nausea that I remember.</p><p>9:45 pm. I'm pretty good at talking to people, even on psychedelics, but at this point the English language stopped making sense to my mind and I really couldnt form a coherent thought to save my life. But for maybe two hours I tripped harder than anything I had imagined possible. I'm talking full audio-visual out-of-my-mind tripping balls. Just to give an idea, I saw the birth of the universe staring into a lava lamp, the droplets of moisture on the inside were galaxies being born and the red light at the bottom the geothermal reaction going on under the earth's crust. Deep stuff, I know.</p><p>10:00 pm. Really thirsty. I think it's from the blunt. I drink lots of water and feel better.</p><p>12:15 pm. Eventually I get the hang of it and am able to talk again. As I'm talking to some people about (what else) drugs, I start to see just how many lies the government has been telling us about them and how mis and uninformed people are when it comes to drugs. Drugs aren't bad. Addiction is bad, addicts are bad. But addicts are people, not drugs.</p><p>2:00 am. D then made us some really good food and I buried the hatchet with him as best I could, so that whole mess turned out okay, too. Still tripping moderately hard, but in control. At this point I've been tripping hard for over nine hours. Body feels okay, though.</p><p>4:00 am. I go to bed, but I can't sleep. I have to take a couple shits, too, not sure what that's from.</p><p>6:00 am. I finally get to sleep, not even sure if I was still feeling the 2C-E, but real tired.</p><p>12:40 pm. Next day my brain feels a little fried. Nothing unexpected considering the party in my brain the night before, though.</p><p>Even the next day, thirty six hours later, after I'm still feeling a little bit of whatever chemicals are left over in my brain. But I love it.</p><p>Moral of the Story: Drugs are fun, I just make sure I do them right.</p><p>New Year's Resolutions: Have more fun! Party a lot more! And do more drugs!</p><p>1/15/05 PS: I did the same 2C-E again, about the same audio distortion which kinda reminded me of acid, but visuals nowhere near as intense. Same inability to communicate sometimes. 2C-E is not at all like 2C-I. I have a lot of respect for 2C-E and look forward to doing it again.</p>",
 "year": "2005",
 "id": "40114",
 "gender": "Male",
 "timestamp": "2005-07-21T07:00:00.000Z",
 "views": "10766",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "0.25 oz",
   "administration": "oral",
   "substance": "Mushrooms"
  },
  "1": {
   "time": "",
   "amount": " T+ 3:15",
   "administration": "10 carts.",
   "substance": "inhaled"
  },
  "2": {
   "time": "Nitrous Oxide",
   "amount": "(gas)",
   "administration": " T+ 3:30",
   "substance": "20 mg"
  }
 }
}
