{
 "id": 4014,
 "title": "The Light Fixture",
 "date": {
  "submission": "2006-07-03T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(daily)"
  }
 ],
 "report": [
  "A couple of months ago I started taking lexapro. I was forced to by psychiatrists and my family or else they would've abandoned me. I gave in and took them, warning them that I knew the real dangers of the chemicals they were giving me. A lot of bad side effects took place, including psychosis and psychotic episodes every night for two weeks. I took it every day for about 4 weeks and nothing big happened except some geometric figures in front of my eyes, and being unable to focus my eyes.",
  "Then about 2 weeks into it I started having psychotic episodes. The first time this occurred it wasn't too bad.  It was just some ripples, kaleidoscopes, mostly closed eye visualizations, and the perception of size was altered.  Every night that it happened, it seemed to get more intense, almost like the tolerance was decreasing. A week went by and I had the same type of psychotic episodes mostly every night. Then I had a bad experience, I was sitting in my room in the dark trying to sleep and all of the sudden the light fixture on my ceiling kept getting bigger and smaller, and the bookshelf was moving left to right at rapid speeds. ",
  "The whole room would shift an inch up or to the left.  There were these bright blue spirals getting bigger and bigger even becoming a part of me once. Then many red dots appeared and they turned into eyes.  Like an infinite number of red eyes staring at me. Everything intimidated me.  I wasn't even in my room anymore. It was just the darkest of black empty space. I was basically in complete fear of what was happening, and I'm not the person to freak out from experiences with other drugs I've done.",
  "After this last psychotic episode I decided that I wasn't curious about the 'trips' I was getting anymore and I decided to stop taking it. At first I thought it was good but it's not. It is a bad psychotic episodes. I've done hallucinogens before and only for my own spiritual purposes and there's nothing spiritual about this.  Just psychosis."
 ],
 "erowid": {
  "id": "27521",
  "citation": " Anonymous. \"The Light Fixture: experience with Escitalopram (Lexapro) (ID 27521)\". Erowid.org. Jul 3, 2006. erowid.org/exp/27521",
  "substance": "Escitalopram (Lexapro)",
  "views": "16283"
 }
}
