{
 "title": "'Mitch Is Back!'",
 "author": "mitch",
 "citation": " mitch. \"'Mitch Is Back!': experience with 2C-I & Hash (ID 40167)\". Erowid.org. Apr 6, 2005. erowid.org/exp/40167",
 "substance": "2C-I & Hash",
 "bodyweight": "185 lb",
 "report": "<p>My name is Mitch. I only mention this because it becomes relevant  a few paragraphs down. Just as set and setting is important to the psychedelic experience, so I believe it is also relevant,  to give a little of my own background to help create a better understanding of the events Ill try to describe.</p><p>In 1967, my psychotherapist invited me to hear Tim Leary speak. Consequently, I approached the entire world of LSD, DMT, STP (DOM), and Mescaline with  an eye towards psycho-spiritual understandings. After slipping and sliding for a dozen years, I experienced another dozen completely dry years (not even smoking cannabis), eventually  returning to marijuana use and a deep commitment to meditation in the mid nineties.  In 2004, my two older sons convinced me to try Salvia (READER BE CAREFUL!), and after a true heaven and hell experience, I tried it again and found tremendous emotional breakthroughs occurring as layers of denial were being peeled away from my consciousness and early traumas were being revealed in ways that I can only describe as  healing in nature.</p><p>One of my sons had sent away  for 2ci (it was legal then thru the web). He had no way to measure dosages without a hi-tech scale, so I tried a conservative amount, realized what I needed to do dose-wise, and took three days to fast and canoed up to an idyllic spot on a river, pitched a tent, and smiled in for 3 days of 2ci  with hashish and mj for after the main course deserts.</p><p>Soon after serious dry heaves , I was face-to-face with that 'GIVE-IT-UP' voice that I know I have to float downsteam with, and the more I fight - the less my trip will be. That's just the way it is, folks... in that hyperpersonal typography that my ego cannot get its mind around so I cant remember it when I'm straight - and I find myself in a setting  which as all psychotropic travelers know, never lends itself easily to communication within our three dimensional world of consensual validations. It was like a StarWars bar scene, but only a hint in that a being like a cosmic hyperbeing wiping a barglass and looking up as I came in said clearly Mitch is back! It was with a very real sense that I had been there before in the 1960s.  It was a very pleasant and welcoming sound and a general sense of good hearted welcome permeated  from several other beings of light that were there. I sensed them communicating to me that they lived in a world or universe above the ego, and well, here we are.</p><p>I of course freaked out, I couldnt handle it long at all. I think we were like flashing our lights at one another and there was floating out into such generations of beauty  as if one could imagine the most glorious jewelry from the best New York stores one-thousand times more beautiful and glorious, and I got caught up in it and stopped flowing and started describing and characterizing it to myself and kept reaching out to my reason and became self conscious. I started thinking, and most dangerous of all, started reacting to my own thinking, and of course the heavy gravity of the ego enters in, and I start reacting to hallucinations that they (the creatures of light) were reading into my mind like a hacker reading anothers hard drive, and that either  pissed them off, and they let me know how easily they could (but also with an annoyed sense that what  do we want to look at your garbage for?') and I got so embarrassed at my own anxieties that the combination of the two (fear and anxiety) was enough to end the trip. Once down I realized what I had done, talked and laughed outloud  probably prayed, and quickly smoked huge amounts of hash.</p><p>Soon Britney Spears came dancing into my eyes closed world singing Anticipating this is our song theyre playing (a very non-sexual performance) and I just felt such innocence,  love and peace that I was soon back at the bartender and he looked up and said Mitch is over there, smoking hash. I saw myself smoking like in a 60s poster with a big Hookah and the letters H-A-S-H were coming out in the smoke. I smiled but we knew there was no more energy, and floated back down soon after.</p><p>Weeks later I started reading Pikhal and halfway through picked up Terence McKennas True Hallucinations and The Archaic Revival. I was astounded to find his conception of the Mushroom Other, as since the 2ci experience described above I have tried Psylocibin Mushrooms four times, with definite experiences causing me to call the Mushroom Sacred.</p><p>The mushroom experiences have not been so light-hearted as that described above on the 2ci, however.</p><p>Question: have others experienced the Other on the 2ci, CB, etc. drugs that Alexander Shulgin has blessed us with?</p>",
 "year": "2005",
 "id": "40167",
 "gender": "Male",
 "timestamp": "2005-04-06T07:00:00.000Z",
 "views": "7314",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis - Hash"
  }
 ]
}
