{
 "title": "Extreme Closed Eye Visuals",
 "author": "Socharis",
 "citation": " Socharis. \"Extreme Closed Eye Visuals: experience with Anadenanthera colubrina (ID 40182)\". Erowid.org. Oct 6, 2005. erowid.org/exp/40182",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3 seeds",
   "smoked",
   "Anadenanthera colubrina",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>Me and 2 of my friends decided to try smoking some Anadenanthera colubrina seeds the other night. I took 3 seeds for each person, so that was 9 seeds, and placed them into a pan on a low heat until the outer seed coating had started to come loose. I then removed all of the seed coatings and placed them into a grinder (however, a coffee grinder would have been optimum), they were still quite coarse from the grinder, so I chopped them finer with a sharp knife over and over again. once in a fine powdered state, I decided to mix in some Baking Soda, as I thought it might help the DMT to react. so I placed the same amount of baking soda into the mixture as the same amount of seed, then throughly mixed them together.</p><p>We all took a third each, the first person to do it found it too thick  and harsh on the throat and made him cough, and didnt finish the whole of his third. The second person to take it took more and coughed less, then when I took it I took medium breaths but more frequently, this seems to have stopped the coughing.</p><p>All of us commented on the pressure we could feel on our heads and body. I could really feel a sharp pressure on my head and got a bit worried, as it felt as though somebody had closed a bear trap on my head. But this stopped being painful after a short time.</p><p>I noticed open eye visuals, for example all things had a hue of different colour light around them and I could see waves on the floor. But I feel these could have been more powerful with a higher dosage. I was looking at the floor for ages and my friend was watching also, looking at the differnt colour surrounding things, and light moving across it. BUT the real treat came when I closed my eyes for a few moments. Intense, powerful, bright, dancing images mainly geometric were dancing at supreme speed. To start off with I saw what looked like chemical compound structures just darting around, then came a tunnel experience (which also kept repeating itself), I saw a bright tunnel which I was travelling through at fast speed, like these futuristic racing games that you can buy, I.e. F-Zero X.</p><p>Upon realising what was happening I watched them mesmerised, then finally got the energy to tell my friend to close his eyes. When he did he also had Closed Eye Visuals of the same type, he reported travelling down tunnels at fast speeds. I carried on watching this fantastic 'Laser Show' for a while. My friend placed his hands over his eyes and it intensified the CEV's so I did the same, and we sat there for about 30 mins having the most amazing CEV's. A few times we both reported that there were some very real looking hallucinations. For example my friend saw a devil coming towards him and an angel took it away, I saw a hand ripping the corner of the black screen of my mind and revealing a more 3D looking world. We were both supprised to see these 3D images as most of the images we were seeing were bright lines and spheres, and maily 2D.</p><p>After a while we went downstairs and to the kitchen (the friend who didnt take much went to bed just feeling relaxed) while in the kitchen it was dark with no light on and the Open Eye Visuals were very very strong, objects had a glow and moving of hands produced trails of glowing light. We could see a dark corner and we both said at the same time that the very pitch black seemed like a void and as if there were things waiting there, it felt as though it was sucking us in. Then we noticed the door was slightly open and there was a dark area just beyond the door and we both got very freaked out and saw the darkness as being an eminent scary force, like a dark cloak. We both felt very scared and couldnt stay in the room any longer. The CEVs and OEVs then slowly began to dissapear and it too a few hours for them to go fully.</p><p>Throughout the entire experience there were little dots everywhere, just like static/white noise on a television set, these visuals were the emost prodominent and also lasted the longest. The trip from start to finish lasted around 1 hour 30 mins for the most powerful part then it slowly declined after that. Also throughout the experience there was a great felling of happiness and euphoria, that carried on for a number of hours afterwards.</p><p>We all found the entire experience to be very pleasant. We plan on doing it again but with higher doses next time.</p>",
 "year": "2005",
 "id": "40182",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-10-06T07:00:00.000Z",
 "views": "14152",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 seeds",
   "administration": "smoked",
   "substance": "Anadenanthera colubrina",
   "form": "(ground / crushed)"
  }
 ]
}
