{
 "title": "Jimson Weed isn't all that bad...",
 "author": "Whoknows",
 "citation": " Whoknows. \"Jimson Weed isn't all that bad...: experience with Datura (ID 402)\". Erowid.org. Jun 29, 2000. erowid.org/exp/402",
 "substance": "Datura",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Datura"
  ]
 ],
 "report": "<p>To all you people who say that Jimson Weed is stupid and that no one should try it...</p><p>Personally, I like jimson weed. It's cheap (about 10 bucks a pound) and it CAN get you really screwed up. What I like about jimson weed is that when you make tea from it, you can easily control your high/trip. Just bring about 1 1/2 cups of water to a boil, turn heat down, throw in about 3 or 4 good sized pinches of jimson with a tea bag, then let simmer for about 15 minutes. The water should turn a brownish color. Strain mixture into a glass and drink up :) If you're wondering how much to drink then read on. If the tea is a light brown and you can see the bottom of the glass, then one glass will make you feel a little bit high and a little bit drunk. If you cannot see the bottom of the glass, then about 1/4 of it will give you the effects just described. 1/2 of a glass will make you feel even more drunk, and a full glass of the strong stuff will make you start to trip a LITTLE bit, about the same effect as taking 1 hit of pretty good acid. If you drink more, all I can say is BE CAREFUL! When you're really screwed up off jimson, you will feel very drunk and fall down a lot (but you dont puke(!)), you smoke imaginary joints and cigarettes and still get high from the imaginary joint. Anything you pick up won't be in your hands much longer :) All the stuff I just described is if you drink a lot or if you make REALLY strong tea. The tea will taste kinda gross. If you're wondering about one of my experiences then read on.. :)</p><p>I boiled about 1 cup of water and put about 5 big pinches of jimson in the water. The tea was VERY dark and tasted very gross, but I wanted to get fucked up and I did..</p><p>At first I didn't feel it and was complaining (it seems that everyone who says they don't feel it gets the most fucked up.) Well, about 30 minutes later I couldn't stand up. I sat down and almost fell out of the chair. My friend passed me a joint and I took it into the kitchen, dropped it, then went and sat on the couch and started smoking an imaginary joint. I kept trying to pass it, wondering why no one would take it. Then my friend said 'wanna hit this?' as he passed me the bong. I smacked it out of his hands. After he filled it back up with water he passed it to me again and I tried to take a drink out of it. Thank god he didn't let me, cause I would've chugged it. I probably dropped about 5 beers all together and smoked at least 3 imaginary cigarettes. Theres a lot more that happened but those were the parts I remember the most. I do have a friend who drank 2 glasses of the strong shit and was making drug deals with the toilet. So I don't advise drinking more than 1 glass! :)</p><p>Hope this gave you a better understanding of jimson weed.</p>",
 "year": "2000",
 "id": "402",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-06-29T07:00:00.000Z",
 "views": "61876",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Datura"
  }
 ]
}
