{
 "id": 402,
 "title": "Heaven, Well Not Quite",
 "date": {
  "submission": "2003-07-16T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Persistent",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "insufflated",
   "substance": "PMA",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "In the spring of '99, I had an encounter with PMA, MDMA's rough and dangerous cousin that is increasingly masquerading as E and wrecking havoc all over the world.",
  "I actually found this compound to be quite enjoyable. I had shared a bottle of wine with a friend, R, earlier in the evening, we had then gone to my friend F's house. F offered me a tablet that he said he had procurred in Louisiana, which he said was sold as E but certainly was not. He was somewhat foggy on the actual name of the drug contained, but he remembered it having a p in the name, (he had actually spoken to the manufacturer, who had apparently told him what was in the pill.) I figured right away that it might be PMA. The unmarked tablets were large, tan, chalky, and not particularly bitter. R and I split one tablet, ground to a powder and insufflated. Effects came on quickly, and can best be described as an intense vibrational energy rush. My hands trembled and clenched convulsively, and I had uncontrollable sewing machine leg. There were slight melting, wriggling visual effects and patterns of black and white checker-board dots flying through the air. This rush was quite pleasant, but certainly as powerful as I could want it to be. I could see how this compound could be dangerous.",
  "F had taken at least 2 tablets orally and was loving it. He described it as electric, with bolts of lightning shooting up his limbs and spine. You should know that F was what even I would call a totally insane drug freak, who would consider 1/2 g crystal MDMA and a 1/4 g of Heroin to be just a mellow nights entertainment, so definitely don't try taking 2 tablets of PMA, many people have died from less. Any how, he said that he preferred the PMA over MDMA, due to the stronger rush, which he said made him feel fierce and animalistic. R said it was quite visual, and reminded her more of LSD than MDMA. About an hour into this, I developed some GI discomfort, probably due more to wine I had drunk earlier than the PMA, though that certainly could have contributed. This discomfort continued for some hours, but was not bad enough to comlpetely ruin the experience. Smoking some cannabis did help somewhat.",
  "Overall, I found this drug to be enjoyable and it has certainly piqued my interest. Most people probably would not get into this stuff, it has a heavy body load, and very little in the way of visuals or insight. This is not a thinking drug, just the opposite. In fact, the most interesting thing about it was the way it seemed to temporarily turn off most higher mental functions, leaving me in a highly animalistic, instinctual mindstate. Duration was fairly long, with an hour or so of initial rush, 3 or 4 hours of plateau and a long come-down to baseline at about T+12 hours. Be very careful with your dosage, I took 1/2 and it was almost too much, and the LD50 is only 2 or 3 x the ED50."
 ],
 "erowid": {
  "id": "10720",
  "citation": " Persistent. \"Heaven, Well Not Quite: experience with Alcohol, PMA & Cannabis (ID 10720)\". Erowid.org. Jul 16, 2003. erowid.org/exp/10720",
  "substance": "Alcohol, PMA & Cannabis",
  "views": "19635"
 }
}
