{
 "title": "No Point of Reference",
 "author": "23",
 "citation": " 23. \"No Point of Reference: experience with DMT (ID 40231)\". Erowid.org. Jun 29, 2005. erowid.org/exp/40231",
 "substance": "DMT",
 "bodyweight": "150 lb",
 "report": "<p>Holy crap! Ok just recently finished a 20mg trip. This time I smoked it in a bong with some Salvia Divinorum as a way to hold it in the bowl. Now I realize just how much I need to break through. (On a side note I smoked some of the salvia by itself to see if was potent or not and I barely got a head change). So I loaded the chamber with smoke and proceeded to take 3 hits in a row and then laid down. The intensity grew until I saw myself looking down a hallway type of structure. It tapered down to a point kinda like I was looking down through a cone towards the point. Now from this other end I saw the elves coming up towards me. As if they where coming through a worm hole from another dimension! He looked just like a leprechaun, with the top hat and pointy red shoes. One of them was carrying a big red Santa Claus bag full of tricks. They told me get ready cuz they where coming. Behind them came a circus full of activity. (This circus theme pops up allot in other peoples trips) This is what you have been waiting for! So they marched up towards me and as they reached me what was behind them oozed up and all over me. It felt like I was being dipped into this paint like substance made of colors and patterns. Pure psychedelia. I love it!</p><p>Then one of them proceeded to show me the most incredible scenes and landscapes. Everything had a yellow green hue to it. I thought, what was the purpose of all this what was I to learn from this? Then they told me stop trying so hard to make sense of anything. That, the purpose was just to accept it for what it was, to stop trying so hard. One of the elves had this device in his hand that looked like a remote, and he was controlling everything that I was seeing! He was definitely in control of everything. They where very eager and ready when they came but calm and focused. I realized that I had seen them before but did not realize it until now. (I think from all the other trips I have had where I didnt remember most of what had happened) They had a lot for me to see, and this one in particular had great enjoyment in showing me all these extraordinary visions and things. Everything folded out for me to see right in front of me. Unfortunately I dont remember most of what I saw. The trip faded really fast after this. Next time I will remember more. Frigin awesome!</p><p>On a side note, now that I have had more DMT breakthroughs since this report, I have come to some new conclusions. I have broken through and communicated somehow with other beings. When I break through I completely leave my body and find myself in this hyperspace. Hyperspace is multidimensional. There exists more than 3 dimensions here. The reason the my DMT experience is so difficult to explain is because its very difficult describing what a 4th or 5th dimension is like. In hyperspace there is nothing I can anchor myself to as a point of reference.</p><p>Without a doubt there are entities of some kind here. They come in the form of elves or completely unstructured or made up of shapes and forms that are constantly changing, and morphing. These beings guide me through hyperspace at the speed of light as if I am a current of electricity. They don't communicate in words but in symbols and telepathy. There are times when they don't want me around and other times they are ready and very willing.</p><p>I always do a blessing before I smoke. I burn some sage around the room while asking for guidance. The one time I did not do a blessing I encountered the beings as being dissapointed and did not want me around. They where busy pushing me out of their world! It was crazy to say the least. Also when you breakthrough you really go to this place in hyperspace and it is very real. Every time I smoke now it never fails to amaze me. This is an amazing and incredible entheogen.</p>",
 "year": "2005",
 "id": "40231",
 "gender": "Male",
 "timestamp": "2005-06-29T07:00:00.000Z",
 "views": "7964",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(freebase)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 }
}
