{
 "id": 4024,
 "title": "Persistant Deja Vu, Pure Euphoria",
 "date": {
  "submission": "2003-10-14T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Vapour Boy",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "110 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "110 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>Prior to my first experience with MDMA, I had never before recreationally taken a substance more 'severe' than marijuana. This being said, I had been smoking marijuana on an almost daily basis for quite some time, and was eager for a different experience. (Is marijuana a gateway drug? Undoubtedly, in my opinion.)",
  "Upon the offer of a friend of mine, I had decided to take the plunge and try MDMA with three friends: one had about 5 prior experiences, another had just rolled for the first time two weeks earlier, and the third was my ex-girlfriend (ex at the time of rolling, as well) who had once before taken MDMA which, according to her, resulted in a horrific experience.",
  "I had always harbored reservations about taking Ecstasy, due primarily to a small number of second hand accounts of bad trips, as well as the reputation the substance has for potentially harmful side effects. (I now realize that these cases of bad trips are frequently due to the presence of substances other than MDMA in the 'Ecstasy.') However, on this particular occasion, I was quite familiar with the source of the substance, and was assured that it was only pure MDMA that I would be consuming in the gel cap.",
  "Instead of the usual rave/dance scene, we decided to enjoy our evening of rolling at my friend's house, which was entirely fine by me, as I had no idea what to expect from the substance. Immediately upon arrival at his house, we consumed one pill each (110 mg) at 7 PM and proceeded to smoke a small bowl of marijuana (largely to calm my nerves, which were a bit on edge after consuming the substance.)",
  "After about 45 minutes, my two male friends present seemed to be feeling a good level of the effect: they were really getting into the use of ice and cold water, frequently rubbing the former on one another's skin. At this point I was a bit dissappinted; I had obviously not achieved the level of euphoria that they had attained. (In retrospect, they felt about the same as I did at that time; I believe that they were just recalling their prior experience rolling together, and knew that what they were doing just seems right while under the influence. Their actions, at this point, actually made me a bit uncomfortable. 'Can I rub your feet?' 'Uhm, sure' I would reply)",
  "I was definitely feeling content with life in general by this point, and felt no evidence of nausea or anxiety, so I joined them in taking another 110 mg pill. However, soon after I took the second (a mere 5 minutes or so), I began to truly notice the full effects of the first pill.",
  "The moment of my realization of the euphoria can be specifically isolated: after partaking of another bowl of marijuana, I looked up behind me at a Bob Marley poster on the wall, and there was a sudden *click*, and, at that moment, everything was right in the world. From this point on, my memory of the experience is quite delinear, but many key moments I recall.",
  "By this point in time, it was quite dark outside, but it was a lovely evening with a full moon and low clouds (with Colorado's Rocky Mountain range as a backdrop.)  During a smoke break outside, I melded with a deck chair, absolutely content to just look up at the sky, and try to focus on the (now overly bright) full moon among the clouds. Focusing on such a bright object at the time was quite impossible, but I was content with losing myself in the expansive night sky.",
  "My next memory vivid enough to recall is one of looking at myself in the mirror. In my reflection, I had ceased altogether to be myself; I was looking at myself as an impartial observer, and was able to be completely honest about my appearance and facial expressions. This golden moment, by itself, I consider to be worth the entire trip. (I was also quite enamored with my severely dialated pupils.)",
  "After descending into my friend's well-furnished and comfortable basement to listen to music as a group, the second pill was starting to take effect as well. At this point, nothing felt better than being touched, or touching others. Even the rubbing of ice on and intense muscle rubs I was giving to my friends there didn't give me the slightest of pause; our touches had no sexual lust to them, they were merely expressions of our feelings toward eachother as human beings.",
  "I did experience minor hallucinations, especially while looking up at the night sky. (A stuffed teddy bear spent a few moments hopping inbetween clouds and waving, and then was gone for the remainder of the evening.) Although nowhere near the severity of those experienced while under the influence of psilocibin, colours were intensified and sound was amplified internally.",
  "Much of the rest of the night was spent clenching my jaws (something I did regret the next day) and experiencing severe Dej Vu; although I know that I had never before taken MDMA in my life, almost everything I was perceiving felt as if it had happened to me before (something that I also experienced with psilocbin.)",
  "My experience (and post-experience) with MDMA did cause frustration with words, however. I felt that it was not possible to express myself thoroughly with words alone. However, this frustration didn't effect my experience at all; nothing whatsoever could have been construed as negative while rolling.",
  "The following day, the four of us got together to go for a short hike. A feeling of rebirth was with me throughout the day, but I never experienced (even in the following days) any of the negative side effects I have heard and read about (depressions, anxiety, strong desire to avoid normal life.)",
  "Although it is frustrating trying to recall and express in a satisfactory manner what the experience was, I would definitely like many more experiences with MDMA (although I haven't been craving the drug whatsoever.) I feel that, after the experience, I can actually cope with life's curveballs much better and enjoy, just that much more, it's pleasurable experiences.</p>"
 ],
 "erowid": {
  "id": "27555",
  "citation": " Vapour Boy. \"Persistant Deja Vu, Pure Euphoria: experience with MDMA (ID 27555)\". Erowid.org. Oct 14, 2003. erowid.org/exp/27555",
  "substance": "MDMA",
  "views": "10308"
 }
}
