{
 "id": 4025,
 "title": "The Chaos Magicians Card Deck",
 "date": {
  "submission": "2007-10-18T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Stormi",
  "gender": "Female",
  "weight": "52 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "One cold, stormy afternoon, during an abnormally auto-destructive period in my life, I thought I would try a little salvia to ease my nerves. A sexy shaman gave me an elegant pipe-full to try out for free, and seeing as though it is rather expensive to buy, I jumped at the offer.",
  "I inhaled quite alot, and instantly felt the effect. The effect is immediate, intense, but wears of rapidly. All in all my experience lasted around 6 minutes. The first thing that I became aware of was my seperation to my own body, I was in it, or hovering slightly over it, yet disconnected to the meat, and quite paralyzed. But part of me was still there, and this is the point that I need to stress, the many parts of myself I simultanously became conscious of whilst tripping on this shamans drug'. I no longer felt intergrated, whole. I was existing on many different levels of consciousness, or if you like, I was in a variety of dimensions, all at the exact same time, so understandably I felt a tad skitzo and broken up into pieces. Each part of the giant me was insanely different to the others.",
  "All the time that I was skimming through the levels, I was accutely aware of the sexy shamans eyes upon me. I felt embarrased about my incapacity to move or speak sense, so I closed my eyes and shut my mouth. I could feel the shamans energy enveloping me. I will tell you now that he was not a real shaman, but my mind prefers to remember him this way. I become incredibly self-conscious on this drug and it seemed to rip through time and space and interconnect, yet at the same time divide everything. I was paranoid that this guy from South-America could know my thoughts and sense my fear. All energies seemed interlaced, yet it was no spiritual-hippy feeling, it was quite scary.",
  "Maybe I feared death, or better said, the dissolution of my ego. When faced with death the ego panics and fear is the inevitable result. I feel that Salvia brings me closer to death, not physical death, but dissolution of my own identity.",
  "So I was on many planes at once, and I was shuffling through them all like a magician playing with a deck of cards. The shuffling, or flicking through realities happened at an inconceivable speed, so that concentration on a single plane proved difficult for too long, yet the second I was there seemed like an hour. Such is the true nature of time and space.",
  "The lowest part of me was in the Abyss, a void devoid of light and matter, a black hole of aloneness. Coming up from here I found myself in real reality, solidness, fear and desire. The next level was an astral sketch of the physical room I was sitting in, and was a curious dance of colour, sound and light. Shuffling up a little higher, I was amazed to find myself in a world of fantasy, or was it. I seemed to be in another realm or even galaxy, but I definitely was in outer space, though close to some planet because I was flying through enormous, yet skinny, violet rocks which had nothing between them but empty space. There were many other flying machines or creatures, I do not recall exactly what they were, zooming about. On the highest level, everything was pure light and love. I know that sounds cheesy, personally I dig shadowland, but that is how it was. It was immaterial and sublime, without beings or distraction, everything was pure, vibrant energy. So I was flicking through all of these dimensions yet in all of them at the same time.",
  "Eventually my body functioned again and off went the sexy shaman and I, to have a drink."
 ],
 "erowid": {
  "id": "27557",
  "citation": " Stormi. \"The Chaos Magicians Card Deck: experience with Salvia divinorum (ID 27557)\". Erowid.org. Oct 18, 2007. erowid.org/exp/27557",
  "substance": "Salvia divinorum",
  "views": "2917"
 }
}
