{
 "title": "A Visit to the 'Other Side'",
 "author": "Deepdreamer",
 "citation": " Deepdreamer. \"A Visit to the 'Other Side': experience with Mushrooms (P. cubensis) (ID 40262)\". Erowid.org. Mar 5, 2007. erowid.org/exp/40262",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "68 kg",
 "header": [
  "DOSE:",
  "5.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)"
 ],
 "report": "<p>We had been staying on Wua Talap, Ang Thong Island for about 3 days enjoying ourselves immensely and immersing ourselves in meditation when we decided to ingest our little bag of magic that we had brought with us from Chiang Mai.  I didnt quite know what to expect given that I had never really had a strong experience on Psilocybin mushrooms.  We all at 5g dried at around 1:30pm on a somewhat overcast day.  We all took them at the bungalow we had just moved to since we had been camping on a secluded corner of this amazingly beautiful beach.</p><p>So, I decided to walk into the forest and hang out until things started to 'change'.  About 30 minutes in, I noticed a kind of dizzy feeling coming on.  Shortly after, I started to feel like laying down on a rock in the path.  I started to hear a bird chirping strangely as if it were surround sound and with a mysterious echo.  I soon realized that I was being eaten by mosquitos and decided to go back to the cabin to find the mosquito spray.</p><p>When I left the forest, the overcast day had changed to a beautiful sunny day that I just couldnt help soaking up.  Upon arriving back to the bungalow, I realized that I had just walked into the presence of mad people.  My brother-in-law was laughing strangely and my wife was acting like a child.  I tried in vain to both find the mosquito spray and to talk to them.  I felt really frustrated at this point and a bit paranoid that the employees at the national park would know we were taking drugs, which they probably did in the end, given the fact of the hysterical laughter and also my brother-in-law screaming loudly as if he was a monkey.</p><p>At this point, I decided to go down to our secluded beach where our tent was still standing.  During this stage, I entered the most mystical experience of my life.  I felt like a divine being on the brink of a mass collective consciousness change on planet earth.  I also felt complete gratitude & awe of my life and of all life and the fact that I was given this journey.  I felt I had a responsibility to others to love them and to share this message with them.  I felt my soul in an eternal context.</p><p>Next, my feelings morphed into a strong feeling of my own mortality.  I felt that I was on the 'other side'.  And still feel this was a real perspective & feeling.  My next feeling was that I had actually died!  This was such a real feeling that I really do think that it has some symbolic, spiritual significance for me.  I then felt, 'Oh no, what have I done in my life?  What consequences do I have waiting?'  I then felt a real responsibility to live rightly and to conduct myself in the most pure way possible in my life.  This because I think that Psilocybin mushrooms reflect your souls accumulated material: thoughts, behaviors & emotions you have had throughout your entire life, and quite possibly past lives.  This resolve to right things made me feel emotional towards my relationship with Christy (my wife). </p><p>Mixed in with all of this was a feeling of mystical connection with my ancestry and the ancestry of the entire islands history.  I also felt a deep connection with the Tsunami victims and I even thought that I was one.  I then thought that a tsunami was coming and then felt very frightened.  This feeling wasnt helped by the fact that my tent literally lifted up a few feet while I was inside, apparently from the strong wind (or from who knows what??).  The feeling of fear surrounding this situation eventually subsided.</p><p>We all reunited in the bungalow.  I felt that I was still on the 'other side'.  This was an EXTREMELY profound feeling.  As I came down, I started feeling great gratitude for having another chance at life.  This is one of the major lessons that the mushrooms taught me.  They also taught me about the profound mystery of life and the interconnectedness of all of life and especially the importance of seizing the opportunity to love each other out of true openness and to try and live a truly altruistic life which is in the end really the key to our own happiness.  That is that giving truly is receiving and that hurting others in the end is only hurting ourselves.</p>",
 "year": "2005",
 "id": "40262",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-05T08:00:00.000Z",
 "views": "3951",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
