{
 "id": 4026,
 "title": "Met My Inner Child",
 "date": {
  "submission": "2005-10-13T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "xtrmskater",
  "gender": "Male",
  "weight": 62
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "report": [
  "This is the account of my voyage through a mushroom trip on a Friday night at my best friend's apartment.  I ate two grams of dried mushrooms.",
  "Like every past experience with mushrooms I wasn't expecting a whole lot (more like just being higher than high). Perhaps because I had never taken more than one gram before.  So when I first felt the effects of lightheadedness and brighter than usual objects, I wasn't expecting to experience what I ended up experiencing. About 20 minutes into the trip I was still fairly grounded in reality, which is how I expected to feel for the next couple hours as the chemicals took effect.  I know I started to stare out the window of the 5th floor apartment.  My buddy would look back occasionally to see what I was looking at, but he had only smoked weed so I would get giddy the more often he looked back, knowing he couldn't see what I was seeing. We had also put in a video tape called 'Beyond the Mind's Eye' which is completely computer generated imagery, but for some reason I couldn't stay concentrated on it and my eyes would wander back to the window.  I think it was because my mind was starting to see things in the black sky, which my eyes were not yet seeing.  Another reason I couldn't stay focused on the video was because of how superficial it looked.  I had bought the video back in 1996, so being fairly old, the pictures appeared often fuzzy with static noise in the background.  Looking at the TV simply made me think how corny it was. ",
  "Around this time, perhaps 40 minutes into my trip, I started to fully experience everything around me.  I sat down in a chair, and noticed that my arms and legs were no longer controlled by me unless I fully concentrated on moving them.  My arms, which I could only describe as being possessed, would occasionally crawl up and down my chest and wander around my face.  I honestly could not tell what they were trying to accomplish.  I had visions of them wanting to strangle me, but I wasn't worried about that happening.  It was quite amusing actually, and I got quite a kick out of watching my arms wander around like lost puppies.",
  "I was eventually able to get control of my limbs to get up and head to the bathroom. I had drunk so much water that I couldn't stay sitting in that chair any longer.  I wobbled to the bathroom slowly since now the mushrooms were in full effect.  I suddenly stopped as I entered the bathroom.  I looked squarely at the mirror, and my reflection in front of me, only to notice that my mind seemed somehow outside my body, as if 'I' were in-between my physical body and my reflection.  My thoughts quickly turned to feelings of how this was possible.  My mind had no body, which I envisioned how death must certainly be.  What if when we die our mind truly does wander the earth for a while, before it's time for its ascent to judgement. At those thoughts,  the mirror started to wave in a liquid motion, and my reflection was being stretched and distorted in several vertical waves.  I walked over quickly and sat down on the seat because I wasn't able to concentrate on standing still, or even standing up, for any length of time after tuning out the mirror incident. ",
  "Then, as I started to go, what felt like a cloud of pure ecstacy enveloped me.  I started to breathe heavy just taking in the experience.  It's the type of pleasure that is impossible to describe without having the listener feel it for themselves.  Needless to say, every pleasure sensory nerve in my body suddenly lit and I couldn't do anything but let the waves pass through me with my eyes shut.  I finally stood up, the pleasure feeling still running through my whole body, and all I could do was collapse in the darkness onto the bathroom floor.  The next several minutes I was just lying there, looking at the closed-eye visuals I was seeing.  Patterns of twisting sharp objects, like geometric Christmas trees, would imprint themselves in the blackness, and they danced to the ambience of music that was still playing from the video.",
  "Without realizing it for a moment, my body began to sit up and move to the corner of the bathroom.  Uncontrolled by me, my legs were brought up to my chest and my arms wrapped around them.  I felt like a 4-year-old.  A 4 year old who is lost in some unknown place and just sits tight till someone finds them.  I was able to tell that my mind was lost somewhere outside my conscious, outside my normal reality, and it was trying to make sense of what was going on.  I pictured my parents, trying to ground myself in that: perhaps to find the path back out of this dark forest and back into my mind.  The more I thought of them, however, the more they slipped out of my grasp.  I could picture their faces, but the essence of who they were made no sense to me: I couldn't envision how they could be my parents, or how I could even have parents, or for that matter have anyone or anything in my life. I was truly alone.  It was just me in my world, no one else existed, except, perhaps, on a 'cartoon' or 'painting' level: simply not real, but mere abstracts of some sort of outside reality; the first time I had ever felt truly solipsistic.  That 4-year-old self, plus my actual self, were all I could feel.  I pictured myself as Gollum from Lord of the Rings: the two personalities in one body, and as I felt that analogy take affect I wondered if I would ever become one person again.",
  "After many attempts to regain arm and leg control I wandered into the living room again.  The roommate had come home and they were talking else where.  I sat in the same chair I had been in before and just closed my eyes.  The visuals were more intense out there, which I can only attribute to the dark room and the glow of the tv screen: giving off the only light, it gave the room a magnificent blue to red alternating pattern.  I could make out the closed-eye visuals well at this point.  The first visual I was able to make out appeared to be a liquid wall, which seemed to be trying to keep me out of someplace.  This wall seemed to be made of two layers, and resembled thick organic chain link fence.  Upon closer inspection it turned out not to be a wall, but transformed into a complete biological system of some life force.  What I was seeing were veins and arteries pumping multicolored liquid bubbles, like a lava lamp, throughout my entire visual field.  I felt like I had wandered into my unconscious mind's respiratory system. The fluidic motions were interrupted when I heard the roommate say 'John, John... you don't talk much when you're tripping do you?' All I could do was give a big cheesy grin and say no.",
  "The roommate left again to go to one of his friend's apartment elsewhere, and I wandered into one of the bedrooms in the apartment I was in.  The room was completely dark except for the window which let some light in.  I collapsed onto the floor and just rolled around for a while till I ended up on my back.  Before I knew it, my hands were back to having a mind of their own.  I was helpless as they felt their way all over my face, but this time was different, for I didn't think they were going to hurt me.  My buddy walked into the room some time later to grab some of his things and I stood up as best I could and looked at him, grinning. He asked me if I was still boomin, and I said 'yeah... I don't know what I'm seeing, but it all makes perfect sense.' he laughed and said, 'well, I hope you figure it out.'",
  "I was lying on the floor again after about 30 minutes according to the alarm clock, and I grabbed a piece of paper and a pen that I keep in my Camelbak and just started drawing.  It mostly ended up in scribbles, but I did write down a few words such as 'john' 'me' 'reality' and 'life' which makes me think now that I was trying to ground myself back into the real world as the trip was starting to wear off.  I could now control my arms again, which is how I was able to draw on the paper.  I finally just rolled onto my back, still seeing the closed-eye visuals and feeling out of my mind still when I finally fell asleep, perhaps at about 3:30, making my trip last about 3 hours, but feeling more like 3 days.",
  "I don't know where I went during this trip, but my mind was definitely looking back on me from another plane of existence.  I also don't know who, or what, was in control of my arms and legs the entire time, but I'd like to figure it out, and perhaps I will in time.  I keep thinking it was some local creature from the reality I was coexisting in, doing the same thing I was doing: exploring a new dimensional plane, but I can't be certain.  Perhaps as I continue 2+ gram dosages I will able to verify who this was."
 ],
 "erowid": {
  "id": "27559",
  "citation": " xtrmskater. \"Met My Inner Child: experience with Mushrooms - P. cubensis (ID 27559)\". Erowid.org. Oct 13, 2005. erowid.org/exp/27559",
  "substance": "Mushrooms - P. cubensis",
  "views": "3397"
 }
}
