{
 "id": 4031,
 "title": "Tri-linear Shifts",
 "date": {
  "submission": "2003-10-15T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Richard A.",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "oral",
   "substance": "IAP",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "9:05pm- Diluted the white powder in soda and drank it down.  Unusual taste that lingered for about 10 minutes.",
  "9:15pm-  Onset, light to deeper tingling sensation in the rear-middle of my brain.  Get a glass of water and settle in for the ride.",
  "9:25pm-  As I am sitting the tingling continues to pulse through the under layer of my skin, first reaching the arms and then the lower half of the body.  There is slight vision alteration (thicker pallet).  And I have noticed an increase in body temp.",
  "(9:35pm?)-  (This is where I lost track of time.)  Music is exceptionally felt, very exquisite,  Penetrating and vibrating on the next level inward under the tingling.  I have a feeling of floating outside myself, but not completely.  I stand and try to make sense of the disorientation I have been thrown into.  My self seems to be floating tentatively in and out of my body, with a sway and pull much like that of the Ocean.  Changing from two to three inches  outside my body to the same distance in another direction within seconds.  As you can imagine this had made it very difficult to walk, wobbling to and fro.",
  "10:00pm-  I notice the confusion.  It only lasts about 1/2hr. But it was very intense, closer to anxiety than anything else I can explain.  I spent this time rolling around in a bed clutching pillow and blankets.  I did note a couple times there were heat and cold flashes.",
  "After the anxiety wares away, I am left with a very amphetamine-like high,  legs bouncing,  jaw clenched,  etc...   Hallucinatory effects noted now the walls are streaming with purples and yellows but not full on.  A very distinct hallucinogenic clearness.  I am about bouncing off the walls with energy now and a friend convinces me to take a walk to have some direction for all the energy.",
  "I set out on a trip along the lake path.  Soon I see a man to my right and after a second look he is gone and a pole is standing there.  Then I walk a little further and see a decent size fire behind a house, and keep walking to the other side of the house and the fire is gone.  I pass it off to be the light on a boat house of the same irridesance. I make my walk to the lake and after about 2 hours of reflection, head back.  Now the smell of fire is coming from the same area the fire was, but upon inspection no fire. And then I see a 73'-74 VW in a neighbors yard and a doubbletake again reveals it to be a shed.  Very real but brief hallucinations, all the time colors doing dances around me. ",
  "3:30am-  I am back from my walk now and I feel the high energy effects are almost gone, my jaw has relaxed much and my legs are still.  This is when I notice the empathetic effect dominating the trip as I talk to my friend of her problems and share some of past experiences to  help her.  We talk for about 2 hours.",
  "4:30-  Waves of energy come in and out (every 20min. ?), very strange.  I take note of one and lay down to watch my eyelids, last time noted 5:30am.  I am told I fell asleep soon after.",
  "Overall good.  I would repeat in different circumstances, considering it was not the rolling high I had expected."
 ],
 "erowid": {
  "id": "27585",
  "citation": " Richard A.. \"Tri-linear Shifts: experience with IAP (ID 27585)\". Erowid.org. Oct 15, 2003. erowid.org/exp/27585",
  "substance": "IAP",
  "views": "22022"
 }
}
