{
 "title": "Fluctuant Intangi-Tweaking",
 "author": "Vyevissorex",
 "citation": " Vyevissorex. \"Fluctuant Intangi-Tweaking: experience with Ephedrine  (ID 40336)\". Erowid.org. Mar 13, 2007. erowid.org/exp/40336",
 "substance": "Ephedrine ",
 "bodyweight": "",
 "header": [
  "DOSE: T+ 0:00",
  "100 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)",
  " T+ 0:50",
  "50 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)",
  " T+ 1:00",
  "12.5 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)",
  " T+ 1:00",
  "12.5 mg",
  "insufflated",
  "Ephedrine",
  "(pill / tablet)"
 ],
 "report": "<p>One day I was waiting in an acquaintances car when I noticed a bottle of pills in the glove compartment. Being the curious individual that I am, I examined the evidence. The bottle had something printed on it about giving one energy and alertness. I assumed that it was merely feeble caffeine since this acquaintance of mine works late shifts.</p><p>To my surprise though, the only active ingredient was Ephedrine. No Guaifenesin to be found. I concluded that the tablets must be well-aged since the FDA has cut off pure Ephedrine. Needless to say, I took a few with me. I tried taking 25mg and 75mg on two separate occasions with very little effect besides body tingling, numbness, and a feeling of uneasiness. Not unlike that of a caffeine overdose but without jitteriness. It definitely didn't come anywhere near the stimulating and euphoric effects of the amphetamines.</p><p>Despite the first two failed attempts, I decided to try a high dose on a dull evening a few weeks later.</p><p>T+0:00:</p><p>Swallowed 4 tablets (100mg) of Ephedrine.</p><p>T+0:20:</p><p>Feeling minor stimulating effects that are reminiscent of caffeine. There is something about this that feels inane.</p><p>T+0:30:</p><p>I decided to consume 2 additional tablets (50mg) bringing my experience total to 150mg. The most pronounced effects at this point are the feeling that my legs weigh less, the unusually fast motion of my heart, and my increasingly dry mouth.</p><p>T+0:50:</p><p>The effects are definite. I do feel much more alert and awake but not necessarily energetic. It interchanges with a feeling of slight irritability and spaciness.</p><p>T+1:00:</p><p>I decide that I might as well use the last remaining tablet of Ephedrine. For the sake of novelty I crush one half (12.5 mg) of the tablet and snort it. It isn't harsh at all. The nasal taste actually reminds me of Xanax (perhaps because of similar binders). I also ate the remaining half, bringing my total up to 7 tablets (~175mg of Ephedrine).</p><p>T+1:05:</p><p>Snorting the powder definitely boosted the effects, as expected. I feel very awake and a mild sense of euphoria but it isn't an amp-like euphoria. The feeling is intangible. My pupils have not dilated at all, so I suspect that Ephedrine does not affect dopamine levels.</p><p>T+1:30:</p><p>Shit, this dry mouth is unbearable. I have been drinking glass after glass after glass of water.</p><p>T+ 2.30:</p><p>I believe that the effects have peaked. There is still a very strong feeling of _something_ but I can't decide what it is. Either that or I don't feel like deciding what it is. Again, I must state that it feels so hollow. I feel like I need to be running around but at the same time I have a feeling of lethargy that doesn't want me to.</p><p>T+4:00:</p><p>The positive effects have lasted in intensity for a surprisingly long time. The Ephedrine high is ridiculously unstable. For a few minutes I feel very content and the next I feel very uneasy and agitated. When it first hits, it seems like these two feelings (content/euphoria vs. uneasiness/dysphoria) both take place at the same time, creating spaciness. As time passes after a few hours, though, the two feelings separate and rapidly go from one extreme to the next. It seems like I feel best just laying on the couch and watching television but fidgeting my hands while I lay there. This seems to satisfy both the combined restlessness and lethargy. The dry mouth is even worse now. I've never had such a dry mouth.</p><p>T+6:00:</p><p>Fell asleep.</p><p>T+ 16.30:</p><p>I had no problem sleeping, which isn't something I can say often. I had unusually vivid dreams and slept for 9/10 hours. I have a slight headache and my mouth remains somewhat dry but no terribly hellish amphetamine comedown. I guess the negative always compensates for the positive.</p><p>Overall I feel that Ephedrine is an interesting chemical. There really is no comparison to amphetamine, though. Ephedrine feels like the hollow and unstable shell of the amphetamine fruit. It isn't necessarily unenjoyable but it isn't something that I would want to do again.</p>",
 "year": "2005",
 "id": "40336",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-03-13T07:00:00.000Z",
 "views": "27217",
 "dose": {}
}
