{
 "title": "Hypoglycemia",
 "author": "Duracell",
 "citation": " Duracell. \"Hypoglycemia: experience with MDMA (Ecstasy) & Alcohol (ID 40338)\". Erowid.org. Apr 19, 2008. erowid.org/exp/40338",
 "substance": "MDMA (Ecstasy) & Alcohol",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  "4 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  " T+ 0:00",
  "2 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 1:00",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 1:30",
  "2 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>Last night I went to a rave in D.C. by myself since none of my friends would join me.  I went to hear good tech/house music and chill out.  I'm 20, not 21, yet they slapped me with a serve alcohol bracelet.</p><p>I was feeling nice from the beers when a shady dude asked if I needed anything.  I was bored so I bought two pills from him.  This was 11:00pm.  An hour later I was very dissapointed; the only perceivable effect from the two pills were slight disassociation, but no increase in energy and actually less motivation to dance.  I knew I had eaten duds.</p><p>I ran into another dude who claimed to have some good stuff.  At midnight I bought one, and immediately felt amped and soon I was feeling one with the music, the lights, and the dance floor.  I was feeling so good I bought two more from him, making my total of good pills 3 by 12:30.  This was my first time trying 'exctasy.' The rest of the night blended away in a blur of excellent dancing.  But I incurred memory loss/blacking out/passing out or something.  I don't remember getting my coat on the way out, but I managed somehow.  Then began the living nightmare.</p><p>My memories are only vague dreams.  I ran into four guys who were concerned for me, because I think they nearly hit me in their car.  I was doing poorly on my own, so I got in the car with them.  I didn't know what I was doing. I began wigging out and speaking insane paranoid ramblings like a madman.  I was utterly drenched in sweat and was shaking.  I felt utter emotional torment, as if hell itself was attacking me and I was totally helpless.  I thought I was losing my mind.  My sweating and state of mind only got worse, and I'm sure I was burning up.  I talked with the guys in some kind of lobby with sirens in the background and many concerned looking people.  They kept pouring water on my head and face.  This was around 5:00am.</p><p>I woke up at 11:00am in an ER bed with a catheter, water/sugar IV, frequent blood pressure monitoring, and a heart rate monitor.  My lips were chewed to hell.  Apparently, hypoglycemia was on the dockett as well, so I'm getting that followed up on.  The dockett also reported weakness and numbness on one side of my body and passing out.  I don't know what the problem was; high first dose, fake drugs, interactions, allergy or just the hypoglycemia.  I have not found myself to be especially sensitive to any drugs in the past.  But it was psychologically the most brutal night of my life, not counting my wanderings in D.C. at 4am that only fortunately got me picked up by the right people.  I'm thankful I didn't find my car in that state of mind.</p><p>Today, the day after, I've felt slightly disassociated, tired, achy and stiff, but none of the numbness/weakness on one side.  I hope my mind will heal itself from the trauma it underwent last night.  I unwittingly put my life completely in fate's hands in more ways than one, if exctasy was even what I consumed.</p>",
 "year": "2005",
 "id": "40338",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-19T07:00:00.000Z",
 "views": "6198",
 "dose": {}
}
