{
 "id": 4035,
 "title": "Blackouts",
 "date": {
  "submission": "2001-03-01T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JR",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "1050 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Ive tripped on DXM (robitussin) many times before, but i began to get bored with any dose below 700mg (about what's in one 8oz bottle of robotussin extra strenth). So i went out and for 5 dollars bought a store brand 8oz bottle of extra strenth tussin. When i got home, to my joy i found i had a unopened 4oz bottle of extra strenth tussin already!",
  "9:30 I finished off both bottles, it tastes nasty, i washed my mouth out and brushed my teeth to try to get the taste out, it work.",
  "10:00 fealing drunkish, similar to a 350mg dxm dose.",
  "10:30 There seems to be a lot of white in my vision, i cant read too clearly, and when i stare at something, i get double vision. All over there are flashing white light, simalar to inhalents. My face has gone totally numb.",
  "11:00  I close my eyes for a minute. All of a sudden im wandering all over my house, totally confused, then everything spins around, and im back in my chair, i never left my seat.",
  "11:30 i cant understand what people on tv are saying at all. Im trying to talk to people online, but i cant type.   im not sure what happens during this time asmy short term memory was very bad. i was laying on the floor with no idea how or when i landed on the floor, my everything is horrible confusing and blank.",
  "2:00 things seem to have come down a bit, i can sort of walk, but its difficult and fantasy and reality have become 2 differnt things once again. I try talking to people online again, friends, i find that im very emotional, and that i can talk about anything anyone asks me, without shame or difficulty.",
  "2:45 i go to bed. I close my eyes and the hallucinations begin again. A dayglo colored transformer robot is talking to me, although i dont know what he's saying."
 ],
 "erowid": {
  "id": "2760",
  "citation": " JR. \"Blackouts: experience with DXM (ID 2760)\". Erowid.org. Mar 1, 2001. erowid.org/exp/2760",
  "substance": "DXM",
  "views": "8471"
 }
}
