{
 "title": "Lost and Found",
 "author": "Bob",
 "citation": " Bob. \"Lost and Found: experience with Nutmeg (ID 40407)\". Erowid.org. May 20, 2008. erowid.org/exp/40407",
 "substance": "Nutmeg",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>I first took nutmeg in the December of 2003.  I had quit weed a week before this.  I did not take any other drugs from my doctor or from over the counter.  Not even tylenol or any of that crap.  I am generally hyper, happy, and a little bit psychotic so I usually don't get nervous around people when I'm stoned cause I normally act weird.</p><p>I took 2 tablespoons straight (I can handle the taste) and it kicked in about 2 hours later. I went over to my friends house (very comfortable setting) and I was hyper as hell but nobody thought it was unusual. I felt like I was on weed laced with coke.  It was great.  I listened to music and it surrounded me.  I made vivid music videos in my mind.  Drawing was fun as hell.  I had absolutely no come down effects and I felt lucid and sober the following morning.</p><p>So there's the good part.  The bad part is it screwed with my head really bad in the long run.  About 2 weeks later I started noticing that my imagination was more vivid and it was getting hard for me to concentrate in class.  I thought it was just withdrawal from weed.  Being how I quit smoking weed I really wanted to get stoned so I bought some nutmeg and took one tablespoon.  Same thing, great effects when I was in a comfortable setting. I went to church the next morning and I was still really fucked up.  I had visions of demons eating me throughout the entire service and I couldn't look anyone in the eyes or talk to them because I was paranoid that they knew I was trippin.  I went home and I noticed my eyes were bloodshot as hell and I felt like crap.  </p><p>Two days after that dose I went to school and I was still fucked up.  I told my friends that I felt like we were underwater.  I was going beserk.  I was extremely moody and hyper.  I was talking all day in school and not paying attention in class.  I couldn't do my homework because I couldn't think straight.</p><p>For the next two months I went through an extreme spiritual shift. I would laugh myself to tears almost every day, at absolutely nothing. I had overwhelming visions 'from god' at any given moment where I would lose complete touch with reality.  I prayed alot more and began conversing with demons, angels, god, and satan on a continual basis (everywhere, all the time), I was basically tripping for the next two months but I didn't feel like crap physically and I generally felt mentally lucid.  I would talk to the spirits of trees on my way home and my striped wall would always fold up like an accordian when I stared at it.  A blue energy guy popped out of my electrical socket and he stuck around and talked to me everyday for about 5 months after that second dose. I thought that my fish were electronic machines.  Every single day my perception of reality would change, but I wouldn't tell anyone I would just try to act the same.  To be honest with you, I couldn't even remember all the fucked up shit that my mind created throughout the year after dose two but I was almost fully convinced that my girlfriend at the time was an angel from god but she wasn't allowed to tell me. </p><p>I then moved back downstate and my intense religiosity surprised my friends but it started to die soon after that.  I fell into a state of depression and extreme introversion.  I couldn't relate to anyone and I never knew what to say when I was around people.  Before this I was extremely extroverted and was one of the people who kept parties alive, so I was told.  Before this I was psychotic, hyper, and happy (I felt happy inside even when I was angry, anger is peace to me haha).  I got along with everyone, I was part of almost every clique there was in my school.  So going from this to introverted and withdrawn totally screwed with my head.  I hated myself.  Also, it was a major struggle to do good in school when before I breezed through it when I cared enough to try.</p><p>I did feel normal sometimes and on those days I would make about 30 or 40 aquaintances(seriously) and then the rest of the week, or even month, I wouldn't want to talk to anyone.  About a year after that second dose I started feeling like myself for weeks at a time.  Now, a year and a half later, I am back to being extroverted and psycho for weeks or months at a time with occasional days of withdrawal. </p><p>I had to use drugs to help me get back to normal.  I used adhd drugs off and on and the effects stuck with me even when I stopped taking them.  Nicotine has helped me as well, and in the process I have discovered that I don't get addicted to it.  I get sick of cigarettes after about a week and just stop.  So just stating that fact should make it obvious that my brain is way fuckin weird but yours might be weird too and nutmeg might throw your whole life out of whack. It sucks.  Next time I want to get stoned I'm smoking weed.</p>",
 "year": "",
 "id": "40407",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-20T07:00:00.000Z",
 "views": "7029"
}
