{
 "title": "First Time Low-Dose Trial",
 "author": "Smoker",
 "citation": " Smoker. \"First Time Low-Dose Trial: experience with DON (ID 40414)\". Erowid.org. Apr 26, 2007. erowid.org/exp/40414",
 "substance": "DON",
 "bodyweight": "160 lb",
 "report": [
  "<p>This was my first time with DON and purely a research endeavor, as there was little to no information provided about this compound. The entry in PiHkAL suggested that this be the more stimulating and less psychedelic version of DOB. I started with a dose of 2.5mg (lower than the 3.0mg starter dose suggested in PiHKaL). Here goes:",
  "Dose: 2.5 mg orally dissolved in tea. This was taken on an almost empty stomach.",
  "Mindset: Woke up early in the morning after getting absolutely shittedfaced on some GBL the night before. This may or may not have an effect due to Lactone's reported dopamine-inhibitor action. Felt completely normal though.",
  "T+1:00: Started feeling a very slight jaw tension and a rise in blood pressure. Not much else at this point. Come up is said to be around 3-3.5 hrs with this one. Also noticed some unpleasant 'stomach effects'.",
  "T+1:30: The stomach had settled so no real side effects except for slight shaking of the limbs. Noticed an increase in stimulation and a little bit of added confusion. Colors seem really bright but no visuals. Similar to a come up on a low (1.5mg) dose of DOB except for there is a lot more stimulation and a lot less side effects.",
  "T+2:00-2:30: This is nearing the 'peak' I suppose. Not much of a psychedelic acpect here really, just a nice even at times calming stimulation which goes like this: I do not feel the uncontrollable urge to do stuff like with amphetamines, but no super-calm-as-a-tank euphoria as with meth either. I almost feel some kind of 'inner peace' without any schitzophrenic ideations as I get with DOB. Just a nice mellow high, spoiled only slightly by shaking in my legs. Feels fine after some stretching is done though. Also drank some tea here which is always a nice booster.",
  "This is T+3:00 and I just got out of the shower feeling refreshed and relaxed. I guess this reminds me of a fourth or fifth day up on meth when I can't really get spun anymore and doing more just makes I not give a damn and really mellow ;-) Also little bit of mental confusion as with DOB which usually makes me fuck up everything I do.",
  "So this is more euphoric than most other phenetylamines I've tried (exceptions would be 2C-I and 2C-B) but doesn't quite turn me out on overstimulation like STP does at the peak. Still get the 'laughs' a little bit as with any phenetylamine (this is just a silly laugh a lot of people get which I think is a result of overstimulation; I get it with 2C-B, DOB and STP).",
  "It is now time for me to make my moves for the day, so we'll hit the road and see how well this fares as a 'workable high'. I dont look too messed up when I'm on this and unlike DOB, this here allows me to think better and clearer, a very amphetamine-like quality.",
  "Anything even closely resembling a psychedelic experience was gone after the come up and the only thing left was the semi-euphoric stimulation that lasted another 15 hrs before subsiding. I felt quite cracked out on this but not anything as bad a DOB where you ask yourself 'Why did I do this to my brain?' ))).",
  "Now it is T+12:00 and the stimulation is gradually subsiding. Visited my local pharmacy for some clonazepam and took half a tablet equaling 1mg. This provided the synergy I described with DOB. Clonazepam was an unusually deep and emotional experience and felt like 'medicine for the soul' - a very nice way to end the 'trip' and get the nice calm 'afterglow'. Then I smoked a lot of Cannabis and took another 1mg Clonazepam then went to a bar with some girls where I had a beer. So anyways here's the conclusion:",
  "DON is a nice substitute for amphetamine, more economical than meth, which I wanna do more and then more and after that wait 2 minutes and do some more again, all at lower doses. I'd imagine the side effects could get a bit rough at 4.5-5.0mg but I had little to no side effects common to STP and DOB. Could be an awesome party drug for sure.",
  "Peace, be safe ;-)</p>"
 ],
 "year": "2005",
 "id": "40414",
 "gender": "Male",
 "views": "6516",
 "dose": [
  {
   "time": "0",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "DON",
   "form": "(liquid)"
  },
  {
   "time": " T+ 12:00",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 12:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 12:00",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 12:00",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2007-04-26T07:00:00.000Z"
}
