{
 "title": "Sunshine In My Veins",
 "author": "Kutch",
 "citation": " Kutch. \"Sunshine In My Veins: experience with Heroin (ID 40425)\". Erowid.org. Apr 26, 2006. erowid.org/exp/40425",
 "substance": "Heroin",
 "bodyweight": "185 lb",
 "report": "<p>Around here, it's pretty difficult to get heroin in powder form, so most people, seeking simplicity, make the short trip for black tar.</p><p>$20 gets me a .2 gram lump of the sticky brown stuff, and the consitency varies occasionally. Usually, it's just a melted flat lump that sticks to the little baggies, but sometimes, it's sort of hard, and completely opaque. When it's that way (the second way) it usually has more cut.</p><p>At first, I'd only cook up 3/4 of it, but after building up a little tolerance, I started preparing the whole bag.</p><p>I take the lump, and put it in my spoon, and then use a little pipette to drop some clean water over it. Then I use an exacto blade to stir it around a bit, which makes it not stick to the spoon. Then I use a lighter to heat it up from the bottom, which makes the tar diddolve into the water, and boils the water a bit. I keep a bandaid wrapped around the handle so i don't burn my fingers.</p><p>Once the tar is all dissolved in the water, I have a brown liquid with little particles of adulterant (cut) floating around in it.</p><p>I then pinch some cotton off of a cotton ball, roll it up into a small ball with my fingers, and put it in the spoon. It instantly soaks of all of the heroin.</p><p>Next, I stick the needle (I prefer the 1cc 27 gauge allergy needles, but sometimes I use the smaller gauge 1cc insulin ones) against the cotton, and pull up the plunger, which pulls up all the heroin, and none of the cut.</p><p>I tap the barrel with my fingers, which makes all of the air bubbles rise up to the top, then I push up the plunger so there's no more air in the barrel.</p><p>I stick the cap back on the needle, and place it on my lap. Then I take my tourniquet (I use a length of latex tubing, the kind used for hunting slingshots, which you can find at hardware stores) and hold one end with my teeth, wrap it around my arm twice, and stick the other end under my armpit to secure it.</p><p>Then, I pump my arm and make a fist. I take the cap off the needle and hold the barrel firmly with my middlefinger and thumb, near the needle side. I slowly insert the needle into my arm, where I see the vein bulging, at about a 45 degree angle. I then use my index finger to pull out the plunger a little, and if dark red blood slowly flows in the barrel, I know I'm in the vein.</p><p>Then, firmly holding the needle right where it is, I release the tourniquet by moving my arm up a little.</p><p>When the tourniquet is loose, I loosen my fist and slowly use my index finger to shoot about 50% of the solution. I wait for the rush, to make sure everthing is as it should be. Once I know everthing is in order, I shoot the rest. Then I fill the syringe with water and shoot it out a few times to clean it and prevent clogging. I cap the syringe, and put everything back in my little kit.</p><p>Now I can enjoy my high. The rush comes on about 2 seconds after shooting the first 50%, and lasts for about 30 to 45 minutes. Then, theres about 3 or 4 hours of moderately intense high, followed by a low intensity plateau that sometimes last up to 18 hours.</p><p>I rarely put a bandaid on the injection site, but I always clean it after the the hole heals up. I never really shoot in the same week, so I don't really have to worry about rotating, but I still do switch between arms ever time.</p>",
 "year": "2005",
 "id": "40425",
 "gender": "Male",
 "timestamp": "2006-04-26T07:00:00.000Z",
 "views": "36970",
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Heroin"
  }
 ]
}
