{
 "title": "Saved My Life, But Difficult to Quit",
 "author": "Happy Mondays",
 "citation": " Happy Mondays. \"Saved My Life, But Difficult to Quit: experience with Venlafaxine (Effexor) (ID 40457)\". Erowid.org. May 20, 2008. erowid.org/exp/40457",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "200 lb",
 "report": "<p>I began taking Effexor for depression in 1999 and took it until 2003.  After several years of trying to treat my illness with different drugs prior to 1999, it turned out Effexor was the one that really worked.  For a long time it seemed as though this was the perfect prescription for me.  My depression was almost completely gone in a matter of a couple weeks and I was able to get on with my life.  There were side effects, of course, but they were tolerable considering the alternative (debilitating depression).  Mostly I lost my tolerance for alcohol and experienced a marked decrease in sex drive.  The sex was difficult to get used to, actually, but that's another story.</p><p>Then, after 4 1/2 years of taking Effexor almost daily I lost my job.  I quickly found out I could no longer afford the medicine without health insurance, so I involuntarily quit taking it by staggering my doses until I was completely out of the stuff.  The withdrawl symptoms are horrible.  I had experienced a hint of these symptoms a few times when my meds had run out and I had no refill, but this was the first time I didn't have an opportunity to get a prescription at all.  The only thing I can liken it to is taking massive doses of depakote when you don't need it in the first place.  Anyway, here are the withdrawl symptom I experienced:</p><p>*Crying for no reason - deep deep sadness</p><p>*Debilitating dizziness - I could not leave the house for 5 days.  I couldn't walk for 2 days and had to crawl around the house when I had the energy to get out of bed or off the floor</p><p>*Panic attacks</p><p>*Terrible stomach aches</p><p>*Drenching night sweats</p><p>After about a week I came around and I found to my astonishment that the depression the Effexor was prescribed for was virtually gone.  I could still sense a low-grade level of depression (which is still there all the time), but not nearly as bad as before I took Effexor or during the withdrawl symtoms.  It is now almost 2 years later and I can honestly say that this is the scariest drug I have ever encountered because of the real addiction it causes. Sadly, my memory of the those years isn't the best either and I believe the drug has something to with that, although this is just conjecture.  Having said all that, it did help my depression and may be the reason I'm no longer clinically depressed.</p>",
 "year": "2003",
 "id": "40457",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-20T07:00:00.000Z",
 "views": "8969",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 }
}
