{
 "id": 4045,
 "title": "Ostracized State of Existence",
 "date": {
  "submission": "2006-06-19T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Orion's Lover",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "As a 15-year-old, I haven't had a lot of experience with drugs or alcohol.  I researched for about a month the effects of.  Deciding that the benefits of the plant outweighed the potential risks, I told my boyfriend (a regular smoker) that I would be willing to try.  One night, a group of about 10 of us (mostly people that I knew and trusted, although some of the girls I had only met that day), went out into the night at about 1 a.m. and tried to find a private place in the neighborhood to smoke.",
  "It was a cold night, and because I'm pretty comfortable in any temperature, I was wearing just a tank top and shorts, while the rest of our group was wearing long sleeves etc.  This will come into play later.",
  "Although I had attempted to smoke pot from a bowl about two weeks prior, I didn't really know what I was doing - hadn't even used a lighter before - so my frustrated boyfriend had basically given up that time.  This time, as we all sat in a circle outside on a dock by this really pretty pond, everyone was pretty much determined on getting me really stoned.  I still wasn't sure how to use a carb and when to inhale, so although I breathed in from the bowl, I didn't really get any effects, except for the occasional chunk of pot obscuring my windpipe, which, believe me, was not a pleasant experience.",
  "Suddenly, we heard voices and had to get up and run, crouching down and hiding behind bushes, to the middle of a golf course to get away from them.  This was about the scariest event of my life, and I hadn't even gotten high yet.  At this point, I took some smoke into my lungs and inhaled enough to count as a hit, although I didn't feel a whole lot.  I tried again, and I think that was the first time I'd ever truly smoked anything.  I started choking and coughing.  Feeling like I was going to vomit, I shoved my face into the grass.  It felt like I was going to die because I couldn't get enough air into my lungs and everyone kept urgently whispering, 'Don't cough, don't cough!  They'll hear us!'  It was horrible because I knew that if I didn't cough I wouldn't be able to breathe.  Finally the feeling passed and, stupid as I was, I decided to take another hit because I didn't feel anything to speak of.  I took another, to an even worse respiratory effect than the previous, and fell face-first on the cement golfcart trail, convinced that my lungs were going to explode.",
  "At this point I was definitely high, although I hadn't really realized it yet.  Suddenly, I heard the group talking and even though I tried to understand them, I really couldn't.  Still not thinking I was affected, and still with my face smushed into the ground, I kept yelling, 'What are you talking about?  What are you talking about?'  Everybody freaked and put their hands over my mouth, and this is when I realized that something was wrong.  Whenever anybody touched my back or grabbed my hand, I felt like all this pressure was pushing out and my skin was going to just like explode.  So I sat up, trying not to fall, and everyone kept touching me to reassure me and keep me quiet, but the whole time it just felt as if they were trying to pop me like a balloon.",
  "Apparently I made a bunch of entertaining comments that I don't remember, and then as the others started a circle where they inhaled and then blew smoke into each other's mouths (which I really wasn't interested in as I knew I'd had too much at that point), I started wandering off towards a lake.  It was kind of misty that night (or so I recall), and the mist by the pond was like bright neon green.  I was fascinated by the fact that, when I walked into this mist, it just stayed and surrounded me with this beautiful neon green light.  I looked up at the sky and I could see Orion, my favorite constellation, and I just felt totally grounded - not scared, not frustrated, but just totally relaxed and amazed.",
  "I heard the group talking about me, laughing and saying, 'What is she doing?' and I just got this feeling that they didn't understand.  So, because I wanted them to stop talking about me like I couldn't hear them, I walked back and sat with them.  They were talking a lot, and I didn't really listen.  All my focus was on how I was feeling.  Suddenly, this wave of dizzy panic came over me and I kept falling on people, grabbing them and trying not to lose touch with reality.  I couldn't feel any part of my body except for my face and my hands, so I felt like I was kind of floating.  Part of this was definitely due to the pot, but I think a major part of it was also the cold.  When somebody reached out and touched me, they started freaking out, gasping, 'She's so cold, she's like ice, it's like she's dead!'  This scared me so bad and for a second I thought I actually was dead and wondered if I was just dreaming everything.",
  "They forced me to stand up and we walked about a mile back to one guy's house.  It was one of the hardest walks I'd ever taken.  I noticed if I stared up at Orion I seemed to know where I was going and what was going on, but every time someone touched me, either to be affectionate or to lead me in the right direction, I'd lose control again.  I kept saying, 'I CAN'T do more than one thing at one time, when you touch me, I can't focus on walking, it's like, you know how they talk about chewing gum and walking at the same time, and how I can usually do that, but now, in this state, I can't!'  I remember that I was being kind of long-winded, but my explanations were valid.  Nobody would listen to me!  Especially my boyfriend, I know he was trying to be comforting, and he kept saying, 'Don't try to explain it.  Man you're so stoned.  Stop talking, stop talking.'  I got so mad that I just wanted to hit him.  I glared at him and forced him to stop holding my hand or kissing my head; I just honestly couldn't walk and do that at the same time.",
  "After I had pushed him away, one of my new girl friends walked up to me and tried to comfort me.  It was fine and pretty helpful until she touched my back, at which point I pushed her off (and apparently onto the ground, which I don't remember).  I didn't understand why everyone kept touching me when I told them not to.",
  "When we got back to the guy's house, everyone was complaining about how hot the room was and they all climbed into a giant king-sized bed to go to sleep.  My boyfriend took off his shirt (because of the heat), but because I was so confused and because I couldn't feel the temperature, I was convinced that they were all trying to trick me and were planning to have a huge orgy or something like that.  Now, I know they would never do that, but because I didn't know any of them very well and because nobody would stop touching me - innocent though it was - I was frustrated and upset and started crying.",
  "They turned off the lights, which made everything even harder for me to deal with.  Even though everyone else was in the bed, I still honestly thought something horrible was going on, and so I curled up in a corner bawling.  I knew that I was overreacting but at the same time I honestly couldn't control my emotions.  When my boyfriend asked what was wrong, the only way I could explain it was, 'I don't understand.'  He told me that I wasn't supposed to understand and that I should just let go, which at the time seemed like he was trying to take advantage of me although I know better now.",
  "I know this is getting to be a long story so I'll try to wrap it up now.  Everyone else being extremely tired or asleep, I crawled over to the window and sat staring out at the stars, especially Orion.  I don't remember how long I did this, but it was probably about an hour.  I fell asleep for exactly an hour, and when I woke up at like 7, the effects of marijuana had already left for everyone else.  For me, I was at my prime state - happy and relaxed and entertained by everything.  At this point we ate pancakes, and though I didn't feel hungry, I at about 3 times more than I usually would have.  I sobered up at around 10 a.m., although I didn't feel totally like myself until the next day.",
  "Looking back on the experience, I can see a number of mistakes I made.  First, I didn't think about the setting.  If I had been in a warm, comfortable setting, my body would have felt safer and I could have enjoyed the mental effects more.  Also, being in the dark, alone and awake all night only served to confuse and scare me.  I should have done something to entertain myself and draw myself back to the real world.  Secondly, I should have taken more consideration into the people I was with.  Although I felt like I could trust them, since I didn't really know them the trust evaporated when I got stoned, which left me in a miserable situation. ",
  "Finally, I know that I'm a lightweight when it comes to being intoxicated and I still took as much as everyone else.  This was a mistake and I should have waited longer between hits.  All in all, though, the experience was a beneficial one since I know what to expect now.  Next time I'll be better prepared and I'm sure that I'll enjoy it if I have more experiences like the neon green mist and staring at Orion."
 ],
 "erowid": {
  "id": "27648",
  "citation": " Orion's Lover. \"Ostracized State of Existence: experience with Cannabis (ID 27648)\". Erowid.org. Jun 19, 2006. erowid.org/exp/27648",
  "substance": "Cannabis",
  "views": "3795"
 }
}
