{
 "title": "Dipropyl Propulsion",
 "author": "aphelion",
 "citation": " aphelion. \"Dipropyl Propulsion: experience with DPT (ID 40487)\". Erowid.org. Jun 3, 2005. erowid.org/exp/40487",
 "substance": "DPT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "IV",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I am not going to say that I am the first to do DPT via the intravenous route (certainly, for Sasha Shulgin touches briefly on his experience with it in TiHKaL), or necessarily the last.  However,  I think that my I.V. experience with DPT is one of my more courageous psychedelic explorations, and surely a pioneering effort in the area of personal &/or recreational use.</p><p>T=0:00</p><p>On a Friday morning at about 1AM I finally summoned up the courage to try DPT by intravenous injection.  I loaded up about 25mg (a very hefty dose!) into an apparatus with some sterile water and applied a little heat to get the DPT to dissolve, after which I loaded this solution into a 28 guage diabetic syringe.  Saying a little prayer to myself I found a vein and pushed the plunger down slowly.  Within what seemed like an eternity but was more like 5 seconds, I was entering a writhing world of swirly chaos.  Imagine being SLAMMED (literally!) with a hefty dose of LSD & entering the peak almost instantly and you will know what I was experiencing.</p><p>T+:05min</p><p>Suffice to say I managed to pull the needle out of me and set it down, while making an attempt to stumble to the bathroom to check out pupil dialation.  Sure enough they were as huge as saucers.  Everything in my vision was whirling and distorting and pulsing with color and often times it was difficult to tell where one surface started or ended.  I think with anymore of this substance my vision would have been totally obliterated.  When I let my mind go for a second, I started to make out faces in the whorls and patterns around me.  Of course I snapped out of it and realized this was only an illusion.  I couldn't readily distinguish different colours at this point. </p><p>T+:20 or :30min</p><p>At this point I go back and sit at my computer and try to get my bearings which is very difficult to do.  The sounds of the music (Boards of Canada 'Geogaddi') are blending with my visual, touch, taste, and smell processing.  I keep thinking that I am breathing in certain parts of the music or that I am inhaling the various fractaline pattens floating and dancing about me.</p><p>T+:50 or :60min</p><p>Starting to re-enter reality a bit.  I had a feeling that the DPT would wear off much sooner via I.V. than with other usual methods of ingestion.  I try to talk to my friend Charlie through instant messenging, and he is responding with pretty abrupt answers as if he is somewhat disinterested in my experiences.  I start to feel kind of sad and forlorn but this quickly fades away into a state of giggly bliss.  Everything I see on the net seems to be really funny for some reason and I am even enjoying my friends clipt responses.</p><p>T+:120min</p><p>Well I am officially 'down' now with only a slight lingering fatigue of having experienced a really intense peak.  Looking back on the experience I remember having temporary feeling of fear like , 'Oh no! I've really done it this time!' but I assuaged them by noting that my heart rate and breathing were totally normal and I wasn't feeling anything irregular in my body (except the presence of the DPT of course) such as aches or pains.  I did remember that at some points I was having a very strong dissociative feeling, almost like being under the anaesthetic effects of ketamine.</p><p>Conclusion:</p><p>The I.V. administration is something which only seasoned psychedelic explorers should try, and only if they are really comfortable with the I.V. process (using clean needles every time and using sterile water).  The peak comes on VERY fast and is very instense.  I later tried doses of DPT that were a lot less (approx 5-10mg) and had a much more subtle and thoughtful psychedelic experience.  The value of the I.V. route with DPT is that you can titrate exact doses and know immediately what the effects are going to be like.</p><p>Sidenote:</p><p>In my experiences with many of the psychedelic tryptamines, I have noticed that they all seem to carry a very similar overall tone and feeling.  While there is no real replacement for the overall experience of that 1st experience of pure LSD, or making a foray into the woods and gathering your own psylocybin mushrooms, it is my opinion that IV DPT carries very similar physiological effects to other tryptamines.  Being able to titrate exact doses is very appealing to me as a psychedelic explorer and I think that given the choice & availability, I would probably use this method in the future instead of using the less precice route of injesting an unknown dose of psylocybin mushrooms or the even more risky 'street' LSD.  I list these 2 tryptamines because they are the most commonly found tryptamines available to the lay-psychonaut. </p><p>Disclaimer:</p><p>DPT and other psychedelic tryptamines are very powerful compounds and without proper measuring technique, I.V. administration carries a greater margin of error for getting more into your system than you bargained for.</p><p>I recommend that everyone follow the Erowid adage: Know your Body, Know your Mind, Know your Substance, Know your Source.</p><p>-peace</p><p>Paul</p>",
 "year": "2005",
 "id": "40487",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-03T07:00:00.000Z",
 "views": "11175"
}
