{
 "id": 4048,
 "title": "Refreshing Mental Travelling",
 "date": {
  "submission": "2007-10-03T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ELF"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "Took the hit in one lungful while lying in bed.  Blue flame was used to ignite the flaky 10X Salvia divinorum extract in my jade spirit pipe reserved for this use.",
  "'...from here to there, oh okay... heheheh can you do that thing with my eyes again?'",
  "Took some time here trying to figure out how my eyes were being exercised as they were, because it felt so good and I remembered the feeling from prior trips.  The best I could tell, was that when I closed my eyes they were flitting around as they do during REM sleep and the feeling of my eyelashes brushing my face felt funny.  During the experience, I thought my eyes were getting a good cleaning.",
  "Random thoughts overflowed from the workday into my Salvia trip and colored the experience with what seemed to be rather pedstrian concepts, like coworker relations and customer satisfaction.  I got the idea that I could formulate certain questions in my mind and receive an answer from the Salvia.  I think this effect has the been most useful benefit Salvia has offered me so far.  Relevant to my workday and to the topics I was looking over during the beginning of the trip:",
  "'I wonder if she will remain upset?'",
  "The answer came without hesitation:  'only while you continue to be upset with her.'",
  "I felt the answer as much as I 'heard' it, and what's more... I understood it.",
  "'Do I have time to ask more questions?'"
 ],
 "erowid": {
  "id": "27659",
  "citation": " ELF. \"Refreshing Mental Travelling: experience with Salvia divinorum (10x extract) (ID 27659)\". Erowid.org. Oct 3, 2007. erowid.org/exp/27659",
  "substance": "Salvia divinorum (10x extract)",
  "views": "3653"
 }
}
