{
 "id": 4051,
 "title": "How I Got My Life Back",
 "date": {
  "submission": "2006-06-16T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Guani",
  "gender": "Female",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1500"
   },
   "administration": "oral",
   "substance": "Lithium",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "400"
   },
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "daily"
  }
 ],
 "report": [
  "Two years ago I was diagnosed with bipolar disorder--an illness that gives me severe mood swings between depression and psychotic mania.  During my worst episode of mania I thought that I was some kind of apostle.  It was like I had drunk forty cups of coffee and my brain just wouldnt quit.",
  "In November, 2001 I checked into the psychiatric ward for the umpteenth time, and the doctors immediately took me off my antidepressant.  My mania shot right into another deep depression.  I couldnt take an antidepressant because that would send me back into mania.  I was taking an antipsychotic called Risperidone, but that did nothing for my depression.  That was when my doctor decided to put me on lithium.",
  "At first I was on a low doseonly 300 mg.  I wasnt given any instructions as to how to take the medicine so I took it on an empty stomach with a cup of coffee.  I immediately vomited up the lithium, and I continued to throw up the next ten doses after that.  Finally my doctor told me that I should take it with food and milk, and for once I was able to keep it in my stomach.",
  "In the beginning I didnt feel like the lithium was working at all.  The only thing that stopped me from having panic attacks every day was the Benadryl that I used as a sedative. I was also feeling depressed and I thought about going back into the hospital.  Then in December my doctor increased my dose to 300 mg twice a day.  A week later I felt the first effect of the lithium.",
  "Gradually my depression lifted, and I felt some relief from my anxiety attacks.  It was like my mind was a picture coming into focus.  Bit by bit I was getting back into my usual routine: cleaning my room, showering every day, writing in my journal, going to my psychiatric day program  Then I realized that it was the lithium that made all of this possible.",
  "By the end of December I was switched from Risperidone to an antipsychotic called Seroquel.  In January the hallucinations were gone and my mood was getting much more stable.  In June, 2002 my Lithium dose was slowly titrated (increased) to 900 mg in the morning and 600 mg at night.  I noticed the difference in my mood, and I became much more social.  I made friends at my day program and I started producing art again.",
  "I have side effects from the medications, including: sedation, dizziness, dry skin, hair thinning and heart burn.  It took me a while to get used to these side effects, but in the end I decided that it was worth it.  I would rather be tired, losing my hair and forced to eat a special diet if thats what it takes to be happy and live a normal life.  Lithium and Seroquel gave me my life back."
 ],
 "erowid": {
  "id": "27668",
  "citation": " Guani. \"How I Got My Life Back: experience with Lithium & Quetiapine (Seroquel) (ID 27668)\". Erowid.org. Jun 16, 2006. erowid.org/exp/27668",
  "substance": "Lithium & Quetiapine (Seroquel)",
  "views": "25058"
 }
}
