{
 "id": 4053,
 "title": "The Best Visuals I've Seen Yet",
 "date": {
  "submission": "2003-10-19T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pacoloco",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "We dosed at about 3:00 pm on a lazy friday afternoon.  I had never tried this before, so I wasn't quite sure what to expect.  We dissolved it in grain alcohol and mixed that with water.  Me, and 2 of my friends all took our dose and went to hang out for a bit.  We first went to the store to pick up drinks, snacks to have them readily available if need be.  Upon returning from the store, about 20 minutes later, I began to feel a slight tingle in my back.  It was like a warm glow.  We put on a DVD to watch, to make some background noise, and something to watch if need be.  We talked for a bit, then all talking seemed to stop as the movie, which was 'Waking Life'  seemed to become reality.  The moving effects, the leaves in the trees, the floor... everything had this fluid liquid, growing effect to it.  It was at this time we all realized, yes this is working, and man is it nuts.",
  "We went for another walk around the neighborhood, just to take it all in.  It was a psuedo gloomy day, but the sun was just breaking through, so it made it nice.  We wandered around the neighborhood for a bit then took to the streets.  We went on our local subway system to downtown, where we got off in the heart of the city.  When we got off I was peaking pretty hard.  We got on long escalator which is one of the largest in the city, and rode it to the street level.  It was really bizzare.  I watched the stairs before me change from black to white to blue to black again.  There weren't many people around, but those that were had their faces growing and sinking and shifting a lot.  I recall in the subway, watching people get in, and being able to trace their bodies through the walls as they walked from window to window.  I noticed that the effects were very easily controllable.  I could almost instantly turn on or off any sort of visual I wanted.  It was very nice since most other psychadellics I've had I could not do this. ",
  "Upon getting in downtown we wandered around for a bit and came to a park, where we sat and just observed.  There were a lot of scary people, which I had never noticed before in downtown, and I kept getting the feeling that I was being watched, but I'm sure it was just my paranoid conscience.  When we stopped at this park I took a good long look around, and saw everything in colors.  Not really solid colors, but like there were lots of these hidden spotlights that made building have spots of green blue orange and purple... lots of purple.  The trees were growing before my eyes and moving in the nonexistent wind.  I had alread begun to notice the stronger effects wearing off and coming back to normal.  It had been about 4 hours since we dosed.  The sunset wasn't spectacular, but pretty nice given the slightly overcast skies.  It added a nice pink hue to all the clouds which seemed to look like 'Vanilla Skies.'  We tredged home slowly being hindered by bums who were looking for money and cigarettes, also many of whom probably noticed our non sober state and asked if we needed anything, 'ladies, or anything elese' as one put it with no front teeth.  I said no thanks, we had to get home for a movie.  We made it about a mile from our home, after cover about 3/4 of one, and had to stop because we coudln't carry on.  I think I could have made it, but only because I've walked around most of downtown bymyself at about any and every hour of the day and night. ",
  "Someone came and picked us up.  I beagn to notice how I classify people.  I remember reading this in someone elses trip on 2C-I, but it really puts you in tune with people so you can almost see right into their soul.  I noticed simple little things about what people say, how they say it, and the context.  It was weird, cause I had never really thought about it much before.  I just figured I was tripping tho. ",
  "We eventually made it home to where I went to my room and layed down after a long afternoon of obstacles.  To which I noticed I was still very sped up, but barely hallucentaing at all.  So I cleaned my room, which was a very difficult task since I couldn't really tell how clean or dirty many of my clothes were.  Nonetheless I made a great deal of progress and finally came back to baseline.  It was a great afternoon. ",
  "I would definately do that again.  From what I can tell there are no real residual affects at all.  I feel just as normal as I had before the trip.  Sometimes on acid or shrooms I've noticed that I'm a little off for a couple days, but I'd definately say that 2C-I is the most clean trip I've ever had.  I have been known to get 'the fear' after a couple really really bad trips, but this time I was perfectly fine, and I just watched the world blow up around me, while I could keep a clean stream of consciousness in my mind.  Another thing I must note, is that usually while tripping a communication barrier arises.  This is not so with 2C-I.  I could talk and communicate just as fluently as I would have sober.  So all in all, very visual, and very little 'heady' affect."
 ],
 "erowid": {
  "id": "27676",
  "citation": " Pacoloco. \"The Best Visuals I've Seen Yet: experience with 2C-I (ID 27676)\". Erowid.org. Oct 19, 2003. erowid.org/exp/27676",
  "substance": "2C-I",
  "views": "7854"
 }
}
