{
 "id": 4054,
 "title": "Know your Limit...",
 "date": {
  "submission": "2007-12-05T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Stupid metal head",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 oz",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "A few months ago, I realized that teens really need to pace themselfs and know their limits. I had drank hard booze many times before, but this experience has changed that. Im a 17 year old in high school, and got some booze from a friend on a Friday. He has given me a coke bottle filled to the top with 100 proof gin and a 5oz flask of Bacardi 151. my mom was working late, so I figured that night i'd drink a little. I do suffer from depression, and at this time I was on no medication, but I didnt feel depressed that day or week.  i sat at my computer taking gulps out of the gin bottle. I then fell over in the chair I was in because I was headbanging to some music. I got up, laughing, and did it again. I also fell again. the second time I fell, I remember thinking 'holy fuck that hurt...I think I broke a rib...this isn't so fun anymore.' but i got back up. i remember at this point that the bottle was half gone.",
  "I then woke up, rather my memory was working when this happened. I was in the shower with my clothes on and my mom was crying and asking me what i took. i was slurring out 'fuck you I didnt do anything, I didnt take anything, im fine leave me alone.' If I was sober I would have realized that she wasnt going to leave me alone. she helped me to the car and we drove to the hospital, and I experienced every emotion we humans have on the way there. laughing, crying, i could not control myself. I could not walk alone into the hospital, I needed help getting in there. when i got into the hospital bed, my mom pulled out the coke bottle and the flask. she told me they smelled of booze, but had nothing in them. I was in shock, i could not belive i drank that much. I was in the hospital for 8 hours or so, and nursed a 3 day hangover afterwards, while pissing razors from having a tube stuck up my dick and a bruised rib.",
  "I don't tell people not to drink and do drugs, that would make me a hypocrite. I still smoke, drop acid and have a few drinks now and then. but this experience really makes me understand that we teens, the underexperienced, need to know our limit. I had to replace the carpet in my room and gain my parents trust back because I got to drunk to realize when to stop."
 ],
 "erowid": {
  "id": "27677",
  "citation": " Stupid metal head. \"Know your Limit...: experience with Alcohol (ID 27677)\". Erowid.org. Dec 5, 2007. erowid.org/exp/27677",
  "substance": "Alcohol",
  "views": "3138"
 }
}
