{
 "title": "Not As Good As I Hoped",
 "author": "Disappointed",
 "citation": " Disappointed. \"Not As Good As I Hoped: experience with Cocaine (ID 4056)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4056",
 "substance": "Cocaine",
 "bodyweight": "186 lb",
 "report": "<p>Ok, one night I was with a couple friends at their apartment smoking some kind bud. And I guess the topic of doing coke came up (I was later told that I had brought it up). Staci has done it many times before, Shaun only a couple. So anyways, Staci said she would try to get some.</p><p>So the next day I go back to their apartment and they have half an 8-ball. Sixty bucks for a bag that small??!! Jesus H Christ! So anyways, Staci and I do a key bump, while Shaun says he is gonna wait until after he eats. When I snorted the bump, there were like these chunks stuck in my nose. Well anyways, we went to get something to eat, the whole time being very attentive to my body and any changes that might occur (even though it was only a 'key bump'). Nothing really unusual. Maybe a little energetic.</p><p>So we get back to the apartment and after 5 minutes we start doing it. The old 'What am I doing??' thought came to mind but I just blocked it out. We each took turns doing a line every couple minutes or so while we played Street Fighter II on the Playstation.</p><p>Maybe after a couple minutes I felt a little more energetic. I could definitely feel its effects, but it was not like I had heard or had hoped. One annoying thing about doing coke is the nasty bitter taste in the back of your throat. Bad, but not too bad. Tastes like you just chewed up and swallowed an aspirin. After an hour all the coke was gone. Shaun and I kept saying 'What?? This is it?? Definitely overrated.' while Staci was on the phone trying to get more. She said it worked on her good, although one could not tell a difference just by looking at her.</p><p>Either we did not do enough, the stuff we did was not strong enough, or some people just do not get affected as easily, but we eventually ended up going to get more. Shaun and I are very analytical people, always trying to analyze anything and everything while stoned (as I am sure a lot of people do.)I decided not to do anymore because I did not think it would really do anything plus the nasty bitterness in the back of the throat feeling, but eventually ended doing more hoping it WOULD do something. Of course it did no more than keep me alert and somewhat energetic, but that's it.</p><p>I did notice I was getting a little annoyed when Shaun kept scraping the remaining coke into a pile over and over and over )And it is hard for me to get annoyed). I also noticed I did not talk any more than usual, as opposed to Staci and Shaun who were talking constantly about nothing, which also annoyed me. We had some kind bud to do, and I was glad to do it for that is something I could actually feel. It calmed me down and immediately got rid of the anxious feeling I had on coke.</p><p>All in all, I just gotta say coke is definitely not worth it to buy or for that matter do, unless of course it is your first time and you want to see what it is like, and you don't have to pay for it. Who knows? It may be different for you. But if you have heard and seen as much hype as I have on the stuff and eventually do it....you will see for yourself. You might be in for a big let down.</p><p>Of course, like I said before, maybe the stuff we did was not as good as it could have been. But I now see how cocaine can ruin someone's life. It ruins it by making them spend their money over and over again trying to make the damn stuff work!!</p>",
 "year": "2000",
 "id": "4056",
 "gender": "Male",
 "timestamp": "2001-12-25T08:00:00.000Z",
 "views": "9618",
 "dose": [
  {
   "time": "0",
   "amount": "8 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ]
}
