{
 "id": 4062,
 "title": "Erection Stimulant",
 "date": {
  "submission": "2000-10-06T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "S Sorlien",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "750 mg",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "capsule"
  }
 ],
 "report": [
  "My experiences with Yohimbe have all been very positive. I did not use it expecting it to be psychoactive. I learned about it's effect to produce strong erections from a psychiatrist with whom I once worked. He had a patient that he injected with Yohimbine, the active ingredient in the yohimbe bark. The patient reported he had a three hour erection! I can believe that completely. My experimentation with yohimbe has been all positive. I get a little head 'buzz', but nothing I would call a high. What I do get is a guaranteed erection to sexual stimuli in at least 45 minutes from dosage. I have purchsed yohimbe OTC from Twin Lab. The after effects, following sex are continuing energy.",
  "I used 750 mg of bark standardized for 8 mg of yohimbine. Along with a guaranteed erection 45 minutes after dosage, orgasm was guaranteed as well. although it is difficult to hold back once it is on its' way. I am not trying to be provocative, rather I am providing a factual account of the experience. I do not have a problem obtaining erection, but as I age, my 'recycle time' has increased from every day to every other day. Yohimbe cuts that to every day up to three days in a row, then I need a break.",
  "I do not recommend more than one capsule of an OTC product. It may speed you up way too much!  ",
  "As for other psychotropic/psychoactive effects, I experienced none. I have not had any side effects yet."
 ],
 "erowid": {
  "id": "2770",
  "citation": " S Sorlien. \"Erection Stimulant: experience with Yohimbe (ID 2770)\". Erowid.org. Oct 6, 2000. erowid.org/exp/2770",
  "substance": "Yohimbe",
  "views": "29436"
 }
}
