{
 "id": 4063,
 "title": "Soaring Through Realities While Dissolved",
 "date": {
  "submission": "2004-02-06T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SD",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "sublingual",
   "substance": "Lorazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Vitamin C"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "IM",
   "substance": "Ketamine",
   "form": "liquid"
  },
  {
   "time": "1:15",
   "amount": {
    "unit": "mg",
    "quantity": "50",
    "grams": 0.05
   },
   "administration": "IM",
   "substance": "Ketamine",
   "form": "liquid"
  }
 ],
 "report": [
  "Last night, around 1:30 or so, I got ready for my K journey. I had been planning to do it this night all week.",
  "My previous experience with K: 3 other times I had IM'd it (50mg, 70mg, and 70mg +50mg, 1hr apart) I had always gone into an interesting psychedelic mindscape where my life became much more, real feeling (for lack of a better word) but also distorted somewhat. If I closed my eyes I would enter a different world with various visions (not clear visions). This experience wasn't much different but more powerful. I also have experience with salvia, which has some similarities with K.",
  "I had insufflated it quite a few times at lower doses, with drunken/nitrous-like results. I find the IM experience much cleaner feeling, and I find injecting it correctly is less painful than snorting it. The IM journey is shorter lasting but much more desirable and potent for me.",
  "I got together the following:",
  "Empty 20oz bottle",
  "alcohol soaked napkins",
  "small syringe (.5cc)",
  "music",
  "bottle of liquid k (100mg/ml)",
  "Sometime before 2 I was ready to begin my journey. I had to take some deep breaths cause I was shaking a little. Just slightly nervous to do this dose. I took a 1mg ativan sublingual and vitamin c only to hopefully avoid brain damage. William White might not be correct, but I rather not take extra risk.",
  "t+0- inject 50mg into leg, quickly and carefully reload the syringe with 50 more and inject into the other leg. (100mg total) The light fuzzy feeling came on in 3 minutes, gradually at first then strong. I lay down in bed after writing some comments on the computer. Injection painless as usual.",
  "t+10- I turn the music off, like I usually do. It can be distracting and I only use it to relax as the K comes on. I am feeling 'staticy' and lightweight. My coordination is similar to having a few shots of alcohol. I close my eyes and wait for this new reality(-ies) to unfold under my eyes.",
  "t+15-30- I am very far now. 'I' exist in a very different way. I don't currently have any religious beliefs but it is as if my soul only exists as my brain goes through some dramatic changes. I am watching things happen from an observer viewpoint-almost like I (my soul) didn't change at all, just my brain did (if that makes sense). In front of my bed, there is a black hole type gravity forming. I can't see it but feel it, everything in the room including me is spiraling around it and some things are getting sucked in. It felt similar to a 'salvia twist' but more comfortable. I wasn't afraid.",
  "Then I was thrown horizontially across my bed. I floated like I was in a raft in water that got evenly pushed. Then I started to leave my body. I was in my head, and it was as if I got sucked into a space beyond reality which was much too chaotic and complex to ever exist, at least in this dimension. I flew down various multicolored holes as my perception of my body got very odd. Once I was a rectangle shaped thing, and shifted into complex shapes. I landed in a 'basement' like place of some weird reality. Here things get very unclear but I do remember it was colorful and entities were there, whether they were a part of my head or not. Jack Nicholson was there and he seemed to be guiding me through parts of this 'psychedelic basement reality' for a minute or 2. (I recently watched Anger Management a few times,hehe.) There were other 'things' though that weren't human and one in particular was communicating to me through nonverbal ways. He wasn't negative, but not positive. I dont remember what it intended, but I remember seeing a green thing, with pseudopods and eyes, well its pointless to try and describe well because it was so odd and complex.",
  "I am sure there were many other entities but this was the most intense part of the experience and its hard to recall. One time I see hell from a distance and see bright red and demons, but I know it is fake and I almost laugh, I think something like 'oh look, this is where some people can have bad K trips', the idea seeming absurd as to how one could have a bad time with K. But most of this intense part of the journey I don't immediately recall doing a drug.",
  "t+30- I keep coming from the hole (different realities) to my bed. One minute I would be laying in bed wondering if I should attempt to get up and type some of this stuff. The next second I would be back down the hole exploring and forget that I was in bed.",
  "t+55- I finally could crawl to the edge of my bed and layed where the computer was. It was very hard to type, and I still wasnt quite there on my bed. As I was trying to type some ideas and experience descriptions, I appeared laying on the ground where I work, the computer came with me. I sort of laughed at this, but it was nothing odd because of where I been. K makes me have to urinate badly, and since I can't walk to the bathroom which is quite a journey, I go in the empty bottle I planned to use for that purpose. I filled it clear up (k can easily cause dehydration), luckily I didn't spill any.",
  "Here is exact text from the journal at this time.>(x)______________________",
  "fuck. uh hey fr >(fr means future me)(2:3?am)",
  "jack nicholson was there I think, haha. some k hole. there was a few hooles an di -kab to keep it thisway)?) >(I dont understand that)",
  "world sideways. damn. cant focus, eyes arent working well they are now.",
  "what should I do?ots / some of this typing an",
  "I am gonna do 50u more. maybe. but now I am on k extreme. like almost out of body/ is it good? yes vey uniwue",
  "235 I am distorted. well I ccant tyoe too much,heh I'll leave that.",
  "I think 50 more would be delightful! Nah,it might get even weirder. so. lets go........",
  "whatever gives u pleasiure is worth living for. that was in a partial k hole with jack. ha. haha. well I feel fuzzy, a little bit psychedelic and floaty. wow I am still fucked up it comes in cycles, gotta watch out for them. right now I feel like I am >(on the ground where I work)",
  ">(5-10mins later)240 am stuck here, lifei s ours we live it our way, the screen is floating away, my brain has so many powers.",
  "eh 242 I kind of sobered up but that's an >(over)_____________________________",
  "t+1:10(70mins)- I am coming down. I am no longer travelling. I am in my bed pretty solidly. I type ideas and such. Some didn't make sense and some did. I appeared to have had a hard time typing. I wanted to return to that out of body world. I think about it some, then decide to go for it...",
  "t+1:15 (t+0#2) I am still slightly dissociated but I very slowly and carefully draw up 50mg more, sterilize the site, and in it goes, no problem.",
  "t+5-10#2-I lay back down in bed and rapidly (just a minute or 2 from fuzzy feeling to out of body) return to the K hole, it was as strong as the last one or maybe more so. I remember colors and constantly changing realities, and a neutral robotic voice speaking to me (I don't know what it said). My last entry which was a few minutes after this 50mg injection: (bye reality, I will probably lay down and dream for a while. which I did after the first k hole which right now I barely remember at all. my mind is full of happy weird radioactive fuzz.)",
  "9am (7 hours after first injection)- I suddenly wake up. My brain feels damaged like I had alcohol poisoning the night before, but I don't have a hangover as bad as that. I feel fuzzy and dehydrated. Unfortunately I didn't wake up to reality after the second k hole until this point, so that I could type what happened. The memory is very faint.",
  "Overall thoughts: I like the uniqueness of K. I see how people get addicted to it because it is such a profound and almost magical escape from reality, which has never remotely scared me like other psychedelics can. I have done it the last 3 weekends (my use is once a week since I got it) and I wonder if this would cause tolerance. I was expecting complete ego loss with 100mg, I got much of it removed but not all. My conscious state was similar to dreaming but much more aware and distant. At the times when I became a rectangle (merged with them or into them) and other 'spaces' 'I' didn't exist in the same way but if I would have opened my eyes I would have 'waken up' from that odd reality (with a very distorted glance of the room). Keep your eyes shut if you plan to do a beyond-recreational dose, and I recommend music only for the first 10mins. Distractions will keep you from travelling far.",
  "I was trying to find god (I don't believe but want to), because on the last journey I could almost feel him. But the trip was much more, in me than out. K is a trip inside, and in contrast I think classic psychedelics like lsd and mushrooms are more outer. But inside can be so much more amazing and unearthly than one can imagine."
 ],
 "erowid": {
  "id": "27705",
  "citation": " SD. \"Soaring Through Realities While Dissolved: experience with Ketamine (ID 27705)\". Erowid.org. Feb 6, 2004. erowid.org/exp/27705",
  "substance": "Ketamine",
  "views": "9003"
 }
}
