{
 "title": "Hard Trip",
 "author": "EugeneOregon",
 "citation": " EugeneOregon. \"Hard Trip: experience with LSD (ID 40651)\". Erowid.org. Nov 6, 2007. erowid.org/exp/40651",
 "substance": "LSD",
 "bodyweight": "160 lb",
 "report": "<p>The following account was my second trip on acid.  Since then I have tripped 2 more times, with results very different from this.</p><p>A friend had put hits of LSD on smarties, and I started out at around 7 by eating 6 of them.  An hour later, I was starting to feel the effects, and it was quite different from the first time I had tried it.  I then decided that I should smoke some marijuana, so I took around 3 rips from a bong.  Those hit me very hard, and the visuals began immediately.  I was at the Willamette River in Eugene, and I was seeing the coolest shapes under the water.  It was if I could see the bottom of the river no matter how deep it was.  Added to this were the dragons and serpants that I could see in the rock formations.  These visuals were much more clear than anything I have gotten from mushrooms.  I was transfixed by this sight until my friends told me it was time to go back.  On the walk back, my mind was taking me in and out of reality.  I then took 4 and a half more hits (half because that was the end of the vial).  Within the next hour or so, my mind started to go crazy.  I had some more very intense visuals looking at some CD covers.  That is basically all I did durring the intense visuals.  About 3 hours after my visuals started, I was able to distinguish (or thought I could distinguish)what was real and what the acid was causing me to see.  That was when I started listening to music.</p><p>The kind of music I listen to during a trip is very important.  With the wrong kind of music, I can cause a good trip to go bad.  I am a fan of Radiohead, so I started listening to their music, but it was  too intense for me to handle.  However, one of my friends was at the computer comtrolling the music, so I was unable to switch the music.  I wanted to ask him to change the music, but I could not operate my body correctly.  I could not speak audibly to get him to change the band.  For the next 30 minutes or so, the music ruled my life.  It controlled my thoughts, so I felt depressed the entire time.  Almost unbearably depressed.</p><p>Then 'Friend of the Devil' by the Greatful Dead was played, and my trip immediately turned great.  I thought happy thoughts (because the music is so upbeat) and I started to dance involuntarily.  I swayed with the music without a care in the world.  The visual mode of iTunes also played a key role during my trip.  My mind was so active, that even a simple color fading on and off of the screen seemed to convey the deepest desires of my soul.  I srongly recommend the visual option on iTunes to anybody on any psychodelic.</p><p>I tried going to sleep at around 3 o'clock AM, but I was still tripping to hard.  Whenever I closed my eyes, colors and shapes flew past in front of me, making sleep impossible.  This was when the trip started heading in a bad direction.  My thoughts were fixated on negative aspects of myself, and that was all I could think about.  I was by myself, and there was nothing I could do to change my thought process.  I tried watching TV, but had to turn it off as soon as I turned it on because I couldn't handle all of the moving pictures anymore.  Music also seemed a bit too intensae, so I layed down on my bed quietly for about 30 minutes, at which point I took a longboard outside (at around 5 AM) and somehow got to the top of a very gradual slope that led straight back to my room (I have no recolllection of how I got there).  I stood on the longboard and cpmpletely zoned out, and about 30 minutes later, I was back in my room (I don't remember much of the ride either).  After that, I was able to go to sleep, but some effects, such as an overactive mind and inability to concentrate, stayed with me for a couple of days.</p><p>This account may sound too intense for some.  Not all trips cause me to think negatively for extended periods of time.  In fact, recently I took 5 hits of slightly less diluted LSD, and had the greatest day of my life.  LSD can be a bit overwhelming for me, but most of the time it is quite enjoyable.</p><p>In a side note, when taking LSD, I find it to be a good idea to make sure I am around people i know and trust, or i get very self-concious about my state of mind.</p>",
 "year": "2005",
 "id": "40651",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-06T08:00:00.000Z",
 "views": "3120",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "6 hits",
   "administration": "oral",
   "substance": "LSD"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "2": {
   "time": " T+ 2:00",
   "amount": "4.5 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 }
}
