{
 "title": "Sucked Down a Rabbit Hole",
 "author": "Jessica",
 "citation": " Jessica. \"Sucked Down a Rabbit Hole: experience with Mushrooms (ID 40679)\". Erowid.org. Jul 4, 2007. erowid.org/exp/40679",
 "substance": "Mushrooms",
 "bodyweight": "122 lb",
 "header": [
  "DOSE:",
  "6.0 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>The mushrooms kicked in about an hour after my friend and I ingested them. The intensity of the onset seemed to possibly be exaccerbated by a lychee berry elixer I purchased from a local chinese medicine store. We walked in a clothing shop and I told my friend: 'It feels like I just put on my pajamas and now I'm walking into a breakfast party'. She gave me a wierd look in response. Next thing I knew, I was staring at the ocean about a mile away from the store with barely ANY recollection of how I got there. I stared in amazement as it stripped itself of all former shadows and came forth like a story book jumping into a childs' lap and opening. The colors were opalescent, shimmery, ancient and of-the-future simultaneously. A huge boat with a gleaming eye on its' mast sat centerfold.</p><p>It was then that the sun became a kaleidescope full of hearts, stars, psychedelic motifs, etc and enveloped the sea and the grass entirely. Music came in the form of waves that were now absent from the skyline. Unfortunately this was also BEFORE we reached the beach. We were at a park, on a CLIFF no less, overlooking the ocean, when I started MELTING. It shouldn't have been a surprise, as I could feel it earlier. It began as a serpent in my lower stomach, then a washing of waters, like a washing machine without clothes. I suddenly became aware that I was about to be lifted by an intergalactic silver force produced by demons and angels that were having sex inside my organs, rocking me into a womb coma and then catapulting their excretory organs out into a strange time space fabric. I was pulled out of my body and began falling into a hole, much like an 'Alice In Wonderland' rabbit hole if the rabbit hole consisted of a hollow tree with eyes, focal points where I could direct awareness and thereby project my astral body into scenes of past dreams, past lifes, other peoples' minds.</p><p>Luckily a sober friend rescued us from going completely insane in public. On the car ride home, I was propelled into scenes of all kinds of suffering. Somehow I was experiencing many scenes at once, existing in multiple dimensions is the closest thing I can come to describing the feeling. Homeless people on the street became gnomes and devils, ordinary strangers walking along became circus freaks. All the while, there was a pressing question going on inside my brain, perhaps the voice of the mushroom that kept trying to guide me throughout this strage ordeal. It said (and I'm not just talking about intuitive voices popping into your head, I'm talking absolutely auditory- actually there)</p><p>'Are you in for this entirely? '</p><p>My fear of falling, my fear of forgetting, all fears of losing came to the surface. At this point I began experiencing what I can liken to a full body oragasm but mainly in my brain. Such intense pleasure in my brain. Hard to fathom if it were not a first hand experience, a force so powerful shot out of the very top of my head, releasing all the stagnation previous neurological conditions seemed to have been causing.</p><p>I gave into the drug and fell into blackness, literally passed out on my bed. This was when I knew I was dead (as in deceased, not fucked for taking such a high dose). At first, I was extremely fearful. I traveled to past scenes, past dreams and sometimes it seemed like other people's dreams, to find out where I died and how. I saw scenes of death around the world and realized that my fear was not that I was dead but that I was in a hospital being kept alive, being tortured. I felt that it was extremely wrong to keep people past their time, that they would become lost, fall down a whirling black rabbit hole where parallel universes collide and astral bodies can have godly knowledge without possession or place (just as I did). I searched many hospitals, coming to the conclusion that this was not the case, I was not being kept alive in one of these torture palaces, I accepted death. It came in the form of utter darkness. And then a tree and vivid jewel tones that seemed to be incubating me. I was in a womb tomb.</p><p>Immediately I understood how certain monks/yogis can go without food or drink for long periods of time. In death, I felt filled, not needing ANYTHING AT ALL, forever. Death was a mixture of awake and of sleep, slightly like an opiate intoxication but with no anticipation of time and therefore no thoughts of it ending. Waiting without anticipation, thats all it was.</p><p>I cant remember much more for a while, but what I do know is that I didnt want to leave. However the mushroom set out to show me otherwise. I began feeling such intense pleasure that it became pain so awful that I couldn't scream, I couldnt relate on the surface. A huge wave smashed me into the sand, and instead of relief, I was pushed under the grains into another sky, sucked into another ocean and smashed into another sand and so forth. At this point I was able to sense the surface world slightly, but any movement or sound would send me into another trip, some terrifying, some beautiful.</p><p>Throughout this next part of the trip other altered states of consciousness occured: 1. Remembering, hearing, thinking and speaking became the same things. This resulted in a high level of paranoia. I would not believe my friend when she kept repeating: 'Its ok, we just took a drug.' because every thought I was thinking was manifesting itself infintiyfold cross-dimensional and some how I was existing in all of these mirror-facing-mirror thoughts, I was CONVINCED that we had never taken anything, that it was just another dream/thought/voice/myself/god. EVERYTHING WAS EVERYTHING there is no exaggeration here when I say I had lost all contact with reality because everything carried the same mass. It all weighed the same and I was weightless. How does a weightless person decipher which box is full of truth when a box full of lies is exactly the same worth?</p><p>2. I was able to consciously astral project. A few places I remember going were a) The Amazon. I was surrounded by shamans and wise women chanting my name, saying 'Come back home Jessica, come back, come back...' b) Some other planet. Now this is very vague but I do remember some kind of alien communication. c) There was also a feeling that I went inside the earth. It was inhabited by other creatures, but I can't be sure if this was merely a thought, a full body hallucination, or an actual astral transportation.</p><p>However those details were not nearly important in my mind as the interphase, as I would call it. I woke up. Not in the ordinary sense, I did not wake up in my previous surface reality. I woke up in a rain drop clock. This, friends, is not a metaphor. It was not a hallucination. This was a FEELING. As in 'I feel hot, I feel cold.' I FELT as though I was waking up in a rain drop clock. My best friend was the only other being inside the clock. It was a pendulum clock we were incapsulated inside, and 'drip drip drip' was the back ground noise. She was asleep, and I was awake inside something that we had both created, she was still dreaming it as though it were a dream, reading it as if it were a book to be read and I had successfully entered inside of it.</p><p>I opened my eyes and then realized that they were actually closed. I was seeing through one eye, slightly below the middle of my forehead. Although contrary to its placement, I was able to see (with my bodily eyes closed) a full 360 around me. I could hear her thoughts echo inside the raindrop, as if we were both in the same brain. This is where I was physically/astrally existing, then this is what my mind did: I wanted to be able to better navigate my thoughts, so I created a two story house that seemed somewhat one dimensional. In order to visit different thoughts, I simply walked to different rooms of the house.</p><p>Then my friend woke up. All barriers of communication were broken down. There was a sense of 'Where are we?' and we could communicate by hallucinations, we were inside this tear drop palace and nobody was awake except us. We were yogic breathing in the same time and measure somehow, although neither of us is trained in the ability nor has achieved it through unassisted yoga/kundalini previously.</p><p>I wanted to listen to her, I felt absolute empathy and oneness. However she said, or I felt/remembered/spoke/heard, 'I'm still dreaming.' This was when I was sucked back in the time warp. I developed a mild Korsekov's (sp?) syndrome (as in the movie 'Memento', when you cannot remember anything minutes/seconds after it happens) and somehow became the main (male) character of the film: 'Eternal Sunshine for the Spotless Mind'. It was terrifying beyond belief. I fully experienced that movie. Running through childhood scenes, dreams, trying to remember, trying to figure out loopholes so I could carry a bit of myself with me, across dreams/dimensions/realities. I think that this was perhaps me trying to keep the little bit of my ego that rebuilt craftily when no one was looking after the blackout/death/rebirth experience.</p><p>I was running, running, running and being swallowed and spit out. I had lost control, I was no longer directing my awareness into the tree eyes and visiting the places where I wanted to visit. I came to heaven at one point, screaming, frightened. I asked, and Terence Mckenna answered, 'Where is the antidote?' He seemed very relaxed, and told me that I had to work though it before I could wake up in the right place. Just like I previously revisited death scenes to find out where I died, I was now rushing through life scenes trying to find a safe place to wake up in where nobody could wipe my memories clean. I was sucked out of heaven.</p><p>I slept and there were dreams of panthers, schizophrenics, homeless women making up sympathetic lies in order to get money, swapping children for speedy drugs. 'I finally have my own dreams' , and 'So thats all death is: just rebirth' are a few of the things that I apparently said.</p><p>The trip did not end there. It in fact kept getting stranger. I was somehow back in the bed with my friend, when I became convinced that I was in fact, God. I started moving objects, twisting my body around, contorting, astral projecting around my room, etc. Although no one was there to witness if objects were flying about, my friend, without me telling her anything about my trip, told me that she had the feeling we were both stretched out with all our limbs yet somehow laying next to each other in my twin bed. At the same time I was melting into the wall, contorting my body, etc.</p><p>In this state, I possessed real or hallucinogenic telekinesis. However a bit later, when we both somehow crawled to the (locked, thankfully) door and tried to open it, we could not. Before we attempted, we spoke to each other 'It doesnt matter if it's locked, we can open it' and then after the attempt 'Ohhhh so that's it, you need a key.' Somehow this was EXTREMELY profound, at the time.</p><p>Back in bed, I began what I think was the comedown and it was awful. I became extremely depressed, feeling that I would never wake up and return to the surface, that things would never be the same. I began missing people. I saw myself and another projected across my walls and in the wood workings of my bed in old movie-flickering-light, black and white style, making love.</p><p>I cannot began to explain the intense sadness at knowing (as I was convinced) that I would never see this person again. I tried to comfort myself by reading books off my shelf, somehow I was able to read them, or my astral body was, within minutes. I tried to go back to the womb, tried to enter the tear palace again, but I couldn't. I was haunted by movie projections that were the past, that were ghosts, that were entities with position but no energy, or with energy but no position.</p><p>'Sliding doors, sliding doors, remembering, click, listening, thinking' (I was babbling).</p><p>I began to come out of it. I 'awoke' eating a lime skin. Why or how, I do not know. My VCR was spewing musical curses, flickering with firefly light, 'Ommmmmmmm' It said. My friend was speaking in tongues, or making up words, which we were both doing earlier.</p><p>'Everything is made of language' I told her.</p><p>'Get the bible' I yelled, when in reality I was refering to 'The Archaic Revival', which she found out later when I became more intelligible. My heating pad formerly on my bed was ripped out of the wall but still remained on, the light still glowed.</p><p>'I finally understand schizos! I finally understand retards' I told her.</p><p>The flood gates were still open, and I was way past tired of this. My last halluciniation came in the form of being inside a scooby doo episode. You know those treasure chests/vaults that scooby accidentally opens in search of a scooby snack and unleashes all the otherwordly creatures? I had to transport myself into the end of an episode and close the vault. I could feel my body rising to the surface, as with all my force I pushed the doors closed.</p><p>I felt like Odyssius returning from his 20 year long journey. I felt like an Amazonian hunter boy returning to the village after a week long initiation retreat. I lay in bed reading, trying to remember what had happened. One thing that I left out in this play by play happened somewhere in the middle of the trip. I was able to heal myself and others, or so I believed. I pressed my hands against a scar and it went down. I went inside my brain and healed, filled in the lacunar infarcts from migraine seizures, made myself whole again.</p><p>Although my friend's trip was less intense, it was also longer. I (how????) ate ten granola bars while waiting for her to wake up. Thousands of years had been fitting inside of minutes, and therefore I suppose I was extremely hungry. They were also comforting. I was chewing on them as an infant would suck a passifyer, in place of the real thing. It was surprising how soon I returned to normal, or at least 'functioning'. How soon I was able to discern reality from 'illusion'. The next day I had brain ache, fevers, extreme despondency, yet tinged with (hope?).</p><p>Overall this experience was probably the highlight of my life. I have a few years of experience with various psychedelics, but this is my first 'initiation' experience. As horrible as it was- and I'm sure if you have taken such a large dose you will know the hell and suffering that you become vulnerable to- I have kind of come to the conclusion that if you don't feel as if you have taken too much going into it, you haven't taken enough. I know this is the feeling of many experienced psychonauts but I was fairly skeptical until this past trip. Next adventure: Ayahuasca.</p>",
 "year": "2005",
 "id": "40679",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-07-04T07:00:00.000Z",
 "views": "3295",
 "dose": {}
}
