{
 "title": "Saved My Ass",
 "author": "Juan",
 "citation": " Juan. \"Saved My Ass: experience with Bupropion (Wellbutrin) (ID 40697)\". Erowid.org. Jan 1, 2011. erowid.org/exp/40697",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "180 lb",
 "report": "<p>I'd been depressed after a somewhat painful relationship thankfully ended. Anyway, a few months had passed and I still wasn't feeling any better. I was really sick. I'd suffered bouts of depression in the past and was just over it. I told my therapist to dose me. I'd done some research and had come to the conclusion that I did not want to take an SSRI, like Prozac, they kill woodies. No thanks. I really didn't know what to expect with the Wellbutrin.</p><p>I'd been told that it may take up to week for me to feel anything. That was clearly not the case with me. About a half an hour after taking 150mgs in the morning I could feel the stuff working, and how. It felt really good, I was focused and alert yet tranquil and very much in control of my emotions. It took the edge off for sure. I was able to get through my day with a smile instead of a scowl; a welcome change.</p><p>Side effects: The first two weeks I had lower intestinal cramps. Third week I had head aches. Both of those symptoms have since passed. My biggest problem with it now is fitful sleep with disturbingly vivid dreams. Sometimes it doesn't even feel like I'm sleeping, although I guess I am.</p><p>One more thing on the positive side is that it seems to have greatly enhanced my sex drive and seems to have hightend the pleasurable senstations of sex, even if it's just whacking off. This may be directly related to the drug itself, or it could also be because it pretty much got rid of my depression. Maybe a combintaion of the two, I'm not sure.</p>",
 "year": "2005",
 "id": "40697",
 "gender": "Male",
 "timestamp": "2011-01-01T08:00:00.000Z",
 "views": "9797",
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  }
 ]
}
