{
 "id": 4070,
 "title": "Ultimate Death",
 "date": {
  "submission": "2005-10-05T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Human",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Moclobemide",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:30",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>It was a sunny saturday in the end of april -03. I had been looking forward to the trip, was eager and expectant, yet calm and untroubled. Me and a friend, both experienced with LSD and such, tripped. A friend was sitting us and smoking pot. We ate the MAO-inhibitors half an hour prior, then settled to a sunny field with a spacious view, and took the psychedelics by nose. Our mood was positive as waiting for the effects.",
  "It was the first really warm and sunny spring day, snow had just melted away. I became acutely aware of the bird singing nearby. The moment gathered. Everything seemed perfect. I became aware of a formless kind of agitation. I tried to subdue this, making it worse. Holding my head, I stared at the field trying to cope with it. Staring at the dead, dry, bonelike crops didn't help either. I felt a strong mental nausea. Time proceeded slowly. I got stripped from all mental defences and perspectives. The moment was eternal, definite. And I was losing everything. Naturally, I clinged to the last comforting thought: The Life itself, the Existence.",
  "My mind swell. I obtained perfect, godly understanding. My ego became a terminal where all worldly qualities united in perfect harmony, countered each other and ceased to exist. In desperation, I yearned for the unknown that would escape the embrace and survive. I engaged them all. The Omega consciousness.",
  "The sitter asked if I felt bad. I said yes, but that it would pass. A second later, I felt the opposite. Even though I was aware that I had taken the drugs, It hit me that this most powerful trip had somehow pushed my mind over the edge, caused an opening of a Pandora's box which would destroy the Universe, instantly and utterly. I didn't mourn my own death, I mourned it all. The meaning of my life revealed itself to be the destruction of all I'd learned. The World was in my head, and it was doomed. Looking around, my friend tripper was on the ground, pushing through orgastic twists. The sitter observed, 'He's fighting'. I well knew he struggled against the end, but I couldn't say anything, that could make it worse.",
  "I fought too, losing all the time. The shame, the agony was most excruciating. I tried to see, if there was something, whatever, to be after this accident. I knew by heart, there was going to be none. The possibility of any existence was about to be extinguished. Return to the time before creation, with the creator snuffed out. Eternal nothingness descended.",
  "As a final compassionate attempt, I concentrated on a personal mental suicide to neutralize the process. It was too late, and more: The final step in Me becoming Death. The physical feelings took hold. I dried out, life escaping, beheld my hands withering. The world blackened. With scorn, I perceived these hallucinations would be the final observations of the reality plunged into oblivion.",
  "There was a blackout. I remember, feeling terribly ill, staggering to my feet and asking for vitamin C to down the trip. Sitter handed me juice, which I drank and soon threw up.",
  "After this, I realised the persisting existence around me. The infinite possibilities of life. The energy of observation streamed through my hollowed body, praising words bubbling from my throat and causing smiles in my mates. The following couple of hours would be a child-like ecstatic rambling in the forests, our sitter shepharding us. My friend had an astral journey of many levels and delights, with death just as a passing portal through uncontrollable hallucinations. He never observed my pain in the start, but valued my joy in the end part.",
  "Coming down in 3-5 hours, I realized my sad inability to die alone, having to pull the whole understanding of everything I love with me. This experience has made my previously death-romantic mind afraid of the phenomenon, and given a profound and persisting love for any life.</p>"
 ],
 "erowid": {
  "id": "27722",
  "citation": " Human. \"Ultimate Death: experience with 5-MeO-DMT & Moclobemide (ID 27722)\". Erowid.org. Oct 5, 2005. erowid.org/exp/27722",
  "substance": "5-MeO-DMT & Moclobemide",
  "views": "12234"
 }
}
