{
 "id": 4071,
 "title": "Needed to Be With People...",
 "date": {
  "submission": "2003-10-20T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sadie85",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 ],
 "report": [
  "Setting: Typical weekend in college, yet this one included E.  One of my best friends tells me that he can get a few pills of E for me, him and two of my other friends.  None of us (besides him) had ever done it before. ",
  "He shows up at the party with four tiny white pills and I remember thinking to myself that there can't be much harm in these tiny little things.  Unfortunately, I did absolutely NO research prior to taking the MDMA and had no idea what to expect.  Only after I dropped the pill did I ask what was going to happen to me.  First Big Mistake.  I was told only the good things and was under the impression that it was going to be slow gradual high.  Second Big Mistake.",
  "(T-0:00)K, C, K and I take our pills and head downstairs to watch a beer pong tournament. ",
  "(T-0:30) I stand watching the beer pong waiting for the E to take effect, I blink, and all of a sudden feel as if I'm floating.  I look up to see about 7 balls flying through the air, when in reality there was only one. I look around at my friends and say 'holy shit' and it hadn't hit anyone else but me.  C looks at me and says what's wrong with your eyes?  I reply with 'What do you mean?' and continue to go find a mirror.  There was absolutely no brown in my eyes anymore, they were completely black.",
  "(T-0:45) We all go outside (which I don't remember leaving the party) and people are all out there taking pictures.  Someone snaps a picture of me and I proceeded to projectile vomit across the front yard.  At that point everyone know that I was on something, and proceeded to remove me away from K,C, and K, which was probably the worst thing they could have done.  I was standing here with 5 sober people telling me to relax and I just kept telling them 'you need to let me be with my friends that feel the same way as I do' and no one would let me be with them. ",
  "(T-1:15) Finally I calm down and a complete state of Euphoria sets in.  I walk upstairs to find K,C and K dancing on a bed with lollipops and it's the most beautiful sight I've ever seen.  At that moment I knew I was in for the best night of my life, and I was right.",
  "(T-2:00) We decide to go down to the bars and see what the scene is like there.  The light breeze blowing on my skin on the walk there is like heaven.  When we finally get the bar, everything is brighter, happier, right with the world.  People walk by and graze my arm and send chills throughout my entire body.  There's no way it can get any better than this.  I stand up on a platform, dance, watch people, and dance some more.  The connection I feel with my 3 friends who took the E with me is unbelievable.  We just keep hugging and rubbing eachother and saying how much we love each other and how happy we are to be able to share this amazing feeling. ",
  "(T-3:30) After several bottles of water and tootsie pops, we decide to leave the bar and take a walk with some Newports.  The extreme feeling of calm I am sensing is impossible to put into words.  Everything just seems so clear and I don't want this feeling to end.  Ever. ",
  "(T-4:45) We all go back to my house and lay on the couches as we feel like we're 'coming down'.  Tingles go throught me as I start smelling something like it's right under my nose.  The smell of oranges and cigarettes together is overwhelming to me.  I keep asking everyone, 'do you guys smell that?' and no one else does.  Finally the suspense is killing me, I have to find the source of this strange odor.  After walking through my entire house, in the spare bedroom (which is three rooms away from where we were laying), I find a plastic cup with orange peels and cigarette ashes in it.  My senses were so acute, I could smell this as if it were directly in front of me. ",
  "(T-5:00)We lay there until the sun rises, talking, laughing, sharing stories about the night.  To this day I've never felt more of a connection with people, and probably never will.  There's something about sharing a roll with all 'first timers' that can never be duplicated.   ",
  "-Other than the messy beginning of the roll (which I think would have been fine if I could have been with my friends that were feeling the same way), it was the most amazing experience of my life, and led to many more.  My only regret is that I didn't educate myself more prior to taking the E. ",
  "Bottom Line: Do your research and enjoy yourself.  It's worth it."
 ],
 "erowid": {
  "id": "27729",
  "citation": " Sadie85. \"Needed to Be With People...: experience with Ecstasy (ID 27729)\". Erowid.org. Oct 20, 2003. erowid.org/exp/27729",
  "substance": "Ecstasy",
  "views": "9268"
 }
}
