{
 "title": "Incredibly Strange Thoughts",
 "author": "DJ Devin",
 "citation": " DJ Devin. \"Incredibly Strange Thoughts: experience with 2C-B & Cannabis (ID 40738)\". Erowid.org. Aug 24, 2005. erowid.org/exp/40738",
 "substance": "2C-B & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  "DOSE: T+ 0:00",
  "30 mg",
  "oral",
  "2C-B",
  "",
  " T+ 2:00",
  "4 hits",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Having enjoyed 24 mg of 2C-B a few weeks earlier, I decided to step the dose up to 30 mg.  The effects started after about 30 to 45 minutes, and they were quite awesome.  The main effect was a kind of pleasant heaviness, and some funky visual effects.  If I stared at myself in the mirror, my appearance would start to change...I'd acquire different tints, my veins would begin to show, and things would be different generally.  However, it wasn't too overpowering; I could 'snap out of it' and act normal if necessary.  Physically and sensually I felt good, but mentally I felt surprisingly clear-headed; definitely euphoric, and thinking a bit weirdly, but otherwise coherent and capable of conversing.</p><p>After about two hours, I was definitely having a good time (30 mg is a pretty nice dose for me) but I decided to augment the experience with some cannabis.  Cannabis always causes interesting thought patterns in me, so I thought it might nicely complement the physical and sensory aspects of the 2C-B.  Not having read any experiences of this particular combination, I was curious to see what would happen.  I used a vaporizer to inhale about four pretty large hits.</p><p>After about ten minutes, everything went nuts and a truly fantastic psychedelic experience started.  Other than Salvia divinorum and the awesome LSD + Nitrous Oxide combination, this was the strongest psychedelic experience I've had.  I'd classify it as roughly as strong as 20X Salvia divinorum about five or ten minutes after the peak.  It is very hard to describe, but basically I was thinking a bunch of thoughts which were really not coherent ideas, but a combination of sounds remembered vaguely from my childhood, shapes, colors, facial expressions, and ideas.  These thoughts seemed to be rotating in a kind of cycle that I experienced as a physical circle.  So, one thought would be a kind of self-righteous smile, plus the emotion of 'confidently explaining something', plus a comic figure from the 1970's smiling, plus the color red, plus some syllables that didn't make sense.  Another would be my third-grade English teacher saying 'right', combined with the color yellow, combined with I don't know what.  These thoughts were very intense and I was curled up in the fetal position for about an hour.  The physical sensations were also very strong...my body was definitely tingling all over and feeling funny.</p><p>It was weird, but very fun and interesting.  I didn't actually lose touch with reality - I could converse if necessary, and even successfully got up and got something to eat (the Cannabis made it taste awesome, naturally) - but the thoughts were powerful.  After maybe an hour or so, the effects started to diminish, as if I was seeing the weird thought cycles from a 'distance'.  Eventually, I fell asleep and woke up the next morning feeling awesome.  My only regret is that I didn't have any Nitrous to add to the experience; Nitrous + 24 mg 2C-B is a truly awesome combo, and I would have been very curious as to the world Nitrous + Cannabis + 30 mg 2C-B would have propelled me into.</p><p>It wasn't precisely 'fun', and I probably couldn't party or concentrate on stuff while on this combination, especially at high doses.  But as a mental trip, it is very cool.</p>",
 "year": "2005",
 "id": "40738",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-24T07:00:00.000Z",
 "views": "6170",
 "dose": {}
}
