{
 "title": "Out of Nowhere",
 "author": "Weatherman",
 "citation": " Weatherman. \"Out of Nowhere: experience with Clonidine & Cannabis (ID 40743)\". Erowid.org. Jun 14, 2006. erowid.org/exp/40743",
 "substance": "Clonidine & Cannabis",
 "bodyweight": "180 lb",
 "report": [
  "<p>Last night I snuck out of my house after being grounded and went to a party at my friends house. No one had any mind altering substances, so I and 2 girls proceeded to call up every person we could to score some herb. I finally got my neighbor to get me some herb, and I and the 2 chicks went out to pick it up.",
  "After we picked it up, we went to one of the girls houses to pick up her pipe. It was at that time that I realized the girl still waiting in the car with me had these two extra pills, and in exchange for a good name with a particular dealer I know, she gave them to me. So I took them with some diet coke. Then the other chick got in the car and we went off back to the party, but before doing so smoking 3 or 4 bowls in the car.",
  "At the party we smoked a shitload more herb, and I must have smoked at least 10 bowls total. Due to this, unfortunately I cant quite tell you when the pills hit me. But I do know that as soon as the marijuana took hold, an extra oomph was apparent about 20 minutes later. I felt extremely good, I was very giddy (even though I can handle marijuana). After leaving the party I ended up walking around town waiting to get sober, and I felt like there were people with me everywhere I went. I saw people/beings at places where there was absolutely nothing. I told one of my friends to be more hospitable to people that weren't there. I couldnt walk straight and I was stumbling a lot. However through out this time I was euphoric and felt extremely good. The next day I slept in until 3:30 in the afternoon.",
  "Overall this experience was VERY good, it made plain ol' mary jane seem like Salvia that wouldnt go away.</p>"
 ],
 "year": "2005",
 "id": "40743",
 "gender": "Male",
 "views": "20959",
 "dose": [
  {
   "time": "0",
   "amount": "10 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Pharms - Clonidine",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2006-06-14T07:00:00.000Z"
}
