{
 "title": "I've Lost Myself",
 "author": "C.A",
 "citation": " C.A. \"I've Lost Myself: experience with Mushrooms (ID 40774)\". Erowid.org. May 4, 2007. erowid.org/exp/40774",
 "substance": "Mushrooms",
 "bodyweight": "",
 "report": [
  "<p>I've experienced several mushroom trips, yet none of them where near the intensity of this. I ingested approximately four grams at 11:23 and within 25 minutes, I could tell that something about these mushrooms was not normal. I began feeling an immense manipulation of my mind, which caused me to suddenly be extremely perplexed. I was weighing out the remainder of the mushrooms when the digital scale which I was using suddenly melted. I panicked.",
  "'This isn't supposed to happen' raced through my mind, I immediately leapt form my chair laughing hysterically to go stand in a corner. My friends Sa and Ia followed and attempted to scare me by making awkward movements with their hands, 'I swear to god if you harm me in any way, I WILL kill you' I screamed, this wasn't a threat, It was a warning. After saying this I realized it was important for me to find a place where I could be away from everyone. I went outside and stood in a corner. In this place I lost my mind. I lost all association with my entire body, and became several different versions of myself. Instead of myself being C, I was Responsible C, Rational C, Panicked C, Drug C, Intellectual C and a main entity which controlled every variety of C which was thought.",
  "At this point I had lost the ability to think inside my head, and every thought I had was spoken since my mind lost the ability to think it. I began saying 'Leave C alone, talk to rational C he'll know what to do. No he isn't necessary, Drug C. I am having so much fun, Ok, Thought, what should we do, what should we do.' I went through this several times while each time experiencing an immense variety of emotion, often panic rocketing into powerful happiness.",
  "After many times going through this while standing in a corner outdoors in negative 30 degree weather talking to myself I decided to call my friend Co, a responsible friend, I assumed he would have an idea of what to do. While speaking on the phone with him I was not C. I was simply thought, every once in awhile Co would ask to speak to C, then Id say things like 'Why doesn't Co want to speak to thought, shut up thought... be rational Co is a rational being, speak to him, let C speak to him...Co whats up?' Then Co would speak to me normally and ask me a few questions to clam me down.",
  "Eventually after I began really freaking out as I became much more immersed in this experience and told Co I had to hang up.  I proceeded to use Thought to speak to several different C's while in my own corner outside. I looked up and the brick wall began moving as if it was a pond effected by the ripple effect of a object being thrown into it. I looked at a hose on the ground and it began slithering. I then was convinced that this was experience would be astronomical in comparison to every other drug I've ever experienced which includes; Ecstasy, Mushrooms, Marijuana, Dextromorpan, Codeine, Alcohol and Ketamine.",
  "I used a body (my own) to reach for a cell phone in a pocket. I looked at the time, it was 12:11, I began panicking 'Are people calling the police, Is Thought scaring them?' I wanted to help but I had to gain my composure first. Soon, Ia came outside and said 'C I know you don't feel it, but your freezing out here and you need to go inside. I simply agreed. I went inside where everything was either melting or changing in size, proportion was random as table and chairs would go form enormous to tiny. With much difficulty I walked approximately 12 feet, to the stairs and proceeded to walk downstairs. I saw a friend of mine X, who was terrifying to me. He began to grow, I saw him as some sort of warrior. I looked at him with fear and said 'To many of you, we have to go downstairs' (referring to myself.) I then sat in the same place I was prior to leaving to go to the corner outside.",
  "I called Co again and went through the same sequence of talking to myself and then saying 'No talk to Co, Co whats up?' then I didnt think he'd understand, then Thought was talking to rational Chris and Drug Chris and then Co would say 'ok let me talk to normal C' and I would say 'Should I let him, ok fine I'll let Co talk to C, Co whats up?' The phone started to feel slippery and it simply fell out of my hand and hung up, I then simply laughed hysterically. As I laughed I looked at my hands and waved them through the air. Colours where being dispersed form the tips. A variety of colours at that, yellow purple, green blue, moving as if they where strings swaying through the wind. They made sounds varying from static to screeching as they moved. I looked at the floor and it moved like liquid. I looked up and my entire perception of proportion had left me, the rather small basement now seemed infinite.",
  "I looked up and began creating scenarios in my head which werent even near the reality of the situation. I believed that this basement was a bomb shelter and outside of it everyone was panicking about our safety because we where on drugs (I was on drugs.) My friend X who was also on these mystical mushrooms came downstairs and greeted me, at this point I was comfortable with being several Cs controlled by the single entity and began to slip into the drug as I became familiar with what was happening. Hello X, I like what is happening to us now He simply replied with yea man probably assuming that I was speaking about myself and him.",
  "My 2 other friends In the basement ST and SG came over to where we where to greet X, at this point Xs dad came downstairs; acting sober was impossible. I looked up at him with enormous pupils swaying and twisting and turning in ways which are completely unnatural. I looked up at him and his facial hair began to grow, baffled by this, yet overjoyed by what I was experiencing I abruptly broke into laughter, his Dad simply assumed we had smoked a lot of pot which he wasnt against that, so it wasnt a problem that he saw us in this state of mind. He dismissed our antics and went upstairs.",
  "Still quite panicked I walked over to the couches in the basement approximately 7 feet away from me, this felt like miles which I enjoyed walking because I felt as though I was flying each step was light and feathery and my head felt elevated. I sat down in a couch and started asking strange questions What is important? Why are linguistics necessary? Why is there time? Then I went from this confusion to fear. Wait! I need a few questions answered. Is everyone calm? my friends said yes. Does anyone know we are on drugs? My friends said no. Are people worried? My friends said no. I then slipped into a comfortable state, I now knew I had nothing to worry about and I was safe.",
  "I decided I had to attempt to describe what was happening and write it down. I got as far as my brain has poison swirling through Then wrote 27 then wrote drugs are stupid. I began talking to Xs brother P about my experience I would cry tears of happiness and laugh and become confused, I went through the same thought process nearly 9 times but I thought it was 27 times. Constantly talking to him in third person. I was experiencing revelations while I spoke to him, I was disassociated from everything and didnt believe anything was necessary except thought. Then said there is something so beyond drugs, your mind your mind is important, all a human needs, is thought, we all must build on thought. I made several speeches to him about how unnecessary drugs are. Constantly attempting to write it down but failing, because the rate and jump of ideas and thoughts which I was going through was so absolutely radical and rapid that it made it impossible.",
  "I would be immersed in a feeling of relaxation which overwhelmed me like a blanket, I then began to become happy, then panicked once again, then afraid, then confused then I would feel some sort of emotion which I can only describe as honest, though it is an adjective used to describe truthful, it is the closest word in relation to the emotion which I felt. After a 30 minute conversation P went to bed, I sat in my chair listening to music for a brief period of time, then decided to interact with my friends ST and SG. I was used to the visuals at this point because they where constantly happening, designs on mattresses, every ones face would shift, shimmer and almost vibrate, while others faces would simply melt as their eyes would move to different parts of their face. They also would become thinner than wider and move sometimes like the liquid one would see in a lava lamp.",
  "We asked each other questions, This became repetitive and I felt as though I needed to experience things, I went upstairs to find X and to look in the bathroom mirror. I first went to look in the mirror, I was talking gibberish as I did this, and didnt know whether or not I was thinking or talking. I looked at my eyes and my pupils where enormous. My face? I couldnt tell what it looked like because it was constantly shifting in shape and size, the wall behind me in the mirror had a pattern of shells on it, which would rotate frequently.",
  "I left the bathroom after about 20 minutes of standing on front of the mirror talking about this revelation that I had of nothing being important except for thought. I went to the kitchen and was acting insane. Dancing around the kitchen in strange ways and moving my hands lasted for a considerable amount of time. I then went upstairs, to talk to X, I told him to come with us referring to thought, which controlled the Cs and the several Cs (main components and adjectives which describe my personality split into people.) I lead X down the stairs where we sat and discussed things, everything that I felt at this time was sensational.",
  "My visuals started to slowly end and then, we all began having conversations, about the fact that we dont feel that we can function properly anymore in the real world. We had been thrown this curveball of perception which we cant associate with anything concrete and essentially real in terms of recognition in the real world, because though I attempt it in this experience report, the experience was ultimately impossible to describe then and now. Frustrated with this, I went to bed, assuming It would go away the next day.",
  "The next day I felt strange and spent the entire day confused about whether or not to take the ideas I had and things I felt seriously or just think of it as the psychoactive effects of a drug which have absolutely no significance in terms of there validity within a sober world. This entire day was difficult yet by the following day, I felt much better and the experience had become a memory, by far, the most powerful memory in my conscious waking mind. It was a night Ill never forget, a night that may have changed my life forever.</p>"
 ],
 "year": "2005",
 "id": "40774",
 "gender": "Male",
 "views": "3102",
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2007-05-04T07:00:00.000Z"
}
