{
 "title": "On a Deserted Island",
 "author": "AJ",
 "citation": " AJ. \"On a Deserted Island: experience with Mushrooms (ID 40780)\". Erowid.org. Jun 24, 2008. erowid.org/exp/40780",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>My boyfriend and I were really antsy during our spring semester at school one year and decided to head south for some warmth. We found an island that we could camp on, completely secluded and uninhabited, and thought it the perfect place to get some rest and relaxation. Just for fun we brought some leftover mushrooms that we had lying around from a previous week. We had to take a ferry to get to the island, and we arranged to be picked up again 3 days later. We couldn't hold our excitement at being all alone and far away from civilization - we grabbed our tent and our bags of food and ran through the trees and towards the dunes.</p><p>After setting up our tent and dining on some grilled steaks, James and I decided to munch on the shrooms. It was getting late, I'm not sure what time, but as the sun set we munched on the caps and within minutes the whole island was completely enveloped in darkness. The mushrooms hadn't kicked in yet so we knew we had some time to get our storm lamp lit. Unfortunately, the winds coming off the ocean were so strong the flame refused to remain. We didn't have a flashlight either. We were still buzzing with the overwhelming isolation of the place that we didn't care. We held hands and let the night begin.</p><p>As the mushrooms started kickin in, we giggled to each other and talked about events back at school. The breeze was very cool and soothing - I felt like I was constantly being caressed. But as we were getting lost in our giggles, I noticed something that really frightened me. I couldn't see the ocean at this point because the night was so dark. I could only make out objects that were very close to me. On this island though there was a lighthouse. I didn't notice the beaming light until this very moment, its ray circling the island and showing us, only in strobed seconds, the crashing waves, the sandy shore, then ourselves. It was a constant rhythm that really intesified the trip. So what really frightened me was that when I saw the beam illuminate the area by our tent, it showed the tide closing in on us only a few feet away.</p><p>James and I panicked and, as if by instinct, I began to build a sand barrier in front of the tent. The sand through my fingers felt like watery jello and the activity of piling and sculpting it became pleasurable and cathartic. I forgot about the 'danger' ahead of me and enjoyed myself. James and I chatted and laughed and had a great time of ourselves while building with the sand - it was like being kids at the beach again. Eventually we stopped building and I, feeling brave, decided to venture out closer to the tide. I let the light from the lighthouse illumiate my path, so my steps were very gradual, rhythmic. Suddenly I spotted something in the sand. I screamed.</p><p>A few feet away from me was a very large object that looked like a washed up giant squid - the waves were crashing over it in big sprays. I couldn't tell what it was and I was afraid to get any closer. To make things even more enigmatic, the lighthouse only showed us 1 second of the object in pure light, and then for 2 more seconds it was completely dark. James and I were really scared. I needed to know what this object was so I grabbed a stick and slowly made my way closer. Each time the light beamed on the washed up thing it looked like something different - a severed horses head, a bag of bones, an octopus. Finally I got close enough to poke the thing. It was hard but gave a little, it reminded me of a body, of flesh. As I looked closer as the light hit, I saw intricacies of fabric and then realized it was a rug - a rug burried beneath the sand that was slowly being uncovered by the tide.</p><p>James and I feared that there was a dead body wrapped inside, but we had had enough of playing with the mysterious object and decided to leave it alone. We opened a bottle of wine and relaxed ourselves, talking away the rest of the trip and gazing at the HUGE sky above us - the only bit of light we saw that night save for the lighthouse.</p><p>The next morning we woke up to sunlight. The barrier we built the night before was HUGE! Needless to say no waves reach our tent, but we didn't realize how much effort we had put into our sand creation. We also examined the rug and found that it contained no dead bodies, but it was still creepy anyway.</p><p>All in all, a lot of fun.</p>",
 "year": "2003",
 "id": "40780",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-06-24T07:00:00.000Z",
 "views": "2795",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
