{
 "title": "Holy Wow",
 "author": "Toxic Kits",
 "citation": " Toxic Kits. \"Holy Wow: experience with Melatonin & Caffeine (ID 40786)\". Erowid.org. Jun 18, 2007. erowid.org/exp/40786",
 "substance": "Melatonin & Caffeine",
 "bodyweight": "",
 "report": "<p>I decide to spice up the night. I walk into the bathroom and grab three of the little white tablets that are 3mg each I take them with an energy drink that says on the label that has 95mg of caffeine in it. I have taken melatonin for sleep purposes only.</p><p>In the time I decided to try this I was incredibly bored. Trust me living in this town=no fun at all</p><p>Previous experience being with nitrous oxide, marijuana, caffine, zolipidem, Adderall and nutmeg. I can say gladly that Im an semi-experienced psychonaut and no the ups and downs of some drugs, but this was totally different than all the others.</p><p>As I said earlier, I ate three pills followed by the 95 milligrams of caffeine the energy drink provides meokay around fifteen minutes later it hits me a body rush like a cold shiver that warms up...kinda like the speedy comedown from nitrous. Then Im submerged in the deepest most intricate thought patterns that Ive ever had.</p><p>Within the next five minutes my whole mind is just in a unwilled meditative state that I soon submit to now my thoughts are morphing to a awesome soft euphoria the caffeine is doing its job keeping me up and the melatonin instead of tranquilizing me is providing the same subconscious changes it would while sleeping but Im in a full state of awakeness all the come down was very gentle, and all I can say is it is not an unalert high.</p>",
 "year": "2005",
 "id": "40786",
 "timestamp": "2007-06-18T07:00:00.000Z",
 "views": "14322",
 "dose": [
  {
   "time": "0",
   "amount": "95 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "9.0 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 ]
}
