{
 "title": "The Woodland Initiation",
 "author": "Scumbag",
 "citation": " Scumbag. \"The Woodland Initiation: experience with Psilocybin & Mushrooms - P. cubensis (ID 40788)\". Erowid.org. Jun 19, 2006. erowid.org/exp/40788",
 "substance": "Psilocybin & Mushrooms - P. cubensis",
 "bodyweight": "102 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "oral",
   "Psilocybin",
   "(liquid)",
   " T+ 0:15",
   "8.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(ground / crushed)",
   " T+ 0:50",
   "4 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2004",
   "40788",
   "Male",
   "",
   "Not Given",
   "Jun 19, 2006",
   "23206",
   " "
  ]
 ],
 "report": "<p>It was Thursday November 4th, 2004. My companions and I had arrived at the farm where we usually hunt the night before. Since it had been raining this day, there was no chance for spotlighting this night. So this was the perfect opportunity for my shamanic initiation.</p><p>The previous day, I had acquired about 8 grams of dried mushrooms and some liquid psilocybin equivalent to another 5 grams of powdered mushrooms. I swallowed the liquid first, on an empty stomach of course. I could feel a slight sensation after about 10-15 minutes. Then I added the powder to some water in a mug and swallowed that also.</p><p>At this point, it would be irresponsible for me not to stress that this is about TRIPLE the dose most people would take for the same effect. This is because I am a rather large person (102 KGs), and I seem to have a high tolerance for any such substance. </p><p>I then sat by the camp fire, listening to the wind in the trees while I contemplated what was about to happen. After about 45-50 minutes I heard a 'voice' calling to me. It wasn't audible in the normal sense - it came from inside my own mind! It was a woman! ' Yooo-hooo Cameron! Come on Cameron - it's time', she beckoned. I then retired to my tent where I smoked 4 large cones of strong cannabis. I then zipped myself into my swag (like a large sleeping bag made of canvas and with a rubber 'mattress' built into the base).</p><p>Then I was GONE - out of this world. I escaped into what I perceived to be the outer boundaries of my mind or my imagination. This placed presented itself as a natural forest with low light. Here I met the owner of the aforementioned voice - the Mushroom Goddess. She took the form of a white, strapless, ankle-length dress, standing side-on from me.</p><p>For about the next two hours I dialoged with her, becoming totally bewitched by her charm, her wit, her intelligence, her knowledge, her unconditional affection for me and her seemingly infinite perspective. I have come to think of her as my other-worldly girlfriend.</p><p>We 'dialogued' about many things. This took the form of telepathy. Sometimes the communication was 'verbalized' - meaning that the thoughts sometimes took the form of words - sometimes not. My experiences with telepathy have been few, but nonetheless, this mode of communication seemed as natural and familiar to me as eating or walking.</p><p>I recall saying to her 'I recognize you! YOU are the one who brought us (humanity) forth out of animal organization. YOU gave us sentience. YOU gave us speech. It is YOU who is taking us on this trip. Where are you taking us now?! To extinction? To oblivion?' Her reply was thus 'Yes it is I. Stop worrying. STOP IT!! We've done this many, many times before. We haven't lost one yet.' By this she meant that she had formed symbiotic relationships with animals elsewhere and taken them on an evolutionary journey.</p><p>For about the first hour of our conversation, an ambient music attended her presence. I understand that audio hallucinations are rare, so I feel all the more privileged. She offered the music to me. I didn't ask her to elaborate by what she meant, but the thought of making a profit or income from it was abhorrent to me. At this point I said that I think that I have better taste in music than she, citing (the Psy-Trance band) Infected Mushroom as an example. Abruptly, the music ceased and did not return for the duration of the trip. She replied asking where I thought Infected Mushroom's music came, suggesting that she was the inspiration for it.</p><p>Then it was as though I was 'pushed' out of 'my' mind into whatever that is that lies beyond. The closest analogy I can find is to liken it to swimming out beyond the surf into that DEEEEP ocean of mind. Exactly what this mind is I cannot be certain. It may be Jung's collective unconscious, or it may be the mind of the mushroom itself. Perhaps the mind of 'god', whatever that is. After having had time to ponder and process my experience, I'm inclined to adopt the middle view.</p><p>I was now 'traveling' at immense speed (I liken it to the speed of light) through a 'space' totally disjoint and unlike anything here on Earth. There was no 'ground' - no up or down. This dimension was filled with the most intense colours and geometric patterns. Such exquisite beauty I have never before beheld. I did not discourse with the goddess in this realm, nor did I sense her immediate presence. Yet I sensed that it was she who guided me through this journey. She showed me many things, including a huge space ship (which mush have been half the size of Tasmania) in orbit around an enormous planet. It was a faintly glowing white and semi-transparent. I intuited that this was the 'hyper-light drive ship' of which the Goddess told Terence McKenna, and my intuition seemed to be confirmed. It was similar in shape to Star Trek's 'Enterprise'.</p><p>Then I was shown futuristic cities, some of them suspended in space!! But I was not shown any of their inhabitants. The journey in this dimension continued for about 3 hours, after which time I was deposited back into my mind, into my body and into my reality as though nothing had happened, apart from the fact that I was very deeply impressed. At no time did I feel any anxiety. I knew from the outset that this was the safest journey upon which I had ever embarked.</p><p>Since that time, the question which begs most in my mind about my experience is 'What did I ever DO to deserve such a miraculous thing?'. The only answer I can find is that this was my reward for seeking truth so passionately, never being satisfied to allow religion, the establishment, the mass media, science or even myself to define truth for me. A reward for my skepticism maybe.</p><p>Despite my speculations about my initiation, I DO know that it is the definitive point of my life. Something of another rebirth, and something which has restored my hope for the future and the continued survival of our species.</p>"
}
