{
 "title": "Liquid Excretions",
 "author": "C. Schiffer",
 "citation": " C. Schiffer. \"Liquid Excretions: experience with Amanita muscaria (ID 40794)\". Erowid.org. Aug 10, 2005. erowid.org/exp/40794",
 "substance": "Amanita muscaria",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Amanitas - A. muscaria",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "40794",
   "Male",
   "",
   "Not Given",
   "Aug 10, 2005",
   "20689",
   " "
  ]
 ],
 "report": "<p>A brother of mine who loves this mushroom had a bunch and I was interested having never done them before and always hearing that they were poisonous. It is a super-attractive plant, more or less screaming 'look at me!', and I'm sure that our relationship with it goes way back.</p><p>I was with another bro who had also never done them before. We hadn't ate anything since the night before. We were told to take 30 grams dried mushrooms and shred 'em up with hands, put 'em in a pot, add enough water, and bring to a simmer (170-190 f) or so for about 30 minutes. We prayed with attention and respect. The scent of dank mushroom filled the house. After about 30 minutes we were left with two cups of stew. Probably should have added more water, but being our first time we were ok with stew over a dainty tea, and besides it felt more berserker-like with mugs of mushroom gruel.</p><p>We cleared our spots and brought in the pillows, we cleansed the house with good vibrations and some sage. My friends house that we were tripping at was great, datura, salvia, and peruvian torch surrounded us with pleasant plant energy. We brought in some amanita toys of which our western culture has many. We toasted the gods and drank. Not bad really, but certainly not a casual drink. Plus with very little water it was alot of chewing. Mmm, yum... amanita. Got it all down, loaded the bong, and prepared to settle in.</p><p>After about 20 minutes started to feel slightly disoriented, started sweating a little bit, salivation started increasing, and took a big piss.</p><p>At around the 40 minute I was feeling more and more disoriented, started sweating profusely, and drooling like crazy. I had to pee every 10 minutes. It was crazy, I started pouring out water, outta every pore and orifice. I was like a wet rag being rungout.</p><p>After this, time became a blur, my vision felt outta focus, and I would drift off into delirious dream trances off and on in between cleaning the drool of my face, wiping sweat of my body, and taking a piss. I also took several hot showers in my delirium because I would get very cold.</p><p>My goddess, the water faucet wouldn't turn off. I drooled more, sweated more, peed more. I was drenched, all my clothes were soaked. The pillows were soaked, I was creating a lake. It must have looked hilarious, a kodak moment for sure. Seriously, I never could have imagined that much liquid excreting from all exits of my body. No joking, several gallons, it was insane. My friend was sweating alot too but not nearly on the level I was.</p><p>As far as mental stuff goes I mostly felt a little out of it, I was in a calm state of mind in a delirious kinda fashion. No visuals, full on body high (or down).</p><p>Lasted about 8 hours overall. I was encouraged to extend the trip by drinking some of my magic pee, but 8 hours was long enough for me, so I left the magic pee in the fridge for the next lucky customer. I went home and went to bed.</p><p>The next morning I felt great. It felt like I had been through several sweat lodges. Purged of all toxins, I felt energized and ready for the drive down to Mexico.</p><p>Last notes. Either this mushroom is very specific to certain brain chemistry or it's very variable in itself. My brother swears by it, he loves it, it's his plant ally. Apparently he gets visuals and the whole works. But for me this experience was not psychedelic or hallucinogenic by any means. Entheogenic, sure. But for someone that's thinking a psilocybin-substitute, definitely no (though they might like it anyway). The only thing I liked about this was that I felt purged and cleansed and ready to go the next day. But over all the sweat lodge route would have felt more pleasurable. Would I try it again? Yes. Because I'm curious and persistent and think I have 9 lives, haha.</p>"
}
