{
 "title": "Longer, Stronger, Better Than Expected",
 "author": "TeKtonik",
 "citation": " TeKtonik. \"Longer, Stronger, Better Than Expected: experience with Syrian Rue & Cacti - T. peruvianus (ID 40814)\". Erowid.org. Aug 26, 2005. erowid.org/exp/40814",
 "substance": "Syrian Rue & Cacti - T. peruvianus",
 "bodyweight": "165 lb",
 "header": [
  "DOSE: T+ 0:00",
  "2 tsp",
  "oral",
  "Syrian Rue",
  "(extract)",
  " T+ 0:15",
  "30 g",
  "oral",
  "Cacti - T. peruvianus",
  "(ground / crushed)"
 ],
 "report": "<p>I'm going to make a long story short for a change. I consumed 2 tsp of homemade peganum harmala extract. After 15 minutes, I ate 30g of Trichocereus Peruvianus from my favorite supplier. In my experience with legal mescaline-containing cacti, I've found that all the peruvianus I've had beats any pachanoi I've eaten to date. I ground the material into a fine, sawdust-like consistency, added water and formed a dough, which I swallowed in 6 bites or so.</p><p>For an hour and 30 minutes I was very nauseous and considered throwing up numerous times, but I fought through it. I began to feel the effects of the mescaline lightly at this point.</p><p>About 2 hours after ingestion, it started to hit me hard. I reached the levels of my previous 30g experiences, then kept right on going.</p><p>By the time I settled into the peak, about 3 hours post ingestion, I was having an incredible time. All my cactus eating sessions before this one had been lacking in the visuals department, but this time they were out in full force.</p><p>Patterns galore, trails, and colors were everywhere, accompanied by shivers of euphoria. Woodgrain and other patterns became morphing, flowing art, in a classic phenethylamine fashion. My mind was adrift in that beautiful place that psychedelics take me, going from thought to thought with seamless ease. The body high was very enjoyable, but not really stimulating, and the addition of syrian rue seemed to add to this feeling of muscle weakness. The only complaint I have is that despite my being very tired I couldn't sleep a wink that night, despite feeling very tired. The next day, my lack of sleep seemed to draw out the effects of the mescaline, and the experience lasted no less than 16 hours total. The peak was somewhere around 8-10 hours. I found this duration to be very enjoyable, but in the future I'll consume earlier in the day, so as to be able to sleep.</p><p>This trip was awesome, and I wish I'd combined with a MAOI earlier. It was at least twice as powerful as any experience I've had prior.</p><p>I have no complaints, except for not being able to sleep, and I will be repeating in the near future.</p><p>have fun,</p><p>be safe</p>",
 "year": "2005",
 "id": "40814",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-26T07:00:00.000Z",
 "views": "7525",
 "dose": {}
}
