{
 "title": "Otherworldly Vacation",
 "author": "pharmofile",
 "citation": " pharmofile. \"Otherworldly Vacation: experience with DPT & Syrian Rue (ID 40832)\". Erowid.org. Feb 27, 2005. erowid.org/exp/40832",
 "substance": "DPT & Syrian Rue",
 "bodyweight": "60 kg",
 "report": "<p>Early evening after a long day of work. My boyfriend and I have a small amount of DPT to try out. There is not enough for both of us to try the 200+ mg oral dose suggested in TIHKAL, and neither one of us likes insufflation, so we opt for a smaller oral dose with some Peganum harmala seeds. We have not eaten since lunch.</p><p>----------</p><p>19:20\tI attempt to drink a sludge of 2.00 grams of finely ground Peganum harmala seeds suspended in cola. The mixture is bitter, gritty, and rancid tasting. It takes me six minutes to choke it down. It is the most vile concoction I have ever swallowed. I vow never to do that to myself again. If this works, I will make capsules out of the powder in the future.</p><p>19:55\tThe tip of my tongue is tingly. It feels like I have just chewed on some very strong mints. There is a slight pressure in my head.</p><p>20:16\tI feel jittery. Maybe it's just nerves. I don't quite trust P.harmala.</p><p>20:24\tI drink 85.0 mg of DPT dissolved in a glass of water. The DPT is very bitter, and the taste of it lingers despite numerous attempts to wash it away with cola and juice.</p><p>20:30\tI can't be feeling anything already, can I? Everything appears sparkly.</p><p>20:48\tMy hands are trembling. I'm having trouble concentrating. The movie on TV doesn't make much sense. Normally I can read the subtitles without thinking about it, but now I have to concentrate on them to understand them before they switch. I feel slightly separated from the reality I see around me. That feeling is one I recognize from 5-Meo-DMT, but this is not as sharp and insistent.</p><p>20:50\tQueasy. My chest feels tight. My handwriting is becoming worse. My hands are shaking, and I have to try to write slowly to draw each letter correctly.</p><p>20:53\tArms and legs are both trembling. Handwriting noticeably worse than three minutes ago. When I look around I see colored flashes at the edge of my vision. Still a bit nauseous. Am I going to faint? Snuggling up together feels good, reassuring.</p><p>20:54\tExcept for the timing note, my handwriting is no longer legible. I start losing track of what I am doing. Every now and then I watch some of the TV movie, but it is uninteresting and I can't follow it. I am falling into daydreams for several minutes at a time, sometimes in the middle of a conversation.</p><p>22:42\tThe movie is over, and I can scratch out notes again. We agreed that it did not seem like a movie anyway. It looked like a badly filmed Discovery documentary. The 'suspension of disbelief' mechanism required for watching movies seems to be gone. We were analyzing camera angles and color choices instead of following a story.</p><p>The daydream sessions have become longer and more frequent. Each daydream is a fully realized world with its own rules and motivations. I am captivated by each one in turn. Most of them are nice places to be, but a few are frightening. I always have the feeling that I know they are just dream states, however, and that I can leave them whenever I wish to.</p><p>22:47\tIs this less intense than a few minutes ago? Extreme time dilation. One seven-minute song in the background has been playing for days. I feel like I spend an hour or two in each dream world before swapping it for a new one. Pleasant contentment. Music sounds very nice.</p><p>23:22\tObvious tracers around everything that moves. I walk to the other room to experiment with the tracers and to get some snacks. The tracers only work on a contrasting background, and not at all in a partially darkened room. Why?</p><p>The smell and taste of the snacks is greatly enhanced, and I enjoy trying out the various fruit, vegetable, and salty snacks before returning to exploration of the daydream worlds.</p><p>01:40\tThe tracers are time dilation are less noticeable, but the stream of dream worlds are still very much present whenever I close my eyes. I think I've had enough for tonight, and go to sleep.</p><p>----------</p><p>The next day, we woke up easily to the alarm at 08:00. I felt fuzzy-headed all day, unable to concentrate on more than one thing at a time, and slightly irritable. Despite that, I feel relaxed. In my mind, it has been several weeks since yesterday, and I have been on a marvelous vacation.</p>",
 "year": "2005",
 "id": "40832",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-02-27T08:00:00.000Z",
 "views": "9252",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 1:04",
   "amount": "85 mg",
   "administration": "oral",
   "substance": "DPT",
   "form": "(liquid)"
  }
 }
}
