{
 "title": "Mario Kart Fun",
 "author": "Hydrogen",
 "citation": " Hydrogen. \"Mario Kart Fun: experience with Inhalants (Duster) (ID 40852)\". Erowid.org. Mar 29, 2008. erowid.org/exp/40852",
 "substance": "Inhalants (Duster)",
 "bodyweight": "135 lb",
 "report": [
  "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "Last year me and my roommate in college decided to go pick up a couple cans of Duster for a fun night. We went crazy with it that night. We each took about 1/2-3/4 of a can within a period of about 5 hours. It was a very amusing night to say the least. We watched some Comedy Central Presents and laughed our asses off. Later on we played some Mario Kart 64. This was sort of difficult. I lost a lot of time due to trying to huff while in the middle of a race. It was a blast.",
  "I did get officially freaked out though. My roommate took 3 full, deep breaths and started laughing hysterically. A few seconds later he started drooling all over himself. I told him he was drooling everywhere, but he didn't seem to hear me. Luckily, that ended in just a few minutes.",
  "I, personally, enjoy Duster, though not as much as Whippets (Nitrous Oxide).",
  "Pros:",
  "  Wah-Wahs - slightly more intense 'audio hallucinatios' than with whippets",
  "  Visuals - visuals more intense than with whippets. (Rainbow Road was INTENSE!)",
  "  Inexpensive - $3 for a whole night of fun.",
  "Cons:",
  "  Nausea - I felt very crappy after 3/4 of a bottle, but I expected that.",
  "  Wah-wahs - even hours after taking it, I still had the Wah-Wahs..",
  "  Sleep - This kept me from getting to sleep, it reminded me of trying to sleep on Ritalin.</p>"
 ],
 "year": "2004",
 "id": "40852",
 "gender": "Male",
 "views": "9228",
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "submissionDate": "2008-03-29T07:00:00.000Z"
}
