{
 "title": "The long car ride",
 "author": "Brown Eyed Girl",
 "citation": " Brown Eyed Girl. \"The long car ride: experience with Cannabis (ID 4086)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4086",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>Oh, what a great night it was indeed.  My best friend and I decided to go out and by some weed and go for a car ride.  She was driving.  We packed a bowl (a glass one with a carb) and we were both so pumped up to smoke because we both had a stressful day studying for tests.  I packed the bowl and I gave it to her to spark it.  She did, and smiled at me, then let out all this smoke. </p><p>She got a great hit as did I for the rest of the bowl.  By this time I was feeling great.  My head got light and right in around my eyes and nose got tight, and I kept scrunching my nose to release the tension.  Of course it didn't work, but it wasn't a bad feeling or anything so it didn't really bother me.  We were listening to some Phish and picked out Guyute especially.  All we could do was smile and dance as she drove 25 in a 45.  We tried to go the speed limit but it felt as though we were going 80 mph!!  I started to tell her to slow down and she looked at her speedometor and said 'Oh my God we're only going 25!'  I was like 'No we're not...we're going soo fast.'  But we weren't.  It felt like it though.  Everything was moving so fast and we were just stuck in the middle of it. </p><p>Our reactions were slow and our sense of direction was totally gone.  My friend would stop and the green lights for 2 seconds before realizing they were green and not red.  Everything was funny to us, we laughed at eachother, and what we were doing.  We talked like there was no tomorrow it was great.  We also drank soo much water on the short car ride.  Well, it was supposed to be short, but we got lost for 2 hours.  What is funny about that is that we were in a part of town that we both knew like the back of our own hand.  It didn't matter, we were stupid and didn't know where we were.  So we drove around in circles for 2 hours and still we were high.  We got closer to school, and we both mutually decided to smoke another bowl!!  He he he, it was even better. </p><p>She couldn't park her car, and I made up some joke to go along with it and everytime she does a bad job parking I bring it up and we laugh about it.  Anyway, so after she parked her car, we sat in the car for another half hour just chillin out to music.  People were walking by and we were just jammin out to Phish in her car like it was our job!!  Eventually we stumbled out of the car and I was laughing histerically!  We had a hard time walking, and I couldn't talk too well.  Basically, we were just a little slow.  We noticed that we would be in mid-sentence and lose all train of thought and couldn't continue on with our story! </p><p>Everything just felt soo good to us as well.  We were always smiling, and I wanted to talk to everybody!  We were just so friendly to everybody and anybody!  It was like we were angels of happiness sent to spread happiness to everybody.  Our eyes were cashed of course and people noticed that but we didn't care at all.  We rode the elevator up to our rooms where we had a feast.  All we could do was drink and eat a lot of food!!  It wasn't hard to fall asleep either, I was watching a movie and fell right asleep at like 11pm, which is actually very early for me and her.  It was great. </p><p>I have never had a bad experience with weed!!  I love it.  I would highly recommend trying it!  My grades have stayed the same since I have started to smoke, and I am still highly active in my sports.  Nothing about me and who I am changed.</p>",
 "year": "2000",
 "id": "4086",
 "gender": "Female",
 "timestamp": "2001-12-25T08:00:00.000Z",
 "views": "7358",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(dried)"
  }
 ]
}
