{
 "id": 409,
 "title": "A Nice High Turned Nightmarish",
 "date": {
  "submission": "2001-11-21T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Sasha",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "1.25 oz",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>Night started off well; basic plan was to stay at the apartment with my boyfriend and split an 8-ball. Plan was in effect, it was great coke, and a neighbor was over having some wine and chatting. Night wore on, coke wore on, neighbor deigned to share. I am a pretty avid user when I use, so it's my guess I snorted the lion's share - but felt very in control. Party migrated 2 doors down to said neighbors, where we continued, sans coke. Jitters and uneasiness set in about 5:30 AM, that icky time, when I usually pop a Klonopin or 2. Neighbor spoke up - 'I have something that will bring you down!' and pulls out a glass of semi-cloudy liquid. Purportedly GHB, then he explained it was 1,4. I had heard of GHB, but only knew it as 'liquid ecstasy'. Took a gulp, and took a little more after a few minutes, as neighbor gave disclaimer that 'you'll feel great for a few minutes and then you'll fall asleep'. Understatement.",
  "I felt AMAZING for about 10 minutes - better than the best roll I've ever had on MDMA. And that's the last thing I remember. Apparently I went into the bathroom, fell off the toilet, hit my face (and got the worst black eye I'd ever seen), went into convulsions, and spent the next 3 hours in complete hysterical disorientation, half-naked on neighbor's stripped bed, vomiting everywhere.",
  "Moral of the story?",
  "1. I will never agree to do any drug I know little/nothing about/never tried while I are high on another drug - REASONING IMPAIRED.",
  "2. I wont mix prescription meds with illicit ones unless I know they work together! (I have bipolar disorder and take massive amounts of lithium, Topamax, Seroquel, Klonopin).</p>"
 ],
 "erowid": {
  "id": "10734",
  "citation": " Sasha. \"A Nice High Turned Nightmarish: experience with Cocaine & 1,4-Butanediol (ID 10734)\". Erowid.org. Nov 21, 2001. erowid.org/exp/10734",
  "substance": "Cocaine & 1,4-Butanediol",
  "views": "24590"
 }
}
