{
 "title": "Outdoors, Better Than Indoors",
 "author": "Endo420",
 "citation": " Endo420. \"Outdoors, Better Than Indoors: experience with Mushrooms, Cannabis & Alcohol (ID 40900)\". Erowid.org. Jul 13, 2008. erowid.org/exp/40900",
 "substance": "Mushrooms, Cannabis & Alcohol",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "oral",
   "Alcohol",
   "(liquid)",
   "",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>This is my first experience on mushrooms. Some aspects of the high were amazingly great and feelings I would like to experience again, other parts were rather scary, but now that I think about it, could have been changed.</p><p>It all started one day when me and a friend were going to meet up with some friends and go to the beach. My buddy picked me up in his car around mid-afternoon. I think it was a Saturday. We had to drive to the city to meet up with the friend that gave us our dope. While we were sitting in the car with him, my buddy decided to get a few grams of mushrooms. He has done them many times before and told me about it, but I had never tried them yet. We hadn't planned getting mushrooms, but while my friend got some, I decided I would try them. I got 3 grams of mushrooms, and we spent most of the car ride talking about them. We had to drop by another friends place to get him some reefer, on the way there I ate my 3 grams slowly. I didn't mind the taste or texture of the mushrooms, and enjoyed eating them, wondering when the effects would kick in. My buddy also ate his 4 grams at the same time as me.</p><p>About 15-25 minutes after eating all of my mushrooms, I began to feel the effects slightly. I began to feel extremely happy, like everything was great. I noticed the colors were much brighter and seemed very attractive. We left his house and were on our way to pick up our friends and head to the beach. While driving I noticed a dead animal on the side of the road and told my buddy to pull over. I went to curiously examine the animal. It was a large porcupine. I had my steel toe boots on, and out of entertainment I kicked the porcupine several times, leaving my boots with spikes sticking from the toe. We got back in the car, and continued our drive.</p><p>It was now about 45 minutes to an hour after I had eaten my mushrooms when I began to get my first hallucinations. We were driving down a gravel road and I was looking around. Suddenly I began to see patterns. They were like something psychedelic, patterns you might see painted on a hippie bus or a 'trippy' poster. The patterns swirled around and I yelled out in joy. My buddy just laughed at me. I closed my eyes and saw more patterns, variations of them, clearly.</p><p>We arrived at my friends place, and everyone else was already there, sitting in the basement. I was already beginning to trip, and the fact that my friends mom was in the basement too, didn't help me any. I avoided sitting at the table with the rest of the people, but sat down on the floor instead and began to pull out the porcupine quills in my boots. My friends mom became interested in what I was doing and I mumbled what happened for the quills to get there.</p><p>I continued to keep my spot across the room, and sat down on the couch. I was watching the floor, it had a design in it which began to morph slowly. Eventually, my friends mom left the basement and went back to her own business, while we sat around tech table and talked while having cigarettes. About half an hour to and hour passed, when suddenly my buddy who was on shrooms with me was all of a sudden on the floor in the dark corner of the basement. Someone turned on the light, and picked him up. He had tripped over a garbage can and hit his chin on a dresser, then fell and knocked himself out. There was a small pool of blood on the floor.</p><p>My friend went in the bathroom to gather himself, while I sat around, not really aware of what was going on. I remember sitting there saying 'Ahh he's fine, just leave him be!' but he was tripping bad, and bleeding from his cut. My friends mom took him to the hospital. With all the commotion made by that, I was damn confused with what was going on. My friends were talking quietly about my buddy who was at the hospital. The room was quiet and that put me at unease. I could hear EVERYTHING everybody was saying, like my hearing was increased dramatically! Suddenly, I thought they were saying I was bleeding.</p><p>This is where everything changed. For some reason or another, I thought I was bleeding all of a sudden. I couldn't see it, but for some reason I kept thinking my friends were trying to calm me down and stop me from bleeding. This was all confusing, I became sweaty and removed my boots and socks. I was all worried about dying for what must have been half an hour or more. I remember looking at the basement window. It looked black, like it was night time now. Had that much time really gone by?</p><p>For some reason, we decided to all go outside to get some drinks. When I walked outside, and it was still light out. The first thing I noticed was the sky! The clouds were big and puffy and pink colored from the setting sun. I kept saying 'What a nice day out!' We all sat around outside when a few more friends pulled up. One of them wanted to smoke some reefer. I remembered I had gotten some earlier and went in the house to get it. We went to my friends car to smoke a joint. The joint made my mushroom high all that much better. I felt on top of the world. We continued to sit outside drinking. I was getting a buzz from the alcohol now, and it was mixing great with the reefer and shrooms. I remember the sky, how it would go dark-then light-then darker again. We wend down to the basement and I tried to take the lawn chair with me, but my friends made me keep it outside.</p><p>A few hours later, my buddy came back from the hospital with stitches in his chin. I totally forgot about him, I thought he died! We were all happy, and continued to drink and smoke pot the rest of the night. The mushrooms began to fade about an hour or so after my buddy got back. In total, the high lasted for a good 5-7 hours.</p><p>All in all, it was a very unique experience and despite all the confusion turned out pretty great. We never did end up going to the beach though. I look forward to the next time I do mushrooms.</p>",
 "year": "2004",
 "id": "40900",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-07-13T07:00:00.000Z",
 "views": "3098",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
