{
 "title": "By Far the Strongest Trip Ever",
 "author": "Berry",
 "citation": " Berry. \"By Far the Strongest Trip Ever: experience with Dimenhydrinate (Dramamine) & Datura (ID 40916)\". Erowid.org. Aug 27, 2006. erowid.org/exp/40916",
 "substance": "Dimenhydrinate (Dramamine) & Datura",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "10 tablets",
   "oral",
   "Dimenhydrinate",
   "",
   "",
   "3 leaves",
   "oral",
   "Datura",
   "(fresh)"
  ]
 ],
 "report": "</p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>To best describe this trip I am going to use half of what I remember and half of what my friends told me happened.</p><p>I recall the warm march day very well, It was during my spring break senior year in high school.  We had set out to trade of the Datura leaves with the rainbow people in buck lake.  Usually around this time of year I am able to bring them pots, pans, perishable food (milk, eggs etc..) and they would trade with either some of the finest marijuana or lsd.  Seeing as how there was an extreme shortage of lsd we set out with the goal of trading the Datura and some food for some lsd.  We arrive and nobody has anything.  So we have all of this datura and camping supplies and we are in the middle of the forest, so naturally we camp.</p><p>We drink a few beers and fired up a blunt.  Then my friend tells me that we should take the datura and some dramamine and trip all night.  I thought what the heck.  So instead of picking the white flowers he picked the green leaves.  He said it would work and I believed him.  So I took about 10 dramamine and 3 green leaves about the size of my hand.</p><p>What happens next is probably the hardest thing to ever recall.  I have used lsd mushrooms and other drugs but nothing, I mean nothing could compare to the sheer power of the trip I was about to experience.</p><p>The trip began with no onset.  As a matter of fact I dont recall the feeling of ever 'tripping'  there was no visuals such as color changes and moving objects as with lsd or shrooms.  This was purely hallucinations.  Nothing was real.  Nothing was fake.  There was no distinguishing reality from the 'fantasy world'</p><p>I completely forgot that I had even taken a drug.</p><p>This next paragraph is told through the eyes of my friends.</p><p>The first experience was we all set out our separate ways (3 of us).  When they found me they said I was in a lake with weeds matted down around me in a perfect circle and was shouting at them that I was in target playing playstation.  Then I told them that I was in B's pool.  B does not have a pool.  I sure as hell though he did that night I will be damned if I was not swimming in it.  Neither me or friends recall much until I said that I was ready to go back to pat's  20-30 miles away from the woods.  They said that I demanded to let me drive and we should go back.  They did not think so.  So I left them.</p><p>The next paragraph or two is now my own recollection of what happened after I left my friends in the woods.</p><p>I do not remember leaving them or driving anywhere.  I start my memory recall with me standing on the edge of the woods off of a country road where a local spring was.  I remember seeing my car on a dirt embankment and a lake county sheriffs SUV behind my car.  I remember having no feeling of being afraid or scared of getting arrested.  I still do not remember taking any drug and do not realize that I am tripping balls.</p><p>The officer approached me and asked for my ID.  In the report it stated that I reached down to the ground and handed him a pile of dirt.  The reason I know this is because the lady at the dispatcher's office was the mother of one of the friends that I was tripping with.  The initial belief was that I was a mental retarded kid who stole his parents car. I remember him searching my car, and then for some reason says 'dont worry you are not in trouble, you are not being arrested I am just baker acting you'  I had no idea what he meant but I was to calm and relaxed to do anything.  so I was placed in cuffs and put in the back of the cop's SUV.</p><p>During the ride there somehow another officer appeared in the front seat and they began to smoke pot.  If I was sober I would have been like what the hell but at the time it did not seem to bother me.  (luckily I did not say anything because the second officer and the pot did not exist).   We finally arrive to the hospital to take blood and find out what the hell I was on.  The officer asked me to step out of the vehicle.  I looked down and realized that I was shackled to the vehicle.  (not really).</p><p>Suddenly the image of the shackles disappears right before my eyes.  I realize now that I am on something and I am beginning to come down.  I was escorted into the hospital and placed on a bed and they began to draw blood.  Now images of people and things began to appear and disappear.  While the images where there they seemed so realistic, so real that I could touch smell and hear them.  It seemed like they were really there, there was complete interaction with the hallucinations.  The doctors cound nothing in there standerd drug testes.  I was now becoming sober enough to remember bits and pieces and I recall taking the drugs.  I told the doctors what I had taken.  The said the only thing for me to do is to go into detox until the drug completely wears off.</p><p>I remember sitting in the chair at the detox and random people would sit in the chair beside me.  All of them would disappear within a minute.  The only person that was actually beside me was my mother and she kept asking me who I was talking to.  So my mother got me signed in and they said that I would have to be in there at least 24 hours, and that the doctor would evaluate me and tell me whether or not I was ok to go.</p><p>The next day I woke up completely sober and feeling refreshed.  I had tripped for a solid 24 hours.  The doctor evaluated me and said that I was good to go.</p><p>Through all of the different drugs I have done I usually do them more than once.  This drug I did once and will NEVER touch again.</p>",
 "year": "2002",
 "id": "40916",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-08-27T07:00:00.000Z",
 "views": "12151"
}
