{
 "id": 4094,
 "title": "A Demonized Drug",
 "date": {
  "submission": "2003-10-24T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "The Professor",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 seeds",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  },
  {
   "time": "0",
   "amount": "20 seeds",
   "administration": "smoked",
   "substance": "Datura",
   "form": "(seeds)"
  },
  {
   "time": "0",
   "amount": "2 leaves",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "amount": "2 leaves",
   "administration": "oral",
   "substance": "Datura",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>For nearly two years, I have had quite a fascination with solanacious plants. I read every thing I could find on Daturas, Brugmansias, Nightshade, and the like. I had experimented with small doses of Brugmansia, and smaller still of Datura to little effect-a dry throat and tired, dilated pupils.",
  "I finally decided to really give it a try, and ate about one hundred seeds, about 20 on the hour and then 40 or so at once. I also smoked about a dozen. I then ate 2 Datura leaves and 2 Brugmansia leaves.",
  "I noticed very little until I decided to go to bed at about 11:30.",
  "After a while of not sleeping as sometimes I get very bad insomnia, I decided to read a book. I sat up in bed and began to read some readily available story. I can't now recall what it was about, but I found it very interesting. Ironicly, I was reminded of a Datura report here at erowid called The Infinity Book. I then looked away from the book and looked back and there was nothing there except my hands, palms up as if holding a book.",
  "'wow' I thought 'that was one nifty hallucination'. I didn't feel at all high at this time, no confusion or delerium. I continued to lay in bed as people I know streamed through my door one at at time. They would either face away from me when I tried to converse with them, or just stare blankly at me and smile or giggle once in a while.",
  "A close friend of mine walked in a one point and stared at me coldly while I asked her how she was that night (for some reason I would always try to start small talk with these people even though I sort of knew they werent really there)she then preceded to crawl up ontu my desk and assume a fetal possition for saveral minutes before dissapearing.",
  "One thing that happend throughout the experience was my trying to grab things that weren't there. I would be thirsty and reach for a water bottle only to have my hand go right through it. I would try to adjust my pillow or retrieve a blanket but my hand would slide right through them, it became really irritating.",
  "Several other strange things happened that night such as seeing what looked like hundreds of large black rodents scurrying around my floor and watching a television that I found to not be on (similar to the book thing).",
  "All-in-all it was a very nice experience. Very strange but sort of comforting and not at all scary.</p>"
 ],
 "erowid": {
  "id": "27826",
  "citation": " The Professor. \"A Demonized Drug: experience with Datura & Brugmansia (ID 27826)\". Erowid.org. Oct 24, 2003. erowid.org/exp/27826",
  "substance": "Datura & Brugmansia",
  "views": "20482"
 }
}
