{
 "title": "Jeff",
 "author": "Katriss",
 "citation": " Katriss. \"Jeff: experience with Methcathinone (ID 40946)\". Erowid.org. Apr 6, 2006. erowid.org/exp/40946",
 "substance": "Methcathinone",
 "bodyweight": "70 kg",
 "header": [
  "DOSE:",
  "40 mg",
  "insufflated",
  "Methcathinone",
  "(powder / crystals)"
 ],
 "report": "<p>Firstly, excuse me for any bad English.</p><p>I'm a 25 years old man from Israel, and I've recentlly came across a strange recipe for making some sort of meth-like substance out of pseodephedrine.</p><p>At first, i wanderred why peole use pseudephedrine?? isn't it better to use epherine? but ok..I didn't carred much at first.</p><p>Im a bodybuilder, and I use ephedrine myself to burn body fat more easily during fat-loss periods (one can either gain muscle and fat, or burn fat while maintaining gained muscle mass. to do bowth at the same time will require the use of steroids. f*ck that).</p><p>Any whay, a friend came to me with the intent of me getting him some ephedrine, but has later backed off of the idea when he find he could extract pseudephedrine from some red collored pill, avilable for a much cheaper price, at just about any drug store.</p><p>This really got my attention, and i decided to have a quick look at the recipe. 'meth..methca..methcathinone? ok.. whatever. meth-like high bla bla bla.. ingredients.. bla bla bla.. wait.. potassium? HCI? red collored pills?'</p><p>I quickley phoned my friend and asked him what was the name of the pills. he said 'something like sinofed or sudafed'.</p><p>God damned it! I know this shit! this is JEFF! i had no idea that 'JEFF' is the street name for methcathinone, but I damn well know what JEFF is.</p><p>that's crap!! I took it once, about 40 mg of it, snorred. it was great until the crash came. HORRIBLE feeling of despair and depression. I haven't felt this bad even after three hits of X! (and had a WAY better time to).</p><p>I have some speed-freak friends who use to I.V this shit when they couldn't get any real speed. methcathinone is garbage.</p>",
 "year": "2005",
 "id": "40946",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-06T07:00:00.000Z",
 "views": "10494",
 "dose": {}
}
