{
 "title": "Euphoric Happiness",
 "author": "R00fies",
 "citation": " R00fies. \"Euphoric Happiness: experience with Amphetamines (Adderall) & Hydrocodone (ID 40952)\". Erowid.org. Jul 13, 2008. erowid.org/exp/40952",
 "substance": "Amphetamines (Adderall) & Hydrocodone",
 "bodyweight": "130 lb",
 "report": "<p>First off I would like to say that my two favorite pharmaceuticals would definitely be the Dextro-Amphetamine, Adderall, and Hydrocodone. I've had amazing experiences with both when used alone so I was wondering while sitting in school yesterday 'I wonder what the hell would it feel like to put the two together?' The amazing 'ups' of the amphetamine 'I want to jump the fuck around, talk to everyone, BLAAAAAH!!!', mixed with the sedating yet relaxing Hydro.</p><p>I had several hypothesis before consuming both: A) On a 'mathematical' approach, the 'up' and 'down' will cancel and leave me in the middle somewhere, B) I will be experiencing an incredible body high from the tingling sensation of both, or C) (Yes I think about this before I take anything) My body is a pussy and I won't handle it and I'll OD and from there only God knows where.</p><p>This is my 'trip' report:</p><p>T+0:00 - 5:10pm, consumed 40mg Adderall.</p><p>T+0:20 - Amphetamines taking its effect. Went from a tired nappy mood to wide awake and active. Music seems amazing. Certain thoughts of mine send a tingling sensation down my spine. I sure can't wait until tonight. I also had to eat dinner which wasn't hard as I can now eat on this stuff. After several times your body just seems to get use to it.</p><p>T+0:30 - Calling everyone on my contacts list on my cell phone asking them if they're going to the 'show' tonight, which my girlfriend and I along with a few of my friends will be going to. Some local bands are playing.</p><p>T+2:50 - My girlfriend arrives at my house, she is also on amphetamines and is talking to my mom nonstop for forty-five minutes, and I'm in a relaxed mood. Sitting in any position is comfortable. The tingling body sensations are as always so damn good. My heart is racing.</p><p>T+4:00 - We arrive at the show and meet up with a bunch of my friends. I'm in an excited, and nothing but happy mood.</p><p>T+4:10 - Consume two 5/500 Hydrocodone (Generic for Vicodin)tablets. It is freezing cold outside at this time. My mouth is so dry from the amphetamines and I have to drink a lot of water and chew lots of gum to keep myself from having a dry mouth and disgusting breath.</p><p>T+4:30 - The hydrocodone is hitting me now. However, this time around I don't feel the drowsiness from it. I feel the body high, the warmth, and the relaxation along with the Adderall at the same time. So far it seems as I was expecting and hoping, amazing.</p><p>T+5:00 - Went out for a walk and had several cigarettes. I don't really smoke anymore but at this time I didn't really care. The nicotine gave me a decent buzz and made the body tingling sensations even stronger for several minutes. The great thing is, and I'm not even sure which drug it was from, if not both, my girlfriend and I were out in the cold and I was shivering before hardcore, but this time, we were not cold, at all. My guess is since opiates change the brain's vision of 'pain', that the hydro made us not cold.</p><p>T+5:50 - Sat down with my friends for about half hour to an hour talking and really relaxed and then pretty much the show ended at about 11:30 that night about six and a half hours after the Adderall was consumed.</p><p>T:6:45 - Took one more 5/500 Hydrocodone to try and 'level' the last two pill's effects since they were most likely wearing off soon after I arrived home.</p><p>After everything that night, I fell asleep at about 6:00 AM. I could have probably fallen asleep sooner but I just went online, watched TV, relaxed, and did whatever. All in all the experience in my eyes was simply amazing. It was one of those combinations that 'fucked you up' but you were actually clear-minded. No one could really even tell except for my slightly larger pupils.</p><p>I would definitely do this again, not often though together in fear of a fast tolerance and addiction. I was in a very good mood, very relaxed and pretty much had the upper effects of the amphetamines with a strong as hell body high from the Hydrocodone without the drowsiness. Being sociable was a fucking dream. Instead of just Adderall before school, sometimes I might do this, that would be fun. Time went by very fast as well, faster than usual with Adderall somehow. All I know is, there were no noticeable downsides and everything was great. Next time I want to up the dose of the Hydro to 15mg right off the bat, maybe I'll feel it more.</p><p>Being with my friends was the greatest thing ever! Just play it safe.</p>",
 "year": "2005",
 "id": "40952",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-07-13T07:00:00.000Z",
 "views": "41127",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 4:10",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 5:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  },
  "3": {
   "time": " T+ 6:45",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 }
}
