{
 "title": "It Really Sucks",
 "author": "Mojo Risin",
 "citation": " Mojo Risin. \"It Really Sucks: experience with Cocaine (ID 40965)\". Erowid.org. Jun 25, 2007. erowid.org/exp/40965",
 "substance": "Cocaine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cocaine",
   "(powder / crystals)",
   "",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I've only tried coke once, and it sucked. The only reason I got it in the first place is because when I was in Boston I tried to buy mushrooms, but the guy who got it for me brought me back coke, so I decided not to let it go to waste, I decided to try it.</p><p>Me and my buddy smoked a bowl laced with it first and the high was really intense. It was the most intense thing I had ever felt in my life, I felt amped. We happened to be watching TV, and it was the most exciting TV I had ever watched, now I dont even remember what it was.</p><p>That only lasted about 5 minutes. After that I started coming down, and that is the worst feeling ever. A lot of people say that they craved for more coke when they started to come down...I wasn't craving but I did want it to bring me back up, so I snorted a line.</p><p>This didn't really get me as amped as smoking the laced bowl did, in fact I simply felt like I was just really baked. After that we smoked another bowl, and then another one the next morning.</p><p>After that I felt really sick, I couldn't place just what was feeling wrong, but my whole body just felt sick. I wouldn't say I had a headache, but I was certainly feeling nauseous. I definitely didn't get addicted, if anything it made me not want anything to do with coke.</p>",
 "year": "2005",
 "id": "40965",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "5453",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ]
}
