{
 "title": "The Cure",
 "author": "Desperate Housewife",
 "citation": " Desperate Housewife. \"The Cure: experience with Modafinil (ID 40963)\". Erowid.org. Jul 4, 2006. erowid.org/exp/40963",
 "substance": "Modafinil",
 "bodyweight": "122 lb",
 "report": "<p>As an overworked, stressed Mom of a 5 year old diva and a high maintenance artist husband, I have searched for a cure to the 2pm to 4pm burnout. Like other Chicago moms, I learned that 3 lortabs can cure the apathy for housework and playing freaking Barbies for the thousandth time. I only use them for the PMS week during which I will feel so tired and so mind burnt that I have to resort to drastic measures. That buzz makes all the world seem better but I was ready for a change. I drink only if I am lying under a palm tree and smoke a bowl before bed as a sleep agent. So I introduced modafinil into the mix after much research. It took 2 weeks to arrive so I had plenty of time to do my homework. No one I know had ever tried it, so I am the test subject.</p><p>Saturday morning the package arrives, as soon as the mailman closed the door, I ripped it open and toasted 200mg to Father Gonzo (RIP). Yippie here we go!! It is 9am Saturday so the whole crew was home, I had peppy energy not my usual blahs after a draining week. I never felt the lortab rush but I had that same feeling of not minding doing the mundane or unpleasant. I did feel happy but not too happy, it was jus' right. I had a sense of well being and of knowing I would not feel tired or cranky later on. Any other time by 2pm I would need a lite nap (which I seldom get to take) or by 6pm I am the walking dead but before I realized it was 4pm! We had guest coming for supper so I took 100mg to make sure a burnout was not on the way. Once again the next time I looked at the clock it was 8pm. Fun was had by all and I don't even like the asshole dinner quest! I never once felt drugged or the least bit odd. I felt quite content and relaxed. I think I was even polite which is very hard to do assholes. I just feel good.</p><p>Its 10pm as I write this and I still feel pretty nice. I am normally so tired by now that I smoke a bowl, chat with hubby and crash.</p><p>I feel like sleep will not be a problem as I have been up since 6am. I am tired from a busy, active, good day. Not that brain dead, body tired feeling. Warm bath and a bowl and life is good.</p><p>My report is that modafinil is a good thing, for me, to use for the 3pm burnout and I will save the lortab for fun!</p>",
 "year": "2005",
 "id": "40963",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-07-04T07:00:00.000Z",
 "views": "17264",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 7:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 }
}
