{
 "title": "Enlightenment",
 "author": "a soul",
 "citation": " a soul. \"Enlightenment: experience with Cacti - T. pachanoi (ID 40970)\". Erowid.org. Jul 26, 2005. erowid.org/exp/40970",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "160 lb",
 "report": "<p>Ive always been interested in psychedelic drugs, ever since Ive first tried acid a long time ago, when I was younger, Ive known that psychedelic drugs offer more than just a stimulating sense of well-being, they offer a greater insight into ones mind and that of other people.</p><p>However, Its been hard to find acid so Ive resorted to a few other things here and there such as weed, alcohol, complete brain fucking crap now that Ive done mescaline.</p><p>This wasnt the first time Ive tried mescaline. The first time I ate one San Pedro and had a decent experience. Since cactus was easily available Ive tried a few other times to get a good trip. I bought some Peruvian torch cacti, thinking they were somehow stronger then San Pedros, but theyre not, its just a misconception. So after a not-so-special experience on a twelve inch cactus and a half of a twelve, I decided to buy some twelve inch San Pedro.</p><p>Today before work I drank two twelve inch San Pedros. Normally I wouldnt trip before work but I didnt expect to trip that hard because in the past the Peruvians were mild. Unlike the Peruvians I started to feel a trip coming on within thirty minutes of the ingestion. I started to feel apprehensive about having to work because I felt this inner feeling that told me that I was going to trip hard.</p><p>I stuck with it though and thought, Screw it, I want to see what will happen if I trip at work, so I went anyway. What happened next is one of the greatest days of my life.</p><p>I work in a restaurant, so social interaction is everywhere, and when the mescaline started to kick in, my whole entire way of communicating with people changed. Sure, I was seeing little hallucinations here and there and little quirky visuals, but that was not what interested me. I was suddenly overcome by an extreme awareness of affection and appreciation for others. When I started a conversation with someone, instead of automatically thinking about my self, and how to direct attention to my self, which is what many individuals do, I was able to empathize with others immediately, and understand their emotional state. I was able to openly and fluently express my emotions, and wanted to sooth other people who were feeling down.</p><p>Well about and hour into it I was starting to feel what mescaline really was capable of, something Ive never felt on it before. This chemical made me feel love. Unselfish appreciation for things other than myself. And giving my unselfishness to others made me feel great, and my positive attitude brushed off on them. I started to feel ultimate maturity coming on. The realization that making others feel good about their work and their job made them feel great and me good to, rather then constantly whining and trying to feed my ego.</p><p>After a while longer, time started to have less meaning. I was able to do my job pretty well. The mescaline didnt really effect my memory or job skills, but it definitely took the work off my mind. Time probably didnt have meaning because I never felt like I had to get anywhere. I was already there.</p><p>When I got home from work I called my parents just to see how there day went, something I dont normally do. And I realized that I should do it more often, and felt deep love for them which felt good.</p><p>This was the most significant experience Ive ever had from a drug. It taught me great respect for myself and most importantly other life. There are many other powerful effects too which I will not go into. Its almost as if mescaline takes one out of the survival mode one is accustomed to and puts one in touch with a higher awareness.</p><p>There is a sad side to the drug. An awareness of the many problems of society. Thats why I had to write this report, because I want other to experience what I have. Im sure if they did, their lives my become better. This whole world would benefit from this drug. But mescaline is not something that one can do every day obliviously, because one still has to make sure he does the basic things to survive. I will surely visit this realm again though, because it is divine.</p>",
 "year": "2005",
 "id": "40970",
 "gender": "Male",
 "timestamp": "2005-07-26T07:00:00.000Z",
 "views": "18875",
 "dose": [
  {
   "time": "0",
   "amount": "24 in",
   "administration": "oral",
   "substance": "Cacti",
   "form": "(plant material)"
  }
 ]
}
