{
 "id": 410,
 "title": "Frames",
 "date": {
  "submission": "2008-04-01T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BiggE",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  }
 ],
 "report": [
  "It was my 19th birthday, and I was all set to have a mystical experience.  I said a prayer and took 7 deep hits of hashish.  I started to feel really strange, like my body was burning in a fire.  I didn't freak out though, I decided to take it as it came, and relax.  Usually when I smoke normal marijuana I feel hot, so the flame must just have been an exaggerated effect.  I felt like my body was dissolving, until I had no sense of either it or my ego.  The world started to manifest itself like a movie.  I could see frames flashing instead of what in a sober state would be normal fluid reality.  Another description for it would be like a strobe light.  Now, whenever I smoke weed I see this strobe light effect, but I never did before I had smoked Hashish.",
  "Then I began to regress, I felt like a child, full of wonder and not caring what the world thinks of me.  Then I began to feel like a wild animal running through the plains.  I could kind of 'see' all of this occuring, it was something like a daydream, but so much more intense.  After being an animal for awhile, I became a plant, and then I began regressing so fast, I could hardly tell what was happening to me.  I became a cell, and then, I felt like I was back with God.  I felt like I was in an all encompassing everythingness, but it was nothingness at the same time.",
  "I stayed in this state for a while, and then I began to rise back through the ranks of life, from cell, to plant, to animal, back to child, then adult, and then I became what I believe is the next phase of human evolution, and again rose to the God level.  I came back shortly to the above human level, then went to the child level again.  I remained there for the duration of the high, and gradually returned to my normal level of existence.  I realized profound things while I was in that state, and ever since, smoking normal weed has always been so much more profound."
 ],
 "erowid": {
  "id": "10736",
  "citation": " BiggE. \"Frames: experience with Cannabis - Hash (ID 10736)\". Erowid.org. Apr 1, 2008. erowid.org/exp/10736",
  "substance": "Cannabis - Hash",
  "views": "3639"
 }
}
