{
 "title": "The History Class Crash",
 "author": "Value_Mpeals",
 "citation": " Value_Mpeals. \"The History Class Crash: experience with Ether (ID 41015)\". Erowid.org. Jul 13, 2008. erowid.org/exp/41015",
 "substance": "Ether",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "inhaled",
   "Ether",
   "(liquid)"
  ]
 ],
 "report": "</p>\n[Erowid Warning: The water extraction method is ineffective in separating diethyl ether from the volatile hydrocarbon liquids/gases in starter fluid. Our understanding of the literature is that there is no such thing as safe use of volatile hydrocarbon gases: their psychoactive effects are inseparable from nerve and organ damage.]</p><p>First I want you to realize: The reason why this trip lasted so long was because I refueled myself at different times, and because I hit the bottle wrong and possibly swallowed some fumes.</p><p>Today I was greeted in gym class, by my friend Cheech, with a humongous smile on his face asking me 'Dude, you want some Ether?'. I laughed because of the rarity of this substance (in high-school). He then pulled a water-bottle with it's contents filled approximately 1/10 the way up with a clear substance. He then explained how he had extracted this Ether personally, from Engine starting fluid. This seemed quite impressive and made me think of how much more granduer it was. I have had my share of marijuana, cigarettes, alcohol, caffeine, Valium and other benzodaizepines, Vicodin, opium, N20, House-Hold Inhalants, Ecstasy, Adderal, and DXM. None of these could help me deal with what happened next.</p><p>So we each take 4 deep hits inside the gym locker room, causing us and the place to wreak with a rubbing alcohol like smell, and scamper off. I'm enjoying this quite alot and INSIST we take more hits during our next period (lunch). So we do right outside, as we watch our breathe congeal into thicker clouds of smoke (it was snowing outside so our breathe was visible) I realize just how much of a fall I set myself up for.</p><p>While stumbling my way to the library with my friend Cheech a couple of our mutual friends compliment on the gasoline-like smell that follows us. I started to witness everything out of my focus wave and flicker. Not long after-wards, everything was out of focus. I was out of my mind with a numbness of Vicodin, the blur of alcohol and marijuana, and the dumb-foundedness of Valium.</p><p>I floatingly witness how fast my lunch period was completely over. I then sat down in history. My face was on fire, my hands were blocks of ice. My breathe was thin, and I felt suffocated, as I sweat a large profusely. I felt an immense fear of impending doom. The rest of what is told is unclear and may lack in detail.</p><p>I stumbled my way out of the classroom and my friend Gizmo accompanied me. I passed out and woke up with her handing me water and aiding my current intoxicated condition. She clearly saved my life, and brought me out of a sheer state of panic. The rest of my day was unconcentrated and I was actually still tempted to do more Ether. It must be addictive to make someone whom it almost killed, to pay a second visit.</p><p>Ether is not for me. From what I experienced I don't think it is for anyone. It is entirely up to you whether you want to inhale this chemical.</p>",
 "year": "2005",
 "id": "41015",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-07-13T07:00:00.000Z",
 "views": "16729"
}
