{
 "title": "Smokin",
 "author": "QwErTy",
 "citation": " QwErTy. \"Smokin: experience with Methylphenidate (ID 41032)\". Erowid.org. Apr 17, 2007. erowid.org/exp/41032",
 "substance": "Methylphenidate",
 "bodyweight": "132 lb",
 "report": "<p>I was diagnosed with ADD by my family doctor and was prescribed Ritalin to help me concentrate better in my school work. At first I wasn't into taking the pills every morning so I would just give them away to fiends that actually wanted them.</p><p>I met up with an old friend that I knew from public school at a new years party. A conversation lit up when he told me that you can get a high smoking Ritalin. 'smoking Ritalin?' I thought to my self. I handing over my prescription and asked how.</p><p>Mind set: tired, depressed</p><p>9:15pm</p><p>In each table spoon we cooked 4 pills with water until they dissolved. While my batch was cooling off I stirred the water with a safety pin collecting the inept ingredients and poured the left over water on a plate. I threw the plate in the microwave and zapped it for 5 minutes to evaporate the water. While he was scraping the plates with a credit card I grabbed a pop can, poked a couple holes on the side, and used cigarette ashes for the screen.</p><p>9:45pm</p><p>My dear friend convinced me into taking the first toke. A grin on my face and a quick swipe of my hand I threw the 80mg chunk on the ashes and took a slow puff. seconds after exhaling I felt my throat dry up leaving a bitter medicine taste. Around a minute later my arms, knees, and hands froze up due to low blood circulation. I sat there staring at the walls and grinding my teeth thinking I was going to die.</p><p>10:00pm</p><p>The high kicked in. It felt like just I smoked a crack rock. Everything around me was going by in slow-motion. I was experiencing visual hallucinations (distant objects fading in and out). My thoughts and ideas were racing 1000 miles per hour through my mind. I also noticed a huge increase in my heart rate hitting well over 130 BPM.</p><p>2:30am</p><p>The comedown was depressing. I was back at my apartment ripping my room apart in search for more Ritalin. When I tried to eat something the food would just get stuck in my throat. I ended up spending the rest of the night playing guitar and smoking cigarettes.</p>",
 "year": "2005",
 "id": "41032",
 "gender": "Male",
 "timestamp": "2007-04-17T07:00:00.000Z",
 "views": "53509",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "80 mg",
   "administration": "smoked",
   "substance": "Pharms - Methylphenidate"
  }
 }
}
