{
 "title": "No Fun Drug Induced Schizophrenia",
 "author": "Adam",
 "citation": " Adam. \"No Fun Drug Induced Schizophrenia: experience with Datura (ID 41034)\". Erowid.org. Nov 30, 2006. erowid.org/exp/41034",
 "substance": "Datura",
 "bodyweight": "150 lb",
 "report": "<p>My girlfriend and I were drinking one Saturday night in my backyard when I decided to consume the Angel Trumpet thinking it wouldn't work because they were wilted (a bush grows in my backyard.)  This was about 11pm.  Later when we were in bed I do not know the exact time but I suddenly heard her asking me questions.  I was answering and she kept asking me.  This went on for about ten minutes when she finally rolled over and asked who I was talking to.  I said her and she said she never said a word.  This is when I realized the drug must've kicked in (this was my first time taking it, I had researched but didn't know what to expect.) </p><p>Unfortunately my brain didn't understand that no one was speaking and I kept hearing her voice clearly and I kept responding out loud but she wasn't saying anything.  Eventually she told me to shut up, she had forgotten I had taken the flowers thinking I was still drunk as she was herself.  About this time the hallucinations started.  Black dots flashed before my eyes.  When I closed them I saw everything clearly as if I never shut them.  I made the motion to unscrew the light bulb out of my fan and throw it away but when I opened my eyes, my hands were over the garbage can but nothing was in them.  I also hallucinated that my roommate walked into my room and asked where my other roommate was, I told him I didn't know and again my girlfriend asked who I was talking to. </p><p>I knew the voices were in my head so I tried not to answer but they were so clear I wasn't sure if she was actually talking or not.  That is all I remember.  The most unnerving part happened in the morning.  When I woke up I could not walk straight at all.  My body constantly felt like I was falling down and I swayed uncontrollably but it wasn't a dizzy feeling.  When I looked at my digital watch my eyes could not focus at all.  All I saw was a smear.  I looked at my computer clock and it was the same thing.  That was the scariest part of the trip. </p><p>Later I found out from my roommate (and I have absolutely no recollection of this and I'm glad) I had gone into his room and tried to spoon him and his girlfriend, then I fought him for his own covers, said something incomprehensible and walked out (I guess at this point I was peaking) He said this occurred at around 5:30am.  A couple hours into the day my vision finally returned to normal and so did my posture.  All in all I did not enjoy the trip because I felt no euphoria and it's kind of creepy hearing voices.</p>",
 "year": "2005",
 "id": "41034",
 "gender": "Male",
 "timestamp": "2006-11-30T08:00:00.000Z",
 "views": "7143",
 "dose": [
  {
   "time": "0",
   "amount": "5 flowers",
   "administration": "oral",
   "substance": "Datura"
  }
 ]
}
