{
 "title": "A Lesson In Possession",
 "author": "Bluestemz",
 "citation": " Bluestemz. \"A Lesson In Possession: experience with Salvia divinorum (Leaf) (ID 41074)\". Erowid.org. Aug 15, 2007. erowid.org/exp/41074",
 "substance": "Salvia divinorum (Leaf)",
 "bodyweight": "126 lb",
 "header": [
  [
   "DOSE:",
   "12 leaves",
   "sublingual",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "report": "<p>It all started with a dream I had a few days ago. In the dream, I kept growing hair inside my mouth and it was getting very furry & annoying. Gagging me, like having peanut butter stuck to the roof of your mouth. I took a pair of scissors and tried to cut the hairs off, but they kept growing back. I went to the doctor's and he did something to me, he put his hands over my forehead while I was lying on my back. I was levitating and he was pushing me forward while walking beside me with his hands on my head. I seemed to be moving through some sort of tunnel or similar space, then we came out into a field. It was a wide open field, and he mentioned something about this being his method of controlling the poison (that whole ritual we went through).</p><p>Do You Swallow The Poison?</p><p>After prepairing a quid of six pairs of leaves according to Mazatec tradition, I found myself entering a trance prompted by my rythmic chewing and the ancient indian songs on the speakers. I was dancing, healing myself, giving into whatever whim was overtaking my body when I noticed that she was really coming through. I was spinning around in a circle, tapping to the beat, when I felt and 'saw' the body (a vivisection that is) of a giant snake wrapping around me opposite the direction of my rotation. The one became many and it felt as if a hundred snakes were intertangling with my flesh. The quid was a goopy pulp at this point, and it persistently tried to slither down the back of my throat. I heard a voice directing me, saying, 'Don't swallow the poison.'</p><p>I saw a woman in a headwrap and loose blouse standing before me and she held a small snake in her open palms. It squirmed in her hands against her restraint, like an eager sperm waiting to rush to its destiny. My mouth involuntarily opened and the snake lept from her palms and into my mouth, desperately trying to flee down my throat and into my bowls. I had to concentrate on the slimey, evasive reptile inside my mouth in order to prevent from swallowing the mass while my body danced, oblivious to my struggle.</p><p>It is then that I recalled the dream. The texture of the tiny, green, fleshy pieces of leaf sticking between my teeth and in the back of my throat was identical to the uncomfortable presence of the hair. I had this feeling that this is how it's done. The shamen, the witches, the voodoo priests & priestess', poisoning their targets food with the required sacraments in order to use their bodies for whatever means. She was inside me, I had been hit with the shaman's poison dart. She was under my skin, using my flesh, trying to work her way to my bowls where she could either dispose of me or gain complete control. In order to be inside me she had to send 'me' away. I was no longer inside myself. I was a third party observer. I paused for a few moments, having been caught up in the ceremony, becoming the vibe and feeling the heat given off by the fire and torches that surrounded me. I had completely forgotten my identity. I couldn't think who I was or why I was let alone where I was. the only thing I knew was the feeling, the now.</p><p>My body stumbled outside to try and get a grasp on something familiar. Whatever spirit was inside me was eager to stretch it's newfound limbs, yet I fumbled, not knowing how to fully manipulate the human form. I fell over a few times, and once I regained my balance I stood in the soft, damp grass and gazed up and down the street a few times, trying to get my bearings, taking in every sight my eyes could capture. Everything was the same as 'I' had remembered it, but it was all new to me, the me that was inside me now.</p><p>The sky rolled past and the trees and grass breathed with life. I heard a car door slam up the road and figured now would be a great time to get back inside, I didn't belong amongst people just then. I fell through the doorway and flung my body to the floor. I could feel her start to recede back into me. My body clung to the floor as I molted the shell I just occupied. 'I' struggled and pulled myself out of my body. I lay there naked, like a newborn baby, beside the empty persona I just occupied (or perhaps occupied me). She was fleeting from my memory, and the smell of sage krept under my nose and opened my eyes. I was back. I was me again. My body was both weary and rejuvinated. Perhaps she healed my ailments as a toll for the experience of being human for just a brief hour. Till we meet again.</p>",
 "year": "1998",
 "id": "41074",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-15T07:00:00.000Z",
 "views": "3128"
}
