{
 "title": "Sedona",
 "author": "bluestemz",
 "citation": " bluestemz. \"Sedona: experience with 2C-T-2 & Cannabis (ID 41079)\". Erowid.org. Apr 6, 2005. erowid.org/exp/41079",
 "substance": "2C-T-2 & Cannabis",
 "bodyweight": "125 lb",
 "report": "<p>Spent the day on a few mg of 2C-T-2 at the Grand Canyon. Not tripping uncontrollably, just heightened: slightly better than human. Drove back to Sedona. I have never seen so many stars in my life. We get stuck in construction, it's like 9 or 10 pm now. Only one lane open, they make us wait for a pace car to take us down the dark desert highway. It's very dark, very quiet ... We turn off the car but keep the stereo on, some Peter Buffett indian (native american) music ... I lay on the car roof and smoke a cigarette, starring at the open sky through the tree tops. So many stars.</p><p>Splattered paint specks on the ceiling of eternity</p><p>The trees are breathing, there is life all around me. Something in the air ... Bats ... I laugh.</p><p>'We can't stop here, this is bat country.'</p><p>Nobody gets it ...</p><p>Finally, we're at the hotel after a long confusing sojourn attempting to find a non-Circle-K food source in Sedona after 9pm ... Get my snack on and my drink on ... Everybody soon retires ... I move the party to the spa ... A nice, hot spa bath .. A little nugget in the tub to even out the evening ...</p><p>I grab my walkman and decide to find a piece of desert to groove to some Ah Moshi Moshi and smoke a kind little joint. I put the disc in and press play, the door closes behind me and I'm off down the hall toward the exit. Travelers are supposed to be part of the experience, that's justified by the trippy-ass carpet they always put in hotel hallways. I'm on the balcony, the music has taken control. I dance with the water flowing from the fountain for awhile. It's getting hotter and the heat is getting intense. The mesa around me is glowing an ember red, beckoning me into it's midst ... The desert is calling ... My body is under the influence of the music ... I'm glowing, breathing, burning off energy like a thermonuclear reactor.</p><p>As I dance out into the desert, I can see the vortexes coming across the plane like psychedelic tornados of multicolored energy. The cyclones engage me and flow over and around me like some electric gelatin. They are feeding me heat, energy, and at the same time washing it away from me, taking it back to the desert as it cleanses my spirit. Purple and blue and yellow ribbons of ecstasy flowing over my shoulders and between my ribs. I've spent so much time wondering, 'where are the vortexes in sedona? Will I find the energy or will I have to come back? Am I ready?' The vortexes are wherever you are. If your will is strong enough, the energy will come to you. It is everywhere because it is everything. The passion is unending. Sweat and tears of love flow down and around me, my own Nile of passion. The mesa studies me. I kneel before it:</p><p>'I give you love, so that you may give life.'</p><p>It acknowledges my offering with a stroke of yellow. I am back in my material. The world around me is rushing in chaos and I am calm, centered. I am in control of my functions, I am still steaming ... A blue and purple mist of passion rolling off me like the morning fog in London. It is, ultimately, the meaning to life. It doesn't really matter what you do, as long as you approach it with passion. The moment you lose passion, you've strayed from the path and it's time to re-evaluate the situation. Go live life, but more importantly, go LOVE life. The clock is ticking. What have YOU loved with your time?</p>",
 "year": "2001",
 "id": "41079",
 "gender": "Male",
 "timestamp": "2005-04-06T07:00:00.000Z",
 "views": "5386",
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "2C-T-2"
  },
  {
   "time": "0",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
