{
 "id": 4108,
 "title": "Finally Tried the Fermented Jewel",
 "date": {
  "submission": "2006-05-10T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Comfortably Numb",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "shots"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  }
 ],
 "report": [
  "Well I have always wanted to try mind altering substance for a while now.  As sports in my school are coming up, smoking is out of the question (And I don't mean cigarettes)  Basically my two best friends Z and X wanted to get drunk.  So we pitched in some money, and got our hookup to grab the booze.  All that I really wanted was Peppermint Shnapps 100 proof because I love peppermint, and I wasn't really down for a shitty tasting beverage, or guzzling a bunch of beers, and being really full. ",
  "Anyway that night was a quiet night, and I just was hanging out with my sibling, and his friend.  I was quite bored so I decided to try some of the stuff myself.  I grabbed a water bottle and poured a tiny amount of the Shnapps in and downed it (Damn it smelled great, and for the most part going down it was smooth)  Now I couldn't really feel anything so in a little while I did this again except with about a shotful in the bottle, and then diluted it with some water from another bottle.  After this I felt it a little, but I soon wanted more of a drunken stupor feeling.  Hell when the parents are asleep, and I wasn't doing anything on a friday why not?  Anyway a little while after that it started to kick in, and I felt relaxed, and extremely comfortable.  It was a pretty good feeling, but I wanted it to be stronger so I took another shot in like 20 minutes.  That strengthened the effect it had on me, and I was having a very good time just sitting on the couch and watching T.V. with my aquantinces.  They didn't have a clue that I was in the process of getting plastered (That is a good thing, as generally the younger population is feed anti-drug/alcohol shit to pollute their brain. ",
  "I didn't want to take a chance that my siblings friend would be a loudmouth and have something slip out as he is VERY loud) Anyway I could walk pretty good, but was starting to feel a little bit tipsy which was an awesome feeling.  It's not the normal kind of dizzying effect that I get when sick, or if I hit in the head.  I was trying to walk in a straight line, and couldn't really do it, but I could come pretty close.  After the next 'shot' my head started to feel pretty heavy.  I announced that 'My head feels like lead, but not lead, because I like mercury better.'  Now it was getting really fun, and I even fell over like twice, but was easily able to get myself back up.  I said to myself that I should take one last shot, and that would be it.  Soon I was performing the water bottle pouring ritual, and then diluting it with water from another bottle.  This time I believe I took more than one shot worth, but it is hard to tell.  After this I felt very happy, and sedated.  It wasn't like a dreamlike state, and I felt I was all there. ",
  "I explained the feeling to my sibling that my mind was working fine, but what came out of it was a mixture of raw thoughts, and unrefined speach that sounded not natural, but funny as hell!  Soon they started laughing at me falling over, and I was laughing at myself.  It was very enjoyable, but now I didn't want to walk around too much becuase it was very late at night, and I just wanted to go to sleep, and say goodnight to my sibling and his friend.  Normally I am an aggressive person, but drinking kind of brings out the opposite in me.  Whilst drunk, and stumbling around I found myself very happy, and therefore I was nice to my sibling and his friend.  I was more nice than usual, and was even clearing up their stuff on the ground because I didn't want them to get in trouble for being pigs in the morning. ",
  "I have a decent memory of what happened, but some parts of the night are a little bit hazy.  So overall I felt that this experiance was absoultly fantastic, and has opened my mind up to using this substance more often. ",
  "By the way this was my first time really drinking, and I am extremely happy that I can get pretty much cocked off my ass on like 3 shots.  I would expect if I did 2 more shots I probably would literally be on my ass, and it might not be as fun as it was.  Half the fun was stumbling around, just trying to operate normally without stumbling.  I remember laughing a LOT, and making jokes as I usually do.  Generally I was more quite, relaxed, and happy than I normally am.  Also to be noted is the slight numbing effect that alcohol has on the skin.  I wouldn't describe it as 'numbing' but it feels just different, but of course as everything in my first experiance with alcohol, in a good way."
 ],
 "erowid": {
  "id": "27863",
  "citation": " Comfortably Numb. \"Finally Tried the Fermented Jewel: experience with Alcohol - Hard (ID 27863)\". Erowid.org. May 10, 2006. erowid.org/exp/27863",
  "substance": "Alcohol - Hard",
  "views": "11383"
 }
}
