{
 "id": 4109,
 "title": "Re-creation",
 "date": {
  "submission": "2003-10-26T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "0.1",
    "quantity": "0.1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "g",
    "grams": "0.1",
    "quantity": "0.1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "Well it was about 1:30 AM in my friend e's girlfriend m's apartment. Just the three of us. I had made a water bong out of a 20oz coke bottle and smoked some wormwood just to make sure the bong was leak proof. I then put about .1 grams in the bowl. Lit it and filled the chamber up thick with smoke, let the carb go and took a lung full. After 20 seconds of holding it the room started to twist, I shook it off, held it another 5 sec, and exhaled. I wanted to get another lungful in but I dont think I did, as I started to light the lighter I was suddenly not in m's apartment anymore, it was the same place, but as I looked around it looked different. I thought it was a relative's house and I was a little kid again. For example I thought the bong was a juice bottle, and everything in the room had a different meaning, a wholesome familiar feeling. But in the back of my mind I knew it was m's apartment. And I kept trying to tell myself it was mels apartment, but it was like my brain was arguing about where we really were.",
  "It was spectacular, I was very amused by this internal argument and I just looked around laughing, I then stood up and walked around touching things, everything was very special. Both e and m are very insensitive to salvia and they thought I was crazy. I wish they could know what it's like. But anyway e wanted to give it a try, and I knew from a previous salvia use that he was very insenstive so I gave him about .2 grams. He smoked it all and just shrugged, it was so depressing, haha. Well by this time it had been about 20 min since I had forgot where I was, and I decided to try it again. So I loaded up another .1 grams, got a large amount of smoke in the chamber, and hit it. I held it for 30 seconds, by this time things were getting foggy, I went to take another hit, but I don't remember if I did, next thing I know I was falling through the floor. It was almost if I was shrinking into the floor, but my vision was gone or my eyes were closed. So it was not actually the floor I was falling through, somehow I knew I was falling through the laws of this reality, they were being broken down before my eyes.",
  "And then there was a girls voice, she told me things that made me feel reassured about where she was taking me, it was a happy voice but it seemed distant kind of echoeing. I saw realities, or parts of reality, being shuffled like cards and it was making a sound like cards. And each one that passed gave me a flash of that reality, I was just getting glimpses. And then I fell further. Suddenly all the shuffled realities (or parts of realities) were lined up in two rows, its hard explain but it shaped a human. Then there was yelling, like a production manager (God?) Yelling something along the lines of 'let's keep it moving, get these ready' as if he were talking to workers. Then all of a sudden the parts of realities start to merge very loudly, zipping together like a zipper on pants. And the female voice let me know what was happening, this was the creation of realities, and my reality was just one of the millions being formed, as it was zipping together she momentarily threw me into one so I could see how different the realities were. It was like I lived another persons entire life in 1 second, then it slowed down.",
  "Im not sure if it was even a human life, but where it slowed down was a sporting event, I was a big fan of somekind of sport that doesnt exist in my reality, and the name of the team I was cheering for wasnt an english word, I dont remember clearly but it was something like 'ingrods',then I was yanked out of that reality. I was back to the zipper it was zipping towards me, I was in the left leg of the human if that makes sense. The way the realities were being formed seemed like a careless, random, mass production operation. And then the zipper was getting closer and closer, I realized I was a peice on the zipper, I was on the left side, then as it got closer and closer I could hear the zipper approaching like a freight train, I could see glimpses of the realities being formed as they merged together, and right before it closed on me the female voice said 'remember the '?ingrods?', and dont forget me either' and her echoes faded into the roar of the approaching zipper, I was anxious to see what reality I would get put into.",
  "Then SLAM. My eyes opened I saw light, then brown, brown ground, it was carpet, I was on face first on the floor, I jumped up with a burst of energy and yelled 'Go Ingrods!' and threw my fist in the air. I looked around, this wasnt that reality, where was I? What reality had I been put into? Then I saw my friends cuddling on the couch, looking at me as if I were crazy. I then realized this is my OLD reality. This  is where I was before, suddenly my mind flooded with memories of this world, its laws, its people. It was strange to remember things, it was like being reborn. Slowly more and more things came to me. I looked at the bong, I had forgot I had smoked anything, I remembered why I had went to that place, it was because I had smoked salvia. I then started to frantically try to tell my friends how realities were made. I realized how precious the information salvia had just given me was, I was just shown CREATION, not just creation of human, not creation of the galaxy, not creation of the universe, creation of REALITY, which contains EVERYTHING, and there were several realities, I was just randomly put into this one.",
  "I remembered my name, I remembered my family, then I remembered my home. I HAD to go home and sleep in my bed so I could analyze the lesson I was just given, it was a strange impulse, my house was only 3 blocks away so I drove home, (not a good idea) but I made it with only a few small fleeting reality lapses. When I was home in my room my whole room went infrared, I knew it was a hallucination so I simply enjoyed the scene. I then laid in bed and thought about it. The conclusion I came to is there are PIECES of reality, and each soul is one of them, along with many other elements, when we die your soul is shuffled and randomly put into another reality, maybe not even an earthly reality it can be very different. This is just the message I got so far, there seems to be much more she didnt have time to tell me. And she told me not to forget her. So I hope to visit 'her' again very soon. I am not usually a very spiritual person, but the experience was mind blowing, I was given information my mind couldnt possibly create on its own, it was like salvia had a spirit that was very intelligent, and she was teaching me. I felt 'chosen' like I was special so she would teach me.",
  "Its a very interesting plant. I now see everything as an indefinite way of life, for example our government laws only exist in THIS reality, there are many more realities. I do not fear death as much, cause it now seems like there is more beyond it. Peoples opinions of me dont matter, they are only parts of this reality. I even wonder if salvia refuses to teach certain people, as if they are not ready or worthy. The explanation is the best I can explain in words, but it was far more amazing to actually live it. I look forward to my next lesson. Anybody who hasnt tried it yet, I just recommend going in open minded, for me it was a life changing experience, so its not to be taken lightly. Salvia seems very nice and cheery, yet very intelligent and VERY powerful."
 ],
 "erowid": {
  "id": "27872",
  "citation": " A. \"Re-creation: experience with Salvia divinorum (5x extract) (ID 27872)\". Erowid.org. Oct 26, 2003. erowid.org/exp/27872",
  "substance": "Salvia divinorum (5x extract)",
  "views": "9701"
 }
}
